{
    "chapters":{
        "1":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "Katelyn",
                "Roxanne",
                "Yukiro",
                "Krell",
                "Some other friend"
            ],
            "content":"<div class=\"\"><div> <span>You are Catherine Bryant, a high school senior, currently attending classes at Pandora High School. You're about 5'4\", with brown hair, and fair skin. Your breasts are a little on the small side, but still rather ample. You wear contacts, though you do tend to get comments on how good you look with your glasses. Despite your attractiveness, you're not very popular, falling in with a group of other social misfits.<br>\r\n<br>\r\nIn your case it's because you just moved here over the summer, and these were the only people who welcomed you into their clique. But for the life of you you cannot imagine why they aren't more popular.<br>\r\n<br>\r\nFirst up is Katelyn Naine, a tall, athletic girl on the track team. She has platinum blond, almost silvery hair, which she dyes, She is a bit odd, though, but asides from her inordinate fondness of wolves, and here tendency to refer to you and your friends as her pack, she's a very nice girl. She's also very protective of you, and likes to take leadership roles.<br>\r\n<br>\r\nThen there's the gothy girl, Roxanne Spears. She's got a talent for cooking. She's also constantly giving you and your friends drinks she's cooked up herself that she always refers to as brews or potions. They tend to be pretty amazing, even if the taste isn't always great. You're pretty sure she even cured your cold with one. You told her she should mass-market them, but she just laughed you off.<br>\r\n<br>\r\nNext in line is Yukiro Wong. She's Asian, but she also has firey-red hair, which you're pretty sure is natural, hard as it is to believe. She's a mischievous prankster, pulling of seemingly impossible stunts, like the time she managed to fill your mattress with Jell-o, while she was out of town. She is also extremely seductive, and can have anyone bowing to her whims in mere moments. She's not seeing anybody currently, but it's clear she could have any man she wanted. As well as many women.<br>\r\n<br>\r\nThe last of your inner circle is a recent exchange student, Krell Dalachonmik. She says she's from Yugoslavia, but she speaks with no accent you've ever heard. She's friendly enough though, if a bit klutzy. So you tend not to push the issue. She always seems to have high-tech gizmos, claiming they're prototypes given to her from her host family. She also seems to have issues with things that would seem very simple to you. Mostly customs, and traditions, even simple every day tasks sometimes seem completely alien to her.<br>\r\n<br>\r\nThere are a few more friends, whom we may meet later, but now it's Saturday night, just after dinner with your family. You had a great time with your friends at the mall, despite Yukiro causing the curtain to mysterious fall while Kate was nude in the changing room. She made up for it when she bought you all lunch, though. You were hoping to see a movie after dinner, but your friends all had other things they had to do. So you're spending the night at home, watching TV. At least you were, 'til the phone rang so loud, you almost jumped out of your skin.<br>\r\n<br>\r\nPicking up you hear...</span></div></div>",
            "created":1284440400,
            "id":956783,
            "title":"Lazy Saturday Night"
        },
        "11":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "\"I just got dumped.\"",
                "\"I just really need to see you.\"",
                "\"Nothing, I just wanna hang out.\"",
                "\"I have something to tell you...\"",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Looking at the caller ID, you see Kate's number. You briefly ponder what she could be calling about. You were pretty sure she had a date tonight. Oh well, you answer the phone, as you always do with her, \"Hey Kay, what's the way?\"<br>\r\n<br>\r\nHer voice comes over the line, \"Cat, are you doing anything?\"<br>\r\n<br>\r\n\"No, not really, why?\" You respond.<br>\r\n<br>\r\n\"I really need to see you.\" She says, with equal bits nervousness and urgency.<br>\r\n<br>\r\n\"Why, what's up?\" You ask.<br>\r\n<br>\r\nThe response comes...</span></div></div>",
            "created":1284440400,
            "id":956811,
            "title":"Lovable, Loyal Kate"
        },
        "111":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "Kate lets it all out",
                "Kate holds it in",
                "Someone else shows up"
            ],
            "content":"<div class=\"\"><div> <span>\"I... It's Brad! He dumped me!\" You hear a quiver in her voice, it sounds like she's on the verge of tears.<br>\r\n<br>\r\nYou respond immediately, \"I'll be right over.\"<br>\r\n<br>\r\nThrowing on a coat in the cool autumn weather, you rush out the door, and into your car. Kate's house is only a few blocks away, and you pull up in front of her house in minutes. You knock on the door and Kate answers it, looking like a disheveled mess. She's wearing a tank top and short jeans, and shivering. You can't tell if that's just from the cold, or from the fact that she seems to be desperately trying not to cry.<br>\r\n<br>\r\nShe ushers you inside, and you both end up sitting on her couch. It looks like her parents are gone for the evening. Holding her hands, and looking at her distraught face, in a kind voice, you say, \"Tell me what happened.\"<br>\r\n\"Well,\" she starts, \"I... I thought he might've been cheating on me. I kept smelling some other bitch on him... And so, when I saw him tonight... I-I-I-I I asked a-huh-about it...\" She's barely able to contain herself, nearly sobbing several times, and she keeps making a sound like a dog whining.<br>\r\nYou give her a comforting pat, \"Go on, let it all out...\"<br>\r\n\"Wuh-*whine*-well... He-he-he said that I just wasn't the right girl for him... An-and he wu-*whine*-was leaving me for some... Some MONGREL WHORE!\" The sudden angry outburst catches you off guard, before she buries her face in her hands, you lean over and drape your arms over her, to comfort her, \"Some flea-bitten bitch he met upstate! He ditched me like some mangy runt! Oh gods! Am I really worse than that bitch?\"<br>\r\n<br>\r\nYou see this is your time to intervene, \"No, no, come on Kate. Don't be silly, Brad's an idiot for dumping you. Of course, if he's that stupid, you're probably better off without him.\"<br>\r\n\"Yuh-you know wha-*whine-what the worst bit is?\" she starts, \"I can't even cry about it! Cuz then I'll lose control and scare you and you'll hate me and I'll never see you again!\"<br>\r\n<br>\r\nThis is a bit of an odd development, you're not sure what she means by lose control, but you feel the need to reassure her, \"Don't be silly Kay, you're my best friend. Nothing could make me hate you.\"<br>\r\n\"Really?\"<br>\r\n\"Of course, now let's have a good cry.\"</span></div></div>",
            "created":1288674000,
            "id":985885,
            "title":"Rejected!"
        },
        "1111":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "Freak out and hit her",
                "Freak out and run",
                "Try to stay calm, you did promise"
            ],
            "content":"<div class=\"\"><div> <span>Kate looks at you, with her lips quivering, tears welling up in her big eyes. She suddenly throws her arms around your torso, as big, blubbery sobs and whines come out of her mouth, her face buried in your chest, \"Oh god! Cat! I-*whine*-*whimper*-*sob* I-*hyuk*-*sob* I can't even...\" She's broken into almost incoherent sobs, as you do your best to console her, returning her hug and stroking her head.<br>\r\n<br>\r\n\"Shh... It's alright Kay, I'm here for you.\"<br>\r\n\"Ooooh *whine* I... I can't hold it back *sob* puh-please don't freak ouuuuhhhhwwwwWWWOOO!\"<br>\r\n<br>\r\nYour startled by her sudden howl, but not nearly as much as when her arms tighten around you, and begin to get hairier. You try to struggle free as you hear cracks and pops, as Kate seems to be getting larger, her tank top ripping off her back. Your best friend is changing whilst affixed to your torso. Hair seems to be growing over every bit of her body, and you can feel her face, still buried in your chest, getting longer. Your brain can scarcely comprehend what it's seeing, as her pants rip off, and a fluffy tail pops out.</span></div></div>",
            "created":1288760400,
            "id":986102,
            "title":"Kate lets it all out"
        },
        "11112":{
            "choices":[
                "Shes going to make you like it",
                "She snaps out of it"
            ],
            "content":"<div class=\"\"><div> <span>You tumble off the couch and scramble backwards. You know you promised Kay you wouldn't freak out, but that was before she started changing shape. Kay rolls of the couch, landing on all fours. She's covered in bright silvery fur and her eyes are golden. She crawls towards you, wolf muzzle snapping as she licks her jowls. You move further back only to run into the wall. You look side to side, searching for escape but you are trapped in a space between two bookcases.Then Kay is right on top of you.<br>\r\n\"I told you not to freak out.\" She purred as she pulled you, one handed, to your feet, then off them pinning you to the wall with her bulk. \"Now you smell of fear. And its smells...\" She rubs her muzzle in your hair and inhales deeply, \"Sooooo good.\"<br>\r\nKay puts one hand to your throat, holding you against the wall, while another ripped open your shirt. She takes a moment to admire your bra covered breasts as you struggle against her iron grip. Then she leans in and her huge animal tongue rolls out, liking you from tit to chin. \"You taste even better.\"<br>\r\nYou beat your hands on her shoulders, but you might as well beat on a brick wall. You scared what might happen next.<br>\r\nAnd a little turned on.<br>\r\n\"Kay,\" you mange to beg,\"Please stop. Please\"</span></div></div>",
            "created":1397710800,
            "id":1781102,
            "title":"Freak out and run"
        },
        "11113":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "If you have something that fits, that'd be nice",
                "I think I'm actually alright like this"
            ],
            "content":"<div class=\"\"><div> <span>Your mind rebels at what your seeing. Every fiber of your being is screaming at you to run, to get away from this beast that's hugging you. Kate's sudden size shift has knocked you on your side, and you think you might be able to squirm away.<br>\r\n<br>\r\nBut... despite everything, part of you manages to hold on to your calm. A little voice manages to overcome the din of your screaming fight-or-flight reflex, and remind you that this is still Kate, still your best friend, and you did promise that you'd be there for her, no matter what. Maybe the pathetic whimpers emanating from your cleavage are helping matters, as, instead of seeming like a monstrous beast, it makes the huge, furry form that was Kate seem more like a hurt puppy. You gulp, as you gently stroke her head, surprised at how good her long, flowing fur feels in your hands.<br>\r\n<br>\r\n\"It's ok, hon,\" you coo, \"Just let it all out. I'm here for you.\"<br>\r\nYou hear Kate sniff, as she looks up at you for the first time, her big eyes puffy with tears, and a bit of snot running out of her now shiny nose. She shifts upwards, and you finally get a feel for how big she is now. Well over seven feet tall, maybe eight. She's also stark naked, which causes you to blush a little. The fact that you find her attractive at all is causing you to blush even more. Kate looks at you, managing to regain her composure for at least a few moments. You manage to sit back up as well, and for the first time you notice that your shirt has been soaked through with Kate's tears and snot, revealing the fact that you neglected to wear a bra for this trip. Kate doesn't seem to notice herself, at least at the moment, as she just looks at you,<br>\r\n<br>\r\n\"Cath... Y-you're not freaking out?\" She manages to whimper, you can tell she's still on the edge of tears.<br>\r\n\"Well... Yeah I am,\" You respond honestly, \"But you're my best friend, and... And I promised I'd be here for you, didn't I?\"<br>\r\nYou can see Kate's lip start to quiver again, and she suddenly thrusts forward, hugging you again. You get a good idea of her strength, as she lifts you up like a doll, and squeezes you to her chest, sandwiching your head between her nude, furry breasts.<br>\r\n<br>\r\nCrying again, this time tears of joy, \"Oh Cat! I don't deserve a friend as great as you!\"<br>\r\n\"That's... A little tight...\" You manage to gasp out.<br>\r\n\"Oh! Sorry,\" She lets you back down, as you catch your breath, as she sniffles a little.<br>\r\n<br>\r\nAfter a brief pause, you manage to wrap your head around the situation well enough to formulate a question. Looking over the transformed body of your friend, you see she's covered in silver fur, with a dark patch on her back, and it's nearly white on her belly. Her hair has also gotten longer, and has a matching dark spot in the middle of her head. She seems to be generally more muscular, and her hands are now tipped with claws. A fluffy tail is now jutting out from just above her well toned ass, and it's currently flopping lazily from side to side. Her eyes remained the same color, but are now set in a very canine face. The whites of her eyes are also greatly diminished. Finally, you manage to put all these together to inquire, \"So... are you a...\"<br>\r\nShe interrupts you before you can complete the sentence, \"Werewolf? Yup. I normally don't have any trouble controlling my form, but when I get really emotional, and it's so close to the full moon *sniff* I guess I just kinda lost it.\"<br>\r\n\"You're not gonna try to eat my face or anything?\" You say, only half joking.<br>\r\n\"Hee *sniffle* No, not unless you decide to cover it in raw beef.\" She smiles, which is actually a rather kind smile, despite the amount of teeth it shows.<br>\r\n\"So, uh, can you change back?\"<br>\r\nShe frowns a little, \"Maybe? It's a lot harder to change into human than it is to change into this form, I'm not sure if I can manage it right now... And I actually feel a lot more comfortable like this, if you don't mind.\" She shifts nervously.<br>\r\n\"I... guess not.\" It's your turn to shift, as you feel a bit of a chill, \"Is it cold in here?\"<br>\r\n\"Oh, Cat, your shirt! I'm sorry...\" She tilts her head down, like a bad puppy.<br>\r\n<br>\r\nYou look down at your shirt, and blush. Your nipples are clearly visible through the wet tee, and the fabric, clinging to your body, is chilling you to the bone. The girl can really cry when she changes into a wolf. \"Here,\" She says apologetically, \"Let me throw that in the wash.\" She holds out a clawed hand, ready to receive your shirt.<br>\r\n<br>\r\nYou oblige, freeing your breasts, and using the dry bit of your shirt to dab a bit more moisture off your chest. You hand the shirt to Kate, as she heads off to the laundry room, you catch yourself staring at her shapely behind as she exists the room, and feel a little flush.<br>\r\n<br>\r\nA short while later, she returns. In the mean time, you've found a blanket, and have used it to cover up your bare chest. \"I, uh, threw your shirt in with some things of mine...\" She looked a little sheepish, the irony of which was not lost on you, \"Do you want to borrow one of my shirts, or...?\"</span></div></div>",
            "created":1288933200,
            "id":987385,
            "title":"Try to stay calm, you did promise"
        },
        "111132":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "Pick yourselves up",
                "Stay on the floor"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't worry about it,\" you say, pulling the blanket up to your neck, \"I'll do fine without it. Besides, it's not like you're rushing to get dressed either.\" You blush a little.<br>\r\nShe gives a little snicker, \"I don't really have anything that fits me when I'm like this. It's not very often I find myself entertaining guests while I'm a wolf.\"<br>\r\n<br>\r\nShe sits down on the couch next to you, a little huddled. You can tell she's still a little broken up about being dumped, as well as slightly uncomfortable being in front of you like this. You decide to shift a little closer to her, show her that you're comfortable with her like this. You scoot up to the point where the only thing separating the two of you is the blanket. She starts a bit when you put your hand on her thigh, and looks down on you while you look up, into her face, with a smile, \"So, feeling better?\" you ask.<br>\r\n\"Yeah, a little. I'm really glad you came.\" She sniffs a bit.<br>\r\n\"What kind of friend would I be if I didn't?\"<br>\r\n<br>\r\nKate doesn't answer, at least not verbally. Instead she just hugs you, lightly this time, and lets out a small murr, as you return the hug. The blanket managed to stay on your shoulders denying you from feeling her body, something you found you regretted a little.<br>\r\n<br>\r\nAfter a brief while you two parted, and sat in silence for a bit. Finally you broke the ice, \"So, uh, you wanna watch some TV or something?\"<br>\r\n\"Sure.\" Kate shrugged.<br>\r\n<br>\r\nYou were trying to wrap your mind around the absurdity of it all. Here you were, watching a cheesy action movie with your head resting against the shoulder of an honest to god werewolf, who happened to be your best friend. After the second commercial break Kate moved your clothes into the dryer. When she returned you offered her a spot under the blanket, which she eagerly accepted. You were surprised at how much you enjoyed her feel. It felt secure, like cuddling up to a giant teddy-bear. It was clear she appreciated your closeness, bringing an arm around your shoulder, and wrapping her tail around your waist. You leaned into each other, enjoying each other's warmth. Pretty soon she was her chipper self again, and you two were talking about the hunks on the screen.<br>\r\n<br>\r\n\"What about him?\" You asked, as the male lead came on camera.<br>\r\n\"Maybe twenty years ago!\" She laughed, \"Have you seen him lately? He got all old and flabby... Now that's a beautiful specimen!\"<br>\r\n\"Kate... That's a guard dog.\" You said, with a bit of hesitation.<br>\r\n\"Yeah, but look at that coat!\" She laughs, teasingly, to which you give a small punch in the arm. She makes an exaggerated gesture of pain, and looks at you with a pair of puppy dog eyes that could melt the north pole. It's the whimper that tops it off though, and sends you into a fit of laughing. You end up laughing so hard you tumble right off the sofa. Unfortunately for Kate, the blanket wrapped around the both of you drags her off the couch too, and the both of you land in a tangled, semi-clothed, laughing heap.</span></div></div>",
            "created":1289106000,
            "id":988716,
            "title":"I think I'm actually alright like this"
        },
        "1111321":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "Kate Wants More",
                "Return the Favor"
            ],
            "content":"<div class=\"\"><div> <span>\"Oof! Get off me ya big lug!\" You laugh, as you begin to extricate yourself from Kate.<br>\r\n\"You get off of me, ya klutz!\" Kate retorts, also giggling. The two of you manage to peel yourselves off of each other, and stand up. Embarrassingly enough, rubbing against Kate like that, and now standing, staring at her naked form in front of you, is making you aroused. You can feel the lips of your pussy begin to moisten.<br>\r\n<br>\r\n\"C'mon Kitty Cat, let's finish the movie, but first...\" Kate suddenly lunges forward, and yanks your skirt and panties to your ankles. You squawk in surprise, suddenly feeling the cool air against your moist lower lips.<br>\r\n\"Ack! Kate! What are you doing!\" You move your hands to shield your pussy.<br>\r\n\"I figure, if you get to enjoy me being naked, it's only fair that I get to enjoy you naked too.\" She teases.<br>\r\n\"And who says I enjoy seeing you naked?\" You ask, with a bit of false indignance.<br>\r\n\"Cat,\" She sighs in an exaggerated fashion, \"My sense of smell is so much better than yours, you have no idea.\" She leans in close, right next to you ear, as she whispers the next bit in a sultry voice, \"I could smell how excited you were from the laundry room. Your pussy is telling me everything you're trying to hide, Kitty Cat.\"<br>\r\nHer hot breath on your neck, and her words cause you to go into a full-body blush, hunched up in embarrassment.<br>\r\n\"Aww... Don't be like that, Cat,\" She moves in, and gives you a tender hug, you give a bit of a startled eep, but then just sort of lean into her, enjoying the feel of her body against yours.<br>\r\n\"I've... I've never been with...\" You start, nervously.<br>\r\n\"Shh... Don't worry, we'll take it slow, my little Kitty.\" She strokes your back, tenderly, then leads you back to the couch, the rest of your clothing falling off as you walk over. She sets you on her lap, you can feel the increased warmth coming off her crotch. She pulls the blanket back up around the two of you, and gently begins to nuzzle your neck. You begin to feel less self conscious, as you lean back, and begin to stroke her fuzzy head.<br>\r\n\"Oh Kate,\" you moan, as she gently strokes your belly, and tenderly massages one of your breasts. At this point the movie is completely forgotten, as you maneuver her head to face yours. Tentatively, you lean in, giving her a small kiss, feeling a little foolish at your trepidation, given where her hands are going. You go in for a deeper kiss, plunging your tongue into her mouth, and hers into yours.<br>\r\n<br>\r\nYou feel a sudden shock of electricity as her hand finds its way between your legs. Unconsciously you bring them together, but her powerful hand worms it way in, as you gasp in pleasure. Soon your legs are widening on their own volition, as her fingers rub up against your vaginal lips, her other hand gently tweaking your nipple. Suddenly one of Kate's fingers plunges into your folds, causing you to cry out. You wrap one arm around Kate's neck, as the other hand joins the one working your most sensitive area. Gasping and moaning, you begin to buck your hips. \"Oh god Kate! Oh god! Oooohhhhh!!\"<br>\r\n<br>\r\nA wave of pleasure washes over you, as you scream out in orgasm. Tears of pleasure running from your eyes. Resting, with your head nestled in between Kate's breasts, you become acutely aware of everything. How soft her belly fur is, how great her breasts feel, the heavy, deliberate rise and fall of her chest, in contrast to your own ragged breaths, the moist puddles both between your legs, and the one moistening your butt, coming from Kate's own center of pleasure. You pull back for another kiss, as Kate surprises you by first taking your cum-soaked fingers into her mouth, and gently pressing her own into yours. She smiles as she tastes your fluids, which you cannot help but admit, you're also enjoying. She removes her hand from your mouth, and then kisses you again.<br>\r\n<br>\r\n\"Mmm, Cathy... You taste so good...\" She chirrs.</span></div></div>",
            "created":1289192400,
            "id":989977,
            "title":"It's a comfy couch"
        },
        "112":{
            "choices":[
                "A strange howl from Kate's house.",
                "A disturbing scream from the next street.",
                "Kate greeting you at the front door."
            ],
            "content":"<div class=\"\"><div> <span>\"Um...OK...Why do you need to see me?\"<br>\r\n<br>\r\n\"Something's happened...something bad...very bad.\"<br>\r\n<br>\r\n\"Ok, I'll be there soon.\"<br>\r\n<br>\r\n\"Thanks Cat, you're a life saver.\"<br>\r\n<br>\r\n\"Alright, bye!\"<br>\r\n<br>\r\nYou press the 'END CALL' button, grab a jumper and begin to walk to Kate's house. You begin to think about Kate as the cool air hits your face. The nerves and urgency in her voice scare you. But she's probably trying to prank you, like everyone else in the group.Suddenly, your thoughts are interrupted by...</span></div></div>",
            "created":1405141200,
            "id":1826720,
            "title":"\"I just really need to see you.\""
        },
        "12":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "I need someone to watch my Cat",
                "I've got a new potion I want to try out",
                "I've got to ask you a question, in person",
                "I want to try something, but I need some help",
                "I'm getting the girls together for a little get-together"
            ],
            "content":"<div class=\"\"><div> <span>You jump with a start, knocking the phone to the ground in a panic. You can't believe how much that startled you. You're just feeling really on edge tonight, like something important is about to happen, and you can't remember what it is. You manage to retrieve the phone before it goes to voicemail, and pick it up with a hello.<br>\r\n\"Cat! It's Roxie, glad I got a hold of you.\" you hear Roxxane beam over the phone.<br>\r\n\"Oh, hey Roxie, what's going on?\" you ask.<br>\r\n\"You up to anything special tonight?\" she inquires.<br>\r\nYou think for a moment, \"No, I was just gonna finish this movie, and probably go to sleep afterward.\"<br>\r\n\"Oh, what movie?\" She asks.<br>\r\n\"The Craft.\"<br>\r\n\"Mmm... Didn't like that movie, too unrealistic.\" She says, factually.<br>\r\n\"Um... Did you just criticize a movie about witches for being unrealistic?\" You say, your eyebrow quirked.<br>\r\n\"Er, nevermind, listen, can you come over?\" She asks, then adds...</span></div></div>",
            "created":1295067600,
            "id":1035933,
            "title":"Black lipstick"
        },
        "122":{
            "choices":[
                "A rather sever tingle in your scalp",
                "An itch all along your back",
                "A burning in your groin"
            ],
            "content":"<div class=\"\"><div> <span>\"You made it!\" You never understood how Roxxane's \"potions\" worked, or how a girl that curvy squeezed into a black leather corset, but you were always willing to help a friend.You followed her into her large kitchen, with its assortment of pots and pans in every conceivable metal. Hanging from the ceiling are hanging pots containing every herb Roxxane could possibly need. Sitting on the stove is a large copper pot simmering away, She ladles a generous portion into a glass and hands it to you. \"Drink up.\"<br>\r\nYou look at the glass and wonder how she got a liquid to swirl red and green like that. You shrug, hold your nose, and swallow as fast as you can. You shudder at the acrid taste. \"What did I just drink?\"<br>\r\nRoxxane takes the glass from you and carefully rinses it out. \"A hair potion. You should feel a slight tingle in your scalp.\"<br>\r\nYou wait patiently, as Roxxane's potions usually take a moment to take effect. Suddenly you feel...</span></div></div>",
            "created":1397710800,
            "id":1781131,
            "title":"I've got a new potion I want to try out"
        },
        "1221":{
            "choices":[
                "Floor lenght",
                "A mass of tentacles",
                "Metallic"
            ],
            "content":"<div class=\"\"><div> <span>You reach up and rub your head. It was quite a bit worse than a \"slight\" tingle. <br>\r\n\"Are you all right?\" Roxxane looks concerned. Not surprising considering if she accidentally poisoned on of her friends she would never hear the end of it.<br>\r\n\"My head feels fuzzy.\" <br>\r\n\"Oh, did I give you too much?\" She reaches over and picks up her cookbook. As she leafs through it, the fuzzy feeling spreads through your hair. Wondering how hair can feel fuzzy you reach up, \"Don't touch.\" <br>\r\n\"You didn't even...\"<br>\r\n\"Don't. Touch.\"<br>\r\nYou wait patiently as the fuzzy feeling slowly fades and Roxxane scans her book. Finally she looks up. Then she stares. \"Oops.\"<br>\r\n\"Oops? What do you mean, oops?\"<br>\r\n\"Wait right here.\" She scurries off, and quickly returns with a large mirror. She props the mirror up on the counter. \"Okay look.\"<br>\r\nYou slowly walk over to the mirror as Roxxane wrings her hands. You look in the mirror to see that your hair is now...</span></div></div>",
            "created":1397710800,
            "id":1781200,
            "title":"A rather severe tingle in your scalp"
        },
        "12212":{
            "choices":[
                "Your tentacles don't let go",
                "She feels a prick"
            ],
            "content":"<div class=\"\"><div> <span>\"Tentacles?!\" You probably shouldn't be yelling at Roxxane, but you were to much in shock from seeing the long green mass falling down your back, \"How in hell did you turn my hair into tentacles?!\"<br>\r\n\"I don't know!\" Roxxane throws up her hands and yells back at you, \"It was supposed to be a hair enhancing potion! It was supposed to make your hair shiny! I followed the recipe! I don't know what happened! My mom is going to kill me!\"<br>\r\n\"Wait, what?\" For the first time you notice the tears in your friend's eyes.<br>\r\n\"I'm not supposed to reveal any witchcraft to mundanes,\" Roxxane is on the verge of a full blown breakdown, \"I'm dead, I'm SO dead.\"<br>\r\nAt a lose for what to do you pull your friend in for a hug. She hugs you back, sniffling. You just hold her for a few minutes, just being her friend. Eventually her tears stop. Your shirt is soaked.<br>\r\n\"Feel better?\"<br>\r\n\"Mm-hmm.\"<br>\r\nYou gently separate yourself from your friend and</span></div></div>",
            "created":1398834000,
            "id":1789413,
            "title":"A mass of tentacles"
        },
        "122122":{
            "choices":[
                "Panic.",
                "Go with the flow."
            ],
            "content":"<div class=\"\"><div> <span>\"Ow.\" Roxie reaches up to rub her neck. \"Something pricked me?\" Her eyes roll up, \"Pri...pricked...Huh?\"<br>\r\nYou barely catch her as her whole body goes limp. Gently you lower her to the ground. You look down and see a sharp barb extended from one of your tentacles, a gleaming bead of fluid hanging from the tip. You just drugged your friend. Well you had wanted her to calm down.<br>\r\nSitting down next to Roxie, you stroke her hair thinking. For one thing, people were definitely going to notice the green tentacles on your head. And one of those people was going to be Ms. Spears.<br>\r\nA thump alerts you to someone else in the kitchen. You see Ms. Spears at the counter looking over Roxie's book. She looks over at you. \"Hello, Cat.\"<br>\r\n\"Hello, Ms. Spears,\" You look nervously at the Roxie's voluptuous mother nervously. \"Are we in trouble?\"<br>\r\nMs. Spears arched her eyebrow. \"I assume Roxxane managed to tell you that revealing witchcraft to mundanes is strictly forbidden, before passing out?\"<br>\r\n\"Yes Ma'am,\" you felt like you shouldn't reveal that Roxie had been sedated, rather than pass out.<br>\r\n\"Well as far as I can tell this,\" She jabs her finger at the book, \"Is exactly the recipe Roxxane followed. And all that it should have done was make your hair sleek and shiny. After a few days. Not turn your hair into <i>that</i>,\" this time the finger jabs at your head, \"In a matter of moments. Frankly I have no idea what happened. So, no Roxie won't get in trouble for what is obviously an unforeseeable accident.\" <br>\r\nYou sigh in relief at that. Ms. Spears comes over and sits down behind you. Gently she runs her fingers through your hair, pulling it back into a tail.<br>\r\nYou moan quietly. You can feel her fingers on your hair. Actually <i>feel</i> her fingers sliding against the individual tendrils. It felt good, as her hands gathered up  your tentacles. \"I can't imagine how this would feel. Ouch!\" Quickly, you turn around expecting to see Roxie's mom collapsing. Instead you see her eyes glazed over, a look of lust on her face.<br>\r\nShe takes your head in her hands and bring you in for a kiss.</span></div></div>",
            "created":1398834000,
            "id":1789519,
            "title":"She feels a prick"
        },
        "1221221":{
            "choices":[
                "a crushing hug by Kate",
                "One of Yuki's pranks"
            ],
            "content":"<div class=\"\"><div> <span>You definitely panic. The last thing you wanted right now was a drug induced make out session with Ms Spears. Frantically, you try to think of anything, anything at all to make her stop. Like lightning a tentacle shoots out and jabs her in the neck. Just like her daughter, Ms Spears' eyes roll up into her head. She falls to the ground.<br>\r\nStill panicking you run out of the kitchen stopping only to grab a hat, tucking your hair into it, and race out the door.<br>\r\nYou reach your home grateful that your parents are out of town for the weekend. You lock every door, turn out the lights and hide under your covers.<br>\r\n<br>\r\nMonday morning finds you walking into school. You had spent Sunday experimenting with your new hairstyle. First you had discovered, by staring in the mirror and wishing, that your tentacles could change color and texture. Currently they were pretending to be a perfectly normal brown braid with a couple strands loose to frame your face.<br>\r\nSecond you had discovered that you now produced a variety of venom. Discrete testing on the neighbors dogs had determined that you produced the already known sedative and aphrodisiac, as well as a powerful paralytic agent. You hoped that you had the tentacles under control. You didn't want to accidentally drug someone again.<br>\r\n\"Cat!\" Of course the first person you run into is Roxie. She looks worried. Not surprising seeing as you ran from her house after drugging her and her mom. \"Are you okay? Why didn't you answer your phone?\"<br>\r\n\"I don't want to talk about it right know.\"<br>\r\n\"But your hair? Did it change back?\"<br>\r\n\"No.\"<br>\r\n\"Then how does it look normal?\"<br>\r\nBefore you can reply you are interruptd by</span></div></div>",
            "created":1399006800,
            "id":1790309,
            "title":"Panic."
        },
        "1222":{
            "choices":[
                "Wings",
                "Extra arms",
                "Tentacles"
            ],
            "content":"<div class=\"\"><div> <span>\"GAH!\" You reach behind your shoulders trying to reach that one spot you can never get. You don't know how it started but you're sure Roxxane's potion is at fault.<br>\r\n\"What's wrong?\"<br>\r\n\"It is <b>NOT</b> a tingle! And it is <b>NOT</b> my scalp!\" You are starting to having trouble breathing. Looking down you see that your shirt has been pulled tight against your chest and you hear the sharp rip of a seam failing. Reaching behind, you feel a large bump growing out of your back. \"What was in that stuff?\"<br>\r\nRoxxane grabs a book off of the counter and leafs through it, looking for the recipe she used. She looks up. \"Oops.\"<br>\r\nWith a mighty tear, the bump rips through your shirt taking your bra with it. You stand there topless, chest heaving, relieved that the itch has stopped. Roxxane has her hand over her mouth mortified at what she did,\"I'm so sorry.\"<br>\r\nHesitantly, you look over your shoulders to see what grew out of your back.</span></div></div>",
            "created":1397710800,
            "id":1781172,
            "title":"An itch all along your back"
        },
        "1223":{
            "choices":[
                "A big black cock",
                "A horse cock",
                "A freaking dog's cock"
            ],
            "content":"<div class=\"\"><div> <span>\"Son of a bitch!\" Your hands shoot between you legs.<br>\r\n\"What's wrong?\"<br>\r\n\"My pussy is on FIRE!\"<br>\r\n\"What? But that's not supposed to happen!\" Roxxane looked distraught as she picks up her recipe book. She flips through the pages looking for the recipe she just feed you. You sink to the ground, the pain becoming unbearable. You struggle with your jeans, pulling them off. In your quest for relief you literally tear you panties off, exposing your pussy to the cool air.<br>\r\nYou relief is short lived. As you watch your lips twist and stretch outwards, growing in size.<br>\r\nA loud thump brings your head up as Roxxane drops her book on the floor, \"Oh my god, that's...<br>\r\n</span></div></div>",
            "created":1397797200,
            "id":1781786,
            "title":"A burning in your groin"
        },
        "12232":{
            "choices":[
                "She agrees",
                "She wants more (Addiction)"
            ],
            "content":"<div class=\"\"><div> <span>\"A horse cock? How did you give me a horse cock?\" That's im....\" You stop, the pieces falling into place. \"You're a witch, aren't you?\"<br>\r\n\"Yes,\" Roxanne looked embarrassed. \"This isn't exactly how I imagined you'd find out.\"<br>\r\n\"How did you imagine me finding out?\" You couldn't think of anyway other than a botched potion mishap.<br>\r\n\"Err, by not finding out?\" You throw your hands up. You love Roxie but future planning is just not her forte. You feel something bump into your chin. You look down to see you new cock hardening. Your eyes widen as it reaches its full length, the tip resting just in front of your lips.<br>\r\n\"Wow!\" You look to see that Roxxane is also staring at your new appendage. She licks her lips, \"That's so big.\"<br>\r\nYou blush furiously, \"Stop looking at it.\"<br>\r\n\"Put it away then.\"<br>\r\n\"I can't, it wont fit in my pants\" You push at the shaft, only to have it bounce back and hit you in the face. You flinch as salty fluid sprays everywhere. You watch as one drop flies through the air and lands on Roxxane's out-stretched tongue. Here eyes glaze over and she moans. She stumbles toward you, arms reaching for your cock. \"Roxxie? Roxxie, what are you doing?\"<br>\r\nShe doesn't answer as she takes the flared tip between her lips. You moan as her hot, wet mouth slides over the head. Her tongue licking the underside of the shaft. You sink to your knees, Roxxane following, never letting you slip from her mouth. You gasp as the tip of your cock bumps against the back of the witch's throat. Your look down at your friend, happily sucking on the first few inches of your cock, and want more. Gently you take her head in your hands and drive forward. Roxxane gags as you press against the entrance to her throat, then she relaxes and you slid slowly down her hole.<br>\r\nYou stop, balls deep in Roxxane's throat. You hold there, feeling her throat spasm around the massive intruder. Roxxane looks up at you through watering eyes. Then you feel her tongue slip from her mouth and glide across you heavy balls. With a cry you cum, her throat milking you of every last drop.<br>\r\nYou collapse on top of your friend, rolling off of her as your softening dick pops from her mouth. \"Well that was weird. Good. But weird.\" You look over at Roxxane to she what she thinks.</span></div></div>",
            "created":1398229200,
            "id":1785492,
            "title":"A horse cock"
        },
        "12233":{
            "choices":[
                "Sunday morning",
                "Skip forward to Monday,"
            ],
            "content":"<div class=\"\"><div> <span>\"...the hell?\" You stare, dumbfounded at the new growth protruding form your crotch. It's huge, bright red and nearly eight inches long only half hard, laying proud over a pair of furry balls. \"You said it was a hair potion!\"<br>\r\n\"It was! Or at least it was supposed to be.\" Roxie blushes, \"I, ah, might of switched a couple of ingredients. Accidentally. Sorry.\"<br>\r\n\"I have a dog's frigging prick growing out of my cunt!\" A thought occurs to your. Frantically you feel at your groin around your newly minted balls. \"In fact, I don't even have a cunt anymore! And, and...what's that smell?\"<br>\r\nRoxie sniffs, and pulls a face. \"That kinda bitter smell, right? That's my cauldron, sorry.\"<br>\r\nYou sniff at the air, \"No, it's a kind of sweet smell. Smells kinda nice. Are you wearing perfume?\"<br>\r\n\"No, I never wear perfume. You know how it bothers Kate,\" Roxie looks at you concerned. \"Are you sure it's me you smell?\"<br>\r\n\"Yeah,\" You get up off the floor and walk over to your friend. Placing your hands on her hips you put your face into her neck and breathe deep. \"Oh, yeeaaah. It's definitely you.\"<br>\r\n\"Uh, Cat?\" Roxie backed away and you followed, still holding her hips. She kept going until she bumped into the kitchen table, \"Cat? You're making me kind of uncomfortable.\" Reaching down Roxie tried to get you to let go of her hips. Instead you lifted her up and dumped her onto her onto the table. \"Cat, please stop.\"<br>\r\nYou barely heard her as you climbed on top, pushing up her skirt. \"Nuh-uh, you smell nice.\" You expose her, surprisingly pink, panties. You frown at that and rip them off with surprising ease. Finally you see your goal, the folds of her pussy. Your head feels fuzzy as you look back at Roxie's face. Her cheeks were crimson, and she refused to meet your eyes. You look down in time to see a drop of liquid fall from her slit. A lopsided grin spread across your face. She wanted this.<br>\r\nYou move easily between her legs and place the tip of your new doggy dick at the entrance of her increasingly wet entrance. You hold yourself there for a moment teasing your friend. Then, you mercilessly slam your hips forward, burying ever last inch inside her. Roxie screamed, wither in pleasure or pain  you didn't know. And at this point you didn't really care. All you cared about was milking your shaft with her tight wet hole. You slam your hips back and forth as Roxie writhed beneath you, your shaft hardening with each thrust. Then you froze for a moment before shoving your self all the way in, howling as you cum deep inside her pussy.<br>\r\nYou collapse, exhausted on top of Roxie. You look up at her and manage to mumble an apology. \"No worries, since I started to cum as soon as you put that thing in.\"<br>\r\n\"I don't know what came over me.\"<br>\r\n\"It must have been another effect of the potion. However,\" Roxie looked you in the eye, \"Could you please get off of me?\"<br>\r\nYou try. But something stopped you. Confused, you try again with no results. Then a piece of information pops in your head. Dogs don't get fully erect until <i>after</i> they penetrate their partner. This includes the shaft and...\"Oh, crap!\"<br>\r\n\"What?\"<br>\r\n\"The knot!\"<br>\r\n<br>\r\nIn the end you manage to roll off of the table and carry Roxie to the couch, even with your pants around your ankles. The only thing to do was old still and hope you got soft before, Ms. Spears got home. Today wasn't your lucky today.<br>\r\n\"Am I interrupting something?\" The two of you look up to see her mom standing over you. The woman was more slender than her daughter but had the same dark hair and green eyes. And she was currently looking slightly surprised to see Roxanne sitting astride her friend's lap.<br>\r\nYou blushed furiously while Roxie explained. \"Well, no. We kinda finished awhile ago. Now we're waiting for the swelling to go down.\"<br>\r\n\"What swelling?\"<br>\r\n\"I, er, messed up a potion.\"<br>\r\n Ms Spears was looking concerned now. \"You messed up a potion? What happened?\"<br>\r\n\"Well. Er. Um.\" Roxie stuttered. You decided to just get it over with.<br>\r\n\"I grew a dog dick and fucked her on the kitchen table.\"<br>\r\nMs Spears blinked, \"Well that is certainly unusual. But why are you both still.\" She gestured at your current position.<br>\r\n\"The knot hasn't...wait.\" Carefully you take Roxie by the hips and lift her up. Your cock slid out of her with a pop and lay sticky on your stomach. Embarrassed by Ms Spears stare, you quickly pull your pants back up. \"Anyway! Potion!\"<br>\r\nMs Spears blinked. \"Oh yes. Lets go take a look\"<br>\r\nThe two witches quickly determined that the potion had indeed been made incorrectly. However they could not figure out why it had the effect it did. \"I'm sorry dear, but as far as we can tell the potion should have done nothing. I think it would be best if you just went home and go to bed. Call us in the morning.\"<br>\r\n<br>\r\nYou took her advice and fell asleep as soon as you hit the pillows. Only to wake up in the middle of the night and rape your pillows into submission. When you were finished all you could do was stare at the sticky white mess you had made. You were glad your parents were out of town for the week, as you went to get your bedding into the wash.</span></div></div>",
            "created":1402376400,
            "id":1810071,
            "title":"A freaking dog's cock"
        },
        "122332":{
            "choices":[
                "Slip all the way in",
                "Stop just short. In the wrong hole."
            ],
            "content":"<div class=\"\"><div> <span>You stayed home on Sunday. After a quick call to the Spears' to see if there had been any progress deciphering the potion(there hadn't been), you puttered around the house, doing homework, cleaning and taking the occasional break to masturbate furiously. Then shamefully cleaning up the mess. Once you tried to hold back, and the resulting frenzy turned the couch white. It took you forever to clean. Definitely glad your parents were out of town.<br>\r\n<br>\r\nMonday came and found you trying to sneak into the school without attracting to much attention. It wasn't that hard, since you weren't the most popular person on campus. You made it to your locker without a fuss, and entered your combination.<br>\r\nFWOOSH!<br>\r\nThick chocolate syrup sprayed out of your locker coating your face. You stand still for a moment, to make sure it really was over. Then you wipe the syrup out of your eyes and take a deep breath. \"YUKIRO!\"<br>\r\n\"You shrieked?\" The fiery-headed Asian leaned next to your locker, nonchalantly. She casually looked over your face and said, \"New beauty treatment, Cat? You should let me know how it turns out.\"<br>\r\nYou shake your head. No matter how many pranks Yuki pulls on you, or how over the top it is, you know at least she wouldn't hurt you. Looking into your locker you notice it's empty except for a tub a syrup. \"Were did you put my stuff?\"<br>\r\n\"Right here.\" She produces a paper bag. Which you see does in fact contain all your things. She reaches past you to retrieve her jug, \"So are you gonna eat that? 'Cause trust me,\" She darts forward and gives your cheek a lick, \"That stuff is delish.\"<br>\r\nYou blush crimson under the chocolate. Yuki just didn't have an off switch. You give your nose a quick pinch to clear it out and take an experimental sniff. Then sniffed again. \"Hey, Yuki? Do you smell something?\"<br>\r\nShe wrinkled her nose, \"Yeah, chocolate. Your covered in the stuff.\"<br>\r\n\"No, that's not it,\" You sniff again. It was a kind of musky smell. It sort of reminded you of...<br>\r\n\"Crap! Come on.\" You grab Yuki by the wrist and make a beeline for the nearest closet.<br>\r\n\"Wait. What are we doing?\" You don't stop to explain. You had just realised that the smell reminded you of Roxie the other night. You pull her into the closet and fumble for the button of her jeans. \"Hey now. You could at least by me dinner first.\"<br>\r\n\"Have some chocolate.\" You growl. Finally getting the buttons undone, you get her pants off and are relived to see that she hadn't put on any panties this morning. You didn't feel like destroying another pair. \"If you insist,\" A small nimble tongue proceeded to clean you up. The sensation was rather distracting. However you did your best to ignore it. You did your best to focus and the action below the waist. You didn't want a repeat of Saturday were you spent an hour knotted to Roxie. You get your own pants down and gasp in relief as your red prick flops out. Yuki looks down and her eyes widen, \"Well that's different. Were did you get that?\"<br>\r\n\"Yuki,\" You growl through gritted teeth, \"Shut up so I can fuck you.\" You only had one chance to get this right. You line yourself up with her opening and</span></div></div>",
            "created":1402462800,
            "id":1810558,
            "title":"Chocolate Syrup"
        },
        "1223322":{
            "choices":[
                "Yes.That probably for the best",
                "No, you can't afford your parents finding out"
            ],
            "content":"<div class=\"\"><div> <span>You manage to stop only four inches into Yuki's hole. You freeze, not moving and inch as you feel your dick thickening inside her. You look down at your groins to see your fully engorged knot, thankfully outside of Yuki, but  just below her drooling pussy. You snap back to Yuki's face, her eyes glazed, \"Soooo biiiig.\"<br>\r\nThat did it. Snarling, you grab her by the hips and slammed her against the wall. You catch her moan with your lips, grinding yourself against her. You come up for air gasping, then sink your teeth into her neck. Your hips piston, moving your cock in and out with increasing speed. Yuki was going nuts, wrapping her legs around you, pulling your cock even deeper inside of her. Something soft and fluffy brushes against your legs. You ignore it thinking it an old feather duster or something. Yuki manages to pull you away from her neck to press you into a lust fueled kiss. Moaning into her mouth you reach up to the top of her head and rub her...<br>\r\nPointed ears?<br>\r\nBefore you can think about that Yuki stiffens then arcs her back, screaming as her ass clamps down on your cock. This set you off, and you bury yourself in her neck again biting down to muffle your own scream.<br>\r\nAfter a couple minutes you come down from your orgasm, \"That was intense. Yuki?\"  Her head lolled to the side and her eyes were rolled into the back of her head. A small trickle of blood ran down her neck from were you bit her. And the top of her head had sprouted a pair of fox ears. Shocked you pull out of her and, ignoring the thick stream that runs out of her abused hole, gently lower her to the ground. At which point you notice the pair of fox tails. It clicks in your head. \"You're a kitsune, that explains a lot.\" <br>\r\nYou certainly can't leave her in this state. You also couldn't exactly drag her to the office looking like that. Or with your cum leaking out of her ass. Turning around you reach for your pants and pull out your phone.<br>\r\n<br>\r\n\"Hello? Roxie?\"<br>\r\n\"Yes. I'm at school. Were are you?\"<br>\r\n\"Listen, are the others with you?\"<br>\r\n\"Just Kate? Were's Krell?\"<br>\r\n\"Flu, huh. So she's in self quarantine again? Listen can you hurry over to the closet next to my locker?\"<br>\r\n\"Because I might of, accidentally, screwed Yuki's brains out.\"<br>\r\n\"No we're not knotted together. She's just out of it. And foxy looking.\"<br>\r\n\"Yeah, please hurry. Bye.\"<br>\r\n<br>\r\nAfter what feels like hours you hear a knock on the door. \"Cat? You in there?\" Relieved you walk over to open it and let the girls in. They both stopped and stared at the kitsune laying limp in a puddle of cum. Kate looked at you, as Roxie knelt down  fishing a bottle out of her bag. \"What did you do to her?\" In response you lifted up your shirt exposing your doggy dick. the blonde's eyes nearly fell out of her skull. \"Were did that come from?\"<br>\r\n\"Roxie screwed up a potion the other night. Other than that I don't know.\"<br>\r\n\"Ooookay.\" Kate absently scratched her head. \"I guess now might be a good time to mention that I'm a werewolf.\"<br>\r\nYou throw up your hands, \"At last my universe begins to make sense, What's Krell, the White Rabbit?\"<br>\r\n\"We think she's an alien,\" Roxie said as she propped Yuki's head up, \"Not that she's actually told us.\" She carefully pours a measured dose of her \"Pick Me Up Brew\" down Yuki's throat. <br>\r\nYuki stirred, blinked, and looked around smiling. \"Hey girls, when did you all get here?\"<br>\r\nRoxie glared down at her, \"You passed out after Cat screwed you. And your foxiness is showing.\" Yuki reached up and rubbed the tips of her ears. Shrugging she replied, \"Well it's not like I asked her to do my ass.\" She looked over at you. \"Why'dja screw me back there anyway?\" All three of your friends looked at you.<br>\r\nYou turn crimson. \"I was trying to focus on keeping the knot out. And she was licking my face, and she smelled so good.\"<br>\r\nRoxie and Kate looked a little embarrassed, while Yuki managed to look smug. Then Kate asked, \"Do you think maybe we should skip today?\"</span></div></div>",
            "created":1402549200,
            "id":1811119,
            "title":"Senseless"
        },
        "12233222":{
            "choices":[
                "Kinda, yeah",
                "No. It's just a werewolf thing"
            ],
            "content":"<div class=\"\"><div> <span>\"Absolutely not!\" You manage to refrain from shouting, \"If I skip my parents will find out. And I do not want to talk to them about how their daughter grew a doggy dick. I'm staying in school.\"<br>\r\n\"You should probably put these back on then.\" Yuki holds up your pants. Blushing you snatch them from her. \"You need to put your on too Yuki.\" <br>\r\n\"Are you gonna be okay?\" Roxie looks at you concerned.<br>\r\n\"No,\" you sigh, \"I'm probably going to need to cum more than once during school.\"<br>\r\n\"Can't you just hold it in?\" Kate asked.<br>\r\n\"If I do, I'll end up raping the nearest pussy in the middle of class.\" You remember the couch yesterday. \"So, no. Holding it in is not an option.\"<br>\r\nYuki popped to her feet, clean and dressed. \"Blowjobs between periods?\" You all agree that that would be best. Though you would never think that you would get first hand experience on how your friends give blowjobs.<br>\r\nYou quickly find out just how different your friends are. Yuki, unsurprisingly, was a tease. She brought you to the brink quickly, but it was clear she would have just held you there until you threw her down and fucked her senseless again. You managed to restrain yourself and get her to finish you off. Kate simply shucked of her shirt and bra, showing off her sculpted abs and small, firm breasts. She easily took your entire shaft into her mouth. She got you hard and kept you hard, but she really didn't do anything for you. Until she came up for air and asked if you wanted to breed her. It shocked the both of you when you promptly came all over her face. You filled that experience away for later. Roxie was brisk and business like. Pants down, cock in, cum out. Not the most enjoyable of the three, but it got the job done. Between the three of them they kept your urges under control.<br>\r\n<br>\r\nThankfully there was no repeat of the incidents with Yuki and Roxie. After school you all headed over to Roxie's place. Hanging out in her living room, you chatted and did homework. Carefully not mentioned was the subject of your dick or what Kate had said when she blew you earlier. Soon though Yuki showed signs of getting bored. Roxie, hoping to forestall another epic prank, invited her into the kitchen to make cookies. <br>\r\nSeeing an opportunity you turn to Kate, \"So do you really want me to breed you?\" Then you heard the words that just left your mouth and blush. Kate turned crimson as well.</span></div></div>",
            "created":1402635600,
            "id":1811517,
            "title":"Staying in School"
        },
        "122332221":{
            "choices":[
                "Dinner with her parents",
                "Wait for the pregnancy test"
            ],
            "content":"<div class=\"\"><div> <span>\"Seriously?!\" You yell. Immediately you shush yourself, not wanting to draw attention from the kitchen. \"Seriously?\"<br>\r\nKate looked embarrassed. \"Yes, seriously. I've had a bit of a crush on you for a while. And with werewolves that pretty much means I want to have your puppies.\"<br>\r\n\"You've had a crush?\" You ask incredulously, \"On me?\"<br>\r\n\"Of course!\" Kate gives you a look that sets your heart racing. \"And now that you have the right equipment...\" She trails off and bites her lip. In response you lean over and give her a kiss. It was a long, slow kiss as the two of you took your time tasting each other. With a growl, Kate pushes you onto your back and straddles you, while still maintaining the lip lock. It was definitely a change from your previous experiences, where you were indisputably in charge. Sitting up, Kate stripped off her top, once again showing off her sculpted torso. She smiles down at you. \"Like what you see?\"<br>\r\nWith a growl of your own you reach down with both hands and tear her pants apart. Her eyes widened as you buck under her,.grinding your bulging pants against her exposed slit. \"Does that answer your question?\"<br>\r\nWith a rip, Kate tears into your own pants, eager to get you inside her. Giving your red shaft an experimental stroke, she looked at you expectantly. \"Do you want this inside me?\" That was the last straw. It wasn't the first time Kate had pinned you down. But it was the first time you able to throw her off and pin her to the ground. It came as a surprise to you and to the silver headed amazon. However, you recovered first and rubbed yourself against her. <br>\r\n\"What I want is to fuck a hot bitch.\" You snarled down at your friend. \"Now am I going in here?\" You press the tip of your dog dick against the puckered entrance to her ass. Kate's whined at the pressure, You didn't think she was as \"experienced\" as Yuki, and you knew what she really wanted. \"Or are you gonna let me breed you like the bitch you are?\"<br>\r\nYou didn't know where the words were coming from, but apparently it was the right thing to say. Kate went limp, and spread her legs. \"Breed me.\" You shift the tip of your dick to her wet inviting hole. <br>\r\n\"I can't hear you.\"<br>\r\n\"BREED ME!\" She screamed and you slammed into her. You vaguely realized you were now knotted with her, but that realization was lost in the sensation of her tight pussy. Your screams and her's mixed together. Roxie and Yuki could probably hear you now. You bent forward and kissed Kate and she raked your back with her nails. Crying out, you came blasting her fertile depths with your thick potent cum. You collapse, breathing hard.<br>\r\n\"Hey! What the hell are you guys doing?\" Roxie asked as she came into the living room. She stopped dead at the sight of you and Kate. \"I thought we took care of that.\"<br>\r\n\"We did.\" You say sheepishly, \"Kate managed to get me pretty riled up.\"<br>\r\n\"Oh, really?\" Yuki drawled.\"And what did Ms Naine say to get you to screw her into the ground?\"<br>\r\nKate spoke up, \"I asked her to breed me.\" Even Yuki looked stunned. \"And I think she did.\"</span></div></div>",
            "created":1403154000,
            "id":1814629,
            "title":"Kinda, yeah"
        },
        "124":{
            "choices":[
                "lying unconscious on the floor.",
                "standing there with a wicked smile. ",
                "with somebody else."
            ],
            "content":"<div class=\"\"><div> <span>\"What is it you want help with?\" You ask Roxanne curious. Normally she would never sound so mysterious about something. <br>\r\n\"I can't talk about it with you on the phone. There might be people listening.\" She says in a serious voice.<br>\r\n\"Roxie, don't say things like that. It makes me feel like I'm in a movie myself.\" You tell her joking.<br>\r\n\"I'm serious Cat. I'll explain it all when you come here.\" Roxie then hangs up leaving you to listen to the dial tone. <br>\r\nYou don't know what it is, but Roxanne's behavior concerns you a little, normally she would never act so mysterious. It makes you decide to head over to her house just to see what's going on. <br>\r\nDownstairs you see the rest of the family looking through the pictures they made during the moving to your new home town. Typical, you think. If they were looking through those they wouldn't notice you were gone for hours. You put on your sneakers and off you go.<br>\r\n<br>\r\nWhen you arrive at Roxanne's house you don't see anything out of the ordinary. There is however this mysterious feeling you're getting. The same you get when you're watching a thriller and you just know where the killer is hiding, even though the main character doesn't. That same ominous feeling. You quickly shrug it off. Probably because of that movie you just watched.<br>\r\n<br>\r\nWalking up to the front door you notice it's unlocked, the door a bit open. Seeing this may be Roxanne's idea of trying to scare you, you open the door and enter the hallway. It's dark here, no lights are on. You do notice a note lying on the table next to the door. Probably from her parents. You do remember Roxanne talking about her parents going to visit a relative. It's then that you notice the lights in the kitchen are on. Roxanne is probably busy there. You walk over to the kitchen and as you enter you see Roxanne...</span></div></div>",
            "created":1445749200,
            "id":2052443,
            "title":"I want to try something, but I need some help"
        },
        "1242":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "I need help untying him.",
                "I want to be tied up next.",
                "continue.",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span>Your blood ran cold as you saw Roxanne with a wicked smile on her face and wondered if you had just walked into some kind of trap for a prank. Only, to your surprise, Roxanne motioned you to follow her with a single finger. \"Try to be quiet.\" Amused, she said. \"I don't want to embarrass him, not yet.\"<br>\r\n<br>\r\n\"What are you talking abo...\" Confused, you began.<br>\r\n<br>\r\nThe words died in your throat as you saw Roxanne's younger brother, Shea lying on the spare bedroom floor, tied up and gagged! He was wearing a strange girls' leotard that looked a size too small for him with a flat pad in the crotch area. Around his neck was a thick heavy leather collar, locked in place at the buckle, that had a leather arm binder attached to it. The binder kept his arms pinned to his back by a belt that ran through the D rings on two leather cuffs around his ankles, again with buckle locks, making it impossible for him to spread his legs more than a few inches. Filling his mouth was a large ball gag, held into place by three leather straps with small locks on the buckles.<br>\r\n<br>\r\nThe sight of the thirteen year old boy in such a helpless situation brought mixed emotions, most of them negative. \"What did you do to him?!\" Whispering, you demanded. \"He looks utterly terrified!\"<br>\r\n<br>\r\n\"He did this to himself.\" Surprising you, Roxanne replied. \"You see, I was into escape artistry when I was his age and it sort of turned into a bondage fetish.\" She blushed slightly, adding, \"I got over it quick though after a few close calls but I saved all of the toys just in case I might pick it up again later.\"<br>\r\n<br>\r\n\"You mean Shea found your bondage toys and began to experiment?\" Disbelieving, you said. \"How did he get himself into that arm binder by himself?\"<br>\r\n<br>\r\n\"It's self sealing.\" Serious Roxanne replied. \"A button on the inside activates it and it can open it again in case of trouble.\" She giggled slightly, seeing Shea struggle a bit more. \"Only it's battery operated and I suspect its charge went out the second it closed all the way on him since he can't get it to open again.\"<br>\r\n<br>\r\n\"What about the tight leotard?\" Wincing, you asked. \"What possessed him to put that on and what does it have to do with escape artistry?\"<br>\r\n<br>\r\nYou received your answer when a soft buzzing sound reached your ears and Shea began to moan painfully. Roxanne winced then turned to you, looking guilty. \"That's my fault, I'm afraid.\" Almost timidly, she said. \"It's a fetish outfit with a built in remote operated vibrator.\" She sighed. \"I gave it to him by mistake when he needed to borrow a dance outfit and I suspect he was still wearing it when he tried on the bondage.\"<br>\r\n<br>\r\n\"Why is it going off, then?\" Worried, you asked.<br>\r\n<br>\r\nRoxanne sighed, pointing into the room. \"He found it and started playing with it.\" Softly, she said. \"From what I can see, its set on random intensity.\"<br>\r\n<br>\r\nYou sighed, hearing Shea moaning miserably. \"Why exactly did you call me over?\"<br>\r\n<br>\r\nRoxanne smiled and replied...<br>\r\n<br>\r\n</span></div></div>",
            "created":1560323340,
            "id":2672236,
            "title":"standing there with a wicked smile. "
        },
        "12421":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You were curious about Roxanne's toys.",
                "You worried about Shea.",
                "You recieve a call.",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span>Roxanne smiled and replied, \"I need your help to untie him. Shea may be small for his age but he's a real scrapper and I know I can trust you to keep this secret.\"<br>\r\n<br>\r\nYou sighed. \"Okay, what do we need to do first?\"<br>\r\n<br>\r\nRoxanne showed me a charger with a strange connector on the end. \"First, we need to get Shea to an outlet so I can plug in the battery charger for the arm-binder.\" Motioning you to follow, she said. \"We just need enough juice to open it and get him out.\"<br>\r\n<br>\r\nYou nodded. \"Okay. But you are going to owe me and especially him an explanation.\"<br>\r\n<br>\r\nRoxanne entered the room with me following and saw Shea blush profusely upon noticing us. \"It's going to be okay, bro.\" Cooing, Roxanne said. \"We'll get you out of that get up and then we'll have a talk.\"<br>\r\n<br>\r\nShea nodded, relief in his eyes though he was completely humiliated. The first thing Roxanne did was find the vibrator remote and turned off the unit. You heard the boy sigh as the vibrations stopped. You and Roxanne then lifted Shea and moved him a few feet to the wall where the charger was plugged into the very tip of the arm binder. \"The zipper is motorized and activated with a switch where your hands are.\" Calmly, you said. \"We are recharging the battery so you can get it open.\"<br>\r\n<br>\r\nShea nodded then sighed as Roxanne unlocked the gag and pulled it off of him. \"What possessed you to try this without anyone to help you?\" Scolding, she demanded. \"Don't you understand you could have been hurt?\"<br>\r\n<br>\r\nHer words were stern but you sensed she was holding back a laugh. In a way, you were too. Other than Roxanne's carelessness with the rigged leotard, Shea let his curiosity get the best of him got himself in an embarrassing predicament.<br>\r\n<br>\r\nShea coughed, having the ball gag in for who knows how long. \"What's with that crazy leotard, sis?\" Shaking, he squeaked. \"What did I do to you?\"<br>\r\n<br>\r\nRoxanne winced. \"You really weren't supposed to even know I had that.\" Blushing, she said. \"I was in a hurry and grabbed it for you by mistake.\" She paused then added, \"If you had not been messing around with the remote, it wouldn't have done anything to you other than being a little tight.\"<br>\r\n<br>\r\n\"I thought it was the remote to the arm-binder.\" Defensively, Shea countered.<br>\r\n<br>\r\n\"It doesn't matter.\" Firmly, you said. \"The arm-binder is opening, we should be able to get you completely out of this in a few minutes.\"<br>\r\n<br>\r\nIt took over five minutes but you and Roxanne managed to free Shea from his self bondage and hurry him to his room to change out of the leotard. \"Can I trust you to keep this quiet?\" Wincing, Roxanne asked. \"If father knew I had any of these toys...\"<br>\r\n<br>\r\n\"Your secret is safe with me.\" Sighing, I said. \"Just try to keep your toys out of Shea's reach from now on.\" You giggled. \"Hopefully, this experience will teach him not to play with anything he doesn't understand.\"<br>\r\n<br>\r\nRoxanne flashed you a grateful smile. \"Thank you. I'll make this up to Shea even though he mostly did it to himself.\"<br>\r\n<br>\r\nYou later left Roxanne's house on good terms. That night, you could not sleep...<br>\r\n</span></div></div>",
            "created":1560350940,
            "id":2672304,
            "title":"I need help untying him."
        },
        "124211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "tied up like Shea was.",
                "tied to a chair in the kitchen.",
                "continue.",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span>\"Who would have thought that Roxanne, a girl who likes to cook, was into bondage.\" Bemused, you muttered. \"Just when you thought you knew someone...\"<br>\r\n<br>\r\nThe more you thought about it, the more curious you became. After an hour of sleeplessness, curiosity got the best of you and you called Roxanne. You were surprised she was still awake. \"What's up, Cat?\" Calmly, she asked. \"I can't sleep either so I'm happy for some conversation.\"<br>\r\n<br>\r\nYou sighed. \"Just curious but... who got you interested in escape artistry and bondage when you were younger?\"<br>\r\n<br>\r\n\"Oh, it was Yukiro.\" With a giggle, Roxanne replied.<br>\r\n<br>\r\n\"You smiled at that. \"I can see her being into that sort of thing.\" Softly, you said.<br>\r\n<br>\r\n\"I know, right?\" Giggling, Roxanne said. She sighed, as if to reminisce. \"It all started as a prank she played on me a few years back. She tied me up and dared me to get out while she made an attempt to cook something on her own.\"<br>\r\n<br>\r\nI raised my eyebrows in surprise. \"In <i>your</i> kitchen?\"<br>\r\n<br>\r\n\"No one cooks in my kitchen but me.\" Darkly, Roxanne said. \"I managed to wiggle free rather quickly and chased her out of my kitchen.\"<br>\r\n<br>\r\n\"Let me guess, that's what started the little prank war between you two.\" Smiling, you said. \"We thought that would never end.\"<br>\r\n<br>\r\n\"Yup!\" With another giggle, Roxanne said. \"Anyway, she got me hooked on the thrill and danger of bondage until I went too far and decided it best to hang it up before I got myself hurt.\"<br>\r\n<br>\r\n\"What happened?\" Curious, you asked.<br>\r\n<br>\r\nThere was a pause before Roxanne replied, \"You know that I keep my spice closet locked with a heavy padlock at all times, right?\"<br>\r\n<br>\r\n\"Yeah...\" Worried, I said.<br>\r\n<br>\r\n\"I had tied myself up pretty good in there with the key outside in the kitchen to give myself a challenge.\" Softly, Roxanne said. \"My mom found the door open and called for me but I was gagged so I could not answer.\" She sighed, fighting tears. \"She locked the closet, trapping me in there until she happened to see me on the security camera feed nearly two days later.\"<br>\r\n<br>\r\n\"Oh, wow...\" Whispering, you said.<br>\r\n<br>\r\n\"We both decided not to talk about it after she had released me, thinking it was one of Yukiro's pranks.\" Softly, Roxanne said. \"It was then I decided to kick the habit for my own good.\" There was another pause before she added, \"However...\"<br>\r\n<br>\r\n\"Seeing Shea tied and gagged like he was, you have a renewed interest.\" Guessing correctly, you said. \"Please tell me you're keeping the kid out of this.\"<br>\r\n<br>\r\n\"Oh, no!\" Firmly, Roxanne said. \"I'm only interested in it for myself but I'm not going to do it alone, I learned that lesson the hard way.\"<br>\r\n<br>\r\n\"You plan on asking Yukiro to help you?\" Curious, you asked.<br>\r\n<br>\r\nRoxanne giggled. \"Actually, I was hoping you might be interested it trying it out.\"<br>\r\n<br>\r\nYou blushed at that, although the thought of being made helpless at the hands of another had a certain dangerous appeal. \"What?!\" Trying to sound surprised, you squeaked. \"Me?!\"<br>\r\n<br>\r\n\"Don't be coy.\" Teasing, Roxanne said. \"We've been friends for years, I know that look you get when something intrigues you.\"<br>\r\n<br>\r\nYou blushed even further. \"Well... maybe we can try it just once.\" Timidly, you said. \"Only no one can know about it.\"<br>\r\n<br>\r\n\"Great!\" Clearly excited, Roxanne said. \"We have spring break coming up this weekend, a whole week of nothing to do.\"<br>\r\n<br>\r\n\"Your place or mine?\" With a slight grin, I asked.<br>\r\n<br>\r\nRoxanne giggled. \"My place and don't eat or drink too much before you come.\" Cheerfully, she said. \"You may be stuck there for a while.\"<br>\r\n<br>\r\nWith that, she ended the call and I sighed. \"What did I just get myself into?\"<br>\r\n<br>\r\nThe days passed quickly and you met up with Roxanne at her house to find the house completely dark. \"Roxanne?\" Nervous, you called out. \"This isn't funny...\"<br>\r\n<br>\r\nSuddenly, the door behind you closed and some one forced a foul smelling cloth over your nose and mouth. Before you knew it, you were plunged into darkness. What seemed like hours later, you woke up to find yourself...<br>\r\n</span></div></div>",
            "created":1560370020,
            "id":2672379,
            "title":"You were curious about Roxanne's toys."
        },
        "1242112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "began to force feed you.",
                "said she was only kidding.",
                "continue.",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span>What seemed like hours later, you woke up to find yourself tied to a chair in the kitchen of Roxanne's house. As you became more aware of your surroundings, you found a full length mirror in front of you on a stand that revealed you were sitting in a highchair made for your size! You tried to move your arms but found you could not move them an inch. You turned to the mirror and gulped seeing that they had been tied to your sides with thin but heavy rope. On top of that, the feeding tray was firmly in its place, pinning your arms even more.<br>\r\n<br>\r\n<i>\"Oh crap!\"</i> Frightened, you thought.<br>\r\n<br>\r\nYour  torso was tied to the back of the chair with another coil of strong ropes and your legs were held in place by ankle cuffs whose D rings were held firm to  eye hooks on the legs of the highchair with padlocks. A strange neck stabilizer was secured around your neck with a padlock that forced your head back slightly and in your mouth was a ring gag that only allowed inaudible mumbles to escape your throat.<br>\r\n<br>\r\n\"Ah, you are awake.\" Giggling, came Roxanne's voice.<br>\r\n<br>\r\nYou tried to turn your head but the neck stabilizer prevented it. Roxanne stepped into your line of sight and gave you a shark like grin that made you shudder. She took the mirror away then returned minutes later wearing her cooking apron. \"Are you ready to sample some of my latest experimental recipes?\" Teasing, she asked. \"I am going to enjoy feeding you all day long.\"<br>\r\n<br>\r\nYour eyes went wide as Roxanne brought forth a rolling serving tray filled with a huge assortments of brews and potions she seemed to have prepared in advance just for this day! Seeing your expression, Roxanne giggled then...<br>\r\n</span></div></div>",
            "created":1560390360,
            "id":2672485,
            "title":"A feast of bondage."
        },
        "12421122":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You blink once, agree.",
                "You blink twice, you want to be released.",
                "Yukiro walks in.",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span>Seeing your expression, Roxanne giggled then began to stroke your hair in a loving fashion. \"I'm just kidding.\" Cooing you, she said. \"I'm not going to force you through anything neither you or I know you have any real taste for.\"<br>\r\n<br>\r\nYou sighed in relief then glanced at her large tray of brews before looking at her. Roxane followed your gaze and grinned. \"Oh, don't worry, you are still going to get a few samples of my cooking.\" Playfully, she said. \"I didn't go through all of this work just to release you without playing with you just a little bit.\"<br>\r\n<br>\r\nWith that said, she looked over her variety of prepared concoctions before selecting what looked like an eight ounce vile of a dark brown liquid that had a light white foam at the top. She smiled wickedly before slowly pouring it down your throat. It didn't taste too bad but it was very rich. It was like dark chocolate with a hint of fine cream. Still, you had no choice but to swallow it down or choke. Once it was all down, your stomach almost immediately felt incredibly heavy but you did not feel full. In fact, you felt more hungry than ever.<br>\r\n<br>\r\n\"Did you like that?\" Grinning, Roxanne said. \"That was my chocolate cake in a cup. Every sip is equal to a slice of cake.\" She giggled. \"Congratulations, you just ate a whole cake by yourself!\"<br>\r\n<br>\r\nYour eyes went wide and you tried to shake your head but the neck stabilizer prevented it. Only Roxanne again began to stroke your hair. \"Calm down, sweetie.\" In a loving tone, she said. \"Normally, drinking this all down would make a person too full to even stand, making them wish they hadn't sampled the entire brew. Only I custom made these brews so you would only feel full without actually being full.\" She smiled kindly. \"I'm not <i>that</i> mean.\"<br>\r\n<br>\r\nAgain, you sighed in relief but went wide eyed as another eight ounce brew was poured down your throat before you could protest. Again, you were forced to drink or choke but the taste was quite good. It reminded you of gazed doughnuts. No sooner it all hit your stomach, you felt heavier still. Again, as before, you did not feel full. It was quite a strange and disturbing sensation. You could swear you had just gained twenty pounds from two drinks but you were still hungry and felt the desire to ask for more.<br>\r\n<br>\r\n\"That brew I call 'Baker's dozen'.\" Grinning, Roxanne said. \"Every sip is like a single doughnut and you just ate thirteen of them.\"<br>\r\n<br>\r\nYou were not certain how much more you could take after just two drinks of these brews, even though they weren't really filling your stomach to the point of exploding. You looked at Roxanne, your eyes pleading. You were hoping that she would get the hint that you had enough. Fortunately, Roxanne did get your message and sighed. \"I'll make a deal with you, Cal.\" Patiently, she said. \"I'm going to have my fun with you until that alarm clock goes off behind me, about an hour or so from now. If you agree, blink once and I will let you tussle and tie me up to get even at a time of your choosing. if you refuse, just blink twice and I'll let you out of this now with no hard feelings.\"<br>\r\n<br>\r\nYou hesitated. Your friend's offer was tempting. On the other side of the coin, you did not know if you could take much more of these filling brews before you were forced to cry 'uncle', if the ring gag would let you pronounce the word.<br>\r\n</span></div></div>",
            "created":1560420240,
            "id":2672593,
            "title":"said she was only kidding."
        },
        "124211224":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "to your home.",
                "to her home.",
                "to Yukiro",
                "somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>Just as you were about to reluctantly agree to Roxanne's proposal, Katelyn entered the  kitchen and saw you tied to the highchair with your mouth forced open. She turned to the tray of over a dozen brews and saw red. \"What are you doing to her?!\" Highly annoyed, she demanded. \"First your own little brother and now your best friend?!\"<br>\r\n<br>\r\n\"I explained what happened to Shea!\" Defensively, Roxanne snapped back. \"He did that to himself and all the leotard did was tickle his sides to the point of hurting because he had it on too long!\" She stroked your hair gently. \"As for Cat, she agreed to this. I would never do anything to deliberately hurt anyone.\"<br>\r\n<br>\r\n\"A tickle fetish is still a fetish; you're reckless!\" Unimpressed, Katelyn barked. Her face softened as she turned to you. \"It's okay, sweetie, Katelyn is here now.\"<br>\r\n<br>\r\nWithout another word, she demanded the key to your bonds which Roxanne sighed and reluctantly gave her. Within minutes, you were released. The two brews made you feel heavy, though you were not full, and you found yourself limping heavily. You fought the urge to moan but a few uncomfortable grunts escaped and Katelyn placed one of your arms over her neck and embraced your side to support you. \"I have you, Catherine.\" Motherly, she said. \"Don't you worry about a thing.\"<br>\r\n<br>\r\n\"Roxanne didn't mean any harm.\" Defending your friend, you said. \"I did agree to this, she was just toying with me a little.\"<br>\r\n<br>\r\n\"I know, dear.\" Still plying the mother, Katelyn said. \"Still, you can barely walk. There are limits to everything.\"<br>\r\n<br>\r\nKatelyn then takes you...<br>\r\n</span></div></div>",
            "created":1561112580,
            "id":2676600,
            "title":"Leader of the pack."
        },
        "13":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "Surprise!",
                "Another Surprise!",
                "Yuki greets you with a hug",
                "All the girls are there",
                "Yet another Surprise!"
            ],
            "content":"<div class=\"\"><div> <span>You were sipping a soda, when the phone rang. The surprise caused you to choke, and subsequently spill soda all over yourself. You curse under your breath, then reach for the phone, as you try to dry yourself off with some kleenex. Then, as you reach the phone, you get a static shock. \"Argh!\" You curse. You don't even have to look at the call ID to know who it is. Only one person could be behind all this.<br>\r\n\"Yuki....\" You growl.<br>\r\n\"Cat, is that any way to greet a friend?\" You hear her say. You can picture her mischievous grin over the phone perfectly.<br>\r\n\"Yuki, I am wet and sticky, and I don't know how, but I know it's your fault.\" You say.<br>\r\n\"Mmm, really? I knew you liked me, but I didn't think you liked me that much.\" She says with a sultry tone of voice. You gasp, realizing what you just said. You're not sure if Yuki is a lesbian, but you do know that she is rather... Liberal with her affection.<br>\r\n\"I, buh, er, nuh...\" You stammer, blushing.<br>\r\nShe laughs, \"I'm joking Cat. Listen, why don't you change shirts and come on over?\"<br>\r\nYou think for a moment, this could be a set up for another prank, but even that would probably be better than sitting around watching TV all night. \"Alright,\" You resign, \"I'll be over just as soon as I get cleaned up.\"<br>\r\n\"Great,\" She beams, \"See you in a few.\"<br>\r\n<br>\r\nYou wipe yourself off, and change shirts, and in a few minutes later, you're knocking on Yuriro's door. The door opens, and...</span></div></div>",
            "created":1295067600,
            "id":1035942,
            "title":"Foxy Asian"
        },
        "131":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "She hands you a lucky cat figurine",
                "She hands you a necklace with a curled up fox on it",
                "She hands you a box"
            ],
            "content":"<div class=\"\"><div> <span>You barely have time to scream, as suddenly the floor goes out from under you. With a thud and an oof, you find yourself on a mattress in Yukiro's basement, with Yukiro looking at you, smiling. You sit up, rubbing your backside, and shoot her an angry look, \"You have a trap door in your front porch? YOU HAVE A TRAP DOOR IN YOUR FRONT PORCH?!\"<br>\r\nShe gives you a catlike smile, \"You like it? I got the idea from a cartoon.\"<br>\r\n\"Wha! Grah! Trap door! Bwah!\" You're reduced to incoherency, trying to figure out how this girl can possibly have a trap door in her house. Before you can formulate anything cognizant she's pulling you to your feet.<br>\r\n\"Come on, I have something for you.\" She says, still grinning.<br>\r\nYou look at her skeptically, \"What is it, Yuki?\"<br>\r\n\"A gift.\" This only heightens your suspicions.<br>\r\n\"Yuki, the last 'gift' you gave me turned my hair green.\" You give her a scornful look.<br>\r\n\"Oh, come on,\" she says, rolling her eyes, \"You can't say it didn't give your hair fantastic body, though.\"<br>\r\nYou look a little embarrassed, \"Well...\"<br>\r\n\"I promise, no tricks this time, just this gift.\" A promise from Yuki is worth about as much as an Amish TV, but the way she looks at you... It's the most sincere look you've ever been given.<br>\r\n\"Oh, all right, what is it?\" You say, giving in.</span></div></div>",
            "created":1295154000,
            "id":1036555,
            "title":"Surprise!"
        },
        "1311":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "You were transformed into a Nekomata, a two-tailed Catgirl!",
                "You were turned into a Catgirl!",
                "Actually, you might've transformed into something completely different. Oops!"
            ],
            "content":"<div class=\"\"><div> <span>What Yukiro gave to you wasn't another one of her surprise prank gifts. Instead, it was some sort of lightweight cat figurine. \"Aww, Yuki! It looks so cute! But, um...why does it have two tails, exactly?\" You said, noticing that it wasn't no ordinary cat figurine, seeing two cat tails sticking out from the clay figurine.<br>\r\n<br>\r\n\"Oh, that's because it's no ordinary figurine, Cat. It's a Nekomata figurine, teehee!\" Yukiro explained, showing off her cheerful demeanor to you once more. However, it felt as if you had a very bad feeling about all of this, as if it was another one of Yukiro's pranks. \"Uh, Yuki? Why do I have a bad feeling that this is one of your pranks?\" You nervous asked, just as you could've sworn you saw what appeared to be a cat tail sticking out from Yukiro's rear, all while she began to giggle some more and replied, \"Oh no, this isn't a prank. In fact, I think of it as more of a SURPRISE, NYA!!\"<br>\r\n<br>\r\nJust as she said the word \"surprise\", Yukiro quickly tripped you at an inhuman speed, not even giving you anytime to react. In the process, you lost your grip on the Nekomata figurine she gave, as you landed hard on your back, where the figurine then shattered on top of you. From there, you were instantly covered in smoke with a loud \"POOF!\" noise to be heard within the chaos, covering you from head to toe. But suddenly, you felt something changing you on every part of your body, lasting for a few seconds before the cloud of smoke of dissipated, revealing that...</span></div></div>",
            "created":1423717200,
            "id":1932457,
            "title":"A Lucky Cat Figurine"
        },
        "13111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "You quickly left Yukiro's house. After all, this was HER fault in the 1st place.",
                "You stayed & comforted Yukiro. After all, she felt very lonely as a Nekomata."
            ],
            "content":"<div class=\"\"><div> <span>With the smoke finally cleared up, you quickly got up, only to have a weird feeling that something felt...wrong, with you, just as you grabbed the side of your head with one hand and said, \"Uuuugghh, my head! What....what happened?\" \"HOORAY!! It worked, Nyah!\" Yuki exclaimed, as you suddenly felt her pin you down, as if she saw something that made her super happy.<br>\r\n<br>\r\nAnd yet, while she was pinning you down, you could've sworn you heard Yuki...purring like a cat. Quickly turning your body, you were currently laying on your back, revealing why you heard these purring sounds from Yuki; she was a freaking Catgirl! This caused you to literally freak out from panic, pushing her off of you while she kept holding on as you screamed, \"AAAAH!!! Get off of me!! Get off of me!! GET THE FREAKING HELL OFF OF MEEEEE!!!!!\"<br>\r\n<br>\r\nBut as you moved your hands on top of Yuki's head in an attempt to push her off of you, you got a clear view of what actually happened, as you saw that half of your arms were covered in lush light brown fur, and your hands had become these thick feline paw-like hands, with 3 thick paw-like fingers and a thick paw-like thumb on each hand, making you shake out of pure unadulterated fear, with that sense of fear increasing when you moved your new feline paw-like hands to the top of your head, only to feel a pair of large brown cat ears in place of your already gone human ears, causing your eyes to get a bit watery, right on the brink of letting out the waterworks.<br>\r\n<br>\r\nAnd when you finally felt your two brown cat tails underneath you, that was the last straw for you, as you began to sob and cry like crazy, just as your cat ears drooped down to the sides. From hearing you cry, Yukiro stopped hugging you to take notice of your emotional breakdown from finding out that you're no longer fully human. So, in an attempt to calm you down, Yukiro had you lay in her lap down on the floor, as she spoke to you and asked, \"I'm so so so sorry for making you cry, Cat, Nyah! I just wanted to....to make you happy, that's all, Nya.\"<br>\r\n<br>\r\n\"Hap-*hic*-Happy?! Does it l-look like I'm *whine* happy to you, Yuki?! Why would you do this to me?! I'm your friend!\" You answered, clearly in a mix between sadness and anger, making Yukiro upset herself, as her large fiery-red cat ears drooped down to the sides of her head, showing how depressed she was getting, as she was beginning to shed a few tears herself. In turn, this made you feel guilty from yelling at her.<br>\r\n<br>\r\n\"You're....You're not actually human, are you?\" You asked, wanting to get some answers without severely hurting Yuki's feelings anymore than you already have. In response, Yuki simply nodded once and replied, \"No, Cathy. I...I wasn't born as a human being. The truth is, I'm....I-I'm a Nekomata, a Catgirl born with two tails that are filled with high levels of magical power. T-That figurine I g-gave you was enchanted with a spell to c-change you into a Nekomata like....like m-me. *sob*\" Using one of her red furry paw-like hands, Yukiro wiped the tears with her feline-like limb, as she then continued speaking and said, \"T-The reason why I-I changed you into a Nekomata is because....i-is b-because I...I, um....I......I'M ALL ALOOONNE!! NNNYYYAAAA-AAAHH-AAHH-AAAAAAHHH!! *loud repeating sobbing*\"<br>\r\n<br>\r\nOnce you heard her crying, you thought that now would be a good time to leave while she was having a crying fit. However, it was there that you realized that what Yukiro had said to you wasn't some story she made up. Instead, she was showing real genuine emotions, and real genuine tears, which made you torn between either leaving her or staying here and comforting Yuki, the very prankster who turned into a Nekomata. But in the end though....</span></div></div>",
            "created":1423717200,
            "id":1932495,
            "title":"Catherine The Nekomata"
        },
        "131112":{
            "choices":[
                "Ask more about her",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As you looked at your friend, you could see just how upset she was. These were her true feelings, being one of, if not the only, Nekomata in this world. You could only imagine how long she must have been feeling like this. Despite how upset you were with her, you knew she needed you now. With your big paws, you gently wrapped yourself around the Neko. <br>\r\n<br>\r\n\"Yuki, how long have you felt like this?\" you asked, rubbing her back softly. Yukiro didn't say anything at first, her body falling into your own. As you continued rubbing her, you could somehow tell that she what you were doing was working, as if by instinct. <br>\r\n<br>\r\nFinally, Yukiro pulled herself back and sat in <i>Seiza</i>. She looked up at you, tears still flowing quietly from her face, and responded, \"For one or two hundred years. I know everyone cares for me but...it's just not the same, Ny. There's no one who understands what it's like to be like this.\" She let out a little sob before continuing. \"That's why I turned you into a Neko just like me, because your one of my best friends, Nya. I thought...you might be able to understand, but...it was wrong of me to do this to you, Ny Ny. I can change you back. Let me just-\" <br>\r\n<br>\r\nYou quickly cut her off. \"Yuki, please just relax. I'm sorry for being so upset. If this really means so much to you, then I guess I can stay like this, at least for a while.\" Yuki's face lit up with pure joy. \"REALLY!? REALLY?! NYAHHHHHHH!!!!!!\" She screamed as she pounced on you. The both of you fell back as she hugged you furiously.<br>\r\n<br>\r\n\"Ok, Ok!!! I'm glad your happy again but please don't keep doing that. This body is a bit...sensitive\" you said, rolling away from her. \"I'll try, Nyah\" she replied, grinning brightly.<br>\r\n<br>\r\nWith the tears washed way, you wonder what to do next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1563088260,
            "id":2686522,
            "title":"Comforting the poor kitty"
        },
        "1312":{
            "author_id":"personad",
            "author_name":"Ti",
            "choices":[
                "Your boobs started getting bigger",
                "You begin growing fox ears and a tail"
            ],
            "content":"<div class=\"\"><div> <span>You look up and down at e necklace, amazed at how pretty it looks and how it seems to be in mint condition. But the one thing that peaks at your attention is the shape of a fox on the necklace. \"Wow Yukiro! This is really something.\"<br>\r\nYukiro looks happy to hear you say that. \"Glad you like it, its yours now.\"<br>\r\n\"What? I can't just take this! It looks like something that's priceless!\" You exclaimed.<br>\r\n\"Believe me, I got a lot more of those. And besides, I think I owe it to you after all I put you through. So you can have it.\" She insists.<br>\r\n\"*Sigh* Its not like you had been mean pulling all those pranks. And besides some were really fun. But I'll still take this.\" You resign before putting on the necklace.<br>\r\nImmediately once you put it on, you feel a heat in your body take over you. You stumble back onto Yukiro's couch.<br>\r\n\"Yukiro... Did it just get hot in here or is this something else?\" You ask her.<br>\r\nYukiro just smiles at you gleefully.<br>\r\n\"Something else Cat dear.\" Yukiro then goes over to you and crawls on top of you.<br>\r\nYou feel the heat in your body increase</span></div></div>",
            "created":1508964180,
            "id":2406422,
            "title":"She hands you a necklace with a curled up fox o..."
        },
        "13122":{
            "author_id":"kusaemurak",
            "author_name":"Ama no Murakumo",
            "choices":[
                "Your chest (Breast growth)",
                "Your belly (Pregnancy or expansion)"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly you feel your ears moving to the top of your head and feel what seems to be a tail forming on your rear. You then say, \"What was that?\" Yukiro said, \"That was a transformation amulet besides I think you look better with those on you anyway.\" You say, \"I know you like to do things to me but this is on a new level.\" Yukiro then said, \"That was just the start you may want to take a look at the underside of the amulet. Uhuhu.\" You take a look and notice the fox seems to have its midsection larger. You say, \"Ugh something tells me either my chest gets larger or something will start growing in my belly rather quick.\" Yukiro says to you, \"You are correct on that one and the region of you that is about to grow is...\"</span></div></div>",
            "created":1510174080,
            "id":2412659,
            "title":"You begin growing fox ears and a tail"
        },
        "131222":{
            "author_id":"personad",
            "author_name":"Ti",
            "choices":[
                "\"Right now with 5\"",
                "\"Over the week\""
            ],
            "content":"<div class=\"\"><div> <span>...your belly. Prepare for babies cause they are about to start popping inside you.\" Yukiro tells you rubbing your stomach.<br>\r\n\"What?! Yukiro! You know that I can't take care of any kids now!\" You yell towards Yukiro.<br>\r\nAll she does is giggle at you.<br>\r\n\"I should probably clarify what being pregnant to us means. That's necklace you're wearing actually belongs to a fertility goddess that my family kept within generations. I passed it onto so that we can re grow in our populations. So me making you pregnant will only have the effect of allowing you carry the spirits of people to be made into kitsunes like us only naturally born. You won't give regular birth to them and will not have to worry about birth since you'll be pregnant for like years.\" She explains to you.<br>\r\n<br>\r\nYou look at her confused not understanding what she means. Yukiro just sighs.<br>\r\n\"Look all you have to worry about you're going to be big soon. And besides when have any of my pranks caused you any lasting harm. Or anyone else?\"<br>\r\nJust as you were about to speak she cut you off. <br>\r\n\"And that bitch Maranda is a different story.\"<br>\r\n<br>\r\nYou give knowing that you wouldn't win. So you decided to ask a different question.<br>\r\n\"Well when am I going to have a baby belly then?\"<br>\r\nYukiro smiled at that </span></div></div>",
            "created":1510339500,
            "id":2413420,
            "title":"Your belly (Pregnancy or expansion)"
        },
        "14":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "...I am needing help with emotion.\"",
                "...I assist require for project.\"",
                "...Trouble having, I might have.\"",
                "...of huge important, please haste make.\"",
                "...That I am received permission to secret tell.\""
            ],
            "content":"<div class=\"\"><div> <span>Over the phone comes the familiar, strange accent of Krell. Sometimes you wonder if she really is from Yugoslavia. You haven't been over to her house yet, Krell said her host family was currently getting some renovations done, and didn't want anyone to come over while the bulk of the construction was going on.<br>\r\n<br>\r\nListening over the receiver, Krell starts, \"Hello greetings, I am speaking to the Catherine of Bryant, yes?\"<br>\r\nYou sigh a little, \"Yeah Krell, it's me. And how many times have I said, you can call me Cathy, or Cat.\"<br>\r\n\"I am apologize, but for matters of important, full positive identification name must be confirmed.\"<br>\r\n\"Uh... OK, whatever. So what's up?\"<br>\r\n\"Currently above me is fixture light fluorescent, currently energize, followed by ceiling, followed by-\" You interrupt her. She still hasn't gotten over this little quirk.<br>\r\n\"No, I mean, what's going on, why are you calling, you said it was important?\"<br>\r\n\"Oh! Yesyes, am apologize, sometimes language slang evasive is still. Purpose of communication, yes, important, yes. I am needing you to travel to my domicile.\"<br>\r\n\"Really? I thought the Smiths didn't want anyone coming over 'til the renovations were done?\"<br>\r\n\"I! Yesno, bulk of upgrades are having their completion in near past. Authorization for others to come have are granted.\"<br>\r\n\"Ooooh... Kay.\" Sometimes you wonder if the girl will ever speak proper English, \"So, why do you need me to come over.\"<br>\r\n\"Precise purpose is not authorized for transmission without faceface talk, but general needing is...</span></div></div>",
            "created":1289192400,
            "id":990152,
            "title":"Otherworldly Friend"
        },
        "141":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "Huh?",
                "Wha?",
                "Buh?"
            ],
            "content":"<div class=\"\"><div> <span>\"You... Need help with... emotion?\" You manage to stammer out.<br>\r\n\"Situation explain is... difficult... But needing I am help knowing to react in situations appropriate.\" She explains unhelpfully.<br>\r\nYou pinch the bridge of your nose in frustration. You like Krell, you really do. She's kind, and friendly, and eager to help. She's also really, really smart, at least when it comes to math and science. But sometimes you can't help but wonder if she was grown in a tube, or something. Sometimes it's like she just doesn't know how to behave around people. She's got no sense of tact, simple tasks sometimes elude her, and your other friends tell you that when she first showed up she was even worse. Sighing, you realize that, given the help she's given you with algebra, you figure you can at least go over and see what she wants. Plus maybe if you help her out with whatever she wants, maybe you can avoid another sausage incident. You liked that coffee shop too.<br>\r\n<br>\r\n\"Alright, Krell... I'll come on over and see what I can do.\"<br>\r\n\"Mighty moons many thanks friend Cathy! Vision on you soonly.\"<br>\r\n\"Yeah... I'll be over in a few minutes.\"<br>\r\n<br>\r\nThe drive over is uneventful, and you soon reach her house. She answers you at the door, and smiles, then, unsure of herself, extends her arms as if to hug you in greeting, but hesitates, with a slightly unsure look on her face. You decide to take the initiative and give her a small hug, which she returns, the relief on her face is palpable. \"Sorry,\" She says, \"I was not sure if contact physical situation appropriate being...\"<br>\r\n\"Yes, Krell, it's OK to give me a friendly hug as a way of saying 'hi.'\" You say with a bit of a sigh, but smile at the same time. The poor girl is really trying to fit in, but it's like she's had almost no experience beforehand.<br>\r\n\"Tasticfans. To sleeping quarters you come yes?\"<br>\r\n\"You mean your bedroom? Sure. By the way, are your host parents home?\"<br>\r\n\"Negative query. Out night for them are... yes?\"<br>\r\n\"Yeah, I understand.\"<br>\r\n<br>\r\nShe leads you through the house. It's clean, almost immaculately so. You can't help but notice that every room you pass looks like it should be a photograph in a furniture magazine. There's something vaguely unsettling about it. Finally you reach her room, which is the only one thus far that actually looks lived in, though it's spartan compared to the rest of the house. No posters adorn the walls, nor are they any old toys or keepsakes on the shelves. You chalk this up to Krell visiting from abroad.<br>\r\n<br>\r\n\"So, Krell... What did you need help with?\"<br>\r\n\"Needing to know how... Oh, is embarrass having...\" She actually blushes. Normally she seems almost clinically detached. You fear that whatever it is must be very sensitive.<br>\r\n\"It's OK, whatever it is you must be willing to tell me, otherwise you wouldn't have asked me over.\" You lay a reassuring hand on her shoulder.<br>\r\n\"Needing help I be am going have yes no RRrrgh!\" Her words seem to get away from her, and she grunts in frustration. Standing up she walks over to a dresser drawer and pulls out what look like two metal headbands. She hands one to you and puts one on, before taking a deep breath.<br>\r\n\"Catfriend, trust having in I, yes? This are... experimental device. On put. May slight pain feel, but initial once am doneover...\" She pauses again, she's talking slowly, trying to make sure her point comes across, \"Once connection made, good talk will occur?\"<br>\r\n\"Your saying that these can make us talk... better?\" You raise an eyebrow out of skepticism and confusion.<br>\r\n\"Yesyesyesyes, now onput please.\" She says eagerly.<br>\r\nYou sigh and shrug, slipping the metal band over your crown. She reaches over and taps a button on yours, then puts her finger on her band, \"Now, might uncomfortable be moment.\"<br>\r\nThe meaning gets across, as you wince in anticipation, but you trust she wouldn't hurt you. She taps hers, and for a moment, there's a blinding flash of pain, that sends you to the ground with a cry. It passes quickly, but you're left with a lingering ringing pain. It seems to be fading, as you hear Krell's voice, \"Cathy! Cathy are you alright?\"<br>\r\n\"Owww... Krell? What the hell.\" You're more confused than angry. Not to say that you aren't angry. That hurt!<br>\r\n\"I'm sorry, Cat!\" Krell says, very apologetically, \"I didn't anticipate the link would cause you that much discomfort.\" She cradles you, as you grasp your forehead. Fortunately the pain seems to be dissipating rather quickly, which is when something clicks.<br>\r\n\"Krell... how come I can understand what you're saying now?\"<br>\r\n\"It's the rings... They're experimental, and I really shouldn't have used them but the task I asked you over to help me with may require clarity of communications. They work by forming an empathic link between two people's brains so that the intent of their words can immediately be understood. I'm actually speaking my native tongue right now. Your brain is just translating it into English thanks to the empathic link.\"<br>\r\n\"And now it's gone again.\" Krell pouts, but your grin soon has her perk up again.<br>\r\n\"Oh! It was a joke, playing on my tendency to use large or complex words to explain myself!\"<br>\r\nYou laugh, the pain almost gone, \"Yes Krell, it was a joke. Boy these things are really amazing, minus the whole blinding pain bit.\" <br>\r\n\"Yes, they are. Once again, I'm sorry they caused so much discomfort. You can actually take them off now. The link should last for about 12 standard hours.\"<br>\r\n\"Standard hours? As opposed to regular hours?\" You rib her.<br>\r\nShe blushes a bit, kind of unsure on how to respond. She doesn't have to, as you ask, \"So... As amazing as these are, you said you needed help with an... emotion?\"<br>\r\nShe blushes even harder now, \"Yes...\"<br>\r\n\"I'm not sure I really understand the request...\"<br>\r\n\"I need you to...\" She pauses a minute, and takes a breath, trying to figure out the right words to use and find the courage to say them, \"I need you to show me love.\" She finally blurts out.<br>\r\n<br>\r\nTaken aback by her odd request, you finally manage to say...<br>\r\n</span></div></div>",
            "created":1289883600,
            "id":994890,
            "title":"I got tired of writing the accent"
        },
        "1411":{
            "author_id":"rabies",
            "author_name":"Rabies",
            "choices":[
                "She's been studying in the right places",
                "Book learnin' don't beat street smarts",
                "Um... Where exactly has she been studying, again?"
            ],
            "content":"<div class=\"\"><div> <span>You stare, blank faced at Krell, did she really just say what you think she said, \"I... I'm sorry, I think those things are broken.\" You say, indicating the rings, \"I'm pretty sure that there's no way for you to have said what I think you just said.\"<br>\r\n<br>\r\nShe looks disheartened, blushing, \"I'm... I'm sorry, it's just that... And I... You...\" she begins to sniff, as you immediately feel bad.<br>\r\n<br>\r\nYou scoot up to her, putting a comforting arm around her, \"H-hey,\" you say nervously, \"Don't cry, I... you just caught me off guard, that's all.\"<br>\r\n<br>\r\nShe sniffles a little, and looks up at you, \"D-does that mean you'll do it?\" she asks, hopefully.<br>\r\n<br>\r\nYou swallow nervously, blushing, looking into her eyes, \"I...\" She was very pretty, and you were curious, but it was all so sudden, \"Why me?\" you finish.<br>\r\n<br>\r\n\"B-back home, it is tradition to share at least one moment of intimacy with your best friend, before the end of initial education...\" She explained, \"And since you're my best friend, and...\" she trails off, pushing her fingers together,<br>\r\n<br>\r\n\"I... I've never done anything like this before,\" you say, nervously.<br>\r\n\"Neither have I...\" she responded.<br>\r\n\"I... I guess we should...\" Before you can finish your sentence, Krell pushes her lips to yours, as you mmph in surprise. However, instead of fighting it, you're soon blushing madly, pushing your lips to hers, hugging her tight, and exploring her mouth with your tongue. Hers seems to be almost impossibly long, and when you finally both break the kiss, you're both blushing madly, and panting, \"Wow...\" you gasp.<br>\r\n\"Yeah...\" She responds.<br>\r\n\"I think I'd like to...\" she silences you with a finger, and gives you a knowing nod.<br>\r\n\"I've been studying...\" she says quietly, as she begins to unbutton your blouse.</span></div></div>",
            "created":1298091600,
            "id":1056881,
            "title":"Huh?"
        },
        "15":{
            "choices":[
                "Annie",
                "Uxliolsizzle",
                "Mimi",
                "Briana",
                "Karen"
            ],
            "content":"<div class=\"\"><div> <span>It was just your friend...<br>\r\n<br>\r\n<b>Annie</b>- Asking you if you want to take a late night boat ride. You don't realize until you take a ride that she is a pirate. She has dark brown eyes, a tanned complexion, 6 feet tall, and curly auburn hair pinned neatly back.  She wears a pair of mid-length trousers, a shirt with mid-length sleeves, and goes barefoot.  She also wears a silver ring and a bandana.  She has many noticeable scars, overly large breast, and is very boisterous.<br>\r\n<br>\r\n<b>Uxliolsizzle</b>-You always thought her lack of ears were strange and now that she is inviting you over for a sleepover you will finally find out that she is actually a lab experiment created when her father his deceased wife's DNA with that of a jellyfish when he tried to use the jellyfish's ability to be reborn anew after death (Something Jellyfish actually do) but instead created a hybrid that looks human except that tentacles have replaced her lady parts. She is pale, no hair, around 6' 6\".<br>\r\n<br>\r\n<b>Mimi</b>-Shy girl in class. Has braces and thick glasses. Blonde hair kept medium length with a small frame including a small butt and small breasts and around five feet tall. You are actually really surprise she has called and seemingly demanded you come over now. Maybe she got the wrong number. Better check it out.<br>\r\n<br>\r\n<b>Briana</b>-She is an extremely good friend of yours. She is unambiguously brown, your really have not asked what she is nor have you cared. But she is brown, medium sized breasts, black hair, pale blue eyes, and 5' 8\" tall.<br>\r\n<br>\r\n<b>Karen</b>_She lives on an island, fathers a billionaire, and is a little hippie-ish. She is 5' 10\" tall, with larger than average breasts, never shaves, brown hair, brown eyes, and will try anything at least once.</span></div></div>",
            "created":1417582800,
            "id":1897215,
            "title":"Some other friend"
        },
        "151":{
            "choices":[
                "Make'er walk the plank",
                "strip her to 'er till shes baby born nude and put 'er on perminent cleaning duty",
                "Give'er a runnin with yer sword"
            ],
            "content":"<div class=\"\"><div> <span>You think its strange to have a friend who thinks shes a pirate but she has real swords and real guns so lets not annoy her. Annie, \"Aye, lets do some swashbuckling.\" Cathy, \"I'd rather not.\" Annie looks at you, \"What do ya mean no swashbuckling? What should we do with 'er\"</span></div></div>",
            "created":1417842000,
            "id":1898683,
            "title":"Annie"
        },
        "1511":{
            "choices":[
                "play detective",
                "play spies",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She made you walk the plank (diving board) and sent you home with soaking wet clothes. She did call you back the next night though asking you to...</span></div></span></div>",
            "created":1420347600,
            "id":1912994,
            "title":"Make'er walk the plank"
        },
        "1512":{
            "choices":[
                "streaking",
                "naked sleepover",
                "skinny dipping else where"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>At which she meant skinny dipping. This led to</span></div></span></div>",
            "created":1440392400,
            "id":2024725,
            "title":"strip her to 'er till shes baby born nude a..."
        },
        "15122":{
            "choices":[
                "in the morning",
                "they heard something outside"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They spent the night nude, talking about boys, pirates, more boys, other interests, even more boys. Then,</span></div></span></div>",
            "created":1473915600,
            "id":2210527,
            "title":"naked sleepover"
        },
        "151222":{
            "choices":[
                "something found in real life",
                "something not found in real life"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was....</span></div></span></div>",
            "created":1475038800,
            "id":2216228,
            "title":"they heard something outside"
        },
        "1512221":{
            "choices":[
                "knock",
                "bang as the door came crashing in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A dark shadow danced across the wall and you two knew you had a person outside. Then, at the door, was a</span></div></span></div>",
            "created":1490763780,
            "id":2296393,
            "title":"something found in real life"
        },
        "152":{
            "choices":[
                "Nope never heard of it, what is it",
                "Why call me Yukiro is the Asian",
                "Catherine runs"
            ],
            "content":"<div class=\"\"><div> <span>C-\"Whats up, WHOA.\"<br>\r\n<br>\r\nU-\"Don't be alarmed but I need help.\"<br>\r\n<br>\r\nC-\"What are those things.\" Poking Ux's tentacles<br>\r\n<br>\r\nU-\"That would be my tentacle. I am a hy ah ah STOP IT THAT I I AH AH MA VA GI NA.\" At that Cathy stopped.<br>\r\n<br>\r\nC-\"Your what?\"<br>\r\n<br>\r\nU-\"My female parts have always actually been clusters of tentacles. Now I have mutated and I need help.\"<br>\r\n<br>\r\nC-\"With what.'<br>\r\n<br>\r\nU-\"Taming my tentacles.\"<br>\r\n<br>\r\nC-\"How do we do that.\"<br>\r\n<br>\r\nU-\"Have you ever seen Hentai.\"</span></div></div>",
            "created":1417755600,
            "id":1898184,
            "title":"Uxliolsizzle"
        },
        "1521":{
            "choices":[
                "That was great and I would love to be your tentacle tamer",
                "Catherine runs away",
                "I will still be your friend as long as you at least warn me next time"
            ],
            "content":"<div class=\"\"><div> <span>\"This.\" Ux grabbed you with her tentacles and began penetrating you in every hole. After you both orgasm she lets you go saying, \"Sorry I just, after you rubbed my vagina tentacles I could not stop the rush of pleasure taking me over. I understand if you stop being my friend.\" She said as the tentacles shrunk and balled up into formation that mimicked breasts and a clitoris.</span></div></div>",
            "created":1417755600,
            "id":1898281,
            "title":"Nope never heard of it, what is it"
        },
        "1522":{
            "choices":[
                "Yukio attacks you from behind",
                "Ux attacks you with her tentacles",
                "Ux's father chloroforms you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ux-\"That's racist. What just because she's Asian she automatically likes Asian porn?\"<br>\r\n<br>\r\nCathy-\"You asked her and she turned you down didn't, MMPH\"</span></div></span></div>",
            "created":1417842000,
            "id":1898506,
            "title":"Why call me Yukiro is the Asian"
        },
        "15221":{
            "choices":[
                "You were in love with Eunice and decided to ask her hand in marriage",
                "To leave Yukiro in Taiwan as a revenge prank"
            ],
            "content":"<div class=\"\"><div> <span>\"Gotcha\" yells Yukiro. This is when Ux begins pulling off the robotic tentacles. \"My cousin Eunice and I got you.\" You look at Yukiro, \"Cousin? Eunice?!\" \"Yep, she was in from Taiwan for only the month and I wanted to pull a prank. Well we decided since she is leaving next weekend this is the perfect time to have a sleepover.\" You enjoyed Eunice's company for the night and the weekend after she went home. About two years later Yukiro and you took a trip to Taiwan and visited Eunice, which was her American name. This is when you decided...</span></div></div>",
            "created":1423285200,
            "id":1929316,
            "title":"Yukio attacks you from behind"
        },
        "15222":{
            "choices":[
                "was in cage in a lab",
                "was in a cage in the zoo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Daddy needs you for his zoo.<br>\r\n<br>\r\nUx grabbed Cathy by her wrists and ankles and with another tentacle chloroformed Catherine.<br>\r\n<br>\r\nWhen she woke up she...</span></div></span></div>",
            "created":1436590800,
            "id":2006352,
            "title":"Ux attacks you with her tentacles"
        },
        "152221":{
            "choices":[
                "Zoo enclosure",
                "back in her cage but changed"
            ],
            "content":"<div class=\"\"><div> <span>There was a crowd of people of all genders, races, and species, yes as in humans and other non-human beings. All of them were going around doing science things. \"Hello Cathy.\" She looks up and whines, \"Please let me go. I...I didn't do anything to your daughter.\" \"Exactly, that is how it works, we only catch people that my daughter says will be easy to change.\" Assistants came to lead her to the genetics lab. She fought but the men were too big, and too well armored. They dragged her into the lab, and began mixing her genes with animal's genes. The pain was excruciating and Cathy blacked out. She awoke in a</span></div></div>",
            "created":1456117200,
            "id":2108066,
            "title":"was in cage in a lab"
        },
        "152222":{
            "choices":[
                "develop a romance",
                "show Cathy's adjustment to the zoo"
            ],
            "content":"<div class=\"\"><div> <span>You, roll over groggy, the drugs and pain causing you to barely be able to move. You hear a mumbling that slowly you recognize as speaking through a loudspeaker, the language unknown to you. Your vision becomes less blurry as you fully awake, your in an enclosure, and you are not alone. Standing over you is a group of other humans, all of which are naked, making you assume your naked too. You speak out to them and they understand you and talk back. They explain that you are in a zoo, a zoo that takes regular humans and show them off to the amazed populous outside the glass. Humans have become an endangered species and in their place have arisen anthropomorphic animals. You now realize that this is you new home, it had a skylight roof that showed the time of day, it had a cave for getting out of the sun, a large pool/bathing area, it had trees for your nastier business, and it had cameras everywhere. <br>\r\n<br>\r\nhow should the story progress</span></div></div>",
            "created":1473310800,
            "id":2207822,
            "title":"was in a cage in the zoo"
        },
        "1522221":{
            "choices":[
                "That guy is hot",
                "That lady is hot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You didn't know why you were here but you did know one thing</span></div></span></div>",
            "created":1473829200,
            "id":2210247,
            "title":"develop a romance"
        },
        "1522222":{
            "choices":[
                "Cathy obeyed",
                "Cathy rebelled not wanting to play their games"
            ],
            "content":"<div class=\"\"><div> <span>Cathy began creeping around the enclosure trying to hide, but that only prompted giggles, they really thought you were a low intelligent animal be shy didn't they. A male co-prisoner, \"Don't do that, they like it. They know we have intelligence, that is obvious, but honestly humans, due to our wars, prejudices, and desire to order and classify, did in fact get left behind when it came to intelligence, and once they began threatening us guess what we clung to. That's right, we began using prejudices of their former incarnations to try to hold them down, give that a generation and as they grew culturally and scientifically in their ghettos we kept being filthy humans. After a few generations prejudice became racist, and we started a race war that turned into a real war, which turned into a civil war when we began blaming other \"races\" for us losing the war. It became a racist slur to be the original humans, the ones who came first. The Animals then saw our squabbling and feared our primitive natures. And that is why we are slaves inside one of the many zoos. A relic, a museum full of those who came before. We came, we saw, we conquered, then they came, we fought, they conquered. Be good, this is all to train us to be humble, actually try to be friendly and try to make contact that is what they want from us. Or don't and they will euthanize us and find other humans to hold in this prison.\" Cathy, \"Are there other humans out there.\" Male, \"Yes, and they consider themselves as a better race of humans than those of us in here and will never come here to save us, just kill us to save themselves from the embarrassment of sharing a species with them.\" Cathy yells, \"I'm sorry\" to the animals and they respond back in human. Male, \"Oh they can understand us but their language has never been taught to us after a while you will pick up some of their language but we have found that it is filled with rules and would probably take a human years to understand the basics let alone speak fluently. Like children in timeout. My name is prisoner 7, yours is prisoner 10, there are ten of us and your number will reduce as older humans pass away. It is our hierarchy there are ten of us, you are on the bottom, if a handler or anyone with a lower number yells 10 respond, else they will take it as an act of rebellion and will punish you. Got it, good, now mingle with the animals, that's an order.\"</span></div></div>",
            "created":1473483600,
            "id":2208637,
            "title":"show Cathy's adjustment to the zoo"
        },
        "15223":{
            "choices":[
                "fur",
                "scales"
            ],
            "content":"<div class=\"\"><div> <span>You wake seeing Ux and her father standing over you, you are naked and strapped down to a table. Instead of the sexual misconduct you feared Ux's father is turning you into a creature as well. You look around and see other furrys on tv screens. Ux and her father have done this to at least a dozen other girls. After hours of pain you are carried into a cage. The next morning you awaken with...</span></div></div>",
            "created":1418878800,
            "id":1904256,
            "title":"Ux's father chloroforms you"
        },
        "152231":{
            "choices":[
                "Dog",
                "Bear"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look down and see that you are covered in thick brown fur. You also discover you cannot speak, you were trapped, you still had conscious thought but you were now enslaved to Ux's father. You walk up to the mirror and see you are half...</span></div></span></div>",
            "created":1425099600,
            "id":1941605,
            "title":"fur"
        },
        "152232":{
            "choices":[
                "You had no arms or legs",
                "You were underwater and still breathing, fishy isn't it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look down to see scales and hear a hissing sound that you realize is you breating but something else was different...</span></div></span></div>",
            "created":1425099600,
            "id":1941611,
            "title":"scales"
        },
        "1523":{
            "choices":[
                "is caught by ux",
                "is caught by ux's father",
                "gets away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and as she is running she...</span></div></span></div>",
            "created":1419570000,
            "id":1907816,
            "title":"Catherine runs"
        },
        "15233":{
            "choices":[
                "The asylum is real",
                "It was all a dream"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She got away and tried to tell the police but they did not believe them, mainly because those two people never existed. They sent Cathy to an insane asylum to get her help. She woke up on a bed and realized </span></div></span></div>",
            "created":1490418000,
            "id":2294650,
            "title":"gets away"
        },
        "152331":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She was laying there, straight jacketed and belted to the bed, with a leather muzzle. The nurses came in, \"Are you going to be a good girl today Cathy?\"</span></div></span></div>",
            "created":1490677200,
            "id":2295859,
            "title":"The asylum is real"
        },
        "152332":{
            "choices":[
                "That morning",
                "You awoke again from that dream to find Ux and her father's plan for you"
            ],
            "content":"<div class=\"\"><div> <span>She awoke in her bed, next to her was her husband. He woke up and said, \"It's okay they won't ever hurt you.\" You snuggled up to Mo and embraced his protective spoon. You laid there thinking of you great children, your job as a stay at home mother, your wonderful husband, and slowly you fell asleep to dream another dream.</span></div></div>",
            "created":1490815860,
            "id":2296707,
            "title":"It was all a dream"
        },
        "153":{
            "choices":[
                "Well yes (Get attacked and join Jenny)",
                "Nope, just wondering (Dominate Jenny)",
                "No but I was hoping to join her (Join Jen be released before the end)"
            ],
            "content":"<div class=\"\"><div> <span>You walk in the door and see Mimi in tight black leather with a whip and your arch enemy Jenny tied to a chair naked. Mimi, \"Hello Cathy I kidnapped this bitch,\" swatting Jen as hard as she could with the whip, \"and thought you would like to join.\" You, \"Is she here of her own will?\" Mimi, \"No, is that a problem?\"</span></div></div>",
            "created":1419310800,
            "id":1906846,
            "title":"Mimi"
        },
        "1531":{
            "choices":[
                "Sora",
                "Paul, (Sora's boyfriend), Luke (Mimi's boyfriend), and Nate (Your boyfriend)",
                "You as soon as you come over"
            ],
            "content":"<div class=\"\"><div> <span>But you wake up to your phone ringing. Your on your own couch, why did you have a dream about Mimi being a dominatrix over Jenny. You answer the phone, \"Hey Cat its me Mimi. My sister Sora and I are inviting your over for some bondage fun.\" You say, \"Sure who's tied up.\"</span></div></div>",
            "created":1419570000,
            "id":1907845,
            "title":"Well yes (Get attacked and join Jenny)"
        },
        "15311":{
            "choices":[
                "they did something similar the next weekend",
                "Sora's freed herself and wanted bondage revenge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cathy heard muffled screaming in the background.<br>\r\n<br>\r\nThey had a nice sleep over, but then </span></div></span></div>",
            "created":1489122000,
            "id":2287691,
            "title":"Sora"
        },
        "15312":{
            "choices":[
                "He cheated",
                "He got Cathy fired from her job"
            ],
            "content":"<div class=\"\"><div> <span>\"But of course not until you arrive.\" Cathy rushes over and each guy waited in their own assigned rooms naked. \"Well Paul is waiting in the basement, Luke is waiting in the spare bedroom, and Nate is waiting in the pool house. First off Paul.\" You look at Sora's boy toy, nerdy man even though he was taller than any of you he was also lighter. His two redeeming qualities were one, he was a sub, and two, he had a larger than average...manhood. Cathy was given power over how all three men were tied and she chose to tie Paul sitting hogchained with a ball gag in his mouth, in a slave princess Leia costume, leashed to a pole. Then they went to tie Luke. He was waiting next to the bed he was about the girl's height but he was chiseled, a meatcake of a man, rippled with muscle and waiting for his mistresses to dominate him. Cathy chose to tie him spreadeagle to the bed with a panel gag in his mouth, wearing nothing. Then finally Nate he Cathy had special orders for him. Nate was normally Cathy's dom but is serving has her sub for a month because...</span></div></div>",
            "created":1424926800,
            "id":1940383,
            "title":"Paul, (Sora's boyfriend), Luke (Mimi's ..."
        },
        "153121":{
            "choices":[
                "Kara",
                "her new boyfriend Omar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She mummified him with tape, wrapped his mouth, chastity belted him, and left for good. At the end of the night Mimi and Sora released him and he never saw Cathy again. She had changed her name to Cynthia and established new friends, like...</span></div></span></div>",
            "created":1424926800,
            "id":1940496,
            "title":"He cheated"
        },
        "153122":{
            "choices":[
                "her new boyfriend Larry",
                "her friend Laura"
            ],
            "content":"<div class=\"\"><div> <span>Which deserved its own punishment. She pulled out the socks she had used when she ran that marathon the week before but hadn't washed yet. They stank and was just nasty. She stuffed them in his mouth and wrapped his head in tape. Then she tied his arms to the roof and tied his legs apart. Finally she set up Mimi's elaborate spanking machine, patent pending, it automatically spun allowing four pedals to continuously spank the victim. She then left Nate being spanked and the three girls had fun the whole night together and at the end they released their men. Cathy got a new job and moved away but that was not the end of her adventures, she met new people and had new interesting adventures with her friends, especially...</span></div></div>",
            "created":1424926800,
            "id":1940495,
            "title":"He got Cathy fired from her job"
        },
        "15313":{
            "choices":[
                "see a cop stopping her",
                "Mimi's house, she made it without incident"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"What should I wear mistress?\" \"Nothing if you can manage it.\" Cathy stripped nude, got in her car, and began driving to Mimi's house. Then she stopped, she looked over to...</span></div></span></div>",
            "created":1424926800,
            "id":1940364,
            "title":"You as soon as you come over"
        },
        "153132":{
            "choices":[
                "There was a knock at the door",
                "Sora walked down looking to have fun too"
            ],
            "content":"<div class=\"\"><div> <span>Mimi, \"Did you remember how I like you?\"<br>\r\n<br>\r\nCathy, \"Yes mistress, I am nude and have a bag full of dirty lingerie, dirty socks, and even my sleep mask.\"<br>\r\n<br>\r\nMimi, \"Good. To the basement.\"<br>\r\n<br>\r\nIn the basement Cathy stood there with her hands behind her back. Mimi wrapped Cathy's wrists together then taped her arms to her body. Cathy than knelt and Mimi shoved Cathy's sweaty panties in her mouth and taped over Cathy's mouth. Than Cathy laid down and Mimi taped her ankles together and her thighs together. Mimi looked over her now helpless slave and began having fun with her. Then...</span></div></div>",
            "created":1430888400,
            "id":1974259,
            "title":"Mimi's house, she made it without incident"
        },
        "1531321":{
            "choices":[
                "Mimi accidently killing her neighbor with a head trauma",
                "the woman had a heart attack and laid there dead"
            ],
            "content":"<div class=\"\"><div> <span>There was a neighbor at the door you couldn't hear the conversation but you did hear a cluster of feet running downstairs and the old woman saying, \"I knew I saw a naked lady, you are a lesbian, and one of those freaks that like sexually abusing people. Mimi tried to explain it but the woman attacked her and there was a fight that ended in.</span></div></div>",
            "created":1498507560,
            "id":2343116,
            "title":"There was a knock at the door"
        },
        "1531322":{
            "choices":[
                "mimi",
                "sora"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She began feeling up Cathy but Mimi was not amused, the two began fighting and after a minute Cathy found her self tied up next to a naked and tied up</span></div></span></div>",
            "created":1445576400,
            "id":2051120,
            "title":"Sora walked down looking to have fun too"
        },
        "1532":{
            "choices":[
                "you two dominating each other",
                "you two dominating 18+ guys, who are paid models",
                "you two dominating 18+ girls, who are paid models"
            ],
            "content":"<div class=\"\"><div> <span>The two of you spend all night getting all your frustrations out on Jenny. Then Mimi knocks out Jenny and returns her to her bed. Then next day the two of you call Jenny crazy for her story and without evidence the case was dropped. You and Mimi take the chance to start a bondage business. The two of you started a pay site where people buy videos and photos of ...</span></div></div>",
            "created":1419570000,
            "id":1907801,
            "title":"Nope, just wondering (Dominate Jenny)"
        },
        "1533":{
            "choices":[
                "a burgler you two are chair tied naked with a stranger and a freed Jenny",
                "Jenny escaped and overpowered Mimi",
                "Mimi's mother!"
            ],
            "content":"<div class=\"\"><div> <span>You went into the other room and was tied up naked to a chair. Then you heard a noise, Mimi went out to check it out, you heard a loud thud, zipper unzipping, and tape being pulled Then a figure walks in and pulls you out to where Mimi is tied up naked to a chair. You look at the figure and can't believe it, </span></div></div>",
            "created":1423285200,
            "id":1929320,
            "title":"No but I was hoping to join her (Join Jen be re..."
        },
        "15331":{
            "choices":[
                "unmasked herself, its Mimi's mother this is all a practical joke",
                "burglar knocks out and ties up Jenny naked, again"
            ],
            "content":"<div class=\"\"><div> <span>Jenny was not amused and to get her revenge she snapped some pictures of the girls, but all of a sudden the burglar busted in and began arguing with Jenny. They thought the two girls were 17 and Jenny swore that they were adults. Then the burglar said that taking pornographic pictures of someone without their permission is still illegal. The pictures were erased and the burglar then</span></div></div>",
            "created":1475298000,
            "id":2217518,
            "title":"a burgler you two are chair tied naked with a s..."
        },
        "153312":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenny woke up and found herself next to Cathy and Mimi all naked. They sat there until Mimi's parents came home.</span></div></span></div>",
            "created":1489208400,
            "id":2288053,
            "title":"burglar knocks out and ties up Jenny naked, again"
        },
        "15332":{
            "content":"<div class=\"\"><div> <span>\"Lookie here little Cathy all tied up and naked.\" Cathy tried to break free but Mimi was a master at this. Jenny started to grab all of Mimi's clothes, Cathy's clothes, jewelry, money, and began making the house look like a party happened. The two girls sat there for two days waiting for someone to come home. Eventually Mimi's parents returned from their trip, got worried, realized \"their daughter had a party\", found Cathy, called her parents, and the two girls were then not only grounded but also had to live like a nudist until enough money to begin buying them clothing again was saved up. Worst part was because Jenny was kidnapped against her will the two ladies could not tell the truth due to revealing themselves as criminals. They took the punishment and their families never forgot this event, an event that never actually happened. Oh and by the way, Jenny used the money she received by selling Mimi's and Cathy's stuff to start a business and now she is a billionaire.</span></div></div>",
            "created":1425099600,
            "id":1941239,
            "title":"Jenny escaped and overpowered Mimi"
        },
        "15333":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who promptly called your and Jen's parents. What Mimi's mom didn't know was that in doing that she just basically ended her daughters life. Mimi and Cathy were charged with kidnapping and sexual assault.</span></div></span></div>",
            "created":1423371600,
            "id":1929444,
            "title":"Mimi's mother!"
        },
        "154":{
            "choices":[
                "makeup party",
                "silly pillow fight",
                "talking about boys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A normal girly sleepover, first order of the night was a...</span></div></span></div>",
            "created":1419310800,
            "id":1906858,
            "title":"Briana"
        },
        "1541":{
            "choices":[
                "varient 1",
                "varient 2",
                "varient 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They had a fun couple of minutes then Briana had an idea dare challenge, each girl would give the other an increasingly intense dare. As soon as one of the girls forfeits they will suffer a punishment created by the other girl. First dare</span></div></span></div>",
            "created":1440046800,
            "id":2023049,
            "title":"makeup party"
        },
        "1542":{
            "choices":[
                "she hit you with the brick pillow",
                "you hit her with the brick pillow",
                "someone else hit both of you with the brick pillow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You didn't know Brenda put brick in one of the pillows. The game ending when...</span></div></span></div>",
            "created":1445230800,
            "id":2049475,
            "title":"silly pillow fight"
        },
        "1543":{
            "choices":[
                "Bull shit",
                "Blackjack",
                "you don't want to play, next idea"
            ],
            "content":"<div class=\"\"><div> <span>You and her talk for about an hour about boys, which ones are cuter, obvious you both think that your own boyfriends are the cutest, you tell secrets about yourself and your boys, but after an hour you all get bored of just talking. She suggests the two of you play your special game. <br>\r\n<br>\r\nBriana, Yourself, and some of your select mutual friends have created a game, more like a championship but all connect, All participants, which are only the two of you, must write names of games that they would wish to play, if all participants, again the two of you, all write the name of the same game that game automatically is placed in the games played. All other games will put in a hat and drawn at random. The participants than play the selected game in a best 2 out of 3 match. Loser must than strip one article of clothing. After all but one participant is stripped naked, the losers participate in embarrassing punishments for losing. depending on position the losers participate in the punishment of each person who beat them and do all the punishments until they are the highest ranking loser. If the game is only between two people then the loser participates in 10 punishments. If a player forfeits not only are they automatically placed last but they must endure double the amount of punishments that would have been assigned to them, however, if the game only consists of two players than than instead of double punishments, the punishment will be lengthened from a one moment event to a day to week long bout of embarrassment, for example instead of streaking the block they instead have to wear slutty clothes for a week.<br>\r\n<br>\r\nboth of you are wearing 4 articles of clothing meaning that depending on who wins and who loses each game, there should be between 4 and 7 games. There must be one video game, one card game, and one board game. First up card games, and you play...</span></div></div>",
            "created":1423371600,
            "id":1930011,
            "title":"talking about boys"
        },
        "155":{
            "choices":[
                "her undying slave",
                "do something illegal",
                "her hoe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The incense was great, and the drugs, better. You had a great time and then you passed out. What you didn't know was the smoke around you was a hypnotic sleep gas. Now Karen can reprogram your mind, which she does, and makes you...</span></div></span></div>",
            "created":1419310800,
            "id":1906852,
            "title":"Karen"
        },
        "1551":{
            "choices":[
                "Cathy",
                "Sex worker",
                "Patron"
            ],
            "content":"<div class=\"\"><div> <span>She turned Catherine into a slave to work at her father's adult amusement park. Anyone over the legal age can go to this park and have their wildest desires played out. Unbeknownst to anybody but Karen and her father the workers that do all the none sexual things are brainwashed slaves. So we as the writers have three choices, we can continue to follow Catherine, which is now going to be a messy fetish story, we can follow one of the sexual workers or follow a patron, both of the later choices could be any fetish the writer wants.</span></div></div>",
            "created":1428901200,
            "id":1963700,
            "title":"her undying slave"
        },
        "15511":{
            "choices":[
                "Clean up",
                "Flush"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She was one of the mindless slaves mopping up goop and stuff, but she was required to be human toilet once in a while too. Which was she doing today?</span></div></span></div>",
            "created":1442466000,
            "id":2035562,
            "title":"Cathy"
        },
        "15512":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off lets start with the Genders Male or Female</span></div></span></div>",
            "created":1428901200,
            "id":1963702,
            "title":"Sex worker"
        },
        "155121":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off There was Tommy, he dealt in the section for normal sexual acts. Is he your fancy?</span></div></span></div>",
            "created":1428901200,
            "id":1963704,
            "title":"Male"
        },
        "1551211":{
            "choices":[
                "Man",
                "Woman"
            ],
            "content":"<div class=\"\"><div> <span>He walked into work and awaited to see his post, he got to walk around today and tease people. If he was lucky, and he always was, he would be getting a little action from many of these lovely patrons, he walked out and greeted the patrons. \"Hello people and welcome to the park!\" he said as he smacked a couple on the ass making them both moan, \"Everyone is so kinky here\" Tom thought and then he got his first customer, a you _____ ready to fuck.<br>\r\n</span></div></div>",
            "created":1428901200,
            "id":1963708,
            "title":"Yes"
        },
        "1551212":{
            "choices":[
                "roger",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Roger was a worker in the kinky section, he dealt with people's more deeper desires, BDSM, Age play, Animal play. Sometimes he was dom sometimes sub.</span></div></span></div>",
            "created":1438405200,
            "id":2015226,
            "title":"No"
        },
        "155122":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off is Melony. She worked the sextion a section of the park devoid of the crazy fetishes and focused mainly on sex. Follow her story?</span></div></span></div>",
            "created":1428901200,
            "id":1963709,
            "title":"Female"
        },
        "1551221":{
            "choices":[
                "a man",
                "a woman"
            ],
            "content":"<div class=\"\"><div> <span>She loved getting some, she awaited her post, she was working the pole dancing show today, her day's job today was to get the patrons to enjoy their food and drinks a little more. If she was lucky a patron would pay for a private \"show\" which 100% of the time would be just an excuse to have sex with her. Well she was working a pole when ______ asked for a private show</span></div></div>",
            "created":1428901200,
            "id":1963710,
            "title":"Yes"
        },
        "1551222":{
            "choices":[
                "Jose",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Josephina dealt in the more kinky section. She played with peoples deeper desires, BDSM, Age play, and animal play. Sometimes she was dom sometimes sub.</span></div></span></div>",
            "created":1438405200,
            "id":2015228,
            "title":"No"
        },
        "15513":{
            "choices":[
                "boy",
                "girl"
            ],
            "content":"<div class=\"\"><div> <span>It was your 21st birthday and your friends supprised you with a day at adult world, the adult theme park. You and your three friends (same gender) were walking up to the park. You all had your ids checked and showed them your tickets. Then you all walked into the stripping area. Patrons of this park spend the whole day completely naked, therefore, the park entrances lead right into an area where every patron, no matter their sexual or gender orientation, can find a locker to keep their clothes in. After you and your friends strip you walk out into the park, so where want to go birthday</span></div></div>",
            "created":1428901200,
            "id":1963721,
            "title":"Patron"
        },
        "155131":{
            "choices":[
                "the sextion, you know start off with some basic sex before the crazy stuff",
                "go straight for the kink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well its my 21st birthday so getting a few drinks to knock off the jitters would be cool, but after that how about we go to...</span></div></span></div>",
            "created":1428901200,
            "id":1963724,
            "title":"boy"
        },
        "155132":{
            "choices":[
                "the sextion, you know start off with basic sex before going crazy!",
                "If I wanted to have sex I would stay home, lets be freaky chicks!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well its my 21st birthday so getting a few drinks to knock off the jitters would be cool, but after that how about we go to...</span></div></span></div>",
            "created":1428901200,
            "id":1963726,
            "title":"girl"
        },
        "1552":{
            "choices":[
                "Baby",
                "Pet",
                "Slave"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She had you steal a machine. It was a little machine but it was powerful. This machine would use the mind altering drugs and turn you into her permanent slave. She decided to make you her... </span></div></span></div>",
            "created":1432616400,
            "id":1983189,
            "title":"do something illegal"
        },
        "15523":{
            "choices":[
                "housework",
                "bondage"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what type of slave</span></div></span></div>",
            "created":1445403600,
            "id":2050574,
            "title":"Slave"
        },
        "1553":{
            "choices":[
                "David",
                "Carlos",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake from your high, Karen passed out on your couch, and the phone is ringing. It is your friend...</span></div></span></div>",
            "created":1420174800,
            "id":1911082,
            "title":"her hoe"
        },
        "15531":{
            "choices":[
                "dominate you",
                "be your bitch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Can you come over and play? Sure Cathy said, i can't wait to...</span></div></span></div>",
            "created":1439269200,
            "id":2019816,
            "title":"David"
        },
        "15532":{
            "choices":[
                "traditional style olympics (naked olympics)",
                "Quidditch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>reminding you that cheerleader tryouts for the local team of the world level championships. What sport was it for?</span></div></span></div>",
            "created":1425099600,
            "id":1941236,
            "title":"Carlos"
        },
        "15533":{
            "choices":[
                "yeah",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jaime (could be either gender)</span></div></span></div>",
            "created":1439874000,
            "id":2022240,
            "title":"Someone else"
        },
        "155331":{
            "choices":[
                "boy toy",
                "girl toy"
            ],
            "content":"<div class=\"\"><div> <span>Jaime was calling Cathy because they set up a \"week long vacation\". Jaime and Cathy owned the whole building and had created a business out of renting their apartments out to strangers for enough to make a profit off of it. Cathy would do everything, including taking care of Jaime for the week. Even though the renter would think Jaime was out on their own vacation they would really be tied up in the secret basement apartment that was only accessible from the first story apartment. Cathy lived on the second story apartment that also had a secret stairway to the first story apartment. Jaime lived on the third story apartment on purpose, the renters would be too far from the action to hear anything, plus Jaime would not make too much noise anyway. Cathy would feed Jaime three times a day and had free reign to do whatever she wanted with her </span></div></div>",
            "created":1439874000,
            "id":2022242,
            "title":"yeah"
        },
        "1553311":{
            "choices":[
                "pain",
                "pleasure"
            ],
            "content":"<div class=\"\"><div> <span>C-Week long huh?<br>\r\n<br>\r\nJ-Yeah.<br>\r\n<br>\r\nC-Alright, when is this \"vacation\"?<br>\r\n<br>\r\nJ-Friday until Friday, the patron is coming in for a wedding.<br>\r\n<br>\r\nFriday morning<br>\r\n<br>\r\nJaime walked in Cathy's apartment already naked and carrying his clothes in a suitcase, to make it look like a legitimate vaca. the two walked down to the basement.<br>\r\n<br>\r\nJ-How am I spending the week mistress<br>\r\n<br>\r\nCathy gave him the instructions. It had been almost two months since he got a customer and Cathy was beyond horny about getting to had Jaime all to herself. Jaime laid himself down on the mattress on the floor positioned perfectly between four sturdy pipes. Cathy went to work handcuffing Jaime to the pipes and then ring gagging Jaime and shoving a dildo in his mouth. She also took no time to ride Jaime hard. She was laying there next to him when she heard the door bell.<br>\r\n<br>\r\nC-I'll be right back.<br>\r\n<br>\r\nShe got dressed and went to let in a young couple and hand them the keys. They went up and got settled. Cathy went down stairs to Jaime.<br>\r\n<br>\r\nC-What should I do to you now?</span></div></div>",
            "created":1440046800,
            "id":2023219,
            "title":"boy toy"
        },
        "15533111":{
            "choices":[
                "day 2",
                "day 7"
            ],
            "content":"<div class=\"\"><div> <span>\"You have been a naughty boy slacking off and not working for months. What am I going to do with you.\" Jaime looked up, he knew the look in cathy's eyes. She walked up and stepped right on his balls. He screamed through the gag. \"Oh if you don't be quiet I'll have to keep you quiet.\" She said as she pulled out a whip and thwacked Jaime. Jaime swore that after this he would never allow Cathy her fun ever again. Then on</span></div></div>",
            "created":1444712400,
            "id":2047219,
            "title":"pain"
        },
        "155331111":{
            "choices":[
                "two, day four",
                "the rest of the week, day seven"
            ],
            "content":"<div class=\"\"><div> <span>a spreader bar was locked to his wrists and ankles. Then his wrists were unlocked from the bars and the spreader was raised up until his arms were above his head and his ankles being unlocked from the other two bars, he was hanging just above the ground and he was left for not one day but </span></div></div>",
            "created":1453784400,
            "id":2094785,
            "title":"day 2"
        },
        "1553311111":{
            "choices":[
                "day 5",
                "day 7"
            ],
            "content":"<div class=\"\"><div> <span>His legs were locked into shackles with fifty pound weights to each and a four by four was put under him. Jaime pleaded for Cathy to reconsider by she just said, \"Sorry I can't understand you and the spreader bar's chain was unlocked making him drop right on his crotch and the weights then making it so the crushing was prolonged. His hands were locked behind his back and he was re-gagged with a spider gag. Jaime was then left again.</span></div></div>",
            "created":1453957200,
            "id":2095746,
            "title":"two, day four"
        },
        "15533111111":{
            "content":"<div class=\"\"><div> <span>Cathy lowered him and dragged him into the living room. That is where she left him for the rest of the week as she took a vacation herself. <br>\r\n<br>\r\nThen on day 7<br>\r\n<br>\r\nJaime pain was finally done after a week of punishment he was free </span></div></div>",
            "created":1453957200,
            "id":2095798,
            "title":"day 5"
        },
        "15533111112":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jaime pain was finally done after a week of punishment he was free </span></div></span></div>",
            "created":1453957200,
            "id":2095747,
            "title":"day 7"
        },
        "1553311112":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jaime pain was finally done after a week of punishment he was free </span></div></span></div>",
            "created":1453784400,
            "id":2094786,
            "title":"the rest of the week, day seven"
        },
        "155331112":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jaime pain was finally done after a week of punishment he was free</span></div></span></div>",
            "created":1453784400,
            "id":2094779,
            "title":"day 7"
        },
        "15533112":{
            "content":"<div class=\"\"><div> <span>Day 1<br>\r\n\"You think I am going to allow you to have fun?\" Jaime shook his little head and looked coy. Cathy walked over and caressed Jaime's face. \"Hh bhbn nmf!\" he shivered in ecstasy as Cathy began whacking off Jaime. Thud, thud, thud, thud, thud, thud. \"Hh bhbn nmf! nmf! nmf! nmf!\" Then Cathy let Jaime cum all over her face. \"Time to wash this off. Can't have cum on my face when the girls come over\" \"Whht!\", Jaime knew he was in trouble.<br>\r\nDay 2<br>\r\nJaime woke up as Cathy walked in. Jaime was hungry. Cathy cooked breakfast and began eating. The smell was great and asked, \"Hmf fhmm hf thht fhhd mnnm?\" Cathy looked at at Jaime, \"I\" chew chew swallow \"Have no fucking\" chew chew swallow \"idea what you saying.\"Nhh ghhgmd brmhgfhft. Hmf fhmm hf thht fhhd mnnm?\" Cathy stood up grabbed Jaime by balls and said, \"I don't know what you are saying.\" and let go. Jaime began thrashing, \"Fhhd! Hmf thht mn fhhd? Dhmmnt!\" Cathy looked back, \"Food?\" Jaime nodded yes. Cathy decided on her plan. She walked up to Jaime and said, \"Boy's don't get hot girl food\". \"Gnrl fhhd? Nhh mmhn nhh whn't fmmd mm?\" Cathy, \"No silly, you'll eat whatever the girl's and I don't. It is possible for my little Jaime to survive six more days on only scraps.\" At this Jaime, began thrashing and making empty threats. Cathy looked scolding. Jaime shut up, and Cathy just smiled and said, \"Good boy.\" Then she walked away, and said, \"I will decide what you eat. But since you were bad today no food for you.\" At that she closed the door and Jaime heard the doorbell and a group of girls enter. Cathy, \"You ready for a week long girl's sleepover, I have food, games, and a boy tied up in the back that concented to anything.\" He heard a giant \"Yay.\" They didn't even look at him all day though, they just went shopping, girls.<br>\r\nDay 3<br>\r\nCathy now walked up with her hand behind her back and the girl's giggling. Cathy, \"I figured my widdle Jaime needed a food for the fun he'll have today.\" She then revealed a bowl of almost completely eaten food. Jaime, \"The food has to be eaten off of?\" After Jaime at his food like a good garbage desposal they decided to re-gag and have fun with him. The girl's set up a video camera, a six hour playlist of porn, a vibrator ring slid on his penis, and left him all day. Cathy kissed Jaime and said, \"See you tonight.\" then turned on the ring and left. That night they closed the door and had another night of grown-up sleepover.<br>\r\nDay 4<br>\r\nThe girls woke up and fed Jaime again. But they forgot to do something to pleasure him. <br>\r\n<br>\r\nThen they left for another day on the town.<br>\r\n<br>\r\nDay 5<br>\r\nThe girl's forgot him again as they ran out the door wearing swim suits and leaving for the day to go to the beach, however a storm came in and they came back frustrated. They didn't fuck Jaime again<br>\r\nDay 7<br>\r\nJaime was finally done after a week of punishment he was free, hungry, and embarrassed. But they rewarded him with an orgy.</span></div></div>",
            "created":1493181720,
            "id":2310929,
            "title":"pleasure"
        },
        "1553312":{
            "choices":[
                "pain",
                "pleasure"
            ],
            "content":"<div class=\"\"><div> <span>C-Week long huh?<br>\r\n<br>\r\nJ-Yeah.<br>\r\n<br>\r\nC-Alright, when is this \"vacation\"?<br>\r\n<br>\r\nJ-Friday until Friday, the patron is coming in for a wedding.<br>\r\n<br>\r\nFriday morning<br>\r\n<br>\r\nJaime walked in Cathy's apartment already naked and carrying her clothes in a suitcase, to make it look like a legitimate vaca. the two walked down to the basement.<br>\r\n<br>\r\nJ-How am I spending the week mistress<br>\r\n<br>\r\nCathy gave her the instructions. It had been almost two months since she got a customer and Cathy was beyond horny about getting to had Jaime all to herself. Jaime set herself up between the two sturdy pipes that the girls often used for standing positions. Cathy went to work handcuffing Jaime to the pipes and then ring gagging Jaime and shoving a dildo in her mouth. She also took no time fingering, rubbing and hard dildo penetrating Jaime. She was sitting there next to her when she heard the door bell.<br>\r\n<br>\r\nC-I'll be right back.<br>\r\n<br>\r\nShe got dressed and went to let in a young couple and hand them the keys. They went up and got settled. Cathy went down stairs to Jaime.<br>\r\n<br>\r\nC-What should I do to you now?</span></div></div>",
            "created":1440046800,
            "id":2023222,
            "title":"girl toy"
        },
        "15533121":{
            "choices":[
                "day 2",
                "day 7"
            ],
            "content":"<div class=\"\"><div> <span>\"You think I am going to allow you to have fun?\" Jaime shook her little head and looked coy. Cathy walked over and punched Jaime's face just hard enough to piss Jaime off. \"whht thm fhgg Omph\" she shivered in pain as Cathy began punching Jaime repeatedly across the breasts. Thud, thud, thud, thud, thud, thud. \"fthp Hmt! fthp Hmt nhw!\" \"What was that bitch.\"fthp Hmt nhw nhh fhggnng fngg pnmgm hf fhnt! Hmf nhh dhn't fthp Hmt Hm wnll nmvmr hllhw nhh th dh thnf hghnn!\" Then Cathy gave Jaime a cunt busting kick to the baby hole. \"You don't understand, I cannot understand you with that gag in your mouth. Plus I can do whatever I want with you, you consented to anything.\" Jaime knew she was in trouble.</span></div></div>",
            "created":1444712400,
            "id":2047231,
            "title":"pain"
        },
        "155331211":{
            "choices":[
                "Day 3",
                "Day 7"
            ],
            "content":"<div class=\"\"><div> <span>Jaime woke up as Cathy walked in. Jaime was hungry. Cathy cooked breakfast and began eating. The smell was great and asked, \"Ghn Hm hhvm fhmm brmhgfhft Ghthn?\" Cathy looked at at Jaime, \"I\" chew chew swallow \"Have no fucking\" chew chew swallow \"idea what you saying.\"Ghn Hm hhvm fhmm brmhgfhft Ghthn?\" Cathy stood up grabbed Jaime by the hair and said, \"I don't know what you are saying.\" and let go. Jaime began thrashing, \"Fhhd! Gnvm...Mm...Fhhd!\" Cathy looked back, \"Food?\" Jaime nodded yes. Cathy decided on her plan. She walked up to Jaime and kicked the back of her knees causing Jaime to fall to a kneeling position. Cathy, \"I do not know if I want to feed you. It is possible for my little Jaime to survive six more days with out food.\" At this Jaime, now unable to stand, began thrashing and making empty threats. Cathy pulled out a bamboo stick. Jaime shut up, and Cathy just smiled and said, \"Good girl.\" Then she walked away, and said, \"I will think about feeding you, but it is my choice.\"</span></div></div>",
            "created":1453784400,
            "id":2094775,
            "title":"day 2"
        },
        "1553312111":{
            "choices":[
                "day 4",
                "day 7"
            ],
            "content":"<div class=\"\"><div> <span>Cathy now walked up with her hand behind her back. Cathy, \"I figured my widdle Jaime needed a little grooming.\" She then revealed an electric shaver. Jaime knew exactly what was being shaved. Jaime, \"Hm fwmhr, Hmf nhh ght mn mhthmr fhggnng hhnr, Hm wnll bmht thm lnvnng fhnt hht hf nhh, nhh mhthmr fhggnng, ghgg fhggnng, ghnt fhgmd, bntgh!\" Cathy then pulled so hard on Jaime's hair that she screamed, Cathy then yelled, \"You stupid girl, I, DO NOT, KNOW WHAT, YOU, ARE SAYING!\" She then proceeded in making Jaime bald. Jaime, \"Hm fwmhr, whmn Hm gmt hht hf hmrm Hm wnll gnll nhh. Hm wnll bmht nhh, hnd hnd HW!\" Cathy yanked grabbed Jaime's head, pulled it and said, \"obviously you are too stupid to understand me.\", let Jaime drop, and walked away until...</span></div></div>",
            "created":1455339600,
            "id":2103592,
            "title":"Day 3"
        },
        "15533121111":{
            "choices":[
                "day 7"
            ],
            "content":"<div class=\"\"><div> <span>Cathy came back now with all of your friends. Cathy, \"See, I told you this is where she is during her 'vacations'.\" All of your friends then spent the whole day having pain fun with you.<br>\r\n<br>\r\nThen they had a sleepover<br>\r\n<br>\r\nday 5<br>\r\n<br>\r\nYour friends beat you a little bit more before all getting dressed in their swim suits and leaving for the day and the next and returned on</span></div></div>",
            "created":1455685200,
            "id":2105723,
            "title":"day 4"
        },
        "155331211111":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jaime pain was finally done after a week of punishment she was free, hungry, bald, and embarrassed.</span></div></span></div>",
            "created":1455685200,
            "id":2105724,
            "title":"day 7"
        },
        "15533121112":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jaime pain was finally done after a week of punishment she was free, hungry, and bald.</span></div></span></div>",
            "created":1455339600,
            "id":2103593,
            "title":"day 7"
        },
        "1553312112":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jaime pain was finally done after a week of punishment she was free and hungry<br>\r\n</span></div></span></div>",
            "created":1453784400,
            "id":2094776,
            "title":"Day 7"
        },
        "155331212":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jaime pain was finally done after a week of punishment she was free</span></div></span></div>",
            "created":1453784400,
            "id":2094752,
            "title":"day 7"
        },
        "15533122":{
            "content":"<div class=\"\"><div> <span>Day 1<br>\r\n\"You have been a naughty girl slacking off and not working for months. What am I going to do with you.\" Jaime knew the look in cathy's eyes. She walked up and sensually rubbed Jaime's g spot. She screamed through the gag. \"Oh if you don't be quiet I'll have to keep you quiet.\" She said as she pulled out a vibrator egg. Jaime swore that after this she would never allow Cathy her fun ever again, but deep down inside she knew that was a lie.<br>\r\nDay 2<br>\r\na spreader bar was locked to her wrists and ankles. Then her wrists were unlocked from the bars and the spreader was raised up until her arms were above her head and her ankles being unlocked from the other two bars, then Cathy taped a vibrator egg to each of Jaime's breasts and to her G-spot, shoved a dildo into Jaime's vagina, anus, and mouth and used a pad and made a bra and panty set out of duct tape to keep the dildos and eggs in/on. She then turned it all on and Jaime felt as that pad began absorbing her cum. she was hanging just above the ground and she was left for not one day but <br>\r\nDay 4<br>\r\nHer legs were locked into shackles with about five hundred fifty pounds of weight to each. Jaime pleaded for Cathy to reconsider by she just said, \"Sorry I can't understand you and the spreader bar's chain was unlocked making her drop to the ground and not be able to move. Her hands were locked behind her back and she was re-gagged with tape. Jaime was then left to recoup.<br>\r\nDay 5<br>\r\nCathy lowered her and dragged her into the living room. That is where she left her for the rest of the week as she took a vacation herself.<br>\r\n<br>\r\nThen on day 7<br>\r\n<br>\r\nJaime was finally done after a week of punishment she was free </span></div></div>",
            "created":1493180460,
            "id":2310923,
            "title":"pleasure"
        },
        "155332":{
            "choices":[
                "infant",
                "animal"
            ],
            "content":"<div class=\"\"><div> <span>it is your \"big\" sister, who is upstairs. \"sissy i need you.\" she said in a whiny tone. Cathy goes upstairs and says, you don't need to call on the phone you live with me. Your sister Nana was older than you by three years however after she was in a car accident when she was sixteen she began having mental spells of believing she was an</span></div></div>",
            "created":1445576400,
            "id":2051329,
            "title":"someone else"
        },
        "1553321":{
            "choices":[
                "Nana's doctor",
                "Your parents"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I need a diapee change. Ugh, all right lay down. Nana laid down and Cathy went to work changing her sister. Then there was a knock at the door.</span></div></span></div>",
            "created":1453525200,
            "id":2093408,
            "title":"infant"
        },
        "1553322":{
            "choices":[
                "helped Nana get better",
                "hypnotisted Cathy"
            ],
            "content":"<div class=\"\"><div> <span>Woof. \"Oh, Nana! Put some damn clothes on! You are a person not a dog!\" Nana pouted and whined like a dog. Cathy stood her sister up and said, \"Good girls act like people.\" Nana snapped out of it and got dressed right on time for her hypnosis session. During the session the hypnotist...</span></div></div>",
            "created":1457931600,
            "id":2117719,
            "title":"animal"
        }
    },
    "info":{
        "author_id":"rabies",
        "author_name":"Rabies",
        "brief_description":"A young woman discovers her friends have some disturbing secrets.",
        "created":1284480780,
        "description":"<td align=\"left\" class=\"norm\">Hello, welcome, hope you enjoy, and I hope that you add even more. But before you do, I'd like to you to follow a couple of guidelines.<br>\r\n<br>\r\nUse proper spelling, grammar, and punctuation. When people are speaking, be sure to put what they're saying in quotes. Also be sure to break up your entries into paragraphs every so often. As a rule of thumb, try not to have a single paragraph longer than nine sentences.<br>\r\n<br>\r\nTry to be as descriptive as possible. Avoid one-line chapters if you can.<br>\r\n<br>\r\nEndings are allowed, but if you are making a chapter with an ending, one of the choices in the previous chapter must continue the story.<br>\r\n<br>\r\nStay consistent with previous chapters in the same story arc.<br>\r\n<br>\r\nThe first 4 characters introduced are Catherine's best friends. They'd never knowingly do anything to hurt Catherine, willingly. Now, it may be that their nature gets the better of them, or circumstances may cause them to do something they don't want to, but they'll never act maliciously towards Cat.<br>\r\n<br>\r\nThough not outright stated, it should be obvious what each of the girls are. If you can't figure out what they're supposed to be, drop me a line and let me know.<br>\r\n<br>\r\nChapters are to be written in second or third person (ex. “you go down the stairs” or “alice goes down the stairs”.) No additions in first person (“I go down the stairs.”) And keep the tense consistent<br>\r\n<br>\r\nThere will be sex. There will probably be some kinky sex. There will probably be a great deal of fetishes covered, including bondage, transformation, furries, and vore. The only thing specifically disallowed is pedophilia.<br>\r\n<br>\r\nAvoid choice chapters if at all possible (A chapter consisting solely of 2 options) If you do end up making one, please fill out at least one of the choices.<br>\r\n<br>\r\nI reserve the right to remove or modify any chapters not following these guidelines. However, if I do deem it necessary to do so, you will get a notification beforehand and an opportunity to modify your chapter to bring it in line.<br>\r\n<br>\r\nIf you are unsure of anything, have any questions/comments/whatnots, please drop me a line on the onsite e-mail, and I will get back to you as soon as possible.<br>\r\n<br>\r\nIf you want to reserve a chapter, drop me a line on my onsite e-mail. If you reserve a chapter, it will be held for you for two weeks.<br>\r\n<br>\r\nOther than that, please add, and enjoy. There will be rewards for good additions.</td>",
        "id":1707861,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1563088260,
        "modified":1563088260,
        "pretty_title":"The Secret Lives of Your Friends"
    }
}