{
    "chapters":{
        "1":{
            "author_id":"c856935",
            "author_name":"Chaos",
            "choices":[
                "Have fun with tTsunade.",
                "Go see Sakura.",
                "Go see Hinata.",
                "Go see Ino.",
                "Find another girl."
            ],
            "content":"<div class=\"\"><div> <span>In the village of Konaha, Naruto Uzumaki is grumbling to himself. He is being dragged by Tsunade across the Hokage Tower. They enter a room, and Tsunade flips the switch. The room is full of stuff, and covered in dust.<br>\r\n\"OK brat your punishment will be to clean this room,\" Tsunade says smugly.<br>\r\n\"But that will take hours. It was only one prank,\" Naruto whines.<br>\r\n\"You will clean this room, or I will have you suspended,\" Tsunade says angrily.<br>\r\n\"Fine fine,\" Naruto grumbles.<br>\r\nAn hour pasts, and Naruto is still not done cleaning. He trys to move to a new spot when he trip's and knocks over a pile, messing up what he already did. When he gets up he sees a trunk was hidden under it. He looks around to see if anyone is around before opening the trunk.<br>\r\n\"I wonder whats in here,\" Naruto says.<br>\r\nIn the trunk is a hat, and countless cards. He looks into the hat, sees Mad Hatter written inside.<br>\r\n\"I wonder who the Mad Hatter is,\" Naruto says outloud.<br>\r\nNaruto liking the way it looks puts on the hat. Next he looks into the trunk to see if their is anything else in there. He finds a note burred under the cards. It says \"Put a card behind someone's ear, and start making your own Wonderland\", and below that in a new handwriting, \"Add chakra to make permanent.\"<br>\r\nNaruto puts the cards in his jumpsuit wondering what they they do. He turns around to see a angry Tsunade.<br>\r\n\"I give you a order to clean this room, and you play around. Im going to go suspended you right now,\" Tsunade says in anger.<br>\r\nNaruto in a moment of panic throws one of the card between Tsunade's ears. Tsunade becomes still with a glazed look in her eyes.<br>\r\n\"Tsunade are you okay,\" Naruto says.<br>\r\n\"Yes Master,\" Tsunade says with no emotion.<br>\r\nNaruto wonders why she called him master, but then remembers the note. He realizes that the cards allow you to control minds.<br>\r\nWanting to see if he is right says to Tsunade,\"Clean this room\",<br>\r\n\"Yes Master,\" Tsunade says, and starts working.<br>\r\nA few hours latter Tsunade has finished cleaning, and Naruto is sure the cards work. Next Naruto wants to see how powerful the cards are.<br>\r\n\"You are a cat,\" Naruto says seeing if it would work.<br>\r\nTsunade suddenly starts walking on all for meowing. Naruto wondering what would happen takes out the card. Tsunade's eyes change from a cat like one to a confused then angered one. Seeing this Naruto puts the card back between her ears, and she stands up her eyes gaining there glazed look. Naruto realizing that Tsunade last saw the room dirty wonders what he could do when he removed the card. He thinks about what the note said, and remembered about the second part. Naruto touches the card, and adds chakra to it causing it to glow. Tsunade eyes seem to empty completely leaving nothing at all.<br>\r\n\"You came down here to see me busy cleaning. You decide to watch me, but fell asleep,\" Naruto says.<br>\r\n\"Came down here. Saw you working. Fell asleep,\" Tsunade says as if it was the truest thing in the world.<br>\r\nNaruto stops adding chakra, and the Tsunade eyes gained their glazed look when the card stop glowing.<br>\r\n\"Okay go to sleep,\" Naruto says.<br>\r\nTsunade leans against the wall, and instantly fall sleep. Naruto removes the card, and wakes up Tsunade.<br>\r\nTsunade yawns and says, \"Sorry i fell asleep. Well you did good brat you can go.\"<br>\r\nNaruto can see that see remembers what he told her and wonders what he can do next.</span></div></div>",
            "created":1338008400,
            "id":1345801,
            "title":"Birth of the Hatter."
        },
        "11":{
            "author_id":"c856935",
            "author_name":"Chaos",
            "choices":[
                "Make him Hokage.",
                "Make her do something funny or embarising.(No Chakra.)",
                "Make her do something sexy.(Chakra.)/",
                "Make her do something funny or embarising.(Chakra.)",
                "FInd another girl."
            ],
            "content":"<div class=\"\"><div> <span>Naruto looks at the card in his hand, and starts to think.<br>\r\n'Well she is right there, and I have time,' Naruto thinks.<br>\r\n\"Hey, I think I saw some old wine over there,\" Naruto says pointing behind Tsunade.<br>\r\nAs Tsunade turns around, Naruto throws the card at her. The card lands where it should, and Tsunade stops moving. Naruto walks in front of her, and sees the glazed look in her eyes.<br>\r\n\"Tsunade can you hear me,\" Naruto says making sure it worked.<br>\r\n\"Yes Master,\" Tsunade once again with no emotion.<br>\r\nNaruto jumps in joy that it still worked. When he calms down he wonders what to do. He almost gives up, till he remembered what her Nickname was.<br>\r\n\"I guess it's time to give another meaning to \"The Legendary Sucker,\" Naruto says with a smirk.<br>\r\nNaruto takes off his clothes, and sits down on a chair.<br>\r\n\"Tsunade I want you to give me the best blowjob you can give, and swallow it all,\" Naruto commands.<br>\r\nTsunade walks over to Naruto, and gets on her knees. She grabs his dick,and moves it into his mouth. Naruto starts moaning as she hits all the right spot. After a few minutes Naruto starts to cum. As the last of it starts coming out Naruto pulls out of Tsunade's mouth, and the rest land on the floor. Tsunade, after swallowing. starts licking his cum off the floor. When she is done she stands at attention.<br>\r\nNaruto shocked at what she just did wonders what to do next.</span></div></div>",
            "created":1338354000,
            "id":1348446,
            "title":"\"The Legendary Sucker.\""
        },
        "112":{
            "author_id":"saimin",
            "author_name":"Larax99",
            "choices":[
                "Use the card on another girl",
                "Go to your house"
            ],
            "content":"<div class=\"\"><div> <span>Lets see how are you when you are not you granny.<br>\r\n\"Tsunade I want you to act like very drunk, imagine Im just a simpley guy and not Naruto\"-said Naruto.<br>\r\n\"Yes Master, drunk, simple guy, not Naruto\"-Said Tsunade with a monotone voice.<br>\r\nAfter reciving her orders Tsunade start to wobble by the effect of the alcohol on her body.<br>\r\n\"Hey what are you seeing??\"-Said a drunk Tsunade.<br>\r\n\"Hehehe it's working\"-Thought Naruto after seen Tsunade.<br>\r\n\"Hey I asked you a question, it's for the boobs it's that it??\"-Said Tsunade while she grabbed her left boob.<br>\r\n\"Wow, you like the fight dont you granny??\"-Said Naruto after seen the Tsunade mood.<br>\r\n\"Huh?? Who're calling granny man??\", let me tell you these friends are more sexy than a teenager's\"-Said Tsunade taking out her tits.<br>\r\nNaruto gets surprised by grannys mood, surprised but excited at the same time.<br>\r\n\"Ooh the man took a choice, are you keep thinking Im a granny??\" or I have to show you what else I have young\"-Said Tsunade seeing the Naruto erection.<br>\r\n\"Wait, what are you gonna do??\"-Answer Naruto.<br>\r\n\"You will see friend\"-After saying that, Tsunade take off her pants.<br>\r\n\"Fresh air al least\"-Said Tsunade after taking totally of her pants.<br>\r\n\"Wait granny, I think you are very drunk\"-Said Naruto while seeing the Hokage naked in front of him.<br>\r\n\"You keep de granny think huh?? well this granny's gonna show you how much she know\"-Tsunade take Naruto down to the floor.<br>\r\n\"You have to allow your body breathe too\"-Tsunade take off all Naruto's clothes, leave him with a hard dick.<br>\r\nTsunade put all his dick inside her mouth, starting a blowjob, using her toungue and making lewd sounds.<br>\r\n\"Wow granny you know how to do it\"-Said Naruto feeling the mouth of Tsunade eating his dick.<br>\r\n\"Stop that granny thing dude and wait for the best\"-Tsunade show her pussy and she settled down on Naruto's cock and start to fuck him.<br>\r\n\"Yeah yes Tsunade its feel great\"-Said Naruto feeling Tsunade's pussy.<br>\r\n\"Finally you called me by my name, I have to fuck you more times to remember it\"-Tsunade kept fucking Naruto for a time until both of them got the climax.<br>\r\n\"Wow granny that was awesome\"-Said Naruto while he got up.<br>\r\n\"Dont call me granny zzzzzz\"-That was her last words until she slept.<br>\r\n\"Well its better that I clean up\"-Saying that Naruto get dressed again and Tsunade too, after finish that Naruto put the card on her ear again.<br>\r\n\"Ok granny you will sleep again and forget all of this, you will only remember you drank all the wine I found it\"-Said Naruto.<br>\r\n\"Yes Master, sleep again, forget everything, drink wine\"-Said Tsunde before she fall sleep again.</span></div></div>",
            "created":1489390320,
            "id":2288895,
            "title":"Drunk Granny"
        },
        "113":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "That night...",
                "Later that day...",
                "Tsunade's POV leading to the evening..."
            ],
            "content":"<div class=\"\"><div> <span>Naruto adds chakra to the card and tells her, \"Tsunade, every day when you are done with your Hokage duties, you will go to my apartment and strip naked, not feeling any embarrassment or shame about it. You will then submit yourself to me and obey my every order without question. Whenever you wake up in the morning, you will always return to your office and forget the events of the previous night except for these commands.\"<br>\r\n<br>\r\n\"Every night, your apartment, naked, shameless, submit, obey, forget everything in the morning.\" Tsunade repeated in a monotone.<br>\r\n<br>\r\nSatisfied, Naruto removed the card and watched as Tsunade regained her senses and said, \"I don't see any wine here. You must have been seeing things. You're dismissed, Naruto.\"<br>\r\n<br>\r\n\"Thanks!\" Naruto said as he quickly made his escape.</span></div></div>",
            "created":1362978000,
            "id":1548130,
            "title":"Make her do something sexy.(Chakra.)/"
        },
        "1131":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "he plays with her tits, gets titfucked, and hotdogs Tsunade",
                "he goes for the gold, and fucks her ass and pussy in doggy-style",
                "he puts a leash and collar on her, and takes the dog for a late-night stroll"
            ],
            "content":"<div class=\"\"><div> <span>Naruto was sitting in his living, totally naked, awaiting the arrival of his personal pet, the Hoe-kage. He was gonna have some fun with her tonight.<br>\r\n<br>\r\nAt 10:00, a knock came at the door. Naruto got up, and opened the door. He was greeted by the sight of Tsunade as she walked in before taking off all of her clothes.<br>\r\n<br>\r\n\"What shall we do first, Naruto-sama?\" Tsunade asked, unfazed by the fact that Naruto was naked.</span></div></div>",
            "created":1362978000,
            "id":1548155,
            "title":"That night..."
        },
        "11313":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "An Adult Store (Tsunade is temporarily restored humanity)",
                "Another Girl's House (Tsunade remains a dog)"
            ],
            "content":"<div class=\"\"><div> <span>Naruto grinned as he held up a collar to Tsunade and said, \"Place this collar around your neck.\"<br>\r\n<br>\r\n\"Right away, Master Naruto,\" Tsunade said as she did as told. The collar around her neck became the only clothing she was allowed to wear.<br>\r\n<br>\r\nImmediately after the collar was put on, Naruto told Tsunade, \"Get down on your hand and knees. You will act like a dog until I say sow.\"<br>\r\n<br>\r\nWithout a moment's hesitation, Tsunade dropped down with a bark. She sat on the ground just like a dog, even having her tongue hang out and wagging her butt as if it was a tail.<br>\r\n<br>\r\nNaruto then tugged at the leash attached to the collar and told Tsunade, \"Come on, it's time for your walk!\"<br>\r\n<br>\r\n\"Woof!\" Tsunade said before following Naruto out the door.<br>\r\n<br>\r\nNaruto was amazed at how well the commands he had given her earlier worked! Here he was walking Tsunade around the back streets of Konohagakure, which has very little activity, so it was rare that he'd be caught. Furthermore, Tsunade was acting like a dog, even peeing on a tree and leaving a poop near the tree when she did eventually have to go.<br>\r\n<br>\r\nNaruto continued to walk Tsunade, her looking back at him and barking on occasion, before he suddenly had an idea. Pulling on the leash, indicating Tsunade to stop, Naruto said, \"Okay, we're going in--\"</span></div></div>",
            "created":1363150800,
            "id":1549215,
            "title":"From Hokage to Dog"
        },
        "113132":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Sakura",
                "Shizune"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>whose house?</span></div></span></div>",
            "created":1363150800,
            "id":1549236,
            "title":"Another Girl's House (Tsunade remains a dog)"
        },
        "1131321":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Sakura",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Sakura?</span></div></span></div>",
            "created":1424149200,
            "id":1936084,
            "title":"Sakura"
        },
        "11313211":{
            "author_id":"augumon11",
            "author_name":"Chaos",
            "choices":[
                "Get revenge",
                "Make like Tsunade, but a cat"
            ],
            "content":"<div class=\"\"><div> <span>Sakura opens the door and Naruto quickly sticks a card behind her ear before she realizes what's happening.  She gets the glazed look that Naruto had come to love and he says,\" invite me in.\"  \"Yes master.\" She replies. They go to the middle of her house and Naruto imagines what he could do to her.</span></div></div>",
            "created":1434690000,
            "id":1994985,
            "title":"Sakura"
        },
        "1133":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Yes",
                "No, he brought Hinata",
                "No, he brought Sakura"
            ],
            "content":"<div class=\"\"><div> <span>Throughout the day, Tsunade felt as if she was forgetting something. It felt as though it was very important, but what was it? She had checked with Shizune, and all of her paperwork was in order. There were no important appointments she had forgotten. <br>\r\n<br>\r\nBut then what was it?<br>\r\n<br>\r\nThe answer came at 9:30pm. Just as she was finishing the paper work...<br>\r\n<br>\r\n\"Naruto! I have to go to Naruto's apartment and strip naked!\"<br>\r\n<br>\r\nThis did not seem odd to her. It did not seem shameful or fill her with embarrassment. <br>\r\n<br>\r\nIt took her only a minute to get to Naruto's apartment, and though the apartment was unlocked, he was no where to be found. <br>\r\n<br>\r\n\"Oh well, I should probably strip for when he comes back,\" she said.<br>\r\n<br>\r\nShe stripped, and waited. Soon, Naruto did return, but did he come back alone?</span></div></div>",
            "created":1423890000,
            "id":1933876,
            "title":"Tsunade's POV leading to the evening..."
        },
        "11331":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "Have Tsunade change personalities, or act as an animal?",
                "Skip to the more sexy options?",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Naruto walked into his apartment after a long day of using the cards to mess around with people. Some strangers, some he knew, but he was saving the real fun for right now.<br>\r\n<br>\r\nAs he entered, he saw Tsunade kneeling in the middle of the room, completely naked, and looking up at him.<br>\r\n<br>\r\n\"Welcome home, Master Naruto. I am ready to serve.\" Tsunade said, a dullness in her voice that showed a faint trance was overtaking her, despite the fact that she was technically not fully under the power of the cards.<br>\r\n<br>\r\n\"Well! This is better than I expected! I gotta say, you look great without your clothes on Granny!\" Naruto snickered. <br>\r\n<br>\r\n\"Alright, let's see how this works. Stand up!\" Naruto ordered. As the words left his mouth Tsunade immediately shot up to her feet.<br>\r\n<br>\r\n\"Yes master!\" she replied, almost instinctively.<br>\r\n<br>\r\n\"Jump up and down\"<br>\r\n<br>\r\n\"Yes master!\" <br>\r\n<br>\r\nTsunade began to hop in place, her ample breasts bouncing freely as she continued. Naruto stared at them as they moved, concerned he may get put into a trance himself for a moment.<br>\r\n<br>\r\n\"Alright. Stop. And now er...\" Naruto said, as he pondered his next move. <br>\r\n<br>\r\nBut what IS his next move?</span></div></div>",
            "created":1535349180,
            "id":2539469,
            "title":"Yes"
        },
        "113313":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "Tsunade as Naruto",
                "Tsunade's impromptu make-out session",
                "Tsunade, Naruto's naked maid",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Perhaps Naruto does one of these?<br>\r\n<br>\r\nOption 1: Tsunade is made to wear Naruto's clothes and pretend she is a clone of Naruto who took over Tsunade's body.<br>\r\n<br>\r\nOption 2: The door is knocked upon, so Naruto has Tsunade engage whoever is at the door in a deep kiss.<br>\r\n<br>\r\nOption 3: Naruto makes Tsunade clean the apartment, making sure Naruto pays attention to her tits and ass.</span></div></div>",
            "created":1535366580,
            "id":2539528,
            "title":"Something else."
        },
        "11332":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "\"...your feelings about being naked and being clothed will be switched.\"",
                "\"...you will be my loyal slave, obeying my every command.\"",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Tsunade turned toward the door to Naruto's apartment when she heard it open. She was happy to see Naruto had returned, but also noticed Hinata Hyuga walking in behind him. She could make out a card resting on her ear and a blank stare on the girl's face, but Tsunade didn't pay it much mind. <br>\r\n<br>\r\nInstead she walked over and knelt in front of Naruto, not bothering to cover her exposed breasts and vagina. She then said, \"How may this humble slave serve you, Master Naruto?\"<br>\r\n<br>\r\nNaruto was surprised at first, but after remembering the orders he gave her, calmly said, \"Go to the kitchen and make some dinner for the three of us. Wear the short apron while you do it.\"<br>\r\n<br>\r\n\"As you wish,\" Tsunade said as she went to the kitchen.<br>\r\n<br>\r\nAs soon as Tsunade was out of sight, Naruto led the hypnotized Hinata to the chair and said, \"Hinata, strip naked and sit down.\"<br>\r\n<br>\r\n\"Yes, Master,\" was all Hinata said blandly before complying with Naruto's orders.<br>\r\n<br>\r\nAfter drinking in Hinata's naked form, Naruto then leaned over, poured chakra into her card and said, \"Hinata, from now on...\" </span></div></div>",
            "created":1424322000,
            "id":1937068,
            "title":"No, he brought Hinata"
        },
        "113323":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "Girlfriend",
                "Apprentice of a Slave",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Naruto convince Hinata?<br>\r\n<br>\r\n1: She was now Naruto's girlfriend, who loved being naked in private and wearing sexy clothes in public<br>\r\n<br>\r\n2: She was Tsunade's apprentice, learning how to be a slave</span></div></span></div>",
            "created":1424840400,
            "id":1939863,
            "title":"Something else"
        },
        "1133231":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Tomorrow's slave search",
                "Continue tonight's date"
            ],
            "content":"<div class=\"\"><div> <span>\"Hinata, you are now my girlfriend.\" Naruto said<br>\r\n<br>\r\n\"Yes, master. I am your girlfriend.\" Hinata responded, in a monotone voice<br>\r\n<br>\r\n\"When it's just us, or us and those I have made my slaves, you will strip naked. If you are in public you will ware sexy clothes.\"<br>\r\n<br>\r\n\"Alone, naked...Public, sexy.\"<br>\r\n<br>\r\n\"You won't feel embarrassed to show off that fantastic body of yours anymore. Oh, and before I forget you'll do whatever I tell you to.\"<br>\r\n<br>\r\n\"Yes...won't feel embarrassed...fantastic body...whatever you tell me to.\"<br>\r\n<br>\r\n\"Excellent.\" Naruto grinned as he took the card from Hinata. She blinked a few times as the life returned to her eyes. She looked up at Naruto and a smile spread across her face.<br>\r\n<br>\r\n\"Hi, Naru!\" Hinata said happily as she stood up. She wrapped her arms around him and kissed him deeply. When she look back at her clothes she scoffed \"Are those my clothes? How embarrassing, why wouldn't I show off this great bod I have?\"<br>\r\n<br>\r\n\"I think you look good In whatever you wear.\" Naruto said, trying to be cool. Hinata giggled and kissed him again.<br>\r\n<br>\r\nTsunade walked in the room again, only wearing a small apron, just a little away from showing a nipple or her pussy. \"Master, our dinner is ready.\" She said dutifully<br>\r\n<br>\r\n\"Excellent slave. Come on, Hinata lets eat.\" Naruto said<br>\r\n<br>\r\n\"Ok, I hope your eating more than just ramen every night.\" Hinata said still holding on to him.<br>\r\n<br>\r\n\"Don't worry Mistress Hinata. I've made sure to prioritize nutrition in my master's meal.\" Tsunade said<br>\r\n<br>\r\n\"Good! Then lets eat.\" Hinata replied with a smile on her face.<br>\r\n<br>\r\nIn the kitchen Naruto and Hinata ate on separate ends of the table, while Tsunade ate on a counter.<br>\r\n<br>\r\n\"You know, you should get more slaves like Tsunade.\" Hinata said \"They would help out around your house more often than she could, and it would let me show off more of my amazing body.\"<br>\r\n<br>\r\n\"I think you've got a point. I'll look into it tomorrow.\" Naruto said. They continued to have a nice dinner.</span></div></div>",
            "created":1454821200,
            "id":2101140,
            "title":"Girlfriend"
        },
        "11332311":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Ino",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>The next day Naruto and Hinata were sitting on a tree watching the streets of Konoha. Hinata was wearing short shorts, and a tight purple t-shirt with a diving v-neck. She was happy to show off more of her body, but not so pleased that they were hiding it in a tree.<br>\r\n<br>\r\n\"So who do you want to have for your next slave Naruto?\" Hinata asked leaning on him, internally hoping he would look down her shirt. <br>\r\n<br>\r\n\"We'll see who comes walking down the street first.\" Naruto replied wrapping his arm around her. <br>\r\nIt wasn't long until ----- came down the street and Naruto managed to throw a card right on her ear.</span></div></div>",
            "created":1455058080,
            "id":2102050,
            "title":"Tomorrow's slave search"
        },
        "1133233":{
            "author_id":"greenicedragon",
            "author_name":"G-Dragon",
            "choices":[
                "Diaper love slave",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Naruto convince Hinata?<br>\r\n<br>\r\n1. Have Hinata strip naked and put a diaper on her and Naruto give her orders to be his lover slave and that she have to use the diaper.</span></div></span></div>",
            "created":1424840400,
            "id":1939945,
            "title":"Something else"
        },
        "12":{
            "author_id":"lichlord08",
            "author_name":"Lichlord08",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Sakura alone?</span></div></span></div>",
            "created":1402290000,
            "id":1809756,
            "title":"Go see Sakura."
        },
        "122":{
            "author_id":"uglmag",
            "author_name":".",
            "choices":[
                "Control one",
                "Control all of them at once"
            ],
            "content":"<div class=\"\"><div> <span>Naruto relaxed for a moment, not only to enjoy the pleasurable feeling in his groin But also so that he could come up with some new plot. Naruto loved pranks But he was also a horny teenager and he wanted to combine HIS two passions in some way. \"Tsunade when I remove the card you will feel a strong urge to change into a slutty school girl outfit. Once that is done you will carry Me to Sakuras house, drop me of then buy every type of fetish clothing and sex toy you manage to find. If anyone recognises you you will reply: (Even a hokage has needs.) and Flash you ass at them.<br>\r\n<br>\r\nNaruto got dressed and removed the card from Tsunade's ear. She immediatly turned back to normal.         \"(What the hell is this weird taste in my mouth? Tsunade thought. Her face looked bothered for a second before she realised What was missing. \" Dont go anywhere ill be right back\" Tsunade said while running out the door. After just a couple of minutes she returned wearing a white blouse several sizes to small and a short red skirt that showed of her thong when she bent over. Her hair was set up in pigtails. \"Sorry about that, I just felt like trying a new look all of a sudden. Anyway I need you to follow me over to Sakuras house. I have some important.... business to take care of,\" Tsunade said blushing AS she thought of all the shopping she  ow urged to do. Tsunade picked up naruto and jumped out the window. Jumping from roof to roof flashing several bystanderst walking down on the streets. Naruto was pressed against Tsunades gigantic boobs and enjoyed the heck out of IT.  \"Dont Get any ideas gaki\" Tsunade said steernly. Naruto loved how contradicting her outfit and personalety was now. <br>\r\n<br>\r\nThey finnaly arrived at Sakura's house and Tsunade left naruto but could be seen turning around and lifting up her skirt at a complete stranger not to long after. Naruto looked in the window to find Sakura, Tenten, and Ino all having a pajamas party together. Naruto got a hard on thinking of all the fun stuff he could do with them.</span></div></div>",
            "created":1483546500,
            "id":2259005,
            "title":"No"
        },
        "1221":{
            "author_id":"uglmag",
            "author_name":".",
            "choices":[
                "Make her do something sexy",
                "Make her do something humiliating",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Naruto knocked on sakura's door, hiding a card behind His back. Sakura opened the door wondering who IT could be. She was immediatly disappointed when she saw that it was just Naruto. \"What do you want and why are you wearing that stupid hat.\" Naruto just smiled and said: \"you should probably look up.\" But as Sakura did it was already to late. A shadow clone had thrown a card at her from on top of the roof. Sakura's eyes glazed over and she was ready for Naruto's commands. <br>\r\n\"Sakura, from now on you will do whatever i tell you to,\" Naruto said while fishing a small earpiece out of his pocket and placing it in Sakura's ear. She had been a big bitch to him her entire life and now he was finally going to get revenge. \"You will do whatever I tell you to do  thinking its your own idea,\" Naruto said while grabbing and feeling up Sakura's ass. \"Now when i remove the card you will forget all about me coming here and return to the other girls.<br>\r\n<br>\r\nHow will naruto get his revenge on Sakura?<br>\r\n</span></div></div>",
            "created":1483562580,
            "id":2259094,
            "title":"Controling Sakura"
        },
        "12212":{
            "author_id":"uglmag",
            "author_name":".",
            "choices":[
                "Control the other girls ",
                "More sakura revenge"
            ],
            "content":"<div class=\"\"><div> <span>Sakura opened  the door but couldn't find the person that knocked. Sakura figured it was probably just a prank and went back inside. She walked back through the hall way, only taking a small detour to her bedroom before entering the living-room where the two other girls were waiting for her.<br>\r\n\"Who knocked\" Tenten asked. \"Well it was probaBLYYY! hrmph sorry about that, it was probably just a prank or something,\" Sakura said blushing at her slip up. The other girls looked at each other with  questioning expressions  but decided to just ignore it. <br>\r\n<br>\r\nThey all sat down infront of the TV. Sakura squirmed  in her seat, her hands fidgeting in between her thighs. Ino switched channels until she settled on a cooking show. Sakura loved cooking and was enjoying the show when she suddenly decided to grab the remote and change the channel. \"Really sorry guys, my favorite show IIIIIS! airing now\" Sakura said one hand using the remote the other holding her crotch like she really had to pee. Thatssss ok, i guess? Ino said as Sakura stopped at a lesbian porn movie. Ino just  glared at Sakura giving her a (wtf) type of glare, while Tenten was red as a tomato watching the dirty scenes on the screen. \"Sakura are you feeling okay, is there something wrong?\" Ino asked. \" NeveEE r been better OOOUUU Why  do you A A AAAAAAAASK!!! Mmhhhh Yeaaa oooomph!!!\" Sakura Moaned as she orgasmed hard from the vibrator she had in her pussy. It was such a smart idea to use that at a pajamasparty, she almost couldn't believe a bimbo whore like herself thought it up. She really had to find the remote for it though, it seemed to change from one to ten at the worst possible times.<br>\r\n<br>\r\nHiding elsewhere, Naruto was laughing himself silly at Sakura's predicament. He watched as his latest command made her start gushing out about her masturbation routines. He wondered how he could possibly top this.  </span></div></div>",
            "created":1483569480,
            "id":2259156,
            "title":"brilliant ideas"
        },
        "1222":{
            "author_id":"jackjtfi",
            "author_name":"J",
            "choices":[
                "Tsunade joins Ino and Sakura",
                "\"Suck my dick.\"",
                "Back to Naruto's apartment with slaves"
            ],
            "content":"<div class=\"\"><div> <span>Holding three cards in his hand, Naruto created a shadow clone, giving him a card to control Tenten. As Tenten got up to go to the restroom, the shadow clone surprised her by putting the card behind hr ear.<br>\r\nTenten's eyes glazed over, and she and the clone walked back to Tsunade, Naruto sneaking into Sakura's home.<br>\r\nSeeing the girls unaware, Naruto threw the cards, and they landed on Sakura's and Ino's ears.<br>\r\nBoth girls eyes glazed over, and Naruto shut the door behind him.<br>\r\n\"Sakura, Ino, stand at attention.\" Naruto ordered.<br>\r\n\"Yes, master.\" Sakura said in a monotone.<br>\r\n\"Yes, master.\" Ino said, her eyes glazed over.<br>\r\nNaruto smirked. Now what?</span></div></div>",
            "created":1535772240,
            "id":2541336,
            "title":"Control Ino and Sakura"
        },
        "13":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "Target only Hinata",
                "Hinata and Tsunade",
                "Hinata, Tsunade and Sakura",
                "Hinata, Tsunade, Sakura, Ino and Tenten",
                "Sexy women at Naruto's beck and call!!"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, time to go see how I can make Hinata act!\" Naruto thought to himself. He then paused and thought, \"Wait, I have all these cards; why can't I let Tsunade join in the fun? She was so fun as a cat; I bet I can play some more with her!\"<br>\r\n<br>\r\nShe then thought about other potential targets. \"I can use these cards on Sakura as well! It'd be the perfect revenge for how she treated me when I was young. I could also use this to get Ino and Tenten as well. Oh, I can also have the adult women join us as well! Oh, so much sexy fun!!...but would that be going too far, though?\"</span></div></div>",
            "created":1372395600,
            "id":1619420,
            "title":"Go see Hinata."
        },
        "131":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "In the Hyuga Compound, in her room",
                "At Naruto's apartment",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Deciding it'd be best to target only Hinata, Naruto sped toward the Hyuga Compound, making sure to be as stealthy as possible. Finding Hinata just outside on her way in, he looked around to see if anyone was around. Finding himself all alone with Hinata, Naruto dropped down and quickly stuck a card between her ears. Seeing that Hinata was standing completely still, Naruto asked, \"Hinata, can you hear me?\"<br>\r\n<br>\r\n\"Yes, Master,\" came Hinata's emotionless response.<br>\r\n<br>\r\nFilled with glee, Naruto thought of all the possibilities he could do with Hinata. He first wondered where he should go to play with Hinata, though.</span></div></div>",
            "created":1372395600,
            "id":1619432,
            "title":"Target only Hinata"
        },
        "1312":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Sexy Time",
                "A Game",
                "A Sexy Game"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Follow me.\" Naruto commanded. Hinata replied submissively \"Yes master.\" a few minutes later and they were at Naruto's apartment. \"Now Hinata, its time for...\"</span></div></span></div>",
            "created":1423976400,
            "id":1934651,
            "title":"At Naruto's apartment"
        },
        "13123":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "\"...dance for me!\"",
                "\"...tell me what you think of me.\"",
                "\"...suck my dick.\""
            ],
            "content":"<div class=\"\"><div> <span>\"...a little game.\"<br>\r\n<br>\r\nHe sat down on his bed, thinking the game over in his head. Hinata stood steady in front of him, her eyes glazed, her cheeks a little flushed. She looked like she was asleep, the way she was. Asleep and dreaming.<br>\r\n<br>\r\n\"The game is really simple, Hinata. When I remove the card, you'll wake up, but you won't think it's weird that you're in my apartment. You're gonna be really, really gullible when you wake up, though. Everything I say is going to make sense, okay? Everything I say is right.\"<br>\r\n<br>\r\nHe removed the card. <br>\r\n<br>\r\nHinata blinked rapidly. It wasn't wrong for her to be in Naruto's apartment, it was normal.<br>\r\n<br>\r\n\"Hey, Hinata, how are you feeling?\"<br>\r\n<br>\r\n\"O-Oh, um, f-fine, N-Naruto...\"<br>\r\n<br>\r\nShe felt herself blush. It felt right to be in his apartment, it felt right to be talking to him, but what was she here for again?<br>\r\n<br>\r\n\"N-Naruto...w-what was I...?\" <br>\r\n<br>\r\nShe couldn't stop her hands from raising up in front of her.<br>\r\n<br>\r\n\"We were playing a game, remember?\"<br>\r\n<br>\r\n\"A g-game?\"<br>\r\n<br>\r\n\"Yeah, it's really fun. The rules are really simple. All you have to do is do whatever I say, and if you do it right, you don't have to take your clothes off.\"<br>\r\n<br>\r\n\"My clothes?\" she cried.<br>\r\n<br>\r\n\"But Hinata, you agreed to this game! Don't you remember?\"<br>\r\n<br>\r\nShe did remember, she had agreed.<br>\r\n<br>\r\n\"O-Okay...\"<br>\r\n<br>\r\n\"Great! Now, first, you need to...\"</span></div></div>",
            "created":1424062800,
            "id":1935402,
            "title":"A Sexy Game"
        },
        "131231":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Put the card back on her head",
                "Continue the game"
            ],
            "content":"<div class=\"\"><div> <span>\"D-dance?\" The now bra and pantie clad Hinata asked slightly shocked. \"Yes,\" Naruto replied cooly \"But First I need you to be completely naked. \"W-What!? But-but-\" Naruto Interrupted Hinata \"You agreed to what ever I told you to.\" \"O-okay..\" Hinata responded weakly. She slowly bend over and took off her panties, reveling a small virgin and shaved vagina. 'Wow' Naruto thought 'Its like something out of the pervy sage's book.' Hinata, who was so red she made tomatoes green with envy, then brought her hands up to her rather concealing bra. She took it off and it seemed as though they grew a cup size right there. 'Six paths shit!' Naruto thought as he stared upon her bountiful breast 'How did she hide those so well?' Hinata somehow bent the laws of reality and got even redder. she then began her dance. at first it was just her doing a few slow steps, until Naruto said \"No no no, make your dance sexy! Liven it up a little bit. I want to really see that body of yours move.\" \"S-Sexy!?\" Hinata replied caught off guard by his request. Regardless she followed his instructions and her dance became sensual. she passionately swung her body back and forth, her breast swaying beautifully side to side, her pussy rubbing between her legs, and her ass swaying to and fro. Naruto's dick almost exploded right there. \"Stop\" He commanded much to Hinata's relief. She was so red that it fell of the color spectrum and she seemed to not be blushing at all. She was panting with exhaustion though. \"Now Hinata, it is time for...</span></div></div>",
            "created":1424149200,
            "id":1935859,
            "title":"\"...dance for me!\""
        },
        "1312311":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "change her personality",
                "more options"
            ],
            "content":"<div class=\"\"><div> <span>\"It's time for a new game.\" Naruto said smirking as he pulled out a card and placed on her head and channelled chakra into it, Hinata's reverted into a blank dazed look, her pearl pupilless eye's glassed over and stared at him with a lack of intelligence, awaiting his command.<br>\r\n<br>\r\nNaruto grinned as devious idea's raced through his head about what he should do the Huuyga heiress.<br>\r\n<br>\r\nwhat should he do to  her next</span></div></div>",
            "created":1535313480,
            "id":2539176,
            "title":"Put the card back on her head"
        },
        "1313":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "The Hokage Tower",
                "A Training Feild",
                "readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else?</span></div></span></div>",
            "created":1439182800,
            "id":2019581,
            "title":"Somewhere else"
        },
        "13133":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "his appartment (again)",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just making more options.</span></div></span></div>",
            "created":1466092620,
            "id":2165166,
            "title":"readers choice"
        },
        "132":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "Tsunade finds Hinata in the Hot Springs",
                "Naruto finds Hinata at Ichiraku Ramen",
                "Naruto and Tsunade find Hinata with a friend (Reader's Choice on who)"
            ],
            "content":"<div class=\"\"><div> <span>Naruto grinned as he secretly slipped a card back on Tsunade's ear. In an instant, her eyes glazed over, leaving her mind open to Naruto's suggestions. He then reached up and poured chakra into the card, forcing her to obey Naruto's command, even if the card is removed.<br>\r\n<br>\r\n\"You will remember living your life as my slave, happily doing whatever I ask of you. You will now believe everything I say is the truth and will address me as Lord Hokage when we are alone, yet will never notice,\" was all Naruto said before he removed the card, bringing life back into Tsunade's eyes.<br>\r\n<br>\r\n\"Ugh...what happened? Did you do something to me, Lord Hokage?\" Tsunade asked, proving the card worked again. <br>\r\n<br>\r\n\"No, I didn't do anything,\" Naruto casually said. \"You were just about to let me rub your naked tits when you blanked out.\"<br>\r\n<br>\r\nTsunade looked confused for a while, but then started removing her shirt as she said, \"You're right. I'm sorry, Lord Hokage; I guess my mind's somewhere else.\" As soon as she finished the sentence, she removed the shirt, revealing that she didn't wear a bra over her massive breasts. \"Please be gentle, Lord Hokage; they're very sensitive.\"<br>\r\n<br>\r\nNaruto eagerly took Tsunade's boobs and started rubbing them, causing Tsunade to moan at the contact. He then said, \"You know, there is another reason you wanted me down here.\"<br>\r\n<br>\r\n\"There is?\" Tsunade asked between moans.<br>\r\n<br>\r\n\"Yeah; you wanted to help me capture Hinata and make her my slave. You wanted to have a sister slave.\"<br>\r\n<br>\r\nTsunade immediately \"remembered\" her asking to be a part of Naruto's enslavement of Hinata. She had wanted to serve Naruto alongside someone else, and thought Hinata was the perfect candidate.<br>\r\n<br>\r\n\"Oh...of course, Lord Hokage...\" Tsunade moaned out as her breathing got heavier.<br>\r\n<br>\r\nNaruto then remove his hands and said, \"We can finish if you want, but only when we've captured Hinata.\"<br>\r\n<br>\r\nAlthough disappointed at the loss of contact, Tsunade smiled and said, \"Very well, Lord Hokage.\" She then slipped her shirt on and said, \"Where should we start?\"<br>\r\n<br>\r\n\"Well, first, make a Shadow Clone to take your place as Hokage so no one gets suspicious when you aren't there.\"<br>\r\n<br>\r\n\"Yes, Lord Hokage,\" Tsunade said as she created the clone. When the clone left, Naruto whispered into Tsunade's ear, \"Okay, here's what you need to do.\"</span></div></div>",
            "created":1422334800,
            "id":1923992,
            "title":"Hinata and Tsunade"
        },
        "1323":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Sakura",
                "Ino",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well who is it reader?</span></div></span></div>",
            "created":1424149200,
            "id":1935862,
            "title":"Naruto and Tsunade find Hinata with a friend (R..."
        },
        "13233":{
            "author_id":"greenicedragon",
            "author_name":"G-Dragon",
            "choices":[
                "Tenten",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was Tenten with Hinata?</span></div></span></div>",
            "created":1424149200,
            "id":1936048,
            "title":"Other"
        },
        "132331":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "Cosplayer Hinata and Nymphomaniac Tenten",
                "Nudist Hinata  and Crossdresser Tenten",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>Naruto eventually found Hinata walking toward the shopping district with Tenten. He grinned, then approached the two girls with a henged Tsunade behind him. She had made herself look much younger, around 8 or 9, and had put a regular playing card on her ear, as per Naruto's instructions.<br>\r\n<br>\r\n\"Hey, Hinata; hey, Tenten!\" Naruto called out, causing the two girls to turn his way. While Tenten waved at him, Hinata blushed and sank into Tenten's shadow.<br>\r\n<br>\r\n\"Hi, Naruto! Who's your friend, and what's with the wacky hat?\" Tenten asked.<br>\r\n<br>\r\n\"Hey, that's rude!\" Tsunade yelled. \"That hat makes him look classy, and besides, it was my Daddy's!\"<br>\r\n<br>\r\n\"I'm sorry,\" Hinata said on Tenten's behalf. She then asked, \"Um, N...Naruto, why are you...\"<br>\r\n<br>\r\n\"I got stuck with babysitting her today, and she insisted I wear this hat,\" Naruto lied.<br>\r\n<br>\r\n\"Hey, you two wanna play a game?\" Tsunade asked.<br>\r\n<br>\r\nFeeling guilty about making the girl feel bad before, Tenten said, \"Sure.\"<br>\r\n<br>\r\n\"Great!\" Tsunade cheerfully said. She gave Hinata and Tenten a card and said, \"Place the cards on your ear without looking at the face!\"<br>\r\n<br>\r\n\"Why?\" Hinata politely asked. <br>\r\n<br>\r\n\"I've heard you can hear what card it is if you put it on your ear,\" Tsunade lied.<br>\r\n<br>\r\nTenten and Hinata shrugged before putting the cards on their ears. As soon as they were in place, the girls' eyes grew glassy and they stood still. Naruto approached them and asked, \"Hinata, Tenten, can you hear me?\"<br>\r\n<br>\r\n\"Yes, Naruto-sama, we hear and obey,\" both girls answered in monotoned unison.<br>\r\n<br>\r\n\"Yes! It worked!!\" Naruto cheered.<br>\r\n<br>\r\n\"I'm so happy for you, Lord Hokage!\" Tsunade said as she hugged Naruto.<br>\r\n<br>\r\nNaruto grinned, then said, \"Hinata, Tenten, follow us to my apartment.\"<br>\r\n<br>\r\n\"Yes, Naruto-sama,\" Hinata and Tenten blankly said as they jumped on the rooftops until they stood in the living room of Naruto's apartment. <br>\r\n<br>\r\nTsunade then dropped her little girl disguise and asked, \"What are we going to do now, Lord Hokage?\"<br>\r\n<br>\r\n\"Just watch,\" Naruto said as he channeled his chakra in the cards in Hinata and Tenten's ears. \"Hinata and Tenten, from now on, you will obey me without question and believe everything I say.\"<br>\r\n<br>\r\n\"...yes, Naruto-sama...\"<br>\r\n<br>\r\nNaruto then thought about individual quirks he wanted to give Hinata and Tenten. In the end, he settled on...<br>\r\n<br>\r\n1: Hinata becomes obsessed with cosplay and is more outgoing while Tenten is always trying to have sex with the others.<br>\r\n<br>\r\n2: Hinata doesn't like to wear any clothes when she's around Naruto, Tenten and Tsunade while Tenten prefers to wear men's clothes while in their presence.</span></div></div>",
            "created":1425099600,
            "id":1941390,
            "title":"Hinata and Tenten join the fold"
        },
        "1323311":{
            "author_id":"amitlion1",
            "author_name":"Yeaaaa",
            "choices":[
                "Wake up Tenten",
                "Go check on hinata"
            ],
            "content":"<div class=\"\"><div> <span>Naruto wakes up Hinata who is confused as to what she is wearing (her casual attire) she immediately starts running to her house, only a single thought in her mind \" I have to dress up and please my master... I have to dress up and please my master... I have...\" Knowing that the only thing Hinata can think about is pleasing him makes Naruto's member stand up in arousel. He knows exactly what he wants to do...</span></div></div>",
            "created":1565115540,
            "id":2698109,
            "title":"Cosplayer Hinata and Tenten the slut"
        },
        "13233112":{
            "author_id":"amitlion1",
            "author_name":"Yeaaaa",
            "choices":[
                "Cosplay of nami (one piece)",
                "Cosplay of Yuki (gurran laggan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Naruto decides to go see his little cosplay slave. He runs As fast as possible towards Hinata's house. He rings the bell only for the door to be open by Hinata wearing a</span></div></span></div>",
            "created":1565115900,
            "id":2698110,
            "title":"Go check on hinata"
        },
        "1323312":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "\"...have sex with me!\"",
                "\"...wash me in the shower!\"",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Naruto grinned as he said, \"Hinata, from now on, whenever you are around me, Tsunade and Tenten, you will feel the most comfortable while you are naked, not feeling ashamed that your naked body is on display. You will never make an effort to conceal your body around us and will be completely open with your feelings and thoughts around us. Finally, you must always address my as your love and you will believe you, Tenten and Tsunade have always been my loyal slaves. Understand?\"<br>\r\n<br>\r\n\"...yes, my love...\"<br>\r\n<br>\r\nNaruto then focused on Tenten and said, \"Tenten, from now on, whenever you are around me, Tsunade and Hinata, you will feel the most comfortable while you are wearing men's clothes. You will not feel embarrassed to be crossdressing, and will attempt to move as much like a man as possible while still acting like a girl. Finally, you must always address me as your master and you will believe you, Hinata and Tsunade have always been my loyal slaves. Understand?\"<br>\r\n<br>\r\n\"...yes, Master...\"<br>\r\n<br>\r\nSatisfied, Naruto removed the cards, bringing life back to Hinata and Tenten's eyes. Hinata immediately started removing her clothes as she said, \"Hello, My Love; I'm sorry I didn't strip earlier.\"<br>\r\n<br>\r\n\"That's fine,\" Naruto said as he drank in the sight of Hinata's strip show. As soon as she was completely naked, Naruto accidentally blurted out, \"Holy crap; your boobs are so big!!\"<br>\r\n<br>\r\nHinata blushed, struck a seductive pose and said, \"I'm glad you like them, my love.\"<br>\r\n<br>\r\n\"Sorry I'm late, Master!\" Tenten said as she emerged from Naruto's room, now wearing Naruto's boxers and one of his spare T-shirts. She had also let her hair down out of her buns. \"I had to get into the right clothes.\"<br>\r\n<br>\r\n\"No harm done,\" Naruto said, laughing inside at how ridiculous Tenten looked. He then said, \"Now, Tsunade, strip down to your underwear and make us dinner.\"<br>\r\n<br>\r\n\"At once, Lord Hokage,\" Tsunade said as she began stripping on her way to the kitchen.<br>\r\n<br>\r\n\"Tenten, why don't you clean up the living room and dining room, then help Tsunade if you get done before her?\"<br>\r\n<br>\r\n\"Of course, Master,\" Tenten said, immediately getting to work with a masculine stride and casually scratching her left breast.<br>\r\n<br>\r\nHe then turned to Hinata and said, \"Well, Hinata; it's time.\"<br>\r\n<br>\r\n\"Time for what, my Love?\"<br>\r\n<br>\r\n\"You forgot? Today's your day to...\"</span></div></div>",
            "created":1425099600,
            "id":1941603,
            "title":"Nudist Hinata  and Crossdresser Tenten"
        },
        "13233123":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Dance For My Pleasure",
                "Suck My Dick"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>...Well day for what reader? Jeez I hate it when they arn't specific about their choices.</span></div></span></div>",
            "created":1425099600,
            "id":1941604,
            "title":"Something else"
        },
        "1323313":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "human pets",
                "bikini maids"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well then how about Hinata becomes his loyal cat and Tenten his courages dog. or maybe he makes them his bikini maids doing whatever he tells them to while exposed like that.</span></div></span></div>",
            "created":1425877200,
            "id":1946239,
            "title":"Other choices"
        },
        "13233132":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "Bikini maids",
                "Two girlfriends for Naruto",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did he go with his bikini maid idea, or did he make them his girlfriends, who don't mind sharing him with each other and even making out with each other if Naruto is too busy?</span></div></span></div>",
            "created":1483667520,
            "id":2259681,
            "title":"bikini maids"
        },
        "14":{
            "author_id":"lichlord08",
            "author_name":"Lichlord08",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Ino alone?</span></div></span></div>",
            "created":1383195600,
            "id":1686642,
            "title":"Go see Ino."
        },
        "141":{
            "author_id":"garunix",
            "author_name":"Ethan Shane",
            "choices":[
                "Have Ino do some housework, naked",
                "Go back to Tsunade and have fun"
            ],
            "content":"<div class=\"\"><div> <span>Naruto left the Hokage tower in search of another girl to bring under his power. \"Hey, Naruto!\" Naruto turned to see Ino running towards him. \"Hey, Ino, what's up?\" Naruto asked, preparing a card. \"I just wanted to talk.\" Ino said, trying not to look at Naruto's strange hat. \"Ok, let's talk.\" He replied, putting a card behind her left ear. \"Follow me.\" \"Yes, Master.\" Ino replied, her eyes as blank as Tsunade's. Naruto and Ino walked to Naruto's apartment, in order to have privacy. Naruto, deciding to get to the fun part, added chakra to the card, leaving Ino's eyes devoid of life. \"Ino, from now on, you are my personal servant, you will cook, clean, and do anything I ask, no matter what, do you understand?\" \"Yes, personal servant, do anything you ask.\" Ino repeated, in a monotone voice. Naruto removed the card, and almost instantly, Ino's eyes filled with devotion and admiration. \"What is it you wish, Master?\" Ino asked, submissively. Now, Naruto froze, what did he want?</span></div></div>",
            "created":1384146000,
            "id":1692934,
            "title":"Yes"
        },
        "1412":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "something sexy",
                "something fun",
                "grant himself ridiculus legal power"
            ],
            "content":"<div class=\"\"><div> <span>\"Well I'm going to get Tsunade for 'personal matters'. When I come back I expect this place to be completely clean, understood?\" Naruto said feeling powerful. \"Yes master.\" Ino replied submissively blushing a bit. Naruto then speed toward Tsunade's office deviously making plans for what he was going to do once he arrived. he would...</span></div></div>",
            "created":1426914000,
            "id":1951692,
            "title":"Go back to Tsunade and have fun"
        },
        "142":{
            "author_id":"uglmag",
            "author_name":".",
            "choices":[
                "Someone shows up",
                "Leave ",
                "Stay"
            ],
            "content":"<div class=\"\"><div> <span>Naruto left Tsunade and started to walk around town. He wanted to find out more about the strange hypnotic cards. After a while he passed The flower shop that Ino worked in. Ino was a smart girl ( if not a bit bitchy at times) so Naruto figured that she could probably help him.<br>\r\n<br>\r\nEntering the flower shop, Naruto was met with the sight of several long green plants hanging from the roof and walls as well as on the tables and shelves making  it look more like a botanic garden then a shop. In the middle of it all was Ino dusting of a big Greek statue of a naked muscular man.<br>\r\n<br>\r\n\"Hey\" Naruto said the minute he opened the door. Ino, having been working the entire day, was annoyed beyond belief at the sound of that kid Naruto's voice.<br>\r\n<br>\r\n\"Whats up with all the green in here?\" Naruto said not noticing the uninviting look Ino was giving him.<br>\r\n<br>\r\n\"Mom made me buy all these plants just because she thought they matched this stupid statue she won in a lottery.\" Ino said now using a piece of cloth to polish the right arm of the statue.<br>\r\n<br>\r\nI think it looks pretty cool. I was just cleaning the hokage tower and you won't believe what I found.\" Naruto said as he searched his pockets for a card.<br>\r\n<br>\r\nIno let out an aggressive sigh and turned back to Naruto. \"Look, im not intrested in you or your stupid cards! You're being a pest and a bother and I have to finish cleaning.\"  Ino said as she turned back to the statue and dusted it's muscular chest.<br>\r\n-                                                                                                                                                              -<br>\r\n\" Don't be like that it's something really cool I promise.\" Naruto said feeling hurt from Ino's harsh words.<br>\r\nIno decided to just ignore him and focus on cleaning. She moved to it's  lower half and washed the belt area that seemed especially dirty.<br>\r\nNaruto walked over to a chair and sat down to Ino's continued annoyance.<br>\r\n<br>\r\n\"I found these cards and hoped you could help me figure out how they worked.\"<br>\r\n<br>\r\n\"Mhm really interesting,\" Ino said. She couldn't for the life of her get the statue's hrmph, \"thing\" clean and dropped the piece of cloth, instead spitting in her hand and trying to rub the dirty spots of it.<br>\r\n<br>\r\n\"First I thought that it was some random old deck, but then I noticed this note that....\"<br>\r\n<br>\r\n\" Does this this story have a point,\" Ino cut Naruto of still concentrating on cleaning, now using both hands to stroke the man's sausage.<br>\r\n<br>\r\n\" Well it turns out that the cards have hypnotic powers that can control people through chacra.\"<br>\r\n<br>\r\n\" Thwate twe \"slurp\" stupidest thing iv'e  \"lick\" ever heard,\" Ino said after licking the shaft of the giant statue and turning to Naruto giving him a \" are you retarded\" type of look. For then to continue washing the statue with her mouth.<br>\r\n<br>\r\n\"It's true,\" Naruto said defensively.<br>\r\n<br>\r\n\"Shwuwh ihf ihs,\" Ino muffeled out trying to deep through the dick clean.<br>\r\n<br>\r\n\" What if I told you Iv'e already used them on you.\" <br>\r\n<br>\r\n\" Thwaawph rephic \"slurp\" Thats ridiculous!\" Ino said as she let go of the man's length and started to climb on top of the statue.<br>\r\n<br>\r\n\"Just think about it, isn't what your doing now weird.\"<br>\r\n<br>\r\nDon't think so, no, Ino said getting bored of the conversation. She removed her panties from underneath her skirt and placed them over her head like a mask. <br>\r\n<br>\r\n\" Tell me, what exactly are you doing now\" Naruto asked, one hand down his pants without Ino seeming to care.<br>\r\n<br>\r\n\"I'm about to clean this statues phallus using my pussy. Something that would be alot easier without you talking,\" Ino said she positioned herself in a crouching position over the cook, legs spread giving Naruto a  great  view of her shaven cunt. <br>\r\n<br>\r\n\" And you sure you want to do that?\"<br>\r\n<br>\r\n\"YEEES!!!!\" Ino screamed as she lowered herself on to the penis and started to ride it like a horse.<br>\r\n<br>\r\n\"Then i suppose you are right\" Naruto said laughing.<br>\r\n</span></div></div>",
            "created":1486943400,
            "id":2276803,
            "title":"Ino, Naruto, and the statue."
        },
        "1422":{
            "author_id":"uglmag",
            "author_name":".",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 4"
            ],
            "content":"<div class=\"\"><div> <span>After Ino's third ride on the statue, Naruto finally got tired of watching the blond pleasure herself on the oversized piece of furniture. He left the store, leaving Ino bouncing frantically, and decided to look for something (or someone) that could help him with the situation in his pants that he was having a \"hard\" time dealing with.<br>\r\n<br>\r\nHe tried to find his long time crush Sakura, and have her fulfill all his life time dreams. He found Sakura out on the training grounds, busy training with Anko and Kurenai. Naruto quickly made several shadow clones and hid them around the three kunoichi. <br>\r\n<br>\r\n\"Thank you for training with me today, Kurenai sensei, Anko sensei. I usually only get to train with Kakashi and Naruto, and they can be such pigs sometimes.\"<br>\r\n\" It's our pleasure Sakura. We all need some girl time once in a while.\" Kurenai said just as Naruto walked over to them grinning from ear to ear.<br>\r\n<br>\r\n\"Hi girls. I was just passing by and couldn't help but notice tha....\"<br>\r\n\"Scram gaki!\" Anko threatened, not even bothering to hear what Naruto was going to say.<br>\r\n\" Sorry but this training session is only for Sakura. You can't join us,\" Kurenai said giving an apologetic smile.<br>\r\n\"Is it because you know I would have beaten all of you in whatever activity you choose?\" Naruto replied trying to bait a reaction.<br>\r\nSakura just shook her head looking at him in a mix of disappointment and annoyance. \"#1 No you wouldn't 2# Can you just leave already.\"<br>\r\n<br>\r\nAnko was about to throw Naruto out by force so that they could finally get some piece when...</span></div></div>",
            "created":1489623600,
            "id":2290304,
            "title":"Leave"
        },
        "15":{
            "author_id":"c856935",
            "author_name":"Chaos",
            "choices":[
                "Tenten.",
                "Temari.",
                "Anko.",
                "Hanabi.",
                "More GIrls."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Girl.</span></div></span></div>",
            "created":1338094800,
            "id":1345978,
            "title":"Find another girl."
        },
        "155":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Ayame",
                "Shizune",
                "another girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about Shizune or Ayame(that's the Ramen shop girl, in case some of you don't know who that is)?</span></div></span></div>",
            "created":1338094800,
            "id":1346557,
            "title":"More GIrls."
        },
        "1553":{
            "author_id":"c856935",
            "author_name":"Chaos",
            "choices":[
                "kurenai",
                "other girls."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Kurenai</span></div></span></div>",
            "created":1338181200,
            "id":1347060,
            "title":"another girl"
        }
    },
    "info":{
        "author_id":"c856935",
        "author_name":"Chaos",
        "brief_description":"Naruto finds the Mad Hatter's(Batman) hat and Mind control cards.",
        "created":1338071220,
        "description":"<td align=\"left\" class=\"norm\">This is one of my idea's that are keeping me from working on my other storys.<br>\r\n<br>\r\nThis story takes place before Sasuke retrival but Tsunade is Hokage.<br>\r\n<br>\r\nNaruto, while being punished for a prank finds a trunk. In the trunk he finds a hat with Mad Hatter writen in it and sevearl cards.<br>\r\nRules.<br>\r\nNaruto must wear the Hat(<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://2.bp.blogspot.com/-xmD6sPfUs-A/ThpKnIwMMdI/AAAAAAAAAEM/037ReYHDgLI/s1600/hatter2.jpg\" target=\"_blank\">http://2.bp.blogspot.com/-xmD6sPfUs-A/ThpKnIwMMdI/AAAAAAAAAEM/037ReYHDgLI/s1600/...</a>)<br>\r\nAdding chakra to the cards will cause them to make comands permanet until they are put back on.<br>\r\nNo Yaoi.<br>\r\nNo Futa.<br>\r\n<br>\r\nHave Fun.</td>",
        "id":1870018,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1565115900,
        "modified":1565115900,
        "pretty_title":"Naruto the Mad Hatter"
    }
}