{
    "chapters":{
        "1":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Tell him \"yes\" and tell him about the stone",
                "Tell him \"no\"",
                "Just tell him \"yes\"",
                "Tell him nothing and possess him",
                "Another story arc"
            ],
            "content":"<div class=\"\"><div> <span>          Summer days. A time of joy for many, a time for adventure for some. A time of exploration for the likes of Phillip Martens. Suburban, typical yet braver than most. <br>\r\n<br>\r\n          \"You okay down there!?\" Phillip screamed, careful not to lost focus on his footing. Age old dust fell from his fingers which hit his friend's face from down below.<br>\r\n<br>\r\n          \"Of course I'm okay, I'm not a baby.\" Mark screamed back to the kid above.<br>\r\n<br>\r\n          The two boys found a small oddly shaped cavern entrance just this afternoon. Both boys was seeking adventure and it came right in front of their doorstep.<br>\r\n<br>\r\n          \"You know, we could clean the area below. It could make a good hideout.\" Mark said. He was itching to clean the place up and unleash his indoor architecture prowess. \"I could bring the old sofa from the junkyard.\"<br>\r\n<br>\r\n          \"We could do that, after we find what's above this cavern.\" <br>\r\n<br>\r\n          San Valentino, California was a settlement of Native Americans back in the day. No one knew who these people are as they left sparse evidences of their existence. Only due to the Spanish journals did their existence was backed up and Archaeologist swarmed the town. Kind of like the Californian Gold Rush in the days, but this time, ancient history.<br>\r\n<br>\r\n          \"Damn! This cliff is too high. My hands are already aching.\" Mark complained. Unlike Phillip, Mark received no training on cliff climbing. Climbing on school fences, that's a skill he dare not miss. \"What do you think would we find up there?\"<br>\r\n<br>\r\n          \"Treasure, The old Americans or dead bodies. Probably dust.\"<br>\r\n<br>\r\n          Once they reached above, Phillip was awestrucked in the sight in front of him. Mark mirrored the act when he too reached the caverns above. \"Guess we found all four\" Mark remarked.<br>\r\n<br>\r\n          In front of them lay bare heaps of golden coins, ever glowing in the light filtering through the caver holes. There were weapons, aged with rust and guns, old ones, incapable of being used again. Beside the heap of treasure lay bodies, strewn all about. From the looks of it, several bodies died with spears stabbed into their chests. One was stabbed into the skull which made it split in half.<br>\r\n<br>\r\n          \"We're fucking rich!\" Mark shouted. \"Filthy fucking rich!\" He was jumping in joy, already thinking of the things he could buy. Phillip on the other hand, was skeptical. One more look he realized what was wrong with the bodies.<br>\r\n<br>\r\n          \"Look over there.\" Phillip pointed. \"What is different about that guy?\"<br>\r\n<br>\r\n          Mark thought for a second and realized what Phillip was pertaining to. \"He is the farthest and he died without a spear killing him. Also, he is standing on a stone plate. So booby traps?\"<br>\r\n<br>\r\n          Phillip hadn't seen the plate before but that is one evidence added to the problem. With many of the tomb raider films he's seen, no one has done this simple solution. \"Grab a few rocks.\" Phillip ordered. <br>\r\n<br>\r\n          Phillip threw one and darts hit the skeleton for the second time in hundreds of years. He threw one again, then again and again until no more darts dispensed. Phillip smirked from the knowledge he learned from playing Minecraft.<br>\r\n<br>\r\n          With the following plates, they have done the same, picking the rocks they have thrown prior. On the way, Mark was busy filling his pockets with gold coins and sparkling jewel.<br>\r\n<br>\r\n          On the end of the cavern laid a jewel on the middle. Unlike the others, this one was strange. No light was hitting it yet it glows eerily. White the brown then green then red and back to white again. Strange science is going here that not even Mark can comprehend. <br>\r\n<br>\r\n          Phillip walked towards the large gem and found it smaller than what he seen in the distance. Its generated light makes it sparkle and glitter with every angle he viewed it upon. The temptation was strong and he went to touch it. No traps activated but the dark, ever so consuming and dying to eat him.<br>\r\n<br>\r\n<br>\r\n          Sometimes, waking up feels worse than letting yourself slip again in bed. This isn't such time for Phillip. He woke up with a groan and a heavy feeling on the chest. He was in a different place yet somehow familiar. Nevertheless, he stood up and walk to whatever direction his feet moved.<br>\r\n<br>\r\n          The forest around him was filled with life. but if one could see clearly, the creatures have dead eyes and dead souls. Although, they chatter and shriek like real animals, something was off about them. Phillip could not care less than ignore them and walk to nowhere in particular.<br>\r\n<br>\r\n          Soon, he found himself in a clearing with a white specter in the middle. The being was floating mid-air and bobbing in and out. It was white as snow and from a distance, it looks like a blot of perspective. \"Outsider, for a thousand years I have waiter and finally my time is up.\" It's voiced boomed in the surrounding, making nearby critters scurrying away.<br>\r\n<br>\r\n          \"I don't understand.\" Phillip said \"Wh- Where am I?\"<br>\r\n<br>\r\n          \"Outsider, don't bother asking for you shall be out in a moment. Probably, you'll never go to this place again. My time is long but my patience is short. I will tell you the essentials and I'll be on my way.\" He moved near Phillip and as he do, a more human shape emerged. It was wearing an eagle feather hat and maroon Indian clothes. The specter's face is filled with scars, with the longest running down from forehead to chin. \"The gems of power were sought by many for their powers. This gem is one of many. I was once the keeper of the gem and I have guarded it both here and the physical realm. But like all things, they have an end. The gem will give you powers, powerful ones. It is up to you whether you use it for your own or for others.\" He stopped in his tracks and began to ascend upwards. \"My time is up. Beware the talons of the eagle.\"<br>\r\n<br>\r\n          Before Phillip could ask more questions, the forest around him collapsed into nothingness but dark. But in the dark he learned. The powers he received, hot to use it and how to share it. In his visions, he saw many other gems, differing in colors, differing in powers. Many did sought after the gems, most ended in vain like the Spaniards who came before. <br>\r\n<br>\r\n          Once again, he found himself waking up in the arms of his best friend. The look on his face was a reassuring worry. Phillip just smiled back at his best friend. \"Dude, you blacked out for like 10 seconds. What happened?\"<br>\r\n<br>\r\n          \"I must have hit my head or something.\" A cheesy quote he once read said that withholding information is smarter than sharing one. But knowing Mark, he'll know soon enough or maybe never. \"Let's get out of here.\" They packed their treasure filled bags and went to the truck. They planned on going back here soon to shovel the rest of the treasure and find someone willing to buy all this gold. Finding that someone should be easy enough.<br>\r\n<br>\r\n          San Valentino is large and it took them one and a half hour to go back to the Marten household. As usual, Gene is nitpicking his things on the garage, he never seemed to learn after nearly blowing up the house. Inside, everyone just finished eating and Mrs. Valentino is groaning how she does all of the work. Once she saw Phillip and Mark, her face changed into a hospitable one. \"Do you want to eat boys? We got glazed pork.\" She said. Growing up from a poor family, she had had years of experience in cooking. Even with her delicious dish, both boys declined. <br>\r\n<br>\r\n          Reserved in Phillip's room, they let out a tired groan. Carrying gold isn't easy as they seem. Leaving them out in the truck would be unwise. \"I'll be going back home. I'll contact some of my err. contacts if they are willing to buy gold.\" Despite being tired, he still has the happy expression in his face. Well, who wouldn't be happy if you suddenly found tonnes of gold. \"Anyway, let's hang out tomorrow before we go back to the cave. What do you say?</span></div></div>",
            "created":1369458000,
            "id":1596458,
            "title":"A fresh start"
        },
        "11":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "[Neutral Path] Possess poeple around the hospital",
                "[Neutral Path] Possess people outside of the hospital",
                "[Neutral Path] Wait for Mark's sister and possess her",
                "[Good Path] Possess Ricky",
                "[Evil Path] Take Mark unawares and possess him"
            ],
            "content":"<div class=\"\"><div> <span>          \"Okay, I'll come but back in the cave, I saw something. And it's greedy of me if I hid it from you.\" From the start, Phillip told everything and anything worth of mentioning. Silence was Mark response while Phillip was telling his story. Though absurd and unbelievable, Mark has a feeling that all of it was right. Phillip never told weird stories before and why now? Still, Mark was still skeptical. \"You didn't take shrooms didn't you?\" He motioned closer to Phillip but his demeanor didn't changed. Stern, unmoved and serious.<br>\r\n<br>\r\n<div align=\"right\">[Mark will remember that]</div><br>\r\n<br>\r\n          \"It's true. I also know how to give you powers. Touch it.\" The gem was changing colors every second. Shimmering at every angle Mark viewed it upon. He expected a joke when he touched it but he was soon proved false. The experience was indescribable, only that he felt surreal and out of this world. Knowledge from the past until now, corrugated in his mind. How to use the power and the responsibilities it hold. All of it.<br>\r\n<br>\r\n          \"Do you believe me now?\" Phillip asked, his stern face replaced with ecstasy.<br>\r\n<br>\r\n          Mark was still blown at the experience. The person in front of him, is now the guardian of the stone and he was lucky enough to get a share of its powers.\"Hide it.\" Mark said. Despite his carefree attitude, he knew the gravity of holding such artifact. \"Keep it close but hide it out of sight.\" There was no hesitation, Phillip grabbed his handkerchief and wrapped the stone. \"I'll find a place.\"<br>\r\n<br>\r\n          Before leaving, they said their goodbyes and exchanged a handshake that only they know. It was fun hanging out with Mark. He's always happy and brings out the color of things.<br>\r\n<br>\r\n          They spent the rest of the day at their respective houses. Both agreed to meet the next day and enjoy their new powers. Yet deep inside, they know the situation they entered and the dangers behind. People would sacrifice anything to get a hand of one of these stones. Through the visions, they saw how relentless the Spaniards on finding the stones. But they are dead a long time ago. Right? Both boys reassured themselves with that question.<br>\r\n<br>\r\n          Tomorrow morning was any other summer day, no alarms and unlimited time in bed. But with their experience yesterday, they knew this day is the start of something different. Phillip went downstairs, eyes drowsy and energy deficit. His siblings already gobbled up breakfast except for one egg and bread. So he ate it up and cleaned himself afterwards.<br>\r\n<br>\r\n          Suddenly, his phone rang to the tune of \"Paint it Black\". It was Mark and he is apologizing for not coming today. He forgot that it was his turn to look after Ricky, his 12 year old comatose brother. A year has passed since the incident but the pain never left them. \"I'll go there with you.\" Phillip replied.<br>\r\n<br>\r\n          The hospital wasn't very far, you only need to cross the river and you're there. The problem is, the bridge connecting both sides of the river is very far away. So Phillip took the bus. It took him 30 minutes to reach the bridge and another to reschedule he hospital. The trip left him exhausted. His body was never made for exhausting trips.<br>\r\n<br>\r\n          \"Could I get directions for Ricky Damien?\" Phillip said to a fat nurse. She looks demeaning especially with an SJW pink hair cut.<br>\r\n<br>\r\n          \"Relation to the patient?\" She said. Her voice kind of reminds Phillip of the slug old lady in Monster Incorporated.<br>\r\n<br>\r\n          \"A friend.\" Phillip replied.<br>\r\n<br>\r\n          \"Room 5-B, go straight to my right and take a left turn. Next.\"<br>\r\n<br>\r\n          The room that held Ricky was surprisingly large and better equipped than most rooms of the hospital. Inside, Ricky is still unconscious with life support tubes connected to his whole body. The whole situation made the lively boy weak and helpless. Phillip could still remember Mrs. Damien crying a lot. Beside Ricky was a female nurse with a nice rack. She was taking notes and turning some of the knobs.<br>\r\n<br>\r\n          \"Where's Mark?\" Phillip asked. Something about the nurse gives him uneasiness. Maybe it was the hospital smell, maybe not.<br>\r\n<br>\r\n          \"Ah. He went to the bathroom Phillip. He'll be coming back in a minute.\" It was that second sentence that blew the whole thing off.<br>\r\n<br>\r\n          \"How do you know my name?\" She moved towards Phillip but Phillip managed to back off until the wall met his back. She held his arms against his will and lowered his mouth to his ear.<br>\r\n<br>\r\n          \"I'm fucking with you.\" She creased a chuckle. \"It's me, Damien. Fooling you is fucking hard.\" Suddenly, an arm appeared out of the nurse's chest and another arm followed. One by one, Mark appeared out of the woman until he is fully out. The nurse on the other hand, was unconscious but soon regained composure. \"What happened?\"<br>\r\n<br>\r\n          \"You hit yourself. Here.\" Mark helped the nurse on her way out of the room.<br>\r\n<br>\r\n          \"So the thing yesterday was real.\" Phillip said. The whole morning, he thought that the gem was one weird dream. Seeing Damien using the full extent of the gem's powers proved otherwise. \"So have you possessed anybody?\"<br>\r\n<br>\r\n          \"So far, only the nurse and my sister. Masturbating in her body was a thrill I could not describe. Still miss my duck though.\" He sat on the seat next to Ricky and laid his head on the bed. \"You?\"<br>\r\n<br>\r\n          \"Not yet. I don't know who I'll possess though.\"<br>\r\n<br>\r\n          \"Well there are people around and my sister is coming here in an hour. But can I ask you one thing?\" His face lit up, only a shade of embarrassment dwindled it down.<br>\r\n<br>\r\n          \"What's that?\"<br>\r\n<br>\r\n          \"I'm not asking you to do it right away but can you possess Ricky? It's been so long since I heard him talk. I'm already forgetting what his voice sounds like. Can you do it?\"</span></div></div>",
            "created":1491627600,
            "id":2301621,
            "title":"Tell him \"yes\" and tell him about the s..."
        },
        "114":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "[Neutral Path] Possess someone",
                "[Neutral Path] Possess someone and exchange the gold",
                "[Neutral Path] Possess someone and go back to the cave."
            ],
            "content":"<div class=\"\"><div> <span>          \"Sure I'll do it.\" Mark's face lit up more and overjoyed to the fact that he'll hear his brother once more. It's been so long that it felt ages since he talked.<br>\r\n<br>\r\n          A mix of emotion is in Phillip's mind. On one hand, he is happy that he'll give his best friend some break in this sad times. On the other, he felt fear that this will go horribly wrong. Mark tested it to live humans and it worked fine but on hams in comatose, the odds are covered.<br>\r\n<br>\r\n          He lied next to Ricky, he could feel the tony breaths the machine is making him do. It preserves him from death but at the same time, it's pitiful to see that a machine does the breathing for you.<br>\r\n<br>\r\n          His hands passed through the chest; it felt warm and tingly, like when you are taking a long piss. He reached further until his whole arm was inside. The whole sensation right now feels warm and tight but Phillip kept pushing further. He pushed and pushed until he head were left. The sensations were at its climax, he felt warmer than ever and the pressure surrounding his body. His head lied down slowly and his whole world stirred black. Over the distance, he could hear the chorus of his phone's ring tone.<br>\r\n<br>\r\n<br>\r\n          Wide lights greeted him. The world of the living welcomed him back despite living in another vessel. In the light, a splotch of brown was crying a river, sobbing to the rhythm of his heart. \"Ri- Ricky?\" the figure asked. He sobbed harder, wiping only seconds later.<br>\r\n<br>\r\n          \"Mark?\" Phillip felt weak, the machines connected to him weighs a burden to him. Raising his hand to meet with Mark's face was a cumbersome burden of its own. Mark's face felt warmer than his own, his tears adding to the emotional warmth both are feeling. \"So what do I do now?\" Ricky's voice is parsed, lips chapping off with every word.<br>\r\n<br>\r\n          \"Let's just talk. Even for a minute.\"<br>\r\n<br>\r\n          And they did. Mark knew that the person in front of him is not Ricky and never will be. But this poor imitation is enough for the pain the accident has left him. They talked about life, family and their general interests. Phillip was kind enough to play as Ricky for the hour. He knew Ricky enough to get a point on how he acts and talk. But the hour struck the clock and time was over.<br>\r\n<br>\r\n          \"Sorry to interrupt but,\" Phillip bit his lip, a trait which Ricky does between interjections. \"Can I go now? I feel tired.\"<br>\r\n<br>\r\n          \"I know you are not Ricky but can you you say 'I love you' one last time? Even if you don't mean it.\"<br>\r\n<br>\r\n          \"I love you brother.\" Phillip's heartbeat skipped a beat.<br>\r\n<br>\r\n          \"I love you too.\" He kissed Ricky on the forehead and waved him good bye.<br>\r\n<br>\r\n          Possessing an unconscious body would be an, unwise choice. The gem only instructed to possess living bodies and straying beyond that can lead to undesirable effects. Phillip being a methodical child, does not want that.<br>\r\n<br>\r\n          \"It's ok,\" Mark piped. \"So we'll hang out later. Let's just wait for my sister.\"<br>\r\n<br>\r\n          It did not take an hour before someone came. Instead of Clarissa, Mrs. Damien came. The crash of seeing her son in a vegetative state wrecked her body. The once Ms. Valentino 1987 was now a gray old woman, deep eye bags forming under her eyes. From the looks of it, she recently cried. \"Your sister feels lightheaded so I came instead.\" She pushed her groceries on one side and proceeded to kiss Ricky's cheeks. \"Go on. Have fun with Phillip today.\"<br>\r\n<br>\r\n<br>\r\n          The sun was high up in the sky yet it does not feel too hot. Leftover spring clouds blocks the sun and somehow, they are giving a gentle cool breeze. From the entrance of the hospital, Phillip could already see the mob of people at the plaza. Marcus Keller is heavy on his campaign right now, mostly when the Halley's behind their backs.<br>\r\n<br>\r\n          \"Fuck them.\" Mark muttered.<br>\r\n<br>\r\n          Nevertheless, they still went to the campaign. Several people, including some people they know, are keen on making Keller win. Even with the people behind their backs, their platform was directed to the public. \"Legalization of Marijuana\". Mark however, was unmoved.<br>\r\n<br>\r\n          \"Here have some flier.\" A familiar voice said. It was James Keller, the mayoral candidate's son. The campaign period did heavy on him. The once lively boy who participated in each class is now pale and coughing occasionally. \"Vote for my days.\" he said. He did not even stop and chat down for a while, instead, he moved to the next person and said the same thing. \"Here have some flier, vote for my dad.\" Mark's steaming face turned to confusion then to pity.<br>\r\n<br>\r\n          \"Pity him. His dad and that brat.\" Mark said pointing to Terry Halley. That boy was an annoying bastard; flaunting his money to whomever he sees. Seeing him above the stage with a smug look, boils back Mark's blood. \"I hate him!\" he steamed.<br>\r\n<br>\r\n          The next thing they did was go to Shelly's and grab a trice-cream. Sun was already peeking through the clouds and the summer heat was once in power. Shelly's is the life saver in the park during these times.<br>\r\n<br>\r\n          \"Hello boy. Usual?\" Shelly said in her cheerful attitude.<br>\r\n<br>\r\n          \"Usual. \" both boys said in chorus.<br>\r\n<br>\r\n          \"So what do we do now?\" Mark asked. \"Being the guardian, it's your choice.\"<br>\r\n<br>\r\n          Phillip pondered for a moment. The sun was nice and people were around. He could test his powers right now. It's kind of embarrassing that Mark got a head start of using the stone's powers. Still, he can possess someone and right that. The only problem is that, there too many people around. It'll be a commotion when someone sees him possessing someone.<br>\r\n<br>\r\n          Other than testing the powers, they can stroll around town. See what the other areas brings. From the rumors and a quick search of Google, he learned that there would be a music festival downtown. Many people from around the state would be there. Possessing bodies over there would be easy. Nobody will notice with the noise and commotion around.<br>\r\n<br>\r\n          From the talks, he almost forgot. The treasure. \"Where did you put the treasure?\" Phillip asked. Mark hid the treasure while he hid the stone. Only him and Mark knew his special hiding place.<br>\r\n<br>\r\n          \"On my car, over there.\" He pointed at the 2nd hand Honda Civic standing at the lone parking lot. \"Mom found my weed stash the day before. Can't hide my the treasure there.\"<br>\r\n<br>\r\n          Exchanging them at the gold exchange or the museum would be problematic when they do it themselves. People would find that they are suddenly rich and will find that questionable. They need to ask someone intimidating but obscure to sell their gold. He should also be trustable that he would kit double cross them and run with the money. But why ask when you can possess someone?<br>\r\n<br>\r\n          Or they could possess someone with a big truck and go back to the cave.</span></div></div>",
            "created":1491627600,
            "id":2301622,
            "title":"[Good Path] Possess Ricky"
        },
        "12":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Stay in the house and possess someone.",
                "Go in the neighborhood.",
                "Go somewhere besides the neighborhood",
                "Slob off and wait for tomorrow"
            ],
            "content":"<div class=\"\"><div> <span>          \"Nah, I can't hang out tomorrow but I'm free to grab more gold in the afternoon. I have lots to do.\" In truth, Phillip does not have anything to do. He does not have a job nor even a summer school. He spends most of his summer like the year before and before after that, being a lazy slob and stuck in a sleep eating cycle. The stone glimmered in his pockets, he hoped that Mark did not see that.<br>\r\n<br>\r\n          \"Ok. I understand. So I'll see you tomorrow then.\" He waved goodbye and went on his way to his home. Mark was a good friend and he better stay that way. Several movies points that greed can change people. Phillip hopes that these gold would not ruin their friendship. And speaking of gold, he guessed that he should also help in buying a buyer for the next few hours. Searching in the internet suggests sending the gold to anonymous people. They don't show their credibility in the description so Phillip crossed them out. Hours of searching and the best route to sell this treasure are these two options. Phillip hadn't known that the Halley's are mad with collecting ancient artifacts. They'd be willing to share millions of dollars just to collect ancient jewels and coins. The other possible buyer is the local museum. They pay small but they ensure credible business. These options should be chosen tomorrow with Mark.<br>\r\n<br>\r\n          The sun is still high up the sky but the shades of orange and red are peeking in the horizon. Seagulls are flying overhead so the chance of storm is low. Phillip brought out the magic stone and with the free time he have, he inspected it further. If one could look closely, small runes appear in and out of the surface. Like a touchscreen display, every flick pushes those runes. The stone was also shining brightly even in the day. Phillip grabbed a wooden box that once house his wristwatch and hid the stone inside. The visions told him of people who would do anything just to grab one of this stones. The Spanish Inquisition, the Crusades even World War 1 and 2 are perpetrated by this stones. <br>\r\n<br>\r\n          The clock struck 5:30 PM and by the looks of it, it is still early for sleeping. Phillip could do anything right now. His newfound powers adds more choices to the list. One thing he could do is just stay in the house. With the stone, he could possess one of his family members and see their life. How amazing can that be? And before he forgot, the Owens are coming over this very night. They're bringing presents from Ecuador is what Phillip's mother said last week. Besides staying here, the neighborhood is also a fun place to possess someone. Cousins on the left and long time neighbors on the right. They are easy to find and when the time comes, it's easy to come back. Outside the neighborhood lies the city. It's big and wide, easy to get lost hard to find a place. The city is alive with people and with the summer overhead, many tourists are coming over to see the lake. Other than those is staying here and be a slob like always.</span></div></div>",
            "created":1491627600,
            "id":2301658,
            "title":"Tell him \"no\""
        },
        "121":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Mom",
                "Kyla",
                "Lyra"
            ],
            "content":"<div class=\"\"><div> <span>    Phillip decides to stay inside to test the stone, who knows what could happen if he leaves the house with it, at least in his house he has some kind of control. \"Hmmm but who to test it on....Probably someone more influential so I can get away with not being here for the Owens visit\" Phillip says to himself before noticing that one of his family members was getting closer to him.<br>\r\n<br>\r\n    \"Uh, Phillip honey, can I talk to you for a second in the dining room please?\" his mom asked him as he sat on the couch still wondering what to do, \"yeah mom be right there\" he said while the gears in his brain began to turn.<br>\r\n<br>\r\n    \"I wonder if being mom would be cool, she would also have a lot of control over the family.....then again, mom's pretty old and that would be weird being my own mom...\" Phillip said to himself quietly so he didn't attract any unwanted attention. \"I'll bring the stone with me to the dining room just in case\" he said cautiously as he took the stone from the box and put it in his pocket.<br>\r\n<br>\r\n    He walked into the kitchen, which was next to the dining room, for a quick snack like an apple or something when he noticed his older brother and sister arguing over some cookies that were fresh outta the oven, \"Come on Kyle just one please!\" Lyra said as Kyle made sure to keep the still piping hot tray from his greedy twin. \"Not until mom says so, now go back to your chores I can smell your laundry from here\" Kyle rebuttal's   <br>\r\n<br>\r\n    \"Mom always takes forever though, let me just have one and I'll go back to my chores!\" Lyra continues as she grabs the tray from Kyle who had oven mits on unlike her, \"OwoWo, damn that hurt!\" \"see this is what happens when you touch a tray that has literal steam coming off of it, not get back to work\". Lyra looked ready to argue again but in the dining room their mother said, \"Lyra! Get back to work now! Your break is over\" Lyra reluctantly wandered back upstairs to her room.<br>\r\n<br>\r\n    Phillip had just watched the chaos go down while eating his apple which now just had the core, he tossed it in the trash soon after, \"hmm maybe being Kyle or Lyra would be cool, Lyra and Kyle are kinda attractive and have some street cred...\" he muttered as he walks into the dining room and chooses _______ to swap with.</span></div></div>",
            "created":1588142640,
            "id":2826665,
            "title":"Stay in the house and possess someone."
        },
        "123":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "The music concert",
                "The lakeside",
                "The town Park"
            ],
            "content":"<div class=\"\"><div> <span>\"Mom, I'll go outside, see you soon, bye!\" Giving her time to talk would just make Phillip stay and welcome the Owens. Sure they are cool and all but the parents mostly talk with Phillip's parents and that leaves them with Larry. The boy is just too shy to talk to everyone. He is also weak and a huge scaredycat unlike his daredevil parents. He won't talk to us and he definitely stays away from Gene. He always brings a book and prefers to sit in the corner. Well that won't be a problem since Phillip is going to the city.<br>\r\n<br>\r\nAlthough it is hot during the daylight hours, it's a common mistake that it would be the same during the night. The cold winds from the lake combined with the northern location of the city makes the nights here as cold as Autumn. Locals on the streets learned this a long time ago. Spotting shivering people is the easiest way to find tourists, unless you're from the far north where the wind here is still warm. <br>\r\n<br>\r\nThe streets of downtown is filled with array of neon lights and the combined conversations of pedestrian. Phillip went to California once and it was just like this minus the tall buildings and the acrid smoke. Even the rude hotdog vendors are found in every corners. Phillip looked at his phone and directed it to Google Maps live. From this point in Downtown, there are three general places he can go to. The first is the live music concert of different musicians and bands. It is just a little walk from here. According to the live feed of the concerts, it has already started and a mosh pit is already starting to form. The place has free booze and free admission slip. The second place would be the lake. Just follow the river downstream until you find the side by side hot baths and saunas. This is where the tourists go during the morning but by night, they stay in nearby hotels. The last place is in the town park. Security is tight over there so people are not afraid to go at night. There are the occasional bozos who sleep and throw beer bottles at everyone but aside from that, nothing much.</span></div></div>",
            "created":1491627600,
            "id":2301666,
            "title":"Go somewhere besides the neighborhood"
        },
        "1231":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Possess one",
                "Body surf",
                "Nah, concerts bore me."
            ],
            "content":"<div class=\"\"><div> <span>          The shouts and music congregating into one can be heard over 10 blocks away. From the sound alone, the concert must be a large one, unlike the lame concerts we have during the cultural festival. The people from the neighborhood are surprisingly not bothered by the noise the festival is making. Some residents have built tents on their building roof and watched the music with binoculars. Good for them but Phillip will have the close up privilege.<br>\r\n<br>\r\n          The guard up front were large and intimidating in the distance. But up close, they are getting drowsy from the free ooze they must be drinking. One guard is singing along with the girl singer in the stage, loosely holding his dripping beer. The people around were none too bothered with beer slapping their faces.<br>\r\n<br>\r\n          From here on out, possessing someone is easy as pie. Nobody is paying attention to anybody. From the stone, he learned that unlike ghosts or demons and whatnot, he does not get invisible when he possesses someone. So there is the risk of someone finding him possessing someone. The crowd around is a perfect way to cover the possession process. That is what Phillip will do when he wants to posses someone from the crowd. But there is another way, much harder but more discreet. This is also the way if he wanted to possess someone famous, like the beauty in the stage. This process is called body hopping or body surfing? Sources from TV tropes differ. In this process, you possess someone then get close enough to someone and hop to the next. With people dancing and bumping off each other, this is no problem. He could hug someone and they won't care.<br>\r\n<br>\r\n          Phillip got close to the crowd and even if he has two left feet, he tried his best to dance like an animal. Nobody cared how he danced though, as long as he danced to the rhythm of song. Now here goes the plan.</span></div></div>",
            "created":1491627600,
            "id":2302053,
            "title":"The music concert"
        },
        "12311":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Possess someone on the left",
                "Possess someone on the right"
            ],
            "content":"<div class=\"\"><div> <span>          Phillip got further into the crowd and danced all the way through the beat. The place stank of vomit and bear combined with the odor and musk of the people. It's sickening but with time, Phillip got used to it. He got close encounters with sweaty armpits and vomit covered torsos. Lucky him, he's intangible, leaving him unharmed and the other person shivering from the sudden power invading. From here, picking someone specific is impossible. Everyone moves and dance quickly that they don't stay in one place. The only way to possess someone is randomly jump in a direction, hoping that the body he enters is good.</span></div></div>",
            "created":1491711960,
            "id":2302054,
            "title":"Possess one"
        },
        "123111":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Quickly unpossess him. [Risk getting seen]",
                "Collapse"
            ],
            "content":"<div class=\"\"><div> <span>          With a push, Phillip jumped left. He did enter someone's body and the rush of alien feelings took Phillip by a surprise. He found himself drunk and the whole world around him is a swirl of colors. But his feeling inside says otherwise. He feels rushed, active, more likely to jump until the end of the day. Phillip never had this feeling before and it was fucking great. He swayed his hips left and right, raising his hands and spilling his beer on his face. \"Whooooo! FUCK YEAH!\" Phillip screamed. His voice was definitely that of a male.<br>\r\n<br>\r\n          For the rest of the night, he danced form song to song and band to band. He never danced this good before and he fucking likes his moves. Some girls beside him took notice and began to video him dancing. Before he knew it, people gave way and he danced like crazy in the middle. Until some asshole walked inside and challenged him to a fight. \"Wanna fu- fucking fight me bitch!?\" Phillip screamed.<br>\r\n<br>\r\n          The guy walked near the edge but the kind people pushed him back to the middle. He lunged at the guy and threw a punch. His body was packed with muscles and the combined strength of each fibers sent the guy flying to the stars. He punched the guy again and again and again. Someone pulled him back and dragged him away from the joy inside the pit. \"Assholes! Fucking get off of me.\" Phillip screamed. But to no avail, they never let him back and worse enough, they threw him outside. He tried to get back but security blocked him. He tried to fight his way through but that only got him a punch and a loose teeth. \"Stupid Fuckers!\"<br>\r\n<br>\r\n          Phillip's mind was a confusion of anger and excitement. For a moment, he forgot who he was and where he was. Only that he must punch someone and make the people live him. For the first time in his life did he really feel free. Devoid of his constricting parents and prejudice of his parents. But that was gone when those asshole security pushed him away. Suddenly, bile poured into his mouth and then came the vomit. It was sweet if beer at first but butter if bile the last. The drowsy feeling of alcohol is overcoming his senses and his sight is becoming darker by the minute. It's only seconds before he'll collapse.</span></div></div>",
            "created":1491712020,
            "id":2302055,
            "title":"Possess someone on the left"
        },
        "1231112":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "The Halley's [Agree with Mark]",
                "The museum [Risk Arguing with Mark]"
            ],
            "content":"<div class=\"\"><div> <span>          The beer was too much and it clouded Phillip's decisions. He went with a thud in his own pile of vomit and slept there as people walk beside him, but caring for the unconscious guy in the street. The whole evening went by and the concert ended. Most people left as soon as the final goodbyes were said on screen but some stayed to listen at the automated rock music.<br>\r\n<br>\r\n          Come morning and Phillip, along with the other people who passed out is being g woke up one by one by the janitors. One poked Phillip with the butt of his broom and Phillip was awake, head pounding of hangover. He sluggishly moved on a nearby alley and threw up once again, this time his stomach hurt with the lack of food to vomit. Phillip saw his current dilemma and staying on this body is a shitty way to spend morning. So Phillip ditched the guy and went back to his house.<br>\r\n<br>\r\n          Somehow, the guy's hangover rubbed off of him. His head pounds like a jackhammer but weaker when he was on the guy. His throat was parched and his stomach grumbles in hunger. He has not eaten since yesterday lunch. Stores outside aren't open yet so the only source of food is home. He took a bus and went back home.<br>\r\n<br>\r\n          Inside, the Owen's Family was surely here. Their climbing gear is hunkered in the living room. Dad was sleeping of the couch again and mom was early to cook breakfast. It's stupid that Phillip proposed to buy a door chime last year and that very door chime signaled his arrival. As usual, Mom took a quick notice.<br>\r\n<br>\r\n          \"Where in the heavens above were you Phillip!? Me and your dad are worried sick. You missed your chance to greet your cousin yesterday. Well, he still is in your room and you can greet him later on. So where was I? Right. Where the heck did you go to?\" She went back to the kitchen and resumed on cooking eggs. They smell nice along with the garlic rice on the table. Ignoring her right now is the best way to defuse icky situation. She usually forgets what she was talking about and resume on other activities. Phillip gobbled up the food and actually took 3 more servings before reserving himself to bed.<br>\r\n<br>\r\n          His body was fine, not tired actually. But his mind is pooped from the information overload yesterday. Well, yesterday was the most thrill he felt in his life. He could go back there tonight and party properly this time. For the meantime, he slept for the rest of the morning.<br>\r\n<br>\r\n          Phillip woke up feeling tired but not an afternoon coffee wouldn't fix. He saw fresh Arabic Coffee in the cupboard just this morning. Probably the gifts Mom mentioned yesterday. The gift from the Owen's can be great at times but mostly worthless junk. Mom never fails to remind them to bring food, one of the many things she never forgets. Phillip looked at his phone and it seemed he missed several calls from Mark. He opened them up and saw a picture of his face, bruised on one side. \"A drug crazed asshole punched me yesterday. Our hang out is canceled. Sorry.\" His message said.<br>\r\n<br>\r\n          Phillip knew what he was talking about. Guilt flooded him like a dam releasing water. It was all a blur, everything happened so fast and the beer, it made him do things. He was such an asshole right now. But as long as he does not talk about the stone or his powers, no one will ever know what he had done. To flush out this guilt stricken occasion, he decided to take a long cold bath in this hot weather.<br>\r\n<br>\r\n          The bath was nice and long. The filth and sweat from yesterday is flushed away with the water. Come as it may, he keeps his body quite clean especially in the summer months. But somehow, acne finds a way to appear here and there. Kind of getting annoying actually. If there is just some other magical stone that would clear his alternative teen illness, that would be great.<br>\r\n<br>\r\n          After bath, he went downstairs to eat lunch with his family. Mr. Owen and Mr. Marten were talking about the alligators they found in Australia. Dad was obviously making up claims to level with uncle. Their wives however, were busy talking about boutiques nearby. Mom was too engaged in conversation while Ms. Owen was half listening. The other half would be listening to his Husband's ramblings. Their son was done eating and resigned to reading a large book at the sofa.<br>\r\n<br>\r\n          Afterwards, Phillip talked to his mom about visiting Mark. News spread quickly and they are finding the man responsible. Mom said that the concert facilitator payed for hospital bills in the condition that the news not reach out of hand. Fair enough, that's what happened to his brother too. Pay for his bills as long the news doesn't get out.<br>\r\n<br>\r\n          The trip to the hospital wouldn't be long if they just built a bridge from their area, across the river and into the Town Center. But no, last mayor said that the project was too costly. Good thing that he was kicked out of his sit and a pop election has taken place. It took Phillip two bus rides to get there. Along the way, he possessed some passing pedestrians and squeezed their junk. He was in the body of a suburban dad when he reached the hospital. With one last slap to the face, he unpossessed the guy in the bathroom. The guy was probably confused on why his face hurt. And more confused on why did he teleported in a bathroom.<br>\r\n<br>\r\n          \"Phillip. Good to see you man.\" Mark greeted as he entered his ward. It's lucky that he was put into the same room as his brother. So far, his bruise subsided a lot. \"I'm going to be discharged today.\" <br>\r\n<br>\r\n          \"What happened?\" Acting oblivious to the situation would make the suspicion point away from Phillip. Like he was being suspected at the first place. Extra precaution wouldn't hurt. \"Looks like you have one hell of a story to tell.\"<br>\r\n<br>\r\n          \"I got into a concert, some drunk assholes pushed me into a mosh pit and a drunker asshole suddenly punched me. That is the last time I'm going to a music concert.\" In the end, he managed to creased a laugh. \"Good thing is, I'm getting paid by the concert official. Add that to the gold we stashed and we're instant millionaires. Also, I forgot. I haven't found a buyer yet.\"<br>\r\n<br>\r\n          \"I did. The Halley's are gaga over our stuff. The museum also buys the gold but in a lower rate. So who do you want to sell it to?\"<br>\r\n<br>\r\n          \"As much as I hate the Halley's, I want to sell it to them. You?\"</span></div></div>",
            "created":1491712320,
            "id":2302057,
            "title":"Collapse"
        },
        "12312":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Stay in the Bodyguard's body",
                "Go for the prize"
            ],
            "content":"<div class=\"\"><div> <span>          First time possessing someone and Phillip already felt like a pro. He got close to a girl with a flowing matte of brown hair and bumped himself inside of her. The feeling was instantaneous warm darkness, like swimming in black jello. The moment he opened her eyes, he was taller with a heavy feeling on her chest. While bouncing to the rhythm, he grabbed his chest and found two big lumps of flesh. \"Boobies.\" Phillip snickered. He gave them a quick squeeze and a slight tickle. It was funny and pleasurable. He danced to the rhythm and moved towards another person. He danced near enough to make a small gap and jumped in it.<br>\r\n<br>\r\n          The next person he possessed was a lean male. Alcohol stank in his mouth and his eyes is getting blurry. But his blood tells himself another thing, he was more than alive and he needs to live up to it. He is so active and the only way to let the energy out was to drink more booze and dance better than the song. Phillip gave himself a quick squeeze to the crotch and he was surprised how wet it is. Nevertheless, he jumped to another person.<br>\r\n<br>\r\n          This one was like the guy before, active and most likely to dance her way through the whole night. She has a flat breast but a nice butt shape. A cheerleader is Phillip's guess but no matter, he gave himself one final squeeze to the butt and jumped to another person. This process of jumping from body to body continued until he at the front of the stage. And by then, he was in the body of a muscular guy wearing a backward cap. His tattoo suggests that he is from the Alpha Beta Boys Fraternity Club. Phillip knew those assholes. They were the one who trashed his bike and got blamed for it. Nobody saw the incident so what better to solve it than her mother blaming him. In a way of revenge, he punched himself in the face. It hurt so hard that it pushed him to the security beside him. He jumped form the Security's body and the pain from his face was gone. The frat boy in front of him was dazed and still searching the person who punched him.<br>\r\n<br>\r\n          In a minute, Phillip had fun pushing people off when they got beyond the limit. His dense muscles is fun to use when he shoves people away. Some stupid guy tried to punch him but Phillip's thick chest muscles prevented damage. He punched the guy back, sending him back to the crowd with the loss of a tooth. He could get used to this but there are better prize backstage.</span></div></div>",
            "created":1491712380,
            "id":2302059,
            "title":"Body surf"
        },
        "123122":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Stay in the Head Choreographer's body",
                "Go for the prize"
            ],
            "content":"<div class=\"\"><div> <span>          Staying in this Security guy's body is fun as fuck for the first few minutes. The following minutes of shoving people again and again got old fast and became a chore. He grabbed his nearby security friend and excused himself to the bathroom.<br>\r\n<br>\r\n          The backstage was cramped with people walking all about. The people around were busy doing their thing that they don't realize that someone is already possession their bodies one by one. First, a guy with a headset over his head then a girl with a frantic hair and she's carrying a ton of paper. When Phillip tried to possess someone, the girl fainted, sending a rain of paper everywhere. Good gentlemen tried to help the lady and collect the papers. Phillip too, helped with collecting the papers but for only a short notice. He slipped little by little until he was out of the gentleman's circle. From here, he could see a woman holding a coffee and gulping it down in one swish. She has a Star clip on her chest and it says, 'Head Choreographer'. \"She looks important.\" Phillip thought. He moved towards her and did his thing.<br>\r\n<br>\r\n          Multiple use of successive possession got him used to it quickly. The momentary darkness and sensory deprivation is now but a distant beginner's memory. He stood strongly with the help of caffeine and went to where the musicians are being held. On second thought, this body wasn't bad at all. She hold a great figure and the people around him seems to be afraid of her. Authority, like how Phillip likes it. But the prospect of fame and a music career tempts Phillip once again.<br>\r\n<br>\r\n          He went inside the room of the musicians and surprisingly, there were just several of them. Their names weren't known in the whole world but they're starting to make noise in the state. The signs outside tells who these musicians are and what song they play.<br>\r\n<br>\r\n          The first is Jessica, \"Just Jessica\". An eccentric name to tell and her voice and body tells the same. While not being the usual solo girl artist, she sings surprisingly well. Her body on the other hand was like the modern SJW people Phillip sees in TV. Blue hair, tattoos on the arms and earrings on one ear. She's the modern goth.<br>\r\n<br>\r\n          The other band is the Boy's Next Door. A boy band, ugh. Boy bands leaves a foul taste in Phillip's throat. Their songs might be catchy but it gets old quickly. Still, there are many girls dying to get sex with these guys and from the looks of it, they're stinking rich. That electric guitar the blonde guy was playing is one of the limited edition of Ray Acoustics. He wanted to have it but it costs $30.000. So the usual answer from his dad was no.<br>\r\n<br>\r\n          The band playing outside was calls themselves \"The Kiss Bomb\". Shitty name but they are local band players. He saw them play once in a while and from Facebook, he knows that they studied where he studied. The band is composed of 3 boys and a girl. The boys include a normal teenager which is better than Phillip in a musical sense. A grouchy young adult, a baby faced teen and a rude girl who somehow manages to flip everyone while drumming. Somehow, they remind me of some band I watched on a television.<br>\r\n<br>\r\n          The last band who hasn't retired yet to their rooms is Darien James. An African-American gifted with a voice for consecutive rap. Phillip heard him a few times in the state radio and he's spitting straight flames. He may be the one of the free people who put peaceful messages in raps rather than money, Sex power and other shit.</span></div></div>",
            "created":1491712500,
            "id":2302060,
            "title":"Go for the prize"
        },
        "1231222":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Go for Just Jessica",
                "Other Bands"
            ],
            "content":"<div class=\"\"><div> <span>          Phillip sat down on a bar stool, near enough to get a glimpse on the musicians. The first option is Just Jessica. Overflowing blonde hair, puckered lips and a Bear Pelt attire gives her the intimidating Russian look. Even her voice gives a touch of the cold Russian Tundra. On this moment, several fans are trying to get near her and ask for selfies. She was happy and cooperating but looking further, you could see how tired she is. If Phillip could just possess one fo th fans and jump into her, nobody would notice. There are the other bands still.</span></div></div>",
            "created":1491714600,
            "id":2302078,
            "title":"Go for the prize"
        },
        "12312222":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Go for Boys Next Door",
                "Other Bands"
            ],
            "content":"<div class=\"\"><div> <span>          Boy Bands gives Phillip the Heeby Jeebies. Their statuses crawl on your skin and gives the same cringe material as Emo kids. Living with his boy band crazed sister probably gave the feeling. Their fame reached far and most teenage girls would kill just to touch one of the band members. Looking in other perspective gives you a good look on them. No girls would deny when you want to have sex with them. With music concerts on the rise, sponsors will pay for your travel trips. You are always on the cover of magazines and social media. The high life so to say.<br>\r\n<br>\r\n          Phillip moved from his stool to the wall overseeing the band. All four members were practicing with the song they just played earlier. Practice makes perfect they seem. Midway through the song, the drummer asked to take a half hour rest. All other members agreed and went to their own devices. Two of the member stayed at their practice area, one went back to the band trailer and the last one confronted him. \"Mrs. Andrea. Good evening.\" the young curly haired boy said. Phillip estimates that he is just 16 -19 years old. He wears a plain black t-shirt and a dark blue jean. From the posters, this must be Anderson Lowry, the band vocalist. Phillip could possess this guy and he would become the key to the others. There are other bands still.</span></div></div>",
            "created":1491714660,
            "id":2302079,
            "title":"Other Bands"
        },
        "15":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "[Neutral Path] Possess someone",
                "[Evil Path] Possess someone and take their life forever",
                "[Neutral Path] Sleep it off",
                "[Goodl Path] Call someone and share your power"
            ],
            "content":"<div class=\"\"><div> <span>          People say that life is great big wheel. Sometime you are on top, sometimes on middle and mostly on the low. Other people see it as pyramid. The chosen elite are few and always at the top. While the many poor people scratch and scramble at the bottom, hoping for survival. Such is the life for Phillip, commonly called garbage man. Aged 18, left his family for a better life out west. Only debt after debt met him on his stay. Not even his minimum wage can seal the hole he was in.<br>\r\n<br>\r\n          \"Welcome to Burger Mansion, what's your order?\" This was the same dull response Phillip said all day, all month and probably for the next year if he was lucky. This last customer is so far better than the usual late comers. The customer took her order and Phillip tiredly fetch it.<br>\r\n<br>\r\n          Outside, the full moon was shining brightly. From the phone he was borrowing, today marks the farthest distance the moon can get. Pretty early said by some commenters. Nevertheless, Phillip doesn't care. How far the moon must be, as long as he eats and survives another day, it's fine.<br>\r\n<br>\r\n          This Friday though, the best of the garbage is thrown out. It's surprising that the local supermarket throws this much edible food. Year of living with eating trash made Phillip doubt the expiration dates. As long as it's sealed airtight, the food is fine. This night, he hauled 5 fish loaves of bread, some vegetables and a heap of processed foods. He learned to stay away from unpacked meat. Eat one and suffer a week long diarrhea.<br>\r\n<br>\r\n          Amidst the dark, a flint of light managed to attract his attention. The light was changing, hopping from one color to the next. It's like a lighthouse in the dark. Phillip shoved away the trash, too curious to see the light's source. And finally, he saw its source. A small stone, not larger than a Dime is at the bottom. Something unnatural surrounds it, even the source of its light is a mystery to him.<br>\r\n<br>\r\n          \"Touch.\" A whisper slipped into Phillip's ear. He peeked outside but the back store was desolate of life. He returned to the stone and hear the wispy voice once more \"Touch.\" And so he did.<br>\r\n<br>\r\n          The following experiences is unbelievable and out of this world. But nevertheless, every bit of it is real. Phillip was surrounded by a flash of light until he became unconscious. Phillip felt clean, he felt light and free. Like he was a child again, back at his farm house at Montana. A voice around him boomed him out of his trance. This one was different than the last. It hold deep power within the stone.<br>\r\n<br>\r\n          \"Outsider. My time is little so no question.\" Phillip sat at the non-existent floor and listened to voice. He kept his mouth shut, partially put of fear but mostly of curiosity. \"We were many once but we were conquered and we died. We guarded this stone for a centuries and now, the role of the guardian is passed to another. You. The stone will tell you its secrets and powers. It is up to the guardian to use it for their own need. Just don't let the stone be stolen by others.\"<br>\r\n<br>\r\n          Once the voice was gone, Phillip was pulled into the sky. Information about the stone, the people behind it, the people who want it flooded his mind. In one moment, he felt as of he was using the stone's powers for a very long time. Power came into his mind but for good or worse, it is up to him.<br>\r\n<br>\r\n          A moment later, he was put back into his sense. He was heavy and dirty once again. In front of him is the stone, still shimmering in the dark. He grabbed it quickly and covered it in cloth, as to prevent anyone from seeing its light. In this moment, he felt happiness. Years of torment from life, the greediness of people and assholes ruining his day can be solved by his newfound power.<br>\r\n<br>\r\n<br>\r\n          Phillip was back in his tepid apartment. It was once before the storage room but the land owner saw how he desperately need it. Small, cramped and itchy but affordable with his current salary. Privacy is an added bonus to the room. Nobody wants to bunk with him in such small room.<br>\r\n<br>\r\n          But with this stone, all of that could change. I could possess someone rich and live out his life as him/her. Or share the power and earn considerable respect. Or take the wise way of sleeping it off and wait for tomorrow. Besides, tomorrow is Saturday and it is a day off. Mark will also be bringing me to his other friends. More source of vessels. There are many choices but only one must be chosen.</span></div></div>",
            "created":1491627600,
            "id":2301624,
            "title":"Another story arc"
        },
        "151":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Top Floors",
                "Middle Floors",
                "Bottom Floors"
            ],
            "content":"<div class=\"\"><div> <span>          Montgomery Apartments or as it's aptly called by the tenants, a run down cheap ass heap of wood. It got its nuisance here and there, mostly everywhere. But hey, it's cheap and it is situated near the metropolitan area. So it's cool for the working class. Loud steps disturbed Phillip in his thoughts. The added drywall dust disturbs him further.<br>\r\n<br>\r\n          The tenants of the apartment are mostly people working near the area. The lower floors are reserved for the land lord's room and the middle class citizens. The lower floors costs much higher than the top floor. Convenience costs is what the landlord told them. Bogus robbery in broad daylight is what Phillip calls them. The middle floors are where the workers are staying. Most are store clerks and sales ladies from the supermarket. From what Phillip have seen, 8 women live inside. They sleep in 2 pairs of 4 level bunk beds. Pretty neat. One family also live in the middle floors. Both sons go to a school nearby and the father works at a car workshop a few blocks down. The top floors are where the cheapest people live, like Phillip. On his left is the Land Owner's son who works at the Lakeside Diner. He lives alone and probably will be for the rest of his life. On his right was a mystery. Phillip saw the insides of his apartment and it looks like a high class condominium. A newly wed couple lives inside and their pretty new. Upstairs are the drug addicts, never paying rent and constantly threatens the landowner's life. Finally, the landowner is one big demanding oaf. He is demanding to the poor and a big fat coward to the addicts upstairs. All tenants are puzzled why he hasn't called the police yet. Better yet, kicked them out. He's gruff and huge, albeit fat.<br>\r\n<br>\r\n          After picking one, Phillip could just knock and possess the first person to open the from. Most are kind enough to answer him since he's the computer whiz of the apartment. From then on, he has full access to the room he was in and probably spend the night in their bed. Now the only thing to do is pick one.</span></div></div>",
            "created":1491818160,
            "id":2302634,
            "title":"[Neutral Path] Possess someone"
        },
        "1512":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Room on the left",
                "Room on the right",
                "Investigate the smoking man"
            ],
            "content":"<div class=\"\"><div> <span>          The middle floor, two rooms, one on the left and one on the right. The one on the left contains the Darren Family. The father is a gentle giant, often gone in the day to work at a workshop. The mother used to work as a fashion model. 10 years of motherhood did a lot to her mind except her body. She is still overflowing with beauty that the girls next door would often gossip on how she keeps her body that way. The family has two sons, one is ten years old and the other it's probably 7 or 8. Phillip doesn't see them much as they spend most of their time in school.<br>\r\n<br>\r\n          On the right contains the eight girls who work at the local supermarket. Loud digital sounds come off their room. As if they were watching movie night. Before Phillip went to his room, he swear that he saw drunk men go inside. Probably their boyfriends. Phillip doesn't see the females inside often. Since they work from morning till late at night. He knew one woman by face. That woman always gives her an odd look on her way to work.<br>\r\n<br>\r\n          Phillip went down the stairs. On his way, he crossed with a thin man, covering his face on his way. Smoke surrounds the man and smells like one too. Phillip ignored him and went on his way.</span></div></div>",
            "created":1491818220,
            "id":2302636,
            "title":"Middle Floors"
        },
        "15121":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Stay in his body",
                "Other family members"
            ],
            "content":"<div class=\"\"><div> <span>          Phillip knocked on the cheap wood imitation door and waited for someone to open it. Something scrambled inside with some clicking. Then the younger brother screamed followed by the shush of the mother. The door opened but Phillip did not give the person a chance to see. He jumped in front and landed not into the floor but into the innards of someone. Comforting warmth surrounded him followed by a flash of darkness. A second later and he was dumped back to his reality.<br>\r\n<br>\r\n          Phillip's perspective was shifted 180 degree. Once he was looking in front and now he was looking at the scraping yellow wallpaper if the apartment. \"Who is it?\" A female voice asked. Phillip turned around to see an atmospheric home that is only ruined by toys scattered all about. The voice belong to a woman larger than him, wearing a white dress dappled with heart motifs. On her hand was a cigarette, still smoldering ashes all about.<br>\r\n<br>\r\n          \"No one.\" Phillip said in his new high pitched voice. He went closed the door and went back inside. The apartment inside was homely, a TV set with a couch in front. A large man sleeps 2/3 of the sofa space with a small boy occupying the remaining space. He sat on another smaller sofa and chilled there for a minute.<br>\r\n<br>\r\n          The family was surprisingly disgruntled. The mother is smoking and drinking, the father is a father than before and the younger brother was screaming at the TV. Nevertheless, this looks like the home he once had years ago. Maybe better than the last. This could be a life he can have for the taking, maybe fix the family of its problems. The only choice is who to possess?<br>\r\n</span></div></div>",
            "created":1491818280,
            "id":2302639,
            "title":"Room on the left"
        },
        "151211":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Continue walking",
                "Phillip digs in to what happened to Mark"
            ],
            "content":"<div class=\"\"><div> <span>          Living his life as Roy Mallard, gave Phillip a semblance of what life should have been if he did not leave Montana. Like before, this life is hard. Eating three times a day is a luxury they usually don't have. Also, studying is hard when you have incomplete books and school equipment. With his prior 4th grade knowledge, people were shocked with him passing in full colors. Roy Mallard was considered to be a hopeless kid but something over the summer changed that.<br>\r\n<br>\r\n          As for his old life, Phillip never came back. For the first weeks, he went back to his apartment to grab fee important items. Like the stone, his picture of himself, an old throwaway phone and the picture of his family in front of a barnyard. He put all of this items in his closet and sat there until this day. His old life was a bore anyways, so it is easy to leave it. No friends looked for him and only 2 months after his disappearance did people get concerned. His work went to his apartment and noticed that he was not living there. Then the landlord got notified until a formal police report was made. The news did not gain track and after a week, nobody remembered him. The room he was living in, was turned back into a janitor's closet.<br>\r\n<br>\r\n          His disappearance hit Mark, his best friend, the most. Both boys only understood each other and trusted one another. He comes back to the apartment day by day to ask the landlord for information about Phillip. Then those days, turned to weeks then to months then to years. On his final day of mourning, he looked wrecked. Wrinkles creased under his eyes, his skin is pale and cracking and he got himself a wide bush of tangled beard. He left a daffodil on the janitor's closet and left for good.<br>\r\n<br>\r\n          For Phillip, life began to gain track after high school. He passed all previous years with the highest grade and he is buff enough to join the wrestling and soccer team. But amidst the achievements and recognition, his family was spooked and suspicious. Something in the summer of '04 changed their son. Better yet, replaced him at the same time Phillip Martens went missing. They became paranoid enough that they stopped talking to him. Roy Mallard's friends however was convinced that he was still Roy. His doesn't have close friends to begin with so integrating himself in their new lives was easy.<br>\r\n<br>\r\n          After High School, he gained enough recognition, both in the academic and sports world, that most universities in the state wanted to get him. He chose San Valentino University which is close to home. Later, he moved from his tepid apartment to a lofty condominium in Town Center. Mayor Raymond Harley funded his amenities in exchange for advertising him in the upcoming elections. A year later and Mayor Raymond won the elections and Roy Mallard was crowned honorary star child of San Valentino. Men want to be him and women want to be with him. He has taken a few girlfriend over the years. Had sex with both men and mostly women.<br>\r\n<br>\r\n          As for his powers, he soon forgot them. Phillip was too preoccupied with life that he never got to use the stone for a second chance. He still kept the stone close and always at his bed side cabinet. Every so and often, he would open the box and saw the memories that housed his life from before. He would wonder what happened to them all those years that he was gone. He tried to call up the farm once, a gruff voiced answered him. He did not realize who it was but it sounded oddly familiar.<br>\r\n<br>\r\n          \"Hello?\" Phillip said. Sweat bead in his temples as every second of silence pass. Finally the voice talked, he was tired and huffing often.<br>\r\n<br>\r\n          \"Who is this?\" the voice asked.<br>\r\n<br>\r\n          \"A friend of Phillip Marten.\"<br>\r\n<br>\r\n          \"It's been 7 years. We don't talk that name no more.\" He smashed his phone so hard, that it made Phillip flinch back. So that is one loose end tied. They already forgot him a long time ago and will probably forget him for the rest. Phillip left his apartment and took a long walk around the area. As he walked, people would greet him. One girls realized that he's the guy in the Plaza Billboard. A woman by the light post gave him a discount just for one night in the bed. He declined and went on his way. On the corner sat an old hobo, carrying a slurpy cup and asking for loose change. Phillip got near and put 30 bucks inside. He lived in the streets once and he knows how hard it is.<br>\r\n<br>\r\n          \"Star child was kind enough to give this old man money. Thanks.\" His voice sounds oddly familiar but raspy with the years. He took a swig of liquor and washed it off with a laugh. \"What you looking for star child?\" Those whiskers, he never made them grow but he did. It's Mark Damien, a friend from a life time ago. What the fuck happened to him?</span></div></div>",
            "created":1491818400,
            "id":2302642,
            "title":"Stay in his body"
        },
        "1512112":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "\"No anwer mine.\" Phillip said.",
                "Answer Mark's question"
            ],
            "content":"<div class=\"\"><div> <span>          \"Mark Damien?\" The name struck him to look at Phillip directly. \"Is that you?\"<br>\r\n<br>\r\n          \"Haven't heard that name in years. How come star child knows my name?\" He looks shit, in very deep shit. His clothes are tattered and his face is shining with dirt and grease. Visible bugs crawl his shirt and he's not even flinching at them. The insect phobic guy descended into this pile of bones and strewn flesh.<br>\r\n<br>\r\n          \"What happened to you?\" He let down his cup and gave him a stern look. He always does that when he's cornered in an inescapable situation.<br>\r\n<br>\r\n          \"I answered your first question, answer mine first.\"</span></div></div>",
            "created":1491818460,
            "id":2302643,
            "title":"Phillip digs in to what happened to Mark"
        },
        "15121122":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Tell him the stone",
                "Keep the stone a secret"
            ],
            "content":"<div class=\"\"><div> <span>          \"Follow me first.\" He stood up and followed him to his condominium floor. People, especially the females gives him an odd look of disgust. 'A well known town celebrity next to a hobo?' is probably what everyone is thinking. They heed forward even with the drowning prejudice of the populace. From the elevator, Phillip could smell the accumulation of sweat and shit Mark must have got over the years. It's pitiful really.<br>\r\n<br>\r\n          \"Clean yourself first and I'll explain everything.\" He seemed surprised by the invitation of a bath. He was reluctant at first but soon gave in to Phillip's command. An hour was the time it took for him to take a bath. A hobo came in and a man came back, although thin. His face is white once again and clear shaven. That took of 10 years into his age. \"Here are some clothes you can borrow.\" Phillip gave him his old Football t-shirt, a pair of black boxers and some brown shorts.<br>\r\n<br>\r\n          Mark sat down on the bed beside Phillip and he began to ask again. \"Thank you star child, so how do you know me again?\" Phillip pushed himself out of Roy's body. His body, stuck in perpetual adolescence did a welcome bow. His shirt was still the same tattered black from the moment he had gone missing. Mark on the other  hand was shocked in the unfolding of events. \"I - I thought you were missing?\"<br>\r\n<br>\r\n          \"My last life was shit so I grabbed another one. I answered you question now what happened to you?\" Mark was still mouth opened him. Tears swell up his eyes and rained down like rain drops. Suddenly, he lunged at Phillip and hugged him like a long lost brother. This is what family feels like, Phillip supposed. He hugged him back and kept the embrace for several seconds.<br>\r\n<br>\r\n          \"Fuck you.\" Mark laughed. \"My life went downhill after everyone thought you died. I kept searching but when problems piled up one by one, I lost time to search for you. And you're just inside that guy?\" He pointed at Roy, still unconscious at the bed. \"Mom and dad died at an accident. Ricky was denied in the hospital and died later. I was hopping from one orphanage to the next until I found myself on the streets.\"<br>\r\n<br>\r\n          \"I'm sorry for what happened.\" Phillip felt somehow responsible for what Mark turned out to be. It is because of him that all his problems started.<br>\r\n<br>\r\n          \"I think you are blaming yourself for what happened to me. Don't be. I got over it a year back. Some random dude in the shelter helped me.\" He moved and sat behind Phillip. Now, he is between the host and vessel. \"How did you do that thing? When you went inside.\" He touched Roy and traced his defined body.<br>\r\n<br>\r\n          This is the longest time Phillip was put in Roy's body. And during that time, he felt weird at how incomplete he is. He was molded by his life, his soul and his body. Like his body was drug and everyday is a daily fix. Phillip wondered if Mark could gain the same powers. He remembered the stone saying that he can and he should. This way, he could repay the years of torment he left him. But 7 years is a lot of time to change a man. Living at the streets could change you faster than you think and it's always for the worse.</span></div></div>",
            "created":1491818520,
            "id":2302645,
            "title":"Answer Mark's question"
        },
        "151211221":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Give in to him",
                "Resist his grip"
            ],
            "content":"<div class=\"\"><div> <span>          Phillip went to his trophy cabinet and opened a secret compartment at the side. The stone has been sitting here for a year now. Untouched and earning an inch of dust. Still, the light it shimmers is enough to poke through the crust and shine brighter than the light outside. \"Here, catch.\" Mark caught the ball loosely. Suddenly, he crumpled like a fetus and groaned a second later. His eyes was blank, skin paler than the egg colored bed. His colors was drained of him but soon returned with his face flush of red. He woke up smiling and laughing.<br>\r\n<br>\r\n          \"I understand man. This stone is how you got it. Here, catch it back.\" Phillip caught it and placed it back the trophy cabinet.<br>\r\n<br>\r\n          Mark stood smiling from ear to ear. In a split second, he jumped from Roy's body. The event was instantaneous and his old was gone. In return, Roy convulsed and stood smiling, like the one plastered in Mark's face. A new laugh filled the room, this one filled with the most joy someone could have. Roy began to flex his muscles and did some poses in front of Phillip. Seeing his long time vessel do lewd poses made a large tent in his shorts.<br>\r\n<br>\r\n          \"I remember this guy. He is the jerk neighbor downstairs. You really turned his life around.\" Mark scoffed in his new voice. \"This is fucking cool, I could really turn my life back again.\"<br>\r\n<br>\r\n          \"What do you mean?\" Phillip asked. Honestly, he was feeling afraid at what Mark is doing. Mark's faced, rather, Roy's face turned vicious. It's a face he did not use before and will never do. Roy is kind and will never harm anyone. This Roy just grabbed him by the arms and pulled him to the bed. </span></div></div>",
            "created":1491818580,
            "id":2302646,
            "title":"Tell him the stone"
        },
        "153":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "[Good Path] Ask him for permission in possessing him",
                "[Evil Path] Possess without permission",
                "Other Choices"
            ],
            "content":"<div class=\"\"><div> <span>          Today's sleep was a peaceful once albeit dreamless. The bedbugs seemed to be kind enough to not to leave Phillip with red marks again. The AC next door was working so he got a nice cool breeze in the hot summer season. In the morning, he boiled some water and used it to make coffee and Ramen.<br>\r\n<br>\r\n          An hour later, Mark came knocking with a wide grin on his face. Mark for the best part was the best best friend Phillip had in his whole life. There may be several arguments we had but he was always there. When Phillip was being bullied, he was there to protect him but in the end, he was bullied along. He was there when he sprained his arms from carrying too much luggage. He was there on every bad moments to lift up his day. Today, he was carrying fresh bread from the store. Croissants, yum.<br>\r\n<br>\r\n          \"So I have good news and good news.\" He said. His grin always manage to make Phillip smile. It has a mellow power surrounding it.<br>\r\n<br>\r\n          \"Tell me the good news.\"<br>\r\n<br>\r\n          \"Terry the bitch kid is hosting a party on their private island. I was invited. Nora was invited too. Time to step up my game!\" The grin in his face reached ear to ear.<br>\r\n<br>\r\n          \"Shh. Don't be too loud, the situation here is bad as it is.\" Phillip hasn't paid rent for two months now and the land owner's patience is running out. \"The other good news?\"<br>\r\n<br>\r\n          \"We are allowed to bring 3 companions. I'm bringing you with Jerry Smith. Wanna come?\"<br>\r\n<br>\r\n          Too be honest, the whole party was a nice way to get free food. But the people, they are assholes his while high school career. But with the stone... \"I'll come. When is this party?\"<br>\r\n<br>\r\n          \"Tonight at 6 PM. Meet me at the Marina.\"<br>\r\n<br>\r\n          The test of the day, both boys talked about everything if interest. Ranging from women to video games to creepypastas. By 10 AM, they were already talking about supernatural and folk stories of San Valentino. Some stories, Phillip heard over the years but most were new. Like the Wailing Lady of the stone were the Valentino Sardine Factory stood. The stormy about the lucky Jim mine was Phillip's new favorite. Massacre, love, supernatural aspects, all of it was socked into one folk story.<br>\r\n<br>\r\n          Amidst the fun, Phillip got focused. He remembered the stone and even though he knows how to use it, he hasn't used it yet. Looking around, Mark is the only candidate to use it on. He could take him surprisingly and he'll remember nothing of being possessed. But he's Phillip's best friend and possessing him without permission is a little bit like stealing. Phillip could tell him about the stone and ask him if he can possess him. This once comes with no evil karma. Looking in other perspective, Phillip can tell Mark about the secret of the stone. Share the powers and forge their friendship stronger. A fourth option is also viable which is sitting it out. Never tell him anything and the prospect of possessing someone is out of the picture.</span></div></div>",
            "created":1491627600,
            "id":2301630,
            "title":"[Neutral Path] Sleep it off"
        },
        "1531":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "[Evil Path] Go deeper",
                "[Good Path] Unpossess Him",
                "[Neutral Path] Spend more time inside his body"
            ],
            "content":"<div class=\"\"><div> <span>          \"Can I possess you?\" That came out... wrong. Mark stood confused at the words that left Phillip's mouth. \"Can I possess you?\" Phillip said again. The whole atmosphere was awkward and both lads knew it.<br>\r\n<br>\r\n          \"Possess me, as in own me?\" Mark asked.<br>\r\n<br>\r\n          \"No. Possess as in control your body.\"<br>\r\n<br>\r\n          \"If you are hiding shrooms and not sharing it, you know I'll be mad.\" Mark sat closer to Phillip and held his hand. He always does this to icebreak an awkward situation. But this time, he found that his technique was in some deep shit. His hand sank to Phillip's lanky hands until only his can be seen. The feeling was tingly and warm but the sense of having something inside you feels uncomfortable. \"Did that just happen? I'm dropping balls man.\"<br>\r\n<br>\r\n          Phillip pulled away his hand, disconnecting the pleasure he felt. Warm energies surrounded his hand, he felt stronger, more alive than before. Only Mark's permission can make it happen again.\"So can I possess you?\"<br>\r\n<br>\r\n          \"Oh my God. This is just so, strange. Tell me this is drugs.\" Mark is the one always with the bong and it's funny seeing him like this.<br>\r\n<br>\r\n          \"No, I found this stone which gave me powers.\"<br>\r\n<br>\r\n          \"Umm. What are you going to do with my body when you possessed me?\" He was getting nervous now that he he is starting to sweat beads. The Damn neighbor turned off his AC again.<br>\r\n<br>\r\n          \"Just going to test my powers and I'll be out.\" He took Phillip's word as comfort. So far so good, only test and he'll be gone.<br>\r\n<br>\r\n          \"Ok. Just tell me everything when I get back. I'm already thinking ways to make use of that power.\" Knowing Mark, he'll just use the powers to prank someone. Or steal cash and other mischievous things. He sat straight as morning wood and closed his eyes.<br>\r\n<br>\r\n          On the other end, Phillip activated his powers once more. He felt light and free but not the same feeling he felt in the white void. He moved near Mark and began to move inside him limb to limb. The feeling can be described as sinking in warm marshmallow. It's soft with a little resistance. \"This feels so good.\" Phillip said.<br>\r\n<br>\r\n          \"Yeah. My feet feels cramped.\" Mark complained. On his end, he felt as if someone was pushing his legs outside and inside. It feels like you're in one of those massage chairs pushed to extreme setting. \"Oh. You're inside my dick. Be careful with my dick.\"<br>\r\n<br>\r\n          Moments later, only the head is not entered. Phillip could already control the body and even stand with it. Mark was still comprehending the feeling as a passenger on one owns body. \"We look like a sideshow freak.\" Mark said. People with one body and two heads would surely make people flock to see them.<br>\r\n<br>\r\n          Suddenly, a tent was already forming at their dick. From the mirror, both boys could already see the show below. \"You're aroused by this?\" Mark questioned. \"That is one weird fetish.\"<br>\r\n<br>\r\n          \"No... No. This is just one of those weird morning wood. Besides, do you still feel you body?\"<br>\r\n<br>\r\n          \"Yes. So would you enter my head now? This is getting too weird.\"<br>\r\n<br>\r\n          Phillip pushed his head and Mark met with his. Like the rest of his body, the head just passed through and with it, the possession is complete. A brief blackness ensued before Phillip woke up. In a long process, he found himself alone in his room once more, in a body that belongs to his best friend. The atmosphere around him feels like home but he still holds a new territorial feeling.<br>\r\n<br>\r\n          \"So I'm alone.\" Phillip said in Mark's lively voice. A voice that signals everyone that the annoying teen is around. And now, it is his. \"Cool\". He stepped neared to the made in China body mirror and inspected the body if his best friend. While Mark did go to the gym once in a while, he never really packed a pound of muscle. Only that his pudgy body from two years ago was replaced by a fairly lean torso and legs. His face looks like an average teenage American, white, clear of acne and fairly structured. A little more care and girls will be wanting instead if him. His upper on the other hand was a brown matte of short cropped hair. He always kept it short, never passing beyond his neck. \"Do see what I'm doing?\" Phillip said internally and externally. The stone showed that the vessel will not remember anything when it was possessed. He was just making sure if that is true at all. No reply came for a couple of seconds and it reassured his doubts. Now, he can look further into his friend.<br>\r\n<br>\r\n          It was three years ago when he saw his friend half naked. Gym class if he could remember. He was still fat back then, not that severely obese but enough to make people tease him. The teasing took the limit and he started a membership to the gym. Two year and this is what it got him; no more fat and signs of abs can be traced. He got scars beneath his novel and only Phillip knows why he has one. He got thin too quick and any medical literate can know what happened. He got skin flaps. His family was rich to clear it off but the scars were still there, fading with age. Phillip did some crunches and pull ups on the pipe above. It was not surprising that he found it easy to do. Looking back at the mirror, he saw himself sweating and huffing, cute.<br>\r\n<br>\r\n          Now Phillip's path in here goes two ways. He could continue exploring Mark's jungle and into his private parts or he can be the considerate best friend and clean him up and return him back to normal. Either way, he won't remember a thing. </span></div></div>",
            "created":1491627600,
            "id":2301634,
            "title":"[Good Path] Ask him for permission in possessin..."
        }
    },
    "info":{
        "author_id":"space_man2",
        "author_name":"space_man2",
        "brief_description":"Summer vacation is here and Phillip finds a stone that will change his life forever.",
        "created":1369472160,
        "description":"<td align=\"left\" class=\"norm\">          After a long year of rigorous study and school life, the summer is finally here. It's hot and plain boring until Phillip Martens finds a stone that allows him to possess somebody and live their life through their eyes. Through the writers and readers, they can guide Phillip to become altruistic with his powers or become malevolent in it.<br>\r\n<br>\r\n          The place takes place in San Valentino, California. The city happens to have a Mediterranean Climates that makes its winters mild and summers long and dry. The place is one of the original settlements of the Native Americans which was soon followed by the Spanish Inquisitors. <br>\r\n<br>\r\n<b>Characters</b>:<br>\r\n<br>\r\n<i>Martens Family</i>: A big family but with both parents working, they seem to go along so well.<br>\r\n<br>\r\n<u>Phillip Martens</u>: Main Character of the story. People considers him to be anti-social but in reality, he prefers closer friends than a large group of one. For appearances, he keeps his hair black and short and his face has the sign of receding pimples. He does not take exercises which left his body slightly pudgy but not overweight. Also, he considers himself bisexual. Age 16.<br>\r\n<u>Andrew Martens</u>: Father of the family and a large caring bear. Standing 6 foot and 3 inches, he's always mistaken to be a gruff of a man. In reality, he has a kind heart due to his immigration history. He knew how hard life was back in his home country so he does his job eagerly to keep his family away from poverty. He has a Filipino ancestry from her mother's side. Age 48.<br>\r\n<u>Lyanna Martens</u>: Not entirely MILF material but she works on the gym every other day to keep hos body firm and healthy. While she does have a job at the local farmer store, she still has time to take care of her family. At her age, she makes sure of her children's welfare and social status. With the declining of Phillip's grades, she starting to worry what's wrong. Age 44.<br>\r\n<u>Andrew \"Kyle\" Martens Jr.</u>: Commonly known as Kyle. As the eldest brother, he takes responsibility whenever his parents are not around, which is common. Since he was young, he learned how to become responsible and independent in the household work. Despite his strict attitude, he never fails to have fun with his twin and younger siblings. Age 19.<br>\r\n<u>Lyra \"Kristine\" Martens</u>: Only coming out mere seconds before her twin, she became the second eldest in the family. She shares the responsible attitude of her twin but never the independence. She always looks up to others for help, even in the simplest of things. She also has a short temper and her anger lasts as much. Give her some food and she'll cool down for people to talk to. Age 19.<br>\r\n<u>Eugene \"Gene\" Martens</u>: Always called as \"Gene\" by his siblings and \"Eugene by his friends. Trying new and dangerous things is this guy's forte but going away with it, not so much. At age 5, he was fond of the garage and the tools around. At age 7, he created his first explosive with only a handful of paper clips, an old car battery and the neighbor's kitten (Mr. Whisker's survived but left her tail smoking). At age 12, he nearly burned the garage down with his homemade flaming potato launcher. His family thinks he has the potential to be a great engineer and he thinks the same too. But his reckless attitude does not permit him that. A demolition Expert is a thought at the back of his mind. Age 12.<br>\r\n<u>Olivia Martens</u>: A short yet terrible kid. She's smart and cunning but in the bad way. She knows how to deceive and how to fool people and the ways how to get away with it. Age 10.<br>\r\n<br>\r\n<i>Major Characters:</i><br>\r\n<span style=\"font-family:impact, fantasy\"> Close Friends </span><br>\r\n<u>Mark Phillip Damien </u>: Phillip originally though Mark as rival due to a misspoken rumor. Als0 to the fact that his second name is the same with his first. But as time went on, they talked and found many similarities between the two of them. From their taste in music to their love of geek culture, Phillip considers Mark his long lost brother from another mother. They mostly hangout at the abandoned Spanish bunker near the mountain side. He is planning to take indoor design in college.  Age 18.<br>\r\n<u>Grace Ryder</u>: As a young kid, Phillip never really had a liking for girls, mostly due to her drama filled sister. But during his 3rd grade, his views about girls changed for the better. Grace became the adviser of Phillip when he has problems. So far, her mostly helps the situation Phillip were in. She is planning to take psychology as a course in college. Age 18.<br>\r\n<u>Ian Vance Jr.</u>: Male and gay. So far, he is closeted and only Phillip, Mark and Grace knows his sexuality. He is found to be quite an order maniac and strives to keep everything in its perfect state. His talents include; proficiency in painting and dancing, knows the many rumors of the town and the secret keeper of many. He is on his way to achieve a degree on arts and gender studies. Age 19.<br>\r\n<br>\r\n<span style=\"font-family:impact, fantasy\">Friends</span><br>\r\n<span style=\"font-family:verdana, sans-serif\">Boys</span><br>\r\n<u>James Keller</u>:Phillip's classmate last year and considered the best leader around. He would kindly give everyone orders and everyone would do so. He is a nice guy to be friend with and you'll be crossing heads when you get on his nerves. He is the son of Marcus Keller, the running Mayor of the town. Age 17.<br>\r\n<u>Terry Halley</u>: School rich kid and a snotty brat. The Haley is behind the Keller campaign so he expects to be on the good side of James Keller. James on the other hand was none too happy with his monetary relations with Terry. Terry is short in stature and a bright blond hair. Age 18.<br>\r\n<u>Justy Hopkins</u>: The school top hunk and the football Captain of the Saint Bernards. He is known in the school as \"Skipper Hopper\" because Skipper is also the other term for football captain. Unlike other jocks, he does not undermine the people below him. People has seen him to be kind and understanding and always acts as the mediator of fights. He is always with Matthew Williams. Age 18.<br>\r\n<u>Matthew Williams</u>: Valedictorian and has been on the Principal's honor rolls for 12 consecutive years. He come out to be this weird kid that everyone avoids. But with the help of a close friend, he became social with others and began to partake in clubs and parties. Up to this, some people still hold a prejudice against him. Age 17.<br>\r\n<u>Ricky Damien</u>: Brother of Mark Damien. A young and energetic lad. All of that changed when he got into a car crash. Now, he lies weak and pale in the San Valentino Hospital. Everyone is hopeful that he will break out of his coma anytime soon. Age 12.<br>\r\n<br>\r\n<span style=\"font-family:verdana, sans-serif\">Girls</span><br>\r\n<u>Melinda David</u>: The school cheerleading captain and a widely known drama queen. She has the habit of mingling with the jocks, having relationships with them for weeks and suddenly breaking up with them. Rumors spread and people learned. She spent days mocking her previous exes on social media. Soon, she preyed on the new jocks which are gullible to her charms. Age 17.<br>\r\n<u>Adeline Georgeson</u>: A cahoot of Melinda but shares an opposite attitude than her. She has a stable relationship with James Keller for 3 years and going strong for the following. She is beautiful and sexy for teen standards and that is why several adult personnel has their eyebrows unkempt within her. While she still has the bitchy attitude, she has rare moments of logical actions which benefits her and the people around her. Age 17.<br>\r\n<u>Clara Pond</u>: A school hottie and a member of the school cheer leading squad. While she has the sassy attitude of an urban teenage girl, she still has morals to keep her ground. Although, she may do reckless actions to keep her popularity in a stable state.<br>\r\n<u>Gena Mathers</u>: The female body and wits. While she is not overly sexy, she still manages to keep appearances. From 1st year to the last year of junior high, she was always the candidate for debate competitions. She may have a stern attitude but deep inside, she likes ponies.<br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:impact, fantasy\">Relatives</span><br>\r\n<span style=\"font-family:verdana, sans-serif\">Father's Side</span><br>\r\n<u>Oliver Martens</u> (Cousin): Living only next door, this guy is a know it all about the history of the town. Actually, he is working at the museum of San Valentino and he is striving to be the youngest curator in centuries. His attitude is a chill guy and is known to be stashing weed somewhere. Age 24.<br>\r\n<u>Quinzel Martens</u> (Cousin): Oliver's younger sister. Still in her pre-teens. She is bound to be playing beside Olivia when her time is free. Has a short temper and cries a lot. Age 9.<br>\r\n<u>Phineas Martens</u> (Uncle) Age 45<br>\r\n<u>Matilda Martens</u> (Aunt) Age 49<br>\r\n<br>\r\n<span style=\"font-family:verdana, sans-serif\">Mother's Side</span><br>\r\n<b>Owens Family</b>: Has a tradition of always coming to San Valentino over the summer. Mainly to have a trek on the mountains or use the Martens' Household as a pit stop to California. They live in Oregon.<br>\r\n<u>Joseph Owens</u> (Uncle): A hulk of a man and is considered by many as an adrenaline junkie. Always takes advantage of the scenery to induce shock to himself and to unsuspecting individuals. Age 38.<br>\r\n<u>Maria Owens</u> (Aunt): She met Joseph on her trip to Moscow, Russia. Joseph dropped his bear pelt and Maria managed to bring it to him in time. Like Joseph, she is also considered an adrenaline junkie and always partakes in thrilling trips around the world. Age 30.<br>\r\n<u>Larry Owens</u> (Cousin): The unlikely result of the parents. He is sickly, easily spooked and always stuttering. When he does visit the Martens' household, he is always sure to avoid Gene at all time. Amidst the fear, he is a nice kid and always like to read in his spare time. Age 14.<br>\r\n<br>\r\n<b>Events</b><br>\r\n*Half a month ago, the federal government established an outpost just 20 kilometers away from the city entrance. The skies above it is strictly a no fly zone.<br>\r\n*One month and the pop election for Mayoral seat will happen. Marcus Keller V.S Haley Jones.<br>\r\n*Next week would mark the cultural festival. A time in which the sun would hit the mountains just right and make the Lakeside Waterfall glow golden.<br>\r\n*One day after the cultural festival is the entrance festival. It is dedicated for people who are going to go back to school in the next school year. There will be bands, concerts and foods. Most students, even the anti-social ones go to the festival.<br>\r\n*10 more weeks before classes start again.<br>\r\n<br>\r\n<b>The Power</b><br>\r\n*The powers of the stone only include possession and intangibility.<br>\r\n*The user can only be intangible when near a vessel.<br>\r\n*That means, no invisibility, flight, memory changing and animal possession. There are other stones for those powers.<br>\r\n*Only the guardian of the stone can share the powers (which is Phillip Martens) and he has the power to revoke the said power.<br>\r\n<br>\r\n<b>Writing Notes</b><br>\r\n-Consider writing 2 or more paragraphs in the story.<br>\r\n-Always use 3rd person in the story. It widens the writing view of the story, making it not always about the main character. You can loosely use 3rd person limited omniscience, meaning, one character Point of View per paragraph.<br>\r\n-The spell check is there for a reason. Don't be shy on using them. Still, there might be words that can pass the spell check. Be your own Beta Reader.<br>\r\n-I as the creator can also make mistakes. Message me if you found one. Rewards await to the finder.<br>\r\n<br>\r\n<b>Story Notes</b><br>\r\n-While I classified the story as Erotica, please don't take it for granted. Plot of the story should outweigh the sexual side stories.<br>\r\n-Please consider equality of genders in the chapter decisions. This is the present, please be considerate about our brothers and sisters with differing genders.<br>\r\n-Don't forget to tell the feelings of other characters.<br>\r\n-Be imaginative but not too flowery with words.<br>\r\n-When creating new characters or locations, be good at describing them. And don't be too cliche. Making a cheerleader character whose only purpose was too act sexy all the time is boring. Take Clara Pond for example, while she is beautiful, she suffers from anxiety in losing her popularity.<br>\r\n<br>\r\n<b>A/N</b>: I accept Interactive Story transfers. Also, I can write chapters in other interactive stories as long as I have the idea and time.<br>\r\n<br>\r\n<b>Disclosure</b><br>\r\nAny specific names, locations or establishments said on the story are not my property and never will be. If such names are said in the story, it is purely coincidental and has no intention to infringe the rights of the owner.</td>",
        "id":1934962,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/100732.jpg",
        "last_full_update":1588142640,
        "modified":1588142640,
        "pretty_title":"Possession Stone"
    }
}