{
    "chapters":{
        "1":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><span style=\"line-height:2.0;\">Before we start a few questions?<br>\r\n<br>\r\n1. What gender are you?</span><br>\r\n</span></div></span></div>",
            "created":1320469200,
            "id":1218652,
            "title":"Start"
        },
        "11":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "16-26",
                "27-39",
                "40-over"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>2. What is your age group?<br>\r\n</span></div></span></div>",
            "created":1320469200,
            "id":1218656,
            "title":"Male"
        },
        "111":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "survivor ",
                "descendent of a survivor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>3. Are you a survivor or a descendent of a survivor?</span></div></span></div>",
            "created":1320469200,
            "id":1218658,
            "title":"16-26"
        },
        "1112":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Reader's Choice",
                "Reader's Choice.",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>It's been about a year since the Forth Ninja War and things have been for the most part stable. The Five Great Nations were friendly but there still was  tensions that came from the years before. The one thing that kept the villages from acting on this  tensions was the presence of Naruto Uzumaki, The Hero of Leaf and one of the last Uzumaki. To the knowledge of the Leaf the only other person with Uzumaki blood is the Fifth Hokage, Tsunade and a girl named Karin that served Orochimaru. Well now the Hidden Leaf Village is about to get another Uzumaki in town.<br>\r\nWalking down the main road towards the Hidden Leaf Village was a man in his late teens or early twenties. He was wearing a black outfit with a red swirl on each shoulder and a larger on on the back. On his back was a sword with a curved hilt. He wore a large straw hat (think the Akatsuki hats) that was blocking his eyes and hid his hair. Around his waist was a red sash. Dangling off of the left side of his sash was a headband. The cloth was black but was tattered and the insignia was hard to make out. <br>\r\nAs he approached the gates he was stopped by the guards. \"Hold up, what is your business here?\" One of the guards said. The guard had spiky black hair and a bandage over his nose. The man just kept walking. <br>\r\n\"We asked what is your business here?\" asked the other guard. He had brown hair then covered his right eye. He got up and placed a hand on the man's shoulder.<br>\r\n\"If you value your life, I would not touch me if I were you.\" He said in a serious tone.<br>\r\n\"Is that a threat?\" The spiked hair chuunin asked.<br>\r\n\"No, it is a warning.\" He said.<br>\r\n\"Why you!\" The Spiked hair chuunin then throw a punch but then the man lifted his left arm and stopped the punch. It was then that they saw that the man's left arm was wrapped. <br>\r\n\"Kotetsu!\" Then other guard said as he came in with a kunai.<br>\r\n\"Right Izumo.\" Kotetsu said as he jumped back.<br>\r\nIzumo then swung the blade but the man dodged but when he landed he found that his at was slashed. He then reached for it and then felt the hat about to fall off. \"You destroyed my hat.\" As he said that the two then appeared on ether side of him with a chain attached to a large blade help by each of them and as they pulled they got him trapped in the chains. This caused his hat to fall off.<br>\r\n\"If you are not going to tell us why you are here then Ibiki will have to get the information from you.\" Kotetsu said. Just then the man started talking.<br>\r\n\"You are idiots.\" This confused Kotetsu until he felt his hand starting to loosen up. \"What is happening?\"<br>\r\n\"What me too?\" Izumo said.<br>\r\n\"When you two each made contact with me, I placed a seal on each of you that allows me minor control of your bodies.\" With that they both let there blades go and then the chains loosened and the man got up. He then picked up what was left of his hat. \"Shame and I was starting to like this hat.\"<br>\r\n\"What do you want with in this village?\" Izumo asked.<br>\r\n\"It is not a what, but a who.\" The man then made a hand sign and then the two then grabbed the other's throat. They tried to pry the hands off but it was hard. Then Izumo asked. \"Who are you?\"<br>\r\n\"My name is Kenshin.\" He then turned around to show his straight red hair and purple eyes. \"Kenshin Uzumaki.\" With that he disappeared. As soon as he disappeared both chuunin felt them regaining control of their arms again. <br>\r\n\"We have to report this to Lady Tsunade.\" Izumo said.<br>\r\n\"Right.\" Kotetsu agreed and they then ran towards the Hokage's office. Once there they explained the situation to Lady Tsunade.<br>\r\n\"So he claims to be an Uzumaki and he attacked you.\" Tsunade asked.<br>\r\n\"Actually, he used a seal to make use stop each other so he could escape.\" Kotetsu said.<br>\r\n\"He is skilled enough to be able to use seals that forces others to his will. What could he want?\" Her assistant Shizune said.<br>\r\n\"I don't know but I do now one thing.\" Tsunade said. \"Until we know for sure what he is up to we have to be on our guard, even in our own village.\"<br>\r\n\"Meanwhile just outside in a alley way Kenshin was leaning on a wall and that thinking. \"What was that all about, why did I do that? Oh well at least this makes things more interesting.\" With that he left to start his search.</span></div></div>",
            "created":1365692460,
            "id":1569805,
            "title":"Enter Kenshin Uzumaki."
        },
        "11121":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Lady Tsunade assembled a team to look for Kenshin. It was Team 10, Shikamaru Nara, Choji Akimichi, and Ino Yamanaka.<br>\r\n\"What is the assignment Lady Tsunade?\" Shikamaru asked.<br>\r\n\"One hour ago, a single man infiltrated the Leaf and is in search of someone.\" She said. \"You assignment is to find him and capture him with as little damage to the village as you can.\"<br>\r\n\"Who is the target?\" Shikamaru asked.<br>\r\n\"He called himself Kenshin Uzumaki but there is no proof to that being his real name.\" She said. \"He has red hair and purple eyes and was last seen wearing a black outfit with a red sash.\"<br>\r\n\"You can trust use milady.\" Ino said. With that the three left.<br>\r\nMeanwhile elsewhere Kenshin was walking through the village in search of his target. \"Where could he be?\" Kenshin asked himself. \"He then made his way to the forest around the village when he suddenly felt something. He then jumped away and show a shadow was following him. Kenshin moved away but then got caught by two giant hands.<br>\r\n\"Kenshin Uzumaki?\" Shikamaru asked.<br>\r\n\"Yeah what of it?\" Kenshin said.<br>\r\n\"You are to came with us. Please don't resist.\" Shikamaru said.<br>\r\n\"Sorry man I don't do requests.\" Kenshin said. \"Plus why would I came with you. What did I do to warren my capture?\"<br>\r\n\"Are you dense or something? You attacked two chuunin.\" Ino said.<br>\r\n\"I did no such thing.\" He said. \"I merely defended myself.\"<br>\r\n\"You still entered the village illegally.\" Shikamaru said.<br>\r\n\"Oh that? My bad.\" Kenshin said with a smile. \"Well I better leave then.\" With that Kenshin's body started to glow and Choji yelled out in pain.<br>\r\n\"Choji!\" Shikamaru said but then held a kunai to his neck.<br>\r\n\"Move and I will kill you girl.\" He said.<br>\r\n\"Why is he facing me?\" Ino said to herself. \"She then stepped back but as she did Kenshin moved the kunai closer to Shikamaru's neck. <br>\r\n\"I said don't move that means forward and back.\" Kenshin said.<br>\r\n\"What is with this guy.\" Shikamaru said. \"What do you want?\"<br>\r\n\"I want to be left alone to look for someone.\" He said.<br>\r\n\"And who is it? We may be able to help.\" Shikamaru said.<br>\r\n\"Do you think I am a idiot.\" He then throw the kunai at the trees and then three ninja and a dog jumped out from it.<br>\r\nThey were Team 8, Kiba Inuzuka and his ninja hound Akamaru, Shino Aburame, and Hinata Hyuuga.<br>\r\n\"You two better come out as well because I know that you are there.\" Out came Rock Lee and Tenten, the last members of Team Guy.<br>\r\n\"How did you know we were here?\" Kiba asked.<br>\r\n\"I have my ways\" Kenshin said.<br>\r\nJust then he heard a something coming at him. They were insects. they swarmed around him and Shikamaru got away. \"Good work Shino, now let's get him to Lady Tsunade.\" Shikamaru said. \"Are you okay Choji?\"<br>\r\n\"Yeah but I am hungry.\" Choji said.<br>\r\nShino retrieved his insects. Just then Shino fell to the ground. \"Shino are you okay?\" Hinata asked.<br>\r\n\"It is like my insects are attacking me.\" Shino said.<br>\r\n\"He is stronger then we thought.\" Lee said. \"Then I will stop him with my power.\" Lee then charged at Kenshin but he blocked the first kick with his left leg. <br>\r\nThe two jumped back. \"Nice one.\" Kenshin said.<br>\r\n\"He blocked Lee's attack.\" Tenten said.<br>\r\nLee then charged in again but Kenshin dodged. \"Too much power.\" Lee then jumped up and got ready to drop kick Kenshin but he braced himself and then too hold of Lee's leg. He then tossed him aside.<br>\r\n\"Lee!\" Tenten said. She then jumped into the air and then summoned weapons from her scroll and launched them at Kenshin. <br>\r\n\"Wow that is a lot of weapons.\" He then reached for his sword. \"Whirlpool Sword Technique:...Half Multi Strike Current.\" With that he draw his blade and then swung it with one hand and then all the weapons Tenten launched were destroyed. Kenshin then swung it the other way and another wave was sent and head straight for Tenten. \"What!\"  Tenten said. Tenten was about to get the full force of the attack but then Lee jumped infront and took the attack as well. \"Lee! Why?\"  <br>\r\n\"I am not losing another teammate.\" Lee said weakly. <br>\r\n\"I was successful in my attack.\" Kenshin said. Just then he heard something.<br>\r\n\"Double Piercing Fang.\" Kiba and Akamaru were heading straight towards Kenshin and then attack hit. \"We got him!\" Kiba said as he and Akamaru stopped and then barked in agreement. <br>\r\nJust then Kenshin disappeared and a log appeared in it's place. \"A substitution. Where could he be?\"<br>\r\n\"Behind you.\" Kenshin said as he then placed a hand on Kiba and he then fell to the ground.<br>\r\n\"What have you done to me?\" Kiba asked.<br>\r\nJust then shuriken came flying towards Kenshin. He then draw his sword and placed the attack. \"It is not nice to attack when others are talking.\" Kenshin said to Shikamaru.<br>\r\n\"What have you done to everyone, and why is it so hard for use to fight?\" Shikamaru asked.<br>\r\n\"I have placed a seal on you, that Akimichi, the green clad taijutsu user, and even the Inuzuka. Proof enough that I am an Uzumaki since I have used so many seals with out your noticing.\"<br>\r\n\"This proves you are a skilled seals user but not that you are an Uzumaki.\" Shikamaru said.<br>\r\n\"Is that so.\" Kenshin said. \"In that case I will just take my leave.\" Just then Kenshin heard something. <br>\r\n\"You are not going any where.\" Yelled Sakura Haruno as she jumped and punched to ground creating a crater.<br>\r\n\"Looks like I have my hands full.\" Kenshin said. As the Kenshin was recovering his barrings he observed the girl that arrived here. <br>\r\n\"Is everyone okay?\" She asked the Nara.<br>\r\n\"For the most part but he has placed seals on several of us.\" He said.<br>\r\n\"He did all this?\" Sakura said. \"Of all times for Naruto to be out of the village.\"<br>\r\n\"Thank you.\" Kenshin said. \"I have been waiting for this.\" <br>\r\n\"Now I know where to find my target.\" Kenshin then jumped away.<br>\r\n\"Came back here.\" Sakura said.<br>\r\n\"Sakura, you and Ino tend to the others, Let me go after him.\" Hinata said. Before Sakura could answer Hinata was already on her way. \"I have to stop him before he gets to Naruto. Please be safe Naruto.\"<br>\r\n\"Achoo.\" Naruto sneezed elsewhere.<br>\r\n\"Where is he?\" Just then shuriken came flying towards him. He then dodged them and looked at his attacker. \"Man what is with you Leaf Ninja?\"<br>\r\n\"Why do you want to with Naruto?\" Hinata asked.<br>\r\n\"To talk with him about something of a personal matter.\" With that he then charged and then he and Hinata fought.<br>\r\n\"I will not let Naruto get hurt if I can.\" She managed to lay a hit but Kenshin then moved and only his left arm was hit.<br>\r\n\"Your hit... would have killed me?\" Kenshin said. He then took a smoke bomb and set it off. When the smoke cleared he was gone.<br>\r\n\"Where can he be?\" Hinata said. \"There he is.\" With that she was off.</span></div></div>",
            "created":1365697080,
            "id":1569824,
            "title":"Deploy!"
        },
        "111211":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Hinata was trying to locate Kenshin before he finds Naruto. She was on his tail be she could not get an accurate lock on his trail. She then heard a commotion and then Started towards it. :Am I too late?\" Hinata asked herself. She found herself at the source. From the trees she saw that Naruto was down there, face to face with a group of ten men. \"It is not Kenshin, at least that is good. But why is Naruto having so much trouble?\"  She then activated her Byakugan and then saw two small chakra signatures. \"Naruto is protecting the two children that are there. But that shouldn't stop Naruto? Why is it that he is not trying to fight back.\" <br>\r\nHinata was about to go and help Naruto until she felt a hand go over her mouth. \"Hush Hyuuga.\" She took a glance to see it was Kenshin. \"Tell me which is Naruto. The two kids are too young so they are not him. Oh of course he is the one with the Leaf Headband on.\" He then let go of Hinata's mouth and then jump in front of her. \"Once I get down there get the kids to safety.\" With that Kenshin then jumped into the frey.<br>\r\nMeanwhile while Hinata was observing the scene:<br>\r\n\"For the last time just step aside and we will leave you be.\" Said the head man.<br>\r\n\"Never.\" Naruto said looking all beat up. \"I don't understand what this two did to you but there is no reason to try and kill them.\"<br>\r\n\"You better just stand there then because if you move we  will set off the explosives that we planted on the little girl so take this beating and maybe we will go easy on those two brats.\"<br>\r\n\"With that said one of his men then swung a giant club at Naruto but then someone appeared in front of Naruto. <br>\r\n\"Hey there Naruto, I am...\" Kenshin then got hit and was sent flying to the left.<br>\r\n\"Who was that?\" Asked the club wielding man.<br>\r\n\"I was getting to that before you interrupted.\" Kenshin said as he go back up.<br>\r\n\"Hey you okay?\" Naruto asked.<br>\r\n\"Yeah, lucky for me I was able to block the hit.\" Kenshin said.<br>\r\n\"What is with this guy? He was just hit by a club at full force and is barely hurt.\" The head man said in his head.<br>\r\n\"As I was saying I am Kenshin. That will have to do for know.\" He said. \"So why are you not moving?\"<br>\r\n\"They wish to kill this two.\" Naruto said. \"Also they planted explosives on the girl so if I move they will set them off.\"<br>\r\n\"That would make things hard.\" Kenshin said. \"Hear that Hyuuga.\" Just then Hinata dropped out from the tree.<br>\r\n\"Hinata, why are you here?\" Naruto asked.<br>\r\n\"That can be answered later. Get them out of here and take care of the girl.\" Kenshin said.<br>\r\nHinata looked hesitant at first but then left with them. \"Now to take this guys out.\" <br>\r\n\"Okay then.\" Naruto then got up and then made a hand sign. \"Shadow Clone Jutsu.\" With that Naruto created eight clones. \"Mind taking on the one with the club?\"<br>\r\n\"Not at all.\" Kenshin said. With that the two of them charged at the group.<br>\r\n\"Crush them!\" With that his men attacked and then they fought.<br>\r\nMeanwhile with Hinata and the kids. <br>\r\n\"Please help her.\" The other kid, a boy asked.<br>\r\n\"The seal in made into her skin.\" Hinata said to herself as she examined it. \"I will do what I can.\" Hinata then went to work to suppress the seal.<br>\r\nBack at the fight.<br>\r\nEach Naruto clone had taken out one of the men and the original took the leader out. Kenshin thous looked like he was in trouble until...<br>\r\n\"I will crush you for sure this time.\" The club wielder said as he swung the club down but Kenshin disappeared and then reappeared. \"What are...\"<br>\r\n\"Silent 'Killing'.\" With that Kenshin then slashed at the club user and then he was knocked out.<br>\r\n\"Wow you defeated him with out killing him. You must be one skilled ninja.\" Naruto said.<br>\r\n\"I guess. Thank you.\" Kenshin said.<br>\r\n\"Fools, I will simply take you all out with me. He was about to make a hand sign when Kenshin then swung his sword and then cut the man's hand cleanly off his wrist.<br>\r\n\"Sacrificing one's self for your comrades is noble, but sacrificing one's comrades make me sick.\" Kenshin said as he cleaned his blade and then sheathed it.<br>\r\n\"Tell me.\" Naruto said talking to the man. \"How do you remove the seal.\"<br>\r\n\"I am not telling you.\" Then man said but then Kenshin squeezed the stump of a hand. \"AH!!!.\"<br>\r\n\"He asked you a question.\" Kenshin said.<br>\r\n\"AH!!!, I don't Know. The seal was pre-made and sold to me.\"<br>\r\n\"Where is the sales person?\"<br>\r\n\"Dead, died of a heart attack.\"<br>\r\n\"He is not lying.\" Kenshin said. He then took a piece of the man's other sleeve and wrapped it around the stump of a hand.<br>\r\n\"I will have to try to remove it myself.\" Naruto then started off to Hinata and the kids.<br>\r\nHe arrived to see Hinata exhausted and about to faint. When she did Naruto caught her. \"It is okay I am here.\"<br>\r\n\"I did what I could but the seal is engraved into the skin.\" Hinata said.<br>\r\n\"This is not going to be easy.\" Naruto said.<br>\r\n\"AH!!!\" They heard a scream and then Naruto turned to find Kenshin was doing something.\"Hey what are you doing?\" Naruto asked.<br>\r\n\"Hush, I am removing the seal.\" Kenshin said. Soon his hand stopped glowing and he moved it. \"There done.\" Naruto and Hinata then move to look at it. \"She will have a scar of the markings but she is no longer in danger of exploding.\" <br>\r\n\"Thank you mister.\" The boy said.<br>\r\n\"You are welcomed.\" Kenshin said. \"Now where do you live?\"<br>\r\n\"My grandmother's.\" <br>\r\n\"Okay take her there then go and let who ever is her guardian know where she is.\" <br>\r\n\"Right.\" With that the kids left.<br>\r\n\"Now that they are gone I have to say this.\"<br>\r\nAfter arriving back to the village.<br>\r\n\"What! You attacked ninja in the Leaf because you wanted to see Naruto/me to talk!\" Lady Tsunade, Naruto and the ninjas that Kenshin fought said together.<br>\r\n\"I am sorry about that? I sometimes forget that I can't just go into places with out answering questions, expectantly ninja villages.<br>\r\n\"Why do you wish to talk to me?\" Naruto asked Kenshin.<br>\r\n\"Well since I caused a commotion I guess I can let the others listen in. Okay here it is.\"  Kenshin said. \"As I said before my name is Kenshin Uzumaki, I was born in a small village about eighteen years ago. My father is... was a shinobi that managed to get out of the village. He died around the time I was ten but until he died he kept hope of the Uzumaki Clan's future growth and rise back into history.\" <br>\r\n\"Then why are you here?\" Kiba asked.<br>\r\n\"I am allowing you to hear this but I don't want to hear questions from anyone but Naruto or the Hokage.\" Kenshin said. \"But the answer that, an his death bed he made two requests, One to the man that he came to call a brother and one of his son me.:<br>\r\n\"And what was it that he asked of you?\" Hinata asked.<br>\r\n\"To ensure that the Uzumaki clan would spread by finding a mate that makes me happy. At least that is how I first interpenetrate that.\" Kenshin said.<br>\r\n\"He yelled at me but not Hinata.\" Kiba said in his head.<br>\r\n\"Anyway about a year back I heard the name Naruto Uzumaki, the Hero of the Leaf. So I wished to see if it was truly a Uzumaki that did this. But with the war I had to wait to travel.\" Kenshin said.<br>\r\n\"So what do you want of me?\" Naruto asked.<br>\r\n\"I wish to test that you are an Uzumaki.\" Kenshin said.<br>\r\n\"He is a Uzumaki.\" Tsunade said.<br>\r\n\"I don't mean to be rude but are you dense, He doesn't have red hair.\"  Kenshin said.<br>\r\n\"Why you little brat.\" She said.<br>\r\n\"I am sorry.\" Kenshin said in a frantic tone. \"But I don't understand how he is an Uzumaki since no Uzumaki how survived would have placed there ally, the leaf in danger by living here.\"<br>\r\n\"I guess your father was too young to be informed at the time.\"  Tsunade said. \"Naruto's Mother was the Jinchūriki of the Nine-Tailed Fox as Naruto is now.\"<br>\r\n\"You are kidding me.\" Kenshin said. \"So that is why you are in the Leaf. Wait if she was the jinchuuriki then that means that she is dead. That is sad.\" <br>\r\n\"Not just that but...\" Kiba was about to say but Hinata and Sakura both stepped on his foot.\"AH!!! What was that all about?\"<br>\r\n\"I he may be an Uzumaki but we can't trust him.\" Sakura said.<br>\r\n\"Also Naruto is right here so there is no reason to bring up things that are hard for him.\" Hinata said.<br>\r\n\"That was kind of you Hinata, Sakura, but it is okay. Both my parents died during the Nine-Tails attack.\" Naruto said.<br>\r\n\"That means!\" Kenshin then place two and two together. \"Your the Fourth's son.\" He then started to cuckle.<br>\r\n\"What's so funny?\" Naruto asked.<br>\r\n\"It's Nothing.\" Kenshin said. \"Well it is getting late.\"<br>\r\n\"Fine let's talk tomorrow.\" Naruto said.<br>\r\n\"Love to. Till then I will be seeing you.\" With that Kenshin then left the tower.<br>\r\n\"Where could he have gone?\" Sakura asked.<br>\r\n\"Don't know but he still worries me.\" Shikamaru said.<br>\r\n\"Don't worry, he will not do anything too bad.\" Naruto said.<br>\r\n\"Alright.\" Shikamaru said.<br>\r\nWith that they all left for the day.</span></div></div>",
            "created":1365895260,
            "id":1571159,
            "title":"Naruto and Kenshin meet."
        },
        "1112111":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>The next day Naruto was looking for where Kenshin was. \"Where is he? He said you wanted to talk more but I can't find him anywhere.\" Naruto said. \"Kenshin? Where are you?\"<br>\r\n\"Relax I am here.\" Kenshin said as he walked over to Naruto. \"Hey.\"<br>\r\n\"Where did you sleep last night?\" Naruto asked. <br>\r\n\"I set camp late night.\" Kenshin said. \"But man am I hungry. Is there a place that you suggest.\"<br>\r\n\"I have just the place.\" Naruto said. He then took Kenshin to Ramen Ichiraku. <br>\r\n\"Ramen Ichiaku. This is the place you recommend. Alright.\" Kenshin said. The two entered to restaurant and then sat down.<br>\r\n\"Okay what is first that you wish to ask me about?\" Naruto asked.<br>\r\n\"Okay were to start? Okay, how much do you know about the whirlpool?\"<br>\r\n\"Not much, just that it was destroyed during the Third Great Ninja War.\" Naruto said. <br>\r\n\"How do you know that much?\" Kenshin asked.<br>\r\nNaruto looked around and then whispered. \"When I was mastering to use the Fox's chakra my mom appeared to me and told me about the whirlpool and the clan.\" <br>\r\n\"Do you know any sealing techniques?\" Kenshin asked.<br>\r\n\"I know to use storage seals and I can manipulate the seal on me,  I have been working learning same other types of seals but Not many no.\" Naruto said.<br>\r\n\"Shame but understandable. Sorry.\" Kenshin said.<br>\r\n\"It is alright, it my be depressing but I know that my parents love me the same why I can assume your father did for you.\" Naruto said.<br>\r\n\"Thanks.\" Kenshin said. Just then they get there ramen. They then both said thanks for the meal and then dug in. <br>\r\nHalf why through the bowl Naruto stopped and turned the Kenshin and asked him. \"So how is the ramen?\" <br>\r\n\"It is good.\" He said.<br>\r\n\"What did you say?\" The owner, Teuchi said.<br>\r\n\"Sorry mister but to me all food that is not homemade is at most good.\" Kenshin said.<br>\r\n\"Well okay.\" He said.<br>\r\nKenshin then took out some money and placed it on the counter and then started off. \"Hey wait.\" Naruto said as he finished his ramen and then placed his share on the table and went after him.<br>\r\n\"Sorry if I made things difficult for you there.\" Kenshin said.<br>\r\n\"No it is fine.\" Naruto said. \"Can I ask you something?\"<br>\r\n\"What?\" Kenshin asked.<br>\r\n\"Well you showed skill but since you are not wearing a headband then you did not receive training from a village program. My question is how did you get so strong?\" Naruto asked.<br>\r\n\"My father and grandfather trained me and I have someone that taught me how to be a ninja.\" Kenshin said.<br>\r\n\"Really! Can I meet him?\" Naruto asked.<br>\r\n\"I don't think that is a good idea.\" Kenshin said.<br>\r\n\"Well it was worth a try.\" Naruto said.<br>\r\n\"Trying to full yourself by thinking you can get stronger.\" They both looked up to see a young man with black hair and black eyes on the fence.<br>\r\n\"Sasuke, why are you here?\" Naruto asked.<br>\r\n\"Just got back from a mission and I heard about your cousin.\" Sasuke said.<br>\r\n\"We are not cousins.\" Both said. \"Well maybe that is not too far-fetched.\" Kenshin said. \"We are not direct cousins but as members of the same clan we are related. And who are you?\"<br>\r\n\"Kenshin this is Sasuke Uchiha.\" Naruto said.<br>\r\n\"Well Sasuke Uchiha, I am neither pleased or privileged to meet you.\" Kenshin said.<br>\r\n\"I am alright with that.\" Sasuke said. <br>\r\nJust then Sakura ran to them. \"Naruto!\" <br>\r\n\"Hey Sakura.\" Naruto said. \"What is up?\"<br>\r\n\"Lady Tsunade has a mission for use.\" She then turned around and said to Sasuke. \"You too.\"<br>\r\n\"Of course.\" Naruto said and Sasuke nodded in agreement and the three of them were off.<br>\r\n\"Wait for me.\" Kenshin said.<br>\r\nThey all arrived at the Hokage's office. \"They are here.\" Sakura said.<br>\r\n\"Okay.\" Tsunade said. \"Word of a group of Rogue ninja have been reported in the southern part of the Land of Fire. Your mission is to confirm this and if so doe all in your power to stop them.\" <br>\r\n\"Lady Tsunade. Is this anywhere near a place called Akane-Hoshi Village?\" Kenshin asked.<br>\r\n\"Yes why?\" She said.<br>\r\n\"Akane-Hoshi is my home village.\" Kenshin said. \"That is why I am going with you.\"<br>\r\n\"It would be good to have same one that knows the area.\" Sasuke said.<br>\r\n\"Very well. I will inform Kakashi of the addition. Dismissed.\"<br>\r\n\"Yes Milady.\" Sakura said and they all left. <br>\r\nAfter getting their stuff they started off. \"Just hold off mother, grandfather, help is on the way.\" Kenshin said to himself as they raced off.</span></div></div>",
            "created":1365909720,
            "id":1571268,
            "title":"Uzumaki Bonding."
        },
        "11121111":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Naruto, Kenshin, Sasuke, and Sakura were racing through the trees on root to Kenshin's home village of Akane-Hoshi to deal with the rogue ninja. \"Slow down Kenshin.\" Sakura said to him. \"I know we have to hurry but we need to meet up with Kakashi sensei first.\" <br>\r\n\"Hush Sakura, we have little time to waste.\" Kenshin said.<br>\r\n\"What was that?\"  Sakura said. Then she noticed the seriousness of Kenshin's face.<br>\r\n\"Some one is coming?\" Kenshin said. They then stopped and so did the ninja that was approaching them. \"Who's there?\"<br>\r\nThe ninja was a male that had white hair and was in full Leaf uniform with a mask over the lower half of his face and his headband lopsided, covering his left eye. \"Relax Kenshin.\" Naruto said. \"That is Kakashi sensei.\"<br>\r\n\"So you are Kenshin Uzumaki.\" Kakashi said. \"Well let's stop and rest and  then you can tell us about your village.\"<br>\r\n\"Alright.\" Kenshin said. The five of them then sat down and then started to talk.<br>\r\n\"So what is your village like?\" Naruto asked.<br>\r\n\"The Akane-Hoshi is a village that is filled with elderly ninja and their offspring. Ninja that have tired of war and the horrors that are forced to be done as a shinobi.\" Kenshin said.<br>\r\n\"So that explains how you can get training.\" Sasuke said.<br>\r\n\"Sasuke!\" Sakura said.<br>\r\n\"It is alright, I understand he doubt that my abilities are real.\" Kenshin said. \"But that aside we need to hurry and get moving again.\"<br>\r\n\"Why is that?\" Sakura asked.<br>\r\n\"The village of Akane-Hoshi is surronded by the sea on one side and a forest on the other.\" Kakashi said. \"In the forest live a clan of ninja that can mirror any jutsu.\"<br>\r\n\"That must be a story.\" Naruto said.<br>\r\n\"With many stories there is a level of truth.\" Kenshin said.<br>\r\n\"What do you mean?\" Naruto asked.<br>\r\n\"Hopefully you will never have to see.\" Kenshin said. They then got back up and then said. \"Let's go.\" With that they headed out again. After a matter of seconds they arrived at the forest. Kenshin then landed on the ground at the entrance of the forest. \"We will have to go through slow and be quiet.\" With that they walked through the forest. They soon found their way to the village gate. \"Here we are. The village of Akane-Hoshi.\"<br>\r\n\"Okay team let's go.\" Kakashi said as he then took point and the rest followed him.<br>\r\nOnce in the village, they made an observation. \"That is strange. Where is everyone?\" Kenshin said. \"It is usually busy at this time of day.\"<br>\r\n\"Maybe they are hiding.\" Sakura said.<br>\r\n\"Well let's find the village head and inform him that we are here.\" Kakashi said. With that said they followed Kenshin to the home of the village head. <br>\r\n\"So you are the ninja we requested.\" Said the village head, a bald man with formal robes on. \"It is an honor that the Leaf sent a team containing their hero Naruto.\"<br>\r\n\"I speech for all of us in saying, it is our honor to be at service to you.\" Kakashi said. <br>\r\n\"So where are this ninja?\" Naruto asked impatiently.<br>\r\n\"That can wait for tomorrow. \" Then village head said. \"You all must be tired from your travels and wish to rest.\" <br>\r\n\"He is right Naruto.\" Kakashi said. \"We need all the rest we can get.\"<br>\r\n\"Fine.\" Naruto said.<br>\r\n\"Good.\" The village head said. \"Kenshin, do you think your mother would mind four additional tenants?\"<br>\r\n\"I don't think she would, but Grandfather is a different story.\" Kenshin said.<br>\r\n\"Well unfortunately we don't have a choice.\" The village head said. \"Take them there and explain the situation to them.\"<br>\r\n\"Alright.\" Kenshin then motioned for the others to follow. <br>\r\nAs they were heading for his house Sakura asked Kenshin something. \"What did you mean when you said your grandfather might not like use staying at your house?\"<br>\r\n\"I don't know why but my grandfather hates ninja. In fact, although he would never say it I think he hates it that I became a ninja.\" Kenshin said. \"We are here.\" Kenshin then walked up to door and then as he opened it he said. \"Mom, I am home!\" <br>\r\n\"Is that you Kenshin?\" said a woman's voice. Moments later a woman in her mid to late forties walked into view. She looked much like Kenshin but her hair is brown and her eyes black. \"It is you. What are with the others?\"<br>\r\n\"They are the ninja the village hired for help.\" He said. \"Mister Akio asked that they stay here. I informed him that Grandfather may not like it.\"<br>\r\n\"What is it that I wouldn't understand?\" came a voice and then walked up was an old man in his sixties with grayish black hair and black eyes like Kenshin's mother. \"Please explain, Sumiko, Kenshin.\"<br>\r\nKakashi then walked up and said. \"We are ninja of the Leaf sent here to investigate if the rumors of Rogue Ninja nearby is true are not. Looks to me it is true?\"<br>\r\n\"What makes you say that?\"  Kenshin's grandfather asked.<br>\r\n\"When Akio said that there was no choose but for use to stay with you I first though it was because this village had no inns but the real reason is because this house is near the center of the village so it is the farthest point from all directions. The safest area to be.\"<br>\r\n\"Very well. They can stay.\" He said. \"The name is Ryouichi.\" With that he left.<br>\r\n\"You all must be hungry.\" Kenshin's mother said. \"I will get to work on dinner.\" <br>\r\nAfter finishing eating Kenshin then showed them to their room. They soon went to sleep but half way through the night nature called for Naruto and as he when he finished he saw a door cracked open and he looked into it and saw Kenshin looking at a picture. It was too dark to see what the picture was of but he could tell that Kenshin had been crying. \"Naruto, it is not weakness to show tears but this is a private moment.\" <br>\r\n\"Sorry.\" Naruto said as he headed back to his room.<br>\r\n<br>\r\n</span></div></div>",
            "created":1365920220,
            "id":1571345,
            "title":"Race to Akane-Hoshi."
        },
        "111211111":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>The next day Kakashi and his team were being escorted to the Villager Head's house where they are to briefed on the situation. Once there they found themselves in a large room with tables along the sides of the room. \"Please take a seat.\" Akio said pointing them to the center.<br>\r\nThey took the seats and then sat ready. \"So what it the situation?\" Kakashi asked.<br>\r\n\"As you know since the Forth Ninja War there has been a decrease in combat by the large villages.\" Akio started off. <br>\r\n\"Of course we know that.\" Naruto said earning him a slug to the head by Sakura.<br>\r\n\"Be more respectful.\" She said.<br>\r\n\"But what is not known is that Ninja from smaller village have still been active.\" Akio said.<br>\r\n\"Why would they do a thing like that?\" Naruto asked.<br>\r\n\"A large force of strength has two noticeable results. Either they flee or attack. Both of this actions are fueled by fear.\" Ryouichi said from his seat.<br>\r\n\"Anyway...\" Akio continued. \"One of our guards noticed activity in the forest that looked ninja in nature.\"<br>\r\n\"We contacted family from the other villages and none of them have knowledge of troop deployed.\" Stated a woman in her late fifties.<br>\r\n\"We have no idea as to what it is so we asked help from the Leaf, but it was because the Leaf was closer that we asked.\" Akio said.<br>\r\n\"That is understandable. The faster we get here the sooner this would be dealt with.\" Kakashi said. \"Don't worry Mister Akio, Team Kakashi is on it.\"<br>\r\n\"Thank you.\" Akio said. \"We will offer all the help we can give.\" <br>\r\nJust as the village elders were about to leave Sasuke spoke up. \"Why not first handle this yourself?\" <br>\r\n\"Sasuke!\" Sakura said.<br>\r\n\"Yeah what are you thinking?\" Naruto said.<br>\r\n\"It is a valet question.\" Kakashi said. \"It is understanding that there are ninja in this village, if only former ones.\"<br>\r\n\"My grandson has a big mouth.\" Ryouichi said. \"Truth is that since the people here are reminisce of wars, there are those who hide there past and refuse to pass there skills to they children.Myself included.\" <br>\r\n\"That explains his distrustful composer towards Kenshin.\" Naruto said to himself. \"I wish to apologize to you all for my teammate.\" Naruto said as he took hold of Sasuke and made him bow.<br>\r\n\"Okay. I am sorry.\" Sasuke said.<br>\r\n\"That is alright.\"  Ryouichi said. With that they all left.<br>\r\nLater Naruto, Sasuke, and Sakura were walking through the village. \"Why are we doing this again?\" Naruto asked.<br>\r\n\"In case they are ninja we have to be able to fight them anywhere. That includes the village.\" Sakura said. \"We need to check as to see if there are any clues that point to violent intent.\" Just then Kenshin's mother, Sumiko ran up to them. \"Miss Sumiko, what is the matter?\" <br>\r\n\"It's Kenshin... He was attacked.\" She said.<br>\r\n\"What!\" They all said and then they headed to his house. Once there they saw him in pain. \"What happened?\" Sakura asked.<br>\r\n\"I don't know.\" She said. \"He won't let me near.\"<br>\r\n\"Let me take a look?\" Sakura asked.<br>\r\n\"No don't.\" Kenshin said.<br>\r\n\"I am a medical ninja so don't worry.\" Sakura said.<br>\r\n\"Fine.\" With that Sakura went to work.<br>\r\n\"The injuries are not as bad as your mother made them seem.\" Sakura said. <br>\r\n\"I was allows hard to hurt.\" Kenshin said.<br>\r\n\"So tell use what happened.\" Naruto said.<br>\r\n\"I can't.\" <br>\r\n\"Why?\" Asked Sakura.<br>\r\n\"Tell them.\" Ryouichi said as he walked into the room with Kakashi with him. \"Tell them about them.\"<br>\r\n\"So you know, how long?\" Kenshin asked.<br>\r\n\"That is not important, Tell them.\"<br>\r\n\"Okay.\" Kenshin said. \"I was attacked trying to stop them.\"<br>\r\n\"The Rogue Ninja?\" Naruto asked. \"They got into the village, where are they?\"<br>\r\n\"No it was not them.\" Kenshin said. \"It was my friends.\"<br>\r\n\"Friends did this?\" Sumiiko said. \"Why would you need to stop them?\"<br>\r\nKenshin was silent. Then said. \"I was trying to stop them from trying to find the Rogue Ninja and trying to kill them.\"<br>\r\n\"What do you mean?\" She asked.<br>\r\n\"Kenshin have been training with Takuma's Three.\" Ryouichi said.<br>\r\n\"Who is Takuma?\" Naruto asked.<br>\r\n\"My father.\" Kenshin said. \"He became a teacher here and started teaching the children of the village how to use basic ninja skills. The three are three boys that are around my age that gave my father the most trouble but were his favorite.\"<br>\r\n\"I thought I told you not to interact with them.\" Sumiko said.<br>\r\n\"They were the only one that did not treat me as the spawn of a outsider like the others did.\" Kenshin said.<br>\r\n\"That is why you had to fight them.\"  Naruto said. \"Okay where did they go? I will go and retrieve them.\"<br>\r\n\"That is not a good idea.\" Kenshin said. <br>\r\n\"Then I will go and help them.\"<br>\r\n\"They are not going to accept your help.\"<br>\r\n\"Why is that?\" Kakashi asked.<br>\r\n\"They think that we don't need the help of an outside village.\" Kenshin said.<br>\r\n\"Then why not you go and convince them.\" Sakura asked.<br>\r\n\"Can't.\" Kenshin said.<br>\r\n\"Why?\" Sakura asked.<br>\r\n\"Because although I think it was the wrong move I agree that we could handle things without the help of another village's ninja.\"  Kenshin said. \"But I guess it can't be helped.\" Kenshin then got up and grabbed his stuff. <br>\r\n\"I will not let you go, it is one thing letting you learn ninjutsu but I will not let you get into real battle.\" His mother said. <br>\r\n\"It is too late for that.\" With that Kenshin started out the door. <br>\r\n\"Don't worry we will make sure Kenshin gets back alive.\" Naruto said as he went after him.<br>\r\n\"Don't worry. Naruto never breaks a promise.\" Sasuke said as he, Sakura and Kakashi left.<br>\r\n\"So which way did they go?\" Naruto asked Kenshin.<br>\r\n\"They were planning still when they punched me out so they may still be getting ready. We should go and wait in the woods and then keep heading towards the location of the ninja sighting.\" Kenshin said.<br>\r\n\"Right.\" The others said.<br>\r\nThey head there and soon confronted them.</span></div></div>",
            "created":1366212060,
            "id":1573619,
            "title":"Trouble in Akane-Hoshi."
        },
        "1112111111":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Team Kakashi and Kenshin got to where the group called Takuma's Three and was in there path. \"Kenshin, I thought you did not like the idea of the Leaf Ninja doing the work we should be doing ourselves.\" Said a bulky young man with a shaved head, wearing an opened black vest and dark blue pants.<br>\r\nOn one side was a young man with short green hair. He was wearing a tan cloak so it could not be seen what else he had on. On the other was a young man with long white hair in a braided ponytail. He has a red short sleeved shirt and loss fitting dark gray pants. On his back he carried a bamboo stick. <br>\r\n\"I do think that we should take care of this, but we no nothing of the intent of this so called Rogue Ninja.\" Kenshin said. \" Hibiki...\" He looked to the cloaked man. \"Daisuke...\" He looked at the one with the ponytail. \"Ren...\" Looked at the bulky man. \"I will not let you go and make things worse.\" Kenshin then got into a stance. \"I will kill you all if I must.\" <br>\r\n\"Please, you can't fool us.\" Ren said. \"We all know that you never can kill a person that you think a friend.\"  Just then Daisuke throw a smoke bomb and when the smoke cleared they were gone.<br>\r\n\"They got away.\" Kenshin said. \"We have to stop them.\" <br>\r\n\"Why do you fell so strongly about them?\" Sasuke asked.<br>\r\n\"They were the only ones after myself that mourned for my father longer then others.\" Kenshin said. \"Let's go.\" With that they all headed off again but it was too late when they caught up to them. The three have already confronted the Rogue Ninja. Kenshin and Naruto was about to jump in but then Kakashi held them back. <br>\r\n\"Who do you think you are?\" Asked one of the Rogue Ninja.<br>\r\n\"Like we tell you.\" Ren said. \"Now why are you here, if we like your answer then we may let you live.\"<br>\r\n\"We are in search of a new base of operations and that village back there  seems to be a good place.\" The Rogue ninja said.<br>\r\n\"How do you know about the village?\" Asked Ren.<br>\r\nThe rogue ninja then stepped aside as another came walking up. He was dressed in a grey uniform and had a headband on that could not be seen. With him was two ninja wearing cloaks and there body wrapped with cloth. There was one other following him. A young man that had tan hair and light blue eyes wearing a  large black robe at his side was tied off a headband. \"You have this man to thank.\" The leader said.<br>\r\n\"It can't be.\" Kenshin said.<br>\r\n\"What is it?\" Kakashi asked.<br>\r\n\"That young man, he is from the village.\" Kenshin said. <br>\r\n\"Yori! How could you help this rogues.\" Ren said.<br>\r\n\"We are no rogues\" Yori said. \"This guys promised to put our village on the map as one of the great ninja villages. And if you stand in the way then we will stop you.\"<br>\r\nWith that several of the troops attacked. \"I will not stand for that.\" Ren then punched the air and sent a shock-wave that sent the ninja back.<br>\r\nMore then attacked but then Daisuke stepped in the way and took the staff and then used it and beat all the  attacking ninja.<br>\r\n\"Hold it.\" One of the still able troops said as he had a kunai to Hibiki's throat. \"Step down and your friend will live.\"<br>\r\n\"You fool!\" Yori said.<br>\r\n\"What?\" the ninja said when he get stabbed in the gut. He stumbled back and then saw that the blade came from Hibiki's under arm. \"How?\" He grasped onto his cloak and ripped it off as he fell to show that both of Hibiki's arms where metal.<br>\r\n\"What the?\" Naruto yelled. Naruto then tried to cover his mouth at that and it worked as it was ignored. \"How is his arm's metal?\"<br>\r\n\"When he was eleven his arms were destroyed in an accident and were replaced with prosthetic ones.\" Kenshin said.<br>\r\n\"I tried to warn you.\" Yori said. \"They are part of the Star Points of the Akane-Hoshi. The five ninja that showed the highest level of skill.\" <br>\r\n\"Well then my friend were is the other two?\" The leader asked.<br>\r\n\"I don't know where the other is but I am the fifth.\" Yori said.<br>\r\n\"You don't have the right to call yourself that.\" Ren then charged in and as he did the ninja in his path were sent flying the back. <br>\r\nYori then held a hand up and then created a barrier. Ren hit it and then a second barrier appeared behind him and at his side. \"Ren, your technique is so destructive that the village made you stop working with it. But my barriers were not so I could perfect it to a level you were unable to with your Force Strike.\" He turned his attention to the others. \"And I can do the same with you as well so don't even think about attacking.\" <br>\r\n\"I have seen enough.\" Kenshin said. \"I am attacking and getting them out of here. Go up a head so they can't see you.\" With that they went into action.<br>\r\nKenshin then ran in and slashed at Yori's arm and Yori dropped the barrier. \"Now get Ren and fall back.\" <br>\r\nThey did as they were told. \"Kenshin, I know you would be here.\" Yori said his arm covered by a smaller barrier. <br>\r\n\"You are a disgrace. You don't deserve that headband.\" Kenshin said. <br>\r\n\"Better a disgrace to a something then honoring nothing.\" Yori said and this got to Kenshin. <br>\r\n\"How dear you!\"  Kenshin then jumped back. \"You are lucky that I have no time to deal with you.\" With that Kenshin took his sword and stuck it into the ground and then a wall formed around the Rogue Ninja forces and then ran off.<br>\r\n\"That Kenshin, still full of surprises.\" Yori said.<br>\r\nKenshin soon caught back up with the rest of them. \"Kenshin, you okay?\" Naruto asked. <br>\r\n\"Yeah just had to use a lot of my chakra to delay them.\" He said. Soon the village was getting ready to defend it's self.<br>\r\nThey got him back to the village. Later as Kenshin was getting up to join the defense his grandfather came up to him. \"Grandfather I don't have time for you to tell me to do something.\" <br>\r\n\"Kenshin, win or lose this battle, I want you to go to the Leaf Village and became a full ninja.\" Ryouichi said.<br>\r\n\"Grandfather. Put why?\" Kenshin asked.<br>\r\n\"You are a lot like Takuma in the way that you are loyal to your friends.\" He then throw Ryouichi a sword that matched the one he had. \"That sword is the partner of the one you have been using. The two work as one, like the Uzumaki that developed the true style you are to work best not alone but as a team.\" <br>\r\n\"Grandfather.\" Kenshin then charged in and gave him a hug before heading out the door. <br>\r\n\"You know that Kenshin is a ninja, like his father.\" Ryouichi said to his daughter.<br>\r\n\"And like his grandfather.\" She said looking at her father. <br>\r\n\"It is a shame that this heart of mine can't take the stress of battle are I would help in more then my words.\" He said as he headed for the shelters.</span></div></div>",
            "created":1366305840,
            "id":1574282,
            "title":"Takuma's Three in Action."
        },
        "11121111111":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Reader's Choice.",
                "Reader's Choice."
            ],
            "content":"<div class=\"\"><div> <span>Kenshin made his way to the living room that they have turned to a planning room. \"Good you have arrived.\" Sasuke said. \"So are you going to be able to kill your friend?\"<br>\r\n\"I can not willingly kill a friend, But I will stop Yori.\" Kenshin said.<br>\r\n\"Good now what is the plan?\" Naruto asked. Just then Ren, Daisuke, and Hibiki came into the room. \"Why are you here?\"<br>\r\n\"This is our village and Yori is one of us, we must fight.\" Ren said.<br>\r\nKakashi got up and then walked to them and asked. \"If we allow you to fight would you work with us?\"<br>\r\n\"I would.\" Hibiki said.<br>\r\n\"So would I.\" Said Daisuke. <br>\r\n\"Daisuke.\" Ren said.<br>\r\n\"Admit it the Leaf Ninja are better trained and we need all the help we can get.\" Hibiki said. \"I am not to proud to ask for help.\"<br>\r\n\"Hibiki, you too?\" Ren asked.<br>\r\n\"Yes, I have nothing against the Leaf.\"  Daisuke said. \"If any of the Rogue Ninja have been Leaf Ninja in the past then so be it but I don't wish to condemn others for being outsiders.\"<br>\r\n\"Alright guys you guilt-ed me into it. I will work with you too.\" Ren said.<br>\r\n\"Okay then let's think up a plan.\" Kakashi said. <br>\r\n\"Wait.\" Kenshin said.<br>\r\n\"What is it Kenshin?\" Sakura asked.<br>\r\n\"Working together will help but without knowing too much about the enemy we need to make sure we have every point covered.\" Kenshin said.<br>\r\n\"That is what we are trying to do by planning.\" Kakashi said. <br>\r\n\"Yeah but you guys don't know the village as well as the locals so it would be hard for you to make a plan for defending since you don't know what you are to protect.\" Kenshin said.<br>\r\n\"If that is the case then what do you suggest?\" Naruto asked.<br>\r\n\"We get a former ninja from this village that knows the area.\" Kakashi said. \"But who?\"<br>\r\n\"Well there is always Lord Ryou?\" Daisuke asked.<br>\r\n\"Who is this Lord Ryou?\" Sasuke asked.<br>\r\n\"He is one of the Ninja Master's of the village.\" Ren said. \"He is also the strongest of all the ninja from his home village before he was forced to retire.\"<br>\r\n\"Where is this Lord Ryou?\" Kakashi asked.<br>\r\n\"I will take you.\" Kenshin said. \"Follow me.\" Kakashi and Naruto followed after him. Kenshin turned and said. \"Go and find as many ninja that you can to fight by our side.\" <br>\r\n\"Right.\" Ren said.<br>\r\n\"We will stay here and help.\" Sakura said for her and Sasuke.<br>\r\nKenshin then led Naruto and Kakashi to a simple shack. \"Here we are.\" <br>\r\n\"That is it, but when Ren said Lord I thought that he would have a bigger house.\" Naruto said.<br>\r\n\"Few people know he lives here.\" Kenshin then walked up to the door and then knocked saying. \"Ryou Sensei, your help is needed. May we enter.\"<br>\r\n\"Very well Kenshin.\" Said a voice from the other side of the door. <br>\r\n\"Sensei?\" Naruto asked.<br>\r\n\"After my father died Ryou trained me.\" Kenshin said. <br>\r\nWith that they entered the shack. At the table was a man in his late thirties with straight orange hair and looked to have one blue eye and one green eye. He was wearing a tan short sleeved shirt. \"So what is it that you need?\" He asked.<br>\r\n\"Hello I am Kakashi Hatake  and this is Naruto Uzumaki, both of the Leaf Village. We were hired by the village to help in it's defense against the attack by a group of Rogue Ninja and we need you help...\" Ryou then help a hand up. <br>\r\n\"I understand what you want.\" He said. \"How many ninja are there?\"<br>\r\n\"At least one hundred but there may be more.\" Kakashi said.<br>\r\n\"How many ninja do we have to work with?\" Ryou asked.<br>\r\n\"There are four from the Leaf and at least four from here.\" Kakashi said.<br>\r\n\"Anything else?\" Ryou asked.<br>\r\n\"I am sorry to say that one of the village's ninja, Yori, is part of the enemy forces.\" Kakashi said.<br>\r\n\"Yori, one of the Points of  Akane-Hoshi. If you said it was Ren I would have been worried.\" Ryou said jokily.<br>\r\n\"Sensei this is not the time for your humor.\" Kenshin said.<br>\r\n\"I don't mean to be rude but we should hurry back so we can make out plans.\" Kakashi said.<br>\r\n\"Very well then.\" With that Ryou pushed back and then wheeled himself to the side to reveal that he was missing his right leg. \"Naruto right? Could you open me the long box next to the bed?\" Naruto did as he was asked and when he opened it he saw a leg in it. Shocked Naruto closed it back up. He then lifted open and then saw it was not real. \"Hand that to me.\" Naruto did that.  Ryou then proceeded to attacking it to the stump of a leg that he had. \"There.\" He then reached  to the table and pulled a cane out and  then lifted himself to stand. \"Would you mind Kenshin?\" <br>\r\n\"Not at all.\" Kenshin then placed a hand out and guided Ryou outside. Once there Ryou slit his cane into two and then used them to stay in a standing position. Kenshin then went back in and folded the chair and then mount it to his back. \"Let's go.\" With that they headed back to Kenshin's house.<br>\r\n\"So this will be our central base.\" Ryou said as he was guided to a chair and his wheelchair placed close-by. \"So let me see what you have so for?\" With that they got to planning.<br>\r\nLater Sakura and Ren returned. \"Any luck?\" Naruto asked.<br>\r\n\"Not really, I got about five more.\" Sakura said.<br>\r\n\"I got three to help.\" Ren said.<br>\r\nSasuke then entered with a young girl with him. \"Who is the girl?\" Sakura asked.<br>\r\n\"She is the only one that wanted to help.\" Sasuke said.<br>\r\nHibiki then entered as well. \"I got two to help.\" Hibiki said.<br>\r\n\"Well that is not much to work with.\" Said Ryou.<br>\r\n\"Lord Ryou, any ideas?\" Ren asked.<br>\r\n\"This is Lord Ryou?\" Sakura said to herself. <br>\r\n\"It would be hard even if we had more and there is not enough time to get reinforcements.\" Ryou said. <br>\r\nJust then Daisuke entered. \"So no luck.\" Ren asked.<br>\r\n\"Actually I was able to get help for us.\" Daisuke said. He then showed them. <br>\r\n\"That can work.\" Ryou said.<br>\r\nA hour later the Rogue ninja were on there way to the village for the attack and the village was ready for the defense. </span></div></div>",
            "created":1366820460,
            "id":1577641,
            "title":"Readying for Battle."
        },
        "112":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "survivor ",
                "descendent of a survivor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>3. Are you a survivor or a descendent of a survivor?</span></div></span></div>",
            "created":1320469200,
            "id":1218660,
            "title":"27-39"
        },
        "113":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "survivor ",
                "descendent of a survivor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>3. Are you a survivor or a descendent of a survivor?</span></div></span></div>",
            "created":1320548400,
            "id":1218661,
            "title":"40-over"
        },
        "1131":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "Where you might find the Hokage",
                "About Naruto Uzumaki",
                "About recent events"
            ],
            "content":"<div class=\"\"><div> <span><i>Uzumaki.</i> In days bygone, days forgotten to many who now lived, there had been great power in that name. Power of fame, of dread or hope over the minds and hearts of those who heard it, the power to move <i>nations</i>. Uzumaki had been a name feared and respected by all, equal even to the likes of <i>Senju</i>, or <i>Uchiha</i>, or <i>Hyuuga</i>, and their home had been impregnable, a bastion of secret might equal to the Five Great Hidden Villages.<br>\r\n<br>\r\nBut that was long ago. Thirty and some years have passed since the Fall of the Whirling Tides, and the Scattering of the Uzumaki clan to the far-stretched corners of the world. Such a span is reckoned as a very long time, among shinobi, whose histories can rarely be traced accurately back much further than living memory, and even that oft is suspect in this world of intrigue and lies.<br>\r\n<br>\r\nYes, despite its former glory, the name of Uzumaki now held little meaning among the younger generations of shinobi, unless as a reference in the speech of some aged campaigner. The Hidden Whirlpool Village was forgotten to most, even the sons and daughters of its once long-time allies.<br>\r\n<br>\r\nTo most folk nowadays, <i>Uzumaki</i> means nothing.<br>\r\n<br>\r\nBut not to you. To you, it is everything. It is glory, it is pride, it is the memory of former grandeur and strength, an ideal to uphold, and a sacrifice to honor, the very blood which runs through your veins.<br>\r\n<br>\r\nYes, you are an Uzumaki, a survivor of that forsaken clan, a ghost of days gone by. Old you are, perhaps to the reck of most men, but your hair still holds the scarlet hue of your youth, if a touch dulled and grayed by time and weariness, and your limbs are still strong, if the slightest bit stiff in the morning. Your face is lined, perhaps, with the wearing of sorrows and joys over many long years, but your eyes still shine brightly with a youthful vitality, for if the Uzumaki were slow to age in body, they aged even more slowly in spirit. And you are young, yet, by the measure of your people, few and estranged though they had become.<br>\r\n<br>\r\nCarrying the burden of naught but a scroll and a sword, garbed in raiment practical, if outdated, you reach your destination at last. Gazing up, you behold the mighty gates of the Hidden Leaf, and a rare smile chances across your lips as nostalgia overtakes you for a moment. Much has changed, and even those mighty walls could not stand the test of time and war, from what  you had heard, but they were replaced now, same as they had once been, if perhaps less guarded, for times were peaceful now, truly so.<br>\r\n<br>\r\nYour smile widens.<br>\r\n<br>\r\nYou are here at last, after a long, lonely journey. Here is the Leaf, home to longtime allies of your people, and home to the last Uzumaki of renown, young though he was.<br>\r\n<br>\r\n\"Naruto... Uzumaki...\" you murmur to yourself as you approach the gate sentries, and for the first time in far too many years hope wells up in your chest.<br>\r\n<br>\r\nGreeting the sentry, you ask him...</span></div></div>",
            "created":1365529380,
            "id":1568689,
            "title":"survivor "
        },
        "11311":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "Business or pleasure, it must be attended to at once",
                "You are in no hurry, and you feel like seeing the sights"
            ],
            "content":"<div class=\"\"><div> <span>\"Tell me, good sir,\" you say to the sentry, a young man with dark spiky hair and bandages running over the bridge of his nose, \"Where might one find your Hokage, at this time of day? I wish to speak to her.\"<br>\r\n<br>\r\nThe young man eyes you oddly, the smallest hint of suspicion evident in the glint of his eyes. Not that you could blame him, of course.<br>\r\n<br>\r\n\"What's your business with her?\" his companion asked, sounding rather bored, in contrast with the first.<br>\r\n<br>\r\nYou smile enigmatically. \"I daresay it is more a matter of pleasure than business,\" you say, \"if you'll understand my meaning.\"<br>\r\n<br>\r\nThe first sentry cocks an eyebrow at you, perhaps reading too much -- or too little -- into your answer, but the second one shrugs and waves you on through. You nod politely to both, then pass through the gate into the Village proper.<br>\r\n<br>\r\nAs an afterthought, it would seem, the first sentry calls after you, \"The Hokage's office is in the tower, you can't miss it. I wouldn't talk like that to her face, though, if I were you.\"<br>\r\n<br>\r\nYou smile and wave nonchalantly, before making your way down the main street to the center of the village, where the Hokage Tower rose above the other buildings like a watchful sentinel, standing tall and silent.<br>\r\n<br>\r\nDo you head straight to the Hokage's office, or do you take the scenic route?</span></div></div>",
            "created":1365529500,
            "id":1568691,
            "title":"Where you might find the Hokage"
        },
        "113112":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "A flustered chunin",
                "The hokage's aide"
            ],
            "content":"<div class=\"\"><div> <span>You meander through the streets of the rebuilt Leaf Village, pausing here and there as you take in the sights. Much of what you saw in the Village was new to you, for you had not been there since you were young, but there were still a few things that managed to evoke nostalgia. There were a number of people you could recognize as the children or grandchildren -- or even great grandchildren -- of people alongside whom you had fought back when you were young, when the Whirlpool still stood and the alliance with the Leaf was yet strong, and a few structures still stood from those days, much changed but at heart still the same.<br>\r\n<br>\r\nWith a widening smile, you glance up at the Hokage monument, recalling back when they had been sculpting the second face upon the mountain. Now there were five Hokage, carved of unyielding stone, watching over the village, and from the talk going around it was only a matter of time until a sixth face was added.<br>\r\n<br>\r\nThen, chortling softly at the thought of an Uzumaki leading the Leaf, you glance aside at the passing posterior of a particularly attractive young woman. She had short pink hair, and was clearly a kunoichi of some considerable ability, judging by the way she carried herself but what your attention was her behind, visibly firm and well-shaped. <br>\r\n<br>\r\nFor a fleeting second, the thought enters your mind to cop a friendly feel, but you quickly decide against it, recalling the righteous fury of cute, feisty Koharu-chan that had left you laid up with a broken leg for a week. Konoha kunoichi were nothing if not protective of their personal space, and they were famous for being generally very strong-willed when pushed to it.<br>\r\n<br>\r\nSo you pass on with nothing more than a last inconspicuous admiring glance, and make your way to the Hokage tower.<br>\r\n<br>\r\nBefore you can get there, however, you find yourself waylaid by...</span></div></div>",
            "created":1365708060,
            "id":1569880,
            "title":"You are in no hurry, and you feel like sightseeing"
        },
        "12":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "16-26",
                "27-39",
                "40-over"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>2. What is your age group?</span></div></span></div>",
            "created":1320469200,
            "id":1218657,
            "title":"Female"
        },
        "121":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "survivor ",
                "descendent of a survivor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>3. Are you a survivor or a descendent of a survivor?</span></div></span></div>",
            "created":1320548460,
            "id":1218663,
            "title":"16-26"
        },
        "122":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "survivor ",
                "descendent of a survivor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>3. Are you a survivor or a descendent of a survivor?</span></div></span></div>",
            "created":1320548520,
            "id":1218664,
            "title":"27-39"
        },
        "123":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "survivor ",
                "descendent of a survivor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>3. Are you a survivor or a descendent of a survivor?</span></div></span></div>",
            "created":1320548520,
            "id":1218665,
            "title":"40-over"
        }
    },
    "info":{
        "author_id":"ninjaman90",
        "author_name":"MasterDickmanto",
        "brief_description":"Journey thorough Naruto's world as a Whirlpool Ninja.",
        "created":1320547860,
        "description":"<td align=\"left\" class=\"norm\"><span style=\"line-height:2.0;\">You are either a survivor from the Village Hidden among the Whirling Tides (Hidden Whirlpool Village) or a descendent of a survivor who fines his/her way to the Hidden Leaf with in a year after the Fourth Ninja war. Your reason for being there is to find the only (other) Uzumaki to... well that is your choice. The rules are:<br>\r\n1. No sexual context, or gore.<br>\r\n2. Keep OCing of existing characters to a minimum. <br>\r\n3. You may have relationships between characters.</span></td>",
        "id":1824039,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1366820460,
        "modified":1366820460,
        "pretty_title":"Naruto: Whirlpool Ninja's Revealed."
    }
}