{
    "chapters":{
        "1":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "choices":[
                "Check it out",
                "leave it be",
                "*Readers choice*"
            ],
            "content":"<div class=\"\"><div> <span>You are on Vacation in a small village. There is a Rumor amongst the Townsfolk that in a certain house, there lives a Woman who has inhuman powers. No one who ever visited this Women has come back so far. <br>\r\n<br>\r\nYou ask some People about where the house is and if they know any explanation what kind of powers the woman has. No one has any reasonable explanation but you now know where the house is. <br>\r\n<br>\r\nDo you investigate on your own or do you stay out of that dangerous adventure?</span></div></div>",
            "created":1518375300,
            "id":2451805,
            "title":"The Mysterious House"
        },
        "11":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "choices":[
                "Go inside",
                "Still wait for an answer"
            ],
            "content":"<div class=\"\"><div> <span>You decide to check out the house because you don´t believe that this Woman can simply make everybody who visits them disappear.<br>\r\n<br>\r\nAfter a 30 minute walk away from the village you find the house the townsfolk told you about. Its a small house but relatively modern if you compare it to the village.There are no windows and one big Door in the middle in the house. You get a strange feeling because of the missing windows but still decide to check it out. You knock on the door, but you get no response. You knock again but still hear no answer. After knocking for a third time, you realize that the door isn´t even closed.</span></div></div>",
            "created":1518375720,
            "id":2451808,
            "title":"Check it out"
        },
        "111":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "choices":[
                "I wanted to see it for myself(unwilling)",
                "I didnt hear anything about you(willing)",
                "*readers choice*"
            ],
            "content":"<div class=\"\"><div> <span>You sneak inside, trying to make no sound at all. After all you still don´t know if its  a trap or not. You look around but you need some time so you can see in the dark room. The first room alone is gigantic but there is barely anything inside. You decide to go in further. After reaching the middle of the room, you hear the door close and someone locking the door. You spin around to see a Woman with red glowing hair. At first you only stare at her, wondering what will happen. Suddenly she starts speaking : \"So there finally is another one. I never thought that i would see another human being after the townsfolk telling these stories about me. Tell me, why are you here? \". </span></div></div>",
            "created":1518376800,
            "id":2451816,
            "title":"Go inside"
        },
        "1111":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "choices":[
                "*close your eyes*",
                "*dont close your eyes*",
                "*readers choice*"
            ],
            "content":"<div class=\"\"><div> <span>\"I see... so what exactly did you want to see? why all these people are missing?\". You tell her that you didn´t believe that People would simply vanish after visiting a house.\"Ah yes it´s always someone that doesn´t believe the people in the village. I´ll tell you something : you should have listened to them. I can make people vanish but in a special way. Just close your eyes for one second and i´ll show you.</span></div></div>",
            "created":1518377040,
            "id":2451817,
            "title":"I wanted to see it for myself(unwilling)"
        },
        "11111":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "choices":[
                "Her Pussy",
                "Her Ass",
                "Her breasts",
                "*readers choice*"
            ],
            "content":"<div class=\"\"><div> <span>You close your eyes because she locked the door anyway. You suddenly feel a tingling sensation all over your body, to which you open your eyes immediately.You see the woman growing bigger and bigger, you thought. But what you soon realized was, that you were actually shrinking! You close your eyes again thinking that this was just a bad dream and hoping you would wake up soon. But when you opened your eyes again, the woman grabbed you and brought you up to her face, while you were 3/4 of the length of her hand.<br>\r\n\"I´m glad you saw that you had no other choice. I will show you how the other people went missing, but i can´t guarantee that you´ll like it.But i most certainly will. Oh and dont worry, while being shrunk you are invincible, might be good or bad for you.\" After that she slowly lowered her hand to ...</span></div></div>",
            "created":1518377340,
            "id":2451819,
            "title":"*close your eyes*"
        },
        "111111":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "content":"<div class=\"\"><div> <span>What you already noticed on your way down was, that she didnt wear anything at all. She slowly brought you down to her pussy and starting to rub you against her lips and her clit.She was toying with you for a while, already moaning and getting a bit of her juices onto you. Suddenly she pushed your face into her opening, which was already welcoming you and completely covering you in her juices in not even a second. At the moment of your entry she moaned really loud, and you could feel her body vibrate with you halfway inside of her. You couldnt really see much, except some hot red walls to both of your sides and her juices all in your face. She used you as a toy for quite some time,sliding you in and out of her making you feel like you would drown in her juices any second now, grinding an Orgasm or two out of you. After her second Orgasm you heard her talking again : so now you will see where all the others were,until they got out at night.\" After completing her sentence she pushed you all the way into her, until you passed her cervix and entered her Womb. From feeling you enter her Womb she had another orgasm and was pretty happy about having a new visitor inside of her.\"So like i said you are invincible while you are shrunk, so have fun in there because you also dont have to eat or drink or breathe, so you will stay in there as long as i like. And i wont make the same mistake again so i will make it impossible for you to escape. So you will spend the rest of eternity inside of my womb.</span></div></div>",
            "created":1518377880,
            "id":2451822,
            "title":"Her Pussy"
        },
        "1112":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "choices":[
                "You can shrink people? thats exactly my fetish!",
                "ummm ok i guess"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh so i finally found someone not knowing anything about me? well thats great. Well let me tell you, i  can shrink people down to any size i want. Thats why so many men are missing in town, they all heard about me being able to shrink them down and they didnt believe a word about it. so now they are missing.\"</span></div></div>",
            "created":1518378240,
            "id":2451824,
            "title":"I didnt hear anything about you(willing)"
        },
        "11121":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "choices":[
                "sex toy",
                "ass",
                "everything",
                "tits or womb"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Well i guess that´s even better for you then. I´ll give you a choice i can either use you as my sex toy, keep you in my ass, keep you in my tits, or keep you in my womb. You can decide for yourself what you would rather have.</span></div></span></div>",
            "created":1518378360,
            "id":2451825,
            "title":"You can shrink people? thats exactly my fetish!"
        },
        "111211":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "choices":[
                "3 days",
                "1 month",
                "1 year",
                "eternity"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So you decided to be my Sex toy? great i waited for this for so long. While we´re at it, how long do you want me to use you?\" she said with a devilish and greedy smile. \"Oh and by the way, you cant die or feel pain while shrunk\".</span></div></span></div>",
            "created":1518378540,
            "id":2451826,
            "title":"sex toy"
        },
        "1112111":{
            "author_id":"santobi2",
            "author_name":"Santobi2",
            "content":"<div class=\"\"><div> <span>\"Are you kidding me? I already told you that i waited way too long for another guy to come to my house. That´s it i tried to be nice and you completely ignore how i feel\". She blows some weird dust into your face after which you immediately begin to shrink, until you are as big as her hand. \"Oh dont worry im still gonna use you as my sex toy, but just for as long as i want to.\" She begins to pull down her short skirt, revealing that she doesn´t wear any panties. She starts rubbing you against her pussy and her clit, beginning to moan only by doing that. Suddenly she jams you into her hungry lips that are already awaiting you. You feel her hot and wet flesh surround you, just to be yanked out of it again. She pushes you in very aggressively and you can feel yourself becoming stickier and stickier being covered in all of her juices. All while she pushes you in and out of her tight wet cunt you hear her moaning extremely loud. She cums on you at least 4 times before slowing down.\"Aaahhh im so happy that you were stupid enough to just enter a house without any windows. You feel great down there, but i need to make a short stop because i can hear some footsteps, maybe someone´s going to meet my ass very soon.\" She pulls you out of her and puts you inside of a cage she has prepared just for you. she places the cage in a secret room and leaves while you just hear the door open...</span></div></div>",
            "created":1518379020,
            "id":2451828,
            "title":"3 days"
        }
    },
    "info":{
        "author_id":"santobi2",
        "author_name":"Santobi2",
        "brief_description":"NSFW writing. Includes macro/microphilia",
        "created":1518375060,
        "description":"<td align=\"left\" class=\"norm\">You are on Vacation when you hear about a Woman living in a house nearby.What will happen?<br>\r\nEverything written here will be non-fatal.<br>\r\n<br>\r\nThis is my first Story so i would appreciate some feedback. <br>\r\n <br>\r\nI will still give some rules here if you still want to add something :<br>\r\n<br>\r\nNO scat<br>\r\nTry to use decent grammar and spelling. If i think that its not enjoyable to read i will edit/delete it<br>\r\nNO death. I cant stand death in stories like this</td>",
        "id":2148840,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1518379020,
        "modified":1518379020,
        "pretty_title":"A mysterious house(shrinking,AV,UB etc)"
    }
}