{
    "chapters":{
        "1":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Yes I'd better wake her up before the stench kills me!",
                "No, better to let her sleep, her farts are kinda cute in a gross way."
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes, you'd been out on the town last night and had gotten quite drunk and now you were in a bed with a girl you don't remember and a strange stench hangs in the air.<br>\r\n<br>\r\n<i>pppprrrrtttt</i><br>\r\n\"Well that explains the smell\" you think to yourself, as the girl who lays beside you passes gas underneath the covers, the warm current of air washes over your half naked body before the scorching stench enters your nostrils, whatever she ate last night was not agreeing with her stomach.<br>\r\n<br>\r\nEven though she's laying with her back towards you, it's plain to see she's quite pretty, her face is gorgeous, she has a tight hourglass figure, large breasts and a juicy backside to go along with it, too bad her farts don't smelly quite as nice as she looks.<br>\r\n<br>\r\n\"Mmmm <i>ffrrrppppttt</i>\"<br>\r\nShe moans in her sleep before letting out another fairly quiet fart, the stench is really starting to build up now, should you wake her up?</span></div></div>",
            "created":1431061200,
            "id":1975224,
            "title":"The morning"
        },
        "11":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Dive beneath the covers and face her smelly ass.",
                "There is no way you'll go beneath those smelly covers",
                "There's no need to hide, she's just exaggerating "
            ],
            "content":"<div class=\"\"><div> <span>\"Hey honey wake up\" You say gently to your bed mate.<br>\r\n<br>\r\n\"Hmm? Oh hi sweetie, sorry for the smell I get kinda gassy in the morning <b>PPAAARRRPP!</b> hehe sorry..\" she replies sleepily as she releases a thunderous emission under the covers inflating them considerably.<br>\r\n<br>\r\n\"No need to apologize, this is your house, you can fart as much as you want.<br>\r\n<br>\r\n\"Thanks! <b>BBBBRRRRMMMMPPTTT</b> Aaah much better\" She says as she releases another fart on you.<br>\r\n<br>\r\nCREAK!<br>\r\n\"Oh crap, that's my mom, she's gonna kill you if she finds you in bed with me! Quick get under the covers!\" She whispers to you as she lifts up the covers releasing more of her acrid stench.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1431061200,
            "id":1975229,
            "title":"Waking her up."
        },
        "111":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Meanwhile in the bedroom."
            ],
            "content":"<div class=\"\"><div> <span>Quickly you slip into the tainted humid airspace that lies beneath the covers, you roll make yourself as small as you possibly can, but as you open your eyes you see the large round globes of her ass which are right in front of your face.<br>\r\n<br>\r\n<b>BBBBRRRRPPPTTTT</b> Her buttocks jiggle as she rips a huge on right in your face, the stench in your small cloth prison intensifies significantly.<br>\r\n<br>\r\n\"<i>sorry</i>\" she says quietly, she can't keep it in this is gonna be one hell of a dutch oven.</span></div></div>",
            "created":1431147600,
            "id":1975828,
            "title":"The dutch oven."
        },
        "1111":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Hide him!",
                "Stop your mom!"
            ],
            "content":"<div class=\"\"><div> <span>\"Good morning sweetie\" the girl's mother says, she is wearing tight jeans around her large hips and bottom along with a white tank top which contain her ample breasts and chubby gut.<br>\r\n<br>\r\n\"I'm alright mommy, <b>PAAARRRPPP</b> a little gassy though.\"<br>\r\n<br>\r\n\"Oh sweetie let me help you out, how about a tummy rub?\"<br>\r\n<br>\r\n\"NO, uh no you don't need to do that mommy, I'll just let them <b>PFFRT</b> slip out\"<br>\r\n<br>\r\n\"Nonsense sweetie, you know you love my tummy rubs.\" her mother says as she closes in on the bed.<br>\r\n<br>\r\nIf she gets too close she'll totally notice the guy in bed with you, you need to hide him or prevent your mom from getting close to you.</span></div></div>",
            "created":1431147600,
            "id":1975834,
            "title":"Meanwhile in the bedroom."
        },
        "11111":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Yeah, sure",
                "Ew! No!"
            ],
            "content":"<div class=\"\"><div> <span>Your eyes are tearing up from the vile stench beneath the covers and suddenly the large brown buttocks get slammed into your face, your nose get stuck in her sweaty and smelly crack.<br>\r\n<br>\r\n<b>BBBRRRPPPPPTTTT! FFFFFAAAARRRRPPPPP! PPLLLPPPTT! FFFFFRRRRMMMMPPTTT!</b><br>\r\nSuddenly she starts unloading all her gas right up your nostrils as her mother massages her stomach, you can hear her moan in relief as more of her incredibly rancid winds enter your respiratory system.<br>\r\n<br>\r\n<b>SSSSSHHHHHRRRRRRAAAAAPPPPPTTTTT!</b><br>\r\nShit splatters onto your face as she unleashed a nasty shart on you.<br>\r\n<br>\r\n\"Hehe sorry cutie, I guess I pushed you a little too much, I'll leave you alone to clean up a bit.\"<br>\r\n<br>\r\n\"Yeah thanks mom.\"<br>\r\n<br>\r\nAfter the door slams shut, she lets you out form beneath the covers.<br>\r\n<br>\r\n\"You alright?\"<br>\r\n<br>\r\n\"Yeah, I could use a wash though.\"<br>\r\n<br>\r\n<b>GGGRRROOOOAAARRRNNN</b><br>\r\n\"Ooh I gotta take a shit, you gonna go with me?\"</span></div></div>",
            "created":1431234000,
            "id":1976054,
            "title":"Hide him!"
        },
        "111111":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "In the bath tub.",
                "In the shower cabin."
            ],
            "content":"<div class=\"\"><div> <span>She puts on a bra and a pair of panties, you follow her to the bathroom trying not to stare at her perfect ass, partly to be chivalrous but mostly due to the loud wet farts she's releasing.<br>\r\n<br>\r\nAs the two of you enter the bathroom, she immediately sprints for the toilet and starts her massive morning dump while you wash your face at the sink.<br>\r\n<br>\r\nThe smell in the bathroom is appalling but you manage to have a conversation with the girl despite the rancid act she's committing in the meanwhile.<br>\r\n<br>\r\nSuddenly there's a knock at the bathroom door.<br>\r\n<br>\r\n\"Hey honey I need to use the bathroom, can you let me in?\"<br>\r\n<br>\r\nIt's her mom again, you need to hide quickly, but where?</span></div></div>",
            "created":1431234000,
            "id":1976329,
            "title":"The Bathroom"
        },
        "1111111":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Yes, join me in the shower ",
                "No, just find me some clothes"
            ],
            "content":"<div class=\"\"><div> <span>You quickly leap into the bathtub and hope her mother won't see you.<br>\r\n<br>\r\n\"Please lemme in honey, I really need to take a <b>BBBBBBLLLLLLLLAAAAAAAAAARRRRRRRRRTTTTTT</b> shit\" her mother begs.<br>\r\n<br>\r\n\"C'mon in mom, the door is open.\" The girls reaponds as she dumps more waste into the toilet.<br>\r\n<br>\r\nHer mother barges in clutching her large hindquarters, she pulls down her pants and places her large naked bottom on te bathtub, you are in direct line of fire.<br>\r\n<br>\r\n<b>FFFFFFFFFFFRRRRRRRRRRRRAAAAAAAAAAAAASSSSSSSSHHHHHHHTTTTT!! PPPPPPPPPPPFFFFFFFFFFFFSSSSSSSSSHHHHHHHH! SSSSSSSHHHHHHHHHHAAAAAAAAARRRRTTTTT </b><br>\r\nHer asshole erupts as you are buried with her thick mushy shit, slowly the bathtub fills up as her mother relieves herself of her massive load.<br>\r\n<br>\r\nThe bath is filled to the brim with the chunky stew by the time she finishes dumping and gets up again.<br>\r\n<br>\r\n\"Sorry for the smell sweetie I just couldn't hold it.\" Her mother apologizes<br>\r\n<br>\r\n\"No problem mommy.\"<br>\r\n<br>\r\nAnd just like that ger mother leaves again, another close call and another time of you getting doused with shit.<br>\r\n<br>\r\nGasping for air you emerge from the brown sludge, you are covered from head to toe in her mother's poop.<br>\r\n<br>\r\n\"I'm so sorry that happened I should've have warned you, do you need me to help clean you up?\"</span></div></div>",
            "created":1431320400,
            "id":1976673,
            "title":"In the bath tub."
        },
        "11111112":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Tell her the truth",
                "Lie, say that you're here for her."
            ],
            "content":"<div class=\"\"><div> <span>\"Okay I'll try and find some clothes for you.\" The girl says before leaving the bathroom.<br>\r\n<br>\r\nYou walk out of the bath and into the shower leavig behind brown footprints on the clean floor.<br>\r\n<br>\r\nYou close the curtains and turn on the shower, at first the scat doesn't seem to be budging of your body but after some intense srcubbing you start making progress on the coating of excrement.<br>\r\n<br>\r\nIt takes an hour until you are even remotely clean and you can step away from under the shower, you couldn't continue showering anyway as the thick poo had clogged up the drain.<br>\r\n<br>\r\nYou are drying yourself off as te bathroom door opens again, you turn around expecting your former bed partner with clothing but instead it is her mother.<br>\r\n<br>\r\nShe stares at your naked form in shock, she wasn't expecting this, what so you say to her?<br>\r\n</span></div></div>",
            "created":1431320400,
            "id":1976677,
            "title":"A lonely shower?"
        },
        "111111121":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "content":"<div class=\"\"><div> <span>\"I slept with your daughter and was trying to hide from you in the bathtub, but then you shat all over me so I had to take a shower.\"<br>\r\n<br>\r\n\"Is that so?\" Her mother replies, you can hear the anger in her voice.<br>\r\n<br>\r\nShe starts walking toward you with an angry glare on her face, you back up in a vain attempt to escape her but trip and end up on the floor.<br>\r\n<br>\r\nShe stands over you with a massive grin on her face, before turning around and pulling down her pants revealing her bottom once more, she squats bringing her rear closer to your face.<br>\r\n<br>\r\nWithout warning waste is propelled from her semi-visible anus, this waste a lot more solid than her previous dump and soon you are buried underneath a mountain of it,<br>\r\n<br>\r\nYou kick and scream but the massive pile does not budge, the amount of oxygen runs out quick and you start choking, slowly your life slips away.<br>\r\n<br>\r\nAnother soul lost to the black widow.</span></div></div>",
            "created":1431320400,
            "id":1976679,
            "title":"The truth hurts"
        },
        "111111122":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Yes, even if she's massive and disgusting you have to do this",
                "No way, she's too nasty!"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm here for you <i>sexy</i>\"<br>\r\n<br>\r\nShe is completely stunned by your proposal and seems lost for words.<br>\r\n<br>\r\nShe looks you over again, her eyes lock onto your groin and she licks her lips, but she still seems doubtful.<br>\r\n<br>\r\nShe turns around showcasing her large jeanclad backside \"Do you think you can handle all of <b>PPPAAAARRRRRPPP</b> this.\" She asks as she smacks her ass making it jiggle.</span></div></div>",
            "created":1431320400,
            "id":1976681,
            "title":"Lie, say that you're here for her."
        },
        "1111111221":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Normal sex",
                "Anal",
                "Oral"
            ],
            "content":"<div class=\"\"><div> <span>\"I can't wait <i>hot stuff</i>\" you reply with a wink.<br>\r\n<br>\r\nShe lifts you of your feet and carries you on her shoulder to her bedroom, as she carries you through the hallway you pass her daughter, she casts you a worried glance before returning to her bedroom with the clothes she was carrying.<br>\r\n<br>\r\nThe mother drops you on her bed, before undressing revealing her massive nude form.<br>\r\n<br>\r\n<b>BBBBBBBRRRRRRRRRRRRTMMMMMMMMMMMMPPPPPPPPPPTTTTTTTT!!</b><br>\r\nLifting one of her legs to rip another huge fart she asks \"So what do you want to do with me?\"</span></div></div>",
            "created":1431950220,
            "id":1979735,
            "title":"Sexy time "
        },
        "11111112212":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "No, I know a different method ",
                "What do you have in mind?"
            ],
            "content":"<div class=\"\"><div> <span>She gets on hands and knees with her ass pointing toward you.<br>\r\n<br>\r\n<b>SSSSSSSSPPPPPPPPPLLLLLLLLAAAAAAAAAAAAARRRRRRRRRTTTTTTTTTTT!!</b><br>\r\nA wet fart jiggles her cheeks and showers you in her runny excrement, but nevertheless you prepare for entry.<br>\r\n<br>\r\nYou try as best you can but yer rear is way too large for your member to reach her sphincter let alone penetrate it.<br>\r\n<br>\r\n\"I guess you're too small\" she says \"we could try something else\"</span></div></div>",
            "created":1431954720,
            "id":1979758,
            "title":"Anal"
        },
        "11111112213":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Yes, some manners in bed would be nice",
                "No, her enjoyment is more important."
            ],
            "content":"<div class=\"\"><div> <span>She lays next to you underneath the covers.<br>\r\n<br>\r\n\"Well? <b>PFFFRRRTTT!</b> let's get to it.\" She asks as she lets out a steamy one under the covers.<br>\r\n<br>\r\nYou feel slightly worried as the heat of her emission wafts over you along with its vile scent, should you ask her to keep her gas back?</span></div></div>",
            "created":1431950580,
            "id":1979737,
            "title":"Oral"
        },
        "111111122131":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "content":"<div class=\"\"><div> <span>She stares at you in shock, before responding \"How rude of me, of course I will keep my farts back, I wouldn't want to gross you out.\"<br>\r\n<br>\r\nThough slightly doubtful of her sincerity you dive underneath the covers anyway and start lapping at her private parts.<br>\r\n<br>\r\nYou try every trick you know but nothing even solicits a moan from her all the response you get is her stomach rumbling reminding you of the horrors brewing within.<br>\r\n<br>\r\n\"Homey try the other hole.\" She says as sge moves her knees to her chest revealing her sphincter.<br>\r\n<br>\r\nYou move your mouth to ger revealed asshole and open it to start licking again.<br>\r\n<br>\r\n<b>PPPPPPPPPPPPFFFFFFFFFFFFFFAAAAAAAAAAAAAAAAAAAAAAAAARRRRRRRRRRPPPPPPPPP{/b }<br>\r\nHer butthole suddenly shoots open and fires gallons of its gaseous contents down your throat, as your mouth is still agape she forces it against her rectum, making sure there's no other way for the gas to go but down your throat.<br>\r\n<br>\r\nShe starts letting loose relentlessly as your gut inflates with her putrid fumes before finally your stomach bursts open ending your life.<br>\r\n<br>\r\nAnother soul lost to the black widow.<br>\r\n</b></span></div></div>",
            "created":1431951780,
            "id":1979740,
            "title":"Manners "
        },
        "111111122132":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Yeah, I'll go back to her",
                "No, I prefer you!",
                "No, I'd rather go home."
            ],
            "content":"<div class=\"\"><div> <span>You dive underneath the covers into the massive cloud of gas beneath it and start pleasuring her.<br>\r\n<br>\r\nAs your tongue explores her vaginal cavity she moans and releases another thunderous burst of gas.<br>\r\n<br>\r\nAs you continue pleasuring her, her flatulence gets raunchier and wetter, before she finishes with a massive shart.<br>\r\n<br>\r\nYou climb out from underneath the covers onto her gurgling stomach, she looks at you kindly from between her bounding breasts.<br>\r\n<br>\r\n\"Huff! Huff! <b>PPPPAAAAAAAAAARRRRRRRRRPPPPPPP!</b> Whew good work sweetie!\" She remarks \"If what you did to my daughter was even half as good as this, I'm fine with it.\"<br>\r\n<br>\r\n\"Y-you knew?\"<br>\r\n<br>\r\n\"Yeah, but it's fine, you can go back to her.\"</span></div></div>",
            "created":1431952500,
            "id":1979744,
            "title":"Cunnilingus"
        },
        "1111111221321":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "content":"<div class=\"\"><div> <span>Her mother escorts you to her daughter's bedroom, with a hefty shove she pushes you into it.<br>\r\n<br>\r\nThe girl looks at you with an angry scowl on her face<br>\r\n\"HOW COULD YOU?\" Her daughter shouts at you.<br>\r\n<br>\r\n\"What?!\"<br>\r\n<br>\r\n\"I THOUGHT YOU LOVED ME AND THEN YOU SLEEP WITH MY MOM?\"<br>\r\n<br>\r\n\"B-but.\" You stutter as she grabs hold of you, with incredible strength she pushes your head in between her asscheeks.<br>\r\n<br>\r\nShe opens the floodgates and blasts you with all the gas and scat she has, you barely last a minute before fainting but her assault continues until she is completely out.<br>\r\n<br>\r\nWith a thud your shit stained corpse lands on the floor.<br>\r\n<br>\r\n\"I told you, all men are pigs!\" Her mother <br>\r\n<br>\r\n\"Yes you were right mother.\"<br>\r\n<br>\r\n\"Now then, are you hungry dear?\" She asks as they both glance at your corpse.<br>\r\n<br>\r\nAnother soul lost to the black widow </span></div></div>",
            "created":1431954300,
            "id":1979756,
            "title":"Eating out"
        },
        "1111111221322":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "content":"<div class=\"\"><div> <span>\"Really?\"<br>\r\n<br>\r\n\"Yes really.\"<br>\r\n<br>\r\nShe wasn't nearly as scary as her daughter made her out to be and even her flatulence didn't seem as bad anymore, somehow you'd fallen for this woman and you didn't mind at least one bit.<br>\r\n<br>\r\nThe two of you start making out and groping each other's bodies, slowly it turns into foreplay which turns into sex and soon you lay next to your sleeping lover.<br>\r\n<br>\r\nDespite the massive farts she rips in her sleep she looks gorgeous and peaceful, as you look at her face you think of the future, marriage, maybe a couple kids and growing old with her.<br>\r\n<br>\r\nAnd to think this started as a one night stand with her daughter.<br>\r\n<br>\r\nHappy ending.</span></div></div>",
            "created":1431953340,
            "id":1979750,
            "title":"Big love"
        },
        "1111111221323":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "content":"<div class=\"\"><div> <span>\"Okay, there's probably some clothes in the closet for you.\"<br>\r\n<br>\r\nAnd just like that, she lets you leave.<br>\r\n<br>\r\nYou have gotten several raunchy pictures and phone calls from both the woman herself and her daughter, even offers for threesomes, but you don't feel like returning to another day of flatulent lovemaking.<br>\r\n<br>\r\nYou have escaped her clutches.</span></div></div>",
            "created":1431952740,
            "id":1979747,
            "title":"Home sweet home "
        },
        "1111111222":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "The white outfit ",
                "The apron"
            ],
            "content":"<div class=\"\"><div> <span>\"N-no I can't\"<br>\r\n<br>\r\n\"Well that's too bad, but luckily there's another way you can service me.\" You gaze up at her in fear for what she might say next.<br>\r\n<br>\r\n\"I don't have the time to make dinner tonight, do you think you could...\"<br>\r\n<br>\r\n\"Male you dinner? Yes of course I could do that!\" You reply eagerly<br>\r\n<br>\r\n\"Follow me to the bedroom so I can dress you appropriately.\"<br>\r\n<br>\r\nYou follow her, she grabs two things from her wardrobe, a white outfit and an apron.<br>\r\n<br>\r\n\"Which one do you want?\"</span></div></div>",
            "created":1431349200,
            "id":1976686,
            "title":"Too much"
        },
        "11111112221":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "content":"<div class=\"\"><div> <span>\"Alright just stick yoir arms into the sleeves.\"<br>\r\n<br>\r\n\"These sleeves seem a bit.... Long\" you say before realizing she putting you in a straight jacket.<br>\r\n<br>\r\nBut as you attempt to eacape she pulls the straps tighter locking you in place, you swat at her landing a nasty hit with the cast iron lock on the end of one of your sleeves which causes a nasty bruise on her cheek, in response she hrabs your head and holds it against her butt.<br>\r\n<br>\r\n<i>pppppfffffffffeeeeeeee....</i><br>\r\nA soft squeaker leaves her and enters your nose sapping all your energy, rendering you defenseless.<br>\r\n<br>\r\nWithout any problems she lock your hands behind your back and ties your legs together.<br>\r\n<br>\r\nShe stands in front of you licking her lips again and says \"bon appetit\"<br>\r\n<br>\r\nShe lifts you up before opening her mouth as far as she can and stuffing you inside it face first, bit by bit your body disappears down her throat.<br>\r\n<br>\r\n<b>BBBBBBOOOOOOOOOAAAAAARRRRRRPPPPPP</b><br>\r\nA loud belch annouces the moment your entire body has entered her throat.<br>\r\n<br>\r\nSatisfied the mother rubs her overstuffed gut, pooping out the straight jacket is going to hurt tomorrow but it's worth it, nothing beats the taste of human.<br>\r\n<br>\r\nAnother soul lost to the black widow.</span></div></div>",
            "created":1431350820,
            "id":1976693,
            "title":"The white outfit "
        },
        "11111112222":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "choices":[
                "Yes, show me to the kitchen!",
                "She seems so disappointed maybe I should..."
            ],
            "content":"<div class=\"\"><div> <span>You put on the apron, \"F*%k the cook\" it reads, she might have misunderstood you.<br>\r\n<br>\r\n\"C'mon then chef, go and whisk my cream\" the woman says as she lays down on te bed.<br>\r\n<br>\r\n\"I wasn't role playing I really don't want to have sex with you.\"<br>\r\n<br>\r\n\"Oh... So you're just here to cook?\"<br>\r\n</span></div></div>",
            "created":1431351360,
            "id":1976698,
            "title":"The apron"
        },
        "111111122221":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "content":"<div class=\"\"><div> <span>\"Okay, do you know how to use a dutch oven?\" She asks<br>\r\n<br>\r\n\"Of course I do.\"<br>\r\n<br>\r\n\"Good, cause I'm gonna make one just for you!\"<br>\r\n<br>\r\nShe catches you off guard and shoves you under the covers before putting her lower body under it too.<br>\r\n<br>\r\n<b>BBBRRRROOMMMPPPTTT</b><br>\r\nA loud fart floods your prison with a beefy stench, you try to get out but her hips hold you tightly, there is no escape.<br>\r\n<br>\r\nWith every loud thunderous burst of gas the temperature rises and it gets harder to breathe, but she doesn't stop blasting you with full force, slowly you choke on her thick gas before giving up the ghost for good.<br>\r\n<br>\r\nShe pulls your hot and pale body out from underneath the covers \"Cooked perfectly\" she remarks as she moves your body to her mouth.<br>\r\n<br>\r\nAnother soul lost to the black widow.</span></div></div>",
            "created":1431353760,
            "id":1976713,
            "title":"Dutch oven"
        },
        "111111122222":{
            "author_id":"grayvii",
            "author_name":"Gray",
            "content":"<div class=\"\"><div> <span>\"I guess, if you really want it, I could give you oral.\"<br>\r\n<br>\r\n\"Oh that would be great!\" She replies<br>\r\n<br>\r\nShe bends over onto the bed and pulls down her jeans revealing her large juicy buttocks.<br>\r\n<br>\r\n\"What are you waiting for? Get to it!\" She says impatiently, you had meant her vagina not her ass, but there was no turning back now.<br>\r\n<br>\r\n<b>PPPPPPPRRRRRRRRRRAAAAAAAAAAAAFFFFFFFFFFTTTTTTT!</b><br>\r\nAs you stand face to face with ger rear she rips a massive fart, which blows back your hair \"hehe sorry, I'm a little gassy.\"<br>\r\n<br>\r\nDespite the obvious danger you plunge your head within the smelly crevasse of her bottom and start pleasuring her butthole with your tongue prompting more rancid gas to fly out, but you can't escape as her buns clench holding you in place.<br>\r\n<br>\r\nAfter five minutes of tasting her vile hole, she orgasms releasing a massive wet fart in the process, however her buttocks don't release you yet.<br>\r\n<br>\r\n\"Sorry hun, but you're bot leaving here alive!\"<br>\r\n<br>\r\nAnd hust like that her ass clenches even harder and with a loud crunch your skull is compressed killing you instantly.<br>\r\n<br>\r\nYour lifeless body flops onto the ground, triumphantly she looks back at your corpse, her future meal.<br>\r\n<br>\r\nAnother soul lost to the black widow.</span></div></div>",
            "created":1431352500,
            "id":1976705,
            "title":"Put your money where your mouth is"
        },
        "12":{
            "author_id":"jonikari",
            "author_name":"jonikari",
            "choices":[
                "The girl wakes up and says \"Good morning'",
                "The girl wakes up and doesn't remember you.",
                "The girl wakes up and gets embarrassed after she smells the room.",
                "Nobody wakes up and you get to enjoy yourself a bit more.",
                "You decide to leave the room."
            ],
            "content":"<div class=\"\"><div> <span>You decide to let the mystery girl sleep. You enjoy watching her sleep and the way she snores quietly and lets loose unaware is something you find strangely cute.<br>\r\n<br>\r\nYou lift up the covers slowly to reveal her black round butt and marvel at its greatness for a bit before it blasts another long fart. You decide to risk it and take a closer look at her rear despite its smelly downside. After the last fart die out you shut your nose with your hand and head straight to the girl's lower back area. Right after you arrive, another raunchy fart burst out of the girl, and despite the situation, you manage to enjoy herr butt jiggling all throughout.<br>\r\n<br>\r\nYou then retreat from the smelly area and...</span></div></div>",
            "created":1482344280,
            "id":2252816,
            "title":"No, better to let her sleep."
        },
        "123":{
            "author_id":"jonikari",
            "author_name":"jonikari",
            "choices":[
                "The girl gets closer to you seductively.",
                "The girl decided to head to the bathroom first.",
                "You are both interrupted."
            ],
            "content":"<div class=\"\"><div> <span>After you retreat back to your side of the bed and consider whether or not you should get up, the mystery girl opens her eyes, stretches her arms and says: \"Good morning honey\" with a smile<br>\r\n<br>\r\nJust as it seems like she's going to be completely oblivious to her sleepy gas outburst, she smells the air, realizes what happened and blushes furiously: \"Oh my god! Did I fart in my sleep again? I'm so sorry!\"<br>\r\n<br>\r\nYou quickly say: \"No, it's oka...*cough* *cough*\" as you choke on your words and on her farts which makes her even more embarrassed.<br>\r\n<br>\r\n\"Hold on, I'll open a window!\" the girl say. As she hurries to do just that. And as she return to the bed, you wonder briefly why she doesn't wear underwear like you do. She tells you: \"I'm sorry. I always do this after I eat a big meal before sleep, I should've went to the bathroom at night but I didn't want to ruin the moment.\"<br>\r\n<br>\r\nYou can certainly believe her, even though you still don't remember what happened last  night at all. \"Don't worry about it.\" you tell her \"Besides, you look beautiful even when you fart.\"<br>\r\n<br>\r\nThat last statement had certainly caught her by surprise, but she seems to be feeling a lot better now because of it. What happens next?</span></div></div>",
            "created":1482848700,
            "id":2254984,
            "title":"The girl wakes up and gets embarrassed."
        }
    },
    "info":{
        "author_id":"grayvii",
        "author_name":"Gray",
        "brief_description":"You wake up in bed with a girl you don't remember.",
        "created":1431109740,
        "description":"<td align=\"left\" class=\"norm\">You wake up in a bed with a young black girl who seems to have some fierce flatulence, but way more awaits you later.<br>\r\n<br>\r\nWARNING: This is fetish-writing it contains: Farting, Facesitting, Vore, Anal Vore, Scat and Crushing.</td>",
        "id":2041057,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1482848700,
        "modified":1482848700,
        "pretty_title":"The Black Widow"
    }
}