{
    "chapters":{
        "1":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "Jenna, your 13 year old younger sister, who is very popular blonde",
                "Chasity, your hot black haired neighbour with Ccups 20 years old",
                "Samantha, your 16 year old girlfriend, who has dark red hair and is super sexy",
                "Mladdie, your 18 year old older sister who your friends find hot, blonde",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>you were walking home one day when you saw a a key lying on the ground with a note next to it. The note reads, \"This key is magical. Insert into someone and they will freeze. Turn right and they will open up like a suit for you to step into and assume their identity, by possessing them. Turn to the left to mind control them. You pick up the key, and go home thinking it won't work, but praying that it will, as you really need a break from being you. You arrive home and the first person you see that would be fun to use the key on is...</span></div></div>",
            "created":1368334800,
            "id":1588517,
            "title":"start"
        },
        "11":{
            "author_id":"sbloggsy",
            "author_name":"sblogsy",
            "choices":[
                "Right - possess",
                "Left - control",
                "Rape without turning the key",
                "Pull out the key",
                "Run away"
            ],
            "content":"<div class=\"\"><div> <span>Jenna was a stupid cow. Throughout your whole life, she had bullied you. Every time you killed an animal, she'd cry to your parents. Whenever you tried to see what lay under your own skin, she'd tell mummy and daddy. Every time you'd try to take a pretty girl into and isolated area, she'd stop you. She'd keep on confiscating all of your knives, but you'd just steal mummy's money and buy a new one. Mummy had been running out of money ever since daddy left.<br>\r\nYou hated them all.<br>\r\nIf you were her, you'd feel, like she did, be human, like she was, understand, everything.<br>\r\nYou were indifferent, if she died, she died, if this fixed you, it fixed you.<br>\r\nEven if it didn't, you could do whatever you fancied as her, hurt whatever or whoever you wanted, feel pain. When mummy came home late from work, you could hurt her.<br>\r\nBeing would be perfect.<br>\r\nSo, you snuck into her room, she was in pink pyjamas, you could tell from her legs sticking out from under the covers, she was on her phone under there. You flung the covers upwards and, as soon as she turned over, stabbed the key deep into Jenna's throat with a satisfying crunch.<br>\r\nTime seemed to stop. Jenna didn't bleed. Rabbits always bled when stabbed...<br>\r\nA sudden idea popped into your head. You could have sex with her right there, and with consent. All you had to do was turn the key left.</span></div></div>",
            "created":1542862800,
            "id":2580739,
            "title":"Jenna, your 13 year old younger sister, who is ..."
        },
        "111":{
            "author_id":"sbloggsy",
            "author_name":"sblogsy",
            "choices":[
                "Show love to Jenna",
                "Call the girl back",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Why run?<br>\r\nThe key turned right.<br>\r\nAs if a samurai had vertically swiped down her body in order to cut her in two, a deep line appeared from between her clavicles and unzipped downwards, below the cleavage-v on her button up pink pyjama top.<br>\r\nThen, with unrealistic speed, like a child's balloon when popped, deflated and flopped on the floor as if rubber, nylon or leather.<br>\r\nBut it wasn't.<br>\r\nIt was skin and cotton pyjamas. You place an hand on her cheek and push through, feeling no bone or muscle in the way. It was a weird kind of cold. Your hand went completely numb momentarily, until you withdrew your hand. <br>\r\nThe cotton was completely unchanged and, eager to see the effects of your decision, unbuttoned the cotton to reveal that the wound stretched below the waist of her bottoms.<br>\r\nYou pull down the bottoms, careful not to touch the suit, but feeling numb from proximity alone. Yes, the bottom of the line was obscured by pubic hair...<br>\r\nOh well, you couldn't wear the suit anyway, going near it would make you so numb that you would be paralysed. You bend over the mess on the bed and reach for the key. The key. as soon as you pull it from Jenna's neck, the tingling sensations vanish.<br>\r\nAfter doing this, you realise what had happened. You strip completely naked, with a mild erection beginning to form. How annoying. Jenna didn't have to deal with anything like that. You stand up and hold the suit out in front of you, seeing uncovered nipples and pussy for the first time.<br>\r\nYou begin by placing your legs into Jenna's hollowed out limbs... It is loose fitting and weightless, not in any way convincing, like baggy polyester trousers. Whatever, the experience was fascinating on its own anyway. You lead your arms through as if into a one-z and tug at the end. Your hands didn't even reach the end of her fore-arms - and your arms were longer than hers as a fact. Maybe without that fat she had from lunch everyday, she'd fit.<br>\r\nSweating, you close the deal and pull the mask over your head. It rests there, like a hood, obscuring everything, even your vision.<br>\r\nYou sit down on the bed, nearly tripping in the process, disappointed and feel a sharp prick on your butt. The key. Oh well. It was worth a shot.<br>\r\nYanking the neck part of Jenna's mask far down over your head until it lined up with your own neck with your left hand, you stab the key in horizontally, in line with her old cut from the key, with your right.<br>\r\nSuddenly, the numbness intensifies, spreads to your head and almost makes you black out. You look down and see the fault in the suit mend itself, stitching itself together with infinite tiny teeth, as though the jaws of a terrible beast.<br>\r\nSlowly, the total body numbness and paralysis fades and sensations return.<br>\r\nYour mouth is forced shut by a powerful clamping force, a headgear attached to your jaw, yet exerted over small, flabby cheeks. You breathe sharply and swiftly through tightened, constricted nostrils. Your mouth aches and slowly, agonisingly, opens, your swollen tongue slipping out along with a stream of drool. <br>\r\nYour heart pounds in your chest. Your large, heavy chest. Large balloons had been inflated there, it seemed. You felt rough glandular tissue expanding to fill the vibrating cavity. Bouncy jiggly fat forms around it as you glance down in horror to rapidly puffing up boobs. Those small round, flaccid nipples that were on the original skin-suit erected and stood up like diamonds. The illusion was intensified by sight and feeling of shrinking shoulders and torso.<br>\r\nYou wiggle your toes, then your small feet the ankles resting on the floor.<br>\r\nYour tiny hands clench into tiny fists as your mind struggles to adapt to new nerve endings.<br>\r\nThen  a tiny shard of bone snaps into existence at your wrists and your arms twist violently at the shoulders in reply.<br>\r\nYour legs go into spasm, kicking and writhing against the freezing cold floor and you nearly faint.<br>\r\nYour eyes rapidly blink as they adjust to a sudden influx of blinding light.<br>\r\nSomehow, flopping in the manner of a fish, you roll over and feel the pleasure of freezing cold against where your genitals were before. Weirded out, you roll over onto your ass.<br>\r\nYour tongue slithers back into the mouth, your mouth closes around it, you shake your head and raise it up, your chin pointing down as you admire a new body. You place your hands onto your breasts and cup them, diamond-hard nipples poking into your softened palms. You try to sit up, but your body, dizzy, slams itself back forward into the cool floor. The coolness drifts up your bum crack, along with your awareness of its magnitude and pertness.<br>\r\nTo reduce breeze between your legs, you close your thighs together, acutely aware of a missing element. At the same time, you swivel your calves and lower legs at the knee to either side of your upper legs, creating an 'm' shape.<br>\r\nYou sit up and your hand dashes towards your new vagina.<br>\r\n\"Hello!\"<br>\r\nInstinctively, you try to answer, but cough stray strands of hair out of your mouth. Jenna's long blond hair. Jenna's credited characteristic. Oh how you marveled at the beauty of it, you wanted to stroke it...<br>\r\nbut...<br>\r\n...<br>\r\n\"Sorry for the wait. Jenna, are you there.\"<br>\r\nA girl's voice. From the phone on Jenna's bed.<br>\r\n\"I needed the loo,\" this girl says.<br>\r\nYou're on speaker.<br>\r\nJenna wouldn't masturbate in these conditions, with one of her friends listening.<br>\r\n\"Please say you're not upset. I didn't mean to make you angry. Your brother just creeps me out.\"<br>\r\nA tear falls from your eye.<br>\r\n\"That's all.\"<br>\r\nThen another.<br>\r\n\"Look, I'm gonna hang up now.\"<br>\r\nThen another tear.<br>\r\n\"I'll see you tomorrow.\"<br>\r\nListening to this girls voice made you cry.<br>\r\nYou cried, then you sobbed, then you cried some more. Such grace in her voice. You appreciated it. You loved it.<br>\r\n<br>\r\nYou.<br>\r\nFelt.<br>\r\nLove.<br>\r\n<br>\r\nYou were human. Jenna. Human.<br>\r\n<br>\r\nYou killed Jenna.<br>\r\nRegret.<br>\r\nGuilt.<br>\r\nRecompense.<br>\r\n<br>\r\nYou loved Jenna.<br>\r\nHer body appealed to you.<br>\r\nYou really did want to use it...<br>\r\n<br>\r\nYou let go of her. Killed off who she was. But not how she was.<br>\r\n<br>\r\nYou didn't wear Jenna, you were Jenna.</span></div></div>",
            "created":1542862800,
            "id":2580754,
            "title":"Right - possess"
        },
        "1111":{
            "author_id":"sbloggsy",
            "author_name":"sblogsy",
            "choices":[
                "Airport",
                "School",
                "Left"
            ],
            "content":"<div class=\"\"><div> <span>Your hand is drawn towards your now sensitive crotch.<br>\r\n<br>\r\nAt last, you question your confidence, your readiness not just to exploit her, but also...<br>\r\n<br>\r\nForget it. The moist red slit is visible through thin wisps of hair. You laugh and guffaw boyishly.<br>\r\nYour right middle finger, followed by the other enter the forbidden cavern. It reminds you of the time you first discovered masturbation. The pleasure.<br>\r\nThe accommodating crack yawns open receptive, but as your fingers explore deeper the organ convulses, trying to snap shut like a Venus fly-trap, but your fingers spread out and stretch it.<br>\r\nYour left hand, unoccupied, gropes at the tit.<br>\r\nYour mouth forces open, drooling as you continue.<br>\r\n<br>\r\nYou almost black out at the climax, orgasm, screaming girlishly. You lie in a puddle of effeminate secretions, coating your thighs, having splattered onto your stomach, caking your hands and wrists, and, from when your had tried to wipe your profusely sweating forehead, a translucent white crusting of sweat and lady-waters, even a rogue tear...<br>\r\n<br>\r\nYou crack it out until you cum one more time before getting up, messy and leaving the room.<br>\r\n<br>\r\nYou open the door, stumbling and wobbling awkwardly.<br>\r\nAware of how your new body handled the weight of your boobs, you carefully descend the stairs, turning your feet sideways as you tread down her steep narrow staircase. The foreign jiggling and the way that your turned out legs expose your... clitoris to the cold only make you feel more uncomfortable.<br>\r\nDrip. Drip. The carpet stains as you take each step.<br>\r\nYou reach the bottom floor and open the door.<br>\r\nThe Summer's heat keeps you just above an unbearable temperature, while your lack of hair or clothing made sure that you weren't too comfortable.<br>\r\n\"I want to have sex!\" is what you try to yell, but your voice sticks inside your throat. No, more than that. Nothing happens inside your throat. Not the familiar sensation of your vocal chords vibrating and giving the unique texture of voice to the air you expel from your lungs. Would you ever be able to speak again? In your old body it was so easy. What happened to that? Darn. Could it ever be reversed?<br>\r\nYou firmly caress the sharp pointed key in the palm of your hand...<br>\r\nSpinning on the pads of your feet, you saunter inside, drunk with emotion. Emotion you had never felt before. Emotion that you still were not able to fully comprehend.<br>\r\n<br>\r\nLying on the floor of your living room, still naked, you come up with a plan of action. Jenna's tutor had always been someone you had fantasised about getting to know more... intimately. She would knock on the door in less than 45 minutes. <br>\r\nJenna's tutor had a name. A name you couldn't remember. A face you most certainly could. The prettiest face you had ever seen. Wait... You never appreciated beauty like this. You just used to like looking at her smile and thinking that even you could do a more convincing fake smile but like how her face went dark when Jenna wasn't looking. Now you could do that face and were considering her face as a thing of beauty. Beauty. Such a short word and yet a concept so foreign. Did anyone really understand it. Why some people liked looking at some people and others others.<br>\r\nYou'll have time for that when you're inside. Right. This was your sister. Your boring, flat, washboard sister. How could you enjoy this fully, unless you were someone more mature than this test. Yes. That all this was a test. You were...<br>\r\nBut why couldn't you speak?<br>\r\nThat didn't matter. All that mattered was the kind, rich, semi-Asian woman who, out of pure generosity, tutored Jenna in her school subjects. Retard girl. That woman was too nice, yet fake. A paradox.<br>\r\nShould you get dressed? No. What was the point?<br>\r\nYou imagine her running her hands up her bone-thin legs, up her miniskirt or petite dress or, Sitting down, having opened her long legs, groping her large breasts, or her slender abdomen, or pulling the bobble and freeing her long, black, silky hair. Or, in a w-sit...<br>\r\nThe doorbell rang.<br>\r\nYou skip your way over to the door, high on fantasy. And tug it open.<br>\r\nTutor drops her handbag at the entrance and smiles, \"You're sexy like your mother,\" she says. Feeling a faint, lazy disgust, you shank the key into her neck and turn... you hesitate... left.<br>\r\nNo! Idiot! What if you can't turn right afterwards. You're powers were limited enough as it was, you had just removed the chance of a taxi ride out...<br>\r\nHer eyes, frozen in shock, grow blank, and her features stiffen and tense.<br>\r\nShe is wearing massive heels, translucent skin-coloured stockings, a short black zipped-up skirt, a smart, button up dress-shirt and a thick pair of glasses.<br>\r\nInstinctively, you command her: \"Strip!\"<br>\r\n\"S...tr...ip,\" she murmurs. Her smile widens.<br>\r\nWith one hand, she removes the band around her ponytail and her locks bounce vivaciously. She flicks it back, then turns your head either side, leads the hair, which flips, whips and bounces. The other hand crawls down her chest, over her breasts and glides down, now across her abdomen, and stops, pinching and groping between her legs. You stare, dumbfounded and amazed. You marvel at her figure, stunned. She was tall, with her height mostly in her legs, and of a healthy weight, not horrifically skinny yet packing not enough fat to be judged or even noticed at a simple glance. Her breasts were moderate, mediocre in size compared to many models and such, but somewhat larger than those of middle-school girls. She seemed a bit stretched in a way, hair too long, arms too long, legs too long...<br>\r\nYet, when she was there, visibly massaging her crotch and unbuttoning her shirt slowly, these flaws were of little significance.<br>\r\nAs soon as your thoughts wonder, she pulls up her skirt, uncovering plain white panties. This was exceptionally unexpected and your heart (or Jenna's heart, perhaps, you weren't sure) fluttered, fluctuated in rhythm and began to speed up.<br>\r\nShe licked her lips and winked.<br>\r\nThis gives her ample diversion to unzip and pull down the skirt...<br>\r\nBoth of your hands move onto it, entertaining themselves with Tutor's warm inner thighs.<br>\r\nThen, acting on a desperate mind (your acceptance had a kind of disturbing, frightening effect on yourself), as Tutor, removes her shirt with her left and inserts her hand into her matching snow-coloured patternless bra with her right, you turn the key in her neck to the right. <br>\r\nHer knees buckle, she bends at the back and her face shifts to a look of dismay when her hands arms shoulders-neck-faceboobiestummyvagnbuttlegfeet all dissolve and deflate into a pile of skin, around part of it, a second layer, the hosiery (pantyhose), the heels clatter on the floor and topple and fall, and, somewhere, buried among the messy tumulus of skin, was the bra belonging to the woman who was standing there stripping for your pleasure.<br>\r\nPanting, you lounge both of Jenna's hands against Jenna's legs, leaning forwards, legs straight, acutely aware of the awkward, unfamiliar breeze interacting with Jenna's anus.<br>\r\n<br>\r\nWere you really ready to use that key to take off Jenna? Why? Was she not good enough?<br>\r\n<br>\r\nYou had a bit of a dilemma:<br>\r\n<br>\r\nYour, Jenna's, tutor's taxi was arriving in one hour. You could get changed into her, have some fun, mess with makeup and find some clothes in Jenna's wardrobe before then, then ask the cab drive to take you to an airport perhaps. Maybe, you could take Jenna along in your handbag as hand-luggage. You didn't require anything else.<br>\r\n<br>\r\nYou could also pack up the tutor in your own school rucksack and get dressed as Jenna. You could see who was still in school for extracurricular and consider sharing the gift of the key around.<br>\r\n<br>\r\nYou could also try turning the key left and seeing if it re-inflates the body or does anything special.</span></div></div>",
            "created":1544158800,
            "id":2587044,
            "title":"Show love to Jenna"
        },
        "11113":{
            "author_id":"sbloggsy",
            "author_name":"sblogsy",
            "choices":[
                "Experiment with make-up and wait for the taxi",
                "Make more suits now"
            ],
            "content":"<div class=\"\"><div> <span>You turn the key left.<br>\r\nLike a magic trick, the suit began to squirt out colourless fluid, reminding you of the fun you had just had. It soaks through the visible clothes like an inflating bubble..<br>\r\nYou drop to Jenna's knees to get a closer look and see, to some surprise, that it was not liquid as you knew it. Like a plastic or cellophane wrapper. Then, it constricted and became thin, gluing the bra, panties, hose and maybe even the heels to the suit. The sheen disappears as if whatever the suit had secreted had been fully withdrawn now.<br>\r\nCLICK.<br>\r\nThe key suddenly twists to neutral position and eases itself out of the hole.<br>\r\nYou take the key into your hand, feeling noticeable warmth on it's surface. How strange. You put the key in your mouth, between Jenna's teeth, you think.<br>\r\nYou straighten up the body, feeling the extra weight of the heels, but admiring how cleanly the clothes had stayed attached. You had been certain the bra and heels at least would have slipped to the wrong position on the suit, but no, Damn. How good would it be to wear a suit like that. Since Jenna was fused to you, you could wear Tutor over the top of her and probably not feel any difference. Or you could try to use the key to take Jenna off and swap suits, or maybe even wear Jenna on top of Tutor.<br>\r\nShudder. Maybe that decision would be too much for now. It would be better to try and see what was possible before making any rash decisions. Besides, it might be a bit lewd to keep this woman without a skirt or top. Maybe some of Jenna's clothes might fit. It was well worth trying, just in case.<br>\r\nEnough thought.<br>\r\nYou could barely contain your excitement as you slip Jenna's body into the opening of your new bodysuit. It's an easy fit. Jenna's body was small, this one was larger. The sensations of the suit still excite you and you feel slightly more moist underneath the suit. You tug the legs up in one go, flick the top half over your back, and slide your arms into the sleeves, your hands only reaching Tutor's forearms. You spit the key onto the suits left arm-piece and struggle to find it with both hands. Fiddling with it in frustration, you pull down the hollow mask and push the key into the neck-hole.<br>\r\nYou remember that this was one of the best bits, but brace yourself for discomfort, pain and generally overwhelming sensations.<br>\r\nNUMBNESS!<br>\r\nCONCUSSION?<br>\r\nDON'T FAINT.<br>\r\nYour head wobbles and spins as you fight the expected feeling, no caught unaware this time.<br>\r\nYou focus hard on the numbness. To see if you can control it. You can't.<br>\r\nSlam.<br>\r\nNo, you couldn't stay upright. You force yourself to try to feel the jolt, the reverberations, but no.<br>\r\nThe paralysis subsides.<br>\r\nYou had crashed forwards. That was all. But the wave, the lead-blanket feeling was retained even with your body-stacking.<br>\r\nIt worked.<br>\r\nYou could stack every woman in the world onto you, every teenage girl, every teacher.<br>\r\nYour mouth slackens, yet you could tell it had stretched downwards and the skin tightened around it. Hard lips had formed. You concentrate as hard as possible on your teeth. They were in better shape now, they were Tutor's. How did that happen? Was there some way that the suit had compressed Jenna's mouth inwards before imploding it's own. That would make some sense. But what would that mean for removing the suit. Would you just be de-crushed, like a spring made of smart memory metal? Would it be heated? Was that what the chemical secretions were, an undiscovered smart material. The substance that could manipulate temperature and pressure, causing whatever was inside the suit to reduce its volume. It would hurt if it wasn't for what was probably anaesthetic mixed in with it all. Was that why the key was warmer? No, if that was right it would be scorching. Thousands of Kelvin, burning your skin. Maybe it was coated in agents to reduce the effects of heat. Maybe it cooled itself with something. What the hell. It couldn't be magic. That key had to have scientific properties that could revolutionise the world. Humanity could be saved. <br>\r\nWait.<br>\r\nIf...<br>\r\nIf this suit had overrun your previous self, were you thinking in Tutor's brain. That could explain this inquisitiveness. But had you replaced Jenna's kindness or libido or innocence or whatever the hell she brought to the table. You hyperventilate and drool, panting like a dog.<br>\r\nDrool. Was this from Tutor's salivary glands? Did it smell different from Jenna's. No, stupid, all saliva smelt more or less the same. Anyway, Jenna's cum didn't come from your testicles. Cum. Come. Hilarious.<br>\r\nWhat about the thumping heart? Whose heart was that? The heart. Not yours or Jenna's, the heart had to be Tutor's. But then where were you stored? And, if you had used someone with heart disease, you would get that disease, and probably die during this phase of the transformation. Avoid girls with heart conditions. Still about 2.5  billion eligible right. You glance down at the magnificent chest. The snow-white bra,  though, you expected to feel it constricting your whole breasts. Covering them. But instead, it is light, weightless, natural. Normal.<br>\r\nYou anticipated erect nipples underneath, but you didn't even feel nipples there. Your torso leaps in reaction to collision with the ground.<br>\r\nThe heels were the weirdest though. It was as if nerve endings had grown out through the foot and into them. You could feel no join between flesh and plastic. But the plastic responded to the temperature and the fall. The. Plastic. Heel. Hurt.<br>\r\nThe movement in the ankle was limited, and you couldn't flex your toes with your feet any more. Your legs were trapped in hose.<br>\r\nThrough soft layers of hair, you cover your ears, which ring violently on the inside at a ridiculous high pitch.<br>\r\nThen pain. Convulsion. Unable to scream, you throw your head and neck forwards, but your voice is still stuck, caught in your new throat.<br>\r\nThe wave. That was the only way to describe it. In Jenna it been in the eyes. Momentary blindness followed by blinding light. Light that brought immeasurable instantaneous pain to your body. This was worse.<br>\r\nYou heard a rip, a tearing sound you did not understand. Your eyes popped. It was just like that. They popped.<br>\r\nThen vibration. Not so much painful as intense. Pounding the sockets where you weren't sure if your eyes still were. The light was manageable this time. And the pain. But fear. Fear and trembling. Like an electric rod had been stuck in both eyes. Or a chainsaw was being driven into his brain.<br>\r\nAn unmistakable buzz.<br>\r\nOne that was curious. Yes. Dramatic. Yes. Horrific. YES<br>\r\nThrashing and crying like a little girl. Screaming for Mommy, for Heaven, for God. Anything.<br>\r\nYou think of the masturbation. That calms you. Your voiceless shaking ceases. The torture, the pain-free agony. Ceases.<br>\r\nYou don't feel your tights. You are your tights. They were not a second layer of skin on your legs. But THE skin on your legs. You had no awareness of the underwear. It was neither part of the hose or part of you or an independent entity. It was just there. For show.<br>\r\nYou slurp up the strings of hot saliva from your mouth as you sit up and ogle your mature form. Boobs. Check.<br>\r\nYou touch the sensitive area between her legs. You believed that there would be pleasure felt underneath. But you only felt it on the surface of the tights. They felt good. Really good. Like a vagina. Like Jenna's vagina.<br>\r\nRubbing harder makes the pleasure increase.<br>\r\nLike masturbation.<br>\r\nBut clean.<br>\r\nYou got all the feedback of an orgasm. But nothing got wet. But it was just as good. If not better. If not more.<br>\r\nYou drag yourself over to the table. You position your crotch against it and hump the table.<br>\r\nBang.<br>\r\nHallelujah.<br>\r\nBang.<br>\r\nHallelujah.<br>\r\nBANG!<br>\r\nHALLELUJAH!!<br>\r\nOrgasm.<br>\r\nBut nothing comes out.<br>\r\nNothing need turning on. You could go all day. Forever. Until death.<br>\r\nWhy not?<br>\r\nThis was it. The ultimate feeling. What more could you want? What more could you need?<br>\r\nYou can't.<br>\r\nYou rush to grab the rogue pencil on the table and stab at the groin as hard as possible. The pencil cracks in half and breaks.<br>\r\nYou jump onto the table and -crack- you ride on shattered fragments of wood.<br>\r\nIf you wore gloves, then fused them to the suit using the key (right-left) you could be unstoppable.<br>\r\nJenna had a pair of them in her room.<br>\r\nYet, the power could be too much, it could corrupt you. It could destroy you.<br>\r\nWhere would you go anyway? You run upstairs. Finding it as easy to walk in heels as it was to walk on feet. Even if the pressure distribution of force between the toe and the heel was odd at best. You got used to it on the way up the stairs and go into Jenna's room. You open her wardrobe and, there, at the bottom, next to some boots, were her gloves. You would put these on soon anyway and see if you could add them to the suit. But first, you could add make-up and lipstick to the suit and bond that to make Tutor's face indestructible too and get the Taxi to take you somewhere. Or see what you could do with the gloves now and go outside on your sex-rampage.<br>\r\nMoney. Strength. Intelligence.<br>\r\nIt was fantastic</span></div></div>",
            "created":1551589200,
            "id":2625886,
            "title":"Left"
        },
        "112":{
            "author_id":"hi2u",
            "author_name":"Hi",
            "choices":[
                "Have sex with her, as planned ",
                "Do something else with her",
                "Someone knocks on the door"
            ],
            "content":"<div class=\"\"><div> <span>You decide to stay as yourself for now and get to control your little sister, so you turn the key left. She suddenly sits herself up on her bed, without any emotions on her face. You look at her \"Jenna?\" she turns her head \"waiting for instructions. \"At first, please, act a bit more like normaly\", you tell her. \"Sure big bro\" she tells you with a smile on her face. Jenny's personality was back and under your command, the question is what to do with her ?</span></div></div>",
            "created":1595586660,
            "id":2874030,
            "title":"Left - control"
        },
        "13":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "turn right (her body opens up)",
                "turn left (mind control)",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Samantha walks up to you, asks where you have been, and then sees the key. Before she can ask what it is you stab her with it and it just slides into her body halfway and she freezes. You think, \"Wow, it actually works!!!\" You then.....</span></div></span></div>",
            "created":1368334800,
            "id":1588519,
            "title":"Samantha, your 16 year old girlfriend, who has ..."
        },
        "131":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "go inside and explore Sami's body",
                "try to leave Sam's body",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You turn the key to the right and hear a click. Samantha's body opens up vertically, separating her front from her back. You step inside of the open Samantha and it instantly closes around you and you feel your body inside of her fade away and then you try to move your hand and see Samantha's hand move. You look down and Samantha's dark red hair falls into your face. Then, once you push it out of the way, you see Samantha's perky Bcup breasts pushing out from under the tank top you are wearing and realize it worked. You yell, \"Yes\" and are kind of freaked out that Samantha's (Sami's) voice came out of your mouth. You are ready to have some fun do you....</span></div></div>",
            "created":1368334800,
            "id":1588525,
            "title":"turn right (her body opens up)"
        },
        "1311":{
            "author_id":"darkental",
            "author_name":"Dark123",
            "choices":[
                "Go to the mall to get some clothes",
                "Get a swimsuit from samanthas room and go to the pool",
                "Leave samantha's body to explore someone's else's"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You start touching your breasts, they feel great! As you do this you go down with one of your hands ans start rubbing samanthas pussy. You cannot stop yourself! After cumming and resting a bit you are ready to explore how it is to go out as a woman.</span></div></span></div>",
            "created":1521349200,
            "id":2465897,
            "title":"go inside and explore Sami's body"
        },
        "14":{
            "author_id":"freddychief",
            "author_name":"mcy",
            "choices":[
                "get her a boyfriend ",
                "get out of her body and make her your slave",
                "make out with her"
            ],
            "content":"<div class=\"\"><div> <span>You walk to your sisters room and she sees you and asks 'what do u want?' But you stab the key in her back and you turn to the right then her body opens soon u see a soul flying around but the soul Flys straight into u and u shake but finds out u have her memory so u walk into her body and hold her boobs and wonderful what u should do now</span></div></div>",
            "created":1470546000,
            "id":2192649,
            "title":"Mladdie, your 18 year old older sister who your..."
        },
        "143":{
            "author_id":"hi2u",
            "author_name":"Hi",
            "choices":[
                "Masturbating",
                "Going out of her body, and mind controlling her",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you mean by \"making out with her\" ?</span></div></span></div>",
            "created":1592814480,
            "id":2854849,
            "title":"make out with her"
        },
        "15":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "your best friend's girlfriend, Allison, who is 17, has brown hair, A cup tits",
                "your mom, 34 Julia, CC cup boobs, light brown hair",
                "your best friend, Stan, 16, strawberry blonde hair",
                "a celebrity, your older sister won a contest to meet",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you see_____ and use the key on them.</span></div></span></div>",
            "created":1368334800,
            "id":1588606,
            "title":"someone else"
        },
        "151":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "turn right (her body opens up)",
                "turn left (mind control)",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You walk into your apartment where you and Stan, your best friend live. You see Allison, who is Stan's girlfriend waiting by the TV, because you guys gave her a key. She walks over to you, giggles drunkenly, and she asks when Stan will be back. You tell her about 10 minutes and then stick the key into her and she freezes. You then...</span></div></div>",
            "created":1369890000,
            "id":1600259,
            "title":"your best friend's girlfriend, Allison, who..."
        },
        "1511":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "you have to pee",
                "Stan is home",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You turn the key to the right and hear a click. Allison's body opens up vertically, separating her front from her back. You step inside of the open Allison and it instantly closes around you and you feel your body inside of her fade away and then you feel dizzy, as though you were actually drunk.  You fell a small weight on your chest, but as Allison had A cups your chest isn't much bigger than normal. You look down and Allison's brown hair falls into your face. You sit down on the couch with some trouble, and suddenly realize...<br>\r\n</span></div></div>",
            "created":1370149200,
            "id":1602261,
            "title":"hey Ally, I'm you!"
        },
        "15111":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "see Stan walk in",
                "fall asleep "
            ],
            "content":"<div class=\"\"><div> <span>The effects of Allison drinking have finally hit her body and you suddenly feel an overwhelming urge to urinate. You run dizzily into the bathroom and sit down to pee. You feel the weird sensation of pees spraying out of Alli's.... Your pussy, and then you remeber to wipe, but only after pee runs down your leg. After relieving yourself you...</span></div></div>",
            "created":1371099600,
            "id":1610605,
            "title":"you have to pee"
        },
        "15112":{
            "author_id":"ravenrain",
            "author_name":"Raven",
            "choices":[
                "Keep going",
                "Go to the bathroom, mind control her and become stan"
            ],
            "content":"<div class=\"\"><div> <span>Stan walks through the door with a smile. <br>\r\n\"Hey babe.\"<br>\r\nYou feel a bit of discomfort knowing that stan is/was a close friend and him calling you that. However, your body betrays you a bit as he walks over and kisses your neck.<br>\r\n\"How was work, baby?\" You ask, trying to put on the act.<br>\r\n\"Was a long day. Wanna come lay down with me? Watch a movie and help me unwind?\"<br>\r\nYou nod and figure its just a movie, what harm could their be?<br>\r\n<br>\r\nAs you get to the room, he walks to the TV and puts in a movie. Some cheesy romance flick and lays down next to you. He smiles and wraps his arm around your shoulder. 10 minutes in, his hand moves down, thinking nothing of it, he grasps your breast and pulls on the nipple, illiciting a moan from your throat. In no time hes kissing you, and to your surprise, you're kissing back as he reaches under your shirt. <br>\r\n<br>\r\nSoon, you are both undressed and he has your arms tied above you. He finds the bag of toys and begins to tease your nipples, clamping them to keep them sensitive and hard, a toy is pushed against your clit. The buzzing makes thinking hard. As soon as he feels you are wet enough, he plunges deep into you, giving you rough hard strokes. You can feel the electricity start to build inside you and before long, you clamp around him, Cumming hard. Just as you cum,  you feel him start to pulsate as thick ropey sperm shoots inside your tight soaked hole. </span></div></div>",
            "created":1599686040,
            "id":2900147,
            "title":"Stan is home"
        },
        "15113":{
            "choices":[
                "that you can check out a female body for the first time in your live.",
                "something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You realize something else besides that.  You realize...</span></div></span></div>",
            "created":1455771600,
            "id":2106111,
            "title":"something else"
        },
        "151131":{
            "author_id":"haxxare",
            "author_name":"haxxare",
            "choices":[
                "Stan's home!",
                "Ally's phone buzzes"
            ],
            "content":"<div class=\"\"><div> <span>A grin slowly forms on your face as the realization hits you - you had a sexy female body at your fingertips! You drunkenly stumble to your bathroom, and stare at the mirror. Ally's reflection stares back.<br>\r\n<br>\r\n\"Hello Ally!\" you say with a sly expression on your face, seeing her do the exact same thing. Hearing her voice from your lips, and seeing her reflection move when you do really turns you on. It might be the alcohol, but you felt yourself becoming wet. <br>\r\n<br>\r\nThe grin doesn't leave your face as you slowly begin to take off your - Ally's - t-shirt. You reveal a small black bra around Ally's small boobs as you throw off the shirt. You begin to run your hands over your borrowed body, loving the feeling of soft hands on your soft skin. A small moan escapes your lips, causing you to become even more turned on. <br>\r\n<br>\r\nHungry for more, your hands fumble with the bra strap, before finally dropping it. Ally's small boobs - your boobs - are very perky and seeing them completely bare makes you let out a small moan. Your hands quickly make their way to them - you love how they feel, they're sensitive and really make you wet.<br>\r\n<br>\r\nAnother moan later, you find yourself still playing with your boobs, but wanting more. <br>\r\n<br>\r\nSuddenly...</span></div></div>",
            "created":1559468940,
            "id":2668062,
            "title":"that you can check out a female body"
        },
        "1511312":{
            "author_id":"haxxare",
            "author_name":"haxxare",
            "choices":[
                "Play some more in Ally's body",
                "Try using the key some more"
            ],
            "content":"<div class=\"\"><div> <span>\"I better look at that...\" you muttered, reluctantly pulling yourself away from the mirror. The air conditioning tickles your naked boobs while you walk, looking for Ally's phone. Even though you weren't playing with yourself, it just felt nice to be walking around as a topless girl. Ally's body was so petite, she felt so light. \"There it is!\" you find her phone on the couch.<br>\r\n<br>\r\n'Hey babe running late ill be home in an hour xx' is what you see on the phone.<br>\r\n<br>\r\nYou smile. So Stan would be late. That was perfect. You run back to the bathroom, small boobs jiggling. Staring at your reflection, you begin to play with your boobs again. Eventually, without thinking about it, one of your hands slips into your shorts.<br>\r\n<br>\r\nA moan escapes your lips as the hand grazes your clit, causing a shock of pleasure to run through your body. Hungry for more, you dig your hand in tight, and run your fingers across Ally's pussy.<br>\r\n<br>\r\n\"Hnnng\" you moan as you struggle to unbutton your shorts. Finally, they slip down around your legs. You give your reflection one last look - seeing a flustered, topless, tipsy Ally with a hand in her panties - and run to your bed. You jump onto the bed, spread your legs, and aggressively dive your fingers into the slit between your legs.<br>\r\n<br>\r\nIt's a feeling like nothing you've ever felt. The pleasure is indescribable. Your hands go back and forth, in and out, you moaning as you keep pleasuring yourself. Eventually, with a final loud moan, you feel yourself come. You lay on the bed, in the bliss of Ally's afterglow.<br>\r\n<br>\r\nAfter a few minutes you get up and think to yourself - what now? You had about 45 minutes left before Stan should be home.</span></div></div>",
            "created":1559469480,
            "id":2668066,
            "title":"Ally's phone buzzes"
        },
        "15113122":{
            "author_id":"haxxare",
            "author_name":"haxxare",
            "choices":[
                "\"Have sex with me\"",
                "\"Get dressed and wait for Stan\""
            ],
            "content":"<div class=\"\"><div> <span>You decide that it would be fun to see what else the key can do. If it was boring, you could always just take over Ally again and play some more. But how to get out?<br>\r\n<br>\r\nYou fiddled with your back, before finding a small bump where you had stabbed Ally with the key before. After a few seconds of fiddling, you feel a strange tingling sensation around your whole body... and your back swings open like a door.<br>\r\n<br>\r\nBack to your normal self, but inside Ally's body, you step out and see her, still wide open, waiting for someone to step inside and take control of her hot naked body. Walking around her, you swing her shut and see the key fully sticking out of her back. What would happen if you rotated it the other way? You grab the key and rotate it a full half circle to the left. It clicks twice, and you push it into her back, where it disappears.<br>\r\n<br>\r\n\"Huh?\" you say. Nothing happened. Ally is completely still, though. \"Hey, Ally?\"<br>\r\n<br>\r\nShe turns around, blank expression on her face. Seeing her naked from this angle was still nice - you still remembered what it had felt like being inside her. <br>\r\n<br>\r\n\"Uhh... are you ok?\"<br>\r\n<br>\r\n\"Yes\" she responds mechanically.<br>\r\n<br>\r\n\"What's up?\" you ask, concerned that something happened.<br>\r\n<br>\r\n\"Awaiting instructions.\" she said, still mechanically as if in some sort of trance.<br>\r\n<br>\r\n\"As in... my instructions?\" you ask. \"Ok, tell me your name.\"<br>\r\n<br>\r\n\"My name is Allison Myers\"<br>\r\n<br>\r\n\"Jump up and down\" Ally starts jumping, small boobs bouncing around. You watch with interest, but she doesn't stop.<br>\r\n<br>\r\n\"Ok, you can stop now. And act normal\" she stops, and shows some sign of emotion. <br>\r\n<br>\r\n\"Hey, Stan said he'd be an hour or so late\" Ally says to you, completely oblivious or apathetic to her state of undress, and your presence there. You realized that she would indeed do everything you asked her to. Some thoughts crossed your mind...</span></div></div>",
            "created":1559470020,
            "id":2668069,
            "title":"Try using the key some more"
        },
        "151131221":{
            "author_id":"hi2u",
            "author_name":"Hi",
            "choices":[
                "Continue with Ally",
                "Seek someone else"
            ],
            "content":"<div class=\"\"><div> <span>\"Ally, i want you to have sex with me. Act like you wanted to have sex with me for a long time now and like I'd be so much better than Stan. Fuck me with the passion you'd fuck him. If you're good enough we might make this a regular think, which is what you desire. You still love Stan, it's just our sex which is much better. You'll never tell this to anyone.\" You tell her, hoping it works. Suddenly she comes to you puts her arms behind your head and gives you a long passionate kiss. Then she gets on her knees and begins to take your trousers off. \"Oh god it's huge\" she tells you, as your dick pops out. She lays herself on her bed, spreading her legs, showing you her wet pussy. \"Get over here and fuck me\" she tells you \"i've wanted this for so long\" You go to her, grab her hips and slowly start to enter your dick into her thight pussy. \"Wow, your so much bigger than Stan\" she moans as you start going in and out of her. Her breast were shaking so you place both of your hands on them and start to massage them gently, causing Ally to moan. <br>\r\nYou two have lived in the same flat for so long and you always admired her beauty, but you never even dreamed that you would get this far. This key simply was the best thing that has ever happened to you. Coz here you are, fucking your best friend's hot girlfriend. Just because of that key. You lean forward and begin licking her nipples causing her to cry in pleasure, shouting your name, which drives you over the edge. You both orgasm at the same time. She gets a multiple orgasm by the feeling of you creampieing her pussy. You shoot all your semen into her before telling her to go take a shower and prepare for Stan. <br>\r\n<br>\r\nYou look at the key, which was laying next to you.</span></div></div>",
            "created":1593353580,
            "id":2857955,
            "title":"\"Have sex with me\""
        },
        "152":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "turn right (opens body up)",
                "turn left (mind control)",
                "the key unleashes a new power"
            ],
            "content":"<div class=\"\"><div> <span>you are examining the key closely as you walked into your house. you walked further into the house you bump into you mom thus causing the key go go into her chest thus making her freeze in place. after shaking your self out of your daze after bumping into you mom you notice the key actually worked see the key was in your moms chest and she is not moving at all. now what direction will you turn the key or due they key have a surprise for you?  </span></div></div>",
            "created":1368766800,
            "id":1591867,
            "title":"your mom, 34 Julia, CC cup boobs, light brown hair"
        },
        "1521":{
            "choices":[
                "Go inside",
                "Try to undo this ",
                "Try the key on someone else "
            ],
            "content":"<div class=\"\"><div> <span>You push the key to the right and are shocked to find that your Mother's body opens up, leaving a large hole that you could easily fit it. It was as if your Mother was simply a suit of armor just waiting to be filled with a living person. <br>\r\n<br>\r\n\"Huh, weird,\" you say to yourself laughing at the understatement for a moment and walking around the strange display for a moment. Sure enough, your Mother's light brown hair is at the back of the display, her favorite yoga pants caressing her curves, her tank top that she actively worked out in across her shoulders. It was simply the front that was opened up, waiting for someone fill the void. </span></div></div>",
            "created":1388811600,
            "id":1721592,
            "title":"Right into your Mother's panties "
        },
        "15211":{
            "choices":[
                "Go on your Mother's workout routine",
                "Something Else "
            ],
            "content":"<div class=\"\"><div> <span>After your inspection of this display, you step forward and begin to fit yourself into the empty space. At first you feel strange, simply with your arms in the corresponding holes and your legs trapped in the lower half of it. You stand and begin getting impatient after a few minutes.<br>\r\n<br>\r\n\"Well, this is a great situation,\" you mutter. Then it started, you feel tightening beginning in your arms and legs, not painful but simply claustrophobic in nature. You wiggle your toes and fingers as your Mother's limbs correspond to your commands, complete with the large diamond wedding ring on her finger wiggling and the feet with pink toe nail polish obeying your commands. Then you see a top on what previously was just arms and legs, it begins lowering over your own face and torso. For a moment you feel pressure and see darkness, you attempt to let out a breath for a moment but cannot and begin to panic for a split second. Then it happens.<br>\r\n<br>\r\nYou feel the world rushing back to you, the harsh, bright, artificial lights that was in the foyer of your house. Your body letting out quick, nervous breaths that correspond with your momentary inability to breathe. Then the signals of your body begin to set in, the feeling of restraint on your chest, the tickling of your bare shoulders by your hair now restrained in a ponytail, the feeling of tightness on your legs and ass. You look down and sure enough your chest is now your Mother's, complete with the sizable breasts, the toned tummy brought on by the ritual of working out. Your legs are now encased in black yoga pants leading up to the painted pink toe nails that had greeted you a second ago.<br>\r\n<br>\r\n\"Wow,\" your Mother's voice exits your throat. You touch your throat for a moment to make sure, and yes no Adam's Apple. The clear coat of paint on your long fingernails and large wedding ring greeting you once again, the same as it did a few minutes ago. What now? </span></div></div>",
            "created":1388984400,
            "id":1722770,
            "title":"Go inside"
        },
        "152111":{
            "author_id":"howler53115",
            "author_name":"CCRFan1",
            "choices":[
                "Slip back into \"mom\" mode and enjoy your workout.",
                "Exit mom's body.  Maybe find a replacement."
            ],
            "content":"<div class=\"\"><div> <span>You walk over to your gym bag and sling it over one shoulder.  Next you tuck your yoga mat under your left arm.  You head towards the door where you slip your purse over your other shoulder while grabbing the keys to your SUV.  If you don't get going you're going to be late for yoga.  You really don't want to be at the back of the class again, you'll just have to deal with your errant son when you get back.  Opening the door you step out into the sunny day.  The warmth feels good on your face and you smile.<br>\r\n<br>\r\nYou're most of the way to the yoga studio before you realize what your doing.  Without even thinking about it, you've been acting just like you mother Julia.  You're both a little freaked out, and also excited.  It was just a bit scary how easily you got lost in your mom's personality.  But at the same time, it was so cool being able to impersonate her so flawlessly.  No one would be able to tell you weren't the real Julia.<br>\r\n<br>\r\nYou had to figure this out.  Do you want to keep on being your mom for now?  Or is this just too much?  Maybe you'd better get out of her before you lose yourself completely.<br>\r\n<br>\r\nWhile thinking about this you pull up to the yoga studio.  If you did get out of your mother, there would probably be some other hot ladies her to try the key on.  What to do?</span></div></div>",
            "created":1520917200,
            "id":2464257,
            "title":"Go on your Mother's workout routine"
        },
        "1522":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "You decided to order her to do something else",
                "Someone walks in",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>You wanted to test it out so you turned left just to find out what happened, after you did the key went loose and fell into your hand as your mother still standing became almost zombie-like  said in a monotone voice, \"what shall i do for you?\" You were just surprised that it worked so you said this as kinda a joke, \"um...take off your bra and show me your boobs\". <br>\r\n<br>\r\nYou then started laughing as you expected your mom to slap you in the face and say 'don't ever say that to a woman!' Or something like that what happened next was not what you expected. You watch in total awe as your mom begins to peel off her black shirt and rip off her bra then let the boobs show themselves off gor your enjoyment.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://2.bp.blogspot.com/-PUvGRRz3f6U/TvQ9NvJh4fI/AAAAAAAABqQ/7XoErM-bJrc/s1600/Catalina_Cruz_nude_009%40hotnwildbabes.blogspot.com.jpg\" target=\"_blank\">http://2.bp.blogspot.com/-PUvGRRz3f6U/Tv...</a><br>\r\n<br>\r\nYou were not expecting this to actually happen so you started gaping while your mom's face stared blankly at you waiting fir more orders. You shook off your surprise and asked your mom, \"wait... will you do anything i tell you to do?\" Her response is, \"yes, i am meant to do any and all requests that are asked of the key owner.\" You didn't know how to respond so you say, \"alright mom, I want you to have all the interests of me so we can talk together\".<br>\r\n<br>\r\nIt was pretty weird order but he was having a rough time in school and needed to talk about some of the things he liked. Your mom's blank expression changed to that of excitement as she said, \"does that mean we can talk about (favorite topic)\" your eyes brightened as you say, \"yes, of course!\" So you you talked with your mom (still topless about your favorite topic until...</span></div></div>",
            "created":1544418000,
            "id":2587999,
            "title":"turn left (mind control)"
        },
        "15221":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Become your mother",
                "Command her to become a clone of yourself"
            ],
            "content":"<div class=\"\"><div> <span>After you and her are done talking you decide to make her do something rather inappropriate as some may say. \"Mom, i want you to start groping yourself\", she then stands up and lifts her hands up and begins to grope herself. \"Like this (your name)?\" You answer, \"yes\" as she continues 2ith the show as you would put it.<br>\r\n<br>\r\nYou realize that it had gone on long enough so you tell her to stop, \"Alright (your name)\". You think of other things that you could do with this power, you then think about how cool it would be to be your mother or mabye have a clone or something like that as her.<br>\r\n<br>\r\nHowever which one?</span></div></div>",
            "created":1552169040,
            "id":2628187,
            "title":"You decided to order her to do something else"
        },
        "15222":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Father",
                "Sister"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you and her are talking, your _________ walks in, they are im total amazement as they see your mom (still topless) sitting with you and having a good time. You notice this and walk up to them hurriedly, who is this person?</span></div></span></div>",
            "created":1552168680,
            "id":2628185,
            "title":"Someone walks in"
        },
        "152222":{
            "author_id":"hi2u",
            "author_name":"Hi",
            "choices":[
                "Samantha, your 13 year old sister ",
                "Maddie, your 18 year old sister"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one of your sisters ?</span></div></span></div>",
            "created":1593944700,
            "id":2861766,
            "title":"Sister"
        },
        "1522222":{
            "author_id":"hi2u",
            "author_name":"Hi",
            "choices":[
                "left to control her",
                "right so her body opens "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The door opens and you see your older sister Maddie walk inside. Before she can say something about you and your topless mom you stick the key into her belly and turn ...</span></div></span></div>",
            "created":1594026660,
            "id":2862402,
            "title":"Maddie, your 18 year old sister"
        },
        "1523":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "put on mom's lower body",
                "go after someone else's body",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>you where about to turn the key when it glowed and shoot a beam at you. it projects it's new ability's to you which are the ability to take a person apart with the key in them and combine them to others you taken apart. then the ability to project more keys so you can use them on more then one person at a time. after that new information you take apart you mom by silting her lower half and upper half of her body. you now wonder what to to next sure you could put on you mom's lower half right now or you cold combine you moms lower body with another person's. but what to choose?</span></div></div>",
            "created":1368766800,
            "id":1591881,
            "title":"the key unleashes a new power"
        },
        "154":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "Ke$ha",
                "Taylor Swift",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you use the key successfully to control your sister and tell her to take you with her. Which celebrity was she going to meet?</span></div></span></div>",
            "created":1388811600,
            "id":1721434,
            "title":"a celebrity, your older sister won a contest to..."
        },
        "1543":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "Katy Perry?",
                "Emma Watson?",
                "something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it....</span></div></span></div>",
            "created":1388811600,
            "id":1721437,
            "title":"someone else"
        },
        "15431":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was she meeting her privately?</span></div></span></div>",
            "created":1398747600,
            "id":1788974,
            "title":"Katy Perry?"
        },
        "154311":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "turn right (her body opens up)",
                "turn left (mind control)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>your sister is seeing Katy in private and you go with her. Once the security guards let you in, you use your control over your sister to make her block the door. Then, before Katy can can scream in horror, you jab her with the key and then.....</span></div></span></div>",
            "created":1398747600,
            "id":1789011,
            "title":"Katy Perry you are mine"
        },
        "1543111":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "go explore your new body",
                "have lesbian sex with your sister"
            ],
            "content":"<div class=\"\"><div> <span>You turn the key to the right and hear a click. Katy Perry's body opens up vertically, separating her front from her back. You step inside of the open Katy and it instantly closes around you and you feel your body inside of her fade away and then you try to move your hand and see Katy's hand move. You look down and Katy's black hair falls into your face. Then, once you push it out of the way, you see Katy's perky DDcup breasts pushing out from under the Red Carpet Dress you are wearing. You yell, \"Yes\" and are kind of freaked out that Katy's voice came out of your mouth. You are ready to have some fun and your sister is still guarding the door. Do you....</span></div></div>",
            "created":1400648400,
            "id":1800220,
            "title":"Hey Katy... I'm you!"
        },
        "15433":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "Anna Kendrick.",
                "other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other celebrities. But who is your target?</span></div></span></div>",
            "created":1511931600,
            "id":2421900,
            "title":"something else?"
        },
        "154332":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about 'Marco Polo' actress Claudia Kim? </span></div></span></div>",
            "created":1513227600,
            "id":2427894,
            "title":"other."
        },
        "1543322":{
            "author_id":"ipee234",
            "author_name":"P-Two-Three-Four",
            "choices":[
                "Angelina Jolie?",
                "Khloe Kardashian?",
                "Scarlett Johansson (I hear many people think she’s kinda hot) ?",
                "Tina Fey (wait, what?! Really?) ?",
                "Thank God for more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let’s get some new options, huh?</span></div></span></div>",
            "created":1600728000,
            "id":2907595,
            "title":"No"
        },
        "155":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "Selina Valdez, dark raven hair girl, thick figure and E-cup breast neighbor",
                "The neighbor mother across the street doing her garden, pear shaped, short hair",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see____and use the key on them after looking around your neighbors yards</span></div></span></div>",
            "created":1498626000,
            "id":2344172,
            "title":"someone else"
        },
        "1551":{
            "author_id":"haxxare",
            "author_name":"haxxare",
            "choices":[
                "Turn the key left (mind control)",
                "Turn the key right (possession)",
                "Remove the key and find someone else"
            ],
            "content":"<div class=\"\"><div> <span>You see Selina walking down the street in front of your neighbor's place. Her long black hair was tied back in a ponytail, and she wore a simple white dress. It really showed off her breasts, and was flared out at about knee height. \"She'll do, I guess\" you thought and walked towards her.<br>\r\n<br>\r\n\"What do you want, loser?\" she asked as you walked closer.<br>\r\n<br>\r\n\"Nothing\" you said. As you walked past her, you took a step and quickly stabbed her back with the key. It went right into her skin, and she froze. \"It works!\" you exclaimed, before looking around. No one anywhere. Now what were you going to do?</span></div></div>",
            "created":1559470740,
            "id":2668071,
            "title":"Selina Valdez, dark raven hair girl, thick figu..."
        },
        "15512":{
            "author_id":"haxxare",
            "author_name":"haxxare",
            "choices":[
                "Go back to Selina's house and check yourself out in detail",
                "Have some fun outside as Selina, maybe humiliate her"
            ],
            "content":"<div class=\"\"><div> <span>Quickly, you turn the key to the right, and watch with some surprise as Selina seems to split open in the middle, and swings open like a door. <br>\r\n<br>\r\nYou look around. Still no one. Perfect. With Selena's back wide open, you peer inside. It's just a black void of nothing. What the hell was this thing, anyway? Well, you thought. No point in having second thoughts now... Carefully, you step into Selina's half-cut-open body, and feel her back slam shut behind you.<br>\r\n<br>\r\nA rush of air and new sensations greets you - as well as a heavy weight on your chest. \"Whoa\" you breathe, feeling the difference even in your throat as you did. When you look down, you are greeted by the sight of two enormous balls of flesh - Selina's boobs. Your boobs. With a devilish grin forming on your face, you cup them.<br>\r\n<br>\r\n\"Who's the loser now, loser?\" you laugh to yourself, still low-key fondling your new assets. You walk back towards Selina's house, thick thighs rubbing together under your dress. Just the thought of it is turning you on, and you steal another peek at your chest. <br>\r\n<br>\r\nSo what now?</span></div></div>",
            "created":1561492500,
            "id":2678463,
            "title":"Turn the key right (possession)"
        },
        "155122":{
            "author_id":"benmd95",
            "author_name":"Benmd95",
            "choices":[
                "Stop",
                "Masturbate in front of the 14 year olds"
            ],
            "content":"<div class=\"\"><div> <span>You decide why go inside to have fun. After all it isn't your life that will be ruined if you do anything in Selena. In fact you decide why not strip and play with her body right out in the back yard. Near the pool with the 14 year old boy next door is having a birthday. You should really be nice and give him a gift Selena. While the parents are inside drinking you decide to take off your dress revealing your new body to the world. In a purple push up Bra and Black thong. Damn Selena is more of a whore then I thought. Do you stop here or take it further?</span></div></div>",
            "created":1594086240,
            "id":2863047,
            "title":"Have some fun outside as Selina, maybe humiliat..."
        },
        "1553":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "Someone stolen your key.",
                "You going abroad and use the key in the other countries.",
                "more."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you like the other events?</span></div></span></div>",
            "created":1514955600,
            "id":2436301,
            "title":"More"
        }
    },
    "info":{
        "author_id":"thonan",
        "author_name":"thonan",
        "brief_description":"you gain a key to possess or control others",
        "created":1368376140,
        "description":"<td align=\"left\" class=\"norm\">You gain a key that allows  to possess others. If you turn the key to the left you control the other person, and if you turn it to the right the person's body opens and you can possess them by wearing it.</td>",
        "id":1933076,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600728000,
        "modified":1600728000,
        "pretty_title":"The Key to Someone Else's Life"
    }
}