{
    "chapters":{
        "1":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "choices":[
                "\"...Sure, why not...\"",
                "\"...C'mon, you're not serious are you?..\"",
                "\"...Enough with this BULLSHIT, AJ!..\""
            ],
            "content":"<div class=\"\"><div> <span>In a nearly empty classroom, you and your best friend, \"Payton\", enjoy your afternoon lunch together with the room to yourselves. Your back has been hurting dreadfully for days now, and Payton has offered to help. With her black boots off in her long black socks, you lay on your belly as she walks on your back, slowly and carefully...It feels amazing.<br>\r\n<br>\r\nPayton is 5,5 and her weight is perfect enough to get the job done without hurting too much. She's an interesting girl, with her favorite colors mostly consisting of black and purples as her nails are always painting black, her eye liner black, and maybe some red to go along with it her and there. The only thing that didn't match these colors is her long dark brown hair, which reaches down to her waist  You stand a good two inches over her. <br>\r\n<br>\r\nAfter your back felt better the two of you sit up and get back in your chairs. You pick at your food as she places her black boots on again. You turn to her.<br>\r\n<br>\r\n\"Jeez! That felt amazing\", you say to her, \"Thank You\". <br>\r\n<br>\r\n\"No problem. Glad I could help\", she says with a smile.<br>\r\n<br>\r\nYou nod, \"If you ever need something from me, don't hesitate to ask.\"<br>\r\n<br>\r\nThe two of you chat about horror movies, politics and other random topics for some time. And then, she sits up.<br>\r\n<br>\r\n:\"You know\", she starts, \"There is ONE thing you could do for me\".<br>\r\n<br>\r\n\"Certainly, anything you want\".<br>\r\n<br>\r\nShe nods, then reaches into her backpack. You watch closely, wondering if she possibly needed any help with homework, or for you to look over a poem she was trying to write. However, neither a poem or a sheet of homework was pulled out, but rather, a book. A rather dated and beaten up one to say the least. <br>\r\n<br>\r\n\"What's that?\", you ask. Payton always has interesting things to show to you. You recall the one time she showed you an old Voodoo doll she found inside of the attic of her home<br>\r\n<br>\r\n\"It's nothing, just a \"Spell Book\" I found in my attic. I just want to test it out. Say a few words from it and see what happens. Wanna be my test subject?<br>\r\n<br>\r\nWhat do you Say?</span></div></div>",
            "created":1538629200,
            "id":2559296,
            "title":"CHAPTER ONE: THE SPELLBOOK"
        },
        "11":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "choices":[
                "\"...Well...I don't know...\"",
                "\"...Sure, I'd love to, AJ...\"",
                "\"...Are you FUCKING insane?!?\"",
                "\"...Um...uh, al-alright...\"",
                "\"...What do I get out of it?..\""
            ],
            "content":"<div class=\"\"><div> <span>She springs to her feet with joy. You get up with her. After all, it's the least you can do for her after the job that she did for your back. <br>\r\n<br>\r\n\"Great! Oh thank you!\" she says with glee, \"I knew you'd be open minded. Alright, stand still. This won't hurt a bit. I think\"<br>\r\n<br>\r\n:\"Wait, what are you going to do to me?\" you ask with a smile.<br>\r\n<br>\r\n\"We'll see\", she says. She lifts the book to her sight, opens it and reads a spell. The words, said clearly and nicely from her mouth are \"Subtraxerim Altitudo\".<br>\r\n<br>\r\nGlowing rays of blue blind you and pass through your very body. The light is near blinding. You rub your eyes and open them, trying to get some sort of a hint of vision.<br>\r\n<br>\r\nEventually, your eye sight does come around, but your surroundings are no where close to what they were like before. Everything from the Payton, the desks, the chairs, and even the pencils have grown at least sixty feet. Right now, at this moment, you're the size of a six inch doll. <br>\r\n<br>\r\nShocked and excited, Payton jumps up and down, happy that the spell was a success. The jumps boomed throughout the room. Soon, they began to get louder as she runs towards you.<br>\r\n<br>\r\n\"Oh My GOD! It worked it actually worked!\" her voice boomed. \"Oh come here, lets have a closer look at you\".<br>\r\n<br>\r\nYou look up to see a gigantic hand coming your way. Before you can move, she scoops you up from off the ground and holds you up to her excited face and eyes. <br>\r\n<br>\r\n\"So, can I ask for another favor?\" she asks you. Her voice is as loud as a helicopter taking off.<br>\r\n<br>\r\n\"This wasn't it\" you respond confused.You're still trying to Process exactly what just happened. <br>\r\n<br>\r\n\"Of course not\", she giggles, \"Let me explain. I can get lonely. Real lonely. I've hardly got anyone to hand out with or talk to when I'm at home. And Ever since you've gotten that job, you're always at work. I want to have you around forever. <br>\r\n<br>\r\nYou gulp. <br>\r\n<br>\r\n\"So...so what now?\" you ask hesitantly.<br>\r\n<br>\r\n\"Well...what do you think?\" she laughs, \"Now you're gonna be my little tiny man to keep me company. Wouldn't that be fun? What do you say? It'll only be for a year or two. I'll keep you happy. Please?\"<br>\r\n<br>\r\nYou sweat. A year or two? She can't be serious.<br>\r\n<br>\r\nHow do YOU respond?</span></div></div>",
            "created":1538703480,
            "id":2559333,
            "title":"CHAPTER TWO: THE TEST"
        },
        "111":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "choices":[
                "TRY THE WINDOWS",
                "TRY TO PUT IT OUT",
                "GO BACK UPSTAIRS"
            ],
            "content":"<div class=\"\"><div> <span>You look up at her to see that she looks a bit confused. <br>\r\n<br>\r\n\"Whats wrong?\" she asks, \"Can't handle a little of me?\"<br>\r\n<br>\r\n\"No\", you respond, \"I just didn't expect the offer to be so....drastic.\"<br>\r\n<br>\r\n\"What the fuck do you mean drastic? This is the offer of a lifetime.\"<br>\r\n<br>\r\nYou try to make up for that response, however, there's no use in bargaining. You see a giant hand reach down at you and grasp your shirt. Fiercely, she rips if off.<br>\r\n<br>\r\n\"What are you-?\"<br>\r\n<br>\r\nShe goes for your shoes, socks, pants, then underwear. Eventually, you're completely naked before the sight of her. She giggles, using her index finger to flop your tiny penis up and down. <br>\r\n<br>\r\n\"Can't say I've seen a penis THAT small in my life. Though, I bet it was bigger than the last guys\".<br>\r\n<br>\r\nYou focus on trying not to get a stiff. You cover your genitals and try to look at her. <br>\r\n<br>\r\n\"Great, thanks, can you give me my clothes back?\"<br>\r\n<br>\r\n\"Oh no. Not after that response.\" she says, \"You're gonna have to EARN them back\".<br>\r\n<br>\r\n\"How the hell am I supposed to do that?\" you ask. <br>\r\n<br>\r\n\"You'll see.\" she giggles and moves over to her backpack, slipping you inside and shutting the zipper. <br>\r\n<br>\r\nYou'll see nothing but darkness for the next for hours. <br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ------------------------------<br>\r\n<br>\r\nThe moment you get any sort of glimpse of light is inside of AJ's room. Pulling you out, she places you on the floor and stands up, towering over you. <br>\r\n<br>\r\nPlacing her hands on her hips, she looks down. <br>\r\n<br>\r\n\"Was that fun, little one?\" she asks you. <br>\r\n<br>\r\n\"Thrilling\" you say without a trace of emotion. <br>\r\n<br>\r\n\"Good to hear. You ready for your first challenge to earn your socks back?<br>\r\n<br>\r\n\"Guess I don't have a choice\".<br>\r\n<br>\r\n\"You don't\" she says. <br>\r\n<br>\r\nLeaving you on the ground, she steps over to her closet, opens it up, and pulls out an old, wooden doll house. Walking back to you, she sets the house right next to you. <br>\r\n<br>\r\nYou stay silent.<br>\r\n<br>\r\n\"Well\", she says, \"Go on in.\"<br>\r\n<br>\r\nYou do just that, stepping up the from porch stairs and into the door. You wander around, exploring the living room, kitchen, dining room, upstairs, the attic. <br>\r\n<br>\r\nYou spot a sign at one of the doors, marking it to be your room. <br>\r\n<br>\r\nYou set inside, which holds a bed, closet, desk, and window. <br>\r\n<br>\r\nYou sit on the bed, wondering how in the hell she managed to put this all together. <br>\r\n<br>\r\nA scent hits your nose. A burning scent. <br>\r\n<br>\r\nYou exit the room to find that inside the living room is a lit cigarette, burning the mini rug. <br>\r\n<br>\r\nThis is your test. Escape.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1544921520,
            "id":2589546,
            "title":"CHAPTER THREE: WHAT DO YOU MEAN?"
        },
        "1111":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "content":"<div class=\"\"><div> <span>You rush towards the nearby window by the door and try to pull it open, only to find that it, along with all of the other windows have been closed securely from the outside. You rush to the door. This toy house is old, perhaps the structure of it cant be to hard to break. <br>\r\n<br>\r\nYou grasp the door handle, only to horribly burn your hand on the metal surface. <br>\r\n<br>\r\nYou scream, and back up to the stairs, tending to your wounded hand. <br>\r\n<br>\r\nThe flames from the rug have now spread, and before you've noticed, your very feet have caught fire.<br>\r\n<br>\r\nThe last thing you hear as you burn to death is the demonic laughing of AJ from the outside of the home. </span></div></div>",
            "created":1545020520,
            "id":2589923,
            "title":"CHAPTER FOUR: SHOULD'VE TAKEN A CLASS"
        },
        "112":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "choices":[
                "RUN TO HER",
                "STAY PUT"
            ],
            "content":"<div class=\"\"><div> <span>At your response, her eyes widen with joy. She lets out a scream of joy, jumping up and down. The pounding of her feet upon the floor sound like various bombs hitting around you. You try and hold onto her pinky finger, but it's no use. Your fingers slip off and soon your're heading towards the ground. <br>\r\n<br>\r\nJust then, when you think all is about to end, a hand swoops you up, and into a hug you go. A painful, hard to breath hug just outside of her breasts at her shirt. <br>\r\n<br>\r\nShe brings you back to her first position: You in her cupped hands as she stares down at you. <br>\r\n<br>\r\n\"Sorry\" she says, noticing your frazzled look, \"I forgot that you're not used to that\"<br>\r\n<br>\r\n\"Y-your fine, I-\" before you finish, you lean over and puke over the side of her hand. <br>\r\n<br>\r\nAJ, disgusted, takes a Kleenex from a nearby desk and cleans of your face. <br>\r\n<br>\r\n\"Better?\" she asked<br>\r\n<br>\r\n\"Yeah, I'm good.\"<br>\r\n<br>\r\n\"Great, I'm so sorry, I got a little carried away. Rest while you can, we're gonna have A LOT of fun together. <br>\r\n<br>\r\nYou gulp as she places you inside of her pencil bag. Just then, the bell rings, and AJ places the bag inside of her backpack, then out the door she goes to her next class. <br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ------------------------------<br>\r\n<br>\r\nIn class, AJ sits with her bag next to her. You manage to shrivel out from the slightly opened zipper and slide out from the books and folders until you see an opening. From the distance, you spot a girl familiar to you. You stare at her for a moment, thinking of the possibilities. <br>\r\n<br>\r\nIf you leave, you have the chance of getting help. <br>\r\n<br>\r\nIf you stay, you could possibly have the experience of a lifetime.<br>\r\n<br>\r\nThen again, if you leave AJ could spot you.<br>\r\n<br>\r\nAnd if you stay, she could very well turn on you. <br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1544919900,
            "id":2589537,
            "title":"CHAPTER THREE: THE START OF A BEAUTIFUL FRIENDSHIP"
        },
        "1121":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "content":"<div class=\"\"><div> <span>You think for a moment, then decide that anything is better than this nightmare that you're living. <br>\r\n<br>\r\nSprinting out from the bag, you run as fast as you possibly can to your friend on the other side. Your heart rate picks up. Your legs begin to ache. Obviously, this type of world will be getting used to. But not for long. <br>\r\n<br>\r\nFrom up above, AJ spots your attempt to find rescue. Lifting up her black boot, it comes crashing down upon you.<br>\r\n<br>\r\nHowever, the crash didn't kill, you. Just leaving you horribly mangled and bloody. <br>\r\n<br>\r\nFor hours you suffer until the end of the day, when the teacher, \"Ms. Artis\" finds you. With her mild distaste for bugs, she decides the only thing to do is to crush you with her black flats, ending it for once and for all. </span></div></div>",
            "created":1545016920,
            "id":2589907,
            "title":"CHAPTER FOR: GAMBLING STILL CAN BE RISKY"
        },
        "1122":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "choices":[
                "Sex.",
                "Massage.",
                "Hide and Seek."
            ],
            "content":"<div class=\"\"><div> <span>You sit and think on it for a moment, then decide that this chance is too good for you to miss. So therefor, you slide back in and sit there until the end of the day. <br>\r\n<br>\r\nHours on end pass as you sit in the darkness. You begin to wonder if she'll even let you out at all. What if she completely forgets about you? You've almost been crushed to death by books, binders, and pencil cases a number of times, and if that wouldn't do it, then the lack of air certainly would. <br>\r\n<br>\r\nYou hear the process of the day go by. Bells ring, AJ moves to different classes. Soon, you listen to the process of the last bell ringing, AJ leaving the school, AJ walking home, entering her house, going upstairs and into her room, and then plopping you in the backpack on the floor.<br>\r\n<br>\r\nYou look up to see that the zipper is being undone and see the gigantic smiling face of AJ hovering over you. Reaching in two hands, she scoops you up and places you down on the floor in front of her. <br>\r\n<br>\r\n\"Was that fun, little one?\" she asks.<br>\r\n<br>\r\n\"Oh...it was thrilling!\" you say hoping to not offend her in anyway. <br>\r\n<br>\r\nShe smiles. \"Good! I have another surprise for you. <br>\r\n<br>\r\nLeaving you on the ground, she steps over to her closet, opens it up, and pulls out an old, wooden doll house. Walking back to you, she sets the house right next to you. <br>\r\n<br>\r\nYou stay silent. So THIS is your new home. <br>\r\n<br>\r\n\"Well?\" she says, \"Don't you love it? I made it just for you.\"<br>\r\n<br>\r\n\"Oh! Yes! It's wonderful. Thank You. Here, let me check it out. <br>\r\n<br>\r\nYou begin to walk towards the front porch stairs when a giant hand comes crashing down right in front of you. The thundering sound and tremble send you landing on your behind. <br>\r\n<br>\r\n\"W-well night just yet! We still have so much to do!\" she says. <br>\r\n<br>\r\n\"What's on your mind?\" you ask. <br>\r\n<br>\r\n\"It's up to you, you're my guest aren't you?\"<br>\r\n<br>\r\nWhat's your idea?</span></div></div>",
            "created":1545019080,
            "id":2589920,
            "title":"CHAPTER FOUR: DON'T SPOIL THE FUN"
        },
        "113":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "content":"<div class=\"\"><div> <span>You leap to your feet and glare up at the giant face above you. Your fists clench as well as your teeth. <br>\r\n<br>\r\n\"I helped you see if this little spell would work, and you had your fun, now change me back to my regular size you stupid bitch! One or two years, are you kidding me!?!\" I ought to-\"<br>\r\n<br>\r\nBut before you can finish that sentence, AJ clenches a fist around your whole body, pulls you back, then throws you like a baseball. <br>\r\n<br>\r\nYou hit the wall with a splat, splurging flesh, bits of bone and guts about the white wall. <br>\r\n<br>\r\nPerhaps you were too harsh. </span></div></div>",
            "created":1544916360,
            "id":2589513,
            "title":"CHAPTER THREE: TRIGGERED"
        },
        "114":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "content":"<div class=\"\"><div> <span>After muttering out this poorly put together sentence you look up to see that AJ has a look of both suspicion and confusion upon her face. At this look, you gulp, wondering what in the world could happen next. <br>\r\n<br>\r\nNothing could have prepared you for it, for after you respond, AJ carefully wraps her fingers around your whole entire body the way one would grasp a sword. <br>\r\n<br>\r\n\"What-what are you doing?\" you ask her. <br>\r\n<br>\r\n\"It seems that I may have poorly judged you.\" she stared, \"You see, I would've expected someone like you to appreciate the value of serving me as a goddess a bit more.\"<br>\r\n<br>\r\nThe grasp of her fingers tighten around you. You grunge at the slight pain and pressure. <br>\r\n<br>\r\n\"What're you talking about?\" you grunt through your teeth, \"I didn't say that\".<br>\r\n<br>\r\n\"Don't bullshit me, I heard it through your words\". <br>\r\n<br>\r\n\"What else is her capable of?\", you think to yourself, \"Can she read my fucking thoughts too?\"<br>\r\n<br>\r\nThe grip tightens. This time you let out a slight scream You can hardly breath.<br>\r\n<br>\r\n\"I might as well find another one who'll appreciate me as much as I wish\" she says , \"Enjoy this while it lasts, sugar.\"<br>\r\n<br>\r\nThe last thing that you fell is the snapping of your rib cage and various other bones, passing out and never waking up again. </span></div></div>",
            "created":1544915820,
            "id":2589507,
            "title":"CHAPTER THREE: WHAT'S SAID IS SAID"
        },
        "115":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "content":"<div class=\"\"><div> <span>This question you ask with a grin. However, the grin is not returned from AJ. Without any warning, she quickly turns over hand and lets you fall and come crashing down on the hard floor bellow. Nearly every bone and joint in your body is now mangled and broken. You howl in pain.<br>\r\n<br>\r\n\"What the HELL, w-was that f-for you fucking b-BITCH!\" You scream up to her. <br>\r\n<br>\r\nAJ bends down, hand on her knees. <br>\r\n<br>\r\n\"Amazing. I help you with your back and when I want something you still manage to only think about yourself.\"she lifts herself up again. <br>\r\n<br>\r\n\"So y-you try and kill me?!?\" you shout. <br>\r\n<br>\r\n\"I was hoping it would be quick\" she says, \"Here, I can't leave you like this. Even IF you're a selfish FUCK.\"<br>\r\n<br>\r\nShe lifts up her boot and hovers it over you. <br>\r\n<br>\r\n\"Any last-\" she starts, \"Oh never mind\".<br>\r\n<br>\r\nBefore you can even utter a word for mercy the boot comes crashing down upon your mangled body, finishing the job for good...<br>\r\n<br>\r\n</span></div></div>",
            "created":1539747720,
            "id":2564745,
            "title":"CHAPTER THREE: YOU GET WHAT YOU GET"
        },
        "12":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "choices":[
                "Take the Chance",
                "Lick Her Boot for the Chance",
                "Nothing, it's not worth it"
            ],
            "content":"<div class=\"\"><div> <span>She grins with no answering response to your question. However, you don't really need one for you can tell that she is serious as serious can be. <br>\r\n<br>\r\nShe stands up and motions you to stand up with her. You stand still in the middle of the room as she, without breaking eye contact, takes a few steps back until a good six feet stands between you and her. <br>\r\n<br>\r\nShe raises her wand. \"Are you positive that you're up for this? This is only a test\".<br>\r\n<br>\r\n\"Sure\", you say with a shrug, \"What's the worst that can happen?\"<br>\r\n<br>\r\nShe frowns, then swings her wand over her head, the points it directly towards you. Clearly and with power, she speaks the words, \"SUBTRAXERIM ALTITUDO\".<br>\r\n<br>\r\nFrom the tip up her wand shoots out a glow of blue rays, as laser like lines shoot right through your body. You try your best o stand still, for the blow gave a bit of a push. <br>\r\n<br>\r\nImmediately, you begin to realize that something is severely wrong. AJ, the chairs, the desk, and even the pencils have started to grow larger. No, not them. YOU are getting smaller. <br>\r\n<br>\r\nThe rays cease, and AJ lowers her wand. AJ now towers over you, the size of the Statue of Liberty almost. She takes wand and sets it into her pocket. Smling, she begins to tap her right boot. <br>\r\n<br>\r\n\"Didn't expect to make you THAT tiny\", she giggled, \"But I'll make do\".<br>\r\n<br>\r\n\"Oh-Okay\", you shiver, still perplexed, \"W-what now?\"<br>\r\n<br>\r\nShe places a finger to her chin, thinking.<br>\r\n<br>\r\n\"Well\", she starts, \"Considering your attitude towards this at first, I think a bit of work is due from you\"<br>\r\n<br>\r\n\"Okay\", you say with a bit of concern, \"What\"<br>\r\n<br>\r\nShe carfully steps towards you until her boots are right at your face.<br>\r\n<br>\r\n\"Polish these for me, I'll think of what to do next\"<br>\r\n<br>\r\nWithout thinking, you begin to rub the tip of her boot with your elbow. To your surprise, a hint of an erection is starting to form inside of your pants. AJ pulls out her phone and beings to text. <br>\r\n<br>\r\nWhile polishing, you get an idea. She's wearing a skirt, and you could very well now get the chance to take that look you've always dreamt of having. But should you just go for it? Or maybe if she saw you licking her boots, she would reward you with a peak.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1538702040,
            "id":2559323,
            "title":"CHAPTER TWO: SERIOUS AS SERIOUS CAN BE"
        },
        "121":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "content":"<div class=\"\"><div> <span>You grin, and look up to see what wonders is beneath that skirt. That grin soon drops, as you realize that AJ happens to he wearing jogger's shorts underneath the skirt. What a surprise.<br>\r\n<br>\r\nAt this moment, AJ decides to take a look down to see the job you're doing, only to see that you, the little pervert, are trying to take a peak at her snatch. You notice and try to make it seem like your working. However, whats done is what has been done. <br>\r\n<br>\r\n\"ARE YOU FUCKING SERIOUS YO LITTLE SHIT?!?\" she thunders. <br>\r\n<br>\r\nYou try to get a word out, but are simply too embarrassed and scared. Only sputters manage to leave your lips. <br>\r\n<br>\r\n\"I'd bet you'd like to get a closer look at this ass? Wouldn't you?\"<br>\r\n<br>\r\nYou say nothing. You tiny legs shake.<br>\r\n<br>\r\n\"Well, that's too fucking bad. You're getting the boot.\"<br>\r\n<br>\r\nAt this, she lifts up her boot and hovers it over your whole body.<br>\r\n<br>\r\n\"Say Goodnightttt\" she taunts.<br>\r\n<br>\r\n\"No! AJ PLEA-\"<br>\r\n<br>\r\nThe boot comes crashing down as your entrails and fluids come spluttering out all over the ground and on the bottom of her boot. </span></div></div>",
            "created":1538711400,
            "id":2559359,
            "title":"CHAPTER THREE: GAMBLING CAN BE RISKY"
        },
        "122":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "choices":[
                "RUN TO HER",
                "STAY PUT"
            ],
            "content":"<div class=\"\"><div> <span>Immediately, without looking up and keeping to your promise, you begin to smother her boot with your tongue and lick it clean from the dirt and lint. You really start to get into it. It's not terribly horrible. <br>\r\n<br>\r\nAJ looks down from her phone. Her face quickly changes from confusion to pure and utter disgust.<br>\r\n<br>\r\n\"Did I fucking tell you to LICK?! That's fucking disgusting! What the FUCK is wrong with you\".<br>\r\n<br>\r\n\"I-I thought that you would appreciate it You wan't them clean, right?\"<br>\r\n<br>\r\n\"I want them POLISHED, not with your spit! This is ridiculous. I can do better\". <br>\r\n<br>\r\nShe raises her boot, hovering over your body. <br>\r\n<br>\r\n\"WAIT!\" you cry.<br>\r\n<br>\r\nAJ moves her boot to the side, still keeping it hovered.<br>\r\n<br>\r\n\"Yes?\"<br>\r\n<br>\r\n\"Look, I was only trying to...I was only trying to exceed my expectations. I'm sure you wanted me to do a good job. I mean, you did a wonderful job on my back. Just give me another chance. <br>\r\n<br>\r\nShe thinks on it, boot still raised. Your heart pounds at the speed of a thousand pumps per minute.<br>\r\n<br>\r\nGradually, she puts down her boot. You sigh a great relief. But, before you know it, your being picked up by the collar of your tiny shirt. AJ gently places you in her hand. <br>\r\n<br>\r\n\"Look\", she says, \"I'm sorry I wanted to be nicer. But you've really pressed my buttons. Truth is, I get lonely. Really lonely. I've got no one to play with or talk to when I'm home, and you're always at work. I had another tiny man before you. But, he decided that he was gonna be a little shit. And you know what he got?\"<br>\r\n<br>\r\n\"What?\" you ask trembling.<br>\r\n<br>\r\n\"What I was about to give you\", she says, \"I was only going to keep you for a year or two. But now, I think a good decade is long enough. You better not piss me off little man\".<br>\r\n<br>\r\nShe places you in her bag. Lunch has ended, and the two of you are now off to class. No one knows where you are, or whats happened to you.<br>\r\n<br>\r\n                                                            ------------------------------------------------------------<br>\r\n<br>\r\nIn class, AJ sits with her bag next to her. You manage to shrivel and slide out from the books and folders until you see an opening. From the distance, you spot a girl familiar to you. Now is your chance to end this nightmare. You can get up and grab her attention. But what if AJ spots you? Are you going to take your chances?</span></div></div>",
            "created":1538713560,
            "id":2559372,
            "title":"CHAPTER THREE: NOT IMPRESSED"
        },
        "1221":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "content":"<div class=\"\"><div> <span>You slimmer out of the open pocket and drop to the floor. The classroom is truly the greatest and biggest room you've ever seen.<br>\r\n<br>\r\nYou see your friend in front of you. Now is your chance to end this nightmare for once and for all. <br>\r\n<br>\r\nSprinting across the floor as fast as you can, you make it closer and closer to the other backpack. Your plan is simple. Hide inside her bag, wait till she gets home, reveal yourself and be saved. <br>\r\n<br>\r\nJust then, you hear the thundering sound of shoes hitting the ground. <br>\r\n<br>\r\nYou begin to run faster, almost reaching the heel of her shoe, when the foot of the teacher, \"Ms. Artis\", in her black flats crushes you, splattering you among the floor of the classroom. </span></div></div>",
            "created":1544922000,
            "id":2589550,
            "title":"CHAPTER FOUR: CHANCE TAKEN"
        },
        "1222":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "choices":[
                "...Fine",
                "...All of them?"
            ],
            "content":"<div class=\"\"><div> <span>You think about it for a minute or two, them slide back it to where AJ put you before she can spot that you're outside and peeking out. You've already pissed her off enough, so it's best to not test her patience.<br>\r\n<br>\r\nHours on end pass as you sit in the darkness. You begin to wonder if you'll ever see the light of day again. You've almost been crushed to death by books, binders, and pencil cases a number of times, and if that wouldn't do it, then the lack of air certainly would. <br>\r\n<br>\r\nYou hear the process of the day go by. Bells ring, AJ moves to different classes. Soon, you listen to the process of the last bell ringing, AJ leaving the school, AJ walking home, entering her house, going upstairs and into her room, and then plopping you in the backpack on the floor.<br>\r\n<br>\r\nYou hear the zipper open, and see the gigantic, grinning face of AJ hovering over you. Reaching her hands in, she scoops you and and brings you over to her desk, plopping you down and sitting at the chair near it. <br>\r\n<br>\r\nYou look up to her. \"So\", you say, \"What's next?\"<br>\r\n<br>\r\n\"Whats next?\", she smiles, \"What's next is simple. One, you're not getting the privilege of having your name while your in the hands of me, understand? Good. Your new name will be...Douche...no...BITCH. Understand that, Bitch?\"<br>\r\n<br>\r\nYou nod.  <br>\r\n<br>\r\n\"Excellent. Now...about those clothes. Not a fan. You certainly won't be wearing them under my bedroom roof.\"<br>\r\n<br>\r\n\"What do you mean?\"<br>\r\n<br>\r\n\"I mean what I mean. Hand them over.\"<br>\r\n<br>\r\nHow do you respond? </span></div></div>",
            "created":1545016320,
            "id":2589903,
            "title":"CHAPTER FOUR: BUYIN' TIME"
        },
        "123":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "content":"<div class=\"\"><div> <span>Taking the safe road, you continue to polish the toe cap of her boot. AJ stays on her phone, paying absolutely no attention to you or your work. Your erection is fading. The fact that your very life could be on the line could have a bit of a tendency to turn some one off. Yet, you're still hanging in there. <br>\r\n<br>\r\nBarely a minute has passed by the time AJ looks down from her phone to look at the progress that you've made. Not much. <br>\r\n<br>\r\nShe lifts up her right shoe, inspects it, then lifts up the other. Tisking and shaking her head, she puts both feet down and places her hands on her hips. <br>\r\n<br>\r\n\"Sorry my tiny friend\", she says down to you, \"But that is just not going to do\".<br>\r\n<br>\r\n\"What?\" you ask, \"What the hell do you mean?\"<br>\r\n<br>\r\nBefore you can get an answer, AJ lifts up her boot and hovers it over you. You fall back, raising your hands up, begging for mercy. <br>\r\n<br>\r\nThe boot comes crashing down, sending chunks of your very flesh and bones and fluids all over the floor and splattering all about the bottom of her boot. </span></div></div>",
            "created":1539743760,
            "id":2564719,
            "title":"CHAPTER THREE: THE CLASSIC RESULT"
        },
        "13":{
            "author_id":"damkoehlerde",
            "author_name":"Andy Wilson",
            "content":"<div class=\"\"><div> <span>At this, AJ nearly fell out of her seat. You realize that this was an over reaction, and try to apologize. Yet before you can even say, \"I'm sorry\", the wand swishes towards you, nearly stabbing you in the chest.<br>\r\n<br>\r\n\"SUBTRAXERIM ALTITDO!\"<br>\r\n<br>\r\nA ray of bursting blue glowing strings fly out from the wand. This successfully makes you fall back, nearly knocking you out. You stand back up and rub your eyes. When the adjust, you see AJ. However, there is something different about her. Shes grown, and she keeps growing. Not just her but the whole room.<br>\r\n<br>\r\nYou soon come to the realization that AJ had placed a shrinking spell on you. Quickly she grows higher and higher over you. Soon, your about the size of a four inch toy. <br>\r\n<br>\r\nAJ looks over you with her arms to her sides, wand still in hand. The once petite best friend of yours was now the size of the statue of liberty. <br>\r\n<br>\r\n\"So sorry I had to do that\", she says to you, \"And I'm sorry for this\".<br>\r\n<br>\r\nAt that, she began to lift up her right boot. You knew you were in trouble. You fall back and lift up your arm, begging her for mercy. But, it's not enough.<br>\r\n<br>\r\nSoon, the ginormous boot hovering over you comes crashing down, splattering you all over the ground and all over her boot</span></div></div>",
            "created":1538629200,
            "id":2559300,
            "title":"CHAPTER TWO: CURSED FOR LIFE"
        }
    },
    "info":{
        "author_id":"damkoehlerde",
        "author_name":"Andy Wilson",
        "brief_description":"Survive Payton's magical powers. Can you make it to the 300th Chapter Finale?",
        "created":1538525220,
        "description":"<td align=\"left\" class=\"norm\">Payton always has something interesting to show you, but you've never seen anything like the spell book she found in her attic. Your whole life is soon about to change...</td>",
        "id":2170906,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1583611620,
        "modified":1583611620,
        "pretty_title":"Payton the Giantess"
    }
}