{
    "chapters":{
        "1":{
            "author_id":"broker117",
            "author_name":"Broker",
            "choices":[
                "Test your new power",
                "Nick comes in",
                "Ignore it",
                "Go for a walk"
            ],
            "content":"<div class=\"\"><div> <span>It's been a month since your first year of college started and you've been having a good time. Your roommate, Nick, is a member of the swim team and has the body to prove it. You admit to be jealous of his body when compared to your scrawny form. But one day when you're working on homework in your room, you hear a ringing noise in your ears that's deafening. In your mind you hear a voice saying:<br>\r\n\"<i>You're the perfect candidate for my experiment! Enjoy the ability to swap traits between members of your sex! So if you want to swap any trait, mental or physical, just concentrate on the targets. I recommend two, three at maximum, for best results. Enjoy!</i>\"<br>\r\nAfter that the ringing stops and you regain your bearings.<br>\r\n\"That was weird\" you mumbled. <br>\r\nSo what do you do?</span></div></div>",
            "created":1442725920,
            "id":2037136,
            "title":"The beginning"
        },
        "11":{
            "author_id":"broker117",
            "author_name":"Broker",
            "choices":[
                "Test on yourself",
                "Test on the geeks"
            ],
            "content":"<div class=\"\"><div> <span>If I want to test my power out either I use it on myself or I find someone else to test it on...<br>\r\nYou then hear a loud banging noise from the hallway and then hear some yelling and laughter.<br>\r\nDammit Matthew must be messing with William again... But those two geeks would be perfect test subjects.</span></div></div>",
            "created":1467611940,
            "id":2175131,
            "title":"Test your new power"
        },
        "111":{
            "author_id":"broker117",
            "author_name":"Broker",
            "choices":[
                "Check yourself out",
                "More swapping to co"
            ],
            "content":"<div class=\"\"><div> <span>You decided that since you're the one with powers that you'd be the best test subject. You looked out your room window and saw Ivan (<a rel=\"nofollow\" href=\"http://traitswapper.tumblr.com/post/146898360629/ivan\" target=\"_blank\">http://traitswapper.tumblr.com/post/1468...</a>) walking outside. An exchange student from Russia, he had the biggest muscles on campus. So you concentrated on those hard earned muscles of his. Ivan kept on walking, completely oblivious that his muscles were deflating like balloons. You on the other hand felt your muscles expanding and your clothes bursting from being unable to contain your newly gained muscle. Looking back out the window, you noticed the newly scrawny Ivan was swimming in his clothes, both hands on his pants due to him being unable to fit in them.</span></div></div>",
            "created":1467649440,
            "id":2175286,
            "title":"Test on yourself"
        },
        "1111":{
            "author_id":"clfmql",
            "author_name":"uto",
            "choices":[
                "Continue swap with him",
                "back to normal"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size35\" style=\"\">You enter the bathroom and stand in front of the mirror. All the clothes that you are wearing are torn and you tear it off with your hands. The shoulders are wide, and the pectoral muscles are as wide as the mountains. You lift your left arm and bend your elbows and rub your biceps with your right hand. The biceps of the same size as a baseball are very hard. Ivan's muscles in your body are quite beautiful.<br>\r\nYou see your legs. The pants are also completely torn, so only pieces of clothes are attached to the legs. When you shake your body, the pieces of pants that are left fall to the floor. Thighs and calves look good. You move your right leg forward and then point your toes. Then the muscles of the whole right leg are wriggling like living. This proved that Ivan is really working hard.<br>\r\nYou look out the window again. Ivan is still there. Hiding in the alley, but still in your sight.<br>\r\nWhat would you do?</font></span></div></div>",
            "created":1525327260,
            "id":2487507,
            "title":"Check yourself out"
        },
        "11111":{
            "author_id":"clfmql",
            "author_name":"uto",
            "choices":[
                "groins swap",
                "mental swap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size35\" style=\"\">You decided to give him a little more trouble. <br>\r\nWhat do you want to swap this time?</font></span></div></span></div>",
            "created":1525327680,
            "id":2487512,
            "title":"Continue swap with him"
        },
        "112":{
            "author_id":"broker117",
            "author_name":"Broker",
            "choices":[
                "Find more people to swap",
                "Swap yourself ",
                "Reverse changes"
            ],
            "content":"<div class=\"\"><div> <span>Matthew and William: <a rel=\"nofollow\" href=\"http://traitswapper.tumblr.com/post/146881152859/matthew-and-william\" target=\"_blank\">http://traitswapper.tumblr.com/post/1468...</a><br>\r\n<br>\r\nYou left your room and walked down the hall to their doorway. It was opened enough that you could see in. Matthew had trapped William in a chair was sitting on him.<br>\r\n<br>\r\n\"It was an accident Will! And I'm not getting off you until you realize that!\" Said a smug looking Matthew.<br>\r\n<br>\r\n\"You bumped into my favorite model from Star Wars! And you think by sitting on me it'll make me accept that? Said a rather exasperated William.<br>\r\n<br>\r\nCurious on how this would look different if was two jocks arguing, you began concentrating on the two geeks. You saw Grant t(<a rel=\"nofollow\" href=\"http://traitswapper.tumblr.com/post/146881114384/mike\" target=\"_blank\">http://traitswapper.tumblr.com/post/1468...</a>)walking to the showers with towel wrapped around his waist and decided to swap all of his muscle, ass, and groin with Matthew. At The same time you saw Cole (<a rel=\"nofollow\" href=\"http://traitswapper.tumblr.com/post/146847264119/cole\" target=\"_blank\">http://traitswapper.tumblr.com/post/1468...</a>) walking back from the gym and decided to the same changes to him as you did with Frant but giving them to William. The two former jocks were looking rather pathetic now, but the new jocks that were arguing were a site. <br>\r\n<br>\r\nTheir clothes had been torn apart by their sudden growth and they were in the same position as before.<br>\r\n<br>\r\n\"C'mon Will it was an accident! It's not my fault my muscles cause me to bump into things, I can't hel how big I am!\" Whined a newly muscled Matt.<br>\r\n<br>\r\n\"Dammit Matt! That was a gift from my dork of a cousin, he's gonna be pissed that it's broke! Complained a mentally altered Will.<br>\r\n<br>\r\n\"The nerd won't know, and besides, you know you love these big muscles!\" Said Matt as he began flexing while still on Will.<br>\r\n<br>\r\nWill blushed and angrily burrowed his face into Matt's pecs as Matt just laughed at him.<br>\r\nIt looks like reality alters to the changes you make.</span></div></div>",
            "created":1467613080,
            "id":2175135,
            "title":"Test on the geeks"
        },
        "12":{
            "author_id":"broker117",
            "author_name":"Broker",
            "choices":[
                "Swap groins or ass",
                "Take his muscle",
                "Mental swap",
                "Ignore him and go out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nick: <a rel=\"nofollow\" href=\"http://traitswapper.tumblr.com/post/146847030559/nick\" target=\"_blank\">http://traitswapper.tumblr.com/post/1468...</a><br>\r\n<br>\r\n\"Yo Eli, you awake?\" You heard your roommate Nick ask before coming in. <br>\r\nWell Nick was on the swimming team so maybe a test of your new power was necessary.<br>\r\n</span></div></span></div>",
            "created":1467610860,
            "id":2175118,
            "title":"Nick comes in"
        },
        "121":{
            "author_id":"broker117",
            "author_name":"Broker",
            "choices":[
                "Groin",
                "Ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1467610920,
            "id":2175120,
            "title":"Swap groins or ass"
        },
        "1211":{
            "author_id":"broker117",
            "author_name":"Broker",
            "choices":[
                "Keep swapping with Nick",
                "Explore your new part",
                "Find someone else to swap with"
            ],
            "content":"<div class=\"\"><div> <span>You felt a tingling sensation in your crotch and  saw that a rather large tent was forming in your pants.<br>\r\nHoly shit, Nick is endowed<br>\r\nYou looked at Nick who's front end of his pants were a bit more deflated, but he didn't seem to notice the change.</span></div></div>",
            "created":1467611100,
            "id":2175122,
            "title":"Groin"
        },
        "12112":{
            "author_id":"broker117",
            "author_name":"Broker",
            "choices":[
                "Find someone else to swap with",
                "Go to the showers"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey sorry for bothering Eli, but i forgot my bag before practice.\" Said Nick as he left the room.<br>\r\n<br>\r\nNow that you were alone, you unzipped your pants and saw your new 8 inch dick nestled snugly between your legs. Seeing yourself with a bigger dick got you aroused just by looking at it and you could help but grab it. You began to moan as you stroked it faster and faster, felling the pressure build underneath your grip made the arousal grow even more prominent. Until finally you ejaculated all over your desk. Panting and sweaty you slumped back into your chair, trying catch your breath. That was great and you needed some more parts now, this could make for a better experience.</span></div></div>",
            "created":1467614040,
            "id":2175136,
            "title":"Explore your new part"
        },
        "121121":{
            "author_id":"clfmql",
            "author_name":"uto",
            "choices":[
                "Swap it secretly",
                "To obtain ched's permission before swap."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size35\" style=\"\">After cleaning the semen-covered desk, you are ready to take a shower. Your 8-inch dick is still hot. You smile and unconsciously rub your dick and abdomen. Suddenly, you start to worry about a big dick and a soft body that does not fit at all. You seem to have to make a new 'massive body' for a new dick.<br>\r\nBefore you take a shower, you open the door and look around the room. Then Ched goes through the hallway. He has already won several awards as a bodybuilder. As proof of this, his muscles are as vast as mountain ranges and excellent in definition. But you know he is a very good person. He is kind to everyone.<br>\r\nWhat would you do?</font></span></div></div>",
            "created":1525329120,
            "id":2487518,
            "title":"Find someone else to swap with"
        },
        "1211212":{
            "author_id":"clfmql",
            "author_name":"uto",
            "choices":[
                "Swap the muscles of Chad and Dale",
                "Talk to Chad"
            ],
            "content":"<div class=\"\"><div> <span>You thought you could not swap without permission from Chad. Previously, Chad had helped you. Then, you think of a good idea. After you take a shower, go to the gym and call Chad.<br>\r\n<br>\r\n“What's up?”<br>\r\n<br>\r\nIn Chad 's affectionate question, you explain your ability.<br>\r\n<br>\r\n“I can not believe it. Can you prove it?”<br>\r\n<br>\r\nYou look around and find a student who has passed by. He is also an athlete. You point to him and you swap that student's biceps with yours. Immediately your arm becomes instant muscular. You show a bicep, which is about the size of a softball, to Chad. A muscular arm in a dry body gives a bizarre impression, but it will be a great example to demonstrate your ability.<br>\r\n<br>\r\nChad is very surprised. You reset the arm. Then, you suggest one thing to Chad. You say you want Chad's muscles and height. And if you allow swap, I promise to give you a much better body now. Chad thinks for a while.<br>\r\n<br>\r\n“Among the freshmen at this college, I found a student with a lot of muscle and  stamina. his name is Dale. he said he would jump over me, and in fact he is bigger than me. so I want his muscles.”<br>\r\n<br>\r\nYou answer that you understand. He looks around for a while and takes you into the locker room. You and Chad, immediately take off all your clothes and head to the shower. He has a greater body than you think. Immediately you imagine yourself with the same muscles as Chad. The 8 inch dick starts to get hot.<br>\r\n<br>\r\n“Then I will start.”<br>\r\n<br>\r\nYou say so, then concentrate on the muscles and height of the chad. Changes soon come. The height of you and the chad is reversed. Now you can look down at Chad. Chad's muscles have diminished, and soon he has a lean body like you. Ribs are exposed on the skin, and skin color changes from deep brown to white.<br>\r\n<br>\r\nOn the other hand, your muscles blow like a balloon. Soon your muscles will be exactly the same size as the previous chad. Basketball-sized biceps, mountain-like pectoral muscles, wide shoulders and back, attractive waist, large thighs and calves. skin color changes from white to deep brown. You instantly become a bodybuilder like the previous chad.<br>\r\n<br>\r\nOh my god! Endless vigor is sprouting from the body! You make a double biceps pose.<br>\r\n<br>\r\n“I'm tired somehow.”<br>\r\n<br>\r\nChad mutters. You go to the locker room with Chad and then exchange each other's clothes. Chad's clothes fit your body perfectly. And you go to Dale with Chad. Freshman Dale was playing on the playground. My God, Dale was bigger than Chad!<br>\r\n<br>\r\nNow, what do we do now?</span></div></div>",
            "created":1538109360,
            "id":2555308,
            "title":"permission the swap"
        },
        "122":{
            "author_id":"clfmql",
            "author_name":"uto",
            "choices":[
                "Continue swap with him",
                "humiliate a Nick",
                "back to normal"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size35\" style=\"\">You focused on Nick's muscles. You have a feeling of tingling all over your body. Then Nick 's body dries up like a twig in an instant. The shoulders and chest become narrow, and the abdomen becomes fat. On the other hand, your muscles begin to inflate like a balloon. The shoulders are widened and the pectoral muscles bulge. The waist becomes thin, and abdominal muscles become clear. Soon when the whole process was over, you and Nick's muscles / fats were completely swapped. nick 's clothes flowed down. He panicked and unconsciously pulled up his clothes. Your clothes were already half-torn by Nick's muscles<br>\r\n\"What the fuck is that?! What did you do to me?!\"<br>\r\nNick yelled at you in horror.</font></span></div></div>",
            "created":1525330500,
            "id":2487529,
            "title":"Take his muscle"
        },
        "14":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Gym",
                "Library ",
                "Beach",
                "Frat part",
                "other "
            ],
            "content":"<div class=\"\"><div> <span>You decide to go for a walk. As it would give you a greater range of targets if what the voice in inside to tree. Alternativity it would also give you time to think about what the voice told about this new ability. <br>\r\n<br>\r\nYou get dressed and leave your room and pass some of your loud college dorm mates. You get annoyed that some of the dorms and muscle bond jocks who get drunk and wake you up at 3 in the morning when they pound at your door thinking it is theirs.  As you leave the dorm, the remember that the voice said that you can take the any trait, mental or physical.<br>\r\n<br>\r\nYou know that the college gym is pack with gym rats and that would be perfect time to build up your body. The college library is filled with some the smartest students, and while you are not dumb or smart, at best average intelligence. This could a time to make you smarter and help you make your classes easier. Finally, is that there is a frat party at of the frat house off campus, you got an invite from your roommate Nick. <br>\r\n</span></div></div>",
            "created":1525332240,
            "id":2487534,
            "title":"Go for a walk"
        }
    },
    "info":{
        "author_id":"broker117",
        "author_name":"Broker",
        "brief_description":"You're in college and find out about an ability to swap body traits with other males.",
        "created":1380415080,
        "description":"<td align=\"left\" class=\"norm\">Your name is Eli and you just entered college. Your roommate is awesome to you. You've made new friends and have discovered that you have a gift.<br>\r\n<br>\r\nPlease keep all swaps between males and feel free to add new characters. Also please no deaths.<br>\r\n<br>\r\nFeel free to add chapters!</td>",
        "id":1955133,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1538109360,
        "modified":1538109360,
        "pretty_title":"Male Body Trait Swapper"
    }
}