{
    "chapters":{
        "1":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "shrunk him",
                "shoved him in her mouth",
                "stuffed him",
                "cooked him",
                "made a sandwich"
            ],
            "content":"<div class=\"\"><div> <span>Nighttime, and Ash's team has camped out a half mile from the pokemon center. Ash was exploring while everyone slept, when a jigglypuff came in front. \"Hi there.\" She prepared to sing and he covered his ears, making her raise a brow. \"Alright, okay.\" He let go and slept as she sang. She got angry but her stomach growled. She then...</span></div></div>",
            "created":1247893200,
            "id":727155,
            "title":"Sleeping"
        },
        "11":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "ate him whole",
                "shoved him in her mouth",
                "tasted him",
                "covered him in pokeblock",
                "made a sandwich"
            ],
            "content":"<div class=\"\"><div> <span>She licked her lips at the idea of human food but was unsure of how. Then, her minty breath caught him and made him shrink. She finally knew she would eat him, so she lifted his body, now as tall as her, out of his clothes and licked his face, loving the taste.</span></div></div>",
            "created":1247893200,
            "id":727161,
            "title":"jigglypuff-tall"
        },
        "111":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "kept him overnight",
                "digested him",
                "ate berries"
            ],
            "content":"<div class=\"\"><div> <span>She slowly opened her lips and let his head through. Her tongue cushioned and tasted him as she slurped his naked sleeping body inside, swallowing as she does. Soon, she gets a taste of his feet and can't get enough. She has no choice and makes a final gulp, and her body is now expanded.</span></div></div>",
            "created":1247893200,
            "id":727172,
            "title":"gulp"
        },
        "1112":{
            "author_id":"keidran",
            "author_name":"Keidran",
            "choices":[
                "Follow Misty",
                "Follow Brock",
                "Do something else"
            ],
            "content":"<div class=\"\"><div> <span>After she swallowed Ash completely she took a nap for herself. Inside of her Ash slowly digests in sleep, never to awake again. While the rest of Ashs team was unaware what happened to him, only the jigglypuff knows the truth.<br>\r\n<br>\r\nThe next morning.<br>\r\n<br>\r\nJigglypuff wakes up as she hears Misty and Brock shout for their friend. \"Aaaash! where are you?\" They shout and are searching the woods. Jiggly stands up and hides behind a tree and watches them from a save distance. <br>\r\n\"We should split up and search for him.\" Said Brock and Misty agreed to him nodding.<br>\r\n</span></div></div>",
            "created":1258107120,
            "id":791164,
            "title":"digested him"
        },
        "11121":{
            "author_id":"keidran",
            "author_name":"Keidran",
            "choices":[
                "She digests Misty peacefully",
                "Someone shows up"
            ],
            "content":"<div class=\"\"><div> <span>Jigglypuff decides to follow the girl. While she still searches for Ash, its stomach starts to rumble again. After her midnight meal she became rather hungry again. It's set then. Misty's for breakfast. Still in hiding Jigglypuff starts to sing her song. As Misty hears it, it was already too late. She was hit directly by the song and slowly sinks down asleep. Giggling at how easy that was, Jigglypuff approaches the sleeping misty, licking her lips. Misty was a bit smaller than ash so she wouldn't make much of a problem to eat. But before that she had to take her somewhere save.<br>\r\nShe pulled at mistys legs and pulled her deeper into the woods far away from the route. <br>\r\n<br>\r\nThere she start to undress Misty. Clothes aren't tasty after all. But suddenly a moaning can be heard from Misty. She slowly awakes from her nap provided by Jigglypuff. Now Jiggly has to react fast. she grabs the legs of Misty and shoves them into her mouth. Misty, sleepy as she still is, looks confused and dizzy down to her legs which are already halfway inside of Jigglypuff. She was abruptly awake and tries to free her self. \"Hey stop that. What are you doing??? Let me out.\" she demands and pushes against the jigglypuff with her hands. But it was no use. the little pokemon was somewhat much stronger than it may look like. she shoves more and more of Misty down into her maw and into her stomach. Misty starts to scream and cry in fear but thanks to jigglypuffs caretaking, nobody could hear her. Misty is suddenly turned around so she lies on the ground with her belly. She digs her hands into the ground and tries to pull herself free but jigglypuffs swallowing is just too strong. Already half her body is inside the Pokemon and she starts to lick over Mistys flat belly, really loving that new taste. Misty is still crying and begging to be set free. but Jigglypuff ignores that and swallows more. now only her head and her arms are left outside of the very stretched pokemon. Tears run down her cheeks and she whimpers. \"please....\" but before she could end that sentence jigglypuffs tongue pushes on her face and pushes her head inside her maw and down inside her stomach. JIggly giggles at the hand which is still twitching at the outside and with another swallow it's inside her stomach too.<br>\r\nFrom inside can be heard muffled cries and whining. Jigglypuff rolls under a tree and takes a rest of her really hard swallowing.</span></div></div>",
            "created":1258108500,
            "id":791166,
            "title":"Follow Misty"
        },
        "111212":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "EATS HIM",
                "coughs out Misty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Brock came out of nowhere sees a Jigglypuff laying on the ground.He bends down &amp; says\"hey there have seen ash?\"what does Jigglypuff do?</span></div></span></div>",
            "created":1261520340,
            "id":809511,
            "title":"Brock"
        },
        "1112121":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "more of ash's friends come(which means more food for jiggly puff)",
                "she digests her meals"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jigglypuff sings &amp; puts him to sleep then undresses him.she puts him in her mouth head first &amp; begins swallowing him eventually he reaches her belly &amp; then jigglypuff goes back to sleep to digest her meals.then.......................................</span></div></span></div>",
            "created":1264560900,
            "id":826322,
            "title":"EATS HIM"
        },
        "1112122":{
            "choices":[
                "Brock and Misty",
                "Jigglypuff"
            ],
            "content":"<div class=\"\"><div> <span>Jigglypuff looked at Brock. He new he was way too full to eat another peson, directly after eating the nude Misty. Suddenly, he starts to feel a bit too full. Suddenly realizing she forgot to shrink Misty before swallowing her. When Misty heard Brock outside, she started struggling to get out of her wet-walled, damp, dark, prision squeezing in on her from all sides. Jigglypuff could no longer take it. She started coughing, and with a huge COUGH, she coughed out Misty headfirst onto the ground. Misty's hair was matted and a mess. She had a dazzed and grossed out look on her face. Her breasts were exposed and wet with saliva from Jigglypuff's mouth and stomach. The rest of her sleek, thin, nude body was also covered with saliva from Jigglypuff's insides. Brock stared at Misty, then at Jigglypuff, then back at Misty. For the first time, he noticed how sexy Misty looked, or how big her boobs were. And seeing them nude didn't hurt either. Jigglypuff was still dazed from coughing up the nude Misty, Misty was stunned from being eaten and coughed up by Jigglypuff, and Brock was stunned by Misty's sleek and sexy body. Who reacted first?</span></div></div>",
            "created":1268446380,
            "id":850065,
            "title":"coughs out Misty"
        },
        "112":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Play with him",
                "she eats him (soft)",
                "She eats him (hard)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jigglypuff puffed out her cheeks and opened wide. Ash screamed as Jigglypuff closed her mouth, sealing him in eternal darkness.<br>\r\n<br>\r\nWhat does Jigglypuff do?</span></div></span></div>",
            "created":1350274440,
            "id":1447035,
            "title":"shoved him in her mouth"
        },
        "113":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "swallowed him",
                "spit him out",
                "kept him"
            ],
            "content":"<div class=\"\"><div> <span>She dusts him off and sets him on a stump as he wriggles and snores. She sniffs up and down his body when she finds his feet. She lays out her tongue and rests his feet on it, immediately loving the taste. She then wraps her tongue around his legs and up, unknowingly shoving him in her mouth, savoring his body.</span></div></div>",
            "created":1247893200,
            "id":727192,
            "title":"taste test"
        },
        "12":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "he rolled out accidentally",
                "she accidentally swallowed",
                "she kept him"
            ],
            "content":"<div class=\"\"><div> <span>She removed his tasteless clothes, and sat next to his head. She didn't want to eat him, since he was too big (to her), and positioned him in the fetal position to make it easier. She lifted the curled up boy and licked her lips as she opened wide and let him on her tongue. She then lapped it all over his entire body, loving his taste so much that she couldn't swallow or spit. She soon slept with him still inside.</span></div></div>",
            "created":1247893200,
            "id":727492,
            "title":"big mouth"
        },
        "122":{
            "choices":[
                "Go to Ash's point of view.",
                "Go to Jigglypuff's point of view."
            ],
            "content":"<div class=\"\"><div> <span>After Jigglypuff fell asleep with the naked Ash curled up in her mouth, she had very sweet dreams. She loved the taste of Ash so much, she dreamed of eating candy all night long. When she dreamed of eating a very tasty piece, she actually swallowed in real life. The motion of being forced into the Jigglypuff`s throat woke Ash up. Ash, finding himself naked, drenched with saliva, in a dark, fleshy, wet place, being shoved along, he panicked, and started to scream and struggle. This woke Jigglypuff up, who realized she had swallowed the curled-up nude Ash. There was nothing she could do, Ash was going to her wet, pulsing stomach.</span></div></div>",
            "created":1268442540,
            "id":850001,
            "title":"Tasty treat."
        },
        "13":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "ate him (soft)",
                "cooked him",
                "ate him (hard)"
            ],
            "content":"<div class=\"\"><div> <span>She didn't think he was filling enough by himself. She gathered a bag of her favorite pokeblock and fed him with a funnel. Soon, his belly tripled in size. The pokeblock couldn't fully break down, and so his flesh caught the flavors and the rest was turned into a flab layer.</span></div></div>",
            "created":1247893200,
            "id":727184,
            "title":"stuffed ash"
        },
        "14":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "rolled pastry",
                "rotisserie",
                "boiling",
                "pie",
                "cake"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She felt that raw human wasn't edible, so she prepared to cook him.</span></div></span></div>",
            "created":1247893200,
            "id":727498,
            "title":"cooking"
        },
        "141":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "soft",
                "hard",
                "boiling"
            ],
            "content":"<div class=\"\"><div> <span>She got some large puff pastry sheets which she set on a tree stump and topped it with plenty of berries and pokeblock. She lifted him on top of that, and rolled it all together. She dragged him to the pokemon center and into an oven to become a living pastry.</span></div></div>",
            "created":1247893200,
            "id":727525,
            "title":"pastry"
        },
        "142":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "ash woke up",
                "she had a feast",
                "she left him alive"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She removed his clothes and tied him up to a long stick. It was placed on two poles and a fire below. She giggled as the boy was cooked alive before her eyes.</span></div></span></div>",
            "created":1248937800,
            "id":734797,
            "title":"rotisserie"
        },
        "145":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "shoving him in a cake",
                "making him a topping",
                "baking a cake"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was her birthday, and she wanted a cake.</span></div></span></div>",
            "created":1247893200,
            "id":727540,
            "title":"cake"
        },
        "1451":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "no teeth (soft)",
                "can't fit all at once (hard)",
                "munch on cake, and swallow filling (soft)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She found a bakery that had the region's largest cake, the size of a man. She inflated to help carry him there. She grabbed him by the arms onto the table and threw him 3 feet deep into cake. She licked her lips as she opened wide.</span></div></span></div>",
            "created":1248935280,
            "id":734774,
            "title":"largest cake"
        },
        "14511":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "ash woke up",
                "she regurgitated"
            ],
            "content":"<div class=\"\"><div> <span>She drags the cake over the edge, then opens wide below. In a flash, the entire cake and Ash disappear between her lips and fill her balloon body near the point of burst. Only his feet couldn't fit, and she giggled as she licked the thick frosting off from them and her lips. She then curled her tongue around and sucked his endlessly flavorful feet for the rest of the night, becoming coated in saliva as she also digested the cake in her belly.</span></div></div>",
            "created":1248935940,
            "id":734789,
            "title":"no teeth (soft)"
        },
        "145111":{
            "author_id":"dan101",
            "author_name":"harek",
            "content":"<div class=\"\"><div> <span>Then Ash woke up lying on top of the half digested cake. He yelled and squirmed inside the belly. She giggled and finally made a sealing gulp, fully trapping him inside her belly. He kicked around the walls, making her do a loud belch, draining all the digestive fluids and cake, leaving him. She then made a smaller belch that made the belly comfortable for Ash. He offers to do this all the time in exchange for capture. She accepts and burps him out. He put his clothes on and they went back.</span></div></div>",
            "created":1248936660,
            "id":734786,
            "title":"woke up"
        },
        "145112":{
            "author_id":"dan101",
            "author_name":"harek",
            "content":"<div class=\"\"><div> <span>She knew digestion couldn't replace this taste, so she slowly regurgitated Ash into her mouth and countinued with his whole body. She then remembered others were with him, so she wobbled over and rolled him off her tongue onto the sleeping bag and left, licking her lips hoping she could do this again...</span></div></div>",
            "created":1248937320,
            "id":734793,
            "title":"spit out"
        },
        "1453":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "soft",
                "hard"
            ],
            "content":"<div class=\"\"><div> <span>She ran to her group and told them. They wanted to be part of baking a human cake since they are maneaters anyway. They carry him to a bakery and drop him in a pan. One pours cake batter filled with berries and pokeblock on top. Then Ash opened his eyes half dipped in batter. \"What's going on?!\" Then she smacked him cold with a frying pan and giggles as she almost forgot to remove his clothes, licking the batter off them and tosses them out. They placed him in an warm oven and waited.</span></div></div>",
            "created":1248930000,
            "id":734763,
            "title":"baking for a family"
        },
        "14531":{
            "author_id":"dan101",
            "author_name":"harek",
            "content":"<div class=\"\"><div> <span>Inside, the cake rose around him, and the flavors of his skin were absorbed both into the cake and inside his flesh along with berry flavors. Although his flesh became cooked, he was otherwise unharmed. Then the cake was taken out and they didn't want to see blood, so she opened wide and chewed softly before swallowing. Then one put her on its tongue and made a 'food chain', gulping in unisen and each getting a share of dessert. Ash woke up and yelled as he was trapped in layers of bellies forever...</span></div></div>",
            "created":1248930000,
            "id":734768,
            "title":"layers"
        },
        "14532":{
            "author_id":"dan101",
            "author_name":"harek",
            "content":"<div class=\"\"><div> <span>The cake enveloped him and absorbed into his flesh along with the many flavors of his skin. He essentially became part of the cake while his blood boiled away. They took the cake out and cut pieces of the berry and Ash flavored cake. She got the tastiest part, his feet and legs. All six left with full bellies that would last until... they get to make a Misty pie...</span></div></div>",
            "created":1248930000,
            "id":734769,
            "title":"hard"
        },
        "15":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "ate him head-first (soft)",
                "ate him feet-first (soft)",
                "ate him (hard)",
                "kept him in her mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She got a hold of food from the pokemon center. Two very large pieces of bread were placed on a tree stump along with some lettuce. She removed his clothes and placed him on the lettuce. She then rubbed mustard on and put the other bread on.</span></div></span></div>",
            "created":1247893200,
            "id":727180,
            "title":"ashwich"
        },
        "153":{
            "author_id":"dan101",
            "author_name":"harek",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She shoved his head in, and chewed her way up until she closed and crushed it to bits before swallowing.</span></div></span></div>",
            "created":1248938280,
            "id":734802,
            "title":"ate him (hard)"
        },
        "154":{
            "author_id":"dan101",
            "author_name":"harek",
            "content":"<div class=\"\"><div> <span>She opened wide and rested the ashwich onto her tongue and closed her huge maw. She chewed and swallowed the bread and lettuce but her stomach couldn't stretch as much as her mouth. She kept him and massaged him with her tongue. In the morning, she spit him out where she found him, her saliva marking her property.</span></div></div>",
            "created":1248938820,
            "id":734813,
            "title":"kept him in her mouth"
        }
    },
    "info":{
        "author_id":"dan101",
        "author_name":"harek",
        "brief_description":"Ash is at the sleeping mercy of a hungry jigglypuff. Choose his fate.",
        "created":1247907300,
        "description":"<td align=\"left\" class=\"norm\">notes-<br>\r\nthe jigglypuff's stomach takes up most of her balloon body, but is not as stretchy as her mouth.<br>\r\nshe is unable to chew flesh easily<br>\r\nshe is capable of most methods</td>",
        "id":1582567,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1350274440,
        "modified":1350274440,
        "pretty_title":"Jigglypuff's Midnight Snack"
    }
}