{
    "chapters":{
        "1":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "More Sleep Required",
                "I'm too tired, I know how to make this bird leave",
                "Wait a minute!",
                "Hold up a moment!",
                "Ah, Erm"
            ],
            "content":"<div class=\"\"><div> <span>You can see the sun slowly rising out your window, you are a teenage skunk girl named Elanor. You are currently asleep under a large pile of covers, your tail poking out of the sheets waving lazily around. A bird is currently singing at your window and waking you up.</span></div></div>",
            "created":1281848400,
            "id":936941,
            "title":"Beautiful Morning"
        },
        "11":{
            "author_id":"hiddenname150",
            "author_name":"hiddenname150",
            "choices":[
                "Wake up",
                "Sleep more",
                "Your Dreams"
            ],
            "content":"<div class=\"\"><div> <span>The birds chirping at your window are trying to wake you soon your body acts on auto-pilot lifting your tail and firing a volley of gas at them. They fall from the branches slamming into the ground one sticking out of the mailman's head while he walks away unaware. You fall back asleep in your cloud of stink hopping it will by you a few hours</span></div></div>",
            "created":1283058000,
            "id":946365,
            "title":"Target Detected: PPPFPFFFFFFTTT"
        },
        "111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Push Onward"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">          You awaken as your tummy grumbles fiercely. You close your eyes and push a little, releasing a ripper of a fart that fades into a real wet one, spraying your panties with little spots of liquid shit. You grin sheepishly, continuing to knowingly speckle your strawberry colored undies until it just stops. This isn't good. Stomach ravaging your insides with no relief, you slowly make your way to the bathroom.You've had one of these before and it's so fun. Mom should be out of the house so you can take all the time you want. Plodding into your roomy, tiled bathroom, you sexily ditch your panties and top, tossing them into the hamper to stew until later. For something like this it's best to keep close out of the equation, less restraint. Moving to the middle of the room, you slowly massage your well sized breasts, opening up your body for the primal pleasure it is about to receive. You slowly crawl down on all fours like an animal and begin the process of pushing. Bracing your hands against the floor and arching your back, you start to apply pressure to your rectum to push out this grand blockage. Starting to feel it move, you lower yourself to the ground, essentially kneeling at this point with your doughy breasts squishing on the ground. You push hard, grunting with exertion as you feel the beast move an inch. Pleasure explodes through your body as you groan out load, hopefully your mom is still out and no one heard you. Recovering from that first wave, you push onward</span></span></div></div>",
            "created":1338181200,
            "id":1347270,
            "title":"So Much Fun!"
        },
        "112":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Lets keep this shit train a rolling",
                "Soup goes right through me, it should speed up the process",
                "Mystery 3rd choice"
            ],
            "content":"<div class=\"\"><div> <span>Ugghhh, your not feeling well this morning, seems like your down with the flu. No worries though, because of your hyper-messing, you tend to recover from sickness quiet quickly, and have a ton of messy fun while doing it.  While you still may be asleep in bed, your body knows what to do as your stomach gurgles noisily as you turn your side and lift your tail. A stream of shit then precedes to jet out of your ass and shows no sign of stopping. Of course your asleep and don't know this yet but it continues until a layer of poop covers the room reaching up to about your knees. You feel a little better as the virus moves more out of your system but not fully recovered yet. Do you continue to sleep or ask for your mom to bring you some soup?</span></div></div>",
            "created":1283922000,
            "id":952824,
            "title":"Dump Ass with the Sickness"
        },
        "1123":{
            "author_id":"sonio",
            "author_name":"Sonio",
            "choices":[
                "May the runny mess continue!",
                "Ask mom for something to give you upset stomach relief.",
                "Mystery 3rd choice again?"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, a bad case of diarrhea kicks in as a flood of liquid mess splatters out of your butt cheeks as you continue sleeping, this is due to the flu that you have. The liquid mess takes up the whole bed, spills on the floor and makes the air in the room unbreathable! Runny liquid mess continues to flow out of you for a while, then you stop for a moment. Still asleep? Or will you ask your mom to bring you something to stop the runny mess from flowing?</span></div></div>",
            "created":1328763600,
            "id":1273372,
            "title":"Mystery 3rd choice"
        },
        "11233":{
            "author_id":"mike3031",
            "author_name":"Mike3031",
            "choices":[
                "Keep shitting, Let the pedestrians below know your ass is the stinkiest in town",
                "Attempt to get up and squat so it floods your room first"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As the diarrhea keeps flooding from your rump, you shift a bit so its aiming out the window.The diarrhea is now flooding out your window hitting pedestrians and anything else, Now what?</span></div></span></div>",
            "created":1406523600,
            "id":1834823,
            "title":"Mystery 3rd choice again?"
        },
        "112331":{
            "author_id":"cinderel345",
            "author_name":"fluttershy",
            "choices":[
                "You wake up!",
                "Your mother comes to check on you!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're still asleep, and the <span class=\"cbrown\">mud bombs</span> continue to flood out the windows with no sign of stopping, but then...</span></div></span></div>",
            "created":1412398800,
            "id":1866221,
            "title":"Keep shitting, Let the pedestrians below know y..."
        },
        "1123311":{
            "choices":[
                "Take some laxatives (keep going)",
                "Get some medicine (stop)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up, and notice the shit that's flooded your room and is flowing out the window. What do you do now?</span></div></span></div>",
            "created":1513616100,
            "id":2429617,
            "title":"You wake up!"
        },
        "11233111":{
            "choices":[
                "Take another",
                "Decide this enough for now"
            ],
            "content":"<div class=\"\"><div> <span>You've always wanted to flood the world with your shit, so you get some laxatives out of your drawer. After taking just one, the whole neighborhood is completely covered in your waste. Within minutes, the while town is flooded. Should you take another, or stop?</span></div></div>",
            "created":1513616400,
            "id":2429619,
            "title":"Take some laxatives (keep going)"
        },
        "112331111":{
            "choices":[
                "Keep shitting"
            ],
            "content":"<div class=\"\"><div> <span>You decide to take another. Almost instantly, the next 10 miles are drowned in your waste.You decide this isn't enough, and take the whole box at once. The whole state was soon flooded. Cities were destroyed and people were not doing much better. The laxatives kick in, and the country is soon laid to waste. Your shit pours into the ocean, but you keep going. The planet stood no chance and was completely covered in your feces.</span></div></div>",
            "created":1513617060,
            "id":2429622,
            "title":"Take another"
        },
        "113":{
            "choices":[
                "Keep Dreaming",
                "Wake Up"
            ],
            "content":"<div class=\"\"><div> <span>You dream that you are a teacher. You don't notice the heaps of shit flowing out of your pants and piling behind you, because it is so automatic.<br>\r\nYou are telling the class with an ambiguous age about science, which is ironic in a way due to the fact that science cant explain your shitting condition that you've actually grown to like.<br>\r\nThere is a trail of poop, like a snake, showing everywhere you've walked to. It's starting to get in the way, actually. But this is a dream, so you don't really have the instinct to call a janitor over.</span></div></div>",
            "created":1449723600,
            "id":2072843,
            "title":"Your Dreams"
        },
        "12":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Seriously it's time to wake up!",
                "Back to ZZZZZZ Land"
            ],
            "content":"<div class=\"\"><div> <span>That chirping bird is causing you to drift into consciousness but you just want to drift back to sleep. While still covered in covers you lazily lift your tail, your stomach rumbles momentarily and a long steady fart escapes your sweet cheeks. Success, the bird has stopped singing but you've done more than shut it up. Your wonderful stink caused it to be knocked out and it fell to the ground. Your farts are so useful you drift back into sleep.</span></div></div>",
            "created":1281848400,
            "id":936944,
            "title":"There's More Where that Came From"
        },
        "121":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Nothing, hey it's okay I'm covered in fur, the world is my toilet",
                "A diaper, capable of handiling tons of my messes",
                "Just a simple pair of cloth painties, its just more comfortable"
            ],
            "content":"<div class=\"\"><div> <span>You finally wake up ,you can't sleep all day you've got a full day and a full bladder ahead of you. Before you arise from your covers you unleash a torrent of urine causing an expanding puddle to form on your bed and spread all the way up to your pillow. \"Ahhh\" you think, \"So refreshing.\" It's so nice to at least get a little of that presure out. Now with your bladder only marginally less full you fully awake and climb out of bed. Quick question though, what are you wearing?</span></div></div>",
            "created":1281848400,
            "id":936949,
            "title":"Get Up and Greet the Day the Only Way You Can"
        },
        "1211":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Lets Go Great Mom on this Wonderful Day",
                "My Stomach's a little rumbly, I suggest you birds move on",
                "Awesome, I haven't gone for a swim in ages"
            ],
            "content":"<div class=\"\"><div> <span>Today is a special day. It is the one day a month your mother lets you go around bottomless and go anywhere you feel the urge. She always walks around like that and just wants to keep it special for you so you can better enjoy. While walking over to your open window, you unconsciously push out two logs each hitting the hard wood flooring with a dampened thump. You peer (and also pee) out your window to see your backyard. Looking down you see normal things to see in a backyard and also your awesome pool. While across from your window is your friend Jenny the cow's house but her window is obscured by a flock of birds on a branch in front of her window. Now you can just head downstairs and continue your day, remove the birds and see into your friend's room, or put on a bikini and go swimming because certainly can't go swimming naked for OBVIOUS REASON WHICH DON'T NEED TO BE EXPLAINED.</span></div></div>",
            "created":1282366800,
            "id":941003,
            "title":"As Nature Intended"
        },
        "12111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Head downstairs to see whats cooking for breakfast",
                "Ask your mom to tell stories about when you were younger"
            ],
            "content":"<div class=\"\"><div> <span>Before heading down, you put on a mini-skirt. You may be naked but that dosen't mean you can't be trendy. To test the skirt out you brace yourself against the wall, legs spread wide, your back arched, your tail lifted, pulling the skirt up a little and with a groan of work you slowly push out a large turd the size of a can of tennis balls. As it comes out you can feel it touch against the back of your skirt before hitting the ground with a thud. Bending over a little more you let rip a massive fart *FFFFFRRRRRRTTTTTTTPFPFPFRRRRPPPPRFFFRRRRRTTTTTTRFRPTPFRPTPPTRPFPRTP* , you grunt with exertion as you try to keep the fart going even longer. As all of this occurs your mother waltzes into the room saying,\" Good morning sweet checks, do you know what today is\" before she notices your stink. \"Already enjoying it I see,\" she states before helping you telling you to lift your leg when farting to better keep it going. You comply but instantly your bowels unleash a torrent of poop from your already stinking butt. \" Ahh that was beautiful honey, you smell delicious this morning, let me get a better whiff.\" You approach each other to embrace both of you putting a hand on the others butt to check their load or see if anything comes out as is customary with your kind while you also pee on each other. With some effort you manage to push out a pretty good sized turd but always the champion your mother has effortlessly dropped a titanic load the size of a cinder block. She congratulates you but your load is nothing compared to her's. You've always loved and respected your mother for her ability to effortlessly take gigantic dumps and you hope one day she'll teach you how to do it but today is not that day. You've got a wonderful day ahead of you, what do you do?</span></div></div>",
            "created":1282626000,
            "id":943451,
            "title":"Short Skirt and a Long Fart"
        },
        "121111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Off to school",
                "Actually lets go to the evil school"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">After exchanging normal pleasantries, your mom goes back downstairs to continue making breakfast. Before heading down,you get ready for school grabbing books and shoving them in your bag. While it would be normal, you can not go to school topless and grab a cute top to match your skirt. This school you go to accepts your hyper messing and everybody there is okay with it. All your other hyper-messing friends also go there making it a good spot to meet up. It's a big day today, you say to yourself as you strut down the steps, accidentally dropping a book at the bottom and bending over to pick it up flashing your butt which has already  started pushing out some soft scat. As you walk into the kitchen, you see your mom making eggs at the stove, mindlessly dropping another large log onto an already big pile of turds. Time is of the essence as you scarf down the egg and head out the door to your car. Sitting down you quickly rip so loud and noisy farts to both warm the car and make it smell nice. You breath in deeply as you back out of the driveway, enjoying the tint of egg smell in your farts. \"Aaaahhhhh\" you breath out as you poop a nice warm pile on the seat and mush it around with your butt. Now your driving, where to?</span></span></div></div>",
            "created":1284440400,
            "id":957157,
            "title":"Wakey, Wakey Farts and Bakey"
        },
        "1211111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "More bathroom action",
                "Head to your first class"
            ],
            "content":"<div class=\"\"><div> <span>The drive in is uneventful but smelly as you continue farting and rubbing your butt around in your poop. Your cute skirt should mean no one can see your messy rear, not that it matters, you're sure you'll show off the goods at some point. Pulling into your parking spot, you grab your backpack and exit the vehicle. While walking to the front door, you drop a sizable deuce on the street and a trail of urine, but no one seems to mind. You quick drop your books off in your locker and make a beeline to the bathroom to meet up with your friends. When you enter, it seems empty until a massive *FffFGfgFGfRRT* echoes through the tiled space. \"That must be Jenny,\" you think to yourself, Jenny being your cow friend. You bend over and send a response, *frrtftpppt* a dry ripper. \"We're in the second stall,\" you hear your deer friend Carol say. Walking over to the second stall, you open the door and enter bent over, butt first. \"Good morning,\" you shout followed by a grunt as you show your friends your bare ass and push out a nasty wet fart followed by a log that splats onto the floor. They all respond with good mornings and various other bodily sounds, they being your friend Carol the deer, Jenny the cow, and Tandi the horse. The three sit straddling the social toilet installed at your school and wave you over to join them. The social toilet is like a set of four toilets but everything drains out in the middle so you can see what your friends are pumping out while also chatting with each other. You take your spot and send a slight yellow stream towards the center. \"No panties to take off chica, must be a big day,\" Tandi says in her usual bright tone. \"Yup, going all natural today\", you respond. \"So what are we up to today?\" you ask your friends.</span></div></div>",
            "created":1484629200,
            "id":2265313,
            "title":"It's a Brown and Yellow Morning"
        },
        "12111111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Leave for Homeroom",
                "Clog the Toilet"
            ],
            "content":"<div class=\"\"><div> <span>Everyone goes through their day adding their own specific scat to the mix. Carol talks about a test she has later today while farting out her signature little poop pellets, well not so little for her, more the size of tennis balls. Jenny talks about the date she went on with her boyfriend last night. At one point during the story she rips a series of very wet and dirty sounding farts followed by a massive splatting noise. You didn't see anything come down from her until she turned on the water works and peed down her massive cow pie into the center bowl. Those things are really heavy and hard to clean. Finally, Tandi asks you about your morning, grunting every so often while she pinches off a fat load. You've been mostly holding it in to save for the rest of the day, letting a little turd go a few times. After everyone finishes their morning chat, you get ready to leave for homeroom.</span></div></div>",
            "created":1484802000,
            "id":2266368,
            "title":"Stink and Tell"
        },
        "12111112":{
            "author_id":"vogonpottery",
            "author_name":"VogonPottery",
            "choices":[
                "Volunteer you and your friends to help clean up the mess",
                "Spend some time hanging out in the halls"
            ],
            "content":"<div class=\"\"><div> <span>\"First up, Math class!\" Tandi says cheerfully, opening her locker with one hand, while reaching under her skirt with the other. \"What are you doing?\" you ask, watching her as she removes her lightly stained underwear and places it in her locker. \" You said you were going au naturale today. I wanna join the fun!\" Tandi responds. \"What about the rest of you guys?\" \"Heck yeah, I'm game.\" comes Carol's voice, as she too starts taking off her tights and walking over to her locker. \"I'm not going to let you girls have all the fun!\" says Jenny joyfully, shrugging out of her jeans. \"If I'm competing with you guys, I'm going to need to rehydrate!\" I laugh, moving over to the drinking fountain and taking a long gulp from the stream. <br>\r\n<br>\r\nMath class is usually a bore, but today's class is made better by watching your friends from your seat in the back of the classroom. Jenny is noisily munching on a bran muffin while studying, with her plump cow hind sticking half out of the chair, quivering every few minutes with a strong, silent fart. The fox girl sitting directly behind Jenny is looking a little green, trying to pay attention to her sheet. Carol is sitting above a modest pile of deer pellets built around her desk, and as you watch, you see her move slightly, her tail raised, and add a couple more lumps to the pile. You turn to the right to take a look at Tandi, and find her watching you as she takes a water bottle out of her bag and bring it under her desk. You watch as she opens up a clear yellow stream that slowly fills up the bottle, right to the top, then starts overflowing onto the floor. The sound draws the attention of the girl sitting on the other side of Tandi's desk, who stares at the growing puddle with shock, then amusement. The teacher looks up for the first time since he finished his lecture and notices the state of the classroom. He lets out a big sigh, then says \"I guess I'll end class early today while we get this all cleaned up before my next class. Dismissed.\" The class lets out a cheer. You've got a little time left before you have to get to your next class, what will you do?</span></div></div>",
            "created":1542073620,
            "id":2576934,
            "title":"Head to your first class"
        },
        "1211112":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Slowly stink them out",
                "Turn on the Scandinavian oven!"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">Oh yes, you know the \"evil school.\" The one with a dark crystal powered by an evil wizard in the basement that manifests a bunch of people so besides them not being real, it's for the greater good. Yeah it's stupid but I can't write torture stuff unless JUSTICE and RETRIBUTION are involved just just roll with it, now back to the story.<br>\r\nSlamming your foot to the pedal and your rear to the seat, you set off for the ominous building down the street to invoke a little skunky JUSTICE! As you walk into your first class you notice, thankfully enough, that a bunch of your friends are here too. Carol the mare and her boyfriend Charlie the stallion along with your boy friend ( Currently don't have a name for him, if you have any suggestions that would be great). \" Oh, your here,\" your boyfriend says, looking up from his doodling,\" now the fun really begins!\" \"Ugh my breakfast is not agreeing with me at all,\" Carol states as Charlie puts an arm around her. \" Yeah me neither,\" declares Charlie declares before pushing out a little fart into his work jeans and grinning like an idiot,\"so what's the plan?\"<br>\r\nSo person in charge, what's the plan?</span></span></div></div>",
            "created":1325480400,
            "id":1251454,
            "title":"School's In Session"
        },
        "12111122":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Commencing Phase 2"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">\" Ah, the Scandinavian Oven,\" Charlie grinned,\" Isn't that where we lock all the doors and windows and hot box them until no one is standing?\" \"Exactly,\" you proclaim,\" all the exits should be locked and the vents closed, this is gonna get real steamy real fast so I hope everyone is ready for it, especially you boyfriend, I don't want you knocked out by our stench.\" \" Hey, If I'm reaching for the door, your clearly doing something right and anyways, I always love your guys' stinks.\" he rebuttaled. Who's going first? \" I'll go first,\" Charlie stated,\" Had some oats this morning that aren't quiet agreeing with me.\" As class started with the four friends in their back corner, Charlie, with a swish of his tail, started pushing without any signs of effort or strain. \" Oh boy, that's the stuff, time to get messy,\" He quietly whined while releasing horse apples of diabolical stench into his waiting tight work jeans, slowly stretching the denim back with his mountains of manure.  \"How about them apples\" he quietly muttered. Your nose twitches as it takes in the beautiful but strong aroma emanating from your equestrian pal's rear end. Stopping from her lesson the teacher shouted,\" What is that stench, it's positively rotten!?\" but no one said a word. The group of friends giggled in the back when Charlie asked,\" Baby, I'm running a little low of juice, mind helping me out.\" \"With pleasure,\" Carol returned before ripping a barn clearing fart. <span class=\"clgreen\">*PPPPPPPPPPPPPFFFFFFFFFFFFFFFFFFFFFFFFRRRRRRRRRTTTTTTTTTTTT* </span>This was all done without breaking character, no one knew where the smells and sounds were coming from and most were to scared to find out. \" Okay, we've warmed them up a little,\" you whisper,\" Start phase 2. \"Wait\", your boyfriend whispers,\" Let's try to knock one of them out before the next phase, drop one of your SBDs in there, that should shake them up.\" You brace yourself on the desk before bearing down, releasing a wafting fume that spreads its stinky tendrils throughout the classroom. For 15 seconds, a small hiss like the sound of a gas leak (lol) could be heard and then the first of many. The unfortunate soul sitting directly in front of the party caught a whiff, his face contorting before going blank against the almighty odor and good country crap. Okay, now phase 2.</span></span></div></div>",
            "created":1325566800,
            "id":1251663,
            "title":"Step 1, We Find the Worst Stinkers Ever"
        },
        "121111221":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Phase 3 is Go"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">Phase 2, make our presence known. Getting the signal, Charlie bursts up from his desk and dashes towards the door, shouting \"OH NO!\" while releasing wet farts that squelch across his packed pants. As he reaches the handle, a loud rip is heard as a torpedo of fertilizer bursts forth from his jeans, spilling out his collected horse apples on to the floor. A look of relaxed, dumb pleasure forms on Charlies face as his head lolls back. He continues shitting onto the floor as the front of his jeans begin to darken and drip. Meanwhile, greatly inspired by her boyfriends actions, Carol has been busy filling her cotton panties with horse apples of her own, bulging them out well beyond the confines of her skirt. She waddles up to the teacher saying,\" I had an accident, a lot of accident!\" The teacher at this point, already disgusted by the shitting stallion at the door just starts flipping out and yelling at Carol. Stomach rumbling, Carol giggles,\" Guess I'm not finished yet, tee hee.\" before bucking the teacher back into her chair, ripping a well timed fart to help blow her back.  <span class=\"clgreen\">*FFRRTT*</span> \" Oh teacher,\" she coos, sexily lowering herself onto the teacher's lap, her mess smushing and spreading out. \" I'm so messy but maybe you can help me, uggnh.\" <span class=\"clgreen\">*FFFFBBBRRRTT*</span> \" clean up.\" she suggests while pumping out a deep, bassy fart that warms the teacher's lap. \" Uh oh, here come the oats!\" she shouts,\" bombs away!\" A rancid warmth permeates the room as your mare friend's butt shoots out a spray of diarrhea into the already overflowing undies. Laughing out loud Carol states,\" I'm losing all sorts of control now, might as well go with the stinky flow.\" With shit oozing out of her panties already, Carol gets a big grin across her face and her head lolls back similar to her boyfriend. A series of rapid fire farts escape from her beautiful brown plot, blasting manure all over the teacher. Judging by the teacher's expression, she is both disgusted and barely holding on against this assault. The farts stop for a few seconds, as on odd silence fills the room. Carol momentarily leaves her state of pleasure to concentrate for a second. Her eye's lower, she grits her teeth before returning to Neverland <span class=\"ckhaki\">*PPPPPPPPPPPFFFFFFFFFFFFFFFFFRRRRRRRRRRRRRRRRRRRRTTTTTTTTTTTTTTTTTTTTTT *</span> An earth shaking fart, exploding her stretched panties and spreading her mess all over the teachers lap. This is clearly the last straw for the teacher as she passes out from the stench. As one looses consciousness, another gains it back. Charlie breaks out of his stupor, hearing his super hot girlfriend creating such delicious nastiness. He unzips his already soaking jeans, his massive colt \"peacemaker\" flopping out as he proceeds to pleasure himself. While his rear continues to dish out manure by the minute his front is shooting out a steady stream of stallion sperm. \" Oh that's it baby,\" he shouts,\" Daddies cumming!\" He whinnies loudly with renewed vigor before crouching down and concentrating all his energy on pumping out as much nastiness out of both ends as possible. Now you've been watching as this messy chaos, but now it's your turn!<br>\r\n</span><br>\r\n<br>\r\n</span></div></div>",
            "created":1325826000,
            "id":1253384,
            "title":"Commencing Phase 2"
        },
        "121112":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Continue the Ritual"
            ],
            "content":"<div class=\"\"><div> <span>Actually, back in the day when you were a baby and young toddler, you had been brainwashed and kidnapped by other families to not enjoy messing. This of course did not change your love of it but it did create some pretty great stories. There was one time this evil mom had you in pull-ups and well, let's just flashback to your point of view.<br>\r\n<br>\r\n*Flashback*<br>\r\n<br>\r\nYou are currently a young toddler sitting in a room wearing a pull-up with an incredible need to fill it. Of course mommy dosen't like this but when has that stopped you before? You mindlessly play with your toys, pushing your toy car along until your stomach rumbles. Without really stopping or even noticing, your tail raises up and you push out of soft log into the pull-up, causing it to bulge ever so slightly. Piloting your toy car, it arrives in your block town and you plop down to continue building the city, smushing your mess out. Being a skunk, a simple swish of your tail unleashes a torrent of silent but deadlies, but you just sniff the air and wonder who let this beautiful aroma in.</span></div></div>",
            "created":1339477200,
            "id":1358579,
            "title":"When You Were Young"
        },
        "12112":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Ask if she has a load going",
                "Ask if she wants to terrorize your other neighbohrs"
            ],
            "content":"<div class=\"\"><div> <span>The birds must go, you lift your naked booty to the window and unleash a silent but deadly fart mixed with some of your skunk juice. As your wonderful smelling cloud makes its way to the birds they drop down off the branch one by one. Ahhh, you've been holding in that one for a while and you love messing with animals speaking of which you accidentally pushed to hard on that initial fart and a cascade of poop falls from your butt along with some really loud farts, well there goes sneaking up on your neighbor but at least you have her attention. You can her head poking out her window now. Quick, don't be an anti-social, shitting anywhere jerk face say something. But what?</span></div></div>",
            "created":1282453200,
            "id":941737,
            "title":"This is how I Contact All my Friends"
        },
        "121122":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Open the door genius"
            ],
            "content":"<div class=\"\"><div> <span>You shout across to your friend if she wants to mess up your neighbor's house. After admiring your smell, she hastily agrees. Your other neighbor is one of the evilest men to walk the face of the earth, he has a very high up corporate position and runs a dictatorship over his employees. You know many of his employee's love your blog (you know that blog of your where you post about being a hyper-messing skunkette with your friends) and you want to help them out. Also he sells drugs to kids, dosen't recycle and rapes women. Besides being the biggest asshole ever he highly detests you and your friends and all of your messes. In short he's totally evil and deserves this punishment. Jenny says she wants to change into something else and will meet you over there shortly. Awesome, today is gonna be the best day ever. Turning around you notice a pile of your manure that been building up this whole time unbeknownest to you. Your incredibly full today. Great news for you, horrible for your neighbor. You quick run down stairs, dropping a log on each step. Your naked self bursts out the door and you run over to the door to meet Jenny who is also wearing nothing. This is going to be the best day ever, but where do you begin?</span></div></div>",
            "created":1282539600,
            "id":942208,
            "title":"The Only Asshole Bigger Than Yours"
        },
        "1211221":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "I think my random poops will do more damage",
                "I know there are more guards in that house, I need all the stink I can get"
            ],
            "content":"<div class=\"\"><div> <span>To bad you can't, there's this big guard in the way. You must have forgotten that your neighbor guards his house with hired mercenary who are also criminals. You've tangoed with them before, and by tango you mean knock them out with your smell, but they're still scary. Knowing you can't get into the front door, Jenny suggests working your way around from the back door which is usually unlocked. The both of you dash to the backyard, you peeing freely while Jenny, as the cow she is, plops out a fresh pile of manure with every step. The front door guard gives you an incredibly mean and disgusted look but you ignore it, he'll get his comeuppance later. So now your in the backyard, you see a pool, one of your bikinis from the last time you were here and went skinny dipping, and the unguarded door to the backyard. Before going inside you both decide the pool is your first target. The both of you jump in but precede to relax, slowly letting out a turd here and there as you lazily float around the pool. At one point Jenny gets a really bad cramp and pushes out most of her breakfast in the form of multiple large,wet cow pies. At another point you both climb out and put your butts up against the edge and start pushing out massive logs. You push with all your might as a poop the width of a 2 liter bottle of soda pokes out from your booty and continues coming out until there's a poop train from your butt to the bottom of the pool. You both giggle loudly as you both continue to dump all your bowels content into the pool which is getting pretty rank at this point. Finally to finish it up, you both stand up and while walking around pee into the pool. It's taken a lot of practice to pull this off but you practiced a lot with your mom at your house. With the two of you feeling somewhat empty and the pool, now brown and yellow with a visible stink cloud coming from it, you decide its time to hit the house but do you go in naked and dump anywhere or where the bikini to bring your loads with you and drop more tactical logs?</span></div></div>",
            "created":1282539600,
            "id":942563,
            "title":"It's Blocked Numb Nuts!"
        },
        "12112211":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "This I gotta see",
                "Let's Split Up, We Can Do More Damage that Way"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go the all natural route and both you and Jenny slip silently into the house. Sneaking past passing guards, you find your self in the kitchen where you find the gigantic stacks of bean cans your evil neighbor confiscated from you earlier in the week. They must be still good as you and Jenny hunker down and proceed to eat and refuel yourself for the upcoming invasion. To see if your gas tank is indeed set to full, Jenny quietly grabs a passing guard from behind and pull him into your anxious, awaiting furry buttocks. Quickly wrapping your tail around his head, your plump booty stops the guard's screaming shouts to be heard as you unleash a barrage of farts, *PPPPFFFRTRTRFGRTT* *PRFRTRTRFRRTTTTTT* *FRFRPPPRTTFRTFPPPFRTTTRTRTRT* Each one's sound dampened out by the screaming man's face. You feel a great feeling of justice (and also your stomach rumble, more farts on the way) that this man who is both a child rapist and sells drugs to children is getting his punishment. Did I forget to mention that every person guarding this house is wanted for henious crimes against humanity and that anything goes to torture this scum of the earth, because that's what it is. As you contemplate this you head into the finishing stretch of horrible wet farts (that means your dump tank is once again full) finally ending with one last butt trumped with a bit of your skunk spray. The man howls in pain from your sweet and intoxicating stench as his face is literally burned. Laughing quietly, you unleash the man from your grip before laying him on the ground while Jenny readies her bowels to unleash round 2. Do you sit around and watch the show while waiting for Jenny or do you head over to the main entertainment room?</span></div></div>",
            "created":1283317200,
            "id":948581,
            "title":"Farts *OF JUSTICE*"
        },
        "121122112":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "You know what time it is?"
            ],
            "content":"<div class=\"\"><div> <span>You leave that piece of shit human being to be done in by just that, shit. While you would normally love to watch, today is finally the day you take out your neighbor and his horrendous mark on humanity. Readying yourself for the ultimate storm that will take place after all those beans, you dash to the living room. *RUMBLE RUMBLE* \"Here it comes!\" you shout before laying down on your back onto a sofa that's pointing a wall. A single tiny fart rings out. \"Odd\" you think,\" normally my butts a cannon after a meal like that.\" Just then <span class=\"cbrown\">* FLLLLLARRRPPPPP*</span> A shotgun blast of poop rockets out of your loaded booty, spraying the wall with a deluge of doodie. \" Now that's what I call modern art,\" you quip as you start unloading mushy logs onto the sofa your laying on while farting a peeing freely. Scooting back, you feel your stomach rumble once more indicating another blast. You ready your ass blaster at a portrait of your neighbor. <span class=\"cbrown\">* BAGGUUUSSSSHHH*</span> \" Wow, my brown crap extenuates his features pretty well,\" you thoughtfully remark,\" I can't wait how to see how it looks in real life.\" You then proceed to prance about the rooming, pooping on just about anything. At one point you even use his webcam to take video and pictures of your act and post them all over his computer, that will show him for banning your blog from his employees. His desktop background is now a very tasteful shot of you taking a huge dump on your knees onto his already crappy portrait while making a ,did I do that, face. Your almost done with this room, but first all his evil plants must die, he uses them to torture children. You take wonderful pleasure in ripping a giant fart in front of every plant until they wilt, brown and dead. To better view your progress, you take a step back to observe. Wow, you really trashed this room, almost everything is either brown, wet, or both and on top of that, your lovely odor permeates the entire room. This would make your mother so proud, you should show here after today is over. Before leaving, you try to think up a cool line to shout. \" It looks like the shit just hit the fan.\" you playfully utter. Ugggghhh, that was the worst idea, you are so bad at that, maybe you'll have better luck in the media center. You've already stalked out the house, you've been planning this day for ages.</span></div></div>",
            "created":1284267600,
            "id":955812,
            "title":"Ass Blaster"
        },
        "1211221121":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Get on with it"
            ],
            "content":"<div class=\"\"><div> <span>Yup, time for dumb movie puns with scat jokes in them. You've made and seen a ton of scat remakes of movies, here are some of your favorites. Beauty and the Beastly Dump, that was a fun one to film. It's about a girl trapped in a castle and while many love her looks they are turned away by her gigantic craps until her prince finally comes who her and her messes. You remember you got to poop in a beautiful dress in that one which your normally not aloud to do, but it was such a wonderful sight. Next is Sisterhood of the Sagging Panties. A great one you did with your friends about a group of girls that discover the joy of panty pooping but then they all move away from each other but send around a pair of panties which they all poop in. One of the last ones you made was Bravefart about a group of female farting warrior fighting against an oppressor that wanted to put a stop to their smelly ways. Finally a scat original movie entitled Shit has been gaining popularity. Its about a serial killer who captures people and puts them through grim, tortuous fecal matter related challenges to survive. Your one cousin showed you some of this and the first couple were ok, but now they make even you sick. Well now that we have that out of the way on to the media room.</span></div></div>",
            "created":1284354000,
            "id":956519,
            "title":"Dumb Jokes"
        },
        "12112211211":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Shit just got real"
            ],
            "content":"<div class=\"\"><div> <span>You wander over into his main media center finding some cabinets, a big tv, and a quickly spinning fan. For a dude you really hate he's got nice set up, you take to ransacking his cabinets and find a pack of diapers he stole from you a while back. \" Well now seems as good a time as ever.\" you state, taping up the diaper as you settle in for a movie marathon where getting up is not on the menu. You belly flop on to the lush, expensive couch and rip a massive fart before settling in for the show. Tummy rumbling, you shift around to find a more comfortable position finally stop at on you hands and knees. At this point your bowels give up and a massive amount of poop squelches its way into your waiting padding. <span class=\"cbrown\">*PPPPPPPFFFFFFRRRRRRRLLLLLRRRTTTT*</span> \" Ah, nice and squishy just how I like it.\" you coo, reaching back to massage your massive load. Grunting with each one, a series of smaller farts follows. A particularity loud, wet fart shakes you out of your euphoria and you fall back onto your butt with a loud <span class=\"cbrown\">*SQQQUISH*</span>. \" Wow it's everywhere,\" you happily shout,\" He's gonna have a fun time cleaning that.\" Some of your poop when through your leg wholes onto the couch when you fell. While continually shitting and grinding your mess all over the couch, a loud hissing sound is heard as your bladder empties into the waiting but not quiet ready diaper. A puddle forms around your already multi-colored diaper. Oh boy you are really enjoying this until you hear the sound of a gun cocking. Gazing over to the open door you see your evil neighbor pointing a gun at you, clearly home early from a day of extorting money from orphanages and selling drugs to children. Quickly snapping yourself out of your pleasure, you stand up tensely watching him as he moves closer and serves the scene. This doesn't look good!</span></div></div>",
            "created":1313038800,
            "id":1166525,
            "title":"Movie Marathon"
        },
        "121122112111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Unleash the Booties of Mass Destruction",
                "No Behind is Left Behind, espcially when its that dangerous"
            ],
            "content":"<div class=\"\"><div> <span>Shit does indeed get real as your bowels explode into your already past bulging diaper with a loud, obnoxious <span class=\"chunter\">*PPPPHHHHFFFFTTTT*</span>. It just so happens he pulled the trigger at that moment but your noisy booty destroyed his concentration and his shoot went high, hitting the fan in the process. The fan, still running, falls perpendicular to the ground right behind you, shredding into your wonderfully disgusting diaper. Your diaper explodes as shit is flung around the room at high velocity. Your neighbor is incredibly disgusted by this, though he hasn't even seen your work in the computer room. Taking this moment of distraction, you lay down a skunky, green smoke screen <span class=\"clgreen\">*FFFFRRRRRTTTTTT*</span> before skedaddling out the nearby window. Man, you are really stupid for not saving that one liner form earlier for here. You facepalm as you decide what to do next. Go back to your house for  your mom or sneak back in through a different door and look for Jenny</span></div></div>",
            "created":1313038800,
            "id":1166528,
            "title":"The Shit Literally Hits the Fan"
        },
        "1211221121111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Bust in through the front door",
                "Take to the roof"
            ],
            "content":"<div class=\"\"><div> <span>You skedaddle back to your abode to call in the big guns. Walking into the main room, you find your mother laying out on the sofa enjoying a book and a slowly growing mound of scat under here ample rear. As soon as you say a signal word about your, the book comes down. \" I have put up with that man for far too long,\" she shouts. \" Better call a builder,\" she bellows,\" as there will be nothing left of that house when I'm done.\" Your mother storms out of the house leaving you in a surprised state. Usually your mom is like a calm, cool spring. The very image of chillax but now she's unleashed something, a rage of sorts, like the one currently punching around in your aching bowls. Quickly hurrying outside to watch your mom, you see her walking over to the guard in front of your neighbor's house. \" Shit lady, haven't I already told you to get your skunky ass out of here today.\" the guard quips. You mother is clearly having none of this as she turns around, bends over, and unleashes one of the nastiest skunk butt blasts you've ever witnessed. A billowing cloud of bright green is released from your mother rear, accompanied a long <span class=\"clgreen\">*PPPPPPPFFFFFFRRRRRTTTTTT</span>*. An acrid smell fills the air followed shortly by the smell of cookies, your mother's scent. Surveying the damages, you see that the guards face has been completely burned off and all that remains is a skull attached to a clothed body. Not showing a single ounce of pleasure in the matter, your mother proceeds to turn around and kicks the skull of the body. She then places the neck to here butt and takes a gnarly dump. Wow, she means business! You see her run off, but to where?</span></div></div>",
            "created":1313470800,
            "id":1169730,
            "title":"I Oughta Rip Off Your Head and Shit Down Your Neck"
        },
        "12112211211112":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "PARTY TIME, EXCELENT!"
            ],
            "content":"<div class=\"\"><div> <span>She quickly scampers up the roof to the chimney. You think you see where this is going and you quickly over to the window into the family where your neighbor is with Jenny to survey the barrage of \"presents\" from the fireplace. A quick series of wet farts echos through the brickwork as your mother quickly gets to work, pushing with everything shes got. Jenny gets the hint early on but your neighbor is confused until a mountain of shit pours forth from the cozy hearth. To clarify, this isn't some soft scat. This is some hardcore mud mountain here. <span class=\"ckhaki\">*PFFFRRRRTTT*</span> <span class=\"cbrown\">*SPPLLLOOORRTCCHHHH*</span> <span class=\"cgreen\">* FFFRRRRTTTTT*</span> . She shows no sign of stopping as your neighbor starts flipping out and gagging. Jenny, on the other hand, is really enjoying herself as your jerk neighbor rushes out of the room. You look up and shout to your mom that he's left the room when out of the corner of your eye you see a rocket shoot off in to the sky. \"DAMN IT!\" you loudly proclaim as your nemesis once more escapes your stinky grassp. This will be a battle for another day. Being the ever agile acrobat she is, your mother gracefully leaps to your house and hops down to the backyard. Needing to rescue Jenny, you quickly bust in to the delicious smelling house and go free here from her chains. There were chains, I just didn't mention them. Your both pretty down about not finally getting him until a gurgling wet fart rumbles out of Jenny's ass <span class=\"cgreen\">*PBBBBBFFFFTTTT*</span> , causing you both to break out into laughter. \"Look on the bright side\", you say through laughter,\" We get new neighbors!\" And with this wonderful revelation there's only one thing you can do.</span></div></div>",
            "created":1316062800,
            "id":1187940,
            "title":"A Christmas of Sorts"
        },
        "12113":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "The World Should See More of My Wonderful Body",
                "That One Piece Does Look Pretty Tempting for its Capacity"
            ],
            "content":"<div class=\"\"><div> <span>A swim sounds like a wonderful idea this morning, a you just bought a some new swimsuits which you'd love to model but which one do you pick. The smoking hot red with flames bikini with ties or the curve fitting, fur matching black with a white stripe 1 one piece?</span></div></div>",
            "created":1282366800,
            "id":941010,
            "title":"The Swimwear Stumper"
        },
        "121131":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Yes, Get on with It!!"
            ],
            "content":"<div class=\"\"><div> <span>Smoking hot fire bikini it is. You quickly start posing in front of the mirror admiring your lithe but solid frame. The crazy amounts you crap do have benefits one being a great way to regulate weight, it's just one of the many awesome perks you have for crapping nonstop. Anyway with each pose you rip a stinky fart clouding the room with your personal musk. Still posing and farting, you take a minute to admire your sexy rear, the most dangerous part of you. Your booty's been through a lot and is surprisingly muscular for all of the huge logs it's needed to push out. As you are about to finish posing, you turn around and give your butt a smack before causally dropping a soda can sized load into your waiting bikini bottom where it warmly settles and hugs up to your furry back side. You give it another smack, smashing your turd and turning the once black bikini bottom a wonderful shade of brown. Now should you finally go swimming?</span></div></div>",
            "created":1282885200,
            "id":945427,
            "title":"Admire My Bikini Bottom"
        },
        "1211311":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Advance the plot"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">Zooming down the steps, you burst out the door to your backyard loosing your bikini bottom somewhere along the way. Your friends, Jenny and Carol, have done the same and are waiting for you in the kiddie pool still wearing their bodacious bikini tops. You exchange hellos before slowly lowering yourself into the already warm pool water, you question Carol. \" You know that expression having to piss like a racehorse, well pretend it's the whole stable and ya got me,\" she says. Sitting each in your own sector of the circle, your back against the wall, you lay your head back and relax. The three of you relax but after a while you feel a force underwater like a jet. \"Geez, someone has to go!\" you remark. Carol grins confidently as she opens her legs wider, causing the jet to intensify. \"I thought we were all relaxing,\" she comments,\" I thought I could just let go.\" Okay then what happens next</span></span></div></div>",
            "created":1328590800,
            "id":1272627,
            "title":"Welcome to our Ool"
        },
        "12113111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Continue the Jacuzzi",
                "Release the Turd-tacnic"
            ],
            "content":"<div class=\"\"><div> <span>Getting into that relaxing mood, the water around you warms as you pleasurably release a waterfall of piss. The pool's once clear surfaces begins to turn a murky yellow as the three of you pump out your limitless bladders into the water. \" And I thought I had to go bad,\" Carol said moving her crotch up causing her jet of pee to break the surface. You and Jenny join in this pee fountain spraying around the pool and occasionally a little bit on each other giggling all the while. \"Watch this\", you say standing up towards your fence and leaning back a bit. With a mighty \"UNF\" you release a stream over the fence and can hear the tinkling sound as it lands in your neighbors pool. \"Bulls-eye\", you triumphantly shout. \"Hew Whe!\" Jenny comments,\" the water is getting mighty warm and we got jets, this is practically a hot tub. \"Exactly, all it's missing are the bubbles,\" agrees Jenny before grimacing for a second. *FFFWUB* A large bubble bursts up from Jenny's lap releasing a noxious green fume. Taking a large whiff of her scent, Jenny comments,\" Nothing like your own scent girls am I right?  Yes ma'am, I can tell you it's gonna get messy soon\". \" Oh it's full tilt jacuzzi time,\" you shout, barreling down to release a buncha bubbles turning the nearby water a sickly green.</span></div></div>",
            "created":1328677200,
            "id":1272821,
            "title":"Relaxin Action"
        },
        "121131112":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Chapter isn't finished yet"
            ],
            "content":"<div class=\"\"><div> <span>(Hey go check out the last chapter quick, I added a bunch of new stuff to it)<br>\r\nThe three of you have a great time recreating a hot tub with all the heat, jets, and bubbles gals like you could ask for. After a while you all settle down and just enjoy the smell. After a while a turd the size of a candy bar floats out into the middle of the pool. You eye your friends suspiciously. \"Wasn't me, mine would be way bigger than that,\" Carol says. Looking over to Jenny you see she has this smug look of satisfaction. \"Hey at least it wasn't diarrhea,\" Jenny retorts rubbing her stomach.</span></div></div>",
            "created":1404622800,
            "id":1823543,
            "title":"Release the Turd-tacnic"
        },
        "121132":{
            "author_id":"controndatiger",
            "author_name":"ConTronTheTiger",
            "choices":[
                "The extra capacity footie pajamas",
                "Still the black one piece with the white stripe "
            ],
            "content":"<div class=\"\"><div> <span><i>What else do I have?</i> you think as you walk over towards your closet. You open the door and see an extra large (more like extra capacity) pair of red footie pajamas. You take them off the hangar and toss 'em on the bed. What will you go swimming in?</span></div></div>",
            "created":1465448400,
            "id":2161633,
            "title":"Wait..."
        },
        "1211321":{
            "author_id":"controndatiger",
            "author_name":"ConTronTheTiger",
            "choices":[
                "Jump",
                "Walk"
            ],
            "content":"<div class=\"\"><div> <span>You did always want to go swimming in those pajamas. You pick them up and pull down the zipper. Then you slide in your feet one at a time, put your arms in the sleeves, and zip it back up. You look at yourself in the mirror as you squat down and release a shit load of shit, only 10 themes bigger. You release so much poop that your pajamas are already half way filled. (And they've expanded 3 feet from your waist) Now it's time to go swimming. But will you jump in from your second floor window? (You've done it many times before and you have a huge pool) or just walk squishilly down the stairs?</span></div></div>",
            "created":1465448400,
            "id":2161638,
            "title":"The extra capacity footie pajamas"
        },
        "1212":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "You can not wait another second, poop comes out now",
                "You can wait, anyway you love watching Tandi's messes",
                "Shoot a video"
            ],
            "content":"<div class=\"\"><div> <span>As soon as you get that diaper you remember you called your friend Tandi to come around this time, you actually hear her coming up the steps. Tandi is your cow friend who works in the fields fertilizing them with the freshest manure if you catch my drift. She too is wearing a diaper and is ready to unleash hell much like yourself. Before that you have to decide who goes first.</span></div></div>",
            "created":1282021200,
            "id":938278,
            "title":"Two padded butts are better than one"
        },
        "12121":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Change into a new diaper and think it over in your bathroom",
                "Escape from the tree by your window"
            ],
            "content":"<div class=\"\"><div> <span>You seriously can not wait another second and instantly dump ass. Jenny marvels as you continue to push pound after pound of scat into the rapidly expanding diaper. \" Dang girl, I didn't know you had to go that bad, just keep it coming, I'm loving every minute of it you sexy beast.\" shouts Jenny. She's really getting into it, she's got her head down to your butt and you give her a nasty fart right into her face for the respect, *PPFFFRTT* \" Ahhh delicious, you may want to slow down soon though,\" Jenny suggests,\" I don't think that thing can hold much more or if I can take much more of your rank smell.\" You can't believe what your hearing and take that as a challenge pushing out clump after clump of shit, grunting and groaning sexily the whole time, constantly ripping farts and peeing a river. At this point the diaper's incredibly soggy and is really weighing you down, the front has turned to a magnificent shade of yellow while the back has turned to a bubbling brown. As you let out one more nasty fart muted by the fluffy get sagging diaper it looks like Jenny is about to pass out. \" That enough for ya,\" You shout out definitely. Jenny readies to shout a counter argument but her bowels instantly lock up as her butt pushes out a ton of manure, bugling the diaper back with some falling out as she moos in paradise, You know from many experiences that Jenny dosen't have much of a nose for other people's smells and that she tends to let go in cripplingly large loads to block out that smell  but you love her for it. Just to see her speed up you unleash a little SBD mixed with some of your stinky skunk juices. This new smells explodes into Jenny's nostrils sending her derriere into overdrive as it poops out so much crap that Jenny's messy diaper now covers the door to outside. Nice going idiot, now your stuck what now.</span></div></div>",
            "created":1282712400,
            "id":944298,
            "title":"Poop Coming Out"
        },
        "12122":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Go outside and play in the snow",
                "Continue messy play with Jenny"
            ],
            "content":"<div class=\"\"><div> <span>It looks like Jenny is going first and because it's so cold from your window being open and that it's snowing outside ( did I not mention that cause it's totally snowing) both you and Jenny climb into your bed for added warmth. As you both settle in under your covers you hug Jenny close from behind for heat. Jenny noticing this pushes out her first cow pie into the waiting diaper which expands back. You can feel it's heat as Jenny continues pushing out hot mess with a fart every now and then which you can feel vibrate from her already drooping diaper. \" Warm enough for you,\" Jenny asks you, which you reply, \" Your always on fire when you drop a load Jenny.\" You both laugh and to really get warm you both start a dutch oven underneath the sheets, just continually farting. The air under your sheets is getting pretty rank and visibly dense as you hear each muffle fart erupt from Jenny and your sexy booties. All this warm air reminds you that you still have to go and you ask Jenny if she would like to watch. \"Actually,\" Jenny questions,\" could you send a little of that poop my way, my fronts kinda cold, it does take a lot to warm these four stomachs of pooping madness.\" You oblige her by pulling down you diaper and sitting on her lap as she pulls out the waistband of her's. With a grunt of effort, you push out a few logs into the front of Jenny's diaper. She moos, basking in the warmth and pleasure of your poop. Now that your're both warmed up, what next?</span></div></div>",
            "created":1283576400,
            "id":950252,
            "title":"Just a Hot Mess"
        },
        "121221":{
            "choices":[
                "They pee there way out",
                "They poop there way out"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on messy girl let's go outside and play in the snow\" you said with a playful voice. \"You read my mind girl let's make some brown snow\". You both shared a laugh then ran down the stairs and burst out the front door onto your front yard. It was good at first,but they both tripped and fell in the snow face first.\"It's so cold my diaper is frozen i cant barely move my booty\" jenny said shivering. \"Your rite i can't move my diaper is weighing me down,we got to warm-up or we might not make it out alive\". \"I got a idea if we pee the diapers will warm up and we can get up no problem,or we can poop and burst the diapers and try and get up\"you said eagerly .\"They both sound good so which will it be\" jenny said impatiently.     </span></div></div>",
            "created":1324270800,
            "id":1242873,
            "title":"Go outside and play in the snow"
        },
        "1212211":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Help a Friend Out",
                "She Is Your Captive Audience"
            ],
            "content":"<div class=\"\"><div> <span>You hear a strong hissing sound as Jenny opens up her bladder. Steam rises up around her as the hot liquid heats up her diaper surrounded by the cold snow. Some melts but it's not quiet enough. Having not gone yet you blast out a torrent of pee into your clean padding. The force has it all directly absorbed making the front very soggy and weak. Jenny stares at you in surprise as a great plume of steam rises up from your crotch. Feeling you've almost broken through, you centralize all your gas and let go a mighty queef. The southside lady belch blows open the soggy front of your diaper allowing the muggy scents and heat escape and warm you up. You're now free and mostly warmed up. Jenny is still trapped in the snow absolutely bewildered at the performance she has just witnessed. Do you help Jenny or warm her up in slightly less helpful ways?</span></div></div>",
            "created":1408597200,
            "id":1845320,
            "title":"Very Yellow Snow"
        },
        "121222":{
            "author_id":"cyberplaner",
            "author_name":"CyberStrain ",
            "choices":[
                "Jenny locks herself in the closet",
                "Invite your sister"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You say to Jenny \" I going to change the sheets to day anyways, so why don't we just take off are diapers and turn this bed into a toilet\" Jenny quickly agrees. You both take off you bed and start stinking it up.</span></div></span></div>",
            "created":1405227600,
            "id":1826971,
            "title":"Continue messy play with Jenny"
        },
        "12123":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Let Tandi take a turn",
                "Pump up the juice"
            ],
            "content":"<div class=\"\"><div> <span>You decide that this is the perfect time to shoot a fart video. You and Tandi have a lot of gas in the tank and even if you poop, that's what the diaper is there for. Wanting to hide the diaper from the viewers, you and Tandi put on black spandex pants that stretch over the waiting garments. \" Haha you butt looks so huge with the diaper on,\" laughed Tandi as you admire her own large rear. \"All the better for the viewer,\" you smirk back,\" and it can only get bigger as the video goes on.\" After setting up the camera, you take first shoot, bending over slowly in front of the camera. Your tail lifts up and after a brief \" grrnnppm,   ahhhhh.\" *FFFFFRRRRRRRRTTTTTTT* \"Oh that was a loud one,\" you comment as you breath deeply through your nose taking in your scent. Lowering your bottom, you grunt \"GGGNNN\" *PHPHPHPHHPHPHPHPLLLLPPPHHRR* \"That was a wet one!\"</span></div></div>",
            "created":1351054800,
            "id":1452958,
            "title":"Shoot a video"
        },
        "1213":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "I'm not done streching yet, let's do some sit-ups",
                "BOMBS AWAY!!!!!"
            ],
            "content":"<div class=\"\"><div> <span>After selecting a nice pair of solid white panties and bra you start your morning stretches in front of your mirror. You slowly bend over to touch your toes lifting your tail as you go. Just as you reach your toes, your butt unleashes a nasty fart and you slowly push out a hot steamy log into your nice clean panties tenting them back a half foot away from your butt. As you start to bend your head under your legs ( you are very flexible) you see the log settle gently into the bottom of your panties. You smell the air and waft in your delicious scent. You stand back up but not before watching yourself naturally drop another giant log into your panties. \"Sweet\" you say as your reach back to serve the deposit. It's a pretty good sized load and you congratulate yourself for pooping so big without thinking buts there's a lot more where that came from. \"Mom still won't let me out of my room with that little back there, she knows I can do better, anyway I know she loves my smell as much as I do\" Do you keep stretching and increase your deposit naturally or just drop your load now.</span></div></div>",
            "created":1281848400,
            "id":936953,
            "title":"My way of starting the day"
        },
        "12132":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Lets just squat",
                "To remember my skunk ancestors, I shall do a handstand"
            ],
            "content":"<div class=\"\"><div> <span>You've stretched out enough, any way dropping a good load is exercise enough. You get into your favorite pooping position on your hands and knees and let it rip. Your tail lifts up as you unleash a torrent of crap and farts. Your panties begin to stretch farther and farther as you continue and you continually push out more .A squirrel climbs to the branch outside your window to see what all the ruckus is but quickly regrets as he falls unconscious to the ground from your stink cloud. *PPPPFFFFRRTTTT* Your butt rings out as you drop log after log into your expanding undies. The flow stops for a moment but a few grunts later your back into it. Hearing so more birds at your window you yank on your tail to unleash the nastiest fart yet sending them all drooping just like your panties. Refreshing, you think to yourself but you are in no way empty. You stand up and admire your work in front of the mirror. \"Maybe enough\" you think unsure if it enough even though your currently hanging onto your panties to stop them from falling. You grab a belt to secure them and go onto to choose another position. Reaching back you smush the crap into a more uniform shape. You can't believe your panties are holding that much but you know from experience they can hold more. Remember you can't leave that door till your doodie pants hit the floor.</span></div></div>",
            "created":1281934800,
            "id":937357,
            "title":"Dropping Da Bomb"
        },
        "121321":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "I walk a lonely road, but with when I have my biggest load",
                "The mission is clear, I'm going over there and I'll need all the help I can get"
            ],
            "content":"<div class=\"\"><div> <span>You do the normal thing and not squat down and let gravity help you squeeze one, or a few dozen, out. For support, you grab the corner of your bed and let er rip. Your tail lifts up quickly as your  backside unleashes hell upon the already sagging panties. Giant farts explode out of your butt after each poop. *PPPFPFPFFFRRRRRTTT* You feel a big one coming and reach back to feel it as it slides into the smelly confines of your underwear. *PPPPPPFFFFTTTT* You push out the last bit of your current load and are ready to stand up but you lose your balance and fall back. Readying to feel the pain of hitting the floor all you hear is a soft <i>smush</i> and notice that your currently sitting on your poop like a chair. Your about a foot above the ground on your rank recliner and decide this is the perfect time to let out a fowl fart. *FFRRRTTTTTTFRTRFRT* It bubbles the poop beneath your butt and you can actually see the stink eminating from your destroyed panties. While delighted with your work you've got a full day ahead of you, do you go off on your mission alone or call up your boyfriend for help. Remember your a hot skunk teen with some panties full of poop and an appetite for destruction, and justice.</span></div></div>",
            "created":1282366800,
            "id":941026,
            "title":"Aromic Armchair"
        },
        "1213212":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "A few smelly minutes later"
            ],
            "content":"<div class=\"\"><div> <span>Ahh you love your boyfriend, and he loves you and your messes just as much. While he may not be able to produce as much as you, you still love him to death, its hard to find a man with a nose for your aroma. Still sitting on your pile of poop you grab your cellphone from the table and dial him up. He quickly answers the phone and you greet him in your normal way, with a big fart into the phone. He can hear the bubbling and knows your panties are full of poop, he says he's working on quiet a load himself in his diaper and can't wait for you to see it. To get back to the point, you ask him if he'd like to go to the mall with you. \"Which one?\" he asks to which you reply,\" The evil one\". Laughing with delight he says he'll be over to pick you up soon love muffin, just sit tight and stay stinky. Taking his advice, you precede to pee in your sagging panties and unleash a number of devastating farts. Closing your eyes you take a deep sniff in, smelling your rich and wonderful aroma. Opening you eyes you see you have a constant visible green stick cloud surrounding your panties, Awesome!!</span></div></div>",
            "created":1282539600,
            "id":942197,
            "title":"Bringing In Back Up"
        },
        "12132121":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "He's fine, it's time to go to the mall",
                "I love him, lets help him out a little"
            ],
            "content":"<div class=\"\"><div> <span>After sitting around for a few minutes contemplating your smell while swishing your tail to spread the stink around the room you hear your boyfriend roll up in his car. After putting on a top and skirt combo, you quickly dash down the steps and bust through the door like an Olympic runner. He has the door to the passenger side all open and ready for you. He clearly sees and enjoys your wonderful mess as evidence from the bulge at his crotch. He's usually shy about it but you usually accept him and coax it on. That facet of life is natural just like your messes (which the size of them is very unnatural). Do you ignore it and sit in the passenger seat or help him out and go sit on his lap?</span></div></div>",
            "created":1283835600,
            "id":952250,
            "title":"Your Coach Has Arrived"
        },
        "121321211":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He's just too infatuated with your mess, your not going anywhere. He may politely say nothing is up but you're well aware of whats up and how to deal with it. Please don't leave a brotha standing!</span></div></span></div>",
            "created":1284267600,
            "id":955772,
            "title":"NOPE!"
        },
        "121321212":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Pedal to the metal my messy friend"
            ],
            "content":"<div class=\"\"><div> <span>He seems genuinely embarrassed about it but you gotta teach him its only natural. Strutting around to the driver door, you make sure to flash him your mess from under your skirt as you pass by the front windshield. He is totally enamored with your hot load and wonderful visible aroma but you can tell he's resisting it. While opening the door you exchange some pleasantries and plop down unto his lap with a satisfying splat. You cuddle and hug him, stating how much you love him as you slowly see his guard drop while you feel a little more push from your bottom. \" A got a little something extra for you,\" you sexily whisper as you grunt in effort to let out a fart which vibrates across his jeans. That did it, he quickly hugs you stating how much he loves you and your messes as you feel a jet of sticky liquid on your poopy butt. Man, you really put him over, he dosen't seem to be stoping. You decide to add to the pleasure as you sexily drop a deuce into your bulging panties followed but I nice long pee to hide his spot. He's still going, you decide you want in on this mess and quickly unzip his jeans, grab his penis and shove it into the back of your stinky undies. This new development sends your boyfriend into overdrive as he continues to pump out his juice into your mess. A half an hour later, your both spent but finally ready to go to the mall, messy pants and all.</span></div></div>",
            "created":1283922000,
            "id":952848,
            "title":"Crackatoa"
        },
        "121322":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "I worked hard, I deserve my poop",
                "Whatever, I'll clean it up later"
            ],
            "content":"<div class=\"\"><div> <span>Amazing you've never tried this position but always wanted to and today is that day. Your belt helps no poop escape as your prepare, because your a skunk your great at doing handstands without losing balance. As you get your legs up you feel your poop shift down and your tail tickles the back of your head. You ready and steady yourself and decide to start with a big one. Straining to fight gravity you release a series of wet farts as well as a torrent of pee drenching your panties and dribbling down to the floor. You've almost got it out, straining to push the almost torpedo sized poop but oops you push too hard and send it flying to the ground. Your butt now unplugged it unleashes a ton of soft poo into your belted panties, sagging down with gravity touching the almost bottem of your tail. You may have gotten enough poo to leave your room but you really wanted to enjoy that big one. Do you leave it be or pick it up and put it into the mess.</span></div></div>",
            "created":1281934800,
            "id":937493,
            "title":"Blood ain't the only thing rushing towards my head"
        },
        "1213221":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "And by enjoy you mean poop like crazy, right?"
            ],
            "content":"<div class=\"\"><div> <span>You unfasten your belt momentarily and drop the poop, its pretty large and you congratulate yourself over it but your really hot and sweaty from all that work so you decide to take a bath. You walk over to the bathroom connected to your room and start undressing but not before admiring your load in the mirror striking poses and giving it a good whack. You wish your butt could be that big normally. Taking special care to not upset the contents, you set down your poop filled panties and start running a bath. You know you only need cold water because you have ways of warming it up. You gingerly step into the cold bath water and before sitting down unleash a torrent of warm piss into the freezing bath water. You continue peeing as you lower yourself into the water until your sitting. The water is warm but is only about up to your boobs. This is a big bath tub and you like the water to be at least up to your neck but you have your ways. While the water level might not be high enough yet you grab your bath pillow and lay back, still peeing the entire time, the water level slowly rising. Now your relaxingly lying down and ready to enjoy your bath. </span></div></div>",
            "created":1282107600,
            "id":938898,
            "title":"Rub a Dub Dub just Peeing in the Tub"
        },
        "12132211":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Damn all torpedos, Dump Dump!!",
                "See what your mom is up to"
            ],
            "content":"<div class=\"\"><div> <span>What of course not, maybe a little at the end but all you do for know is a little farting but well get to that later. This reminds of the time when you were little and tried to fill this entire bathtub with poop and you succeed. You were up there all morning with your friend Jenny the cow just dropping as many bombs as your little bladder could push out. You also remember that both of you were naked for it, remember you're animals its not wrong, and that Jenny had really bad diarrhea that day. Any time she finally settled down it would flair up again with a wet and juicy fart starting a torrent of feces out of her butt as she moo'd with pleasure. It was so funny and you were so proud when you actually finished, now a days its really easy for you but back then you could only go so much. Your mom was also very proud, you remember that specifically because she was wearing a really messy diaper that day which was odd because normally she walked around the house naked and took a dump anytime the urge hit but clearly she was in a different mood that day. You remember here walking up to you and saying how proud she was then turning around, sticking her diapered butt into your face and without any sort of movemnet dropped two <i>MASSIVE</i> logs into the clean diaper. Then with a mighty, !PPFFFFTTT! let out a huge stinking fart right into your nose. You love your mothers scent, it smells like fresh cookies to you. Ahh that brings back memories but today is today and now that your thinking about it maybe you do want to fill this bathtub with poop. That or finally head downstairs to talk with your mom.</span></div></div>",
            "created":1282194000,
            "id":939631,
            "title":"Good Times"
        },
        "121322111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Put your panties back on and head downstairs",
                "Remember times with your mother"
            ],
            "content":"<div class=\"\"><div> <span>Ahh screw it, your rip roaring ready to go as you quickly stand up and grip the side of the tub. Pushing with all your might, log after log comes quickly out of your powerful butt, hitting the water with a *KERSPLUSH*. Gripping hard, you push even harder sending out a jet of soft poo which smacks the water and turns it to a nice muddy brown. You take a second to breath a deep breath in, admiring your stench before reading your self for the final, bathtub clearing turd. Breathing slowly in and out and relaxing your muscles you bend over, kneeling in the shitty bath water before taking one last deep breath and then you push with every muscle in your being. Your ass stretches to absurd size as the tip of a poop the size of a barrel starts poking out. It slowly snakes its way out before hitting the water with a splash as you continue to push with a your being. In pure ecstasy, you finishing pushing out the giganto-load as it displaces all the current water. To enjoy your achievement you slowly lower yourself into your now warm and mushy bath taking in your sent as you settle. Your mom tells you that your scent to her is of lilac or of other beautiful flowers and you always want to smell good. Finally climbing out of your wonderfully smelly bath, you dry off your fur. Now what are you gonna do?</span></div></div>",
            "created":1283317200,
            "id":948588,
            "title":"*KEEERRRSSSPPLLLASSHH!!!!!*"
        },
        "1213221112":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "content":"<div class=\"\"><div> <span>\"I remember when you were a bay,\" she reminisces,\" still just as stinky then as now just much less control.\" She continues,\" Why I recall one morning when I went to check on you in your crib and I found you happily giggling inside your voluminous messy diaper, farting and stinking up the place so much you had a green cloud around you.\" \"The bad babysitter I had hired sat in disgust in the corner remarking about the horrid smell while I took a deep breath in enjoying your aroma before pushing out a log into my work pants. I then wrapped my fluffy tail around the evil sitters head, pushing her facing into my all to eager rear before giving her a skunking she did not soon forget.\" <br>\r\n<br>\r\n</span></div></div>",
            "created":1324875600,
            "id":1246559,
            "title":"Baby Boom"
        },
        "121322112":{
            "author_id":"girlfartlover",
            "author_name":"whocares",
            "choices":[
                "Stay and enjoy each other's scents",
                "Go fill the basement with your mom"
            ],
            "content":"<div class=\"\"><div> <span>You get out of the bathtub and head downstairs to see your mom.She's in the kitchen cooking breakfast.\"Good morning,mom\" you say to her.\"Morning,sweetie\"she says,letting out a massive fart in the process.You stand there,breathing in the wonderful scent.Your mother just smiles and says \"after breakfast,we could go fill the basement with our mess,or just stay here and enjoy each other's scents.</span></div></div>",
            "created":1313211600,
            "id":1167518,
            "title":"Mother's Scent"
        },
        "122":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "You call a truce (for now) and decide to have some fun",
                "THIS MEANS WAR!!!!!",
                "IDEAAAA!!!!"
            ],
            "content":"<div class=\"\"><div> <span>Fading back into vague consciousness, you hear something rustle. You slowly open an eye to, OH NO! All you can see is black! Your panic is broken when you hear someone shout,\" Toot toot motherfucker!\" <span class=\"clgreen\">*<i>pfffffrrrrrtttttt</i>*</span> An intense stench fills your nostrils shocking you awake. Wait a minute, you know whats happening, your somewhat younger sister has gotten into your room and totally just tooted her 'horn' all up in your face. As she laughs in triumph, pumping out more farts, you quick grab her and pull her head under the sheets. You then proceed to dutch oven the heck out of her. <span class=\"cgreen\"><i>*PPPPFFFRRRTTTT*</i></span> <span class=\"clgreen\">*<i>FFFFFFFSSSRRRRTTTT</i>*</span> <span class=\"ckhaki\">* <i>PPPFFFFFFFFFFFFTTTTT</i>*</span> Man, you could curl paint with this concentration of gas. Your sister is flipping out as you hold her under the covers being disgusted and half enjoying it as you continue to \" turn up the heat\". \" This, little sister,\" you declare,\" is why you never sneak up on me!\" She's clearly had enough when she breaks free of your grip, hops up on the bed, and lowers her shapely rear to your face. \" Don't underestimate me.\" she giggles before totally unleashing into her waiting sweats. You react in mock horror as the bulging workout pants make their way towards your face. \" Why this is getting a little steamy in here.\" you quip. Between pushing your sister shouts,\" nnghh, this is for the time you got me in the shower,\" <span class=\"cbrown\">*<i>SSPLLLOOORRTCCHHH</i>*</span> ,\" gghhaa,\" <span class=\"cgreen\">*<i>FFRRRTTT</i>*</span> ,\" and this is for,\"<span class=\"clgreen\"> *<i>PPPPRT</i>*</span>,\" that oven stunt.\" <span class=\"cbrown\">*<i>FFFFFLLLLOOOOOFFFFLLLLPPP</i>*</span> You bury your muzzle into the mess, now enjoying your sister's particular scent before pushing her off you</span></div></div>",
            "created":1316926800,
            "id":1194993,
            "title":"Surprise!"
        },
        "1221":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "A quick jaunt into the shower should get him",
                "A steamy bath should break him"
            ],
            "content":"<div class=\"\"><div> <span>\"Enough of this,\" you shout,\" we've got bigger fish to totally take a dump on.\" Your sister ceases as you remind her that you have a evil henchman of your evil neighbor tied up in the bathroom. He's got some important information about your neighbor's plans and you gotta flush it out of him. ( See what I did there, \"flush\" oh whatever) You both waltz into the bathroom. As your sister strips her stinky sweats, you starting grilling the henchman for info. (disclaimer, this dude is one bad dude in all the worst possible ways, any and all punishment he receives is punishment he's had coming for him for years, that is all) \" Sooooooooo, feeling loose lipped yet?\" you question. \" I won't cough up anything to the likes of you kids, bah,\" the henchman sneers. \"Oh you'll be coughing up something all right!\" you declare. During this, your sister has situated her plump buttocks on to the toilet. You quickly take your place on her lap while shouting,\" let the fun begin!\" <span class=\"cgreen\">*<i>PPPPPPFFFFFFFRRRRTTTTT</i>*</span> <span class=\"cbrown\">*<i>SSSSSSPPPLLLOOOOORRRCCCHHHHH</i>*</span> Your sister starts to unload her bowels as you aerate the room with your gaseous odors. \" nnngghhh <span class=\"cbrown\">*<i>FFFllllOOORRRPPP</i>*</span>, oh sis\", your sister says between grunts,\" this is getting really hot, nnngggggaaahhhh <span class=\"ckhaki\">*<i>FFFFRRRRRTTTAAAAPPP</i>*</span> <span class=\"cbrown\">*<i>KERPLUNK</i>*</span>, like literally.\" You laugh at your sister before *rrrrmmmmbbbllleee* OH SHIT! \" Quick, sis, split your legs!\" you shout before adding your own stream of shit to the pile of poop. Breathing in deeply through her nose your sister quips,\" whew it's getting thick in her, you might wanna nnnnnghhhhhhaaa <span class=\"ckhaki\">*<i>FFRRTTT</i>*</span> <span class=\"cbrown\">*<i>PLOP</i>*</span> <span class=\"ckhaki\">*<i>FFLLRPPPT</i>*</span> <span class=\"cbrown\">*<i>PLOP</i>*</span> open a window before we knock this dude out completely.\" You stop shitting for a second to crack the window behind you. Through this small opening, a small army of flies invade the space, eager to reach the stinking gold beneath you butts. \" I gaahhhhh hate flies, they are sooo gggnnnnnnhhh annoying,\" your sister states. You know just how to solve this problem. You lean back a little, hugging your sister for support, and release a single, rancid fart. <span class=\"chunter\">*<i>FFFFFFFFFFFFFFFFFRRRRRRRRRRRRRRRRRRRRTTTTTTTTTTTTTTTTTTTTTT</i>*{/ c} But this isn't just any old fart, you've mixed some skunk juice into to this one. \" Gahhhhhhhhhh,\" you exclaim in pleasure as the flies practically disintegrate before your eyes. \" Oh I am so getting you back for that later sis,\" your sister cockily shouts. Your hostage looks like he's starting to crack but you need to do something else to finally break him.</span></span></div></div>",
            "created":1317099600,
            "id":1196517,
            "title":"Shrine of the Shitting Skunkies"
        },
        "1223":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Unleash fart hell",
                "Drop a load and see if he notices"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">You and your sister decide to fart troll the nearby evil office cooperation. This is a horrible, evil business so messing with them makes the world a better place. As you have done before, you and your sister don suits to \"blend in\" and make your way over to the place. First stop the elevator, the best place to troll as hot boxing business men never gets old. Looking official, you push the button to call the lift, silently holding in your raging gas until it finally arrives. This is a very tall office building, and your going to enjoy every stinking floor up! Stepping inside, you and your sister put on shades and walk to the corners of the elevator, trying to remain inconspicuous and separated. The first mook enters the box and pushes the 50th floor button, Perfect! As the doors close you glance over at your sister giving a knowing nod. She gets the signal and with a slight wave of her tail drops a small squeaker of a fart <span class=\"cbgreen\">*FFFRRRTT*</span> . The mook, trying to be polite, dosen't say anything but you can tell he's noticed. You respond with a little Silent But Deadly as the man's countenance changes ever so slightly. 10th floor as you sister releases a longer but still average sized stinker, her tail wiggling as it does. <span class=\"cbgreen\">*FFFFRRRRRPPPPRRRTTTT*</span> Still trying to play like your supposed to be there, neither of you says anything but you take a quick breath in like someone with a stuffy nose would and breath in the fresh aroma. Your sister's been working on her scent as you enjoy every contour of the stench emanating from her backside. Behind the mook's back, she sexily slides down her glasses and winks at you, the signal to let the fun begin.</span></span></div></div>",
            "created":1324443600,
            "id":1243701,
            "title":"Business Time"
        },
        "13":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "The kind that loves your various smells and functions",
                "Ones who don't but they look kinda shaddy and evil",
                "Ones who don't but they seem nice"
            ],
            "content":"<div class=\"\"><div> <span>Your not sure what that was about. Your totally not a skunk girl and your certainly not asleep. You are actually an anthropomorphic horse named Carol, a friend of the skunk girl, and are currently chained up to your carriage. You run a carriage pulling company that transports people around your local park. It's early in the morning so not many people are out yet but you like to have a healthy early start. All you're gear is ready, your cart is polished, your ropes set, and your horse scat catcher firmly in place. You need that one because while you love pooping everywhere, you couldn't stand sullying the paths of this lovely park. Striking a strong pose, you let out a mighty fart before dropping a log into your catcher to make sure it works. In relation to your job, some people enjoy your particular aromas while others find them highly disgusting, you always have to make sure before you leave. Can't go around grossing out customers. Speaking of which your first one seems to be walking towards you, it seems to be a young couple. They walk up and great you but what kind of customer are they?</span></div></div>",
            "created":1312866000,
            "id":1164759,
            "title":"Fresh Start"
        },
        "131":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "her",
                "her costumer"
            ],
            "content":"<div class=\"\"><div> <span>the male of the couple say goodbye for both and go away, the female that remains sees the scat cacher and hop up in the cart, \"what a lovely smell, my honey would have loved\" Carol blushes as they beggin the ride, not 5 minuts latter she starts smelling something foul in the air, it was...</span></div></div>",
            "created":1500267600,
            "id":2355279,
            "title":"a walk (or ride) through the park"
        },
        "1312":{
            "choices":[
                "Carol takes that as a challenge (Contest)",
                "Carol recognizes the passenger",
                "The passenger has to poop"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cyellow\">*FFFFFFRRRRRRRRRRPPPT*</span> \"Pardon me\" the woman says smirking \"I had a heavy breakfast\". Carol inhaled her passenger's emission, which had a distinctly eggy odor, and smiled. \"No problem, feel free to fart as you please* She says flexing her butt. \"That's what I do\" <span class=\"cbrown\">*PLLLLRRRROOOORRROORRRPPPT*</span> A muddy stream of liquid scat pours out of her butt as she farts, with her passenger watching intently and Carol sighing with relief \"And that too\". At that, both girls break out into laughter \"Hahaha! That's good\" She says lifting a leg <span class=\"cyellow\">*Prrrrrrrrrrrrrrrrrrrrrrrrrrppppptt*</span> \"Cause I'm not stopping anytime soon!\"</span></div></div>",
            "created":1553555100,
            "id":2634826,
            "title":"Stink Sister"
        },
        "13122":{
            "choices":[
                "Her friend",
                "Her teacher"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Wait, I know that voice\" Carol says before sniffing the air \"And that stench\" she turns towards her passenger and sees...</span></div></span></div>",
            "created":1553558400,
            "id":2634849,
            "title":"Carol recognizes the passenger"
        },
        "131221":{
            "choices":[
                "Ellie the Skunkette",
                "Jenny the Cow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Looking back at her was her friend...</span></div></span></div>",
            "created":1553559180,
            "id":2634856,
            "title":"Her friend"
        },
        "1312211":{
            "choices":[
                "They go find Ellie's Boyfriend ",
                "They continue riding"
            ],
            "content":"<div class=\"\"><div> <span>Her friend Ellie smiled back at her, with her butt stuck out and tail lifted \"Good to see you, Carol\" she says pointing her deadly booty right in Carol's face <span class=\"cyellow\">*MMMBBRRRRRROOOOOOORRRRRRRPT*</span>. Carol's hair was blown back by the sulfuric blast as the hot, dry gas stung her eyes and nostrils \"Good to SMELL you, Ellie\" she says exaggeratedly wafting her face \"You never miss a cheap shot do you?\". The two giggled before Carol spoke again \"What brings to the park today?\" She asked, \"My boyfriend and I were taking a romantic walk through the park as part of our date\" Ellie says stroking her tail \"I was shaking my ass and farting in front of him the whole way\". \"Ellie, you tease!\" Carol says playfully slapping her friend's butt. \"You should have seen his boner, I swear his dick was about to pierce through his pants\" Ellie says rubbing her rear \"He had to go to the restroom to calm down, if he had gotten in with me there's no way he could've kept it in his pants\" She says inhaling their foul air \"Both of our stinky sexy butts would've been too much for him, he'd have to whip it out and jack off\". Carol giggled at the idea \"I wouldn't have minded at all\" she says wiggling her large behind <span class=\"cbrown\">*SSSPPPPRRRRRRRRRRRPPPTT*</span> \"I might have even been willing to help him\"</span></div></div>",
            "created":1553561940,
            "id":2634882,
            "title":"Ellie the Skunkette"
        },
        "133":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "My butt is a steel fortres through which nothing will escape",
                "Poop time NOW!"
            ],
            "content":"<div class=\"\"><div> <span>They seem nice to you. The women remarks about a particular smell in the air so you know to keep for bodily functions to a minimum. They point out their destination on the map and you begin pulling. You enjoy wagon pulling, helps keep your already stunning, muscled figure and it gets you outside for some nice fresh air. Well maybe in your case sometimes not so fresh but you get the point. The ride is going along nicely when suddenly your stomach gurgles loudly. You can tell there is something brewing down there but you couldn't stink out these nice people before their ride is over? So what do you do? Hold it in and hope you don't explode before dropping them off or run off to the nearest bathroom?</span></div></div>",
            "created":1313125200,
            "id":1167143,
            "title":"The Grand Descision"
        },
        "1331":{
            "choices":[
                "Hold it in and go see what the man wants",
                "Don't hold it in and go see what the man wants",
                "Let it all out now I'm tired of waiting!"
            ],
            "content":"<div class=\"\"><div> <span>You decide to hold it in. You're not particularly fond in doing so but you can't drive away nice customers and their destination wasn't too far to stop for. It almost felt like forever as you made your run but luckily, you were able to bring the couple to their desired destination without a problem. Waving your goodbyes to them, they had told you that they'd likely come again. Looks like this was a job well done! Your stomach gurgled most of the way there and now you had to go more than ever. You relaxed your muscles to let out a loud fart. That fart was cut off as a huge log of scat pressed against your tailhole. Looks like you could do what you've been wanting to do now. But it looks like someone is trying to catch your attention by waving their hands at you down the path. <br>\r\nDo you let it all out now or go see what the possible customer wants?</span></div></div>",
            "created":1381467600,
            "id":1677606,
            "title":"My butt is a steel fortres through which nothin..."
        },
        "1332":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Hit the deck!"
            ],
            "content":"<div class=\"\"><div> <span>Clearly you can't wait another minute. You quickly apologize to the people, telling them that there ride is over but this one is on the house. Hurriedly, you push your cart off to the side and make your way to the nearest porta-potty. \" Man, I really hope no one has to use this thing after me, especially after the last time.\" you think to yourself. You are of course referring to last time when you did your business in the porta potty and the cleaning crew had to wear haz-mat suits just to not get knocked out by the smell. Your not really sure what the problem was as your stink smells like morning, dew covered grass to you but whatever. Quickly stripping your diaper sling and your clothes ( it tends to get a little messy in these close quarters) you slam the door shut on the potty and lock it. This is gonna take a while so you settle in a brace yourself for the exsplosion. </span></div></div>",
            "created":1313470800,
            "id":1169733,
            "title":"Porta-Potty Time"
        },
        "14":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Great her in normal cow fashion",
                "Turn and run using a fart smoke screen to escape",
                "Continue your business"
            ],
            "content":"<div class=\"\"><div> <span>Now hold a dang moment! Your no skunk girl, your a quiet literal cow girl working down on the farm. The tomboy friend of the skunk girl, your name is Jenny. Right now your out in the fields fertilizing the new crops the only way you know how. Lazily walking along, you deposit your particular brand of manure to all the waiting crops to give them proper nutrients. Ohhh, your stomach gurgles as you crouch down. *PLLLPLTTHLPRPLTHPPPFFF* \"Where did that come from\" you playfully remark as stream of diarrhea shoots out of your voluptuous rear. This gos on for another minute. Finally standing up, you survey your work. \" Now that is a cow pie\" you state proudly before bursting into laughter. Another cow friend of yours is walking towards you to see where all this sound is coming from. You've got quiet a nosily butt on you. Well she's walking towards you, now what?</span></div></div>",
            "created":1312866000,
            "id":1164764,
            "title":"Farm Life"
        },
        "141":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "continue talking",
                "go back to work"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the other cow approaches aand you rips a good old one right into her face \"hi\" you say, you turn to her and gets greet by one of her own \"hello\"</span></div></span></div>",
            "created":1500267600,
            "id":2355282,
            "title":"stink greetings"
        },
        "15":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Have fun",
                "Rando 1",
                "Rando 2",
                "Rando 3",
                "Rando 4"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are a raccoon herm standing in line for the bathroom and you really have to pee.</span></div></span></div>",
            "created":1313038800,
            "id":1166313,
            "title":"A Herm ( See what I did there)"
        },
        "151":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "content":"<div class=\"\"><div> <span>Wait a minute, you remember you have a balloon with you, you could pee in that. Throwing all sorts of decency to the wind, you pull out your massive dong in the middle of the crowded mall and start to go about equipping the balloon. It fits snugly, well not for long, as you put it back into your pants and let loose. Normally a balloon of this type would not expand for liquids but you're peeing so hard it quickly \"inflates\", creating quiet a large bulge in your front. This also creates quiet a stir in the mall denizens around you as they react with shock and disgust. Not that it matters to you as you finally relax after holding so much.</span></div></div>",
            "created":1336366800,
            "id":1331381,
            "title":"Hot Wet Balloon"
        },
        "152":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The couple moved into the woman's large, walk-in shower, ready to be washed clean from a long sweaty night of love making. \"That was fantastic honey, I think I'm going to be feeling it tomorrow,\" Tim said to the woman, comically rubbing his back. \"Oh, because you did all the heavy lifting?\" Breeze playfully returned. The hot water cascaded down greatly relaxing the two. \"Ugh\" Tim said gripping his stomach,\"I think my stomachs a little upset from.\" He was cut off by a loud *PFFFFRRTT*. The smell of the fart hung heavily in the small chamber. Tim turned beet-red with embarrassment while Breeze laughed, playfully fanning the air. \"Oh I'm so sorry,\" Tim apologized. \"Oh it's nothing,\" Breeze calmly returned,\"my stomach is actually a little grumbly after all that work-out if you don't mind.\" Tim nodded, whatever she had couldn't be as bad as his normal gas. Breeze lifted her leg slightly and unleashed a number of toots. *Pffrrtt* *pffrprprprt* *rrpfrpt* Breeze grinned with wonderful relief,\"I've always been a gassy girl, I hope you're ready for it.\" \"Ready for it?\"Tim questioned,\"mind if I join in?\" Breeze nodded in the affirmative and the two embraced over their new-found connection, releasing bombs all the while turning the tiny shower into a deadly gas chamber. \"ahhh, so relieving,\" Tim exhaled,\" mind if I?\" Tim pointed at his dick. \"We're in the shower, go right ahead,\" Breeze said, already starting to pee. Their twin streams of yellow, noticeable even in the downpour of the shower head, rained onto the tile. \"It's just so nice to know someone who you can just relax with and let it all go without any worries, ya know?\", Tim questioned. \"I hear ya,\" Breeze replied before continuing,\"wow you really had to go! I'm surprised you kept all that in during sex.\" Tim had continued peeing, seemingly unaware of the constant stream. \"Oh, oops sorry, I'll stop.\" \"No no, don't stop, here let me do something quick,\" Breeze said before placing a cap over the drain. They both began peeing again, sighing from the release as yellowed water built up around their feet. Breeze sat down in the now bathtub below. \"Here, check this out,\" she said unleashing a *FFLFLFRPR* as a flow of bubbles jetted up from her butt.</span></div></div>",
            "created":1436590800,
            "id":2006505,
            "title":"Couples Shower Time"
        },
        "1521":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "let she have her fun",
                "join to her",
                "better choice?"
            ],
            "content":"<div class=\"\"><div> <span>The flow continued for sometime until suddenly stops, Tim was going to question what happened but then he saw her face, she looks like pushing something then he looked down and saw the shower soon becoming a toilet. \"what is happening?\" he asked with a worry looking in his face, \"What, i had to go and you don't want some 'messy fun' ?\" She sad while some diarrhea jets are giving some color to the water, he didn't know what to do</span></div></div>",
            "created":1467003600,
            "id":2171798,
            "title":"dirtying up"
        },
        "153":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Dinner is ready",
                "Mom comes back",
                "Timmy's stomach grumbles"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">He sat in the tub, splashing around while his mother was off readying dinner. While pushing around his toy boat his stomach gurgled signaling his favorite part about bath-time. Little Timmy happily tooted sending a stream of bubbles to the surface. *Frrrtpt* *Frprrpt* *pffrrprt* He created his own little jacuzzi, tiny green bubbles floated up from the surface. Then the gas sadly stopped. He knew what this step meant as he grunted with exertion. Up to the surface came not a bubble, but a log, and quite a sizable one for someone of his age. He saw it, unfazed, as it floated around him like a small moon. After it bumped into his toy boat, Timmy went back to farting, occasionally releasing another turd. Once five logs circled the tub, Timmy's bladder opened up as he mindlessly peed in the bathtub water for almost two minutes. The smell in the bathroom was becoming noticeable as the water level rose and yellowed. One of the reasons Timmy loved bath time so much was his freedom to pee, poop, and fart as much as he wanted without fear of causing problems. The toilet usually overflowed or couldn't flush, and his diapers, while a little better, usually ripped open from the sheer weight of his messes. The bathtub was like one giant toilet that could contain all his output until he was mostly empty. The only time he could remember fully emptying was when his mom got him a small, inflatable pool which he adored. Timmy continued making bubbles with smaller, rabbit pellet like poops shooting up with the gas. He took to floating the logs around in front of him like a large harbor. Notified by the growing smell, Timmy's mother walked in. \"Timmy,\" she shouted in shock,\"what a mess you've made.\" This was said not with the air of alarm but surprise as Timmy's mom moved closer to the tub. Living just the two of them, Timmy's mom walked around bottomless with no pants or underwear on, her apron covered her upper body. \"Wish I could join you but someone has to get dinner ready,\" she said playfully. \"But I do have something for you,\" she continued. Timmy clapped in excited as his mother stood up on the edges of the tub, bent over, and grunted with exertion. A loud fart heralded a heavy log which splashed into the messy water below. While all of Timmy's turds floated on the top, this one sank straight to the bottom. \"Ah dense as always, she breathed out a sigh of relief,\" well, back to dinner.\" She left the room as Timmy returned to farting in the tub. At this point the water was somewhat yellowed and full of logs.</span></span></div></div>",
            "created":1430888400,
            "id":1974655,
            "title":"Messy Tub Time"
        },
        "1531":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Baked Beans",
                "Ice Cream",
                "Salads"
            ],
            "content":"<div class=\"\"><div> <span>Timmy played around in the tub for a few more minutes before his mom returned saying that dinner was ready. \"We can get you back to your bath time fun after dinner little stinker,\" she said lifting Timmy out of the bath. While okay with the messes, Timmy's mom rarely moved him without a bottom on for fear that he would poop on the ground, but he had gotten most of that out in the bath... hopefully. As she carried him between rooms, Timmy began to squirm signaling an immediate need to relieve himself. Timmy's mother Lizzy smiled to herself in exasperation knowing what would come next. Lizzy lifted Timmy up more, over her shoulder. With a wet fart, Timmy sharted out a splattering of poop onto Lizzy's sizable boobs. \"Awww, hehe, looks like I'm going to have to join you in that bath after dinner now and wash this off.\" The two laughed as they got to the kitchen. Timmy was placed into his special highchair which had an opening around the butt and a large bucket underneath. What's for dinner?</span></div></div>",
            "created":1482037200,
            "id":2251796,
            "title":"Dining Room Dash"
        },
        "15311":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "join him",
                "wait"
            ],
            "content":"<div class=\"\"><div> <span>Lizzys brings to the table two plates with baked beans, one for her and other for Timmy, she takes a seat and start feeding both of them, as Timmy eats he releases nasty and loud farts witch were amplified by the bucked, the kitchen starts getting smelly by the time, as Timmy have fun releasing his almost toxic bombs, Lizzy starts feeling a realy big gas build up, what should she do?</span></div></div>",
            "created":1482382800,
            "id":2253306,
            "title":"gassy symphony"
        },
        "153111":{
            "choices":[
                "Return to the bath",
                "Continue their contest in the bedroom"
            ],
            "content":"<div class=\"\"><div> <span>     \"Ohh Timmy, I have a suprise for you\" Lizzy said with a mischievous smirk on her face. Timmy perked up when heard this. \"Okay now just close your eyes\" she said, Timmy complied with his mother's orders. Timmy heard some shuffling in the background as he waited eagerly. \"Okay, you can open your eyes now\" Timmy opened his eyes excitedly was greeted by the sight of his mother's round, filthy butt cheeks pointed directly at him. *PPFFFFFRRRRRRRPPPPP* Lizzy unleashed an enormous and devastatingly smelly fart in her son's face. <br>\r\n<br>\r\n     She lied back on the table and laughed whilst rubbing her stomach, \"There's <i>way</i> more of that in here\". Timmy first remained in shock but then began to frown at his mother and tried to position his butt towards her. \"Whats wrong Tim? You wanna give me a taste of your own gas after I released that monster all over your face?\" She inquired \"well then...\" she got Timmy out of the high chair and on to the table with her \"I'm more than happy to oblige\" she said as she faced Timmy's butt towards her face.<br>\r\n<br>\r\n     Timmy responded by pushing out a nasty fart *Pppffrrrrrpt*. Lizzy quickly sniffed up her son's gas \"Whew, you have some rancid guts, but...\" . She once again pushed Timmy's face into her ass *FFFFRRRPPPTTT* \"Aah, never forget it was ME you got them from!\" She declared proudly. Timmy gagged briefly then moved towards his bowl and started shoveling beans into his mouth with his hands while shooting his mother a determined glare. \"Why did you also have to inherit my bad manners?\" Lizzy giggled \"Oh well\" she said shrugging her shoulders as she picked up her own bowl and did the same, both of them occasionally stopping to fart in the others face.<br>\r\n<br>\r\nAfter they're done eating do they?</span></div></div>",
            "created":1486098000,
            "id":2272968,
            "title":"Fart Contest"
        },
        "1531111":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "use the bathtube",
                "go somewhere besides the bathtube"
            ],
            "content":"<div class=\"\"><div> <span>She picks up her son and put back on the bathtube, witch soon starts bubbling heavily, she giggles happly at her son and decides join him, the buubles got way bigger when she entered until she realised, something else was about to come out, and the bathtube only holds her sons mess, what would she do?</span></div></div>",
            "created":1487653200,
            "id":2280373,
            "title":"naval battle"
        },
        "1531112":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "let it rip",
                "hold and thing on something"
            ],
            "content":"<div class=\"\"><div> <span>Lizzy grabs Timmy and giver her run to her bedroom, she closes the dorr releasing a deadly fart onto Timmy's face, they start they gas off as the room becomes more and more smelly, Lizzy was about to release a great bomb, but sundenly feel something elso coming along, what should she do?</span></div></div>",
            "created":1487653200,
            "id":2280370,
            "title":"ingasse"
        },
        "15311121":{
            "choices":[
                "Run wild through the house and make a mess",
                "Sleepover"
            ],
            "content":"<div class=\"\"><div> <span>     Lizzy ripped a massive fart into her son's face that turned into shart  *PFFFFFRRRPPPPPRRRRRRSSSSSSSTTTT*, the boy was blasted with combination of his mother's toxic gas and liquid waste. A turd began praire-dogging in Lizzy's ass. \"Here comes the main course\" she said grunting. Before pushing, she rolled onto her back and laid down flat, before raising her legs up and pushing. The massive log exited her asshole little by little, until the other end of the loaf came out of her ass, followed by a smelly trumpet blast heralding it's arrival.<br>\r\n<br>\r\n     Lizzy looked to her side and saw Timmy, with brown streaks on his face and shirt. \"Looks you like could use a wash\" she then looked over and took a peek at her dirty ass \"Both of us actually\" \"buuuut, it's not like we're going out or have any plans that require us to be clean\" Lizzy said giddily, Lizzy may seem to act mature and motherly, but she's actually just as much of child, if not more than, her son. \"Plus, I heard dung is good for the skin\" she said as she moved over to her turd and smushed it into her back. \"Cleanliness is overrated anyway\" <br>\r\n<br>\r\n     Timmy started pushing a turd of his own, he pushed so hard he ended up peeing onto his mother by accident. \"Oh, was that a challenge?\" Lizzy said smirking. Lizzy then shot a stream of piss onto Timmy laughing throughout it. \"Let's see, what other fun could we have?\"</span></div></div>",
            "created":1488171600,
            "id":2282973,
            "title":"No Restraint"
        },
        "153111211":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "continue messing IN the house",
                "mess OUTSIDE the house"
            ],
            "content":"<div class=\"\"><div> <span>a powerful blast exited Lizzy's but going all around the house and killing any small creatures or plants, her anus seemed like an toxic air machine liked to an infinit flatulence void, his son starts releasing a big strem resembeling and adlt one, they both go to the kitvhen there and giant log start leaving both of them like snakes tails</span></div></div>",
            "created":1499058000,
            "id":2346743,
            "title":"Run wild through the house and make a mess"
        },
        "153111212":{
            "choices":[
                "\"My bed!\"",
                "\"Your crib!\""
            ],
            "content":"<div class=\"\"><div> <span>Lizzy looked up at the clock  \"it's getting late, don't you think, how about we sleep together tonight\" she said to her son. Timmy expressed glee at this idea. \"Great, now your bed or mine?\" Lizzy looked at the her bed and Timmy's crib<br>\r\n<br>\r\nTimmy's crib was quite large, not as big as her bed but still big enough for the two of them. If they slept there however they would have to wear diapers as the crib wouldn't be able to contain all their waste. Spare diapers were fortunately within arms reach.<br>\r\n<br>\r\nHer bed was big enough to accommodate them and their messes so they could go bare ass. It had white sheets that would be stained very easily. <br>\r\n<br>\r\n\"How about...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1491195600,
            "id":2299203,
            "title":"Sleepover"
        },
        "15312":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "go...somewhere in the kitchen",
                "hold in"
            ],
            "content":"<div class=\"\"><div> <span>Lizzy put two bows of ice cream on the table, after she sits, she starts feeding herself and Timmy, after some time, Timmy starts felling a pressure on his lower half, as it went a lound sound of water hitting a surface appeared by Timmy empitings his bladder, soon the kitchen was filled with a ammonia smell, Lizzy son notice the her piss  was hitting the end of her pussy long a ocean on a storm, what should she do? </span></div></div>",
            "created":1482382800,
            "id":2253370,
            "title":"yellow snow"
        },
        "15313":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "go...somewhere in the kitchen",
                "hold"
            ],
            "content":"<div class=\"\"><div> <span>Lizzy put two plates of salad on the table, and after she sits she start feeding both of them, after some time Timmy felt his body fully filling up and soon, the kitchen starts gathering a lingering smell from everything that Timmy is giving in his bucket, Lizzy soon notice her butt getting a lot bigger, but she realize that the only thing keeping her mess inside is her booty, thats why the size, what should she do?</span></div></div>",
            "created":1482382800,
            "id":2253375,
            "title":"Nature call"
        },
        "153131":{
            "choices":[
                "Diaper up",
                "Continue bare ass"
            ],
            "content":"<div class=\"\"><div> <span>     Lizzy got of her chair and attempted to make a run to the bathroom, but unfortunately the combination of pain and rushing caused her to fall and release her mess. <br>\r\n     She fell back onto her button and felt something squish beneath her. She got up and a huge turd smeared into the floor with her ass and lower back stained.  \"damn it, I just cleaned the carpet\"  she said.  <br>\r\n<br>\r\n     Tim laughed at his mother's plight while still pooping. Lizzy then noticed Tim's bucket was just about full.  Furthermore she still felt a lot more shit inside her trying to get out. <br>\r\n<br>\r\nWhat does she do now? </span></div></div>",
            "created":1486098000,
            "id":2272936,
            "title":"go...somewhere in the kitchen"
        },
        "1531311":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "\"the right one, they will hold\"",
                "\"the wrong one... dear lord\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she dashes to a drawer and grabs 2 diapers, one for timmy and one for her, she puts they on and when they abot to get started she asked herself \"what diaper did i grabbed?\"</span></div></span></div>",
            "created":1487653200,
            "id":2280374,
            "title":"Diaper up"
        },
        "15313111":{
            "choices":[
                "Change",
                "Sit in their mess"
            ],
            "content":"<div class=\"\"><div> <span>She and Timmy both released their bowels into the diapers, Lizzy managed to grab the ultrastrong variant for herself which was able to hold what she gave it. They finished after a few minutes, Their diapers discolored, though Lizzy knew there would be more for each of them later. Lizzy playfully sniffed the air \"Whew! someone smells stinky!\" she said fanning a hand in front her nose, she then felt Timmy's diaper \"You made a big stinky, you naughty boy\" \"Oh wait..\" she said as she felt her diaper \"Mama made an even bigger stinky, she's way naughtier!\" She said giggling \"I think she deserves a spanking\" she said as she repeatedly and firmly slapped her ass, squishing her poop inside against her skin. \"Oh what I am to do with these 2 naughty babies?\" She said</span></div></div>",
            "created":1490590800,
            "id":2295610,
            "title":"\"the right one, they will hold\""
        },
        "153131112":{
            "choices":[
                "Their diapers reach their limit",
                "Bedtime approaches"
            ],
            "content":"<div class=\"\"><div> <span>\"I think we need to think about what we've done\" she said \"So we're going to keep these on until we've learned our lesson\", she then sat down on her mess smushed it around \"I don't know about you Timmy, but it might be a while until I learn mine, cause I'm really enjoying this\" she said grinning, Timmy was also enjoying the feeling of his mess. Lizzy then stuck her face into her son's diaper a took a deep sniff \"P-ew! You really did a number in that!\" She exclaimed \"Still not as bad as mine though\" she said shifting her ass toward her son \"Wanna whiff?\" She said wiggling her butt, Timmy sniffed around her diaper until he was interrupted by a *PPPRAAARRPP*. <br>\r\n<br>\r\nLizzy laughed \"Sorry, I couldn't help myself\", Timmy then responded with his own foul *Frrrrrrtttttt*. Lizzy then sniffed up his butt blast \"Nice one!\" She said as she lazily lifted a leg a ripped a *PFFRRRAARRLLL* that ended on very wet note \"oops, wasn't expected that to come out\" she said patting her diaper. Timmy then pushed a log into his own diaper with his butt pointed toward Lizzy. \"I'm beginning to think we're a bad influence on each other\"</span></div></div>",
            "created":1490590800,
            "id":2295627,
            "title":"Sit in their mess"
        },
        "1531311122":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "bed",
                "crib"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lizzy looks at a clock and sees how late it is \"well, i dont want any of my babies to pass it bed time, so lets go lay down sweetie\" she picks timmy up and they go to the hallway \"hhh, where we should sleep?\"</span></div></span></div>",
            "created":1499058000,
            "id":2346712,
            "title":"Bedtime approaches"
        },
        "1531312":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "that one time",
                "that other time"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"well the damage has been done, lets ends this\" she says then release some deadly gas, a waterfall of pis and bowling balls logs, her soos mess started getting onto the floor by the overload, she sundelly started to remember...</span></div></span></div>",
            "created":1487653200,
            "id":2280376,
            "title":"Continue bare ass"
        },
        "15313121":{
            "choices":[
                "Continue the rest of the experience",
                "Remember another time"
            ],
            "content":"<div class=\"\"><div> <span>     She remembered the time she and Timmy went camping in the park, it was a large area with campers having some distance from each other. Both of them had gone bare ass, Their waste could only fertilize the plants, maybe even enough to make up for the damage their gas would do. <br>\r\n<br>\r\n     Lizzy stretched in front of their tent as breathed in the crisp Autumn air. \"Nice day to be outdoors, lovely breeze\" \"Though I suppose it could be a bit better..\" she said as she stuck her rump up into the air and lifted heir tail. A loud *PPPHHHHRRRRRRTT* blasted out of her bottom. She brought down her booty and raised her head back up. \"Ooh! nice and spicy with acrid undertones, glad we filled up on Mexican on the way here\" she observed as she sampled her fragrance \"Hwooo... Haaa, absolutely delicious!\". <br>\r\n<br>\r\n     She then heard a *Ppfffrrrppptt* from her left and saw Timmy pushing out his own ripper \"I guess you took my little air freshener as a challenge?\" She said as crouched down to sample his scent \"No bad kid, but you're still a long way from this!\" She turned and pointed her ass at Timmy. *BBBRRRRPBBPRRLLLlll* her farted started to turn into a shart. \"Oh boy, looks I'll have to push a bit more, Hhnng!\" She bore down and released a large turd just inches away from Timmy. \"Ah ha, man it felt good letting that out\" she said as she sat down on the pile \"definitely feels good now\" she said rubbing her butt cheeks and shifting from side to side, mushing it more into her ass. \"Out here we can both poop to our hearts content\" she said with a grin.</span></div></div>",
            "created":1490072400,
            "id":2293132,
            "title":"Camping"
        },
        "153131212":{
            "choices":[
                "Continue the memory",
                "Remember another time"
            ],
            "content":"<div class=\"\"><div> <span>She remembered the time they went out to the movies. It was a kid's movie so there were a lot of other parents with their children, many of who were in diapers. Thus they could both fill theirs discreetly. *Splortch* Timmy happily pushed a turd into his diaper on his Mother's lap, who was enjoying the feeling and smell of her son's mess. \"Nice one\" Lizzy whispered in Timmy's ear before pushing. *BLAARRRRTT* Lizzy filled her own diaper which was becoming quite a comfortable seat. She and her son giggled as quietly as they could. </span></div></div>",
            "created":1494219600,
            "id":2316487,
            "title":"Remember another time"
        },
        "1531312121":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>\"BRRRRRRRT\" that sound emaneted from Timmys behind and start to stink up at some radius, Lizzy giggles and whispers\"not bad, not bad at all, so, i will let you improve tody cause i dont think this cinema will still be working if i release my fumes...or will it?\"</span></div></div>",
            "created":1499058000,
            "id":2346734,
            "title":"Continue the memory"
        },
        "15313121211":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "continue your busines",
                "see they do they busines"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>without hesitation, she starts ripping her nasty gas, until she notices her gas is way more lound than usual, shw looks at both her sides, on her left, a female dog was breaking wind alt, on her right, a fox girl was build a log house on her seat</span></div></span></div>",
            "created":1504933200,
            "id":2382679,
            "title":"cinema aircondicionare"
        },
        "1531312122":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "\"mee\"",
                "\"you, my sweetie\""
            ],
            "content":"<div class=\"\"><div> <span>She remembers that other time that they both went to a farm, the great fields, all those animals and basically one giant toilet, the fist thing they did was ride a horse, when they were getting near one, he accidentally farted into them \"sweetie, i think that mister horsee have challenged us, so, who would answer his calling?\"</span></div></div>",
            "created":1499058000,
            "id":2346736,
            "title":"Remember another time"
        },
        "15313122":{
            "choices":[
                "Continue reminiscing",
                "Snap back to reality"
            ],
            "content":"<div class=\"\"><div> <span>     Both Lizzy and Timmy had caught a stomach bug and were afflicted for a while. Lizzy even let Timmy sleep in her bed during the whole experience. Lizzy knew there was no way their diapers or the toilets could handle the hypermessing they would experience, even the bathtub could only hold so much from both of them. so throughout the entire time they were sick they both went bare ass and messed wherever and whenever the urge hit them. <br>\r\n<br>\r\n     Despite the stomach pains and mess, Lizzy actually ended up enjoying the experience, she even started pissing all over the house just for fun. She and Timmy messed the bed every night, something she enjoyed so much she now sometimes does it intentionally, even using white sheets so the stains standout more. The house was a pig sty, which again Lizzy enjoyed. Lizzy farted, pissed, &amp; pooped with wild abandon alongside her son, the household became a child being supervised by a far more unruly child.<br>\r\n<br>\r\n     Sadly the bug passed and Lizzy had to start being an adult and clean the house again. Though she's always looking for more opportunities to run wild and make a mess of the house again.</span></div></div>",
            "created":1490072400,
            "id":2293144,
            "title":"Stink bug"
        },
        "153131222":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "lets fill it in\"",
                "its time to stop\""
            ],
            "content":"<div class=\"\"><div> <span>a warm feeling on her knees bring her back to reallity as she sees the house starting to become a mud pool \"well, i did hold alot tohse past days, it had to come out one day or another\" by saying that, she points her ass to the nearest room and grunts as a literal shitstorm start to fill the house</span></div></div>",
            "created":1499058000,
            "id":2346718,
            "title":"Snap back to reality"
        },
        "1532":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "stay there ",
                "leave",
                "HERE COME A NEW CHALLENGER"
            ],
            "content":"<div class=\"\"><div> <span>\"You know what\" she said returning to the bathroom, \"i quite need to go *FRRRPRPRPRPRPRPPRPRPRPRPRPRPRPRPPPRPPRPRPRRRPPRPRPRPRPRPRP* a little\" she said taking out her apron, her weight didn't added a lot to the water level but when she started peeing there the tub overflowed, Timmy just giggled release his on fluids when he steeped on something, he putted his head underwater to see what is, then he saw the hole bathtub filling up with poop, from the bottom to the top, his mother only remember be so relieved like this the day she inflate Timmy's pool, that day, she was so desperate she filled the pool, not whit air, but with her own waste</span></div></div>",
            "created":1467003600,
            "id":2171823,
            "title":"Mom comes back"
        },
        "15321":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "stay",
                "leave"
            ],
            "content":"<div class=\"\"><div> <span>She remembered another experience, in Timmy΄s last day in the pré-school, before being home schooled, she needed to talk to the principal, but she also needed to go, so she picked up a plastic potty, and uses it in the principal room, of course it leaked, alot but<br>\r\n*FRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR* this fart made her remember the last time she wore clothing, she decided to poop in her underwear but the log was so big that filled her hole dress before it self-destruct</span></div></div>",
            "created":1469682000,
            "id":2187437,
            "title":"pos-school stinker and stink dress"
        },
        "1533":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Continue Reminiscing",
                "Snap Back to Reality"
            ],
            "content":"<div class=\"\"><div> <span>Even with all he had released, Timmy's stomach was still a roving ocean of activity, maybe even more so than when he started. He pondered this while pushing around his brand new submarine below the murky depths. It was at this time his tumultuous tummy unleashed its stormy payload, a watery jet of diarrhea. It puffed around him like a brown cloud and expanded out like a mushroom cloud coloring the bath water. While normally this sort of activity, and all those prior, would be medically dangerous, it did not infect Timmy or his family at all, really it didn't hurt anyone. If you could stand the smell, if would do you no harm. For the few times they went out to public pools, Timmy's parents would be fine if he pooped a little in the pool. He always enjoyed the sensation of a couple turds floating in his swimming diaper while he bobbed around. Actually wearing a diaper into the pool was one of his favorite things to do, he loved the way the padding soaked up all the water. </span></div></div>",
            "created":1455598800,
            "id":2105294,
            "title":"Pool Stool"
        },
        "15331":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Snap Back the Reality",
                "Remember Another Exerpience at the Pool"
            ],
            "content":"<div class=\"\"><div> <span>People always knew there would be a warm spot if they swam near Timmy. Sometimes, despite the chlorine, the water would yellow around him at his flow. One of his friends who appreciated both these facts was Juliet who was a number of years older than Timmy. She tolerated Timmy's various bodily functions and knew they wouldn't harm her, if anything she enjoyed them at the pool because it kept other kids away. They often played in the deep end and as Timmy was not yet a good enough swimmer to be there, he needed a flotation device. This came in the form of a number of logs he pushed out into his diaper, a rush of bubbles following each one. Their buoyant nature kept his head above water and other swimmers at bay.<br>\r\n</span></div></div>",
            "created":1455685200,
            "id":2105815,
            "title":"Continue Reminiscing"
        },
        "153311":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "time to fill your tummys",
                "2 kid and 1 bathtub"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Timmy\" He returned to the present by the voice of her, who had came  came to spend the night at his house and planned to tell him her secret. She was just wearing a diaper, a pink diaper with princess in the front. \"see what we gonna do\"</span></div></div>",
            "created":1467003600,
            "id":2171793,
            "title":"Snap Back the Reality"
        },
        "1533112":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "\"lets just chilax\"",
                "she releases her own flood"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Julie jump into the bathtub and giggles as feels the warmt of it</span></div></span></div>",
            "created":1499058000,
            "id":2346744,
            "title":"2 kid and 1 bathtub"
        },
        "153312":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Go Get Flotation Device",
                "Change To Another Story"
            ],
            "content":"<div class=\"\"><div> <span>          One time they went out to a different pool in the meaner part of town. A number of gentlemen who worked at the pool were incredibly rude to Timmy's mom as were a number of people attending the pool. After that Timmy's mom, Jenny, got in the pool and encouraged him to let loose. They both proceed to stink up the pool, turning the entire thing into a giant, smelly Jacuzzi. Everyone fled the pool area as a brown aura spread out from the pair. At one point, Jenny picked up her son and noticed his soggy, bulging swim diaper, and said, \"give me a big push Timmy, blow out your diaper for mama.\" She hefted him up higher as Timmy grunted and pushed with all his might. The soggy garment bulged at the messy onslaught until the tapes could no longer hold against the weight and Timmy's well used diaper splashed heavily into the pool below. Timmy continued pushing, dropping a couple of logs and keeping up a constant pee stream which arced onto his mother's bikini top. \"Oh you little stinker,\" she said with comical irritation before shifting him toward her butt and forcing out a real barn burner of a fart. The smell combined with the already sizable load Jenny had held up in her bikini bottom seemed to surprise Timmy at first before he grinned at his mother's odor and returned the favor with his own powerful gas. <br>\r\n          Those few brave souls who hadn't left the pool earlier watched the disgusting display in front of them wanting to stop the dirty duo but the stink drove them back. Some of the men who had rudely propositioned Jenny had passed out at this point from the smell. But Jenny and Timmy weren't done yet, they still had to go. \"Looks like we need to get you a floatation device my little poop machine, and a new swim diaper, can't have you going around naked, that would be gross hehe,\" Jenny cooed. Timmy shook his head in agreement then hiccuped and sharted messily on his mother's chest. \"Yes, for moments like that. You need big boy pants so you can leave skidmarks like your proud mama,\" Jenny replied as she let out her own messy shart, renewing the brown cloud surrounding them. </span></div></div>",
            "created":1457154000,
            "id":2113378,
            "title":"Welcome to our Poolp"
        },
        "1533121":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Farting Competition",
                "Diaper Burster"
            ],
            "content":"<div class=\"\"><div> <span>Jenny with Timmy in tow slowly walked her way to the side of the pool and climbed out, putting on display her no longer white bikini bottom. Her mess swayed back and forth as she strutted over to their stuff and plucked a fresh diaper from their bag. Jenny quickly scanned the pool area and noted they were now alone. With this in mind, she snatched a second larger diaper from the bag and dropped her bikini bottom to the ground with a juicy splat. The pair changed into their padded garments, an easier task when you don't need to clean up the previous mess, and headed back for the pool. Due to them essentially having free run of the place, Jenny grabbed a small inflatable tub for Timmy before stepping back into the pool. Instantly their diapers expanded as they took in pool water. \"Ahhhuuhuhuh, no wonder you like to come to the pool Timmy, this feels great,\" Jenny said with delight \"HHHHnnnrrgggg, Ahhhhhh,\" she pushed out a few logs and exhaled with relief, \"Ooh, I like the way they float around back there.\"</span></div></div>",
            "created":1457240400,
            "id":2113772,
            "title":"Quick Change"
        },
        "15331211":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Share a Diaper",
                "Approach the Diving Board"
            ],
            "content":"<div class=\"\"><div> <span>The mother and son proceeded to make the pool their own personal Jacuzzi with heat and bubbles. Timmy found if he really pushed, his farts could propel him around with his little inner tube. Of course this meant he was accidentally pooping every so often, the real dense kind, which despite his flotation device, weighed him down. Noticing her son sinking  from the weight he pumped out, she would turn out his diaper, wantonly dropping his poop in different parts of the pool. At this point the entire pool had turned a murky yellow/brown and the stink formed a bubble of smelly hazard around the place. Any animals still in the vicinity of the pool ran, flies flock the pool until even they could not handle the stench, and even some birds flying overhead fell to the ground, knocked out from the duo's odor. The pair didn't notice, they were having a blast tooting it up and letting loose; a pleasure they rarely got to share together. The pool was their toilet, and they were going to go until they were empty. </span></div></div>",
            "created":1457413200,
            "id":2114915,
            "title":"Green Haze"
        },
        "153312111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Despite its constant expulsion, Timmy's stomach gurgled angrily. He had mostly been farting before, but this heralded a literal shit storm. Floating in place, Timmy mindlessly gave pass to his bowels.<br>\r\nINCOMPLETE</span></div></span></div>",
            "created":1459918800,
            "id":2128789,
            "title":"Share a Diaper"
        },
        "153312112":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "eating and going",
                "put use to this diaper"
            ],
            "content":"<div class=\"\"><div> <span>When they got near the diving board Jenny had a ideas,\" look sweet\" she said as leaving the pool and going to the top of the board, she sat there and let some fart and a literally waterfall of peeing the water,\" that's *grunts* is how you drop *grunt* the bombs\" then she let her bowel movement onto the pool. Some time latter the pool was completely full with log of poop and pee, beside hazard air, she went down and saw her son suffering and remembered that he still need to go</span></div></div>",
            "created":1467003600,
            "id":2171975,
            "title":"dropping bombs from above"
        },
        "1533121121":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "someone came",
                "shitty food"
            ],
            "content":"<div class=\"\"><div> <span>She picked her son up and headed to the eating area, there she saw that there was completely full, so you give a good one of yours and son, it was all clean and smelly, so you toke out yours and yous son diaper and ordered food , when they started to eat,they realized the content they had inside they</span></div></div>",
            "created":1467090000,
            "id":2171979,
            "title":"eating and going"
        },
        "1533121122":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "ssomething happens",
                "someone appears"
            ],
            "content":"<div class=\"\"><div> <span>she went back to the pool and putted her son on her diaper, \"now give everything you have\", she said as both released a shit storm onto the diaper, the diaper was a special kind, witch hold all the water in the world, they continued filling up until</span></div></div>",
            "created":1467090000,
            "id":2171980,
            "title":"put use to this diaper"
        },
        "15331212":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "one thing",
                "other thing"
            ],
            "content":"<div class=\"\"><div> <span>Back to the pool, Timmy out the shit storm, his diaper didn't stand a chance and completely explode, releasing the boys bowel movement into the pool as his mom, on the other hand, as she was plugging her posterior while pushing her mess tsunami to his son have some messy fun be himself and because she was preparing something \"special\" back there.\" there was a good one sweetie, but sometimes to do the best you have to hold a little\". She said while releasing one log made out of her hole bowel movement, as the turd leave it hits the diaper, expanding it until it also explode, she stayed there as her poop tail manage to get to the other side of the pool and finally be completely release and fall directly onto the bottom. \" see sweet heart, that's how you do a big load\", she said as realizing a literally ocean of pee, make the pool overflow </span></div></div>",
            "created":1467003600,
            "id":2171732,
            "title":"Diaper Burster"
        },
        "1533122":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "More At The Hotel",
                "Go To A Different Story"
            ],
            "content":"<div class=\"\"><div> <span>One time my mom and I went to a hotel. As usual, we knew and were close friends with the hotel owners meaning the staff was okay with cleaning our messes, even if the other guests were not. I had cleared out many a pool by dropping a \"baby ruth\" into the water. The staff never closed the pool, they just let us go about our watery fun as it bobbed around the pool, later joined by many more as we played. I was wearing my swim diaper and my mom wore a cute bikini. At one point even she let out a floater while splashing around. The crew dutifully watched and fished them out with a net, they had some trouble when I pulled down my swim diaper and pushed out an extra large and dense turd. The stink was so bad from all of it that the entire pool area had cleared out besides us and the few staff members there. Feeling a sense of comfortable privacy, my mom removed her top then revealing her large, perky boobs much to the excitement of the staff.</span></div></div>",
            "created":1513314000,
            "id":2428657,
            "title":"Shitting Poolside"
        },
        "15331221":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "content":"<div class=\"\"><div> <span>When we're in the actual hotel room, my moms \"no messing anywhere rule\" is no longer in affect. The cleaning staff has to clean it all up so it's open season for the both of us. I don't have to wear a diaper and my mom just goes nude. We're both farting almost constantly, the room gets a foggy green haze from all our gas. Just from the smell, we usually drive off whoever is in the rooms next door.</span></div></div>",
            "created":1522523940,
            "id":2472839,
            "title":"More At The Hotel"
        },
        "15331222":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "More At The Play Place",
                "Go To A Different Story"
            ],
            "content":"<div class=\"\"><div> <span>One time, my mom took me to a play place with my cousin. As a super duper diaper pooper, I made sure to leave my handiwork around the entire place, I knew my mom and the owners wouldn't mind. The ball pit was an optimum spot to let out some of my load. It's nice and hidden underneath the waist so I can fully drop my diaper and push out a few logs without being seen and then they can't even find it. After the other kids hit a few of my poopy landmines and the smell got bad enough, everyone but my cousin and I avoided the ball pit. More space for us I guess, cause we certainly didn't mind getting a little \"muddy\" while playing around in there. I also had a lot of fun after getting a little brown back bulge going, sliding down the slide and leaving a nice skidmark on it. No kid wants to follow along a stinky snail trail, well no one but my cousin. She followed after me, her heavier mess giving her a lot more speed than I got. To make sure she didn't hurt herself, I quickly pushed out a lot of soft scat into my diaper and positioned my poopy butt at the bottom of the slide like an airbag. She laughed pretty hard after slamming into it, even after I farted really hard in her face.</span></div></div>",
            "created":1513392360,
            "id":2428659,
            "title":"Play Place Pooping"
        },
        "153312221":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "more",
                "CHANGE STORY NOW"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>my cousing dont exactly wants to be out stinked, so she starts to ripping really foul gas, the plants nearby starts dying and some of the staff starts faithing, i starts laughing  when sundenly a brown shower leves her butt, making the balls go up</span></div></span></div>",
            "created":1515299940,
            "id":2437704,
            "title":"hot air"
        },
        "153312222":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "After The Movie",
                "Go To A Different Story"
            ],
            "content":"<div class=\"\"><div> <span>It was a big day at the movie theater as a much anticipated kids movie was premiering and its first showing was sold out. Families with their kids, many babies and toddlers, flocked to the theater. Among them was mother Trish and her son Timmy. While excited for the movie, the duo enjoyed packed houses with many children as it allowed them to poop their diapers without worry of being caught. It was too dark to see it, to noisy to hear it, and the smell of popcorn blocked out their odor. The bonus of having many young people is if the smell was picked up on, it was easy to blame any number of babies also present in the theater. They loved it. A double bonus was this particular film was the penchant of this film series to use potty humor, this installment being all about it. The prepared before hand putting on extra strength diapers and scarfing down as much Mexican food as they could handle. Trish and Timmy found their seat and sat down, Timmy sitting on his mother's lap. The theater was full of families, lots of babies and toddlers with their moms. The lights dimmed as the movie began. Already Timmy squirmed and started releasing tiny poots. His stomach churned with a massive mess inside. A few minutes into the film he already pushed out his first steamy log. Trish felt it come out as it pushed against her lap, and smelled it heavy scent. No one near by seemed to care, they were too into the movie and eating their popcorn to notice. His mom followed his lead and pushed out a rank fart of her own. The movie continued and the pair continued farting, Trish sharted real good a couple of times and Timmy pushed out a second and third log to join the first. He wiggled his butt around on his mom's lap, smushing and spreading out his mess. Their odor became stronger but no one still seemed to notice, they seemingly were too into the movie. At around the half way point they understood why. Trish's motherly ears picked up on farting and pooping noises all around the theater and the pair smelled a stinky aroma that was not just their own. It seemed many of the other young kids in the audience also had to go and didn't want to get up and miss the movie so they just went where they sat, and on top of that, the parents didn't seem to mind either. The entire theater stunk of poop, but no one seemed to mind because they were all producing it. Well not no one. A teenager had come to see the movie to make fun of it, but left covering his nose when the smell became too much. Looking around, Trish spotted many kids noticeably further up on their parents laps than when the movie had started, their messy diapers elevating them to see the movie better. She also spotted a young man in his 20s clearly enjoying the messy content of the film as well as the messy content that surrounded him. She would have to talk to him later. Now knowing they were in a safe place, Timmy and Trish let loose. Timmy farted and shat with reckless abandon, bulging out his pampers immensely. His diaper engulfed his mother's entire lap underneath it's smelly girth. All eyes were still on the movie. A character on screen would fart, and the entire theater would fart in kind. At one point the kid in front of Timmy rose up further in his seat, blocking Timmy's view, so Timmy and Trish just pooped out more to raise themselves up. Finally the end of the movie came, and as the credits rolled the light came on and they surveyed the scene. The theater stank like a full dirty diaper pail after it's been left sitting a week, the big ones. Packed pampers were seen in every row. The ushers were gonna have a heck of a time cleaning up after this one. Trish sat up, hefting Timmy and his heavy load on her shoulder and clearly putting her own mess on display.</span></div></div>",
            "created":1513392480,
            "id":2428661,
            "title":"Movie Theater Loads"
        },
        "1533122221":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Change Timmy's Diaper",
                "Leave It Be"
            ],
            "content":"<div class=\"\"><div> <span>It was after the movie, and Trish went to go find that 20-somthing that was visibly enjoying the aroma of the theater. She found him leaning up against the wall near the bathroom, poking at his phone. Passing by him, she let out a little toot before saying \"hello handsome, let me quick change my boy, then I'd like a word.\" The guy turned beet red and smiled,\"I'd like that\", he responded. As she entered the ladies room, Trish plunked Timmy down on the changing table. It groaned and squawked under the weight of his mess.</span></div></div>",
            "created":1513392600,
            "id":2428662,
            "title":"Post Film Aroma"
        },
        "1533122222":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "More Sandbox Stories",
                "Go To A Different Story"
            ],
            "content":"<div class=\"\"><div> <span>My sandbox in the back yard is like a big liter box. My mom let's be play in it without a diaper on because we have such high fences, and due to my delicate aroma, we don't have any neighbors very close by. I usually wander around, playing in the grass or on my jungle gym, but if I feel the need to push one out, I head over to the sand box. Much like a cat I just stand up over it and drop some logs. Usually it's two or three big ones. Then when I'm done, I hide them in the sand. It's a force of habit from when I do this out and about. Pooping in the open is not exactly smiled upon in the world at large, but why should that stop me, I just have to be a little more secretive about it. Every couple of days during the summer, my mom has to clean out the sandbox with a big shovel and some garbage bags. It probably doesn't help I'm usually in the box when this is happening dropping more loads, but I know she doesn't mind.</span></div></div>",
            "created":1513392840,
            "id":2428665,
            "title":"Sand-Liter-Box"
        },
        "15331222222":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "A Different Story A",
                "A Different Story B"
            ],
            "content":"<div class=\"\"><div> <span>One weekend, a sewer main broke in our neighborhood and the entire area stunk of raw sewage. Except our house of course, it reeked of my many dirty diapers. While everyone else was suffering from the smell, we barely noticed with how much stink I was putting out. My mom had me drop a big load in a new diaper in each room to make sure every room smelled fresh. Well, except the bathrooms. I let my mom handle those; she clogged those toilets real good, not that we could flush them anyway with the broken pipes. If we ever went back to a room I already stinkified, I'd swap back to that diaper. It's an interesting feeling putting back on an already used padding. Usually it's a little cold by then so I carpet bomb it with some hot and heavy farts while peeing a bunch. Really helps warm things back up.</span></div></div>",
            "created":1513393200,
            "id":2428671,
            "title":"Sewer Main Stinker"
        },
        "15332":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "lets eat",
                "fire in the hole"
            ],
            "content":"<div class=\"\"><div> <span>He went back to reality by hearing a splash and realized the bathtub has overflowed, he got and decided to put a diaper on. This diaper was new in the market and the company promised it to hold all the water in the world so he went to the kitchen to eat.\" Hi honey, so you had a good time there\" She said while cooking. Even after all the time Timmy has in the bath she didn't had finished because: 1- She cooks both launch and dinner, also because. 2- Whenever she felt, she release her gas wherever she is so the hole kitchen is filed with methane, so if she don't get careful, the hole thing will blow up. \"i see you are wearing your new diaper, do you mind if i test it with you ?\"</span></div></div>",
            "created":1467003600,
            "id":2171784,
            "title":"Snap Back to Reality"
        },
        "154":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "A friend of her comes by",
                "A store worker comes by",
                "No one comes by"
            ],
            "content":"<div class=\"\"><div> <span>She pushed her cart containing her toddler daughter into the super market. It was about mid-day so there was a good number of people, an annoyance to the mother but she had something planned. A special connection she shared with her infant daughter that made every trip out enjoyable. As the pair entered the crowded produce section they locked eyes for a moment before the daughter started to fidget. The mother knew what these movements told and anticipated the outcome greatly. The daughter was suffering some intense intestinal discomfort and when she was lifted out of her little seat proceeded to unleash that distress directly into her clean diaper. A fart heralded in a decent sized load by the mother's approximation confirming everyone's suspicion of what had happened. The mother sniffed heavily,\" smells like someone made a stinky\", she said almost unfazed by the smell of her daughter's mess. With the stench in the air, everyone gave her a wide bubble of space to go about her shopping trip which she greatly enjoyed. As she searched for the perfect apple, her daughter sat content with her messy diaper, releasing a noxious cloud of gas every so often. The mother playfully waved away the fumes smiling at her daughter, both of them enjoying the smell. Pushing her cart into the first aisle, the daughter started fidgeting again with even greater intensity than the first time. The mother quickly picked her up as she saw her already sagging diaper ballooned out even further, the browns turning even darker than before. \"Smells like you really need a change now wehh\", the mother announced still unfazed by the smell. She placed her daughter back into the seat of the cart with an audible squelch. People quickly emptied out of the aisle as the mother grinned to herself at both the wonderfully pungent odor in the air and the glorious privacy as she went about her shopping. Finally able to do as she pleased the mother hiked up her dress a little to reveal her own diaper underneath. Her fiber rich diet meant she usually had to go multiple times a day and it was now after lunch and she was really feeling the need to unleash. The daughter's area clearing messes gave her the perfect excuse for the smell and it usually kept people away from seeing it. She bent over to get something on a lower shelf, her rear appearing before her daughter who clapped and giggled happily knowing her mother was about to join the poop party. With an easy and practiced push the mother emptied her bowels into the diaper.</span></div></div>",
            "created":1430888400,
            "id":1974653,
            "title":"Supermart Supermess"
        },
        "1541":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "\"let they have fun?\"",
                "\"join they?\"",
                "\"ahhh, erm\""
            ],
            "content":"<div class=\"\"><div> <span>She soon stops after hearing the sound of something heavy hitting the floor and then she looks behind and saw her friend and her daughter, both only wearing a well used diaper. \"Look who we have here\" \"So you miss my mister potty pants?\", the two women started to argue while her daughters were having a messing contest of they own. \"So what you doing? \" \"well. i was using the toilet until someone interrupt me\" \"OHH! I saw that, but beside you i try to take the blame for mys and my daughter's mess\" \" talking about her, look, they are having a contest off they on, should we...\"</span></div></div>",
            "created":1467003600,
            "id":2171925,
            "title":"loads of rivality"
        },
        "15413":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "pick the fist thing you see and let rip",
                "run to the bathroom and drop the meteors"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After the raccoon stayed some more, he notice he had to poop as much as he need to pee, so..</span></div></span></div>",
            "created":1467003600,
            "id":2171927,
            "title":"A Herm (Part 2)"
        },
        "154131":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "SOOOOOOOOOOOOOOOO lets go home",
                "somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>he looked at his pockets and saw a balloon, but remembered he had a absorbent on, so he putted the balloon on his penis and let flow, the balloon expanded so much that it was three times his size while his mess have ten times it as the people around he looked disgusted he just walked away (somehow) and gave then the middle finger</span></div></div>",
            "created":1467003600,
            "id":2171959,
            "title":"mess destruction"
        },
        "1542":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "continue there",
                "leave before someone comes by"
            ],
            "content":"<div class=\"\"><div> <span>\" Looks like someone needs a change\" the mother stopped as she heard someone behind her, she turned and saw a store worker, \"the bathrooms are aver there\" he said pointing to some direction \"so you can change that little stinker\", \"thanks\" she said trying to recover from the heart attack and walking to the direction,\"little silly filly\" when it hits the mother ears she turned and asked \" excuse me ?\" \"nothing, just your daughter is a little to old tho mess THAT MUCH\" by that, the mom went to the worker, pushed him to he fall in the floor and squatted on his face \"if you think a kid of that age can't make messes like that say to me what you think about THIS\" she said pushing her monstrous load that hit the guys face, it only take 5 seconds but her diaper was now the double of her size and even had a guy under it, while all that her daughter just giggle and filed more her diaper.</span></div></div>",
            "created":1467003600,
            "id":2171829,
            "title":"punishment, NOW"
        },
        "1543":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "pass everyone",
                "let her release ",
                "take out the dress and both reliese"
            ],
            "content":"<div class=\"\"><div> <span>She drooped a astronomical mess into her pampers, the only thing that didn't let anyone know was her big dress, when she ended her load was about 10 times her size, only the dress kept it safe, \" so lets pay now sweet\" she said as they both went to the cashier.<br>\r\nThere she notice that there was a line, full of people with stink babies, they smell altogether didn't stand a chance against the line, but the mother notice her daughter pushing more, and she know that diaper didn't was going to hold all that, also she notice she also had to go again</span></div></div>",
            "created":1467090000,
            "id":2172385,
            "title":"No one comes by"
        },
        "155":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "A caretaker comes over",
                "A bully comes over",
                "No one comes over"
            ],
            "content":"<div class=\"\"><div> <span>She stood separate from the other kids in the large play pen intending to reap the maximum benefit from an already great situation. Hugging her plushie tight, Breezie settled down in a corner near some blocks, her favorite toy. Normally when she built things with the blocks, kids would come over and smash down her towers and steal her blocks but not this time. Breezie tugged her padding up a little and began to push. She didn't mind being messy, she even enjoyed the smell, and it helped keep the other kids at bay from stealing her blocks so it was a win-win. Breezie's diaper began to sag and turn a light shade of brown as she released, her bowels feeling the wonderful sensation that came with it. The smell wafted up towards Breezie's nose causing her to grin in excitement. Wanting to spread the stench further, she blew a wet fart into the already raunchy padding.*FFFRRRrrrtttttt* She sighed in relief and went back to focusing on her blocks. One of the kids came over to knock her tower down but Breezie barely noticed inside opening her bladder into the padding. *ppssssssssssssss* A seemingly endless stream of piss yellowed the front of the diaper, the smell heavy in the air. Breezie finished her performance with a mighty toot. *PFRT* The invading kid wrinkled his nose and left the scene. Her stench had worked and now her tower was bigger than ever. Her tummy rumbled, thankfully already ready for round two, as she set about creating the walls of her castle. There was something special to her about being able to mess the same diaper twice. Usually her parents or one of the daycare aids came and whisked her away to get changed despite the fact she didn't mind her messy state. Breezie never seemed to suffer diaper rash or any sort of infection so it always came down to the smell as their reasoning. There was nothing wrong with the smell of her diapers. They clearly just could not appreciate the aromatic fragrance she exuded. Speaking of which. *FFRRRTTT* Her butt announced her bowels were once again at full capacity with a bass raspberry. Finishing off the working castle gate, Breezie stood up. She wanted to fully enjoy this rare second messing opportunity. Clenching her fists, Breezie pushed out another log to join the orange sized mess already resting in the soggy garment. She crouched down and forced out a second, bigger log, the largest one yet. Her little overalls very visibly tenting out as the behemoth turd poked it's way out of Breezie's butt. Breezie giggled wiggling around her new tail, continuing to push out the fecal snake until it curled off and sagged down the diaper heavily. Breezie stop pushing and relaxed. The massive poop had clearly unclogged something as a rush of diarrhea messily, and noisily into her diaper. *FRT* *prtrrt* *FIZZRT* *popfrrttt* *FRPPRTPPRT* Breezie breathed deeply through her nose enjoying the heavy stench that hung in the air around her like a miasma. Her butt ceased production and Breezie sat right on down a few inches of compacted poop. Her diaper had turned a dark shade of brown and showed clear signs of the bulging mass inside. Ahhhhh, she sighed enjoying her private play time.</span></div></div>",
            "created":1430888400,
            "id":1974440,
            "title":"Pre-School Stinker"
        },
        "1551":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "She escapes outside",
                "She defends herself",
                "She is caught"
            ],
            "content":"<div class=\"\"><div> <span>Noticing the smell, the male caretaker came over. \"Smells like someone is ready for a change,\" he said playfully. He then comically sniffed the air, causing him to cough on the noxious fumes from Breezie's behind. \"Oh wow kid, you really reek,\" he said between coughs. Breezie sniffed the air and just smiled releasing a small toot. \"I'm as fresh as a daisy, I don't need a change,\" she cheekily replied. The caretaker attempted to swoop in and grab her but Breezie waddled off. She was used to moving around with a mess, even with the extra weight.</span></div></div>",
            "created":1431493200,
            "id":1977658,
            "title":"Stinker Alert"
        },
        "15511":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Try to befriend the other sandbox goers",
                "Try to drive the sandbox goers away"
            ],
            "content":"<div class=\"\"><div> <span>With her short, unbound strut, Breezie quickly dashed out the door to the outside play area and made a beeline for the sandbox. Much like a litter box, the sand helped to nullify the smell of her messes usually allowing her to stay unchanged for longer, and, still much like a litter box, it was a good spot to hide her work. Breezie plopped her mushy padded butt down on the sand. There were two other kids in the sandbox.</span></div></div>",
            "created":1431925200,
            "id":1979889,
            "title":"Sandbox Escape"
        },
        "155111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "They too enjoy being messy and accept you",
                "They think you stink"
            ],
            "content":"<div class=\"\"><div> <span>Breezie smiled and waved to the two kids, a boy and a girl, sitting in the sandbox with her. It always helps to have a buddy when in these kinds of situations, she may need their help if the caretaker comes around again. \"Hi, my name's Breezie, what's yours?\", Breezie asked with upbeat pep. The boy responded, \"I'm Timmy\", followed by the girl saying,\"and my name's Jenny.\" Now that they had been acquainted, Breezie continued,\"Okay you two, the caretaker is looking for me because I pooped my diaper but I don't want to get changed. Can I hide out here with you two?\"</span></div></div>",
            "created":1432011600,
            "id":1980419,
            "title":"Putting Out Waves"
        },
        "1551111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Jenny Tells it",
                "Timmy Tells it"
            ],
            "content":"<div class=\"\"><div> <span>\"Why didn't you say you were messy, of course you can play here with us,\"Timmy said as he bared down to push out a fart *FFRRRTTT* Breezie smiled as the smell wafted over her. \"Most kids run away or make fun us and say we stink so we usually uh,\"Jenny clutched her stomach as she sharted into her padding,\"oh that sounded wet, we usually play alone. It's really nice to have a new friend who can stand the smell,\" Jenny said. \"Stand it?\" Breezie questioned,\"I love it, it's so great to find people who have good taste. So,\" Breezie said standing up,\"I'm currently sitting on a lovely double mess, a rarity for me.\" Breezie popped the buttons on the butt flap of her overalls to show the bulging, muddy war-zone her diaper had become. \"I'd like to avoid getting changed today and make it to a third. What's your guys deal?\" Breezie asked. </span></div></div>",
            "created":1432011600,
            "id":1980426,
            "title":"Stinkers Stick Together"
        },
        "15511111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "The three play in the sandbox",
                "The three hatch a plan"
            ],
            "content":"<div class=\"\"><div> <span>\"I feel you sister. My mom says I have something called Irritable Bowel Syndrome cause I can't stop pooping and *Frrgght* farting all the time, but it's not like I can't *FBBLP* stop, it's that I don't want to. My padding's not clean for usually only a couple minutes before.\" *BbBBBRRRRBRLBRRPPPPppptptptptptprrprtprptrt* Jenny's face contorted into a mask of pleasure as a particularly long and wet fart erupted from her rear causing the dress covering her diaper to flutter slightly. \"Well something like that happening, hehe. Wanna see?\" Jenny continued lifting up her dress to reveal her heavily darkened diaper bottom. It lacked the bulges of Breezie's sizable mess but was a darker shade of brown and a little damp. \"Impressive,\" Breezie said in admiration,\"What's your deal Timmy?\" \"Let me explain,\" Jenny said,\"kids call him the human fire hose because of how much he pees.\" Breezie looked at him noting he was only wearing a shirt and a very very wet diaper. \"Yeh, he can't wear any pants because they just get soaked. That's why we usually play in the sandbox, it's helps suck it up so he doesn't form a puddle,\" Jenny continued. Breezie noticed the very damp sand around him. *FFRRRTTTT* Timmy farted dryly into his wet padding. \"Also he's really gassy,\" Jenny finished. \"Oh, sounds like it's time to turn my diaper around,\" Timmy announced, \"you see I like the feeling of actually getting my diaper wet. As you can see the front is soaked but the back is nice and dry.\" Timmy stood up and dropped his diaper to the ground with a wet thud before spinning it and putting it back on. \"Also,\" Timmy continued with a chuckle, \"I love feeling the wetness on my butt and it makes the back of the diaper weaker, perfect for blow-outs.\" \"Now that the three of us are acquainted,\" Breezie said, \"let's get down to business.\"</span></div></div>",
            "created":1432098000,
            "id":1980562,
            "title":"Number 1 and Number 2"
        },
        "155111111":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "They try to go inside and get food",
                "They get snacks from a random kid"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, let's build a sandcastle\", Jenny suggested, punctuating her sentence with a noisy shart. Breezie shifted herself forward and wiggled her butt into her drying mess and got started. Working well together, they started work on a sandcastle. The trio's stench hung heavy in the air but none of them seemed to mind it. \"Ya got anything solid back there?\" Breezie questioned Jenny as she patted her sizable bulge. \"Nope, just wet *fFFRTFFGRT* poopy but it still stinks as bad,\" Jenny responded. The sandcastle grew from a single tower to an entire complex. A group of flies flew around the kids, drawn in by the smell. \"Man,\" Breezie exclaimed, \"people think the worst part of my poop is the smell, but they have it all wrong, it's the flies.\" Jenny stood up and said, \"I've got this. Timmy knows my method for dealing with flies.\" Timmy grinned with anticipation as Jenny waddled over to the far side of the sandbox, well away from their castle. Jenny began hitching her dress up. \"The caretakers hate when I do this but it works every time,\" Jenny said as she pulled her messy diaper bottom down and crouched. With barely any effort at all, Jenny pooped out a sizable turd for someone of her size. She looked back to survey her worked and smiled at her accomplishment. \"That's one of my finest works, I think I should be able to do this in one go,\" Jenny said proudly. Noticing the free, easily accessible food, all the flies in the area flocked to the smelly poop. \"And now onto phase two, the part my mom doesn't like.\" Jenny dropped her dress back down and went on all fours pointing her butt at the collected swarming flies. She pushed her head up and her butt down, took a deep breath, clenched her teeth, and with a roll of her body putting her butt in the air, Jenny unleashed a massive shart.*WLPWLWPLWPWLPLPWLPWFLPFLRPRLPFRLPFRLTPRLTPRLTPFLTPRLTRPTLRTPLRTLP* Her dress rippled in the breeze as flecks of brown dirtied her mostly clean pink dress. Breezie swore she could visibly see the wave of stink or maybe heat moving towards the gathered flies and stared in shocked attention. The flies didn't seem to just die from this odorous onslaught but disintegrate from the sheer force of it. \"Ahhhhhhhhhhh\", Jenny sighed in relief, pulling her diaper back up and returning to her original position with an audible squelch. \"That should, erhh\" *ftlp* keep them away for a while,\" Jenny said. Indeed, flies no longer buzzed around the stinky children and the three were able to return to building their sandcastle undisturbed. \"Okay, the parapets are up, we have a working drawbridge, the walls are detailed, and we've dug the moat. Anyone know where we can get water for it?,\" Breezie asked. Timmy returned,\"I got this one.\" His face mellowed out as his diaper front yellowed rapidly. A stream trickled out from him to the moat slowly filling it up. \"Impressive,\" Breezie commented. Timmy sniffed loudly as he proudly surveyed their work,\"this is the smell of productivity ladies. No adults wanting us to waste time and get changed, just three friends working together without the need to get up to go to the bathroom.\" \"Yeh, this is a lot of fun, but if I'm gonna get to that third mess and make it a good one, we're gonna need to refuel,\" Breezie returned. \"Well we could go to the kitchen and grab something but that might be a little dangerous. The kids around outside usually have some snacks on them, we could eat those,\" Jenny openly pondered.</span></div></div>",
            "created":1432184400,
            "id":1981235,
            "title":"Smelly Sandbox"
        },
        "1551111111":{
            "author_id":"cryohydr0",
            "author_name":"CryoHydr0",
            "choices":[
                "Story time",
                "final destination"
            ],
            "content":"<div class=\"\"><div> <span>as they are were stealthily trying to get they snacks Breezie remembered a story. \" That's remembers me one time where i was shopping with my mom and she really needed to go, she was desperate and the bathroom line was big, so she tried to find a calm place so she went to the changing room. There, she pulled my diaper, my fear was she was going to changing me but then i felt a pee waterfall and some heavy poop logs filing it, i turned back and saw that my mom was filing my diaper, but she soon stooped when saw my diaper leaking. so she search in her purse for something to use and founded a trash bag. She putted on the bag like a diaper and leted all out, she went so much that even the trash bag started to leak and almost riped apart</span></div></div>",
            "created":1467003600,
            "id":2171765,
            "title":"They try to go inside and get food"
        },
        "1551111112":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "Timmy, shut up about your dog"
            ],
            "content":"<div class=\"\"><div> <span>They scanned the playground for a kid carrying snacks. \"I wish my dog Charlie was here, he'd be able to sniff out those snacks,\" Timmy said, \"actually have I ever told you about Charlie? It's funny, whenever me and my mom take him on walks she has to bring a garbage bag to pick up all his poop. I usually try to carry it but it gets a little too heavy for me about half way through the walk. We tried putting him in a diaper once but it got to heavy for him. The bag also helps when I have to go and mom doesn't want me to be smelly, we just find a bush and I go in the bag, and no one is the wiser. One time my mom had to go and we had a real hard time getting the bag back home after that.\"</span></div></div>",
            "created":1433048400,
            "id":1986124,
            "title":"A Doggy Distraction"
        },
        "15511111121":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Shut up about your dog Timmy, I think I've found our target,\" Jenny snapped as she pointed at a kid on the playground. He was one of the kids that always bullied them and he had a big backpack bursting with food.</span></div></span></div>",
            "created":1434258000,
            "id":1992527,
            "title":"Operation: Stink Tube"
        },
        "15513":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "You make it to the changing room",
                "Another caretaker arrives to tag you out"
            ],
            "content":"<div class=\"\"><div> <span><b>CHANGE OF VIEW TO THE CARETAKER</b><br>\r\n\"What was with this kid?\" I thought to myself as I quickly plucked up the escaping child. It was kinda hard to hold on to her as she was surprisingly heavy, probably that disgusting diaper she was wearing. Geez what were they feeding here. \"I don't wanna get changed mister, I'm only on my second mess,\" she shouted trying to struggle out of my grip. Well that explains the weight, gross. Gosh I wish I didn't need both hands to hold her, the smell is so strong. She stopped struggling oddly then had a face of extreme effort as she gritted her teeth. \"Uh oh\", I gasped realizing what was about to happen. A series of nasty farts preceded it. Even through her little overalls I could see the bulge growing, expanding past the already noticeable lump. The smell was near unbearable, I was frozen by its funky presence. She seemed unaffected by it as she said,\"There's more where that came from, put me down or I might start leaking.\" I steeled my resolve,\"No little missy, we are getting you out of that disgusting diaper.\" She frowned at my comment. \"It's not disgusting,\" she insisted,\"it's a work of art, I smell like a beautiful bouquet.\" She punctuated this point with a nasty fart.</span></div></div>",
            "created":1433221200,
            "id":1986814,
            "title":"Hazmat"
        },
        "155132":{
            "author_id":"joebob76",
            "author_name":"The Dude",
            "choices":[
                "You go back to your blocks",
                "You go somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>At that moment a young female caretaker arrived on the scene. \"Hey Ron, looks like you're having a little trouble there, mind if I tag you out? They just brought in a box of donuts to the break room,\" she said with a carefree smile. \"Oh thank God you're here,\" Ron said before thrusting little Breezie into Janet's hand,\"this little one here is a real stinky menace and needs to be changed.\" Wanting to not spend one more minute with the smelly child, Ron quickly exited the room. \"Man I thought he'd never leave,\" Janet giggled taking a big whiff of the air, \"smells like you got something good cooking little one.\" Breezie was confused. Usually caretakers hated her stench and wanted to change her. Noticing her confusion, Janet lifted up her skirt revealing a dirty diaper of her own. \"Ya see girlie, I get you. Thanks to cute little stinkers like you, I get to walk around messy at work and nobody bats an eye, speaking of which.\" Janet grunted and expanded her bulge with a messy sounding shart before dropping her skirt back down. \"The funny thing is all the male caretakers think I got a really nice butt, but they don't know what's really hiding underneath my skirt,\"Janet said with a laugh. \"Now us messy chicks gotta stick together, you hear me sister, so I'm gonna let you go. Enjoy that mess for me, try to pop your buttons off.\" Janet set you down and went in the direction of the changing room. You are once again free to do as you please.</span></div></div>",
            "created":1433394000,
            "id":1987970,
            "title":"Stench Sisters"
        }
    },
    "info":{
        "author_id":"joebob76",
        "author_name":"The Dude",
        "brief_description":"Just an average day for a hyper-messing teen skunk and her family and friends",
        "created":1281925920,
        "description":"<td align=\"left\" class=\"norm\">Get in here and get messy</td>",
        "id":1699601,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1553561940,
        "modified":1553561940,
        "pretty_title":"A Skunkette's Messy Day"
    }
}