{
    "chapters":{
        "1":{
            "author_id":"tom_lady",
            "author_name":"Tom_Lady_the__Glorious_Benefac",
            "choices":[
                "A 23 year old man.",
                "A 19 year old Woman",
                "An 8 year old Girl/Boy",
                "Plasmid list/ Information."
            ],
            "content":"<div class=\"\"><div> <span>You stumble out of the small metallic capsule and fall to the ground.<br>\r\nYou get up and dimly look around, a staircase leads to a pink-looking machine.<br>\r\n<br>\r\nYou look back down and notice that your knee was grazed.<br>\r\nSaid knee belonged to...</span></div></div>",
            "created":1351659600,
            "id":1457178,
            "title":"Enter: Protagonist!"
        },
        "11":{
            "author_id":"batman645",
            "author_name":"Batman645",
            "choices":[
                "You meet a Splicer",
                "Big Daddy",
                "Little Sister"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your name is Roger Carols. You have short, brown hair and are 6 foot 3. You brush off your knee.</span></div></span></div>",
            "created":1397967900,
            "id":1783053,
            "title":"A 23 year old man."
        },
        "112":{
            "author_id":"batman645",
            "author_name":"Batman645",
            "choices":[
                "Get Ready to Fight",
                "Sneak Past",
                "Drop Down the Difficulty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Oh, crap. Its a Big Daddy, looking for his Little Sister, and you only have a wrench.</span></div></span></div>",
            "created":1411944060,
            "id":1863470,
            "title":"Big Daddy"
        },
        "1123":{
            "author_id":"batman645",
            "author_name":"Batman645",
            "choices":[
                "Fine, Let's go in, Guns Blazing",
                "Never mind, Let's get Stealthy",
                "Please can I have another choice?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you kidding me? This isn't a game. There is no difficulty settings. Than again, you chose to deal with a Big Daddy.</span></div></span></div>",
            "created":1411944300,
            "id":1863473,
            "title":"Drop Down the Difficulty"
        },
        "11231":{
            "author_id":"batman645",
            "author_name":"Batman645",
            "choices":[
                "Hits you with their giant drill arm.",
                "Is attacked from behind by someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You mean wrench blazing? Okay. You start wildly swinging away at the Big Daddy. In turn the giant creature covered in metal turns around and...</span></div></span></div>",
            "created":1489286100,
            "id":2288285,
            "title":"Fine, Let's go in, Guns Blazing"
        },
        "113":{
            "author_id":"batman645",
            "author_name":"Batman645",
            "choices":[
                "Harvest",
                "Rescue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Oh look, its a Little Sister, away from her Big Daddy.</span></div></span></div>",
            "created":1411944480,
            "id":1863474,
            "title":"Little Sister"
        },
        "12":{
            "author_id":"tom_lady",
            "author_name":"Tom_Lady_the__Glorious_Benefac",
            "choices":[
                "You were a Big Sister Returning home.",
                "You are military, on a mission to destroy the underwater Dystopia.",
                "You're an author who came here to avoid censorship from the church",
                "Oh wait... it's gone."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You walk over to the stairs, pondering why you were here on the way up.<br>\r\nyou reach the pink machine and the sight of the plasmids suddenly triggered your memory.<br>\r\nYou remembered why!</span></div></span></div>",
            "created":1351659600,
            "id":1457180,
            "title":"A 19 year old Woman"
        },
        "121":{
            "author_id":"skirret",
            "author_name":"Comic lover",
            "choices":[
                "Getting supplies(post-bioshock 2)",
                "Bringing a new little sister(pre-bioshock 2)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were an older sister who had come back from the surface after...</span></div></span></div>",
            "created":1416767760,
            "id":1892634,
            "title":"You were a Big Sister Returning home."
        },
        "124":{
            "choices":[
                "A Little Sister finds you",
                "A couple of Splicers find you. ",
                "A bottle of red slime catches your eye. "
            ],
            "content":"<div class=\"\"><div> <span>You think that you remember why you're here, but it turns out that you don't. All you know is that a city exists at the bottom of the Atlantic Ocean. A city that has harnessed the power of DNA changing and is far more technological advanced that the USA and the USSR put together. <br>\r\nBefore you have a chance to further look around...</span></div></div>",
            "created":1400192820,
            "id":1796972,
            "title":"Oh wait... it's gone."
        },
        "1241":{
            "choices":[
                "Blast him with Ice, freezing him (Winter's Blast)",
                "Open your mouth, wider than any human can. ",
                "Get knocked out by his lead pipe colliding with your head. "
            ],
            "content":"<div class=\"\"><div> <span>You turn around to see a young girl of about 8 looking at you with glowing yellow eyes. She was dressed in a dirty red and white dress and had no shoes. <br>\r\n\"Hey there\", you say to the girl. \"I'm a bit lost. If you could just point me to the exit, that would be great.\"<br>\r\nAs you walk closer to the girl, she seems to back off. Eventually, after comforting her, she comes a bit closer. Now you see that she's carrying a needle with a red gelatinous substance in a bottle. You see that needle now because it's stuck in your right arm. <br>\r\n\"Owww, Shit.... That really hurt.\" Before you can retaliate, the girl has run off. You go to follow her, but fall over. When you try to get to your feet, you fall again, this time unconscious. <br>\r\n<br>\r\nYou wake up to a couple of heavily deformed people looking over you. You scream and hurriedly back away. The pair just advance towards you. <br>\r\n\"I see a woman. A woman with ADAM! Give it to me!\", the one on the right demands. When he jumps at you, you...</span></div></div>",
            "created":1400193480,
            "id":1796980,
            "title":"A Little Sister finds you"
        },
        "12413":{
            "choices":[
                "Rapture isn't such a bad place after all. (Little Sister Mental Conditioning)",
                "A needle, similar to the one you were injected with. (Urge to gather ADAM)"
            ],
            "content":"<div class=\"\"><div> <span>His lead pipe collided with your head, knocking you clean out. <br>\r\nComing to, you see the splicers walking around, discussing what they should do with you. <br>\r\nOne of the splicers threw the idea out that they should just harvest your ADAM right here and now. <br>\r\nAnother wanted to let you loose in the city of Rapture and let you find more ADAM, turning you into one of them.<br>\r\n<br>\r\nFortunately, they never decided what to do with you. Unfortunately, they were scared off by a loud stomping. <br>\r\n\"Its the Metal Daddy! Let's split!\" All but one splicer ran off. <br>\r\nHe leaned down and said to you, \"Let's hope that you survive the Metal Daddy, little fish. We'll be seeing you very soon if you do.\"<br>\r\nHe grinned at you with half his mouth before running off after the other splicers. <br>\r\nLosing conscious again, you woke up when a sad whale-like noise and a loud stomping was right next to you. <br>\r\n<br>\r\nLooking up, you see a huge hulking metal figure, the source of the noise. It stood next to you, revealing the tip of a huge drill. It didn't drill you, but instead pushed you over with its free hand. <br>\r\nLooking at it, you some how realise what it is. A Bouncer Big Daddy. <br>\r\nYour faithful protector. <br>\r\nThe needle that the Little girl had injected you with was turning you into a Little Sister. Getting to you feet, you see that...</span></div></div>",
            "created":1400667660,
            "id":1799855,
            "title":"Get knocked out by his lead pipe colliding with..."
        },
        "124131":{
            "choices":[
                "Retrieve ADAM from the nearby Angel. ",
                "Take a look around Rapture. "
            ],
            "content":"<div class=\"\"><div> <span>Sitting up, you look around and see Rapture as a Little Sister would see it. <br>\r\nYour Big Daddy, once clad in a dirty grey suit, now was a golden Knight in pristine armour. His drill had transformed into a golden sword. You knew that he would always protect you. <br>\r\nLooking around, the fires that once burned had transformed into fireplaces. The dirty walls were now clean and golden and the floor was a nice pink colour. Vines grew over the walls, covering the cracks in the walls. A nearby blood splatter was now a pile of rose petals. The body that lay near the 'roses' now was an elegant person, dressing in a fine evening dress and masquerade mask. Sprouting from the person's back was a pair of Angel wings. In the real world, this was a dead splicer that your Knight in Shining armour had killed with his sword. <br>\r\n<br>\r\nThis mental conditioning change had affected your physical appearance. Your eyes, once brown, were now a glowing yellow colour. Your age dropped a couple of years, making you 17. You also shrunk a couple of inches, bringing you to a height of 5 Feet. <br>\r\nLooking around, what is your next move as a Little-ish Sister?</span></div></div>",
            "created":1400668800,
            "id":1799860,
            "title":"Rapture isn't such a bad place after all. (..."
        },
        "1241311":{
            "choices":[
                "You shrink and become younger. ",
                "You smell another Angel. "
            ],
            "content":"<div class=\"\"><div> <span>Picking up the needle that you were initially injected with, you look it over. It looked like it was quickly thrown together. You recognised a needle from a hospital syringe. <br>\r\nWalking over to the angel, you did a little dance, commented on what you were about to do -\"Who watches over sleeping angels? I do, I do..\"- and jabbed your needle into the woman's belly. <br>\r\nAlmost immediately, you hear a large roar from your Protector, as he gets ready to fight off the incoming enemies. Ignoring what was happening around you, you happily hum to yourself as you jab your needle into the woman. <br>\r\n<br>\r\nAfter all the splicers had been killed, you stood up and looked around. You had shrunk another couple of inches and were about 15 years old now. Turning to face your golden Knight, you tell him \"Come on, Mr Bubbles. Angels don't wait for slowpokes\", before walking off. <br>\r\nAs you walk...</span></div></div>",
            "created":1400669460,
            "id":1799861,
            "title":"Retrieve ADAM from the nearby Angel. "
        },
        "13":{
            "author_id":"tom_lady",
            "author_name":"Tom_Lady_the__Glorious_Benefac",
            "choices":[
                "A Dress (girl)",
                "Shorts (boy)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you make you way up the stairs you brush the dirt off you clothes.<br>\r\nthese clothes were:</span></div></span></div>",
            "created":1351659600,
            "id":1457184,
            "title":"An 8 year old Girl/Boy"
        },
        "131":{
            "choices":[
                "Fail to notice the hypo on the floor",
                "Get kidnapped",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You brush the dirt off your pretty pink dress and look around. Out a nearby window, you see a blue whale swim by and are fascinated by it. You are so fascinated that you...</span></div></span></div>",
            "created":1394870940,
            "id":1760601,
            "title":"A Dress (girl)"
        },
        "132":{
            "author_id":"abadthing",
            "author_name":"A Bad Thing",
            "choices":[
                "You move on to the next room",
                "Someone grabs you",
                "You decide to test out your plasmids"
            ],
            "content":"<div class=\"\"><div> <span>You knew about this world, but you had no memory of it. You also knew of this place, but not much. It seemed to be some sort of luxury resort- a theory that was confirmed when you emerged into the second room. Beyond the curious states and smirks of the dining strangers, you see a statue...<br>\r\n<br>\r\n<span style=\"font-family:impact, fantasy\"><div align=\"center\">ADONIS LUXURY RESORT</div></span><br>\r\n<br>\r\nYou had to admit, if you were going to wake up lost and alone, you might as well do it in a luxury resort. But something seemed off about this place. You were left to try to cloak yourself from the many stares as you approach the second, larger staircase.</span></div></div>",
            "created":1351659600,
            "id":1457251,
            "title":"Shorts (boy)"
        },
        "1322":{
            "author_id":"abadthing",
            "author_name":"A Bad Thing",
            "choices":[
                "Some kind of house",
                "Some kind of daycare",
                "Some kind of orphanage"
            ],
            "content":"<div class=\"\"><div> <span>It seems, in your efforts to remain unseen, you weren't paying much attention to who you were hiding from. Someone found sneaking up on you very easy- a fact they indicated to you when you felt unknown hands grab you by the shoulders. Before you could even squeal, everything went black.<br>\r\n<br>\r\nWhen you woke up, you were in...</span></div></div>",
            "created":1351659600,
            "id":1457257,
            "title":"Someone grabs you"
        },
        "13223":{
            "author_id":"tom_lady",
            "author_name":"Tom_Lady_the__Glorious_Benefac",
            "choices":[
                "Pink (TG)",
                "Red"
            ],
            "content":"<div class=\"\"><div> <span>You Awake to the feeling of your hair being stroked by someone.<br>\r\n\"There there,\" says a motherly voice, you start to try to sit up, but a firm hand pushes you back down gently.<br>\r\nYou did get a small view of the room around you though. it appeared to be a nurse's office, like one might find in a school or... or... an orphanage. A neon-ish logo adorned the woman's lab coat, it had a rainbow and several little girl cut-outs the text below.<br>\r\n<div align=\"center\"><b><font class=\"size5\" style=\"\">Little Sister's Orphanage</font></b></div><br>\r\n\"I'll make it all better,just relax.\" said the voice again as the same hand that held you down brought a glass jar filled with a coloured liquid into view.<br>\r\nWhat was the colour?</span></div></div>",
            "created":1351746000,
            "id":1457698,
            "title":"Some kind of orphanage"
        },
        "132231":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Just drink the pink liquid.",
                "Ask about the effects of the liquid first."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Honey just drink this, and everything will be perfectly fine\" the woman said, as she held the jar with the pink liquid in it up to the mouth.<br>\r\n<br>\r\n<br>\r\nWhat will you do?<br>\r\n</span></div></span></div>",
            "created":1354815840,
            "id":1482915,
            "title":"Pink (TG)"
        },
        "1322311":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "you are a 8 year old girl.",
                "you are a 4 year old girl, only wearing a wet and messy diaper."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You don't know why, but you trust the strange woman and just drink the pink liquid. Soon you lose consciousness, as you wake up you notice that<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1354918320,
            "id":1483554,
            "title":"Just drink the pink liquid."
        },
        "1322312":{
            "author_id":"yote",
            "author_name":"Yote",
            "choices":[
                "A high-class debutante",
                "A lowly servant and soldier of Fontaine"
            ],
            "content":"<div class=\"\"><div> <span>You know not to accept things from strangers and there's nothing stranger than this woman in a city in the bottom of the sea. \"What is it?\"<br>\r\n\"It is a plasmid, dear,\" the woman soothes, pressing the jar to your lips.<br>\r\n\"But what's a plasmid?\"<br>\r\n\"It is something that will help you fit in around here,\" she explains. \"You're new to Rapture, that mean's you have to find your place. But Rapture has no need for children, especially boy children. This Orphanage and this plasmid are here to usher children quickly on the great journey into adulthood, so that they can become productive, useful members of our society. So would you kindly drink it.\"<br>\r\nThat is all you needed to hear. To be an adult would be fantastic! Eagerly you take the jar and drink the thick liquid. The woman let's you go and you sit up, clutching your stomach queasily.<br>\r\n\"Just try to relax,\" she says. \"Soon you'll be remade in the image of Rapture.\"<br>\r\n<br>\r\nShe wishes to turn you into...</span></div></div>",
            "created":1371906120,
            "id":1615552,
            "title":"Ask about the effects of the liquid first."
        },
        "15":{
            "author_id":"tom_lady",
            "author_name":"Tom_Lady_the__Glorious_Benefac",
            "content":"<div class=\"\"><div> <span>Cyclone Trap: Spawns a mini-tornado which flings any Splicer who steps on it into the air.<br>\r\nElectro Bolt: Sends a jolt of electricity to electrocute an opponent or to open a few locked doors in Rapture.<br>\r\nEnrage: Causes the target to attack anyone in the near vicinity.<br>\r\nHypnotize Big Daddy: Hypnotizes a Big Daddy into thinking the user is a Little Sister, and it will protect you for a short time.<br>\r\nIncinerate! Sets the target on fire, dealing damage over time. Also ignites any flammable object in the firing radius<br>\r\nInsect Swarm: Spawns a swarm of bees which will home in on the nearest enemy, damaging them as well as distracting them from the player.<br>\r\nSecurity Bullseye: Causes all Security Devices in the area to attack the target.<br>\r\nSonic Boom: Creates a powerful burst of air in front of the user, knocking back any enemy or object caught in the blast as well as dealing them damage.<br>\r\nTarget Dummy: Spawns a ghost that distracts any enemy, allowing the user to escape<br>\r\nTelekinesis: Pulls the targeted object towards the user and allows them to throw it forward, dealing physical damage to anything it hits.<br>\r\nWinter Blast: Temporarily freezes the target, allowing them to be shattered using another weapon.<br>\r\nRescue Little Sister: Allows the player to rescue Little Sisters.<br>\r\nAnthro-TF: When combined with the DNA of an animal it will turn you into an Anthro of that animal.<br>\r\nAnimal-TF: more potent than Anthro TF, complete transformation into animal.<br>\r\nVore: Allows unhinging of the jaw, and pelvis and also expansion of the throat, anus, urethra, cervix and ribcage. Everything a good Vore Artist needs! well... except a victim.<br>\r\nUnbirther: Female only. Allows expansion of Cervix. Unbirth victims are hypnotised after their 3 day stay. there is a chance that unbirthed males with become Herm.<br>\r\nTG: Simply Genderswap, if not all formula is used, the user will become a Herm.<br>\r\nGTS: DANGER! DO NOT USE IN ENCLOSED SPACES<br>\r\nLAC: Causes slight breast expansion in females and Herms and breast growth in males. Then Lactation, milk acts as an Aphrodisiac.<br>\r\n<br>\r\nFind and invent more!<br>\r\n</span></div></div>",
            "created":1351659600,
            "id":1457182,
            "title":"Plasmid list/ Information."
        }
    },
    "info":{
        "author_id":"tom_lady",
        "author_name":"Tom_Lady_the__Glorious_Benefac",
        "brief_description":"You mysteriously arrive in the underwater city of Rapture! Transform and Fetishes Good!",
        "created":1351673700,
        "description":"<td align=\"left\" class=\"norm\">You mysteriously arrive in the underwater city of Rapture! <br>\r\nTransformations and Fetishes Encouraged!<br>\r\n<br>\r\nBadly edited chapters frowned upon.<br>\r\nAnything goes: Gay/Lesbian, Anthro, Vore, Unbirth, WG, HG, BE, TG, TF GTS, LAC, Powers, Science!<br>\r\nJust try to keep it in the City of Rapture.</td>",
        "id":1901115,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1489286100,
        "modified":1489286100,
        "pretty_title":"Would You Kindly?"
    }
}