{
    "chapters":{
        "1":{
            "author_id":"atomsize",
            "author_name":"Tinkerbell’s Lover ",
            "choices":[
                "Billy ",
                "Chloe",
                "Travis ",
                "Jeffrey",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who wakes up to their Christmas surprise?<br>\r\n<br>\r\nBilly- 10 year old boy<br>\r\n<br>\r\nChloe- 9 year old girl<br>\r\n<br>\r\nTravis- 16 year old boy<br>\r\n<br>\r\nJeffrey- 42 year old man<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1578891600,
            "id":2773264,
            "title":"Christmas Surprise"
        },
        "11":{
            "author_id":"atomsize",
            "author_name":"Tinkerbell’s Lover ",
            "choices":[
                "A blonde girl his age",
                "A 40 year old brunette",
                "A sixteen year old black girl ",
                "An eighteen year old red head",
                "25 year old brunette"
            ],
            "content":"<div class=\"\"><div> <span>Billy was not unlike other ten year old boys. He was mischievous and often likes to goof around.<br>\r\n<br>\r\nHe woke up on Christmas morning and thanked his mom and dad for his presents.<br>\r\n<br>\r\nHe got a fair amount of toys, video games and clothes. <br>\r\n<br>\r\n“Sweetie?” His mom called “Your father and I have one more present to give you.”<br>\r\n<br>\r\nBilly was intrigued thinking he had originally opened them all but his mom and dad presented him with a tiny box in Santa wrapping paper<br>\r\n<br>\r\n“Enjoy son!” His father said with a wink,<br>\r\n<br>\r\nBilly took his present onto the couch, opened up the box and was shocked. There was a tiny female in the box. <br>\r\n<br>\r\nBilly dumped the lady into his hand and realized the tiny person was...</span></div></div>",
            "created":1578891600,
            "id":2773266,
            "title":"Billy’s Christmas "
        },
        "111":{
            "author_id":"atomsize",
            "author_name":"Tinkerbell’s Lover ",
            "choices":[
                "Billy undresses Anna",
                "Billy asks Anna some questions ",
                "Billy tries to teach Anna some tricks"
            ],
            "content":"<div class=\"\"><div> <span>Billy couldn’t believe he was looking at a tiny girl in his hand. She was ten years old like him, she had bright blue eyes, long blonde hair and a pretty green dress. Billy thought she was gorgeous and couldn’t believe she was only about four inches tall.<br>\r\n<br>\r\n“Wow! A tiny girl?” The blonde girl curled up into a ball clearly nervous <br>\r\n<br>\r\n“That’s right Billy!” His dad said “Your mother and I wanted to really surprise you so we ordered you a shrinkee.”<br>\r\n<br>\r\n“What’s a Shrinkee?” Billy asked <br>\r\n<br>\r\n“Oh a shrinkee is a tiny human born with a special gene. They start their lives out normal sized but eventually they start to shrink and shrink until they become the perfect size for gifts.”<br>\r\n<br>\r\n“Wow!” Billy said lightly rubbing the shrinkee girls head. “This is so cool!”<br>\r\n<br>\r\n“Now be careful son,” his dad said “Keeping a Shrinkee is a big responsibility. Do you think you can handle it?”<br>\r\n<br>\r\n“I do!” Billy exclaimed. He then turned his attention back to the tiny girl. “Hi, I’m Billy I’m your new owner, what’s your name?”<br>\r\n<br>\r\nThe girl still sitting in Billy’s palm looked up and said “my name... is Anna.”<br>\r\n<br>\r\n“I like that name. It fits.” Billy said. “Mom? Dad? Can I take Anna to my room?” <br>\r\n<br>\r\n“Of course you can sweetie” Billy’s mom said <br>\r\n<br>\r\n“Yes!” Timmy holding Anna in his hand ran back to his bedroom and plopped on his bed still holding the ten year old blonde in his palm. <br>\r\n<br>\r\n“Alright, first things first Anna” Billy said<br>\r\n<br>\r\n</span></div></div>",
            "created":1579150800,
            "id":2774453,
            "title":"A blonde girl his age"
        },
        "1111":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "Billy finds a new dress for her",
                "Anna messes with Billy"
            ],
            "content":"<div class=\"\"><div> <span>Billy looked the tiny girl barely a couple inches tall and decided to undress her. Anna didn't protest but was a bit curious about this. Billy grabbed the back of her dress and began pulling it up. She went with it and slipped her arms out.<br>\r\n<br>\r\n\"What exactly is this for?\" Anna asked.<br>\r\n<br>\r\n\"To get a good look at you.\" Billy said.<br>\r\n<br>\r\nHe continued to undress her until she was completely naked. Anna tried covering herself but was stopped by Billy. He messed with her a bit to her pleasure. He loved his Shrunkee and how adorable she is.  He would take great care of her and she would be as happy as can be.</span></div></div>",
            "created":1580706000,
            "id":2782079,
            "title":"Billy undresses Anna"
        },
        "1112":{
            "author_id":"duolc",
            "author_name":"K4D",
            "choices":[
                "Time to change your clothes",
                "Let's go to the bathroom",
                "Let's talk more about ourselves"
            ],
            "content":"<div class=\"\"><div> <span>\"Are you hungry Anna ?\" Asked Billy whose eyes were gleaming full of expectations.<br>\r\n<br>\r\nThe tiny blonde hair girl hesitated before replying:<br>\r\n\"Not really, I had some biscuits just before coming here.\"<br>\r\n<br>\r\n\"Do you need to use the toilet right now ?<br>\r\nCan you still do it even though you're so small ?\"<br>\r\nBilly wanting to know more about the lifestyle of a Shrinkee.<br>\r\n<br>\r\n\"I can't go to the toilet like before.<br>\r\nEverything is so big now.<br>\r\nMy family has thrown me away because I'm now a Shrinkee.\" Replied Anna who started crying out loud.<br>\r\n<br>\r\nBilly was startled by her reaction and tried to appease her but nothing worked.<br>\r\nAnna was letting out lots of tears.<br>\r\nThe boy picked up tissues and gave it to her.<br>\r\nAfter some time passed, Anna was able to regain her calm.<br>\r\n<br>\r\n\"I'm sorry for soaking your hands.<br>\r\nPlease don't abandon me.\" Said the tiny girl with her eyes still red after crying a lot.<br>\r\n<br>\r\n\"I won't abandon you, Anna.<br>\r\nI am now your owner so I'll be sure to take good care of you. Just trust me.<br>\r\nI'm a Big boy who can handle any responsibility. \" replied Billy while using his finger to gently rub on her head.<br>\r\n<br>\r\n\"So how do I call you ?\" said Anna who was getting used to the boy.<br>\r\n<br>\r\n\"Just call me either Billy or Owner.<br>\r\nWait it's better to praise me as a Master.<br>\r\nYep Master sounds better and more cool.<br>\r\nI'll treat you very well if you follow my orders.<br>\r\nDon't worry I'll even share some of my favorites if you do well.\" Said Billy with a confidant voice.<br>\r\n<br>\r\n\"If that's how it is then I guess it's a great honor to serve you now Master.<br>\r\nSo what do you want to do now ?\" Asked Anna who was now smiling and started giggling.<br>\r\n<br>\r\n\"I guess my first order should be ...</span></div></div>",
            "created":1581138000,
            "id":2784252,
            "title":"Billy asks Anna some questions "
        },
        "112":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "\"I don't like that name.\" ",
                "\"I want to take your clothes off.\" ",
                "\"I want you to be my girlfriend.\" ",
                "\"I want to play with you.\" "
            ],
            "content":"<div class=\"\"><div> <span>Billy looks inside the box to find a forty year old woman with long brown hair and a curvy figure. Billy's face lights up as he reaches inside taking her out. <br>\r\n<br>\r\n'Thank you so much!\" He smiles without taking his eyes off her. \"I love her already.\" <br>\r\n<br>\r\nThe woman turns bright red before speaking up. \"Please don't hurt me.\" <br>\r\n<br>\r\n\"I'll only hurt you if you are naughty.\" Billy says with a frown. <br>\r\n<br>\r\nThe woman whimpers and slowly nods making Billy giggle. Billy places his finger on her head and slowly and gently runs it down her entire body. He stops at her breasts making sure to give them a gentle squeeze, Billy is happy with the size of her breasts, its going to be fun to play with later. <br>\r\n<br>\r\n\"You're very pretty.\" He smiles. <br>\r\n<br>\r\n\"Um, thank you.\" The woman blushes hard. <br>\r\n<br>\r\n\"I'm billy, whats your name?\" He asks. <br>\r\n<br>\r\n\"I'm Tracy.\" She says softly. <br>\r\n<br>\r\nBilly smirks as he looks at her, Tracy trembles a bit knowing that expression wont lead to something good. </span></div></div>",
            "created":1586322000,
            "id":2815805,
            "title":"A 40 year old brunette"
        },
        "1124":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "Billy removes the rest of her clothes ",
                "Billy removes his clothes ",
                "Billy is called downstairs ",
                "There's knock at the door ",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to go and play with Tracy in my bedroom.\" Billy smiles without taking his eyes off her. <br>\r\n<br>\r\n\"Okay honey,\" His mother says. \"Just make sure you come back soon as your cousins will be over in a hour.\" <br>\r\n<br>\r\n\"Yes Mom.\" He smiles. <br>\r\n<br>\r\nBilly stands up and heads towards his room with Tracy in hand. Tracy closes her eyes and whimpers terrified what this ten year old boy is going to do to her. She is hoping that because he is so young he wouldn't know too much about sexual things. <br>\r\n<br>\r\n\"Here we are Tracy.\" Billy smiles entering his bedroom. <br>\r\n<br>\r\nBilly smiles as he sits down on his bed holding Tracy up to his face. The tiny woman looks up at him with terror. Billy laughs and gives her shirt a bit of a tug. <br>\r\n<br>\r\n\"What are you doing?\" Tracy whimpers. <br>\r\n<br>\r\nBilly ignores her squeals and rips her shirt off her with no much effort. Tracy yelps and tries to cover her breasts. Billy frowns and flicks her hands away before pinning them to her side. Tracy whimpers as her arms feel a little sore. Billy smirks before ripping Tracy's bra off as well leaving her breasts exposed to the young boy. Tracy turns bright red and looks away. <br>\r\n<br>\r\n\"Wow,\" Billy gasps as he gives her breasts a squeeze. \"I like you boobies.\" <br>\r\n<br>\r\nTracy turns bright red at the comment not sure what to say that. She bites her bottom lip as his fingers begin to travel all over, his fingers are very smooth and they glide over her nipples. <br>\r\n<br>\r\n\"Stop!\" Tracy groans. <br>\r\n<br>\r\nBilly smirks and just ignores her. Tracy tries to squirm out of his grip but he is too strong for her. He continues to fondle her breasts and Tracy does her best to not enjoy it. Tracy's stomach drops as she feels herself be lifted and the boy's lips smack together. She looks up and sees that Billy had just licked his lips and is ready to open his mouth. <br>\r\n<br>\r\n\"No!\" Tracy screams. \"Don't! please!\" <br>\r\n<br>\r\nBilly opens his mouth and slides Tracy's large breasts inside his mouth, Tracy lets out a loud groan turning bright red as he continues to suck and lick her breasts. Tracy whimpers trying to scream at him to stop but all that comes out is whimpers and groans. Tears roll down her cheeks as Billy moans loudly, he is loving the taste of her and doesn't on plan on stopping any time soon. <br>\r\n<br>\r\nTracy lets out a loud squeal and ends up climaxing due to the intense pleasure she is getting on her breasts. Billy moans and removes the older woman's breasts out of her mouth with a loud pop. Tracy lets out a loud gasp and tries to catch her breath back. <br>\r\n<br>\r\n\"Wow,\" Billy moans licking his lips. \"You taste great, its a shame you peed yourself though.\" <br>\r\n<br>\r\nTracy turns bright red not wanting to correct him on what happened. It's less embarrassing for her for him to think that she had only peed herself compared to climaxing due to her breasts being sucked by a nine year old boy. </span></div></div>",
            "created":1586408400,
            "id":2816418,
            "title":"Billy and the Breasts "
        },
        "12":{
            "author_id":"atomsize",
            "author_name":"Tinkerbell’s Lover ",
            "choices":[
                "A 30 year old man",
                "A boy her age",
                "A girl her age ",
                "A 16 year old girl ",
                "A 37 year old MILF"
            ],
            "content":"<div class=\"\"><div> <span>Chloe was a very nerdy 9 year old girl. She always very curious and peppy despite having trouble making friends.<br>\r\n<br>\r\nShe is very cute at her age with blonde hair and blue eyes. She always enjoyed playing with her dolls and wanted a new one for Christmas.<br>\r\n<br>\r\nHer parents wanted this Christmas to be special for her so they decided to go online to the Shrink Site where Shrunken people are auctioned.<br>\r\n<br>\r\nThey searched for hours and finally decided who they should give to their nine year old princess. <br>\r\n<br>\r\nIt was Christmas morning, Chloe woke up in her Disney pajamas and ran downstairs to her mom and dad.<br>\r\n<br>\r\n“Chloe darling” her mom said “We wanted to get you something extra special for Christmas”<br>\r\n<br>\r\nHer dad holds out a small box. Chloe eagerly opens it and the young girls jaw drops as she realizes she’s looking at a five inch tall shrunken person who was...<br>\r\n<br>\r\n</span></div></div>",
            "created":1579323600,
            "id":2775197,
            "title":"Chloe gets a gift"
        },
        "124":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "“...I don’t like that name.”",
                "“She’s so funny, daddy!”",
                "“...wanna be girlfriends?”"
            ],
            "content":"<div class=\"\"><div> <span>Holding the box in her lap, Chloe’s jaw dropped as she saw the tiny teenager inside of it.<br>\r\n<br>\r\n“Oh, god...” The older girl groaned, before Chloe swooped and squashed her against her chest.<br>\r\n<br>\r\n“Ooh, you got me a real life dolly!” She giggled, holding her tight. “Wh-wh-what’s her name?!”<br>\r\n<br>\r\n“...whatever you want it to be, honey,” her dad just winked. Meanwhile the teen in her hands had something to say about the matter.<br>\r\n<br>\r\n“Hey! I’m not just letting some kid decide my name for me!” She cried. “It’s Alana, so call me that!”<br>\r\n<br>\r\nChloe frowned at the little teenager in her hands.</span></div></div>",
            "created":1581310800,
            "id":2785264,
            "title":"A little bigger girlfriend "
        },
        "1243":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "“But why don’t you wanna be my girlfriend?”",
                "“But that’s so sad! What was her name?”",
                "“...what if I was older?”"
            ],
            "content":"<div class=\"\"><div> <span>“Girlfriends?” Alana frowned. “I can’t be your girlfriend! You’re like half my age!”<br>\r\n<br>\r\n“Sure you can!” Chloe grinned, and squashed an enormous kiss against most of her body. “...right dad?”<br>\r\n<br>\r\n“Your dolly your rules, sweetie.”her father just dismissed, and am overjoyed Chloe dashed out of the room holding tiny Alana to her chest.<br>\r\n<br>\r\nShe charged into her bedroom and onto her bed, crossing her legs around Alana.<br>\r\n<br>\r\n“So, uh...” she giggled awkwardly at the shrunken redhead in her lap. “Girlfriends, huh?”<br>\r\n<br>\r\nAlana just frowned up at the tween. “...look, do you honestly think this is okay? I’m a human being, not your pet!”<br>\r\n<br>\r\n“You’re not my pet you’re my girlfriend!” Chloe cooed down at her. <br>\r\n<br>\r\n“...yeah sure, you’re what? 10?”<br>\r\n<br>\r\n“9...”<br>\r\n<br>\r\n“Oof, that’s even worse. L-“<br>\r\n<br>\r\n“How is that worse?!”<br>\r\n<br>\r\n“...I was just about to say before you interrupted me!”<br>\r\n<br>\r\n“Ohhhh! Sorry.”<br>\r\n<br>\r\n“Look,” Alana groaned. “I dunno about here, but where I come from it’s illegal to date a kid. And the younger the kid, the more illegal it is! So I can’t-“<br>\r\n<br>\r\n“Ohh, don’t worry about that!” Chloe interrupted again. “What’re they gonna do? Arrest you?”<br>\r\n<br>\r\n“...yes?!”<br>\r\n<br>\r\n“Wouldn’t they have to find you first?”<br>\r\n<br>\r\n“Well I guess...?”<br>\r\n<br>\r\n“And I’m not gonna tell anyone? Are you?”<br>\r\n<br>\r\n“Ugh, that’s not the point!” Alana threw her arms up at Chloe. “I’m breaking the law by just sitting here with you, pretty much! Anything we do together is just... wrong!”<br>\r\n<br>\r\nChloe just looked down at the tiny girl in her lap. “...so does that mean you don’t wanna be girlfriends?”<br>\r\n<br>\r\nAlana groaned. “I never really did, if I’m honest! Besides, I already had a girlfriend before your lovely dad took me away from her!”<br>\r\n<br>\r\nAlana stopped raging for a moment to notice Chloe’s giant sniffling. Rubbing at her cheeks and spluttering loudly, she realised she probably shouldn’t piss off the giant.<br>\r\n<br>\r\n“But...” Chloe spluttered,</span></div></div>",
            "created":1581742800,
            "id":2787503,
            "title":"“...wanna be girlfriends?”"
        },
        "14":{
            "author_id":"atomsize",
            "author_name":"Tinkerbell’s Lover ",
            "choices":[
                "A 37 year old woman ",
                "A 12 year old girl ",
                "A 24 year old woman ",
                "A 16 year old girl ",
                "A pair of 15 year old twin girls "
            ],
            "content":"<div class=\"\"><div> <span>Jeffrey didn't have the most glamorous life. He lived in a trailer park with his trashy wife Jaime, and their 1 year old son Toby. <br>\r\n<br>\r\nThe trailer was disgusting and Jeffrey hated his job as a plumber, partially because he wasn't very good at it. <br>\r\n<br>\r\nHe was a scruffy looking guy with an alcohol problem living in a trailer park. He wasn't fat persay but he did have a beer gut from drinking so much alcohol. <br>\r\n<br>\r\nIt was Christmas in Jeffrey's Alabama home. His wife got him a cheap bottle of booze, he couldn't get his wife anything or for his kid which caused Jaime to get mad and storm off for a while like she normally does. <br>\r\n<br>\r\n\"Damn bitch. At least she got me this whiskey.\" Jeffrey unbuckled his pants, plopped down on his couch, turned on the TV and started drinking his whiskey but to his surprise he noticed there was a tiny Christmas present underneath their cheap tree. He scratched his head in confusion.<br>\r\n<br>\r\n\"How did I miss that one?\" He picked it up and read it \"<i><b>To Jeffrey from Anonymous</b></i>.... That's weird.\" <br>\r\n<br>\r\nJeffrey took off the tiny ribbon and popped open the box, he heard a tiny voice echo out of it, causing him to scream in surprise. <br>\r\n<br>\r\n\"Aaaaaaaaaaaah!\" After the shock subsided, Jeffrey looked in the box and noticed that there was a tiny female inside.<br>\r\n<br>\r\nThis tiny female was...</span></div></div>",
            "created":1582088400,
            "id":2789924,
            "title":"Jeffrey gets an X-mas gift"
        },
        "15":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Emily, 14",
                "Cliff, 22",
                "Sarah, 13",
                "Sophie and Callie, 15 year old twins",
                "James, 19"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some more character choices</span></div></span></div>",
            "created":1581310800,
            "id":2785267,
            "title":"Other"
        },
        "151":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "25 Year old Woman",
                "16 Year old Cheerleader ",
                "A Boy Her age ",
                "A 40 Year old Woman ",
                "Someone else "
            ],
            "content":"<div class=\"\"><div> <span>Emily heads downstairs Christmas morning to see her family already down their opening presents. Emily sighs softly and just walks over, she's used to this at this point, with a family of four brothers and three sisters Emily was often forgotten. Not to say that her family didn't love her, it's more than there was too many people in the house to keep track of at times. <br>\r\n<br>\r\nEmily is fourteen years old and is pretty shy, she often spends time by herself reading or watching movies. While Emily was a shy girl she did have a few friends who would try to help Emily out by getting her out of her comfort zone. <br>\r\n<br>\r\nEmily sits on the couch and opens her presents. She opens them all happy with what she had got. Emily looks over to see her bothers and sisters smiling and plying with their presents. <br>\r\n<br>\r\n\"This is from your Dad and I.\" Emily's mother says handing her a box. \"Merry Christmas sweetie.\" <br>\r\n<br>\r\nEmily looks at it a little confused, this looks unlike her other presents she has gotten. Emily's heart skips a beat when she sees the tag accidentally hanging out, it's the company logo of the Shrinkee foundation. Emily smiles widely, she can not believe that she had gotten a Shrinkee for Christmas, she had asked her parents months ago and she was told that they would cost too much. <br>\r\n<br>\r\nEmily lets out a little squee and tears into the present, she opens the lid to look inside to see what tiny she had gotten. </span></div></div>",
            "created":1581829200,
            "id":2788006,
            "title":"Emily's Christmas "
        },
        "1511":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "Girlfriend ",
                "Pet",
                "Toy "
            ],
            "content":"<div class=\"\"><div> <span>Emily opens up the box and looks inside to see a twenty five year old woman curled up at the bottom of the box. Emily smiles widely down at the woman, she had to admit that she looked beautiful. long blonde hair and a curvy figure. Emily smiles and reaches in curling her fingers around the woman. Emily giggles a bit when she picks her up as she feels that she’s only about eight inches tall. The woman looks up at Emily with a whimper and covers her ears. <br>\r\n<br>\r\n\"What's wrong?\" Emily asks. <br>\r\n<br>\r\nThe woman doesn't answer, she just flinches and palms her ears hard. Emily realises that the room must be too loud for her as her family is all talking over each other and some are yelling. Emily stands up and takes the tiny woman back to her bedroom. <br>\r\n<br>\r\n\"Sorry about the noise.\" Emily apologies and places the woman on her desk. <br>\r\n<br>\r\n\"It's okay.\" She whimpers.<br>\r\n<br>\r\nEmily sits down on the chair in front of the tiny woman and smiles just marvelling at her new girl. The girl smiles and blushes a bit as the teen girl's eyes travel over her body. <br>\r\n<br>\r\n\"So I guess I'm your Shrinkee?\" The woman smirks. <br>\r\n<br>\r\n\"I guess so. I'm Emily.\" She smiles and holds out her hand to introduce herself. <br>\r\n<br>\r\n\"Brittany.\" She smiles softly. <br>\r\n<br>\r\n\"Such a pretty name for such a pretty girl.\" Emily smiles. <br>\r\n<br>\r\n\"Thanks.\" Brittany giggles and blushes. \"You're very pretty too,\" <br>\r\n<br>\r\n\"Thanks Brittany.\" Emily coos. \"You're so sweet,\" <br>\r\n<br>\r\nEmily leans in and kisses Brittany's tiny face, she blushes and lightly kisses back making Emily giggle and blush. <br>\r\n<br>\r\n\"Can I ask how old you are?\" Brittany asks nervously. <br>\r\n<br>\r\n\"I'm fourteen,\" Emily says. \"But I'm fifteen in January, how old are you?\" <br>\r\n<br>\r\n\"I'm twenty five.\" Brittany says, <br>\r\n<br>\r\n\"Wow,\" Emily gasps. \"I never thought I would get a older woman.\" <br>\r\n<br>\r\n\"Excuse me?\" Brittany giggles. <br>\r\n<br>\r\n\"I didn't mean you are that old,\" Emily laughs. \"I was meaning that you are older than me that's all, when I saw the Shrinkee box I thought I was going to get someone my age or a year older that's all, I'm sorry.\" <br>\r\n<br>\r\n\"It's fine,\" Brittany laughs a little. \"I was only teasing. So what's your status for me?\" <br>\r\n<br>\r\n\"Huh?\" Emily asks. <br>\r\n<br>\r\n\"Status, what is it you want from me?\" Brittany asks. \"Every Shrinkee gets a status form their new owner, it can be anything from pet to girlfriend, toy or just nothing if you wanted.\" <br>\r\n<br>\r\n\"I don't want to just keep you as nothing,\" Emily says, \"You are special to me.\" <br>\r\n<br>\r\n\"Thanks.\" Brittany blushes. <br>\r\n<br>\r\n\"So how do you know so much about Shrinkees?\" Emily asks. <br>\r\n<br>\r\n\"isn't it obvious enough?\" Brittany giggles pointing down at herself. <br>\r\n<br>\r\n\"That's not what I meant.\" Emily laughs. \"I mean how do you know so much about the Shrinkee system?\" <br>\r\n<br>\r\n\"I've been there for a couple of years,\" Brittany says. \"I'ver over heard so many conversations and read some of the books the company leaves lying around.\" <br>\r\n<br>\r\n\"I'm so sorry,\" Emily says. \"I f I makes you any better I know you'll be so much happier with me.\" <br>\r\n<br>\r\n\"Thanks, I'm sure I will be.\" Brittany smiles and blushes. \"So what's your status for me?\" <br>\r\n<br>\r\nEmily sits back and takes a good long think. What status does she want to give Brittany?</span></div></div>",
            "created":1582174800,
            "id":2790315,
            "title":"Emily's Brittany "
        },
        "1514":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "\".....girlfriend.\"",
                "\"......friend.\" ",
                "\".....Toy.\"",
                "\"..... pet.\""
            ],
            "content":"<div class=\"\"><div> <span>Emily looks in the box only to find a older woman curled up at the bottom looking like she's about to cry. Emily reaches in curling her fingers around her waist and pulls her out of the box with a large smile. The woman looks to be in her early 40s with long black hair, a thin figure and a decent pair of breasts. <br>\r\n<br>\r\n\"Wow.\" Emily gasps gently patting the woman's head. \"You're so pretty.\" <br>\r\n<br>\r\nThe woman smiles a little then turns bright red trying to avoid Emily's giant eyes. Emily giggles and turns the woman's head back to face her. <br>\r\n<br>\r\n\"We are going to have so much fun,\" Emily smiles. \"I promise I'll take good care of you, I'll feed you, care for you and love you.\" <br>\r\n<br>\r\n\"Thank you.\" The woman whispers with a faint smile. <br>\r\n<br>\r\nEmily giggles and holds the woman to her chest hugging her. Emily smiles as she feels her snuggle into her chest. While Emily wasn't expecting to have such a older woman as her Shrinkee she didn't mind at all, she could make it work. <br>\r\n<br>\r\nEmily brings the woman up to her face with a large smile. <br>\r\n<br>\r\n\"Sine you aren now mine I want you to be my....\"</span></div></div>",
            "created":1586322000,
            "id":2815795,
            "title":"Emily's older Shrinkee "
        },
        "154":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "“One for each of you.”",
                "“But you’ll have to share him.”",
                "“But you’ll have to share her.”"
            ],
            "content":"<div class=\"\"><div> <span>Sophie and Callie shared just about everything, from clothes to their social lives to their bedroom. Sometimes it was a bit of a drag, like whenever you needed privacy and your twin was just there, staring at you with the sole purpose of making it awkward, but on the whole the girls got along well.<br>\r\n<br>\r\nCome Christmas time, the girls’ mother had arranged for a ‘very special’ present for them both.<br>\r\n<br>\r\n“Since you’ve been so good this year,” she beamed. “Your father and I have chipped together, and got you this.”</span></div></div>",
            "created":1581742800,
            "id":2787507,
            "title":"Sophie and Callie, 15 year old twins"
        },
        "1543":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "12 year old named Emma",
                "14 year old named Yukiko",
                "22 year old named Katie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“We could only afford the one, I’m sorry,” the girls’ mother explained. “But I’m sure you can both be responsible and share her, right?”<br>\r\n<br>\r\nThe lid came off the box, revealing a</span></div></span></div>",
            "created":1582520400,
            "id":2792064,
            "title":"“But you’ll have to share her.”"
        }
    },
    "info":{
        "author_id":"atomsize",
        "author_name":"Tinkerbell’s Lover ",
        "brief_description":"Someone wakes up on Christmas morning and receives a shrunken person",
        "created":1578943020,
        "description":"<td align=\"left\" class=\"norm\">Someone wakes up on Christmas morning and receives a shrunken person (3 to 6 inches tall)<br>\r\n<br>\r\nRULES <br>\r\n<br>\r\nNo male on male interaction<br>\r\nCharacters cannot grow or shrink more <br>\r\nMales characters can be no younger than 8<br>\r\nFemale characters can be no younger than 9<br>\r\n</td>",
        "id":2210209,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1586483280,
        "pretty_title":"Shrinkee for Christmas"
    }
}