{
    "chapters":{
        "1":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "America",
                "Japan",
                "France",
                "Somewhere else",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tila Tequila is where??? Or is it someone else??</span></div></span></div>",
            "created":1226725200,
            "id":664065,
            "title":"Where or who??"
        },
        "11":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "choices":[
                "100 feet tall",
                "500 feet tall",
                "1000 feet tall"
            ],
            "content":"<div class=\"\"><div> <span>Tila was walking downtown in los angeles one afternoon shopping around for some new outfits for an upcoming event. It was very hot right now and Tila decided to get herself a drink. She purchases a bottle of water from the vending machine and sits down for a quick break. Tila takes a drink of the water, then making sure nobody is looking, pours a little down her cleavage.<br>\r\n<br>\r\n\"Ahhh...getting a little hot down there...\" Tila said. She finishes off the rest of the water then tosses the bottle into the trash bin nearby. A few seconds later, Tila begins to feel dizzy and sits on a bench. Suddenly, her muscles began to tighten and she noticed everything around her was starting to change. Getting smaller in fact.<br>\r\n<br>\r\n\"Whats happening?!\" She said. It must of been something in that water she drank thats causing this. Everyone around turned their attention to the growing woman. All Tila could do was watch helplessly as she got bigger and bigger until she reached,</span></div></div>",
            "created":1226811600,
            "id":608346,
            "title":"America"
        },
        "112":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Continue to grow",
                "begins to move",
                "takes her clothes off"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She looks around to see all the people looking at her. She then....</span></div></span></div>",
            "created":1230354000,
            "id":625201,
            "title":"500 feet tall"
        },
        "1121":{
            "author_id":"sweetsurrender",
            "author_name":"GrowthLover",
            "choices":[
                "1500 feet...And hungry",
                "2000 feet...and still growing",
                "The cum has side effects for those who drink it"
            ],
            "content":"<div class=\"\"><div> <span>Tila noticed a wetness between her legs. She walked up to a building...and was about half its height at 500 feet. She was so aroused by her hot, giantess body, and thousands of people at her feet that she flung off her clothing [if any remained], and ground her bare, wet pussy up against the cold steel. That sent shivers up her spine...<br>\r\n<br>\r\nShe faced the steel skyscraper, and noticing a bus below, picked up the 50 foot long vehicle and rubbed it around her sex, inserting it partway in. She rubbed her assets against the glass and steel of the skyscraper, moaning as the bus got covered in slick, slick cum...<br>\r\n<br>\r\nTila Tequila was growing, although she did not notice it at first, but it became hard to ignore as the bus seemed to slip further and further in, until she inserted it completely. She felt her vaginal walls contract around it, her powerful, vaginal muscles forcing the steel phallus to conform to their demands...She felt her breasts sliding up the steel structure, even while standing completely still...and screamed with pleasure as she felt a few humans inside being sacrificed to her mighty tits.<br>\r\n<br>\r\nAt this point she was 900 feet tall and still growing...the contractions grew faster as she ground her pussy into the building once more...She was 1000 feet tall...she pumped her own fingers in and out...<br>\r\n<br>\r\nAnd came with a scream as her body surged in growth. Cum flowed like a waterfall from her cunt.<br>\r\n<br>\r\nShe passed out...<br>\r\n<br>\r\nHow big is Tila Tequila when she wakes up?</span></div></div>",
            "created":1252558800,
            "id":758552,
            "title":"Continue to grow"
        },
        "11212":{
            "choices":[
                "Keeps growing",
                "Stops growing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She wakes up at 2,000 ft tall.  She looks around and is right where she was before.  She still keeps growing, though.  By now she might be 3,000 ft tall.  She looks around more observantly and realizes an army trying to destroy her.  She...</span></div></span></div>",
            "created":1263790680,
            "id":821950,
            "title":"2000 feet...and still growing"
        },
        "112121":{
            "choices":[
                "She wakes up STILL GROWING",
                "She wakes up normal sized"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She is now 5,000 ft tall, and the army is nothing compared to her.  By now, everyone in the city is running away, and the army has given up. She suddenly has a sharp pain in her back.</span></div></span></div>",
            "created":1263790860,
            "id":821951,
            "title":"Keeps growing"
        },
        "1121211":{
            "choices":[
                "Growing so much, atmosphere not allowing oxygen",
                "Stops growing"
            ],
            "content":"<div class=\"\"><div> <span>She quickly looks around seeing that the skyscrapers are now barely an inch tall compared to her.  She is now over 50,000 ft tall.  Someone had tried to stop the growth process, but it made it quicker.  After being conscious for a couple minutes, rampaging violently, she has already tripled in size.</span></div></div>",
            "created":1263791160,
            "id":821954,
            "title":"She wakes up STILL GROWING"
        },
        "1122":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "choices":[
                "Walk down the street",
                "Test her new powers",
                "Demand worship!"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my God!\", she shouts out as she looked at her surroundings. She was a true giantess. Her glance met the ground where hundreds of people ran in panic of this titanic beauty. She turned around. It was an immense display of power as she still moved so gracefuly as if nothing had happened. Her right foot, still in her white pumps moved and pushed a couple of cars aside before she finaly crushed them under her sole with minimum effort. Probably she wouldn't even had noticed if there wasn't this awful sound of bending metal and the crunching of compacting plastic and shattering glass. She checked what she had stepped on and smiled. \"Whoops. Guess my insurance won't come up for that!\" <br>\r\n<br>\r\nShe decided to...</span></div></div>",
            "created":1230872400,
            "id":628365,
            "title":"begins to move"
        },
        "11221":{
            "choices":[
                "They're heading for her vagina"
            ],
            "content":"<div class=\"\"><div> <span>At time time she want to share her happiness. The happiness of being a giantess. She find out she wants to do it with no reason. Maybe it is the thing called subconscious. Anyway, she still walk down the street. Each step carelessly kill and crush about 50 people. As she walk around she find the pumps and clothes uncomfortable for her. The people around see as this gigantic beauty take off these weapons and drop them on the road crushing people underneath it. Some people follow her to watch her perfect tits, pussy and feet while some enjoy the sweet scent from her underwear. Even several people tries to climb her body. She looks at them, pondering where they will go.</span></div></div>",
            "created":1230958800,
            "id":628527,
            "title":"Walk down the street"
        },
        "112211":{
            "choices":[
                "She make cum above them",
                "She simply insert them in"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm... you want my pussy right? How exciting it is!\" She smiles as she sees them climbing up. It just make her mind fulfilled with sexual lust. And suddenly a feeling of heat comes from her belly. White vaginal fluid(cum) start to be visible on cunt's view. It begins from drop to flow as she feel more excited. People climbing cannot avoid it, and feel the legs very slippery. People down the cunt watching it enjoys cum a lot even its amount falling corrodes the ground, crushing and flooding some of them. They start to taste the cum, and find the cum indescribably tasty. She turns back and watch them doing so. \"I hope you'll enjoy it as there are more coming for you!\"</span></div></div>",
            "created":1230958800,
            "id":628530,
            "title":"They're heading for her vagina"
        },
        "1122112":{
            "choices":[
                "Let's go back to Tila Tequila",
                "Continue with his view"
            ],
            "content":"<div class=\"\"><div> <span>She make her decision with hesitate, that is to lie down and satisfy herself before any people can escape from where her body lands. As her back touches the ground a loud sound of squishing can be heard. The ground become concave and shakes hard as if it is an earthquake The others start running from her but the thought is destroyed as they can't control themselves from this beauty. Tila Tequila enjoys herself as she uses a hand to support her cunt facing the sky, and start using feet to \"fish\" some human into the vagina she opens with another hand. Most people are crushed between the toes as she is too excited, and some of them missed the pussy and face their death by falling on the ground.<br>\r\n<br>\r\nOne of them watch as the hoist grab and lift a people up. This time she doesn't succeed, and he is crushed into flesh and blood debris raining after a moan. And after that she do this to that man. He screams loud and struggle futilely while every single human watch the event silently. He overlooks the ground and see it smaller and smaller, and now over the drooling cunt as if it welcomes him. It is filled with white liquid going up and down, and sticky cum formed of web. The web even exists out of it. It puff hot, asphyxiating air as if it is a chimney. The cum blow some bubbles following the rhythm the cunt breaths, which makes it more horrified. Suddenly he feel the pressure from toes weaken which presents he is gonna be dropped. \"I hope you enjoy it!\" <br>\r\n<br>\r\nShe stretch her toes and let him fall at once. He scream and struggle midair until he hit something. He find himself on something like inside a giant red well, but this one is different. It is hot like desert, and breathing air here is hard. The walls are rough and very slippery. Down there isn't water... it's some kind of white liquid, which is very sticky. He tastes it and finds it pretty good. While he is enjoying the rest of it, he find the top, where should be the exit, seal up slowly. It become blackout inside, and the temperature is raising gradually.</span></div></div>",
            "created":1230958800,
            "id":628540,
            "title":"She simply insert them in"
        },
        "11221121":{
            "choices":[
                "People give her one big enough",
                "Sorry, no mirror for you"
            ],
            "content":"<div class=\"\"><div> <span>\"Finally I make it. That was fun! I should train myself more on it\" She finishes enjoying it. And now she can't wait to get the rest of people inside. It's too easy for her as her beauty overwhelms their mind, which means they will do anything she says. She take a good pose and move her body to lying to sitting, with legs spread wide. She turns back looks at the crater she just caused. It is too attractive that it even can make people in love with it. By looking at thousands of people who will become nothing but her sex toy, her cunt react weird and crush the man here before, then opens wide without any force. She want a mirror - look exactly at her cunt!</span></div></div>",
            "created":1230958800,
            "id":628543,
            "title":"Let's go back to Tila Tequila"
        },
        "112211211":{
            "choices":[
                "She keep them alive",
                "She make a easy, small but destructive orgasm"
            ],
            "content":"<div class=\"\"><div> <span>The people just get in love with her, and start in search of mirror as soon as possible. And fortunately they find one as large as a house nearby. They transport it carefully to her. She looks at her drolling vagina - it's a hairy monster that has a mouth full of cum, and muscles that unleash wild force that everything has to give way. \"Now everyone please queue up and walk in it one by one.\" She start to enjoy this which is exciting even by just thinking of it. She watches the whole scene as people going in the cunt while the vagina is active, and they fill all space, shaking with force like masterbating and the cunt is full. Every time it happens she use her huge forefinger to push the crowd further. Perhaps some of them inside are crushed, or perhaps the cunt is an abyss. She continues it with thousands of people, which costs her for hours. After every single human are stuffed inside, she push the entire crowd one more time, and the labia closes. She carefully move her body and stand up so as to prevent the cunt give pressure to them. And then she start to ponder - keep them here until I finish my job, or just finish them off with a orgasm, and see what they become?</span></div></div>",
            "created":1230958800,
            "id":628550,
            "title":"People give her one big enough"
        },
        "1122112112":{
            "choices":[
                "She walks further into the city"
            ],
            "content":"<div class=\"\"><div> <span>She can't resist it anymore. All she can do is just to squish everything inside as hard as she can at the moment of orgasm. The orgasm comes, she use all her strength on the cunt as if she's urinating, and it ends with a harsh sound of squishing. She open the labia again and let the product come out - no flesh or bones, just cum that can form a river, and some red spots floating on it. She look at it, sweating, which only increase her dirty lust more. \"That one was reeaaaaally fun... that I can't tell how fun it is. This place should be hollow now with buildings only. I need to find somewhere else to continue.\"</span></div></div>",
            "created":1230958800,
            "id":628551,
            "title":"Finish them off"
        },
        "11221121121":{
            "choices":[
                "It's time to fill the stomach"
            ],
            "content":"<div class=\"\"><div> <span>It's not hard to identify the way to the city as the buildings are much taller. She continue making her way while people and vehicles on the way begin to run from her instead of staring at her, and goes into the city which is gonna turn into chaos. Each step crushes numerous people and create a footprint crater. Small house are stomped and obliterated into debris in just a simple step. For bigger buildings, she step over and pass them while her dripping cunt leave drops of cum on the roof which flows down the buildings and fill in the upper floors. The other drops hit directly on the ground, crushing stuff nearby. Some lucky ones survive from it but get stuck with these sticky liquid and lost control of body. Each drop contains cum over gallons as if it can flood the whole city, and also leaving a trail. It's such a great destruction by sex that nothing on the path can resist it. As time passes, she becomes much hornier and hornier, which increase the amount of cum drops. Part of the city has already become cum pool with lots of people stuck inside. She continues until she notices skyscrapers nearby. On there the population is even more dense than the place she went. And she feels she need something...</span></div></div>",
            "created":1230958800,
            "id":628555,
            "title":"She walks further into the city"
        },
        "112211211211":{
            "choices":[
                "She grows to a size that fit with her lust"
            ],
            "content":"<div class=\"\"><div> <span>Her stomach is rumbling. It has been hours before she ate anything, and now finding for food has no difficulty, but it may be not enough. She doesn't care about it, and start grabbing handfuls of people and let them roll from palm to the mouth, or just directly to throat as if she is a hungry monster who eat millions of people a day. People run toward all sides and try to escape, but grabbed and eaten in less than a minute. Each handful of human contains hundreds of them. Some hide into skyscrapers, merely try to hide. She continues her hunt while the excite bring her cunt to small, unnoticeable orgasm and flowing cums like a water tap. Thousands of unlucky civilians are crushed unawarely under her soles, or got stuck with the cum raining above. She lose control of herself and rush like a bull until the stomach is full - with nearly hundred thousand people inside. It can keep her from hunger for at least a month. And she turns back to normal, examining her work. It is satisfying, but her lust tells her to deal with the buildings filled with crowds.</span></div></div>",
            "created":1230958800,
            "id":628560,
            "title":"It's time to fill the stomach"
        },
        "1122112112111":{
            "choices":[
                "She start on fucking the buildings",
                "Goes on complete rampage!!!"
            ],
            "content":"<div class=\"\"><div> <span>She look at the buildings and do nothing, as skyscrapers are too big for her in this size. She just wonders if she can grow bigger and make them available for her to toy with, and she find the world shrinking just like what she wishes for. The process is rather slow, and at the same time her foot start to stretch and push the ground outward causing nearby land to be collided and cause weird things underground that doesn't affect the city, for now. The cunt can now swallow more - and the cum production becomes much faster and drips more frequently. Her tits change into a perfect size - not too big, not too small. Her body become more flawless, and make her a beauty that is close to a goddess. She look carefully at the buildings and find them much smaller. Human are now ant-sized, which make her feel that they run as if they are little ants comparing to her, and trying to hide in anthills made by them which they think it's safe, but it doesn't, as a 1200 feet goddess is here taking their lives away.</span></div></div>",
            "created":1230958800,
            "id":628570,
            "title":"She doubled her size"
        },
        "1123":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "choices":[
                "Destroy stuff",
                "Eat first",
                "Get nasty"
            ],
            "content":"<div class=\"\"><div> <span>Tila Tequila smiles then decides to take all her clothes off except for her bra and undies ((for now)). She removes her pink tank top and wrings it over a nearby skyscraper. All the people within the building screamed as they were suddenly enveloped in darkness. Next she takes off her white high heels and purposely drops them on a crowd of people below. They were a little stinky since she was wearing them all day. Next she then slowly begins to work down her tight denim shorts.<br>\r\n<br>\r\n\"Mmmmm...\" Tila moans as she drops her shorts to the ground and kicks them aside. Because the shorts were a little heavier than Tila's tank top they destroyed a couple of buildings when coming to a rest in the middle of the block.<br>\r\n<br>\r\n\"Ahhhhh...Now thats better..\" Tila says in her powerful voice that drowns out all the thousands of screams from the little people below!<br>\r\n<br>\r\n\"Yes. This is a dream come true! Maybe their is a god out there after all hahaha! So, what should I do first?\" Tila thinks for a moment and decides to,</span></div></div>",
            "created":1230958800,
            "id":628660,
            "title":"De-clothing giantess"
        },
        "11232":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "choices":[
                "Tila notices the army moving in",
                "Tila wants to be worshipped"
            ],
            "content":"<div class=\"\"><div> <span>Tila Tequila rubs her stomach and looks down at the people below.<br>\r\n<br>\r\n\"Mmmm. I need to fill up before I have some fun with this city. And I think you folks will do just fine.\" Tila said and smiled evily! People begin to panic even more and run for their lives as Tila's massive hand descends! Tila manages to grab an unfortunate woman standing by her feet and bring her up to her face. The young woman crys and curls up in a ball as Tila licks her lips!<br>\r\n<br>\r\n\"Mmmm you look Yummy.\" Tila said before dumping the girl into her mouth and chewing her up.<br>\r\n<br>\r\n\"Mmmmm. Good. But that will never do. I need more!\" Tila said then reached down once more, grabbing a handful of fifteen people! They squirmed and screamed within her grasp as Tila opens her mouth wide. She then deposits the doomed people into her mouth and begins to chew.<br>\r\n<br>\r\n\"Mmmmphh...Definatly doesnt taste like chicken. More like Steak with A1 sauce.\" Tila said with a mouthfull. Of all the fifteen people only two managed to avoid Tila's massive molars. The two victims were buried in a sea of guts and gore for a moment just before Tila swallowed.<br>\r\n<br>\r\n\"Ahhhhh...Refreshing. Who knew my own type could taste so good?\" Tila said rubbing her sexy stomach once more. Satisfied for now, Tila stomps down the street and into the heart of downtown. Many people were crushed into a pulpy mess beneath Tila's massive soles as she casually strolls along.<br>\r\n<br>\r\n\"Look at you all down there. You all look like bugs from up here hahaha!\" Tila laughs and places her hands on her hips. Tila surveys the area for a little and smiles. Then,</span></div></div>",
            "created":1231045200,
            "id":628978,
            "title":"Lunch!"
        },
        "112321":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Destroys them!!!",
                "Focus on the city"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tila Tequila notices tanks coming in the streets and helicopters looking like flies.  She...</span></div></span></div>",
            "created":1268273640,
            "id":849188,
            "title":"Tila notices the army moving in"
        },
        "113":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "have some fun",
                "begin the buffet",
                "try to fulfill her pleasures"
            ],
            "content":"<div class=\"\"><div> <span>In a instant, Tila grew to immense proportions. The city in a instant became shadowed by her towering figure. Tila lost focus during the growth and looked down to see what happened. The city sprawl out around like a map. She looks down and sees her foot has grown through an apartment building. Tila stands above the city naked and at a size of nearly 1,000 feet. A few buildings come to her shoulders but the rest are knee high. She feels like in a new world with no consequences. All her dreams, pleasures, urges can be fulfilled. She decides to...</span></div></div>",
            "created":1317870960,
            "id":1201503,
            "title":"1000 feet tall"
        },
        "12":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she is shocked",
                "she doesn't notices"
            ],
            "content":"<div class=\"\"><div> <span>Throughout all of Tokyo, it is hot and busy. People rushing and going to their homes and jobs just to end the day. In the downtown area, Tila sets on a park bench where she decided to rest. She sits down where she wipes the sweat from her nice chest. As she sighs over the intense heat, she looks down to see a mosquito on her hand. As she goes to strike it, it bites her. \"Ouch\", she says as suddlenly she notices she begins to grow. She starts growing at 50ft a second. The clothes on her body begin to ripe right off showing her glorious body. Her chest is so huge that it cast a shadow over the hot and exhausted people below her. People around her around stunned and stop in shock. Traffic in all lanes of view stop or crashed. They stare at her magnificent body and have no idea what has happened. She grows to a height of 500 feet and stops.</span></div></div>",
            "created":1226725200,
            "id":607934,
            "title":"Japan"
        },
        "121":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she starts to move",
                "she sits down and play with the people",
                "goes on a pleasure rush"
            ],
            "content":"<div class=\"\"><div> <span>As Tila looks around, she can see skyscrapers and buildings, most coming to her shoulders. She looks down to see the people stare at her and wonder how this has happened. She turns to look in the windows of a office building and see herself. She is completely naked. Her body has grown to great sizes. Her tits are the size of cars now. Her body has been defined in many ways, turning her already beautiful body into a near complete giantess. She is very pleased with what she is looking at. She looks down at the people to see how tiny they are. Her body is casting a shadow on them from the summer heat. She begins to wonder what to do....</span></div></div>",
            "created":1226725200,
            "id":667900,
            "title":"Tila the new Giantess"
        },
        "1211":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she gets hungry",
                "she gets horny"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins to take her first steps. In a moment there is a scream and then nothing as 30 people as smashed into the road. The next step crushes a car into a pancake. Tila looks down and is amazed at her power. She begins to move with ease down the streets. She begins crushing cars and people as if there was none. She smiles with pleasure as she crusies down the steets. Buildings rattle with every step she takes. People stare in awe at her body even as they are about to be crushed. Tila then feels a strange feeling inside her.....</span></div></div>",
            "created":1226725200,
            "id":607943,
            "title":"she starts to move"
        },
        "12111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she continues to move"
            ],
            "content":"<div class=\"\"><div> <span>Tila gets a urge inside her that she now knows....she is hungry!!! She looks down at the thousands of people at the streets and smiles. \"Your mine!\" she says. She kneels down and begins picking up hand fulls of people and dropping them into her mouth. People begin to panic and run in all directions. Some start to get away. She kneels down and puts her head to the ground and opens her mouth. People begin to run as fast as they can in the other direction but their attempt is useless. She begins to inhale. By the dozens they flood into her mouth without a struggle. She gets up after ingulfing hundreds of people. \"Wait, don't run!\" She begins to walk down the streets as she notices people in the buildings looking at her. She turns towards the building noticing hundreds of people with their faces pressed up against the windows. She smiles and with one hand shoes it through the building. People run in all directions trying to hide in the building her hand crawls and grabs one by one and tosses them into her mouth. \"Ummmmmm...you are all delicious. I wonder what else I can use you for.\"</span></div></div>",
            "created":1226725200,
            "id":607945,
            "title":"she gets hungry"
        },
        "121111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "She gets horny"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins to move through the streets of Tokyo. Each step bringing her closer to the busy center of the city. She wonders why she is so happy. She has never felt this way before. She always wanted to be the center of attention. She always wanted to to please the world...or be pleased. NOw she can have it all. Nothing could stop her. People continued to run from her every step. She continue to move and step right over any buildings that she could. Suddently she feel an sensation that got her aroused. Drips of cum begin to drop from her cunt. Every drop that fell crushed cars and even made craters in the road. People were washed away from her little dribble. She smile and wished she could fulfill her extreme sexual desire. She turned the corner and was in the center of Tokyo. As she turned, there stood thousands of people.</span></div></div>",
            "created":1226725200,
            "id":607947,
            "title":"she continues to move"
        },
        "1211111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she gets hornier"
            ],
            "content":"<div class=\"\"><div> <span>Tila smiles as she see hundreds of people in shock, who can barely move at the sight they see in front of them. Tile sits down on the ground with her legs spread and hundreds of people in between them. The people stare at what is a huge fine cunt. \"I want you inside me, all of you!\" <br>\r\n<br>\r\nAt that moment people begin to run as fast as they could from her and her cunt. Tila puts her hands together and pushes the people closer to her. People begin screaming as they get closer to her cunt. She begins to push them by the hundreds into her cunt. She begins to moan. She begins to push more and more people into her cunt. She moans louder and louder. \"I can feel you all inside me!\", she yells. Her moans can be heard blocks away. \"Oh yeah this is fun!\" After her little orgasm, she stands up as cum and dead people fall from her cunt. \"I want so much more!\" Tila says as she approaches a major highway. Thoughts run through her head as about all the things in the world can please her. Her sexual desire grew with each thought and she wanted everything.</span></div></div>",
            "created":1226725200,
            "id":607950,
            "title":"She gets horny"
        },
        "12111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she encounters the army",
                "she plays with the city"
            ],
            "content":"<div class=\"\"><div> <span>Tila stared at the traffic on the highway. She imagined what she could do with all the vehicles. Each one to her was another play toy. Her body wanted more by the moment. The sensation of lust and pleasure grew inside her.  She spotted a city bus in the traffic. She smiled as she picked up the bus. A shadow of a hand learned over the bus. The people turned over to see a giant asian woman grabbing for the bus. People panicked and screamed but it was too late. The bus lifted off the ground and she put it close to her face. \"Owww...I hope you like what I got for you. Your going to be special.\" , she said as she grinned with amusement. The bus went down and began to insert inside her large cunt. Drips of cum began to hit the windows of the bus. It began to get hot inside as it went deeper inside.  She began to go back and forth with it slowly while moaning more and more with each insertion.<br>\r\n<br>\r\n\"Yes..yes....YES!!!\" Tila began to scream louder and louder. Each insert with deeper and deeper as she pleasured herself more and more. \"Oh there is so many of you inside me, I hope you like it!\" Tila loved every moment of it as people all around the city heard her moans and watched her. People stood in awe as they watched Tila Tequila masturbate herself with a city bus. Drips of cum began to run down her legs and run in the streets. Faster and faster she inserted it. Her body began to lurch and finally with one last loud moan, her cunt squirted a huge amount of cum that shot the bus through a office building that brought it to the ground. \"Oh Yeah, I gotta do that a lot more\" <br>\r\n</span></div></div>",
            "created":1226725200,
            "id":667886,
            "title":"Playing with traffic"
        },
        "121111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Tila ATTACKS!!!",
                "She runs away"
            ],
            "content":"<div class=\"\"><div> <span>Tila walks over to the the highway. She sits down and begins to clean herself. \"Wow, this has been a great day. I wonder what else I can do\". Suddently the sound of trucks and tanks begin to be heard in the distance. She sees hundreds of tanks and trucks full of men pulling in front of her. The men begin to dismount their trucks but let dazzled by the view in front of them. A towering asian woman with perfect beauty sitting naked with her legs opened sat in front of them. Her body stood flawless. Her breast were enormous in size, even bigger than they were in her natural size. She sat their rubbing her cunt and and brushing off the debris and dead bodies off her. <br>\r\n<br>\r\nThe army stood in formation and prepared to attack. \"Well what should I do now, there is so many of you and only one of me. I hope you are ready.\" Tila thought to herself of what to do.</span></div></div>",
            "created":1226725200,
            "id":607960,
            "title":"she encounters the army"
        },
        "1211111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Army destroyed",
                "Army's secret weapon"
            ],
            "content":"<div class=\"\"><div> <span>In one swipe, like hitting a bug her hand slammed into the ground killing hundreds and knocking more into the air. The army began to fire but their weapons harmlessly did anything to her. Tila smiled as she begin to pick up tanks. She begin to crushed them between her glorious tits. One..then two at a time began to crush into thousands of pieces. The soldiers began to hold their ground but it was too late. She layed over on the ground and opened her mouth. Her hand pushed out ward and pushed all the men into her mouth. Hundreds of soldiers screamed as their lives ended as they fell to their death. Tila stood up and licked her lips ,\"Ummm..you guys were good.\"</span></div></div>",
            "created":1226725200,
            "id":607963,
            "title":"Tila ATTACKS!!!"
        },
        "12111111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she grows again"
            ],
            "content":"<div class=\"\"><div> <span>She stands around as she looks upon the battlefield. Destruction was everywhere. News helicopters filled the sky as they reported the disaster that has taken place. Around the world, nations watched in awe as Tila Tequila stood tall with a sexual desire that couldn't be filled and a body that everyone in the world wanted to see naked and now it stood. She began to move throug the city again picking up people and rubbing them into her cunt. No one survived the attack and she moved farther into the center of the city. People ran for their lives but only ended up inside her vagina to please her. She begin to feel a strange feeling inside her as she moved about the city. Finally it happened...</span></div></div>",
            "created":1226725200,
            "id":607964,
            "title":"Army destroyed"
        },
        "121111111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Finding fun in the city",
                "Tila goes on a rampage"
            ],
            "content":"<div class=\"\"><div> <span>In a instant, Tila rose to the height of 1000 feet!!! People looked up to the sky in shock. A towering naked asian woman stood. Tila looks around as she can see all of Tokyo. She laughed as she now towered over most of the city. People below her feet looked like ants and the city was now her playground. Her tits were now the size of baseball fields. The world watched as she grew and stood in fear. All of Japan was now her little world and the people knew it. Nothing could stop her. She began to feel aroused again as thought of the once tall buildings can now be her little toys. Drops of cum began to fall from her cunt crushing people and small buildings beneath her. The people stared at her and in one sudden moment they ran for their lives. They knew there was no where to hide. They were all her little play things. Every building they tried to hide in were just a dildo or a grinding toy for her endless lust.She began to move into the city with only one thought on her mind....</span></div></div>",
            "created":1226725200,
            "id":667892,
            "title":"1000 Foot Tila!!!"
        },
        "1211111111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Finding her perfect toy",
                "run a rampage through Japan"
            ],
            "content":"<div class=\"\"><div> <span>Tila now moved through the city with chaos in her foot steps. She began to pick up people out of buildings that were staring at her and tossed them into her mouth. Small buildings where people cluddered and hid were picked up and smeared against her chest. People and debris fell from her massive tits as she moved through thr city. Drips of cum rain down and left a trail where she went. She want more and more every moment. <br>\r\n<br>\r\nShe began to stack up cars up to 20 high then jump on top of them. Some going into her ass. The seismatic wavs were felt through all of Japan. Her ass left a crater that was smooth but large enough to put a small stadium in. News helicopters began to come in closer to get a better shot. \"Oww, so you want a better shot?\" Tila began to pose for the cameras of the world. Her poses were with whole groups of people going into her pussy or kicking skyscrapers over. She continue to move until she saw what she needed in her.</span></div></div>",
            "created":1226725200,
            "id":607967,
            "title":"Finding fun in the city"
        },
        "12111111111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "continues with her toy"
            ],
            "content":"<div class=\"\"><div> <span>People begin to hear the tremors of foot steps. They didn't know what it was until they looked out the window. A giant asian woman moved directly toward the office tower. The people could only see her up to her knees as she gotten closer. She knealt down to examine the building. It was sleek, slender tower with a firm base and a pointed top with a small flat roof. She thinks to herself how great its going to be and wonders what she is missing. \"This is what I have been looking forward to all this time. I want you so bad\" She puts her face to the window to see the people inside. They are shocked knowing they can't leave but having no where to go. She begins to lick the side of the building. Her imagination begins to run wild in her head. She starts to suck on the building a little. She starts to moan as she sucks on the top of the building. She then stops to look around as people have gathered to watch her. She begins to get aroused. </span></div></div>",
            "created":1226725200,
            "id":607971,
            "title":"Finding her perfect toy"
        },
        "121111111111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Looking for more fun",
                "finds a bullet train"
            ],
            "content":"<div class=\"\"><div> <span>Tila wanted this to be the best ever, or for the next five minutes until she finds something else. She begins to grab the people around the tower and places them on top. \" You will be so perfect for me, I hope you like whats coming for you\", she giggles. She then squats over the tower and ease down slowly onto the tower. The people scream inside her as they are swallowed. She begins to get aroused as she feels the people move around inside her. \"Oh yeah I can feel you all inside me\". She begins to move up and down more and more. The tower goes deeper with each  lurge. She moans louder and louder as she continues to fuck the tower. The ground rumbles in her orgasm  <br>\r\n<br>\r\nPeople inside the building begin to sweat as they heat up inside her cunt. Cum runs down the side of the building. Her moans get louder and begins to shatter nearby windows. She goes faster and faster. More and more as she goes. \"OH YES!!!! I WANT YOU ALL INSIDE ME!!\"  Finally the building gives way as her body lurches in her orgasm. As she stands up, nothing is left but debris and cum. <br>\r\n<br>\r\n\"That was amazing, I should do that alot more often\". Tila looks across the city and sees more buildings like the one she just fucked and a smile runs across her face. \"Its going to be a good day, I hope you are all ready\", she yells across Tokyo.</span></div></div>",
            "created":1226725200,
            "id":607974,
            "title":"continues with her toy"
        },
        "1211111111111112":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "goes to the port",
                "goes to airport"
            ],
            "content":"<div class=\"\"><div> <span>Tila starts walking through the city when she hears a sound. She looks over to see a train track. Farther down the tracks is a high-speed bullet train. Tila smiles as she notices what is coming towards her. She walks over to the tracks in a hurry, destroying everything in her path. Whole buildings are wiped out as she walks right through them. She stands over the tracks and sits down on them. She settles herself into position and smiles as she waits for an experience of an life time. <br>\r\n<br>\r\nHundreds of people are crowded in the busy train. Over 200 miles a hour it goes along its path trying to flee the chaotic city. The people look across the city to see the destruction that have been brought. The people are frightened to see buildings covered in cum and half eaten people lying in the streets. As they look along in front of the train they scream at the site before them. Tila Tequila is sitting along the tracks with her legs open. The tracks are set to go right into her cunt. The people on the train panic and they try to stop it but its too late. She grins over the train as it gets closer and closer. Finally the train rails right into her cunt. Tila lets out a huge moan that shatters glass windows all over the city. Her orgasm is insane as her lege lift right off the ground. Her eyes roll to the back of her head as the sensation is overwhelming. Her cunt lurches in the orgasm and cum goes shooting out destroying the train and launching it over the city. Cum rains all over the city with people and debris as well.<br>\r\n<br>\r\n\"That was cool, maybe I can do it both ways next time\" , Tila says as she gets up.</span></div></div>",
            "created":1227675600,
            "id":667894,
            "title":"Getting Railed by Tokyo"
        },
        "12111111111111121":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Tila strikes again",
                "Tila goes out to sea"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins walking over to the sea. She can see many lights and boats at the port. She can hear the busy noises of hundreds of people trying to get on the boats to run away. She begins walking over to the port. She has a little idea in store for them. She is still aroused after her little rampage in the city and she needs to relief her self. Her footsteps cause the ground to shake and crushing cars in her way. Finally she comes to the sea. She looks down at the busy port to see thousands of people trying to flee. They don't notice her in their panic. <br>\r\n<br>\r\n\"Hey guys, I hope you don't all leave\" , Tila says. In a instant they all look up and stare at Tila. They are stunned still at the sight of her. Her perfect body, her glorious tits, her fine cunt. Even after all the destruction caused she still is amazing. <br>\r\n<br>\r\n\"You all look tired. Let me cool you off\" , she says. Then she arches her back let her chest stick out. They all look up at her while her tits cast a shadow over them. Suddenly they look at her cunt and sees it moving. Then it begins to get wet and dripping. All of a sudden it comes. Tila begins to urinate on all the people. Urine flushes all the people out to sea. Hundreds die as they are drowned in her excess. The ferry boats flip over in the tidal wave of urine. Some people are killed instantaneously as they urine falls down crushing them. Her urine makes ditches in the road, even washing away sidewalks. Any buildings that stood are now wiped out, even their foundation has shifted.<br>\r\n<br>\r\n\"Oh yeah, I feel better now. Well back to having some fun\", Tila says as she looks down at a little puddle of urine. She giggles as she walks away. Her body feeling better and more comfortable to her actions. She feels she wants more and need it to survive. She wonders what makes her grow.  She wants to grow bigger.</span></div></div>",
            "created":1227675600,
            "id":667898,
            "title":"Flash Flood!!!!"
        },
        "121111111111111211":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she grows even more",
                "Tila relieves herself"
            ],
            "content":"<div class=\"\"><div> <span>A group of people are sitting down inside watching the destruction on television. They are frightened and wonder where she will strike next. People still crowd inside large structures hoping they will not be another one of her sexual lusts. They then hear the ground shake. They hear footsteps coming closer. Windows shake in the tremors. They hear screaming from far away. They hear her voice getting louder. They look at the window. Suddendly they see her face looking inside the building. <br>\r\n<br>\r\n\"Hey guys, did you miss me?\", Tila says as she hugs the building. Her breasts squeeze up against the building and then bust through killing people and crushing floor after floor. People try to jump to their lives but land on her tits.She begins to grind herself against the building. Her cunt pressed up against the building. The heat and moisture steaming up the windows. The people inside scared but knowing their deaths are coming. She grinds more and more until the building gives way to her body. The building comes crashing to the ground.<br>\r\n<br>\r\n\"Awww, now I need to find a new friend.\"<br>\r\n<br>\r\nTila begins walking over to a busy interesection of traffic. She sees a highway going through. She walks over and lifts up the side of the highway towards her. Hundreds of cars begin to go crashing down towards her cunt. She moans as she picks up the rest and smash them into her cunt. She walks over to the streets looking down at little people trying to flee. She rubs her finger in her cunt to get some cum and flings it at them. They get stuck in her cum. <br>\r\n<br>\r\nHours past as she unleashes herself on the city. She continues to walk through the streets when a car goes crashing into her foot.<br>\r\n\"Ouch, now you are going to pay\", Tila says. She lifts up her foot and slams it down on the street. Her foot goes right through the ground into the subway tunnels. She bends down to look inside the tunnels see hundreds of people.<br>\r\n<br>\r\n\"Owwwww, look like I found some candy\", Tila says as she extends her tongue out and begins picking up people by the dozens. \"You all taste so good.\" Tila starts to get a feeling in her stomach. It begins to hurt. She needs to relieve herself of the pain. She looks into the distant to see Mt. Fuji.</span></div></div>",
            "created":1227675600,
            "id":611871,
            "title":"Tila strikes again"
        },
        "1211111111111112112":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Tila gets more of Japan",
                "Tila grows alot!!!!"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins walking up the mountain. Along the way she see villages and picks them up and eats them. She always wanted to see whats up here. Her stomach been hurting for a while and wonders why?  Maybe because of all her sexual urges. She notices that her body has never felt this way before. Her body has been having multiple orgasms and her pussy has been constantly wet. Her body must be getting used to all of her liquids leaving her. She wonders how much her body can make. She smiles as she wants to find out her limits. Tila finally reaches the top of the mountain. She looks around seeing most of Japan. She looks where she was and can see the path of destruction she has left behind her. She smiles seeing her wonderful \"work\"<br>\r\n<br>\r\nTila looks down to see a few villagers on top of the mountain. She smiles at them as they stare up at her body. She raises her foot and smashes them into pieces. Her foot goes right through the top of the mountain. Chunks of rock goes everywhere. The ground begins to rumble as lava begins to spew out of the mountain. Tila then gets another pain in her side. She notices she has to \"relieve\" herself again.<br>\r\n<br>\r\n\"Jeez all the fun has making me go alot\" she says as she spreads her legs. In seconds piss begins to come down and rain upon the volcano. Gallons upon gallons begins to rain down into the crater of the mountain. Soon the lava is dryed up and the bowl is filled with piss.<br>\r\n<br>\r\n\"Well thats was a relief, lets see what else there is to do\"</span></div></div>",
            "created":1227675600,
            "id":625643,
            "title":"Tila meets nature"
        },
        "12111111111111121121":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Tila finds love",
                "Another giantess"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins her path of destruction again. This time right towards the high-rise area. She sees in the distant the glass towers that dot the cityscape. She wants them to fill her desires. On the way she begins picking up houses. Most fit inside her hand. She looks inside them at the scared people and eats them. Some she smashes against her tits in pleasure. She notices a large stadium in the distant. She sees a baseball game is going on. She begins her move over there. As she gets closer she notices that the stadium is packed full. As she gets to the stadium she steps over the sides of it with ease. Thousands of people as frightened at the sight of Tila. They stare at her magnificent body. Her body was flawless.  She looks down to see the people staring at her.<br>\r\n<br>\r\n\"Looks like you guys want a show. Well let me give you one.\", she says. She then takes two fingers and places them inside her pussy. She begins to masterbate in the stadium. People watch in awe at the show Tila has. She begins to moan more as she rubs faster. Men in the audience have never seen a sight like this in their lives. They begin to say things like \" I want that\" or \"I wanna tap that\". Suddendly the crowd notices she is beginning to moan louder. Her pussy begins to get wet as drips of cum fall to the ground.<br>\r\n<br>\r\n\"Get ready guys, here comes the surprise!!\", she yells as her body arches in her little orgasm. Cum comes rushing out of her pussy and drowns the crowd. She turns back and forth spewing cum over the entire audience. \"Oh yeah guys, I hope you like every bit of this\", she says. She looks down at the stadium seeing the entire audience wiped out in her orgasm. She begins to walk away walking right through the stadium. She moves back into the streets of the city. <br>\r\n<br>\r\nTila looks down to see traffic packed up along the way. She bends down to pick up a bus. She sees that it is too small to be her toy anymore. She tosses it into the air as she begins to play with the cars below. She begins to smash cars up against each other. People scream as their car is thrown up against buildings or driven around like a matchbox car. Suddendly Tila looks over to see something that will mae her very happy.</span></div></div>",
            "created":1227675600,
            "id":611876,
            "title":"Tila gets more of Japan"
        },
        "121111111111111211211":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she continues with her love toy"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins to move over to a tall building. She walks right over anything in her way, leaving only death in her wake. She examines the building. It is a cylinder shaped building made of steel and glass. It has a dome point and smooth down to the base. She bends down to look inside the building. She presses her face close to the window. She can see people crowded inside and scared. She waves to them and smiles. She begins massaging her tits. She looks down at the people trying to leave the building and rub them across her tits.<br>\r\n<br>\r\n\"I hope you like what your going to get. I have been waiting for a time like this.\"<br>\r\n<br>\r\nTila picks up the building, riping it out of the foundation. She then stands up and inserts it slowly into her pussy. She moans as it goes into her. Then she begins to speed up. A little faster each time she rails it. Floor by floor goes away as it is swallowed and destroyed by her pussy. People fall to their deaths as they are swallowed. She begins to moan louder. Her back arches showing her large amazing tits and her toes curl up. \"OH YEAH!!! YOUR SO GOOD!!!!\", she yells. Her eyes roll back in her head with her orgasm. \"MORE, MORE , MORE!!!\",Tila yells out as the building goes faster into her pussy Cum begins to run down her thighs and into the streets washing away people. News crews around the world broadcast the event. The world watches in awe and horror as Tila Tequila is watched pleasuring herself with a building.</span></div></div>",
            "created":1227675600,
            "id":611884,
            "title":"Tila finds love"
        },
        "1211111111111112112111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "She grows again",
                "Another Choice???"
            ],
            "content":"<div class=\"\"><div> <span>Tila looks down at the building. She sees that their is only 15 stories left of the building. She smiles at what she sees and gets another urge in her body. She lifts up the building to eye level to see what is inside. She sees people packed in the building. They are leaning up against the window. <br>\r\n<br>\r\n\"I always wonder if you had a cream filling\", Tila says.<br>\r\n<br>\r\nShe opens her mouth and presses her lips around the building. She inserts the building back and forth in her mouth. The people inside can see the frantic motion the building is moving in as they see her lips go back and forth over the sides. She then inserts her tongue inside. Her tongue begins to clear out the floors of the building. Each movement of her tongue grabs ten to twenty people that are swallowed and fall down her throat. She moans as she sucks on the remaining of the building. <br>\r\n<br>\r\n\"You taste so good\", Tila says as she continues. She begins massaging her tits with her other hand as she pleasures herself more. Her tongue gets wild inside as it begins clearing the rest of the building. Hundreds are sucked up into her mouth. She begins to insert the building faster into her mouth. She begins to squeeze the building harder with every motion. Suddendly the building gives way to the pressure and collaspes in her hand. She looks down at what is left in her hand to see only debris and maybe fifty people still alive. She licks them up and swallows them down her throat.<br>\r\n<br>\r\n\"Wow guys, you are the best\", Tila says. She looks down around at the mess she caused around her during her orgasm wih her cum. She giggles at the sight. </span></div></div>",
            "created":1227675600,
            "id":625614,
            "title":"she continues with her love toy"
        },
        "12111111111111121121111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "She grows 5 miles high",
                "She grows 50 miles high"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tila starts to feel an sensation run through her body. She looks around to see things beginning to change again. Suddendly...</span></div></span></div>",
            "created":1230440400,
            "id":625615,
            "title":"She grows again"
        },
        "121111111111111211211112":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Readers Choice",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Tila gets a crazy sensation. In a flash she expands out and upwards at insane speeds. She grows 10 miles a second. Her body feels a rush of power and lust run through her body. She looks down to see clouds falling past her body. She looks down to see most of Japan below her. Tile looks down upon Tokyo to see almost nothing lift of it. The tallest buildings come up to her ankle. She smiles down below and a rush of lust and her craving for pleasure makes her almost shake. She smiles as she thinks about what to do next.</span></div></div>",
            "created":1232600400,
            "id":636924,
            "title":"She grows 50 miles high"
        },
        "1211111111111112112111121":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "building me a giant dildo",
                "making a bikini fit for a Goddess"
            ],
            "content":"<div class=\"\"><div> <span>Tila looked around, smiling at just how powerful she had become.<br>\r\n<br>\r\n\"Look up at me you little insects! I am now a Goddess to you! Your military couldn't stop me when I was smaller, and they sure as hell can't stop me now! My lust is insatiable, and all your existence now means is to satisfy my every whim!\"<br>\r\n<br>\r\nTila then placed her foot on top of a mountain and simply let it's weight have it's effect on it. The mountain began to crumble and compact until it was even with the rest of the earth on each side of it.<br>\r\n<br>\r\n\"I can shape your world in any way I wish, kill millions of you with a single move, your world IS MY PLAYTHING!\" she boomed down placing her hands on her hips.<br>\r\n<br>\r\n\"Now because I am your Goddess I demand to see you worship me, and right now you can do that by _________________\"<br>\r\n<br>\r\nTila then sat down, obliterating several cities underneath her massive ass and endlessly stretching legs. She then waited for her puny slaves to meet her demands.</span></div></div>",
            "created":1235192400,
            "id":650228,
            "title":"Make some demands"
        },
        "12111111111111121121111211":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Her increased size means she sleeps longer",
                "She sleeps a normal eight hours (They fail to complete their task)"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, and by the way you little slaves, I want that Dildo to vibrate furiously! I be damned if I am going to put any effort into getting off again!\" she said as she rubbed one of her massive breasts.<br>\r\n<br>\r\n\"I wonder just how long I should give you to build my toy. Obviously it will be the biggest thing you bugs have ever built, but of course the world will want to appease their Goddess... Hmm...\" she said taking her free hand and dragging her fingertips over the mountain ranges and cities around her.<br>\r\n<br>\r\n\"Here's the deal, I'm going to lay down and go to sleep, when I wake up I want that dildo complete, all 10 miles of it! If it is not complete I will destroy Japan, and oh, lets say Australia. I will then destroy another country every hour until my toy is complete.\" she then laughed as she laid down.<br>\r\n<br>\r\nUsing her hands she pushed some dirt together to form an earth pillow. She could'nt help but play with herself some more before she went to sleep.<br>\r\n<br>\r\n</span></div></div>",
            "created":1235451600,
            "id":652149,
            "title":"building me a giant dildo"
        },
        "121111111111111211211112111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Enjoys her toy",
                "gets pissed because the damn thing broke"
            ],
            "content":"<div class=\"\"><div> <span>With Tila's increased size that meant that her body reacted to everything differently. Time flowed around her at the time rate, but her body acted differently she aged slower, and instead of sleeping for just 8 hours or so. She slept 384,000 hours or roughly 43 years. As time passed her slaves worked furiously to build her the most grand dildo of them all to appease their Goddess.<br>\r\n<br>\r\nThe earth weathered around her, rivers formed where her breasts shed rain water. Her hair became one with the forests around her head, and small mountains had formed where her arms rested.<br>\r\n<br>\r\nOver that 43 years the cities she had destroyed had been rebuilt, and Tila herself was considered holy ground. Few dared to venture a climb onto her body, for fear of awaking the Goddess and facing her wrath.<br>\r\n<br>\r\nHer ultra mega sized dildo awaited her between her legs for her to do with as she wanted when she awoke.<br>\r\n<br>\r\nEverything was peaceful, some even wondered if the Goddess would ever awaken again. When suddenly one day, her eyes opened, and she let out a massive yawn as she began to sit up.<br>\r\n<br>\r\nLooking around everything seemed to be pretty much the same to Tila, with the exception that the cities seemed a bit different. She did'nt think much of it as how often does someone get to see a city from 50 miles up.<br>\r\n<br>\r\n\"Did my little slaves accomplish their task?!\" she asked, noticing the new toy awaiting her.<br>\r\n<br>\r\nShe picked it up and...</span></div></div>",
            "created":1235538000,
            "id":652155,
            "title":"Her increased size means she sleeps longer"
        },
        "1211111111111112112111121111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "People's POV",
                "she countinues"
            ],
            "content":"<div class=\"\"><div> <span>Tila inserted the 10 mile dildo into herself. She let out a moan as it inserts into her vagina. Years have passed since anything have been inserted into her. <br>\r\n<br>\r\nHer pussy was tight but quick to warm up and begin to let out moist air around it. She begins to shove it in faster and faster with a moan being let out in every slide.<br>\r\n<br>\r\nHer moans are heard from around all of Asia. She spreads her legs in her ecstasy. Cities that were once rebuilt now lay ruined in seconds from her passing legs. <br>\r\n<br>\r\nFor years people have waited for her awakening only to see her great pleasure. Her pussy begins to ooze out its juices forming rivers.<br>\r\n<br>\r\nTila begins to insert faster in the ecstasy. <br>\r\n<br>\r\n\"You have built me a good one, lets put it to the test!!\"</span></div></div>",
            "created":1235538000,
            "id":652285,
            "title":"The world's largest dildo"
        },
        "12111111111111121121111211112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Tila wants to sleep",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Tila then turned the knob on her toy and activated the vibration mode.<br>\r\n<br>\r\n\"OH YES!\" she screamed as she turned the dial up higher and higher until it was at maximum.<br>\r\n<br>\r\nShe then began thrusting it harder and faster. To say that she was creating an earthquake was a gross understatement. The earth itself shook in sync to her massive body. Tsunamis formed at sea dozens of miles away, rising hundreds of feet in the air, crashing on the cost lines of far away countries.<br>\r\n<br>\r\nYes the world now knew that their Goddess had awakened again, and everyone could feel it in the earth they walked upon.<br>\r\n<br>\r\nIt did'nt take long for Tila to orgasm at all, and she was'nt stopping with just one, she kept going. She was like an animal, never stopping, unable to be satisfied.<br>\r\n<br>\r\nOrgasm after orgasm, it was like they were all waiting in line just waiting to be unleashed. Everything between her legs and the coast was under her juices. Her free hand massaging her breasts, and rubbing up and down her body. She just couldn't get enough of herself.<br>\r\n<br>\r\n\"YES! This is what I want! MORE!\" Tila kept pounding her toy into herself over and over, harder and harder, faster and faster.<br>\r\n<br>\r\nThe earthquakes around the world intensified, the tsunamis raised higher and higher now reaching thousands of feet in the air. She pushed herself up onto her knees and continued her work. Now her juices rained down on the earth below. If there was anything still around in Japan it would have been devastated by the massive drops of juice.<br>\r\n<br>\r\nAgain orgasm after orgasm ensued, as Tila then leaned forward allowing her breasts to swing in the air, one hand propping her up from the ground.<br>\r\n<br>\r\n\"Oh Goddess YES!\" another massive orgasm rocked Tila's body.<br>\r\n<br>\r\nTila then rolled over onto her back and relaxed, and allowed her toy to keep running as she felt it's energy diminish and then finally die.<br>\r\n<br>\r\nTila sighed as she had never had that many orgasms before in her life, let alone so many so close together.</span></div></div>",
            "created":1235970000,
            "id":655017,
            "title":"she countinues"
        },
        "121111111111111211211112111121":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "The tinies rebuild again and meet her demands",
                "The new generation of tinies are pissed and declare war on their \"Goddess\""
            ],
            "content":"<div class=\"\"><div> <span>\"Mmmm that was sooo Gooood...\" Tila purred as she relaxed, enjoying the aftershocks of her pleasure run through her body.<br>\r\n<br>\r\nIn just a couple of hours the Goddess had awoken, pleasured herself, and wiped out 60% of all life on the planet. Those that were still alive wanted it all to end now, but it looks like there were going to be denied.<br>\r\n<br>\r\n\"Thank you little ones for such a good time, but I think I tired myself out... I'm going to take a nap...\" Tila then removed her plaything and set it beside herself.<br>\r\n<br>\r\n\"When I wake up I want that running in tip top shape...\" she yawned as she went back to sleep.</span></div></div>",
            "created":1235970000,
            "id":655033,
            "title":"Tila wants to sleep"
        },
        "1211111111111112112111121111211":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Plays with the UTLIMATE TOY!!!",
                "Goes somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>As Tila went back to sleep for her time, thousands of people came to rebuild her toy. Around the clock people from all around the world repaired the toy to be fixed in time. The rest of the world thought maybe an \"upgrade\" could be done to pleasure her enough so she will not have to killed them and spare their lives. Not only fixing it they installed the latest in fusion powered technology. Though never fully tested, they believed it would make it 100x more powerful at least. Maybe enough so she will spare them.<br>\r\n<br>\r\nTila rises from her slumber. Only 22 years have went by until she woke up. Her body has perfected itself even more to be perfect during her slumber. Her tits have grown to even greater sizes. She is the ultimate giantess now. The world now has their empress to follow and give to her demands.  She looks down to see her dildo in perfect shape and glowing. Around her cities have rebuilt themselves. New buildings with new heights have been reached. She grins at them wishing to test their strength. The people see her awake and pray that their plan has worked.<br>\r\n<br>\r\n\"Well well...let see if you have pleased me.\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1236056400,
            "id":667903,
            "title":"The tinies rebuild again and meet her demands"
        },
        "12111111111111121121111211112111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "She finally turns the toy off",
                "Her mind is lost in pleasure, she can't think about the toy now."
            ],
            "content":"<div class=\"\"><div> <span>Picking up her toy she looks it over, impressed with it. Tila could feel the power within it as she held it in her hand.<br>\r\n<br>\r\nPlacing it inside herself she instantly started flooding the area with her juices, and she had'nt even started to pump yet. The power emanating from the toy was pleasuring her, she couldn't wait to turn it on.<br>\r\n<br>\r\nReaching down she turned the dial to the lowest setting, and she instantly reached orgasm, again and again and again. Mere split seconds apart, Tila screamed in pleasure as the toy did it's work. Barely able to control herself, or even think she reached down and turned the dial up higher, and higher. The frequency of orgasm approached overlapping themselves. Arcs of electricity flowed around her body as her nervous system was in overdrive, stronger and thicker the arcs became. Finally Tila turned it to the highest setting, her eyes went solid white, her body was completely covered in electricity. Tila seemed to be made of energy itself as her orgasms had orgasms, and overlapped each other. Her screams were so loud that they became super sonic, far beyond hearing of the puny population.<br>\r\n<br>\r\nTila was becoming more and more powerful, more than she could have ever imagined.</span></div></div>",
            "created":1238994000,
            "id":671677,
            "title":"Plays with the UTLIMATE TOY!!!"
        },
        "121111111111111211211112111121112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Tila tests her destructive power",
                "Tila tests her power and brings everyone back to life"
            ],
            "content":"<div class=\"\"><div> <span>Despite how intense her pleasure already was, it seemed to be getting stronger and stronger. Tila could'nt think of anything she was in a complete daze of pleasure and power. Eventually the toy stopped running, she wasn't sure how much time had passed years, or a few millennium, but one thing was sure, all life on the planet had died in her fit of passion. The world was barren, it looked as if it had been cooked alive.<br>\r\n<br>\r\nTila finally looked at herself, and she realized she wasn't normal. Sure she was huge, but her body wasn't right it was completely made of energy.<br>\r\n<br>\r\n\"Have... Have I become a real goddess?\"</span></div></div>",
            "created":1239426000,
            "id":674149,
            "title":"Her mind is lost in pleasure, she can't thi..."
        },
        "1211111111111112112111121111211121":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Play with the solar system",
                "Find other life in the universe"
            ],
            "content":"<div class=\"\"><div> <span>Tila looks across the globe and finds the cities have been near obliterated. Its looks as if a nuclear holocaust has happened. No evidence can be found of any survivors or the cause but it looks like she has done it. Tila lurches forward and leaps away from the Earth. The ground she pushes away destroys miles of already destroyed landscape. She turns around to see the Earth. She wants to destroy it. There is no pleasure to be done or anything to play with on the Earth.<br>\r\n<br>\r\n\"Its going to be hard to destroy this planet\"<br>\r\n<br>\r\nTila closes her eyes and grows. She thinks of a suitable size she wants to be. She grows and grows until the moon now revolves around her. She opens her eyes to see the Earth the size of a basketball. She takes her two hands and smashes the Earth in a single smash of anger. The Earth breaks into chunks until the float away into the Sun. Tila body glows with pure energy. She is now a true goddess. Once a goddess of Earth, but soon she will conquer the vastness of space. Other civilizations will meet her demands until nothing is left in the universe. <br>\r\n<br>\r\nTila begins to move through space. She decides to...</span></div></div>",
            "created":1240894800,
            "id":683066,
            "title":"Tila destroys the Earth"
        },
        "12111111111111121121111211112111211":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "She likes the taste and wants to try this some more",
                "Eating planets does not amuse her"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm... Being that I am now a Goddess... what is there for me to do, no one could ever please me. There would never be enough worshipers for me to be amused by...\"<br>\r\n<br>\r\nTila floated over to Mars and idlely began drawing on it's surface with her finger. As she debated what to do next. She was so powerful, she had everything and anything. Yet she was very alone and getting rather bored.<br>\r\n<br>\r\nTila blew onto the surface of the planet and obliterated it. The entire planet disintegrated and turned to microscopic dust particles.She had destroyed another planet this time without even really trying.<br>\r\n<br>\r\nTila sighed and floated over to Venus, she simply decided to try and eat the planet this time. She grew about 20 times larger so the planet could fit in her mouth easily. In a single bite she chomped down on the planet and began to chew it.</span></div></div>",
            "created":1241499600,
            "id":686821,
            "title":"Play with the solar system"
        },
        "121111111111111211211112111121112112":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Find new life in the universe",
                "Find some pleasure"
            ],
            "content":"<div class=\"\"><div> <span>\"That doesn't seem as fun as I thought.\"<br>\r\n<br>\r\nTila floated through space only to find Jupiter, which is about the size of a beach ball to her now. She kicked the planet and hurled it through the sun which ignited into a fireball and burn all the other planets into cinders.<br>\r\n<br>\r\nTila grew bored as she watched her solar system burn to dust.<br>\r\n<br>\r\nShe decided to....</span></div></div>",
            "created":1243832400,
            "id":700689,
            "title":"Eating planets does not amuse her"
        },
        "1211111111111112112111121111211121121":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Make contact",
                "Demand worship!!!"
            ],
            "content":"<div class=\"\"><div> <span>\"There must be more in this universe...more life..more planets.\"<br>\r\n<br>\r\nTila drifted through space, she could sense life. It was a faint sound in her head as if a beacon. She traveled through the emptiness of space towards a bright star.<br>\r\n<br>\r\nShe came upon a star system that was bustling with life. Entire planets glowed as they were filled with life. Space stations as large as her foot. Tila was amazed to find life in the universe. Though as she can see they were more technological advanced than humans on Earth but the same size. <br>\r\n<br>\r\nTila decides to.......</span></div></div>",
            "created":1246251600,
            "id":716125,
            "title":"Find new life in the universe"
        },
        "12111111111111121121111211112111211211":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "The planet strikes back",
                "Tila demands worship"
            ],
            "content":"<div class=\"\"><div> <span>Jak\"arr was tired of his crappy job. He worked for hours staring at his console as he looked for new life in the universe. Just a day ago there was an energy spike that was detected as an whole star system seemed to disappear. His boss told him to shut his mouth but he could only wonder why....<br>\r\nA beeping sound came from the console and the monitor brought up a view of space. There was a being, that seemed to be unknown but vastly huge. It was coming towards their planet. Already satellites and small stations were crushed by its movements. The planet goes on full alert readiness to make contact with the creature......<br>\r\n<br>\r\n<br>\r\nTila sees the planet below which is only about the size of a beach ball. She wonders what they people are and what can be made of them. <br>\r\n\"HELLO!!!!\" , Tila says as her voice doesn't make sound in space but creates a shockwave that tilts orbiting space stations into disarray. She is dismayed by there is no contact yet and brings her face closer to the planet.<br>\r\n</span></div></div>",
            "created":1249707600,
            "id":741187,
            "title":"Make contact with a new civilization"
        },
        "121111111111111211211112111121112112112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Make me a ring to marvel at!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The glowing body of Tila leaned down even closer.<br>\r\n<br>\r\n\"Hello! Little people! I am your Goddess Te... Goddess... yeah You will just call me Goddess. I am a simple Goddess, and only demand complete and total obedience in the form of worshiping me.\" she spoke telepathically to all the people on the planet in their own language as well as physically speaking in her own.<br>\r\n<br>\r\n\"You will all learn my language, do my bidding, and worship me. For your entire life from this moment on is dedicated to nothing more than pleasuring me!\" Tila finished as she leaned back, showing off her current size.<br>\r\n<br>\r\nEveryone on the planet knew that she just spoke to them all at once, and that someone that big had to be some kind of real God. Without question they surrendered and gave into her will. A few beings on the planet would resist her, but these people would be hunted down and sacrificed to the new Goddess.<br>\r\n<br>\r\nAs expected Tila demanded complete changes in religion, and that statues and shrines be built to her all across the planet. She could feel the energy of the tiny little beings directed toward her in the form of worship, and she loved it.<br>\r\n<br>\r\nIn just a few short days to Tila the little beings become completely converted to her religion, language and everything about her. To the people on the planet years had passed, and all they knew was that this Goddess had only shown them mercy so far.<br>\r\n<br>\r\nHowever now Tila had grown bored of just acts of worship she wanted something more physical...<br>\r\n<br>\r\n\"My precious slaves, I will now make my first true demand of you...\"</span></div></div>",
            "created":1250312400,
            "id":744423,
            "title":"Tila demands worship"
        },
        "1211111111111112112111121111211121121122":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Sex",
                "To find more worshippers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Tila want?</span></div></span></div>",
            "created":1258760880,
            "id":794473,
            "title":"Something else"
        },
        "12111111111111121121111211112111211212":{
            "author_id":"chozo_ghost",
            "author_name":"Chozo",
            "choices":[
                "Tila rapes the space station with her cunt",
                "A vast Armada of spaceships tries to stop her"
            ],
            "content":"<div class=\"\"><div> <span>It had taken millions of years of drifting through the cold empty void of space before Tila had reached this bustling solar system. So much time had passed since she had destroyed the human race that this new species of aliens probably hadn't even evolved yet, or perhaps were only in the stone age. Now they were a vast and bustling interstellar civilization and had managed to construct massive space stations almost as large as the earth had once been, and each space station housed billions of individuals.<br>\r\n<br>\r\nTila licked her lips as she eyed these space stations which were just the right size and shape to satisfy her pussy which has been aching for attention for millions of years. She fondly remembered the enormous dildo humanity had constructed for her just before she wiped them out, and felt remorse over wiping out those who had worked so hard to give her such a wonderful gift. Doing that had been such a waste, and now that she had finally discovered a new species to be her slaves she vowed to be more careful to not destroy more than these tiny beings could cope with.<br>\r\n<br>\r\nNevertheless, she was going to make them her slaves. She needed to be served and worshipped and pampered by an entire alien civilization, and there was no doubt billions of them were going to die for her pleasure, but at least their species itself would not be wiped out. True they were condemned for all eternity to be her personal slaves and toys, but at least they would exist. Tila felt this made her a benevolent goddess.<br>\r\n<br>\r\nMeanwhile, the nearest space station which she had been eyeing so hornily engaged its maneuvering thrusters in a futile attempt to get away from her. \"Oh no you don't!\" giggled Tila as she reached out and grabbed the dildo shaped space station with one hand, immediately grinding its movement to an abrupt halt.</span></div></div>",
            "created":1325501820,
            "id":1251052,
            "title":"Demand worship!!!"
        },
        "1211111111111112112111121111212":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Their plan works",
                "Their plan is a joke"
            ],
            "content":"<div class=\"\"><div> <span>The countries of the world were not amused or pleased by Tila. All she wanted to do was masturbate and sleep, a few small actions for her, and it spelled total destruction for the planet. They were pissed and they wanted revenge.<br>\r\n<br>\r\nThey could not physically harm her, but perhaps they could keep her asleep forever. After all she destroyed the least when she slept.<br>\r\n<br>\r\nThe plan was to connect wires to her, and effectively drain her nervous system of it's energy, leaving her constantly tired, and asleep. While she slept they would encase her in concrete, and eventually fill her with it as well so she couldn't breathe. Forcing her to stay unconscious forever. </span></div></div>",
            "created":1238994000,
            "id":671671,
            "title":"The new generation of tinies are pissed and dec..."
        },
        "12111111111111121121111211112121":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Lisa's team finds one of the power lines",
                "Tila's body forces itself to wake up to find food"
            ],
            "content":"<div class=\"\"><div> <span>Tila slept for many years as the tiny population built their device to keep her asleep. When it was complete nearly 20 years had passed.<br>\r\n<br>\r\nThe switch was thrown and Tila's body now powered the entire planet with energy from her body. Now the new phase could begin, and that was to encase her in concrete to not only hide her, but to prevent her from moving in her sleep at all.<br>\r\n<br>\r\nAnother 30 years had passed and the little people had managed to completely cover the massive woman, and seal her away. A new golden age had begun, and it was being powered by Tila.<br>\r\n<br>\r\nFor another 50 years her body was guarded 24 hours a day 7 days a week. No one was allowed to enter property anywhere near her. Civilization quickly grew dependant on her electricity, and stopped building their own power planets. It now seemed evident that Tila would never awaken, and the world could finally be at peace.<br>\r\n<br>\r\nOver the next 200 years security was lessened and lessened around Tila, slowly, until eventually it ceased to exist. Many wondered if the stories of old about a giant woman being in the sacred ground was true, or if it was just a cover up. It would take another 100 years before anyone dared try and enter the \"Holy ground\".<br>\r\n<br>\r\nThe notoriously hot asian Dr. Lisa siesmore and her mostly female team had decided to break into the Holy ground despite numerous protests, and attempts to stop her. They worked late at night and tunneled their way in from several miles away. As they got closer the earth and stone seemed to get hotter and hotter. Eventually they hit a material they just could'nt break through.<br>\r\n<br>\r\n\"Dr! Come see this!\" Lisa ran over to the assitant and felt the substance. It was hot, and smooth, and seemed to feel rubbery, almost like skin. Cutting it, stabbing it, drilling it... Nothing seemed to dig into it.<br>\r\n<br>\r\n\"Keep clearing around it, whatever it is we need to find out.\"<br>\r\n<br>\r\nSeveral more days of working the team kept going along the surface of the object, it seemed to go on forever. They went higher, it seemed to go higher still, they went west it seemed to continue to stretch west.<br>\r\n<br>\r\n\"Dr, do you believe this is the legendary Goddess?\"<br>\r\n<br>\r\n\"I'll believe it when I see her face, until then this is just a huge wall.\"<br>\r\n</span></div></div>",
            "created":1239426000,
            "id":674145,
            "title":"Their plan works"
        },
        "121111111111111211211112111121211":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Gain some of Tila's power for herself",
                "To cut the line and restore some of Tila's power"
            ],
            "content":"<div class=\"\"><div> <span>The team had found one of the wires that connected to Tila and headed out toward the power grid. The team did not know what it was, but Lisa did. She ordered everyone to leave the tunnels except for herself.<br>\r\n<br>\r\nOnce everyone was gone she made her preparations to...</span></div></div>",
            "created":1241499600,
            "id":686720,
            "title":"Lisa's team finds one of the power lines"
        },
        "1211111111111112112111121111212111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "She gains power that matches Tila",
                "No one can handle the power and she is destroyed by the surplus energy."
            ],
            "content":"<div class=\"\"><div> <span>\"If this is the supposed Goddess, then this must be one of the lines that are drawing energy from her! If I connect up into it I can draw her power into me and I will become a Goddess! The world will finally give me the recognition I deserve!\"<br>\r\n<br>\r\nLisa made the connections to the line and herself, and began severing the connection from Tila to the outside world. Once the connection was broken the flow of power would go directly into Lisa giving her a full blast of \"Goddess power\".<br>\r\n<br>\r\n\"Cut faster damn it! Godhood will soon be mine!\"<br>\r\n<br>\r\nDoes Lisa's plan work?</span></div></div>",
            "created":1241499600,
            "id":686799,
            "title":"Gain some of Tila's power for herself"
        },
        "12111111111111121121111211112121111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Grow right here and now",
                "Go the city and demonstrate"
            ],
            "content":"<div class=\"\"><div> <span>The connection was finally cut and in a blinding flash of light all the power that was going to the world from Tila was now flowing into Lisa.<br>\r\n<br>\r\n\"YES! YES! YES! THIS IS POWER TRUE UNFATHOMABLE RAW POWER!\" Lisa shouted as she grew more and more powerful by the nanosecond.<br>\r\n<br>\r\nOn the outside every city in the world went dark as they no longer had power to run anything. Everything relied on Tila, and now that was taken away. Now Tila's immense power was fueling one single being.<br>\r\n<br>\r\n\"NOTHING CAN STOP ME! I AM GOD!\" Lisa screamed as the flow of power seemed to stop. She had now matched Tila in every way in terms of power, and she couldn't wait to show it off.<br>\r\n<br>\r\nIf Lisa grew inside the cave she might awaken Tila, and she would have to share the world with her. However if she waited a bit and went to the city, surely the world would be hers alone.</span></div></div>",
            "created":1241499600,
            "id":686812,
            "title":"She gains power that matches Tila"
        },
        "121111111111111211211112111121211112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "They worship Lisa",
                "They reject Lisa and give praise to Tila"
            ],
            "content":"<div class=\"\"><div> <span>Lisa walked out from the tunnels and was greeted by her workers.<br>\r\n<br>\r\n\"What happened Lisa? The power has gone out world wide, everything is in chaos!\"<br>\r\n<br>\r\n\"I happened!\" Lisa said as she began growing right in front of them.<br>\r\n<br>\r\n\"I am your Goddess, and this world is mine!\" she declared as she kicked one of her workers hard sending them flying into the city. In just a few short seconds she had already grown to 500 feet tall and was still going.<br>\r\n<br>\r\n\"Nothing will stop me, everyone will serve me now!\" Lisa topped out at 1,000 feet tall and began making her way toward the darkened city. Dozens of people where in the streets trying to figure out what was going on as the earth shook beneath their feet. Each step Lisa took the earth shook more and more as she got closer and closer to them. Soon they could see her head on the horizon just above the skyscrapers.<br>\r\n<br>\r\n\"It's the Goddess! She has awoken! She's going to kill us all!\"<br>\r\n<br>\r\n\"No, that's not the Goddess it's that damn scientist that was wanting to fool with the ruins to the north!\" a second citizen added.<br>\r\n<br>\r\n\"Does that mean, that the Goddess does exist?!\"<br>\r\n<br>\r\nLisa arrived in the city and without any warning just began crushing and destroying anything within her reach. All the while remaining silent, keeping her enjoyment to herself.<br>\r\n<br>\r\nBuilding after building was being stomped out of existence. Those that did not meet their fate under Lisa's foot were knocked over by the shock wave or accidentally tumbled due to Lisa's leg brushing against them.<br>\r\n<br>\r\nIn this time period buildings where much bigger than the older days an average building would tower in at around 800 feet, the tallest was around 3,000 feet. There were no longer houses or small buildings. There was just too many people in the world for anyone to own their own house. Only the very rich had their own houses, and even then they would only be single story buildings in the middle on inhospitable land.<br>\r\n<br>\r\nLisa saw there were many buildings in the city still bigger than her, but she wanted to have her own fun first before beginning a true massive rampage. She walked over to a building twice her size and simply punched a hole straight through it. The building collapsed shortly after she pulled her arm out. Another building received a devastating round house kick, sending debris flying through and over the city. Another building she wrapped her arms around and squeezed it tight against her body turning it into ruble that rained down onto the streets below.<br>\r\n<br>\r\nThe entire city was in chaos, and she was loving it.<br>\r\n<br>\r\n\"Insects... this world is now mine! Long have I waited to become this powerful, and now I am a Goddess. Worship me and your death will be painless, if you won't then you will suffer! The Goddess of old is dead, and there is only me! Come forth and bow down to me, give me praise and beg for me to kill you quickly!\"</span></div></div>",
            "created":1241845200,
            "id":688741,
            "title":"Go the city and demonstrate"
        },
        "1211111111111112112111121111212111121":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "The Goddess Tila has awoken!!!!",
                "The immense power of the Ancient Goddess"
            ],
            "content":"<div class=\"\"><div> <span>Thousands of people crowd around Lisa's feet. Begging for mercy and praising her. <br>\r\n<br>\r\n\"Well, now that you finally know who your Goddess is, I have demands to be meet\", said Lisa as she bend down to pick up a <br>\r\nhandful of people which is about 300-500 of them. She opens her mouth and tosses them in like candy. Screams are heard as they fall down her throat to a darken abyss.<br>\r\n<br>\r\n\"You will all beg for mercy or more of you will end up like the others\"<br>\r\n<br>\r\nThey crowd begins to beg for mercy. Some are crying and offering anything they can give her to be spared. Lisa feels aroused at this scene. She knows that she is a Goddess. All the stories of the Goddess of the past are true. Now she will become the Goddess of this era. But to do so, she will need to be bigger. She needs more of the mighty power of the ancient goddess.<br>\r\n<br>\r\n\"Puny Worshipers, your Goddess must go out throughout the land to conquer more of this puny world. If you wish to be spared, I demand a mighty statue of myself. If not completed, I will bring my wrath down upon you\", said Lisa as she smashed another skyscraper to the ground. The tinnies run through the street looking for materials for their project. Lisa smiles and begins to go back to the site of the Ancient Goddess. A dark shadow towers over the the site. <br>\r\n<br>\r\nIt is.......</span></div></div>",
            "created":1243746000,
            "id":700133,
            "title":"They worship Lisa"
        },
        "12111111111111121121111211112121111211":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Reader's Choice....",
                "Reader Choice............."
            ],
            "content":"<div class=\"\"><div> <span>A dark shadow rose across the continent...it was the ANCIENT GODDESS TILA!!!!<br>\r\n<br>\r\nTila lets out a long moan as she awakes from her slumber. She rises above the Earth and looks down. She notices the Earth has developed alot since she has slept.<br>\r\n<br>\r\nTila decides to...</span></div></div>",
            "created":1248757200,
            "id":734070,
            "title":"The Goddess Tila has awoken!!!!"
        },
        "121111111111111211211112111121211112111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Lisa tells her the truth",
                "Lisa tells her a lie"
            ],
            "content":"<div class=\"\"><div> <span>Tila decided to take a look and see what had happened in the world.. She quickly noticed the much taller than expected woman at her feet.<br>\r\n<br>\r\nLisa just stood there in shock of the Goddess still being alive. She thought that she had drained all of her power, but somehow she still had more. Was it true that she really had UNLIMITED power?<br>\r\n<br>\r\n\"YOU! Little woman, how did you get so big?\" Tila pointed at Lisa and spoke with authority.</span></div></div>",
            "created":1250312400,
            "id":744426,
            "title":"Reader's Choice...."
        },
        "1211111111111112112111121111212111121112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Wait for her chance to drain even more power",
                "Fight back now"
            ],
            "content":"<div class=\"\"><div> <span>\"Uh, I uh I don't know... I just kinda grew a few minutes ago and I came over here and found you.\" Lisa said. Tila got down on one knee and looked at the smaller woman.<br>\r\n<br>\r\n\"There is something about you... I don't know what it is...\" Tila said as she tried to read the woman's mind. She was surprised that she was unable to do so.<br>\r\n<br>\r\n\"I don't know... Your.. uh name... but I believe you are the legendary Goddess that has been asleep for hundreds of years.\" Lisa said trying to quickly change the subject.<br>\r\n<br>\r\n\"YES! I am your Goddess. Hundreds of years huh? I am a bit of a heavy sleeper at times. That reminds me... I gave you slaves an order before I went to sleep and I don't see it completed!\" Tila pointed towards her little toy that had since corroded and was ruined by the passage of time.<br>\r\n<br>\r\nLisa had never noticed it before, but to her and the rest of the world it was believed to be just a mountain. She watched as Tila grabbed the mountain with her had and from it her dildo was freed from it's confines as well.<br>\r\n<br>\r\n\"You little people failed me, and on top of that I find another woman has grown?! I am to assume that she is my new plaything!\" Tila said looking disgusted at her former toy as she threw it away and began reaching for her new one.<br>\r\n<br>\r\n\"I... AM ... NOT... YOUR.... PLAYTHING!\" Lisa shouted as Tila reached for her.<br>\r\n<br>\r\n\"You have no choice in the matter!\" Tila said as she sat back down, obliterating the remains of the \"Holy ground\".<br>\r\n<br>\r\nLisa decides to...</span></div></div>",
            "created":1250312400,
            "id":744432,
            "title":"Lisa tells her a lie"
        },
        "12111111111111121121111211112121111211121":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Drain Tila's power from within",
                "Grow bigger than Tila and return the favor"
            ],
            "content":"<div class=\"\"><div> <span>Lisa was doll sized to the Goddess at the moment, and she knew that if she suddenly grew to the Goddes's size they would have an all out fight. Lisa was'nt sure how, or even if she could get more power from the Goddess. Let alone how her current power was in relation to the Goddess. She was going to have to take a chance and throw herself at her mercy.<br>\r\n<br>\r\n\"Goddess, please... Please go easy on me... I am not sure if I was intended to be your plaything or not. I just suddenly grew... I don't know what's going on...\"<br>\r\n<br>\r\n\"Woman... you are incredibly powerful, at least as powerful as I am now. I can sense it. I don't know how you became so powerful, but I do know one thing. I need pleasure, and your the right size!\" Tila said as she grabbed Lisa and shoved her into her pussy and began feverishly pumping her in and out.<br>\r\n<br>\r\n\"YES! SQUIRM YOU LITTLE SHIT! SQUIRM FOR YOUR GODDESS!\" Tila shouted. Her bucking and pumping causing the whole planet to quake in fear yet again. The oceans raised and lowered in rhythm to her motions.<br>\r\n<br>\r\nMeanwhile Lisa should have been killed by now, was still alive and fully aware of the situation. Initially she was in shock, and fear. But quickly adjusted to her situation. Now all she could do was think of what her next move was going to be.<br>\r\n<br>\r\nTila continued her work, having orgasm after orgasm before she finally slowed down and stopped.<br>\r\n<br>\r\nFor once Tila tired herself out without any aid.<br>\r\n<br>\r\nLisa waited what felt like an hour to herself before she made her next move.</span></div></div>",
            "created":1250312400,
            "id":744437,
            "title":"Wait for her chance to drain even more power"
        },
        "1211111111111112112111121111212112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Tila awakens again and this time she's hungry",
                "Tila does not awaken, but something else happens."
            ],
            "content":"<div class=\"\"><div> <span>\"If this truely is the Goddess, then If I start cutting the power lines to the outside world she will awaken and prove herself to exist. If not I simply waste my time.\"<br>\r\n<br>\r\nLisa began cutting the line, waiting to see if the legends are true about a woman so large and powerful she could destroy the world.<br>\r\n<br>\r\nFinally Lisa had broken through the line, she began to notice that it was getting hot in the cave. Perhaps it was just from her cutting the cables... <br>\r\n<br>\r\n\"Well 'Goddess' are you going to wake up or prove me wrong?\"</span></div></div>",
            "created":1241499600,
            "id":686800,
            "title":"To cut the line and restore some of Tila's ..."
        },
        "12111111111111121121111211112121121":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "China becomes her first meal as a Goddess",
                "America will satisfy her hunger... for now..."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly the entire ground began to shake, the walls started to crack and crumble.<br>\r\n<br>\r\n\"Holy shit... it's true... It is really true...\" is all Lisa could say as a giant slab of concrete fell on her. A massive moan could be heard as Tila began to re-awaken. She had taken quite a nap, in perspective to her size she had slept for a few days. She found herself having a bit of difficulty moving, but with a little bit of effort she managed to break free of her confines.<br>\r\n<br>\r\nDirt, concrete, and an assortment of other debris began raining down her body as she sat up and started to look around. It appeared to be that she somehow got buried. Tila tought about this for awhile before she re-focused on the task as hand... her hunger.<br>\r\n<br>\r\n\"I wonder if something befell my planet and they buried me to protect their Goddess... \" she thought as she began to stand up and stretch.<br>\r\n<br>\r\nHundreds of years asleep she needed it.<br>\r\n<br>\r\n\"Mmmm... that feels good... \" she moaned from her colossal height.<br>\r\n<br>\r\n\"Now... what can I eat... I'm so hungry I could eat a horse... or well if I was mortal sized that is...\" she giggled and began walking toward the main land.</span></div></div>",
            "created":1241499600,
            "id":686808,
            "title":"Tila awakens again and this time she's hungry"
        },
        "121111111111111211211112111121211211":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "She devours more and is partly satisfied enough to stop",
                "She consumes nearly all life on the planet and still needs more"
            ],
            "content":"<div class=\"\"><div> <span>Normally a normal sized person would eat around a pound of food for a meal. However when you are 50 miles tall that equals out to around 55,296,000,000 tons, and Tila was feeling more than just a little hungry after being sleep for so long.<br>\r\n<br>\r\nHer body would require the devouring of nearly 500 billion average weight humans to satisfy her hunger, and the world certainly did not have enough life on it for her hunger to be quenched.<br>\r\n<br>\r\nShe started with china thinking it had enough people to satisfy her, and as she devoured city after city. Licking up each and every last person, car, building, truck, and anything else around.<br>\r\n<br>\r\nHundreds of thousands of lives turned into hundreds of millions, and then finally billions as all of China now resided inside of Tila.<br>\r\n<br>\r\n\"All this effort and I am still soooo hungry... can this world really satisfy my hunger...\" Tila asked as she rubbed her stomach as it growled for more.</span></div></div>",
            "created":1242277200,
            "id":690966,
            "title":"China becomes her first meal as a Goddess"
        },
        "1211111111111112112111121111212112111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "A mass of people pour out of the buildings and praise her in unison",
                "She spots a statue of herself"
            ],
            "content":"<div class=\"\"><div> <span>Tila continued feasting on the cities in Asia and parts of Russia. Nothing seemed to be satisfying her hunger.<br>\r\n<br>\r\n\"Soo... hungry... I need more... too much for this planet to provide me with now...\" Tila said as she rubbed her stomach and looked around at the barren landscape behind herself.<br>\r\n<br>\r\n\"My worshipers... I need you to bring me food every day! It's the only way I can fill my hunger over time, and not wipe you all out of existence. What fun is it to be a Goddess with no worshipers?\" she told them as she stood back up and then began walking again.<br>\r\n<br>\r\nShe made her way to Europe and then sat there.<br>\r\n<br>\r\n\"So my little ones, while I wait for my food, show me how loyal you are to me and how you worship me.\" Tila asked the tiny city of Paris as she brought her face closer to the city.</span></div></div>",
            "created":1243314000,
            "id":697370,
            "title":"She devours more and is partly satisfied enough..."
        },
        "12111111111111121121111211112121121112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Tila is angered deeply by this",
                "Tila shows forgiveness to the world"
            ],
            "content":"<div class=\"\"><div> <span>\"ooh... What's this...\" Tila asked as she noticed something that was roughly twice the size of the other buildings. It seemed to be made of gold, and had some gems in it.<br>\r\n<br>\r\nTila leaned in closer, causing her breasts to collide with the world below her crushing hundreds of buildings to dust.<br>\r\n<br>\r\n\"Oh... my... gawd...\" she giggled as she recognized that it was a statue. Not only was it a beautiful statue, but she realized it was a very close resemblance to herself.<br>\r\n<br>\r\n\"You built a towering statue of myself to stand over your city! How cute! Do you worship this statue of me?\" Tila asked the city below as she watched and waited for an answer.<br>\r\n<br>\r\nIt took the puny people a while, but they managed to rig up a sound system for Tila to hear them.<br>\r\n<br>\r\n\"Is this thing... WHOA... yeah it's working... Goddess! It is my city's privilege to have caught your eye with our statue of yourself. We have prayed to it every day for the last several hundred years since your appearance on earth!\" The mayor spoke through the system.<br>\r\n<br>\r\n\"Several... hundred... years...\" Tila idlely spoke in a whisper.<br>\r\n<br>\r\n\"Yes my Goddess, we are very loyal to you, and would do anything for you. On behalf of everyone on earth, we thank you for sparing us. We all understand you must be famished for having not eaten for so long.\"<br>\r\n<br>\r\n\"Uh... Yes... Your welcome... Tell me little man, what year is it?\"<br>\r\n<br>\r\n\"The year 3,408 A.G. Goddess\"<br>\r\n<br>\r\n\"Three thousand... AG? What does that stand for?\"<br>\r\n<br>\r\n\"After you appeared on earth it was only fitting to mark our calendars appropriately. AG stands for After Goddess\"<br>\r\n<br>\r\n\"So it's been over 3408 years, since I became a giantess...\" Tila mumbled to herself.<br>\r\n<br>\r\nTila laid there and wondered and thought about how long that was, how everything must have advanced so much, and then how much had here mere existence effected the world.<br>\r\n<br>\r\n\"So... tell me more... How else have I impacted your tiny lives...\"<br>\r\n<br>\r\n\"Well, not everyone worships you like we do, our city is completely loyal to you and has never lost hope that you would return to us!\"<br>\r\n<br>\r\n\"Return? I never left, and what do you mean there are people who DON'T worship ME?!\" Tila said a bit agitated to say the least.<br>\r\n<br>\r\nThe mayor then went on about what happened ages ago about entombing Tila and using her for powering the cities of the world.</span></div></div>",
            "created":1243314000,
            "id":697374,
            "title":"She spots a statue of herself"
        },
        "121111111111111211211112111121211211121":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Destroy America",
                "Use America and its cities to pleasure her"
            ],
            "content":"<div class=\"\"><div> <span>Tila screams upward into the atmosphere. Her voice is heard even by the deaf. Tila wants revenge for the puny little ones plans. She grows to immense sizes in her rage, topping to 500 miles tall!!!!<br>\r\n<br>\r\n\"I will spare your city and others who worship me, but the others are mine!!\", said Tila as she marched across the Atlantic. The tinnies in the city praise her but her thoughts are bent on revenge.<br>\r\n<br>\r\nTo the west, she can see the lights of the futuristic cities of North America. As far as she can see, which is almost to the Mississippi River, is lighten up. She stands only 50 miles from the coast of America. <br>\r\n<br>\r\n\"You will all pay for what you have done! You will feel the wraith of your Goddess, Tila!!!!<br>\r\n<br>\r\nTila has an urge though, it has been over 3000 years since she has been pleasured. Though she is not hungry now, she now has other needs to be meet.<br>\r\n<br>\r\nTila decides to...</span></div></div>",
            "created":1243746000,
            "id":700139,
            "title":"Tila is angered deeply by this"
        },
        "1211111111111112112111121111212112112":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Destroy the Earth and conquer the Galaxy",
                "Destroy the solar system and seek out new life"
            ],
            "content":"<div class=\"\"><div> <span>Tila body needed more, her stomach growled as if she hasn't eaten in years..(which is true). Tila decided to move west and eat all that comes in her path. She knew she must eat all until she is full. And if this planet couldn't fill her, then something else would.<br>\r\n<br>\r\nIndia.....<br>\r\n<br>\r\nPeople were going to work when they hear rubbles in the east. News was just reporting how Japan and China has been lost but no one knows. No calls, no survivors. It took 28 minutes for both countries to disappear. A dark towering figure rose from over the horizon. It blocked out the sun. Suddenly it crashed on its hands and knees, creating earthquakes that were so powerful that California broke off the United States. Suddenly its mouth open up and a tongue miles long start to devour the countryside. Millions died in a instant. People fled, running, driving, rampaging through airports to get on planes but nothing could stop their doom. Whole mountains were licked clean of all life. Cities were eaten in seconds which stood hundreds of years. Plumbing, subways, the very foundations were eaten. In less than 18 minutes, India was no more. No life covered the land.<br>\r\n<br>\r\nEurope.....<br>\r\n<br>\r\nNews channels buzz down the streets of Paris. All of Asia has went dark. No contact. The only sign of life was Russia when they launched all their nuclear weapons into the sky. The light of the blast was seen across the world but the radiation and energy of the blast was absorbed. After the blast, A giant dark figure grew in the distant. Suddenly in the distance, the figure was made out to be the GIANTESS!!!! Her beautiful toned body lumbers over the continent. The lights of the cities of Europe glow against her body. Every detail of her body is perfect. As she licks her lips she begins to kneel down to begin her meal. Her body has grown to immense sizes due to the nuclear attack. She is now 500 miles tall!!! Her tongue reaches out and eat all of Eastern Europe. In minutes nothing is left. Air raid sirens are sounded through all of Europe. People panic not knowing what to do. Screams are heard as the figure comes closer, no disaster has been seen like this in most people's lives. As the sky darkens, the figure leans over the Alps. The mountains are smeared across the landscape by her enormous breasts. She begins to inhale as whole city blocks are lifted into the sky. Europe darkens in her hunger. Soon after that Africa and South America darkens also......Tila begins to move towards the West which lies....<br>\r\n<br>\r\nUnited States....<br>\r\n<br>\r\nAmerican people run towards their bunkers, most haven't been used since the Second Cold War. The president flees the Capitol and all Armed Forces are sent home to their families. The end is near.....<br>\r\n<br>\r\nTila walks across the Gulf of Mexico. She looks down to see all of America. She gets a small urge that needs to be fulfilled first. She leans over and rips Florida out of the crust of the Earth. While she stands, she inserts the Sunshine state into her vagina and beings to make it into a dildo. She moves it faster and faster until she cums. Her fluids rain down across the United States, replacing rivers and lakes with her cum. <br>\r\n\"That should be the icing on the cake\", as she bends down and begins to eat more and more of the land. In 30 minutes...no life is on Earth. Only thing that lives is Tila Tequila licking her fingers while sitting across the Midwest. <br>\r\n<br>\r\n\"Well, what should I do now?\". After her meal, her stomach subsides and feels better. She looks up towards the stars. She decided to.....GROW!!! She closes her eyes and feels her self growing..... She shoots pass miles and miles, she begins to float away from the Earth. The Earth begins to look like a basketball.....baseball.....tennis ball.... Tila decides to</span></div></div>",
            "created":1242277200,
            "id":690991,
            "title":"The extinction of the Human Race"
        },
        "12111111111111121121111211112121121122":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Smashing it",
                "Shoving it up her ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tila starts to take her fun out on the solar system... first she must destroy the Earth. She destroys it by....</span></div></span></div>",
            "created":1283908140,
            "id":952177,
            "title":"Destroy the solar system and seek out new life"
        },
        "121111111111111211211112111121211211221":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Continue rampaging the solar system",
                "On to bigger and better things"
            ],
            "content":"<div class=\"\"><div> <span>Tila floats over to the diminutive planet and looks down at it. Grinning intently as she plots what to do with it*<br>\r\n<br>\r\n\"I know exactly how to end you all! Be thankful I am so merciful!\"<br>\r\n<br>\r\nAs she leans it she cups her breasts one with each hand and brings them up and around the planet.<br>\r\n<br>\r\n\"Worship me as hard as you can in this last moment. It will be your last chance at salvation!\"<br>\r\n<br>\r\nAs she waits just a moment to feel their fear and worship at it's peak before slamming her breasts together. Pressing and grinding them against the planet, turning her breasts into the greatest weapon of mass destruction ever. She slowly grinds and pulverizes it further until it is nothing but grains of wet sand to her as she laughs and pulls away from it. Brushing the dirt off her massive breasts like one would pieces of dust.<br>\r\n<br>\r\n\"That was so disappointing... I expected to at least feel something more than that, but it was just like popping a small water balloon full of sandy water... Ugh... So disappointing! Perhaps there is something else here that will be more interesting to crush?\"</span></div></div>",
            "created":1436075700,
            "id":2003369,
            "title":"Smashing it"
        },
        "121111111111111211211112111121211211222":{
            "choices":[
                "reader's choice ",
                "reader's choice "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tila posistions her ass near the earth and spread her cheeks the earth slowly begins to move near her ass. once finally there she shoves it up her ass and then she feels it flatten.</span></div></span></div>",
            "created":1461528780,
            "id":2138705,
            "title":"Shoving it up her ass"
        },
        "121111111111111211211112111122":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Sex seems to make her grow...",
                "What was she going to do for the rest of her life now"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Tila relaxed the tingle of her orgasms still flowing through her body, she realized something.</span></div></span></div>",
            "created":1235970000,
            "id":655019,
            "title":"Something else"
        },
        "1211111111111112112111121111221":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "250 miles",
                "1000 miles"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tile looks around to see herself grown to incredible sizes during her orgasm. <br>\r\n<br>\r\nShe is now.....</span></div></span></div>",
            "created":1236056400,
            "id":655326,
            "title":"Sex seems to make her grow..."
        },
        "12111111111111121121111211112212":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Pleasures herself more ",
                "Use the countries as playtoys"
            ],
            "content":"<div class=\"\"><div> <span>Tila looks around to see herself has grown to 1000 miles!!!!!! Clouds now come up to her ankles. While standing she can reach into outer space.<br>\r\nStaring down she can see the cities of the world and their glow. She smiles down below and says \"Now you will all bow down to me!!!!!\" Her voice was a deafening boom<br>\r\nthat everyone on earth can hear. \"Now you will all fulfill my pleasures and fantasies for all eternity, be prepare to worship your new goddess!!!\"<br>\r\n<br>\r\nTila feels amazing, her body is defined to be a true goddess!!! Now she knows how to make herself grow, she decides to....</span></div></div>",
            "created":1238389200,
            "id":668614,
            "title":"1000 miles tall!!!!!"
        },
        "121111111111111211211112111122122":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Japan",
                "China"
            ],
            "content":"<div class=\"\"><div> <span>Tila decided it was best to try not to pleasure herself for now. After all how would she know if there was other life in the universe, what fun would it be to destroy everything but have no slaves?<br>\r\n<br>\r\nShe decides it is best to play with a country or two, and then make some more demands.<br>\r\n<br>\r\nWhat country does she start with?</span></div></div>",
            "created":1239426000,
            "id":674155,
            "title":"Use the countries as playtoys"
        },
        "1211111111111112112111121111221221":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Eats Japan",
                "Uses country as dildo"
            ],
            "content":"<div class=\"\"><div> <span>She stares down between her legs and sees the island of Japan. It is the length of her forearm at most. She bends down draws a finger across the country. Entire cities are wiped out of existence. She brings her finger up to her eye and sees hundreds of buildings and people on her finger. She sticks her finger in her mouth and sucks off the buildings.She smiles and says \"Ummmm your good! I wonder how you would.....\" <br>\r\n<br>\r\nTila bends down and ripes the country of Japan out of the Earth. She then...</span></div></div>",
            "created":1240376400,
            "id":680027,
            "title":"Japan...the new play thing"
        },
        "12111111111111121121111211112212212":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "The nation of China",
                "All of North America"
            ],
            "content":"<div class=\"\"><div> <span>Tila rips the island nation out of the crust of the Earth. Sea water rushes in the hot lava crust and steam rises from the ocean. Tila lowers the country to her vagina and begins to insert the country.<br>\r\n<br>\r\n<br>\r\n<br>\r\nPeople run and scream in panic and fear. The whole ground rumbles as the country passes through the clouds. In the distant, a dark hole..resembling a black hole is seen in the sky surrounded by a pinkly flesh. It gets bigger and bigger every moment. \" Is that a monster\" a man says.     \"Oh my God...its a VAGINA!!!!\", a woman screams. People begin to cry and loot as their end is near. The first coastal cities hit the black hole and is sucked in by her fluids. A smell engulfs the country and brings some to pass out. The country begins to enter deeper. Whole cities and mountains are devoured by the hole. A moaning sound that almost deafening to the human ears is heard.<br>\r\n<br>\r\n<br>\r\n<br>\r\nTila rolls her eyes to the feeling. Destruction, pleasure.....all in one hit! Tila moans more and more as the country crumbles in her vagina. She can hear the screams of millions as they perish. Entire cities are crashing against the walls of her pussy bringing her almost to pure ecstasy. She can barely take it. Her toes begin to curl as the feeling drives her to orgasm. She shoves more of the country in her, taking more than half now. She can't take it anymore as she screams in ecstasy and orgasms.<br>\r\n<br>\r\n<br>\r\n<br>\r\nPeople hold their ears as screams and moans become louder as if a 747 is right next to them. They here a gushing sound and they look out their windows. A tidal wave over 1000 feet tall is coming at them. Its rushing out of the dark hole. It is white and moving at over 500 feet per second. Whole buildings and hills are obliterated in the moment. People scream as they move close to the hole in a more frantic motion. Their end is near. Loved ones hold each other in their last moments. Darkness engulfs the island..then there is nothing.......<br>\r\n<br>\r\n<br>\r\nTila orgasm is complete. She is exhausted but also amazing. She looks down to see what is left of the island. Only a small chunk, less that 50 miles wide is left in her hand. She takes the piece and smears it across her chest. The sensation is erotic as millions of people are felt being smeared into a pulp across her tits. Tila then looks around to see the world. It is quiet, probably in a state of fear. <br>\r\n<br>\r\n\"I am Tila, your Goddess and every thing you now do will be for me. Worship me puny humans!!!!\"<br>\r\n<br>\r\nTila then feels a little hungry. She rubs her stomach. Her increased size and her multiple orgasms have turned her stomach into a bottomless pit. She knows now food can fill her. She knows only countries can fill her size now. She decided to eat.....<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1242018000,
            "id":689596,
            "title":"The End of the Rising Sun (she destroys Japan)"
        },
        "121111111111111211211112111122122122":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "continue eating",
                "People's POV  "
            ],
            "content":"<div class=\"\"><div> <span>Tila stomach rumbles with hunger. The sound roars across the Earth as thunder or an earthquake.<br>\r\n\"I should get something to eat before I go any farther\".<br>\r\n<br>\r\nScreams are heard across Earth as their doom awaits in form or hunger, destruction or their goddess's pleasure.<br>\r\n<br>\r\nTila begins to cross the Pacific Ocean. Entire navies have mobilized to stop her but do little. Their missiles and cannons fire, which only reach her ankle. In her first step, she wipes out most of the pacific islands in tidal waves. Her foot makes a crater deeper than the ocean is by 3 times. She crosses the Pacific in 4 steps. She looks down across America with a grin. Tila gets down on her knees. The shockwaves cause 15.4 scale earthquakes across the Earth. She brings her face down to California and beings to lick up the coast into her mouth.</span></div></div>",
            "created":1249707600,
            "id":741191,
            "title":"Crosses the Pacific"
        },
        "1211111111111112112111121111221221221":{
            "author_id":"sweetsurrender",
            "author_name":"GrowthLover",
            "choices":[
                "She demands to be nuked again.",
                "She continues to grow"
            ],
            "content":"<div class=\"\"><div> <span>Now, most Americans knew what was going on, and many of them worshiped the Goddess, praying to be honored among her 'victims', to be either consumed by mouth or vagina by her was to be considered the greatest way for one's life to end. It would mean that they would be a part of Tila, the almighty, beautiful Goddess.<br>\r\n<br>\r\nBut there were those that did not worship and did not like the idea of a Goddess eating them or using them for her sexual pleasures. So they devised a plan to destroy her.<br>\r\n<br>\r\nTila was in the middle of eating California's fertile Central Valley when it happened. Nukes. Lots of nukes. All dropped into her pussy.<br>\r\n<br>\r\nShe felt as though she had been fucked by the worlds biggest and best dildo, such was the orgasm that came. <br>\r\n<br>\r\nShe let out a cry that shattered nearly every eardrum as she grew. Her hunger grew with her, and she shoveled entire states into her 1500 mile long and growing body. Once satisfied [for now] she sat on the remaining states, aroused by the sight of her swelling body, getting well...larger. <br>\r\n<br>\r\nTila then lay down on her back, her 200 mile tall boobs nearly obscuring her vision. But it did not matter. She could feel herself continue to grow, her body in two hemispheres at once at 2000 miles tall.<br>\r\n<br>\r\nStill she felt...a little unsatisfied. Those nukes were awesome...but she wanted more.</span></div></div>",
            "created":1253163600,
            "id":761994,
            "title":"continue eating"
        },
        "1211111111112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "having some fun with it.",
                "anger that something could be as big as her."
            ],
            "content":"<div class=\"\"><div> <span>\"There is nothing that can stop me! I am far superior to you little insects! I wish to get off, however none of you are worthy of even gazing upon me! You hardly even deserve the effort I have to put into killing you. That is why I will destroy this city in an act of foreplay!\" Tila shouted to the city around her as she began laughing.<br>\r\n<br>\r\nShe walked over to the biggest skyscraper in the city, while rubbing herself. She then noticed the building was a little bit higher than her breasts, this gave her the idea to destroy them with her mammories of mass destruction.<br>\r\n<br>\r\nShe started swinging her boobs back and forth as she neared closer to the building, the first strike was far more devastating than she thought. The entire upper floors of the building disintegrated and rained down on the city below. Pleased with this simple action Tila began leaning forward while still swinging her breasts, back and forth. She was using them like massive wrecking balls, and was pulverizing the remains of the building to dust. As she got to the lower floors she had to crouch, causing her legs to plow into nearby buildings.<br>\r\n<br>\r\nFinally as she reached the ground floor she entered a prone position, and simply let herself fall down on the remains of the building. Laughing and rubbing herself, she rolled over onto her back, causing several more buildings to collapse.<br>\r\n<br>\r\nHer nipples stood hard and erect as they swelled bigger and bigger with each act. She rolled back over onto her stomach, by going through some still standing buildings. She brought herself up to all fours and began crawling through this section of the city that had smaller buildings. Each of which was only as high as her shins if she was standing up.<br>\r\n<br>\r\nHer hands plowed through building after building as she made progress further into the city. Each thunderous handfall was followed by an even stronger movement of her leg. Then she moved the other hand, and her leg with that as well. The buildings that were not crushed by her approaching hands, met the force of her wrecking ball boobs.<br>\r\n<br>\r\n\"This is too easy...\" she said aloud as she eyed a new target in the city, Tokyo tower. The tower standing at around 1,000 feet tall was just as big as Tila.<br>\r\n<br>\r\nCrawling closer and closer to the tower she looked at it with the intention of...</span></div></div>",
            "created":1235192400,
            "id":650241,
            "title":"Tila goes on a rampage"
        },
        "12111111111122":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Destroy some more",
                "Grow bigger"
            ],
            "content":"<div class=\"\"><div> <span>crushing the tower.<br>\r\n<br>\r\nTila reached where the tower stood and began ripping it from the ground. Now in her hands she began to crush and compact the metal of the tower into a ball.<br>\r\n<br>\r\nTila then stood up to her full height and looked at the remains of the skyline. Tossing the ball up and down in the air, she now pondered if she could do what she was planning. Tila pulled her arm back behind her and let it go forward like she was bowling. At the end of her swing she let the ball of metal go as it rolled down the main street and into the once busy downtown section.<br>\r\n<br>\r\nThe ball hit one building and bounced off hitting two more. The buildings shook and then finally collapsed under the damage they had suffered.<br>\r\n<br>\r\n\"Strike!\" Tila shouted raising her hand in the air in a victory pose.<br>\r\n<br>\r\nShe then looked around at the city and brought the tip of her finger to her lips as she pondered what to do next.</span></div></div>",
            "created":1235970000,
            "id":655036,
            "title":"anger that something could be as big as her."
        },
        "121111111111222":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Enormous!!! (Cities are the size of her hand)",
                "Giga (Cities are the size of her thumbnail)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tila gets the idea to grow bigger. She closes her eyes and imagines herself bigger. She can feel the ground around her get smaller as she grows. She can hear screams as people are crushed under her growing body. She opens her eyes and she is.....</span></div></span></div>",
            "created":1236056400,
            "id":655329,
            "title":"Grow bigger"
        },
        "1211111111112222":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "\"Play\" with the cities of Asia",
                "Grow larger"
            ],
            "content":"<div class=\"\"><div> <span>Tila opens her eyes and see clouds and the curves of the Earth. She drawfs the Earth. Hundreds of miles high she can see most of Asia. She looks down to see her legs floating in the Pacific. The country of Japan is laying between her legs, now it is the size of a dildo. She smiles at the thought and a little cum dribbles out of her vagina. Down below people are washed away from a tsunami of cum that drowns out the remaining cities of Japan. She looks around and she decides to....</span></div></div>",
            "created":1238043600,
            "id":700154,
            "title":"Tila..the 8th Continent!!!!"
        },
        "12111111111122222":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Tila fucks the Earth crazy!!!!",
                "Tila goes out and finds other life"
            ],
            "content":"<div class=\"\"><div> <span>Tila desires to grow larger. She wants to grow more and more. She WANTS MORE!!!!! Tila closes her eyes she begins to grow at a incredible rate. Miles a second. Clouds are erased as she grows faster and faster. Her body begins to leave the Earth and float into space. Oceans and volcanoes go erratic as Tila's body creates its own gravity that pull from the Earth's. She grows until she thinks she is big enough. She opens her eyes to see only space. She looks down to see the Earth and other planets revolving around her. <br>\r\n<br>\r\nShe has became a TRUE GODDESS!!<br>\r\n<br>\r\n\"I AM TILA TEQUILA, THE ONE AND ONLY GODDESS!!  WORSHIP ME OR PAY THE ULTIMATE PRICE!!!!\"<br>\r\n<br>\r\nThe Earth is about the size of a basketball now compared to Tila. She picks up the moon like an apple and starts eating it. She thinks what she should do next.</span></div></div>",
            "created":1243746000,
            "id":700158,
            "title":"Grow larger than the Earth"
        },
        "12111111112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Something that renders her unconscious? ",
                "Another Giantess?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of weapon does the military surprise Tila with?</span></div></span></div>",
            "created":1235192400,
            "id":650221,
            "title":"Army's secret weapon"
        },
        "121111111122":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Jarah Mariano",
                "Readers Choice #2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1235192400,
            "id":650236,
            "title":"Another Giantess?"
        },
        "1211111111221":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Just as big as her",
                "Much bigger than her (10x)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The military decided to use an experimental formula on the equally attractive Jarah Mariano to combat Tila.<br>\r\n<br>\r\nTila heard a rumbling sound coming from behind her, she turned around to see Jarah...</span></div></span></div>",
            "created":1235192400,
            "id":650247,
            "title":"Jarah Mariano"
        },
        "12111111112212":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "I'm going to kick your ass",
                "I'll take you up on your offer"
            ],
            "content":"<div class=\"\"><div> <span>towering over her, easily ten times her size with her hands on her hips.<br>\r\n<br>\r\n\"Tila you will cease this activity at once! As the nation of Japan's new ultimate weapon I command you to drop to your knees and surrender to me!\"<br>\r\n<br>\r\nTila could'nt help but be both amazed, and frightened at this turn of events. Jarah was just about 1mile tall, and easily more powerful than her.<br>\r\n<br>\r\n\"What if I refuse?\" Tila decided to ask.<br>\r\n<br>\r\n\"Then I will destroy you!\"<br>\r\n<br>\r\n\"If you try to kill me you will cause massive destruction to the city.\"<br>\r\n<br>\r\n\"That may be true, but either way you will be destroying the city.\"<br>\r\n<br>\r\n\"So what happens if I go with you?\"<br>\r\n<br>\r\n\"That is for the government to decide, if you co-operate you might just get to join me as an ultimate weapon. However if you continue to cause trouble, you will likely be terminated.\"<br>\r\n<br>\r\n\"You know I think...\" </span></div></div>",
            "created":1235451600,
            "id":652134,
            "title":"Much bigger than her (10x)."
        },
        "121111111122122":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "World Domination",
                "Finish off Japan!!!!"
            ],
            "content":"<div class=\"\"><div> <span>Sure, I guess I will work with you.<br>\r\n<br>\r\nAfter they both agree to work together, a warm sensation went through Tila's body and she grew to Jarad's height!!!<br>\r\n<br>\r\nBoth of these colossus asians now are 50 miles high!!!<br>\r\n<br>\r\n\"Well, that was cool. What you want to do now?\"<br>\r\n</span></div></div>",
            "created":1235538000,
            "id":652286,
            "title":"I'll take you up on your offer"
        },
        "1211111111221221":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Japan has a weapon that can turn the back to normal",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"We will conquer the world in the name of the mighty nation of Japan!\" Jarah commanded.<br>\r\n<br>\r\n\"That sounds like fun, but why should we do anything for these little microbes? What could they do to stop us?\" Tila said, motioning around herself to put emphasis on just how powerful the two where.<br>\r\n<br>\r\n\"Because...\"</span></div></div>",
            "created":1235624400,
            "id":652763,
            "title":"World Domination"
        },
        "12111111112212212":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "us under mind control",
                "a Goddess for an emperor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"the nation of Japan has...\"</span></div></span></div>",
            "created":1235624400,
            "id":652765,
            "title":"other"
        },
        "121111111122122121":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "America",
                "Asia"
            ],
            "content":"<div class=\"\"><div> <span>\"us under mind control, we will do whatever they command. The world will bow down to the nation of Japan...\" Jarah said with a completely blank and emotionless look. Before returning to herself.<br>\r\n<br>\r\n\"Yes... Japan will rule the world...\" Tila said in a similair manner, before she returned to her normal self.<br>\r\n<br>\r\n\"Let us start our conquest with...\"</span></div></div>",
            "created":1235624400,
            "id":652775,
            "title":"us under mind control"
        },
        "1211111111221221212":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Hong Kong",
                "Beijing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But what major city should they attack first???</span></div></span></div>",
            "created":1235797200,
            "id":653574,
            "title":"Picking the \"play pin\""
        },
        "12111111112212212122":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Crush it with their bodies",
                "Eat it"
            ],
            "content":"<div class=\"\"><div> <span>The unstoppable duo began walking straight toward china. Their 50 mile tall bodies traveling easily at 120,000+ miles per hour with a light walk. Each step covering a distance of 10 miles, bringing them closer and closer to their destination.<br>\r\n<br>\r\nA single step brought them out of the busy city of Tokyo, and into the surrounding rural area. Entire towns disappeared under their feet. Two more steps and they were in the mountains of japan. Their mighty peaks flattened and reduced to huge craters, whereever the mighty women placed their feet.<br>\r\n<br>\r\nAnother dozen or so of these light strides brought them to the coast of japan, where they when began walking toward South Korea. Each movement of their towering legs created massive tsunamis no less than a thousand feet high. Each crushing wave washing away dozens of miles of coastal property. Another couple dozen strides and they were in the eastern coast of South Korea.<br>\r\n<br>\r\nHaving adjusted to the extra effort of moving through the water, the two mega Asians were putting more effort than they realized into each footstep. This extra force magnified the destruction of their walking causing cities several miles away from them to have buildings collapse.<br>\r\n<br>\r\nThey walked right through the capitol Seoul without even paying any attention. In their wake it was nothing more than two massive foot prints where they had walked through it. Unknown to them, they had killed millions, and didn't even feel it.<br>\r\n<br>\r\nAnother couple of steps and they were in the West sea, and then the Yellow sea. Once again in the water the Tsunamis began striking the coasts again. Several small islands where completely removed from the map and replaced with underwater footprints. Finally another dozen strides and they were back on land, and just a few steps away from Beijing. In a little over a minute the two had traveled nearly two thousand miles, and had killed over 4 million people. All without breaking a sweat, now it was time of them to have fun.<br>\r\n<br>\r\nThe two colossal women looked at the city in the distance, and began discussing what to do with it once they arrived.</span></div></div>",
            "created":1235883600,
            "id":654307,
            "title":"Beijing"
        },
        "121111111122122121222":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "\"Play\" with the rest of China",
                "Destroy it all!!!"
            ],
            "content":"<div class=\"\"><div> <span>They two colossal asians kneel down on each side of the city. Each knee killing thousands and bringing shockwaves through all of East Asia. They put their heads close to the ground and open their mouths and began. <br>\r\n<br>\r\nDown on the ground people look up for what was a sunny day then became dark then disturbing as on each side of the city, two giant faces showed over the horizon and tongues extending out of their mouths. Their tongues each 1/2 mile across begin licking up whole buildings and streets. People scream and panic in the unnerving end of their city. Thousands die with each lick. People flee in all directions but with no use they perish inside the bottomless pits of the two women.<br>\r\n<br>\r\n\"Ummmm this taste good. Not what I expected though.\"<br>\r\n<br>\r\nIn a half hour all of Beijing rests inside the stomachs of two giant asians. The two women look around and then decide to....</span></div></div>",
            "created":1235970000,
            "id":654733,
            "title":"\"Doesn't taste like a egg roll\""
        },
        "1211111111221221212222":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Japan demands more stomping",
                "They mix things up some"
            ],
            "content":"<div class=\"\"><div> <span>The two looked at each other with a completely blank look and in monotone said \"We should level this entire country for the glory of Japan...\" the two returned to normal behavior and got up. Systematically they began crushing anything that looked like a city under their feet. Sometimes they simply put their foot down, other times they stomped, causing several cities to collapse.<br>\r\n<br>\r\nWithin minutes their death toll went from millions to well over a billion. They had hardly even begun their destruction on china, and stomping was starting to get boring for them...</span></div></div>",
            "created":1238994000,
            "id":671689,
            "title":"Destroy it all!!!"
        },
        "12111111112212212122222":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Enjoy me crushing cities against you!",
                "Enjoy this pathetic attack by the military!"
            ],
            "content":"<div class=\"\"><div> <span>Tila and Jarah got bored of all this stomping and laid down and started to roll around on the country, using their bodies like giant steam rollers. They flattened mountains, cities, rivers, dams, EVERYTHING under their unstoppable mass.<br>\r\n<br>\r\nTila stopped and laying on her back began to fan her arms and legs against the ground, in the same manner as someone would to make a snow angel. Meanwhile Jarah stood up to her full height and surveyed the damage they had done. Her and her masters seemed to be satisfied with the work they had done.<br>\r\n<br>\r\nJarah looked over at Tila making her earth angel, and then walked over to her. \"Having fun?\" she asked.<br>\r\n<br>\r\n\"OH YES! I just love the feeling of everything crushing against me!\"<br>\r\n<br>\r\n\"Oh do you? Then you should...\"</span></div></div>",
            "created":1239426000,
            "id":674153,
            "title":"They mix things up some"
        },
        "121111111122122121222221":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Put cities in your cunt",
                "Laid back as Tila's smashes cities against Jarah"
            ],
            "content":"<div class=\"\"><div> <span>Tila laid back across the ground, crushing thousands under her gorgeous back. A scream was heard then a pop. Tila looked up at Jarah as she lifts up a chunk of the landmass off the ground. The mass is filled with city blocks and teeming with thousands of people. Jarah smears the mass against Tila's body. She rubs it across Tila's breast and down to her stomach. Tila lets off a moan as the sensation runs through her body. <br>\r\n<br>\r\nJarah then...</span></div></div>",
            "created":1242277200,
            "id":691071,
            "title":"Crushes cities against Tila"
        },
        "1211111111221221212222211":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "awake to find the World's army",
                "awake to find another Giantess"
            ],
            "content":"<div class=\"\"><div> <span>Jarah always wanted to know how this felt. She looks down to see the remaining cities of China. Only Hong Kong and the surrounding areas still stand. She scoops of the cities with her hand and slides them inside her. The sensation runs through her body. She moans as the feeling of entire cities and millions of people are being used to masturbate. She grabs more and more cities and shoves them in. <br>\r\n<br>\r\nTila watches the event and decides to do the same, city after city is placed inside them. <br>\r\n<br>\r\n\"MORE, OH YES MORE!!!!\" Tila cries out as she goes on. Jarah goes faster with her hand, the screams of millions can be heard as she smashes them inside her more vigorously then suddenly it happened.<br>\r\n<br>\r\nTila and Jarah climaxed at the same time. The moans are heard across the entire Earth. A eruption is let loose from their vagina that the Earth has not felt since its creation. Cum explodes out of each them that reaches the atmosphere. It travels as far as Moscow and Cairo. Cum rains down upon the nations of the Earth that drown out valleys and floods the countryside. Jarah last squirt blasted the side of the Himalayas mountains and leveled them to hills.<br>\r\n<br>\r\n\"That was so much fun Jarah\",said Tila. \"We need to do that more often\"<br>\r\n<br>\r\nThey both look across China to notice it was barren before falling asleep.<br>\r\n<br>\r\nThey...</span></div></div>",
            "created":1243746000,
            "id":700145,
            "title":"Put cities in her cunt"
        },
        "12111111112212212122222111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Tanks, aircraft, and other weapons",
                "Hundreds of 25 mile tall women"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tila and Jarah woke up from their slumber to find they were surrounded by an entire army of...</span></div></span></div>",
            "created":1250312400,
            "id":744402,
            "title":"awake to find the World's army"
        },
        "121111111122122121222221112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "The women have giant sized weapons (They would'nt stand a chance)",
                "The women are unarmed (They might be able to take these girls out)"
            ],
            "content":"<div class=\"\"><div> <span>Tila was surprised to see several feet around here, she looked up and saw several women looking down at her and Jarah.<br>\r\n<br>\r\nJarah started to wake up shortly after Tila did and was greeted with a similar sight<br>\r\n<br>\r\n\"Tila Tequila! Jarah Mariano! You will surrender to us now, or be destroyed!\" said one of the women with her hand on her hips.<br>\r\n<br>\r\nTila and Jarah began to stand up to their full size. Upon doing so they noticed that the hundred or so women around them were only half their size.<br>\r\n<br>\r\n\"Who are you women?\"<br>\r\n<br>\r\n\"I am Jessica, and these are my soldiers. We are the new world order, and no one can stop us. This world belongs to us now, and you two will be my ultimate weapon. Fail to obey me and you will find yourselves under my feet!\"<br>\r\n<br>\r\nTila took a good look at the women around her before she made her choice.</span></div></div>",
            "created":1250312400,
            "id":744516,
            "title":"Hundreds of 25 mile tall women"
        },
        "1211111111221221212222211121":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Follow Maria and Angela",
                "Follow the experimentation on Tila and Jarah"
            ],
            "content":"<div class=\"\"><div> <span>\"So what's with the weapons?\" Tila asked. \"Your almost as big as us, and nothing could even remotely hurt us, why do you need weapons?\"<br>\r\n<br>\r\n\"Each of us are armed for a reason. First is that we have an even greater edge over the pathetic population. Second is that none of us would dare try to over power the others. and Finally we wanted to make sure we could control you two!\" Jessica said as she waved her pistol around.<br>\r\n<br>\r\n\"Fair enough, apparently we can't do anything to stop all of you so what do you want from us?\" Jarah asked.<br>\r\n<br>\r\n\"You two have some uncanny ability to grow bigger and bigger at will. If we have that power at our disposal we can do far more than just rule the earth, we could rule the universe! Imagine each of us the size of planets... No... Stars! The size of entire solar systems! Entire galaxies will bend to our will and do our bidding! I want that power! I demand to know how you got it!\"<br>\r\n<br>\r\nTila and Jarah looked at each other, they did'nt even know how they got the ability to grow. They seemed to grow at random themselves.<br>\r\n<br>\r\n\"We... don't know... How did you all get to be this big? Perhaps that can help you again?\"<br>\r\n<br>\r\n\"It was a one time process, one that required the sacrifice of millions of puny male lives. Reproducing it again on this scale would be impossible without the risk of someone else gaining untold amounts of power.\"<br>\r\n<br>\r\n\"Interesting...\" Jarah mumbled<br>\r\n<br>\r\n\"Neither of you know how you became so large? Don't you know how to grow bigger? We saw on the TV Tila's sudden growth to 500 feet tall, and then the two of you suddenly grow to the size you are now.\"<br>\r\n<br>\r\n\"Well... Tila doesn't know....\" Jarah added. \"Japan was testing a formula designed to turn anyone into a super soldier. The formula failed to work on men, however in women it had a strong side effect of making them grow to insane heights. Tila was inadvertently exposed to the formula somehow. So I was given it to stop her.\"<br>\r\n<br>\r\n\"So where can we get this formula from?\"<br>\r\n<br>\r\n\"I don't know, but Japan has it. The problem is neither me or Tila can go and attack Japan, they seem to have us under some kind of mind control. I can only assume that all of you around us right now is stopping their signal from reaching us to order us around.\"<br>\r\n<br>\r\n\"Very interesting... Maria, Angela front and center!\"<br>\r\n<br>\r\nTwo women came forward out of the crowd and stood before Jessica. These women were obviously higher ranking than the others. Likely for other reasons beside their combat abilities, from the looks of them. <br>\r\n<br>\r\n\"You two will take two units of 10 each and go to Japan. Get that formula, we must have it if we are to reach Goddess status!\"<br>\r\n<br>\r\nLooking up at Tila and Jarah, Jessica gave them a direct order \"and you two will lay down and allow us to experiment on you. First thing is to make sure you are no longer under anyone else's control EXCEPT FOR ME!\"</span></div></div>",
            "created":1250312400,
            "id":744545,
            "title":"The women have giant sized weapons (They would&..."
        },
        "1211111111221221212222211122":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "These girls have an edge that can't be seen",
                "Tila has a point, attack now"
            ],
            "content":"<div class=\"\"><div> <span>\"You little bitches think you can stop the two of us? I suggest you go and look in the mirror because you are all shrimps to us! We'll kick your ass\"<br>\r\n<br>\r\nJarah started to feel confident as well with Tila's words. \"Yeah I could probably take on 5 or 6 of you at once and not break a sweat.\"<br>\r\n<br>\r\nJessica looked at her soldiers and then back at Tila.</span></div></div>",
            "created":1250312400,
            "id":744524,
            "title":"The women are unarmed (They might be able to ta..."
        },
        "12111111112212212122222111221":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Elemental control",
                "Another super power"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"HAHA! You two think your size alone makes you more powerful. Well I hate to break it to you, but me and my entire army have a few powers ourselves!\"<br>\r\n<br>\r\nWhat kind of edge do these women have?</span></div></span></div>",
            "created":1250312400,
            "id":744532,
            "title":"These girls have an edge that can't be seen"
        },
        "121111111122122121222221112211":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Tila surrenders",
                "Tila fights alone"
            ],
            "content":"<div class=\"\"><div> <span>Tila and Jarah laughed back at the smaller women, calling their bluff.<br>\r\n<br>\r\n\"You little bitches don't have anything on us!\" Tila shouted at the leader.<br>\r\n<br>\r\nJessica pointed a Tila and a bolt of lighting shot from her finger just barely missing her face.<br>\r\n<br>\r\n\"That's a warning shot! I suggest that you two drop to your knees now, and do my bidding, unless you want to see a more powerful version of that down your throat!\" she commanded.<br>\r\n<br>\r\nJarah looked at Tila, and then back at Jessica. She then got down onto her knees and bowed to her new master.<br>\r\n<br>\r\n\"What are you doing?! We can fight them!\"<br>\r\n<br>\r\n\"You can fight them... I am going to do the wise thing and give in!\" Jarah said.<br>\r\n<br>\r\n\"Last chance Tila... Join us.... now... Soldiers! Ready! Aim!\" Jessica said as she pointed at Tila along with the hundred other women.</span></div></div>",
            "created":1255150800,
            "id":773486,
            "title":"Elemental control"
        },
        "1211111111221221212222211122111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Follow Jessica as she has fun in Russia",
                "Follow the torture and testing on Tila and Jarah"
            ],
            "content":"<div class=\"\"><div> <span>Tila looked at Jarah, she couldn't believe that she just simply gave up. If the two of them fought together...<br>\r\n<br>\r\n\"FINE! You win!\" Tila shouted throwing her arms up in the air.<br>\r\n<br>\r\n\"Then bow to me, and kiss my feet slave!\" Jessica commanded<br>\r\n<br>\r\n\"Wha? What!\"<br>\r\n<br>\r\n\"DO IT!\" she pointed to the sky again and fired another massive bolt of electricity.<br>\r\n<br>\r\nTila quickly got to her knees and began kissing the feet of Jessica.<br>\r\n<br>\r\n\"Yes, that's a good slave. Now you Jarah! Kiss my second in commands feet as well!\"<br>\r\n<br>\r\nJarah crawled over and did as she was commanded.<br>\r\n<br>\r\n\"Tomorrow you two will reveal the secrets to your growth! and I will become the most powerful woman in the universe!\" Jessica laughed as her troops began making preparations for the equipment.<br>\r\n<br>\r\nWhen morning came, Tila and Jarah awoke to Jessica's commands yet again. <br>\r\n<br>\r\nYou two! Get over there and assist them in connecting the devices to yourselves!<br>\r\n<br>\r\nOnce again, they did as they were told. <br>\r\n<br>\r\nWhile the scientists ran their tests Jessica looked toward Russia with a sparkle in her eye.</span></div></div>",
            "created":1255150800,
            "id":773490,
            "title":"Tila surrenders"
        },
        "12111111112212212122222111221111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "The work is complete",
                "It is impossible for Jessica to gain Tila's powers"
            ],
            "content":"<div class=\"\"><div> <span>Knowing that it could take hours, possibly even days for the work to be completed Jessica decided it was time to enjoy the better parts of being a Giantess Demi Goddess.<br>\r\n<br>\r\nShe began walking towards Russia, there she would show the little people a small sample of her power... and maybe warm things up there for them some.<br>\r\n<br>\r\nAs she walked entire villages disappeared under her toes. So small they were to her that a single toe could wipe out 20 or more if they were close enough. Small towns met the same fate. They were too small for her to see or even care about. What Jessica wanted was to find Moscow!<br>\r\n<br>\r\nSurely she could find it, it should be big enough for her to see even from her height. However being that it was the middle of winter, everything is covered in snow, so the chances were pretty low.<br>\r\n<br>\r\nShe walked from one side of the country to the other, and back and forth. She just simply could not find the puny city. She then got down onto her hands and knees and began crawling across the countryside trying to find it. Each little thing she suspected to be the city she gave a small puff of her breath to it. The heat from her breath instantly melted any snow or ice, and turned it into water. Her next motion would be to move forward again, and quickly she found that she was getting muddy.<br>\r\n<br>\r\n\"DAMNIT! My uniform is getting muddy! You insects will pay for this soon enough!\" she shouted as she began to strip down to nothing. Ironically throwing her clothes on the very city she was looking so hard for, crushing it to dust.<br>\r\n<br>\r\nJessica continued her routine of crawling, exhaling, and searching for her target. When she did find a city she managed to watch it for a little bit before the flooding wiped a large portion of it out. In anger she slammed her fist down, splattering mud over herself and turning the city into a mud pit.<br>\r\n<br>\r\nShe then thought that maybe she could feel the cities with her fingers first. This seemed to work better as she would find a city by it's little puffs of smoke and dust raining from the damage she had done.<br>\r\n<br>\r\nThe first city she could play with she simply poked and prodded at with her fingers.<br>\r\n<br>\r\nNever before had she gotten a chance to play with a city. Her soldiers always stomped them flat before her. Now it was her turn to play. She was amazed at how absolutely pathetic the buildings were, how small, and yet so detailed they seemed to be.<br>\r\n<br>\r\n\"How can anything this small continue to exist?\" she wondered aloud as she picked up a skyscraper. It quickly turned to dust before it reached a thousand feet in the air. \"Hmph... I guess it can't...\"<br>\r\n<br>\r\nHer play was disturbed again by the melting snow and ice. The heat from her body had melted it all for miles around, and now she stood in a massive mud pit. Giving up on staying clean, she plopped herself down in the mud and rolled around. Her massive mamaries became coated with mud as well as her face and legs.<br>\r\n<br>\r\n\"Get a good look little ones... this is the closest you will get to a Goddess's mud wrestling show... unless your IN IT!\" she said as she slid over to another city and dropped her breasts down on it, smothering it out of existence.<br>\r\n<br>\r\nShe continued her poking and prodding of cities, eventually using her fingers as if they were a giantess their selves to stomp and destroy. But none the less the giantess got bored as it always happens when you can't find your plaything, and resorted to pleasuring herself.<br>\r\n<br>\r\n\"You know... I would feed an entire city to this cunt of mine, but I don't want to get dirt and filth inside of me! So allow me to wash it away for you!\" she said as she sat down before another city and furiously rubbed herself. The trickle of her juices slowly dripped out and flooded the city, doing the dirty work for her.<br>\r\n<br>\r\nAfter reaching her climax she simply stood up and talked to the sea to rinse the mud off.<br>\r\n<br>\r\n\"I so needed that, no wonder my soldiers take so long when I send them to destroy cities... heheh\" she said as she put her clothes back on, inadvertently stepping on Moscow several times as she put her pants back on. She delivered the final blow when she went to put her boots on and tie them up. She noticed a small amount of smoke coming from under her boot.<br>\r\n<br>\r\n\"Even putting my clothes on is a disaster for you people... It's a shame... If only I found Moscow I probably wouldn't have wiped your country out... But let it be known, I will be back to find it!\"<br>\r\n<br>\r\nShe stood back up and headed for her camp to check on her pet project</span></div></div>",
            "created":1255237200,
            "id":773513,
            "title":"Follow Jessica as she has fun in Russia"
        },
        "1211111111221221212222211122112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Jarah agrees",
                "Jarah refuses"
            ],
            "content":"<div class=\"\"><div> <span>\"Fuck you!\" Tila shouted as she jumped up and towards the smaller Jessica.<br>\r\n<br>\r\nJessica fired a mighty blast knocking Tila out before she could get more than a couple miles off the ground.<br>\r\n<br>\r\n\"Pathetic... \" she mumbled.<br>\r\n<br>\r\n\"Jarah! When she awakes you will prove your loyalty to me! You will kill her in combat!\"</span></div></div>",
            "created":1255150800,
            "id":773492,
            "title":"Tila fights alone"
        },
        "12111111112212212122222111221121":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Jarah wins",
                "Tila Wins"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes my master! I will destroy her right now!\" Jarah stood and began talking toward Tila.<br>\r\n<br>\r\n\"NO! Not now, wait for her to awaken, and fight her! I want to see the look on her face when you defeat her!\"<br>\r\n<br>\r\nThey all waited several minutes for Tila to reawaken, when she did she found Jarah standing over her.<br>\r\n<br>\r\n\"Tila my new master demands that I destroy you, and I shall!\"<br>\r\n<br>\r\nStill groggy from waking up, Tila got to her feet and backed away from Jarah.<br>\r\n<br>\r\n\"Do you always give in to pathetic little people like that? First Japan... and now this bitch?!\" Tila said rubbing her head.<br>\r\n<br>\r\n\"I'll follow anyone who can give me more power!\" she shouted as she charged Tila, growing bigger with each thunderous step.<br>\r\n<br>\r\n\"So... It's a battle of size you want!\" Tila shouted as she crouched and performed a jumping uppercut, hitting Jarah square in the jaw. \"Then it's a battle of size your going to get!\" she said landing at now twice her previous size.</span></div></div>",
            "created":1255150800,
            "id":773497,
            "title":"Jarah agrees"
        },
        "121111111122122121222221112211211":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Tila is dead",
                "Tila becomes the earth"
            ],
            "content":"<div class=\"\"><div> <span>\"Your size power is nothing compared to mine Tila! If you gave in, maybe you wouldn't get to know the bottom of my foot!\"<br>\r\n<br>\r\nJarah shouted as she kicked the massive Tila in the face, while giving herself another massive size boost to bring her to nearly 1,000 miles tall.<br>\r\n<br>\r\nStill flying through the air, Jarah doubled in size yet again and plowed a massive fist several times bigger than Tila straight into the woman. Tila slammed into the ground as Jarah mercilessly pummeled her.<br>\r\n<br>\r\nThe pain and surprise of the attack was too great for Tila to be able to fight back. She was helpless as Jarah had her way with her.<br>\r\n<br>\r\nMeanwhile Jessica watched with awe at the true power that Jarah had. She could'nt wait to merge with this woman and become the most powerful being in existence.<br>\r\n<br>\r\nTila quickly became unconscious  from Jarah's assault. Yet Jarah still sat crouched over the smaller woman, pounding her. Creating massive fissures in the planet, and plowing the body of Tila past the crust of the planet and into the molten interior.<br>\r\n<br>\r\nRealizing her victim was no longer resisting Jarah stood back up to her full height of 2,000 miles tall and looked down at Tila. She delivered a massive final stomp, twisting her foot several times to force Tila into the core of the planet.</span></div></div>",
            "created":1255150800,
            "id":773502,
            "title":"Jarah wins"
        },
        "1211111111221221212222211122112111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Jarah agrees",
                "Jarah refuses"
            ],
            "content":"<div class=\"\"><div> <span>\"Excellent!\" Jessica exclaimed at the gargantuan Jarah.<br>\r\n<br>\r\nJarah looked down and saw the much smaller woman to the right of where the massacre just took place.<br>\r\n<br>\r\n\"With Tila beaten to a bloody pulp, we can now access her biological data much easier! Thank you!\" Jessica praised Jarah.<br>\r\n<br>\r\nShrinking back down to Jessica's height of 25 miles, Jarah took a knee and asked for her next command.<br>\r\n<br>\r\n\"Rest for now my soldier! With this victory, you and me will be able to gain power we have never dreamed of before. If the world thinks that we are Goddesses now, then they have no idea what a real Goddess is!\"<br>\r\n<br>\r\nThrough the night Jessica's soldiers and scientists worked hard with the new biological data they had from Tila. In the morning Jessica and Jarah was greeted with some news.<br>\r\n<br>\r\n\"Commander! The formula has been extracted, and you can now begin testing.\"<br>\r\n<br>\r\n\"Excellent!\" Jessica took the container from the scientist and quickly chugged it's contents. Her entire body began glowing a bright orange color, which turned to a blinding white light.<br>\r\n<br>\r\n\"THE POWER! I CAN FEEL THE POWER!\" she shouted as everyone, including Jarah had to look away from her.<br>\r\n<br>\r\nWhen the light finally faded Jessica still seemed to have a white aura to herself, and was marveling over her body.<br>\r\n<br>\r\n\"Yes! Now Jarah, it's your turn! Merge with me and turn me into a supreme Goddess! The power I now I have will be nothing! NOTHING COMPARED TO WHAT I WILL RECEIVE!\"</span></div></div>",
            "created":1255150800,
            "id":773504,
            "title":"Tila is dead"
        },
        "12111111112212212122222111221121111":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Use the army of 25 mile tall giantesses to pleasure herself",
                "Taste the planet"
            ],
            "content":"<div class=\"\"><div> <span>\"As you command master...\" Jarah got down on her knees and waited for Jessica to absorb her.<br>\r\n<br>\r\nJessica put a hand on her shoulder and began absorbing the raw power Jarah had. In a blinding light, even brighter than before both Jarah and Jessica where engulfed in it.<br>\r\n<br>\r\nAll that could be heard was the laughing of Jessica, which continued to get louder and louder. The voice seemed to be changing as well.<br>\r\n<br>\r\nFinally when the light died down, a bright red glow was emitting from everywhere. Jessica's all female giantess army looked up to see a new face. One that looked nothing like Jessica or Jarah (but looks exactly like Grace Park), looking down at them.<br>\r\n<br>\r\nJessica had now grown larger than the entire planet, and now had a red aura to herself. She was so large that her head alone was now the size of the entire planet.<br>\r\n<br>\r\n\"I WILL NO LONGER BE KNOWN AS JESSICA... I AM GODDESS.... BOW TO ME NOW OR BE DESTROYED! MUAHAHAHAHAHA!\"<br>\r\n<br>\r\nGoddess began laughed at the diminutive planet as she now floated in space.<br>\r\n<br>\r\nWith her infinite power, she could feel each and every being on the planet bowing to her. Those that did not simply turned to ash where they stood. In a split second she had killed a billion people because they either were not worshiping her, or did not worship hard enough.<br>\r\n<br>\r\nA massive grin formed on her face as she made her next decision.</span></div></div>",
            "created":1255150800,
            "id":773510,
            "title":"Jarah agrees"
        },
        "12111111112212212122222111222":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "The army of women stand no chance, Tila and Jarah win",
                "Tila and Jarah subcomb to the choke attacks, there are just too many of them"
            ],
            "content":"<div class=\"\"><div> <span>\"I figured you would have it this way... That's why there are so many of us. Girls... ATTACK!\" Jessica shouted as all the women rushed Tila and Jarah at the same time.<br>\r\n<br>\r\nSeveral had managed to jump up and get on Tila and Jarah's back while several attacked them from the front.<br>\r\n<br>\r\nTila and Jarah's strength was far greater than any one of these women. They might be twice as tall as them, but that means their strength and weight is 8 times greater than any one of them. Single punches were breaking and crushing bones and ribs. Kicks where breaking spines and in some cases ripping them in half.<br>\r\n<br>\r\nTila and Jarah were being covered in the blood of their tiny enemies. The more they killed the more seemed to be on them. The duo were crushing and breaking skulls with their bare hands, ripping the women apart like dolls.<br>\r\n<br>\r\nSeveral of the women teamed up and managed to push Tila and Jarah onto the ground. Where again more women managed to get onto the back of Tila and Jarah in an attempt to choke them out, as nothing else even seemed to hurt them. All the while dozens more piled on top of them to help hold the two women down.</span></div></div>",
            "created":1250312400,
            "id":744527,
            "title":"Tila has a point, attack now"
        },
        "121111111122122121222221112221":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Crush Jessica like a bug",
                "Accept Jessica's surrender"
            ],
            "content":"<div class=\"\"><div> <span>The women continued to pile on top of Tila and Jarah all while they combined their strength in an attempt to choke the two into submission. Tila could feel her body starting to get cold, when she suddenly unleashed all her fury and anger.<br>\r\n<br>\r\nWith a massive roar Tila threw the smaller women off of herself, and exploded in size. In seconds she had doubled in size again, and again bringing her to a massive 200 miles tall.<br>\r\n<br>\r\nFollowing suit Jarah had performed the same manuever and exploded in size as well matching Tila's massive size.<br>\r\n<br>\r\nThe two began mercilessly stomping and crushing the smaller women as they ran from them.<br>\r\n<br>\r\nJessica looked up at the two as they had grown even bigger and stronger than before.<br>\r\n<br>\r\n\"Everyone stop! Cease fire! Kneel before them! Let them know we yield!\" Several of the women stopped in their tracks and got on their hands and knees. Jarah and Tila were too caught up in their revenge and it took a few extra stomps before they realized the women were surrendering.<br>\r\n<br>\r\n\"Are they... giving up?\" Jarah asked<br>\r\n<br>\r\n\"I think so?!\" Tila added as she looked around the blood stained continent of Asia.<br>\r\n<br>\r\nJessica walked out to Tila and knelled before her.<br>\r\n<br>\r\n\"Please have mercy on us, we just wanted to be like you. To have power like yours!\"<br>\r\n<br>\r\nOut of the hundred women that began the attack roughly only a dozen and a half were still alive.<br>\r\n<br>\r\nTila looked at Jarah, and then back at Jessica bowing before herself.</span></div></div>",
            "created":1250312400,
            "id":744675,
            "title":"The army of women stand no chance, Tila and Jar..."
        },
        "12111111112212212122222112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "am your new master",
                "am going to show you true power"
            ],
            "content":"<div class=\"\"><div> <span>Tila and Jarah awoke to a cold feeling over them. Their instinct was to grab a blanket and put over themselves, but they quickly remembered that they were huge.<br>\r\n<br>\r\nLooking around they noticed two massive feet before them, several times bigger than they expected.<br>\r\n<br>\r\nTila and Jarah both followed the legs as they tilted their heads up higher and higher.<br>\r\n<br>\r\nThey quickly realized this woman was several times bigger than they were. Looking around again Tila confirmed they were still 50 miles tall, but this woman before them had to be close to 150 miles tall at least 3 times their size.<br>\r\n<br>\r\n\"SO! You two finally woke up. How does it feel to be the smaller ones for a change?\"<br>\r\n<br>\r\n\"Who... Who are you?\" Tila asked.<br>\r\n<br>\r\n\"My name is Jessica and I...\"</span></div></div>",
            "created":1250312400,
            "id":744409,
            "title":"awake to find another Giantess"
        },
        "121111111122122121222221121":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Free me from my master!",
                "Destroy Japan"
            ],
            "content":"<div class=\"\"><div> <span>\"I am your new master!\" Jessica pointed at the two massive women at her feet.<br>\r\n<br>\r\n\"No one commands us!\" Jarah shouted<br>\r\n<br>\r\n\"Except the mighty nation of Japan...\" said Tila blankly and emotionless.<br>\r\n<br>\r\n\"That's right, Japan controls you! Or did anyway! I have been given my powers by the United States Military for the sole purpose of countering Japan's two new ultimate weapons... You two...\"<br>\r\n<br>\r\nTila and Jarah stood up, and began to back away from this new woman.<br>\r\n<br>\r\n\"I have been given two devices to make sure you two are MY slaves, and thus are under command of the United States!\" she pointed down at the two women. \"The collars you have on, prohibit any further growth from you two, and if you fail to obey me will unleash an electrical charge that would put you in a world of hurt\".<br>\r\n<br>\r\nJarah and Tila began checking their necks, and sure enough they had collars on. They tried to remove them, but simply could not.<br>\r\n<br>\r\n\"Don't bother ladies, neither of you have the strength to remove them, even combined. Besides by now they have burrowed their way into your skin enough that they are a part of you now!\"<br>\r\n<br>\r\nSure enough Tila and Jarah looked at each other disparately trying to just get their fingers between the collar and their skin, and found it was impossible.<br>\r\n<br>\r\n\"We will not be slaves to YOU!\" Tila said as she began charging at Jessica.<br>\r\n<br>\r\nJessica raised her eyebrow and laughed as Tila suddenly fell to her knees screaming.<br>\r\n<br>\r\n\"You were going to do what now?\" Jessica said as she got down on their level. \"Go ahead, hit me! Punch me! STOP ME!\" she laughed with her massive face as close as it could be to Tila before she turned it to Jarah.<br>\r\n<br>\r\nTila's pain stopped as Jessica smiled back. \"Now be a good little girl and I won't have to do that again.\"<br>\r\n<br>\r\n\"What... What do you want us to do...\" Jarah questioned.</span></div></div>",
            "created":1250312400,
            "id":744419,
            "title":"am your new master"
        },
        "1211111111221221212222211211":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Only Jessica can control them",
                "The USA has control of them directly, just two more giant slaves"
            ],
            "content":"<div class=\"\"><div> <span>\"Free me from my Master! Go to the United States and level it before they regain control of me... meh... AHHHH!\" Jessica shouted as she dropped to her knees holding her head in pain.<br>\r\n<br>\r\nJust like Jarah and Tila she was a slave as well. Now they had a new master who wanted them to do her bidding. They knew that it was better for them to destroy the USA than to be a puppet of a puppet.<br>\r\n<br>\r\nThe real question now was, were they under direct control of Jessica or the USA?</span></div></div>",
            "created":1250312400,
            "id":744439,
            "title":"Free me from my master!"
        },
        "13":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she is amazed",
                "she grows some more"
            ],
            "content":"<div class=\"\"><div> <span>The sweet smell of flowers fill the air in the city of Paris. It is a beautiful day. Tourists are crowded in the streets taking pictures. A bus pulls up to a stop and lets of its passengers. Tila gets off and looks around. The view is beautiful. She starts walking looking for a restaurant to eat. She goes to pull out her cell phone to take a photo of the scenery when a small electric spark from the phone shocks her.<br>\r\n<br>\r\n\"Ouch\", she says. She begins to look down at her hand for any mark but none. Suddently she begins to notice things are changing around her. Her clothes tighten on her body then ripe to shreds. She begins to get higher and higher. Her head passes the buildings nearby her. She begins to cast a shadow over the people but no one notices. She continues to grow to a height of 500 feet! </span></div></div>",
            "created":1226898000,
            "id":608760,
            "title":"France"
        },
        "131":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she is angry",
                "the people obey "
            ],
            "content":"<div class=\"\"><div> <span>Tila is amazed at what has happened. She looks around at the view. Most buildings only come up to her chest. In the distant she can see the Eiffel Tower only towering over her. She begins to laugh as she sees the small people travel through the streets.<br>\r\n<br>\r\n\"Wow, Paris looks nice from up here\", Tila says down to the people.<br>\r\n<br>\r\nThe people are startled from hearing a voice from up above. They look up to see only a 500 foot asian woman towering over them. Her chest is sticking out to cast a shadow over the streets below. People are staring in astoushment at what stands before them.<br>\r\n<br>\r\n\"People of France, I am your goddess and I have demands. First I want to worship as I should be\" , Tila says loud over the cowering people.<br>\r\n<br>\r\nThe people are frightened and begin to run away.<br>\r\n<br>\r\n\"Hey come back!!\", she says<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1226898000,
            "id":608765,
            "title":"she is amazed"
        },
        "1311":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she grows"
            ],
            "content":"<div class=\"\"><div> <span>Tila looks down at the people as they run. Tila begins to move across the streets after the people. People who are at a outside diner sees a shadow cast over them only to be followed by their end. Tila begins stomping people and cars in the ground. Her stomps are felt through most of the city.  She looks over to see a overpass with hundreds of people are trying to flee. <br>\r\n<br>\r\n\"Ummm...all this work is getting me tired\", she says.<br>\r\n<br>\r\nShe starts to move to the overpass. She walks right through it with ease. She kneels down to set her head even to the overpass. She opens her mouth. The people try to flee the other way but no hope. She begins to inhale, dragging hundreds into her mouth. Some crash up against her teeth and other fall helplessly against her tongue. <br>\r\n<br>\r\n\"Tasty....Your all so good\"<br>\r\n<br>\r\nShe begins to move towards the housing district. She sees people crowded in the buildings trying to hide. Tila begins poking people out of the building one by one into her hand. \"Your all my little dolls, and I want to play\",she says. After a while she gets 20 to 3- in her hand and starts to eat them. Tila stands up and gets a feeling in her stomach.<br>\r\n</span></div></div>",
            "created":1226898000,
            "id":608768,
            "title":"she is angry"
        },
        "13111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Tila's playground"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins to get a feeling. She looks around to see things getting smaller and smaller. She grows more and more until she reaches a height of 1000 feet. She looks around to see no building higher than her. Ideas begin to run through her head. Her pussy begins to heat up with her emotions.<br>\r\n<br>\r\n\"I guess it's time to have fun in the playground\", Tila says. She begins to move toward the busy city with a grin across her face.</span></div></div>",
            "created":1226898000,
            "id":608770,
            "title":"she grows"
        },
        "131111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "The people worship"
            ],
            "content":"<div class=\"\"><div> <span>A group of people start to fill up a bus to leave the city. They pack into the bus as much as they can fit trying to flee from the giantess that is in their city. As the bus pulls out and goes into the streets, the bus is stopped in its tracks and lifted into the air. <br>\r\n<br>\r\nTila picks up a bus with a idea in mind for her own use.  \"Hey guys, I hope you weren't going to leave without saying goodbye\". She sucks on the bus for a moment then inserts it inside her. She moans as she pushes it back and forth until her orgasm forces her to crush the bus in her hand. Blood and steel falls from her hands.<br>\r\n<br>\r\n\"Awww...I want to play some more\", she says.<br>\r\n<br>\r\nTila begins to goes through the streets using her tits to knock over buildings that are closer to her height.  Huge imprints are placed in office buildings all around the city. Each the size big enough to fly a small plane. She giggles as she hugs buildings to starts to grind on them as they fall to the ground.<br>\r\n<br>\r\n\"This place is so fun\"<br>\r\n<br>\r\nShe begins to get aroused from all her horseplay in the city. Her pussy moists up and begins to drip. Her drops begin to crush cars and small homes. People drown in her drips. She giggles at the thought of the destruction cause by her little drips.<br>\r\n<br>\r\n\"People of France, I give you one last time to save yourselves and worship me.\"</span></div></div>",
            "created":1226898000,
            "id":608773,
            "title":"Tila's playground"
        },
        "1311111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Tila gets what she needs",
                "Tila destorys FRANCE"
            ],
            "content":"<div class=\"\"><div> <span>Tila looks down to see the people beginning to come out of their homes. They gather at her feet and kneel down to pray to her.<br>\r\n<br>\r\n\"Nice, now I feel that its time to satisfy my self.\"<br>\r\n<br>\r\nTila notices that her sexual lust is growing by the minute.  She needs to find a way to satisfy it but how she wonders. She doesn't want to use all these people. Then she feels a sensation go through her body. She notices another change. She is now 2000 feet tall!!!! Her body is now a goddess that nothing can come close. She begins to realize her body is unstoppable and incredible. It is perfect to every detail. Her pussy is in full wanting. Her chest has grew to perfection. They are round and smooth. She admires herself and looks over the city only to spot something that could do the job.</span></div></div>",
            "created":1226898000,
            "id":667909,
            "title":"France surrenders!!!!"
        },
        "13111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she grows again",
                "she wants more"
            ],
            "content":"<div class=\"\"><div> <span>Tila looks in the distance and sees her the Eiffel Tower. She smiles at what can become of it. She begins to move towards the tower, leaving only destruction in her wake. Buildings and people are wiped out under her feet. She grows more and more horny as she approaches the tower.<br>\r\n<br>\r\nShe looks down at the tower which comes a little bit under her knees. She smiles at the idea of what is about to happen. She begins to straddle the tower and slide down on top of it. She lets out a moan as it enter her pussy. The steel can be heard being put under stress. She begins to go farther up and down the tower. She begins to ride the tower to its base. Faster and harder she goes. The tower begins to lose strength under the pressure being put on it. Tila moans louder as her voice is heard over all of Paris. Cum runs down the tower and forms pools big enough to be small lakes.  People stare in shock as what they are seeing. Their national momunment being used for pleasure by an giant gorgous asian woman. The ground shakes and her orgasm gets more intense. Suddendly the tower gives away as her orgasm spews out cum everywhere. Cum fills the streets and floods buildings up to two stories. She smiles down below at what she has done. Then she gets a feeling.....</span></div></div>",
            "created":1226898000,
            "id":608778,
            "title":"Tila gets what she needs"
        },
        "131111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Europe attacks Tila",
                "she destroys Paris"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins to grow at a amazing rate. Buildings become smaller and smaller as she rises to greater heights. Tila grows until she reaches the height of 5000 feet!!!!  People all over Paris look up to see with astonishment of what has just happened. Before they lays a giant naked asian woman towering over their beloved city. Tila looks down to see what is down below. She laughs to see the people begin to run as she grins down at them. <br>\r\n<br>\r\n\"Well let's see what else France has\", she says as she take her first step.<br>\r\n<br>\r\nIn a instant a entire city block is leveled under her foot. Each step can be felt all over France. She is still aroused after the last \"toy\" she had in her. Her pussy becomes moist and begins to drip. Drops of cum go raining down upon the city. Each drop destroynig whole streets making craters the size of football fields. People by the hundreds begin to drown in her little drips. She giggles as she looks down to see what her fun has done.</span></div></div>",
            "created":1226984400,
            "id":609179,
            "title":"she grows again"
        },
        "1311111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she grows to Giga size",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Deep down in a bunker in the Alps lies leaders from all over Europe....<br>\r\n<br>\r\n\"Then the decision is made, prepare to attack!!!\", says a shadowed figure as he hits a red button.<br>\r\n<br>\r\nTila stares over the distant countryside deciding where to go next. She smiles to see what has happened in Paris and wonders what to do. Suddendly she looks at the sky to see hundreds of little dots flying towards her.<br>\r\n<br>\r\n\"Owww....now what can you guys be giving me to play with now?\"<br>\r\n<br>\r\nThe missiles strike her at the same time leaving a bright flash....</span></div></div>",
            "created":1226984400,
            "id":609180,
            "title":"Europe attacks Tila"
        },
        "13111111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she goes to England",
                "she goes to the sea"
            ],
            "content":"<div class=\"\"><div> <span>The flash is brighter than anything she has ever seen. Her eyes open after it dims to see a very different view than before. She looks around to see that she must be miles high now. Clouds now roam around her. She smiles as thoughts run through her head on what to do. She begins to move and take her first step destroying an entire city in a flash. People down below are shocked all around Europe to see even as far as Poland a giant Tila Tequila roaming around in Europe. Her body feels so horny and wants more and more every second.<br>\r\n<br>\r\n\"Nothing can stop me now...I shoul probably start playing\"</span></div></div>",
            "created":1226984400,
            "id":609182,
            "title":"she grows to Giga size"
        },
        "131111111111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Tile rains milk on them",
                "Tila destroys England!!!"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins to march across the little English Channel. She wonders what she will see in England. She puts her face closer to a little grey patch which she thinks is London. Looking down she can barely make out buildings. She smiles as she begins to play.<br>\r\n<br>\r\nThe streets are crowded and full of panic as word has traveled to them about the giant asian. Even more they look up and saw her approach them with death looming in their eyes. As they look up for a moment they see her gigantic face and chest close to them as if planets. She casts a shadow over all of southern England. As they look up in silence they see her grin and a giant finger comes down. In a instant her one finger comes down destroying Buckingham palace. Then again it comes down again crusing another building. They people flee and run but there is no hope as she looks down from above and pummels each building one by one into destruction. All of England's air force is launched to give one massive assault. As they approach they prepare to fire...5...4..3..2..1...then they are gone. Tila moved a little to see what was going on over to her right and her massive chest moved through the air and wiped out all the planes. She giggles as she notices what her boobs can do. She begins rubbing them and moans. </span></div></div>",
            "created":1226984400,
            "id":667905,
            "title":"Conquering England"
        },
        "1311111111112":{
            "author_id":"liquidz",
            "author_name":"LiquidZ2k",
            "choices":[
                "Go to the United States",
                "Go to Russia"
            ],
            "content":"<div class=\"\"><div> <span>Observing the simple power of her breasts, Tila decided to test their true power.<br>\r\n<br>\r\nSwinging them back and forth she began to lower them down more and more. The closer they got the more destruction the air flow they created caused. Finally her breasts began to make contact with the tiny city. The buildings offered no resistance at all and were instantly turned to dust and they continued to get lower and lower. Until eventually they no longer were swinging, but starting to bulge out as her mass pressed them down and around everything in the area.<br>\r\n<br>\r\nTila rested on her stomach for a few minutes before she carefully raised back up. She was hoping to see two massive craters that her breasts would have left, however she was disappointed to see that water had already started to fill her marks.<br>\r\n<br>\r\nTila was not amused by this as she wanted to leave two huge tit marks on the planet. Realizing she had to go somewhere more inland so they would not flood again, she decided to...</span></div></div>",
            "created":1250312400,
            "id":744434,
            "title":"Tila destroys England!!!"
        },
        "131111111112":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she goes to Italy",
                "She travels across the Atlantic"
            ],
            "content":"<div class=\"\"><div> <span>Tila smiles as she walks through France. She begins to move south and sees the sea which to her is like a kiddie pool. Each footstep killing thousands. Little drips of cum fall from her pussy, destroying whole towns. She giggles as she steps over France, her steps are felt around the world.<br>\r\n<br>\r\nAs she reaches the sea, she begins to sit down. Down below in a small city people look up to see a giant smooth ass coming down on them. Thousands of cries are let out but Tila is too large to hear them. Her ass crushes hundreds of towns leaving a giant crater. Tila dips her legs into the sea washing off hundreds of towns and millions of people off her body.<br>\r\n<br>\r\nShe looks down to see between her legs a small bit of land. It is speckled in Grey and she notices it is by the sea. It is the city of Marseilles. <br>\r\n<br>\r\nThe people down below look to the north to see a giant cunt towering over them. Heat emitting from it brings the temperature to scorching temps. <br>\r\n<br>\r\nTila looks down and smiles. \"Well I guess I found another toy. I hope you guys like me as much as I like you.\"<br>\r\n<br>\r\nTila cups her hands together and begins pushing the entire city into her cunt. Thousands of people try to flee but there is no where to go but in. Screams of horror are let out as they go into the gigantic cunt. Tila starts to moan as she put the city into her. She pushes her fingers together and rube it around in her. \"OH YES, I NEVER THOUGHT CITIES COULD BE SO FUN!!!\" Tila starts to moan more and more. All of Europe can hear her and even see the disaster taking place. Her legs start rattling along the ocean floor causing tremors around the world. \"OH YES!! MORE!!! MORE!!!!\" Suddenly her body lets out a stream of cum. Her cum fills across the Mediterranean Sea destroying ships and over flowing smaller islands.The waves of cum reach the coast of Africa and wash ways hundreds of miles inland. Millions have dies in moments. A white goo now floats above the sea. Tila decides to try to fulfill her pleasure lust that burns inside her, she then... </span></div></div>",
            "created":1226984400,
            "id":667907,
            "title":"March to the Mediterranean"
        },
        "1311111111121":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "she plays with Europe",
                "Tila runs rampant!!!!"
            ],
            "content":"<div class=\"\"><div> <span>Tila begins moving over to Italy. She always wanted to go there see the places and even eat the so called, \"Taste of Italy\". Tila thought of it as her stomach rumbled. She was hungry after all her orgasms and she needed something to fill it. She walks through the country and bends down close to where she think is Rome. Millions are killed in a instant.<br>\r\n<br>\r\nIn the city the sun is blocked out. People begin to scream as they look up only seeing Tila Tequila's face and her massive tits. Even knealt down her tits lay on the ground. The people stare at her magnificent body and tits only to await their end. Her mouth opens and lets out her tongue. Her tongue is miles long and begins scrapping up all of Rome. She begins to lick more and more, picking up whatever is on the landscape. Panic runs through the streets as the run from a mile long pink tongue. As she devours most of central Italy with a single lick she begins licking her lips.<br>\r\n<br>\r\n\"Ummmmm..you all taste so good. I wish there was more of you.</span></div></div>",
            "created":1226984400,
            "id":667910,
            "title":"Tasting Italy"
        },
        "13111111111212":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Spain",
                "Germany"
            ],
            "content":"<div class=\"\"><div> <span>Tila stands up and looks around. She looks down to see all of Italy beneath her. She picks her foot up and in a instant she slams it down splitting Italy into two. Shockwaves are felt across all the Earth. She smiles down at what she has done. She wonders where shall begin her rain of terror?</span></div></div>",
            "created":1230526800,
            "id":626334,
            "title":"Tila runs rampant!!!!"
        },
        "131111111112122":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "something else??????",
                "Destroy it off the face of the Earth"
            ],
            "content":"<div class=\"\"><div> <span>Tila looks over to see the peacful country of Germany. She can see the Alps which look like an ant hill. She begins to wall which took less than a minute to reach the country. In 12 steps her footsteps made crater-size lakes and killed over 10 million people in the earthquakes make. She looks down on the puny country and decides to...</span></div></div>",
            "created":1236056400,
            "id":680014,
            "title":"Tila versus Germany"
        },
        "1311111111121222":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Go east and conquer Russia",
                "Go south and destroy Africa"
            ],
            "content":"<div class=\"\"><div> <span>Tila wants this country to be destroyed. She gets on her hands and knees to look closer to the country. Her knees and arms destroy millions of lives in moments. She wants to see the destruction first hand. At this level, she still can't tell the cities that well. Tila leans closer to the ground to see them, her breasts touch the ground obliterating cities and the landscape.<br>\r\n<br>\r\nShe sees the panic of thousands running through the streets, begging for mercy, crying as their lives are to an end. She takes her hands and rubs the ground across the country, millions are crushed in her fury as screams are silenced by one hand sweep. She smiles as she can see the rivers turning red. Tila stands up. She notices some parts of cities are stuck to her chest when her tits touched the ground. She dusts the cities off and admires how perfect her body is. <br>\r\n<br>\r\nTila decides to</span></div></div>",
            "created":1243746000,
            "id":700140,
            "title":"Destroy it off the face of the Earth (Germany)"
        },
        "1312":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "They decide to submit to this superior woman and worship her unconditionally.",
                "They decide to continue running from her and accept whatever fate has in store.",
                "The millitary arrives and interupts the scene!"
            ],
            "content":"<div class=\"\"><div> <span>Seeing the pathetic people at her feet running in fear from her, Tila began to get irritated. These worthless little bugs should be worshipping her, not running from her! She immediately raised her voice to a level that cracked the windows of the surrounding buildings.<br>\r\n<br>\r\n\"I <i>said </i><b>GET BACK HERE</b>!!!!!\"<br>\r\n<br>\r\nTila then lifted her foot up and sent it crashing down on top of a nearby building. The small structure put up a little resistance, but it quickly yielded to the immeasurable power of Tila's brutal bare foot. Within seconds, the space that was once occupied by a building was now filled by nothing but rubble. Hearing the crash of the giantess's foot passing through a building and slamming into the ground below, all of the citizens who were fleeing from her were now paralyzed with fear. <br>\r\n<br>\r\nThey turned back to see the carnage that this goddess had so easily inflicted upon one of their buildings, and knew that she was through messing around. Every single one of them looked up at her gorgeous face to see an annoyed expression on it. They all quickly realized that if they didn't surrender and bow down to her as she demanded, then they would be in a <i>much</i> worse condition that that building under her divine foot was. Tila then glared at the small crowd.<br>\r\n<br>\r\n\"Well?! What are you pathetic little worms waiting for?! Get over here <b>right now</b> and worship your new goddess!!!\"<br>\r\n<br>\r\nThe terror that Tila had struck them with was too much. They crowd immediately realized the choice that they had to make: worship this titanic woman as a goddess, or have their lives snuffed out of existence beneath her omnipotent feet. <br>\r\n<br>\r\nWhat will the citizens of France do now?!</span></div></div>",
            "created":1300048920,
            "id":1069769,
            "title":"Too terrified to escape..."
        },
        "13121":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "\"Service my divine feet! I want them to be cleaned and massaged flawlessly!\"",
                "\"Gather a grand feast for me! If you fail to satisfy my appetite, I'll eat YOU!\""
            ],
            "content":"<div class=\"\"><div> <span>Within moments of seeing Tila's display of power, the helpless French citizens realized that she was clearly going to be the one in charge of their fate. Rather or not they went along with her, she was capable of doing anything that she wanted to do with them. It was a universal conclusion that they would be better off if they simply surrendered to the obviously superior power that is Tila. The entire group walked back in front of her and began to bow down to her feet; lest they find themselves <i>beneath </i>said feet. Tila simply laughed.<br>\r\n<br>\r\n\"Ah, that's much better! It seems that you insignificant bugs have finally learned your place! Now for my first order as your supreme goddess: I want you insects to...\"</span></div></div>",
            "created":1300049700,
            "id":1069773,
            "title":"Worshipping their Asian goddess..."
        },
        "14":{
            "author_id":"gfable",
            "author_name":"Libarian of the Void",
            "choices":[
                "United Kingdom",
                "China",
                "Australia",
                "Russia",
                "South America"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about?</span></div></span></div>",
            "created":1226984400,
            "id":666748,
            "title":"Somewhere else"
        },
        "141":{
            "author_id":"passiveimput",
            "author_name":"Buell",
            "choices":[
                "Run and hide",
                "try and wake herself up because this is  ovbiously a dream",
                "Attack some of the villagers- you can't help feeling its their fault"
            ],
            "content":"<div class=\"\"><div> <span>The quiet streets of a little town in the heart of the country It is a beautiful day. Some kids are playing in a nearby park. A taxi pulls up and Tila get out looks around. She remembers how beautiful the town was. She starts walking down the street taking in the beauty. Then there is a heart stopping noise and a blinding flash, she stumbles disorientated from her senses being overwhelmed.<br>\r\nHer sight begins to return, she looks at her reflection in a nearby shop window. She stares trying to pin point what has changed, she cannot. Suddenly she falls to her knees an unbearable pain nearly forces her to tears.  Her clothes tighten on her body, she realities what is happening as they are ripped to shreds. She begins to get larger and larger. She stands up the pain gone, nearby buildings begin to look more like doll houses. She wonders if the other people noticed. As she continues to grow to a height of 500 feet! <br>\r\n<br>\r\nShe asks her self: what should I do? </span></div></div>",
            "created":1230526800,
            "id":626130,
            "title":"In a nice country village"
        },
        "1412":{
            "choices":[
                "red socks with green and white snowflack pattern",
                "black socks with chimney patterns on upper part",
                "socks with white and bloody red stripes"
            ],
            "content":"<div class=\"\"><div> <span>\"C'mon, it must be a dream.\" She has wanted to be a giantess, but she knows it is not going to happen. So she nip her cheeks, and find herself sleepwalking and fell down from stairs.<br>\r\n<br>\r\n\"Ow.... it hurts. How come I've done that.\" She stands up, wearing casual pajamas. She is an asian who has a great fetish on being giantess and even tries to simulate it and take video of herself. On her bedroom upstairs she stores various types of small houses and micro human models in a box under her bed. She moved to this house months ago and lived alone as she decided to study on here. On this day she want it again. 'The feel of being superior'.<br>\r\n<br>\r\nShe immediately go to living room which is empty with only a soft wool carpet covered the floor, with that box. She imagines a town, and place the houses just as same as what she thinks of, and also for micro humans. Then she immediately head for her wardrobe excitedly to dress up herself. This time she finds three pairs of knee-high socks here. Then she remember it was Christmas not long before and she bought them from a special shop selling unique clothes.<br>\r\n<br>\r\n\"It's gonna be fun... I can't wait\" she can't wait wearing them. \"Hmm... this red one with green and white snowflake patterns on it is great, but that black one with chimney pattern on upper part is also good. And this one with white and bloody red stripes looks good also. Which one should I choose... it's hard\" She has no idea on which one she's going to wear.<br>\r\n<br>\r\nAnd finally she chose one to wear(You'll be able to choose it later). And she strip off all other clothing, stay herself naked. Then she go downstairs. This time she notices a mail behind the door that wasn't here before. She lower her body, pick it up, and examine it. It looks weird as it isn't flat, but look like as if something is inside. She opens it, and find a small pack of powder and a small note:<br>\r\n<br>\r\n'Grow powder - It enlarges the object and things touch directly with the object in scale, after the object touches liquid that solved this powder. Use in caution - note that full pack grows thing 100 times, and half grows 10 times. If you want to know how much it needs to grow a specific size, you can use logarithm to help you. 100ml Net Content. solubility in water - 30ml grow powder per 10ml water'<br>\r\n<br>\r\n\"100 times is perfect for me! I always want that. And it seems it's not fake. Let's give a try.\" With excite she start finding for water. On there her cup with half cup of water inside were put on the table in the corner as if it's waiting for her. She open the pack, drop them inside the water. She even use her finger to stir it so as to make sure it's fully dissolved. And she drink it without hesitate. It's a strange feeling for her - a bit dizzy, then a bit weakened, and strange feeling that confuse her, while the surroundings are changing. She fulfill herself with joy and happiness while she see things go small. And she is growing.<br>\r\n<br>\r\nShe check things around - luckily she wore the socks which prevent direct touch with ground. And the sock she likes amazingly grows with her! She keep growing and hit the roof. It hurts a bit, but a good news for her - it's not a dream! And she grows and grows. After she reaches 10 times bigger, she get control of herself from feelings, and rise up with her perfect body, with socks. She smiles filled in excite as her expanding feet are crushing stuffs around. Several people get crushed, however, the whole city hasn't aware her existence. And then she reaches 100 times bigger, which is 600 feet for her(her original height is 6 feet). She looks at her socks again, which is...</span></div></div>",
            "created":1231045200,
            "id":629029,
            "title":"Back to her own house"
        },
        "14123":{
            "choices":[
                "She start to move"
            ],
            "content":"<div class=\"\"><div> <span>She find her striped socks easily on her foot. And amazingly the other two pairs of socks also grow with her. Three pairs of special socks are the only clothing she has now, and it is too much for being footwear. She pick up other socks, and starts to be more excited looking at them.<br>\r\n<br>\r\n\"These socks grow with me... now they also have the power of destruction. And they have many uses too. I'm too excited by just thinking it!\" There is no time for her to hesitate. She need to have fun immediately. As soon as possible.<br>\r\n<br>\r\nShe finds out half human body near her foot, and pick her foot up and see. The stripes are now dyed spots of red, which is obviously blood. And their body become nil and can't be found again. She imagines the event: some people are walking while she is growing, and her growing feet unawarely reaches them, and they are drawn into her soft, attractive socks which has taken their live.<br>\r\n<br>\r\n\"Making my socks totally red doesn't matter. It's always my favorite socks which have fun with me!\" She looks around see people who has just noticed her start fleeing in terror. It is too exciting for her that she start being overwhelmed by three feelings - hunger, sexual lust and fun on gathering humans with the spare socks.<br>\r\n<br>\r\n</span></div></div>",
            "created":1231131600,
            "id":629394,
            "title":"all socks with her"
        },
        "141231":{
            "choices":[
                "She start her hunt"
            ],
            "content":"<div class=\"\"><div> <span>She take her first step. It requires lots of time to choose a target to stomp on, and she step in front of her neighbor's house. She watch as the neighbor who hate her notice the socks by the balcony, and has no idea on it. After a little time he notice her topless body and screams in terror. He tries his best to open the main door and escape, but she effortlessly block it just by tip of her thumb toe. He react very quickly, and head for balcony again. Then he jump down the balcony at once which landed on her hot sweating socks that's very sticky. He find himself stuck on her thick sock, while he has to breathe in awful scent of sweat with nothing able to do at all.<br>\r\n<br>\r\n\"Don't be panic, I'm not going to kill you.\" She sneer at him and pick it up from the socks. He can feel pain from pressure of her fingers. \"You like the smell of my feet? I just saw you suck some. I'll let you enjoy it more.\" She pull the socks and create a space for him. It is so hot that steam flow out from it. She aim well and drop him by the height of her shoulder. It is torturous that he rolls and falls continuously for seconds, and fall into this hot, wet, dark, smelly place with a giantess's foot inside. It can't really take his life but a ultimate torture. He hear a sound after on, \"Stay here and try to satisfy my feet, or my feet will turn you into just paste.\" it is obviously Tila Tequila's voice.<br>\r\n<br>\r\nTile Tequila looks around again. She find the house very ugly and is unsuitable to put in here. It gives way by just a powerful stomp by her. She stomp on it even more so as to make it totally disappear. Then she pulls the socks again and check whether her tiny neighbor is still alive or not. Fortunately the socks are soft enough to protect him from stomps and crushes. \"There's no time to waste, I'm hungry, I need food!\" She starts to head for other people that can be found everywhere on the town.</span></div></div>",
            "created":1231304400,
            "id":630195,
            "title":"She start to move"
        },
        "1412311":{
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>She remembers her four extra socks on her hand. She puts a hand in, figuring out its volume, and smiles. \"It's enough for thousands of human. Yeah. Thousands of human!\" She rushes and grabs every single human she sees and drop them inside. Many of them are crushed in her way. Some houses are damaged by her careless move. People hide on edges of houses avoiding her, and she just uproot houses and grab them. It continues until no one left on the area.<br>\r\n<br>\r\nShe examine the chimney socks which is now filled with tiny people all around. Her sock is too big that even the people all can't even fill half of the sock. She feel extremely excited as they are trapped in a homemade chimney in her imagination. Without hesitate, she just drop them all into her throat, even without tasting with tongue. The people hitting her esophagus just tickles her and excites her more.</span></div></div>",
            "created":1231304400,
            "id":630212,
            "title":"She start her hunt"
        },
        "143":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "1000 feet",
                "5000 feet",
                "25000 feet"
            ],
            "content":"<div class=\"\"><div> <span>Clouds past from the sun letting it warm rays light up the beach. People are playing in the water and kids are running wild on a nice summer's day. Tila looks around to find a nice spot to sit down and soak up some sun. She finds a nice open spot near the water and lays down. She lays out her towel and sits down. As she sits a little purple crab pinches her butt cheek.<br>\r\n<br>\r\n\"Ouch!!! Scram you little fuck!!!\"<br>\r\n<br>\r\nAs Tila lays down she goes into a deep slumber. In a moment the sun on the beach is goes dark and the people look to see a giant shadow casting over them. The look to see Tila growing to enormous sizes. She awakes and finds herself ______ tall!!!!</span></div></div>",
            "created":1236402000,
            "id":657175,
            "title":"Australia"
        },
        "1432":{
            "choices":[
                "remain asleep",
                "is aroused by people's sound",
                "grow again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The people are afraid of Tila in this size. In several seconds the whole city, in a blackout now, is in a huge chaos, and cause damage without Tila moving. And then Tila...</span></div></span></div>",
            "created":1237611600,
            "id":664103,
            "title":"5000 feet"
        },
        "14322":{
            "choices":[
                "wearing the same clothes",
                "also not the clothes she wore just before"
            ],
            "content":"<div class=\"\"><div> <span>At the last moment Tila is lying sideways, and suddenly she waves her hands. Her arms crush thousands of skyscrapers, leaving a flattened surface of plain. Her eyes, facing down the city, opens. Her blink causes shockwaves and crushes some more buildings. Then Tila rises up, and sit in the middle of city. \"Hmm... what've just happened?\" She sits up, and looks around. The skyscrapers are two times taller than her toes, and people are already too small for her to recognise. She is excited as her toes wiggled. She is not naked, but...</span></div></div>",
            "created":1237611600,
            "id":664107,
            "title":"Tila awakes"
        },
        "143221":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Move around",
                "Notices the little people"
            ],
            "content":"<div class=\"\"><div> <span>Tila is in her bathing suit as before. The sun looks smaller from where she sits. The surrounding landscape looks much different. She notices small patches of grey and green on the ground. She can see for thousands of miles...as far as Japan. <br>\r\n<br>\r\n\"Where am I\",she says as her booming voice echoes across the hemisphere. Birds and animals run for their lives. People look up towards the sky thinking of their God has spoken. <br>\r\n<br>\r\nShe decides to.....</span></div></div>",
            "created":1244696400,
            "id":706549,
            "title":"Same clothes, bigger size!!!!"
        },
        "14323":{
            "author_id":"sweetsurrender",
            "author_name":"GrowthLover",
            "choices":[
                "She wakes up"
            ],
            "content":"<div class=\"\"><div> <span>A man was witness to Tila's already almighty growth. He watched from an office building a thousand feet away, where he had a magnificent view of her already magnificent, heaving breasts. She slumbered on...<br>\r\n<br>\r\nThen there was a massive rumbling sound. The same that made Tila into the magnificent giantess...<br>\r\n<br>\r\nThe man stood helpless, a massive hardon making a tent in his pants...As Tila expanded once more. She was only a couple hundred feet away from his office building. Tila rolled over in her sleep, still growing...The office a sacrifice to her magnificence...The man a nameless victim among thousands...<br>\r\n<br>\r\nStill she grew...and slept...</span></div></div>",
            "created":1252558800,
            "id":758690,
            "title":"Sleep Growth"
        },
        "15":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Jarah Mariano",
                "Grace Park",
                "Kelly Hu",
                "Ayumi Hamasaki",
                "Someone Else ????????"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>WHO Grows?</span></div></span></div>",
            "created":1238043600,
            "id":680013,
            "title":"Someone else?"
        },
        "151":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "1000 feet tall",
                "5000 feet tall",
                "50000 feet tall (Hawaii can fit in her hand)"
            ],
            "content":"<div class=\"\"><div> <span>Jarah Mariano is on the sunny beaches of Hawaii. She is posing for a photo shoot for Victoria's Secret. Her amazing chest is pushing out as she arches her back. The clouds part and lets the sun blaze through the clouds. \" It's getting a little hot today, I better lotion up some\". As she looks over her shoulder for her bag she notices a bottle of lotion laying next to her. She looks at the bottle and there are no markings or labels, just the words \"Sun Screen\" written in sharpie on the bottle. She begins to apply it through out her body and skin. She throws the bottle down and arches once more for a pose for the camera. She closes her eyes to soak up the sun. She hears screams and people running away. She opens her eyes and</span></div></div>",
            "created":1238216400,
            "id":667922,
            "title":"Jarah Mariano"
        },
        "1511":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Goes into the city to play",
                "Goes into the city for destruction",
                "Goes into the city for pleasure"
            ],
            "content":"<div class=\"\"><div> <span>Jarah opens her eyes to see the beach much smaller than before. She looks down to see the trees looking like grass around her. Her legs are extended down to the ocean. She stands up and looks around. She sees the nearby city of Honolulu. The tall dense city stands but even the tallest building comes up to her knees.<br>\r\n<br>\r\n\"I wonder what the city will be like at this size\", she says.<br>\r\n<br>\r\nShe takes a step and crushes the remaining camera crew. A small bloody spot is all that remains. She gets a good feeling for the destruction she has just caused. She notices that all her senses have been enhanced. Her body is more defined than before making her body to be a pure Hawaiian goddess. She begins to march to the city and......</span></div></div>",
            "created":1240376400,
            "id":680019,
            "title":"1000 feet tall Jarah awakes"
        },
        "152":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Grows in the studio",
                "Goes home in the city",
                "Goes to the beach"
            ],
            "content":"<div class=\"\"><div> <span>The studio is busy as the director gives commands to change the set. Grace still has time to change her clothes for the next scene in the show. She wants to go back to her room to change. She sees there is confusion on the set with the director's commands. She   thinks it will be a hour until they get their head out of their asses. She is trying to find the door to the changing rooms. There has been so much electrical equipment placed around in the rush. She moves through all the wires and lights, then suddenly a bulb blows and shocks her body. Her body goes into shock as her body drains the electricity in the studio. Lights dim as the power rushes to her body. This ends in about 2 seconds. She comes out of her shock with no burns or wounds. Only with a strange sensation running through her body. She then.....</span></div></div>",
            "created":1242968400,
            "id":695215,
            "title":"Grace Park"
        },
        "154":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "United States",
                "Japan",
                "Australia"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ayumi Hamasaki is where?</span></div></span></div>",
            "created":1238216400,
            "id":667914,
            "title":"Ayumi Hamasaki"
        },
        "1541":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "500 feet",
                "1000 feet",
                "5000 feet"
            ],
            "content":"<div class=\"\"><div> <span>Ayumi is in her dress room changing into her sleek leather pants. She has just got out of the shower and is ready to perform. The crowd of thousands can be heard from outside her room. She is ready to change but first needs to apply some nail polish to her toes. She opens the dresser to see a small green bottle. \"Nice, I have never seen this one before.\" She goes to apply it on her toes. Half way through her first foot she gets a feeling. The room becomes smaller every second. The towel falls off her body. She looks up at the ceiling and then.....</span></div></div>",
            "created":1238216400,
            "id":667919,
            "title":"Naked Ayumi grows"
        },
        "15411":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "choices":[
                "Play",
                "Eat"
            ],
            "content":"<div class=\"\"><div> <span>Ayumi bursts thru the cieling and rapidly continues growing until she ends up at 500 feet tall! She looks down, totally naked and confused. Everything is alot smaller. Including the people attending the concert who are now screaming and forcing their way thru the gates.<br>\r\n<br>\r\n\"Oh my. What happened? Ayumi says in a thunderous voice that heightens the terror of the little people even more. Ayumi then remembers how she always fantasized about being taller than everyone else and smiles.<br>\r\n<br>\r\n\"My wish has come true! If there is a god then i'd thank him for making my fantasy a reality!\" Ayumi says then steps over the busted remains of the building she was standing in. Looking down at the fleeing people below Ayumi laughs and decides to first,</span></div></div>",
            "created":1238302800,
            "id":668009,
            "title":"Mighty Japanese goddess Ayumi"
        },
        "154111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "plays with them sexual",
                "plays with them angry"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ayumi bends down and grabs a handful of people. She brings her hand to her face and sees 20-30 people in her hand. She smiles at them and decides to play with them....</span></div></span></div>",
            "created":1238302800,
            "id":668513,
            "title":"Plays with people"
        },
        "1541111":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Begin her reign of destruction",
                "Plays with the city"
            ],
            "content":"<div class=\"\"><div> <span>Ayumi looks down upon the tinies. She thinks they are so cute. They look up in fear as the giant Ayumi stares down at them and grins as their demise is being thought up. She spreads her legs across the city, crushing two whole city blocks. <br>\r\n<br>\r\n\"You look like you can do me a little favor\", Ayumi says as she brings her hand down to her vagina. With one hand she opens her cunt open and with the other drops the people in. Sounds of screams are heard as they are dropped. She closes her vagina and leans back with pleasure as she can feel them move around inside her. The sensation rises in her. \"YOU FEEL SO GOOD!!! I THINK I WILL HELP YOU OUT!!!\" Ayumi takes two fingers and begins mashing the bodies together inside her vagina, leaving a small trail of cum leaving her body as it begins to flood the streets. She begins to masturbates until the bodies are no more than an lubricant. She pumps faster and faster, driving her pussy wild until she cums. Her fluids blown down a 7 story building and a parking garage.<br>\r\n<br>\r\n\"Wow, you guys seem useful. Next time I will use a lot more of you.\"<br>\r\n<br>\r\nAyumi stands up as she views the destruction. She decides to...</span></div></div>",
            "created":1242709200,
            "id":693911,
            "title":"Ayumi's orgy"
        },
        "15413":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "hungry?",
                "horny?"
            ],
            "content":"<div class=\"\"><div> <span>Ayumi crashes through the roof. Every second is another 500 feet. She closes her eyes to feel the rush of growing. In less than 30 seconds she opens her eyes. She is a startling 5000 feet!!! She looks down to see the crowd of what was once thousands now a sticky red slime under her foot. She looks around to see the night life of the city bustling. No one has noticed her yet. She feels.....</span></div></div>",
            "created":1241845200,
            "id":688487,
            "title":"5000 foot Naked Japanese Woman"
        },
        "155":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Kim Kardistan",
                "Jamie Chung",
                "READERS CHOICE???? ??"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well.....who do you want!!! </span></div></span></div>",
            "created":1242104400,
            "id":761112,
            "title":"Someone Else ????????"
        },
        "1551":{
            "author_id":"commiebob14",
            "author_name":"CommieBob",
            "choices":[
                "Los Angeles",
                "New York",
                "Somewhere else??????"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does she grow?</span></div></span></div>",
            "created":1256878800,
            "id":784133,
            "title":"Kim Kardistan"
        },
        "1553":{
            "choices":[
                "Yes",
                "No",
                "Maybe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Lucy Liu?</span></div></span></div>",
            "created":1290966420,
            "id":1003414,
            "title":"READERS CHOICE???? ??"
        },
        "15531":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Play around with the cars and people ",
                "Walk off in the direction of the city"
            ],
            "content":"<div class=\"\"><div> <span>Lucy was on her way to her newest 2002 film set when something out of the ordinary happened to her and she fept her whole body tighting up \"What the-\" she thought as to her disbelief she felt herself growing bursting out of her clothes and shredding the car she was in under her huge ass it crunched into a hunk of metal the other motorists on the highway were shocked as the Asian American actress grew to the stunning size of 200 feet Lucy clearly confused glanced around her tiny surroundings she slightly blushed as she was buck naked and a giantess in the middle of the highway most people were driving away in fear but some had their cell phones and cameras out taking pictures of the bombshell Lucy suddenly with a weird grin on her face began to</span></div></div>",
            "created":1366318500,
            "id":1574362,
            "title":"Yes"
        },
        "15532":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Yes, lets have Hitomi Tanaka become a giantess!",
                "No, someone else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Hitomi Tanaka, the Japanese gravure idol known for her incredibly large boobs?</span></div></span></div>",
            "created":1323736680,
            "id":1238804,
            "title":"A buxom beauty"
        }
    },
    "info":{
        "author_id":"commiebob14",
        "author_name":"CommieBob",
        "brief_description":"500 points for additions!!! Add please!!!!",
        "created":1226661960,
        "description":"<td align=\"left\" class=\"norm\">This interactive is based off of Asian women growing and causing chaos and mayhem. Sex, vore, vagina, destruction are allowed and encouraged.<br>\r\nNo shrinking past normal height. Plot are not needed. No sex with minors. Growing males are not allowed. Can get as big as you want!!!<br>\r\nInteractive starts off with Tila Tequila but can be changed with other choices. <br>\r\n<br>\r\n500 POINTS PER ADDITION!!!!<br>\r\n<br>\r\n10000 POINTS FOR 10 ADDS IN 5 DAYS!!!!!!!<br>\r\n<br>\r\nHere are links to show you some of the girls I have made choices already, but don't be limited to them.<br>\r\n<br>\r\nTila Tequila: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://cannemma.files.wordpress.com/2008/06/tila_tequila_.jpg\" target=\"_blank\">http://cannemma.files.wordpress.com/2008/06/tila_tequila_.jpg</a><br>\r\nAyumi Hamasaki: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.ampedasia.com/gallery/90206-ayumi-hamasaki-002.jpg\" target=\"_blank\">http://www.ampedasia.com/gallery/90206-ayumi-hamasaki-002.jpg</a><br>\r\nJarah Mariano: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.asianplantation.com/asian/Portals/0/JarahMariano.jpg\" target=\"_blank\">http://www.asianplantation.com/asian/Portals/0/JarahMariano.jpg</a><br>\r\nGrace Park: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.celossip.com/wp-content/gallery/galatica/grace-park-chair.jpg\" target=\"_blank\">http://www.celossip.com/wp-content/gallery/galatica/grace-park-chair.jpg</a><br>\r\nKelly Hu: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://bargirlsrpeople2.files.wordpress.com/2009/04/kelly_hu2.jpg\" target=\"_blank\">http://bargirlsrpeople2.files.wordpress.com/2009/04/kelly_hu2.jpg</a><br>\r\nJamie Chung: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://farm1.static.flickr.com/206/457877248_70732a1c21.jpg?v=0\" target=\"_blank\">http://farm1.static.flickr.com/206/457877248_70732a1c21.jpg?v=0</a><br>\r\nLucy Liu: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://popularbiographies.files.wordpress.com/2008/07/lucy-liu.jpg\" target=\"_blank\">http://popularbiographies.files.wordpress.com/2008/07/lucy-liu.jpg</a></td>",
        "id":1495434,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1461528780,
        "modified":1461528780,
        "pretty_title":"Tila Tequila becomes a GIANTESS!!!!!"
    }
}