{
    "chapters":{
        "1":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "Bring the remote with on your weekend with your dad",
                "Bring the remote to your friends house",
                "Bring the remote to school",
                "Bring the remote to your work",
                "Maybe use it on yourself? hehe"
            ],
            "content":"<div class=\"\"><div> <span>You are an average american boy. Wishing for something BIG to happen in your life...but you know nothing really big would ever happen to you. You decide to get out of bed and start your day. You'r dad tells you to go get the mail, so you follow his order not knowing that you will be recieving one of the biggest things in your life. You oppen the front door and look down and see a brown package addressed to you. You run up to your room and decide to open it.<br>\r\n<br>\r\nYou hurrily open it and pull out a object that looks like a remote, but you can tell it is anything but because of the fact that it only has two bottons. One arrow facing up the reads grow and another arrow faccing down that reads shrink.<br>\r\n<br>\r\nYou think this is the perfect opportunity for you to satisfy your fantisies. You remember that you are supposed to be going out of town to your cabin to spend some time with your dad (sean) this weekend but you also think that you should test out your new toy on your friend. <br>\r\n<br>\r\nYou decide to.........</span></div></div>",
            "created":1209790800,
            "id":527831,
            "title":"The start of it all"
        },
        "11":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "Go with just you and him *wink*",
                "Bring a friend with",
                "Ask him to bring some (or one) of his buddies with",
                "Shrink him right now and drive up with your shrunken dad",
                "Show your dad the remote"
            ],
            "content":"<div class=\"\"><div> <span>If you didnt go with your dad this weekend like you promised youd feel pretty bad so you decided to go with him. Once you got all the stuff packed in the back of his truck he asks you if you want to bring a friend with for this trip or not.<br>\r\n<br>\r\nWhat do you decide to do</span></div></div>",
            "created":1209790800,
            "id":527841,
            "title":"Bring the remote with on your weekend with your..."
        },
        "111":{
            "choices":[
                "go into the room and let your dad suck you off",
                "get the shrink ray",
                "go into the room and become your daddies little whore"
            ],
            "content":"<div class=\"\"><div> <span>Deciding against bringing a friend you walk back in the house to take a quick piss. Whipping out your nine inch cock you begin to relieve yourself in the toilet. <br>\r\n<br>\r\nA wierd fantasy comes to mind as you stare at your engorged cock. Jumping out of the bathroom you grab your shrink/growth ray and shoot your cock with the growth button.<br>\r\n<br>\r\nImmediatly your cock begins to grow...10 inches..11 inches..12 inches...stopping at exatly 13 inches and widens becoming about three inches wide. Your balls become the size of oranges bouncing around as you lift your cock closer to your face.<br>\r\n<br>\r\nDropping your pants and boxers on the floor you replace them with a pair of your dad's boxers and the tightest jeans you can find, making sure your huge package was prominent on your body. Examining yourself in the mirror you look at your gigantic bulge and smile proudly.<br>\r\n<br>\r\n\"Wait till I show dad.\" You say aloud, walking towards the packed up car.<br>\r\n<br>\r\n********<br>\r\nSitting in your father's car you watch as he looks you over examining your face,<br>\r\n torso, and then your gigantic bulge. his eyebrows came up as he came to the gigantic bulge in your pants.<br>\r\n<br>\r\n\"When did you get so big son?\" your father asks you turning his attention back to the car.<br>\r\n<br>\r\n\"Well dad I'm a teenager now, we tend to grow a lot durning this time.\" you respond back avoiding his real question until you reached the cabin. It took about three hours to reach the cabin and it was in the middle of bullshit nowhere.<br>\r\n<br>\r\nPulling up to a small clearing your dad gets out of the car and begins unloading the suitcases. You see him glance at your huge bulge a few times as you bend down to help.<br>\r\n<br>\r\nLoading all the cargo into the living room you run up to your room, lock the door, and whip out yor thirteen inch cock. Letting your eyes take it all in you begin to rub it making sure its really real and at the same time grabbing your balls and squeezing a little. A tap at the door brings you back from your pleasant fantasies.<br>\r\n<br>\r\n\"Its me, your father dinners almost ready. Do you mind letting me in?\" He asked. <br>\r\n<br>\r\n\"Ya one sec.\" You reply back. Jamming your semi-hard cock into your boxers you zip up your pants and unlock the door. Your dad walks in a, curious glint in his eye, and sits on the end of your bed near you. <br>\r\n<br>\r\n\"Son, whats up with your cock its huge. Are you sick?\" your father asks. Deciding its time to own up yuo tell yuor dad about the shrink/growth gun and how you enlarged yuor cock.<br>\r\n<br>\r\n\"Do you mind if I see it because i really dont buy this one bit?\" he askes. Pulling open your zipper you stand up and pull down your boxers revealing your thirteen inch cock and perfectly rounded balls. You watch as your dad's eyes almost bulge out of his head. Lifting his hand he touches the head of your cock sending a feeling of ectasy thoughout your body.<br>\r\n<br>\r\nYour dad begins stroking your cock moving his hands rythmaticlly up and down, making your cock harden with pleasure. You begin to moan with ecstacy thrusting your cock into yuor fathers awaiting hands. Moving one of his hands down to your large balls he begins squeezing them softly jiggling them back and forth. you begin to orgasm cuming in torrents on his hands.<br>\r\n<br>\r\nStopping the movement your father stands and goes into his room, beckoning for you to follow..<br>\r\n<br>\r\nWhat do you do......?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1209963600,
            "id":528599,
            "title":"Go with just you and him *wink*"
        },
        "1112":{
            "author_id":"inuyasha21",
            "author_name":"inuyasha",
            "choices":[
                "He's excited",
                "He's scared",
                "He's horny"
            ],
            "content":"<div class=\"\"><div> <span>You grab the shrink/growth gun and head into your dad's room. As you enter, you see him taking his shirt off, followed by his pants. You follow swiftly and in seconds you both are naked.<br>\r\n<br>\r\nYour dad gets on his knees and starts rubbing your cock. You start moaning, getting arouse. After a while, he starts sucking on your cock. As your precum leaks out, your pull out the shrink/growth ray and set it to growth. You aim it at your dad and fire and quickly after fire it at yourself.<br>\r\n<br>\r\nYou both start growing and finally stop at ten feet tall.<br>\r\n<br>\r\nAs you cum, your dad starts licking it  When he's done, he gets up and realizes that his head is a foot from the ceiling.</span></div></div>",
            "created":1231650000,
            "id":632323,
            "title":"get the shrink ray"
        },
        "112":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "Blake",
                "Kenny",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to bring one or two of your friends along so that you can have more \"slaves\" or just so that you can try out the growth ray on them <br>\r\n<br>\r\nWho do you invite</span></div></span></div>",
            "created":1209790800,
            "id":527843,
            "title":"Bring a friend with"
        },
        "1121":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "No, just the one. ",
                "Hold that thought, I just thought of someone else. ",
                "PARTY!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hey, Dad,\" you say. \"Can we bring Blake along?\"<br>\r\n<br>\r\n\"You can bring as many people as you like,\" he says, ruffling your hair fondly. <br>\r\n<br>\r\nYou think about it for a minute, then say...</span></div></span></div>",
            "created":1299128400,
            "id":1064123,
            "title":"Blake"
        },
        "11211":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Blake can't go...",
                "Blake is perfectly willing to go. "
            ],
            "content":"<div class=\"\"><div> <span>\"Nah, you say, \"Blake will be fine.\" Your dad agrees, and you head off to pick your friend up. <br>\r\n<br>\r\nOn the way, your dad gets a call. You can hear the incessant chattering on the other end, and know it has to be Aunt Linda again. Your dad agrees to something, then drives faster. <br>\r\n<br>\r\nYou arrive at Blake's house, and knock on the door. </span></div></div>",
            "created":1299128400,
            "id":1064124,
            "title":"No, just the one. "
        },
        "113":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "James",
                "Jason",
                "Kyle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hey Dad, you say<br>\r\n<br>\r\nYeah Alex, He says<br>\r\n<br>\r\nHow about you bring one of your buddies with? You say<br>\r\n<br>\r\nWho do you have in mind? He says<br>\r\n<br>\r\nYou tell him......</span></div></span></div>",
            "created":1209790800,
            "id":527847,
            "title":"Ask him to bring some (or one) of his buddies with"
        },
        "1131":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Stop by home to drop Father off."
            ],
            "content":"<div class=\"\"><div> <span>\"What about James?\" you ask. Your dad nods vacantly. \"Good,\" he says, and hurries to the phone.<br>\r\n<br>\r\nTen minutes later, he comes back. \"I invited Kyle, Jason, and James,\" he says.<br>\r\n<br>\r\nYou'd kind of expected this, because you guessed your dad had wanted to bring those three along with him anyway. All four men were gym partners and buff, spending all their time at the gym where they worked. Every one of them was over six foot six, with Jason the shortest at 6'6\" and James the tallest at 7'4\". Kyle was 7\" and your dad was 6'10\".<br>\r\n<br>\r\nOne hour later and one trip to the gym to pick them all up, you were on the road. Suddenly, your dad's phone rang. He answered it.<br>\r\n<br>\r\n\"Oh, hello, Linda. Yes. Yes. Okay.\" Constant squabbling could be heard even as your father hung up. He turned around and drove home. On the way, he told everyone else what was happening.<br>\r\n<br>\r\n\"Linda's sick, though it hasn't stopped her talking so much. I have to take her to the hospital, and...\"<br>\r\n<br>\r\nYou weren't really paying attention, Linda being your least favorite aunt. However, you perked up when your father said, \"So behave yourselves and I'll meet you at the cabin in two days at the earliest, maybe even a week.\"<br>\r\n<br>\r\nThis was going to be good.</span></div></div>",
            "created":1291266000,
            "id":1006932,
            "title":"James"
        },
        "11311":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Kyle.",
                "Yourself."
            ],
            "content":"<div class=\"\"><div> <span>Your dad hurries out, calling instructions to his friends.<br>\r\n<br>\r\n\"Kyle's car, here's the map, I'm off.\"<br>\r\n<br>\r\nKyle grins, then stops. \"I gotta piss,\" he says, and hurries off. James lays on the couch to nap, and Jason slugs you on the shoulder. It feels like you've been whacked with a bowling ball, but you stand your ground. Jason leaves for the car.<br>\r\n<br>\r\nYou walk towards the bathroom, then look furtively around. You produce the ray gun and rest your finger on a button. You point it at...</span></div></div>",
            "created":1291266000,
            "id":1006937,
            "title":"Stop by home to drop Father off."
        },
        "113111":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Time to go."
            ],
            "content":"<div class=\"\"><div> <span>You push the \"shrink\" button on the remote and aim it inside the bathroom. You envision Kyle at six foot ten instead of seven feet -- it's not that much of a shrink, but it'll test your theory when he comes out. Next, to see if it really works, you imagine Kyle's ten-incher as a footlong. A frantic cry of delight erupts from the bathroom and you grin.<br>\r\n<br>\r\nCertain now that it works, you aim the ray at yourself and push a button. Your own cock stretches from six to fourteen inches, sliding down your leg. You reluctantly shrink it back -- there'll be more time for that at the cabin. Replacing Kyle to his former height and size, you climb into the car.</span></div></div>",
            "created":1291784400,
            "id":1010779,
            "title":"Kyle."
        },
        "1131111":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Jason, the new tallest one.",
                "Playjason."
            ],
            "content":"<div class=\"\"><div> <span>Finally, you're ready. Kyle's zipped up his pants and everyone's in the car.<br>\r\n<br>\r\nYou stop about halfway through the trip to piss. Jason rushes to the bathroom. You follow at a slower pace. Pulling out the ray gun, you push a button.</span></div></div>",
            "created":1291784400,
            "id":1010793,
            "title":"Time to go."
        },
        "113112":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "You and one person.",
                "You and two."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're about to shrink yourself, when you stop and think. Smiling, you point and click...</span></div></span></div>",
            "created":1291784400,
            "id":1010796,
            "title":"Yourself."
        },
        "1131121":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Kyle",
                "Not Kyle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But which one?</span></div></span></div>",
            "created":1291784400,
            "id":1010798,
            "title":"You and one person."
        },
        "11311212":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Jason",
                "James"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dammit, I hate only two choices!</span></div></span></div>",
            "created":1291784400,
            "id":1010800,
            "title":"Not Kyle"
        },
        "1131122":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Kyle and Jason.",
                "No?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who? Who will come?</span></div></span></div>",
            "created":1291784400,
            "id":1010802,
            "title":"You and two."
        },
        "11311222":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Jason and James",
                "Kyle and James."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Haha, then it must be...</span></div></span></div>",
            "created":1291784400,
            "id":1010804,
            "title":"No?"
        },
        "1132":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Jason has got to go",
                "Dad gets pulled over for talking"
            ],
            "content":"<div class=\"\"><div> <span>You look at your dad and ask, \"Do you think  Jason would want to go with us?\"<br>\r\n<br>\r\nJason works for your dad down at the gym as a personal trainer.  They were friends in college where they both were stars on the varsity football team.  Your dad was the quarterback and Jason was an offensive lineman.  After graduation they went through various jobs till your dad got a job as the manager of the biggest gym in town.  He quickly hired the six foot five inch ex jock with the perfect muscular body as a trainer to bring in lots of clients.<br>\r\n<br>\r\nAs much of a friend he is to your dad, he was just the opposite to you.  Now that your older, you figured out that Jason and your dad have a \"thing\" for each other which is most likely the reason for your parents divorce  and also the reason why he doesn't like you.  Jason doesn't want to share your dad with anyone and at his size nobody will argue the point.<br>\r\n<br>\r\nThis is your chance to get back at Jason for what he has done to you and your mom.  There is no way that he will turn down the invitation.<br>\r\n<br>\r\nYour father smiles and says, \"That's a great idea.  I know that he's off this weekend.  If you have everything packed, I'll call him on the cell on the way to his place\".<br>\r\n<br>\r\nYou and your dad leave for the cabin with a \"small\" detour.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1214024400,
            "id":547006,
            "title":"\"Pop goes for Jason\" "
        },
        "11322":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "On to Jason's house",
                "Oh no, not car trouble"
            ],
            "content":"<div class=\"\"><div> <span>You are in dad's Jeep cruising down the back roads to Jason's house and he is on the cell phone talking to Jason when a cop pulls out from hiding.   The siren and lights come up quickly to the back of the jeep. <br>\r\n<br>\r\n Dad yells out, \"Oh shit, what did I do?  I wasn't  speeding.  Jason, I should be there soon.  If not I'll call you back\". <br>\r\n<br>\r\n He pulls off the road and the donut fed cop pulls up behind and gets out of the patrol car and walks over, \"Sir, do you know that it's against the law to drive while using a cell phone in this state?<br>\r\n<br>\r\nWhile the cop is talking to your father, you come up with an idea that not only will get rid of the cop but will test out the device.  The two vehicles are parked in such a way that you can get a clear shot from the passenger window.  While the cop is looking at your dad, you take the small box and shoot at the patrol car, pressing the button a couple of times.<br>\r\nTo your amazement the full size car shrinks down to nothing.  You get all excited.<br>\r\n<br>\r\nThe cop looks over at you and asks, \"What's wrong with your boy?\"<br>\r\n<br>\r\nYou look at the cop and say in a frantic voice, \"Somebody just stole your police car!\"<br>\r\n<br>\r\nThe cop runs back to find that his car was gone.  You yell to your dad to step on the gas, and away you go.  </span></div></div>",
            "created":1214024400,
            "id":547021,
            "title":"\"This Cop is going to need a Shrink\""
        },
        "113221":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "1- Stop for a bite",
                "2- Pull over to piss"
            ],
            "content":"<div class=\"\"><div> <span>\"Could you believe that somebody would actually steal a police car.  It was probably some kid from a broken home or who was looking for attention\".<br>\r\n<br>\r\nYou just look at your dad and think to yourself how right he was.  When you had the choice of going either with your mother or your father, you chose your father because you wanted to grow up big and strong like he was.  Nature's gene pool pulled a dirty trick on you by having you take after your mother's side of the family.  Your average height and slight build was a big  disappointment to your father who was expecting another quarterback.  Now at eighteen years old you look four years younger.  Your new toy is going to take care of nature's mistake but first you want to take care of a few other \"mistakes\". <br>\r\n<br>\r\nWell, your impromptu test shows that the thing works and your looking forward to using it on Jason.  You have never been to Jason's house before and as your dad pilots the jeep up the long winding driveway your getting \"itchy on your trigger finger\".  Finally you spot the object of your revenge standing in front of the surprisingly big house.  Even from this distance you can see that Jason is a big man.  Your dad pulls up to where Jason is standing. Dressed only in a pair of tight shorts, you look out the window only to see the deep cuts of his eight pack.<br>\r\n<br>\r\nThe big man bends down and looks in the window. \"Hey Sean, glad you finally made it through the police dragnet. I didn't know that you were bringing the kid with you.  What are we going to do with him tagging along?\"<br>\r\n<br>\r\nYou would like to shrink him right now but you hold back.  You start to speak but your dad interrupts, \"Jason he's my son and he comes first in anything that I do.  Now get your shit together and let's go\".<br>\r\n<br>\r\nYour taken back and you say to yourself, \"Was that my father speaking those words.  I better check my birth certificate\".<br>\r\n<br>\r\nJason comes back out of the house carrying a duffel bag.  Your eyes are fixed on the site of all those huge muscles flexing in order to propel the massive man in your direction.  Your dad tells you to get in the back seat and you normally would argue but you decide to comply with his wishes.  As you get out of the jeep you are staring right into Jason's abs.  You tilt your head up to see a big smile on the jerks face.  You vow to wipe that smile off of there before the weekend is over.  Jason picks you up like you weighed nothing and puts you and his bag in the back seat.<br>\r\n<br>\r\nLots of scenarios are going through your mind as you stare at wide shouldered figure in the seat in front of you.  You have time to think as the jeep heads toward the mountains.<br>\r\n<br>\r\n</span></div></div>",
            "created":1215147600,
            "id":551741,
            "title":"\"Jason Muscles In\""
        },
        "1132211":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                " Excuse yourself from the table",
                "Order an ice cream soda"
            ],
            "content":"<div class=\"\"><div> <span>Just two hours on the road an your about to throw up.  It's not that your car sick, it's from listening to all the bullshit coming out of Jason's mouth.  He has been telling you tall tales about what his magnificent body is capable of.<br>\r\nTo say that this guy loves himself is a huge understatement.  <br>\r\n<br>\r\nYou spot a billboard advertising \"Moms place...for good home cooking\" and you speak up, \"Dad, don't you think we should stop to eat?  Jason has probably burned off a few thousand calories just from talking and needs a refuel.\"<br>\r\n<br>\r\nYour dad agrees and pulls into \"Moms\" which looks like a roadside diner that you would find in the middle of nowhere.  The parking area is all dirt and the jeep created a mild dust storm that settles on the one car and one motorcycle also parked in the lot.<br>\r\n<br>\r\nJason gets out of the car and makes sure that he stretches right in front of you.  You can't turn away from the sight of his twenty four inch upper arms peaking with the mountains acting as a backdrop behind them. Your father's voice breaks the trance as he tells Jason to put a shirt on.  You look down to see a bulge in your shorts and as you look up Jason has that smile again.<br>\r\n<br>\r\nMoms' insides consist of six tables and six stools at the counter.  Behind the counter is a waitress in her early sixties with the remains of a beehive on her head.  Mom must be the grossly overweight cook leaning over the grease fire in the back.  There is a guy all dressed in leather sitting on a stool and you think that it's his bike outside. <br>\r\n<br>\r\n The three of you sit at a table near the biker and Alice the waitress comes over and asks you \"What ilya have?\" while she smacks some gum around in her mouth.  You and your dad order the burger deluxe while Jason has a hard time with the menu. \"Do you want me to translate it into 'muscleheadese' for you?\" you ask him with a smile.  He just looks at you and says, \"Make that three and cokes all around.\"  <br>\r\n<br>\r\nWhile you were ordering you didn't notice that the biker left his seat.  Jason announces that he needs to go to the bathroom and he gets up and leaves.  The way that he said it makes you think that something is up.  He never asks to do anything.  Could it be possible that he was distracted while you were ordering by the guy on the stool who also left?  You look out the dirty window and the bike is still there. HMMMMMMMMM.<br>\r\n<br>\r\nWhat do you do?<br>\r\n</span></div></div>",
            "created":1215147600,
            "id":551743,
            "title":"\"Eat meat at Moms\""
        },
        "11322111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                " The cabin in the woods",
                "Stop at a no tell motel"
            ],
            "content":"<div class=\"\"><div> <span>You have a suspicion that something is going on in the bathroom so you ask your dad if you can go.  He says ok but stay away from Jason.  You walk to the back of the diner and put your ear to the bathroom door.  You have a smile on your face as you hear some heavy moaning going on. You quickly open the door to find the leather guy bent over the sink with his pants down and Jason's huge cock banging him in the rear.<br>\r\n<br>\r\nYou shut the door behind you and yell out, \"Hey, shouldn't you guys should get a room?\" <br>\r\n<br>\r\nJason yells back, \"Get the hell out of here.\"<br>\r\n<br>\r\n\"Anything you say Jason, I'll just tell dad why your food is getting cold.\"<br>\r\n<br>\r\nJason zips up his shorts and runs over and picks you up in his massive arms and tells the other guy to get out which he quickly does. \"Your not going to tell your father anything or I'll break you in two.\"<br>\r\n<br>\r\n\"That will look good on your resume when you go looking for a new job.  Previous experience: broke bosses son in two.  Now why don't you put me down and we'll make like this never happened.\"  <br>\r\n<br>\r\nHe puts you down just in time cause you were really getting \"hot\" being in<br>\r\nhis muscular grip.  You can't wait to shrink him but now is not the time. <br>\r\n<br>\r\nJason and you return to the table and you say nothing but you just give Jason a sly smile whenever he looks at you. <br>\r\n<br>\r\nThe three men finish their meal and leave the diner without noticing that the mystery biker was long gone. No telling what awaits down the road.</span></div></div>",
            "created":1215147600,
            "id":551745,
            "title":"\"Bang the biker slowly\""
        },
        "113221111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Jason shrinks to three inches",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>The rest of the trip was uneventful.  Jason even shut up for a while which let you catch a nap.  Your dad turns off the narrow road and the truck goes almost vertically up a dirt path until finally you arrive at the cabin.  It's just like you remembered it, it's a dump! It is so old and run down that it's possible that Lincoln might have slept in it.  Hell, he may have built it.<br>\r\n<br>\r\nJason gets his bag out of the truck and is the first to go inside.  Your dad tells you to unload the truck as he goes inside. \"Thanks for the help guys.\" you blurt out on deaf ears.  You drag the supplies and fishing gear into the one room log cabin only to find your father sound asleep on the one of the two beds in the place and Jason nowhere to be found. <br>\r\n<br>\r\nYou run back outside and see Jason coming up the path from the woods. You approach the big man, \"Where did you go?\"<br>\r\n<br>\r\nHe looks down on you, \"I was taking a shit in the woods and the only reason I'm telling you this is because something bit me and I can't see what it is but it stings like hell.  I want you to take a look.\"<br>\r\n<br>\r\nYou can't believe your good luck.  Not only are you going to feel Jason's muscular butt, you now have a perfect scenario for shrinking him.  \"Ok, let me take a look at big Jason's boo boo.\"<br>\r\n<br>\r\n\"Keep this up and you'll have to open your fly to eat.  Now take a look and can the humor.\"<br>\r\n<br>\r\nJason pulls down his shorts and the site of his beautiful ass is ruined by the stink emanating from it. \"Looks like you have one funky looking tick bite and it's still in there.  I can get it out with the tweezer from my Swiss Army knife. Just stay still and take deep breaths.  Just a few more seconds and here she is...SHIT!\"  <br>\r\n<br>\r\nJason nervously asks,\"What happened?\"<br>\r\n<br>\r\n\"I cut myself but it's ok. I got the tick out.\"<br>\r\n<br>\r\nYou show the monster tick to Jason and he gets a little light headed and sits down on a big rock. \"I don't know why but I feel kind of strange.\"<br>\r\n<br>\r\n\"Just stay there and I'll get you something to drink.\"  You appear to walk away from Jason but you go behind him and take out the shrink control box.  Taking aim, you press the button and...<br>\r\n</span></div></div>",
            "created":1215147600,
            "id":551747,
            "title":"\"The little set up\""
        },
        "1132211112":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "You get Jason's body",
                " Something else"
            ],
            "content":"<div class=\"\"><div> <span>You take aim at Jason and press the button expecting him to shrink down to three inches but instead he shrinks down to your height and all his muscles are gone.  Your shocked and excited at the unexpected outcome but you try not to make any noise. This is a bigger punishment for the egotistical jerk. Your thinking that it must have something to do with the strange tick and your blood mixing with the tick and Jason.  You wonder what would happen if you set the control for grow and aim it at yourself. There's only one way to find out so you go behind the cabin and press the button.  <br>\r\nTo your surprise...<br>\r\n</span></div></div>",
            "created":1215147600,
            "id":551749,
            "title":"\"Jason becomes mortal\""
        },
        "11322111121":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Dick in the mouth",
                "Dick in the butt"
            ],
            "content":"<div class=\"\"><div> <span>Your body instantly grows to Jason's old size and strength. You can't hold back how you feel and you scream, \"YES!!\"  With your huge hands you feel every muscle in your massive body while you flex it.  Your excitement over the power you now possess causes a bulge in your shorts and you can't believe you've waited this long to look.  You open your shorts and your huge cock pops out like it has a mind of it's own and grows to a whopping fourteen inches.  Now you know why Jason was so in love with himself.<br>\r\n<br>\r\nYou tuck the monster back in and run back over to where you left Jason and with every step you feel the power of your massive leg muscles. Jason is still sitting on the rock with his head down and his eyes closed and seems to be unaware of what happened to him.  <br>\r\n<br>\r\nYou stand before him and say, \"Jason how you feeling?\"<br>\r\n<br>\r\nHe is still looking down. \"Did you get me a drink?\"<br>\r\n<br>\r\nYou smile and reply, \"No, but I got something else.\"<br>\r\n<br>\r\nAs he lifts his head up he says, \"What?\"<br>\r\n<br>\r\n\"I got your size and strength.\"  <br>\r\n<br>\r\nA look of horror appears on Jason's face.  Before he can utter a word you pick him up and hold him over your head and using your great strength you do military presses with him. Then you bring him down and hold him in your massive arms.<br>\r\n<br>\r\n\"Remember how you liked to pick me up all the time.  Well, even though I complained, I secretly liked it.  I wanted to be built like you and look, now I am.  Isn't this great!  Now I want to do something for you that you could never do for yourself.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1215147600,
            "id":551753,
            "title":"\"Big dreams do come true\""
        },
        "113221111211":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Dad, have I got a surprise!",
                "Jason runs away "
            ],
            "content":"<div class=\"\"><div> <span>You put Jason down and he is still in shock.  You took away the very meaning of his existence.  His body was everything to him and now he is nothing.  You couldn't be happier and as far as he knows this is all the result of a tick bite.  He has no idea what else you could do to him.<br>\r\n<br>\r\n\"Ok, Jason, you've experienced my great strength, now I'm going to show you what I'm packing in my shorts.\"  You open your shorts and take out the massive cock. \"Remember this giant piece of your manhood, well it's all mine now but we're going to have a sort of 'homecuming' if you know what I mean. So let's open up that big mouth you always had and make this reunion a meaningful one.\"<br>\r\n<br>\r\nJason finally speaks up in the voice of a broken man, \"I don't know how this happened but I'm not going to do what you want. There must be some way to reverse this.\"<br>\r\n<br>\r\nYou give him a big smile, \"This is permanent little man so you better get used to it cause from now on you'll do what your told and right now I want you to open that mouth up wide.  If you don't I'll do it for you.\"<br>\r\n<br>\r\nJason does what you say and as you grab the back of his head you shove the massive cock into his mouth and tell him to get to it and suck you off.  He must have done this many times before cause once he got started he really got into it.  Your surprised on how much self control you have over your new cock.  The old you would have blown a long time ago. The feeling of all your size and strength is pulsating through your loins as you inch further down the throat of your prey. His tongue action is getting you to moan out loud and your flexing your massive arms and legs creating one huge orgasm.  Your sweating in places you never did before. You pull his head closer so that his mouth is in your pubes. Your pounding away at him and when you finally cum it feels euphoric as all your juices go right into Jason's stomach.<br>\r\n<br>\r\nYour out of breath,\"Wow, what a ride that was.  I have to admit little man you give good head.  We'll have to do that more often.\"  You pick up Jason with one arm and take him down to the stream to clean up.  \"Now when I explain about all this to my father I am going to leave this part out and I expect you not to say anything or else I'll break YOU in two. Remember?\"  <br>\r\n<br>\r\nThey finish washing up and head back to the cabin to face dad's questions.<br>\r\n<br>\r\n</span></div></div>",
            "created":1215147600,
            "id":551792,
            "title":"\"Open up and say cock\""
        },
        "1132211112111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Could it be dad?",
                "The biker looking for dessert."
            ],
            "content":"<div class=\"\"><div> <span>You carry Jason back to the cabin over your wide shoulder like he is an animal that you hunted down in the forest.  Jason is coming around after the ordeal that you just put him though, but you have no trouble holding him still.<br>\r\n<br>\r\n\"Put me the fuck down,\" shouts Jason as he hits you on the back with his fists.<br>\r\nAll of his protesting is just feeding your new super ego and as you flex your arms to hold him still another bulge starts to grow in your shorts.<br>\r\n<br>\r\n\"Keep fighting it Jason as I'm loving every minute of this.\" You make it back to the cabin without cumin again but it wasn't easy.  <br>\r\n<br>\r\nYou can't wait to see the look on your dad's face when he sees what his little boy has become but you'll have to wait, because when you enter the cabin, dad is not there.  You look around and on a table next to a few empty cans of beer you find a note that says, \"Son, I don't know where you and Jason went off to but I have gone out hunting for dinner.  Be back soon.\"  The writing is a little shaky so it seems that dad has a little \"buzz\" on.<br>\r\n<br>\r\nJason is still on your back and putting up a fuss.  You are enjoying humiliating him so much that you can't hold back anymore.  Your massive manhood is just waiting for you to open it's cage so that it can inflict more revenge on the enemy.  You throw Jason face down on the bed and pull down his shorts. His cries are muffled by the soft mattress.<br>\r\n<br>\r\nYou open your shorts and let the monster cock out.  \"Jason, it's a good thing that you can't see what's about to split you in two.  Oh, whats that?  What did you say? Oh, your saying you know how big it is cause it used to be yours. Well who am I to put off this reunion of two old friends.\"<br>\r\n<br>\r\nYour just about to do the deed when you hear the sound of a rifle being cocked behind you and the cold steel end of the barrel is presses against your back.<br>\r\n<br>\r\n<br>\r\nWho is the lone gunman?<br>\r\n</span></div></div>",
            "created":1216702800,
            "id":559063,
            "title":"\"Round two\""
        },
        "11322111121111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Jason \"opens\" for business",
                "What's that on your back, a tick?"
            ],
            "content":"<div class=\"\"><div> <span>You are standing still with your cock hanging out and a gun pointing at your massive back. The shrink box is in your pocket but you will never get to it in time. A lot of images go flashing through your brain in what seems like minutes but is actually seconds when you hear the gun owner say, \"Jason you sick fuck, put your hands behind your back and walk away from my son.\"<br>\r\n<br>\r\nYour father sees the giant muscular man that you've become from the back so of course he thinks that your Jason. You want to really surprise him so you do what he says. Without saying a word, you walk away keeping your back to him but you have a big smile on your face. Once your far enough away, your father goes over to Jason who is still face down on the bed and rolls him over.<br>\r\n<br>\r\n\"Son, are you ok hey what the..Jason..this can't be Jason. What happened to you? What's going on here? Am I drunk or what?\"<br>\r\n<br>\r\nYou turn around and look down at your dad who is now tongue tied.  You pick him straight up and with a big smile on your face you say, \"yea dad, it's me. Isn't this great?  Look at your big son now.\"<br>\r\n<br>\r\nYour dad is trying to speak. \"I can see that your BIG.\" You forgot that your cock is still hanging way out so you reel it in and close up. \"How did this happen?\"<br>\r\n<br>\r\nYou tell the story of Jason and the mysterious tick without mentioning the shrink box and the other \"activities\".  Your father finds the whole thing hard to believe but he can't deny what he sees. Now your father is much bigger than Jason and he is not afraid of him anymore.  For years Jason used him as a sex slave and forced him to hire Jason at the gym.  Now, with the help of his son, he too can have his revenge.<br>\r\n</span></div></div>",
            "created":1216702800,
            "id":559064,
            "title":"\"Daddy's home\""
        },
        "1132212":{
            "author_id":"mansized",
            "author_name":"ManSized",
            "choices":[
                "Shrink Jason to just a few inches.",
                "Shrink Jason by just a few inches."
            ],
            "content":"<div class=\"\"><div> <span>About an hour into the drive to the cabin, Jason asks your dad if he can pull over at the next gas station.<br>\r\n<br>\r\n\"Dude, I really need to piss,\" he says.<br>\r\n<br>\r\n\"But, we're almost there. Just another 20 to 30 minutes,\" your father responds.<br>\r\n<br>\r\n\"No, I really need to go.\"<br>\r\n<br>\r\nA couple minutes later, your father pulls into a Shell station. Jason is quick to jump out. You figure you may as well go too, and follow in the direction Jason headed, leaving your dad alone in the jeep. <br>\r\n<br>\r\nWhen you enter the bathroom, you can hear Jason talking in one of the stalls. He must be on a cell phone.<br>\r\n<br>\r\n\"Listen, I told you where we'll be, right? Yeah, once he and his twirpy son are fast asleep, I'll head out and meet up with you and we can have our own fun in the woods…. No, no, he has no idea about you…. Dude, don't be jealous, you know it's all about his money.\"<br>\r\n<br>\r\nYou turn around and exit the bathroom. You're not sure if you want to move forward with your plan or rat on Jason to your dad. You're disgusted.<br>\r\n<br>\r\nAs you get back into the jeep, your dad is just shutting off his own cell phone. \"Son, I've got some bad news. That was just your aunt. She's having some problems. I don't want to go into details, but I'm going to have to head to her place this evening.\"<br>\r\n<br>\r\nHe pauses, seeing that you're not sure how to react.<br>\r\n<br>\r\n\"Anyway, I was thinking of dropping you and Jason off at the cabin, and heading out to her place. Would that be okay? It may just mean the two of you for the night, but I'll join you both first thing tomorrow morning.\"<br>\r\n<br>\r\nYou pause, and realize this may be a secret blessing, as you'd have the rest of the afternoon and all night for your revenge on Jason.<br>\r\n<br>\r\n\"Ok, dad. You take good care of Aunt Linda,\" you respond.<br>\r\n<br>\r\nWhen Jason returned to the car, though, he wasn't as understanding: \"Man, that bitch of a sister of yours! This was supposed to be our weekend.\"<br>\r\n<br>\r\n\"Hey, there's nothing I can do. She is my sister,\" your father replies.<br>\r\n<br>\r\nBut Jason doesn't argue too much. He probably thinks this will make it easier for his secret rendezvous later tonight.<br>\r\n<br>\r\nTwenty minutes later you're at your cabin. You're stuck with the unloading of the car, as your father is too busy \"handling\" Jason.<br>\r\n<br>\r\n\"Can't you take him with you?\" Jason asks.<br>\r\n<br>\r\n\"I promised him a weekend in the woods, Jay. Besides, he was the one who asked you to join us. This'll be a good time for both of you to get to know each other better.\"<br>\r\n<br>\r\nAs you finish unloading, you say goodbye to your father.<br>\r\n<br>\r\nAfter your father has driven off, Jason turns to you and says, \"Well, runt, looks like it's just you and me.\"<br>\r\n<br>\r\nHe turns his back to you, and you realize now's the time. You reach into you pocket, grabbing the shrink control box, and …<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1215234000,
            "id":552254,
            "title":"A change in plans"
        },
        "11322121":{
            "author_id":"singrfan",
            "author_name":"JamMan",
            "choices":[
                "He sees the gun",
                "He is too preoccupied with his giant body to notice the gun"
            ],
            "content":"<div class=\"\"><div> <span>You point the gun at Jason's wide, muscular back, relishing the thought that he will soon be just a few inches and in your complete control. You can't wait to show that arrogant bastard a lesson in humility. Plus, despite your better judgment of him, he is definitely a really hot guy, and having your way with him will be all the more pleasurable. Before he can turn back around, you adjust the setting on the gun to 10x, figuring that will make him just over 6 inches tall, and fire.<br>\r\n<br>\r\nThe beam hits Jason, and he stumbles forward a bit, doubling over. You grin, expecting that when he stands back up, he will be shorter than you, and then he will go down to his final height. But something is off; when Jason stands back up, he looks.....taller. You are now eye level with his muscled bubble butt, which is strained against his shorts. You panic and check the setting on the gun, and your face pales. When you adjusted the gun, you accidentally set the beam to grow, not shrink! And 10x bigger means.....uh oh. You gasp and stumble back. Jason hears the noise behind you, and begins to turn around.<br>\r\n<br>\r\n\"What are you whining about now you little shri.....\" he trails off as he sees how tiny you are to him. Not being the brightest crayon in the box, it takes him a minute to realize he is rising into the open sky, his head now above the cabin and still rising. He begins to touch his now even more massive muscles and grin as he looks down on you. \"WHAT THE FUCK? THIS IS AWESOME!\" he bellows as he grows to his set 70 feet tall. His cock is straining against the shorts, which grew with him but now resemble a second skin on him. He looks down on you and smiles. \"HEY THERE RUNT, MAN ARE YOU FUCKED NOW!\". He shifts his giant foot and nudges you, knocking you over as the gun flies out of your hand. As it slides across the ground, it comes to a stop right between Jason's massive feet. You look up, past his bulging thighs, massive cock, and perfect abs and pecs to Jason's face to see if he noticed your only way of taking control back in this situation.</span></div></div>",
            "created":1377579600,
            "id":1652462,
            "title":"Uh oh......"
        },
        "113221211":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Show the world who's in control",
                "Thank you for making him all that he is"
            ],
            "content":"<div class=\"\"><div> <span>Just as you think things couldn't possibly get worse Jason spots something slide between his feet.  He bends over to pick it up as they gun quickly re-sizes to fit its new master.  After a second or two Jason finally puts two and two together and realizes this little (to him) gun was what miraculously made him better then he was, \"WELL IF THIS ISN'T THE COOLEST LITTLE PRESENT EVER\" Jason dumbly boomed thinking you like him and wanted him this big.  \"WELL RUNT SINCE YOU OBVIOUSLY CAN'T GET ENOUGH OF ME I'LL JUST TAKE THESE OF FOR YOU\" Jason said as he effortlessly ripped off the skin tight shorts leaving his enormous at any size cock to flop out freely and dangle by his knees.<br>\r\n<br>\r\nAs much as you hated the son of a bitch this you couldn't help but think had to be the hottest thing ever, but your idle thoughts were short lived as Jason started to rub his big and hardening cock leaving you no need to think as anything you could have thought up was going on right before you.  <br>\r\n<br>\r\nWhen Jason was done shamelessly jacking off for anyone to see and the trees were covered in his seed he finally turned his attention back to the gun that caused it all then declared it was time to</span></div></div>",
            "created":1377752400,
            "id":1653456,
            "title":"Jason's new toy"
        },
        "1132212111":{
            "author_id":"singrfan",
            "author_name":"JamMan",
            "choices":[
                "Jump in front of Sean, the ray hitting you instead",
                "Grab onto the back of your brother's jeans as he grows"
            ],
            "content":"<div class=\"\"><div> <span>\"ALRIGHT RUNT, NOW IT'S TIME TO REALLY HAVE SOME FUN!\" he booms, his voice sounding through the entire forest. \"THANKS FOR THE 'SMALL' START, BUT NOW IT'S TIME FOR ME TO TRULY GET BIG!\" You gulp and stare nervously at this perfect giant of a man. What have you done?<br>\r\n<br>\r\nAs he is about to squeeze the trigger and begin his ascent into GODHOOD, you hear a voice shouting from the patch of woods close to you. \"Jason! Babe, wait. Jason!\" Somehow he hears the voice as well, and his eyes scan the forest. You look over to see who is coming through the underbrush, and gasp. Your little brother, Sean, comes tearing into the clearing, wearing nothing but a pair of jeans, staring up at Jason with the biggest look of lust on his face. You haven't seen him since he was sent away to military school for behavioral problems. He ran away six months ago, and you hadn't heard from him since, your dad having given up the search a few months after his disappearance. He always was kind of a little shit, throwing tantrums, breaking things around the house. But he was controllable enough, being a few inches shorter and 50 lbs lighter than you. Now at 15, it seems that military school has changed him a bit, at least physically. He shot up another couple of inches, making him nearly as tall as you, with well defined pecs, a smooth six pack with a hint of happy trail leading into his jeans, and well-developed arms that could actually possibly take you in wrestling, were you to challenge him. But he still has the same smirk upon his handsome, boyish face, a sign that military school probably never really straightened him out.<br>\r\n<br>\r\nYou stare in disbelief. \"Sean, is that really you?\" He looks back at you. \"Of course its me, dumbass! Now what did you do to my boyfriend? He's huge!\"<br>\r\n<br>\r\nYour jaw falls agape.\"B-b-b-boyfriend? What the hell?\" You nervously look back up to Jason's huge, smiling face, amused at watching this revelation play out. \"THAT'S RIGHT, RUNT! YOUR BROTHER HERE HAS BEEN GETTING BANGED OUT BY THIS PERFECT SPECIMEN OF A MAN HERE FOR THE LAST FEW MONTHS! GOTTA KEEP MY DICK ALL IN THE FAMILY! FIRST YOUR DAD, NOW YOUR BROTHER! THOUGH I GOTTA SAY, YOUR BROTHER'S BOY PUSSY IS A MUCH TIGHTER LAY! HAHAHAHA!\"<br>\r\n<br>\r\nSean just stares at Jason, a huge bulge forming in his jeans. \"Jason, babe, I saw you growing and had to come see you! Make me a giant like you and we could rule this world together!\" Jason looks down at Sean and grins. \"MMM YEA YOU SHOULD BE BIG LIKE ME. HANG ON, HERE WE GO!\" he points the gun at Sean and fires. As soon as that happens, you.....</span></div></div>",
            "created":1378011600,
            "id":1655594,
            "title":"Show the world who's in control"
        },
        "11322121112":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Jason decides to have some destructive fun",
                "He wants to find YOU"
            ],
            "content":"<div class=\"\"><div> <span>As your brother was hit with the beam you thought to yourself you had to stay with him and try and get some answers.  You quickly grabbed onto his jeans before they were out of your reach and held on helplessly as Sean continued to grow but with seconds you heard a heart dropping rriiiiiiiiiiippppp as his jeans could take no more as you helplessly fell Sean finished his growth winding up just a hair (to them) shorter then Jason.  Thankfully you landed in a large bush and ended up falling before Sean was to massive but you were still badly hurt but functioning as your injuries could wait the situation at had was much more dire.<br>\r\n<br>\r\n\"Well finally someone my size to fuck\" Jason teased \"but we won't be the same size for much longer I just wanted you big enough so you'd be safe while I become truly worthy of worship.\" \"Sounds good to me\" Sean cooed enjoying the thought of a godly man all for himself.<br>\r\n<br>\r\n\"ALL RIGHT WORLD HERE COMES YOUR NEW MASTER\" Jason barked out as he blasted himself with the growth beam<br>\r\n<br>\r\n\"This is bad\" you sad to no one in particular as you tried to run far enough away to be safe but it was becoming apparent there was no such distance as you looked back to see Jason already doubled in size and his growth was only accelerating. Then it occurred to you you couldn't run from this your only possible solution was getting back the remote somehow but your chances were going to be beyond terrible.<br>\r\n<br>\r\n\"OH YEAH\" Jason exclaimed growing and feeling himself all over \"it's true what they say bigger is always better.\" Jason then in a display of dominance began to masturbate for the world and show them he was superior and as he pumped his dick his growth got in some way boosted by the extra sexual energies.<br>\r\n<br>\r\nJason's size was now beyond beyond belief even though you were watching in awe for yourself his old self who you thought of as massive and hated to the core was no more then a speck compared to what he had become even Sean ,who had taken refuge on his foot, was like an insect to him.  Jason's growth was now finally stopping as he spurts waves of semen all over the land realizing how utterly massive he was  Jason chuckled as he said\" guess I over did it a little, but hey all the more to love right.\" He then bent down to let Sean crawl into has hand so he could bring him to his face and ask the little giant who was only as big as his eye \"how's that babe big enough for you.\" Using the closeness as a reference you figured out Jason was now roughly TWO MILES TALL holy shit it was nothing short of a miracle among miracles you were still alive but you didn't really have time to savor the moment because...</span></div></div>",
            "created":1390366800,
            "id":1731356,
            "title":"Grab onto the back of your brother's jeans ..."
        },
        "113221211122":{
            "author_id":"akatheguy",
            "author_name":"akatheguy",
            "choices":[
                "Front row seat to the end of the world as you know it",
                "Jim makes a mistake and you end up with control of the gun again!"
            ],
            "content":"<div class=\"\"><div> <span>As you stared up in horror at the absurdly large man that now dominated the skyline - at two miles tall he was almost 10 times as big as the Empire State Building - you found you couldn't move. His feet, about a foot long normally, had grown to the point that they were now almost a third of a mile long themselves...and so they had easily caught up with your hiding spot. You were only a few feet away from <i>his</i> feet, if that made any sense, and you were simply awed. You couldn't do anything but stare up at him and his enormous, muscular body and that manhood which was still throbbing even after his recent ejaculation. Speaking of which, the air all around stank of his seed.<br>\r\n<br>\r\nSo before you could move, you heard something very scary. \"HEY SEAN. DO ME A FAVOUR, LITTLE MAN...FIND ME THAT BROTHER OF YOURS. HE SHOULD BE NEARBY. I WANT TO THANK HIM FOR THIS...\"<br>\r\n<br>\r\nThat wasn't good. You were inspired into movement and got up quickly. You began running as you heard the ridiculously large Jason crouch down, presumably with Sean in hand. <br>\r\n<br>\r\nSean was about 60 feet tall to you, the largest person to ever exist were it not for Jason, and he was being held easily between thumb and forefinger by the larger giant and used almost like a metal detector, scanning the ground. It took only a minute for him to find you, the seemingly unlimited reach of Jason allowing him to cover a great distance very quickly, and you heard Sean shout in as loud a voice as he could, \"I FOUND HIM!\" Jason heard and set your brother down. <br>\r\n<br>\r\n\"Hey, little brother. Don't run. This is gonna be great!\" <br>\r\nYou could tell Sean actually believed those words and you decided maybe it was best to just go with this. Jason kind of owed you one now.<br>\r\n<br>\r\nYou were enclosed in Sean's hand and then Jason enclosed Sean in his. At this point you made the decision that you would have to go with it, because there was no way you could win. Even Sean was too much for you to handle, let alone Jason, and it's not like you could appeal to Sean's humanity - you could tell Sean was completely besotted with his now-giant muscular god of a boyfriend.<br>\r\n<br>\r\nThe air got thinner and colder as you arrived at your destination - you were in Sean's open palm, as he stood in <i>Jason's</i> open palm, and held up. You could see Jason squinting to make you out, and then he spoke. \"AH, THERE YOU ARE!\" the words nearly knocked you clean off the hand.<br>\r\n\"THANKS FOR DOING THIS, LITTLE MAN...I GUESS YOU REALLY WANTED BIG OL JASON TO GET EVEN BIGGER, HUH?\"<br>\r\n\"Um...yes!\" you shouted out, as loud as you could - lying through your teeth. \"I knew I could get huge if I wanted, but I knew I wouldn't use that power as well as you would!\"<br>\r\n\"IS HE SAYING SOMETHING?\" Jason asked. He couldn't even hear you! Sean relayed the message. \"HAH! YOU'RE RIGHT, LITTLE MAN. AND AS A REWARD, HOW ABOUT I GIVE YOU A FRONT ROW SEAT TO ME BECOMING KING OF THE WORLD?!\"<br>\r\n<br>\r\n<br>\r\n\"Yes please!\" you called, and again Sean relayed the message. So Jason took the ray and brought it right up to Sean's open palm, then hit \"grow\". Quickly, Sean released you and you tumbled into the landscape that was Jason's hand, but the landscape quickly became more recognisable as you grew. Before you knew it you were more or less the same height as Sean, give or take a couple of inches - or, well...feet. But a foot or two didn't seem such a big deal when you were about 60 feet tall!<br>\r\n<br>\r\nJason grinned at you. \"ALRIGHT, LITTLE MAN. LET'S DO THIS.\" <br>\r\n<br>\r\nHe set his little lover, Sean, in his pubic hair. \"YOU DON'T NEED TO SEE THAT, HAHA,\" said Jim, and you were right. You were slowly becoming more aroused by Jim's dominance of the situation but you didn't need to see your brother in such a compromising position. So Jim slipped you into his ear.</span></div></div>",
            "created":1435381200,
            "id":1999822,
            "title":"He wants to find YOU"
        },
        "1132212111222":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "BIG Daddy (Twice as big as Jason and super playful)",
                "COLOSSAL GOD (10+ times bigger than Jason and horny as the day is long)"
            ],
            "content":"<div class=\"\"><div> <span>As the situation was beginning to look more and more bleak you were finally with an opening, one fleeting chance, to do something. This opportunity came in the form of Sean playing with Jason's godly cock (specifically his slit) distracting the titanic oaf and allowing you time to scale down his arm hair and get to the gun that started it all.  Fortunately as you reached it and grabbed at the gun it began to resize to fit it's new user. After your second scaling adventure past muscular bubble butt (to avoid Sean) and down his legs, which was thankfully hastened by a little growth, you realized that if you tried to shrink him he'd just step on you and go right back to growing and if you tried to match his size he could easily overpower you. This brought you to the conclusion that you needed to get back into town and make your own godly hulk to face Jason for you.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nAfter you sprinted for what felt like hours, constantly looking over you shoulder for Jason, you reached town. Panic immediately ensued as a 100 foot tall man frantically ran around in the nude, but you had no time to concern yourself as you knew a much much much larger threat was looming. Once you had finally reached the house you were looking for you tore the roof and found your father and aunt Linda (who promptly fainted) and immediately blasted your father, who, after the shock wore off, yelled \"WHAT THE FUCK IS GOING ON\" which you could only respond to ,in between pants, \"Jason...too...big...need...help.\" Your father was clearly unsatisfied by the response but before he could rebuttal he began to tremble violently as he started to explode with size his clothes torn to shreds in seconds as he quickly outgrew the house moaning sexually as he grew hornier and larger sending you into a tizzy as well with the glorious sight the was you father's muscular form, his abs and pecs becoming even more well defined and his succulent cock growing from it's ample 10 inches (regularly) to at least 14 inches. Your dad's body hair, lightly dusted with silver, becoming more like a forest as he had now well outgrown you standing at 1000 feet. \"WHY DON'T YOU HELP YOUR DADDY OUT\" he said as he picked you up and dropped you on his dick \"Ugh I really would love to but you still need to get a lot bigger\" you said as you shot him a few more times.<br>\r\n<br>\r\n---<br>\r\n<br>\r\n\"AH BABY YOU REALLY ARE A TREASURE\" Jason moaned to Sean \"BUT IT'S TIME TO GET BACK TO BUSI-\" he was cut off by a loud booming which soon revealed itself to be<br>\r\n</span></div></div>",
            "created":1436936400,
            "id":2008467,
            "title":"Jason's Pleasure is Your Gain"
        },
        "11322122":{
            "author_id":"mansized",
            "author_name":"ManSized",
            "choices":[
                "Jason decides to take a nap.",
                "Jason tells you he needs to make a phone call."
            ],
            "content":"<div class=\"\"><div> <span>Rather than shrink Jason down all at once, you decide you want to play with his mind first. After all, you have until tomorrow morning to complete your revenge.  You set the shrink control box to reduce him gradually, starting with just a few inches, but continuing sporadically throughout the night.<br>\r\n<br>\r\nYou aim the box toward his back, and hit the button. Even though it was just a loss of a few inches, the change is noticeable. The once tight shorts have loosened quite a bit, and the impact of the shrink seems to have temporarily stunned Jason.<br>\r\n<br>\r\n\"Everything okay, Jason?\" you call out, trying to disguise your obvious glee.<br>\r\n<br>\r\nHe seems confused, but is clearly unsure of what has happened. \"Yeah,\" he mutters. \"Just got a bit dizzy. Must be allergies.\"<br>\r\n<br>\r\nHe turns and looks at you; he knows something strange has happened, but is not quite sure what exactly. He shakes his head, then quickly turns back to the cabin, and heads in.<br>\r\n<br>\r\nYou follow him in, and …<br>\r\n<br>\r\n</span></div></div>",
            "created":1215320400,
            "id":552261,
            "title":"Let the mind games begin"
        },
        "113221221":{
            "author_id":"mansized",
            "author_name":"ManSized",
            "choices":[
                "your height.",
                "a foot shorter than you."
            ],
            "content":"<div class=\"\"><div> <span>You enter the cabin behind Jason, and notice that the place is looking a little dumpy. Neither you nor your father has been here over the last year, and there's dust and dirt everywhere. <br>\r\n<br>\r\nJason puts his duffel bag down by what usually is your father's bed. He raises his arms a bit to stretch and yawn, his muscular torso flexing as he does so. His shorts begin to slide a little from his now-smaller hips, and he immediately lowers his arms to catch them from slipping. He's confused for a moment, but then shrugs.<br>\r\n<br>\r\nHe lays back on the bed and looks at you: \"Dude, I'm gonna take a little nap. But why don't you be of some use and clean this place a bit, hunh?\"<br>\r\n<br>\r\n\"Jason,\" you begin to respond, but he cuts you off.<br>\r\n<br>\r\n\"That's Mr. Williams to you, squirt!\"<br>\r\n<br>\r\nYou start again, \"Mr. Williams, we have a lot to do. Before it gets dark, we'll need some wood for a fire, and we need to figure out what we're doing for dinner.\"<br>\r\n<br>\r\nHe smiles, and begins to close his eyes, \"Looks like you've got quite a bit of work to do, squirt.\"<br>\r\n<br>\r\nYou grumble to yourself, as he quickly falls into a light sleep. But, as you head out to begin bringing in some wood, you smile. Well, this may not be so bad after all. Your revenge won't be able to begin now at his current height. Even with a few inches gone, he's still more than a foot taller, and much more stronger than you.<br>\r\n<br>\r\nThis pleases you, and you no longer are so upset handling the chores. You set about chopping enough wood for an evening's fire, and then coming in and begin cleaning up the place. Over an hour later, the place isn't looking so shabby, and you sit down by the fire you've set up and snack on some trail mix.<br>\r\n<br>\r\nIt's then you hear some rumbling coming from your father's bed, followed by Jason's voice: \"What the fu--?\"<br>\r\n<br>\r\nYou jump up and look over at Jason. <br>\r\n<br>\r\nAs his hands hold up his way-too-large shorts, he looks at you, and is startled, as he is now . . . <br>\r\n<br>\r\n</span></div></div>",
            "created":1216443600,
            "id":557830,
            "title":"Sleeping away some inches"
        },
        "1132212211":{
            "choices":[
                "That you are the one who shrunk him.",
                "That you have no idea what is happening."
            ],
            "content":"<div class=\"\"><div> <span>When you look at Jason you are almost shocked by how much he had shrunk. Normally much taller than you, he now stood at about your height, looking confused and a littled terrified at the changes that have occured. For a minute you both just stand there staring at each other and then all of a sudden Jason snap's from the shock. <br>\r\n<br>\r\n\"What the hell happened to me?!\" Jason yells in frustration. He runs up to you, now standing face to face with the one he used to look down upon. His body hadn't changed, still muscular and toned, just smaller. <br>\r\n<br>\r\n\"Kid, what the hell happened to me?!\" He yell once more, this time looking for an answer that you weren't about to give away. He runs to the bathroom in the cabin where there is a mirror and you here him scream from the other room.<br>\r\n<br>\r\n\"Shit, I'm freaking tiny!\" He's really lost it now. He runs back into the room your in and your surprised that he has already lost another inch since you were both standing face to face. You get a huge grin as you notice he starts to shrink faster and more noticeably. <br>\r\n<br>\r\nYou decide to tell him...</span></div></div>",
            "created":1217998800,
            "id":566208,
            "title":"Your height and shrinking."
        },
        "11322122111":{
            "author_id":"puppet_master",
            "author_name":"~Benjamyn~",
            "choices":[
                "\"..lick my feet clean!\"",
                "\"..suck my cock!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Ok, JASON\" You say, making a point of calling the overly cocky man by his first name. \"I suppose I will tell you who did this to you - You wanna know so bad? Well..\" Excitement is growing in your voice as you close in on the ever-shrinking man who now only just reaches your knees. \"..It was ME!\" You shout, slamming your foot down on Jason's chest. The miniature muscle man is hysterical now, and tries hopelessly to assert his power. \"Hey, y.. you better get your foot offa me, squirt - I'm warning you!\" You fold your arms and laugh rauciously. \"Sorry, Jason. You're the one who'll be taking orders from now on! And just to get you used to being my father's and my bitch, I think right now I'm gonna have you....\"</span></div></div>",
            "created":1218430800,
            "id":568626,
            "title":"Jason's fall from power"
        },
        "11322122112":{
            "author_id":"mansized",
            "author_name":"ManSized",
            "choices":[
                "You call your father",
                "You decide not to call your father"
            ],
            "content":"<div class=\"\"><div> <span>\"Dude, what's happening to you?\" you say to Jason, pretending you have no idea why he's shrinking.<br>\r\n<br>\r\n\"I don't know! When I went to bed I was fine, but now… now…\"<br>\r\n<br>\r\n\"You're shrinking!\"<br>\r\n<br>\r\nJason shivered a bit, after hearing those words come out of your mouth.<br>\r\n<br>\r\nYou pretend to be oblivious. \"You're shivering. You must be cold. Those clothes don't look like they fit you very well. You can probably wear something of mine.\"<br>\r\n<br>\r\nJason looks horrified, as you start pulling out some clothes you had packed earlier today. You can imagine what he's thinking, how embarrassed he must feel wearing your smaller clothes.<br>\r\n<br>\r\nYou find a T-shirt and elastic-banded shorts for Jason to wear. Jason has stopped shrinking for now, and is about a half foot shorter than you. But though he's shorter than you, his large muscular build has remained proportionally in tact, and he fills out the clothes; the shirt especially is rather tight.<br>\r\n<br>\r\n\"There we go,\" you say.<br>\r\n<br>\r\nBut Jason's not so pleased, \"There we go? I've shrunk! And I may shrink more! And there we go?\"<br>\r\n<br>\r\n\"Well, what do you want to do? We could call Dad . . .\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1219122000,
            "id":572315,
            "title":"Pretend you have no idea"
        },
        "113221221122":{
            "author_id":"mansized",
            "author_name":"ManSized",
            "choices":[
                "\"No wonder you're feeling drunk, at your shrunken size,\" you say.",
                "You remain quiet, and watch him shrink some more."
            ],
            "content":"<div class=\"\"><div> <span>Jason turns to you and says, \"Yeah, we should call your dad.\" He heads over to his phone, and then suddenly curses, \"Shit, the battery's dead. Kid, you have your own cell?\" <br>\r\n<br>\r\n\"No.\" Actually, you did bring your phone, but you've decided you want little Jason all to yourself tonight.<br>\r\n<br>\r\n\"Where's the nearest phone?\" Jason asks.<br>\r\n<br>\r\n\"We'd probably have to walk a few miles down the road. There's a ranger's station, where we could ask to borrow their phone. But they'll be closed until the morning.\"<br>\r\n<br>\r\nYou watch Jason, physically struggling trying to figure out what to do. \"This is the worst. The Worst! How is this happening? Why to me?\" he screams.<br>\r\n<br>\r\nYou smirk to yourself as you head over to the fridge to grab a coke. \"Why to him?\" you mutter to yourself, giggling. \"This is what we call bringing someone down to size.\"<br>\r\n<br>\r\n\"Did you say something, Kid? Hey, grab me a beer while you're over there! I could really use a drink.\"<br>\r\n<br>\r\nYou hand Jason his beer, and he sits back on the bed. You sit on a chair across from him, and continue to listen to Jason babble on. The beer seems to be relaxing him, and plans form in his head. \"It'll all be fine. All be fine. Your dad'll be back in the morning, and if not we can always go to the ranger station . . .\"<br>\r\n<br>\r\nHe mutters on and on, strangely calm, though you're amused by his random thoughts.  <br>\r\n<br>\r\n\". . . but how did this happen? Why? Doctors will know. We'll head over to the nearest hospital, and they can help. Oh jeez, but what kind of hick docs will be out here?\"<br>\r\n<br>\r\nYou notice the shirt you loaned to Jason is no longer so tight on his body, and smile as he obliviously shrinks slowly in front of you.<br>\r\n<br>\r\n\". . . your dad's gonna freak when he sees me. The jerk, he'll probably be turned on. He always has wanted control over me.\"<br>\r\n<br>\r\nJason's near finished with his beer, and you offer to get him another. \"Oh, sure. Thanks, kid.\"<br>\r\n<br>\r\nAs he starts his second beer, he's quiet for a while, but still not noticing that your clothes are pretty loose on him by now. \"Man,\" he says, after a while, \"I am really feeling this beer.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1219467600,
            "id":573477,
            "title":"You want little Jason to yourself tonight"
        },
        "1132212211221":{
            "author_id":"mansized",
            "author_name":"ManSized",
            "choices":[
                "You lay Jason back on the bed, and play with his little muscular body.",
                "Jason breaks free."
            ],
            "content":"<div class=\"\"><div> <span>“Of course you’re feeling that beer, Jason. That’s because you’ve shrunk even more!” you say, trying as hard as possible not to laugh.<br>\r\n<br>\r\n“What?” Jason says, suddenly alarmed. “Why didn’t you say anything?!”<br>\r\n<br>\r\nHe attempts to clamber to his feet, but your clothes are so loose on him now, that he finds himself stumbling about.<br>\r\n<br>\r\n“I don’t know, Jason, I thought it was kinda funny watching you be brought down in size!”<br>\r\n<br>\r\n“Funny! Kid, this is no joke!” he shrieks, as he falls out of the bed and onto his knees. As he clambers back onto his feet, he screams, “You know, I can beat the shit outta y…”<br>\r\n<br>\r\nJason never finishes his sentence, as he has stood up and found himself staring directly at your waist. He eyes widen, as he slowly raises his head to look up past your stomach, your chest, your neck, until looking up straight at your eyes.<br>\r\n<br>\r\n“Hey, shorty!” you say, laughing while looking down at him. “I’m sorry, what were you just saying? Something about beating the crap out of me?”<br>\r\n<br>\r\nHe backs away from you, stuttering, “I’m sorr… I’m sorr… I… I…”<br>\r\n<br>\r\nBut you’re tired of dealing with his crap. You step toward him and grab him on both sides just beneath his armpits, and then lift him up. You’re surprised at how light he is. You raise him up so that he is eye-to-eye with you. He cowers back, while struggling to break free from your grasp.<br>\r\n<br>\r\n“You’re pathetic, Jason, you know that? Pathetic. Maybe I should beat the crap outta you.” <br>\r\n<br>\r\nHe squirms in your arms, trying to use all his might to break free. You watch, and are amazed at how impressive his muscles still are despite his small size.  <br>\r\n<br>\r\n</span></div></div>",
            "created":1235192400,
            "id":650239,
            "title":"Jason's shrunk some more"
        },
        "1132212211222":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Jason is gone",
                "Jason's back to full size but under your control"
            ],
            "content":"<div class=\"\"><div> <span>Jason now looks like he is wearing a tent instead of your shirt.  He has shrunk down to three feet and is feeling no pain as he keeps blurting out things.<br>\r\n<br>\r\nJason gets up and walks over to you in anything but a straight line. \"Hey kid, you feel like dancin? I weally wanna dance.  I'm a gweat dancer.  People are amazed to see just how gut a dancu I is.\"   <br>\r\n<br>\r\nYou look down at the pathetic sight as he puts his once mighty arms around your legs which leaves his mouth directly in line with your crotch.<br>\r\n<br>\r\n\"Ok Jason,  I will dance with you but you have to hold on to my pacifier like the little baby you are.\"  You smile at him as you open your fly and unleash your already growing cock.<br>\r\n<br>\r\nFour beers have left the little guy ready for anything. \"Now open wide Jason and suck on my pacifier and I'll dance with you.\"  Just the thought of Jason giving you a blow job has your cock now fully erect.  You place it in the little guys mouth and he goes right at it like he has done this before.<br>\r\n<br>\r\nYour whole body is getting hot as Jason's tongue whips around your cock and his small mouth opening is just the right size to form a perfect suction.  You want this to last a long time so you waltz Jason over to the fridge where you have the beers cooling and without looking, you reach in and pull out a can, open it up and gulp the whole thing down.<br>\r\n<br>\r\nLooking down at the human vacuum you yell, \"Wow, that's some strong stuff no wonder your loaded.\"  All of a sudden you're feeling very strange.  It's like your whole body is about to have an orgasm.  You look at the beer can and it has an old unreadable label on it that turns into dust when you try to clean it off.  \"Shit, I wonder what this is.  It must have been in the cabin for ages.  Sure makes a fella feel real horny though.  Good thing I got somebody to take care of that.\"<br>\r\n<br>\r\nYou're amazed that you have lasted almost an hour with Jason still going at it.  Then for no reason at all he stops.  You look down and his feet are now off the ground because he is hanging by your cock!  The sight sets off your orgasm and your cock grows to nearly twice the size.  You yell out, \"What the fuck was in that can?\"   Your balls swell up to triple their size and you finally explode, sending gallons of cum down Jason's throat.<br>\r\n<br>\r\nBut you're not done yet.  You pull out of Jason's mouth and hold him up in the air. You shake Jason and his shorts fall off and you ask him if he wants to dance some more. His only reply was \"Taango\".<br>\r\n<br>\r\nYou smile at the little cum magnet, \" Well Jason, you know that it takes two to Tango.  I don't have a rose so this will have to do.\"  And with that you shove your huge cock up his ass.  He lets out a little yelp like a puppy would when spanked.  You hold him up with your massive cock and pump him in mid air until your balls swell up again and you unleash a torrent of cum inside the little scum bag.  You walk over to the bed with Jason still attached to your cock. He is totally asleep now but he coughs up some of your cum.  It is only now for the first time that you notice that your jiz is a bright green color.  This really freaks you out but after what you have just been through,you're too tired to think and you collapse on your back in the bed with your cock still in Jason to sleep it off.<br>\r\n<br>\r\nThe next morning you wake up to find...<br>\r\n</span></div></div>",
            "created":1221454800,
            "id":582814,
            "title":"\"Dance with me shorty\""
        },
        "11322122112221":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                " Jason comes out of you",
                "Jason shows up."
            ],
            "content":"<div class=\"\"><div> <span>You awaken to the sound of a rooster crowing but that is not the only cock that disturbs you this early in the morning.  You just had a really erotic dream that your cock grows to seven feet long after seeing Jason in the buff. He tries to get away but he is no match for the giant monster.  You get highly aroused as the piss slit opens up and swallows Jason whole and just like a snake after swallowing it's prey, you see the outline of Jason's muscular body as it makes it's way up to your balls. Your body quickly absorbs him and you feel horny as hell cause all of Jason's size and strength is in your body and when you jerk off you swallow all of the huge man's DNA cocktail. <br>\r\n<br>\r\nYou're still lying on your back with your cock sticking up in the air.  It looks bigger than usual but you attribute the hallucination to what you had to drink last night. You tuck in your big member, zip up and look around for the can. <br>\r\n<br>\r\n\"What was that stuff?  The can has to be somewhere around here.\"<br>\r\nYou find the can under the bed and pick it up.<br>\r\n\"The label is gone but what's this stamped on the bottom?<br>\r\n'Irradiated for shelter use'.  Shit, this must have been for a bomb shelter in the 1950's. Dad once told me that there is one around here. No wonder it looks so old.  What ever it was it sure makes me feel great!\"<br>\r\n<br>\r\nYour dream pops back into your head and you suddenly realize that Jason is gone. You look around the bed and on the floor but you don't see him anywhere.<br>\r\n\"Jason come out from your hiding spot.  The big bad giant isn't going to hurt you.\"  Out of the corner of you eye you spot something going behind the refrigerator. It's one of the big old ones that weigh a ton. You try to pull the fridge away from the wall but it will not budge. \"Jason, come out from behind there.  Don't make me come and get you.\" You hang off the front and try to rock it back and forth.  You smile as it starts to move but the smile turns into a scream as the huge fridge tips over on top of you.  The pain is radiating all through your body as you see a mouse run away from it's now exposed hiding spot.<br>\r\n<br>\r\nYou are stuck underneath the heavy appliance unable to move when....</span></div></div>",
            "created":1221454800,
            "id":582817,
            "title":"\"Canned dreams\""
        },
        "113221221122211":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Your body returns",
                "You take over Jason"
            ],
            "content":"<div class=\"\"><div> <span>You are stuck underneath the heavy refrigerator after it falls on top of you.<br>\r\n<br>\r\nSeething in pain you start to babble out loud, \"Oh shit, what have I got myself into?  Dad is going to find me dead under this thing.  I've got to lift this but it's so fuckin' heavy.\"<br>\r\n<br>\r\nYou gather up all your strength and give it one big shove.  It starts to move and you feel a surge of power all throughout your body.  Looking at your arms they suddenly start to grow.  The same thing is happening to your chest, shoulders and legs.  You can easily push the heavy appliance over and as you stand up you notice that you're growing taller.<br>\r\n<br>\r\nFeeling fantastic, you run over to the mirror to get a look at your growing body.  \"What's happening to me?  This is amazing. I'm getting huge.\"<br>\r\n<br>\r\nFlexing your arms causes your shirt to tear up the sleeves.  Flaring out your lats has your shirt tearing right up your back. Your legs have grown so big that any movement causes your pants to tear to shreds. You take off the rags and you're standing there admiring the massive nearly naked body in front of you when all of a sudden it dawns on you that this is Jason's body.<br>\r\n<br>\r\n\"This is great.  Somehow I got Jason's body.\"  You're just about to celebrate when your voice starts to get deeper. You start to panic. \"What's happening to me. I'm losing control. I'm paralyzed! I've got this great body and I can't move a muscle.\"  You watch as your face changes into Jason's and it is now his voice coming out of the muscle giants mouth.  <br>\r\n<br>\r\n\"I can't argue with you about the great body cause I happen to love it much more than you ever will.\"  Jason flexes his huge bicep and gives it a kiss.<br>\r\n\"I don't know what you did to me but I am not going to let you out again.\"<br>\r\n<br>\r\nYou're now totally confused as to what's going on.  Jason is in control and you have to figure out how to get it back and keep it.<br>\r\n<br>\r\n</span></div></div>",
            "created":1221454800,
            "id":582820,
            "title":"\"Turnabout Intruder\""
        },
        "11322122112222":{
            "choices":[
                "Fuck me hard up the but",
                "Chain yourself to that wall, time for some bondage ;)"
            ],
            "content":"<div class=\"\"><div> <span>You see Jason sat in a chair snoozing. Last nights memories came back to you in one flood and you remembered your total control over Jason's hapless form.<br>\r\n<br>\r\nTime to see if he remembers...<br>\r\n<br>\r\n\"Erm Jason, hello?\" you ask nervously. In a flash Jason's eyes open and he gets up, using his huge biceps to push himself off the chair. Your bulge grows as you see his biceps flex.<br>\r\n\"Yes master what is your command?\" Jason sayd robotically. You are startled. Is Jason your slave? He msut be, it seems whatever was in that can has made him become your sex slave, he will do anything!<br>\r\n<br>\r\n<br>\r\n\"Erm Jason i want you to</span></div></div>",
            "created":1225256400,
            "id":601327,
            "title":"Slave"
        },
        "113221221122221":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "The \"hug\" is his usual finish",
                "He's no longer your slave"
            ],
            "content":"<div class=\"\"><div> <span>This presents an interesting situation.  If Jason is indeed in your power then there are a lot of things that you would like to do with him.  You're thinking that to make sure he isn't faking it, you have to give him a test but first you want to try something.<br>\r\n<br>\r\n\"Jason, stand in place with your arms at your side and don't move.\"<br>\r\n<br>\r\nYou watch him follow your command then you take your right fist, pull it way behind you, wind up and sock Jason as hard as you can in the stomach. The sound is like what you would imagine that a brick being fired into a thousand pound bag of sand would make. <br>\r\n<br>\r\n\"Shit, it's like a brick wall.  I wonder if I broke my hand.\"<br>\r\n<br>\r\nJason doesn't budge but now it's time for the real fun.<br>\r\n<br>\r\n\"Jason, I'm going to bend over and I want you to give me a rim job.  Do you understand me?\"<br>\r\n<br>\r\nJason responds with a \"Yes master\".<br>\r\n<br>\r\nYou pull down your shorts and bend over.  The next thing you know Jason's tongue is going up your butt and your getting hard cause he's doing a great job at it. The feeling is like you've never felt before.  You don't want to blow your load already so you tell Jason, \"stop what you're doing and stand up straight.\"<br>\r\n<br>\r\nYou can't believe it.  This is almost as good as shrinking him.  You can now live out one of your fantasy's which is getting fucked by a big man and Jason has to be one of the biggest.<br>\r\n<br>\r\n\"Jason, I want you to pick me up and carry me over to the bed and give me the best fucking that you've ever given to anybody.\"<br>\r\n<br>\r\nAgain Jason responds with a \"Yes master\" then he picks you up in his muscular arms and brings you over to the bed. His eyes show no emotion and you try to squeeze his bicep but it's as hard as a rock.  Just before he drops you on the bed, you get a view of his huge cock which is quickly growing to it's full size. When he enters your butt hole you flinch with the first jolt of pain.  Jason slips in the first four inches to open you up.  The next four soon follow and all eight start going in and out.  The pain is turning to pleasure and you yell out for more.  What you get next sends you over the top. <br>\r\n<br>\r\nJason's huge balls are slapping against your flesh as the over foot long muscle cock drives home again and again.  All the nerve endings in your rectum are firing like crazy. Jason is pounding away and you can feel his monster cock getting thicker. He's about to blow so you order him not to cum till he's told to.  You tell him to wrap his hand around your cock and jerk you off to the same beat of his cock in your butt.  This feels unbelievable and you wish it wouldn't end but you can't control your orgasm and you soon cum in Jason's hand.<br>\r\n<br>\r\nJason's cock is swelling up to bottle size and you can't take it anymore.<br>\r\n<br>\r\n\"Jason it's time to blow your load.  Do it NOW!\"<br>\r\n<br>\r\nYou feel the muscle giants manhood flow into you as Jason puts you in a tight bear hug with his cock up your ass.<br>\r\n<br>\r\nThe orgasmic feeling is replaced with one of fear.<br>\r\n<br>\r\nWhat's up with Jason?<br>\r\n</span></div></div>",
            "created":1231477200,
            "id":631092,
            "title":"\"Screw Me\""
        },
        "1132212211222211":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Jason picks you up",
                "Jason steps on you"
            ],
            "content":"<div class=\"\"><div> <span>You are scared shit-less thinking that Jason is no longer in your control. <br>\r\n<br>\r\nWith a quiver in your voice you ask, \"Uh, Jason, what are you doing?\"<br>\r\n<br>\r\nWith a basic monotone his response calms you down, \"I gave master my 'best fucking' just like master asked\".<br>\r\n<br>\r\n\"So why are you holding me so tight?\"<br>\r\n<br>\r\nAgain with no feeling, \"I always hug my partner to show my alpha status\".<br>\r\n<br>\r\nNow you're a little confused, \"But I am the alpha, you are just my slave. What should I be doing to you?\"<br>\r\n<br>\r\nJason cocks his head to the side like a dog that is showing a confused state.  His huge libido is fighting back at the situation. He releases the tight grip and pulls his cock out and a flood of his cum follows it out of your butt hole.  He gets up and when you turn around to look at him, you would swear that his whole body has grown bigger.  <br>\r\n<br>\r\nYou get off the bed and stand next to him.  \"Holy shit! I'm shrinking!  What the hell was in that can?  I must have absorbed it from Jason's cum in my ass. I've got to find the size change device before I get too small.  Where the fuck did I put it?\"<br>\r\n<br>\r\nYour running around the room while Jason just stands there at attention.  You go over to Jason and you're now up to his knee caps. Looking up at his naked muscular body, you become transfixed at the sight of Jason's cock which looks like a good twenty five inches to you and for a moment you're getting excited, but then a few drops of cum land on your head and you yell out in anger,\"Don't just stand there, DO SOMETHING!\"<br>\r\n<br>\r\nJason tilts his head down at you and has a quizzical look on his face.<br>\r\nYou're waiting for a response and getting shorter before you realize that you have to tell him what to do but now you're so small that he can't hear you.<br>\r\n<br>\r\nYou run over and bang on his toes to get his attention.  You're thinking that, \"If this doesn't work, I'm screwed\".<br>\r\n<br>\r\n</span></div></div>",
            "created":1231477200,
            "id":631094,
            "title":"\"Someone gets small\""
        },
        "11322122112222111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "You stop shrinking",
                "You grow back to normal "
            ],
            "content":"<div class=\"\"><div> <span>Jason feels the little tapping on his foot and instinctively squats down to rub it.  You watch all his giant muscles go into action and when he gets down low enough you scream out, \"PICK ME UP!\"  Jason looks at you. \"Eureka! he heard me\".<br>\r\n<br>\r\nThe huge hand comes down upon you and lifts you off the ground.  Jason stands back up and you're still in his hand which is by his side.<br>\r\n<br>\r\n\"Shit, do I have to tell him everything?\"<br>\r\n<br>\r\nYou try to find a fleshy part of Jason's hand to bite on but he's all muscle so you pick one of his calluses and bite down hard.  This feels like a little pin prick to Jason but it accomplishes your goal because he raises his hand up to his face to see what bit him. <br>\r\n<br>\r\n When he opens his fingers you yell out, \"Keep me where you can hear me unless I tell you otherwise.  Now go look for a little box that I had with me.  It looks like a small TV remote.\" <br>\r\n<br>\r\nYou're about three inches tall and the shrinking is slowing down.  Jason is doing as told.  As he walks around the room the once small cabin looks absolutely huge to you now and you're starting to really worry because you're beginning to enjoy this. <br>\r\n<br>\r\nJason is looking through your bag and finds a zipper pocket inside.  Even before he opens it up, you remember that you hid it in there.<br>\r\n<br>\r\n\"Jason open up the zipper and take out the box inside and be careful with it.\"   Jason follows your instruction.  \"Now put me down on the floor, point the box at me, and press the arrow pointing up that says grow for twenty seconds.  If nothing happens then pick me up to your face again.\"<br>\r\n<br>\r\nJason puts you down on the floor, points the box at you, and presses the button.<br>\r\n<br>\r\nWhat happens?<br>\r\n</span></div></div>",
            "created":1231477200,
            "id":631096,
            "title":"\"Small you has BIG problems\""
        },
        "113221221122221111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                " You wake up and so does Jason",
                "You wake up full size"
            ],
            "content":"<div class=\"\"><div> <span>The beam hits you and as the seconds tic away nothing happens.  Ten, fifteen, twenty...nothing. What you don't know is that Jason's fingers are so thick that he pressed both buttons at the same time.<br>\r\n<br>\r\nYou stand on the floor, all two inches of you. You're not shrinking anymore which is a good thing but you feel that something else is different.  Jason's hand comes down and picks you up to his face but he does it so quick that your head and stomach are meeting somewhere in the middle. <br>\r\n<br>\r\nAfter you regain you're balance you yell at Jason, \"Next time you pick me up, do it slow!<br>\r\n<br>\r\nNow you're at an impasse.  Your mind is all over the place.  \"Maybe that stuff in the can will wear off and I'll grow back.  But what if Jason snaps out of it first?  I can't imagine what he would do to me at this size.  Damn, he's in my control and I'm stuck at this size.  Well, the one good thing about being so small is that Jason looks a hundred time hotter from this viewpoint.\"<br>\r\n<br>\r\nYou're looking up into Jason's eyes as he stares straight ahead.  His chest is right below you and it's so big that you could walk right on to it without falling.  This gives you an idea.<br>\r\n<br>\r\n\"Jason, I want you to put the box down then go lie down on your back on the bed and put me on top of your chest.\"<br>\r\n<br>\r\nHe follows your instructions and you watch the fluid motion of his muscles move his body to get in position on the bed.  You end up being placed below Jason's neck right above his pecs which look like two mountains rising above you.  You walk into the valley between them and lie down on your back.  You can just imagine all the power in the body underneath you, all the years of pumping iron that it took to have the size and strength of Jason.  The  warmth being generated by those muscles flows into your body and rise and fall of his chest causes you fall asleep feeling like you're back in the womb.<br>\r\n</span></div></div>",
            "created":1231477200,
            "id":631097,
            "title":"\"The muscle bed\""
        },
        "113221222":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "You play Jason's game",
                "Jason plays the giant - for real"
            ],
            "content":"<div class=\"\"><div> <span>You follow him in and Jason tells you that he needs to make a phone call.  You have been expecting Jason to contact his \"friend\" that he spoke to earlier and now you have to come up with a plan of action.<br>\r\n<br>\r\nJason grabs his cell phone and goes back outside but a few seconds later he comes back in a little shorter from the trip. \"Hey kid, where's your cell phone?  The battery in mine is dead.\"<br>\r\n<br>\r\nYou go and get it out of your bag.  You turn it on and hand it to him.  \"Don't stay on it too long and run down my battery.\"<br>\r\n<br>\r\n\"I'll stay on it as long as I want to kid, remember who the big man is around here.\"  Jason does is usual bicep flex and he quickly puts his arm down because it's not that impressive anymore.  You smile as he walks back outside.<br>\r\n<br>\r\n\"Bruce, Jason...Come up to the cabin.  It should take you about an hour.  The old man is gone and I'm here alone with the kid but I'll take care of him.  I can't wait to see what my lover looks like after role playing on the web with you for the past year.  I'm a lot bigger than I told you, so this time I'll be the giant and you be the shrinkee. -  Yea, I knew you would like that.  See you soon\"<br>\r\n<br>\r\nJason walks back into the cabin and you notice that his shorts are getting ready to drop. You try to hold back your laughter because he still out muscles you.<br>\r\n\"Here's your phone kid.\"<br>\r\n<br>\r\n\"I'm going to call Dad to see how my Aunt is doing.  I'll be right back.\"  You go out and play back the conversation that you had the phone record of Jason and his friend talking.<br>\r\n\"So that's what he's up to.  Well looks like I'm going to have some fun with Jason after all.</span></div></div>",
            "created":1219208400,
            "id":572654,
            "title":"\"The phone call tells all\""
        },
        "1132212221":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Bruce meets the new Jason",
                "Bruce ain't as dumb as he looks"
            ],
            "content":"<div class=\"\"><div> <span>You walk back in through the cabin door and look around for Jason but you can't see him anywhere.  You call out, \"Jason are you in here?  Come out come out where ever you are. I know your hiding somewhere.  Don't make me come and find you.\"  You walk over and you find his clothes laid out on his bed like he shrunk while he was in them. <br>\r\n<br>\r\n\"Hmmm, could Jason be in here?  You pick up the shirt that used to contain his massive chest and back and oh, those abs, how deep and thick they were.  You put your hand in the sleeve that could barely contain his twenty four inch upper arm.  \"No, Jason's not in here.\"<br>\r\n<br>\r\nYou pick up his size 15 sneakers. \"Jason, you hiding in here?  Phew, I hope not for your sake.\"  You tilt the huge footware on their ends and tap them on the floor. \"Well you lucked out on this one.\"<br>\r\n<br>\r\nYou look down at his shorts.  \"Well looks like you might be in here.\"   You slowly pull the zipper down that till a hour ago held in one of the biggest cocks around.  Then you feel in the leg openings that stretched as he would purposely flex each quad while walking. \"Well Jason it appears that there is only one place that you can be.\"<br>\r\n<br>\r\nYou take hold of his navy blue speedo and separate it from his shorts.  You look inside and a huge grin comes across your face.  \"Jason, there you are!\"<br>\r\n<br>\r\nJason is now only four inches tall and lying in his speedo.  He looks up at you and yells out, \"I don't know how you did this but you're going to pay for it if it's the last thing I do.\"<br>\r\n<br>\r\nYou pluck Jason out of his hiding place and hold him up to your face.  \"Oh, I hope you don't take this the wrong way but you can't do anything to me.  Hell, my cock is bigger than you.  You know I would love to continue this inane conversation but I'm on a time schedule.  Your so called friend will be here soon.\"  Jason whips his head up at you.  \"Yes, I know all about your plans and I need to get ready.  Lucky for you I brought along a little container to put you in for safe keeping.\"  You get the container out of your bag and Jason puts up a fight but he's no match for you.<br>\r\n<br>\r\n\"Now watch this Jason.\"  You take off all your clothes and put on Jason's speedo, shorts,shirt and (phew) sneakers. This already feels good and your cock is already growing but the clothes are hanging on your small frame.  You set the device for grow, point it at yourself, and push the button.  <br>\r\n<br>\r\nYou immediately start to grow bigger in all directions.  The front of the shirt is rising up with your newly forming chest.  Your arms are filling out the sleeves and your shoulders and back are all tugging on the material.  Your feet are inching forward within their confines.  Best of all, your thighs and cock are doing their best to fill out the speedo and shorts.  You feel huge and powerful.<br>\r\n<br>\r\n You end up growing to over six and a half feet tall and Jason's clothes are tight on you.<br>\r\nYou pick up Jason and hold him up to your arm as you flex.  \"Look Jason, this is what guns are supposed to look like.  You feel your \"package\" through your shorts and lick your lips.  \"You'll meet him in a little while but first things first.  I hear a car coming up the road.\"</span></div></div>",
            "created":1219294800,
            "id":572685,
            "title":"\"Jason loses his shirt, etc.\""
        },
        "1132212222":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                " Going down...on Jason",
                "A much smaller problem"
            ],
            "content":"<div class=\"\"><div> <span>You go back into the cabin but you don't see Jason anywhere.  \"Jason are you in here?\"  You look around the cabin and then you spot Jason's clothes on the bed laid out like he was wearing them.  \"Holy shit, did I shrink Jason down to nothing?  The shrinking must have accelerated while I was outside.  He might be in the bed somewhere within his clothes.  I'll just set the control for grow and aim it at his clothes.  Here goes nothing.\"  You aim the ray at his clothes and Jason doesn't reappear.  \"Maybe I have to set the control higher?\"  You do so and fire again.  \"Still nothing.  Damn, how could I let him out of my sight.  Maybe he went outside.\"  You go look but in your haste, you leave the device on top of Jason's bag next to the bed. <br>\r\n<br>\r\n\"Damn, he's not out here.\"  You run back through the cabin door and stop.  You look around and notice that Jason's clothes are no longer on the bed.<br>\r\n<br>\r\n\"SHIT\"<br>\r\n <br>\r\nThe word barely leaves your lips when the door slams shut behind you and you're lifted high up in the air.<br>\r\n<br>\r\nA deep voice starts you shaking. \"I think you were looking for me. You're not up on your role play.  I was hiding in my bag and I put my clothes on my bed to fool you and you took the bait like a fish in a bathtub. You forgot that you are playing games with the big boys, you little runt.\"  Jason puts you down and flexes his huge bicep. \"That's more like it.  When my friend Bruce gets here, we'll show you how it's really done but in the meantime how about we have some \"fun\" of our own.\"<br>\r\n<br>\r\n\"Jason, it was just a joke.  Where's your sense of humor?  Ha Ha.  Come on big guy. You know that I would do anything for you.  Why you're my muscle god!\"<br>\r\n<br>\r\nJason is smiling now.  \"Are you finished begging for your life?\"<br>\r\n<br>\r\n\"Yes SIR\"<br>\r\n<br>\r\n\"Good\"  <br>\r\n<br>\r\nThe ray hit's you right in the chest.<br>\r\n</span></div></div>",
            "created":1219208400,
            "id":572657,
            "title":"\"Stupid is as stupid does\""
        },
        "1133":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                " Kyle comes to pick you up",
                "You go to pick Kyle up",
                "Kyle takes you to work  at the gym instead"
            ],
            "content":"<div class=\"\"><div> <span>You think about your father's friends and you pick the one that you're most likely to have a good time with. <br>\r\n<br>\r\n \"Dad I think it would be great if Kyle could come with us.\"  <br>\r\n<br>\r\nKyle works for your father at the gym and when you became interested in working out, Kyle took you \"under his bicep\".  Only seven years older than you,  the beefy twenty five year old out weighs you by a hundred and thirty muscular pounds.  He treats you like a kid brother and you have always looked up to him both literally and figuratively.  You have an idea, that with the help of your new \"toy\", you can get to know him a lot better.<br>\r\n<br>\r\n  \"Son, I don't know if Kyle is free this weekend.  I'll have to check the schedule\"<br>\r\n<br>\r\nYour father is a bit jealous of your relationship with Kyle because the two of you have always been buddies unlike your relationship with him.  You put on the sad looking face that always works when you want to get your way.<br>\r\n<br>\r\n  \"Please dad.\"<br>\r\n<br>\r\nYour father looks at you mystified and mumbles to himself, \"There's the sad face.  I hate when he gives me the sad face.  Gets that from his mother.\"<br>\r\n<br>\r\n   \"Dad?\"<br>\r\n<br>\r\nYou still have a perfect record as your father gives in.<br>\r\n<br>\r\n   \"Ok, I'll call him up. If Kyle wants to go then he can have the time off.\"<br>\r\n<br>\r\nYou are already thinking of things to do when you're up at the cabin with Kyle and the device and you notice that you have a little growth action going on in your shorts.<br>\r\n<br>\r\n   \"This should be interesting,\" you mumble under your breath.<br>\r\n</span></div></div>",
            "created":1219640400,
            "id":574192,
            "title":"Alex and Kyle"
        },
        "11331":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "The phone rings",
                " The doorbell rings"
            ],
            "content":"<div class=\"\"><div> <span>Sean, your father, comes into your room to give you the news.  <br>\r\n<br>\r\nHe whispers,\"Alex, get your things together.\" then he yells out, \"We're going to the cabin with Kyle.\"<br>\r\n<br>\r\nYou yell back, \"Wow, dad this is going to be great.\"<br>\r\n<br>\r\nYour dad is putting up a good front since he's not thrilled with Kyle like you are but he has no way out of it without upsetting you.  \"Kyle is coming to pick us up in his Suburban.  He should be here in about fifteen minutes.\"<br>\r\n<br>\r\nYour dad leaves you alone in your room.  You don't have much to pack but you want to test out the device before you go. Sneaking out to the back yard, you look for a test subject.  You spot a little rabbit and set the device on grow and press the button.  \"Holy shit!\" You yell. \"It works.\" The little bunny is now a six footer.  You're about to shrink him back when your father yells that Kyle is here.  \"Harvey\" the rabbit hops off into the woods as you hop to it back into the house.<br>\r\n<br>\r\nSeeing the two big men together you think to yourself, \"Kyle and dad could have been brothers if not for the thirteen year age difference.\" It's true that both men are 6'3\" but Kyle is 300 lbs of muscle while your father weighs much less and has a little bit of a gut.<br>\r\n<br>\r\n\"Alex\", Kyle yells out when he sees you running toward him.  You jump into his waiting outstretched arms and he lifts you high up in front of him.<br>\r\n\"Either you're getting heavier or I have to work out some more.\"<br>\r\n<br>\r\nDad interrupts the big reunion, \"Kyle, put him down before he gets a nose bleed. Come on let's get out of here before something happens.\"<br>\r\n</span></div></div>",
            "created":1219640400,
            "id":574195,
            "title":"\"Kyle comes a knockin\""
        },
        "113311":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "In the bathroom",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>No sooner do the words \"something happens\" leave Sean's lips when, well, something happens...the phone rings.<br>\r\n<br>\r\nYou tell your father not to answer it but he secretly doesn't want to go so he gladly picks it up.<br>\r\n<br>\r\nSean listens for a second before, \"Why hello Linda!  Alex, it's your Aunt Linda.\"<br>\r\n<br>\r\nYou put down your bag because you know that if Aunt Linda is calling then it has to be bad news.<br>\r\n<br>\r\n\"What's that you say Linda?  You've got some bad news. Uh huh, Uh huh, that's just awful, Uh huh, Uh huh. Don't worry we'll be there as soon as we can.\"<br>\r\n<br>\r\n\"Dad, what is it this time?  Has she a hang nail that needs trimming?\"<br>\r\n<br>\r\n\"Alex, don't be a wise guy.  She has woman problems and I have to take her to the doctor.  You have to stay with \"Scratches\" cause she can't be left alone.\"<br>\r\n<br>\r\n\"Dad, 'scratches' my ass, it's a cat, cats can be left alone\"<br>\r\n<br>\r\n\"Alex, I'm not going to argue with you.  Sorry Kyle, we'll have to do this some other time.\"<br>\r\n<br>\r\nKyle has been listening to \"life's little troubles\" but he has his own problems.  \"Sean, would you mind if I went by myself.  I am really psyched up for the rest in the mountain air.\"<br>\r\n<br>\r\nSean is thrilled with the change in plans, \"I don't mind if you go without us. You relax and have a good time.  Come on Alex, go get in the car.\"<br>\r\n<br>\r\nYou're not in the least bit happy about it but you get in the car. Sean and Kyle are still in the house.<br>\r\n<br>\r\nKyle grabs his crotch, \"Sean, do you mind if I use the 'facilities'?  I really have to go.\"<br>\r\n<br>\r\n\"Kyle, go right ahead.  Just lock the door when you leave. I'll see you at the gym on Monday.\"<br>\r\n<br>\r\nKyle answers back with a \"Yes, sir.\"<br>\r\n<br>\r\nSean gets into the car to find a very unhappy ex-camper.  \"Oh no you don't.  I'm not falling for the sad face this time.\"  <br>\r\n<br>\r\nYou really give it all you've got and your father starts to crack. <br>\r\n<br>\r\n\"Well, I guess the cat can stay alone.  You can go with Kyle.  He's still in the house.\"<br>\r\n<br>\r\nYou're thrilled,\"Thanks dad! You're the greatest dad there is.\" <br>\r\n<br>\r\nYou grab your bag and run back to the house as your father drives away.<br>\r\nWhere will you find Kyle...<br>\r\n</span></div></div>",
            "created":1219640400,
            "id":574197,
            "title":"\"About face\""
        },
        "1133111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "less than a quarter an inch",
                "you pick a height"
            ],
            "content":"<div class=\"\"><div> <span>You are happy that you are going with Kyle but an idea pops into your head before you open the front door. \"Kyle thinks that I'm with dad.  Wouldn't it be fun if I went with Kyle without him knowing about it.\"  You sneak into the house and you stop and listen for where Kyle might be.  Suddenly you hear the toilet flush in the guest bathroom so you quietly go to your room which is next to the bathroom.  <br>\r\n<br>\r\nKyle is humming a tune while he sits on the bowl. You're about ten feet away from your big buddy.  You set the device for shrink and point it at yourself with some hesitation. \"I hope this works.\"  You press the button and you immediately feel warm all over as the room grows larger and you get smaller.  One thing you didn't realize is that your clothes don't shrink with you but luckily the device does.<br>\r\n<br>\r\n Your now less than two feet tall and still shrinking inside your clothes and Kyle is still humming. You finally end up at....<br>\r\n</span></div></div>",
            "created":1219640400,
            "id":574199,
            "title":"\"A shrinking you will go\""
        },
        "11331111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Rest stop action",
                "\"Cop\" a feel"
            ],
            "content":"<div class=\"\"><div> <span>You continue to shrink past a foot, past six inches, past three inches.  You're getting too small. You end up less than a quarter of an inch tall and you're in what seems to be a huge white cocoon.  Your a bit dizzy and trying to get your bearings when you notice that it's quiet.  The humming has stopped.<br>\r\n<br>\r\nYou are about to hit the grow button when you feel the floor shaking.  You take the strap attached to the device and put it around your wrist cause this is one thing that you don't want to lose. You're angry at yourself for getting into this mess and the shaking is getting worse.<br>\r\n<br>\r\nSuddenly you're lifted high up in the air within the white cocoon which you now realize is your own sock.  What is Kyle doing with my sock?  You're bounced around a bit and you end up at the bottom of the smelly garment.  The bouncing continues and then you see \"light at the end of the tunnel\" but in this case it doesn't represent a good ending ahead but rather the beginnings of a bad one.<br>\r\n<br>\r\nWhat you see next scares the piss out of you.  Coming at you is what looks like a bus but in reality it's Kyle's huge cock.  \"He's using my sock to jerk off in!\"  The huge uncut cock head comes barreling right at you but there's no place for you to go. You're pushed against the end of the sock by the throbbing giant member.  Kyle is going hot and heavy on his cock and what happens next really blows you away.  He is moaning as he says your name.  You yell out, \"Kyle has the hots for me.\" You're voice is too low and the moaning is too loud for any chance of you being heard.<br>\r\n<br>\r\nKyle's cock grows to it's full twelve inch length and the \"cover has come off the helmet\".  Even though the odor is awful, you're sporting wood yourself.  A little precum gets on you and you move to the side of the slit. You try to remain still but it's like sitting on the top of a tall flag pole that is swaying in the wind.  He is still moaning and saying your name and you just imagine his huge powerful hand holding on to the other end of his cock.  Kyle is about to cum when...the phone rings.  The answering machine picks up and a horrible voice echos throughout the house.  \"Sean, it's Linda.  Where the hell are you?  Have you left yet?  You should have been here ten minutes ago!\" <br>\r\n<br>\r\nThe throbbing stops.  You hear Kyle say,\"What a buzz kill,\" as his cock starts to retract.  You're stuck to the head as the foreskin comes over you.  The sock is removed and you're left residing at the end of your idol's cock. You remain perfectly still which isn't such a problem because you're surrounded by some cheesy substance.<br>\r\n<br>\r\nThere is a brief moment of light before he puts his cock away and zips up his shorts.  You're in for the ride of your life.<br>\r\n</span></div></div>",
            "created":1219640400,
            "id":574201,
            "title":"\"I've got you under my... skin\""
        },
        "113311112":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "the cops mouth",
                "the cops ????"
            ],
            "content":"<div class=\"\"><div> <span>Every little movement that Kyle makes rocks your universe.  Your mind is on cloud nine but physically you're not going anywhere. You still can't get over knowing that Kyle finds you attractive. Huge, muscular, built Kyle wants you!  Now you can't wait to tell him that the feelings are mutual but there's just one little problem...you're stuck on the end of his cock! <br>\r\n<br>\r\nKyle is in his truck speeding down the highway heading for the cabin in the mountains.  He wants to get there before sundown because he doesn't know the area that well.  The radio is blasting and Kyle doesn't notice that a motorcycle cop is trying to get him to pull over. Finally the CD comes to an end and Kyle hears the siren and pulls over.<br>\r\n<br>\r\n\"Shit, I can't believe this.  My insurance is going to go through the roof.\"<br>\r\n<br>\r\nThe angry cop gets off his motorcycle and walks toward Kyle who is watching him approach in his rear view mirror.<br>\r\n<br>\r\n\" This is some big mother fucker. If he's a gym rat, maybe I can talk my way out of this.\"<br>\r\n<br>\r\nThe huge cop walks over to the driver's window bringing his attitude with him.  He is making the most out of his leather uniform as he has moves with a \"swagger\" from the top of his polished helmet to the bottom of his polished boots.<br>\r\n<br>\r\n\"You son of a bitch! Do you have any idea how many miles...How fast you....\"<br>\r\n<br>\r\nThe cop gets tongue tied as he gets a look at Kyle's huge left bicep as it just happens to flex for no other apparent reason than to impress the officer. <br>\r\n<br>\r\n\"Sir, I'm asking you to get out of the car.\"<br>\r\n<br>\r\nKyle laughs to himself knowing that he has this guy just where he wants him.  Kyle gets out and stretches his arms and inflates his chest.  He knows this type very well from working at the gym.  They walk around and get a hard-on from watching the big guys.  The officer stares at the perfection of Kyle's body and the size of his \"package\".<br>\r\n<br>\r\n\"Sir, I have to search you. Put your hands against the vehicle and spread your legs.\"<br>\r\n<br>\r\nKyle gladly complies and flexes his muscles as the cop puts his hands over them.  Kyle makes his move.  When the cop sticks his hand between Kyle's legs, Kyle closes them and flexes his thighs.  The cop keeps his hand there longer than necessary.  He finally removes his hand and sniffs it as Kyle turns around.<br>\r\n<br>\r\n\"Officer, I can't help but notice that you've got some decent size.  I'm surprised that you're that big cause you probably don't get a chance to get to the gym too often.  You must have good genes.\"<br>\r\n<br>\r\nThe officer is surprised by the comments but is glad to receive them from such a well developed hunk.<br>\r\n<br>\r\n\"Thanks, I work out when I can but I don't look half as good as you.  You must have great genes\"<br>\r\n<br>\r\nKyle comes in for the kill.  He grabs his own crotch with his big hand.<br>\r\n<br>\r\n\"Yea I do.  Like to get a look at them?\"<br>\r\n<br>\r\nYou don't know what's going on but you can tell that Kyle is moving around.  All of a sudden you're brought out into the light again but your vision is cloudy as you look though the thin layer of skin. There is a swooosh of fresh air as the giant cock extends and the skin slightly pulls back.<br>\r\nYou are in trouble cause Kyle's cock will be going in....<br>\r\n</span></div></div>",
            "created":1220418000,
            "id":577973,
            "title":"\"Cop\" a feel"
        },
        "1133111121":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "goes home ",
                "follows Kyle"
            ],
            "content":"<div class=\"\"><div> <span>Kyle unzips his fly and whips out his huge cock and it's size causes the cop to step back in shock. Kyle walks over to the dazed man and looks him straight in the eye.<br>\r\n<br>\r\n\"You're a public servant.  You know that you want to service me. Take off your jacket and give it to me now.\"<br>\r\n<br>\r\nThe cop takes off his leather jacket and Kyle takes it and puts it on.  The feeling of power and the smell of the leather combined with the cop's sweat causes his muscles to swell and the leather stretches to accommodate them. Kyle's cock is getting harder and as he walks over to the motorcycle, the huge appendage is swaying in the breeze. He sits down with his legs straddling the seat and his cock sticking upward.<br>\r\n<br>\r\n\"Get over here and service me now!\"<br>\r\n<br>\r\nThe cop quickly goes over to Kyle.  The last thing that you see before the darkness hits are the cop's lips as they go down on the huge monster in which you are a lucky passenger.  The tongue greets you as you are pushed further into the cavern like you are on top of a Saturn V rocket.  The violent sucking and licking causes you to leave the \"capsule\" before the rocket goes down the throat.  You hide out under the tongue by grabbing hold of something and you are hoping to hitch a ride when the \"mission\" is over.<br>\r\n<br>\r\nKyle is holding the cop down on his cock by the back of his head.  He pulls his cock from the cop's throat.<br>\r\n<br>\r\n\"I'm going to cum in your mouth and you are not to swallow a single drop.  You understand me?\"  Kyle moves the cops head up and down.  \"Good, now lick my head.\"  The officer does as told and Kyle takes a deep breath and explodes into the waiting receptacle.  \"Don't you dare swallow.\"  Kyle lets the cop stew a while.  \"Now, spit all of my seed out into your helmet.\"  The cop has a blank expression on his face.  \"DO IT!\" He does as told and a load of cum fills up the bottom of the helmet and you go along with it.<br>\r\n<br>\r\nKyle puts his cock back in storage and takes off the cop's jacket.<br>\r\n<br>\r\n\"Now you can put your jacket and helmet back on.\"<br>\r\n<br>\r\nThe cop balks at putting the helmet on but Kyle insists. <br>\r\n<br>\r\nYou're coated with Kyle's cum and you can see light but you have no idea where you are.  You can't chance growing yourself until you can be sure that nobody is watching.  All of a sudden you feel like you have just been lifted a great distance and things go dark again.  <br>\r\n<br>\r\nKyle gets back in his truck and drives away and pats his groin.  \"What a great start to the weekend.\"<br>\r\n<br>\r\nThe cop....<br>\r\n</span></div></div>",
            "created":1220418000,
            "id":577974,
            "title":"\"Cop sucker\""
        },
        "11331111211":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "sex, shower, hit the road",
                "playtime?"
            ],
            "content":"<div class=\"\"><div> <span>After what seems to be forever, the loud buzzing noise stops and your host is on foot again.  You still don't know what's going on but you figure that it's about time that you find out.<br>\r\n<br>\r\nThe cop is back at his house and he is feeling horny as hell after just having an encounter with the hunk of his dreams.  Still in his uniform, he stands in front of a full length mirror, pulls out his cock and starts going at it while he thinks about his encounter with Kyle.<br>\r\n<br>\r\n\" I want to fill up this jacket with the muscles that the last man wearing it had.  Make me grow into his size and my arms, chest and back stretch out this jacket like he did. I would give anything to be huge and have his big cock.\"<br>\r\n<br>\r\nYou can hear someone mumbling something but you don't hear any other voices.<br>\r\n<br>\r\n\"I have to take a chance and shrink this guy so that I can get the hell out of this mess that I'm in.\"<br>\r\n<br>\r\nThe cop is pumping away at his cock and wishing that he was bigger when you take the device and aim it at his head.  Pressing the shrink button you instantly feel your \"host\" going down.  The cop is still looking at himself in the mirror and stops pumping when he notices that his clothes are getting bigger on him.<br>\r\n<br>\r\n\"What the fuck!  This isn't what I wished for.  I'm getting smaller. Noooooo, this can't be happening.\"<br>\r\n<br>\r\nYou hold on to the cops hair as he shrinks and his helmet falls off.  For the first time since you were stuck in Kyle's cock, you can see your surroundings. He is down to four feet and you are inside his shirt .  At two feet you are in his pants. The cop is in shock and he doesn't notice you yet but at the one foot mark both of you are in his briefs and he looks down at you.<br>\r\n<br>\r\n\"Who the fuck are you?  What the hell is going on here? Do you have anything to do with this?<br>\r\n<br>\r\nHe lunges for you but you are ready for him.  Before he can touch you, you give yourself a shot with the growth ray.  Now you are growing past a foot as he gets smaller.  At two feet your legs are through the briefs.  You quickly grow to your normal height and your standing in front of the mirror in the cops briefs.  You feel something moving around your cock and when you pull the front elastic forward you see the one inch cop struggling in your pubes.<br>\r\n<br>\r\n\"WOW! This is great!  I have a little man in my shorts.\"<br>\r\n<br>\r\nYou look around at the clothes that are lying at your feet.<br>\r\n<br>\r\n\"Holy shit!  This guy is a cop.  How great is this!<br>\r\n<br>\r\nYou pluck the little man out of your pubes and bring him up to your face.<br>\r\n<br>\r\n\"Now, what am I going to do with you little man?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":597867,
            "title":"\"Trading small Places\""
        },
        "113311112111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                " Put on his uniform and leave with him",
                "Put on his uniform and do away with him"
            ],
            "content":"<div class=\"\"><div> <span>The cop yells out in a high voice, \"You have to return me back to my normal size.  I can't live like this.\"<br>\r\n<br>\r\nYou look down at him in your hand. \"By the looks of your muscles, you must have been a big guy before I shrunk you.  If you want to ever be that big again then you're going to have to pump me up.<br>\r\n<br>\r\nThe cop looks confused. \"This is ridiculous.  At my size, how can I work out your body?\"<br>\r\n<br>\r\nYou tap him lightly on his head,\"Hello, is this on?  I want you to work my cock and get me off.  Simply put, keeping me happy, keeps you alive.\"<br>\r\n<br>\r\nYou like being hard on the little guy cause you inherited your dislike of cops from your dad.  Years ago he got a string of tickets during an end of month, \"I gotta make my quota for the month blitz\", and he has never forgotten about it, nor does he refrain from talking about it over and over again.<br>\r\n  <br>\r\nYou feel all sticky from still being covered in Kyle's cum so you go in to the shower and take the cop with you.  You stick him at the base of your cock and tell him to hang on.  As you wash yourself, you keep one eye on the little guy who is struggling to hold on to your growing cock.<br>\r\n<br>\r\nThinking again about your father, you come up with another plan.<br>\r\n\"Looks like you're you're too small to stay on my cock.  How about I put you in a safer place for a while.\"<br>\r\n<br>\r\nYou take the little cop in your hand while you bend over and pop him easily through your butt hole.  \"If you want to stay alive then you better move around in there.\"  He must have heard you cause you receive a wave of good sensations through your groin and your member is growing larger.  This is all new for you and you're loving it.  The cop is moving around as you squeeze your anal muscles and your cock is now ready to blow.  You retrieve him from his temporary \"digs\" and he is relieved to be out of there but the feeling is short lived because you hold him at the head of your cock where he takes the brunt of the orgasm as your stiff cock unloads all over him.<br>\r\n<br>\r\nYou feel great after totally humiliating the cop.  You finish showering and clean him off at the same time.<br>\r\n<br>\r\nWhat will you do next?<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":597868,
            "title":"\"Shower with a cop\""
        },
        "1133111121111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Pull over a speeder",
                "Hungry?  Make a donut stop"
            ],
            "content":"<div class=\"\"><div> <span>You go back to where the cop's clothes are lying. You take his briefs and put them back on. With the little man in the palm of your hand, you explain to him that he is going to be keeping your cock company and if he steps out of line, he can easily be swallowed. Without ceremony, you open up the elastic strap and drop him in on top of your manhood.  You snap it shut and proceed to put on the rest of his uniform.<br>\r\n<br>\r\nThe cop was much bigger than you so the uniform is \"swimming\" on you.  Not to worry, as you take the device and point it at yourself and press the slow grow button. You stand in front of the mirror as you see your arms, chest, back, shoulders, and legs take up the air gap between your flesh and the material until you look like a muscle stud. The boots somehow hold the power of the position and as you put them on, not only do you gain a few inches, you now have the attitude.  You pick up the leather jacket and sniff the scent of a real man on it that you recognize as Kyle's.  You slowly put it on and it hugs your new body. The helmet is the last to be put on but it's still full of Kyle's jiz. You wash it out in the bathroom sink and use the cop's hair blower to dry it out.<br>\r\n<br>\r\nYou just realize that you don't have any other clothes but the uniform so you  find a duffel bag in the closet and raid the cop's dresser drawers, taking out everything that you'll need for the rest of the weekend.<br>\r\n<br>\r\nNow back out in front of the mirror, you put on the helmet and the image is complete.  You feel your cock growing as the cop is trying to move around it.<br>\r\n<br>\r\nYou like what you see and feel so it's time to hit the road and surprise Kyle.<br>\r\n<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":597870,
            "title":"\"Cop for a day\""
        },
        "11331111211111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "opposites attract",
                "the big man takes over"
            ],
            "content":"<div class=\"\"><div> <span>You hop on the cop's motorcycle, put on your shades, and head out on the highway thinking that it was a good thing that you used to ride dirt bikes with your friends.  Cruising along at sixty five, you approach the mountains in the distance when a big pick up truck comes speeding up from behind and passes you like you were standing still.  It takes you a few seconds to figure out where the siren is but once it's on, you go after it.<br>\r\n<br>\r\nWhen you finally catch up to the truck, you see a guy behind the wheel and signal him to pull over. You park the motorcycle behind the truck and you take out the device just in case you run into trouble.  In the back of your mind you're still a little kid and not the tough cop that you're trying to project to the world. The illusion that you have been living for the past ten hours suddenly cracks. <br>\r\n<br>\r\n\"What the hell am I getting myself into? What if this guy's a killer or something?\"  You catch a glimpse of yourself in your rear view mirror and you stand up straight and push out your chest.  \"I look great.  This guy is probably scared to death of me.  What am I worried about? I'm a tough cop. I'm a tough cop.\"<br>\r\n<br>\r\nYou catch the guy looking at you in the rear view mirror as you strut over to the driver's window. The guy rolls down the window and sticks his elbow out.  His upper arm looks like your thigh. You're tough facade is shattered as the door opens and the biggest man that you've ever seen steps out. He stretches like he just woke up from a nap, showing off his massive physique and making you feel like the little man that you are.  You don't know it but this same scenario started out like this earlier today with Kyle and the cop in your briefs. <br>\r\n<br>\r\nLooking down at you, the giant speaks in a deep voice with a calm tone. \"Officer, what did you stop me for?<br>\r\n<br>\r\nYou now have a bulge in your pants that has not gone unnoticed by the big man.  You try to hold it together as you eek out a response. \"Sir, I pulled you over because you were exceeding the speed limit.\"  Years of watching cop shows has given you the cop lingo.  \"Could you show me your license and registration.\"  You really don't want to see it but you just have to watch his back flare out as he reaches into the truck to get it.  The guy has other ideas though.<br>\r\n<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":597872,
            "title":"\"Pull over the perfect man\""
        },
        "113311112111111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Don't tell him just yet",
                "Tell him now"
            ],
            "content":"<div class=\"\"><div> <span>As you take the items from the big man, you make contact with his huge hand and you swear that you felt something like a spark jump between the two of you. Looking up at him, you see a puzzled look on his face.  You don't know what just happened but you notice a growing bulge in his pants.  You take off your sun glasses to read his license and you find out that his name is Steve and that he is 24 years old, 6' 11\" tall and weighs 385 pounds and from the looks of him, it's all muscle. He also lives in the town next to you.<br>\r\n<br>\r\nHe takes off his sun glasses and looks into your hazel eyes.  You in turn look up into his blue eyes and the two of you stare at each other for what seems to be minutes but is actually only seconds before Steve speaks. \"You know, I've heard that this can happen but I never believed it until now.\"<br>\r\n<br>\r\nYou are a little puzzled and you think you know what he is trying to say but you don't want to be the one to say it just in case you're wrong. You carefully respond, \"What are you referring to?\"<br>\r\n<br>\r\nSteve looks directly into your eyes, \"Didn't you feel something when we touched and when I look into your eyes I can see into your soul.  I think we were destined to meet and be together but there's just one thing that's out of place.\"<br>\r\n<br>\r\nYour feeling really good about this. You have a good feeling deep in your loins but you have to find out what the problem is. \"I am feeling the same as you so what's the problem?\"<br>\r\n<br>\r\nSteve's face turns meaner. \"The problem is that you're a cop and I hate cops.\"<br>\r\n<br>\r\nYou burst out laughing which gets a response from Steve. \"What's so funny?\"<br>\r\n<br>\r\nYou take off your helmet. \"Look, I'm not a cop.  I just took this uniform and the cycle away from a cop whom I outsmarted.  See, I'm not even carrying a gun.  I needed a ride to meet up with someone in the mountains and thought I would have some fun along the way.\"<br>\r\n<br>\r\nSteve laughs along with you. \"That is pretty funny.  Now that you're not a cop, I think we can be more than just friends if you feel the same way.\"<br>\r\n<br>\r\nYou can't believe your good fortune.  You've always admired big guys but you wanted them just for the physical aspect.  Here you've found the biggest guy ever and you have an instant emotional contact with him.<br>\r\n<br>\r\nYou try to explain how you feel. \"I have to be honest with you.  At first I had a, dare I say, strong physical attraction to you but then I felt the same thing that you did. I'm only eighteen and haven't been around a lot but to use a famous movie line, 'Steve, I think this is the start of a beautiful friendship'.\"<br>\r\n<br>\r\nSteve picks you up and gives you a bear hug against his huge chest.  You now have to decide whether or not to tell him about the device, the cop and Kyle.<br>\r\n<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":597873,
            "title":"\"At first sight\""
        },
        "1133111121111111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "SHIT, IT'S HUGE!",
                "Shrink him by mistake "
            ],
            "content":"<div class=\"\"><div> <span>Steve puts you down and has a few questions for you. \"Since I can't call you officer then what should I call you?<br>\r\n<br>\r\n\"Although I'm dressed for the part, when I'm out of uniform you can call me Alex.\"<br>\r\n<br>\r\nSteve laughs again. \"Alex, I like your sense of humor.  You mentioned that you were supposed to meet someone up in the mountains, do you still have to go?\"<br>\r\n<br>\r\nYou don't want to lie to him.  You always thought of Kyle as an older brother, a very big one but a brother just the same.  His body turned you on but you never felt the way that you already do with Steve. \"I was going to surprise a friend of mine and my fathers who is staying at our cabin in \"Rustic Acres\" for the weekend.  By the way, where are you heading?\"<br>\r\n<br>\r\nSteve's hard-on is getting bigger. \"Another act of fate.  I'm going to my cabin in \"Rustic Acres\" for the weekend.  Why don't you stay at my place and then we can go surprise your friend.  I'll just put your bike in the truck.\"<br>\r\n<br>\r\nYou're trying to look up at Steve's face and not his crotch. \"Sounds like a great plan.\"  You watch as Steve lifts up the huge bike and puts it in the truck bed.  Your eyes don't leave his body as he straps down the bike. \"Get my duffel bag down, will ya.\"<br>\r\n<br>\r\nYou hold on to the grab bar and climb up into the huge truck on the passenger side.  Steve just steps right in on the driver's side.  His shoulders are so wide that he takes up most of the inside of the truck. Steve puts his hand on your knee.  \"I need to ask for a favor but you have me so turned on that I'm not going to be able to concentrate on driving unless I'm takin' care of.  I know that you've been staring at my crotch...\"<br>\r\n<br>\r\nYou interrupt him. \"You don't have to explain anything to me.  We're on the same wavelength. Just let that bad boy loose and I'll take good care of it.<br>\r\n<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":597874,
            "title":"\"Details\""
        },
        "11331111211111111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "Off to Steve's cabin",
                "There's a knock on the door"
            ],
            "content":"<div class=\"\"><div> <span>You have no idea what your in for.  Steve unzips his fly and as he pulls down his briefs, his cock comes flying out like it's been spring loaded.  It goes over the steering wheel and hunks the horn.  You just stare at it with your mouth hanging open. \"I thought it was big but that's gigantic!  Were you ever in porn with that thing?<br>\r\n<br>\r\nSteve laughs at your response.  \"I should do porn but it's tough for me to find anyone who can take in the whole thing so I usually have to settle for a hand or blow job.  Right now I could really use either.\"<br>\r\n<br>\r\nYou're getting a hard-on just from looking at the \"monster\" and you just remember about the cop in your briefs who is trying to survive.  You ignore him and lean over to lick the head of the still growing cock.  You savor the taste of the giant's manhood as you take the head into your mouth.  Salivating all over the head gives you good suction as you take in more of the shaft.  Steve is pumping blood to his member as he rests his huge hands on top of your head, forcing you further down the veined column of pulsating flesh. <br>\r\n<br>\r\nYou're thinking of the big hunk of a man that's with you as you go up and down on his cock like a jack hammer. You try to take it down your throat like you've seen done in porn videos but this is your first time trying it and his cock is huge. <br>\r\n<br>\r\nSteve is yelling out \"suck it, suck it\" as his strong hands put more pressure on the back of your head.  It's going down your throat whether you like it or not.  As the cock head turns down towards your stomach, Steve yells out YES! and moans louder.  The windows of the truck are all fogged up and you're about to cum yourself when you feel his cock get even larger.  You know what's about to happen so you clamp down on the shaft and feel the pumping cum go though your lips on its' way to your stomach.  \"Take it, take it all, take all of me.\"<br>\r\n<br>\r\nYou swallow all of your lover's cum and when he pulls out he takes a hold of your head and plants a big wet one right on your lips. \"That's the best blow job that I ever got from a cop.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":597876,
            "title":"\"SHIT, IT'S HUGE!\""
        },
        "113311112111111111":{
            "author_id":"mrhaney",
            "author_name":"Toby",
            "choices":[
                "On the road again",
                "Nobody can eat just one"
            ],
            "content":"<div class=\"\"><div> <span>Steve drives for another hour and the two of you are surprised by how you think alike on so many things. From what flavor ice cream (vanilla), to how often you like to jerk off and to whom ( once daily to Mr. Olympia).<br>\r\n<br>\r\nSteve pulls into a gas station. \"I'm going to fill up the tank. Do you want anything to snack on from the store?<br>\r\n<br>\r\nYou think for a second. \"I could use a soda but first I have to go and make room for it.\"  You go around the side of the store where the bathrooms are. There are two stalls inside and a couple of urinals but you take a stall so that you can check up on the cop.  You zipper down your pants and pull open your briefs.  \"How you doing down there buddy.  You've been awful quiet for a while now.\"  The cop barely moves so you take him out in your hand and hold him up to your face.<br>\r\n<br>\r\nUsing all of the energy that he can muster, the cop yells out, \"You fuckin' asshole, why don't you just kill me.\"<br>\r\n<br>\r\nLooking down at the pitiful sight, you start to feel bad for him.  \"I got someone else in my life now so I'll grant your request.\"  There's a look of surprise on the cops face as you hold the little man over your open mouth and as he starts to squirm, you drop him in. Your tongue is holding him to the roof of your mouth and you already have a hard-on in your briefs. He slides down your throat, fighting all the way into your stomach where he continues to move around.  You can't believe the feeling of power that you have and you're thinking that the cop is now going to become a part of you and you already have his uniform on. You feel the tightness of your arms in the jacket as your cock lets out a load into the toilet.<br>\r\n<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":597879,
            "title":"\"Gas 'n Eatery\""
        },
        "1133111121111111111":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Show him to the cabin! Why not?",
                "Thanks, but no thanks!"
            ],
            "content":"<div class=\"\"><div> <span>\"Aaahhh...\" you hear, from the stall next to you. Steve has just let out an enormous load of yellow into the toilet, and then you're both ready to hit the road again. Zipping up your pants, you get back in the passenger seat of Steve's car.<br>\r\n<br>\r\nThe rest of the trip passes uneventfully. Steve is pretty quiet, and you do nothing to change that, though occasionally you smile when you think of the eaten cop. Finally, Steve pulls up to the cabin.<br>\r\n<br>\r\n\"We're here!\" he announces. You both get out of the car, and Steve stretches out. His frame towers above even your expanded body as he reaches for the sky. Pulling his shirt off, he turns and starts limbering out. His iron muscles stand out against his skin as he turns and looks at you with a grin on his face.<br>\r\n\"Welcome! Now, where's this other cabin? Do you need a lift there?\"</span></div></div>",
            "created":1272171600,
            "id":873468,
            "title":"On the road again, to the cabin"
        },
        "11331111211111111112":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Frighten him!",
                "Something else!"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, but I think I'll find my own way,\" you reply. Steve is nice, but your evening with Kyle was supposed to be alone, not with a Steve person. Besides, you still haven't tested out the ray on Kyle like you'd intended to.<br>\r\n\"Actually, I think I might need a few pieces of clothing before I go. Do you mind?\"<br>\r\n\"No, dude, not at all.\" Steve enters the cabin, returning with a few shirts and several pants, with three boxer shorts to top it off. \"Is that enough?\"<br>\r\n\"Yeah, that'll be great. Thanks!\"<br>\r\n\"Take care.\"<br>\r\n<br>\r\nWith your great strength, you soon outdistance the cabin. Taking your clothes off, you replace them with Steve's old ones. They're far too big for you, but a shot with the ray gun makes you expand enough to make them stretch over your ballooning chest. Your dick grows until it pokes out of your pant leg, and you stare at it without comprehension for a few moments. Soon, you're at the cabin. Kyle is standing there, drinking a beer nonchalantly. He doesn't see you yet, though.</span></div></div>",
            "created":1272171600,
            "id":873469,
            "title":"Thanks, but no thanks!"
        },
        "11331111211111112":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "To the cabin"
            ],
            "content":"<div class=\"\"><div> <span>As he reaches down and begins to unzip, you lean over and inadvertently push the \"shrink\" button. Instantly, Steve begins to lose height. Down, down he goes, still unzipping his now too-large pants sexily. Your boner grows to epic proportions, when you suddenly realize that he's only six inches tall.<br>\r\n<br>\r\nHastily hiding the shrink ray, you stare at the tiny Steve as he opens his eyes and freaks out.<br>\r\n<br>\r\n\"Shit, what happened?\" he shrieks. He struggles in the enfolding canopy of his clothes and stumbles out, totally naked. You see his enormous cock and gasp. It sticks up disproportionately on his tiny form. Quickly picking him up and nestling him in the palm of your hand, you begin feverishly speaking nonsense.<br>\r\n<br>\r\nYour plan works. Steve is confused enough to believe that this is a dream and calms down. You hit the gas and move off towards the cabin.</span></div></div>",
            "created":1292994000,
            "id":1020127,
            "title":"Shrink him by mistake "
        },
        "113311112111111121":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Keep him shrunk",
                "Grow him back up"
            ],
            "content":"<div class=\"\"><div> <span>Steve realizes that it's not a dream pretty quickly and begins to squirm. You sigh exasperatedly and pull over. Steve wriggles out of your grips and lands in your lap. He looks up at you reproachfully. <br>\r\n<br>\r\n\"What's going on?\" he asks, one eyebrow raised. You shrug. \"If you know any more than I do,\" you say, \"then you'd know something.\" Steve nods, but still looks distraught. \"I'm like four inches tall,\" he burst out. \"What am I going to do?\"<br>\r\n<br>\r\n\"I'll go to the cabin, and we'll decide what to do there. You just make yourself comfortable for now.\" Steve nods and tugs on your zipper to open your fly, then climbs in and falls alseep. You zip it up after him and start drlving. <br>\r\n<br>\r\nOnce you arrive, you don't wake him up just yet. Instead, you investigate the buttons on the remote. There are three; one says, \"Grow,\" one says, \"Shrink, and one says, \"Settings.\" When you push \"Settings\", a blue screen appears in midair. You see that you can control the rate of growth or shrinking, the exact height and weight and size, and a whole lot of other things that you hadn't thought of, like Sex Appeal, whether or not people would notice the change, and how horny they were.<br>\r\n<br>\r\nYou set the dial on \"Incredibly\", shift Cock Size to nine inches soft, and point it at yourself. The change is gradual, but noticeable, and you feel yourself grow hornier with each passing second. Your fingers itch, and it doesn't take long before your shirt is off and you're rubbing yourself in ecstasy. Your pants are next, and you unzip, then carefully remove, the gently slumbering Steve. Naked and horny as hell, you step out of th truck and touch your eleven inch boner. It explodes suddenly, and you come enthusiastically, spraying white ropes in every direction. You still feel horny, and then realize that the remote would keep you constantly aroused, so you point it at yourself and click it to \"Auto\". <br>\r\n<br>\r\nPutting your clothes back on, you turn to Steve, who continues to sleep unawares. </span></div></div>",
            "created":1301893200,
            "id":1082254,
            "title":"To the cabin"
        },
        "1133111121111111211":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "The cum reached the device; the shock you feel is its power being transferred. ",
                "The device exploded; it doesn't work anymore"
            ],
            "content":"<div class=\"\"><div> <span>You twist the dial all the way to \"Epically\" and the size to six inches in height, with a proportionately normal-sized dick. You press Grow and watch as Steve changes, wakes up, and looks at you. You reach out your hand and grab the tiny hunk, lifting him up to your face. You shake your head, and Steve Lois a little disappointed, then the Epic Horny setting begins to affect him. It starts with just a boner, but Steve is soon gasping as his balls scream for release. You walk in the house, pretending to be oblivious, as Steve gets harder and harder and more and more turned on. Finally you set him down on a countertop and walk out of the room. When you come back, it's with the porn DVD that Kyle thinks he's hidden so cleverly. Steve is rocking back and forth, feeling turned on by everything, even the sight of a window, the touch of countertop on his skin, etc. You pull up a small television and push the DVD in, pointing it towards Steve. As the first heavily muscled man pulls off his shirt, Steve comes. You walk into the next room and twist the knob labeled \"Ball Size\", and the \"Cum Capacity knob\", too, to a very large size for such a tiny person. When you walk in, Steve is coming in a great stream, the cum pooling around his tiny form.<br>\r\n<br>\r\nYou step up on the countertop and shrink yourself down to eight inches. Steve is riveted to the porn onscreen and does not notice. The reel is about to end and the movie stop; you hasten to twist and slide and push until you're a buff, six-inch-tall sexy guy with a massive dong. You aim the remote at Steve and expand a few things over there, most noticeably his height from six inches to eight and from epically horny to simply \"Rather Horny\". Steve turns and looks at you in surprise as you walk over. You drop yhe remote nonchalantly and give Steve a hug. Your cock presses against his, and he grabs your bulging muscles in a tight embrace. His hands slide down...<br>\r\n<br>\r\nSteve touches your thirteen-inch softie with one hand and your face with the other. Your softie does not last long at his touch, and it becomes a boner very quickly. Steve pulls you close in a deep and passionate kiss, his hand rubbing up and down the length of your cock. You wrap your hands around his waist and squeeze the thick muscle, pulling him closer. Steve gets hard and begins to pump your hardon energetically, causing you to come in his hand. You rub your hands all over his body, and push him gently to the floor. His cock begins to shoot off uncontrollably, and you are both soon covered in sticky white cum. You thrust your cock into Steve's ready ass...and suddenly receive a powerful electric shock. </span></div></div>",
            "created":1301893200,
            "id":1082267,
            "title":"Keep him shrunk"
        },
        "1133111121111112":{
            "author_id":"akatheguy",
            "author_name":"akatheguy",
            "choices":[
                "Steve doesn't mind.",
                "Steve isn't happy. He snatches the device!"
            ],
            "content":"<div class=\"\"><div> <span>After a minute or so, Steve puts you down and you stare up at him with a little smile on your face. Inside, though, you worry that telling him everything would ruin it. But...well, you owed Steve the truth. He had been nothing but nice to you.<br>\r\n<br>\r\n\"Um...Steve...about that cop that I told you about? The one I outsmarted?\"<br>\r\n\"Yeah, what about him? Where is he?\"<br>\r\n\"He's...um...he's...\"<br>\r\n\"...Did you kill him?\"<br>\r\nYou gasped in horror, and this made the truth seem a little bit less horrifying if anything. \"No! I...um, I shrunk him.\"<br>\r\n\"You what?\" Steve asked.<br>\r\n<br>\r\n\"Yeah. He pulled me over and I...I used this device to shrink him.\" You pulled out the device and showed it to Steve. <br>\r\nSteve's enormous body seemed to grow a little more, if possible, at the sight of it - he had inhaled deeply when he saw the device. But after a second, reality kicked in. \"Yeah, right. That's just a toy gun,\" he said, his cynicism cutting through his desire for you to be telling the truth.<br>\r\n<br>\r\n\"Oh really?\" he laughed. \"Then what's this?\"<br>\r\nYou pulled on your waistband and grabbed the miniscule cop out of your - actually, his - pants. You held him in thumb and forefinger and lifted him all the way up so he was in front of Steve's face.<br>\r\n<br>\r\nYou saw Steve's eyes widen in amazement. \"That's amazing,\" he said. \"A little cop.\"<br>\r\n\"Haha...yeah,\" you said, surprised Steve was so OK with it. \"I had to grow myself a bit so I could fit into his clothes.\"<br>\r\nAs you lowered the cop from Steve's sight he let out a big, booming laugh. \"Aww, were you even smaller than you are now?\"<br>\r\nShivering a little, you nodded. The size you'd grown to wasn't small whatsoever - the cop had been a solid, muscular man, over 6ft tall before you shrunk him - but compared to Steve you might as well have been a termite. He was truly enormous, tall enough for the NBA and wide enough for the NFL. <br>\r\n<br>\r\nBut this was where it got awkward. \"There's just one more thing. I was with a friend of mine, Kyle, when he got pulled over by this guy. But Kyle didn't know I was with him...I'd sort of shrunk and ended up on his person...\"<br>\r\nSteve nodded along, still amazed by everything that was happening.<br>\r\n\"So I landed up with the cop, and Kyle went ahead to the cabin I was supposed to meet him at. I shrunk the cop and ended up here.\"<br>\r\nYou noticed Steve was frowning. \"So this Kyle...\"<br>\r\n\"He's a good friend of mine. He works for my Dad...he's like a big brother to me in a lot of ways. But...well...\"<br>\r\n\"I get it,\" said Steve quietly. </span></div></div>",
            "created":1439182800,
            "id":2019463,
            "title":"Tell him now"
        },
        "11331111211111121":{
            "author_id":"akatheguy",
            "author_name":"akatheguy",
            "choices":[
                "It's a trick. He takes the ray, the cop and the  bike and leaves you!",
                "\"Hop in.\""
            ],
            "content":"<div class=\"\"><div> <span>\"No problem, little man,\" Steve said after a minute. \"I know you and I are meant to be together.\"<br>\r\nYou nodded. You were increasingly feeling the same way.<br>\r\n\"So you were gonna meet this Kyle guy at a cabin in the mountains? I'm headed up that way myself.\"<br>\r\n\"Wow,\" you said with a low whistle. \"This really is destiny.\"<br>\r\nSteve reached out with his unbelievable, saucepan-lid of a hand and ruffled your hair, which nearly caused you to fall backwards. \"Told you so. So what's say we take you, the cop, and the bike up to the cabin and have a little fun with that shrink ray of yours.\"<br>\r\n<br>\r\n\"That sounds great.\"<br>\r\n\"I never really thought about it but...the idea of having a tiny little man in my hand is unbelievable. Can I hold the cop?\"<br>\r\n\"Of course!\" you said, willing to do anything to make Steve happy. You held out the cop and Steve grabbed him, engulfing the figure with that big hand.<br>\r\n\"Haha, you really are a helpless little bug, aren'tcha?\" Steve turned the cop over again and again in his hand, disorienting him, and you laughed at this display of dominance while feeling slightly aroused by it. You blurted, \"you know, that shrink ray doesn't just shrink. It grows stuff, too. And I don't think there's a limit.\"<br>\r\n<br>\r\nSteve's grin widened. \"That 'beautiful friendship' you were talking about...\" he said vaguely.<br>\r\n\"I know, right?\" <br>\r\n<br>\r\nHe grabbed you by the shoulder and held you tightly to him, then - with the cop still in one hand - walked over to the bike and lifted it with his other hand, dumping it in the back of the truck. </span></div></div>",
            "created":1439182800,
            "id":2019495,
            "title":"Steve doesn't mind."
        },
        "113311112111111212":{
            "author_id":"akatheguy",
            "author_name":"akatheguy",
            "choices":[
                "Nope! You and Steve make it to the cabin without incident.",
                "Yep! You get rid of the cop."
            ],
            "content":"<div class=\"\"><div> <span>You weren't going to argue! You jumped into the truck and Steve drove off quickly, his huge fingers loudly drumming the steering wheel - he was clearly being driven crazy by what was going on.<br>\r\n<br>\r\nThe tiny cop was sat, shivering with fear, between the two of you near the handbrake. After about 10 minutes you reached out and grabbed him. \"You know...I kinda just want to eat you,\" you said with a big grin. \"Get it over with, yknow?\"<br>\r\n<br>\r\nSteve let out a big, booming laugh at this idea, but said, \"nah, don't do it. I want to have some fun with him when we get to the cabin.\"<br>\r\n<br>\r\nSo does your resolve break?</span></div></div>",
            "created":1440478800,
            "id":2025683,
            "title":"\"Hop in.\""
        },
        "1133112":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Shrink him now and drive up with the tiny muscleman.",
                "Wait to do anything until the cabin."
            ],
            "content":"<div class=\"\"><div> <span>\"Great news, Kyle!\" you yell, running into the house. \"I'm coming with you!\"<br>\r\n<br>\r\n\"That's great!\" says Kyle cheerfully. I was hoping your dad would let you come.\"<br>\r\n<br>\r\nYou grin mischeivously, already thinking of how you're going to change your seven foot friend. </span></div></div>",
            "created":1293685200,
            "id":1025875,
            "title":"Somewhere else"
        },
        "11331122":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Aaaaaand...Kyle finds it.",
                "You a wake up and are ready the seize the day."
            ],
            "content":"<div class=\"\"><div> <span>The trip is uneventful, but you have a constant boner from your proximity to Kyle, and you're tempted to shrink him several times. You manage to hold yourself back, though. <br>\r\n<br>\r\nWhen you arrive at your little cabin, you're unsurprised as to its condition. The place has been a dump for years now, out in the middle of nowhere. Kyle pulls up, and you both hop out. Once inside the cabin, Kyle sprawls out on the couch while you collapse on the chair. It's been such a long day, you completely forget about the remote, dropping it absentmindedly on the side table. </span></div></div>",
            "created":1293685200,
            "id":1025878,
            "title":"Wait to do anything until the cabin."
        },
        "113311221":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "But it has..."
            ],
            "content":"<div class=\"\"><div> <span>Kyle is awake first. He yawns, stretches, and notices the remote on the side table. <br>\r\n<br>\r\nYou are shaken awake and asked \"Is this yours?\" \"No,\" you respond sleepily. \"Good,\" says Kyle. <br>\r\n<br>\r\nBy the time you wake up enough to stop him, Kyle has aimed your remote at himself and pressed the Shrink button. Nothing happens. \"Damn,\" says Kyle. \"I thought it would work.\" </span></div></div>",
            "created":1293685200,
            "id":1025880,
            "title":"Aaaaaand...Kyle finds it."
        },
        "1133112211":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "A few minutes later...",
                "Kyle lied."
            ],
            "content":"<div class=\"\"><div> <span>\"What did you thought would work, Kyle?\" you ask, slowly waking up.<br>\r\n<br>\r\n\"It's a shrink ray,\" he says in response. \"I wanted to see what the world is like from your angle, so I twisted the knobs and pushed the button, but nothing happened.\" You aren't quite as concerned with the why anymore, though. You're more freaked out by the fact that Kyle was no longer a seven foot muscleman. He was now a still substantially strong but far smaller man. <br>\r\n<br>\r\n\"Uh, Kyle?\" you interrupt. \"It kinda did work...\"<br>\r\n<br>\r\nKyle turned and saw what you were referring to. \"Damn.\" he says once, then louder, \"Damn!\" He excitedly ran his fingers over his arms, noticing for the first time the world getting larger around him. You, on the other hand, are feeling somethhing else grow. Preoccupied with Kyle's transformation, you don't even notice the arm hat isn't flexing. <br>\r\n<br>\r\nKyle rips his shirt off, watching his pants simply fall to the ground, shortly followed by his undershorts. Standing naked in fron of you, he coyly displays his massive boner, daring you to make a move on a man your height. You resist, wanting to wait until you have control of the shrink ray. Kyle shrugs and moves into the kitchen to retrieve a beer, leaving his clothes behind him. </span></div></div>",
            "created":1294635600,
            "id":1033156,
            "title":"But it has..."
        },
        "11331122111":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Kyle grows to ten feet, you also",
                "Kyle grows to ten feet, you to nine"
            ],
            "content":"<div class=\"\"><div> <span>After a beer or two yourself, sex with Kyle is not only an appealing idea, but ever increasingly a need that must be fulfilled. After the first minute, you'd noticed that your T-shirt no longer fit the same way, and that your cock was swelling at an unbelievable rate. It had to be nine or ten inches by now. You walk into the room, sitting down next to Kyle. <br>\r\n<br>\r\n\"Well, Kyle,\" you say, trying to avoid staring at his growing member, \"I've been thinking, and I decided something.\" Kyle gets up and stretches, making sure his enormous cock is shoved in your face. You ignore him. \"However,\" you add, \"you need to be normal size for this to work. Please give me the remote.\" Kyle thinks for a minute, then hands it to you. You fiddle with dials for a few seconds, firing at both yourself and Kyle. \"There,\" you say confidently, as you feel a faster growth happen. \"Let's fu-\" Kyle is on you like a flash, his expanding cock filling your field of vision as you suck blindly. Kyle bucks, cumming violently into your mouth, as you hold his muscular form up to your face. He's sruprisingly lightweight, but you can feel him getting heavier as he grows. <br>\r\n<br>\r\nYou pull the tiny muscleman out of your mouth and turn him around, stuffing your meat into his asshole. He yelps, but submits to your massive junk as you pound him like a pro. Pretty soon, Kyle is your height and growing fast. Your cock fits more and more easily, so Kyle turns around and gives you some of his. You take the strain of his even now rapidly growing cock, finally letting go and cumming all over the floor.<br>\r\n<br>\r\nFinally, Kyle notices that he is not normal size, but nearly eight feet tall. You're only seven feet. He squeezes outside, barely making it in time, closely followed by your own growing form. You roll together in the grass, fucking each others' brains out and loving it.</span></div></div>",
            "created":1294635600,
            "id":1033196,
            "title":"A few minutes later..."
        },
        "113311222":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Grow yourself a bit while you're in there",
                "Make Kyle's change slower or faster. "
            ],
            "content":"<div class=\"\"><div> <span>You get up earlier than Kyle does, a good thing for your master plan. You aim the remote at Kyle and fiddle with it a bit, then press the button. There is no outward change, but you know that it has started working already. <br>\r\n<br>\r\nYou get up and go outside, waitin for Kyle to join you. Kyle walks out, and you say to him, without looking, \"Sleep well?\"<br>\r\n<br>\r\n\"Very,\" says Kyle. You turn around then, and are greeted with the sight of a totally nude Kyle. This sets you of like an inferno and a fire alarm. It's all you can do to stop yourself from jerking right then and there. <br>\r\n<br>\r\n\"What?\" you splutter. Kyle grins, not making any move to cover himself. \"This is what I always do when I'm out here. It's in the middle of nowhere, it's not like I'm offending anyone. Will you do it, too?\" You tell him you'll think about it and go back inside.  </span></div></div>",
            "created":1294894800,
            "id":1034758,
            "title":"You a wake up and are ready the seize the day."
        },
        "1133112222":{
            "author_id":"mansized",
            "author_name":"ManSized",
            "choices":[
                "In a panicked voice, Kyle says, “You have to help me!”",
                "In an excited voice, Kyle says, “Wow, this is awesome!”"
            ],
            "content":"<div class=\"\"><div> <span>You head back into the cabin, but can’t help but peer through a window at the naked Kyle you left behind. Seeing his massive body in all its glory has you craving him and that bod more than ever. You continue watching as his body visibly contracts, causing him to suddenly lose his footing a bit.<br>\r\n<br>\r\nHe steadies himself against a chair, and you realize he’s down about at least half a foot. Now you’re not sure you want him to be so small, so fast.<br>\r\n<br>\r\nYou grab the remote, and set it for a slower shrink setting. Then you aim it back at Kyle and hit the button, just as another shrink spell causes Kyle to lose a couple more inches.<br>\r\n<br>\r\nKyle looks a little dizzy and confused, and you see he’s still holding onto a chair for support. You decide to rejoin him, and head outside.<br>\r\n<br>\r\nHe sees you leaving the cabin, and shakes his head. “Man, these woods can really put a number on you,” he calls out. “While you were gone, I’ve been getting all lightheaded.”<br>\r\n<br>\r\n“What do you mean? You okay?” You ask innocently, walking toward him. <br>\r\n<br>\r\n“Yeah, I’m fine. Though it’s funny. I don’t remember this chair being so high. Nor this table. Nor …” he pauses momentarily as you step up just inches away him. “… you!”<br>\r\n<br>\r\nKyle, formerly 7 feet tall, used to be well over a foot taller than your 5’10” body. But now, he has maybe just a few inches up on you.<br>\r\n<br>\r\nKyle shakes his head again. “Dude, when’d you get to be so tall! Just how big are you?”<br>\r\n<br>\r\n“5-10,” you answer.<br>\r\n<br>\r\n“5-10? No, that’s impossible. I’m 7 feet! You must’ve had a growth spurt … But that doesn’t make sense, you’re clothes still fit … And … and … Hey, are you growing right now?”<br>\r\n<br>\r\n“I don’t think so, Kyle,” you say, with a trace of sarcasm in your voice.<br>\r\n<br>\r\n“Well, if you’re not growing, then … then … I must somehow be …” Kyle looks around him a little frantically, noticing everything around him getting a little bigger. “ … shrinking!”<br>\r\n<br>\r\nKyle’s height stabilizes, and you realize he’s just an inch or two taller than you! “Wow, you’re right!” you say, nonchalantly.<br>\r\n</span></div></div>",
            "created":1297486800,
            "id":1052933,
            "title":"Set the remote to a slower setting."
        },
        "11331122222":{
            "author_id":"mansized",
            "author_name":"ManSized",
            "choices":[
                "Same-size Kyle gets a little frisky.",
                "Kyle wills himself to shrink further."
            ],
            "content":"<div class=\"\"><div> <span>Kyle looks dumbstruck for a moment, “How’s this possible? People don’t just shrink!”<br>\r\n<br>\r\n“But you are shrinking! You can’t deny it, Kyle. Look around you,” you say.<br>\r\n<br>\r\n“You’re right, you’re right…,” he mutters to himself. He gets a strange look in his eye, and says some other things under his breath. You’re unsure what must be going through his head.<br>\r\n<br>\r\n“Kyle, everything okay?”<br>\r\n<br>\r\nKyle looks back at you, then smiles. “Everything okay? Everything okay?! … Dude, this is awesome!”<br>\r\n<br>\r\nNow, you’re the one who’s dumbfounded, as Kyle begins grinning like a mad man. “Awesome?” you respond.<br>\r\n<br>\r\n“Frickin’ awesome! Ever since I was a kid, I’ve been freakishly tall. Taller than everyone in school. Taller than everyone in my family. Taller than everyone on the street. I hated it; I was always the center of attention, even when I just wanted some privacy.... I’ve always had these dreams, fantasies, that one day I’d shrink, and no longer be so big!”<br>\r\n<br>\r\n“So, you don’t mind shrinking?”<br>\r\n<br>\r\n“Mind? This is incredible. Like my dreams are coming true…,” Kyle paused, as he began to shrink a little more. “Ohhh-hh…”<br>\r\n<br>\r\nHe looked straight at you now, directly in your eyes. “Holy fuck, dude! We’re the same size now!”<br>\r\n</span></div></div>",
            "created":1304830800,
            "id":1102782,
            "title":"Dreams come true?"
        },
        "113311222222":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Reveal the culprit immediately.",
                "Play with Kyle a bit more."
            ],
            "content":"<div class=\"\"><div> <span>As Kyle shrinks even further, he looks around, muttering, \"Now, what could have caused this? I want it to go a little faster.\" You overhear him and yelp, \"Faster? How small are you gonna get?\"<br>\r\n<br>\r\nKyle grins and says, \"Two feet, dude. Maybe even one. Geez, I'm horny as hell just thinking about it.\" Not that you didn't notice that, of course! A thought strikes him. \"What if I end up at only two inches tall? Duuuuuuude!\" He runs into the house to check his progress in the mirror. While his back is turned, you decide quickly and give him a good zap with the ray. He begins to shrink visibly, beginning to stumble as the house grows larger.<br>\r\n<br>\r\nYou follow him and find him putting on his old clothes, which slip right off him. Noticing that he barely comes up to your chest, you click the remote and stop the change. You clear your throat.<br>\r\n<br>\r\n\"Er...Kyle, I was wondering...what do you think caused it? If somebody else did it to you, how would you, er, thank them?\" Kyle looks at you, massive shirt slipping off his shrunken frame, and licks his lips slowly. Well, that answers that, then.</span></div></div>",
            "created":1316494800,
            "id":1191370,
            "title":"Kyle wills himself to shrink further."
        },
        "115":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "Point it at him and press grow when he isnt looking",
                "Give it to him",
                "Shrink yourself"
            ],
            "content":"<div class=\"\"><div> <span>Wondering what it would be like for your fantasies to come true you bring the remote with you. You think the best time to show your dad is when you arrive at the cabin, the trip seemed like forever because of how excited you where. After about 2 hours you turn on to back roads and drive towards your cabin in the middle of no where. <br>\r\n<br>\r\nLater once you and your dad were done unpacking all of your things and sit down you decide it would be a great time to show your dad the remote.<br>\r\n<br>\r\nWhat should you do</span></div></div>",
            "created":1210568400,
            "id":531038,
            "title":"Show your dad the remote"
        },
        "1151":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "He wakes up ",
                "You wake him up",
                "Explore his body"
            ],
            "content":"<div class=\"\"><div> <span>You decide it would be hot if you made your dad grow and he didnt know what was happening, so when you two were watching tv you secretly pulled out the remote and pressed the grow button while it was aimed at your dad. Another button poped out when you pressed it reading \"slow growth\" or \"fast growth\". You thought that the fast growth<br>\r\nbutton would be better so you pressed it and a green light flashed out, hitting your fathers leg. Your dad feel asleep on the couch and you were so dissapointed with the fact that it didnt work you almost wanted to cry untill you noticed him getting a little bigger. Soon enough the real growth started. Your dad was laying down right by you so his socks were right to the right of you inching closer and closer, the smell also getting worse and worse.<br>\r\nHis clothes started getting tighter and tighter untill it looked like he was wearing a muscle shirt and really tight girl jeans. His feet started stretching out his socks and soon enough his big toe ripped through the sock followed by all the other toes. Being free from the cramped up prison your dads feet stared to wiggle in there new found space which was at this time right in your face. You jumped of the couch as your dads clothes busted off showing his manly body and his giant manhood, as the couch collapesed under his weight, his giant body started breaking down the cabin. His feet break through the wall. You run outside. His massive fingers break through some windows and his body is so big, even though he was still laying down he broke through the roof. So here you were standing by your fathers giant smelly wiggling toes and you can barely breath they reek so bad, and he completely destroyed your cabin <br>\r\n<br>\r\nwhat happens now</span></div></div>",
            "created":1210568400,
            "id":532231,
            "title":"Growing daddy"
        },
        "11511":{
            "author_id":"silverzeo",
            "author_name":"Joe",
            "choices":[
                "He doesn't believe you, he demands the truth.",
                "He buys it and starts wondering off in his \"dream\""
            ],
            "content":"<div class=\"\"><div> <span>Dad begin to stir from his sleep. His massive head rolling around, crushing the remains of drawers of your clothes in the bedroom. His giant right hand lift up from the where the kitchen used to be and used it to scratch his balls, the massive genitals were sensitive to the open air, not to mention that the TV was under them and was giving them a mild electric shock. You look at all, seeing that hand pressing up and down on that giant shack, with all that hair.<br>\r\n<br>\r\nStill drowsy, Dad didn't notice that he was touching his balls without his pant and undies... at first. But after starting to feel the breeze of the open air  all over his body. he lifts his head up to see that he was in the total nude. <br>\r\n\"What the crap?\" He then noticed that he was nude... outside. \"What the hell!?\" He then stands up, ranging in a height of 25 feet, he then notices that he was as tall as the trees in the area as well as the remains of the the cabin (spotting the remains of the expensive TV he bought for the cabin was the dead give away). \"WHAT THE FUCK!?!?!\" He then spots you, with a toothy grin from ear to ear from the perverted ideas you had in your head.<br>\r\n<br>\r\n\"Son,\" he said a calmly as he can, \"WHAT'S GOING ON!?!\"<br>\r\n\"Uh,\" you said, holding back your excitement and trying to think of a reasonable excuse to tell your giant dad (without talking about the ray). \"This is... a dream\"<br>\r\n\"A Dream?\" he asks questionable.<br>\r\n\"Yeah. A dream.\" he said. </span></div></div>",
            "created":1251262800,
            "id":750748,
            "title":"Daddy Biggest"
        },
        "115112":{
            "author_id":"silverzeo",
            "author_name":"Joe",
            "choices":[
                "renacting his favorite monster movie in the city.",
                "Taking a wiz on another cabin in the woods."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm dreaming.\" said Dad looking in the distance. He's buying it. He began to flex his arms and shake his dick a bit, while looking around at everything being smaller than him. He must had stand about 25 foot tall. \"This is too good to be true!\" His facial expression has change to that of a drunken look, and when Dad was drunk, he always made an ass of himself.<br>\r\n<br>\r\nDad then began to walk away, causing the ground to shake slightly with each foot fall, walking right through a thicket of trees to feel them brush against his manhood. <br>\r\n<br>\r\nYou decided to to follow him, this was too good of entrainment to miss. Seeing Dad make a literal giant jackass himself, and with you're ray, you can make him a bigger jackass, or shrink back to normal to see get his cumupins. It was good thing you brought the mountain bikes and luckly, they were still in the rather the cabin that Dad burst out of.<br>\r\n<br>\r\nPeddling as heard as you can, you follow the path of destcution that Dad and you find your titanic father...</span></div></div>",
            "created":1251522000,
            "id":752446,
            "title":"Dad's delusion."
        },
        "1151122":{
            "author_id":"silverzeo",
            "author_name":"Joe",
            "choices":[
                "stinky foot.",
                "masssive wang."
            ],
            "content":"<div class=\"\"><div> <span>On your bike, you mange to get pass to the trees and found your father stand in front of another cabin not too faraway from where yours used to be. <br>\r\n<br>\r\nDad had his hands on his wang, which then fired a strong stream of yellow, foul smelling liquid onto the wooden house. Dad decided to have with his aiming and fired his pee through the windows of the house, seeing if he could fill it up. After several minutes of peeing (Dad a had a couple of beers before his nap) the door of the cabin opened and out came a man who was soak shin high with Dad's piss. Even though the man had a shotgun in hand; as soon as he leftt the cabin, he was an open target for Dad's \"gun\" and the man was soon covered and push back by Dad's yellow stream. <br>\r\n<br>\r\nBefore the man could have drown, Dad's supply ran out. But don't count the man luck as of yetl because as soon as the man got back on his feet, he was force down again as Dad got on top him with his...</span></div></div>",
            "created":1251694800,
            "id":753675,
            "title":"Dad is the Wiz King"
        },
        "11511222":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Let him have his fun but bigger",
                "The truth shall set you free"
            ],
            "content":"<div class=\"\"><div> <span>Just as the man started to stand back up your dad pushed him right back down again with his dick.  While watching this you realized you didn't really want that man to die so you quick yelled \"hey dad lets go to the lake and skinny dip\" your dad then got up and started giggiling wondering if he could touch the bottom as the man hightailed it out of there as quick as he could.  When you and your dad reached the lake he walked right on in then started to have a hissy fit because you hadn't taken your clothes of yet, you hesitated for a second not fully remembering why you had to then you realized you'd just used this as an excuse to save a man so you shed your layers and hoped in with your gigantic dad.  Affter being in the water a grand total of 10 seconds you couldn't do anything but gape as your dad was trying to position himself so he'd surface with you riding his cock this idea did get you very hard especially considering you could \"give hime more to work with\" but you also wondered if it was time to \"sober\" dear old dad up and tell him the truth</span></div></div>",
            "created":1366952400,
            "id":1578691,
            "title":"masssive wang."
        },
        "115112221":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Show him the remote and come clean",
                "Going up to his level"
            ],
            "content":"<div class=\"\"><div> <span>Well you were pretty confident he could get you at present size you decided to quickly fetch the remote to provide this beautiful sex symbol that you called dad extra help (and size).  You quickly punched in the proper buttons and zapped him but he was to preoccupied to notice the shot but soon he realized he was growing, and fast so he quickly but your new \"steed\" beneath you and but a second later he had you.  Soon he finished growing at 75 ft tall and he was loving the fact his son was now less then half the size of his cock laughing and giggling to the point where he nearly tripped and fell out of the little lake.  Once he had pulled himself together he said five rather shocking words \" I know I'm awake son.\"  You nearly fell off your perch at this being shocked he'd do all the things he did so you asked him, why were you going along with the dream idea the?  Well shrimp I just wanted to see what I could get away with and have a little fun is all.  You figured the was all right and if it wasn't who could stop him?  Well I do have a few questions for you though junior he said setting you down and stepping out of the shin high (to him) puddle laying down on his stomach to get as close as possible, how did you do it and can you do it again? </span></div></div>",
            "created":1377320400,
            "id":1650599,
            "title":"Let him have his fun but bigger"
        },
        "1151122211":{
            "author_id":"singrfan",
            "author_name":"JamMan",
            "choices":[
                "A pair of arms grabs you from behind, and you drop the gun......",
                "His giant foot knocks you over, an the ray gun points at another cabin, still on"
            ],
            "content":"<div class=\"\"><div> <span>You stare at your giant dad's face, almost as tall as you, as his deep brown eyes pierce right into you as he waits for you to answer. You hesitate for a moment, unsure of what consequences showing him the remote will bring, but lust over comes you as your eyes linger over his perfect giant body. You know you want to see him even bigger.<br>\r\n<br>\r\n\"Well dad, I can actually control your size with this.\" You produce the remote and show him the functions to increase someone's size. His eyes widen as he takes in the new information.<br>\r\n<br>\r\n\"You mean you intended this to happen? You wanted your dad to become a giant?\" He asks in slight surprise. You nod sheepishly, not even trying to hide the growing arousal you are feeling at seeing your father in all of his naked, giant glory. He smirks and stands up to his full height. You gasp as you look up nearly eighty feet, past his gorgeous thighs, huge package, perfect abs and pecs and finally resting on his grinning face.<br>\r\n<br>\r\n\"WELL SON, WHAT ARE YOU WAITING FOR?\" he booms. \"GIVE YOUR OLD MAN ALL YOU GOT!\"<br>\r\n<br>\r\nYou can't believe you are hearing this. Could you really do it? Could you turn your dad into a......GOD? You try to think reasonably, but your throbbing boner is clouding all of your thoughts, save for making your father's perfect muscular form even BIGGER. You punch in a command, point it at your dad, and pull the trigger. The beam of light hits him and he begins to moan in pleasure, his already ample cock rising as he gets turned on from the growth. His feet stretch across the dirt, plowing through plants and small trees alike as they grow longer and longer. His chest heaves as his pecs swell and inflate, his nipples sticking out fully erect. He begins to feel his muscles as he rises higher and higher into the sky.<br>\r\n<br>\r\nYou are so enraptured by your dad's growing stature that you fail to notice your surroundings. Suddenly, without warning.......</span></div></div>",
            "created":1377320400,
            "id":1651139,
            "title":"Show him the remote and come clean"
        },
        "11511222111":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "You join me ",
                "We go visit the city"
            ],
            "content":"<div class=\"\"><div> <span>As your dad grows and grows reaching 100 feet then 200 then 300 feet tall with no signs of stopping a sudden grasp brings you back to the world as you drop the gun.  You look up and see your holder us a relatively you man who (at normal sizes) might even outclass your dad in size.  After taking everything in you ask the man what he was doing?  Now this man seems pissed just at you not knowing \"I'M TRYING TO KEEP YOU FROM WRECKING THE WORLD DUMBSHIT\" he hollered at you.as loud as possible, which your dad, still being blasted, somehow heard.  Not a moment later did you and your captor feel tremors as your dad (attempted) to bring himself to your level and figure out what's going on.  Your dad know an unchallenged 1000 was buckled over with a panicked look on his face trying to figure out what was happening to his son.  After a bit of scanning your dad spotted you and your \"friend\" now both trying to gain control of the gun that was still magnifying his size beyond godly proportions.  Just as the vigilante camper grabbed the gun and shut it off he was swept away by your fathers nail and flicked away never to be seen again.  \"WELL LITTLE BUDDY,\" your father boomed down standing back up to his 1500 foot tall stature with beyond perfectly muscles and a rock hard 250 foot long cock jutting out from his crotch \"NOW THAT HE'S GONE I THINK IT'S TIME...     </span></div></div>",
            "created":1378184400,
            "id":1656750,
            "title":"A pair of arms grabs you from behind, and you d..."
        },
        "11511222112":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Roughly as large as daddy",
                "Two maybe three times bigger then the former biggest man ever"
            ],
            "content":"<div class=\"\"><div> <span>This was the most erotic site you could comprehend and the kick was you were (more or less) in control of it all.  You had given this increasingly powerful and sexy god among gods the largest and strongest blast the ray could muster and after only 10 seconds of growth he had roughly quadrupled in size to an unfathomable 320 feet but between his growth and the constant masturbation you had forgotten to be mindful of what was going on around you and were nearly killed by his expanding foot.  You had barely saved your skin by diving out off the way but you had lost the gun.<br>\r\n<br>\r\nAbout 50 yards away a hot 21 year old college boy named Jason who was 6'4 with a nice impressive swimmers build was sitting dumbfounded in his cabin at this impossible sight when a strange beam came rocketing in through the window and hit him square in the chest<br>\r\n<br>\r\nAfter avoiding your dad's foot you began frantically looking for the gun after what seemed like an eternity of looking you finally found it blasting full charge at a nearby cabin you quickly shut it off and no sooner did you see a young Adonis erupt from the cabin and grow until he was... </span></div></div>",
            "created":1377493200,
            "id":1651703,
            "title":"His giant foot knocks you over, an the ray gun ..."
        },
        "115112221121":{
            "author_id":"singrfan",
            "author_name":"JamMan",
            "choices":[
                "The beam hits the dad",
                "The beam hits the boy instead"
            ],
            "content":"<div class=\"\"><div> <span>The roof of the neighboring cabin explodes off as the growing face of a gorgeous young man bursts from it, rising quickly into the air. His smooth, tan muscled torso is quick to follow, revealing nice toned pecs with perk pink nipples, a ripped six pack brought on by years of swimming, with a happy trail leading down into a pair of jeans, which seem to be growing with him. He looks confused as he gets larger and larger, towering over the trees until he reached about 300 feet tall, about at big as your giant dad. You look up at this hunk of a young man, your cock standing at attention. This is a dream come true for you, having hot giant men surround you. You really want to test the limits of this gun's growth, but for now you want to see how daddy will react to a new potential playmate.<br>\r\n<br>\r\nThe giant swimmer looks around and sees your dad, eyes closed, still jerking his massive cock, unaware of the new giant in his presence. The young man approaches your dad, his footsteps shaking the earth every time they pound the ground. You back away, not wanting to get crushed under this new young god's foot. He gets to your dad and kisses him on the lips. Your dad is surprised and pushes the guy away. \"WHAT? ANOTHER GIANT?\". The young guy looks at him and says, \"HEHE I GUESS SO. I'M AARON, WANT TO PLAY?\". You dad looks him up and down, grins, and then pulls him in for another kiss, their giant hands groping each others massive muscles, moving down to feel each others' growing bulges. Aaron gets down on his knees and begins giving your dad a blowjob. While he moans in pleasure at the feeling of this giant young Adonis sucking his massive cock, you are furiously jerking off to this amazingly hot site before you. Suddenly you hear a voice coming from the brush.<br>\r\n<br>\r\n\"What the hell did you do to my boy?!\" You stop jerking and turn around, still naked with your cock pointing proudly in the air, as you see a gorgeous hunk of a man stomping towards you from the remains of the cabin you saw Aaron burst through not moments ago. This man stands about 6'7\", which before today would have been simply awe inspiring. He has a much more solid build than his son, with thick slabs of pec muscles and gigantic arms bulging out from his sides. He has a handsome square jaw and dirty blonde hair, and your cock twitches as he approaches you. He grabs you by the shoulders and picks you up to eye level.<br>\r\n<br>\r\n\"What in the hell did you do? We were just sitting in our cabin, minding our own business, when we see this giant man erupt from your cabin and walk over to the lake. And if that weren't enough, all of a sudden my son grows to huge size! And now this!\" he gestures to Aaron, who is still slurping away on your dad's raging boner like it was the most delicious thing on the planet. He turns back to you. \"Did you do this?! I can tell you are enjoying this\" he looks down at your erection, which is still rock hard. \"Well, yes sir, I did do this, but I can always fix it.\" You pull out the gun and show him. He glares at you, and drops you. You lose your balance, and drop the gun. He swipes it from you before you have a chance to grab it again. Shit.....<br>\r\n<br>\r\nHe looks at it, and smiles. \"So this gun can change the size of anything?\" You gulp and nod, hoping he won't abuse it (not like you haven't already). A noticeable bulge begins to form in his sweatpants as he examines the gun, completely oblivious to the giant sex happening around him. Ok, you would be more than fine if he were a giant as well. His huge hairy muscles towering over all. You walk up to him. \"Do you want to be a giant? I will make that happen for you. You could be up there with my dad and your son, more power than you could imagine.\" He looks at you, almost with a glazed look in his eyes as he is imagining being a huge giant. \"Yes, make me a giant. Make me bigger than those two, and you can explore my body to your heart's content.\" he adds, flexing his muscles. You lick your lips in anticipation, and set the gun's growth to 700 feet. Just as you pull the trigger, you hear from the cabin ruins, \"Daddy, daddy! What's happening?\" You get a glance of a young boy, no more than 12 years old, in just PJ bottoms running towards your target. As the beam leaves the gun, the boy jumps towards his dad, and......</span></div></div>",
            "created":1378098000,
            "id":1656249,
            "title":"Roughly as large as daddy"
        },
        "1151122211211":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Smaller player",
                "The new top dog"
            ],
            "content":"<div class=\"\"><div> <span>The beam hit the man square in the chest and sent him soaring above the trees and boomed down to his youngest son \"Sorry little guy but your dad is moving up in the world\" he said rapidly getting more and more godly the trees now only reaching his ankles chuckling away at his little pun seemingly pleased with himself.  His old attire of black boxers now lay in tatters long since forgotten and with this power why should he need them.  Starting to approach the size of the other giants he couldn't help but feel both disheartened and superior as the other two were far to busy to notice him but even with his currently inferior size he was filled with pride at the fact his member was bigger then both of there's.<br>\r\n<br>\r\nYou couldn't think of what you were going to do next watching this man overtake your last to \"creations\" all you knew was you wanted these three men there.<br>\r\n<br>\r\nNow nearly finished with his growth the man broke up your dad and his son and smiled cockily finishing his growth spurt with his perfect body dominating everything and his rock hard cock jutting out of his groin at over 200 feet long looking down at his \"pint-sized\" new friends <br>\r\n<br>\r\nYour dad looked up and said \"Holy hell\" drooling with anticipation ready to play with this new giant no matter what he had to do, while Aaron looked up trying to conceal his attraction (with no luck) and stammered \"Sir how did you get so much... well bigger\"<br>\r\n<br>\r\nThe man boomed down \"Your friend's horny kid down there did this for me, and enough with the sir act now you have my permission to call me Matthew or Matt.\"  \"But now time to get down to business my little friends you to are going to get me off.\" <br>\r\n<br>\r\nAaron was briefly taken aback having never thought of his dad this way but your dad just dived right in as Matt lay down to be pleasured.  Aaron soon snapped out of his little trance and started working on his dad.<br>\r\n<br>\r\nMeanwhile you were getting ready to join them as a...</span></div></div>",
            "created":1378789200,
            "id":1661033,
            "title":"The beam hits the dad"
        },
        "11511222112111":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Change Matt's youngest",
                "Make one off the peaceful sleepers much much bigger"
            ],
            "content":"<div class=\"\"><div> <span>As you prepped the gun for your growth you watched the hypnotic sight of your father sucking the tip of Matt's 200 foot long boner while Aaron was being gently worked over by his enormous father.  You managed to pull yourself from the sight and blast yourself with the miraculous gun that was making all of this possible and as you broke through the tree line Matt could finally hold it no longer and he violently blew his load drenching your dad in semen and knocking back back into Matt's sculpted abs. <br>\r\n<br>\r\nYou had finished growing now at 100 feet and went to work with you dad and Aaron licking Matt and the surrounding area clean off all cum as Matt drifted into a small cat nap.  Soon you, dad, and Aaron entered an interesting three way with one of the members being a third the size of the other two and with some doing itt worked quite well with you being dominated by the other two.  <br>\r\n<br>\r\nWhen you and your partners had finished both your dad and Aaron drifted off into a nap off their own.<br>\r\n<br>\r\nWith all your playmates now asleep you were left twiddling your thumbs then you had a thought, while they all slept you would... </span></div></div>",
            "created":1379307600,
            "id":1663853,
            "title":"Smaller player"
        },
        "1151122211212":{
            "author_id":"singrfan",
            "author_name":"JamMan",
            "choices":[
                "It landed right next to you on the boy's lap",
                "It fell to the forest floor when the young god's growth started"
            ],
            "content":"<div class=\"\"><div> <span>As the boy leaps into the air, the beam catches him in its wake, giving him the full blast that was intended for his father's ascension into godhood. The beam actually propels him backward, and he slams into his father, knocking him out cold, before hitting the ground, the wind knocked out of him.<br>\r\n<br>\r\n\"Oh shit!\" you exclaim as you run towards him, ignoring the now unconscious father. You didn't intend to shoot the young boy, and you want to make sure that he is okay. You reach him and plant one foot on either side of him and kneel down. As you brush his hair out of his eyes, you see that he is a pretty good looking boy, taking after his father and brother with the makings of a strong handsome face, blonde hair, and full pouty lips. Without his shirt on, you can tell he keeps active, considered how toned his chest and stomach are for his age. He is definitely a beautiful boy.....<br>\r\n<br>\r\nYou snap back to reality as he begins to come to, looking around and then at you. \"Wh-what happened?\" he mumbles as you stare back at him, trying to come up with the best way to explain what is about to happen to him once the ray takes effect. Before you can say anything, though, he gives a small whimper and moan, biting his bottom lip and looking up at you as he begins to expand. You try to back away, but as you are essentially straddling him at this point, you cannot move away quickly enough. As he surpasses 12 feet, still laying on the ground, you lose your balance and tumble onto his smooth, flat stomach. His growth begins to increase, and he starts to sit up. You tumble down his stomach, past his growing navel and get tangled in the increasing fabric of his pajama bottoms as you watch this pre-pubescent lad rise higher and higher into the sky. He looks around, frightened, not knowing what is going on. You can't see your dad or Aaron anymore, but you can guess they are just as awe-struck as they see this boy grow to their height and quickly surpass it. His frightened whimpers soon turn to moans of pleasure as he begins to enjoy what is happening to him. You can feel something large stirring beneath you as he begins to get aroused from the sensation of the growth ray, and the power of the size itself.<br>\r\n<br>\r\nSoon, his growth slows as he approaches the 700 foot mark that had been intended for his father, and the boy looks around at his new position of power and smiles slightly. He is truly a site to behold, a handsome, young boy over 100 times larger than before, with gorgeous features and smooth, toned muscles filling your field of view. Your cock gets hard as you realize you enjoy this sight even more than if the father had grown in his stead. Then you realize the gun is no longer in your hand. You look around frantically to see where it wound up, and.....</span></div></div>",
            "created":1379480400,
            "id":1665074,
            "title":"The beam hits the boy instead"
        },
        "11511222112122":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "\"It's time for me to take my rightful place\"",
                "\"If I'm not going to be biggest then I want Aaron to be\""
            ],
            "content":"<div class=\"\"><div> <span>\"Ugh what's all that noise\" the man groaned getting up \"HOLY CRAP\" he yelled seeing his youngest son Chris 700 ft tall in his place.  \"That damn kid is always getting in the way at the worst possible time\" he complained seeing his ascent into godhood stolen from him.  \"Well the kid looks good at least\" he said.\"but he should after all the work outs proper diets and all the testosterone racing through his body from having me as a father.\"  Just as he finished talking to himself his oldest Aaron and his friend went over and engaged Chris in conversation to get on his good side to stay safe.  Just when he thought he was completely forgotten about he spotted the miracle gun that started this whole thing, faster then he'd ever moved before he grabbed the ray gun and looked it over.  After learning it's functions he said...</span></div></div>",
            "created":1381726800,
            "id":1678840,
            "title":"It fell to the forest floor when the young god&..."
        },
        "11513":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "Stay with daddys dick",
                "Go farther up his body"
            ],
            "content":"<div class=\"\"><div> <span>So there you were standing by your giant naked father. He was completely naked ant the smell of man overpowered you. When would you ever get another opportunity like this? Your dad is giant AND sleeping. Now would be the perfect time to explore his god like body.You decide to climb up him. There is nothing to grip onto down by his giant smelly feet so you walk closer to his legs were you see the perfect way to get up, his leg hair.<br>\r\nYou grab hold of a hair and start to climb up the huge leg of your father going higher and higher being careful not to let go and fall down to your death. After a few minutes you reach the top of his leg and pull yourself up. Up his body quite aways you see your dads giant member. You quickly run towards it and it takes forever because of all the hairs on his leg slowing you down. You finally get to your fathers giant member and it is flaccid starring straight at you with its piss slit. The smell was awful but you were starting to enjoy it.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1210827600,
            "id":532237,
            "title":"Explore his body"
        },
        "115131":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "Hes awake (and looking right at you)",
                "Your going to get stuck"
            ],
            "content":"<div class=\"\"><div> <span>You decided to stay with his giant dick, after all thats what youve wanted all along right?<br>\r\nYou get touching distance away from the giant head of your dads member and you feel overwhelmed. It was about 4 times your height. You slowly reach out to touch it and when your hand touches it. The giant member twitches along with the rest of your dads body and you hear a loud moan. <br>\r\n<br>\r\nGeez. You think to yourself.<br>\r\nIf i could do that just with a touch, i wonder what else i could do.<br>\r\n<br>\r\nFeeling horny now you reached out again and touched your dads slit. It was moist and the smell was putrid but you loved every minute of it.Your dad started to twitch again and your hand got sucked into the slit. <br>\r\n<br>\r\nYou hear loud moans again louder than last time<br>\r\n<br>\r\nOh no.  you thought<br>\r\n<br>\r\n.....</span></div></div>",
            "created":1210827600,
            "id":532243,
            "title":"Stay with daddys dick"
        },
        "1151312":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "Get stuck in his balls",
                "He shoots his load with you in it"
            ],
            "content":"<div class=\"\"><div> <span>The moans are getting worse and worse and at this time the slit is all the way around your elbow. You try to use the head of the member as leverage to pull you out but its no use.<br>\r\nYou look up to see his giant hand come down to wrap his hand around his monsterous cock.<br>\r\n<br>\r\nOh no your touching must have made him horny and now he was gonna masturbate.<br>\r\n<br>\r\nYour dads giant hand started slowly strocking the giant cock and it got faster and faster.<br>\r\nYour arm got pulled in more and more untill it was up to your shoulder and you were kissing your dads slit. Precum started getting everywhere even in your mouth. This was so disgusting but you were loving every minute of it. You were slowly being swalloed by your giant dads slit and his precum was everwhere. Soon enough your head got sucked in side his slit untill you were in to your waist. You were kicking and wiggling but the movements just helped your dad get off even more.<br>\r\n<br>\r\nUHHHHH YEAH  UHHHHH your giant dad is moaning so loud now <br>\r\n<br>\r\nYour getting sucked into your dad more and more every minute and you completely disapear from the outside world. With one last thrust you are completely inside your dads cock now. The ring like tube around you pushing you further and further towards the balls of your dads now \"inhanced\" 11 inch cock. His pre cum is everywhere around you and its lubing you up and making you go down even faster.By this time youve drinkin at least a gallon of your dads seed.<br>\r\n<br>\r\nUHHH YEAH FUCK ME YEAH YEAH YEAH your dad moans<br>\r\n<br>\r\nWhats gonna happen</span></div></div>",
            "created":1210827600,
            "id":532248,
            "title":"Swallowed by daddys slit"
        },
        "11513121":{
            "author_id":"gizmo96",
            "author_name":"Gizmo96",
            "content":"<div class=\"\"><div> <span>You plop into the freshly emptied sack and fell right to the bottom.  After composing yourself, you look around, the inner scrotum bathed in a faint red light.  You look up at you point of access, only to find it the size of a pen!  \"Um... Dad?  Can I come out now?\"  Your dad thinks for a second before saying  \"No, I think I like you in there.\"  \"But Dad!!!\"  \"Don't worry Son, I'll take good care of you.\"  your dad laughs as he masturbates some more, shaking your new prison/home.</span></div></div>",
            "created":1329368400,
            "id":1278457,
            "title":"Get stuck in his balls"
        },
        "1152":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "His playful hands (and more)",
                "One giant hunk (he brought the remote)",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You were itching to play with your dad and the remote but when you finally arrived at the cabin you had the thought that while it would be fun to control your dad's size but what got you really hot was the idea of your sexy hunk of the dad in complete control.  So as you guys were planning you day's events you pulled the remote out and handed it to him while explaining \"this is a special remote I ordered for our weekend that can change the size of everyone and everything.\"  But instead of the reaction you had envisioned he simply looked straight at you and said \"really, why would you make fun of me with this just because I have a size fetish?\"  While this disheartened you for now you knew he'd get curious soon and try it out so for now you just played along and went about you weekend.<br>\r\n<br>\r\nLater that day you and your dad were hanging around by the lake when your dad asked \"what do you think about taking a quick swim?\" \"I didn't bring a suit\" you said turning around to walk back to the cabin when your dad said, \"neither did I but so what\" as you turned around and saw him standing in his 6 foot 4 inches of muscular naked glory.  As he stood there you couldn't help but stare at his dick, which was beginning to perk up in the cool evening breeze, and start to get a hard-on yourself and how could you not, your perfect man was standing here naked with a mind boggling 10 inch semi and as the icing on the cake he was your father so you shared a unique bond with him.<br>\r\n<br>\r\n\"Well are you going to strip or what?\" your dad said snapping you back to Earth \"Oh yeah\" you unintelligibly stammered as you got around to stripping down when your father noticed your boner then said playfully \"No need to be embarrassed your daddy is pretty hot, maybe we can do something about these things later\" and with a seductive stroke of his pike your father ran of the dock  diving in the lake making a stupendous splash.  A few seconds later you followed suit and jumped in after your dad to be met with...</span></div></div>",
            "created":1380603600,
            "id":1672630,
            "title":"Give it to him"
        },
        "11521":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Your dad considerably bigger ",
                "Nothing he just dropped something making dinner"
            ],
            "content":"<div class=\"\"><div> <span>You hit the water and felt the refreshing chill but you only had seconds to enjoy the sensation before your father swam over to you and started to check out his son's development.  Pretty soon it went from a stare to your dad feeling all over your body while holding you up against his significantly larger body.  Before long you couldn't resist it any longer and you had to grab his 13 in dick.<br>\r\n<br>\r\n\"Well I guess it's only fair that if I get to feel you up you can feel me\" you father said oozing a playful lust for you \"but I think we should probably move up to the shore so we don't have to keep treading water.\" <br>\r\n<br>\r\nWhen the two of you were up on the beach you couldn't stand any more waiting and immediately put as much of you father cock in your mouth as you could possibly fit and gave him a blow job with everything you could possibly muster behind it while you dad played with your dick some more.  Only minutes into it you came into your fathers hands while he on the other hand was enduring far better as you frantically tried to work him over.  Before long though he began to pant heavily and was losing control over his finer skills when he violently blew his gargantuan load into your mouth.  Once he was done you were so satisfied and drained you fell asleep on the beach.<br>\r\n<br>\r\n\"Well I guess its been a big day for him,\" your father said tenderly picking you up for the walk back to the cabin.<br>\r\n<br>\r\nThat evening you awoke (still naked) in your father's bed alone.  Deciding to clean off you went to the bathroom and turned the shower on when you suddenly heard a loud noise so you decided to check into it.  You made your way outside to find... </span></div></div>",
            "created":1381640400,
            "id":1678838,
            "title":"His playful hands (and more)"
        },
        "115211":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "I had a big handsome boy to fool around with.\"",
                "you get properly acquainted with daddy's new dick.\""
            ],
            "content":"<div class=\"\"><div> <span>As you were about to step into the shower you heard a thunderous sound accompanied by a sudden tremor that nearly threw you to the floor. \"Dad what the hell was that?!\" you yelled, running from the bathroom only to find your dad was nowhere to be seen. A state of panicked confusion was beginning to overcome you as you had no idea what was going on. Running to the door you quickly flung it open, too worried to be bothered by your state of undress, but you were again shocked when you're father was nowhere to be found.<br>\r\n<br>\r\nRunning back to your room to fetch your phone and try to figure just what the hell was happening you were abruptly halted as a terrible groaning petrified you. Looking to the ceiling you felt your stomach fall as the roof began to rise, revealing the enormous hand that carried it skyward. With the roof now removed there was nothing to obstruct the view you now had of your father's godly 200 foot body shining in the moonlight as he crouched over the cabin.<br>\r\n<br>\r\n\"Well? What do you think boy?\" he asked.<br>\r\n<br>\r\n\"Holy shit...\" was all you could manage.<br>\r\n<br>\r\n\"Heh, your daddy is a big boy ain't he?\" your father said, running his hand along his chiseled 8 pack.<br>\r\n<br>\r\n\"You can say that again...\" you said.<br>\r\n<br>\r\n\"And I just may\" he said, flexing cockily. \"I should have known my sweet baby boy wouldn't steer his daddy astray, especially not after that wonderful blowjob,\" to which you promptly turned red. \"Aw,  don't be embarrassed all of a sudden, where's the cute little cockgobbler from earlier?\" your father asked while grabbing his aforementioned cock.<br>\r\n<br>\r\n\"So-sorry...I know I brought the remote but...I'm just really surprised by all of this.\" you admitted.<br>\r\n<br>\r\n\"Don't apologize boy, in fact let daddy help you.\" he said as he reached down and picked you up. You had the strongest feeling of both terror and exhilaration as your father lifted you higher and higher until you reached his 35 foot dick. Dropping you at the base of his shaft your father said \"Now I think it's high time...<br>\r\n</span></div></div>",
            "created":1552952220,
            "id":2631970,
            "title":"Daddy's New Playhouse"
        },
        "11522":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Your dad",
                "Brandon the nearby hiker"
            ],
            "content":"<div class=\"\"><div> <span>As you made the jump into the lake you were immediately stopped by a 30 foot tall wall of perfection.  \"Gotcha!\" he shouted with immense satisfaction towards his little joke and the fact that he now had his son in his arms as if he were only a small child. <br>\r\n<br>\r\n\"Dad I thought you didn't believe that the remote was real?\" you said flabbergasted.  \"Well I didn't at first\" he admitted \"but you know that boulder we never seemed to notice before back at the cabin, well that used to be a pebble.\" <br>\r\n<br>\r\nYou were stunned that huge thing was nearly as big as your room but your astonishment was quickly interrupted as your dad let you drop into the water telling you he just wanted to sit and soak as he pulled out the remote and blasted himself growing and growing until he was 150 feet tall and sitting in the lake as if it were an undersized tub <br>\r\n<br>\r\n\"You do whatever comes to mind I'm just going to rest for a while\" he boomed down to you. If you say so you thought as you climbed onto you perfect father to investigate his new size. As you strolled down his abs you noticed they were almost as tall as you were, hell if he grew anymore they'd be like an alley, soon you came upon his treasure trail leading you to his 30 foot tall \"treasure\" as you lost yourself staring at his tower of sheer manliness you didn't notice he was not really dozing but getting ready to shoot you with the remote.  <br>\r\n<br>\r\nJust as his shot was all lined up he yelled\"SUPRISE!!!\"which startled you so much you tripped on a snag in his waist high pubic hair and fell onto his water logged balls causing the beam to miss and hit...</span></div></div>",
            "created":1383800400,
            "id":1690798,
            "title":"One giant hunk (he brought the remote)"
        },
        "115222":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Your father prepared the remote for another of growth",
                " He swiped the remote"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh boy\" you exclaimed as the beam shot off into the distance. \"Whoops\" your dad said dumbly \"well what are the odds of it hitting someone anyway.\"<br>\r\n<br>\r\nNearby Brandon, a 24 year old hiker, was pausing at a stream for a break. After getting sweaty from his hike he decided it would be a good idea to take a quick dip in the water and rinse off, after stripping down completely he hopped into the cool water. Just as he was about to gather up his belongings and head back to camp he was suddenly hit with a blinding streak of energy \"well damn\" he said composing himself only to be met with an intense heat and wave after wave of pleasure as he began to expand faster and faster. <br>\r\n<br>\r\n\"Well I guess it won't be a surprise but I'll set it up so you can have your turn\" your dad said but before he got that far you both witnessed not to far from yourselves a handsome head breaking the tree line then a well developed set of pecs replaced with a torso with the sculpted 6 pack then his legs and manhood which he was stroking wildly completely lost in the ecstasy. Both you and your father watched lustfully as this young god pleasured himself as he grew all the while. After several minutes of the expanding jerking off you came shortly followed by your dad who at a much larger size than yourself had coated most of the surrounding area with spurts of hot giant semen then as if it were a grand finale of sorts the gigantic young man who was now far larger then your dad ejaculated with enormous force covering you,  your dad, and everything else with layers of his seed as his growth finally came to a halt at roughly 750 feet.<br>\r\n<br>\r\nAfter coming back to reality Brandon saw you and your dad drooling over him below and greeted you both with a deep and booming hello introducing himself as your father filled him in on what happened.  \"Well I never would of even dreamed something as great as this could happen\" he said as...</span></div></div>",
            "created":1390107600,
            "id":1729701,
            "title":"Brandon the nearby hiker"
        },
        "1152221":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "A comfortable 1000 feet",
                "Oops he's growing way to much"
            ],
            "content":"<div class=\"\"><div> <span>Your father prepared the remote for another burst of growth, this time directed at you.  As he blasted you and you finally got to experience the sheer ecstasy you became completely lost as you grew however your desires for more size were stymied at 150 ft alongside your father as he gave you a welcoming embrace having his son join in on his fantasy.  \"Well that will make it easier for the three of us to communicate\" your father said \"plus it's high time you got a turn to grow, now to the point I think we should go and share our greatness with the rest of the world.\" \"Sounds great to me\" Brandon chimed in as he lied down to be as \"on your level as possible.\" \"Well I know I want to remain at this size for awhile, I definitely like being a giant but I want to worship a bigger giant as well\" you said.  \"Ok\" your dad said \" now I think the quickest way of reaching the nearest city would be to have one giant carry the other two so as is Brandon looks like you're up to bat.\" \"Fine be me\" he said becoming aroused at the possibilities on the horizon \"however I might need to be a bit bigger to carry the both of you without any problems.\" \"Fine by me\" your father said as he hastily got the remote out and fired at Brandon causing him to become,,,</span></div></div>",
            "created":1392699600,
            "id":1747649,
            "title":"Your father prepared the remote for another of ..."
        },
        "1153":{
            "choices":[
                "Happily (Gentle loving)",
                "Normally (Playful)",
                "Demonically (Dominating)"
            ],
            "content":"<div class=\"\"><div> <span>You pull out the remote. Your dad says \"What is that?\" you tell him what the remote does and Dad gets a smile. \"So what were you gonna do with that on our trip?\" you stammer and form the words, \"I-I...just... You know, w-wanted to have a little...fun with you...\" Dad puts his hand on your shoulder. \"It's okay son. You're only 15 and you're just trying to experiment with your fetishes to see what works for you. Don't worry, it's okay. I actually get turned on playing with tiny people.\" \"Same here but I like to be the tiny being played with, like rubbing giant feet or massaging pectorals that are bigger than me.\"<br>\r\n<br>\r\nDad thinks for a bit. \"Maybe just for a few hours, I'll let you shrink yourself and you can have all the fun you want.\" Your hands can barely hold onto the remote as you hold it up to yourself and press the shrink button. A beam of light shoots out, and your vision is filled with green. You can't feel yourself, as you feel numb all over, and the blinding green isn't helping either. You feel like you're being compressed, squeezed into a compact size. It didn't hurt, but it felt unlike anything you have felt before.<br>\r\n<br>\r\nSoon the tingling and numbness stops, and your vision comes back. You were on the floor, and only inches tall! Everything was huge! You looked over and saw your dad's giant socked foot, and you followed the slightly hairy legs up to your dad who was smiling...</span></div></div>",
            "created":1302411600,
            "id":1085977,
            "title":"Bonding"
        },
        "12":{
            "choices":[
                "You make it (yay)",
                "You don't make it (your friend to the rescue!)",
                "You grow",
                "You find the remote (if you choose this include HOW!)",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go to your friends house today. Nothing like having a little fun (pun definitely intended). You go downstairs into the kitchen and ask your dad if you can go over to your friend's house. After asking him, he stops you before you exit, and says, \"What's the remote for?\" You panic and chuck it out the open window behind your dad saying \"What remote?\" He responds, \"Okay, whatever *laughs, then exits*\" You run out into the back yard and retrieve the remote. It doesn't look damaged so you head over to your friend's house.<br>\r\n<br>\r\nOnce you arrive, you actually try to hide the remote this time. It barley fits in your pocket, it sticks out a little, when your friend's mom answers the door and asks what that is, you say it's your iPod. She invites you in and says he's in his room. You walk upstairs to his room and kick the door open. Your friend walks over to his stereo on his dresser and turns off the music. He started to ask, \"Hey, I didn't know you were coming-- what is that?\" You immediately press the shrink button, pointing it straight at your friend. Your friend, unfortunately for you, has incredible reflexes, and ducks down as it comes toward him, bouncing off his mirror on his dresser and hitting you.<br>\r\n<br>\r\nYou can't remember any more. You wake up, and look around to not find the remote anywhere, you look around and see your friend doesn't have it. Then you look around for one more second, then look back at your friend. Something seems different.... Nothing really other than the fact that you're about 1 and 1/2 inches tall... With him lying down on the floor staring at you. You see a slightly glad and angry look on his face. You aren't sure what it is about. You opened your mouth, \"He--\" your friend interrupted, \"You tried to shrink me didn't you?\" You stand there, pretending to be puzzled.<br>\r\n<br>\r\n\"Well, didn't you? It was aimed directly toward me.\" You continue to try to look as confused as possible. \"Looks like your 'little' plan backfired.\" You can tell he brushed his teeth before you came over, it doesn't stink horribly like you were sure it would have. As you just stand there his anger subsides and his glad expression overpower his face. You feel a little uncomfortable at to what he is thinking. He gets up and runs over you through the door (not stepping on you but kind of jumps over you) and is gone for several minutes. You lean out of the doorway into the hallway to see if anyone is coming then walk back into his room to look for the remote.<br>\r\n<br>\r\nA couple minutes after you started searching (it's nowhere to be found) your friend comes back into the room. With pants.... about your size. \"What the hel--\" You start to say as he grabs you and begins to take off your clothes. He leaves your boxers on and sets you on his dresser. He gives you the pair of pants, apparently made out of one of his old swimming trunks. You aren't liking what this is looking like... You look at him expectantly. He sighs then turns around, as you get undressed and get into his home-made swimsuit, just to avoid confrontation, who knows what he will do to you?<br>\r\n<br>\r\nYour friendship with him was always you making fun of him a couple times every time you met and him laughing a little, trying to brush it off. You haven't really done anything for him, you're afraid this will be his revenge. You adjust the pants accordingly then give him a signal that you're done. When you look back up at him he's already changed into his bathing suit. You don't really want to know how that happened while you were so you try not to think much about it. He grabs you and tells his mom you left and he's going to go swimming in the pool in his back yard. <br>\r\n<br>\r\nHe doesn't look at you as he walks out the back door and close to the swimming pool. He turns on the heater and waits a couple minutes, goes to the deep end and puts you in to test the water. It was almost just warm enough but it wasn't unbearable. So you tell him the water is fine. He leaves you inside the edge of the deep end of the swimming pool, you are a pretty good swimmer... but not great. You see your friend go onto the diving board and prepare for a jump. You hope it's a dive so it doesn't create a splash.<br>\r\n<br>\r\nHe goes for the jump... (surprise surprise) he does a cannon ball, causing you to tread water on the waves, which happen to be taller than you. He swims over to you and carries you to the other side of the diving board (still in the pool) and lets you back into the water. He leans up against the side of the pool and watches you try to keep afloat. You look up at him, he is looking at the shallow end of the pool. He turns his head back to you and you look down as fast as possible. He apparently knows you were looking at him. He then says \"I want you to swim to the edge of the shallow end of the pool.\"<br>\r\n<br>\r\nYou answer saying, \"There's no way I'll be able to swim over there, have you noticed my size?!\" He responds \"I guess I'll swim under you to make you feel better.\" You look at the other end of the pool. You hear sloshing of the water next to you then look down and see your friend's chest, stomach, and the start of his swimming trunks, his groin area... the end of his trunks and down to his feet. He was swimming backwards underneath you (with his head above water) using only his hands, you're pretty sure it was faster than you could swim though. \"What are you waiting for? SWIM!\" <br>\r\n<br>\r\nYou start swimming as fast as you can. You look down a couple times to see your friends chest under you. It's still hairless. After all he's only 10.</span></div></div>",
            "created":1223874000,
            "id":594990,
            "title":"Nothing ever becomes real until it is experienced."
        },
        "124":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Blake",
                "Jack",
                "Nah, how about home instead?"
            ],
            "content":"<div class=\"\"><div> <span>Swimming as fast as you can, you suddenly notice the remote wiggling in your friend's back pocket of his swimsuit. As you watch, it wriggles and floats free, bobbing to the surface directly beneath you. Hurriedly, you point it, to the best of your ability, at your friend and press \"shrink\". In an instant, he gets to about your height. Pointing it at yourself, and treading water, you press \"grow\" until you can touch the bottom. Opening your eyes, you look around.<br>\r\n<br>\r\nThe first thing you notice is your friend. He's really tiny and treading water. Then, you see that your head is poking up out of the water. Good.<br>\r\n<br>\r\nThe final thing you realize is that you're still in the deep end.<br>\r\n<br>\r\nNow, this is not a little commercial pool that your friend's family bought. They're super-ultra-rich, so their pool reaches down quite a ways. For you to touch the deep end was beyond your power to dive to, much less stand up and reach the air and the bottom at the same time. Walking slowly to the shallow end carefully, trying not to panic, you realize that you're in the 10 feet and your entire torso is sticking out above the water.The whole schebang. <br>\r\nExamining yourself, you see that you gained some definition in the growth process. Your abs and pecs stand out against your skin, and you look sorta good, for someone who doesn't actually pay attention to that sort of thing. You're also naked, which is unfortunate. You'd kinda expected that your trunks would grow, too, but you supposed they ripped quite a while ago. <br>\r\n<br>\r\nOh, wait! You forgot about your friend! Wading back to the deep end, you stare into his tiny face and aim the growth ray carefully...<br>\r\n<br>\r\nA minute later, he's treading water, back to normal once more. After that, it's simple for you to shrink back to your normal (though, for whatever reason, still well-muscled) size again. Paddling, embarrassed, over to a spare pair of swim trunks, you pull them on and get out. Your friend follows suit. However, he doesn't seem to remember diddly about the whole event, so you leave his house and head to another friend's...</span></div></div>",
            "created":1276318800,
            "id":898153,
            "title":"You find the remote (yay!)"
        },
        "1242":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "The German shrinks",
                "The German grows",
                "You grow."
            ],
            "content":"<div class=\"\"><div> <span>You head over to your friend Jack's. He is a German bodybuilder and weighs an inhuman 375 pounds, even though he's never used steroids. Jack almost never wears a shirt (or, God forbid, pants), preferring to wear shorts out and nothing in ('cept maybe boxers, he says). You still aren't sure why he is your friend (after all, you're only 17 and he's 21), but you get along very well together.<br>\r\n<br>\r\nArriving at his house, you knock on the door. Jack opens it with a big smile.<br>\r\n<br>\r\n\"Alek! Come in!\" he grins, with a thick German accent. He gestures with one massive hand. \"I am just finishing ze training of today. Be right with you.\"<br>\r\n<br>\r\nYou follow him in and sit down on the couch. You watch in awe as the enormous German lifts fifty pounds in one dismissive lift of his arm. Today (thank heaven), he's wearing a pair of plaid boxers, and his muscles stand out in relief against his fair skin, which he refused to have tanned. To this day he keeps his whole body the shade of white he was when he was six -- a fact that you can tell easily, because he wears almost nothing every day. His abs are little plates on his completely flat stomach, and his pectorals stick out to an inhuman distance from his rib cage. His neck is thicker than his arm, and it's covered in little veins when he lifts something. His head, surprisingly enough, was proportioned well, and it seems to belong in that giant neck. He wore size 20 shoes (when he wore shoes) and had an inseam of 45\" (not that that really said anything of what he wore), and there really was no comparing him to others. \"Just forget about it,\" he'd say. \"I am not ze biggest, nor de strongest, and zat is enough for me.\" This simple wisdom, you are sure, is what kept him from insanity all these years. Well, total insanity, anyway.<br>\r\n<br>\r\n\"So. What are you coming to telling me today?\" he asks curiously. \"Did you perhaps find an interesting shell?\"<br>\r\n\"No,\" you say, \"It's a size device.\"<br>\r\n\"Ah. I have been encountered those before. They are being great fun. Could you showing me what this one is doing?\"<br>\r\nYou aim the ray and press a button.</span></div></div>",
            "created":1276318800,
            "id":898173,
            "title":"Jack"
        },
        "12421":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "You grow",
                "Jack shrinks"
            ],
            "content":"<div class=\"\"><div> <span>\"Interesting,\" says Jack. After the green beam hit his massive chest, he had shrunk to only about your height -- a change of about two feet. He looked about your age, as he was clean-shaven and hairless, until you got to his neck. After that point, he was completely ripped. His boxers, now twelve sizes too big for him, fluttered to the ground, where they settled (he ignored them) in a -- excuse me, I almost said \"little\" -- pile on the carpet.<br>\r\n<br>\r\n\"You say it arrived in ze mails?\"<br>\r\n\"Yes -- I don't remember who from, though.\"<br>\r\n\"Well, what's done is done. What are you going to do now?\"<br>\r\n<br>\r\n\"I know exactly what,\" you say with confidence, and push the button.</span></div></div>",
            "created":1276318800,
            "id":898175,
            "title":"The German shrinks"
        },
        "124212":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Why would I do that?",
                "Oops, sorry, hit \"shrink\" when I meant to hit \"grow\"..."
            ],
            "content":"<div class=\"\"><div> <span>Jack is beginning to look rather angry now.<br>\r\n<br>\r\nOnly two feet tall, he barely reaches your slim waist, and he's beginning to get upset over all this shrinking. He still looked muscular enough to lift whatever ungodly amount of weight he was lifting before, but now his hands weren't even large enough to hold a Wiffle ball in one hand. In short, he was short.<br>\r\n<br>\r\n\"I give you one more chance,\" he says in almost unintelligible English. \"Put me back or I hurt you.\"</span></div></div>",
            "created":1276318800,
            "id":898176,
            "title":"Jack shrinks"
        },
        "1242122":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Jack complies.",
                "\"Tell me now, I think please?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, Jack. I'll get you normal again.\"<br>\r\n<br>\r\nYou aim the ray and make sure to hit \"grow\" this time. Jack grows back all the way to his previous height, but there's something different about him. He seems, if that's possible, a bit larger than before.<br>\r\n<br>\r\nPulling on his boxers (somewhat reluctantly), Jack notices, too. \"Eh, boy, you notice? Your thing change in grow more than mine did.\"<br>\r\n<br>\r\nYou turn away, slightly nauseated by Jack's well-endowed penis flopping into its snug pocket within the underwear.<br>\r\n<br>\r\n\"Get some clothes on, and real clothes, too, and we'll talk about this weekend.\"</span></div></div>",
            "created":1276318800,
            "id":898178,
            "title":"Oops, sorry, hit \"shrink\" when I meant ..."
        },
        "1243":{
            "author_id":"narutoxd",
            "author_name":"NarutoXD",
            "choices":[
                "Muscle",
                "Groin",
                "Both"
            ],
            "content":"<div class=\"\"><div> <span>You thought about heading to a friend's house, but decided against it, and just headed on home. on yor way home, you decided to take a furtherlook at the remote. <br>\r\nYou saw that it had a few choices as to what to grow or shrink. <br>\r\n<br>\r\nA few were:<br>\r\nMuscle<br>\r\nHeight<br>\r\nGroin<br>\r\nand various other body parts.<br>\r\n<br>\r\nYou decide on...</span></div></div>",
            "created":1314248400,
            "id":1175312,
            "title":"Nah, how about home instead?"
        },
        "12433":{
            "author_id":"narutoxd",
            "author_name":"NarutoXD",
            "choices":[
                "Grow some more",
                "This is good lets see how people react."
            ],
            "content":"<div class=\"\"><div> <span>You quickly run into your house and locked yourself in your room. You pick up the remote, and put it on muscle and groin. Then you hit grow. You feel a warm tingly sensation pass over you as you began to grow. You were able to get in front of your full body mirror to see that your slightly developed muscle were picking up size and defintion. Soon, you were at a swimmers build and you stopped there, but you left the penis button on. You looked at your briefs seeing something stir inside. Slowly, your briefs fill up and start to tear. RIP... they're gone now. You huge endowment flopped down just past your knees. it was 16 inches with balls the size of over inflated tennis balls. With your growth stopped, you had time to admire yourself. You pinis was standing to full attention right now, and your muscles simply glowed with newly developed power. <br>\r\n<br>\r\nWhat do you do now?</span></div></div>",
            "created":1314248400,
            "id":1175316,
            "title":"Both"
        },
        "13":{
            "author_id":"menaceman44",
            "author_name":"M-M",
            "choices":[
                "Grow a student",
                "Shrink a student",
                "Grow your teacher",
                "Shrink your teacher",
                "Grow yourself"
            ],
            "content":"<div class=\"\"><div> <span>It was a Thursday and you weren't due to leave for your trip with your dad until Friday evening. You can't wait until then to try out the remote so you decide to take it to school with you. You pack it in your bag and set off.<br>\r\n<br>\r\nAs you walk to class you start to think of the things that you could do with the remote if it turns out to actually work. There are quite a few cute guys in your class you wouldn't mind messing with and a few others you wouldn't mind getting even with either.<br>\r\n<br>\r\nYou enter your class room and as you sit down for registration you take the remote from your bag and conceal it up your sleeve so you can easily access it without drawing any unwanted attention.<br>\r\n<br>\r\nThe rest of the class filters into the room, finally followed by your teacher.You glance around and decide on what you are going to do.</span></div></div>",
            "created":1213938000,
            "id":546715,
            "title":"Bring the remote to school."
        },
        "131":{
            "author_id":"occocc",
            "author_name":"occocc",
            "choices":[
                "Rob",
                "Matt",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>You glance around the large dull classroom, Anatomy may be boring as hell, but this class  did have a good deal of selection to it in terms of attractive classmates. The two guys that crossed your mind first were Matt and Rob, two seniors who sat on the opposite side of the classroom whose desks faced yours. <br>\r\n<br>\r\nRob was definitely one of the beefier guys on campus. He fit the stereotypical jock role well, he was the quarter back, who could get any girl he wanted with his looks and popularity. He was 19, held back once freshman year, and had short scruffy brown hair and had decent amount of stubble covering his strong jaw from his refusal to shave on a regular basis that was starting to edge on full beard territory. You didn't know him that well, though you thought he seemed nice enough, not the sharpest tool in the shed, and he could be a bit of a jerk sometimes, though mostly that was him not being aware of when he was acting like a dick to others, at least he generally didn't seem to mean it.<br>\r\n<br>\r\nThe other most immediate option, was Matt. Matt was a bit of a thug. He was 18 and was just skirting  by on the bare minimum to get a diploma, and sometimes not even that much. He was a known to sell drugs to other classmates and get in the occasional fight over one thing or another. He was pretty tough too. He went to the gym regularly, though he never showed any interest in sports, mostly just concerned with looking, and being, tough.</span></div></div>",
            "created":1398315600,
            "id":1785844,
            "title":"Grow a student"
        },
        "1312":{
            "author_id":"occocc",
            "author_name":"occocc",
            "choices":[
                "150ft tall",
                "400ft tall",
                "800ft tall"
            ],
            "content":"<div class=\"\"><div> <span>You looked at Matt, you could only imagine the trouble, and fun, a giant Matt would cause campus, or the city. Images of a giant Matt destroying the school and ripping apart the city tipped the scales in his favor. You readied the remote in your sleeve, hoping to go about this unseen.<br>\r\n<br>\r\nAfter lining it up, the button is pressed, and Matt soon is growing much quicker than you would've anticipated, not that you were complaining. In only about 2 or 3 seconds he'd doubled his height, in another second his chair snaps under his now massive weight. Everyone's eyes are on the rapidly expanding Matt. His jean covered legs push aside neighboring desks and students, he seemed as freaked out by what was happening as anyone else. Soon, even sitting, he had to bend forward with his back to the ceiling to avoid crashing through it, though at this rate that’ll only delay it another very few fleeting seconds.<br>\r\n<br>\r\nBy now, students who are able have pretty much all fled the room and ran into the hallway. As his legs each grow past and behind you, you sit obediently in your desk. Part of you knew you should probably be running, but another, more forceful part compelled you to stay. Soon his back was forcing its way through the ceiling anyway and he just sat up, causing screams from the classroom above. As he readjusted himself his massive boots smashed through the far wall behind you and his ass was bringing down the wall behind him. Luckily no debris hit you, any big ruble above you had been swept behind Matt when he sat up. Soon Matt was then out growing through the roof as his back pushed through it as well.<br>\r\n<br>\r\nNow it was just him sitting in the middle of the increasingly destroyed high school currently being steam rolled by the giant's jean covered ass legs and thick leather boots. You kept your finger on the button watching as he grew bigger and bigger until he was...</span></div></div>",
            "created":1398315600,
            "id":1785850,
            "title":"Matt"
        },
        "13121":{
            "author_id":"singrfan",
            "author_name":"JamMan",
            "choices":[
                "Tell him about the gun",
                "Stoke his ego, but keep the gun secret"
            ],
            "content":"<div class=\"\"><div> <span>You finally release the button on the remote as Matt stops growing at around 150 feet tall. You stare up, and up, past the tight denim clad trunk like legs, letting your eyes linger on the huge bulge in his crotch that could dwarf you at this size, up past his heaving chest and flat stomach, his shirt not leaving much to the imagination as to the enormous muscles rippling just below the surface, pushing and stretching the already tight shirt in and out as he took a few deep breaths. You finally gaze up at his face as he looks around, a bit bewildered, not believing that he had crushed most of the school beneath his bulk.<br>\r\n<br>\r\n\"WHAT THE FUCK JUST HAPPENED?\" he says to himself, though causing you to clutch your ears in pain. The guy doesn't realize how loud he is! He begins to shift his weight slightly, and you look up to see a giant wall of denim coming right at you! You jump out of your desk just in time as you see his gigantic thigh obliterate the desk that, just a second ago, you were sitting in. You breathe a sigh of relief that you are still alive, though you cant help but be a bit turned on that this now titanic thug could end a life simply by shifting around a bit! You cant wait to see what happens when he actually puts effort into destruction! And it looks like you won't be waiting long.<br>\r\n<br>\r\nMatt looks around and shakes some rubble from his head, causing you to have to dodge it. Your movement catches his eye and he squinted down at you. \"HOLY SHIT, YOU'RE TINY!\" he exclaims. His look surprise turns to a smirk as he takes in his surroundings. \"HEH. WELL EVERYTHING IS TINY. ThAWESOME.\" As his realization rumbles through you, you can see the bulge in his pants begin to stir. \"EVERYONE IS SO FUCKED!\" He starts to stand up, his giant booted feet plant down on either side of you as he towers over you, a living tower of teen punk. You looks down and sees you still standing there.  \"WHY AREN'T YOU RUNNING, BUG?\" You stand there, in awe and hard as a rock at this god standing before you, deciding whether you should tell him about the gun, or simply tell bim what a hot giant he is. His handsome face is glaring down at you as you come up eith your answer.</span></div></div>",
            "created":1398315600,
            "id":1786017,
            "title":"150ft tall"
        },
        "131211":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "IS GROW AND JOIN ME.\"",
                "MAKE ME INTO A GOD!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Well to be perfectly honest\" you said to his crotch instead of his face \"I grew you with my remote and despite the danger I'd hate to leave someone as hot as you.\"  \"WELL I CAN'T BLAME YOU I AM PERFECTION\" he said standing up to his full height and revealing that although his clothes grew they looked about 5 sizes to small \"DAMN TINY YOU REALLY CAN'T TAKE YOUR EYES OF ME.\"<br>\r\n<br>\r\nIt was true you were practically drooling over him but with the chance of him squashing you you weren't going to get as much enjoyment as possible.  While you were lost with your thoughts Matt apparently was getting bored as he stepped away from the school to go terrorize a couple of nearby houses. \"YOU BETTER COME UP WITH A REASON I SHOULDN'T DO THAT TO YOU\" he boomed gesturing towards the house he'd just kicked the roof of off.  \"Well I have the remote which means I could do anything you wish of me...sexy.\" Oh shit that sounded so lame you thought in terror hoping he didn't decide to kill you for it.<br>\r\n<br>\r\n\"HEH...YOU'RE DEFINITELY NOT THE SMOOTHEST GUY I'VE MET\" he said nonetheless enjoying the stroking of his ego \"HOWEVER I THINK I CAN MAKE THIS WORK FOR THE BOTH OF US.  SINCE YOU OBVIOUSLY WANT TO GET A GOOD LOOK AT ME I'LL DITCH THESE WORTHLESS CLOTHES IF YOU DO SOMETHING FOR ME.\" \"Oh good anything you want\" you said boning up at the thought of him naked. \"WHAT I WANT YOU TO DO... </span></div></div>",
            "created":1401253200,
            "id":1803866,
            "title":"Tell him about the gun"
        },
        "132":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Fun",
                "Payback"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You only half listen as the teacher talks; it's just review for the test tomorrow and you were going to easily ace it. Instead you scope out who exactly you want to shrink. But first things first, are you looking for fun or payback?</span></div></span></div>",
            "created":1492578000,
            "id":2307374,
            "title":"Shrink a student"
        },
        "1321":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Jamie",
                "Nick"
            ],
            "content":"<div class=\"\"><div> <span>With a bit of thought, you decide on someone cute. You are pent up and finding a boyfriend was plain difficult. Who is more interesting though?<br>\r\nThere's Jamie, the tall basketball star that you occasionally tutored in math. He was a bit loud and energetic at times, but is always up for a challenge (as long as it didn't invoke equations) and willing to try new things (such as being a couple inches tall). He had a six pack, strong legs, and a bit of a bulging package.<br>\r\nOn the other hand, there is Nick. He is a bit shy but he was also quite a looker. He is basically a model under his hoodie. Plus unlike Jamie, you knew Nick batted for your team since you saw him at the pride parade a couple months back.</span></div></div>",
            "created":1492578000,
            "id":2307382,
            "title":"Fun"
        },
        "13212":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "6 inches",
                "smaller"
            ],
            "content":"<div class=\"\"><div> <span>Knowing Nick was open to men was a plus you couldn't turn down. While maybe you weren't his type, you were confident he would enjoy the weekend.<br>\r\n<br>\r\nNow comes the slightly harder part, getting Nick alone so you could shrink him. You didn't want anyone else knowing about Nick yet, because someone else might hurt him. Also you knew that this could be seen as kidnapping if the wrong person saw and since you were 18, you didn't want any jail time for this.<br>\r\n<br>\r\nToo bad for you, class ended before you could make a plan. You didn't share any more classes with Nick for the day.<br>\r\n<br>\r\nGood for you, Nick headed towards the restroom. You quickly followed, and to your delight found it empty. Nick was facing away from you, unzipping himself to pee. The thought of asking him first came to mind, but you shook it off. Better to ask for forgiveness later than for permission now.<br>\r\n<br>\r\n<br>\r\n<br>\r\nHow small do you want Nick?</span></div></div>",
            "created":1492578000,
            "id":2307384,
            "title":"Nick"
        },
        "132121":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Lie, he would knew you shrunk him",
                "Tell the truth (you won't get a boyfriend by lying)"
            ],
            "content":"<div class=\"\"><div> <span>Watching Nick go from about your height to the size of a toy was kinda arousing. You quickly stepped forward, catching him before he dropped into the urinal. Nick yelped and flipped over on your palm, looking up at you with huge eyes. His little lips moved, but you didn't know what he said. So you cupped your hand to keep him contained and brought him up to your face. \"What was that little guy?\" you whispered, walking over to the single stall.<br>\r\n<br>\r\n\"What happened. Why are you so huge?\" Nick asked.<br>\r\n<br>\r\n\"Actually, I'm normal. You are small,\" you told him.<br>\r\n<br>\r\n\"How?\" he yelled, looking scared.</span></div></div>",
            "created":1492592880,
            "id":2307390,
            "title":"6 inches"
        },
        "1321212":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Couple hours",
                "Couple days"
            ],
            "content":"<div class=\"\"><div> <span>\"I bought this size changing ray online and shrunk you,\" you explained, pulling your sleeve up to show him.<br>\r\n<br>\r\nNick stared at you, curling in on himself a bit. \"Why would you do that?\"<br>\r\n<br>\r\n\"Well I think you are cute...\"<br>\r\n<br>\r\n\"And you decided shrinking me was the best way to tell me?\" Nick snapped.<br>\r\n<br>\r\n\"Okay, not my best plan.\"<br>\r\n<br>\r\n\"Unshrink me!\"<br>\r\n<br>\r\n\"Yeah about that...\" Nick glared at me a bit harder, which god damn it was adorable. \"I can't. Not right now at least. The ray needs to cool down between uses.\"<br>\r\n<br>\r\nNick's eyes grew wide and that fear returned. \"How long?\"</span></div></div>",
            "created":1492593660,
            "id":2307393,
            "title":"Tell the truth (you won't get a boyfriend b..."
        },
        "13212121":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Upper body",
                "Lower body"
            ],
            "content":"<div class=\"\"><div> <span>\"Probably should be working again by the end of school,\" you tell Nick. He huffed at you, but slowly nodded. \"I will keep you safe till then,\" you promised. Then the bell rings again. SHIT. You are late for class now. Where will you keep Nick so you can get to class?</span></div></div>",
            "created":1492593840,
            "id":2307394,
            "title":"Couple hours"
        },
        "132121212":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Pants Pocket",
                "Underwear"
            ],
            "content":"<div class=\"\"><div> <span>You decide to put Nick somewhere on your lower body, but where?<br>\r\n<br>\r\nYour pants are loose enough that Nick wouldn't get squished and deep enough he wouldn't accidentally fall out. But you probably won't get another chance like this and he couldn't resist if you wanted to put him in your underwear instead. He would be a lot more secure in your briefs, plus the thought of his tiny body against your groin sounded like heaven.</span></div></div>",
            "created":1492594080,
            "id":2307396,
            "title":"Lower body"
        },
        "1321212122":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Front side (getting cozy with your cock)",
                "Back (snug between your cheeks)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You unzip your jeans.<br>\r\n<br>\r\n\"What are you doing-\" Nick asked before you dropped in your briefs. Which side did you put him in?</span></div></span></div>",
            "created":1492594200,
            "id":2307398,
            "title":"Underwear"
        },
        "132122":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "3 inches",
                "smaller"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>6 inches was too big. You would have trouble keeping him hidden.</span></div></span></div>",
            "created":1492578000,
            "id":2307386,
            "title":"smaller"
        },
        "1321222":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "1 inch",
                "readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still too big</span></div></span></div>",
            "created":1492578000,
            "id":2307387,
            "title":"smaller"
        },
        "13212222":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "readers choice",
                "readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><span style=\"text-decoration:line-through\">Options for another height, bigger or smaller. Just for some variety</span></span></div></span></div>",
            "created":1492578000,
            "id":2307389,
            "title":"readers choice"
        },
        "1322":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Thomas",
                "Andy"
            ],
            "content":"<div class=\"\"><div> <span>Revenge seemed like the better plan. Who shall be your victim?<br>\r\n<br>\r\nThomas was an asshole who had bullied you for years. He was popular so you were outnumbered. He got you in trouble with teachers, destroyed your stuff, and humiliated you at every opportunity.<br>\r\n<br>\r\nAndy was your ex. You two dated for almost a year and you were sure you two would be together for a long time. That was before you found out he was cheating on you for nearly half of your year together.</span></div></div>",
            "created":1492595460,
            "id":2307403,
            "title":"Payback"
        },
        "13221":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Just Thomas, his friends just followed his lead",
                "Shrink them too, Thomas hadn't forced them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why stop at just Thomas actually? You could easily shrink some of his lackeys for even more fun.</span></div></span></div>",
            "created":1492595520,
            "id":2307404,
            "title":"Thomas"
        },
        "134":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "One tiny teacher coming right up",
                "The ray goes off and you accidentally shrink yourself instead"
            ],
            "content":"<div class=\"\"><div> <span>Your teacher, Danny Forrest was plain hot. He had an amazing body and was only in his late 20's. He knew he had a nice body too, and made sure to keep himself off limits to the students. You were pretty sure he would change his mind the morning after graduation though, given some of the looks he has given students, you included. You also knew he was going on a trip himself and would be taking tomorrow off so no one would really notice if he disappeared for the weekend. He would be around for some extra time after school today for that reason though. He was a great teacher though, so few students really needed the extra help and really just swung by to flirt.<br>\r\n<br>\r\nDecision made, you went about the rest of your day in a great mood. After your last class ended, you headed back to Mr. Forrest's classroom. He was sitting at his desk, grading some homework to some soft music. Glancing around the room and back into the hall, you happily learned the two of you were alone. Perfect.<br>\r\n<br>\r\n\"Hey Mr. Forrest,\" you called as you approached the teacher's desk. He glanced up at you, giving you a friendly smile. You pulled today's assignment out of your bag, asking for some help.<br>\r\n<br>\r\nDanny rolled his eyes, turning towards you. \"We are both aware you don't need my help. You are a very smart kid, and would be acing this class if you didn't pretend,\" he said kind of seriously, giving you a look. You fought off a sigh. If he wasn't going to play along, you might as well just shrink him now.</span></div></div>",
            "created":1492596600,
            "id":2307407,
            "title":"Shrink your teacher"
        },
        "1342":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Concern",
                "Mischievous lust"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Danny watched in shock as you went from a proud 5'11 to barely pushing 3 inches. That shock quickly melted away to...</span></div></span></div>",
            "created":1492596660,
            "id":2307408,
            "title":"The ray goes off and you accidentally shrink yo..."
        },
        "13422":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "Down his boxers",
                "In his shirt pocket"
            ],
            "content":"<div class=\"\"><div> <span>Danny quickly grabbed you, smirking. \"Well well, not sure what exactly happened; but I know I don't have any bugs for students.\"<br>\r\n<br>\r\nYou shivered, unsure if you were scared or aroused or both. However you didn't get much time to dwell on the thought as you heard the door opening. Danny heard it as well and quickly hid you.</span></div></div>",
            "created":1492596840,
            "id":2307411,
            "title":"Mischievous lust"
        },
        "134221":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "To the restroom",
                "To his car"
            ],
            "content":"<div class=\"\"><div> <span>One second you were looking at your teacher's gorgeous face, the next you were sealed somewhere dark and warm. Somewhere musky, you quickly added as you felt your cock harden. Shifting a bit, you realized you were in Danny's briefs. You were laying against his half aroused cock and if you put your hands in the correct place you could feel his pulse. Not what you had planned, but this wasn't turning out too bad. There was a muffled conversation going on above you, but you didn't care. You jerked your hips against the firm flesh under you, groaning. You yelped as your prison shifted, Danny was moving. He was adjusting his package to keep his hard-on hidden from his guest. The thought of unintentional voyeurism really turned you on. You moaned, humping into the cock below you faster. It barely took another minute for you to blow your load. The flesh between your legs was harder than ever, and you were tempted to try and bring Danny's dick to full mast. Then you were shifting once again. It took a second before you realized what was going on. Mr. Forrest was walking now. But where was he going?</span></div></div>",
            "created":1492597440,
            "id":2307416,
            "title":"Down his boxers"
        },
        "14":{
            "author_id":"uchihaboy82",
            "author_name":"Uchihaboy82",
            "choices":[
                "Point it at him and press GROW",
                "Point it at him and press SHRINK (show him whos boss)",
                "Point it at you and shrink while he isnt looking",
                "Point it at you and try the GROW setting",
                "Call in another employee"
            ],
            "content":"<div class=\"\"><div> <span>You decide to bring the remote to the pizza place you work at because your excited to see if it actually works and if it does you know just who to use it on.<br>\r\n<br>\r\nYou arrive at work to see your boss<br>\r\n- Eric<br>\r\nHe has brown hair with green eyes and loves to being the boss of people he loves the power.<br>\r\nHe is a kinda shorter guy that you are who is always wearing a tight shirt that allows you to see his muscular chest, cargo shorts that he wears all the time some days without even changing them, and your favorite; brown sandals that make his feet look so hot.<br>\r\n<br>\r\nHe is the main reason you brought the remote to work. You want to test it out on him.<br>\r\n<br>\r\nHey Alex, he says to you <br>\r\ncan you meet me in my office?<br>\r\n<br>\r\nSure, you say<br>\r\n<br>\r\nYou walk into his office and sit down. <br>\r\nYou pull out the remote now that your in the privacy of his office with just you and him<br>\r\n<br>\r\nwhat do you do?</span></div></div>",
            "created":1209790800,
            "id":527849,
            "title":"Bring the remote to your work"
        },
        "15":{
            "choices":[
                "Make yourself grow.",
                "Make yourself shrink."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You hurry upstairs with the strange gun you found, you've always wanted to see what it would be like at different sizes. Pointing the gun at yourself with anticipation you decide to...</span></div></span></div>",
            "created":1259125200,
            "id":796985,
            "title":"Maybe use it on yourself? hehe"
        },
        "151":{
            "choices":[
                "Grow here at home!",
                "Go grow at a friend's house!",
                "Grow somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>Yes! Making yourself dozens or even hundreds of feet tall and standing over everyone who could once have picked on your or made fun of you, now doll-sized or even ant-sized and completely at your mercy! To be able to toy with people, houses, or even whole cities... The prospect alone is arousing, and a bulge tents the front of your pants as you lustfully envision a new life as a giant. You place a finger on the trigger and begin to squeeze.<br>\r\n<br>\r\nBut wait. Is here really the place to grow? There could be so many places perfect for your new life to begin...</span></div></div>",
            "created":1296795600,
            "id":1047389,
            "title":"Make yourself grow."
        },
        "1511":{
            "choices":[
                "You toy with the two brothers",
                "You take the two brothers with you",
                "You force the two brothers to have sex"
            ],
            "content":"<div class=\"\"><div> <span>As you don't want to destroy the house, you rather to go outside to try the grow ray on yourself.  You step out to the patio at the backyard and you decide that you'd like to try to be 6 times bigger. So you squeeze the trigger and you see things been smaller and smaller until you reach your size that appear to be around 35-36 feet tall. To your amusement, you can see all over the fences including all the backyards... Suddenly you see a couple of brothers poolside taking a sunbath closed eyes. You recognize them as they go the the same school and they both play soccer. It's Brad and Mitch actually<br>\r\n<br>\r\nYou then carefully walk toward them and as you are just towering them, they don't seem to notice you are as they seem to be asleep. You always thought how gorgeous they are, two very athletic guys with theirs fairly tan skins, short hair cuts and seeing them in tight speedos revealing so beautiful bulges.<br>\r\n<br>\r\nYou can't reside to squat and with your two index fingers to touch theirs nice little manhood... Mmmmmmmmmmmm they both got a hard on but they suddenly wake up seeing you... then..</span></div></div>",
            "created":1302584400,
            "id":1086871,
            "title":"Grow here at home but outside"
        },
        "1512":{
            "choices":[
                "John father",
                "John",
                "Another friend of yours that was looking at you"
            ],
            "content":"<div class=\"\"><div> <span>- So you went to your best friend (named john) house... you were in his bedroom with him just talking, when you ask him \"John, you have always laugh about my 4 inches cock and always compare it with yours, what if I tell you that I can make my cock bigger than yours and maybe even bigger than your entire house? Would you believe me?\", John answer: \"Well isn't that obvious? Is a big NO hahaha But it could be very exciting to see that hahaha\", with that secretly you press the button to start your growing, you feel that warm sensation in your entire body expanding more and more, the bulge in your pants was more notorious, your cock was already passing 10 inches of length when John look at you and ask: \"Its really happenning?! You are growing! and your cock is growing even faster! I also want to grow! how you are doing this??!! please tell me!! Just make me grow a few feets as you!!\", john was in shock but also very horny seeing how his best friend clothes rip apart showing a muscular body with a very huge manhood getting harder and bigger each past second, you said to him: \"You think that I will grow just a few feets? You are wrong, Iam thinking to grow hundreds of feets!\", John looks with envy as his best friend shoot upwards breaking the roof of his house growing bigger and bigger.. 30, 40, 50, 60, 80 feets and still going... at 100 feets you stop growing, just to see the face of John and the other people of the neighborhood seeing you... when an idea came to your mind... meanwhile down your feet the family of John had come from the city downtown, looking for their son after they saw your giant form growing exactly above their ruined house... You look down with a evil smile and aim the ray to....</span></div></div>",
            "created":1328245200,
            "id":1270702,
            "title":"Go grow at a friend's house!"
        },
        "15121":{
            "choices":[
                "A friends house or to a random house",
                "To the local park where there are men and boys with their families"
            ],
            "content":"<div class=\"\"><div> <span>- You have always admired John body and manhood but also you have always wondered yourself what his father have beneath his clothes, especially in summer time you start to remember all the times you went to the pool of them, always looking in amaze at the giant crotch of his father, and now you have the power to clear your doubts.... You aim the ray and shoot it towards john dad (named Mark) that was behind his family... all the family turn back looking in horror how Mark body grow and his already big cock growing even faster... \"Dad what are you doing?! please stop!!\" one of his daughter shout, \"Oh you are so cute my darling, but I think dad have another point of view about things now, I don't want to stop, this feeling is so great! Look at my cock family is bigger than our car! I don't want to stop growing! Iam sorry family but maybe you should go away from here cause I think that this friend of John have no intention to stop, I think we will outgrow everything and destroy everything with our expanding bodies hahaha!\", you make Mark a 70 feet tall giant with a 12 feet long hard dick, you approach him and tell him: \"You will be my giant partner, every time I grow I will also make you bigger but not big as me, ok?, now less talking and lets have some fun and make a show for your family before we grow more hahaha!\", with that Mark kneels and start sucking your cock, the pleasure was so intense that each suck makes you moan loudly, you were like that for some minutes when you cum all over Mark face, \"Oh!! I didn't know that sucking a giant dick could be so exciting... could you make your dick bigger? I want to feel it with my entire body!\" Mark said, but you answer: \"I will but I want more people to see how big we are gonna get, but before lets make things more interesting\", with that you start walking towards...</span></div></div>",
            "created":1328331600,
            "id":1270956,
            "title":"John father"
        },
        "151212":{
            "choices":[
                "Make yourself bigger",
                "Make more giants"
            ],
            "content":"<div class=\"\"><div> <span>- You arrive to the park, you know that the park has only two exits so you stand in one side and mark in the other so they have no escape so you see all those families not knowing that in a moment their world will become a mess, you stare how they look at you two in terror knowing that there is no escape from you and Mark, and quickly you just start firing the ray randomly to each boy or men you think it could be stimulant to see them grow and watch which will be their reaction, the first one to be hit was a boy nearly 17 years old, the first thing to happen was his moan and then an evil smile looking at his family, surely knowing what will happen next feeling all that power inside his body, then came the growing, his dick literally exploded from his pants... 10, 11, 14, 16, 20 inches and still going, then his clothes ripped apart leaving it naked.... 9, 10, 12, 15, 20 and then he stopped at 25 feets... all the park was in silence... everyone at the park looking at this young boy grown to a giant and assuming with fear that maybe their son or their husband will also will be grown to giants... meanwhile the boy look at his gigantic cock and then down to see his terrified family especially his girlfriend and her family... then he just catch her with his hands and said: \"you have always argued about my body and especially my penis and now that iam a giant I will not  share it with you! I will share it with other giants like me hahaha\"... with that he just put her back to the ground when some cries were heard, the reason was that the brother of that girl (that was also 17 years old) started growing shooting up to 25 feets, then he approached to the other boy and they start kissing each other... then the real mess started... more screams of terror were heard... many boys and mens began to grow, some to 10 feets at least and others up to 50 feets, at the beginning they just stare in wonder their bodies but they start feeling more hornier and start making lots of thing... crushing their own families with their butts, their balls or even their entire body making them even hornier... also eating up people or having sex with tiny and giant people... you see all this things and tell them to go the city and go in a rampage with everyone and everyhting and so they did... you also see that Mark was having some fun with other giants having sex with them... you have never felt so horny in your life with the things your eyes are watching... you just start rubbing your hands against your penis and feel more and more pleasure... but you want more... </span></div></div>",
            "created":1329627600,
            "id":1280196,
            "title":"To the local park where there are men and boys ..."
        },
        "15123":{
            "choices":[
                "Go into the city and have some fun with this ability",
                "Keep it in the suburbs or maybe go to the park"
            ],
            "content":"<div class=\"\"><div> <span>You fire the gun at Rick, a person you know and though was kind of hot. He was kind of standing in the back of the crowd with his girlfriend. He begn to shoot upwads. His shirt shredding apart as he repeats \"Oh my God\" pleasure over and over again. You can't help but notice how hot his body is, as the clothes tighten, and fall off of him. He moans as his cock explodes out of his pants with a stream of pre cum oozing out. His cock jutting out over a foot long and still growing.. \"Rick! what the hell!\" shrieks his girlfriend. Rick doesn't even seem to hear her as he keeps moaning as he passes 20, than 30, 40, and so on. Around 60ft he can't take it anymore, and sits down with a loud thud crushing his girlfriend. He then proceeds to lay on his side looking at you and strokes his monster cock. It doesn't take long untill he moans tremendously in pleasure and firesthe first shot of his load onto John, his dad Mark and the rest of his family. They are knocked down by it. He spews out three more shots onto them. To your surprise you see John and his dad begin to shoot up in a growth spurt. The cum seems to have absorbed into their bodies, meanwhile Johns mom and sisters seem to not be having any reaction it. John and his dads clothes rip apart, cocks spring upwards issuing torrents of precum. There growing bodies, end up crushing the rest johns family between them. This whole sequence is making you so horny, you begin masterbating furiously. And cum all overyourself. You shoot up to about 150 feet. John and Mark  are at about 70ft when they blow their loads into whats left of the crowd that hasnt left. Causing the same thing to happen with a about 3 other guys. Afterwards all of yall are already rock hard again and ready to make use of this new found ability of growth cum that only affects males.</span></div></div>",
            "created":1332306000,
            "id":1299095,
            "title":"Another friend of yours that was looking at you"
        },
        "151232":{
            "author_id":"snackarie413",
            "author_name":"Snackarie",
            "choices":[
                "The boy looks for where the beam came from (Uh oh, he's getting ideas!)",
                "Something unexpected happens..."
            ],
            "content":"<div class=\"\"><div> <span>You decide to head to the park to spread your blessing of growth further.<br>\r\n<br>\r\nAs you approach the park, people can hear you stomping your way there, shaking the ground with each step. Several people faint at the sight of you, while many others stare in awe, including mostly men, and even some younger boys, around age 12.<br>\r\n<br>\r\nYou decide to blast one of the young boys with the gun, catching him off-guard, and forcing a moan from his lips. This was followed up by him grinning. It seemed like he was thinking of becoming a giant ever since you showed up.<br>\r\n\"What's wrong, honey?\", asked the boy's mother. She got her answer in the form of her son suddenly doubling in height from 4' to 8' tall. This caused his clothes to burst off of him, revealing his foot-long dick standing at attention. He promptly started stroking it, to which his body reacted by growing a whole foot per stroke. This seemed to be a new side effect of the ray. The boy kept chanting \"Bigger, bigger, BIGGER!\", as he shot past 20, then 40, then 100 feet tall! He came at that moment, covering his dad and his older brother (age 16), who reacted much the same as him, spurting upwards one foot at a time after doubling in height.<br>\r\n<br>\r\nMeanwhile, the younger boy managed to swallow some of his own cum, which not only grew him more, but it also grew him insanely fast, at 10 feet per second!<br>\r\n\"<b>Yes! Bigger!</b>\", the boy shouted, \"<b>I must grow even BIGGER!</b>\"<br>\r\nThe boy finally stopped growing at 300 feet tall, towering over you, with lust in his eyes.</span></div></div>",
            "created":1595134800,
            "id":2871433,
            "title":"Big Boys in the Park"
        },
        "152":{
            "author_id":"jestex",
            "author_name":"Jestex",
            "choices":[
                "2 inches tall",
                "6 inches tall",
                "1 foot tall"
            ],
            "content":"<div class=\"\"><div> <span>You squeeze your eyes shut and pull the trigger. You can't feel the beam hitting your chest, but you do feel a strange tingling all over your entire body. After a few seconds, you release the trigger and open your eyes to discover that you're now...</span></div></div>",
            "created":1507677900,
            "id":2399395,
            "title":"Make yourself shrink."
        },
        "1521":{
            "author_id":"jestex",
            "author_name":"Jestex",
            "choices":[
                "Yes",
                "No, and he sits on your bed to put on his boots",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You stare around your room, consumed by shock and awe at how impossibly massive the familiar scene has become in mere seconds. You were sitting on the edge of your bed when you shrank, and now you sit in the middle of the vast plain of your bedspread. It was lucky that you remembered to make your bed when you got up this morning, or the landscape would be much more difficult to traverse. Still gaping about at the gigantic world you now found yourself in, you walk towards the precipitous edge of your bed and carefully lean over, trying to gauge the safety of jumping down to the floor. But at your new size, it's simply too high; you silently curse yourself for not leaving the t-shirt you tossed carelessly onto the floor earlier a few feet closer to your bed so that you could use it to cushion your fall. You don't have much time to start planning a new course of action, however, when your father's rough voice calls from the hallway, \"Are you up yet?\" accompanied by footsteps towards your bedroom.<br>\r\n<br>\r\n<i>Shit!</i> In your haste to try out the size ray, you briefly forgot that you were supposed to be getting ready to leave for your father-son camping trip! You cast your eyes around, wildly searching for somewhere to take cover, but it's too late -- the bedroom door swings open, and there stands your father. Already a big man by anyone's standards, the burly 50-year-old now stands at the height of a skyscraper, filling the doorway with his immense frame. He looks like a true lumberjack, dressed in his old flannel and wool socks. He carries a pair of hiking boots in one hand and scratches at his graying beard absentmindedly with the other as he steps into your room. You're frozen in a mixture of fear and excitement as his gaze falls upon your tidy bed, and he frowns in confusion. Does he see you?</span></div></div>",
            "created":1507679400,
            "id":2399412,
            "title":"2 inches tall"
        },
        "15211":{
            "author_id":"jestex",
            "author_name":"Jestex",
            "choices":[
                "He heads straight for the campsite",
                "He decides to pick up a friend to bring along",
                "He makes another stop along the way"
            ],
            "content":"<div class=\"\"><div> <span>Sean's eyes widen when they land upon your tiny form. He drops his hiking boots, and you wince at the booming sound of them hitting the hardwood floor. He walks toward your bed and kneels down, leaning forward to get a good look at you. Even though he's taken a knee, you're still only level with his belly, and you're forced to nearly bend over backwards just to meet your father's gaze. You shrank wearing only the boxers you slept in, and you can't help but feel exposed beneath his stare. There's a playful glint in his eye as he appraises your shrunken body. \"Son... how did you get so tiny?\" he rumbles.<br>\r\n<br>\r\nWith some effort, you clear your throat and call up to him, \"I got a weird size-changing remote in the mail this morning!\" You hold it up for him to see. He reaches down and carefully pinches the minuscule remote between his huge thumb and fingertip -- and suddenly, it starts to grow. You both watch as the remote quickly balloons in your father's hand, expanding until it's normal sized again.<br>\r\n<br>\r\n\"Interesting,\" he murmurs, turning the remote over in his hands and examining it curiously. \"It must adapt its size to fit whoever is holding it. I wonder where tech like this could've come from?\" He looks back down at you and asks, \"Was there a return address on the package?\"<br>\r\n<br>\r\nYou shake your head. It <i>is</i> strange that such powerful technology could even exist -- it seemed more befitting a sci-fi movie -- and it's even stranger that it would be delivered to you, of all people, for seemingly no reason. But you have little time to ponder it, because suddenly your father is tucking the remote into his pocket and reaching down to grab you. He wraps his gigantic fingers around your body before you can react and lifts you up to his face as he rises and turns to leave.<br>\r\n<br>\r\n\"I guess it doesn't matter, really,\" he says, smiling mischievously. \"Our camping trip just got a lot more fun!\" He puts on his boots, grabs his pack from the living room, and hits the road with you sitting warm and comfortable in the front pocket of his shirt.</span></div></div>",
            "created":1507689120,
            "id":2399492,
            "title":"Yes"
        }
    },
    "info":{
        "author_id":"uchihaboy82",
        "author_name":"Uchihaboy82",
        "brief_description":"You have a shrink/growth ray and decide to have some fun with it\r\nGP for adds. PLEASE ADD",
        "created":1209871380,
        "description":"<td align=\"left\" class=\"norm\">This is a full out gay story and ABSOLUTLELY ANYTHING IS ACCEPTABLE<br>\r\n<br>\r\nRules:<br>\r\njust one<br>\r\n1 NO FEMALE INTERACTION</td>",
        "id":1421987,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595686500,
        "modified":1595686500,
        "pretty_title":"My very own shrink/growth ray"
    }
}