{
    "chapters":{
        "1":{
            "author_id":"brad3434",
            "author_name":"lazyboy",
            "choices":[
                "Brett- 18 yr old",
                "Brad- 16 yr old",
                "Asistant coach Jeff - 20 yr old",
                "Jake- 17 yr old Jerk buff jock",
                "Ryan- 15 yr old freshman who picks up and gives out towels in the lockerroom"
            ],
            "content":"<div class=\"\"><div> <span>The whistle blows \"Damn it\" you yell heading into the locker room. you get so pissed u knock a water cooler over and hear a metal object hit the floor. You look down to find a ring and then as u pick it up ur world shifts everthing gets bigger. Your only a half an inch tall now and thats when the team enters. \"Omg\" you yell running from colossal sneakers comming your way thats when u run and climb in to a gym bag on the floor it gets lifted and it belongs to .......</span></div></div>",
            "created":1099458000,
            "id":224401,
            "title":"The Begining"
        },
        "11":{
            "author_id":"brad3434",
            "author_name":"lazyboy",
            "choices":[
                "A Sock",
                "pair of boxers",
                "Sneaker",
                "Gum",
                "Jock strap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You make it in the bag just in time unforuantly that was'nt such a good idea. You see the face a Brett through the opening he grab something out of his bag and you go with it to your horror is a ......</span></div></span></div>",
            "created":1099890000,
            "id":224403,
            "title":"Doomed fate"
        },
        "111":{
            "author_id":"koaxor",
            "author_name":"avrrge",
            "choices":[
                "Stay there",
                "Maybe he'll notice"
            ],
            "content":"<div class=\"\"><div> <span>As he pulls out the sock, you unfortunately fell into it. You fall down to the toe area. As you try to maintain your balance, you see him putting on the sock. As you look up, you see his toes in clear view. You close yours eyes, and before long, you feel them reach you, and push you to the end of the sock.<br>\r\n<br>\r\nNow what?</span></div></div>",
            "created":1130562000,
            "id":281361,
            "title":"Sock"
        },
        "1112":{
            "content":"<div class=\"\"><div> <span>Brett feels wiggling at the bottom of his toe. Mike struggles harder than ever before until he is suddenly released. He falls into the palm of his favorite basketball player. \"Coach?\" Brett says. Mike jumps up. \"YES! HELP ME!\" he screams. Brett, holding the tiny form, thinks for a minuet. Then, he gets an evil smile as he drops Mike on the floor. \"B-Brett? What are you doing?!!?\" Mike says. Brett slowly stands, towering over his basketball coach, and lifts up his socked foot. \"I'm just getting a little revenge...\" Brett says, slamming his foot on the ground next to his tiny coach.<br>\r\nHe was toying with Mike, but now, as his other foot is raised, Mike starts to get scared and run. He doesn't get far, as Brett's smelly sock shadows over him, crushing Mike slowly. \"Looks like I finally got payback for all those burpies.\" Brett laughs.</span></div></div>",
            "created":1449183060,
            "id":2069685,
            "title":"Notice me senpai"
        },
        "115":{
            "author_name":"hum bug",
            "choices":[
                "your strugles makes him cum",
                "your stugles makes emty the jockstrap"
            ],
            "content":"<div class=\"\"><div> <span>to your horror you are in a huge jockstrap that belongs to Brett, not the best person you get along with, as he picks it up and starts to put it on you can see his enormous cock coming closer to you like a huge lorry, as you try to run to end out of the way you trip and the cock pushes you further</span></div></div>",
            "created":1119330000,
            "id":257566,
            "title":"tight sqeeze"
        },
        "1151":{
            "choices":[
                "The coach laps up the cum",
                "The coach chooses the asshole."
            ],
            "content":"<div class=\"\"><div> <span>The coach desperately tries to escape the hugh smelly jockstrap.  But the coaches struggles only excite the hugh black jock.  The coach feels stiffled by the odor of the smegma.  Pre cum begans to drip and the coach struggles harder.  All of a sudden SQUIRT and semen covers the coach.  The coach screams in agony and cum fills his nose and mouth.  The coach feels himself drowning whne all of a sudden the young man takes his jock off to see what was going on.  Seeing the hated coach in this situation makes the young man laugh.  He tells the coach that if he doesn't lap up the cum that he will stick the coach up his ass.</span></div></div>",
            "created":1130821200,
            "id":281892,
            "title":"Decisiosns Decisions"
        },
        "1152":{
            "author_name":"hum bug",
            "choices":[
                "Back at Bretts",
                "Gay Bar"
            ],
            "content":"<div class=\"\"><div> <span>thankfully your strugles made brett take his jockstrap of and you see his massive face looking at you \"oh my god coach what the hell are doing in their?\" \"look ill do anything just help me ok im sorry i shouted at you\" just then he smiles at you and says you can go back in and we shall sort this out at my house, as he puts you back in his cock meets you yet agen he does up his jeans and leaves. you can feel him walking as his cock sways and you sway with it as the head keeps hiting you in the face.</span></div></div>",
            "created":1120971600,
            "id":260534,
            "title":"Where to"
        },
        "11522":{
            "author_id":"antikatze",
            "author_name":"lembargo",
            "choices":[
                "Gives you to a total stranger: a 60 y/o man",
                "gives you to a whimsy boy about 18 y/o"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Brett heads to a gay bar, where he ...</span></div></span></div>",
            "created":1143522000,
            "id":309184,
            "title":"Gay Bar"
        },
        "12":{
            "author_id":"brad3434",
            "author_name":"lazyboy",
            "choices":[
                "mike climbs out of the bag in the car and trys to get attention",
                "Brad reaches in his bag for sumthing...",
                "brad leaves his bag in the car as rick heads to work",
                "rick and brad get home mike trys to escape the bag",
                "mike gets ouit but falls from the gym bag into the taco bell bag next to it"
            ],
            "content":"<div class=\"\"><div> <span>You look out of the bag up at Brad the youngest Team member at 16. He zips u up in the bag and take off to his ride in the front his father ur best friend Rick Flors. He's a 36 yr bodybuilder /police officer. Brad tosses the bag i n the back seat and they take off...</span></div></div>",
            "created":1146546000,
            "id":316760,
            "title":"A Difficult situation"
        },
        "13":{
            "author_id":"brad3434",
            "author_name":"lazyboy",
            "choices":[
                "Head out to his car?",
                "Undress and change into the clothes in the bag",
                "Head to another game",
                "Do something with the bag?",
                "Ur choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look up to see the face of your assistant coach jeff he starts too.......</span></div></span></div>",
            "created":1099890000,
            "id":224402,
            "title":"Jeff"
        },
        "131":{
            "author_id":"brad3434",
            "author_name":"lazyboy",
            "choices":[
                "Climb up to jeff's ear",
                "Stay where u are or hide somewhere"
            ],
            "content":"<div class=\"\"><div> <span>Mike looks up at jeff as he zips up the bag and slings onto his shoulder. He then heads out to his car and tosses the bag onto the passanger seat. He then starts up the car and drives. Poor mike fell and got tossed around. Mike however looks up at a very tiny opening and begins to climb up a jock to get to the hole. He then climbs out of the hole and slides down the bag hitting a rough material. Looking up he noticed he is on the side of jeffs jeans and trys yelling to get his attention but at his size to almost immpossible to be heard. He then brainstorms thinking of a way to get his attention.</span></div></div>",
            "created":1143608400,
            "id":309421,
            "title":"An Excape to what......"
        },
        "1311":{
            "content":"<div class=\"\"><div> <span>Climbing the massive assistant coach, Mike finally makes it to his giant eardrums. He crawls into the waxy cave. \"JEFF? HEY! IN HERE!\" you scream. Jeff almost stops the car completely when the loud noise reaches him. He digs into his ear, trapping tiny Mike on his finger. Jeff lifts the little spec to his face. \"That's disgusting...fucking bugs crawling in my ear! Gotta show you who's boss.\" Jeff shakes his pointer finger, dropping little Mike to the floor. Then, with a quick STOMP, crushes him flat and drives off.</span></div></div>",
            "created":1449182340,
            "id":2069679,
            "title":"Can you hEAR me?"
        },
        "14":{
            "author_name":"Satyagraha7",
            "choices":[
                "He sees you",
                "You hide deeper into the bag",
                "You escape from the bag"
            ],
            "content":"<div class=\"\"><div> <span>You are staring out of Jakes bag. He's telling Brett that it's your fault they lost. How he'd like to get his hands on you without being afraid of getting kicked of the team. Brett and the other guys are agreeing.  Several of them are saying how they wish they had a coach worth crap.  <br>\r\n<br>\r\nThis is pretty much more than you can take.  You've busted your butt for these guys and here they are total ingrates.  <br>\r\n<br>\r\nYou lean up to start yelling at them but are thrown back deeper into Jake's bag when he starts walking again.<br>\r\n<br>\r\nYou start to climb back up.  Now that you've cooled off you decide it might be better if none of the team saw you, as they seemed pretty pissed.  As you reach the top of the bag you feel it being put down.  To your horror the face of a Jake comes into view and he's reaching into the bag.<br>\r\n<br>\r\nWhat happens?</span></div></div>",
            "created":1101186000,
            "id":226647,
            "title":"Not a good place to land...."
        },
        "141":{
            "author_name":"Satyagraha7",
            "choices":[
                "He tells you he'll help you find out what's happened",
                "He gives you an evil grin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>For a moment the look on the Jocks face is almost funny, looking at this tiny dude in his bag.  Then he recognizes you.  \"How the h..\", he starts.  Then...</span></div></span></div>",
            "created":1101186000,
            "id":226648,
            "title":"Uncovered"
        },
        "1411":{
            "choices":[
                "You explain everything to him.",
                "You just ask him if he knows a way to get himself big again."
            ],
            "content":"<div class=\"\"><div> <span>He tells you that he will help you find out what has happened to you, and how you can get back to your good, old form.<br>\r\n<br>\r\n\"Thank you...\" you say gratefully, and you make an oath to yourself to give thanks as many ways as you could to this young man once you have turned big again-- hopefully.<br>\r\n<br>\r\nUsually, Jake was tough, and... well... minded his own business, but this certainly was a change of heart...<br>\r\n<br>\r\n\"Your welcome, and how did you get all shrunk up like this, my coach?\" Jake adds to the strange conversation.<br>\r\n<br>\r\nYou shrug, thinking that what has happened will be a little hard to explain, and you don't think he will by it.<br>\r\n<br>\r\nWhat happens?</span></div></div>",
            "created":1101186000,
            "id":226650,
            "title":"Help"
        },
        "14112":{
            "author_name":"hum bug",
            "choices":[
                "Jake likes you down there",
                "He arives at his House?"
            ],
            "content":"<div class=\"\"><div> <span>Jake do you know anyways to help me get bigger? please ill do anything for you. ok Coach but i don't know how to make you bigger and besides you can't stop me from doing anything i want to do with you. For now ill put you somewhere safe and we can talk about your shrinking problem at my house. JAKE you mst help ! please Jake. Coach i wont hurt you ok and for now becuase i have no where to put you will have to travel with me in my boxers </span></div></div>",
            "created":1119762000,
            "id":258316,
            "title":"Great Help (NOT)"
        },
        "141121":{
            "author_id":"blueplanett",
            "author_name":"BluePlanet",
            "choices":[
                "The couch refuses",
                "He agrees"
            ],
            "content":"<div class=\"\"><div> <span>\"I like you that way runt...hahaha we are going to have a lot of fun\"<br>\r\nJake puts you on the coffee table and he takes off his shoes and his socks<br>\r\n\"would you mind couch.. I'm tired from todays practice so can you give me a foot massage\"</span></div></div>",
            "created":1270787400,
            "id":864838,
            "title":"Jake likes you down there"
        },
        "1412":{
            "author_name":"Satyagraha7",
            "choices":[
                "Reason with Jake to help you",
                "Think of ways to torture you"
            ],
            "content":"<div class=\"\"><div> <span>The look that this giant jock gets on his face tells you this isn't going to be good.  You decide the only way is to try and escape, and begin to run to the edge of the bag.  You think that maybe you are small enough to get where the Jock can't catch you.  <br>\r\n<br>\r\nYou are almost to the opening at the side of the bag when hit something like a brick wall.  You are thrown back and dazed.  When you stand up you realize it wasn't a brick wall, but a jocks hand.  <br>\r\n<br>\r\nYou watch in horror as Jake pushes you with a finger into the palm of his hand.  <br>\r\n<br>\r\n\"Hey Guys, it looks like I might have something to take our minds off things tonight\", Jake is telling the other guys, Brett and Ryan, as he lifts you up.<br>\r\n<br>\r\nHe shows you to the other two jocks standing there, and they.</span></div></div>",
            "created":1101186000,
            "id":226649,
            "title":"Caught in the palm of a jock"
        },
        "14122":{
            "author_name":"Dinghy",
            "choices":[
                "The boys think it might be better to help the coach instead",
                "The boys continue their plans for the coach"
            ],
            "content":"<div class=\"\"><div> <span>Brett and Ryan come into view at look in wonderment at the couch. It takes a few seconds for Brett to say, \"what the hell happened\". Jake said he didn't know but found the couch in his gym bag. Brett and Ryan look up at Jake and Ryan asks, \"what do we do?\". After pondering the question for a moment Jake, Brett and Ryan look down at the coach and all begin smiling. Well, well, well, Brett says as he begins to laugh.<br>\r\n<br>\r\nThe couch realizing his precarious predicament starts and with trembling hands starts to reason with the boys to help hime. They seem oblivious  to him and Jake suggests they wait in the locker room until everyone leaves so they can decide what to do. The replace the couch in Jakes's gym bag and zipper it up. Then the boys take showers and start getting dressed, slowly taking their time as all the other player and coaches leave the locker room.<br>\r\n<br>\r\nFinally the last player leaves and Jake retrieves his gym bag. After a moment of groping around Jake takes the coach and places him on a stool. The coach is prespiring profusely wondering what is going to happen to him. He knows there is no way to escape and he is at the mercy of these 3 teenagers. How he wishes he hadn't yelled at them so much for messing up the game. Ryan speaks first and asks Jake what we are going to do with the coach. Before Jake can answer Brett chimes up and says he knows what he is going to do with him. As he says this he reaches down with his right hand and squeezes his crotch where a huge bulge begins to appear. Jake says, \"after we each have a turn I know what I want to do with him.\" \"What\" ask Ryan. Jake says, \"I am going to have me a couch sandwich\" and with that the 3 boys start laughing. <br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1119675600,
            "id":258193,
            "title":"The coach realizes his fate"
        },
        "141222":{
            "author_name":"Dinghy",
            "choices":[
                "He is actually going to help the coach",
                "Starts telling the coach what he is going to do with him"
            ],
            "content":"<div class=\"\"><div> <span>Jake suggests that they draw straws to see who gets the coach first. It is decided that nobody will kill him until they have each tortured him. They agree that each boy gets the coach for 24 hours. Jake holds the straws and Brett and Ryan reach over to pick theres.<br>\r\n<br>\r\nWhile all this is happening the coach dropped to his knees and starts screaming for the boys not to hurt him. While they are talking they glance down at the coach but none of them pay any attention to him.<br>\r\n<br>\r\nJake curses and says he should go first since he found the coach. Brett draws the big straw and gets the coach first, then Ryan and finally the Jake. Then Jake calms down and says it is better this way since when he is done with the coach he is going to eat him so he might as well go last. It is agreed and as Ryan and Jake leave the locker room, Ryan turns around and tells Brett, \"Hey don't forget, we meet here at 9 tomorrow night\". \"Don't worry we'll be here\".<br>\r\n<br>\r\nNow Brett turns to the coach. They are all alone in the locker room. Brett starts to speak but what does he say?</span></div></div>",
            "created":1119675600,
            "id":258195,
            "title":"Drawing of straws"
        },
        "1412222":{
            "author_name":"Dinghy",
            "choices":[
                "Candy unzips Bretts pants and yells in horror",
                "Candy  unzips Bretts pants and gets excited"
            ],
            "content":"<div class=\"\"><div> <span>Brett tells the coach that he is going to surprise his girlfriend Candy with him. He tells the coach that Candy's parents are away for the weekend and with an evil smile tells the cooach he and Candy will think of something to do to the coach together.<br>\r\n<br>\r\nBrett reaches over to his gym bag and pulls out this gigantic jock strap. \"Get in\" Brett tells the coach. The coach is so terrified that he is unable to move. Brett reaches over and picks up the coach between 2 fingers and brings him up to his face. As the coach dangles helplessly in front of Brett's face Brett says, \"like you always are telling us coach, not to make you repeat yourself. When I tell you something you jump.\" Brett looks at the coach just hanging there and starts to rub his tongue along his lips. He says, \"I bet you would taste good. The guys would kill me but I could always say you escaped.\" The coach screams in horror and begs Brett not to eat him. Brett says, just do what I tell you.\" He puts the coach on top of the jock strap and raises his hands to the button of his jeans. The coach sees that the bulge in Bretts jeans has has gotten bigger. Slowly Brett opens his jeans and lowers the zipper. He pulls down his jeans and underwear in one quick motion. Brett picks up the jock strap and looks at the helpless coach in it and says with a smile, \"make yourself confortable'. With that Brett lowers the jock strap so he can get his feet through it. It is only then that the coach sees Bretts enormous erect cock and his swollen round balls. They race towards him with incredible speed. It happened so fast that the coach had no time to scream. He found himself pinned under Brett's huge balls and was totally unable to move. Suddenly there was a sound and then he was plunged into darkness. Brett had pulled up his jeans and was buttoning the waist shut. Then there was this loud rasping sound and the coach realized Brett was pulling up his zipper. The pressure of Brett's now closed jeans on the jock strap was unreal. The coach thought this was it. He could hardly breath and the air was stale and musty. He felt the motion of Brett walking and wondered how long he could resist before being crushed to death under Brett's balls.</span></div></div>",
            "created":1119675600,
            "id":258197,
            "title":"A stale and musty smell"
        },
        "14122221":{
            "author_id":"annesmith1",
            "author_name":"SarahSmith",
            "choices":[
                "A dead coach, smeared all over Brett's dick. He didn't survive after all.",
                "The coach, still alive but badly wounded."
            ],
            "content":"<div class=\"\"><div> <span>Brett starts taking is clothes off in front of Candy. He first takes his jeans off. Candy then sees a red stain all over the front of Brett's jockstrap. She screams in horror. Brett looks down at his strap, shrugs and goes on taking it off. Candy, who is still watching nervously, then sees something horrifying. What she sees is...</span></div></div>",
            "created":1240256340,
            "id":679030,
            "title":"Candy unzips Bretts pants and yells in horror"
        },
        "14122222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Left (Bladder)",
                "Right (Balls)"
            ],
            "content":"<div class=\"\"><div> <span>ZIP! Candy unzips Brett's pants to find a person cowering among the forest that is Bretts pubes. \"Who's that?\" Candy asks.<br>\r\n<br>\r\n\"Oh, that's just my coach!\"<br>\r\n<br>\r\nCandy smirks at him and says \"Oh, yes! I can't wait to have fun with you! Brett, is he any use to you anymore?\"<br>\r\n<br>\r\n\"Err... well, no. There's plenty of people who'd be willing to coach us.\"<br>\r\n<br>\r\n\"Perfect!\" Candy said. \"Then I'll kill him by making my man feel awesome!\" She picks up the coach in one hand, brings him over to Brett's cock, and drops him in. <br>\r\n<br>\r\nCoach screams as he's swallowed by Brett's unrelenting cock.<br>\r\n<br>\r\nWhich way does he go?</span></div></div>",
            "created":1358215440,
            "id":1508933,
            "title":"Candy  unzips Bretts pants and gets excited"
        },
        "142":{
            "author_id":"tacoseal",
            "author_name":"Nate",
            "choices":[
                "Stay put",
                "Dive away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You dive deep into the bag to escape the giant teenager, but instead of escaping you land inside his sweaty jockstrap.You...</span></div></span></div>",
            "created":1445318220,
            "id":2049702,
            "title":"a failed escape"
        },
        "1421":{
            "author_id":"tacoseal",
            "author_name":"Nate",
            "choices":[
                "Rub his cock",
                "Stay still"
            ],
            "content":"<div class=\"\"><div> <span>You realize that you can't move out of the way and stay put. The giant jock grabs his jock strap and puts it onto his ginormous junk. Your pressed up against the soft flesh of his cock. The smell is terrible you struggle and the giant jock starts to get an erection. He starts walking around and get pressed against his cock you...</span></div></div>",
            "created":1445407020,
            "id":2050136,
            "title":"A terrifying ride"
        },
        "15":{
            "author_id":"brad3434",
            "author_name":"lazyboy",
            "choices":[
                "his socks",
                "his jockstrap",
                "his size 15 nikes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In walks ryan the newest player on the team and he walks up to his gym bag and looks for.......</span></div></span></div>",
            "created":1115960400,
            "id":250117,
            "title":"Gigantic freshman"
        },
        "151":{
            "author_id":"brad3434",
            "author_name":"lazyboy",
            "choices":[
                "does he find a hole in the sock",
                "the foot enters"
            ],
            "content":"<div class=\"\"><div> <span>mike is crawling around the gym bag<br>\r\n<br>\r\nhe ends up near the mouth of some sox, suddenly <br>\r\n<br>\r\nthe bag is lifted and he tumpled into the sox but <br>\r\n<br>\r\nnot too far. when the sox is grabbed he tumbled <br>\r\n<br>\r\nfutther into it ryan out his sox on the floor and <br>\r\n<br>\r\ntakes off his old ones. while he is doing this <br>\r\n<br>\r\nmike crawls almost out of the sox and sees ryans  <br>\r\n<br>\r\nbarefoot on the floor.before he can get out of <br>\r\n<br>\r\nthe sox its lifted and he tumpbles back into it.</span></div></div>",
            "created":1115960400,
            "id":250121,
            "title":"Nasty Socks"
        },
        "1512":{
            "choices":[
                "Stuck between Ryan's toes",
                "Inside the sock and come tumbling out"
            ],
            "content":"<div class=\"\"><div> <span>Mike tries to find a way out but there was no hole in Ryan's sock.  So Mike runs as far back into the base of the sock as he can when Ryan's foot enters and you become trapped between his toes.  Soon you feel Ryan put his shoe on and you know you will be trapped for a while.  You fell him start to get up and walk out of the locker room.  With each step he takes you are shaken quite a bit some times getting further into the tow others getting away from them and one time you were shaken so much that your lips came in contact with Ryan's sweaty foot and you ended up kissing it.  After a while Ryan starts to feel you so he sits down and takes of his shoe but not seeing you but still feeling you makes him take of his sock when he does you are where?</span></div></div>",
            "created":1169269200,
            "id":375204,
            "title":"Ride in Ryan's sock"
        },
        "15122":{
            "content":"<div class=\"\"><div> <span>Mike, now released from his smelly, sweaty prison, falls onto the floor. As he gets up, he is met with a billboard sized face. Ryan looks down at the strange thing that crawled into his shoe. \"Tch. More bugs?\" he says, lifting up a foot to crush his basketball coach.  Mike, knowing what could follow, runs for his life. He narrowly avoids Ryan's foot, and just as he thinks he's gotten away....THOOM. Ryan's other size 14 slimy foot crashes down on him, leaving a speck on his toe.</span></div></div>",
            "created":1449182640,
            "id":2069681,
            "title":"Tumbling"
        },
        "152":{
            "choices":[
                "The coach is splattered like a bug",
                "The coach is dead.  Nobody cares."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The big jock sees the coach and stomps him to death.  I never met a coach yet that wasn't a complete jerk.</span></div></span></div>",
            "created":1130648400,
            "id":281661,
            "title":"Coach gets stomped on hard"
        },
        "1521":{
            "choices":[
                "Ryan sees the tiny coach",
                "Ryan does not see the small man"
            ],
            "content":"<div class=\"\"><div> <span>The coach was splattered like a bug, yet he was still alive as he lay on the floor of the locker room he actually felt the pain start to go away.<br>\r\n\"Great I am dying now,\" thought Mike.  He was wrong though some how due to his being shrunk he had become un-killable, though he still felt pain, so as he laid there he was actually healing.  Soon all of his players had left leaving only Ryan, the freshman towel boy behind.<br>\r\nAfter a few minutes more Mike was able to stand up and walk around, though with a limb, and he saw Ryan standing there goofing around in front of the mirror wearing only his underwear.  Knowing that the boy might be his only chance Mike made his way slowly to the boy.<br>\r\nWhen he got to the base of Ryan's feet he was amazed by what he saw.  Mike never took the time to really see Ryan in fact Ryan had tried out for the team but he had dismissed him away due to Ryan's height was a head taller then the rest of the team.  Now Mike saw a beautiful giant with a muscled and tanned body with a large package.  Remembering why he came there Mike tried to get the Giant God's attention.<br>\r\n</span></div></div>",
            "created":1169269200,
            "id":375210,
            "title":"Smashed  and rebirth"
        },
        "15211":{
            "choices":[
                "placing the shrunken coach into his sweaty sock",
                "goes to take a shower"
            ],
            "content":"<div class=\"\"><div> <span>Ryan started to sit on the bench when he sees the shrunken coach and picks him up; by this time they are the only two in the locker room.  When the coach is a basic foot away from Ryan's face the boy recognizes him and lets out a gasp of surprise.  After the first few moments of shock at seeing the shrunken man Ryan gets and evil gleam in his eyes.  He then starts to strip the coach before...</span></div></div>",
            "created":1169701200,
            "id":376670,
            "title":"Ryan sees Mike"
        },
        "152112":{
            "choices":[
                "reaches down and starts to jack-off with the coach between his hand and cock",
                "Ryan wants Mike to ride him, until he cums"
            ],
            "content":"<div class=\"\"><div> <span>After Ryan has finished stripping Mike he starts to undress himself for a after game shower.  Even though he is not on the team he runs around a lot so has worked up quite a sweat.  Going into the shower Ryan takes the coach and pushes him into the bar of soap until Mike can not move.  Ryan then starts his shower and grabs the soap and using the side where Mike is stuck in he starts to rub the shrunken man over his sweat soaked body.  Mike was ring not to gag as his body was rubbed onto the gigantic god's body parts.  Ryan cleaned his body and then took the coach out of the soap bar and used the little coach as a sponge and continued to rub his over his body again.<br>\r\nHaving this sort of power over the coach had made the younger boy hard so when he was finished rubbing the coach over his body the second time he was fully hard.  Placing the coach onto his hard cock Ryan...<br>\r\n</span></div></div>",
            "created":1171342800,
            "id":381952,
            "title":"Shower with Ryan"
        },
        "1521121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Ejaculation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ryan's eyes bulge. That's it! He needed release, right here, right now!<br>\r\n<br>\r\nHe starts jerking off with the coach being an unfortunate passenger. <br>\r\n<br>\r\nThe coach was turned to a bloody mess by the friction.</span></div></span></div>",
            "created":1397078460,
            "id":1776107,
            "title":"reaches down and starts to jack-off with the co..."
        },
        "15212":{
            "author_id":"jollyfatman21",
            "author_name":"johnyonthespot",
            "content":"<div class=\"\"><div> <span>Looking down Ryan see the coach. Laughing Ryan picks up his size 13 socked foot and hovers it over the little man. Ryan slowly starts lowering it till the coah is pressed flat into his sock. laughing he picks his foot up only to let the coach turn over then smashes it down again with the coaches face pressed into the sock. Ryan leaves it there slowly suffacating the man. Then applying pressure finnishes the coach</span></div></div>",
            "created":1515374040,
            "id":2438090,
            "title":"Ryan settles his foot next to the coach"
        },
        "1522":{
            "choices":[
                "yeah he's dead. crushed under a big teen's sweaty barefeet",
                "he's not dead! but he certainly got a big wiff of those smelly feet!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Aww coach is dead noone cares. But wait! he's not really dead! hooray! or not?</span></div></span></div>",
            "created":1159160400,
            "id":348740,
            "title":"Coach Isnt Dead?"
        },
        "153":{
            "choices":[
                "Mike finds a hole in the bag",
                "Ryan picks up the bag and goes to his room"
            ],
            "content":"<div class=\"\"><div> <span>Mike is scared out of his mind as Ryan grabs in the bag for his shoes. The only good news is that Mike was no where near them so he is not found but after taking out the shoes Ryan zipped up the bag and starts to head home.<br>\r\nAfter a tough journey where he is shaken up and having to fight to stay out of Ryan's dirty socks and his jockstrap Ryan finally arrives at his house.  Ryan then drops his bag and if it was not for the coach's resistant to such pain he would have died.  Thinking it was time to get out of the bag Mike climbs to the zipper and tries to force it open but to no avail.  Giving up he slides down when...<br>\r\n</span></div></div>",
            "created":1175089260,
            "id":393453,
            "title":"Stuck in the towel boy's bag"
        },
        "1532":{
            "choices":[
                "He is going to help the coach",
                "payback time",
                "the perfect gift for the rest of the team"
            ],
            "content":"<div class=\"\"><div> <span>The bag is once again lifted off the floor where it is jostled for a while before being put on Ryan's bed.  Ryan opens the beg and starts to remove his clothes so that his mom can do them in the laundry.After he removes his jock strap and an pair of his dirty gym socks Ryan finds the shrunken Coach.  Gently picking him up to take a closer look Ryan smiles down at the coach.</span></div></div>",
            "created":1198519440,
            "id":479046,
            "title":"Ryan's room"
        },
        "15322":{
            "choices":[
                "\"In my shoe, as my insole.\"",
                "\"Down the back of my boxers, so I can sit on you.\""
            ],
            "content":"<div class=\"\"><div> <span>Ryan just stares at the coach and gets a big grin on his face. He has so many ideas on how to get his payback on this man.<br>\r\n\"Awesome\" Ryan says.<br>\r\n\"You put me down this instant.\"<br>\r\n\"Alright, put where to put you?\"</span></div></div>",
            "created":1287435180,
            "id":977253,
            "title":"payback time"
        },
        "153222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you really want to sit on him?</span></div></span></div>",
            "created":1515439440,
            "id":2438395,
            "title":"\"Down the back of my boxers, so I can sit o..."
        },
        "15323":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Meet with eight teammates at school",
                "Meet four teammates at a burger restaurant"
            ],
            "content":"<div class=\"\"><div> <span>Dawning in Ryan's mind is how much his teammates would love to see their coach under these drastically reduced circumstances.<br>\r\n<br>\r\nHe quickly finds an empty pickle jar, not bothering to rinse it, to transport the coach.<br>\r\n\"WAIT TIL THE GUYS SET EYES ON YOU!\"<br>\r\n<br>\r\nThat statement doesn't exactly feel the coach with confidence.</span></div></div>",
            "created":1263336000,
            "id":819386,
            "title":"Perfect Gift"
        }
    },
    "info":{
        "author_id":"brad3434",
        "author_name":"lazyboy",
        "brief_description":"A Coach shrinks in the lockerroom of his basketball team. to the size of 1/4 an inch tall.",
        "created":1099460580,
        "description":"<td align=\"left\" class=\"norm\">You're the trojan basketball teams coach Mike leer. Your team had just lost their first game and are all very pissed u go in the lockerroom before the team to get ready for a stern talking to and when u pick up a ring off the floor u shrink down to 1/4 an inch and totally helpless and at the mercy of the giant pissed jock comming in. <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n* no women this is a male only story-anything else goes have fun with it and write lots of chapters plz....</td>",
        "id":904824,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1515439440,
        "modified":1515439440,
        "pretty_title":"What the .........!?!?!?"
    }
}