{
    "chapters":{
        "1":{
            "author_id":"nick567456",
            "author_name":"Hybrid",
            "choices":[
                "Tanya Degurechaff ",
                "Visha",
                "Mary"
            ],
            "content":"<div class=\"\"><div> <span>Which character will experience some fattening.<br>\r\n<br>\r\nTanya Degurechaff:<br>\r\n-Age 9-13<br>\r\nTanya is the main protagonist of the series. Tanya was a middle aged Japanese salaryman who got in to a bit of a squabble with God or as she calls him Being X.  She is reincarnated as a little girl in an alternate history Germany and joins the army.  She is very small due to malnutrition.  Her favorite food is chocolate.</span></div></div>",
            "created":1589094000,
            "id":2833345,
            "title":"Character Selection "
        },
        "11":{
            "author_id":"nick567456",
            "author_name":"Hybrid",
            "choices":[
                "Captured by the enemy.",
                "Starts to hit puberty but instead of growing upwards she grows outwards."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Tanya be fattened up?</span></div></span></div>",
            "created":1589094120,
            "id":2833347,
            "title":"Tanya Degurechaff "
        },
        "112":{
            "author_id":"nick567456",
            "author_name":"Hybrid",
            "choices":[
                "Tanya wakes up the next morning ",
                "Tanya wakes up during the middle of the night hungry ",
                "Before Tanya is able to drift off to sleep, her stomach grumbles again!"
            ],
            "content":"<div class=\"\"><div> <span>Tanya von Degurechaff, the Devil of the Rhine, the White Sliver, one of the most fearsome mages of the Empire was in quite a dilemma. She had began to find herself abnormally hungry as of late. Food she used to be repulsed by looked tastier and tastier each day. Maybe she was finally beginning to grow a bit and her body needed nutrition for the lack of it during her childhood but it posed a issue for the young mage. While she knew it probably wasn't the best of ideas, and would probably have consequences later, Tanya decided to eat a bit into her secret chocolate stash. As Tanya stood up to make her way to her personal tent a little slip of paper fell behind her with the words \"Deus lo Vult\" on it. <br>\r\n<br>\r\nTanya entered her tent and lifted up her hasty made bed to reveal various types of chocolate. As Tanya looked at all the different types of chocolate laid out in front of her her mouth began to water and her stomach let out a growl of hunger.  Ever since being reincarnated as a little girl she had developed a bit of a sweet tooth and it was starting to really show. Tanya began to tear into all different types of chocolate as her hunger was at a all time high. Usually the small girl could only handle a few pieces of the rich sweets at a time but today it seemed different. Tanya sat down smiling on her bed with glee as she quickly devoured piece after piece. She was only a quarter of the way into her stash and her belly already felt stretched out. Her custom fitted uniform that already was a bit tight and her small frame, creaked as her belly slowly stretched out in front of her. Even though she was starting to feel full, Tanya had the strange urge to keep eating. This was something she didn't protest against.<br>\r\n<br>\r\nApproaching to halfway through her stash and some changes had began to become noticeable on the small girl. If someone her to view her at a side angle they would be able to see a stuffed belly sticking out about 2 inches. Tanya's uniform was looking tighter than ever especially around her belly. Her belt was starting to feel strained as her stuffed belly began to push into it. Tanya either was too lost in gluttony to notice these wardrobe malfunctions or either didn't care as she continued to shove delicious treats down her throat. But she was beginning to near her limit and finally began to slow down to a stop. After her feast she had begun to feel sleepy. She stood up and began to take her uniform off before she got into bed. Her belly was free to flop forward another inch as she unbuckled her belt. As she stripped down into her underwear it was plain to see the consequences of her stuffing. A taut belly was laid out in front of her and hung slightly over her panties. It was smooth and hard and showed her gluttony. A small amount of chocolate was located around her lips, another sign of her feast. As she clumsily makes her way to bed not being used to eating so much food she similes from ear to ear thinking about how she is proving Being X wrong about faith. She closes her eyes and drifts off to sleep peacefully with a full belly gurgling happily.<br>\r\n</span></div></div>",
            "created":1589096040,
            "id":2833349,
            "title":"Starts to hit puberty but instead of growing up..."
        },
        "1122":{
            "author_id":"nick567456",
            "author_name":"Hybrid",
            "choices":[
                "Head straight to the rations tent for breakfast.",
                "Discuss the frontline situation with her subordinates.",
                "hit her chocolate stash once again before leaving her tent."
            ],
            "content":"<div class=\"\"><div> <span>Tanya received a rude awakening in the middle of the night. Her stomach apparently not content with her feast hours earlier had begun to rumble with hunger. Tanya slowly got up wiping the sleep out her eyes and started to make her way to where rations were kept. She made sure to pick up another piece of chocolate on the way there. As she entered the food tent she was greeted by a wonderful surprise. Rations had been restocked recently and there seemed to be a bit of oversupply. Various potatoes and meats were laid out in front of her. The ever hungry girl took little time to begin digging into all the glorious food in front of her. <br>\r\n<br>\r\nForgetting her earlier feast, Tanya ate into her meal with newfound hunger. As she ate her belly which still was digesting some leftover chocolate began to push out in front of her once again. As high carb food was quickly shoved down her throat, Tanya could only eat with glee and pleasure as she satisfied her hunger. Her belly also stood in agreement with her as it churned along happily with being feed all sorts of things. Eventually Tanya began to slow down as that feeling of fullness settled in once again. She was stuffed beyond belief this time. Her belly stuck out like a sore thumb and was packed rock hard with various types of food. She slowly walked back to her tent holding her sore belly with both hands. She easily drifted back to sleep.<br>\r\n<br>\r\nTanya woke up the next morning feeling refreshed. She quickly got of bed and started to prepare herself for the day. However for Tanya things would be a bit different today. Her feasting did not come without its consequences. The usually lithe girl was looking noticeably softer. Looking at Tanya only on her underwear it was clear to see the damage down to her figure. Her nonexistent breasts had really nothing new to show. Her stomach which usually curved inwards had taken on a new look. It push forward a small bit with soft podge and rested on top of her panties. A soft and small ring of pudge had seemed to find it's way around Tanya's stomach. The biggest change however was Tanya's lower body. Her once flat butt had definitely gained a bit of \"ompff\" to it as it stuck out about two extra inches. Its once toned looked had been replaced by soft, jiggling pudge. Just walking caused a bounce that wasn't present before. Her thighs has also seen a bit of swelling. Nowhere near close to touching but steadily getting there. Little Tanya most certainly was showing the beginnings of a prominent pear-shape.<br>\r\n<br>\r\nAs Tanya began to put on her uniform she ran into some problems. While there wasn't much difficulty getting the top part on with the exception of her belt, her bottom half seemed more difficult. She let out a huffy as she pulled her tight pants past her swelled thighs and butt. She simply chalked up these wardrobe difficulties to her finally growing, which was true but not in the why she expected. So she began to head out of her tent coated in a new layer of pudge.<br>\r\n<br>\r\n</span></div></div>",
            "created":1589100660,
            "id":2833364,
            "title":"Tanya wakes up during the middle of the night h..."
        },
        "11221":{
            "author_id":"nick567456",
            "author_name":"Hybrid",
            "choices":[
                "Tanya once again goes to raid the ration tent.",
                "Tanya attempts to get a proper sleep schedule back in place and goes back to bed",
                "A week later of constant stuffing and Tanya is looking a bit different."
            ],
            "content":"<div class=\"\"><div> <span>Tanya was HUNGRY. Her stomach growled with ferocity as she quickly made her way to the tent. As she entered the tent delicious smells assaulted her nose and caused her hungry to go onto overdrive. She quickly made her way over to the food line and piled her plate high with various types of food.  The ravenous little girl quickly sat down and started to stuff her face full of treats.<br>\r\n<br>\r\nOther soldiers quickly saw the noticeable change in Tanya's appetite. Many dismissed it as the young girl was finally beginning to grow and left her to her own devices. It didn't take long for Tanya to finish her first plate of food and she quickly went back for seconds. As she dug into her second helping, Tanya's stuffed belly began to once again creep out in front of her. Tanya felt nowhere even close to being full as he continued to devour her hearty breakfast. As soldiers began to file out having finished there breakfast Tanya sat continuing to eat her full. After going back for thirds, Tanya finally was beginning to feel full. This hearty breakfast, however, would make the start of her day very interesting. The sheer amount of food packed into her stomach had caused her belt to be strained. Her belly stuck out a good 4 inches in front of her and was slightly peeking out from the bottom of her shirt. Tanya began to stumble out of the tent, happily giving her stuffed belly a loving rub as she made her way to HQ.<br>\r\n<br>\r\nTanya walked inside HQ, her stuffed belly sticking out in front of her. Many of her subordinates were surprised to see her in such a state but they were smart enough to not question their major. As everyone talked about the front line situation Tanya leaned up to see the table. Her stuffed belly brushed against it as she described today's plan. Planning process is always pretty boring so about an hour in Tanya was starting to feel a bit hungry. Luckily for her she had brought some spare chocolate and potatoes along. As the soldiers continued to discuss the situation, Tanya began to bite into her sweets. She began to smile as her belly filled up once again. Her belly began to push even more on her belt as it peeked further out beneath her shirt. Unfortunately for Tanya she should of saved her food throughout the entire discussion instead of eating it all at once. Another 2 hours into the planning and she was already hungry once again. She sat there squirming as her stomach let out groans of hunger. Finally the debate over supplies ended and she quickly got up and made her way back to the rations tent for lunch. The little girl's hunger was unmatched as she once again filled her plate high with all sorts of foods. Tanya quickly tore through her plate with blissful gluttony. After 3 and a half plates full of food the little girl leaned back in her chair, stuffed beyond belief. During her feast she had undone her belt so it now hung by her side. Her belly had grown to about 6 inches out in front of her. Her shirt only barely covered her belly button and a sliver of underbelly was clearly in view. As she stood up to head back to her tent she let out a small burp. If someone was to view Tanya currently right now she would look quite strange as her big belly stood out of place on her body. Tanya walked into her tent feeling very sleepy after her continuous stuffing throughout the day. She fell on to her bed and quickly passed out into a food coma.<br>\r\n<br>\r\nAfter a wonderful dream about chocolate Tanya wakes up later in the day. She curses herself for falling asleep during the middle of the day and gets up to grab her belt. Standing up it was even more noticeable to see the rapid changes undergoing Tanya's body. Her breasts still hadn't seemed affected by her feast but down below was a much different story. Tanya's belly now permanently peeked out from under her shirt with a soft layer of chub. Small love handles were starting to form around her waist and id nothing to help her wardrobe situation. The real issue laid below however. Tanya's hips had flared out with fat and her butt had pushed out behind her another 3 inches. Her thighs had began to creep ever closer to each other as they were started to be filled with fat. Her pants were feeling quite tight with all this extra weight and caused an uncomfortable situation for Tanya. She grumbled about it as she pulled her panties out of her inflated butt and rested a hand on her new belly. All that sleep had left her feeling quite hungry once again. </span></div></div>",
            "created":1589148540,
            "id":2833530,
            "title":"Head straight to the rations tent for breakfast."
        }
    },
    "info":{
        "author_id":"nick567456",
        "author_name":"Hybrid",
        "brief_description":"Fatten up all your favorite characters from the show/magna/light novel Youjo Senki!  ",
        "created":1589093880,
        "description":"<td align=\"left\" class=\"norm\">Watch as characters such as Tanya and Visha experience some interesting changes.<br>\r\n<br>\r\nRules:<br>\r\n-Sex scenes are allowed but be a bit mild about it.<br>\r\n-No instant weight gain<br>\r\n-No deaths<br>\r\n-Try to flesh out chapters beyond a couple of sentences.</td>",
        "id":2221582,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1589148540,
        "modified":1589148540,
        "pretty_title":"Youjo Senki Weight Gain"
    }
}