{
    "chapters":{
        "1":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Check the doors for a life you want."
            ],
            "content":"<div class=\"\"><div> <span>It is a seemingly normal day, as you go for a walk. You are Alex, a normal 16 year old boy. As you walk through the park, you feel a few droplets on your face and look up as it starts to rain. The rain picks up and becomes heavy quicky. You start to run so that you can find shelter. Looking around for anything, you see a cave nearby. Wanting to get out of the rain as soon as possible, you head into the cave. As you enter the cave, you walk in, and suddenly feel yourself start falling and suddenly black out.<br>\r\n<br>\r\nWhen you come to, you find that you are now in a strange hallway. You stand up, and notice that your clothe are dry. \"How long was I out?\" you ask yourself out loud. \"Actually, where am I?\" You look at the hallway and see that it seems to go on endlessly in both directions. \"Hello?\" you call out, but hear only your echo. You also see that there are many doors lining the walls of the hallway. \"Whats with all the doors?\" You look around and then notice something nearby on the ground. You see that it is a piece of paper and pick it up to find that it is a note. You look at it to see that it reads:<br>\r\n<br>\r\n\"Welcome to the Hallway of Lives! Beyond each door is the life of another person, and by stepping through it, you will have that person's life! And if you are unsatisfied with that life, you may return to this hall and choose a different one!<br>\r\n<br>\r\nRules:<br>\r\nWhen you enter a door, you will take on that life. Your body will remain unchanged physically, but you will be treated as the person whose life was labeled on the door.<br>\r\nWhile in that life, you will have everything that they have; clothes, possession, family, friends, and other stuff. Things such as clothes are adjusted as necessary.<br>\r\nIf you enter a door for the life of someone of the opposite gender, you will still be treated as the gender of that life despite not actually being that gender.<br>\r\nWhile you are in a life, you will aquire the skills necessary to live as that person.<br>\r\nEach door is labeled with information of the person whose life it leads to. Name, age, gender, as well as other information about the person.<br>\r\nWhile you are living a person's life, that person is in your life. They are unaware of the change, and will act like you.<br>\r\nOnce you go through, you must stay in that life for a minimum of 1 day before you may return to the hallway.<br>\r\nAfter the minimum time is up, you can leave at anytime you want.<br>\r\nYou have a key that is used to open the doors. When you want to leave your current life, you use the key in any door to return to the hallway. When you enter a door, it disappears, and it reappears when you want to use it. This is so you don't lose the key.<br>\r\nYou can't become famous people. Sorry.<br>\r\n<br>\r\nNow enjoy yourself in the life of another!\"<br>\r\n<br>\r\n\"'Hallway of Lives?' Take the life of whoever's door you walk through?\" you say out loud. You think it sounds crazy, but it also sounds interesting. \"Guess I'll give it a try. I've got nothing to lose.\"</span></div></div>",
            "created":1265950800,
            "id":834965,
            "title":"Enter the Hallway"
        },
        "11":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Enter Christina Robins's door",
                "Enter Mike Walker's door",
                "Enter Jenny Miller's door",
                "Enter Paul Samuels's door",
                "Choose a different door"
            ],
            "content":"<div class=\"\"><div> <span>You start walking down the hall, looking at the labels on the doors for a life you might be interested in.<br>\r\n<br>\r\nChristina Robins<br>\r\n17<br>\r\nFemale<br>\r\nHigh School Student<br>\r\n<br>\r\nMike Walker<br>\r\n18<br>\r\nMale<br>\r\nHigh School Student<br>\r\n<br>\r\nJenny Miller<br>\r\n9<br>\r\nFemale<br>\r\nElementart School Student<br>\r\n<br>\r\nPaul Samuels<br>\r\n14<br>\r\nMale<br>\r\nMiddle School Student</span></div></div>",
            "created":1265950800,
            "id":834971,
            "title":"Check the doors for a life you want."
        },
        "111":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Its Christina's mom telling you its almost time to leave for school",
                "Its one of Christina's friend's here to hang out with you.",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span>You always had been a bit curious about wearing girl's clothes, so what better way to wear them than by having a girl's life? You take out the key like the instructions said and unlocked the door. As you opened it, you saw a girl's room.<br>\r\n<br>\r\nAs you stepped through, you noticed things quickly changed. You were no longer standing up, and were now lying in a bed. You sat up and took notice of your surroundings. It looked like a typical teenage girl's room. You then looked down at yourself and saw that you were also now wearing a girl's nightgown. \"Guess it worked afterall.\" you comment to yourself. You stand up and inspect the room, and one of the first things you notice is a few pictures on your dresser. One is of you with two other girls, and another is a family picture that shows you with who you assume to be your parents, and a younger brother. In both of them you are wearing typical clothes that would be found on a girl, yet no one seemed to find it odd. \"Looks like I'm Christina Robins now.\"<br>\r\n<br>\r\nDeciding to get dressed, you look in the dresser. The first drawer you open has several bras. You pull one out and see that it seems to be meant for a really flat-chested girl. You keep the bra and move on to the next drawer and pick out a pair of panties. Shortly after, you pick out a blouse and skirt and other items of clothing. After a few minutes, you are now dressed in your chosen attire. You look at yourself in a mirror and see what you look like dressed like this. You think you look a bit strange, but like what you're wearing. You then see some makeup nearby and decide to use some. You find that you seem to know how to use all of it as you start applying it, despite never having used any before.<br>\r\n<br>\r\nShortly after your done, you hear a knock at the door.<br>\r\n<br>\r\n</span></div></div>",
            "created":1265950800,
            "id":834989,
            "title":"Enter Christina Robins's door"
        },
        "1111":{
            "author_id":"sweet_candy",
            "author_name":"Ashley",
            "choices":[
                "Alot of make-up and girls stuff...",
                "Your books,and alot of pictures of you and two girls,they must be your friends."
            ],
            "content":"<div class=\"\"><div> <span>You say \"Yes ? \". \"Christina honey its almost time to leave for school, are you ready ? \" Your mom said.\"What?!\"You said that and jumped out of your bed. \"Oh,Mother?\" You said. \"Yes sweetheart ? \" Your Mother said. \"I'm not ready yet,I swear I will finish fast.\" You said that and ran to the bathroom and quickly wash your face and brush your teeth,and this time you didn't care whatever the water is icy cold or not.<br>\r\nYou got out of the bathroom and wear your school uniform quickly,then you stopped for a second and took a very deep breathe and look at the digital clock on your desk,it was 8:30 so you still had another 30 mintues but you didn't want to waste on exploring things that you can do it later,so you put some eyeline and missed a little bit when you put the lip gloss but you did it right in the second try.<br>\r\nYou finally got out of your room,and you saw your mother cleaning up the floor,\"Oh thanks good you got out of your room now go and eat your breakfast,and oh you missed the bus and you should walk to school by your self.\" Your mom said to you. \"Shit!\" , You said.<br>\r\nYou went to the kitchen and you saw a little boy who seems to be only 4 years,he had a blonde curly hair,when he saw you coming to the kitchenhe got off his chair and ran to you and hug you\"Christinaaaa ! \".\"Oh how sweet\" you said to your self.\"Good morning lil bro\".You said to him.<br>\r\nThen you smelled a nice smell,you walked toward the dining table and take a seat and your breakfast was eggs and toast,and a hot chocolate,the breakfast was so tasty,you take a look at your watch and its 8:54 \"oh I better harry up !\".<br>\r\nYou got out of the house and ran very fast to your school,it's located near you house so you just arrived in 15 mintues,when you saw the school \"Wow! , I've always wanted to be in a private school,when you entered the school you notice that no one is there so you ran to the class,first you opened your locker to see what in it and you found ...</span></div></div>",
            "created":1268715600,
            "id":851895,
            "title":"Your mom knocked the door..."
        },
        "1112":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "The mall",
                "The beach",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Its me, Nicole.\" the person says before coming in. You recognize her as one of the two girls from the picture. She looks over at you, and despite your appearance, she doesn't seem to find the sight of a boy dressed in girl's clothes strange. \"Hey Christina. Came by to see if you wanted to hang out today.\"<br>\r\n<br>\r\n\"Sure.\" you reply, interested in what a day in the life of a teenage girl woulfd be like. After all, you had the lfe of one for at least the rest of the day, so you might as well have fun. \"Where do you want to go?\"</span></div></div>",
            "created":1266037200,
            "id":835399,
            "title":"Its one of Christina's friend's here to hang out"
        },
        "11122":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "You just sit and talk with Nicole for now",
                "You two get hit on by a couple of guys"
            ],
            "content":"<div class=\"\"><div> <span>\"Its pretty hot today, so I was thinking we could head to the beach.\" Nicole suggests.<br>\r\n<br>\r\n\"Sounds great. Just lets me find something to wear.\" you reply. After a minute of looking, you find a blue two piece swimsuit. You then slip on a pair of sandals. \"Alright, lets get going.\"<br>\r\n<br>\r\n\"Great.\" You head downstairs and tell \"your mom\" that you heading to the beach with Nicole. The two of you then head out of your house and get on a bus to the beach.<br>\r\n<br>\r\nHalf an hour later, the two of you arrive at the beach. You get undressed and slip into the swimsuit you brought with you. As you step out of the changing room, you notice a few guys checking you out. \"This feels really wierd.\"' you think to yourself. You know you would normally a boy like you wearing a girl's swimsuit would rediculous dressed like this, yet as far as anyone else knows, you're just a normal teenage girl.<br>\r\n<br>\r\nYou head on to the beach with Nicole, and the two of you set up a spot to sit.</span></div></div>",
            "created":1266037200,
            "id":835455,
            "title":"The beach"
        },
        "111222":{
            "author_id":"damaho1",
            "author_name":"Mr. Scratch",
            "choices":[
                "play along.",
                "send them away."
            ],
            "content":"<div class=\"\"><div> <span>The two of you just lay there on your towles and talked about some girl stuff. You had to admit you really enjoyed that kind of talk and were very surprised you knew everything you had to know for this.<br>\r\n<br>\r\nYou enjoyed the feeling of the swimsuit against your body as well. You were really surprised how much fun you had!<br>\r\n<br>\r\nSuddenly there were two shadows blocking the sun. You looked up to see two well-built guys looking down at you two. \"Hey ladies, want us to help put on sunscreme?\", one of the two boys said. You realised the two were hitting on you two. You decided to...</span></div></div>",
            "created":1267678800,
            "id":845974,
            "title":"You two get hit on by a couple of guys"
        },
        "1112221":{
            "author_id":"writ_anom",
            "author_name":"Anom",
            "choices":[
                "Agree to go the party, it's just a little fun",
                "Tell them that you have boyfriends "
            ],
            "content":"<div class=\"\"><div> <span>You thought this was quite funny, these guys honastly were attracted to a teenage boy dressed in a bikini. You decided to play along and asked one of the guys to put some more sun cream on your back, your friend also asked the other boy to do the same. The boys sat down beside you and your friend and star applying the sun cream, the boys are being so gentle and it starts to feel good after, a while the boys started to flirt with you.<br>\r\n'So what brings you fine ladies down to our side of the beach?' Said the larger of the guys with black hair.<br>\r\n'Oh nothing, just thought we'd catch some rays while we get a chance' You repliled while trying to show off your body. You see one of the boys notice your movements and smile at you.<br>\r\n'You girls are gonna look evan hotter once you catch this tan' Laughed the other boy. You blush and the boy sees you doing so 'You know we're having a party later tonight why don't you girls come along we'll make sure you'll fit right in.' You and your friend look at each other, your friend then asks<br>\r\n'I don't know Christina what do you think we should do?'<br>\r\n</span></div></div>",
            "created":1291870800,
            "id":1011376,
            "title":"play along."
        },
        "112":{
            "author_id":"arclight",
            "author_name":"Pass me some dank fetish memes",
            "choices":[
                "The club leaders of the clubs she joined",
                "Franklin Phillips'es relatives",
                "To the security room at the school"
            ],
            "content":"<div class=\"\"><div> <span>Your name was walker, mike walker. Part-time student at Olympia high school, full-time detective.<br>\r\nAt the age of 16, you began solving crimes and such. But you weren't 16, you were 18. Around this age, most teens would be interested in leaving school, leaving their parents, going to college. But you weren't most kids. You were more interested I solving your most recent case... Who killed Faidara Joestar?<br>\r\n<br>\r\nFrom what you knew about her while she was alive, she was a foreign exchange student from Britain. Her parents were a mixed couple of Japanese and British. She wasn't doing particularly well in school, she often complained to you about her C average at school. She also was involved in about 5 school clubs (which could explain the C average). You begin to suspect that she may have made some enemies whilst at these social clubs.<br>\r\n<br>\r\nWhen the body was found, you were one of the first at the scene of the crime. \"Was this how she was found, chief?\" You ask the chief of police. (We didn't move her whatsoever, this is how she was found\" he replied. The good news was that they didn't alter the body in any way, shape, or form. (According to the chief anyways) but the bad news was that the body was laying on its side, so you will have to move it to investigate the wound. You get permission from the chief to investigate the body and have at it.<br>\r\n<br>\r\nYou turn the former Joestar on her back and life her shirt to examine the wound. \"It appears to be a cut mark\" you shout to the chief. You begin to measure the length of the cut. Somehow, it was deep enough to nearly cut through the other side of the body. You inspect the body a little more and find something odd. It appeared to be a happy face on half of it, and a sad face on the other half of it. \"This could possibly be a serial killer we are dealing with here\". You know that serial killers often leave a mark, and this one looks awfully familiar. You finish up looking at the body and head over to your Intel department (aka, your room). <br>\r\n<br>\r\n\"Welcome home, master walker\" your butler Jeevs says to you as you walk in. \"Thank you Jeevs, speaking of which, could you get my case file out from the various serial killings in the area?\" You ask.<br>\r\n\"The big binder?\" He asks back. You sadly reply with \"yes\". He comes back after a few minutes with it and you begin to look through it to find an similar symbol. After about an hour and 4 glasses of tea, you find the appropriate symbol. It belonged to a Franklin Phillips. You brought him in and he was executed though. This was a little strange because the case wasn't particularly popular. It barely got any coverage. That would mean it would have to be someone close to the case to know his symbol. Now that you are equipped with this newfound knowledge, you set out to speak with...</span></div></div>",
            "created":1463288400,
            "id":2148373,
            "title":"Enter Mike Walker's door"
        },
        "113":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "School.",
                "You friend's party",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You thought that it might be a bit interesting to try this one. You take out the key like the instructions said and unlocked the door. As you opened it, you saw a little girl's room.<br>\r\n<br>\r\nAs you stepped through, you noticed things quickly changed. You were no longer standing up, and were now lying in a bed. You sat up and took notice of your surroundings. It looked like a typical little girl's room. There were dolls and other stuff lining the room. You looked down at yourself and saw that you were wearing a nightgown.<br>\r\n<br>\r\nShortly after you get up, the door opens and a woman who you assume is your mother walks in. \"Good morning Jenny. Did my little girl sleep well?\" she asks.<br>\r\n<br>\r\n\"Yes mommy.\" you say sweatly, playing the part of a young girl.<br>\r\n<br>\r\n\"Thats good. Now you should hurry up and get dressed for...\"</span></div></div>",
            "created":1265950800,
            "id":835010,
            "title":"Enter Jenny Miller's door"
        },
        "1132":{
            "choices":[
                "Max answers \"yes\"",
                "Max answers \"no\"",
                "Max bursts out laughing"
            ],
            "content":"<div class=\"\"><div> <span>\"That's good. Now you should hurry up and get dressed for your friend's birthday party.\" <br>\r\n<br>\r\n\"Okay, Mommy,\" you say as you pull the pink floral curtains off of your small body and run over to your closet. You grab a small, pink dress and change into it. After putting the dress on, you eat your favorite cereal: <i>Trix.</i> Then you hop into your mother's blue Mercedes and your mother pulls out of the driveway. Five minutes later, you pull into your friend, Halo's house. You eagerly hop out of the car and ran over to Halo's door, pressing the doorbell repeatedly until someone answers. <br>\r\n<br>\r\nFinally, the door opens, revealing a blonde-haired little girl with blue eyes. <br>\r\n<br>\r\n\"Jenny!\" Halo exclaims as she hugs you. <br>\r\n<br>\r\nYou hug her back. \"Happy birthday, Halo.\"<br>\r\n<br>\r\n\"Thanks!\" she says as she lets go of you. \"Now, come on!\" She pulls you into her house. The party was outside in the backyard. The yard was filled with fourth to fifth graders laughing and talking with each other. You see a cute boy. He is about your age. He has full head of brown hair and big, green eyes. <br>\r\n<br>\r\nYour heart starts to beat. \"Who's that boy?\" you ask Halo as you point to the boy.<br>\r\n<br>\r\n\"That's Max,\" Halo told you. \"He's new to our school. You like him?\"<br>\r\n<br>\r\nYou don't answer. You just continue to gaze at him. <br>\r\n<br>\r\n\"Come on,\" Halo says as she grabs your arm. \"Let's go talk to him.\"<br>\r\n<br>\r\nYour heart starts to beat fast as your best friend drags you over to the boy. <br>\r\n<br>\r\n\"Hey, Max,\" Halo says to the boy. \"My friend says she likes you. Do you like her back?\" </span></div></div>",
            "created":1411534800,
            "id":1861338,
            "title":"You friend's party"
        },
        "115":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Enter Nacy Park's door",
                "Enter Jack Henderson",
                "Choose a different door"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You walk past those and keep looking for a door that interests you.<br>\r\n<br>\r\n<br>\r\nNancy Park<br>\r\n29<br>\r\nFemale<br>\r\nMother<br>\r\n<br>\r\nJack Henderson<br>\r\n30<br>\r\nMale<br>\r\n</span></div></span></div>",
            "created":1265950800,
            "id":834973,
            "title":"Choose a different door"
        },
        "1151":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "that is where Nancy keeps her valuables",
                "that Nancy's husband's ashes are in the vase",
                "that it is empty"
            ],
            "content":"<div class=\"\"><div> <span>You step through Nancy Park's door and black out.<br>\r\n<br>\r\nWhen you open your eyes you find yourself laying in bed. Sitting up you look down and see that you are wearing a pair of womens pyjamas. You then stand up and walk over to the dresser where you find a large lidded vase and a bunch of pictures. The pictures are mostly of you, wearing women's clothes, along side a happy young man and two children, one boy &amp; one girl. Lifting the lid of the vase you discover...</span></div></div>",
            "created":1266037200,
            "id":835773,
            "title":"Enter Nacy Park's door"
        },
        "11512":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "you find the girl's room ",
                "you find the boy's room"
            ],
            "content":"<div class=\"\"><div> <span>there are ashes in the vase.Someone died and was cremated.You can't believe this is for real.You don't really want to live the life of a female but you do want to experience the freedom of being an adult.You feel silly dressed in a ladies pjs.You wonder who died.If it was Mrs.Park's husband.It is sad that such a young guy who had a wife and two kids is gone but it would make things easier for you.You don't want to be going to bed with some guy.You decide to go check on the children to see what it is like to be a mom.</span></div></div>",
            "created":1266728400,
            "id":840241,
            "title":"that Nancy's husband's ashes are in the..."
        },
        "1152":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Search the internet",
                "Finish his sentence",
                "Go up to find Jack's mum"
            ],
            "content":"<div class=\"\"><div> <span>Alex wrenches open the door immediately, then there is a rushing darkness that expands and constricts as Alex blacks out. When she came too, he heard a voice. \"JACKSON WILDER HENDERSON,\" booms the voice that sounded annoyed and angry, he stands up and wibbles. He is in a basement situated within an enclosed space. It looked as if Jack was staying with his mum. <br>\r\n<br>\r\n\"Yes mother~\" A computer desk littered with various porn magazines and video games litter the surface, and it looked like Jack had a lonely existance... You glance at the screen Jack was in the middle of write an advertistment about himself on a dating website, but stopped in mid-sentence.</span></div></div>",
            "created":1268542800,
            "id":851160,
            "title":"Enter Jack Henderson"
        },
        "1153":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Enter Kelly Kelly Daniels's door",
                "Enter James White's door",
                "Choose a different door"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You keep walking<br>\r\n<br>\r\nKelly Daniels<br>\r\n17<br>\r\nHigh School Student. Cheerleader.<br>\r\n<br>\r\nJames White<br>\r\n18<br>\r\nHigh School Student. Football Player</span></div></span></div>",
            "created":1265950800,
            "id":834974,
            "title":"Choose a different door"
        },
        "11531":{
            "choices":[
                "Yes",
                "Nah, stick with Kelly"
            ],
            "content":"<div class=\"\"><div> <span>You're about to open Kelly's door, when another catches your eye. The label on the door reads:<br>\r\n<br>\r\nJean Christofferson<br>\r\n72<br>\r\nFemale.<br>\r\nGrandmother.<br>\r\n<br>\r\n\"Hey, wait!\" You exclaim. \"That's my grandma's door!\" <br>\r\n<br>\r\nIt would be interesting to see what life is like for an older person, and your grandma was supposed to visit your family today, so you could see if your parents were oblivious to the switch.<br>\r\n<br>\r\nDo you enter your grandmother's door?</span></div></div>",
            "created":1464498000,
            "id":2155835,
            "title":"Enter Kelly Kelly Daniels's door"
        },
        "115311":{
            "choices":[
                "You're welcomed by your family",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You open the door and, looking through it, you see your grandmother sitting on her sofa and reading a book. She doesn't seem to notice you, so you take a deep breath and walk through her door.<br>\r\n<br>\r\nSuddenly, you're sitting on your grandmother's couch, holding her book in one hand and the key in another. You notice that you're wearing your grandmother's burgundy nail polish, and, in your haste to examine it, you drop the key. It lands on the floor, and when you bend over to pick it up, you feel a painful ache in your back. \"Guess that I've got Grandma's aches and pains...\" you mutter, sitting back up. You also realize that you can't hear the wind outside, even though your grandma's window is open and the plants are swaying. \"...along with a few other things.\" You're not too worried about your new medical conditions; after all, you can swap back tomorrow.<br>\r\n<br>\r\n\"Better get grandma's-no, wait. 'My' cane.\" You chuckle as you stand up and walk over to a full-length mirror to see what you're wearing. You have on a white blouse with a pair of khaki pants, along with brown moccasins. Your ears are pierced, and your hair is cut short like your grandma's. You're wearing red lipstick, and the rest of your makeup looks light by comparison. You smile in front of the mirror. \"This key opens so many possibilities...\" you say. While you're thinking about the hallway, your landline starts ringing.<br>\r\n<br>\r\nYour mother ('My \"daughter,\"' you think to yourself) is on the other end. \"Hi Mom!\" she says excitedly. \"How are you doing?\" After chuckling at the irony of this situation, you reply \"I'm doing great, sweetheart! I can't wait for our get-together!\" Your grandma impersonation is pretty good, and your 'daughter' buys it. \"Remember to get here by 2, because we'll have lunch prepared by then,\" she says. \"See you there!\" You say goodbye and hang up. It's 1:30, so you figure that if you leave now, you'll get to your house by 2.<br>\r\n<br>\r\nYou grab your purse, and get into your grandmother's car. You find that you now know how to drive. \"There are a few perks of being Grandma,\" you say with a chuckle.<br>\r\n<br>\r\nAfter a long drive, you reach your house, where...</span></div></div>",
            "created":1464584400,
            "id":2155935,
            "title":"Yes"
        },
        "115312":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "She was nice",
                "She was mean"
            ],
            "content":"<div class=\"\"><div> <span>After that pointless and forced choice you decided to stuck with what you had already chosen: being part of the cheerleading team. You thought on how nice would be to be in the changing rooms watching all those girls in their underwear, and with the explanation of how does this hallway works you would not be noticed at all.<br>\r\nAs soon as you crossed the door, your clothes switched into a somewhat skimpy cheerleader uniform, with pom poms, kneesocks and sneakers included. And you were in middle of the field surrounded by other girls with the exact same outfit. It did look like the session has gone for like 21 minutes. But  you were not doing well, and by you I meant the entire squad.<br>\r\nThe leader of the team, a 7ft tall girl known as Marisa Sofia was going to do a speech about it</span></div></div>",
            "created":1486530000,
            "id":2275059,
            "title":"Nah, stick with Kelly"
        },
        "11532":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Go ahead with James White",
                "Try his own door"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're about to enter The door of the football player when he saw his own door...</span></div></span></div>",
            "created":1369026000,
            "id":1593717,
            "title":"Enter James White's door"
        },
        "115321":{
            "choices":[
                "Come up with what happens next"
            ],
            "content":"<div class=\"\"><div> <span>The first thing you see when you enter the football player's door is a football field filled with...well, football players. A guy named Chase, who is your best friend walks over to you. <br>\r\n<br>\r\n\"Dude, why you standin' there for? We're in the middle of a game!\" <br>\r\n<br>\r\nBefore you could respond, a football hit you in the head, which caused you to fall to the floor. <br>\r\n<br>\r\n\"Man, dude! Are you okay?\" <br>\r\n<br>\r\nYou get up and say, \"I'm fine.\" But, your head hurts so bad, it felt like it was bleeding. <br>\r\n<br>\r\nChase reached over to feel your head, picking up blood from it. <br>\r\n<br>\r\n\"Oh, man! You're bleeding! Come on, man. I'm taking you to the nurse.\" And with that, Chase grabbed your arm and pulled you out of the football field and into the school. <br>\r\n<br>\r\n<i>{This is gonna be a long day,/i} you thought to yourself.<br>\r\n<br>\r\n</i></span></div></div>",
            "created":1412226000,
            "id":1865645,
            "title":"Go ahead with James White"
        },
        "115322":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Your Younger Sister",
                "Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>You back away From James, and decide to try your own door.<br>\r\n<br>\r\nWhen you try to open it though, you find it oddly locked.<br>\r\n<br>\r\n\"That's weird, why would it be locked?\"<br>\r\n<br>\r\nYou decide against going through a random door, curious why your own door would be locked,you decide to find a door of somebody that lived nearby or something so you could find yourself.<br>\r\n<br>\r\nSuddenly a thought hits you, maybe somebody else used the hallway, and they're in your life.<br>\r\n<br>\r\nYou quickly search through the hallway trying to find a name you recognize when finally you find</span></div></div>",
            "created":1369026000,
            "id":1593730,
            "title":"Try his own door"
        },
        "1153221":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "In Megan's life",
                "Alternate route"
            ],
            "content":"<div class=\"\"><div> <span>After several minutes of searching, you finally find a door with a name you recognize, it's your sister<br>\r\n<br>\r\nMegan<br>\r\n11<br>\r\nFemale<br>\r\nMiddle School Student.<br>\r\n<br>\r\nYou sigh, \"I guess I have to, its the only way back that's close to myself\"<br>\r\n<br>\r\nWith that you open the door and walk in. Suddenly you're somewhere else</span></div></div>",
            "created":1369026000,
            "id":1593756,
            "title":"Your Younger Sister"
        },
        "11532211":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Continue",
                "Alternate route"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly your back in your house, sitting at the table apparently eating breakfast since theres a bowl of Cereal in front of you, you check yourself out.<br>\r\n<br>\r\nYou recognize the Yellow Pajamas Megan always wears only now they seem larger to fit your body, also your nails are painted pink, and you have a few hairbands around your wrist.<br>\r\n<br>\r\nYou're about to get up and look for your brother aka yourself when you here footsteps coming from your real bedroom.<br>\r\n<br>\r\nThe Person that turns the corner is wearing one of your shirts and your jeans, but is definitely not you, It's a girl, about your age maybe a bit older, she had long curly blond hair.<br>\r\n<br>\r\nShe starts \"Good Morn-\" she pauses when she gets a look at you \"You must've used the Hallway\"<br>\r\n<br>\r\n\"What? How did you know?\" You ask confused.<br>\r\n<br>\r\n\"Because I can see the real you, you're dressed like a young girl, but you're definitely not, You can see I'm not the real person in this life too right?\"<br>\r\n<br>\r\n\"Yeah... In fact It's my life your in. I wondered why my own door was locked so I went into my Sister's door and here we are.\"<br>\r\n<br>\r\n\"Oh cool, So this is your first time in another life? I've been doing it for years, but I've never met up with another Hallway User, Since its Saturday and we don't have school how about we hang out together\"<br>\r\n<br>\r\n\"Alright sure, since I'm stuck as Megan for the whole day anyways, I could probably use some help being a girl.\" you reply not excited about the prospect of spending a whole 24 hours as your 11 year old sister.<br>\r\n<br>\r\n\"Sounds good, The names Samantha, though you should call me Alex to make things look normal.\"<br>\r\n<br>\r\n\"Agreed, My name's Alex which you know, but call my Megan I guess.</span></div></div>",
            "created":1369026000,
            "id":1593781,
            "title":"In Megan's life"
        },
        "115322111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Later",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As you and 'Alex/Samantha' eat breakfast your parents join you.<br>\r\n<br>\r\nIt's weird being treated like their little girl but you do your best to act accordingly. After breakfast you head Megan's bedroom and look through your choices for clothing.<br>\r\n<br>\r\nA minute or two later <b><i>Alex</i></b> comes in and checks on you, you can tell she's used to being in different lives, she's dressed like you normally do, obviously not wearing a bra, but seems used to it.<br>\r\n<br>\r\nShe looks through your outfit choices you've picked out.<br>\r\n<br>\r\n\"Nonono, its your first time being a girl, and if you continue using the hallway, you'll probably be a girl often enough.\"<br>\r\n<br>\r\n\"I doubt it\" you interupt <br>\r\n<br>\r\n\"trust me, having the option to be anyone you want, it soon gets boring being the people similar to you, its fun being something different, I once spent a day as an Infant, But as I was saying, its your first time being a girl, you need the full experience, no jeans\" she says picking up the pants and jeans you'd picked out. \"you're wearing a skirt today. This one should be good\" <b><i>Alex</i></b> says handing me a knee length <a class=\"duLink\" rel=\"nofollow\" href=\"http://www.polyvore.com/cgi/img-thing?.out=jpg&amp;size=l&amp;tid=13423033\">skirt</a>  <a title=\"New Window\" href=\"http://www.polyvore.com/cgi/img-thing?.out=jpg&amp;size=l&amp;tid=13423033\" rel=\"nofollow\" target=\"_blank\"><img style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a><br>\r\n<br>\r\n\"and a pair of panties, I know its probably a bit weird wearing panties, You're also going to need one of these\" she says handing you a pair of panties and a <a class=\"duLink\" rel=\"nofollow\" href=\"http://images.sodahead.com/polls/001099869/6621322_xlarge.jpeg\">training bra</a>  <a title=\"New Window\" href=\"http://images.sodahead.com/polls/001099869/6621322_xlarge.jpeg\" rel=\"nofollow\" target=\"_blank\"><img style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a><br>\r\n<br>\r\nYou look at the training bra, embarrassed \"do I really have to wear one of these?\"<br>\r\n<br>\r\n\"of course, you have to dress just like your sister, so you have to wear one, and here's a cute top to wear over it, now hurry up and get changed, then I'll drive us into town, since your a bit too young to drive.<br>\r\n<br>\r\nYou sigh and agree. quickly putting it all one</span></div></div>",
            "created":1369026000,
            "id":1593832,
            "title":"Continue"
        },
        "1153221111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Alex chooses some clothes for you",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Alex drives the two of you to the mall, as you get out you feel really self conscious, from your point of you you're a 16 year old guy dressed like an 11 year old girl, though you know to everyone else, you look just like your sister.<br>\r\n<br>\r\nyou awkwardly walk kind of behind Alex using him as a shield to hide behind, you keep tugging at your skirt.<br>\r\n<br>\r\n\"You know by hiding behind me like that, you actually look even more like a shy little girl.\" Alex tells you<br>\r\n<br>\r\n\"Well I'm embarrassed, I've never worn a skirt before, and I've definitely never been an 11 year old girl before its a bit embarrassing.<br>\r\n<br>\r\n\"Tell you what, tomorrow, we'll both go to the Hallway, I'll show you some of the coolest lives I've found over the years. I've even been a porn star once if you want to check that out.<br>\r\n<br>\r\n\"sounds like fun, I don't thing I want to be a porn star though. Do I have to be a girl?\"<br>\r\n<br>\r\n\"I think you should, but I won't make you be one, maybe after spending today as a girl, you'll never want to go back to being a boy.\"<br>\r\n<br>\r\n\"Ha, I doubt that.\" You laugh<br>\r\n<br>\r\n\"Ah, here we are\" Alex said, as she had lead you to Rows of Girls clothing stores. \"You're gonna try on clothes I pick our for you.\"<br>\r\n<br>\r\n\"What no way, You already got me wearing a skirt and a training bra, I'm not gonna wear anything else unless they're pants.\"<br>\r\n<br>\r\n\"Have it your way, I guess I'll go try on clothes\" Alex says as she begins walking towards one of the stores. \"I wonder what dress size your body is?\"<br>\r\n<br>\r\n\"Wait!\" You cry out, \"fine I'll model some clothes if you promise not to do anything like that.<br>\r\n<br>\r\n\"Deal\"</span></div></div>",
            "created":1369112400,
            "id":1594109,
            "title":"Later"
        },
        "11533":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "Jasmine Daniels",
                "Alex Thomson"
            ],
            "content":"<div class=\"\"><div> <span>After searching, you narrowed it down to two doors.<br>\r\n<br>\r\nJasmine Daniels<br>\r\n32<br>\r\nOffice worker<br>\r\n<br>\r\nAlex Thomson<br>\r\n16<br>\r\nHigh School Student<br>\r\n<br>\r\nYou were relieved to know that you could return to your normal life whenever you wanted...unless somebody else got there first.<br>\r\n<br>\r\nYou made a decision...</span></div></div>",
            "created":1267592400,
            "id":845528,
            "title":"Choose a different door"
        },
        "115331":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "you get a call from Jasmine's son Raymond's school,she is a single mother ",
                "you run into Mark, the married man Jasmine is having an affair with"
            ],
            "content":"<div class=\"\"><div> <span>You were curious about living the life of not only an adult and a female but also a black person which 32 year old Jasmine Daniels is.You open her door and enter the room.You find yourself standing outside an office building.You are dressed in a skirt and high heel shoes and there is a lit cigarette in your hand.You are accompanied by an overweight hispanic woman who is smoking.You somehow know her name is Maria.She is your friend and you work together.You think it is a gross habit so you throw the cigarette away.\"What's wrong, Jassy?\"she asks.\"I quit smoking.\"you say.Maria looks at you then drops her cigarette on the ground.She steps on it and says\"Ok.I quit too.\"The two of you go into the building and take the elevator up to the floor where you work.</span></div></div>",
            "created":1268542800,
            "id":851003,
            "title":"Jasmine Daniels"
        },
        "115332":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "You find a middle-aged man in your mother's clothes",
                "You find a teenage girl in your mother's clothes"
            ],
            "content":"<div class=\"\"><div> <span>You take out the key like the instructions said. If it worked, perhaps you could come back another time. You open the door to find your own room.<br>\r\n<br>\r\nAs soon as you enter, you find yourself in bed. Was it all a dream, maybe?<br>\r\n<br>\r\nYou get up and go to the kitchen to get breakfast. Your mother is there. At least, the person in your mother's clothes should be your mother. But as you can plainly see, it's someone else.</span></div></div>",
            "created":1267592400,
            "id":845534,
            "title":"Enter your own door"
        },
        "1153321":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "You recognized me. How?",
                "Alex, what are you talking about? I am your mom."
            ],
            "content":"<div class=\"\"><div> <span>You look closely at the man occupying your mother's clothes.<br>\r\n<br>\r\nIt's definitely a guy. He's wearing feminine pajamas that are, oddly enough, a perfect fit for him. You can even see him wearing a bra, despite his lack of boobs. He's even got morning wood.<br>\r\n<br>\r\nYou now see that you are not alone in your discovery of the Hallway of Lives.<br>\r\n<br>\r\n\"Who are you and what have you done with my mom?\", you ask him.<br>\r\n<br>\r\nHe replies...</span></div></div>",
            "created":1267592400,
            "id":845548,
            "title":"You find a middle-aged man in your mother's..."
        },
        "11533211":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Cindy, upset",
                "Cindy, checking in"
            ],
            "content":"<div class=\"\"><div> <span>'Well you are a 50 year old man in my mother's night gown. What's not to notice?\" Alex asked as the man grabbed a matching robe and walked out of his new bedroom. His new husband was left snoring in bed. As he walked his new silky gown flowed behind him. \"Where the hell is my mom?\" Alex began to shout.<br>\r\n<br>\r\nThe man quickly grabbed him and guided him away from the bedroom doors and down the stairs. \"Shhh kid, I am your mom. Cindy Carmichael for the time being, ok?\" He quietly asked. The man pulled at his new nylon panties under his gown and smiled at Alex. \"You look unhappy. Let me explain, see your mother and I entered into a wager at work. You see I used to be Edward Thomson or Big Ed as the called me. I was the janitor at your mothers office. We met causally last night while she was working late and discussed the issues with our lives. Each problem sounded solvable to the other so we decided to swap lives.\" Edward said sitting down in a very unlady like manner. \"I don't understand how you are able to see me as a man. To everyone else I look like your mother.\"<br>\r\n<br>\r\nAlex was in shock about all this. \"How long is this going to last? I can't have you as my mom?!\" He started to yell.<br>\r\n<br>\r\n\"It's only until the problems are solved kid. For now, you are stuck with me.\" He said turning on the kitchen lights. \"Now, what would you like mama to make for breakfast?\"<br>\r\n<br>\r\nFrom out of nowhere there was a knock on the door...    </span></div></div>",
            "created":1456808400,
            "id":2111786,
            "title":"You recognized me. How?"
        },
        "115332111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Cindy getting dressed",
                "Ed downstairs"
            ],
            "content":"<div class=\"\"><div> <span>\"Ed you are right you do live in a dump\" The real Cindy sad upset as she stood in what was once her old doorway. \"It's all a bit more than I can take. I mean look at me\" She did look horrible, wearing Ed's dark gray one piece janitor uniform and worn out boots. To make matters worse it was raining outside and she was soaked. She looked shocked when she saw Alex standing behind his new mother. \"Hey there sport\" Cindy sad trying to pass off as Ed. <br>\r\n<br>\r\n\"Cindy, he knows\" Ed said as he opened the door wider. \"Come in out if the rain and let's talk this out. Can I get you something to eat or drink. It's very early\" Ed walked through what was now his living room with his nightgown gliding behind him. <br>\r\n<br>\r\nStill in the house entry way Alex looked at his disheveled mother in disbelief. \"Mom did you really volunteer for this?\" He questioned as this new Ed hung his head.\" <br>\r\n<br>\r\n\"Yes Alex. I was just looking for a quick change of pace, and you weren't ever supposed to know. How do you know?!\" Ed (formally Cindy) said as she took off her boots. Cindy (formally Ed) walked in with a cup of coffee and sat in a chair. He gracefully lifted a leg to cross over and pulled at his gown. <br>\r\n<br>\r\n\"Good question. Alex you must have went through your own door.\" Cindy sad smiling. \"It must be odd for you to see my chest hairs poke though this light pink fabric.\" Cindy looked at Ed who had a nervous smile on her face. \"Well I'd get used to it for the time being. I'm your mother.\" He sad with a half toothless smile.<br>\r\n<br>\r\n\"Ed, I just took two buses at 4am to get here and tell you the deal is off. I need my life back\" the new Ed complained. She walked over to him in her holey socks and dropped down on a chair. <br>\r\n<br>\r\nThe new Cindy stood up and straightend his nightgown. \"Oh I don't think so ED a deal is a deal. We both agreed to fix the others issues and until that happens this...\" He sad twirling. \"...Is all mine.\" <br>\r\n<br>\r\nThe new Ed had a look of shock on her face as she watched this man dance in her clothes. She sunk back down on the chair and started to cry. Alex put his hand on her wet shoulder and began to consoule his former mother. \"Oh mom, I mean Ed? Don't cry, how hard can it be. Just do it quick and you'll be back here in no time.\" He got her on her feet. \"Plus I know what's going on. Maybe I can help.\"<br>\r\n<br>\r\nCindy stopped his dance and rushed over. His nightie lifted and exposed his panties. \"Oh I don't think I like having MY son assisting a strange man from work. No you'll be too busy with your new chores Alex.\" Cindy fixed himself and pulled his robe up. \"Now Ed, I know the bus can be crowded this time of day so just once I'll drive you to work. Let me get dressed and we will get going. Alex, I want you upstairs to clean your room or something but I do not want you talking to Big Ed while I'm getting ready.\" <br>\r\n<br>\r\nAnd with that Cindy marched upstairs pulling Alex with him....</span></div></div>",
            "created":1486530000,
            "id":2275131,
            "title":"Cindy, upset"
        },
        "115332112":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Make it to the bedroom",
                "Robert comes down stairs. "
            ],
            "content":"<div class=\"\"><div> <span>The knock on the door started the two of them as it was very early. \"I'll get it.\" Edward said as he glided to the front door with his gown falling quickly behind him. He looked back at Alex say, \"This thing is like wearing a cloud.\" He then turned around and opened the door. \"Well good morning Big Ed\" the New Cindy said in his baritone voice.<br>\r\n<br>\r\nI walked your old morther, dressed in tan cover all's and a gray baseball cap and boots. \"Good morning Cindy, looks like everything is just fine right?\" she asked seeing you at the table. <br>\r\n<br>\r\n\"Actually No. For some reason he can see us!\" Ed whispered as Cindy moved from the entry way.<br>\r\n<br>\r\n\"What?!\" she yelled nervously. \"Alex do you see me as your mother, or as a man?\" Alex looked and laughed, shaking his head. \"Ah great I knew this was to good to be true. Now they will just see us as crisscrossed freaks.\" Cindy said unbuttoning her cover calls expossing her white undershirt. \"Come on Ed, let's change in the guest bedroom.\" </span></div></div>",
            "created":1456894800,
            "id":2112081,
            "title":"Cindy, checking in"
        },
        "1153321121":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Run into Robert",
                "Run into Alex"
            ],
            "content":"<div class=\"\"><div> <span>\"I feel so foolish Ed. I knew this was too good to be true.\" Cindy said as she closed the bedroom door. She turned on the light and began to take off her coveralls. \"Look at this, I even have on your briefs. Look how silly I look.\" She said standing in Ed's gray briefs and undershirt.<br>\r\n<br>\r\n\"Are you kidding me Cindy?! Your son just saw me in this!\" Ed said holding out the side of Cindy's gown and matching robe. This caused Cindy to laugh a little and oddly enough she was getting a bit turned on. Even though the \"life changing hallway\" didn't work, he did seem to be walking a bit more feminine. All of a sudden a loud unexpected FART came from Cindy. \"Ew, gross Cindy I have to wear those briefs today.\" Ed whined. He stood there now in Cindy's pink colored panties with white trim, and her matching white bra. <br>\r\n<br>\r\n\"Sorry Ed, That's not like me\" She took off her undershirt without giving a second though about exposing her breasts to Ed. Ed, not thinking anything wrong, turned away from Cindy and expertly unhooked his bra and handed it over to Cindy. Once Ed had his under shirt on he realized how tight it felt. Cindy fumbled with her bra and eventually started swearing. \"God dam it this shouldn't be this hard\" she cussed as Ed came over to assist her. <br>\r\n<br>\r\n\"There you go Cindy, I know they can be tricky.\" Ed said realizing what an odd thing he just said. Now the two of them stood there in miss matched underwear wondering how to switch them. Ed picked up the night gown he was just wear and pulled in up to just his waist and slid his paint nylon panties off and handed them to Cindy. <br>\r\n<br>\r\n\"Thanks Ed but this is my house remember? Turn around and I'll give yah these.\" She said pulling down Ed's briefs. He spun around and pulled them up under the night gown. Again he noticed how tight they were, but didn't think anything of it. He gingerly slipped of the gown once again and Cindy grabbed. After tossing it on she grabbed the robe and handed Ed his coveralls. Now these were way too tight. Cindy looked at the Gown she was practically swimming in. \"Something is wrong here Ed. Did you really stretch this stuff out this poorly?\" <br>\r\n<br>\r\nEd could barley move in his old outfit but before he said anything Cindy opened the bedroom door, with her panties in her hand.<br>\r\n<br>\r\n      </span></div></div>",
            "created":1456894800,
            "id":2112204,
            "title":"Make it to the bedroom"
        },
        "11533211211":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Was invited",
                "broken in"
            ],
            "content":"<div class=\"\"><div> <span>\"Anyway, now that we are dressed you should....\" Cindy was cut off as Robert entered the hallway. \"Hi sweetie\"<br>\r\n<br>\r\nBAM! Robert clocked Cindy square in her beautiful face, knocking her out cold. Ed walked in with his hips swaying uncontrolably. \"What the hell is this Cindy?! Who is this man and why is he wearing your pajamas? Why are you dressed in his clothes?\" <br>\r\n<br>\r\nEd was shocked. \"I worked\" he whispered looking at the blacked out and brosed Cindy. \"Sorry, Robert, this is Ed from work. He...<br>\r\n<br>\r\n</span></div></div>",
            "created":1457067600,
            "id":2112964,
            "title":"Run into Robert"
        },
        "11533212":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "A trucker",
                "A construction worker"
            ],
            "content":"<div class=\"\"><div> <span>\"Alex, what are you talking about? I am your mom.\" he says.<br>\r\n\"But...you're clearly a guy. You have a penis.\"<br>\r\n\"What about it? So do you\".<br>\r\n<br>\r\nYou figure there's no point in arguing with him. Perhaps he really has no idea of his previous life. But maybe your mom does.<br>\r\n<br>\r\nYou tell him that you're going out for a while, and get dressed. It's the weekend, so school doesn't concern you at the moment.<br>\r\n<br>\r\nAfter about half an hour, you find your mom, but she's living the man's life. It turns out he was...</span></div></div>",
            "created":1267592400,
            "id":845552,
            "title":"Alex, what are you talking about? I am your mom."
        },
        "115332121":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "She recognises you",
                "She recognises you, but she won't admit it",
                "She doesn't recognise you"
            ],
            "content":"<div class=\"\"><div> <span>You witnessed a truck pulling up at a nearby gas station. The driver hopped out, and you instantly recognised who it was. It was your 40-year-old mom, wearing a polo shirt, jeans, work boots, and of course, a trucker hat. Quietly, you observed her refuelling the truck, then going into the shop to pay. Through the window, you could see her asking the shopkeeper for a key to the men’s room. When she came out, you decided then and there to question her.<br>\r\n<br>\r\n“Excuse me!”<br>\r\nShe turned and looked at you.<br>\r\n“Hello? Can I help you with something?” she asked, in a surly tone of voice.<br>\r\n“I couldn’t help but notice you have a key for the men’s room.”<br>\r\n“Yeah, I gotta pee. What’s your point?“<br>\r\n“Well, it’s just that…I’m pretty sure cisgendered women aren’t allowed to enter the men’s room…mom.”<br>\r\n<br>\r\nYour mom was briefly taken aback, but responded…<br>\r\n</span></div></div>",
            "created":1470286800,
            "id":2191222,
            "title":"A trucker"
        },
        "1153321211":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "“With you, now the whole family’s in on this.”",
                "“Just Stacey. Nicole hasn't discovered it yet, nor your dad.\"",
                "“Nope. Just you and me.”"
            ],
            "content":"<div class=\"\"><div> <span>“Alex? You can see me?“, your mom asked, dropping the “tough guy” act.<br>\r\n“Well, yeah. I went through the Hallway of Lives, then went through my own door.“<br>\r\nShe paused.<br>\r\n“Alex…wait by my truck. I need to discuss something with you.”<br>\r\nShe then entered the men’s room, so you headed to her truck. Two minutes later, she had gotten out, handed the key back to the shopkeeper, and came back to her truck. She unlocked the door, and the two of you both got in.<br>\r\n<br>\r\n“First of all…Alex, congratulations on finding the Hallway of Lives. I discovered the place when I was your age, and let me tell you, it’s been a fun experience living…god, I’ve lost count of how many lives I’ve inhabited. I wanted to tell you about this, but we Inhabitors are kind of sworn to secrecy. Now that you’re officially an Inhabitor, I think there’s no need to keep secrets from you anymore.”<br>\r\n“But what of the people you swap with? How does the truck driver feel about you swapping lives with him?”<br>\r\n“Oh, Mike? He’s pretty oblivious to his situation. Basically, he’s got all my personality and memories, and no memory of this life. He’s pretty much living my original life on autopilot. So, anyone who hasn’t been initiated into the Hallway won’t be able to tell anything’s amiss with him, nor me as long as I keep up the act.”<br>\r\n“Wait, you mean I’ve probably been living with different people as you all my life?”<br>\r\nYour mother smiled.<br>\r\n“Not as often as you’d think. When I was pregnant with you, Stacey and Nicole, I stayed in my original life and carried each of you to full term. And even on my maternity leaves, I looked after each of you. I love all my children, and I don’t trust a drone on autopilot to look after them as much as myself. But I think now you’re all old enough to the point where I believe I can swap lives with other people a little more often. And listen, if you don’t feel comfortable with anyone acting as my original self, you’re always free to live as someone else for the time being.”<br>\r\n“Just another question, mom…does any else in the family know about the Hallway?”<br>\r\n<br>\r\n“Well,” your mom explained…</span></div></div>",
            "created":1470286800,
            "id":2191226,
            "title":"She recognises you"
        },
        "11533212111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Going home",
                "Try to stop her truck"
            ],
            "content":"<div class=\"\"><div> <span>\"It's actually better now, because with you now the whole family knows!\" She laughed as she took off her dusty coat. It made her still big boobs jiggle as the were unsupported in her new trucker shirt. She pointed to the name stiched on it. \"Call me Mike now. That's me for the next few weeks.\" <br>\r\n<br>\r\n\"What do you mean the whole family know Mmmmm....Mike?!\" Alex yelled. He sat and thought about it. This morning the only other person who was up was his mother, or Mike, so his mother. <br>\r\n<br>\r\n\"What you haven't seen your \"father\" this morning?\" Mike said smiling as she put her hair up in a ponytail. \"You'll have to get out of my truck now Alex. I have to be in North Dallas by tonight.\" She said reaching arcoss her shocked son. \"Go home and meet your family KID, and remember, if it's too much try another life.\" Mike yelled as Alex walked away. <br>\r\n<br>\r\nWith that, his new trucker friend drove off leaving Alex alone in the busy gas station parking lot....</span></div></div>",
            "created":1487394000,
            "id":2279100,
            "title":"“With you, now the whole family’s in on thi..."
        },
        "115332121111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "One of his sisters",
                "His father"
            ],
            "content":"<div class=\"\"><div> <span>After a long and uneventful trip home Alex finally makes it back to his house. Despite the awkward morning, finding out that every member of his family has been living different lives, it was a beautiful sunny day. As he rounded the corner to his house there was his \"mom\" planting his flowers. <br>\r\n<br>\r\n\"Alex there you are!\" He said in a low baratone voice. He put his flowers down and scampered over to him. \"Your father's been looking for you! Today is the big game, and he needs your help get the yard cleaned.\" The wind was blowing his nice flower printed dress up and he quickly pulled it back down.<br>\r\n<br>\r\n\"Oh yeah! The football game is starting in a few hours.\" Alex said looking at his watch. He was looking forward to it but this morning had certainly distracted him. Just then the front door opened...<br>\r\n<br>\r\n</span></div></div>",
            "created":1487394000,
            "id":2279292,
            "title":"Going home"
        },
        "1153321211111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Help \"mom\" garden",
                "Head inside"
            ],
            "content":"<div class=\"\"><div> <span>\"Mom can I have the keys?\" Came a familiar voice. It was your best friend Todd, only dressed in your older sister Nichols's  clothes. He wore a pink and white polka dot summer dress with white sandels on his hair feet. He minced over to you and you mother. \"Hey Alex, dad is pissed at you.\" He said sticking some gum in his mouth. You noticed he even had his nails painted like her. <br>\r\n<br>\r\n\"Where are you going Sweetie?\" Your mom asked as he fixed his bra strap. <br>\r\n<br>\r\n\"To the mall with friends. I hate football, and I'm totally not looking forward to a bunch of grunting men downstairs.\" He said pulling his sunglasses down and flicking his hair like Nichole did. \"Is Todd coming over?\" He asked Alex in a disappointed way. <br>\r\n<br>\r\n\"I guess so\" Alex said still in shock. His best friend was now his own 18 year old sister. She was always the super preppy member of the family.<br>\r\n<br>\r\n\"Yeah see, I can't be around that, and they are having a sale at VS today.\" Nicole said taking her mother's keys. \"Need anything?\" He asked winking.<br>\r\n<br>\r\n\"You know what I like Nichole nothing too young!\" You mother yelled as \"Nichole\" walked away. As he got in the car his dress lifted and you saw Todd's package crammed in Nichols white and black stripped panties. \"Nichole!\" Your mother yelled as she quickly moved to help.<br>\r\n<br>\r\n\"I got it mom! Jesus like I've never wore a dress before.\" He said, aggravated. He started the car and pulled away from the house. \"You'll love what I get you mommy!\" He yelled as he drove away. <br>\r\n<br>\r\n\"What am I going to do with her\" your mother said as she started with he garden....<br>\r\n</span></div></div>",
            "created":1487394000,
            "id":2279294,
            "title":"One of his sisters"
        },
        "11533212111112":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Ex Girlfriend Tina",
                "Current Girlfriend Macy"
            ],
            "content":"<div class=\"\"><div> <span>You mother knelt down on his hair knee's and folded his dress around him, then began to plant his flowers. Taking a deep breath you opened the front door. There in the main living room SAT your new sister Stacey. She was only 12 and still loved dolls. She had them all laid out on the floor and was hmy a light tune. Her double D breasts barely for the ballet outfit, and her new fully developed hips stretched around her bright pink tutu. \"Mrs, Deeds?\" You wishpered which caused \"Stacey\" to look up and giggle. <br>\r\n<br>\r\n\"Daddy daddy! Alex is here!!!\" This full grown woman yelled. Mrs Deeds was one of Stacey's teachers. She was in her early thirties and had a smoking hot body. Now it was cramed into a 12 years clothes. \"Alex daddy is very made at you!\" The sexy mature woman said as she shook her finger.<br>\r\n<br>\r\nThen to your horror your \"Father\" showed up....</span></div></div>",
            "created":1487506440,
            "id":2279450,
            "title":"Head inside"
        },
        "115332121111121":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Help clean",
                "Use the hallway"
            ],
            "content":"<div class=\"\"><div> <span>From out of nowhere in walked your ex-girlfriend Tina. Gorgeous as ever, covered in sweat and grass stains. Her gray undershirt was covered in sweat and her sweat pants had holes in them. This was your father's normal yard work clothes. You couldn't believe it. You father took the life of your own ex-girlfriend. How long has he been her? Was it him that broke up with him? Or was it the real Tina???<br>\r\n<br>\r\n\"Alex! Where the hell have you been?\" your \"father\" yelled in a high pitched voice. \"I've been busting my ass all day with that dam yard\" she said taking off her sweaty undershirt. Her sweaty grassy boobs looked just as good at you remembered. Tina was 17 a year older than you, so you felt lucky to have her, then one day out of the blue she dumped you like a bad habit. <br>\r\n<br>\r\nJust then your mother walked in. \"Aw, there's my handsome man\" said Mike the trucker as he hugged your father, now ex-girlfriend. Your father gave him a passionate kiss then turned to you.<br>\r\n<br>\r\n\"Alright we only have a few hours before the game. Todd will be here soon I need both of you to clean up that deck outside so I can grill\" you father barked in Tina's voice.<br>\r\n<br>\r\n</span></div></div>",
            "created":1487517540,
            "id":2279496,
            "title":"Ex Girlfriend Tina"
        },
        "1153321211111212":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Go on your own adventure",
                "Join a Family member."
            ],
            "content":"<div class=\"\"><div> <span>\"Alright we only have a few hours before the game. Todd will be here soon I need both of you to clean up that deck outside so I can grill\" Tina's high pitched voice barked with the authority of your Father's.<br>\r\n<br>\r\n\"Alright, let me change then I'll help.\" you respond.<br>\r\n<br>\r\n\"Ok but get a move on.\"<br>\r\n<br>\r\nyou head upstairs and use the key entering the hallway, there was no way you were doing Yardwork while the whole family was having adventure's of their own.<br>\r\n<br>\r\nwith the near infinite doors in front of you, you begin to wonder who you should choose, you could pick something that seems interesting, or you could choose a life near one of your family member's Maybe you could choose someone in Tina's family to hang out with your Dad, or Join Todd's family and hang with Nichole, though she was actually coming over here so that might be tricky. Or Even maybe Mrs Deed's family and see how Stacy is doing as an adult Woman.</span></div></div>",
            "created":1487528880,
            "id":2279558,
            "title":"Use the hallway"
        },
        "11533212111112121":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "They both recognize you, having used the doors themselves",
                "They both continue acting like girls",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You know your best friend is currently swapped lives with your sister, you aren't sure who initiated, probably your sister as Todd seemed totally oblivious to acting like your sister.<br>\r\n<br>\r\nYou knew Nichol's best friend was a girl named Tiffany, with some hesitation you headed for her door, that way in a twisted way you could spend the afternoon with your buddy, even if he's currently living the life of an 18 year old girl.<br>\r\n<br>\r\nYou try to open the door but find it locked, confused you struggle with the door knob but finally give up.<br>\r\n<br>\r\nNichol also hangs out with another girl... you had to recall her name, she was freaking hot, oh Talia! Before long you found her door. and opened it.<br>\r\n<br>\r\nA Moment Later, you were standing in the mall, it was chilly, though that was partially due to the thin fabric Talia called a dress she wore today.<br>\r\n<br>\r\nYou saw Todd dressed as your Sister, but what surprised you was seeing Mark dressed as Nichol's friend Tiffany, no wonder it was locked.</span></div></div>",
            "created":1565659860,
            "id":2701226,
            "title":"Go See what Todd in Nichols life is up to"
        },
        "115332121111121211":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "go along with the original girly plan",
                "Do something more boyish",
                "Maybe some of both."
            ],
            "content":"<div class=\"\"><div> <span>\"What?! Alex?\" they say in unison.<br>\r\n<br>\r\n\"You can see me? You used the hallway? Without me?\"<br>\r\n<br>\r\n\"To be fair, its supposed to be kept secret... if everyone knew, it would be chaos.\"<br>\r\n<br>\r\n\"So Todd why are you a girl, more specifically my Sister?\"<br>\r\n<br>\r\n\"Well she used my door dozens of times apparently, after a while you begin to notice, The First time I remember I was as school, then suddenly I was in Nichol's body, from there I learned about the hallway and would voluntarily become her from time to time, remember last week when she suddenly challenged you to a game of smash and wooped you?\"<br>\r\n<br>\r\n\"Oh that was you? I should've known she couldn't do that, and She kept sitting with her legs sprawled out, dude, you kept flashing me my sisters panties!\"<br>\r\n<br>\r\nTodd cracks up, \"So you did notice! I was totally trying to freak you out dude.\"<br>\r\n<br>\r\nyou shake the image out of your head, \"ok, but still why is Mark also here?\"<br>\r\n<br>\r\n\"A few weeks ago I literally ran into him while out as Nichol, and decided to have some fun and flirted with him, but couldn't keep a straight and ended up explaining the Hallway to him.\"<br>\r\n<br>\r\n\"This is only my second time in a girl though...\" Mark said, you noticed he was wearing skinny jeans and a T-shirt, something less flattering than what Tiffany usually wore.<br>\r\n<br>\r\nSuddenly you pieced a few more pieces together, \"Talia's really hot... like she could easily drop out of High school and be a successful model...\"<br>\r\n<br>\r\n\"Yeah... and you ruined our day with her by taking over... Thanks!\" Todd said acting annoyed.<br>\r\n<br>\r\n\"So You turned into my sister\" pointing at Todd, \"and you turned into Tiffany\" pointing at Mark, so you could ogle Talia all day?<br>\r\n<br>\r\n\"Busted...\" Mark says laughing.<br>\r\n<br>\r\n\"So what were your plans for the day?\" you asked<br>\r\n<br>\r\n\"Well Talia wanted to get many pedi's, we wanted to just get new Bikini's and go sunbathing, so we settled on both.\"<br>\r\n<br>\r\n\"But now that its literally us 3 guys here and Talia's gorgeous body is back at your house watching Football, we can abandon that and do whatever, the Arcade could be fun looking like this.</span></div></div>",
            "created":1565661480,
            "id":2701239,
            "title":"They both recognize you, having used the doors ..."
        },
        "1153321211111212111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Talia's usual is a bit more involved...",
                "Afterwards, Bikini shopping",
                "Your phone rings, it says its from Todd, it must be Nichol in his body."
            ],
            "content":"<div class=\"\"><div> <span>Before anything else just to be clear Alex... we should just use our life's names, don't want people overhearing 3 girls named todd mark and... well Alex is ok, but you get it, but as for today...<br>\r\n<br>\r\n\"Well as the one with most girl life experience, I think we should continue with the plan, we can still ogle some girls in the changing room, and You guys should really try mani-pedi's<br>\r\n<br>\r\nMark... you mean Tiffany tentatively agreed... \"this is only my second outing in a girl's life but I guess it sort of sounds like an exciting experience, worth trying once... ya know\"<br>\r\n<br>\r\n\"Hey don't mind me... I don't want to interrupt you two's girl's day out.\" you say making fun of them.<br>\r\n<br>\r\n\"Screw You!\" Nichol laughs.<br>\r\n<br>\r\n\"The World thinks your a girl, good luck with that.\"<br>\r\n<br>\r\nAll of you laugh, and head to the Salon Talia had reccommended before you'd taken over.<br>\r\n<br>\r\nThey Chinese Woman at the Front desk greets you as if you're a regular customer.<br>\r\n<br>\r\n\"Talia! you here for Your Usual?\"<br>\r\n<br>\r\nUmm... sure yes, I think so, you glance back at your friends and give them a shrug.<br>\r\n<br>\r\nThey sit you Nichol and Tiffany in adjacent chairs and begin working, first using nail polish remover... as apparently Talia had nail polish on, even though you could only see your hands which didn't.<br>\r\n<br>\r\nThey then started cleaning your feet while another girl started to apply long fake nails, you heard one of the women call acrylics.<br>\r\n<br>\r\nYou glance over at Nichol with an alarmed look, you hadn't been expecting this...</span></div></div>",
            "created":1565703840,
            "id":2701602,
            "title":"go along with the original girly plan"
        },
        "11533212111112121113":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Bikini shopping",
                "Decide to change plans",
                "try another life..."
            ],
            "content":"<div class=\"\"><div> <span>Some pop song started playing somewhere and you took a second to realize it was coming from the purse beside you, Talia's purse, your purse right now A lady was working on your right hand so with your left hand you picked up the phone seeing it was from a number not saved into the phone, but one you recognized, it was your own home phone.<br>\r\n<br>\r\n\"umm Hello?\" You answer unsure why your house would be calling.<br>\r\n<br>\r\n\"O.M.G it is you Alex, You know about the Hallway now? That's great, but what a first life to try, Talia? is she wearing heels right now? she usually is.\"<br>\r\n<br>\r\n\"Ok ok slow down... how'd you know I was her?\"<br>\r\n<br>\r\n\"Well as you probably know I'm Todd right now and was heading to his best friend <b>Alex</b>'s house when who do I see in Alex's clothes but my friend Talia, so I called you... wait where are you right now, It sounds familiar.\"<br>\r\n<br>\r\n\"I'm gonna hang up now, have fun watching football.\"<br>\r\n<br>\r\n\"You're at Talia's favorite Salon aren't you! Little brother you should've told me, I'd love to do your nails whenever y-\"<br>\r\n<br>\r\n\"Bye\" and you hung up, you would never hear the end of it. You put the phone away and ignored the texts from <span style=\"text-decoration:line-through\">Todd's phone</span> Nichol<br>\r\n<br>\r\nA few minutes later the Ladies finished off your mani-pedi, you had to admit, it had felt nice, getting a hand and foot massage while sitting here.<br>\r\n<br>\r\nWhen you went up to pay, you realized It was Talia's purse, and thus her, wallet. so she'd be paying which was fair since she'd have the nails when you left her life.<br>\r\n<br>\r\n\"See! that was nice wasn't it, I wasn't expecting to have these claws though...\" <b>Nichol</b> said, marveling at her blue nails<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/47/6f/a9/476fa92c45d6e8b2c31035a12c96216c.jpg\" target=\"_blank\">https://i.pinimg.com/originals/47/6f/a9/...</a><br>\r\n<br>\r\nTiffany agreed trying to unzip his purse with his green ones<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/736x/fc/e8/6f/fce86f8946a524940262822d06caa6cb.jpg\" target=\"_blank\">https://i.pinimg.com/736x/fc/e8/6f/fce86...</a><br>\r\n<br>\r\nAnd You were equally impressed with your red claws, maybe <span style=\"text-decoration:line-through\">Todd</span> Nichol was onto something<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/63/36/a1/6336a1dfc1f13efe2125238ac358f44e.jpg\" target=\"_blank\">https://i.pinimg.com/originals/63/36/a1/...</a></span></div></div>",
            "created":1565750820,
            "id":2701864,
            "title":"Your phone rings, it says its from Nichols' house"
        },
        "11533212111112122":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Lisa, Tina's sister unaltered",
                "Lisa, Tina's sister altered"
            ],
            "content":"<div class=\"\"><div> <span>You figured this was all madness. \"What's wrong with my family?!\" You questioned to yourself. \"There has got to be away to change their minds!\" <br>\r\n<br>\r\nAlex walked into the hallway and saw several choices. He could be Stacey's husband and force her back to normal. He could be Todd's older brother and bully Nicole into it, or...\"I know, Tina honors every word of her mother Clair!\" Alex thought as he jumped through her door. <br>\r\n<br>\r\nThere was a familiar flash then everything came into focus. \"Where the hell...\" Alex said as he got his senses back. He saw he was behind the wheel of a large SUV parked outside his own high school. His hand looked normal behind the wheel only with a light purple glaze was on his nails. On his left hand he saw a diamond ring, and brackets on his wrists. \"Oh man\" Alex said looking down at his outfit. It was Clair's business attire. Alex now wore a navy blue blazer and matching knee length skirt. He felt the softness of the light purple blouse he was wearing and under it, and a soft bra. As he moved his legs, he noticed a black slip peek through over his black nylon legs. The shoes he now wore were professional T backs with gray highlights. \"My god it worked\" Alex said aloud.<br>\r\n<br>\r\n\"What worked mommy?\" Came a voice from the back seat....</span></div></div>",
            "created":1487560500,
            "id":2279721,
            "title":"Join a Family member."
        },
        "115332121111121221":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Follow Tina",
                "A laoud beep came from behind "
            ],
            "content":"<div class=\"\"><div> <span>\"Who the hell!\" You yell starteled as you look back and see Lisa, Tina's 10 year old sister sitting behind you.<br>\r\n<br>\r\nShe laughed as she played with her dress and smiled. \"Mommy you sad a bad word!\" She picked up a child's book and began to read. <br>\r\n<br>\r\n\"Sorry sweetie.\" You said in your most motherly tone. Just then the passenger door flew opened and your daughter Tina got in. He wore a purple and sparkly gold chear leading skirt with a matching purple sports bra on his hairy chest. His beer gut over hangged slightly over his skirt waist band as he crossed his hairy legs. \"Dad????\" You asked the man / daughter sitting next to you.<br>\r\n<br>\r\n\"Hey Alex! I mean mom. Shhh Lisa is very nosey.\" He said putting his seat belt on. \"Hey pretty brat\" your father said playfully to the 12 year old. \"Don't you have dance to get to???\" <br>\r\n<br>\r\nLisa looked up from her book. \"Yes but mommy needs to help get me signed up, and my tutu has a whole in it.\" Said the girl inocently. <br>\r\n<br>\r\nTina, your father looked at you and said, \"let me handle this.\" And got back out of the car. He opened Lisa's door and took her little hand. \"Come on silly, mommy's a bit sick right now. I'll take care of it.\" <br>\r\n<br>\r\n\"Thanks Tina!\" She happily yelled as she took her sister's hand. <br>\r\n<br>\r\n\"I'll be right back mom, then we can talk\" you father said in his gruff low voice. You took a deep breath as you watched your two daughters talk hand and hand back into the school.</span></div></div>",
            "created":1487605740,
            "id":2279919,
            "title":"Lisa, Tina's sister unaltered"
        },
        "1153321211111212212":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Fight",
                "Move the car"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey lady!\" You heard a familiar voice yell. \"You're blocking the drop off zone!\" You put your SUV in park and stepped out of the car. After extending your nylon clad leg, you heard your heels click. After spinning around you smiled. <br>\r\n<br>\r\n\"I knew that was you!\" You laughed as you closed your door and smoothed your skirt. The vehicle behind you was your mother's actually Mike's delivery truck. <br>\r\n<br>\r\nYour mother got out of her truck and walked toward you. You instinctively went to give her a hug went she backed off. \"Woah woah lady I don't know you\" she said winking. \"How do you think my lady thinks about me hugging sexy soccer moms?\" You mother pointed to a very scantily clad woman in the cab. \"Anyway lady, you wanna move your car please?\" <br>\r\n<br>\r\n\"Mom, I mean Mike.\" You sad after she pointed to the name on her delivery coat. \"I thought you were heading to Dallas today?\" You said as you buttoned your blazer. It was a very windy day and your blouse was not warm.<br>\r\n<br>\r\n\"I do. This is my second delivery. I've got two more here in town then me and Shasta here are heading to Texas.\" She said as she adjusted her croch. \"These breifs are killing me. I'm kinda missing my panties.\" She said laughing. <br>\r\n<br>\r\n\"Well you can have mine, or even dad's!\" You yelled. \"Did you know he's Tina my ex?\" Just then Tina came out and headed toward you. <br>\r\n<br>\r\n\"You look goooone honey!\" You mother said to your father and the wind picked up his chest leader skirt. <br>\r\n<br>\r\nYou father femininly folded his arms under his non-existent breasts and stuck out his hip. \"Mike again? And who's that up there?\" He said pointing his purple nail polished fingure to the cab. <br>\r\n<br>\r\n\"That's Shasta my hooker. Gotta keep occupied on these long drives.\" Your mom said adjusting her trucker hat. \"Now Alex, ma'am, are yah gonna move your car or not. Y'all are making us late here...\" <br>\r\n<br>\r\n</span></div></div>",
            "created":1487615280,
            "id":2279976,
            "title":"A laoud beep came from behind "
        },
        "11533212111112122122":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "He obeys",
                "He rebels"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on Mom let's just go\" your father said with teenage attitude. He grabbed your hand and pulled you into the car in confusion. \"Ugh, can you believe that pig!\" He whined. \"This happens ever time she swaps with Mike.\" <br>\r\n<br>\r\nYou put the car in gear and slowly pulled into the road. \"Dad, I have a ton of questions.\" You began as you made the familiar drive to Tina's house. \"Why the hell are we both women right now?!\" <br>\r\n<br>\r\n\"Hey no more Dad stuff, I may look like your father to you, but to everyone else I'm Tina Martinez, 17 and sexy 💋\" he said in an all too feminine manner. \"I've been her for almost two weeks!\" <br>\r\n<br>\r\n\"But why? Why her, my ex?!\" You had just taken a turn into your new suburban neighborhood. \"Wait....Were you the one who broke up with me!?\" <br>\r\n<br>\r\nYour father looked at you inocently and nodded. \"Alex you don't understand the fatherly pressures I have, well had. I just needed a break. A change of pace.\" He said as he pulled his pink cell phone from his sports bra. A trick Tina always pulled. <br>\r\n<br>\r\n\"So, you leave your family, become my girlfriend, then breakup with me?! All just for fun?!\" You screamed as you pulled into your house. \"That's so messed up dad!\" You angerly got out and stomped your heels into your new house. <br>\r\n<br>\r\nYour father grabbed his cheer leading duffle bag and purse and followed you inside. You were so mad you were pacing. \"Well, I'm going to shower Mom, and give you time to relax. I'm going out later so I won't need dinner.\" <br>\r\n<br>\r\n\"Oh no you don't, you ruined my life!\" You said taking off your heels and chasing him up the stairs. \"If I were still a man I'm punch you! But, now I'm your mother, so you are grounded young lady!\" You noticed how you were pointing at him. He looked so sad he could cry. \"No tears Tina. Go shower then come straight back down stairs Missy!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1487628720,
            "id":2280050,
            "title":"Move the car"
        },
        "11533212113":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Travel with Mike",
                "Go home to mom"
            ],
            "content":"<div class=\"\"><div> <span>\"Nope, just you and me so far Alex, but you should probably head home. I bet your mother will be worried.\" Mike said taking a big gulp of her coffee. She put on Brown Dusty coat and Alex watched as her big breasts moved unsupported in her plain white shirt. <br>\r\n<br>\r\n\"You are my mom, right?\" Alex asked <br>\r\n<br>\r\n\"Alex haven't you been listening? My name is Mike Russel for now. Don't worry, I've never been in a life for more than a month.\" Mike said getting out of her truck. She walked around font and opened Alex's door. \"Now scram kid. I can't make my deliveries riding with you.\" <br>\r\n<br>\r\nAlex hopped out and noticed some scantily clad women hanging out by the store....</span></div></div>",
            "created":1470373200,
            "id":2191539,
            "title":"“Nope. Just you and me.”"
        },
        "115332121131":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "The truck is gone",
                "mikes ready to go"
            ],
            "content":"<div class=\"\"><div> <span>\"So you can't be seen making your deliveries with a teenaged boy, how about one of those hookers over there?\" Alex pointed to the cluster of women waiting outside the shop. They all wore right tiny shorts, some had bikini tops, some wore tights but all of them were going and in pretty good shape. Mike started to laugh.<br>\r\n<br>\r\n\"You really want to be one of them. You know what it will mean right? You won't be Alex the teenanger, you will be a hooked riding with a trucker. You'll have to play by the rules.\" Mike warned. <br>\r\n<br>\r\n\"Yeah I get it. Just, tell me which one you like the best.\" Alex said. It was odd asking his mother that question. As she looked she seemed to get hornier. <br>\r\n<br>\r\n\"Alright, see that blond one in the Jean shorts and the pink top, that's the new you. Go change and meet by my truck.\" Mike said hopping in. Alex lured the hooked to the hallways of lives. She was very attractive and seemingly clean but clearly not the brightest. She never asked a single question, she just assumed she was heading out back for a blow job. <br>\r\n<br>\r\nIt didn't take long for the transfer to take place and when he came to he saw an Intresting site. He stood up quick but fell right on his ass. \"I wearing heels?!\" he whispered in amazment. Just then the hooker, now dressed like him walked over to help him up. Once he got to his feet the new Alex smiled and walked away. After a quick look at his ID he saw his name was Shasta. \"Cool\" Shasta laughed as he walked in his heels to Mike's truck. <br>\r\n<br>\r\n</span></div></div>",
            "created":1470373200,
            "id":2191549,
            "title":"Travel with Mike"
        },
        "1153321211312":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Start to strip",
                "get me off"
            ],
            "content":"<div class=\"\"><div> <span>As you walk to the truck you see Mike smiling. It was funny to you, knowing you've seen that smile 100 times before. It was a very familiar face, on a very unfamiliar life. The feeling of your heels clicking with each step was also unfamiliar. You stopped to adjust the black bra strap that was peaking out from your pink top.<br>\r\n<br>\r\n\"Looking for a ride?\" your mom, Mike said. You staired at her oddly. <br>\r\n<br>\r\n\"Mom, you know it's me. I'm gonna help you with your deliveries.\" You laughed. <br>\r\n<br>\r\nYour mother smacked her forhead. \"How are you not getting this. You are a slut hooker now. Lets try this again.\" she said roughly pushing you back and leaning on her truck. \"Looking for a ride????\"<br>\r\n<br>\r\n\"Yeah where yeah going\" you asked absent mindedly playing with the top of your denim shorts. <br>\r\n<br>\r\nYour mother pulled out hwe wallet and shoved 300 bucks down your shorts. \"I'll take you as far as Terrytown. We can get a room. Then your own your own. Now get in it the truck\"<br>\r\n<br>\r\nShocked your mother forced you up in the cab. She caught a glimpse of the black trim, leopard print thong you were wearing. She laughed and said, \"Your panties are hot as he'll. What's your name?\"<br>\r\n<br>\r\n\"Shasta\" you whispered feeling very uncomfortable. <br>\r\n<br>\r\nYour mother started his truck and said, \"Why don't you...\"</span></div></div>",
            "created":1470718800,
            "id":2193621,
            "title":"mikes ready to go"
        },
        "1153321213":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "Go home and interrogate the imposter in your mother's clothes",
                "Silently follow your trucker mom",
                "Look for other Hallway users"
            ],
            "content":"<div class=\"\"><div> <span>\"Very funny, kiddo\", your mom responded. \"Push off. I've got no time for your stupid games.\"<br>\r\n<br>\r\nAnd with that, she unlocked the door to the men's room and went in.<br>\r\n<br>\r\nOkay, you thought. Maybe she really does think that she's the truck driver, and she really does have no memory of her previous life.<br>\r\n<br>\r\nBut then you thought something horrible. What if the man now inhabiting your mother's life was the one who entered the Hallway? Your mother was now a prisoner in his life, and now you were seriously thinking of going home and interrogating him.<br>\r\n<br>\r\nBut then you thought that perhaps he would get bored and switch back. Perhaps it would be interesting, and kind of amusing to observe your mother obliviously acting out the role of someone she was clearly not.<br>\r\n<br>\r\nOr perhaps you could spend your time as yourself seeking out more Hallway users. It might be fun to watch obvious life miscasts...</span></div></div>",
            "created":1470286800,
            "id":2191347,
            "title":"She doesn't recognise you"
        },
        "11533212131":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Stay by the school",
                "Find \"mom\""
            ],
            "content":"<div class=\"\"><div> <span>As you quickly biked home you pass by a school yard. There were several kids outside being watched by teachers. One of the teachers was bald man with a scraggly beard wearing a nice yellow sundress with a matching cardigan. He was laughing with the normal teachers watching the kids, then purposefully pushed over a trash can. It didn't take long for the janitor to show up in her stained black coveralls. Her work boots were muddy and untided. She bent down with her shining blond hair blowing in the breeze and sneered at the man who stole her life. \"Thanks Ronald\" The man said to the Janitor. \"Come on children! Time to come inside\" <br>\r\n<br>\r\n\"Coming Ms. Carlyle!\" The children said as they got in line behind the bald man. One of the girls tugged at his dress and giggled. <br>\r\n<br>\r\n</span></div></div>",
            "created":1470373200,
            "id":2191488,
            "title":"Go home and interrogate the imposter in your mo..."
        },
        "115332121312":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Play along",
                "Bust him"
            ],
            "content":"<div class=\"\"><div> <span>After finally arriving home, you walk into a strange site. An overweight man, wearing your mother's pink nighty sprawled out on the couch with a bucket of friend chicken and beer bottles. The local football game was on. His legs wear spread wide open showing off your mother's black panties. \"Ahem\" you coughed, announcing yourself. <br>\r\n<br>\r\nThis startled you \"mother\" and he quickly moved to cover himself. \"Oh hello son.\" He said brushing the drums off his hairy chest. He stood up and pulled his nightgown down to cover his panties, but as he did so he knocked some beer bottles over.<br>\r\n<br>\r\n\"Good after noon mother. Drinking this early in the day?\" You teased. It was fun watching him react to just about being caught.<br>\r\n<br>\r\n\"Oh, know, this mess is from your father. What am I going to do with him?\" The man ran over to the kitchen to grab his robe to cover up. \"What are you doing home so early....\"</span></div></div>",
            "created":1470373200,
            "id":2191612,
            "title":"Find \"mom\""
        },
        "115332122":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "She recognises him",
                "No idea its her son"
            ],
            "content":"<div class=\"\"><div> <span>Alex jumpped on his bicycle and started off towards the park. Just as he got towards the road his new mom came out to stop him. \"Alex\" He boomed in a low voice. \"Where do you think you are going? We have things to do today.\" Alex looked at the man he would now have to call his mom. He wore her light blue satin pj pants and a white lace tank top. A nude bra hugged his hairy chest. His morning wood stood out as the wind blew his loose pants. \"My hair appointment is in an hour, so hurry back quick.\" said his new man mom as Alex biked away. <br>\r\n<br>\r\nHe didn't get a half a mile down the road when he saw a small construction site. They were laying concrect down by an old house not far from his house. Some morning joggers ran passed Alex in their right shorts. He could hear the construction workers hooting and showering at the attractive runners. One voice however sounded strangly familiar. As Alex looked closer, he saw his mother! <br>\r\n<br>\r\nThere she stood dressed in dusty jeans and muddy boots. Her flannel shirt was untucked and her hair was a mess under her hard hat. She had some gray concrete staining her reflective vest. \"Oh baby, slow down for me! Shake that ass sweetie, let's see what you got!\" She yelled, after high fiveing her two other construction workers. The joggers just ignored the horny men. <br>\r\n<br>\r\nAlex quickly biked over and called out, \"Mom!\"....</span></div></div>",
            "created":1456808400,
            "id":2111516,
            "title":"A construction worker"
        },
        "1153321221":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Its only for a little while",
                "Its perminate "
            ],
            "content":"<div class=\"\"><div> <span>\"Alex! oh my word! This is so embarrassing, how'd you find me?\" She said walking back to her big truck. \"Quick hop inside so we can talk\" Alex hopped up into the dirty construction vehical.<br>\r\n<br>\r\n\"Hey, Roy!\" A strange man called out to his mother. \"Roy we need to start laying that flirty give pipe down on the west side, hurry up will yah.\" <br>\r\n<br>\r\n\"I'm on it boss just give me a second!\" She side in her high feminine voice as she hopped on her truck. Once inside she looked at Alex. <br>\r\n<br>\r\n\"Roy?\" He asked condecendingly.His mother just flashed her beautiful smile.<br>\r\n<br>\r\n\"That's me sweetie! For the time being anyway. I'm a man now, and this is my life. Roy Patterson 50 year old construction worker. What do you think?\" she said taking off her hard hat and letting her messy hair down everywhere. <br>\r\n<br>\r\n\"But mom what was wrong with your old one? How long are you going to stay this way?\" He asked as she scrached her right breast.<br>\r\n<br>\r\n\"Call me Roy from now on Alex and...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1456808400,
            "id":2111520,
            "title":"She recognises him"
        },
        "11533212211":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Do you know who that was",
                "Nice outfit mom"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, sweetie. I just needed a change of pace. This is only just for a little while. This life seemed so diffrent, so exciting, I figured let's just try it for a while.\" She side looking at the mid on her hands. \"I'm bored with shopping and hair dressing. What about the real Roy, or should I say Cindy Carmichael. How is SHE taking it?\" <br>\r\n<br>\r\n\"SHE, doesn't even realise he's swapped places with you. Or was very old to see a 50 year old man in you pjs this morning mom.\" Alex said trying to get her to end this. <br>\r\n<br>\r\n\"Hey, what did I say, call me Roy now, and I sorry to startle you like that. Like I said, this is only temporary, but I like it for the time being.\" She was quickly interupted. <br>\r\n<br>\r\n\"Hey Roy! Hurry up with them 43inches will yah.\" a co worker said.<br>\r\n<br>\r\n\"Ya Ya\" she belted out her window. \"Don't get your panties in a twist\" She looked back at Alex. \"Hey I gotta get going. Look, looks like your mom's her anyway.\" she pointed one of her dirty fingers out to the strang man walking towards the car. \"You better get out, all she sees is you in a car with a 50 year old man.\" She laughed opening the door. As the new Cindy got closer, the construction workers started hooting and hollering again. <br>\r\n<br>\r\n\"Yeah soccer mama, show them legs!\" one guy side. Alex looked at his mom and watched her oggle her old life and yell, \"Ya baby show me them tits!\" She winked at Alex then watched him walk away with the man who now has her life. <br>\r\n<br>\r\nAlex got in the car and said...</span></div></div>",
            "created":1456808400,
            "id":2111522,
            "title":"Its only for a little while"
        },
        "115332122111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Help him with his erins",
                "Go back and follow your old mom"
            ],
            "content":"<div class=\"\"><div> <span>Alex got out of the truck and walked toward his new mother. He had on a light purple sun dress and flats with a white cardigan. His purse matches his outfit. As Alex got close, a large wind gust came along lifting his dresss, very briefly exposing his panties. \"Oh mama! You're killing me!\" Alex heard Roy shout. Humilated, Cindy grabbed Alex and made for the car. Leaving his bike behind.<br>\r\n<br>\r\n\"Mom do you know who that is?\" Alex asked as we watched the man adjust himself in the car.<br>\r\n<br>\r\n\"Of course I do kid, that was your real mom.\" This stunned Alex. This morning it seemed this guy had no clue he was swapped. Cindy adjusted his seatbelt over his non existed chest and began to drive them away. \"Now what did she tell you? Did she say this is temporary? Because I gotta say, I have no intention of going back to that horrible life.\" He said alarming Alex. \"See we both gotta go through those doors at the same time. She almost tricked me to get me this far, but now that I'm here, I'm staying.\" This really shocked Alex. Was this really going to be his new mother?<br>\r\n<br>\r\n\"Have you always wanted to be a lady?\" Alex asked, which got him a smack upside the head. <br>\r\n<br>\r\n</span></div></div>",
            "created":1456808400,
            "id":2111600,
            "title":"Do you know who that was"
        },
        "1153321221112":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Sure thing",
                "Nah i gotta see my wife and kid"
            ],
            "content":"<div class=\"\"><div> <span>Alex waited for the car to stop at the next red light then ran out down the road. \"Ok sweetheart! I'll see you back at home!\" he heard his new mother yell in his low voice. Alex ran as fast as he could to get to his bike back at the construction site. Once he got there he saw the men finishing up and heading home. <br>\r\n<br>\r\n\"What do you say Roy, you want to meet us over at the bar.\" one of the workers said to your mom. \"What else you gonna do man? <br>\r\n<br>\r\nRoy looked at them and said....</span></div></div>",
            "created":1456808400,
            "id":2111601,
            "title":"Go back and follow your old mom"
        },
        "11533212211121":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "The life of a whore",
                "Alex sneaks in the bar"
            ],
            "content":"<div class=\"\"><div> <span>Alx watched his mother hop in her new work truck and drive off. \"Which bar are they going to?\" He wondered as he started to follow. He was only on his bike so it didn't take long to loose her. \"Dam it! Now I stuck with a 50 year old man as my mom!\" he yelled as he biked on.<br>\r\n<br>\r\nHe must have biked all the way across town. It was really getting dark, but at the last second he stopped his mother's truck. The bar was called Billy's Beers and Broads and it looked like a tough spot. Plus Alex was too young to get into a bar this late at night. Looking around he saw two women dressed in tiny dresses having their ciggarete break. He over heard one of them talking. \"Ugh I got Roy tonight Carla.\" <br>\r\n<br>\r\nAlex had an idea...</span></div></div>",
            "created":1456808400,
            "id":2111605,
            "title":"Sure thing"
        },
        "115332122111211":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "No way girl, I'm taking you home",
                "If you are sure you feel ok...."
            ],
            "content":"<div class=\"\"><div> <span>Quickly Alex entered the Hallway of Lives and began to search for one of the whore's lives. \"I gotta do this to save her. This man never wants to swap back with her and I don't want a 50 year old man as my mother\" He thought as he quickly opened and closed doors. There wasn't much time so he quickly jumped through and blacked out. When he came to he was outside the bar with a black hooker talking to him.<br>\r\n<br>\r\n\"Summer....SUMMER!\" The hooker yelled until he looked up. She was looking him dead in the eye. \"Summer are you feeling ok? You got a big night with Roy babe you need to get with it.\" Roy felt so uneasy and off balance, even though he was standing he tripped and stumbled. \"Ok girl that's it, forget about Patterson tonight. We going home and getting you right.\" She said helping him up. Alex noticed the high, bright red heels he now wore as he tried to get to his feet. Lucky Carla was there to help or he never would have gotten up. Not familiar with his new body, he spread his legs wide and felt the cool night breeze his penis. <br>\r\n<br>\r\n\"I'm not wearing any underwear?!\" He yelled out and Carla laughed. <br>\r\n<br>\r\n\"Sweetie there is an extra pair of panties in your purse. Let go inside and grab it then well get you home ok girl?\" She lifted him to his feel and helped him adjust his bright purple top. He looked down and saw the loose black skirt he wore and recognized where he was. He was outside the bar! These were the hookers he was looking for! <br>\r\n<br>\r\nExcited, Alex adjusted himself and said, 'Thanks Carla, I'm much better now but Roy and I need to have a chat.\"    </span></div></div>",
            "created":1456808400,
            "id":2111681,
            "title":"The life of a whore"
        },
        "1153321221112111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "She sees him as Alex",
                "She sees him as Summer"
            ],
            "content":"<div class=\"\"><div> <span>\"Summer, you just took a pretty big fall. You look kinda drunk babe.\" Carla said as you walked inside. Alex stumbled a bit in his heels but he picked up the skill quickly. After watching his mom grab the ass of some local bartender he began to walk over, when Carla intervened. \"Oh no babe, look at your arm. It's all scrapped up. Here lets head to the restroom and wash you up.\" <br>\r\n<br>\r\nAlex was getting frustrated. The whole reason he switched lives with this whore was to warn his mother, about getting her old life stolen. All he wanted to do was get five minutes alone with her, but Carla wasn't letting it happen. She walked Alex right passed his mother. So close in fact she slapped his ass and winked. \"My mother the ass grabbed\" He muttered as he walked into the rest room. \"Carla, I appreciate what you're are doing hunny but I'm fine really.\" He looked at the cut on his arm. It was pretty bloody so he let Carla patch him up. She rummaged through your new purse and pulled out some black nylon panties.<br>\r\n<br>\r\n\"Here, put these on Summer, you can't work tonight.\" Carla said after cleaning her friend's arm. She quickly touched up her makeup then handed her eye liner to Alex. He had an odd sensation to put in on, the adjusted the empty bra on his chest. \"Ok girl lets go before the men get to rowdy.\" As they walk through the main bar Alex bumps right into his former mother....</span></div></div>",
            "created":1456808400,
            "id":2111744,
            "title":"No way girl, I'm taking you home"
        },
        "115332122111212":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Alex gets kicked out",
                "in the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>Alex looked passed the whites to the back door. \"That's how I can get in!\" He said as he made his way in. It was a load biked style style bar. The music was loud and it was full of smoke. It didn't take long for him to spot his mother just passed the pool table. A blond waitress handed her a new beer and as she walked away she slapped her ass. \"Wow she's turned into a real pig.\" Alex said to himself as she watched his mom drink her beer. <br>\r\n<br>\r\nHer legs were wide open and se was laughing with her friends. \"Guys I had to got the head\" she said over the loud music. She got up and adjusted her belt and walked towards the restroom. Since she still has her very womanly body, she couldn't stand up to per. Alex thought this was his opportunity to warn his mother and followed her in there. <br>\r\n<br>\r\n</span></div></div>",
            "created":1456808400,
            "id":2111609,
            "title":"Alex sneaks in the bar"
        },
        "1153321221112121":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "too long",
                "in 30mins"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey kid get the he'll out of here. We don't serve minors!\" The bartender yelled as he grabbed Alex by the neck. He saw his mother go into the men's room but was tossed out before he could do anything. <br>\r\n<br>\r\nBack outside, Alex grabbed his bike and waited for his mother to show up. The two whores were still outside talking about their customers. \"You ever been to Roy's appartment Carla?\" Your mother's new date asked her friend. \"He's got a huge hot tub out back. Its like the one good thing he's got\"<br>\r\n<br>\r\n\"That's not all he's got Summer.\" Carla added. \"I heard he's packing some Intresting goods in those jeans of his.\" The two whores laughed and ashes out their ciggaretts. Carla grabbed Summers wrist and checked her watch. \"Dam it girl I have to go!\" Carla said as she clicked away in her hooker boots. \"What time are you meeting Roy? At Ten?\" Summer nodded as she waved good but to her friend. <br>\r\n<br>\r\n\"Ten? Thats...</span></div></div>",
            "created":1456808400,
            "id":2111620,
            "title":"Alex gets kicked out"
        },
        "11533212211121212":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Carla was waiting",
                "Cindy was waiting. "
            ],
            "content":"<div class=\"\"><div> <span>And with that Alex noticed his mom come out of the bar, looking drunk and horny. She waddeled up to Summer and laid a big kiss on her lips. \"Jesus Roy, you are hammered. Wait till we get to your house, I don't wanna do car stuff tonight.\" She said as they got into Roy's truck. <br>\r\n<br>\r\nRoy took out his wallet and said, \"Here's 200 dollars of you eat me out right here in my car.\" She then unbuttoned her jeans and got them too her ankles then sat there in just her briefs. Not having a dick, she couldn't get a bj but Summer was the type of girl known for eating pussy. <br>\r\n<br>\r\nNot knowing what was going on, Alex walked up to the car and opened the door. He saw his mother in men's boxer briefs and an old flannel shirt with a young who're eating out her vagaina. \"Alex!\" She yelled waking her up from her erroctic drunk stuper. <br>\r\n<br>\r\n\"Roy what the hell is this Who is the kid!\" Summer screamed getting out of the car. \"You're messed up Roy. I don't care how good your hot tub is!\" And with that she walked down the street. <br>\r\n<br>\r\n\"Alex, what are you doing here like this?\" she said pulling up her boxer briefs. \"I told you to go with your mother didn't i?\" She pulled up her jeans and looked at her son. <br>\r\n<br>\r\n\"You are my mom! I hate this!\" he yelled<br>\r\n<br>\r\n\"Alex I'm not your mother anymore ok? I'm a man now and I am really enjoying this.\" She saw a tear in her son's eye. \"Look, I'll let you spend the night at my place but tomorrow you have to adjust to your new mother.\" She opened the door to her truck and told him to get in. \"I get your bike in the back.\" She hopped out and easily tossed his bike in the back. <br>\r\n<br>\r\nWhen they got to Roy's appartment....</span></div></div>",
            "created":1456808400,
            "id":2111623,
            "title":"in 30mins"
        },
        "115332122111212121":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "In the hot tub",
                "Alex becomes Carla"
            ],
            "content":"<div class=\"\"><div> <span>As they drove Alex told his mother about Roy not wanting to swap back. \"Oh trust me Alex, he'll want this life back.\" Roy said rolling down his truck window. She lit up a cigarette right in front of him. <br>\r\n<br>\r\n\"Mom!\" Alex shouted.<br>\r\n<br>\r\n\"Hey what did I tell you about that mom stuff! That's not me anymore. You call me Roy, or better yet Mr. Patterson. I'm being nice here letting you spend the night at my place but don't get comfy Alex.\" She yelled ending in an awkward silence. She reached down her jeans to adjust herself in a very un-lady like manner. It was so odd seeing his mother act this way. \"I think that Summer girl wasn't too clean.\" She said after putting her other hand back on the wheel, then taking a long drag off her cigarette. <br>\r\n<br>\r\n\"But what if he doesn't want to switch back. My mom I mean. You'll be stuck as Mr. Patterson forever.\" Alex finally said, breaking the silence.<br>\r\n<br>\r\n\"Look I planned on staying like this for while Alex. I had no idea you'd be able to see the affects or be able to find me, This is just a fun new change of pace for me, so let me enjoy it. I'm certain in time I'll want to switch back and I know he will too but for now you have to accept I am a man now.\" Before Alex could respond they pulled into Roy's drive way. It was a small concrete pad under a pain style apartment. \"I know it doesn't look as nice as my old house, but wait until you see the hot tub.\" Roy got out and was quickly welcomed by Carla. \"Carla?\"<br>\r\n<br>\r\n\"Roy, where's Summer she said she was going to be with you for the night. Who the hell is this?\" She said pointing to Alex with one of her long pink fingernails. She wasn't a bad looking woman but a whore no doubt. She had dark skin wrapped up in a tight short yellow dress, with long flowing sleeves. Her hair was done up with a silver band which matched her silver stripper heels. <br>\r\n<br>\r\n\"He's the reason Summer left.\" Roy said taking Alex by the arm. \"This is my nephew Alex. He ran away from home so he is spending the night in my second bedroom.\" Roy walked Alex up to the front door and reached into her dirty jean pocket and gave Alex her keys. \"Go on in sweetheart.\" She whispered \"Don't cock block be twice in one night.\" She winked and headed over to Carla. \"Carla baby! Have you seen my hot tub?\"   </span></div></div>",
            "created":1456808400,
            "id":2111642,
            "title":"Carla was waiting"
        },
        "1153321221112121211":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Turned into Robert",
                "Began her fun night with Roy"
            ],
            "content":"<div class=\"\"><div> <span>\"What about your nephew? Is he going to be a problem?\" Carla said wrapping her arms around Alex's mother. She pulled him in close, \"Cause you know young eyes cost extra.\" Her seductive tone caused Roy to get all excited and she felt a familiar wetness in her briefs. <br>\r\n<br>\r\n\"Look it babe, I got 400 right here. You go one and get in that rub and I'll take care of everything.\" She said handing over a sweaty wad of cash to the whore. Carla took it and smiled. Then walked towards the hot tub swaying her hips for her to watch. \"God dam!\" She said as he watched her head around back. She quickly got inside to find Alex on the couch. \"Ok, look Alex don't ruin this for me ok? Head into the room and try to rest.\" She said taking off her flannel shirt. She stood there topless with her breasts exposed as she took off her work boots and socks. She walked over to the fridge and pulled out a six pack of beer and took a blue pill. \"This outta do nicely\" she side walking out the back door. <br>\r\n<br>\r\nAlex looked out the back window and couldn't believe what he was seeing. There was his gorgeous loving mother, topples, about to hot in a hot tub with a naked whore. Carla had pulled out a hot pink bikini top and black stripper shorts and smiled. \"I came prepared!\" She giggled as she began to strip. Roy sat down in a chair by the hot tub and took off her jeans. She watched Carla playfully take off her tight yellow dress. Her boobs feel out and she giggled as Roy put her hand down her briefs and began rubbing her clit. \"Did you take your pill Roy. Most 50 yearolds have to.\" She teased as she got closer to Alex's mom. <br>\r\n<br>\r\nShe straddled her on the chair as after she wiggled out of her dress. Standing there in black thing panties she....</span></div></div>",
            "created":1456808400,
            "id":2111651,
            "title":"In the hot tub"
        },
        "11533212211121212111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Explianations needed ",
                "Keep it going \"Roy\""
            ],
            "content":"<div class=\"\"><div> <span>Roy was about to climax when all of a sudden Carla turned in Robert, her husband. \"Robert?!\" She yelled taking her hand out of her briefs. What once was a sexy black stripper in a black lace thong was now her husband. He barley fit into the tiny fabric and was keeping Carla's sexy pose. <br>\r\n<br>\r\n\"What?, You can go off spending the day as a strange man but I can't switch with a strange woman?\" He yelled in a low voice. \"How do you think I felt waking up next to a 50 year old man in your panties today?\" Roy pulled up her briefs and stood up, looking at her ridiculous looking husband. \"He told me to get used to it, or find a new life and showed me the hallway. I must admit, who would have thought you were getting a lap dance buy this whore.\" He walked over to Carla's bag with a nice feminine stride a found her black stripper shorts and a tight pink tank top. Looking at the items, he put them on noticing how perfectly they fit. Cindy was shocked that not only her son but now her husband were aware of her trick. <br>\r\n<br>\r\n\"Honey, like I told Alex I just needed a break from my life and thought this looked like a fun one to try. I was going to switch back eventually. You weren't supposed to find out.\" She put her jeans back on and started to look for a shirt. Robert looked at her in shock. \"Yeah our son knows. He followed me. He's inside right now probably watching this whole thing.\" <br>\r\n<br>\r\n\"You mean he can see me wearing this?\" Robert asked Cindy, pointing to his short shorts. \"Just like I saw a man walking around our house in your dress?!\" Robert yelled.<br>\r\n<br>\r\n\"Well yes, I don't know how he can see us in our original bodies, but everyone else will see you as Carla, the black whore.\" Cindy had to try to keep from laughing. \"What do you want to do Robert? Should we explain this to him or finish what Roy and Carla started?\"</span></div></div>",
            "created":1456808400,
            "id":2111657,
            "title":"Turned into Robert"
        },
        "115332122111212122":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "The car ride home",
                "Your father is in the car"
            ],
            "content":"<div class=\"\"><div> <span>Roy was so upset Alex found him again, right when she was about to get off. All that frustration turned into road rage, plus she was still kinda drunk. That made the car ride very fast, loud and not the best environment to explain whats going on. \"I'll tell her once we are inside her apartment.\" Alex thought as they speed through the dark town. <br>\r\n<br>\r\nIt didn't take long for them to get to Roy's place and when they did, Alex spotted a familiar mini van. \"Perfect! Your mother is here.\" Roy said in a half drunken slur. She opened her truck door and stumbled out. \"Looks like, you're doing well 'Cindy'.\" Roy laughed looking at the man in front of him. He was wearing her silk floral sleeveless blouse with a tan pencil skirt. A white pearl necklace was around his neck half covered by his beard. Cindy put his hands and his hips and Roy noticed what was once her wedding ring. <br>\r\n<br>\r\nWalking closer in his wedged sandals he looked at Roy and said, \"I'll be taking my son home now Roy.\" He could smell the bose on her breath and she could smell his perfume. \"Billy's Beers and Broads I take it?\" He said in disapproval, but halfway laughing. \"Get in the car Alex. I don't want this drunk man driving around town with you.\" Alex looked towards his real mother and she waved him off. As Alex hopped in the van he heard Cindy say, \"Well your obviously too drunk to understand this lady, but this is my life now, and that's my son. If you want to talk more about, you know where I live.\"  <br>\r\n<br>\r\nAnd with that Alex road home with his new mother....    </span></div></div>",
            "created":1456808400,
            "id":2111669,
            "title":"Cindy was waiting. "
        },
        "11533212211122":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Leave her be and let her enjoy",
                "Force her to swap back"
            ],
            "content":"<div class=\"\"><div> <span>\"No thanks guys, I'll catch next time. I need to spend time with my wife.\" She said waving off her new friends. She dusted off her muddy jeans and got in her truck. Alex new he had to follow her, but he was only on his bike. Luckily he knew the neighborhood well enough to follow through the trails and back roads. After a while, finally Roy arrived at her house, or more accurately her trailer. \"Good to be home.\" She said smiling as she walked up to the front porch. She took of her muddy boots and looked out onto her property. She was loving her new life. It was so much more simple and now that she was the man, she felt more in charge. She took one last breath of peace when the front door opened.<br>\r\n<br>\r\n\"Daddy daddy daddy!!!!\" yelled her new son. \"Daddy your home!\" He ran up and hugged him on the leg.<br>\r\n<br>\r\n\"Hey there tiger!\" Roy said picking up the little boy. She tossed his hair around and hugged him. \"Is your mother around? Whats she cooking? It smells great lets go inside!\" She said as the two of them walked into the trailer.<br>\r\n<br>\r\nAlex was shocked! \"Were we really that bad?!\" He thought to himself. His father always worked late and his sister was never home. Hell, he wasn't the model son, always getting in and out of trouble, but were they really that bad. So bad, their own mother wanted to switch her life with this random 50 year old man? He looked through the window and saw the family of three sit down for dinner. Roy's wife came and kissed her on the cheek as she began serving her new 10 year old son. He was all excited to hear about his father's fun day at the construction site. She was more than happy to tell him all about it. \"Wow, she really looks happy.\" Alex thought as he began to walk away....<br>\r\n<br>\r\n  </span></div></div>",
            "created":1456808400,
            "id":2111679,
            "title":"Nah i gotta see my wife and kid"
        },
        "115332122111221":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "Stacey doesn't notice anything unusual",
                "Stacey doesn't recognise the man in her mother's clothes",
                "It's not Stacey, but someone else inhabiting her life"
            ],
            "content":"<div class=\"\"><div> <span>It wasn't too late, so Alex decided to head home. \"If this is what she wants, I'll just let her be for the time being.\"<br>\r\n<br>\r\nAs soon as Alex arrived back home, he was greeted by \"Cindy\", who had just finished a run on her treadmill. She was wearing a tank top and leggings that came down above her ankles.<br>\r\n<br>\r\n\"Hey Alex, how was your day?\" \"Cindy\" asked.<br>\r\n<br>\r\n\"Uh, not too bad\", Alex responded, trying to avoid betraying his disgust at the man in his mother's jogging outfit. \"I uh, saw that my original mom was happy in your previous life. So I thought I'd just leave her be for the moment.\"<br>\r\n<br>\r\n\"Well, listen,\" Cindy said. \"I thought it over, and I decided that it's okay if you want to keep in contact with your real mother. I guess I shouldn't have been so smug about keeping your mother's life.\"<br>\r\n<br>\r\nYou felt a bit better. Maybe this wouldn't be so bad after all.<br>\r\n<br>\r\nLater on, you heard a car pulling up and stopping near your house. You looked out the window, and saw someone getting out of the car. You figured it must be Stacy, your older sister, having spent most of the day with her boyfriend. \"Well,\" you thought. \"Let's see how Stacy deals with this\" as she enters the house.</span></div></div>",
            "created":1458363600,
            "id":2119909,
            "title":"Leave her be and let her enjoy"
        },
        "1153321221112211":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Stacey yelled",
                "Alex yelled"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Mom, hey dork!\" Stacey said walking into the kitchen. \"Wow mom you look great!\" <br>\r\n<br>\r\nCindy patted her hairy belly and pulled on her leggings. \"Thanks sweetheart, I'm running more every day!\" Cindy turned his beared head over to her son and winked. <br>\r\n<br>\r\n\"You're going to look great in your new swimsuit!\" Stacey said with a smile. \"Mom did you do a load of laundry?\" She walked I to the laundry to look. Cindy followed close by. <br>\r\n<br>\r\n\"Yes sweetie, but it's only our delicates.\" Cindy said, taking the wash full of women's panties and bras into a basket and bringing it back out. As she passed by her son a pair of her navy blue nylon panties fell. \"Oops sorry kid. I won't make you fold your own mother's panties\" he said with a pervert grin. \"At least not yet.\" <br>\r\n<br>\r\n\"Mom....\"</span></div></div>",
            "created":1533439260,
            "id":2529158,
            "title":"Stacey doesn't notice anything unusual"
        },
        "1153321221112213":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "A woman in her mid-30s",
                "Another teenage boy",
                "A 12-year-old girl"
            ],
            "content":"<div class=\"\"><div> <span>You were completely taken aback by the person now inhabiting your older sister's life. \"Stacy\" was wearing a low-cut grey T-shirt, denim skirt and sandals, nothing out of the unusual. What was out of the unusual was the person wearing her clothes...</span></div></div>",
            "created":1458363600,
            "id":2119925,
            "title":"It's not Stacy, but someone else inhabitin..."
        },
        "11533212211122133":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "His sister",
                "His father"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey mom!\" Stacy said with joy as she walked into the house. She paid zero mind at the fact her mother was now a man. Cindy didn't happen to notice there was a 12 year old dressed like a 23 year old woman. \"I'm not staying long, I just came but to grab somethings. I have Emily in the car. Mom did you finish the laundry?\" <br>\r\n<br>\r\nCindy was taking a big glup of water with his hand on his hip, and pointed to the table where there was a pile of nearly folded clothes. \"I just finished it this morning Stacy. What do you need?\"<br>\r\n<br>\r\n\"I'm taking Emily to the beach. I need my bikini and beach clothes.\" She said talking with her new manly mother. Alex took used this moment to investgate. He walked outside to Stacys car, which now being driven but this 12 year old. <br>\r\n<br>\r\nIn the back seat he found...</span></div></div>",
            "created":1458450000,
            "id":2120158,
            "title":"A 12-year-old girl"
        },
        "115332122111221331":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Kayla, his girlfriend",
                "Mrs. Conway, the sexy next door milf"
            ],
            "content":"<div class=\"\"><div> <span>Alex looked into the back seat of his sister's car to see his real sister, coloring. Her matured 23 year old body was squeezed into a preteen's swim suit. It wasn't a bikini, it was more like a one piece but a skirt built in. It was teal, and white stripped with her C cup breast pushing out. She had a white backpack filled with certain little girl things. Alex wondered if he should talk to her, but before he did the garbage truck pulled up. <br>\r\n<br>\r\nOut walked....</span></div></div>",
            "created":1458450000,
            "id":2120162,
            "title":"His sister"
        },
        "115332122111221332":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Back inside",
                "Stacy and Emily"
            ],
            "content":"<div class=\"\"><div> <span>\"Dad!\" Alex yelled as his father looked up laughing. His father was such a manly man. 6 Foot 1 with a slight beard and very tan and fit, but now he has on a preteen purple Jonas Brothers shirt and a small white skirt. He was listening to their new album at full volume as he rolled his window down. \"Dad, what is God's name is going on!\" <br>\r\n<br>\r\n\"Alex just relax will you. This is just a temporary thing, plus this wasn't really even my choice.\" the man said increasing his hairy legs. <br>\r\n<br>\r\n\"What do you mean, not your choice?! Did you know mom is a man?!\" Alex yelled at full volume. <br>\r\n<br>\r\n\"Yes! and I'm a preteen girl! Look how I'm dressed. Your mother and I need a break. Just call me Emily now.\" he side rolling up the window. Stacy came walking by and hopped in the car...</span></div></div>",
            "created":1458450000,
            "id":2120160,
            "title":"His father"
        },
        "115332122111222":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "An akward car ride",
                "Back home"
            ],
            "content":"<div class=\"\"><div> <span>Alex waited outside pacing just offside the drive. All he could think of is how insulted he was. \"How could she want this?! How could she hate us all so much.\" he mumbled to himself. At long last he looked at his watch. it was well past 8, and completely dark out. The light around was the small porch light with bugs humming by it. <br>\r\n<br>\r\nHe was so upset he marched up to porch a wrapped his hand on the door. A little lady in a peach colored gown answered, \"Hello, may I help you?\" <br>\r\n<br>\r\n\"Yeah I need to have a word with my mom....Roy for a second.\" Alex demanded. <br>\r\n<br>\r\n\"Hunny who is it\" Alex heard his mom say. She walked up to the door behind her new wife and put her arm around her to comfort her. Alex saw she was only in her briefs and a wife beater. \"Oh sit down Lillian, I know what this is about.\" <br>\r\n<br>\r\nRoy stepped out the front door into her porch in just her under clothes. She odded back to Lillian letting her know everything is ok and that she'll handel it. \"What the he'll mom!\" Alex shouted once the front door was closed. \"Why the he'll would you leave us? Are we really that bad?!\" <br>\r\n<br>\r\nRoy stood there with shock and anger in her eyes. \"All I want is some time to relax and explore this opportunity Alex.\" She looked over at her son who had tears in his eyes. \"Get this through your head, I am Roy now. I am no longer your mother Alex. I have a loving wife and a respectable 10 year old son. The more you show up and complain the longer this will take!\" She was telling so loud, Lillian came back out to see if everything is ok. The young boy jumped off the porch to join his father. <br>\r\n<br>\r\n\"Everything is fine Lillan. Look take jounior back into the house. I have to drive this kid to his house. Can you get me my jeans and keys.\" Roy said, guieding her son to his mother. <br>\r\n<br>\r\n\"Of course sweetie.\" Lillian said handing Roy her requested items. \"Come along RJ.\" She said bringing the child inside. <br>\r\n<br>\r\n\"RJ?\" Alex asked as he watched his mom pull up her Jean over her boxer briefs. She bent over, exposing her chest as she tided up her muddy boats. She grabbed her dusty coat from the railing and got in the truck.<br>\r\n<br>\r\n\"Yup his names after me, Roy Sr.\" She said as Alex got in.</span></div></div>",
            "created":1456808400,
            "id":2111854,
            "title":"Force her to swap back"
        },
        "1153321221112222":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Roy Accepts",
                "Roy Declines"
            ],
            "content":"<div class=\"\"><div> <span>The drive home was silent and awkward. Roy didn't say a word to Alex. Its as if they were two complete strangers. Roy lit a cigarette at a stop light. Alex just looked and shook his head. \"Do you have something to say Alex?\" She said annoyed. Alex shock his head and kept his mouth shut until they got in the drive way. \"Well, we are here.\" she said opening the car door.\" <br>\r\n<br>\r\nAlex got out and tried one last attempt. \"Look around mom look we are home! There's your rose garden you you tend to every weekend, and over there. There's the mailbox you painted. This, this is your VW Bug that you drive.\" <br>\r\n<br>\r\n\"Alex stop. I don't want any of that right now. All I want is to hop in my truck, take off my boots and get in bed with my wife. Its almost 10 and my boss wants be on site by 6am. Now come on I'll walk you to your door.\" She side just as Alex's parent came out. His father Robert, dressed very similar to Roy, and his new mother Cindy. He came out in a light pink robe covering a matching night gown that stopped just before his hairy knees. <br>\r\n<br>\r\n\"Alex where have you been we were worried sick!\" Cindy yelled in his baritone voice. He gingerly tip toed toward Alex on the cold concrete driveway. The wind was blowing his beard into the lace neckline on his robe. He had to keep his hands at his side to keep the wind from blowing his gown up. \"Thank you sir.\" He smiled at Roy. <br>\r\n<br>\r\nThe two both exchanged glances and smiles indicating they knew what was really going on. \"Roy Patterson\" She said shaking Cindy's large hairy hand. <br>\r\n<br>\r\n\"Cindy Carmichael, and this is my loving husband Robert.\" He said holding Robert's hand. \"Thank you for bringing my son home. Would you care to come in for some coffee?\" </span></div></div>",
            "created":1456808400,
            "id":2111879,
            "title":"Back home"
        },
        "11533212211122221":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Continue ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"You know what ma'am, I would love one.\" Roy said winking at Cindy. Cindy caught the look and knew this would be too much fun to pass up.<br>\r\n<br>\r\n\"Excellent!\" He said getting all excited. \"Robert sweetie, you have a big day tomorrow. Why don't you Head upstairs and get to sleep. This won't be a long visit.\" He said to Robert's appoval. Robert smiled as Cindy kissed his loving husband and sent him away. Now, with him out of the way the two of them could brake relax their roles. <br>\r\n<br>\r\n\"Haha! Funny seeing you kiss my old husband!\" Roy laughed walking towards Cindy. \"You look pretty cold.\" <br>\r\n<br>\r\n\"I'm frezzing in this gown. Come on Alex, let's get inside so we can all talk.\" Cindy said putting his hairy arm around his new son.</span></div></div>",
            "created":1457586000,
            "id":2115468,
            "title":"Roy Accepts"
        },
        "115332122111222211":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Let make this permanent ",
                "Alex interrupts "
            ],
            "content":"<div class=\"\"><div> <span>\"You know how against this I was from the start 'Roy'.\" Cindy said as he walked inside. \"But wow this is so much fun!\" He smiled as Roy closed the door behind him. \"Alex sweet heart, go put on a fresh pot of coffee while Roy and I catch up.\" Alex rolled his eyes and made his way into the kitchen were he saw a big pile of newly folded clothes. A mixture of the whole families, but a large pile of his new mother's intimates. Slips, bras, panties, some skirts and Cindy's running attire all now fitted to his new frame. Trying hard not to think about it, Alex began to make coffee.<br>\r\n<br>\r\nMean while in the other room, Roy and Cindy were all smiles. \"Strange, I can barley remember that day.\" Roy said looking at a picture of Cindy and Robert's wedding day. Now handsome Robert stood next to a 50 year old bearded man in a lovely white wedding gown. The same thing was true in the next picture. Roy was having a hard time with his old memories. \"Hmm, i guess that they are his now.\" She mumbled after looking at Cindy Carmichael's beach photo. He looked odd doing a sexy pose with his hairy beer gut over his bikini. <br>\r\n<br>\r\n\"Oh that was me, feeling sexy down in San Padre island.\" Cindy said referring to the picture. He glided over to the couch and gently sat down crossing his legs. \"My husband and I went there 3 years ago for our anniversary. Alex was with his grand parents for the week.\" He welcomed Roy to have a seat, but she was more comfortable standing. <br>\r\n<br>\r\n\"Funny hearing you call him your husband.\" Roy said. \"Oh sorry mam'am I should have taken my shoes off.\" She quickly pulled them off and kicked them towards the door. Looking back at Cindy, she started to laugh.\"Hahaha. This is excellent! I love these, jeans I love these holy socks, I love my new wife. This is so fun, I even enjoy this job at the construction site!\"<br>\r\n<br>\r\n\"I know what you mean!\" Cindy said tossing his night gown around. \"I was hesitant at first but this feels amazing.\" He walked into the kitchen to show her his neatly folded clothes.\"Look at these, these are mine now.\" He said holding up a pair of light blue satin panties.<br>\r\n<br>\r\nRoy laughed and unbuttoned her jeans to show her new briefs. \"I know I know, look, these are mine now!\" She laughed re-doing her belt buckle. \"Oh I just love this!\" she finished letting her excitement come to an end. </span></div></div>",
            "created":1457586000,
            "id":2115603,
            "title":"Continue "
        },
        "11533212211122222":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Night time at the Pattersons",
                "Night time at the Carmicaels"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh thank you ma'am, but I really need to get going. It's late and I have a lovely wife waiting for me. It's past 10 and I'm do at work by 6.\" Roy said as she opened her truck door. She was about to leave when Cindy walked up close. <br>\r\n<br>\r\n\"We simply have to thank you some how for returning our son to us.\" He said as wind snuck up his backside making him shiver. \"Maybe you and your wife could join us out to dinner tomorrow night at the Raddish Hare Club. Do you know it? The one downtown? It would be our great.\" Roy and Cindy stared at each other. This would give the Old Roy a chance to get into the Old Cindy's lovely dress attire. Like was Old Cindy could find a nice shirt and tie that Old Roy owned and show off her new wife. Both loved the idea, and smiled. <br>\r\n<br>\r\n\"Well that sounds great ma'am. My wife Lillian and I would love to join you and your husband.\" Roy said turning her loud dusty truck on. \"We'll be there at 7.\" she said backing out.<br>\r\n<br>\r\n\"Sounds great!\" Cindy said said as he watched drive away. <br>\r\n<br>\r\n\"There goes my mom.\" Alex muttered as he walked inside. </span></div></div>",
            "created":1456808400,
            "id":2111885,
            "title":"Roy Declines"
        },
        "115332122111222221":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "The next morning",
                "Srrange nightmears"
            ],
            "content":"<div class=\"\"><div> <span>During the drive back to her house Roy thought about the real he just made with his old life. \"What will he even wear?\" She thought out loud picturing Cindy, in one of his black dresses. \"No no that's too formal\" she lagged picturing him in the matching tights. \"He could wear that...\" She thought, now picturing him in her green and white floral print dress. The idea had her turned on. <br>\r\n<br>\r\nShe pulled into her driveway and took a look at her trailer. Taking off her dusty coat and boots she looked up at the stars and smiled. Once she got into her house she was created by her wife Lilian. \"I put Roy Junior to sleep.\" she said creating her with a loving kiss. \"What was that all about Roy?\" <br>\r\n<br>\r\nRoy looked at Lillian and noticed she had on the same night gown as Cindy Patterson, only Cindy's was light pink. Lillians was more peach colored. \"Oh that was just some kid who followed me around the sight today Lillian. Nothing to worry about.\" She started to undress and got down to just her under clothes again. \"We've been invited out to dinner tomorrow with the kids family. It's on them if you want to go.\" <br>\r\n<br>\r\nThe two walked over to their bedroom and hopped into bed. Roy took her shirt off and laid down next to her wife. She put her arm around her and pressed her breasts against the silk back of her night gown. \"We will need a sitter for RJ.\" Lillian said as they held each other right.<br>\r\n<br>\r\n\"That's fine sweetie.\" Roy yawned. \"I need to be up in six hours. Goodnight\" she said finally closing her eyes after an exhaughting first day as Roy Patternson.</span></div></div>",
            "created":1456894800,
            "id":2111961,
            "title":"Night time at the Pattersons"
        },
        "115332122111222222":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "The next morning",
                "Cindy and Robert"
            ],
            "content":"<div class=\"\"><div> <span>\"Alex, you are grounded. Now I'm going to bed. My flight to LA leaves bright and early. No TV until I get back.\" Robert, Alex's father barked the moment they got into the house. He marched up the steps and entered his bedroom leaving Alex and the old Roy alone in the living room. <br>\r\n<br>\r\n\"Your punishment will be a lot worse than that Buddy.\" Cindy smiled with a half toothless grin. \"Wait until he leaves tomorrow, I'll have a surprise for you.\" He walked into the kitchen with his nightgown following behind him. \"Didn't you see the look your mother gave me, she loves this! \" <br>\r\n<br>\r\n\"Yeah well I don't!\" Alex barked as Cindy sat down. He tried to clothes his legs but his penis stoped him. He lifted up his gown so he could sit more comfortably. \"Can you not flash my mother's panties!\"<br>\r\n<br>\r\nCindy looked down and smiled say, \"No, I like sitting this way.\" then ajusted the lace light purple trim.. \"You better get upstairs before your father starts yelling again.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1457154000,
            "id":2113458,
            "title":"Night time at the Carmicaels"
        },
        "1153321221112222221":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "He shows her",
                "he refuses"
            ],
            "content":"<div class=\"\"><div> <span>\"Wake up kid!\" Cindy said as Alex slowly came to. He was awoken to a dreadful site. His new mother stood there in a dark deep red pair of panties with her hairy belly over hanging. Matching bra streched across her chest with nothing to hold. There was a woman next to her. Not bad looking and in her mid thirties wearing tight tight Jean shorts and a pink tank top. Be breasts were big, and a white lacey bra could be seen under her tank top. \"Alex. Son, this is Charlotte\" <br>\r\n<br>\r\n\"What the he'll are you doing! You can't just have strippers over at our house.\" Alex yelled getting out of bed. \"And cover yourself up!\" Alex tossed Cindy a white silk bathrobe, then walked out into the hall. Cindy soon followed. <br>\r\n<br>\r\n\"Look kid, that's my hooker, and she needs some help. You are going through that door hallway together.\" Cindy said forcing Alex up to the wall. <br>\r\n<br>\r\n\"Ew what? You want her to be a me? Why?\" Alex said breaking free and heading to his parents room. He was trying to find his father but then remebered his trip. \"Dam it\"<br>\r\n<br>\r\n\"Dam it is right.\" Cindy said closing the bedroom door. He walked over to his new walk in closet and began undressing out of his robe and panties. \"I wanted her to switch lives with your father but since he left, that leaves you.\" <br>\r\n<br>\r\n\"Well what if I don't want to be a hooker!\" Alex yelled. At this put Cindy had squeezed his hairy legs into a pair of black control top panties and just hooked a black and white trim bra to his hairy chest. <br>\r\n<br>\r\n\"That's too dam bad!\" Cindy yelled walking out of the closet and into Alex's face. Just then Charlotte walked in.<br>\r\n<br>\r\n\"Sorry, Cindy is it? Look, I don't know how you know about me a Roy Patterson, but I think I'm just going to leave. Your house is very lovely.\" Cindy ran over to Charlotte and grabbed her arm with his big hairy hand.<br>\r\n<br>\r\n\"Nah baby nah you gotta stay just for one quick minute. Alex quickly, show her the hallway.\"</span></div></div>",
            "created":1470286800,
            "id":2190980,
            "title":"The next morning"
        },
        "1153322":{
            "author_id":"damaho1",
            "author_name":"Mr. Scratch",
            "choices":[
                "How do you know I'm not your mom?",
                "What are you talking about?"
            ],
            "content":"<div class=\"\"><div> <span>You looked closer and saw a teenage girl at around 16 in your moms clothes. \"What the...\", you thought.<br>\r\n<br>\r\nYou slowly sat down at the table and looked at the girl. She had midlength red hair and was wearing one you your moms bathrobes and was making breakfast.<br>\r\n<br>\r\n\"Er-Mom?\", you unsurely asked. She turned around and looked at you. \"Oh, good morning, sweetie.\", she smiled at you. \"What happened to you?\", you asked her. \"What do you mean?\". \"Well, you look not like my mom at all!\".<br>\r\n<br>\r\nShe responded:</span></div></div>",
            "created":1268197200,
            "id":848935,
            "title":"You find a teenage girl in your mother's cl..."
        },
        "11533221":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "You suggest that you spend the day somewhere else",
                "You two stay and talk a bit more for now"
            ],
            "content":"<div class=\"\"><div> <span>The girl looks surprised. \"How do you know I'm not you mom?\" she asks you.<br>\r\n<br>\r\n\"I've been to the Hallway, too.\" you tell her. \"I just saw my own door, and decided to try that one for now.\"<br>\r\n<br>\r\n\"So I guess I'm not the only person to discover that place.\" she says. \"How long have you been using the place? This is the second life I'm trying out through that place.\"<br>\r\n<br>\r\n\"I actually just found it. The first door I went through was my own.\"<br>\r\n<br>\r\n\"Really?\" she asks and you nod in affirmation.<br>\r\n<br>\r\n\"So how long have been in my mother's life?\" you ask her.<br>\r\n<br>\r\n\"Just started.\" she tells you.<br>\r\n<br>\r\n\"I see.\" you say. \"Well, since theres nothing we can do about it for now, what do you want to do, \"Mom\".\"<br>\r\n<br>\r\nThe girl laughs a bit before saying \"I don't know. I just picked your mom's life on a whim.\"</span></div></div>",
            "created":1269406800,
            "id":855962,
            "title":"How do you know I'm not your mom?"
        },
        "115332211":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "Like this",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"You wanna go spend some time together?\"   you ask her.<br>\r\n<br>\r\n\"Sure, but like this or as someoneelse in the hall?\"</span></div></span></div>",
            "created":1283317200,
            "id":948246,
            "title":"You suggest that you spend the day somewhere else"
        },
        "1153322112":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Deal with it",
                "Hang out with 'Michelle'"
            ],
            "content":"<div class=\"\"><div> <span>you decide to spend time together as other people so you both go to the hallway,<br>\r\n<br>\r\nthere, you find a pair of twins, Taylor and Michelle,<br>\r\n<br>\r\n\"hey how about we be twins that should be fun,\" michelle says<br>\r\n<br>\r\nyou agree, and you go into Alex's door<br>\r\n<br>\r\nThe next thing you know your in a room you don't recognize next to a cute 15 year old girl, you look down at yourself and see your wearing a dress!  You run and find a mirror and see an exact copy of the girl next to you when you woke, that must be the girl from earlier, now Michelle, and you're Alex or Alexandra</span></div></div>",
            "created":1295845200,
            "id":1041481,
            "title":"someone else"
        },
        "11533221121":{
            "author_id":"swapgirl",
            "author_name":"swapgirl",
            "choices":[
                "You decide to give it a try... it might be interesting to try life as a girl",
                "You can't do it.... you want to go back to the hallway"
            ],
            "content":"<div class=\"\"><div> <span>You stare in amazement into the mirror, into the face of a girl who looks nothing like you, and yet who is wearing the same dress as you and who is mirroring your every movement.  You glance down in awkward embarassment at the dress you're wearing... a summery pink dress with a floral pattern.  Held up by two slender spaghetti straps and stopping a few inches above your knees, it leaves you feeling uncomfortably exposed.  It's not exactly indecent, at least not on a girl like the one in the mirror--you see girls wearing dresses like this all the time--but it's a lot less fabric than you're used to wearing, and it makes you feel uncomfortably exposed.<br>\r\n<br>\r\nLooking back up at the reflection, you're amazed to see how perfectly the girl in the mirror matches your movements.  Every expression, every blink, every little motion of your body, she matches.  She's even blushing as furiously as you are.  This is your first time through a doorway in the hall, your first time living someone else's life, your first time seeing an unfamiliar reflection in the mirror... and it's by far the strangest thing you've ever experienced in your life.  The pretty blonde girl in the mirror...that's YOU.   You're HER.  And while you still see yourself as a guy, to everyone else in the world, you look like a girl.  That's a weird, weird thought, and you're not sure you're comfortable with it.<br>\r\n<br>\r\nAnother girl sidles up next to you in the mirror.  She's an exact copy of the girl whose life you're currently inhabiting... her long blonde hair is styled a little differently, and there's a small scar above her left eyebrow, but otherwise, the two girls are identical.<br>\r\n<br>\r\nIdentical in body, that is.  But in dress, the two girls look very different indeed.  Whereas you're dressed in a flirty and feminine dress, complete with a necklace and bracelets and earrings, and your hair is perfectly coiffed and your face is expertly made up, your twin is dressed much more painly, in a Clash t-shirt and jeans--albeit in a feminine cut--and her hair is much less styled and her makeup is much plainer.  The stereotype about twins is that they always dress and act exactly alike, but these girls seem to have gone to some length to differentiate themselves.<br>\r\n<br>\r\n\"Wow, look at us,\" the other girl said.  \"We're HOT.\"  She begins striking poses.  You look away from the mirror to the girl standing next to you, and instead of the blonde twin in the mirror, you see the willowy redheaded girl you found wearing your clothing just a few minutes before, dressed in the same Clash t-shirt and jeans.    As she vamps in front of the mirror, her reflection matches her every pose.<br>\r\n<br>\r\nShe is right.  The two of you are absolutely gorgeous... you're every teenage boy's dream girl.  With your pretty dress and perfect hair, you look like a model from the cover of one of those magazines you always see girls reading.  Your body is amazing, your face breathtaking, your smooth  skin and silky hair and deep blue eyes perfect.  And even with her simpler style, your twin is nearly as beautiful... the very model of a hot rock chick.<br>\r\n<br>\r\n\"But...\"'  You stop, surprised to see your feminine reflection mouth your words.  \"But why do I have to be a GIRL?  I don't want to be a girl!\"<br>\r\n<br>\r\nThe girl stops her posing, a surprised look crossing her face.  \"I thought you knew you were going to be a girl.  I said we were going to be twins, right?\"<br>\r\n<br>\r\n\"Yeah,\" you say, \"but I thought we were going to be fraternal twins.  Like, a boy and a girl.  aylor can be a boy's name.  I have a friend named Taylor.  That's why I picked Taylor's door instead of Michelle's...\"<br>\r\n<br>\r\nThe girl studies you for a moment, then her eyes widen.  \"This is your first time, isn't it?  As a girl.  This is the first time you've been through a girl's door.\"<br>\r\n<br>\r\n\"This is my first time through ANY door,\" you say.  I just found out about the hallway.\"  You think for a moment.  \"Wait... have you been a boy before?\"<br>\r\n<br>\r\nShe shrugs.  \"A few times, sure.  It's kinda fun... seeing how the other half lives.\"<br>\r\n<br>\r\nYou walk back to the bed where you were sitting when you first walked through Taylor's door and flop down,, frowning as you see that her sheets are pink and covered with kittens, a sharp contrast to your \"sister's\" pplain black sheets.  The room seems to be split roughly in half, with Taylor's stuff on one side and Michelle's stuff on the other... and there's a stark difference between the two sides.  Taylor's side--your side--is pink and fluffy, with posters of good-looking men and beautiful women, and a picture of one of those guys from Twilight.  There's a collection of small pictures grouped together on the wall; looking more closely, you see they're pictures of a dance team, with several girls in slinky leotards, Taylor included.  Michelle's side, by contrast, has a guitar leaning against the wall and pictures of rock bands, and a poster from the Lord of the Rings movies.  There's a collection of trophies on her dresser; squinting to get a better look, you see they appear to be for softball.<br>\r\n<br>\r\nThere's a big closet on your side of the room.  Getting up and walking over to it, you throw open the doors and see that it, too, appears to be divided in half,  There's no mistaking whose side is whose... Taylor's side is frilly and girly, with a lot of dresses and skirts and ots and lots of pastels.  Michelle's side, on the oother hand, has mostly jeans, t-shirts, and tank tops, with juust a couple of more formal dresses mixed in.<br>\r\n<br>\r\n\"Jeeze,\" you say,\"if we did both have to be girls, how did you end up as the tomboy and me as the girly-girl?\"<br>\r\n<br>\r\n\"Look,\" the other girl says, \"being a girl isn't so bad.  Trust me,\" she adds with a wry smile, \"I have lots of experience.  You should give it a try... you might have fun.  After all, how many people get the opportunity to experience life as the opposite sex?  Can you really pass up that opportunity?\"<br>\r\n<br>\r\n\"But... but I don't know HOW to be a girl,\" you say.<br>\r\n<br>\r\nThe girl grins.  \"I can teach you.\"<br>\r\n<br>\r\nYou hesitate.  \"I... I don't even know your name...\"<br>\r\n<br>\r\n\"I'm Amy,\" she says.  \"Only,  I guess I'm Michelle now.\"<br>\r\n<br>\r\n\"I'm...\"<br>\r\n<br>\r\n\"Alex, I know,\" she says, smiling.  \"I was your mother for a li8ttle while, after all.\"<br>\r\n<br>\r\nYou turn back to the mirror and stare at your pretty, feminine reflection for a long time.<br>\r\n<br>\r\n\"So,\" Amy says at last, \"what's it going to be?\"</span></div></div>",
            "created":1297141200,
            "id":1049959,
            "title":"Dealing with it"
        },
        "115332211211":{
            "author_id":"swapgirl",
            "author_name":"swapgirl",
            "choices":[
                "You want to start out here in Taylor and Michelle's bedroom",
                "You want to go to the mall"
            ],
            "content":"<div class=\"\"><div> <span>Amy does have a point.  This is an opportunity to see how the other half lives.  It would give you a great perspective on girls, on how they live and think, and it would help you grow as a person.  You're sure it's probably going to be awkward and embarassing, but you can't pass this chance up.<br>\r\n<br>\r\n\"Okay,\" you say, giving Amy a shy smile.  \"I'll do it.  I'll try being a girl.  But you will have to teach me.\"<br>\r\n<br>\r\n\"Great!\" Amy says, leaping to her feet and taking your hands.  \"We'll start right away.\"<br>\r\n<br>\r\nShe walks you over to the mirror, and you're again struck by the unspeakable strangeness of seeing a girl stare back at you.  You're blushing--blushing hard--and you realize that it makes your reflection even cuter.  Lifting a hand, you brush a few strands of long golden hair out of Taylor's face and study her intently.  Then, as you watch her eyebrows wrinkle into a studious gaze, you break into a smile.<br>\r\n<br>\r\nLooking at Michelle's reflection, at the lookalike standing next to you--identical in face, in body, in height, in weight--you realize you feel a strange kind of kinship with Amy.  It's not like anything you've felt before.  It's different than friendship, different than a crush, and it's strange that you feel this way about someone you've just met.  Maybe it's because you share the secret of the Hallway.  Maybe it's some kind of residual twin bond seeping through from Taylor and Michelle's lives into your subconscious.  Hiding behind identical reflections, posing as sisters, both pretending to be someone you're not, the two of you are somehow the same.<br>\r\n<br>\r\n\"God, I don't know where to begin,\" Amy says.  We have to teach you how to walk, how to sit, how to move, how to talk, how to gesture, how to dress, how to put on makeup and walk in heels... there's so much you should know, Alex.  I don't even know if we should start here in our room where I can teach you in private and you can get used to being a girl, or if we should take you out into the real world .  Maybe we should take you to the mall... you can watch other girls to see how they act, and we can cruise stores and I can show you some makeup and clothes.\"  She turns from the mirror to look you in the eyes.  \"What do you think, Alex?\"</span></div></div>",
            "created":1297486800,
            "id":1052592,
            "title":"La Vie En Rose"
        },
        "115332211212":{
            "author_id":"swapgirl",
            "author_name":"swapgirl",
            "choices":[
                "\"...it's time for school.\"",
                "\"...your friends are here.\""
            ],
            "content":"<div class=\"\"><div> <span>\"No,\" you say, crossing your arms awkwardly over your chest--God, you're even wearing a bra!  \"No, I can't do it.  It's too weird.  I don't want to be a girl... not yet, anyway.  Let's go back to the Hallway.  Please.\"  You hesitate and look around the room.  \"Um... how do we do that again?\"<br>\r\n<br>\r\nAmy gives you an awkward look.  \"Um... you... can't, actually.\"<br>\r\n<br>\r\nYour heart skips a couple of beats.  \"What?\"<br>\r\n<br>\r\n\"I mean, you can,\" she says, \"but... not yet.  Remember the instructions you got?  We can't go back to the Hallway for twenty-four hours.  I know you don't want to, but... you're going to have to spend the rest of the day as Taylor.\"<br>\r\n<br>\r\nYou sit heavily down on Taylor's bed, staring wide-eyed at Amy.  Suddenly your whole body feels heavy.  A whole day as a girl.  You don't want to do this...<br>\r\n<br>\r\n\"Alex?\" Amy says meekly.  \"Alex, are you all right, hon?\"  She waits for you to respond, but you're speechless.  \"Alex,\" she goes on, \"it won't be so bad.  I promise.  Being a girl really isn't that bad.  We'll get you through the day.\"  She gives you a weak smile.  \"You might even find out you like it.\"<br>\r\n<br>\r\n\"Wait, wait a second,\" you say, \"I went in my own door earlier and I was able to leave right away.  I was only in there for a few minutes.  Why could I leave my own door but I can't leave Taylor's?\"<br>\r\n<br>\r\nAmy shrugs.  \"I guess 'cause it was your own door.  Maybe you can leave your own life whenever you want to.  But trust me, you can't leave Taylor's life yet... I've tried leaving doors before the twenty-four hours is up, and it doesn't work.\"<br>\r\n<br>\r\nYou sit silently a moment longer, your mind racing.  Then, at last, you say, \"What if we switch?\"<br>\r\n<br>\r\n\"Hmm?\"  Amy looks confused.<br>\r\n<br>\r\n\"What if we switch places,\" you say.  \"You be Taylor and I be Michelle.  I mean, we're twins, right?  Don't identical twins pretend to be each other all the time?  At least I don't have to be such a girly-girl that way.\"  Maybe it's a stretch, but you're desperate.<br>\r\n<br>\r\nAmy looks at you for a long moment, then at the mirror.  \"No...\" she says, slowly, thoughtfully.  \"No, I don't think it would work.  I'm sorry.\"<br>\r\n<br>\r\n\"Why?\"<br>\r\n<br>\r\n\"Did you get a good look at our reflections?\" She points to her eyebrow.  \"I have a scar over my eye.  You don't.  We look a lot alike, but the scar is a dead giveaway.  And besides, our hair is different, and... twins aren't really identical, you know.  There are all sorts of little differences even between identical twins.  We might fool some people, but anyone who knows us well... who knows Michelle and Taylor... they would know something was off.\"<br>\r\n<br>\r\nYour shoulders slump.  \"Well, can I at least wear some of your clothes, then?  You have all those t-shirts and jeans... I could borrow an outfit for the day.  It would be way better than this,\" you say, frowning down at your dress in disgust.<br>\r\n<br>\r\nAmy shakes her head.  \"No way.  Did you see your side of the room?  Did you see Taylor's wardrobe?  She's super-freaking-girly.  You're going to have a hard enough time convincing people you're really her.  This is your first time... pretending to be someone else is hard work.  And you don't talk like a girl or walk like a girl or move like a girl...  I mean, no one's going to think you're a guy, but people are going to know something's wrong if you don't act like a girl.  We're not going to be able to teach you how to be a girl in a day, but I think you at least need to dress the part.\"  She gives you an akward smile.  \"I know you hate it, but that dress is perfect, hon.\"<br>\r\n<br>\r\nYou groan and throw yourself back on the bed.  You hate it, but you know she's right.  \"Can I at least hide in our room all day?  I don't want to go out there as a girl.\"<br>\r\n<br>\r\n\"Hmm,\" Amy says.  \"I guess so.  I mean, probably.  As long as it's not a school day.  What day of the week is it again?  It's so hard to keep track of the days when you're in the Hallway...\"<br>\r\n<br>\r\nYou start to answer her, but before you can get any words out, there's a knock at the door, and a woman's voice calls from the other side.  \"Girls,\" it says...</span></div></div>",
            "created":1297486800,
            "id":1052593,
            "title":"Resistance Is Futile"
        },
        "1153322112122":{
            "author_id":"swapgirl",
            "author_name":"swapgirl",
            "choices":[
                "\"I want a new dress for tonight... let's go to the mall.\"",
                "\"It's a gorgeous day outside.  Let's go to the beach!\""
            ],
            "content":"<div class=\"\"><div> <span>Friends?  You seize up in panic.  You start to try to fumble for words, but Amy doesn't even miss a beat.  \"Okay, Mom,\" she says, almost without thinking, \"we'll be right there.\"  She gives you an awkward look and mouths, \"Sorry.\"<br>\r\n<br>\r\nAmy starts to stand, but before she can get up, the door bursts open and two teenage girls spill into the room.  One is a tall brunette in a t-shirt and skirt, one is a short African-American girl in a tank top and jeans, and they're both easily as pretty as you and Mich... as Taylor and... as the twins whose lives you and Amy are currently living.  \"Hey, kids,\" says the girl in the shirt and the skirt, grinning and bouncing energetically, \"we were bored out of our minds and we thought we'd come and see if you could entertain us.\"<br>\r\n<br>\r\nYou and Amy scramble to your feet, and you do your best to look casual, natural, and not at all embarassed about wearing a dress.  Shirt-and-skirt leans in and kisses Amy lightly on the cheek, and Amy, quite fluidly, kisses Shirt-and-Skirt on the cheek as well... very European.  Then Shirt-and-Skirt walks over to you and pecks you on the cheek, as though she's known you all your life and you're not a strange boy crossdressing in her friend's clothes... and you catch a whiff of her perfume, and feel the touch of her lips and the warmth of her body, and something stirs in you... and suddenly you're happier than ever that she can't see you as a boy, with all your ill-behaved boy parts.  You just hope Amy isn't paying too much attention to the drape of your dress.<br>\r\n<br>\r\nAmy and Shirt-and-Skirt sit down on Amy's bed, and they and Tank-and-Jeans start chattering away.  You watch, amazed how naturally Amy is falling in step with the conversation, even though she almost certainly doesn't understand half of what they're talking about.  You consider jumping in, but you're not sure what to say or how to say it... you feel completely in over your head, hanging out with a group of girls and being expected to act like one yourself.  So instead, you focus on watching and listening, on trying to pick up on their speech patterns and body language and trying to imitate them yourself.  In particular, you pay attention to how Shirt-and-Skirt--whose name is Laurel, yo note--is sitting, her knees close together and tucked up beneath her and her hands folded neatly over her skirt, and you try to imitate her as you sit on your own bed.  After a moment, the girl in jeans, whose name is Carmen, gets up and picks up a purple hat that's hanging from a coatrack, puts it on, and begins primping in the vanity mirror sitting between your side of the room and Amy's.  You watch her, studying the way she walks and the way she primps... but then your gaze shifts back to Laurel.  You find you can't take your eyes off her.<br>\r\n<br>\r\nSuddenly Laurel turns to you and says, \"Tay, you're awfully quiet.  Something up?\"<br>\r\n<br>\r\n\"Oh,\" you say, fumbling for an explanation, \"I'm... just in a quiet mood today.  Uh, PMS.\"<br>\r\n<br>\r\nAmy raises an eyebrow, but Laurel just grins a devilish grin and says, \"Well, you'd better not be like this tonight.\"<br>\r\n<br>\r\nTonight?  You consider asking what she means, but before you can say anything, Carmen turns and says, \"I'm bored.  We should go somewhere.\"<br>\r\n<br>\r\n\"Like where?\" Amy asks.<br>\r\n<br>\r\nLaurel, who sort of seems to be the leader of your little group, says,</span></div></div>",
            "created":1297486800,
            "id":1052594,
            "title":"Hanging With the Girls"
        },
        "11533221121221":{
            "author_id":"swapgirl",
            "author_name":"swapgirl",
            "choices":[
                "\"...we have our double date tonight.\"",
                "\"...we're going clubbing!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tonight.  There's that word again.  A little uneasy, you ask, \"Sorry, what's tonight again?\"<br>\r\n<br>\r\nLaurel looks at you and rolls her eyes.  \"You forgot?  Tay, you can be such a ditz sometimes.  You know...\"<br>\r\n</span></div></span></div>",
            "created":1297486800,
            "id":1052595,
            "title":"Tonight, Tonight"
        },
        "115332211212211":{
            "author_id":"swapgirl",
            "author_name":"swapgirl",
            "choices":[
                "You all climb into Laurel's car.",
                "You attempt one last, desperate ploy to get out of going to the mall."
            ],
            "content":"<div class=\"\"><div> <span>\"Date?\" you say weakly. You doubt she means you and her as a couple. You feel a little sick.<br>\r\n<br>\r\n\"With Sebastian and Jeff,\" Laurel says. \"You've only been talking about it all week. You're sure nothing's wrong, Tay?\"<br>\r\nYou start to say that yes, you're feeling very very sick and you think you need to stay home, but Amy jumps in before you can speak. \"She's fine,\" she says. \"She's just a little nervous.\"<br>\r\n<br>\r\nYou shoot Amy an evil look, but she just shrugs and grins back.<br>\r\n<br>\r\n\"Oh, sweetie, don't be nervous,\" Laurel says.  \"Jeff's crazy about you.\"  She gets up from Amy's bed and sits down next to you, her arm around your bare shoulders in a comforting embrace.  You blush at the closeness of her body, but you try to act natural... however much you suddenly wish you were going on this date as Sebastian, not as Laurel's friend and fellow girl.  \"You should have heard him at lunch yesterday,\" Laurel goes on.  \"He couldn't stop talking about how much he was looking forward to tonight, and how great your last date was.  He thinks the world of you.\"  She leans in closer and whispers, \"I think he's falling in love with you.\"  And as her breath tickles your ear, you feel your stomach flutter in sudden glee.<br>\r\n<br>\r\n\"Come on,\" she says, giving your shoulders one last squeeze and getting up.  \"My dress isn't going to buy itself.  And maybe we can find you an outfit that will totally knock Jeff's socks off.\"<br>\r\n<br>\r\nGreat, you think.<br>\r\n<br>\r\n\"Great!\" you say, with the most authentic smile you can muster.<br>\r\n<br>\r\nYou get up, and so do the other girls.  As your bare feet hit the floor, you realize you need some shoes.  Your eyes scan the room until at last they land on the only pair of shoes lying out... a pair of pink high-heeled shoes with a slender three-inch heel.  You pick them up in disgust, wondering how you can possibly walk in these things, but you flop reluctantly down on the bed to put them on anyway.  Before you can slip them on, though, you hear Amy say, \"Tay, hon, are these what you're looking for?\"  You look her direction and see her standing in front of the closet holding a pair of white ballet flats with a bow on the toes.<br>\r\n<br>\r\n\"Yes,\" you say, trying not to let on to Laurel and Carmen how grateful you actually are.  You walk over and take them from her, mouthing \"Thank you thank you thank you.\"  You slide your feet into the sleek feminine shoes while Amy puts on a pair of canvas sneakers.  The shoes feel strange; they fit completely differently than men's shoes.  At least you won't be staggering around on heels all day, though.<br>\r\n<br>\r\nYou grab a dainty handbag from the nightstand while Amy slings a big black purse over her shoulder.  Carmen puts the hat she's been playing with back on the coatrack, and the four of you are ready to go.</span></div></div>",
            "created":1297573200,
            "id":1053487,
            "title":"\"...we have our double date tonight.\""
        },
        "1153322112122111":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Your/Taylor's phone rings",
                "More girl talk"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>On the way there...</span></div></span></div>",
            "created":1490529840,
            "id":2294991,
            "title":"You all climb into Laurel's car."
        },
        "11533222":{
            "author_id":"forthefunofit",
            "author_name":"forthefunofit",
            "choices":[
                "Nothing eventful happens while you wait for 'Mom' to leave",
                "Something weird happens with 'Mom' before she leaves"
            ],
            "content":"<div class=\"\"><div> <span>What are you talking about?\" she said with a puzzled look on her face.<br>\r\n<br>\r\nWith that, and all that has happened recently, you began to doubt that this girl was to one to steal your mother's life. Just because this girl suddenly ended up in your moms' life, doesn't mean she was the one to steal it. For all you knew, your mother could have stolen this girl's life using the Hallway and this girl was only filling the gap in your moms' life without even knowing who she used to be.<br>\r\n<br>\r\nWith the chance that this girl could be the victim and not a thief, you made your choice. \"Sorry Mom, I bumped my head on the way home last night and ever since then I've been a little off.\" You decided to play it cool and pretend this girl was your mother until you gained a little more knowledge of the Hallway, or until this girl screwed something up and revealed herself as someone other than your mother.<br>\r\n<br>\r\n\"Aww sweetie, why don’t I finish making breakfast and you continue sleeping upstairs. I have to head out to get a few jobs done but when I get back maybe we could do something fun today?\" She gave you a motherly smile. \"Unless of course you want to do something with your friends in which case I've had this craving for a spa day, you know a little Me Time!\"<br>\r\n<br>\r\n\"You know, I might just hang out with someone today but sleeping does sound nice. If you could save me a plate for when I wake up that would be great\", you said as you headed upstairs to try and work out your new situation in your head.<br>\r\n<br>\r\nBut just before you could leave the room, your 'Mom' grabbed you by the arm. \"Oh, no you don’t! Give Mom a hug before she leaves for the day!\"<br>\r\n<br>\r\n'Oh how I wish I could' you thought as this imposter pulled you in for a tight motherly hug before finishing with a quick kiss on the cheek. \"Now hurry along, I still have to finish making breakfast, eat, shower, get dressed and clean up a little before I leave.\"<br>\r\n<br>\r\n\"Ya, sure thing Mom\", calling this girl Mom was killing you but the worst part was the kiss. If you couldn’t find a way to get this girl back in her own life and you mother back in hers, you hated to think of having to continue that for the rest of your life.<br>\r\n<br>\r\nYou went up to your room, locking your door so that your mother imposter wouldn’t barge in, and fell onto your soft bed.<br>\r\n<br>\r\nYour room was just like any other teenage boys but with an excess of books, you were a really big reader. You weren’t a nerd exactly but you always enjoyed a good mystery or adventure book before sleeping.<br>\r\n<br>\r\nYour situation was a little like a story plot and what your story needed was a good old fashioned best friend. You really needed someone to turn to and the only friend you figured would ever believe you, or at least not throw you in an insane asylum if you told the truth, was our best friend Jimmy.<br>\r\n<br>\r\nYou just had to wait for your 'Mom' to leave before you could get out of here and see your friend.<br>\r\n<br>\r\n</span></div></div>",
            "created":1368939600,
            "id":1593229,
            "title":"What are you talking about?"
        },
        "115332221":{
            "author_id":"forthefunofit",
            "author_name":"forthefunofit",
            "choices":[
                "\"This is the coolest thing ever!\" (Show him proof)",
                "\"Thats a load of bull crap. Prove it!\" "
            ],
            "content":"<div class=\"\"><div> <span>It took a while but after reading a few chapters of your favourite book, you finally heard your 'Mom' say \"Alex! I'm leaving now so be good and if you do leave the house just keep me posted and be back by dinner!\"<br>\r\n<br>\r\n\"Sure thing Mom!\" That was a classic Mom thing to say but the majority of your brain still thought it was an imposter trying to live your moms life.<br>\r\n<br>\r\nOnce you heard the door open and close you ran to your bedroom window to watch your fake mom leave.<br>\r\n<br>\r\nThe thing you were looking for was poor driving but to your surprise there was none. The girl in the drivers seat of your moms car pulled out of the drive way expertly and drove off to God knows where. You had thought that since the person living your mothers life was 16 you might be able to prove she was the one to steal your moms life if she couldn’t drive. Sure she might have a learners permit but she wouldn’t be very good. Sadly she proved you wrong.<br>\r\n<br>\r\nYou only waited a few minutes before grabbing your phone, wallet, keys and your magic Hallway key and making your way to Jim's house.<br>\r\n<br>\r\n<br>\r\nThe walk to Jims wasn’t very far so on the way you tried to gather your thoughts and sort out all the things you believed to be true<br>\r\n<br>\r\nYou hoped that Jimmy would be able to help you figure out what you were going to do about your fake mom. The thought of dealing with all of this alone scared you to death so if Jimmy believed you then that would make everything easier.<br>\r\n<br>\r\nThe tricky part would be making him believe you. Obviously you were going to tell the truth but would you have to prove yourself to him? What if, to prove yourself, you tried to switch lives with one of his sisters using the Hallway and the effects of the Hallway were too much and he didn’t see through the magic. The easiest way would be to bring him back to the cave so he could get his own key from the Hallway itself (you didn’t feel comfortable giving him yours since it was so valuable seeing as you still hadn’t really tried it out yet) and have him try out someone else's life as proof but what if he got reckless and ruined someone's life? Jimmy wasn’t the most responsible person in the world and being able to get away with any prank he could ever pull off might end up being too much temptation.<br>\r\n<br>\r\nIn truth there was no telling how Jimmy would react but after years of friendship you thought you trusted him enough to tell him your story without him screwing everything up.<br>\r\n<br>\r\nAt this point in your train of thought, you had arrived at Jimmies house and it was time to see how he would take the news.<br>\r\n<br>\r\nYou cautiously walked up to the door and knocked four times. It only took a second for Jimmies older sister Sarah to open the door. \"Hey Alex, come to see Jimmy?\"<br>\r\n<br>\r\nSarah had a bubbly personality and one of the prettiest faces you had ever seen. She was basically the ultimate girl next door but she was also 23 and completely out of your league. Not to mention she was your best friends sister which is completely off limits…usually.<br>\r\n<br>\r\n\"Ya, hey there Sarah! Is he in his room?\"<br>\r\n<br>\r\n\"Yup, hasn’t come out all day except for cereal this morning. Probably on the computer or playing video games.\"<br>\r\n<br>\r\n\"Cool\", you said as you passed by Sarah to head up the stairs.<br>\r\n<br>\r\nJimmies room was very similar to your own except while yours was full of books, Jimmies was full of video games. He was the definition of nerd but with a more mischievous sense of humor.<br>\r\n<br>\r\n\"Oh! Hey dude! What's up? Haven't seen you much this summer!\" Jimmy said when you walked through the door to his room. He was lying on his bed with a controller in his hands. The TV showed one of his favourite Xbox games.<br>\r\n<br>\r\n\"Listen, dude we need to talk. Something's come up and I'm gonna need your full attention for this\", you said trying to get to the point as quickly as possible.<br>\r\n<br>\r\n\"Umm, sure what is it?\" he said, pausing the game and directing all his focus on me.<br>\r\n<br>\r\n\"Well…I don’t really know how to tell you this lightly so I'm just going to tell you everything.\" You proceeded to tell Jimmy everything that had happened to you so far, not forgetting a single detail. <br>\r\n<br>\r\nJimmy looked at you with a blank expression, his jaw almost touching the floor. <br>\r\n<br>\r\n\"Sooo…what do you think? I am gonna need your help to try and get my mom back somehow and I figured who better to hatch a great plan than you?\"<br>\r\n<br>\r\nJimmy just looked at you and said…<br>\r\n</span></div></div>",
            "created":1368939600,
            "id":1593304,
            "title":"Enter the Best Friend"
        },
        "1153322211":{
            "author_id":"forthefunofit",
            "author_name":"forthefunofit",
            "choices":[
                "Readers Choice",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Jimmy stared at you for a full minute before answering you. <br>\r\n<br>\r\n\"Hey, personally I'm flattered that you would come to me for a brilliant plan, but first off this is some pretty heavy stuff! If your going to expect me to believe you fully then I'm gonna need some proof!\" Jimmy was visibly excited to get the opportunity to see something amazing, assuming you were telling the truth, which you were. <br>\r\n<br>\r\n\"Well...that might actually be a problem\" you said. Jimmy began to change his expression from one of excitement to one of disappointment. \"You see, I don't actually know how the Hallway works. I mean the note told me to put the key in any keyhole and I'd end up in the Hallway but I haven't really tried it yet. I just know for sure that someone is in my Mothers life and I really want my Mother back.\"<br>\r\n<br>\r\nJimmy could see that you were a little shaken up from everything that you had gone through lately so he decided to make it easier on you. <br>\r\n<br>\r\n\"How about you put it in my bathroom keyhole, since my room doesn't have one, and we can see if this bad boy works!\"<br>\r\n<br>\r\nI don't think that's really the problem though\" you said. \"What if you don't believe me after I take someone else's life? You shouldn't be able to tell the difference between me and whoevers life I decide to try out as proof.\"<br>\r\n<br>\r\n\"We could make a phrase that you would say to me so that I can know its actually you.\"<br>\r\n<br>\r\n\"That might work but you have to trust that whoever you think is telling you the phrase is actually me.\"<br>\r\n<br>\r\nJimmies excitement was growing again and you started to think he might explode from all that hyper energy. \"This is gonna be so AWESOME!! Oh! Can I try it out afterwards?\"<br>\r\n<br>\r\n\"Ya sure but the number one priority has to be getting my Mom back! Don't ever forget that!\"<br>\r\n<br>\r\n\"Don't worry, Alex. I would never forget that.\"<br>\r\n<br>\r\nAfter a quick bro hug, you told Jimmy to wait on his bed so you could leave and get back to the Hallway. Before you left you told him that whoever said to him \"Revenge is a dish best served cold\" would actually be you in their life. <br>\r\n<br>\r\nWhen you left Jimmies room and closed the bathroom door behind you, you took a moment to slouch back against the door. Jimmies bathroom wasn't the cleanest in the world but you didn't really care right now. All you could think about was the imposter living your moms life. She was probably either finishing up whatever errands she wanted to get done or she was at the spa having her 'me time' in your moms life. You really hoped she wasn't miss treating your moms life. There were so many ways this could all go to hell if this imposter got angry, annoyed or just bored with your moms life. <br>\r\n<br>\r\nFor now though you had to give Jimmy his proof so you could get his help. And with that, you turned your attention back to the bathroom door with the keyhole. <br>\r\n<br>\r\nYou inserted the key, turned it to the right and with a nervous gulp, you opened the door. </span></div></div>",
            "created":1388293200,
            "id":1716856,
            "title":"\"This is the coolest thing ever!\" (Show..."
        },
        "11533222111":{
            "author_id":"forthefunofit",
            "author_name":"forthefunofit",
            "choices":[
                "Jimmies sister Sarah",
                "Jimmies Mother"
            ],
            "content":"<div class=\"\"><div> <span>For some reason the Hallway looked a little different compared to what you remembered of it. It looked like a cross between the elegance of a red carpet affair and the comforting feel of a modern day home. <br>\r\n<br>\r\nYou felt a little more relaxed than before. The first time you entered you were close to wetting yourself with fear but now the Hallway gave off a very relaxing vibe and all you felt like doing was wandering through the halls for ages. <br>\r\n<br>\r\nBut alas you had a job to do! You put on your serious face and headed down the hall. <br>\r\n<br>\r\nThe different doors you passed all looked so interesting that it was actually becoming difficult to remind yourself that you had a mission of utmost importance on your hands.  You knew that whether you liked it or not, you would be spending a lot of time walking these halls. <br>\r\n<br>\r\nThe first door which caught your eye was that of a female Olympic gymnast. You definitely had to try that one out later. Another door led to the life of a professional football player and the one beside it was that of his girlfriend. As you kept walking you noticed that probably every person in the world had a door in this hall. One door even belonged to a woman from Greenland!  The amount of fun you could have with all these different lives was unimaginable!<br>\r\n<br>\r\nIt only took about ten minutes for you to find the doors belonging to the Holden family, Jimmies family. Directly beside them were the doors for all of Jimmies neighbors. Even your door was only a few feet away. <br>\r\n<br>\r\nBefore you decided to enter the life of one of Jimmies family members, you really wanted to try something. So you walked over to your mothers door and gave the door a push. Sadly, it didn't budge. Your mothers life must still be at the mercy of that strange girl. <br>\r\n<br>\r\nWell, if you can properly convince Jimmy to help, then you will be that much closer to saving your mother!<br>\r\n<br>\r\nYou took a quick moment to shake all your limbs in order to prepare yourself for a whole new life, and with a deep breath, you walked through a door. <br>\r\n<br>\r\nWHICH DOOR DID YOU ENTER?</span></div></div>",
            "created":1388293200,
            "id":1716863,
            "title":"Readers Choice"
        },
        "115332221112":{
            "author_id":"forthefunofit",
            "author_name":"forthefunofit",
            "choices":[
                "Readers Choice",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>When you had fully stepped through the door, you completely lost your focus. <br>\r\n<br>\r\nYou could feel yourself lying back on a couch with your feet up on a coffee table. When you opened your eyes, one glance at the clothes you were wearing told you exactly who you now were to everyone else in the world. <br>\r\n<br>\r\nYou had become Jimmies mother! <br>\r\n<br>\r\nYour reasoning for becoming Jimmies mom instead of his gorgeous sister was that Sarah had been wearing a pretty short skirt and tight tank-top which led you to believe that she might be heading out soon. You really didn't want to have to deal with her very feminine outfit or the possibility of being dragged off to hang out with Sarah's friends. <br>\r\n<br>\r\nSadly, even with Jimmies mothers life, you still had to put up with her feminine clothes. At the moment she seemed to have just come back from a run because she was wearing a tight sports bra, which now did nothing for the boobs you did not have, and a pair of running shorts. You can even feel the panties she was wearing which you now possessed.  <br>\r\n<br>\r\nAfter a quick stretch of all your suddenly sore muscles, you stood up and looked around the living room a little. Jimmies mom had been watching one of those crappy soap opera shows so you quickly turned off the TV to save yourself from the terrible dialogue.<br>\r\n<br>\r\n As you walked across the carpet you noticed three things.   One, the soft carpet felt amazing on your bare feet and toes. Two, you were now a little shorter than you used to be which made sense since you were now the height of Jimmies mom. And three, you could remember the run Jimmies mother just ran. <br>\r\n<br>\r\nIt was weird but in your head you could clearly make out the memory of you running through forests and down sidewalks only 20 minutes earlier. These were of course not your memories which meant they were Jimmies moms  memories. <br>\r\n<br>\r\nThis particular point made you think a little more. What if you could 'remember' things about the life you were in? That would help explain how the person living your mothers life was able to get past this morning without slipping up. It would also make living other people's lives a lot easier for you. <br>\r\n<br>\r\nOne thing that you really wanted to check was what your reflection now looked like in the mirror. You figured that everyone would now see you as Jimmies mom but what if everyone saw your physical male appearance and just thought of you as an adult woman.<br>\r\n<br>\r\nWhen you reached the hallway mirror, to your amazement, stood the reflection of Jimmies mom. \"This is seriously incredible!\" you said to yourself as you felt your own smooth face while watching the reflection of the woman you now were do the same. <br>\r\n<br>\r\nYou figured that at this point it would be time to go up and say the code phrase to Jimmie but one part of your brain said that right at this moment, you were the person in Jimmies life who had full control over him and with that kind of power, you could have some serious fun!<br>\r\n<br>\r\nYou changed your posture to a more straight and mature pose. With a quick fluff of your now long and flowing hair, you made your way to the stairs and to Jimmies room. <br>\r\n<br>\r\nJust outside his room, you start to think of the memory of 'you' jogging. What if you could access all of Jimmies mothers memories so that you could pull off the perfect act and really get the best of Jimmy? <br>\r\n<br>\r\nYou concentrated on the memory of the jog Jimmies mother just had, and within seconds, your brain was flooded with images from Tina's (Jimmies mother) life. <br>\r\n<br>\r\nYou saw images from her wedding, the honeymoon, raising Jimmy alone after Jimmies father left them, Tina's first time meeting you and your family and even memories from before you had been born, like memories from Tina's childhood. <br>\r\n<br>\r\nAfter what felt like forever but was probably only a couple of seconds, you were ready to screw with your friend. <br>\r\n<br>\r\nHOW DO YOU DO IT?</span></div></div>",
            "created":1388293200,
            "id":1716939,
            "title":"Jimmies Mother"
        },
        "1153322211121":{
            "author_id":"forthefunofit",
            "author_name":"forthefunofit",
            "choices":[
                "Jimmy laughs it off",
                "Jimmy doesn't notice the code phrase"
            ],
            "content":"<div class=\"\"><div> <span>Now screwing with your friend wasn't the most important thing you probably could've been doing at that moment but seeing as you had the power to have a little fun you decided to go for it. There wasn't too much of a rush with the 'Save Mom' thing, so you figured it might just be time to take a break from your stress. <br>\r\n<br>\r\nWith that final thought, you assumed your motherly pose and knocked loudly on the door. <br>\r\n<br>\r\n\"JIM HOLDEN YOU OPEN THE DOOR THIS INSTANT!\" You felt a little silly yelling at your friend like you were his mother because to you, you still had your own voice which was far from authoritative but you hoped it sounded a lot more commanding to everyone else in the world. <br>\r\n<br>\r\nJimmy opened the door a second later with the expression every teen gets when their mother calls for them; that of exasperation and boredom. \"What mom, I'm busy in here waiting for Alex to come over.\"<br>\r\n<br>\r\n\"Young man, I don't care what your doing, when your mother calls you, you listen!\" The fact that Jimmy had no idea it was you was pretty exhilarating so you kept going. \"I think it's about time you started pulling your weight around here seeing as you are the man of the house now. I didn't raise a slacker!\"<br>\r\n<br>\r\nJimmy cocked an eyebrow at you which made you question your acting ability but you hoped none of that doubt showed on your face. <br>\r\n<br>\r\n\"What's with the sudden change of heart mom? You just got back from your run and you choose this as the time to make me the real man of the house? Cant you just take a shower and we can deal with this tomorrow?\" That's the Jimmy you knew, always trying to get out of doing any kind of physical or mental work. <br>\r\n<br>\r\n\"You know what? Because of the attitude you seem to have developed, I want you to clean the entire house! Starting with my bedroom!\"<br>\r\n<br>\r\n\"MOOOOMMMM! That's completely unfair and totally uncalled for!\"<br>\r\n<br>\r\nJimmy was about to continue talking but you put out your well manicured hand and he stopped talking immediately. You were having way too much fun for your own good!<br>\r\n<br>\r\n\"I don't want to hear any more of this Jim! Why cant you just be a little more like Alex every now and then!\" you hoped to god that little comment wouldn't give you away but luckily Jimmy didn't notice the connecting and surrendered to your will. <br>\r\n<br>\r\n\"Fine, I'll clean your room.\"<br>\r\n<br>\r\n\"Thank you.\" You gave him a cheeky smile and turned on your heel to lead Jimmy to Tina's room where you would sit back and watch him clean. <br>\r\n<br>\r\nSadly Tina kept her room pretty tidy so there wasn't really that much to clean. But it was still fun to lay sprawled out on the king sized bed and bark orders at Jimmy as he cleaned. It was really a miracle that Jimmy hadn't noticed anything about his mothers apparent decision to punish him and how much joy she seemed to be getting out of it. <br>\r\n<br>\r\nAs Jimmy followed the orders of his apparent 'Mother', you took a quick second to comb over your body while he was busy paying you no attention. <br>\r\n<br>\r\nIt seemed that this altered version of you still had a penis (which you thanked the heavens for, since you didn't really feel like having to deal with a vagina for your first time in another life) but there were still other differences. Your penis for instance was definitely more sensitive compared to how you remembered it feeling. You already noticed your now painted fingernails and toe nails. You took a second to realize your new lack of hair except for the excess you seemed to have acquired on your head. You legs, armpits, chest and crotch were all hairless to your surprise and amusement.<br>\r\n<br>\r\nSomething else you noticed was the fact that every piece of clothing in Tina's closet seemed to be reshaped to fit your body type. This Hallway was starting to both amaze and spook you. It had some serious power that could definitely be used for some horrible things if anyone bad got their hands on a key. <br>\r\n<br>\r\nThis thought brought your mind back to your own situation with the imposter mom. What if the girl in your mothers life was actually someone horribly evil? This imposter could make so many aspects of your life a living hell if she felt in the mood. <br>\r\n<br>\r\nIt took a little while but you finally decided to let Jimmy off the hook when he was done cleaning the master bedroom. You cleared your head of the dark thoughts about your imposter mom and put a smile on your face, prepared to bring this whole joke with Jimmy to a close. <br>\r\n<br>\r\n\"You know what Jim my boy? I think I will take a shower, or maybe a bath! Teaching you how to be the man of the house has really tired me out. But you know what... Revenge is a dish best served cold!\"<br>\r\n</span></div></div>",
            "created":1388293200,
            "id":1716966,
            "title":"Readers Choice"
        },
        "11533222111211":{
            "author_id":"forthefunofit",
            "author_name":"forthefunofit",
            "choices":[
                "Let Jimmy go looking while you stay behind",
                "Give Jimmy his turn in a new life while you both wait"
            ],
            "content":"<div class=\"\"><div> <span>You looked over at Jimmy and his expression was of pure embarrassment, with a hint of excitement. <br>\r\n<br>\r\n\"Oh. My. God! It actually worked! You took over the life of my mother! I have so many questions! First being how do you feel? Do you see yourself with my moms body? But most importantly, can I try it next???\"<br>\r\n<br>\r\n\"Dude, don't even worry. You will have plenty of time to try this out. As long as you help me find my mom of course.\"<br>\r\n<br>\r\n\"Oh Alex your mom is as good as found! But where is my mom?\"<br>\r\n<br>\r\n\"I guess she's in my life but I have no idea what she's been doing in the bathroom for this long. I mean, she thinks she's me right now so there is no way she blacked out or anything from the shock.\"<br>\r\n<br>\r\nThe two of you walked to the bathroom where you had used the key to enter the Hallway but when you opened the door, expecting to see Tina wearing your clothes, you found the bathroom empty. <br>\r\n<br>\r\n\"Uhh, Tim? Where's my mom?\" Jimmy said, panic beginning to creep into his voice. <br>\r\n<br>\r\n\"Dude. I have no idea.\" You slumped against the hallway wall grasping for any ideas as to where Tina could possibly have gone. \"She didn't leave the house while I was in her life so the I just assumed that she was in the bathroom. I didn't even think to check.\" You ran your hands through your long, soft hair. \"How long were we cleaning for?\"<br>\r\n<br>\r\n\"Only about a half hour. If my mom was in your life, she would have wandered out of the bathroom trying to look for me...so where'd she go?\"<br>\r\n<br>\r\nYou paused for a moment trying to work out the possibilities in your head. \"I have no idea.\"<br>\r\n<br>\r\n\"Bro if you lost my mom too then I swear to god our friendship is over!\"<br>\r\n<br>\r\nJust when it looked like you might have actually lost your best friends mother, possibly forcing yourself to take over her life forever, Tina walked up the stairs. <br>\r\n<br>\r\n\"Oh hey Jimmy, Ms Holden,\" Tina was dressed in the clothes you had arrived in and her hair was cut to your old short style. She was holding a messy sandwich in her hands. \"I got hungry after going to the bathroom so I thought I'd make myself some lunch. This is my third sandwich.\" she said with a smile. <br>\r\n<br>\r\n\"Mo...I mean Alex! why didn't you come find me?\" Jimmy seemed visibly irritated and you hoped Tina didn't take it the wrong way. She seemed to be living your life perfectly without any knowledge of the life swap. Having a large lunch was something you did on a regular basis because you usually ended up burning off the calories anyway. <br>\r\n<br>\r\n\"Sorry dude,\" Tina said through a mouth full of sandwich. \"I heard your mom yelling at you about being the man of the house so I thought I'd just step back for a moment while you both talked.\" Staying out of other people's confrontations was also a very you thing to do. \"Oh, sorry Ms Holden. You are right though. Jimmy does need to pick up some slack around your house.\" Kissing up to parents, something else you would have done. <br>\r\n<br>\r\nThat was it. You were convinced. Tina was definitely you for the time being and that made you incredibly excited. \"Oh don't worry about it Alex,\" you said with what you hoped looked like a motherly smile. \"The little spat I had with Jimmy is over now, but I think it's best if you go home now.\"<br>\r\n<br>\r\nJimmy looked at you a little surprised. No doubt he was thinking that you were trying to steal his mothers life for the rest of the day. <br>\r\n<br>\r\nUm. Ya, ok Ms Holden. I guess I'll be off.\" Tina finished off the last bit of her sandwich and headed back down the stairs. She called back saying \"See you later Jimmy\" before heading out the door back to what used to be your home. <br>\r\n<br>\r\n\"What the hell did you do that for!\" Jimmy wasted no time after the door shut before letting that out. He was obviously upset that you were sill his mother and could easily mess with him again. <br>\r\n<br>\r\n\"Dude, calm down. I'm not actually trying to steal your moms life or anything.\" you pulled Jimmy into his room and closed the door before continuing. \"I just remembered a part of the rules with the Hallway. There's a minimum limit for how long you need to stay in a persons life before leaving and that's 24 hours.\" Jimmies jaw dropped for the second time today. \"Don't worry though. I'll be out of your moms life first thing tomorrow morning, but until then, we can spend this time planning how to save my moms life.\"<br>\r\n<br>\r\nJimmy shook his head, no doubt trying to clear it from all of the weird things that have already happened today. And it wasn't even 1pm. \"Ok. Just give me a break for the rest of the day. I'll help with the planning but I think I'm done with the weird experiences for today.\"<br>\r\n<br>\r\nYou sat down on the bed and started adjusting your sports bra. The scary part about living Tina's life was that since you had gone and looked through basically all of her memories, you were now completely comfortable wearing Tina's clothes. This little side affect was probably a good thing for living a woman's life but it just felt wrong since, to you, you were still male. <br>\r\n<br>\r\nJimmy looked at you with an expression which fully displayed his distaste towards what he saw as his own mother possibly playing with her sports bra and boobs. \"Dude, right now you look like my mom to me so please refrain from touching anything that would be deemed a private part of the female anatomy.\"<br>\r\n<br>\r\n\"Sorry, but I don't even see your mothers breasts when I look at my chest. I still somehow see my own physical form, just wearing your mothers clothes. Also I'm basically hairless now except for my head. You'll understand when you try it out.\"<br>\r\n<br>\r\n\"So what do you even want to do now? I mean this is kind of your personal mission, I'm just the help, so what do you have in mind?\" Jimmy sat back in his desk chair and stared intently at you. <br>\r\n<br>\r\nIn actuality you hadn't even thought of how you might go about finding your mother. \"Well, I know that whoever is in the life of my mother wanted to do some errands and have a spa day today. Whatever errands she had planned are probably done now so we could just go to the closest spa and see if we can spot my mom. Then I guess we could tail her until she makes a mistake or leads us to something or somewhere that may give us a hint as to where my real mom might be.\"<br>\r\n<br>\r\nJimmy put on his thinking face. \"You told me that someone who uses the Hallway can see someone else who uses it even when their assuming someone else's life, so I think I should go out on my own and try to spot your imposter mom while you just sit here and wait, or we could both just hang out here until your imposter mom gets home. Once the imposter gets back we can begin observing her for any slip ups or clues as to who's life your real mom might be living right now.\" Jimmy pauses for a second while a smile creeps onto his face. \"And maybe while we wait, I could have my first go in another life.\"<br>\r\n</span></div></div>",
            "created":1388293200,
            "id":1717031,
            "title":"Jimmy laughs it off"
        },
        "115332221112112":{
            "author_id":"forthefunofit",
            "author_name":"forthefunofit",
            "choices":[
                "Jimmies POV inside the Hallway",
                "Alex's POV taking the 'new Jimmy' home"
            ],
            "content":"<div class=\"\"><div> <span>The majority of you wanted to send Jimmy out to look for the imposter mom immediately but with only about two hours until she'd have to be back home to start preparing dinner, Jimmies time would probably be wasted with only a short amount of time to search. <br>\r\n<br>\r\n\"I guess you and me can just wait here until tomorrow when I can get my life back and we can begin the interrogation.\" you finally said to Jimmy. <br>\r\n<br>\r\n\"I'm fine with that. But in the mean time I think it's my turn with the Hallway!\" Jimmy paused for a second, looking at you curiously. \"So...how exactly do I do that? Do I use your key? Or can I get my own?\"<br>\r\n<br>\r\n\"Well, my key is gone for now until my minimum time is up and I'm pretty sure the rule is one key per person and one person per key so I guess we have to get you your own.\"<br>\r\n<br>\r\n\"Great!\" Jimmy was starting to get really excited now. He kept jumping up and down like a little kid while listing out random names of people he wanted to become. \"Oh! Do you think I could take over the life of one of my hot adult neighbors so we can do grown up things in our new lives? Or maybe I could take over a teacher and change our grades before doing grown up things. Or I could take the life of my aunt who lives downtown and we can do grown up things downtown!\"<br>\r\n<br>\r\nYou smiled at Jimmy. You did understand his excitement but you were also a little worried that he'd be disappointed when he tried it out for himself. Truth be told, you didn't feel any different compared to how you felt before stepping into Tina's life. Other than the added memories and change in clothes, you didn't feel much of a difference. \"I'm getting the sense that you really want to do grown up things. But how about we focus on getting you your key, and then you can decide how you want to use it.\"<br>\r\n<br>\r\n\"Ok. So where do we need to go?\"<br>\r\n<br>\r\n\"Well, The cave that I went through to get to the Hallway was on the outskirts of the forest behind the mall.\" You thought about how far the mall was from Jimmies house and took another look at what you were wearing. \"And I guess I'm gonna have to change out of these running clothes if I'm going to drive us there.\"<br>\r\n<br>\r\nJimmy plastered a ridiculous grin on his face knowing he was about to enter a whole new world of fun! \"All right Mommy! I'm ready when you are!\"<br>\r\n<br>\r\nYou got up off the bed and lifted your arm up to smell your shaved underarm. \"Oh God dude, your mom reeks right now!\"<br>\r\n<br>\r\n\"Well what do you expect? She had just gotten back from a run before you highjacked her life. You'll just have to add 'take a shower' to the list of things you'll need to do before we leave.\"<br>\r\n<br>\r\nThe prospect of showering in another persons home and changing into someone else's clothes, not to mention a females clothes, wasn't really something you looked forward to but it had to be done. \"How about I go shower and change, then I'll meet you out in the car so we can drive to the mall.\"<br>\r\n<br>\r\nThirty minutes later you were freshly showered and changed. The shower was refreshing but also a little odd. Your skin was incredibly sensitive seeing as you were now as sensitive as Tina was. You also noticed that hair was just starting to grow on your legs and armpits so, with the help of Tina's memories, you properly shaved the for-mentioned areas. That had also been a very different experience. Next had been changing. First off, a look in the mirror reminded you of how exactly you needed to wrap the towel in order to cover the private areas of your body. The next step was changing clothes. <br>\r\n<br>\r\nYou really didn't know what Tina might wear to a quick outing to the mall so, since you knew you wouldn't really be out for very long, you decided on just picking what you thought looked nice. For now, that was a pair of white cut off pants, black ballet flats and a simple black blouse. You also had to change into Tina's underwear so you just quickly picked out a black bra and panties. You felt no desire to sift through Tina's underwear for longer than you had to. <br>\r\n<br>\r\nAfter grabbing Tina's purse, you headed out to her car where Jimmy was waiting patiently in the passengers seat. You walked over to his window and asked \"So, how do I look?\"<br>\r\n<br>\r\n\"Actually, quite a bit like my real mom would dress. Good job. Now hop in the car so we can get on our way. I've been waiting forever for you and I simply don't have the patience today.\"<br>\r\n<br>\r\nyou looked at him for a second with a bit of a nervous expression. \"Do you mind driving us there? I know I have your moms memories and all... but I don't really feel comfortable driving yet. I barely have a lead era permit of my own.\"<br>\r\n<br>\r\n\"Ya, whatever gets us there faster\" Jimmy said while sliding into the drivers seat. <br>\r\n<br>\r\nYou grinned a little as you got in the passengers side. It was true that you felt nervous about driving to the mall with your person lack of driving experience, but you also wanted to check yourself out a little in the over head mirror. You still had Tina's reflection after all, and you kind of wanted to reap the benefits seeing as you don't actually have her physical features. <br>\r\n<br>\r\nThe drive didn't actually take very long, probably due to Jimmies eagerness. You didn't really pay much attention to the road as you should have since you were really interested in Tina's face. It occurred to you that you hadn't put on makeup and since you were trying to act like Tina for the time being, it just seemed logical that you look the part to the T. The drive for you was spent doing your makeup and examining Tina's impressive cleavage in the house you chose to wear. <br>\r\n<br>\r\nFinally, you parked just outside the forest edge a short distance from the malls back entrance. You both hopped out of the car and you led Jimmy to the cave where all this started. Jimmy seemed to be getting more excited with every step he took towards the cave but you weren't really feeling the same. <br>\r\n<br>\r\n\"Well, here we are\" you said gesturing to the cave. \"Ready to give it a go?\"<br>\r\n<br>\r\nJimmy looked at you with his trademark grin \"Hell ya dude. Just tell me what I need to do.\"<br>\r\n<br>\r\n\"Just walk in.\"<br>\r\n<br>\r\n\"That's it?\" Jimmy looked a little disappointed with the simplicity but he still marched through the cave with determination. <br>\r\n<br>\r\n\"Oh! Wait!\" Jimmy stopped in his tracks as you called for him. \"I  have an idea. How about when you get through to the Hallway and you pick out a life you want, try to find a phone so you can contact me. Wherever you end up, I'll drive over and meet up with you. Then we can see what we want to do for fun until the time limit is reached tomorrow.\"<br>\r\n<br>\r\n\"Ya that sounds cool! Just try and keep my body safe until I contact you. Whoever ends up in my life will probably want to get home so you'll have to act like my mom until you can ditch him at my house.\"<br>\r\n<br>\r\nThe idea of putting on another act as Tina wasn't very appealing to you but once you got rid of the 'new Jimmy' you could meet the real one for some serious fun. \"Ok. Sounds like a plan. Just do me a favor!\"<br>\r\n<br>\r\n\"Ya?\"<br>\r\n<br>\r\n\"Pick a good life!\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1388293200,
            "id":1717175,
            "title":"Give Jimmy his turn in a new life while you bot..."
        },
        "115332222":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "“He must have gone through the Hallway, and now he can see me as I am!”",
                "You heard her voice morph into that of your real mother’s.",
                "Nothing unusual on her end…find out where your real Mom is."
            ],
            "content":"<div class=\"\"><div> <span>From upstairs, Alex heard the girl in his mother’s life picking up the phone, and she started talking.<br>\r\n<br>\r\n“Oh hi, Allison, how are you? I’m fine, thank you. Though my son was acting a little weird this morning.“<br>\r\n<br>\r\nDiscreetly, you thought you’d eavesdrop on her. Perhaps she was just putting on a very good act.<br>\r\n<br>\r\n“It’s weird, kind of like he didn’t recognise me.”<br>\r\n<br>\r\nThen you heard something that made your jaw drop…<br>\r\n</span></div></div>",
            "created":1478754000,
            "id":2235059,
            "title":"Something weird happens with 'Mom' befo..."
        },
        "1153322223":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "Working at an organic juice bar",
                "Hanging out with a group of other teenage girls",
                "With her boyfriend"
            ],
            "content":"<div class=\"\"><div> <span>As you listened further to her conversation on the phone, you heard nothing out of the ordinary. Perhaps it was your mother who entered the Hallway, and is now inhabiting this girl’s life, while the girl is obliviously living out your mother’s life.<br>\r\n<br>\r\nYou decided to make a trip to the mall and find your original mother. After showering and getting dressed, you made it to the door and saw the teenage girl dressed in your mom’s white blouse, grey cardigan, jeans and ballet flats, all sized to fit her body.<br>\r\n<br>\r\n“Oh hey, mom. Just on my way to the mall.”<br>\r\n“Would you like me to give you a lift?”<br>\r\n“No thanks, I’ll catch the bus.”<br>\r\n“Well, make sure you’re home by dinnertime.”<br>\r\n<br>\r\nAfter catching the bus to the mall, you had a look around. You visited various shops, the food court, until you found your mother, living the life of a teenage girl…</span></div></div>",
            "created":1478754000,
            "id":2235060,
            "title":"Nothing unusual on her end…find out where you..."
        },
        "11533222233":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "\"Leave him alone, I'll deal with him\"",
                "\"He's clearly bullshitting you. Kick his ass.\"",
                "\"No, he's right, I think it's time I came clean.\""
            ],
            "content":"<div class=\"\"><div> <span>You came across a nearby bench and saw a two people flirting with each other. One was another a guy who was a little older than you, taller and more physically built. However, his girlfriend made your eyes pop, as it was clearly your 40-year-old mother dressed as a teenage girl, wearing a low-cut top, a denim miniskirt, wedge-heeled sandals, and had done her hair in a ponytail.<br>\r\n<br>\r\nYou quietly decided to observe them making their small talk. It would have been cute if it weren't so creepy.<br>\r\n<br>\r\n\"Happy one year anniversary, Kate. I got you something special.\"<br>\r\n<br>\r\nHe handed your mother a box, which she excitedly opened, pulling out a pair of shoes.<br>\r\n<br>\r\n\"Oh my god Brad, thank you so much. They're beautiful!\"<br>\r\n<br>\r\n<i>Wow, she's good at this</i>, you thought.<br>\r\n<br>\r\n\"Now you have something to wear on our more formal dates. Where do you wanna go?\"<br>\r\n<br>\r\n\"Wherever you want, Brad\" she said, wrapping her arms around her boyfriend.<br>\r\n<br>\r\n\"Yeah?\" he reciprocated.<br>\r\n<br>\r\nAs they both leaned in to kiss, you stood up. There was no way you were going to allow this to happen.<br>\r\n<br>\r\n\"Excuse me!\" you asked.<br>\r\n<br>\r\nBrad and Kate turned to you, clearly annoyed at your attempt to cockblock them.<br>\r\n<br>\r\n\"What do <i>you</i> want?\" Brad snarled at you.<br>\r\n<br>\r\n\"I'm sorry, your girlfriend? She's not what she seems.\"<br>\r\n<br>\r\nBrad stood up and approached you menacingly.<br>\r\n<br>\r\n\"You'd better have a good reason for cockblocking me. Explain, or get out of my sight before I kick your ass\".<br>\r\n<br>\r\nAs you wondered if he'd believe you if you told him that his girlfriend was effectively taken over by a 40-year-old woman, and feared getting beaten up by him, \"Kate\" stood up and said to Brad...</span></div></div>",
            "created":1508460420,
            "id":2403679,
            "title":"With her boyfriend"
        },
        "115332222331":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "\"I'll text you my number, is that okay?\"",
                "\"I'll talk to Brad, and hopefully he'll be calmer next time\"",
                "\"Sorry, you'll have to stay away from me and Brad.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Brad, leave him alone. I'll talk to him somewhere else\".<br>\r\n<br>\r\n\"Okay, but make it quick.\"<br>\r\n<br>\r\n\"Kate\" then grabbed your hand and led you to a more private area. She then let go.<br>\r\n<br>\r\n\"So, you can see me for who I am, Alex?\"<br>\r\n<br>\r\n\"After going through the Hallway of Lives, yes I can, mom.\"<br>\r\n<br>\r\n\"Kate\" then sighed.<br>\r\n<br>\r\n\"Alex, what the hell was that all about? I was just enjoying myself before you interrupted my date.\"<br>\r\n<br>\r\n\"By going out with someone less than half your age? I never took you for a cradle robber, mom.\"<br>\r\n<br>\r\n\"I'm only a cradle-robber to you and anyone else who can see me. To everyone else, I'm Kate O'Reilly, 16 year old high school student, dating someone closer to my age. I just needed a change of pace and thought it'd be a nice break to live as a teenager for a while.\"<br>\r\n<br>\r\n\"So, what about the real Kate living your life back home?\"<br>\r\n<br>\r\n\"It's alright, she's just living my life on autopilot. Aside from the obvious physical differences, you'll find that it won't be too different at home while we're swapped.\"<br>\r\n<br>\r\nSuddenly, she got a text on her phone. <br>\r\n<br>\r\n\"Brad wants me back. Gotta go.\"<br>\r\n<br>\r\nAs she picked up her shoulder bag and headed off, you called out.<br>\r\n<br>\r\n\"But mom...I mean, Kate, how will we keep in contact for now?\"<br>\r\n<br>\r\nShe quickly turned around.</span></div></div>",
            "created":1508461500,
            "id":2403682,
            "title":"\"Leave him alone, I'll deal with him\""
        }
    },
    "info":{
        "author_id":"strangeperson",
        "author_name":"Some Random Person",
        "brief_description":"You are a normal boy who one day ends up in a strange hallway full of doors. ",
        "created":1265972640,
        "description":"<td align=\"left\" class=\"norm\">You are a normal 16 year old boy who one day finds himself in a strange endless hallway full of doors, Each door leads into the life of another person, and by stepping through the door, you take on that person's life.<br>\r\n<br>\r\n<br>\r\nRules:<br>\r\nNo killing<br>\r\nNo ending the story<br>\r\nNo scenes of graphic sex<br>\r\n<br>\r\nHave fun!</td>",
        "id":1645108,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1565750820,
        "modified":1565750820,
        "pretty_title":"Hallway of Lives"
    }
}