{
    "chapters":{
        "1":{
            "author_id":"msalvo",
            "author_name":"Zoo - Salted and Roasted",
            "choices":[
                "continue",
                "continue",
                "continue",
                " continue",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>So you get up off the couch. You're not getting any sleep anyway . The gloom and glow of the television lights your way to the kitchen. \r<br>\n\r<br>\n---drip-drip-dripdrip----\r<br>\n\r<br>\nWhere is that coming from? The tap in the kitchen is dry.\r<br>\n\r<br>\n---drip-drip-dripdrip----</span></div></div>",
            "created":995864400,
            "id":65183,
            "title":"drip-----drip------drip------drip"
        },
        "11":{
            "author_name":"summer",
            "choices":[
                "Have someone fix the sink for you?",
                "Fix it like the handyman/woman you are!"
            ],
            "content":"<div class=\"\"><div> <span>You look around, specificaly behind you, where the kitchen sink is. The TV's glare stings your eyes after closing them for so long. You turn it off, and since your pupils have adjusted to the dark, you keep walking without turning on the light. \r<br>\nYour heart races and beats faster than a hummingbird. You walk directly to the sink, without looking anywhere else. \r<br>\nYou put your hand underneath the sink waiting for water. You feel a slight drop, and turn off the sink. You lay back on the couch and fall to sleep, but then you hear that dripping noise again. You go to the sink and turn off the sink. That process happens about two times before you decide to fix the problem. It is four in the morning, but do you want to fix it yourself, or have someone else fix it for you?</span></div></div>",
            "created":995950800,
            "id":65270,
            "title":"Two Drips, a Sink, and Your Sleepiness"
        },
        "111":{
            "author_id":"msalvo",
            "author_name":"Zoo - Salted and Roasted",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You decide to call a plumber to do the job. He says he'll be right over, so you wait all day, and are just about ready to give up on him, when the doorbell rings. \r<br>\n\r<br>\n\"Who is it?\" you ask.\r<br>\n\r<br>\n\"It's the plumber!\" he shouts, \"I've come to fix the sink!\"</span></div></div>",
            "created":995950800,
            "id":65336,
            "title":"The Plumber"
        },
        "1111":{
            "author_name":"filthy_fairy",
            "choices":[
                "Quickly slam the door shut again",
                "Open the door and let him in"
            ],
            "content":"<div class=\"\"><div> <span>As you walk to the front door, an odd tingling sensation creeps over your neck.  Your hearts starts to beat a little faster, and a little voice inside your head tells you not to open the front door.\r<br>\n\r<br>\nIgnoring the voice, you slowly undo the safety bolt on your door...</span></div></div>",
            "created":996123600,
            "id":65617,
            "title":"The little voice in your head."
        },
        "11111":{
            "author_id":"kuddles",
            "author_name":"Kuddles",
            "choices":[
                "Listen to hear if he leaves",
                "Back away from the door"
            ],
            "content":"<div class=\"\"><div> <span>Again, a knock, followed by a raspy voiced, \"Is this 1937 Oaklee Drive Apt. 104?\".<br>\r\nYou stand behind the door, head swimming, desperately unsure of why the hell you bothered to call a plumber only to suddenly cower in abject horror at their arrival.<br>\r\n\"I...I'm not home now!\" You stutter...<br>\r\n\"Whaaa...?\" you hear from the other side of the door.<br>\r\n\"My pipes are fine now!\", you say, perhaps abit too loudly, \"Please, just go away!  I don't need you now.\"<br>\r\n\"Ma'am, you're gonna receive a bill for this visit whether I get in there and have a look at those pipes or not\", says the scratchy-voice on the other side, \"wouldn't you rather I at least had a look at the problem?\".<br>\r\n\"No!  I'm fine now.  Just go away!\", you stammer, \"I mean, the pipes are fine!  Just send me a bill, thanks\".<br>\r\n<br>\r\nYou:</span></div></div>",
            "created":1202456220,
            "id":495707,
            "title":"Quickly slam the door shut again"
        },
        "1112":{
            "author_name":"smiley",
            "choices":[
                "Do you believe him and pay him his fee?",
                "Do you tell him he must be wrong and demand he look harder?"
            ],
            "content":"<div class=\"\"><div> <span>you open the door and let the strange looking man who has called himself your plumber in. He moves straight to your sink. Didn't even ask where the broken tap was. He seems a little strange. He looks at your tap for a while then turns to you and tells you that there is nothing wrong with it.</span></div></div>",
            "created":995950800,
            "id":65361,
            "title":"What??"
        },
        "112":{
            "author_name":"daydreamer",
            "choices":[
                "Wake up and you are trapped in the pipe",
                "Wake up in your house"
            ],
            "content":"<div class=\"\"><div> <span>You crawl under the sink, your trusty toolbox at your side.  You don't have a clue what you're doing, but are determined to give it a shot.  Let's see.. hammer... screwdriver... that ought to be sufficient.\r<br>\n\r<br>\nYou begin to pound on the pipe underneath the sink.  \"Clank!  Clank!  Clank!\"  Then a human voice coming from somewhere... from inside the pipe!  \"Heelllp!\" it calls.  You freeze in fear.  \"Helllllp!\" it calls again.\r<br>\n\r<br>\n<i>It must be late, I ought to get to bed</i>, you think, but the human voice continues.  After a few more cries of help, it seems to give up, or you've regained your senses.  You are about to walk away when an idea occurs to you.  Duct tape!  That should stop the drip!\r<br>\n\r<br>\nHowever, just as you are about to sit up and look for the duct tape, you feel a cold, hard cylindrical object against your neck.  Before you have a chance to turn around and look, a metal pipe wraps itself around your neck tightly.  It seems to be attempting to choke the life out of you, and you start beating on it with your hammer.  Except, you have bad aim and accidentally hit your own mouth several times, causing chunks of teeth to fly out of your mouth, the blood gushing everywhere.  You are spiraling into darkness....</span></div></div>",
            "created":996037200,
            "id":65548,
            "title":"The Pipe comes to live"
        },
        "1121":{
            "author_name":"daydreamer",
            "choices":[
                "Scream as loud as possible for help",
                "Go back to sleep and see if you wake up safe"
            ],
            "content":"<div class=\"\"><div> <span>The darkness threatens to engulf your world.  Though you fight it, the lack of oxygen to your brain wins and you pass into oblivion.\r<br>\n\r<br>\nWhen you awake, not a pinpoint of light penetrates the blackness surrounding you.  The floor beneath you is cold, hard, and damp.  Like... metal.  A nauseating scent almost makes you sick to your stomach.\r<br>\n\r<br>\nDrip!....\r<br>\n\r<br>\nDrip!....\r<br>\n\r<br>\nArrrghhh!  The dripping hasn't stopped!  Where is that damned duct tape!  You feel around and realize that the floor beneath you feels curved, and the walls feel similar to the floor--cold and damp!  What is that awful smell!\r<br>\n\r<br>\n\"Uh... Hello!!\" you call out gingerly.  Is this a dream?  Your voice sounds eerily high and your call echoes all about you.  You begin to walk in the direction that doesn't seem to be blocked by a wall, but find that it eventually curves upward too much to keep going.  Your feet slip on some slimy goo and you land face first.  The stench overwhelms you and you lose the chips and dip you munched this evening.\r<br>\n\r<br>\nYou head the opposite direction, and run into the exact same dilemma.  You think, \"If I didn't know better, I'd think I was trapped in the dip of a pipe.. my kitchen pipe.\"  You laugh out loud at this ridiculous thought, but remember the pipe-like object wrapping about your neck earlier.  You feel your mouth, where there is a chipped tooth (damned hammer!) and the tender area round your neck where the thing had wrapped itself.\r<br>\n\r<br>\nDrip!\r<br>\n\r<br>\nDrip!\r<br>\n\r<br>\nYou grab your head in agony.  Where is that coming from!!  You're going to assume the most ridiculous assumption and now figure out a way to get help.  Maybe you'll soon wake from this nightmare.</span></div></div>",
            "created":996312180,
            "id":66021,
            "title":"Trapped in the Pipe!"
        },
        "11211":{
            "author_id":"msalvo",
            "author_name":"Zoo - Salted and Roasted",
            "choices":[
                "Try to climb the slippery slope",
                "Pray for divine intervention..."
            ],
            "content":"<div class=\"\"><div> <span>Unerved to say the least, you start to panic and scream...\r<br>\n\r<br>\n\"Help!HELP HAYULP!\" you scream, but the sound travels down the pipe and bounces back to you in a disconcerting way, echoing around in the metal tube. \r<br>\n\r<br>\n<i>This is not working at all....</i>you think, <i> This stench is unbelievable! How can I get out of here?</i></span></div></div>",
            "created":996506340,
            "id":66414,
            "title":"Screaming for Help"
        },
        "112111":{
            "author_name":"daydreamer",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You decide to try to ascend the slippery slope at one end of the dank, smelly tunnel.  You place your hands gingerly on the cold metal, which feels disgustingly like it’s coated with K-Y Jelly.  The pungent, rotten odor all about you makes you gag violently.  <i> I don’t know why I’m doing this,</i> you think.  <i>What good could this possibly do me?</i>.  But you figure that trying to do something that is fruitless and hopeless is still better than just sitting there.  You search for something to grab, but only get handfuls of what you presume to be rotten food, or mold.\r<br>\n\r<br>\nFinally, you just plant your foot up high and attempt to stand up on it.  You fall flat on your face.  Just as you are sharply inhaling in order to scream in frustration and disgust, you hear a voice.  “What was that?  Did you hear that?  A clank came from inside that pipe.”  This was a male voice you did not recognize.\r<br>\n\r<br>\n“Well,” said another voice, “She commented the other day that her kitchen sink might be broken or something.  Maybe that’s what she was talking about.”  Your sister!  “I tried calling her today, but I guess she’s not around.”  Maybe you could somehow get her attention!\r<br>\n\r<br>\n“HEEELLLLP!  Help me!  Shawna!  It’s me!  I’m stuck in the pipe!”  You scream your lungs out, but your voice sounds high and squeaky and begins to echo endlessly within the pipe.\r<br>\n\r<br>\n“Did you hear that?” said the man’s voice.\r<br>\n\r<br>\n“Yeah.  It’s like an insect is stuck in there or something.  Maybe we can flush it out.”  Flush it out?  You realize with horror what this meant.  You scream frantically but your voice starts gurgling as the rush of water swishes you violently up the wall you were just trying to climb.  Struggling to catch precious breaths of air, you flow, nearly drowning, through what seems like miles of a water tube slide at a water park in hell.\r<br>\n\r<br>\n</span></div></div>",
            "created":996787320,
            "id":67236,
            "title":"The Water Slide from Hell"
        },
        "1121111":{
            "author_name":"daydreamer",
            "choices":[
                "You wake up in the sewer beneath your house",
                "You wake up in a sewer under the city"
            ],
            "content":"<div class=\"\"><div> <span>All is dark, and you are flailing your arms wildly, trying to keep your nose in the precious little space at the top of the pipe where there is air.  You figure that, any time now, you will end up in some drainage pipe, or possibly a sewer.  Maybe underground, flowing through the city.  You didn’t want to think of the possibilities.  Perhaps you would be dead before you ever reached any of those.  You wondered if anyone would ever find a tiny little dead human body.  Perhaps they’d put you in a lab, cut you up and study you.  <i>How can I think such stupid thoughts as I’m nearly drowning?</i> you think.\r<br>\n\r<br>\nThe thought is cut short when you plink your tiny head up against the top of pipe so hard that your world goes even blacker than the inside of the pipe, and you lose all consciousness.</span></div></div>",
            "created":996787620,
            "id":67239,
            "title":"Knocked Out"
        },
        "11211111":{
            "author_name":"im a star",
            "choices":[
                "Investigate the sewer",
                "follow the screams of help"
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes, and notice that disgusting smell is back again.Then you see a sma.. Hang on YOU CAN SEE!!!!!... Anyways, you see a small area of light above you to your left.Then you realise your in the sewer below your house. A few seconds later you hear that scream for help you heard earlier.</span></div></div>",
            "created":1131804000,
            "id":283526,
            "title":"Strange light"
        },
        "112111112":{
            "choices":[
                "Try to scale the wall",
                "See who is there"
            ],
            "content":"<div class=\"\"><div> <span>You feel like puking. You were definately happy you weren't a sewage man... or woman... but anyway, why would anyone want that job? Gagging, you strain your ears as the scream sounds again. It seems to be coming from the direction of the light.<br>\r\n<br>\r\nYou were happy you were such a good swimmer -- but you definately weren't going to put your face in the sewage anymore than you already had. First trying out a few swift strokes, you manage to find a way to swim with your head above the water.<br>\r\n<br>\r\nAs you near the screams, you realize you're very close to the light. Looking back over your shoulder, you see a few notches along the wall to your right that seem to lead up the the hole. You might just be able to scale it, if you're careful...<br>\r\n<br>\r\nJust then, the scream echoes very close to your left -- the opposite direction. The good person in you wants to find out who it is and how you can help, and the logical side wants to know what the heck is going on?! You look over your shoulder again. Well, having an extra person could help get up that wall... or it could just make it harder.<br>\r\n<br>\r\nWhat should you do?</span></div></div>",
            "created":1201995300,
            "id":493529,
            "title":"Getting out?"
        },
        "1122":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "You've gone back in time",
                "You're still in the nightmare"
            ],
            "content":"<div class=\"\"><div> <span>\"Whew! What a nightmare!\" you think, as you wake up on your couch, the glare of a test pattern shining from the TV. Wait a minute, you realize you haven't seen a test pattern on a TV in years... And someone has replaced your new flat screen with an old oak console, like the one your family had when you were a kid. What the hell is going on here?<br>\r\n<br>\r\nThen you hear the sound again, you think it's coming from the bathroom this time....<br>\r\nDrip-drip-drip-drip...</span></div></div>",
            "created":1202536020,
            "id":496005,
            "title":"Wake up in your house"
        },
        "12":{
            "author_name":"Schugar",
            "choices":[
                "Retreat like a bunny slippers wearing coward",
                "Continue to investigate"
            ],
            "content":"<div class=\"\"><div> <span>Always when I have to get up early.\r<br>\n\r<br>\n-drip-drip-dripdrip-\r<br>\n\r<br>\nI wandered sleepily into the bathroom to check the sink. Nothing. The shower head? Clear. Then what was it? I gave the taps and extra tight turn just to mke sure. Still, there it was...\r<br>\n\r<br>\n-drip-drip-dripdrip-\r<br>\n\r<br>\nPipes maybe? Something up in the attic? By the time I had hauled out the ladder and inched half way up it, I had thought better of it. No. If there was a problem in the attic, then it would just have to stay a problem. I wasn't going up there. \r<br>\n\r<br>\nI shivered. Cotton pyjamas gave little protection against the cold, and even less against the tickles creeping along my spine. I spun suddenly. The tickles made me. But there was nothing to see - only hear.\r<br>\n\r<br>\n-drip-drip-dripdrip-\r<br>\n\r<br>\n\r<br>\n</span></div></div>",
            "created":996874560,
            "id":67479,
            "title":"I follow the sound"
        },
        "13":{
            "author_id":"cannon1",
            "author_name":"Mac",
            "choices":[
                "run out, screaming from the house",
                "get your crowbar and start investigating!"
            ],
            "content":"<div class=\"\"><div> <span>Of course, you think to yourself, it's gotta \r<br>\nbe the bathroom.  You run upstairs to check, \r<br>\nonly to hear the drip-drip-drip fading.  You \r<br>\ncheck, just to be sure, but there's no drip \r<br>\nupstairs.  \r<br>\n\r<br>\nYou return downstairs, where the \r<br>\ndrip-drip-drip continues to echo in the \r<br>\nrooms.  You check the kitchen sink again, but \r<br>\nthere's nothing dripping.\r<br>\n\r<br>\nThen you realize the dripping is coming from \r<br>\nbehind you.... you turn around, but the \r<br>\ndrip-drip-drip seems to be coming from \r<br>\nnowhere, but everywhere.\r<br>\n\r<br>\nYou close your eyes, letting your ears guide \r<br>\nyou.  You walk towards the drip-drip-drip, \r<br>\nand stop when you realize you're in front of \r<br>\nthe wall!  \r<br>\n\r<br>\nIs the drip-drip-drip coming from the wall?  \r<br>\nbe</span></div></div>",
            "created":995950800,
            "id":65351,
            "title":"Check upstairs"
        },
        "131":{
            "author_id":"msalvo",
            "author_name":"Zoo - Salted and Roasted",
            "choices":[
                "Go back in the house",
                "Find somewhere quiet to sleep.."
            ],
            "content":"<div class=\"\"><div> <span>So you run out of the house \r<br>\nscreaming. You make it halfway down the street before you realize that you're \r<br>\nmaking a spectacle of yourself\r<br>\nover a drip-drip-drip \r<br>\nin your house.\r<br>\n\r<br>\n\"Unbelievable.\" you think. \"I've GOT to get some sleep.\"</span></div></div>",
            "created":996037200,
            "id":65573,
            "title":"Making a Spectacle of Yourself"
        },
        "1311":{
            "author_name":"AMANDAluvsSamsBANANA",
            "choices":[
                "1",
                "2"
            ],
            "content":"<div class=\"\"><div> <span>You close your eyes a moment, inhaling a large breath of cold air, hoping it will calm you down. \r<br>\n\r<br>\n\"Just water,\" you tell youself, walking back inside the house.  You've always BEEN the kind of nervous person who panics over the slightest creak from the floor or tiniest gush of air through the room.  The kind of person who, if finding yourself in a horror film, would fall on the floor and allow the villian to kill you.\r<br>\n\r<br>\nClimbing upstairs, heading for the bathroom where you hope to find peace and quiet, you stop in your tracks as you see a strange red light coming from the bedroom to your right.</span></div></div>",
            "created":996558360,
            "id":66648,
            "title":"Red Light"
        },
        "132":{
            "author_id":"moo-ha",
            "author_name":"Oweyn",
            "choices":[
                "Look upstairs for the noise",
                "Keep looking around here",
                "Look in the basement for the noise"
            ],
            "content":"<div class=\"\"><div> <span>Crazed by the dripping noise you tear <br>\r\na hunk out of your own wall. drip-drip-drip<br>\r\nYou realise it can be fixed up later and really<br>\r\ndo not care.<br>\r\n<br>\r\nYour mind is obsessed with<br>\r\nfinding the source of that driping noise.<br>\r\ndrip-drip-drip<br>\r\n<br>\r\nYou look into the dark space which you <br>\r\nhave found inside your wall.<br>\r\ndrip-drip-drip<br>\r\n<br>\r\nYou find nothing to suggest that the<br>\r\ndripping noise is in the wall. drip-drip-drip<br>\r\nSticking your ear in the hole you simply<br>\r\ndiscover that the noise is echoing through the whole<br>\r\nhouse<br>\r\n<br>\r\ndrip-drip-drip<br>\r\n<br>\r\n</span></div></div>",
            "created":1204005180,
            "id":502907,
            "title":"get your crowbar and start investigating!"
        },
        "14":{
            "author_id":"kuddles",
            "author_name":"Kuddles",
            "choices":[
                "A small child with a kitchen knife scrambles after you",
                "A demented madman with a butterfly knife advances",
                "Your other roomate, Janie, steps toward you, knife in hand",
                "Your cat, Morris, jumps down and springs out of the room",
                "You hear a chilling laugh"
            ],
            "content":"<div class=\"\"><div> <span>Half asleep, you stagger into the kitchen, where you see your roomate, Stephan, dangling upsidedown from a rope leading to the ceiling.  His throat has been slashed from ear to ear, and a steady ---drip-drip-dripdrip---- of blood pools beneath him, spreading across the linoleum floor.<br>\r\n<br>\r\n\"Good God!\", you whisper, when all of a sudden, from behind the refrigerator...</span></div></div>",
            "created":1201831020,
            "id":492961,
            "title":" continue"
        },
        "141":{
            "choices":[
                "Try to get the knife away from the boy.",
                "Grab the gun and see what's going on!",
                "RUN!!!!"
            ],
            "content":"<div class=\"\"><div> <span>You whip to your right to see a little boy pressed against the wall, as if trying to hide behind the refrigerator. You blink. <i>Who the heck is that?</i> you think. You couldn't remember Stephan saying anything about having a cousin... or a little brother... or that anyone was coming over.<br>\r\n<br>\r\nYou frown and look from Stephan to the little boy. Bile is rising in your throat as you stare at Stephan, and you quickly turn away. The little boy looks to be about 8 or 9, wearing blue plaid pajamas. His eyes were wide open in fright.<br>\r\n<br>\r\nYou grew up with 6 brothers, 4 of them being younger, so your heart went out to the boy. Trying not to gaze at Stephan's body, you start slowly toward the boy.<br>\r\n<br>\r\n\"Hey there.\" You say softly. The little boy just stares at you. \"Hey... what's your name? What are you--\"<br>\r\n<br>\r\nSuddenly, just as you'd skirted Stephan's body, fire lit the little boy's eyes. With a wild scream, the little boy launched himself at you. A flash caught the corner of your eye. A knife! How'd he get a hold of that? Then you saw that the biggest knife was missing from the holder. Fear clutched your heart.<br>\r\n<br>\r\nYou turned and ran into the living room, slipping on Stephan's blood. The little boy was still screaming, and as you realize you hit a dead end, you weren't sure what to do. Your eyes lingered on the old rifle above the big T.V. You turn to the boy, his eyes filled with some dark emotion.<br>\r\n<br>\r\nShould you disarm the boy? Should you run? Or should you grab the gun and find out what the heck's going on?!</span></div></div>",
            "created":1201996860,
            "id":493547,
            "title":"The boy and the knife"
        },
        "1413":{
            "choices":[
                "Get a neighbor and use their phone, quick!",
                "Run to the police station!",
                "Get to the hospital!"
            ],
            "content":"<div class=\"\"><div> <span>No way, you were never one to handle fear well, and with a dead guy and a boy with a knife, you were getting the heck outta there! Looking around, you pick up a chair from the dining table and launch it at the huge living room window. With a giant crack and a loud shatter, the chair and what was left of the glass fell.<br>\r\n<br>\r\nThe boy seemed to be surprised by that and had stopped momentarily. Taking advantage of it, you rip off the curtains (which were the ones your grandmother made for you), wrap them around both your hands and lean over the edge of the window.<br>\r\n<br>\r\nGreat. Bile rose for the second time that night in your throat as you stare down the 3 stories of your apartment to the ground. Your eyes blurred momentarily, and you shook it away. You had precious little time to figure out how to get down.<br>\r\n<br>\r\nFirst you look for a fire ladder, then realize it's on the other end of the apartment. Ooh! Just your luck, someone had thrown out a mattress. It was perched on the dumpster, at an angle that you might be able to hit and roll off without getting hurt.<br>\r\n<br>\r\nSomething nicked your back and you yelp, jumping to the right just as the knife struck a window and held. You look at the boy. He had grabbed your whole casing of knives, and since you were interested in cooking, that was a lot. Your back stung terribly, and you saw a small knife on the ground, covered with <i>your blood</i>. Luckily it wasn't very deep, and that the knife had only scraped across the surface.<br>\r\n<br>\r\nHoping for the best, you launch over the edge. For a few seconds, there's nothing but air. Then, the air gets knocked out of you as you hit the mattress, rolling off to hit the ground on your back before you can stop. You groan as the alley's dirt digs into the wound on your back. Opening your eyes, you see the little boy's head disappear from the window.<br>\r\n<br>\r\nYou consider your options. Should you go back into the apartment and try getting someone on the lower floor to let you use their phone? Or should you try walking to the police station? It wasn't too far, if you remember correctly. Or maybe you should go to the hospital. That way you can alert them to the boy and Stephan, and get the police at the same time (as well as get something for your back). <br>\r\n<br>\r\nOf course, all those options may mean that the little boy will be gone when someone gets there. And the fact someone may go in there and think YOU did it. But there was no choice, you couldn't go up there alone, and even with a bunch of your neighbors it might not do any good.</span></div></div>",
            "created":1201998360,
            "id":493555,
            "title":"RUN!!!!"
        },
        "14132":{
            "author_id":"useverything",
            "author_name":"itspentime:)",
            "choices":[
                "Front Door.",
                "Back Door"
            ],
            "content":"<div class=\"\"><div> <span>As you run to escape the boy, you make it to the police station.Fortunately,there is some police officers working there.You call 1 of them,forgetting you were in a nightmare.The officer turns around,wielding a knife too.It turns out he was the murderous boy's father.will you run across the police station.Or will you run from the front door?</span></div></div>",
            "created":1372436280,
            "id":1619241,
            "title":"Run to the police station!"
        }
    },
    "info":{
        "author_id":"msalvo",
        "author_name":"Zoo - Salted and Roasted",
        "brief_description":"A steady drip is coming from somewhere...",
        "created":995948100,
        "description":"<td align=\"left\" class=\"norm\">The constant  --drip-drip-dripdrip----  has got you crawling with anxiety. You want to know where it's coming from.... \r<br>\n\r<br>\nPlease take this horror story starter, in any direction you choose to. Keep with the scary/horror theme and go wild !</td>",
        "id":196741,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1372436280,
        "modified":1372436280,
        "pretty_title":"Something is Dripping"
    }
}