{
    "chapters":{
        "1":{
            "author_id":"herrheinrich",
            "author_name":"Heinrich",
            "choices":[
                "Imperium of Mankind",
                "Aliens, renegades or heretics?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a loyal Servant of the God-Emperor of the Mankind or one of his foes?</span></div></span></div>",
            "created":1295204340,
            "id":1036468,
            "title":"Choose your faction..."
        },
        "11":{
            "author_id":"herrheinrich",
            "author_name":"Heinrich",
            "choices":[
                "Imperial Guard",
                "Inquisition",
                "Adepta Sororitas",
                "Adeptus Astartes"
            ],
            "content":"<div class=\"\"><div> <span>Which army of the Imperium you want to join?<br>\r\n<br>\r\nThe Imperial Guard: <br>\r\nMillions of soldiers equipped with the average technology of this age, they're the backbone of the military forces of the Imperium, without them there would be no Imperium of Mankind.<br>\r\nThey operate in the full scale war using numbers and lots of tanks and artillery in order to destroy their enemies, they're also called \"The Hammer of the God-Emperor\" <br>\r\n<br>\r\nInquisition:<br>\r\nThe purpose of the Inquisition is to identify and destroy the myriad of potential threats to the Imperium and humanity, his members are agents known as Inquisitors.  It is separated in three branches each one of them work on a different subject.<br>\r\n<br>\r\nOrdo Malleus: Destroys daemonic threats and investigates the nature of the Daemon<br>\r\nOrdos Xenos: Investigates and eliminates alien influence and plots against the Imperium<br>\r\nOrdo Hereticus:Investigates and roots out heresy, mutation, and rogue psykers from humanity<br>\r\n<br>\r\nAdepta Sororitas:<br>\r\nThey are an all-woman fighting group which purpose is to mercilessly rooting out corruption and heresy within humanity and any of his organization. Often they're used as fighting arm of the Ordo Hereticus.<br>\r\n<br>\r\nAdeptus Astartes: <br>\r\nCommonly know as the Space Marine or The Angels of Death, the Adeptus Astartest are the finest and best equipped of any of the armies of the Imperium, due to this they're fighting in the worst battles against the most dangerous enemies.<br>\r\nThere are too few Space marine to use them on a full scale war so they're used only when strictly requested.<br>\r\n</span></div></div>",
            "created":1295206560,
            "id":1036493,
            "title":"Imperium of Mankind"
        },
        "111":{
            "choices":[
                "exiting the chimera"
            ],
            "content":"<div class=\"\"><div> <span>its hot in a chimera.hot,scary,cramped, in the back of a chimera your only comfort is a dim light that weakly tries to illuminate the,dirt and blood crusted, faces of the poor basterds cramped shoulder to shoulder and awaiting orders to die.you look around at the men stuffed into the back of the transport,what were there lives like,who were these people, of course it really makes no diffrence who they were,the only thing that matters now is there future,or lack of one.you can hear the sound of explosions mix with wepons fire and the low murmer of the engine.then the engines stop, and when they do its like all the doomed soldiers sitting in the back of the chimera take one last breath of air and hold it, together.the captian takes one last look at you all and says \"this is it,try to make a impact before your killed.\" on those parting words of wisdome he opens the doors and charges into the hail of gunfire.one by one you follow him out like lambs to the slaughter.</span></div></div>",
            "created":1321515540,
            "id":1224288,
            "title":"welcome to the guard"
        },
        "1111":{
            "choices":[
                "prepare for close combat",
                "retreat"
            ],
            "content":"<div class=\"\"><div> <span>as you exit the chimera you,and the rest of your unit, rush into a desert land scape litterd with dead bodys of men and xenos alike.the chimera drops you on the front line of a large battle to contain a xeno threat that destroyed a imperial city.your current orders are to assult the walls of the city and secure territory on the other side of the wall that can then be used as  a foothold for secureing the city.it immediatly dawns on you that the exit zone is a death trap,a horde of orcs instintly set on you and your comrades and begin to tear you into peices.you try to regain your composure and begin to fire on the orcs as they crash into your unit.a young soldier at the very front of the unit turns to retreat, and is stabed through his chest by a crude orc dagger,the boy falls to the ground half dead and is then trampled by the orcs.an old veteran fights off the beasts with his bayonet holding back the green tide seemingly single handedly , untill a bullet catches the old man in his stomach, as he flinches from the shot the orcs swarm him and pincushin him with there knives.as this happens you stand near the back of your unit placeing lasgun shots into as meny orcs as you can.with precision even some space marines woulde be proud of.you put hole after hole into the greenskin faces.there xeno blood erupts from the back of there skulls as fine mist that permiates the air.no matter how meny of the basterd you seem to kill more are soon there to fill there ranks and soon they have massacerd most of your unit and have put you at the front of your squad looking directly into there sick green faces.</span></div></div>",
            "created":1321517580,
            "id":1224290,
            "title":"exiting the chimera"
        },
        "11111":{
            "choices":[
                "go to the hill with the heavy bolter.",
                "continue to advance forward"
            ],
            "content":"<div class=\"\"><div> <span>you mimick a some of the guards on your flanks and raise your bayonet to begin close combat.as the orcs close the final stretch you lunge forward and throw all your weight into a stab at the nearest greenskin.the stab peirces his stomach showering you with his blood.you pull out the bayonet and continue wildly stabbing into the orcs,at this point you fight like a wild animal, slashing and stabbing like a madman.at the point you believe it to be all over the enemys line breaks and slowly starts recede,while you where holding off the greenskins in the melee a heavy bolter team positiond on a hill behind you gave you cover at the last second.the bolter rounds tear the retreating xenos limb from limb,literaly.for a second at least the whole war around you ceases to rage and you and your reamaining squad members wrap your heads around what just happend.then the war turns on again as a voice comes from behind you \"well i guess some of us made it,lets get moving,plenty more where that came from\" looks like the captian survived the battle,too bad.</span></div></div>",
            "created":1321520220,
            "id":1224300,
            "title":"close combat"
        },
        "11112":{
            "content":"<div class=\"\"><div> <span>you turn on your heels and run,pushing your brothers in arms out of the way,in your desprate attempt to save your own life.you dont get far. a lasround rips through your back after about 20 feet.you fall to the ground face first with a hole bigger then your fist clear through your lung.as you despratly gasp for air you manage to roll unto your back and raise your gun at whatever just shot you.you see a man dressed in a blue suit pointing a laspistol at you.\"no cowards,fight to your last breath men\" he says then,he blows your head clear off your body with the pull of a triger.</span></div></div>",
            "created":1321518240,
            "id":1224294,
            "title":"victory or death"
        },
        "114":{
            "author_id":"herrheinrich",
            "author_name":"Heinrich",
            "choices":[
                "To the Thunderhawk to kill some xenos scum!",
                "To the Chaplain to receive the Blessing"
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes and you see all your battle brothers kneeling in front of the Chaplain while he continue his speech.<br>\r\n«...And today we have been called! The planet of Kairus has been attacked from those awful and arrogant xenos...They think that they cannot lose...Today, The God Emperor eyes are upon us, WE will show to those filthy animals the rage of the Space Marines! THE RAGE OF THE GOD EMPEROR WILL!»<br>\r\n<br>\r\nYou and your battle brothers stand up roaring your rage toward those xenos, the orks.<br>\r\n<br>\r\nThen everyone is moving towards the assigned Thunderhawk, ready to leave the Battlebarge and descend on the planet to meet in battle the enemy, but you see some of your companions that are receiving the blessing from the Chaplain.<br>\r\n<br>\r\nWhat do you want to do?</span></div></div>",
            "created":1295373960,
            "id":1037669,
            "title":"Adeptus Astartes"
        },
        "1141":{
            "author_id":"herrheinrich",
            "author_name":"Heinrich",
            "choices":[
                "Keep firing with your Bolter",
                "Go and take the Heavy Bolter"
            ],
            "content":"<div class=\"\"><div> <span>You go in the Thunderhawk that you're assigned to, preparing yourself for the incoming battle.<br>\r\n<br>\r\nWhile getting down on the planet your Sergeant start the briefing telling you that you're going directly in the heart of the battle, you have to gain time in order to let the Imperial Guard to regroup.<br>\r\n<br>\r\nWhen the Thunderhawk leave you on the battlefield you see corpse among corpse of loyal imperial guardsmen noticing that the orks have suffered little to nothing casualties.<br>\r\n<br>\r\n«BATTLE BROTHERS! Regroup on my position and advance! We'll take those trenches as our position.»<br>\r\n<br>\r\n«Sir, Yessir!»<br>\r\n<br>\r\nYou and your squad advance towards the abandoned trench, no orks signs until your squad reach the trench, just after that you hear a loud scream from the enemy lines<br>\r\n<br>\r\n«HUMIES! GREEN IZ BEZT! WAAAAAAAGH!»<br>\r\n<br>\r\nNow you see them, thousand upon thousand of green xenos charging the space marine line of defense, screaming and firing with they're weapon, you start shooting with your bolter mowing them down, your battle brothers doing just the same.<br>\r\n<br>\r\nEverything was going easily when a lucky shot from one of the orks kill in a headshot one of your brothers, the one with the heavy bolter... what do you do?</span></div></div>",
            "created":1295464740,
            "id":1038269,
            "title":"To the Thunderhawk to kill some xenos scum!"
        },
        "1142":{
            "author_id":"herrheinrich",
            "author_name":"Heinrich",
            "choices":[
                "Tell him of the dreams and the nightmares",
                "Tell him you're eager to fight the orks"
            ],
            "content":"<div class=\"\"><div> <span>You kneel in front of the Chaplain.<br>\r\n«Brother Pausanius, Are you seeking for the Emperor Blessing?»<br>\r\n«Yes Chaplain Brother»<br>\r\n«Let a wave of repugnance for the enemy wash over you.<br>\r\n  Let hatred fill you.<br>\r\n  Hate is good, for our goal is a Human galaxy. <br>\r\n  We are called by the Emperor with a sacred duty to conquer it in His name.<br>\r\nHe's watching you Brother, show your enemies what is a Space Marine!»<br>\r\n<br>\r\nThe Chaplain chant toward yourself and then give you the blessing, but he's still watching you.<br>\r\n<br>\r\n«Brother, Have you something to say?»<br>\r\n<br>\r\nYou think of all the dreams that you had during the trip from the chapter fortress until you arrived on Kairus, what do you do?<br>\r\n<br>\r\n  </span></div></div>",
            "created":1295378280,
            "id":1037708,
            "title":"To the Chaplain to receive the Blessing"
        },
        "11422":{
            "author_id":"herrheinrich",
            "author_name":"Heinrich",
            "choices":[
                "Go speak with them",
                "Go to the front line"
            ],
            "content":"<div class=\"\"><div> <span>You look directly into the eys of your Chaplain beore say<br>\r\n<br>\r\n«Brother Chaplain, I want only to kill those filthy xenos that are menacing the human on the planet»<br>\r\n<br>\r\nThe chaplain keep looking on you for a few seconds before giving you the permission to leave.<br>\r\n<br>\r\nWhile you run to get on one of the Thunderhawk he look at you muttering under his breath:<br>\r\n<br>\r\n«I hope so Brother...I hope so.»<br>\r\n<br>\r\nAfter your arrival on the planet your squad leader Sargent Romulus called you for the briefing.<br>\r\n<br>\r\n«Brother, we are here to slain those orks who tried to bring their evil war on this planet, we have to give time to the Imperial Guard to regroup and set up their defenses. To do so we're going to divide our forces on all the front line, our squad has been assigned here, on Alpha 21 position. Brothers get ready, we're going in T minus 10 »<br>\r\n<br>\r\nYou got out of the tent were the briefing was hold and see your battle brothers prepare themselves, you...</span></div></div>",
            "created":1295463180,
            "id":1038259,
            "title":"Tell him you're eager to fight the orks"
        },
        "12":{
            "author_id":"herrheinrich",
            "author_name":"Heinrich",
            "choices":[
                "Eldar",
                "Dark Eldar",
                "Necrons",
                "Tau",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>You choose to fight against the Imperium but in favour of which race?<br>\r\n<br>\r\nEldar:<br>\r\nThe Eldar are a race of elf-like humanoids who look into the future via psychic powers. Once they dominated the Galaxy but are currently a dying race. Still they're technologically advanced and in more than one occasion they proved that they can still inflict serious damage to who is fool enough to underestimates them.<br>\r\n<br>\r\nDark Eldar:<br>\r\nThe Dark Eldar are kindred to the Eldar, but here end they're resemblance.<br>\r\nTheir armies usually have the advantages of speed and technology, though they are often lacking in resilience and numbers. The Dark Eldar revel in piracy, enslavement and torture, and are sadistic in the extreme.<br>\r\nThe Dark Eldar are unique amongst the races in the sense that they do not occupy many planets, but rather one dark city called Commorragh. They are mainly pirates, though are sometimes used as mercenaries. <br>\r\n<br>\r\nNecrons:<br>\r\nThe Necrons are a group of metal warriors, created from the Necrontyr, an ancient and once powerful race which tried to find a way to lengthen their lives with to no avail. In their desperation, they looked into space and discovered ethereal beings feeding on the energies of whole stars. They named these beings \"the Star Gods,\" or C'tan. The C'tan offered the Necrontyr people immortality, but only at a terrible price.So their race was completely purged and transferred into their new metal bodies, stripped of thought and self.<br>\r\n<br>\r\nTau:<br>\r\nThe Tau are a young race of technologically-oriented beings, they seek to bring the peace through the galaxies with the help of their spiritual and political guide, the Ethereals.<br>\r\nUseless to say, even if they're seeking peace and collaboration with the others races of the universe they're ready to fight to defend their religion and their race if threatened, they make uses of advanced military technology to kill they're foes at long distances unleashing true storms of fire and bullets.<br>\r\n</span></div></div>",
            "created":1295209860,
            "id":1036522,
            "title":"Aliens, renegades or heretics?"
        },
        "125":{
            "author_id":"herrheinrich",
            "author_name":"Heinrich",
            "choices":[
                "Orks",
                "Tyranids",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>Others race seeking to bring war and destruction in the Universe:<br>\r\n<br>\r\nOrks:<br>\r\nOrks are a warlike, crude and highly aggressive green-skinned alien race.Although their society is entirely primitive and brutal, the Orkoid race is also the most successful species in the whole galaxy, spread throughout the galaxy and outnumbering possibly every other race. However, due to this aggressive and warlike nature, the massive race is split into hundreds of tiny empires, warring as much between themselves as against other races. In the purely theoretical event all the Orks were to unite, they would undoubtedly crush all opposition.<br>\r\n<br>\r\nTyranids:<br>\r\nThe Tyranids are an extragalactic alien race, whose sole purpose is the consumption of all forms of genetic and biological material in order to evolve and reproduce. Tyranid technology is based entirely on biological engineering. Every function is carried out by living, engineered creatures, each of which collectively forms the Hive Fleet, directed by a single Hive Mind. <br>\r\n</span></div></div>",
            "created":1295211660,
            "id":1036547,
            "title":"Others"
        },
        "1251":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Ork Empire",
                "Feral Ork Colony",
                "Death World or someplace else?"
            ],
            "content":"<div class=\"\"><div> <span>And what kind of world are you from? <br>\r\n<br>\r\nMaybe you're from a sprawling ork empire preparing to launch a massive WAAAGH! in an effort to deal with crippling overpopulation. Maybe you're from a feral ork colony, abandoned millennia ago and forced to make do with weapons even more primitive than that of regular orks. Alternatively you may be on a death world, a planet considered too dangerous and fun for \"dem panzy 'umies!\"</span></div></div>",
            "created":1540643040,
            "id":2569165,
            "title":"Orks"
        },
        "12513":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Seris",
                "Someplace else"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<b>Seris</b><br>\r\n<br>\r\nAround 500 years ago an ork spaceship strayed away from it's fleet, due to a calculation error made by one of the meks who as busy slacking off. The ship soon crashed on planet Seris, a desert deathworld. The orks of Seris have since abandoned any desire to leave the planet, since the rich ore deposits on Seris ensure that the orks don't run out of weapons to test on eachother</span></div></div>",
            "created":1540643880,
            "id":2569167,
            "title":"Death World or someplace else?"
        },
        "1253":{
            "author_id":"herrheinrich",
            "author_name":"Heinrich",
            "choices":[
                "Chaos Marines",
                "Chaos Daemons"
            ],
            "content":"<div class=\"\"><div> <span>The last enemies of the Mankind:<br>\r\n<br>\r\nChaos Space Marines:<br>\r\nChaos Space marine, known also as Traitor Marines or Chaos Marine, were once members and brothers of the Adeptus Astartes organization, but they betrayed they're own brothers following the Chaos Gods seeking unlimited power.<br>\r\nThese once loyal warriors are the evil counterpart of the Adeptus Astartes and they now live to see the Imperium smashed with them as a ruler.<br>\r\n<br>\r\nChaos Daemons:<br>\r\nDaemons are vicious creatures spawned from the nightmare dimension of the warp. Feeding upon the emotions of mortals they mount cataclysmic invasions, annihilating entire star systems in their wake.<br>\r\nThe Daemons serve four Lords, each one of them with the same dream, annihilate the others and rule alon among all.<br>\r\nThe four Chaos Gods are:<br>\r\n<br>\r\nKhorne,Chaos god of anger, violence, and hate. Every act of violence gives Khorne power, whether committed by his followers or by enemies, images of Khorne show it to be a mighty being, sitting upon a great throne of brass atop a mountainous pile of bleached skulls centered in a lake of blood.<br>\r\n<br>\r\nNurgle, Chaos god of morbidity, disease and physical corruption. The physical likeness of Nurgle is described as gigantic and bloated with corruption, with foul-coloured leathery and necrotic skin. <br>\r\n<br>\r\nSlaanesh, is the Chaos God of lust, excess, pleasure, perfection and hedonism. Slaanesh typically appears in a form which is female on the right side and male on the left with two sets of horns rising from its flowing golden hair.<br>\r\n<br>\r\nTzeentch, is the God of Chaos who represents the vitality and volatility of change. Tzeentch is closely associated with sorcery and magic, as well as dynamic mutation, and grand, convoluted scheming. He is often visualized as the serpent which writhes and twists to represent constant change and this is mirrored in its symbol with curves and points to represent change and conclusion. </span></div></div>",
            "created":1295212860,
            "id":1036564,
            "title":"Others"
        }
    },
    "info":{
        "author_id":"herrheinrich",
        "author_name":"Heinrich",
        "brief_description":"It is the fortieth millenium, the Imperium of Man is  facing threats from all sides.\r\n\r\n",
        "created":1295175900,
        "description":"<td align=\"left\" class=\"norm\">It is the fortieth millenium, the Imperium of Man is  facing threats from all sides:<br>\r\nOrk, Eldar, Necron, Tau, Renegades and Heretics, these are only some of the threats, many others awaits in the darkness of the cold space to reveal.<br>\r\nWill you save the Mankind or will you condemn it to death?<br>\r\n<br>\r\nChoose your faction and fight for your victory among all the others.<br>\r\n<br>\r\n---------------------------------<br>\r\n<br>\r\nThis is an interactive on Warhammer 40.000 if you don't know what's this i suggest you to visit this link before start your adventure: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://en.wikipedia.org/wiki/Warhammer_40,000\" target=\"_blank\">http://en.wikipedia.org/wiki/Warhammer_40,000</a><br>\r\n<br>\r\nOk some rules:<br>\r\n<br>\r\nNo sex<br>\r\nNo fetishes<br>\r\nDo not exaggerate with your addition, for example a normal human cannot defeat an ork warlord alone.<br>\r\n <br>\r\nI'll check any addition and, if necessary, i'll take action.<br>\r\n<br>\r\nEnjoy!</td>",
        "id":1742278,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1540643880,
        "modified":1540643880,
        "pretty_title":"WARHAMMER40K: LET THE GALAXY BURN!"
    }
}