{
    "chapters":{
        "1":{
            "author_id":"tallbigcal2",
            "author_name":"Tallbigcal2",
            "choices":[
                "Brittany spears",
                "Selena Gomez",
                "GOT characters ",
                "Star Wars characters ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose one to cut your hair</span></div></span></div>",
            "created":1559613660,
            "id":2668810,
            "title":"Who’s cutting your hair?"
        },
        "15":{
            "author_id":"tallbigcal2",
            "author_name":"Tallbigcal2",
            "choices":[
                "Older",
                "Younger",
                "Twin",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about your sister?</span></div></span></div>",
            "created":1560806880,
            "id":2674879,
            "title":"Other"
        },
        "152":{
            "author_id":"tallbigcal2",
            "author_name":"Tallbigcal2",
            "choices":[
                "By force",
                "Willing"
            ],
            "content":"<div class=\"\"><div> <span>You were 17 years old not too much older than your sister Jillian. Jillian was 16 and she was short with medium length bleach blonde hair. Your parents were away because it was their anniversary and they were going out on a date so you and her were left home alone. <br>\r\n<br>\r\nHow do you get your haircut?</span></div></div>",
            "created":1560807300,
            "id":2674881,
            "title":"Younger"
        },
        "1521":{
            "author_id":"corndogs33",
            "author_name":"Megamax",
            "choices":[
                "Jillian tilts you back into the sink to wash your hair ",
                "Jillian pulls out her scissors and comb ",
                "Jillian pulls out a razor "
            ],
            "content":"<div class=\"\"><div> <span>Jillian calls your name and you follow the sound of her voice into the bathroom and find your dad’s office chair in front of the mirror <br>\r\nYou enter to investigate and then you hear the door slam behind you<br>\r\n<br>\r\n“Hello brother” Jillian says with an evil smile on her face, you run to the door and find to your horror that she locked it <br>\r\n<br>\r\n“What do you want Jill?” You ask <br>\r\n<br>\r\nJillian walks up to you and starts to play with your thick four inch long brown hair that covers your ears and is just touching the bottom of your neck<br>\r\n<br>\r\n“I brought you in here because you need a haircut” Jillian said as she led you to the chair and sat you down in front of the mirror <br>\r\n“I’ve waited so long to style your hair bro and now I can finally cut that mop” Jillian says as she pulled out the salon kit that she uses to practice on wigs. <br>\r\n<br>\r\nAs your sister unpacks her tools you attempt to slip away but the door is still locked <br>\r\n“Come on it won’t hurt” Jillian says as she sits you back down in the chair and drapes a long black cape over you, your body is completely covered by the long silk cape leaving only your feet visible.<br>\r\n<br>\r\nJillian begins to comb your hair and examines your face in the mirror as she decides how she is going to cut your hair <br>\r\n<br>\r\nJillian then snaps her fingers as the style comes to mind “say goodbye to your old hair brother” Jillian says as she slowly turns you around in your chair and you get one last look in the mirror before your hair is to be cut off <br>\r\n<br>\r\n</span></div></div>",
            "created":1588942440,
            "id":2832187,
            "title":"By force"
        },
        "15212":{
            "author_id":"corndogs33",
            "author_name":"Megamax",
            "choices":[
                "Something neat ",
                "Something crazy "
            ],
            "content":"<div class=\"\"><div> <span>Jillian pulls out her comb and scissors and begins her work on your hair. <br>\r\n<br>\r\n“I’m gonna make you so handsome brother” Jillian says as she combs your long hair you begin to fidget under the cape as the comb continues to run through your hair. You are constantly considering running for the door but you always remember that it is locked, you consider leaping from the window but you are on the second story so jumping will only break your leg and Jillian will likely just cut off your hair until the ambulance arrives. <br>\r\n<br>\r\nAs all your ideas run through your head your sister then holds the scissors in front of your face, she snaps them together and as you hear the dreaded snip snip of her scissors you know that you’re about to kiss your head of thick hair goodbye <br>\r\n<br>\r\nJillian combs up your bangs which are parted to the left side of your forehead and she takes the scissors to your hair <br>\r\n<br>\r\nYou then hear a (snip snip snip) and watch as brown hair falls onto your lap and you freeze in place as you think to yourself (my haircut has begun) and another few snips are accompanied by more hair falling onto your lap <br>\r\n<br>\r\nJillian hums to herself as she cuts your hair, the scissors continue to slice through your brown locks as they rain onto the floor at your sister’s feet <br>\r\n<br>\r\n“So, how has school been for you?” Jillian asks pretending to be an actual hairstylist but you are just too frustrated to talk to her so you just stay silent as Jillian continues to cut your hair <br>\r\n<br>\r\n“You know you should be this upset, after all I’m doing you a favor by giving you a haircut” Jillian says as she moves to the side of your head and begins to cut around your ears <br>\r\n<br>\r\nYou just stay silent and let your sister get it over with <br>\r\n<br>\r\n“Okay but when the girls start fighting over you I won’t cut your hair again” Jillian says as she slices off your sideburn <br>\r\n<br>\r\nAfter about a half hour Jillian puts her scissors down and grabs some gel and her comb and begins to style your hair and you just look down too nervous to know what she is doing<br>\r\n<br>\r\n“And finished” Jillian says as she begins to slowly turn you around. You stare at the floor that is completely covered by brown hair then your head slowly rises to look at your reflection and you are taken aback by the style your sister gave you<br>\r\n<br>\r\nWhat did Jillian give you</span></div></div>",
            "created":1588944240,
            "id":2832203,
            "title":"Jillian pulls out her scissors and comb "
        },
        "15213":{
            "author_id":"tallbigcal2",
            "author_name":"Tallbigcal2",
            "choices":[
                "I hate it",
                "I love it",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You began to wonder what it was when you heard a click followed by a buzzing sound. “I think you would look better bald big bro.” Jillian says laughing maniacally as the razor gets closer and closer to your head. “Hold on let’s talk about this!” You say trying to get up, but before you can she wraps her arm around your neck holding you in place and takes the first chunk out of your hair. “No going back now.” She says with a smirk.<br>\r\n<br>\r\nJillian starts by going right down the middle and the hair falls onto the floor around your sisters feet and you can also feel your lap get heavier as more and more hair falls onto it. “I’m bored of the clippers.” She says pulling out scissors and cutting off hair at random. “Crazy weather we’ve been having huh?” She says clearly having a blast. “Yeah it seems to be raining hair.” you say sourly.<br>\r\n<br>\r\nShe finishes your haircut and you look at yourself in the mirror. Your hair was piled up to your sisters ankles. “I think I got some I’m my shoes.” She says taking her shoes off and dumping a clump of hair onto the floor. “Well....what do you think?”</span></div></div>",
            "created":1598577060,
            "id":2892790,
            "title":"Jillian pulls out a razor "
        },
        "154":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "The Pet Salon: Special Sports Edition.",
                "Open Choice Chapter.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Instead of human characters what if there was an animated anthropomorphic dog that one day goes to a special pet salon whereas they not only have their usual clientele they cater to but also animated anthropomorphic animal professional wrestlers and sumo wrestlers who usually get their haircut and also groomed as well?</span></div></div>",
            "created":1560887160,
            "id":2675286,
            "title":"Other"
        },
        "1543":{
            "author_id":"tallbigcal2",
            "author_name":"Tallbigcal2",
            "choices":[
                "Teacher",
                "Student",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why not someone from school</span></div></span></div>",
            "created":1598979120,
            "id":2895696,
            "title":"Other."
        }
    },
    "info":{
        "author_id":"tallbigcal2",
        "author_name":"Tallbigcal2",
        "brief_description":"This is a story that will revolve around a character that gets a haircut",
        "created":1558488720,
        "description":"<td align=\"left\" class=\"norm\">Choose your character to play the story as and see where the journey takes you.<br>\r\n<br>\r\n- NO RULES<br>\r\n<br>\r\n👍PLEASE ADD TO STORY</td>",
        "id":2191535,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1598979120,
        "modified":1598979120,
        "pretty_title":"Haircut/Headshave "
    }
}