{
    "chapters":{
        "1":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Jake ",
                "Gramps",
                "Fu",
                "Dark dragon",
                "more?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will be growing?</span></div></span></div>",
            "created":1280206800,
            "id":925234,
            "title":"Who?"
        },
        "11":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Muscle growth?",
                "Weight gain?",
                "Cock growth?",
                "Expansion?",
                "other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will he grow?</span></div></span></div>",
            "created":1280293200,
            "id":925809,
            "title":"Jake "
        },
        "112":{
            "choices":[
                "By eating people.",
                "A spell gone wrong.",
                "Other choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Jake grow bigger and fatter?</span></div></span></div>",
            "created":1280725200,
            "id":928703,
            "title":"Weight gain."
        },
        "1121":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Jake finds the homeless people",
                "Jake goes straight to Brad"
            ],
            "content":"<div class=\"\"><div> <span>'Darn that Brad!' Jake grunted as he stormed into Gramps shop. Fu looked up in surprise from his newspaper.<br>\r\n<br>\r\n'whats wrong now kid?' he said disinterested. Fu folded away his paper and sat up feigning interest.<br>\r\n<br>\r\n'oh nothing except he gave me a wedgie today in front of the whole school! and then a swirlie, i wish there was someway i could get him back, someway to make him pay for all the times hes bugged me!'<br>\r\n<br>\r\nFu grinned devilishly and tented his fingers. Jake raised an eyebrow and moved closer to the counter to listen in on Fus plan. <br>\r\n<br>\r\n'you have an idea?' Jake asked leaning in. <br>\r\n'I might' Fu responded 'but lets say youll have to do something a little bit.......devious'<br>\r\n<br>\r\n'devious is my middle name, lets hear it' Jake smiled<br>\r\n<br>\r\n'Well, youve heard the fairy tales, Dragons burning down villages and ......eating people?' Fu winked on the last words.<br>\r\n'i dont get ya' Jake wasnt the brightest bulb<br>\r\n'you know, eating people?!' empahsis being placed on the end.<br>\r\n<br>\r\n'oh, oh! i see what you mean, but how do i...i mean what do i..?'<br>\r\n<br>\r\n'Trust me kid its a dragon instinct, youll know what to do when the time comes, but if you want to practice first....no one would miss the homeless people outside'<br>\r\n<br>\r\n</span></div></div>",
            "created":1280811600,
            "id":929357,
            "title":"By eating people."
        },
        "11211":{
            "choices":[
                "He eats the rest of the homeless.",
                "He hunts for Brad."
            ],
            "content":"<div class=\"\"><div> <span>Looking outside, Jake found the homeless people Fu mentioned. \"And I thought Gramp's practice was brutal.\" Jake whispered in disgust at the dirty hobos. Suddenly, he heard something growling. Changing into his dragon form, he said, \"Who wants some of this? Who wants some of this?\" Then he heard it again. This time, it was louder.<br>\r\n<br>\r\nSeeing it was his own stomach, Jake groaned. He wanted to face-palm himself. \"Hey. What's that?\" asked one of the hobos. Hearing them getting up, Jake turned to see the homeless coming closer. \"Hey, Mac. How much did you pay for that dragon suit?\" asked one of them.<br>\r\n<br>\r\nJake felt nervous. The homeless were getting closer. Then another thought popped into his brain. \"Duh!\" he said to himself. \"I'm a big scary dragon!\" he bellowed as he roared. The homeless then backed off. \"Okay. Form into a line so I eat your greasy butts.\" Jake said, \"Did I just say that?\"<br>\r\n<br>\r\n\"Yes, sir. Dragon, sir.\" said the homeless in the front. Lining up, Jake walked closer to the leader. His stomach groaned louder. Opening his jaws, he said mentally, \"Fu had better be right about this helping get back at Brad.\" Biting on the man's head, Jake felt something tingle inside his mouth. The homeless man's flesh tasted delicious. Could this be the instinct Fu mentioned?<br>\r\n<br>\r\nHoisting the man higher, Jake began to move his mouth further down his body. Like a python, Jake's mouth stretched larger as the man's head entered his throat and his shoulders began to travel into his maw. The man was screaming, but not loud enough for anyone else to hear.<br>\r\n<br>\r\nTasting his waist, Jake moved his mouth up to swallow his waist. As the man's head and shoulders entered his stomach, Jake's belly began to bulge out further. As his legs were kicking, Jake began to savor two great things: the power of being a predator and the taste of human meat entering his body.<br>\r\n<br>\r\nSwallowing his legs, Jake belched loudly as he ended his meal. \"Never knew people tasted so good.\" he purred at the taste. Hooked on human flesh, Jake was still hungry.</span></div></div>",
            "created":1280811600,
            "id":929547,
            "title":"Homeless for Dinner."
        },
        "112111":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "Sleep, digest, turn the bums into fat. ",
                "Nope, gotta get Brad first. "
            ],
            "content":"<div class=\"\"><div> <span>Whether from fear or awe or just stupidity, none of the other bums tried to flee, but kept standing in the line, waiting to be eaten. There were maybe a dozen of them altogether, and they were all pretty gross and filthy. <br>\r\nJake didn't care, in his hungry state the worst stench was just better flavoring. He grabbed the next two in his hands, and shoved one's head into his mouth, and began to swallow him down. But the whole process was taking too long... Maddened by his newfound craving, Jake thought of an insane way to keep eating. As he swallowed one bum up to his waist, and shoved the next one in the second there was enough room, he reached out with his tail and snagged a third one, then leaned forward and spread his legs, exposing his scaly, red butt and the anus within. He relaxed it as much as he could, took a deep breath, and shoved the third homeless guy's head into his ass with his tail. <br>\r\n\"Yeah, that's where stanky shit like you belongs!\" He snarled at the smelly human, who could barely hear him through Jake's own muscular butt-cheeks. He let out a surprised cry at the way it felt to have someone invade him like that and felt himself growing aroused. The entire situation was surprisingly sensual. All these smelly sacrifices lined up to feed themselves to him... They weren't worthy to be part of the M-drag, but he'd use them anyway. The homeless guy in his ass was up to his chest, and Jake positioned himself carefully and sat down, grunting softly as he forced a full grown human up his tight ass. Once the bum's dirty boots had slipped inside his pucker, Jake leaned against a wall, lifting his legs and exposing his rear to the line. <br>\r\n\"Get in there, shits! Hurry up!\" The next bum got down on his hands and knees and crawled to Jake's ass, needing only a firm shove from the dragon to pop his head inside, and he struggled to work himself in. As he did, Jake began lazily tracing his proud erection, relishing in the new feelings as three humans squirmed in his gut, one in his ass, and a second one trying to join him. He tried stretching his jaw, and finally got it to the point where he could stuff two people in at once. Immediately, he grabbed two more bums and shoved them into his mouth, gulping and stuffing them down with his hands until they were a huge bulge traveling down his throat. Even as he began to fear he could choke, he grabbed two more, and impatiently shoved the bum in his ass' legs in to join the rest of him. Seven humans inside of him, eight to go. Two more in his mouth, and another in his ass. He was eating frantically now, desperately trying to keep this incredible high and sate his newly insatiable hunger. He managed to fit three in his mouth in his next try, though he really did nearly choke. He didn't care. He just needed more! His tail was useless now, it was writhing uncontrollably from all the sensations, and his cock was leaking pre like a fountain. Another one in his ass, shoved in hard all the way to his filthy shoes, which disappeared with another hard shove. Jake nearly came right then, but he barely noticed. Two more in his mouth, gulped down to his huge and squirming gut, one more in his butt, until there was just one human left. <br>\r\nThis bum seemed to have finally snapped out of whatever trance had gotten the others, and turned to run. Jake laughed at the idea of letting his prey escape, and snagged him effortlessly. His ass was full of wiggling humans, and didn't feel like he had enough room for one more, so Jake dangled the terrified homeless man above his wide open maw, listening to him gibber and beg before dropping him in and swallowing. <br>\r\nHe lay there for several minutes, just basking in the feeling of it all, before he suddenly let loose a fiery belch that melted concrete. Of course it would when the gases coming off the bums met dragon-fire... Another feeling gripped him, and he rolled onto his obscenely stuffed stomach, spread his legs and lifted his tail high, and emitted a fiery fart that put the burp to shame. When it finally tapered off, the struggling from his meals had lessened, and he rubbed his stomach contentedly. </span></div></div>",
            "created":1284437880,
            "id":956528,
            "title":"He eats the rest of the homeless."
        },
        "114":{
            "author_id":"tayman001",
            "author_name":"Taylor Manshanden",
            "choices":[
                "Helium inflation",
                "Water inflation",
                "More inflations (air etc.)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about inflation?</span></div></span></div>",
            "created":1399657980,
            "id":1793893,
            "title":"Expansion?"
        },
        "115":{
            "author_id":"tuff15malc",
            "author_name":"remer I'm evil",
            "choices":[
                "vore",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what else ?</span></div></span></div>",
            "created":1341171180,
            "id":1370117,
            "title":"other?"
        },
        "12":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Muscle Growth?",
                "Expansion?",
                "Weight gain?",
                "Cock growth?",
                "Reader choice?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will he grow?</span></div></span></div>",
            "created":1280206800,
            "id":925236,
            "title":"Grampa Growin, how?"
        },
        "123":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Food",
                "Potion",
                "other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you want him to bloat, gain and swell? Hows this gonna happen?</span></div></span></div>",
            "created":1280984400,
            "id":930474,
            "title":"A chubbier lao shi?"
        },
        "1232":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Nothing happens yet",
                "He suddenly gains all over!",
                "other?"
            ],
            "content":"<div class=\"\"><div> <span>Lao shi sighed climbing onto the stool that sat before the counter. He hated being short, everything was a chore.<br>\r\nHe had given up hope long ago that he would grow any taller. Time had sent that ship sailing..<br>\r\n<br>\r\nHe lazily tented his fingers on the desk and looked out to a door that would never open. No customers, never.<br>\r\nDaydreaming he looked around at his store. Every shelf had a stool in front of it, angrily he hit his fists on the desk shouting 'AYE YAH'. In his fury he toppled the stool and fell to the floor with a thudd.<br>\r\n<br>\r\n'Thats enough!' he yelled throwing his arms in the air.<br>\r\n<br>\r\nNo one else was in the store so he ran to the open sign and threw it to closed. The shutters fell and he ran into the back room. The potion storage.<br>\r\n<br>\r\nFu had taken the time to label a few bottles, a few.<br>\r\n<br>\r\nLao shi squinted reading the labels until his eyes fell upon a bottle he believed to say 'growth' it was blurry but he thought 'to hell with it!' grabbed the bottle and eagerly gulped down its contents.<br>\r\n<br>\r\nLao shi waited....</span></div></div>",
            "created":1281762000,
            "id":936261,
            "title":"Potion"
        },
        "124":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Looked for a spell",
                "Went to get one of Fus potions",
                "Called Fu"
            ],
            "content":"<div class=\"\"><div> <span>It was midnight when Gramps woke up. Age had brought on many horrible things but Insomnia had to be the worst!<br>\r\nHe threw the covers off him and reached around for the remote hoping some late night TV might bore him back to sleep.<br>\r\n<br>\r\nFeeling around he found it and the room was light up with the TVs glow.<br>\r\n<br>\r\n'Ay yah!' he grunted to himself finding nothing of even partial interest. he kept flicking and changing until something caught his eye, something he felt drawn to and couldnt look away.<br>\r\n<br>\r\nGramps shuffled towards the end of the bed his smile growing as he neared the TV set. It was not an advert for Island jazz, oh no, but some hardcore gay porn!<br>\r\n<br>\r\nGramps felt a weird sensation come over him. He had never considered himself as gay before but he knew long ago that ladies werent doing it for him anymore. But regardless he couldnt look away and just started at the two rutting males pounding each other.<br>\r\n<br>\r\nGramps couldnt stand it anymore and reached down under his bed robes and grabbed his member that was now rock hard and begging for release!<br>\r\n<br>\r\nGramps moaned as he pumped it slowly up and down, dissapointed that he didnt have a further distance to travel than 5 inches. As the males on tv moaned so did he as he pumped harder and harder, faster and faster whilst caresssing his swollen ball sack with the other hand.<br>\r\n<br>\r\nSuddenly the pressure grew and he couldnt stand it any longer, with a cry he came. It spilled all over his robe.<br>\r\nBut where there should be pleasure there was sadness. This newfound sexuality meant nothing as a tiny cock wasnt going to get him far, in the heat of the moment he decided to take drastic measures and....</span></div></div>",
            "created":1280898000,
            "id":929799,
            "title":"The masters manhood"
        },
        "1241":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Use the oil",
                "Call Fu"
            ],
            "content":"<div class=\"\"><div> <span>Jolting down the stairs as fast as he could, Gramps ran into the backroom where shelves upon shelves held his spellbooks.<br>\r\n<br>\r\nHopping onto a stool he climbed up and looked at the shleves, running his fingers along the spines looking for the right one. Squinting he read the titles to himself <br>\r\n<br>\r\n'hmmmmmm not this one, no.....nope.....hmm...maybe?' he smiled broadly as he stopped on one book that seemed almost hidden from view. reaching in he grabbed it and read the title aloud 'secrets of dragons sexuality' He stiffled his laugh of triumph as not to wake Fu.<br>\r\n<br>\r\nHe threw open the book on a table and scanned for an appropriate spell. Using the index he found a page entitled ''dragon cock''<br>\r\n<br>\r\n''Dragons throughout the ages have been the most dominant of all magical creatures, especially male dragons. They quash all others in strength, speed, stamina but most of all in sexual capacity. It is widely believed that the dragon population.....'' yada yada yada gramps muttered scanning the page for more informtation<br>\r\n<br>\r\n''....their massive pulsing cocks'' 'bingo!' he called out<br>\r\n<br>\r\n''It has since been discovered that a dragons cock is greatly affected by two things...''<br>\r\n''Juniper oil'' Gramps smiled knowing there was some on the shelf ''or the saliva of a magical dog''<br>\r\nGramps gasped as he thought of Fu, he paused for a moment to think and then decided to...</span></div></div>",
            "created":1282839000,
            "id":944532,
            "title":"Go find a spellbook"
        },
        "12411":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Pour it on in human form",
                "Shift into dragon form"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gramps paused for a moment as he grabbed the bottle of oil, would it work better if he was in his dragon form? or maybe it wouldnt matter? he decides to</span></div></span></div>",
            "created":1282839480,
            "id":944540,
            "title":"Dragon or Human?"
        },
        "124111":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Its growing again!",
                "Hes gonna blow!"
            ],
            "content":"<div class=\"\"><div> <span>'nah, man meat will certainly be the better choice, oooh i can picture it now!' Gramps sat there on the stool with the bottle resting in his hand, as he imagined himself strutting along the street with a noticeable bulge thrusting through his strained robe.<br>\r\n<br>\r\nAs thoughts of his new swollen phallus filled his mind, his cock slowly rose to attention. the little pink head pulsing with lust. Lao shi threw his head back and moaned as played with the head with his fingers, squeezing at it and stroking it.<br>\r\n<br>\r\n'Ay yah!' he called in frustration 'i cannot stand it any longer, i want to be bigger now!' <br>\r\n<br>\r\nGramps popped open the bottle lid and inhaled the sweet smell of juniper, he moaned a little in anticpation. He poured some directly onto his hand, just a bit to start, enough to fill his palm. The soft clear oil spread over his hand and began to drip onto his thighs.<br>\r\n<br>\r\nHe easily wraps his whole hand around his pulsing cock, the oil squelches as it is squeezes into his skin. Gramps wastes no time slowly rubbing it in, his hand sliding up and down his short length leaving a lubed trail of oil behind making it glisten in the light.<br>\r\n<br>\r\nHe moans contented with his self service but then begins to feel strange. The pleasure becomes more extreme than usual and a soft rumbling noise begins to come from his crotch. He pants heavily as the pain and pleasure intensify.<br>\r\n<br>\r\nThis feeling slowly begins to subside 'i guess that stuff was a bunch of whooey!' Gramps sighs disapppointed,‘oh well, better finish what I started’ he smiles to himself and grabs the hilt of his still rock hard cock, the white pubic hair tickling his hand.<br>\r\n<br>\r\nHe begins to moan once more as he slides his hand up the soft, yet firm meat. With a shock he realises that his hand still has further to go than usual! He keeps sliding further and further than usual, his cock is growing in his hand!<br>\r\n<br>\r\nIt must be a good 9inches in length and 2.5 in girth! Much larger than normal. Proudly gramps pumps his new thicker meat. The heat of his swollen phallus warming his hand as he slides up and down, faster and faster, harder and harder! <br>\r\n<br>\r\nSweat runs down his brow as he grunts louder with pleasure ‘so big!….so…ngha!..big!’<br>\r\n<br>\r\nSlowly his balls begin to churn and he is overcome by a funny feeling..</span></div></div>",
            "created":1283077260,
            "id":946400,
            "title":"Lao shi is too eagre!"
        },
        "1241112":{
            "author_id":"puppyhell",
            "author_name":"Demon spawn",
            "choices":[
                "Jake finds the oil after school the next day, switch to his perspective",
                "He doesn't find it, continue following Gramps"
            ],
            "content":"<div class=\"\"><div> <span>          Gramps began to buck his hips as his efforts brought him closer to climaxing. His moans became increasingly loud. The head of Gramp's improvde cock was sweating precum. It ran down onto the shaft, lubricating it. This quickened the old man's pace.<br>\r\n<br>\r\n          With one final thrust, Gramps was brought to his greatest orgasm ever. Seed was pumped from his enlarged testicles, spraying a good distance from where he lay. The climax continued for a minute or so and coated the room in Gramps's cum.<br>\r\n<br>\r\n          Spent, the old man began too clean up his mess. Realizing that Fu would find the bottle and know that he had tried something, he began to think of places that it could be hidden. Gramps sneaked into Jake's room where the boy was sound asleep and had obviously engaged in a more mundane form of his grandfather's earlier activities.The bottle was hastily hidden under a pile of dirty clothes. Before leaving, Gramps looked at Jake for moment; the teenage boy's cock was still in his hand. As he exited, a smirk spread across the old man's face, happy that his tool was now larger. </span></div></div>",
            "created":1314310200,
            "id":1175074,
            "title":"The master's pleasure"
        },
        "12411121":{
            "author_id":"puppyhell",
            "author_name":"Demon spawn",
            "choices":[
                "Jake notices his growth.",
                "Jake doesn't notice and hides the oil in a new place."
            ],
            "content":"<div class=\"\"><div> <span>          Jake rushed home the following day. Rose and he had been partenered up for a science lab. When somebody accidentaly tripped her, her F cup breasts had landed squarely on his crotch. He had helped her up before she had noticed his already raging boner. Jake's erection didn't subside for the rest of the day. <br>\r\n<br>\r\n          As soon as he had reached his room, Jake shut and locked his door. He dropped his pants and boxers as quickly as he could, his throbbing hard on standing at its usual six and a half inch height. He rushed over to the pile of dirty clothes where he hid his lubricant from Gramps. As he dug through it, he found a bottle of juniper oil and wondered how it got there for a split second before tossing it onto his bed. Jake reached the bottom of the pile before he realized that he had used the last of the container the previous night. He then grabbed the closest thing that he could think of, the juniper oil on his bed. <br>\r\n<br>\r\n          \"This stuff probably doesn't work too well, so I had better use a lot of it,\" thought Jake, pouring a large amount into his hands. He began to work his right hand up and down his dick while his left massaged his testicles. The oil began to be absorbed into his package, making it larger. Jake was unaware his growing genitals, only the immense pleasure he received from masturbation.<br>\r\n<br>\r\n          When he reached climax, his cum began to cover his bedsheets and his penis began to soften at its new size. </span></div></div>",
            "created":1314314400,
            "id":1175113,
            "title":"Mixing growth with pleasure"
        },
        "124111211":{
            "author_id":"puppyhell",
            "author_name":"Demon spawn",
            "choices":[
                "Jake figuires out what is causing his growth",
                "He remains clueless"
            ],
            "content":"<div class=\"\"><div> <span>          Jake lay exhausted on his bed, his legs spread wide. He was breathing heavily. \"That was...amazing,\" Jake thought to himself. His cock was still leaking seed onto his bedsheets. He began to get up to start cleaning up after himself when he noticed something that demanded his attention.<br>\r\n<br>\r\n          \"Holy shit!\" Jake's eyes had fallen upon his eight and a half inch long, four inch wide cock laying soft on his testicles, which were now each the size of lacrosse balls. His look of shock quickly turned into a devious grin spreading across his face. \"I don't know what did this, but I am more than happy to accomadate.\" He began to harden again. \"I just can't keep you down, can I, little buddy?\"<br>\r\n<br>\r\n          Jake reached for the juniper oil again, this time applying more than he used in his previous session. Stroking his large appendage with both hands, Jake began to moan loudly and bucked his hips with increasing speed. The juniper oil started to soak into the teenager's already impressive manhood. When the oil had finished being absorbed, Jake's shaft stuck out a good sixteen inches from his body, his bolbous, purple head addding another three and a half; his nuts had become the size of whiffle balls. Jake's thrusting quickened, bringing him closer and closer to release until...<br>\r\n<br>\r\n          The tip of Jake's cock absolutely exploded, squirting thick ropes of semen onto the opposite side of his bedroom. Stream after stream, each shot only served to intensify his pleasure. His orgasm continued for a full three minutes, each shot as powerful as the last. When he was finished, he lay, spent, on his cum soaked sheets.</span></div></div>",
            "created":1314427500,
            "id":1175952,
            "title":"Round Two"
        },
        "13":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Muscle growth?",
                "Weight gain?",
                "Expansion?",
                "Cock growth?",
                "Other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will he grow?</span></div></span></div>",
            "created":1280379600,
            "id":926371,
            "title":"Growin the grey shar pei?"
        },
        "132":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Potion?",
                "Food?",
                "Other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you want Fu to bloat, swell and gain?<br>\r\nHows his new girth going to appear?</span></div></span></div>",
            "created":1280379600,
            "id":926373,
            "title":"Fat fu"
        },
        "1322":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Open the bag and chow down!",
                "Double check the cupboards for anything else",
                "Ask lao shi about the food"
            ],
            "content":"<div class=\"\"><div> <span>It was a quiet afternoon in New York city. <br>\r\nQuiet of course except for the electronics shop on Lao Shi in which a Shar pei was moaning and complaining.<br>\r\n<br>\r\nLoud groaning noises filled the shop where Fu dog sat impatiently on the floor rubbing his belly. 'where is that kid with the food?! he said hed be back hours ago and im starving!'<br>\r\n<br>\r\nJake had been given the task of buying Fus dog food for the week, but like many tasks, Jake was taking a lack luster attitude.<br>\r\n<br>\r\nThe sound of a bell sent Fu racing to the front door of the shop, the door opened to reveal a contented jake listening to his walkman and to Fus relief, a giant bag.<br>\r\n'where have you been kid?! im so hungry!'<br>\r\n<br>\r\nJake ignored him and blissfully continued with his walkman 'hey yo, pet store was closed so i went to the magical realm to find some, hope thats cool' Jake then left and walked into the back room, leaving Fu to his food.<br>\r\n<br>\r\nFu stared at the bag of food, scanning the bag carefully. This was no ordinary food, it was from the magical realm and there was no telling what it could do. 'Big boys puppy chow' Fu read aloud ' sure as hell aint no puppy' he laughed contently rubbing his small but bloated belly<br>\r\n<br>\r\nHe then decides to...</span></div></div>",
            "created":1284903240,
            "id":959657,
            "title":"Food?"
        },
        "13221":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "Gut!",
                "Head!"
            ],
            "content":"<div class=\"\"><div> <span>Fu eagerly tears open the bag and sees inside regular looking dog food, little brown nuggets smelling of sweet meat.<br>\r\n<br>\r\nHe starts to drool at the intoxicating aroma, but remembers that this is magical food and maybe he should just test a little first. He ponders for a moment whether he should listen to his head or his gut?</span></div></div>",
            "created":1284903420,
            "id":959658,
            "title":"Little or alot?"
        },
        "132211":{
            "author_id":"bluebloodred",
            "author_name":"Bluebloodred",
            "choices":[
                "He looks at his stomach!",
                "He feels funny!"
            ],
            "content":"<div class=\"\"><div> <span>Fu looks inside the bag and sees its filled to bursting with that delicious smelling food, he breathes in deep to inhale the aroma. He begins to pant and drool at the smell.<br>\r\n<br>\r\n'oooooh i cant stand it any longer!' with one last groan of his belly, Fu plunged his head in and eagerly began to chomp away at the food.<br>\r\n<br>\r\n'He grunts heavily as he goes further into the bag 'oh god this is sooooo good! i cant stop!' <br>\r\n<br>\r\nFu cannot contain his hunger and tries to force as much in his maw as he can, murring softly as he chews and swallows the tasty food. His tounge wrapping more and more chunks as he forces more down his throat. <br>\r\n<br>\r\n'its soo nice, soo tasty, hmmmmmm!'<br>\r\n<br>\r\nFu begins to feel full and collapses back with a content smile.<br>\r\n<br>\r\nHe just lays there until suddenly....<br>\r\n<br>\r\n</span></div></div>",
            "created":1284917700,
            "id":959739,
            "title":"Screw safety, lets eat!"
        },
        "134":{
            "choices":[
                "Jake",
                "Luong",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>While doing some work for Luong Lao Shi, Fu dog accidentally dropped a vile of something that caused a powder to fall on his lower body.  Fu felt a tingling sensation as his cock and balls began to grow.  Fu was astonished as he watched his cock begin to grow and reach the floor.  As he looked at it Fu began to feel incredibly horny.  Needing release Fu started to stroke himself off but quickly got tired of it and went to look for someone to help him get off.  Fu runs into... </span></div></div>",
            "created":1433636040,
            "id":1988785,
            "title":"Potion Accident "
        },
        "1341":{
            "choices":[
                "Jake tosses Fu aside",
                "Even as a dragon Jake can't stop Fu",
                "The powder begins to suck the size of Jake's cock and give it to Fu"
            ],
            "content":"<div class=\"\"><div> <span>Fu barely the room before he literately runs into Jake.  \"Hey Fu dog what...\" Jake began before spotting Fu's huge cock jutting from his body.<br>\r\n\"Oh nothing just working on something for your grandfather when I accidentally got something on my self and now I am really large and really horny,\" Fu said as he runs his eyes over Jake's twinky body and licks his lips.  Jake does not like the looks of this so he begins to slowly back away only for Fu to tackle him and ripe off all of Jake's clothes revealing Jake's toned body and a nice sized cock.<br>\r\n\"Come on Fu this is not cool,\" Jake said as he struggled to get away but Fu was too much for him.  Jake sighed having seeing no choice and became a dragon.  Fu did not even move as flames enveloped Jake's body and transferred into his dragon form.  </span></div></div>",
            "created":1434472140,
            "id":1993489,
            "title":"Jake"
        },
        "14":{
            "choices":[
                "vore",
                "feeding on junk food",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how does he gain grow or gain weight</span></div></span></div>",
            "created":1377492120,
            "id":1651626,
            "title":"Dark dragon"
        }
    },
    "info":{
        "author_id":"bluebloodred",
        "author_name":"Bluebloodred",
        "brief_description":"A story featuring the males of American dragon growing and voring!",
        "created":1280233800,
        "description":"<td align=\"left\" class=\"norm\">This story is about the growth and or voring of Disneys american dragon chracters<br>\r\n<br>\r\nRULES:<br>\r\nMuscle and cock growth are most encouraged! but also enjoy weight gain and expansion<br>\r\nAdult stuff, sex, incest, gay etc is ALLOWED<br>\r\nMALES only!<br>\r\nKeep the focus on dragons if possible!<br>\r\nAnything goes except for scat and urine!<br>\r\n<br>\r\nHAVE FUN!</td>",
        "id":1693872,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1434472140,
        "modified":1434472140,
        "pretty_title":"American Dragon growth/vore"
    }
}