{
    "chapters":{
        "1":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "Brad Pitt",
                "Tom Cruise",
                "Russle Crowe",
                "Ewan McGregor",
                "You choose"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Make male actors get fat. All thier is to it.</span></div></span></div>",
            "created":1139806800,
            "id":301315,
            "title":"Wich actor?"
        },
        "11":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "Papparazzi",
                "a space ship!",
                "nothing",
                "you decide",
                "somthin moving outside...."
            ],
            "content":"<div class=\"\"><div> <span>Brad woke up after having a strange dream, but as soon as he tried to remember what it was, he had forgotten it. He glanced over at his clock, it was 3:12 a.m. He got up groggily heading for his bathroom. As he walked, he tried to force his brain to remember what he was dreaming, but nothing came to his head. In the bathroom he took a piss and stepped in front of the mirror. When he saw his reflection, the dream came back to him. He was at a beach wearing a speedo, but instead of him being muscular, he was fat! <br>\r\n\"Wierd.\" he said to himself. He admired his angular face and wondered, what would it be like to be fat? He pushed the though out of his head and scratched his shortly cut blonde hair. <br>\r\nHe was heading out of the bathroom when suddenly, there was a bright white flash came from the bathroom window. After a moment being stunned from the light, he ran to the window to see...</span></div></div>",
            "created":1139872500,
            "id":324288,
            "title":"Brad Pitt"
        },
        "113":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "Brad walks outside",
                "Dosn't and goes back to bed"
            ],
            "content":"<div class=\"\"><div> <span>Brad runs to the window and looks outside, but finds absolutly nothing. He turns around and heads back to his room. When he got there, he was surprised to find his bed was completely made, and there was a piece of paper on the pillows. He picked it up. There was some very sloppy writing on it. It read \"meet me outside\" what dose Brad do?</span></div></div>",
            "created":1140185040,
            "id":302064,
            "title":"A Note"
        },
        "114":{
            "author_id":"mantaraider",
            "author_name":"Thumbnails",
            "choices":[
                "he was home",
                "The tube was still there"
            ],
            "content":"<div class=\"\"><div> <span>\"Huh?\" he said dazed. Soon there was another flash and the entire room spun causing him to black out.<br>\r\nHe awoke in a daze. He tried to move his arms but instead found that they had been tightly bound to a chair. In front of him was a giant tv screen displaying many different images.<br>\r\n\"Hello?\" He cried out. But as soon as he had a small tube came down from the ceiling. Mechanically it affized itself to his mouth aned began pumping a thick sweet substance into him. Soon he blacked out again but when he awoke he found...</span></div></div>",
            "created":1139982000,
            "id":316750,
            "title":"The tube"
        },
        "1142":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "a mound of fat!!!",
                "His abbs?"
            ],
            "content":"<div class=\"\"><div> <span>He woke up slowly, he tried to stand up, but he found the the restrains on his arms and legs were still there. He saw the long tube still attached to his mouth with a honey colored liqued running through it. He tried to spit the tube out, but it was wedged in his mouth just far enough so he wouldn't choke, but also so he couldn't get it out. <br>\r\nHe felt wierd, somthing was diffrent, his boxers that he had slept in were tighter, and his undershirt was sitting between his chest and abbs. His muscle's felt diffrent to. He tried to move them, but they didn't seem to respond to his commands. He tried looking down, but the tube held his head straight, forcing him to watch the t.v. <br>\r\nThere was no sound coming from the it, just pictures. He watched them flash by. They were all pictures of fat guys. Some of them at the beach, or at the movies. But in all of them, you had a good view of thier bellies, and fat. <br>\r\nAfter a few minuets of watching the fat guys the tube suddenly empties. It moves away and back toward the cieling. His head being free, he looks down at his stomach to see what was making him feel so wierd. What he sees though is... </span></div></div>",
            "created":1139979600,
            "id":301701,
            "title":"dinner and a show"
        },
        "11421":{
            "author_id":"spuffyromy",
            "author_name":"spuffyromy",
            "choices":[
                "Wants a mirror ",
                "Hears one one comming"
            ],
            "content":"<div class=\"\"><div> <span>After a few minuets of watching the fat guys the tube suddenly empties. It moves away and back toward the cieling. His head being free, he looks down at his stomach.<br>\r\nTo see what was making him feel so wierdWhat he sees though is  a mound of fat.<br>\r\noh my god my abs are gone he thought looking at the fleshy mound.<br>\r\nThe  restrain on his right arm released itself .<br>\r\nHe tried to pull the other restrain off but it didn't work.<br>\r\nSo he ran his free hand over his new belly pulling his shirt up more he poked it it jiggled a bit.<br>\r\nHe moved his hand as far under his self as he could he grabbed his once firm butt. it was now soft he couldn't see how big it got but he could feel it way bigger.<br>\r\nHe </span></div></div>",
            "created":1311798600,
            "id":1155928,
            "title":"a mound of fat!!!"
        },
        "11422":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "that he was ferociously hungry...",
                "He had eaten all the food  in his house!!"
            ],
            "content":"<div class=\"\"><div> <span>He looked down to see, his abbs! But somthing didn't feel right. He stood up wobbely and looked around the room. \"What is going on?\" He said to himself. He walked over to the t.v. and looked for an off button. The pictures of fat guys were wierding him out. On the bottom of the screen, there was a unlabled button. Brad reached down and pushed it. As soon as he did, another great white flash appeared and he went unconsiocious.<br>\r\nBrad woke up slowly, when he had opened his eyes all the way, he realized he was in his house! He stood up and found he had been sleeping on the kitchen floor. He looked around and found....</span></div></div>",
            "created":1139979600,
            "id":301770,
            "title":"Wake up."
        },
        "114221":{
            "author_id":"mantaraider",
            "author_name":"Thumbnails",
            "choices":[
                "it was empty",
                "large quatities of weight gain material"
            ],
            "content":"<div class=\"\"><div> <span>Hi stomach rumbled with a force that took him completely off guard. A loud groan emerged from it like a sonic boom that seemed to echo off the walls. He gripped it as he fell to the floor in pain. Images flashed in front of his eyes like flashbacks. He saw himself eatting cake, he saw himself growing, taking a shower with a huge belly, he saw himself immobile, then in college with a slight gut. <br>\r\nBefore he could even grasp what was happening he was at the fridge only to find...</span></div></div>",
            "created":1140066000,
            "id":301821,
            "title":"Painful hunger"
        },
        "1142212":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "a slight weght gain",
                "a large weight gain"
            ],
            "content":"<div class=\"\"><div> <span>Before he knew what was happening, he pulled open the fridge door to find it was filled with Gainer shaked and the fattiest foods he could think of! His stomach let out a louder groan, and the pain of hunger increases. He immediatly starts grabbing food and gainer shakes and guzzling them down. <br>\r\nBrad tried to control himself, but all his body would let him do was eat. Shakes, pies, burgers, and even a few wierd pills were all forced into his stomach. <br>\r\nWhile he was eating, more images came into his head. There was an image of him fat as a child, another image of him in his late 20's, with a beer belly, and a girl swooning over it. Another picture came, this time he looked about a year younger then the last picture, and he was definatly over 400 lbs! His belly was soft and drooped over his very large jeans. He had 3 chins! And his face was chunky and round, but he was smiling, he was happily playing with his immense fat.<br>\r\nBrad puzzled over this when the fridge was suddenly empty. Brad's hunger suddenly stopped. He stood up with som difficulty, feeling a bit dizzy. His balance was off center, his weight seemed to be distributed differently. He looked down to see,</span></div></div>",
            "created":1140066000,
            "id":301845,
            "title":"Gainer guy"
        },
        "11422121":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "Start working out!!",
                "Find somthing else to eat."
            ],
            "content":"<div class=\"\"><div> <span>Brad looked down at himself after his huge feeding frenzy. His white undershirt was blotched with stains from all kinds of food. But underneath the shirt was the real damage. Brad lifted up his shirt to find His abbs were tottaly gone! In thier stead was one small belly. Brad Ran into his bathroom and looked into his mirror. His face wasn't angular any more. It was rounder, with chubby cheeks, and a slight double chinn. His chest wasn't firm and broad anymore. Instead, he had two small soft man boobs. His belly wasn't very big, but it was probably the largest part on him. It hung over his now tight boxers about and inch and a half, and was very smooth and soft. His butt had probably the biggest change though. From being firm, to soft and droopy. He sat down on the toilet and noticed that the extra padding on his but made him sit a little higher. He pulled out his scale and stood on it. The numbers flashed up to 234 a 24 lb gain!!! He gave his belly a little poke, and then decided...</span></div></div>",
            "created":1140066000,
            "id":301848,
            "title":"slightly fatter"
        },
        "12":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "forget it fat bad",
                "go to the beach think about it later",
                "look up on the internet, find a fast way to get fat.",
                "you decide"
            ],
            "content":"<div class=\"\"><div> <span>Tom had just finished acting in war of the worlds and was ready for a long break from movie making. It was mid mourning when he decided to check his fan mail. He got online and as usual, picked about 10 random e-mails and read them. <br>\r\n\"Tom your so hot, Tom I love you.\" Most of the e-mails said the same thing. \"Tom I'm gay.\" he deleted that one as soon as he read it. After 7 of those e-mails, he opens one that read, \"Tom, think you'd look cuter if you were chubby.\" Tom stopped at that one. He had been fighting the battle of the bulge since he got into acting, but never really thought about what it would be like if he got fat. For some reason, the though of him getting fat aroused him. He saved the e-mail and though for a minuet. He then decided to...</span></div></div>",
            "created":1139806800,
            "id":301332,
            "title":"Tom Cruise"
        },
        "122":{
            "choices":[
                "offered to help him get fat",
                "was in awe he was talking to Tom Cruise"
            ],
            "content":"<div class=\"\"><div> <span>\"Why would I become fat? I don't know but I'll just go to the beach.\" He thought to himself. As he arrived at the beach all the girls were staring at him as usual but today he was the only muscle man at the beach. \"Huh, strange.\" He said. The only other boys there were beached whales that looked like they weighed 300lbs or more. This secretly turned him on. This made him really want to get fat so he go to one of the guys and asks how to get his size. He...</span></div></div>",
            "created":1446970080,
            "id":2058204,
            "title":"go to the beach think about it later"
        },
        "123":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "There was a bottle of new pills on the counter",
                "He looked a little chubbier in the mirror"
            ],
            "content":"<div class=\"\"><div> <span>Tom quickly gets on to google and types in 'fat' it dose a quick search and comes up with thousands of websites. He looks through the first few, but finds nothing on wanting to get fat. He goes back to the main page and instead types in 'get fat' more pages, and still no results. He again goes back to the main page and this time types in 'I want to get fat' only 3 pages came up, the first two were filled with weight loss stuff. But the very last link on the very last page had it. \"I want to get fat!!\" read the link Tom moved the mouse arrow over it and clicked. It had a short description, and a link at the bottom of the page.<br>\r\n\"Click on the link below to get instantly fat!! Imediate results.\" <br>\r\nTom clicked on it. A little sign came up and said, thank you, we will deliver your purchas soon. The screen then changed back to the main google site. <br>\r\n\"Wierd\" Tom said, and got up to go to the bathroom. He passed the bathroom mirror and noticed somthing different. What was it? </span></div></div>",
            "created":1140152280,
            "id":302020,
            "title":"Google"
        },
        "1231":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "just eats them",
                "says stomach then eats them"
            ],
            "content":"<div class=\"\"><div> <span>There was a bottle of pills on his counter that he knew he didn't buy. Picked it up and read the name and instructions. <br>\r\n<br>\r\n\"Fat Fast!!\" was the title. The instructions read, \"Each pill will make you gain 10lbs. If you want a natural gain, just take a pill with a liqued. If you want to make a specific body part fat, say the body part, then take the pill with a liqued.\"<br>\r\n<br>\r\nTom finished, then looked in the bottle. There were hundreds of pills in there! He pulls out two pills and then, </span></div></div>",
            "created":1148686500,
            "id":320865,
            "title":"Fat Fast!!"
        },
        "12312":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Fat role in movie",
                "A sympathy belly"
            ],
            "content":"<div class=\"\"><div> <span>Tom said \"Stomach\" and he grab a glass cup and filled with water and drank and water with the pills<br>\r\n<br>\r\nTom felt an tingling feeling in on his stomach and he took off his shirt and saw that it slowly lost his six pack and now has slight baby belly.<br>\r\nTom also notice that he looked good and that he was very \"happy\". He saw that when he put his shirt on it barely covered it and when he stretch upward his shirt will lift upward.<br>\r\nTom decide that maybe there is a fat role he can take or win more people over with Katie being pregnant and have a sympathy belly.<br>\r\n<br>\r\nTom wants to get a ...</span></div></div>",
            "created":1313011260,
            "id":1165595,
            "title":"says stomach then eats them"
        },
        "13":{
            "author_id":"theday",
            "author_name":"Theday",
            "choices":[
                "On set of his new big budget movie?",
                "Hanging out with the Rugby Team in Sydney?",
                "At his agent's office talking about his next roll, oops, role?",
                "Taking a break from acting and motor biking around Austrailia? ",
                "Having a quiet day at his LA mansion?"
            ],
            "content":"<div class=\"\"><div> <span>Russell Crowe Long gone are the days where Russell could pull of a slim neo nazi like in his first real breakout role, Romper Stomper. Over the years Russel has been more and more known for growing a well trimmed beard and putting on some weight. Sure he's been muscular for a couple of roles, but those delicious craft tables on set, there's also his attempts to stop smoking which lead to his peak weight of 250 pounds sporting a nice big gut and a double chin no one could ignore. Russell kind of liked having muscular Dave Bautista joke and poke his belly. In fact Russell kind of got off on it.<br>\r\nSadly Russell had to lose the weight for roles like Noah and Man of Steel and got back down to under 200. But since then Russell has been slowly regaining the weight and has been finding it harder and harder to keep the weight off.  <br>\r\n<br>\r\nWhere do we find Russell? </span></div></div>",
            "created":1428655440,
            "id":1961828,
            "title":"Russell Crowe "
        },
        "15":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "Viggo Mortensen",
                "Toby Miguire",
                "Christian Bale",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More guy actors</span></div></span></div>",
            "created":1139872740,
            "id":302061,
            "title":"more actors"
        },
        "154":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "Ben Affleck",
                "some more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>even more actors</span></div></span></div>",
            "created":1139806800,
            "id":301713,
            "title":"pick one"
        },
        "1542":{
            "author_id":"totterer",
            "author_name":"tycoon",
            "choices":[
                "Matt Damon",
                "you decide"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>another one</span></div></span></div>",
            "created":1139979600,
            "id":301717,
            "title":"pick one alread!!"
        },
        "15422":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Ethan Supplee, or Abraham Benrubi",
                "John Arquette... or somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Better yet, start with some guys who are already big and make them magnificently obese!  Perhaps you'll want to fatten up Ethan Supplee, or Abraham Benrubi, or John Arquette... or somebody else!</span></div></span></div>",
            "created":1144942560,
            "id":312638,
            "title":"A few actors who are already a bit big"
        },
        "154222":{
            "author_id":"spuffyromy",
            "author_name":"spuffyromy",
            "choices":[
                "Freddie prinze jr",
                "Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cute yet dorky star wars loving    Freddie prinze jr</span></div></span></div>",
            "created":1311627540,
            "id":1154754,
            "title":"How about "
        },
        "1542222":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "chase ellison",
                "somone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about... </span></div></span></div>",
            "created":1342163640,
            "id":1377500,
            "title":"Else"
        },
        "15422222":{
            "author_id":"desynate",
            "author_name":"Desynate",
            "choices":[
                "The Franco Bros",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about James or Dave Franco, maybe both of them together?</span></div></span></div>",
            "created":1448766660,
            "id":2067774,
            "title":"somone else"
        },
        "154222222":{
            "author_id":"pork22558",
            "author_name":"Pork",
            "choices":[
                "Zac Efron",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zac Efron?</span></div></span></div>",
            "created":1514946180,
            "id":2436034,
            "title":"Someone else."
        }
    },
    "info":{
        "author_id":"totterer",
        "author_name":"tycoon",
        "brief_description":"Guys of Hollywood get fat!!",
        "created":1139871600,
        "description":"<td align=\"left\" class=\"norm\">You get to make the guys of Hollywood fat. They are not married, but can be in a relation ship, and they can be gay or not. You can have them willing, or unwilling to get thier bellies and you can use any method of weight gain. Alien abduction, magic, force feeding, anything. Just stay away from sex and death scenes.</td>",
        "id":1070789,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1514946180,
        "modified":1514946180,
        "pretty_title":"Male Actor Weight Gain"
    }
}