{
    "chapters":{
        "1":{
            "author_id":"twinsrock",
            "author_name":"Squeaky",
            "choices":[
                "continue on",
                "make your own"
            ],
            "content":"<div class=\"\"><div> <span>I decided to go the messy method, an knife. I sliced open his throat and watched him bleed to death. then I got a sawzall and cut up the body. Who doesn't love that sweet sound of flesh and bone being cut to pieces? Then I put the smaller pieces in a ziplock bag, Don't get mad, get glad ha ha.then I wrapped what was left of him up in plastic wrap and put everything into a large suit case.</span></div></div>",
            "created":1307854800,
            "id":1124446,
            "title":"Killing someone"
        },
        "11":{
            "choices":[
                "you can continue on",
                "come up with your own"
            ],
            "content":"<div class=\"\"><div> <span>hit by a skate boarder then stumbles into an old lady that shoves him down which caused him to be run over by a guy on a bike and thrown into oncoming traffic where the first car missed him by centimeters only to be hit by a big truck unable to stop in time. which doesn't kill him only spins him onto the other side safe at last he is amazed for about a second where a piano falls on him killing him</span></div></div>",
            "created":1308024360,
            "id":1125450,
            "title":"continue on"
        },
        "111":{
            "choices":[
                "continue on",
                "other choice",
                "other choice"
            ],
            "content":"<div class=\"\"><div> <span>She squirmed as I tightened the last of the knots. She tried to pull her hand away, but she couldn't. The rope was too tight.<br>\r\n<br>\r\nShe tried to speak, but I gagged her first thing. I didn't want her screaming for help, or trying to talk her way out of this.<br>\r\n<br>\r\nFinally, when the last knot was nice and tight, I stood up. \"Look to your right,\" I said.<br>\r\n<br>\r\nShe did so.<br>\r\n<br>\r\n\"The train will come from that direction, in about ten minutes. I tied you down just around the curve here so the train crew won't see you. But, even if they do, they'll be traveling about fifty miles an hour, so there's no way they can stop in time.\"<br>\r\n<br>\r\nShe moaned and struggled with the rope. I watched.<br>\r\n<br>\r\n\"Well, good bye,\" I said. I walked away.<br>\r\n<br>\r\nI didn't go far. I found a nice spot from where I could see her, and I sat down to watch.</span></div></div>",
            "created":1357955220,
            "id":1506586,
            "title":"tie her to the tracks"
        },
        "1111":{
            "author_id":"dnadream",
            "author_name":"DnaDream",
            "choices":[
                "And then...",
                "They both die.",
                "Help arrives"
            ],
            "content":"<div class=\"\"><div> <span>I couldn't see the trains approach but felt the slight rumbling beaneath my feet.  Each moment seemed to stretch on before it would end her miserable life.  <br>\r\n<br>\r\nNervous excitement caused my hands to tremble or I maybe I was just  hungry.    <br>\r\nHer eyes were focused on me. Although now the glazed stare and pleading look had disappeared.  Odd.  <br>\r\n<br>\r\nHer handbag was not ten feet away.  I knew should ditch it  after dumping the contents. Maybe she had some gum in there.  It took  me seconds to retrieve it. Sifting through her junk for gum, instead I found the sandwich she so nicely had saved for me. Aww. Such a thoughtful victim. I almost felt sorry for her. <br>\r\n<br>\r\n I took a bite. It was delicious...except for an unmistakable but almost familiar scent.   Akin to almonds.  Yet she used no almonds in it. <br>\r\n<br>\r\nI looked at my sandwich, then  at her again.   Tossing it down, I opened the neck of my shirt and wiped my brow.  Had it just warmed up twenty degrees?  Or was it just me?  <br>\r\n<br>\r\nI glanced toward her now  Was that a smile?  Impossible. <br>\r\nAnd then the cramping started. <br>\r\n<br>\r\nTurning to my side, I folded into fetal position and sputtered and choked on my own spit. Through blurred vision, I saw the front  of the train appear from behind some bushes.  <br>\r\n</span></div></div>",
            "created":1358152380,
            "id":1508489,
            "title":"continue on"
        },
        "11112":{
            "author_id":"sergeantc2",
            "author_name":"Word Smith",
            "choices":[
                "new story",
                "new story",
                "new story"
            ],
            "content":"<div class=\"\"><div> <span>She screamed into her gag as the train grew closer and closer. She was still struggling to get free, in fact, it looked like she tried a little harder as the train grew closer and closer.<br>\r\n<br>\r\nIt did her no good, though. I'd tied her up too tightly, and she should couldn't even begin to get the rope loose before the train was on her. Three large, heavy locomotives and a long string of cars rolled right over her, not stopping, not slowing down, not giving an sign that the crew even knew what they'd hit, and it turned her into pulp and kept going.<br>\r\n<br>\r\nI was vaguely aware of this, however. The pain was so great now that I couldn't move. My vision rapidly faded. I could still hear the train, but I could no longer see it. I couldn't move, couldn't breath. My limbs felt like they were on fire.<br>\r\n<br>\r\nI tried to stand up, but couldn't make my limbs move. I couldn't tell if I was standing or lying.<br>\r\n<br>\r\nI wanted to fight for life, but couldn't.<br>\r\n<br>\r\nThe bitch once told me we'd go within a few hours of each other. I guess she was right.</span></div></div>",
            "created":1422589620,
            "id":1925382,
            "title":"They both die."
        },
        "111121":{
            "author_id":"dnadream",
            "author_name":"DnaDream",
            "choices":[
                "Stay",
                "Leave"
            ],
            "content":"<div class=\"\"><div> <span><i> There he is! </i> she thought.  He looked like a crumpled ragdoll.   She ran toward him.  Her cellphone clutched in her hand, she'd dialed a number. <br>\r\n<br>\r\n\"911. Dispatch.  What is your emergency?  Hello. Are you there?\" The voice said.  <br>\r\n<br>\r\n\"Yes. Yes. I'm here. Someones laying on the ground staring up at the sky,  maybe hes dead.\"  <br>\r\n<br>\r\n\"Where are you,  ma'am?  What is your location?\"<br>\r\n<br>\r\n\"Just south of the railroad tracks at Washington and  45th Street. Please hurry.\"<br>\r\n<br>\r\n\"Help  is on the way.  Is the person breathing or is there blood anywhere?\" <br>\r\n<br>\r\nI...yes.  No.  I don't know.\" <br>\r\n<br>\r\n\"Did you see anything happen? \"<br>\r\n<br>\r\n\"No, but I heard some screams just minutes before, and there's blood on the tracks.\" She couldn't be there when they arrived, yet she couldn't leave him there like that, but she had to.<br>\r\n<br>\r\n\"Maa'm, this is important. Do you see blood anywhere?\"  <br>\r\nHello?  What is your name and do you know the person?\"<br>\r\n<br>\r\n\"You're starting to break up.  Hello?  Can you hear me?  Hello?\"  She said just before pushing the off button and shoved the phone into her body wallet.<br>\r\n<br>\r\n <br>\r\nKneeling, she  lifted his wrist, then touched his neck,  checked for a  pulse. He looked like a sheet of paper. If it was there, it was faint and there was hope. \"Wake up, sweetie, \"she whispered over him, pressing on his chest. \" One, two, three.\"<br>\r\nHer mouth hovered over his then hesitated. \"Poison! <div align=\"left\"></div>Oh god. No!\" </span></div></div>",
            "created":1423947660,
            "id":1933820,
            "title":"911"
        },
        "12":{
            "choices":[
                "make your own"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I think I would go with a more interesting method: buried alive. I could just imagine my victim panicking as they realize that there is no escape, unless of course you have ever seen \"Kill Bill\".</span></div></span></div>",
            "created":1308008100,
            "id":1125298,
            "title":"make your own"
        },
        "121":{
            "author_id":"twinsrock",
            "author_name":"Squeaky",
            "choices":[
                "Your turn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you could always convince them to kill themselves. </span></div></span></div>",
            "created":1308012240,
            "id":1125342,
            "title":"make your own"
        },
        "1211":{
            "author_id":"twinsrock",
            "author_name":"Squeaky",
            "choices":[
                "continue on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Poison a good way to go</span></div></span></div>",
            "created":1308269700,
            "id":1127626,
            "title":"Your turn"
        },
        "12111":{
            "author_id":"twinsrock",
            "author_name":"Squeaky",
            "choices":[
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you could always make them explode </span></div></span></div>",
            "created":1314837060,
            "id":1178688,
            "title":"continue on"
        },
        "121111":{
            "author_id":"desuguy",
            "author_name":"DesuGuy",
            "choices":[
                "Make your own",
                "Make your own"
            ],
            "content":"<div class=\"\"><div> <span>She shivered, locked in the small, damp room. It was cramped, and she was claustrophobic. There was no air, no food and no water... How could she survive in those conditions? She couldn't. Simple. She would have to sit in there, suffocating, dehydrating or starving to death. Whichever came first. The idea of being in such a small room - where she had to crouch to fit - was frightening on its own, perhaps more than knowing what it could cause.<br>\r\n<br>\r\n(This isn't from one of my pieces. It belongs to a friend, and is in a fanfic.)</span></div></div>",
            "created":1322330280,
            "id":1229623,
            "title":"Dying"
        },
        "1211111":{
            "author_id":"twinsrock",
            "author_name":"Squeaky",
            "choices":[
                "kill someone else",
                "we can kill everyone"
            ],
            "content":"<div class=\"\"><div> <span>I stood at the top of a building looking down. I have a fear of falling but I shove it back. I won't be the one falling tonight.  She approached me from behind. \"What did you want?\"<br>\r\n\"Come and see it is amazing.\" At first I don't think she will come over, but then she stands beside me.<br>\r\n\"What?\"<br>\r\nI point down and she looks. \"I don't see anything but cars and people.\"<br>\r\n\"You know what is amazing?\" I ask.<br>\r\n\"No, why are we up here?\"<br>\r\n\"No one thinks to look up as they walk down the street.\"<br>\r\n\"Why would they?\"<br>\r\nI shoved her over the edge. It was kind of  funny she made one of those awkward faces of shock and horror. \"So people like you won't land on them.\" I smiled, this was turning out to be a good night after all.</span></div></div>",
            "created":1326992460,
            "id":1261708,
            "title":"Make your own"
        },
        "12111111":{
            "author_id":"dnadream",
            "author_name":"DnaDream",
            "choices":[
                "and if that doesn't work...."
            ],
            "content":"<div class=\"\"><div> <span>Depending on your reason, you could kill them different ways.  Slow and torturous or quick  and deadly?<br>\r\n<br>\r\nAn alternative way would be to create a do it yourself type situation.  This could be addiction to something. It could be anything, even food, although watching them plump up could get boring after a while I would think. You'd really have to love your work.<br>\r\n<br>\r\nAt least, the blame ends up being on them rather than the one who encouraged them. <br>\r\n<br>\r\nUhoh, I better shut up now. I don't want the FBI investigating me and my IP address. OOPS.<br>\r\n<br>\r\n</span></div></div>",
            "created":1337071260,
            "id":1337639,
            "title":"kill someone else"
        },
        "121111111":{
            "author_id":"twinsrock",
            "author_name":"Squeaky",
            "choices":[
                "what would you do?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You could always blame your twin..... if you have one.</span></div></span></div>",
            "created":1337092980,
            "id":1337765,
            "title":"and if that doesn't work...."
        },
        "1211111111":{
            "author_id":"dnadream",
            "author_name":"DnaDream",
            "choices":[
                "Forget that, I have a better idea",
                "and not just that. this is how the plan will go down..."
            ],
            "content":"<div class=\"\"><div> <span>First, the character would have to learn all her mannerisms, addictions, likes, dislikes, at least enough to fool almost anyone including her twin's  boyfriend or girlfriend. Unless the twin is the opposite sex then I guess  her or she would have to groom him or herself to be that person.  What would be really good is if for some reason one of   the twin characters didn't know he or she had a twin.<br>\r\n<br>\r\nJust think of all the havoc that could be caused.  Then of course you have to worry about trace evidence, fingerprints,  and such, since something pretty bad might happen. </span></div></div>",
            "created":1337136120,
            "id":1338305,
            "title":"what would you do?"
        },
        "12111111112":{
            "author_id":"twinsrock",
            "author_name":"Squeaky",
            "choices":[
                "You don't know you have a twin what happens",
                "you hate your twin she/he needs to go..."
            ],
            "content":"<div class=\"\"><div> <span>there are a few ways to go about it really. First thing would be to decide whether or not the twins are working together or not. <br>\r\nIf they are you just need to be sneaky and have them kill someone and both say it was my twin I would never to that. Good luck proving who is lying all you have to do is be careful of finger prints. Wear a hood and some gloves... could work. Go to the movies one leaves to go kill someone while the other stays behind.<br>\r\nOr you could have one twin who is jealous of the other and wants to be her or him and replace them. creepy stalker I want to be you.<br>\r\n</span></div></div>",
            "created":1340127180,
            "id":1362945,
            "title":"and not just that. this is how the plan will go..."
        }
    },
    "info":{
        "author_id":"twinsrock",
        "author_name":"Squeaky",
        "brief_description":"Lets see how many ways we can find to kill our characters",
        "created":1307918340,
        "description":"<td align=\"left\" class=\"norm\">Want to find new ways to kill off your character? or just add your own?<br>\r\nPlease be warned I will allow anyone to use ideas I write down in this area if you don't want to share please say so in your post.<br>\r\nThis is just for fun and to help other writers. <br>\r\nif you want to let someone continue with your idea check the first box and put continue on.<br>\r\nDon't worry about spelling it's just for fun</td>",
        "id":1784650,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1423947660,
        "modified":1423947660,
        "pretty_title":"Different ways to kill someone"
    }
}