{
    "chapters":{
        "1":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Sarah the mother.",
                "David the father.",
                "Mary the older sister.",
                "Jason the middle brother.",
                "Tara the youngest sister."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of the Mitchell's gain the ability to make people believe what they suggest or state about the person to be true to always have been.</span></div></span></div>",
            "created":1310800560,
            "id":1148702,
            "title":"Which of the Mitchell's gets the ability"
        },
        "12":{
            "author_id":"struiner",
            "author_name":"Struiner",
            "choices":[
                "Sarah",
                "Mary",
                "Jason",
                "Tara",
                "Monica"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does he encounter? To find out, about his powers. Which are totally bordering the psychic!</span></div></span></div>",
            "created":1572833580,
            "id":2741987,
            "title":"David the father."
        },
        "121":{
            "author_id":"struiner",
            "author_name":"Struiner",
            "choices":[
                "\"Sperm is the most nutritious breakfast\"",
                "\"It's a good workout\"",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Dave woke up one morning, not feeling much different. For a moment he panicked at the sight of sunlight hitting the sheets, but then he remembered it was a Sunday. <br>\r\n<br>\r\nHis wife, Sarah, was still sleeping next to him. He cuddled up to her, but she just kept snoring. Her thigh pressing against his morning wood, he was starting to feel frisky. It wasn't long before she was awake.<br>\r\n<br>\r\n\"Good morning.\" She yawned, smacking her lips before she continued. \"You're horny again, aren't you. Wait until tonight.\" She turned away from him. He slid closer.<br>\r\n<br>\r\n\"Aww. But honey...\" he tried, but faltered.<br>\r\n\"You love my cock inside you, right?\" He tried again.<br>\r\n<br>\r\n\"Yeees. Tonight.\" She grunted.<br>\r\n<br>\r\n\"But I'm hard now.\" He hissed, trying to sound seductive. \"It makes no difference whether we do it now or tonight.\"<br>\r\n<br>\r\n\"I... that's true...\" She hesitated, unable to contradict despite the fact she was certain a moment ago there were several things that made a difference. Somehow they didn't matter anymore. She didn't really care about being fresh and clean for sex anymore. It was dirty anyway. Neither did she mind his usually smelly morning breath, not to mention the smell that was coming from his crotch. Not even the creeping feeling that everybody she'd meet that day would know she had sex. Like they could smell it, or something. It was all fine, let them think whatever.<br>\r\n<br>\r\nFeeling her resolve fade away, he crept closer against her, maneuvering his dick against the split between her butt-cheeks. He was thinking up more reasons, hoping she'd buckle. What did he say?</span></div></div>",
            "created":1572834180,
            "id":2741990,
            "title":"Sarah"
        },
        "1211":{
            "author_id":"struiner",
            "author_name":"Struiner",
            "choices":[
                "Bathroom",
                "Breakfast",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"You know, sperm is actually the most nutritious breakfast.\" He murmured into her hair.<br>\r\n<br>\r\n\"Really?\" She kept her eyes closed. \"I never knew...\"<br>\r\n<br>\r\n\"Oh yeah. Good for concentration.\" he continued.<br>\r\n<br>\r\n\"Yours or mine?\"<br>\r\n<br>\r\n\"Both, I guess.\" He chuckled. \"So? Whaddaya say...\"<br>\r\n<br>\r\n\"Oh fine, I'll do it if it shuts you up...\" She finally replied, after a long and tedious sigh. Untypical of her, but Dave was far too deep into the horny valley to notice. She seemed more easy going, a bit trampy, even. <br>\r\n<br>\r\nShe sat up, her nightgown hanging loosely from her shoulders. Pushing back the blankets without much ceremony. Se crouched down, her head inches from his erect dick. She prepped it up with two fingers, staring at it for a moment. Then she shrugged, moved down, and wrapped her lips around it. <br>\r\n<br>\r\n\"Oh god YES!\" Dave exclaimed as the warmth engulfed his member. \"Ooh you're such a dirty slut, sucking my dick like that.\" He moaned. As he spoke, her movements became more fluent, really getting into it. \"Ooh yeah. You like that, don't you. You like the taste of dick in your mouth. My little cum-dumpster slut, craving cum like it's coffee.\" She just kept bobbing, moaning more and more as he spoke.<br>\r\n<br>\r\nWhen he came, she didn't immediately stop. Instead she swallowed, proceeding to clean his shaft thoroughly until there was no speck of sperm left. Then she snuggled against him, one hand on his crotch, the other on his shoulder.<br>\r\n<br>\r\n\"That was good.\" She purred. \"I don't mind having breakfast like that more often...\"<br>\r\n<br>\r\n\"Every day?\" He tried.<br>\r\n<br>\r\n\"Sure, whatever.\" She giggled. \"I'm your cum-dumpster slut, remember. I'll suck you off anytime.\" <br>\r\n<br>\r\nShe leaned in for a kiss. He quickly turned away, overtaken by the unwashed-cock smell coming from her mouth. She just pecked him on the cheek instead, grinning lazily. <br>\r\n<br>\r\nWhat's next?</span></div></div>",
            "created":1574715120,
            "id":2751660,
            "title":"nutritious breakfast"
        },
        "12112":{
            "author_id":"struiner",
            "author_name":"Struiner",
            "choices":[
                "State something about Tara",
                "State something about Jason",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Sarah went into the bathroom, freshening up. Dave was starting to feel peckish, so he got dressed and went down to the kitchen for something to eat. Pouring himself a bowl of cereal, he went to the TV. The kids had put the news on, but neither Jason nor Tara was really watching. Both too engrossed by their phones at the moment. He wished them a good morning, sat down lacking any reply and switched to something about motor-sports. Contentedly munching away at his cornflakes while watching cars go brrrt, this was a very good Sunday so far.<br>\r\n<br>\r\nWhen Sarah came down a little while later he nearly spilled his milk. Wearing nothing but some daisy dukes and a tank top that seemed made to spill, it was pretty obvious she wasn't going to church. Not that they did that anymore, not since they moved here. Even so, she had always kept her Sunday dresses for Sundays. Usually wearing proper, not exactly formal but plenty motherly clothing like sweaters, slacks and the occasional pair of jeans, she wasn't exactly the one to show off her curves. <br>\r\n<br>\r\nBut now. Bare legged, no underwear, generous cleavage and heavily perfumed. She strutted her junk across the living room, not even giving either Jason or Tara a glance. She stopped in front of Dave, winking at him before settling in front of his chair, snugly between his legs. <br>\r\n<br>\r\n\"Oh my god. How is that even comfortable?\" Tara shot out in annoyance at the display of intimacy. \"Didn't you get enough of that just now?\" Then softer. \"Don't think we didn't hear you, dad.\"<br>\r\n<br>\r\n\"Don't be silly, pumpkin.\" Sarah replied without missing a beat. \"I'm your daddy's cum dumpster slut. Of course I'm comfortable between his legs.\"<br>\r\n<br>\r\n\"I- You- What?\" Tara was befuddled. Jason looked up from his phone with a frown. \"Cum dumpster? Dad?\"<br>\r\n<br>\r\n\"I, er... that is- Yeah.\" Dave, red from ear to ear from what his daughter said, wasn't really prepared for Sarah's reply. So he went with it anyway. \"Yeah you heard her... She's my little cum dumpster slut. So?\"<br>\r\n<br>\r\n\"Oh. Ok.\" Satisfied with the answer, both Tara and Jason went back to their phones as if nothing was out the ordinary. Then, Tara added as an afterthought \"Just keep it to the bedroom, please?\"<br>\r\n<br>\r\nDave's mind was racing. Looking from Sarah, who was snuggling closer to his crotch with each snuggle, to his kids, who had just taken his word for granted. This was getting absurd. He had to try something.</span></div></div>",
            "created":1574721000,
            "id":2751699,
            "title":"Breakfast"
        },
        "121123":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Told his kids sperm was nutritious",
                "Told Sarah it’s only nutritious for wives, and told his children it was a joke",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>While Tara and Jason were on their phones, Sarah sucked Dave off again, but instead of swallowing this time, she collected his cum in a cup, and put it in two bowls of cereal, placing them in front of her children. “Eat up!”<br>\r\n<br>\r\n“Ew! Mom, what the hell?!” Tara gagged, pushing the bowl away. “That’s disgusting!”<br>\r\n<br>\r\n“But sperm is the most nutritious breakfast, so you will eat it, and you will like it.” Sarah ordered.<br>\r\n<br>\r\nDave, meanwhile, was flabbergasted by this, as his kids became slackjawed. To ease the situation, he...</span></div></div>",
            "created":1574949000,
            "id":2752987,
            "title":"Something else"
        },
        "1211232":{
            "author_id":"struiner",
            "author_name":"Struiner",
            "choices":[
                "Setting Sarah straight",
                "Say more stuff",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh hahaha. Honey...\" Dave quickly grabbed both bowls, handing them back to Sarah. \"That's not for the kids. Just women who are... unrelated.\" He stumbled.<br>\r\n<br>\r\n\"Oh. I see\" She took the bowls to the kitchen, completely embarrassed. He turned to the slackjawed pair sitting at the table.<br>\r\n<br>\r\n\"It was just a joke. You know how gullible your mom is...\" Holding up his hands in pardon.<br>\r\n<br>\r\n\"Ha ha.\" Tara huffed dryly. Jason still looking horrified at the thought of sperm for breakfast.<br>\r\n<br>\r\nAs soon as the kids were back to their phones, Dave went after his wife to stop her from doing more crazy shit like that. He found her leaning against the kitchen counter. She had poured both bowls into a larger dish. Holding it against her belly, she couldn't help spilling some of the gooey white stuff on her chest as she ladled it up.<br>\r\n<br>\r\n\"What?\" She said. \"I can't let it go to waste, can I? \"<br>\r\n<br>\r\n\"Don't worry, there's more where that came from.\" Dave heard himself say as she continued slobbering up the stuff. \"So... got anything planned for today?\"<br>\r\n<br>\r\n\"I was thinking on asking Beverly to meet up, but honestly I'm down for whatever you want.\" She let out a small belch, giggling at herself.<br>\r\n<br>\r\n\"Hey Mom. I've done my homework, cleaned my room and did all chores. Can I go out?\" Jason Rushed <br>\r\n<br>\r\n\"Already? Sure.\" She smiled blankly. <br>\r\n<br>\r\n\"Oh. And can I have 50 bucks for... supplies?\" He continued, eyeing dad guiltily.<br>\r\n<br>\r\n\"Sure. Wallet's in my coat. Take whatever you need, have fun!\" She waved him out the door. <br>\r\n<br>\r\nDave had no trouble believing it as it all played out in front of him. She had become the epicenter of gullible. Sooo, did he fix things or make them much, much worse?<br>\r\n<br>\r\n</span></div></div>",
            "created":1585522800,
            "id":2809839,
            "title":"Laugh it off"
        },
        "13":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "teacher",
                " friend",
                "boyfriend ",
                "rival",
                "readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> On her way to school she soon discovers this ability when she runs into.</span></div></span></div>",
            "created":1310841060,
            "id":1148869,
            "title":"Mary the older sister."
        },
        "135":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "\"Your new master\"",
                "Nothing He takes off his cloak and flashes her.",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Who are you?\" She asked the strange man in a cloak.</span></div></span></div>",
            "created":1474489500,
            "id":2212912,
            "title":"readers choice"
        },
        "14":{
            "choices":[
                "After a snarky comment to his elder sister?",
                "Mouthing off to his mother",
                "Joking with his father",
                "taunting his little sister",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does he find out?</span></div></span></div>",
            "created":1491956520,
            "id":2303580,
            "title":"Jason the middle brother."
        },
        "141":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "She is a lesbian",
                "She is in love with him(oops)",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does he make her believe?</span></div></span></div>",
            "created":1495950780,
            "id":2326440,
            "title":"After a snarky comment to his elder sister?"
        },
        "15":{
            "choices":[
                "Open",
                "Open",
                "Open",
                "Open",
                "Open"
            ],
            "content":"<div class=\"\"><div> <span>Tara the youngest sister is only ten year old but the biggest pain in your side, you walk up to her room and start talking to her and find that she is easily controlled because she is still so very young.<br>\r\n<br>\r\nHappy with yourself you decide to make her a sexy little vixen, you make her believe that she is completely sexually in lust for your mothers body and will do anything to seduce her and to get your mother to want her the same way.<br>\r\n<br>\r\nWhat does Tara do first ..........</span></div></div>",
            "created":1483193040,
            "id":2257050,
            "title":"Tara the youngest sister."
        },
        "154":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "A Family Member",
                "A Friend",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does she go to first?</span></div></span></div>",
            "created":1564782000,
            "id":2696129,
            "title":"Open"
        },
        "155":{
            "author_id":"kasskid2",
            "author_name":"kasskid",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>That is the end of the story</span></div></span></div>",
            "created":1537206060,
            "id":2548953,
            "title":"The end"
        }
    },
    "info":{
        "author_id":"allen7811",
        "author_name":"no one",
        "brief_description":" you gain the ability tell people anything about them and they'd believe it to be true.",
        "created":1310799960,
        "description":"<td align=\"left\" class=\"norm\">       You wake up one morning to discover that you have the ability to suggest or state to someone anything about themselves or others and they would believe it to have been always true.<br>\r\n<br>\r\ncast:<br>\r\nSarah Mitchell-  38 yr. old stay at home mom and house wife.  <br>\r\nDavid Mitchell- 40 yr. old office manager, father, loving husband.  <br>\r\nMary Mitchell- 18yr.  daughter oldest child part of the popular crowd at school likes to tease her younger siblings.  <br>\r\nJason Mitchell- 17 yr. son not popular but well like by most.<br>\r\nTara Mitchell- 15yr. youngest daughter super smart, pretty like Mary but doesn't get along with her, friends with her brother.<br>\r\n<br>\r\nFeel free to add characters i.e. friends, family, enemies, ect.. . <br>\r\nRules: <br>\r\n  No killing.<br>\r\n  Other than that have fun. please add.  </td>",
        "id":1793802,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1585522800,
        "modified":1585522800,
        "pretty_title":"Truth be told."
    }
}