{
    "chapters":{
        "1":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Find something to do together.",
                "Find someone to mess with.",
                "Something suddenly happens.",
                "Explore the castle.",
                "Go somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>It has been a week since Overlord Laharl had run off to take over a new world. While the trio had since reunited since Laharl and Etna's falling out, Etna and Flonne were left out of Laharl's latest conquest, mainly because they didn't want to go and Laharl wanted to get on his way as soon as he could.<br>\r\n<br>\r\n\"Geez, you'd think that punk would show up on the news at least once since he left.\" says the loosely-clad Etna as she uses a penguin-esque creature known as a Prinny as a chair as opposed to sitting on the floor like Flonne is.<br>\r\n<br>\r\nFlonne shakes her head. \"Well, what he had planned did sound pretty boring, so he could be doing a lot of stuff but they aren't talking about it because it's so boring.\" reasons Flonne, as ditzy as ever.<br>\r\n<br>\r\nEtna turns off the TV and turns to Flonne. \"Well, it's like that here too. I say we find a way to amuse ourselves.\" Etna says. \"We have the whole castle to ourselves and we don't have Laharl around to tell us to do anything.\"<br>\r\n<br>\r\n\"Yeah, we really should. All we've pretty much done all week is sit around.\" Says Flonne, as they begin to think about what all they could do.</span></div></div>",
            "created":1186981200,
            "id":435542,
            "title":"Chapter 1: Idle Hands, Devil's Playthings, Etc."
        },
        "11":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Movie night, and day, and night, and day...",
                "Off to a wild underworld carnival/amusement park.",
                "See what the local town has to offer.",
                "Etna hits on Flonne",
                "Flonne hits on Etna?"
            ],
            "content":"<div class=\"\"><div> <span>Flonne giggles and puts an arm around Etna. \"You know, with Laharl away and all, we could really spend this time to just do stuff together and get to know each other. We don't usually get to since Laharl made us do stuff a lot.\"<br>\r\n<br>\r\nEtna nods. \"Ooooh, good idea, Flonne. We could raid Laharl's funds and do something really awesome together.\" suggests Etna.</span></div></div>",
            "created":1186981200,
            "id":435563,
            "title":"Etna and Flonne's Quality Time."
        },
        "111":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "They fall asleep during the night. Mildly fat at 200 lbs. each.",
                "They spend all day watching and eating. 500 lbs. each.",
                "They last until they're out of stuff. One ton each. (2000 lbs.)"
            ],
            "content":"<div class=\"\"><div> <span>Flonne giggles. \"Maybe we could sit around and watch a whole bunch of movies with all the free time we have? Like a big marathon run of them. How does that sound?\"<br>\r\n<br>\r\n\"I don't know, Flonne. I was hoping we could do something that we aren't normally able to do.\" replies Etna.<br>\r\n<br>\r\n\"Well, when was the last time we had the TV to ourselves? Laharl's usually watching it most of the time.\" reasons Flonne, as she goes off to make preparations before Etna even agrees. Etna just shrugs and helps her out.<br>\r\n<br>\r\n-----------------------<br>\r\n<br>\r\nThe girls don't take a whole lot of time to get everything set up for their movie time. In only a few hours they've managed to gather enough movies and snacks to last them quite a while. \"There, that should be enough to last us all night.\" says Flonne as she finishes looking everything over.<br>\r\n<br>\r\n\"Are you sure this is only for this night, or did you prepare for a large group of people you didn't tell me about?\" asks Etna while directing a few prinnies to set down the last few stacks of movies.<br>\r\n<br>\r\n\"Nope, just the two of us!\" exclaims Flonne. \"I figured we could spend all our nights doing this!\"<br>\r\n<br>\r\nEtna shrugs. \"Well at least you're dedicated to this.\" She says as she flops down on the couch they set up in front of the TV while Flonne gets the first movie ready. Flonne grins as she sits down right next to Etna. \"Alright, let the movie party begin!\" Flonne exclaims as the movie starts up.<br>\r\n<br>\r\n----------------------------<br>\r\n<br>\r\nTime passes...</span></div></div>",
            "created":1195362000,
            "id":466905,
            "title":"Idle-time Marathon"
        },
        "1111":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "The source was Flonne, and did it intentionally and on Etna.",
                "The source was Flonne, and she did it in her sleep.",
                "The source was Etna, who snaps awake because of it."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Etna turns on the couch a little, having fallen asleep during the night. As she gets comfortable again, she is suddenly woken up by the sound of a rather loud fart.</span></div></span></div>",
            "created":1195621200,
            "id":466906,
            "title":"A Very Rude Awakening."
        },
        "11111":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Burp vs. Fart.",
                "Big Fart vs. Small Fart"
            ],
            "content":"<div class=\"\"><div> <span>Etna's eyes snap open to see Flonne's rear end facing her. She waves her hand in front of her a bit as she quickly realizes what just happen. \"H-hey, what was that for!?\" shouts Etna, weirded out in more ways than one.<br>\r\n<br>\r\n\"Just playing around with it, Etna. I wanted to see if it would work as a good wakeup call, really.\" Flonne says with a grin on her face as she turns toward Etna.<br>\r\n<br>\r\nEtna grumbles a bit \"It's good if you like waking up to something really smelly. Why don't you save it for when someone needs a replacement for smelling salts?\" Etna says, before her curiosity gets the better of her. \"Wait, 'playing around with it'?\" she asks.<br>\r\n<br>\r\nFlonne points to her gut, which looks a little bloated. \"Hehe, something must have happened to me to cause me to produce lots of gas and be able to release it at will. It all gets stored in my belly, which is bloated quite a bit from my gassyness.\" Flonne explains, before poking Etna in her slightly more bloated stomach. A <b>*FRRRRRT!*</b> sound comes from under Etna as she farts just like Flonne did.<br>\r\n<br>\r\n\"Whoa!\" yelps Etna as she holds her bloated belly in her hands, which she can feel is slowly expanding. \"Hum...you know, this could be interesting to play around with.\"<br>\r\n<br>\r\nFlonne nods. \"Hehe, I figured it wouldn't take me much to get you to think like that.\" she says. \"So what do you want to try first?\"<br>\r\n<br>\r\n\"Well, there's probably two ways to let it out, so-\" Etna says, as she's suddenly interrupted by Flonne. \"You mean burping vs. farting?\" asks Flonne. \"Well, I kind of want to try to see what the difference would be in suddenly letting all our gas out in one big fart or gradually letting it all out. But your idea is good too.\"<br>\r\n<br>\r\nEtna scratches her head. \"Hrum, took the words right out of my mouth...\" she says, as they consider which they should do.</span></div></div>",
            "created":1195621200,
            "id":466909,
            "title":"Flonne Face Farts"
        },
        "111112":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Flonne zips around the room and soon gains control.",
                "Flonne shoots up and out of the castle."
            ],
            "content":"<div class=\"\"><div> <span>The girls eventually agree on seeing what happens between a long fart and a quick, massive fart. \"Alright, I think I'll try a long fart and you can try the quick fart, Flonne\" Etna recommends, to which Flonne eagerly agrees. Soon, the girls are set up, and on a count of three they begin. Etna starts first as Flonne gets ready to push out all of the gas at once. As soon as she does, she shoots up into the air. Etna suddenly stops as she watches Flonne zip into the air...</span></div></div>",
            "created":1195621200,
            "id":466910,
            "title":"An Interuption."
        },
        "1111121":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Their gassyness isn't smelly to themselves.",
                "Flonne secretly enjoys smelly things."
            ],
            "content":"<div class=\"\"><div> <span>For a moment, Flonne shoots around like an out of control balloon but she managed to gain control and use it to effectively zip through the air. Once she's confident in her abilities she loops around Etna a few times to make sure she's enveloped in her 'exhaust'. Etna coughs, still not used to being in the middle of the gassy fallen angel's fart clouds.<br>\r\n<br>\r\nFlonne tries to land gracefully in front of her, but instead she misses and ends up flying head-first into the ground. <b>*FFFRRRTTT!*</b> she goes as she is flattened into coin from slamming head-first into the ground, her rear end facing upward, which causes Etna to be in the middle of an even more concentrated smelly cloud. Flonne quickly reinflates back to her 'normal' slightly plump form while Etna starts to feel slightly dizzy from taking in so much smellyness at once.<br>\r\n<br>\r\n\"Erk...you'd think I'd be able to handle this better than you...\" Etna says, as she tries to wave the smell away. \"What's your secret, Flonne?\"<br>\r\n<br>\r\nFlonne sweatdrops. \"Well, you see...\"</span></div></div>",
            "created":1195621200,
            "id":466912,
            "title":"Fart-propelled Flonne"
        },
        "11111212":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Of course!",
                "She has a better idea!"
            ],
            "content":"<div class=\"\"><div> <span>Flonne tries to find the words to express what she wants to say. \"...I...actually...really like smellyness. I was...kinda hoping you'd grow into it a bit more before I revealed that. It's...kinda embarrassing, being a girl who can enjoy the smell of things that don't smell to good.\" Explains Flonne.<br>\r\n<br>\r\nEtna blinks, not expecting that at all out of Flonne, who didn't seem to have much of a tomboy in her. \"But...I'm guessing it smells good to you, right?\" Etna says, trying to rationalize Flonne's interest.<br>\r\n<br>\r\nFlonne shakes her head. \"That's why it's so embarrassing...it's as smelly to me as it is to you...probably even more so since I'm not usually around smelly things that much.\"<br>\r\n<br>\r\n\"So...that means you keep farting on me...why, exactly?\" asks Etna, finding herself herself very curious about Flonne's situation.<br>\r\n<br>\r\nFlonne giggles a little. \"Two reasons, one so I could get you used to what I like...and another so...I can make you nice and smelly too...\"<br>\r\n<br>\r\nBy now it has sunk into Etna's head that Flonne really likes the smell of things that smell bad. \"If that's the case, I suppose I'm flattered to directly in the middle of your farts, then...I guess.\" Etna says, as she sniffs herself a bit and realizes that she is starting to get fairly smelly, and also notes that her nose is getting used to it.<br>\r\n<br>\r\n\"So, I guess you'll be farting on me until I'm completely into it and stinky enough, right?\" asks Etna.</span></div></div>",
            "created":1195621200,
            "id":466913,
            "title":"Smelly Secret."
        },
        "111112122":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Straight from her rear.",
                "Through a hose."
            ],
            "content":"<div class=\"\"><div> <span>\"Actually, I think I have a better idea...namely, making you swell up with my farting. It won't make you that much smellier on the outside than the inside, but it'll do what I care more about, namely, getting you to like smellyness as much as I do!\" Flonne says.<br>\r\n<br>\r\nEtna raises an eyebrow, not so much concerned about swelling up since that seems to be what's happening to her belly naturally, but rather having to directly take in Flonne's farts. \"And you'll be doing this how?\" Etna asks, curious as to how this will work out.  </span></div></div>",
            "created":1195621200,
            "id":466914,
            "title":"Fart-filling with Flonne."
        },
        "1111121221":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Stay big and fill up Flonne as well.",
                "Make Flonne big and Etna normal-sized."
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I didn't bring a hose since I didn't expect to get this far, so...I'm just going to have to sit on your face and fill you up that way...you don't mind, right?\" asks Flonne.<br>\r\n<br>\r\nEtna shrugs. \"Meh, I already smell like your butt, so you might as well have it shoved in my face, then.\" Etna says, as she lays down on the ground. \"But I'll be doing the same to you later, understood?\" Flonne just nods, more than glad to be subjected to a fart-filling of her own. Etna nods back. \"Well, I'm ready, fill away, then.\"<br>\r\n<br>\r\nFlonne giggles and goes over to Etna. She gently sits down so that her butt is right over Etna's mouth. <b>*FRRRRRRRRRR*</b> goes Flonne as Etna's cheeks and eyes widen. Her mouth is forced open a bit as Flonne's gas flow goes right into Etna. The smell instantly fills her nose as she starts to swell up. <i>\"Gurk, too smelly! W-why'd I agree to this!?\"</i> Etna thinks.<br>\r\n<br>\r\nAs her body starts to grow round, Flonne starts to roll Etna over so that she's upright. Etna finds that she's involuntarily farting from being filled with so much gas. However, her mind is too attached to the actual act of Flonne farting into her. By the time Etna reaches 5 feet wide, she finds herself starting to share Flonne's mindset as she finds herself slowly enjoying the smell more as Flonne keeps going.<br>\r\n<br>\r\n\"Mmm...so nice and smelly...\" Etna eventually utters, which prompts Flonne to stop as Etna reaches 10 feet wide.<br>\r\n<br>\r\nFlonne grins. \"Hehe, sounds like that's enough, then.\" she says, as she sniffs Etna a bit. \"Mmm! I underestimated how smelly this would make you!\" Flonne says, as she rubs Etna.<br>\r\n<br>\r\nEtna smirks. \"Well I have been helping you out along the way. You weren't the only one farting like mad, you know.\" says Etna, actually quite proud of her smellyness.<br>\r\n<br>\r\n\"Oh yeah, you sure did!\" Flonne says. \"So...what are you ready for now?\" Flonne asks as she strokes Etna's surface.</span></div></div>",
            "created":1195621200,
            "id":466929,
            "title":"In Her Face."
        },
        "1112":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "They sleep without interruption, and awake to the next day",
                "Laharl comes in and finds them",
                "They suddenly feel hungry again"
            ],
            "content":"<div class=\"\"><div> <span>A good number of hours later...<br>\r\n<br>\r\nSince they had started their marathon, Etna and Flonne had done nothing but watch their movies and stuff themselves with junk food. They were practically glued to the couch the entire time. All of their over-indulging and laziness had taken its toll on their bodies. <br>\r\n<br>\r\n\"Oh...well, that's the last one...\" Etna said, mildly disappointed, as the credits scrolled upwards over the scene of the final movie. She threw the now-empty bag of potato chips she had lying on her chest carelessly over her shoulder. The floor itself was riddled with crumbs, empty bags and wrappers, and even a few soda stains.<br>\r\n<br>\r\n\"Aww, oh well. It was fun while it lasted.\" pouted Flonne. <br>\r\n<br>\r\n\"I'm kinda tired...I guess we should get some rest now?\"<br>\r\n<br>\r\n\"That sounds good!\"<br>\r\n<br>\r\nEtna reached down beside her to pick up the remote and turn off the television, but to her surprise it wasn't there. \"Huh? Hey, Flonne have you seen the remote?\"<br>\r\n<br>\r\n\"You had it with you, right?\"<br>\r\n<br>\r\n\"Yeah, I'm pretty sure I-\" Suddenly, Etna recalled the remote's new location. After eating so much, the devil girl and the fallen angel had become incredibly obese, at least 500 pounds for each of them. For some reason, they did not seem very bothered by it. <br>\r\n<br>\r\nEtna herself had grown mainly in the abdominal region. Her flat, washboard stomach had swollen and fattened into three flabby rolls that rested heavily upon her chubby thighs. Each roll was slightly pale in coloration, and riddled with stretch-marks and some cellulite. The demon was no longer flat-chested, although her D-cup breasts were still not very impressive (in her opinion). Her butt was very big too, about five times as big as originally. It actually felt a little good to Etna to be so gigantic.<br>\r\n<br>\r\nWith fingers that resembled plump sausages, Etna dug deep in between her top and middle roll, eventually pulling out the remote. Etna grinned, her chubby red cheeks and double-chin giving her an almost comical look. Etna pressed the power button, and the television shut off. Belching in satisfaction, Etna leaned back and closed her eyes to rest.<br>\r\n<br>\r\nFlonne couldn't help but smile at how adorable her friend looked, so round and chubby and peaceful. Like Etna, Flonne had also gotten extremely fat. In contrast to Etna, who was a belly girl, Flonne's ingested calories had taken up residence generally below the waist, in her thighs and butt. Her chest was only C-cup, and her flabby 'little' belly was just in the makings of a second roll. Her legs, however, flared out nearly four feet across both vertically and horizontally. Her hips were as thick as tree-trunks, but as soft and jiggly as jello. Her ass was like a pair of beach-balls had been attached to her behind, It had sunken so deeply into the pillows of the couch that it would probably leave a permanent imprint of her gigantic ass for all to see. Flonne was happy that she was so soft all over; it reflected her kind, caring personality well.<br>\r\n<br>\r\nSoon, after finishing off a tiny bag of luke-warm mini-donuts she found crushed underneath her ass, Flonne drifted off to sleep as well.</span></div></div>",
            "created":1290355920,
            "id":998220,
            "title":"They spend all day watching and eating."
        },
        "1113":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Etna can move about as well.",
                "Etna is immobile."
            ],
            "content":"<div class=\"\"><div> <span>A few days pass as the girls focus on the marathon. Each of them weighs around one ton, appearing to be at least times as tall as they were once wide and slightly more wide than that. Their cheeks are puffed out to around half the size their heads are normally were. Their legs looked like they had become part of their wide bodies, with their feet poking out of the end of them. While they didn't get big and fat without noticing it, they didn't let it bother them and payed more attention to stuffing themselves and watching the movies. At last, the final movie finishes and Etna manages to shut off the TV with the remote, which is laying down in front of her face.<br>\r\n<br>\r\n\"Hehe...see, wasn't that fun, Etna?\" Flonne says as she pats extremely bloated body, which causes her to jiggle a bit.<br>\r\n<br>\r\nEtna shrugs. \"I don't know...we can't really move around like this. At least I think we can't...\"<br>\r\n<br>\r\nFlonne giggles. \"I bet we can.\" She says, as she makes an effort to get onto her feet. Despite the seemingly useless appearance of her legs, Flonne is soon using them the walk about. \"See, if I can do it, you can do it!\" says the fallen angel, not remembering at the moment that Etna normally isn't as tall as she is.</span></div></div>",
            "created":1195362000,
            "id":465928,
            "title":"Are extremely fat demons mobile?"
        },
        "11131":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "Their bellies rumble ",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Grunting loudly, Etna grasped tightly onto the arm of the couch, and began utilizing every muscle she had left in her flabby body to lift herself up to a stand. The demon girl's face became bright-red as she struggled; she never imagined simply standing up could be so difficult. Flonne watched from the sidelines as she silently cheered her friend on. <br>\r\n<br>\r\n\"Oooh...ugh...ooooo...\"<br>\r\n<br>\r\nEtna's rotund body was drenched in sweat, and she was breathing heavily. Waves of jiggling motions rippled across the surface of her body. She could feel her giant, cellulite-covered booty gradually become separated from the couch. Flonne's grin widened, excited. Finally, Etna leaned forward, and nearly fell face-first to the floor, but she caught herself just in time. She looked down at her body, and saw she was indeed standing. <br>\r\n<br>\r\n\"Wow...\" Carefully, she took one step, then another, and then another. She quickly became used to the slow waddle she now possessed. She was able to move as well.<br>\r\n<br>\r\n\"You did it, Etna!\"<br>\r\n<br>\r\n\"Y-Yeah...but now what do we do?\"</span></div></div>",
            "created":1290354480,
            "id":998203,
            "title":"Etna can move about as well."
        },
        "11132":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Put Etna on a diet.",
                "Make her even fatter."
            ],
            "content":"<div class=\"\"><div> <span>\"Hrumph, well maybe <b>you</b> can with your long legs and all, but my legs aren't nearly large enough to let me move around like that.\" retorts Etna, as Flonne walks over to her. She ends running into her, since Flonne isn't used to being 5 feet wide, which causes her to come to a stop as their bodies wobble due to the collision.<br>\r\n<br>\r\n\"So, I guess I'll just have to take care of you, then, since I can move around and all!\" says Flonne, as she considers either actually helping Etna move around better or if she should make Etna's 'problem' even bigger.</span></div></div>",
            "created":1195362000,
            "id":465931,
            "title":"At a Fallen Angel's Mercy."
        },
        "111322":{
            "author_id":"therealfake",
            "author_name":"Therealfake",
            "choices":[
                "Etna's pissed! She wants payback!",
                "Etna likes it too. Gluttony is one of the ways of Demons, after all."
            ],
            "content":"<div class=\"\"><div> <span>Flonne grinned in a manner more befitting of Etna than herself, her fattened tail moving from side to side as she looked at the corpulent, bloated demoness. Considering how often she had been at the receiving end of Etna's own mischief, what kept her from trying some of her own? Plus it wasn't as if anyone would honestly click the \"Help Etna get thin\" option for this story, so she prepared beforehand.<br>\r\n<br>\r\n\"Prinnes, execute phase FF (Furious Fattening)! Counterstrike!\" Flonne cried out.<br>\r\n<br>\r\nEtna was confused, but when she saw what the hell FF stood for, then she got worried.<br>\r\n<br>\r\nThe doors burst open and Prinnies rushed in, holding plate after plate of food, which was carelessly tossed and filled into Etna's mouth. The bloated Demoness could only sit back, unable to use her arms properly to stop the Prinnies and her mouth was too full of food to bark orders at them! She felt her already grand self begin to swell out, becoming more bulbous and larger as dish after dish was popped into her mouth, which she was forced to eat and swallow. 1000 Prinnes, 1000 dishes. Or so she thought.<br>\r\n<br>\r\nAt last, a group of Prinnies staggered in, holding a giant hot pot above them, carrying it on a huge wood platform over their small shoulders. Etna gasped at the sight of it, which may not have been the smartest thing as it only gave them an opening.<br>\r\n<br>\r\n\"Go Prinnies! Fill her until she can take no more!\" Flonne cheered.<br>\r\n<br>\r\n\"You got it. Master Etna, dood! This is for all those hours we spent working for you, earning one sardine less on average than your standard Prinny!\"<br>\r\n<br>\r\nThe Prinnes quickly poured soup in Etna's mouth before she could think to close it in time. The soup was so rich and thick and poured in so fast that Etna's mouth was forced open! Immediately, Etna's belly swelled with more fat, her breasts blowing up in front of her face as her corpulent butt, already jaw dropping in size, was pumped up and filled further and further, crushing the couch underneath her. Etna felt like a balloon being filled with food as she was forced to swallow and only gain more and more.<br>\r\n<br>\r\n\"<font class=\"size35\" style=\"\">BBBBUUUUUUUUURRRRRRRRRRRRPPPP!!!</font>\"<br>\r\n<br>\r\nOnce the last of the soup was poured, Etna unleashed a monstrous belch, signifying her new weight of 4,444 pounds. Etna's legs were thick, bloated masses and her feet were sucked inside, her arms standing out at the sides as puffy immovable masses of fat that couldn't be moved or bent at all. Etna moaned from fullness, wishing anyone would have the courtesy to rub her painfully full belly.<br>\r\n<br>\r\nFlonne poked a finger into Etna's belly button, forcing an uncomfortable belch out of her mouth.<br>\r\n<br>\r\n\"I think you look nice like this.\" Flonne giggled. She was teasing her, that much was obvious, but she was also telling the truth. There was a certain allure to getting her close friend all fattened up like this, feeding her copious amounts of food.<br>\r\n<br>\r\nEtna on the other hand...</span></div></div>",
            "created":1355256480,
            "id":1486134,
            "title":"A cheeky Fallen Angel"
        },
        "113":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "They really need a chance to unwind...",
                "Let's check out something else."
            ],
            "content":"<div class=\"\"><div> <span>The girls decide it would be best if they hit up the town to see what it had to offer. Not long into their trip, they find one place of interest: A spa, which seems to offer a great variety of packages.<br>\r\n<br>\r\n\"Heh, it's been a long time since I've tried a spa. They're always nice and relaxing.\" Etna says, as Flonne looks over the packages. \"There's a lot to do here, too!\" she says, pointing out the long list that ends with an \"Etc.\".<br>\r\n<br>\r\n\"So what are we waiting for?\" Etna asks.</span></div></div>",
            "created":1187067600,
            "id":435572,
            "title":"A spa, perhaps?"
        },
        "1131":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "To the Hot Tub!",
                "Not the hot tub!"
            ],
            "content":"<div class=\"\"><div> <span>As the girls enter, they fail to notice that they spa just happens to be next door to a bakery, though whether this is relevant is a matter of what they decide to do.<br>\r\n<br>\r\nThey're greeted by a Prinny. \"Good day, dood. What may I help you with, dood?\" He says, dood being the word that almost every Prinny end their sentences with.<br>\r\n<br>\r\n\"How about something simple?\" Flonne says to Etna. \"We could always try out some other packages later.\"<br>\r\n<br>\r\nIf each Prinny wasn't stuck with the same expression on their face, this one's face would have lit up with some kind of enthusiasm. \"Aah, yes, dood! Our hot tubs might be the least expensive on the menu, but they're the finest this part of the universe has to offer.\"<br>\r\n<br>\r\nThis raises a flag with Etna. \"Wait a minute, now that you know we're interested in the hot tubs, why are you so eager to sell us on them?\"<br>\r\n<br>\r\n\"I don't see a problem, he's just trying to be a good host.\" says Flonne.<br>\r\n<br>\r\nEtna whispers to Flonne. \"You should know better by now. Good host around here usually means ripoff, especially if they're extremely enthusiastic about something. We'll be lucky if we all that happens is us not getting our money's worth.\"<br>\r\n<br>\r\nFlonne whispers back. \"Don't be so worried. If worse comes to worse, we'll be able to handle it. It's a spa, you're supposed to forget about your troubles, not worry more about them.\"<br>\r\n<br>\r\nEtna murmurs to herself, wondering whether to follow her intuition or go along with Flonne.</span></div></div>",
            "created":1187067600,
            "id":435577,
            "title":"What should they go with?"
        },
        "11311":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "The girls stay liquid for a good long time.",
                "The girls end up solidified for some other purpose."
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, fine, we'll check out your hot tub.\" Etna says as she turns to the Prinny.<br>\r\n<br>\r\nThe Prinny nods. \"Excelent choice, this way, ladies, dood.\" the Prinny says, as it directs Etna and Flonne to the hot tubs.<br>\r\n<br>\r\nEtna notices right away that there doesn't seem to be anyone around as she takes off what little clothes she has puts on a towel that actually covers more of her body than her clothes did. \"Nobody is here Flonne, this has trap written all over it, and I prefer traps when I'm the one setting them up.\"<br>\r\n<br>\r\n\"And I'm sure they won't spring it until we've had a good while to relax, so just enjoy yourself until then.\" Flonne says, wearing a towel of her own. \"But I wonder why they ask us to take off our clothes...\"<br>\r\n<br>\r\nEtna laughs. \"So the people trapping us, don't have to, obviously. Etna says, unaware of how right she actually is.<br>\r\n<br>\r\nWith no one occupying the tubs, the girls don't have a hard time finding one. The girls are laying in one and are completely relaxed before they even realize it. \"Wow...I'll say that this has to be the best obvious trap ever...\" Etna says as she sinks into the tub a bit. \"Just you watch, any moment now, once they're sure we're totally relaxed, a whole bunch of guards will rush in here and try to kill us since we're the only ones who can really defend Laharl's Castle.\"<br>\r\n<br>\r\nFlonne sighs contentedly. \"I don't know...this might not be a trap...I'm sure they would have tried to do something by now...\" Flonne says, doing the same, already very relaxed.<br>\r\n<br>\r\nThe girls spend another 15 minutes in the tub with nothing really eventful occurring, though they haven't noticed that the water has been gradually heating up the whole time. Etna and Flonne are relaxed to the point where they're half-asleep, though Flonne seems to be nodding off every now and then. They're unaware of what effect this is having on their bodies until Etna tries to sit up, only to feel her body stretch a little.<br>\r\n<br>\r\n\"Wha...my body feels all rubbery...\" Etna says. She groggily lifts up her arm, only to watch as most of it droops right back into the water. \"Oh. Oh!\" Etna shouts, fully awake and alert now that she fully realizes what's going on. \"Flonne, wake up, damnit! We're melting!\" she says as their bodies grow more fluid every few seconds, which becomes more noticeable as their limbs start to stretch and extend around the pool as it's waters slowly spin around, giving the tub a very odd flesh-colored lava lamp-like look.<br>\r\n<br>\r\nFlonne yawns and snaps to attention as soon as she realizes she can't cup her mouth as she does, since her limbs are almost all the way over to where Etna is. \"I-I think this is probably the trap, Etna!\" Flonne exclaims, pretty much blurting the first thing that comes to mind.<br>\r\n<br>\r\n\"You think!? Come on, we...I...I don't think we can do anything about this!\" Etna shouts, as she is unable to move her limbs at all.<br>\r\n<br>\r\nFlonne blinks, then giggles a bit. \"Well...we could just try to get relaxed again...I mean...this isn't so bad...I feel so loose and unwound, just like you always should when you relax, only literally this time...\"<br>\r\n<br>\r\nEtna sighs. \"I guess you're right. I mean...at least we'll be very hard to kill in this st-WAH!\" screams Etna, just as Flonne lets out an equally loud shout of her own.<br>\r\n<br>\r\nBy now, everything below their heads are stretching around the tub several times, and Etna's outburst came from the feeling of her body and Flonne's becoming fluid enough to start blending together, forming a doughnut-like shape around the edge of the tub, with the hole in the middle slowly diminishing as their bodies start to lose all definition of where their limbs and such are and form into simply one large mass. The girls don't seem to be in any pain, however, with their previous shouts being out of surprise, instead. Not even their heads are able to avoid this, and most of Flonne's hair has become mixed up with the rest of their joined body.<br>\r\n<br>\r\nEtna laughs. \"Hah, what a stupid trap. All they did was make us unkillable!\"<br>\r\n<br>\r\n\"See, this didn't turn out bad at all...now why don't we just relax as our heads melt into the rest of our body? I mean...this feels REALLY good...\" Says Flonne, as she and Etna start to feel tingly all over as their bodies start to blend together more throughly.<br>\r\n<br>\r\n\"Yeah...this does have an interesting feel to it...\" Etna says, as her head finishes sinking into their bodily mass, leaving only her eyes sticking out of it as her hair swirls around. If they cared at the moment, the girls would be pondering their fate, though at this point they're too relaxed and into the new sensation they're feeling for that to cross their minds.</span></div></div>",
            "created":1187067600,
            "id":435608,
            "title":"How to REALLY loosen up."
        },
        "113112":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Pull them out and grind them into flour.",
                "Continue to melt them down into a molten substance."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, the water starts to drain out of the tub, though the draining mechanism does it in such a way to make sure the liquidified girls are all that's left on the bottom. No longer gently swirling around, the girls start to lose their relaxed state and are brought back to reality just in time for the next step in whatever is planned for them.<br>\r\n<br>\r\nThey feel their body start to painlessly dry out as whatever was heating up the tub is still applied. \"Gah...I feel like I'm turning to stone...\" Etna says, her and Flonne's ability to communicate diminishing the more they dry out.<br>\r\n<br>\r\n\"What's...gonna happen...to......to.....*gasp*\" Flonne says, rendered unable to speak as the last of the liquid is evaporated out of their bodies, leaving only their now-useless eyes to stare upward as their body becomes hard and rock-like.</span></div></div>",
            "created":1187067600,
            "id":435620,
            "title":"What do do with a perfectly solid girl-mass?"
        },
        "1131121":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "It's Hanako, Etna's young apprentice.",
                "It's a random restruant owner."
            ],
            "content":"<div class=\"\"><div> <span>Etna-Flonne can feel their body move upward on a lift. As they are lifted up, they can hear the workers talking. \"To the Bakery, dood!\"<br>\r\n<br>\r\n<i>What? Are they going to use us as a replacement grinding wheel or something?</i>Etna thinks. <br>\r\n<br>\r\nFlonne is able to hear Etna's thoughts since their body is merged. &lt;i&gt;I don't think so, Etna, or else we'd have a hole in the middle of us or something, and I can't feel one... she replies.<br>\r\n<br>\r\nAs the girls are set down in some location unknown to them, they can hear machinery spring to life. The girls seem to have been deposited under some kind of press. <i>Wha the h-AUGH!</i> mentally shouts Etna as the spiked press comes down on them, breaking their body into pieces. <i>Wha...why is this machine trying to gri-EEK!-nd us down?</i> wonders Flonne.<br>\r\n<br>\r\nEtna doesn't have to think long as the grinder stops pounding and begins to actually grind their rocky body up into a fine, light-flesh-colored powder. <i>T-they're turning us into flour!</i><br>\r\n<br>\r\n-------------------------------<br>\r\n<br>\r\nWhen the girls are ground up finely enough, they're dumped into an extra large bag and put on display, being sold for slightly more than their spa trip did. All Etna and Flonne can do is wonder who exactly will buy them.</span></div></div>",
            "created":1187067600,
            "id":436028,
            "title":"Obligitory Soylent  (Insert Color Here) Joke"
        },
        "11311211":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Hanako somehow knows the flour is Etna and Flonne.",
                "Hanako assumes it's a different variety and bakes away."
            ],
            "content":"<div class=\"\"><div> <span>\"Why are we buying flour here, Hanako? This seems like the most expensive around here...\" says a scrawny cow-motifed boy named Taro. Hanako looks like the offspring of Etna and Laharl. Etna's mind perks up.<br>\r\n<br>\r\n<i>Hey, it's Hanako! She'll get us out of this!</i> Etna exclaims, having quite a bit respect for the young demon-lord-in-training.<br>\r\n<br>\r\nHanako sighs. \"Higher price means better quality, Tardo! We're buying from this place!\" Hanako exclaims, as her brother nonchalantly gulps down some of his milk of unknown origin.<br>\r\n<br>\r\n\"Alright, but I don't see why I have to come along. I'd rather stay with Rozalin.\" he says.<br>\r\n<br>\r\nHanako puts her hands against her hips. \"What, you expect me to carry this around by myself?\" says Hanako, as she points to the bag of flour that Etna and Flonne were deposited in. \"Now let's buy it and get a move on. We're late enough as it is!\" She says, as she pays for the Etna-Flonne flour and hauls it off with Taro.<br>\r\n<br>\r\n---------------------------<br>\r\n<br>\r\nThe siblings arrive at Laharl's castle, with Taro hauling the cart that Hanako has all her baking goods in. Eventually, Hanako has everything in the kitchen. Hanako starts to wonder why she hasn't seen Etna or Flonne yet, and questions a random Prinny.<br>\r\n<br>\r\n\"They went out for a bit, but they should have been back by now, dood!\" says the Prinny.<br>\r\n<br>\r\n\"She must be doing some kind of awesome demon-lord stuff! And Flonne is...being Flonne with her!\" says Hanako,  as she goes to get started with the baking.<br>\r\n<br>\r\nTaro scratches his head. \"So, uh...what are you gonna be making, Hanako?\"<br>\r\n<br>\r\n\"Oh, just a little of this, a little of that. Don't worry so much about it, Tardo! I'll be making all kinds of bread-stuff, since they don't seem to have enough of it around, especially since Laharl tends to eat meat off the bone without anything else with it. I feel sorry for everyone else's digestive tracts. But anyway, time to get started!\" Hanako says, as she gets to work by first opening up the bag of flour. The kids immediately notice the odd, light-flesh-color to it.<br>\r\n<br>\r\n\"Huh, that's odd...it's all tanish...flour is usually either white or grey-ish...\"<br>\r\n<br>\r\nTaro laughs. \"Hah, told you something's wrong with it~!\"<br>\r\n<br>\r\n\"Shut it, Tardo...\" Hanako says, wondering what exactly this means.</span></div></div>",
            "created":1187067600,
            "id":435653,
            "title":"All to one little buyer."
        },
        "113112111":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Etna and Flonne are able to seperate themselves.",
                "Etna and Flonne are stuck together."
            ],
            "content":"<div class=\"\"><div> <span>Curious about the nature of the flour, Hanako decides to sift through it a little. As she does, she notices that part of it is a different color than the rest. Specifically, Etna's hair color, which Hanako recognizes right away.<br>\r\n<br>\r\n\"Wah! Some of this flour is colored the same as Etna's hair!\" shouts Hanako.<br>\r\n<br>\r\nTaro takes a look as well. \"Huh. I bet that means something turned her into flour.\"<br>\r\n<br>\r\nHanako rolls her eyes. \"Of course it does! But...hrum...what are we going to do...\" Says Hanako, as she wonders what to do with the Etna-Flonne flour.<br>\r\n<br>\r\n<i>Heh, I knew it was a good idea to make that kid my apprentice.</i> thinks Etna.<br>\r\n<br>\r\nAfter a few moments, Hanako gets an idea. \"I know, I'll make her into dough! She'll have to be able to sort herself out then!\" She says, as she dumps the remaining flour in the sifter back into the bag.<br>\r\n<br>\r\nEventually, Hanako manages to make all of the flour into dough. She and Taro watch to see what would happen next.</span></div></div>",
            "created":1187154000,
            "id":436041,
            "title":"Making Dough"
        },
        "1131121112":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Etna-Flonne suddenly feels bloated.",
                "Etna-Flonne test out their body."
            ],
            "content":"<div class=\"\"><div> <span>Eventually, the dough starts to quiver a bit and soon begins to form into a humanoid shape. However, the kids notice that the shape seems somewhat fatter than what Etna normally looks like, and are shocked when two head form instead of one. As their form completes, the heads take on the shape of Etna and Flonne. \"Well, damnit.\" Etna says.<br>\r\n<br>\r\n\"Whoa, Flonne was in there with you too!?\" asks Hanako.<br>\r\n<br>\r\nFlonne nods. \"Mmmhum. And wait until you hear how it happened!\" says Flonne with a grin on her face.<br>\r\n<br>\r\nEtna sighs. \"Why? So you can tell them how it was your fault?\" replies Etna.<br>\r\n<br>\r\n\"Well, it was my fault, but still, it was pretty wild ride!\" Flonne says as she giggles a little. \"And we didn't even have to go through someone's colon!\"<br>\r\n<br>\r\nEtna puts a hand against her forehead. \"Please, don't remind me of what our fate could have been. In fact, let's never speak of it again.\"<br>\r\n<br>\r\nTaro gets it and chuckles while Hanako is more concerned about what happened. \"So, how did you end up as flour, anyway?\" she asks.<br>\r\n<br>\r\n\"Long story short, Flonne took us head-first into an obvious trap.\" Etna answers.<br>\r\n<br>\r\n\"Yep, and we got melted, dried out, and ground up!\" adds Flonne. \"Though being ground up wasn't that nice, since those pounders hurt a bit, and being tried up just wasn't really fun, but at least Etna admits the melting part was fun!\"<br>\r\n<br>\r\n<i>Hey! Don't tell them that! I have a reputation, you know!</i> Etna mentally shouts, aware that Flonne can hear it.<br>\r\n<br>\r\n<i>Eep, sorry, Etna. But...it was fun.</i> thinks Flonne.<br>\r\n<br>\r\nHanako giggles. \"I have to admit that it does sound pretty interesting, and Etna thinking it's fun just makes it sound much better!\" says Hanako.<br>\r\n<br>\r\nTaro chuckles. \"Hanako wants to be a puddle~.\" he quips.<br>\r\n<br>\r\n\"I do not, Tardo! I just think it would be interesting to be soft and gooey like that!\" yells Hanako as she glares at her brother.<br>\r\n<br>\r\n\"So you want to be putty instead?\" he asks, completely serious this time.<br>\r\n<br>\r\n\"Maybe...though it would probably be hard to hold my form for very long...ooh, speaking of which, how are you two holding up?\" says Hanako, turning to Etna and Flonne as she asks her question.<br>\r\n<br>\r\n\"It's not too hard now that we've gotten used to the thickness of the dough. The only problem would be drying out, and that's pretty much a given for anything, so we're mostly back to normal, even with the stuff you need to make dough.\" says Etna. \"Now, I wonder what all we can do like this...\"</span></div></div>",
            "created":1187154000,
            "id":436055,
            "title":"Dough...uhm...girl? doughgirls?"
        },
        "11311211121":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Etna and Flonne only end up looking very fat.",
                "Etna and Flonne bloat into a big dough balloon."
            ],
            "content":"<div class=\"\"><div> <span>At that moment, Etna and Flonne suddenly feel like they're bloated. \"Oooh, man, our body feels like it's blowing up...\" says Etna, as Etna-Flonne clutch their fat belly.<br>\r\n<br>\r\n\"Uh oh. Uhm...I think I messed up...\" Hanako says, with a nervous giggle.<br>\r\n<br>\r\nEtna glares at her. \"Messed up? How?\"<br>\r\n<br>\r\nHanako sweatdrops. \"I, uhm...remembered to add the yeast...\" she says.<br>\r\n<br>\r\n\"Oh, well, that should be fine since we're not being baked!\" Flonne says.<br>\r\n<br>\r\nEtna's attention turns to Flonne. \"This is why we don't let you cook.\"<br>\r\n<br>\r\nHanako nods. \"Yeah...yeast expands dough without having to do anything else to it.\"<br>\r\n<br>\r\n\"Well, we shouldn't get that much bigger if the dough was made properly.\" considered Etna.<br>\r\n<br>\r\nHanako giggles nervously again. \"Uhm...well...I've never made a batch of dough this large before...so I may not have added the right amount...I...I guess we'll just have to wait and see what happens...\"</span></div></div>",
            "created":1187154000,
            "id":436062,
            "title":"Forgot to Remember to Forget."
        },
        "113112111212":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Stay as a big dough ball as long as possible.",
                "Get to a normal size as soon as possible."
            ],
            "content":"<div class=\"\"><div> <span>It didn't take long until the yeast really got to work, causing Etna-Flonne to bloat incredibly fast. Within moments their form starts to lose definition between their limbs and body as they start to grow very round.<br>\r\n<br>\r\n\"Eeep! How much yeast did you put in us!?\" yelped Flonne between her puffy cheeks.<br>\r\n<br>\r\nHanako thinks. \"Well, let me recall...oh, it looks like I didn't go TOO overboard with the yeast, as I only used twice as much as I should have.\"<br>\r\n<br>\r\nFlonne blinks. \"Wah...then why are we bloating like this!?\"<br>\r\n<br>\r\nHanako tries to recall everything she added, then recalled something. \"Uh oh...uhm...now that I remember, I added twice the eggs and three times the sugar as well, in an attempt to make your form more solid. In other words...the yeast is having a field day with all the stuff I added.\" she says.<br>\r\n<br>\r\n\"Oi. So we'd have probably been fine if you left out the yeast, right?\" asks Etna.<br>\r\n<br>\r\n\"That's about the si-...err...yeah...that's right. Sorry Etna.\" Hanako says.<br>\r\n<br>\r\nEtna rolls her eyes. \"Wonderful.\" she says, as though she's only mildly upset.<br>\r\n<br>\r\nLuckily for the girls, the kitchen is very large. When the expansion slows down, their body is at 50 feet wide. While they're still expanding, it's rather negligible in comparison to their size overall, only growing an inch every few minutes. They are without limbs of any sort, though their puffy-cheeked heads still crown the top of their body.<br>\r\n<br>\r\nWith Etna-Flonne's growth slowed, Hanako and Taro are able to walk up close without having to worry about getting caught up in their rapid growth. \"Are you two alright up there!?\"  asks Hanako, while Taro presses a hand against their surface out of curiosity.<br>\r\n<br>\r\nFlonne giggles. \"It's pretty nice once you get used to it!\"<br>\r\n<br>\r\n\"Yeah, I guess it's not so bad.\" Etna says with a nod.<br>\r\n<br>\r\nTaro withdraws his hand. \"Wow, you're all round, but you're all soft and spongy.\"<br>\r\n<br>\r\n\"Well yeah! Did you expect them to be firm like a balloon?\" asks Hanako.<br>\r\n<br>\r\nTaro nods. \"Yeah, kinda. I mean, they're way bigger than when they started.\"<br>\r\n<br>\r\n\"That's a good point...well, the yeast does expand and multiply as it eats stuff, so that would probably explain that.\" reasons Hanako. \"That's probably why it would take a while to get all the air out. Nothing short of pressing them flat would really work, though, and I don't think we know anyone who can use a 50 foot wide rolling pin. That is, if it's even a problem right now.\" Hanako says, as she looks up at the Etna-Flonne as she says the last line. \"If you don't mind, there's no real reason to just let all the gas leave your body naturally, but if you do, we'll try to find way to you back to a much smaller size as soon as we can.\"<br>\r\n<br>\r\nEtna and Flonne take a moment to consider what they should do.</span></div></div>",
            "created":1187154000,
            "id":436091,
            "title":"A Huge Ball of Dough"
        },
        "1131121112121":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "They want to get bigger.",
                "They simply want some time to themselves."
            ],
            "content":"<div class=\"\"><div> <span>\"Aww, but we're just now getting used to it. I wanna ride it out!\" says Flonne, while Etna does her best to shrug. \"Yeah, something about being like this is really working for me, so I don't think I want to get smaller for a while.\" Etna says with a laugh.<br>\r\n<br>\r\nHanako smiles, more than happy to go with her idol's wishes. \"If you're cool with it, Etna, I have no problem leaving you like this. Very well, then, but what exactly do you two plan on doing like that. You seem pretty limited.\" Hanako says, wondering just what Etna-Flonne wants out of this situation.</span></div></div>",
            "created":1187154000,
            "id":436095,
            "title":"Staying Big and Round for now."
        },
        "11311211121211":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Feed them like normal.",
                "Add more dough..."
            ],
            "content":"<div class=\"\"><div> <span>\"Hum...well, now that I think about it, growing larger felt REALLY good, so why don't we do that?\" answers Etna.<br>\r\n<br>\r\nFlonne giggles. \"Yeah! We've already gotten this big, so we might as well get even bigger!\"<br>\r\n<br>\r\nHanako scratches her chin. \"Hum...well, the yeast inside you is more than likely still living, so all I figure we have to do to make you bigger is to feed you more stuff!\" reasons Hanako.<br>\r\n<br>\r\n\"Wha, you're just going to make them bigger just like that?\" asks Taro.<br>\r\n<br>\r\nHanako grins. \"If Etna says she wants to grow bigger, then I'm going to see to it that she grows bigger!\"<br>\r\n<br>\r\nTaro looks up at them. \"Are you two sure about this?\" he asks.<br>\r\n<br>\r\nBoth nod. \"I don't know about Flonne, but I wouldn't have asked for it if I wasn't sure I wanted to do it.\" replies Etna while Flonne grins. \"Yeah, we really want to go through with this!\" says Flonne.<br>\r\n<br>\r\nHanako grins. \"Now that Tardo has made sure that all doubts are out of the way, how should we feed them...\"</span></div></div>",
            "created":1187154000,
            "id":436110,
            "title":"Yes, They're REALLY sure."
        },
        "113112111212111":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "The yeast itself multiplies, merely making them bigger.",
                "The yeast has causes them to produce more dough."
            ],
            "content":"<div class=\"\"><div> <span>\"As I said, feeding them like normal should work just fine. But now we have to find something to feed them with that the yeast will take to. Lots of sugar should do the trick, but I don't think both of them are going to want to eat pure sugar.\" says Hanako.<br>\r\n<br>\r\nFlonne giggles. \"Something sweet, hum? How about honey? I like how it feels like it sticks to your insides...ahhh...\" says Flonne. \"Heh, I think I'm craving something nice and sticky as well, but not something that sweet...syrup would work nicely.\" Etna says.<br>\r\n<br>\r\n\"Alright then, let's go gather up everything we need, then.\" Hanako says, as she and Taro head off.<br>\r\n<br>\r\n-----------------------<br>\r\n<br>\r\nFiguring that the grounds outside of Laharl's castle would be wide enough, Etna-Flonne bounces their way outside while Hanako gets everything ready. The girls see two tanks about half their size sitting there with couple of stretchy looking tubes coming from each.<br>\r\n<br>\r\n\"Hum...looks like an excellent setup to me.\" says Etna.<br>\r\n<br>\r\nFlonne nods. \"Yeah, I can hardly wait to start getting bigger...it's going to be so much fun~.\" She says, as Etna-Flonne move their heads down to where Hanako and Taro are.<br>\r\n<br>\r\n\"Alright,  you two, you've got everything set up for us?\" Etna asks, getting tired of waiting.<br>\r\n<br>\r\nHanako nods as she plunks one tube into Etna's mouth. \"Mmmhum. Sorry to keep you waiting Etna.\" she says, as Taro puts another tube in front of Flonne. Flonne happily gets her mouth around the tube, and giggles around it.<br>\r\n<br>\r\n\"Now, these are enchanted tanks, so they'll start pumping their contents into you when you command them to once you're aware you can, and they shouldn't run out for a very long time. I figured I'd leave it up to you two as to how long you want to keep this up.\" Hanako explains with a giggle, though it's not even halfway into her explanation until Etna and Flonne began the flow of each. They begin to grow larger as their choice of sticky fluid pours into them, unaware of how their body is going to react.</span></div></div>",
            "created":1187154000,
            "id":436127,
            "title":"Let's do this 'normally'."
        },
        "1131121112121112":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "They begin to float off the ground.",
                "They begin to lose their round shape."
            ],
            "content":"<div class=\"\"><div> <span>While Etna-Flonne doesn't know it, the yeast inside of them underwent a strange mutation due to using bits of their body as a food source. This mutation has caused the structure of the yeast to be incredibly similar to their flour-like body, and has also caused it stop using their body as a food source in favor of other food sources. As Etna and Flonne consume their respective meals, the yeast begins to reproduce and grow as normal, but it reproduces into more of the doughy substance the girls are now composed of. As a result, Etna-Flonne's pretty much lacks a limit, since more is being added to their body, and they manage to stay round since they're also still filling up with gas as a byproduct of the whole process.<br>\r\n<br>\r\nThis, naturally, registers as a new sensation for the girls.<br>\r\n<br>\r\n\"Mmmmm....I think we're getting thicker inside...\" Flonne says around the hose.<br>\r\n<br>\r\nEtna smirks. \"Yeah, it feels like we're actually getting bigger instead of just filling up with something.\"<br>\r\n<br>\r\nHanako finds their reaction odd. \"Hrum...you shouldn't be able to feel the yeast itself.\"<br>\r\n<br>\r\n\"Then what's going on?\" asks Taro.<br>\r\n<br>\r\nHanako shrugs. \"I don't know, I just know about how cooking processes work.\"<br>\r\n<br>\r\nEtna grins. \"Ahh...regardless, growing bigger feels much better that filling up.\"<br>\r\n<br>\r\n\"Yeah, and so much more to feel with, too!\" Flonne adds as their body grows larger, reaching 100 feet wide.<br>\r\n<br>\r\nJust then...</span></div></div>",
            "created":1187154000,
            "id":436129,
            "title":"More Girl than Gas"
        },
        "113112112":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Reincarnate ASAP.",
                "Take advantage of their gassy new forms."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm sure it's just comes from something local that's this color.\" Hanako says.<br>\r\n<br>\r\nEtna mentally groans. <i>It's ok...I wasn't expecting her to realize our situation, anyway...</i><br>\r\n<br>\r\nWith that said, Hanako gets to work, slowly baking all of the Etna-Flonne flour into various baked goods. Compared to being dried out, being baked doesn't feel too bad to the girls. When Hanako's work is finally done, she sits down. \"Ah...all this baking has made me hungry myself.\" Hanako says, as she eats dozen of the cookies she had baked, noticing a slightly-odd flavor. \"There's something weird with the wheat around here.\" she says, as her digestive system soon gets to work.<br>\r\n<br>\r\nHanako clutches her belly after a few moments of awkward silence as she suddenly feels unusually bloated. \"Oooh...whoa, this wheat is really filling...\" she says with a slight giggle as the bloated feeling intensifies. \"Really, Really filling...I think I need to go to the bath-\" she begins, as she winces and lets a loud fart\"-room. Whoa, I can't believe that came from me...\"<br>\r\n<br>\r\nTaro laughs. \"Told you. That flour's making you gassy!\"<br>\r\n<br>\r\n\"Oh please, that was just on-*FRRRRT!*-e. Augh! I hate it when you're right, Tardo!\" she says, as she produces a few more farts before the bloated feeling finally goes away. \"Ooohg...finally...\"<br>\r\n<br>\r\n\"Hey, we're kinda sort of back to normal!\" exclaims a small voice similar to Flonne.<br>\r\n<br>\r\nHanako and Taro look to the source of the voice, where Etna and Flonne are floating as mouse-sized fart-cloud ghosts. <br>\r\n<br>\r\n\"Whoa, what happened to you guys!?\" asks Hanako.<br>\r\n<br>\r\n\"Long story short, Flonne got us turned into flour, which you then baked into a lot of food.\" Etna says.<br>\r\n<br>\r\nFlonne blinks. \"Well, what's done is done. Now, how exactly are we going to at least get our spirits out of the food?\"<br>\r\n<br>\r\n\"The better question to ask is 'Who here is going to willingly let us force-fed them all the food in order to speed up the process?'\" says Etna, who looks to a ready and willing Hanako.<br>\r\n<br>\r\n\"Well, I don't really want to be gassy and big, but I'll do it for you, Etna!\" Hanako says, as Etna floats over to Taro. \"Now, Taro, be a good boy and tie your sister to something sturdy. We'd do it but we're way too small.\" She says.<br>\r\n<br>\r\nFlonne looks at Etna with a puzzled look on her face. \"But isn't Hanako going along with this anyway? Isn't trying her up overkill?\" Flonne says.<br>\r\n<br>\r\n\"Eh, it's not force feeding without making her unable to do anything about it.\" Etna says, as she turns to see Taro has tied Hanako's arms together while Hanako complains that the knot is too loose. \"If this was a real situation I would possibly try to escape from, I'd totally be able to do it!\" Hanako exclaims, pretty much as accepting of Etna's plan as Etna herself.<br>\r\n<br>\r\nAfter properly getting her arms tied behind her, Etna and Flonne begin to feed Hanako the food she had made from them. As they feed her, her belly starts to grow wider with both gas and content, and she soon starts to uncontrollably fart up a storm while Taro sits a good ways back, not wanting to be too close to his now-smelly sister. As Hanako farts, Etna and Flonne slowly grow back to their normal size. This eventually happens, though not before the little girl is stuffed with enough food bloat her body into a very round shape that's around twice her size. <br>\r\n<br>\r\nWith their spirits completely out of the bread. Etna and Flonne float over to Hanako and thank her. \"You're putting up with this rather well, considering you'll be like this for a good while.\" Etna says, as Hanako giggles a bit. \"Anything for you, Etna...\" she says with a slight grin on her face, as Taro walks up to her with a clothespin on his nose. \"But how are we gonna explain this to mom, Hanako. She'll be really mad that you let Etna do this to you, you know. Not to mention your smellyness.\"<br>\r\n<br>\r\nHanako sticks out her tounge. \"If I would have listened to YOU, Tardo, who knows what could have happened to them?!\"<br>\r\n<br>\r\nFlonne sighs. \"Come on, don't be like  this. Everything worked out fine, right?\"<br>\r\n<br>\r\n\"But what about your bodies? Hanako's kinda turning them into...poop.\" Taro says, stating the obvious.<br>\r\n<br>\r\nEtna shrugs. \"We'll just reincarnate. I mean, it's not like there was any other way to restore our bodies once we were made into flour, anyway. We lost all our levels when Hanako farted us out, anyway.\"<br>\r\n<br>\r\nFlonne scratches her head. \"So when are we going to reincarnate, anyway?\"</span></div></div>",
            "created":1187067600,
            "id":435665,
            "title":"Stuffed and Bloated"
        },
        "1131121121":{
            "author_id":"oddpersona",
            "author_name":"OddPersona",
            "choices":[
                "Curvy Body Shakes",
                "Berrygirl Pie (Cherry, Blueberry, Apple, etc. flavor)"
            ],
            "content":"<div class=\"\"><div> <span>\"Banzai!\" A voice yelled out of nowhere. \"What the hell was that?\" Etna screamed. All of them heard here what sounded like someone running at them at high speed. When they turn to the source they saw a big white wall with the words \"Fouth Wall\" painted red and big on it. Suddenly, the walll shattered as someone gave a powerful running kick to the other side. Taro and Hanako duck to cover from oncoming debris, while Etna and Flonne just floated since they were a gas now. When the smoke cleared it reveal a guy in a black-fur prinny suit wearing sunglasses standing upright with his arms cross, his face had a serious look to it. Everyone else look at the man with quiet expressions.<br>\r\n<br>\r\n\"Who the hell are you?!\" Etna finally exclaim after getting over her shock. The guy's posture got even more upright, \"I'm the writer of this chapter, I've broken the fourth wall just to reincarnate you out of your gaseous forms.\" Everyone was silent after that. Taro raised a hand, \"What's with the get up mister?\" The writer adjusted his sunglasses (which gave a sparkle), \"It makes me feel more badass.\" More silence. \"So wait, you came all the way here, breaking the fourth wall in the process, just to reincarnate those two.\" Hanako question, pointed to the gas duo with her thumb. \"Look,\" the writer said, \"I was bored and decided to do something like this.\"<br>\r\n<br>\r\n\"Wow,\" Etna remark, \"Sounds pretty pathetic for a guy like you.\" \"And this coming from to charcters reduce to cameo appearances in the Disgaea series.\" The writer return. Everyone else sweatdrop after that.<br>\r\n<br>\r\n\"So how are going to fix us?\" Flonne ask in a polite voice. \"Simple.\" The writer search in the pouch of his prinny suit to pull out a hand vacuum. He aimed the device at the gas forms and turn it on. <br>\r\n<br>\r\nWith a powerful suction the two gas clouds soon disappear within it's confinces. \"The vacuum gave a violent shake, \"Hey let us out!\" Etna's voice proclaim. The writer simple ignore it and soon started shaking it violentely, the two girls inside started getting dizzy. After shaking it for about a minute the writer than set the vacuum down gently on the floor infront of him. Taro and Hanako got to both sides next to him, \"What's next?\" Taro ask. The writer's sunglasses gave a malevolent glint in its reflection as the writer raise one one leg. \"One reincarnation coming up!\" The writer said as he gave a violent kick to the vacuum, sending it crashing into the other side of the kitchen. Taro and Hanako ran to the impact sight and were shock to see Etna and Flonne back in their original bodies lying on the floor in a dazed state.<br>\r\n<br>\r\nThe writer in the prinny suit than walk up to his work, he gave a quick nod, \"My work here is done.\" He than started running back to the fourth wall only to give a nasty roundhouse kick, putting another hole in it. \"Wait,\" Hanako went up to the guy in the prinny suit, \"What are we suppose to do for the story from here?\" \"Oh yeah,\" the writer said as he scratch his chin, he than snap his fingers and started searching around in the costume's pouch. He pulled out a hugh purple tome, \"Since there's all kinds of transformation, here's a cookbook for all kind of weird stuff.\" Hanako took the tome and back away a bit. \"By the way I'm not paying for this wall.\" The writer said as he went on the other side of the fourth wall.<br>\r\n<br>\r\n\"What a strange guy Hanako.\" Taro said as he went next to Hanako. Hanako only shrug it off and went back to checking out the tome she got from the prinny suit guy, \"A transformation cookbook huh, sounds interesting. Wait til Etna hears about this.\" She than started reading over the tome's contest, \"I wonder what sounds like a good way to start off?\"</span></div></div>",
            "created":1228280400,
            "id":615225,
            "title":"Guess who's breaking the fourth wall."
        },
        "1131122":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "They maintain their general shape.",
                "The girls start to become wildly distorted as time passes."
            ],
            "content":"<div class=\"\"><div> <span>The girls feel some kind of liquid being poured over them while they're still in the tub, which is now rising up until their top is even with the top of the pool. While they don't know it, there's a spherical encasement coming out of the top of the tub.<br>\r\n<br>\r\n\"I hope we didn't scare you too much, ladies, dood. This is just the next part, dood.\" says a random worker Prinny. Soon after he says that, Etna and Flonne's sight begins to return to them as their body starts to grow liquid again. \"We like to call this part the 'Lava Lamp' treatment, dood.\" explains another Prinny. The girls don't even have to ask why it's called this as Flonne notices that Etna is rising out of their combined body.<br>\r\n<br>\r\n\"Ahh...this is actually pretty nice.\" Etna says as Flonne starts to flow out as well. <br>\r\n<br>\r\nFlonne nods in agreement. \"Oh yeah, I guess we'll just swirl around in here until we're nice and loose!\" reasons Flonne.<br>\r\n<br>\r\n\"Hum...but how much like a lava lamp are we going to be?\" Etna wonders.<br>\r\n<br>\r\nFlonne tilts her head a little  \"What do you mean, Etna...oh, I think it get it!\" Flonne exclaims, as she starts to wonder as well.</span></div></div>",
            "created":1195621200,
            "id":466934,
            "title":"Lava Lamp Girls."
        },
        "11311222":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "They have control over how their bodies flow.",
                "They can only go with the flow."
            ],
            "content":"<div class=\"\"><div> <span>After some time passes, the girls start to become distorted. At first their bodies manage to stay together as they flow up and down the enclosure in a balloon-like shape, but things start to get more random as their bodies become looser. It doesn't take long for some of their balloon-like mass to migrate to random parts of their body and cause the parts they swell up to break apart from the central part of their bodies.<br>\r\n<br>\r\nFlonne giggles as her bloated head breaks away. \"Hehe...we're starting to become like a proper lava lamp now!\" she says right before her head combines with the goo at the top and sinks in, leaving her grinning face visible until the rest of her covers it up, which causes Etna's body to flow downward in a similar fashion.<br>\r\n<br>\r\n\"Yeah, won't be long until we start to get REALLY mixed up.\" Etna says before her body hits the bottom of the space.<br>\r\n<br>\r\nAnd as Etna predicted, the girls soon find themselves flowing up and down the enclosure in completely random shapes and sizes, hardly having any defined shape at all except through pure chance. At this point, the girls are ready to experiment and see if they can actually have some influence regarding the way their bodies flow.</span></div></div>",
            "created":1195621200,
            "id":466942,
            "title":"Alternating Alterations"
        },
        "113112221":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Squeeze,  splitting Flonne up into multiple parts again.",
                "Suddenly, another girl gets tossed into their lamp spa for them to play with."
            ],
            "content":"<div class=\"\"><div> <span>Etna and Flonne first try to see if they can collide with each other on purpose. Sure enough, the two of them manage to bump into each other in the middle of the lamp,  Flonne giggles as Etna flows right through her, forming a hole in the middle of her as she flows to the top. \"Whoo, we can move like this after all!\" Flonne exclaims as her body comes back together at the top of the lamp.<br>\r\n<br>\r\n\"Mmm...we could have some real fun with this, then....\" says Etna. She tries to see if she can force herself to flow upward now, but it doesn't seem to be any trouble at all for her, as she flows upward as a stream. Flonne giggles a little as She and Etna soon occupy the same area of the lamp for a moment before she gets pushed downward as Etna's body fills in the top of the lamp.<br>\r\n<br>\r\n\"Ah, Miss Etna, I don't mean to interrupt but it seems like you're starting to change colors!\" says Flonne, as she notices Etna starting to turn the same shade of red as her hair color.<br>\r\n<br>\r\nEtna seems to be aware of this. \"Yeah, it'll be much easier to identify what belongs to who this way.\" Flonne giggles a bit, as she starts to change into a blonde-ish color.<br>\r\n<br>\r\n\"Oh wow, how considerate of them to do something like this!\" exclaims Flonne. \"So, what should we try doing next?\"<br>\r\n<br>\r\n\"How about we try to see if we can keep ourselves in the middle of the lamp now?\" asks Etna. Flonne seems to agree with this, as she's already trying to get her body to flow into the middle of the lamp. Etna does the same, and the two end up floating next to each other like a pair of wobbly bubbles.<br>\r\n<br>\r\n\"So, is there any reason why you wanted us to meet in the middle like this, Miss Etna?\" inquires Flonne. Etna responds by flowing her body around Flonne's in such a way that she's wrapped around Flonne several times. She then blends everything together so she's like a gooey net surrounding Flonne. Flonne wonders just what Etna has in mind, and gets an answer before she even gets a chance to ask as Etna starts to gently press inward, just enough for Flonne to be able to feel it. Flonne sighs contentedly Etna cuddles with her.<br>\r\n<br>\r\nEtna does have something else in mind, though...</span></div></div>",
            "created":1287205200,
            "id":976301,
            "title":"Formless Fun"
        },
        "113112222":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "They start to merge together again.",
                "They're released from the container as they are."
            ],
            "content":"<div class=\"\"><div> <span>They find that they are too fluid to really have any control over their motion within the container. Neither of them seem to mind, though.\"Hehe, I think it's actually more relaxing this way anyway.\" comments Flonne as parts of her and Etna bump into each other.<br>\r\n<br>\r\n\"Yeah, floating around without any form at all is just about as relaxed as you can get.\" replies Etna, their bodies resembling nothing more than free-flowing putty, each a slightly different color.<br>\r\n<br>\r\nAfter a while...</span></div></div>",
            "created":1221973200,
            "id":585418,
            "title":"As relaxed as possible."
        },
        "1131122221":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "They start to relax more.",
                "They get more excited."
            ],
            "content":"<div class=\"\"><div> <span>Some time passes, and they begin to realize that they're not simply pushing each other around as they flow. They can feel themselves sticking together as they swirl around. The combined colors of their bodies become marbled at first, but after a while, there is no distinction between either of them, as though they've become a single mass of goo.<br>\r\n<br>\r\nTheir relaxation starts to shift into mild arousal as they continue to flow around, breaking apart and re-combining unpredictably. To Flonne, the feeling is something entirely new to her. \"Mmm...I feel all relaxed and warm all over, and just a little excited, too. What does this mean, Etna?\"<br>\r\n<br>\r\n\"Don't worry about what it is right now, just go with it. Trust me, it'll be more fun that way.\" Etna explains, followed by Flonne giggling a bit, having no problem doing what Etna advised her to do.</span></div></div>",
            "created":1221973200,
            "id":585465,
            "title":"As Close As Physically Possible"
        },
        "11311222211":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "They drift off to sleep.",
                "Their minds completely drift away."
            ],
            "content":"<div class=\"\"><div> <span>As they flow together, their minds start to slowly drift off. \"Mmmm...I think it's working...I'm feeling absolutely relaxed, as if I can just let my mind go and just flow around..\"<br>\r\n<br>\r\n\"Ah...that doesn't sound like a bad idea at all, Flonne. That is what we came here to do, after all.\" replies Etna.<br>\r\n<br>\r\nFlonne giggles lightly. \"Mmmhum, let's just relax and drift away together...\"</span></div></div>",
            "created":1287205200,
            "id":976340,
            "title":"Relaxing as One"
        },
        "113112222112":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "content":"<div class=\"\"><div> <span>Etna sighs contentedly as she's feeling what Flonne is feeling. \"Yeah...together, then...\" she says, as she gets into the same relaxed state as Flonne.<br>\r\n<br>\r\nAs they flow about in this state, their minds start to disconnect from every worry and care they could possibly have. The only things that remain in their mind after a while are who they are, their feelings for each other, and the fact they've been transformed.<br>\r\n<br>\r\n\"...Miss Etna...I love this so much...let's just stay like this forever...\" says Flonne, her words sounding serenely cheerful. She can see in Etna's mind that Etna has no desire to bring an end to this either, but hearing each other's voices in their head lets them know they are indeed together.<br>\r\n<br>\r\n\"...I wouldn't dream of it...it's not like there's anything else worth doing...\" Etna says, as she lets out another contented sigh.<br>\r\n<br>\r\nFlonne giggles inwardly again. As they continue to live this way, their minds drift to the point where they completely forgotten about their previous forms, thinking that they have always been this way since they day they were created. By this time, only their names and personalities are all that remain of their original form.<br>\r\n<br>\r\nContent to be this way, time passing does not make them desire any less to remain as they are, blissfully aware they will be like this for eternity. Together forever, they enjoy every moment of it.</span></div></div>",
            "created":1287205200,
            "id":976349,
            "title":"Flowing Forever"
        },
        "11311222212":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Their body grows along with the feeling.",
                "They become one completely."
            ],
            "content":"<div class=\"\"><div> <span>As the perfectly blended duo continue to flow through the lamp, the process of breaking apart and recombining causes the sensations within them to grow more intense. Since they are practically one, they merely have to think to communicate to each other.<br>\r\n<br>\r\n\"Oooooh, Miss Etna, being one with you is making me feel so wonderful inside....\" thinks Flonne.<br>\r\n<br>\r\nFlonne can hear Etna chuckle inwardly. \"It's because of that that you do, Flonne. Every sensation is felt by us individually and felt as something the other feels.\"<br>\r\n<br>\r\n\"Wooooow, that sounds so romantic, Miss Etna...to feel everything the other feels...hehehe!\" giggles Flonne. \"I wonder how much this feeling is going to build up, because I feel like I'm about to cross into pure bliss...\"<br>\r\n<br>\r\n\"Mmm...without an outlet, I don't think it will stop building up, we'll just have to see what happens when we get there, won't we?\" Etna says. Within moments, the two of them moan inwardly at the same time, an indication that they've just reached that blissful state that Flonne mentioned. They feel something start to change within them at this point.</span></div></div>",
            "created":1287205200,
            "id":976330,
            "title":"Flowing as Lovers"
        },
        "113112222122":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Ask to be restored to see how she looks now.",
                "Ask for someone to be brought to her."
            ],
            "content":"<div class=\"\"><div> <span>The moment they moaned, their ceased to be a distinction between Flonne and Etna. It would seem they would need a clever play-on-words-name such as Flonnetna, or something to that effect. But no longer did they view each others as individuals, but rather, themselves as an individual.<br>\r\n<br>\r\n\"Ah...that felt great...\" says Flonnetna, as she giggles a little. Their body is still the same single-color goo, their minds and souls, or rather, mind and soul, now was consistent with their exterior. \"Now...what are we going to do...we need someone to play with~\"<br>\r\n<br>\r\nShe starts to wonder what to do next...</span></div></div>",
            "created":1287205200,
            "id":976331,
            "title":"Flowing as One"
        },
        "114":{
            "author_id":"shadowsonger",
            "author_name":"ShadesWish",
            "choices":[
                "Flonne resists",
                "Flonne gets excited",
                "Someone knocks on the door..."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly Etna stepped right up close next to Flonne.<br>\r\n\"I've got a few ideas... stuff we can do together, y'know?\"<br>\r\n\"Together?\" Flonne asked uncertainly, confused by how Etna was behaving. Etna grinned.<br>\r\n\"Yeah.\" She took Flonne's hand and dragged her into the nearest empty bedroom. Once inside, Etna locked the door and suddenly kissed Flonne.</span></div></div>",
            "created":1268715600,
            "id":851899,
            "title":"Etna hits on Flonne"
        },
        "1141":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Flirt with Flonne until she can't resist.",
                "Coax Flonne to at least get close.",
                "Make her helpless and play around with her."
            ],
            "content":"<div class=\"\"><div> <span>Flonne is surprised by the sudden kiss out of nowhere. She steps back as her face goes completely red. \"W-what was that about!?\"<br>\r\n<br>\r\nEtna smiles slyly at Flonne. \"You of all people should know what love is, Flonne.\" says Etna as she gets closer to her.<br>\r\n<br>\r\n\"Well yeah, and I don't have a problem with having that kind of relationship with you, Miss Etna, but I don't think I'm ready for something like that yet...\" says Flonne as she partially regains her composure.<br>\r\n<br>\r\n<i>\"Hum...what would bring her closer to being 'ready'...\"</i> Etna thinks to herself.</span></div></div>",
            "created":1287118800,
            "id":975525,
            "title":"Reluctant Flonne"
        },
        "11411":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "She swells up while excited like this.",
                "She melts into a puddle."
            ],
            "content":"<div class=\"\"><div> <span>Soon, Etna grins as an idea comes to mind. <i>\"Oooh, I bet Flonne's never had someone flirt with her before...\"</i><br>\r\n<br>\r\n\"Mmm...maybe we are going a little too fast. I think I'll just back up a little and tell you why I think you're so attractive~\" Says Etna, catching Flonne off guard.<br>\r\n<br>\r\nFlonne blushes a little. \"Ah, you mean this isn't just something to do?\" she asks.<br>\r\n<br>\r\n\"Oh no, Flonne, I've had my eye on you for a while now, this just felt like the perfect opportunity to show you how I felt about you...but I guess I can settle for just saying how I feel about you~. Like how you look so sexy in that fallen angel getup.\"<br>\r\n<br>\r\nThis makes Flonne blush like mad. \"A-Ah...you actually find me sexy? I mean, coming from you...that really says a lot, Miss Etna...\"<br>\r\n<br>\r\n\"Mmmhum...not to mention your nice long legs, and for that matter, your nice long everything~. Just the thought of having a lover who's taller than me really gets me going, you know what I mean~?\" says Etna as she gets closer to Flonne.<br>\r\n<br>\r\nFlonne appears to be too busy being positively flustered to even notice. \"R-really now, Miss Etna, that's just physical attraction...\" she manages to say as Etna gets close enough to be able to put her arms around Flonne at a moment's notice.<br>\r\n<br>\r\nEtna prepares what she's sure will get Flonne 'ready' for a relationship with her. \"Yeah...except I don't normally find tall girls attractive, but you've really turned me on to that. In fact~, I even find your cutesy Love-Freak nature really sexy. Mmm...and the way you call me Miss Etna all the time tops it off rather nicely.\"<br>\r\n<br>\r\nWhile still extremely flustered, the nervousness drops from Flonne's voice. \"Oh Miss Etna, to hear you say you love me for who I am, I just feel so warm inside~\" she says, not noticing that something strange is starting to happen.</span></div></div>",
            "created":1287118800,
            "id":975555,
            "title":"Etna's Sexy Angel"
        },
        "114111":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Go for it, we just got started after all.",
                "Wonder what it's like, and maybe find a way to puff with her."
            ],
            "content":"<div class=\"\"><div> <span>Etna can't do much but watch as Flonne literally swells up with excitement. At first it's just the area around her chest and abdomen that swells up. As she continues to fill up, the swelling starts to progress to her arms and legs, causing her whole body to start taking on a rounded shape. As for Etna, she seems to be surprised that this is even happening, though at the same time something about it seems interesting to her.<br>\r\n<br>\r\nFlonne begins to cool down just as she gets as wide as she is tall, the first thing she notices being Etna looking her over, which in turn causes Flonne to look down and realize what had happened to her. \"Ah! When did I get all round like this?\" she says, more surprised than anything else.<br>\r\n<br>\r\n\"Oh, it happened while you were all worked up over me finding you sexy.\" explains Etna. \"I guess angels and/or fallen angels don't get that a lot.\"<br>\r\n<br>\r\nFlonne tries to shrug as well as her puffy body will allow. \"I don't know about that, but nobody ever considered me to be sexy, so maybe it's just a personal thing?\"<br>\r\n<br>\r\n\"Well, whatever the case is, for some reason, it's a nice look for you, it really goes well with you cute sexiness.\" says Etna.<br>\r\n<br>\r\nFlonne starts to blush again. \"Ah, Miss Etna, are you trying to make me swell up even more?\"<br>\r\n<br>\r\n\"Ooooh, now there's an idea...in fact, it's a very good one, you big sexy angel~\" says Etna, as she climbs up on Flonne so they're face to face. She feels Flonne swell up a bit more under her, and wonders if she should really go for making Flonne swell up more.</span></div></div>",
            "created":1287118800,
            "id":975570,
            "title":"She swells up while excited like this."
        },
        "114112":{
            "author_id":"oddpersona",
            "author_name":"OddPersona",
            "choices":[
                "Etna wants to make Flonne into something.",
                "Etna wants to melt herself as well."
            ],
            "content":"<div class=\"\"><div> <span>Etna deciding to be even more daring than she had before gets close to the fallen angel's face and leans in close to whisper into her ear, \"I simply find you so irresistable when you act like that my little angel.\" And to top it all off, the demoness gives the blonde a small kiss on the cheek.<br>\r\n<br>\r\nFlonne's emotions went into overdrive upon receiving that once kiss. 'SHE KISSED ME!' the angel mentally panics, 'SHE ACTUALLY KISSED ME! I'VE NEVER BEEN KISSED BEFORE IN MY LIFE! IT FELT SO GOOD! OH MY BODY FEELS SO...SO...!' However, with her internal fluxuating of her emotions she didn't quite realize her body starting to lose definition.<br>\r\n<br>\r\nEtna gives a purr of delight as she sees her companion's heart melt in adoration...along with the rest of her body as well. The redhead watches with intrigue as the fallen angel's body liquidfy and sink lower into the ground, leaving a flesh-color puddle right where she's standing. 'Oh this is interesting.' Etna mentally smirks as she watches Flonee's clothes flow off her body as they were unaffected by the melting process. Soon Flonne's arms meld with the puddle, leaving a blissfully unaware fallen angel oblivious to her current status. Finally, after about several minutes, Flonne was reduce to a flesh-color puddle on the ground, her clothes floating on the puddle's surface. Though only remnants of the puddle was still Flonne was that there were streaks of yellow in the puddle.<br>\r\n<br>\r\nEtna gives a toothy grin, \"Well what do you know, Flonne really did fall to pieces.\" She takes a finger and stirs the puddle around a bit, mixing up the colors, \"I do say though, she was entertaining.\"<br>\r\n<br>\r\n\"Who is?\" Came Flonne's voice from the puddle.<br>\r\n<br>\r\nEtna jumps back surprised, \"Woah! Flonne you still there?\"<br>\r\n<br>\r\nIn the puddle surface, a couple of crimson orbs that matches Flonne's eyes appear, \"Of course I'm here silly.\" The puddle returns, bubbles forming on the surface, \"Say why do you look bigger?\"<br>\r\n<br>\r\nEtna scratches her cheek, \"Well it's that I'm bigger, it's just that you're smaller.\" Taking a nearbyby handheld mirror the demoness show Flonne her reflection.<br>\r\n<br>\r\nFlonne's eyes on the puddle  widen, \"What happen to me?\"<br>\r\n<br>\r\n\"I guess, since I kinda made you overheat with that kiss on the cheek, you kinda melted. Whoops?\" Etna gives a embarrassed smile.<br>\r\n<br>\r\n\"Please help me Etna!\" Flonne whines, \"I don't want to be a stain on the floor!\"<br>\r\n<br>\r\n\"I''m coming, I'm coming.\" Etna kneels down and taken the fallen angel's clothes uses them as a makeshift sponge, soaking up the melted  Flonne and pouring her into a bucket that was nearby.<br>\r\n<br>\r\n\"Well I guess that's all of you Flonne.\" Etna says as she wringes the last few drops from Flonne's clothes into the bucket.<br>\r\n<br>\r\n\"Thanks.\" Flonne replies back. \"So what are we going to do about me?\"<br>\r\n<br>\r\nEtna mouth curls into a devious smile, \"Well, now that I see you like this, I can pretty much say that you are even cuter know as a puddle.\" She takes the tip of her tail and starts stirring it around the bucket's contents. \"I mean you look so innocent with those worried eyes on your little face, and also,\" She lifts up her tail and licks the few drops of Flonne off of it, \"It makes me curious, how much you can transform while like this.\"<br>\r\n<br>\r\nFlonne stars back at Etna's face with a little bit of fear in her eyes, but also a sense of curiosity builds up inside her.</span></div></div>",
            "created":1287291600,
            "id":976396,
            "title":"Melting Under Her Love"
        },
        "1141121":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Cool her down.",
                "Heat her up."
            ],
            "content":"<div class=\"\"><div> <span>While Etna considers making Flonne into something else, she needs to think of a way to make the liquefied fallen angel into a more, or rather, less malleable forming, seeing that she has virtually no consistency at this point.<br>\r\n<br>\r\n\"Hum...on one hand, cooling you down might do the trick, but on the other hand, you might not stay that way at room temperature, so maybe heat would be a better option...\" Etna says to Flonne as she continues to gently stir her.</span></div></div>",
            "created":1287291600,
            "id":976606,
            "title":"Solidifying Plans"
        },
        "11411211":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Cool her down gently.",
                "Cool her down quickly."
            ],
            "content":"<div class=\"\"><div> <span>Etna figures that to get the most control over what she can make Flonne into she would need to be cooled down. She does notice that Flonne is significantly more heated than the temperature of the room, so she might be less fluid once she gets around there. However, she doesn't really want to wait that long, either. \"Alright, Flonne, let's see if we can bring your temperature down enough to make you less fluid and more gooey~\" says Etna as she pulls her tail out of Flonne.<br>\r\n<br>\r\n\"W-wait, won't I end up freezing solid if you cool me down too much, Miss Etna?\" asks Flonne, worried that Etna might overdo it.<br>\r\n<br>\r\nBut Etna just shakes her head. \"Don't worry, I wouldn't want that to happen...or do I? We'll just have to wait and see~\"</span></div></div>",
            "created":1287291600,
            "id":976614,
            "title":"Chilling Out"
        },
        "114112112":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Make her gelatin-like",
                "Make her into a giant ice cube"
            ],
            "content":"<div class=\"\"><div> <span>\"Miss Etna, I don't think I really mind being this fluid, so maybe we don't have to worry about it?\" says Flonne in an attempt to try to get out of whatever crazy thing Etna has on her mind.<br>\r\n<br>\r\nEtna smirks at Flonne. \"Oh, but what fun would that be? Once you chill out, you'll be fine, trust me~\"<br>\r\n<br>\r\nWith that, they leave the bedroom and Etna begins looking around for a container to put Flonne in. Etna explains to Flonne that she's looking for something that will make her into an interesting shape when she solidifies. What she doesn't tell Flonne is that she hasn't made up her mind how much she intends to solidify her, and that she's looking for an appropriate container for either stage.</span></div></div>",
            "created":1287291600,
            "id":976631,
            "title":"Further Solidifying a Plan"
        },
        "1141121121":{
            "author_id":"oddpersona",
            "author_name":"OddPersona",
            "choices":[
                "Flonne is able to form a body, making her a gelatin slime girl.",
                "Flonne is stuck as a jiggling gelatin dessert, and is looking pretty tasty."
            ],
            "content":"<div class=\"\"><div> <span>Upon approaching the kitchen Etna's eyes catch sight of something lying abandon on one of the counters. <i>'Well what do we have here?</i> The red hair demon saunters up to it to get a better look.<br>\r\n<br>\r\nThe item itself was just a mold used for desserts, a ring mold to be more precise. Made out of simple plastic and showing hardly any signs of having been used before. Nothing remarkable really...except being juuust big enough to look like it can hold the entirety of Flonne's liquid form. The observation gives Etna an idea and a grin to grace her face.<br>\r\n<br>\r\n\"Um Miss Etna,\" The poor melted fallen angel bubbles out from her bucket, \"Your face is scary. What's going on?\"<br>\r\n<br>\r\n\"Oh don't worry your pretty little head Flonne.\" The Beauty Queen/Demon Lord answers with a smile, \"I think I have an idea that might help the both of us.\"<br>\r\n<br>\r\n\"Okay.\" Flonne returns in a shaky tone of voice, \"I trust you know what you're doing.\"<br>\r\n<br>\r\nSatisfied, Etna makes her way to one of the kitchen's stoves and places the bucket on top of its ranges. With a snap of the wrist she twists a knob and the stove comes alive burning a fire right underneath the bucket. \"Now Flonne,\" Etna calls out as she peeks her head over the bucket's top to look at its occupant, \"I need to go grab some things, just wait right there and I'll be right back.\"<br>\r\n<br>\r\n\"I'm sure I can do that at least Miss Etna,\" Flonne bubbles out, \"Hey is it hot in here or is it just me?\"<br>\r\n<br>\r\n\"It's not you, just all part of the plan.\" The red head responds before disappearing behind the bucket's walls leaving the liquid fallen angel alone with her thoughts and the growing feeling of something burning up beneath her.<br>\r\n<br>\r\n<i>'Oh wow it's sure getting hot over here.'</i> The ditzy blonde thinks to herself as she feels the warmth quickly spread all over her. In truth the burning sensation was high, too high really to be bearable. Flonne compares the heat to the multiple times Etna decides to play \"William Tell\" with her only Fire spells instead of a bow and arrow, fire spells that always seem to miss their mark and end up cremating her. With the head coursing through her liquid state Flonne would have been screaming \"I'm on fire!\" over and over but for some odd reason the goo girl can't help but feel giddy. She can feel boiling, bubbles rising through her melted body to the surface to pop on her \"face\". Her entire being wobbles as physics gives her a heat treated massage. It was hard for the fallen angel to keep herself from 'melting' into a haze of pleasure. It didn't take long for Flonne come to the conclusion that Etna was boiling her, but it was so hard to separate herself from the pleasant feeling coursing all around her.<br>\r\n<br>\r\nThe eventual sight of Etna's devious face and smile is a welcome sign, at least Flonne was able to distract herself from her treatment. \"So how you holding out there.\"<br>\r\n<br>\r\nIf the fallen angel was capable she would have given a lazy smile, \"Ju-u-u-u-us-s-st f-i-i-i-i-i-n-n-ne.\" The blonde's pleasure-filled voice was distorted by the bubbles boiling to the surface.<br>\r\n<br>\r\n\"That's good to hear.\" Etna's sly voice would have raised from red flags to the melted girl but the latter was so lost in her mind that she didn't pay much mind as the former whips out three pouches of powder and a whisk. With widening grin, Etna rips the pouches open and pour the contents into the bucket and into Flonne as well before whisking the contents together.<br>\r\n<br>\r\nFlonne can barely process whatever sensations going through her head as she was stirred around and around. She can vaguely recall the scent of cherries, lemons, and vanilla permeating the air, that whatever stuff Etna put in her had some sort of solidifying effect as she can feel her liquid body slowly begin to lose viscosity as the whisk starts slowing down by resistance, all of it didn't matter as the fallen angel just lets her mind melt at the proverbial spa treatment she was receiving. \"Oh the feels nice Miss Etna.\" Flonne tries to speak coherently but all that came out were mumbles out of the goo she is.<br>\r\n<br>\r\nEtna herself smiles at her work. The sweet smiles invading her senses made the demon's mouth water in anticipation as she feels Flonne reaches just the right level of consistency. After several minutes of stirring Etna cuts the heat, takes the bucket, and pours its contents into the plastic mold, making extra sure to have each and every drop is in.<br>\r\n<br>\r\nFlonne herself can't help but feel a rush of ecstasy? euphoria? happiness? as she feels herself slide out of the heated confines of the bucket into a cool surface and begins to pool with a hold in the \"middle\" of her. <i>'Oh my, I can hardly even think straight now.</i> The goo girl thinks to herself, unable to even bring herself to talk. <i>'Miss Etna must try this out.</i><br>\r\n<br>\r\nUnknowing of her compatriot's feelings Etna only smiles as the last drop falls into the mold filling it up to the very top. The filling a mixture of red, yellow, and vanilla all marbled together in a messy pattern. Satisfied, Etna gingerly takes the mold and places it (and Flonne) inside the refrigerator. \"Now we just have to cool you off for several hours and see if what happens okay? Later!\" Shutting the door Etna walks off to kill some time, leaving Flonne alone for a while.<br>\r\n<br>\r\nThe fallen angel herself can't help but notice that it just gotten dark.<br>\r\n<br>\r\n<u><b>*Cue Time Skip*</b></u><br>\r\n<br>\r\nEtna was bored.<br>\r\n<br>\r\nBored. Bored. Bored.<br>\r\n<br>\r\n\"Crap, I'm bored!\" Etna shouts out from her throne of Prinnies as she watches some Netherworld sports program involving pitting Wood Golems against Gargoyles in a game of rugby (with a flailing Prinny as the ball).<br>\r\n<br>\r\nSuffice to say Demon Lord Etna was bored.<br>\r\n<br>\r\n\"I wonder where that love nut went off to, I haven't seen for her days.\" Etna sighs to herself as she gets (okay more like punted her throne of Prinnies away) off her chair and makes her way to the kitchen to grab a snack. \"Just when I decide to play William Tell with her she disappears off the face of the Netherworld. I can't tell if she actually found some self preservation or got lost on one of her love quests.\"<br>\r\n<br>\r\n<i>'That little brat Laharl better not taken my dessert again!'</i> The red head thinks to herself as she opens the fridge door...<br>\r\n<br>\r\n...and sees a mold of shivering gelatin making muffle cries.<br>\r\n<br>\r\n<i>'Well, I knew I forgot about something.'</i> Etna berates herself as she takes the mold out and flips it onto a nearby plate. She pulls it out to reveal a beautiful gelatin dessert of mixed colors across its surface, and a familiar pair of teary red eyes looking at her.<br>\r\n<br>\r\n\"Miss Etna, you've finally remember about me!\" Surprising Flonne was able to retain her speech despite having no mouth. \"It was so cold, cramp, and dark in there, it was scary!\"<br>\r\n<br>\r\nEtna at least had the decency to scratch her cheek in embarrassing at her callousness, \"Uh, yeah, my bad.\" Etna that notice that Flonne had some level of movement, \"So Flonne, you able to do something with yourself, like make a body or something?\"<br>\r\n<br>\r\n\"I don't know, maybe.\" The gelatin returns, \"I was in there for so long I actually felt myself harden.\"<br>\r\n<br>\r\n\"Again, my bad.\"<br>\r\n<br>\r\nWith a glare (more like the equivalent of a eye pout) Flonne looks at the still humanoid demon across her. \"At first I thought I should let you go through the same thing considering how good it felt, but now I want you to go through the same thing I did Miss Etna!\"<br>\r\n<br>\r\n\"I don't know if I should be surprise at your revenge plot or that you actually have a vengeful bone in your body.\" Etna deadpans.<br>\r\n<br>\r\n\"I wish I do have my bones and body.\"<br>\r\n<br>\r\n\"Touche, and again, my bad.\"<br>\r\n<br>\r\nFlonne glares (eye pouts) even further before going back to struggling to do with her gelatin form. She could...maybe...just a little chance, be able to make some sort of form to give her some level of mobility. However it was an up hill battle, she didn't know how long she's been cooling inside that mold, she might be stuck as a dessert. For the fallen angel, the thought of being a sentient dessert in front a sweet tooth demon like Etna was not a comforting thought in the slightest.<br>\r\n<br>\r\nAfter a few minutes of concentration Etna sees that...<br>\r\n<br>\r\n</span></div></div>",
            "created":1390425960,
            "id":1731560,
            "title":"Flonne Brand Gelatin"
        },
        "1141121122":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "She jumps off the box as Flonne reaches the top.",
                "She falls into the box."
            ],
            "content":"<div class=\"\"><div> <span>Eventually, Etna finds what she's looking for: A  plastic box that's about as tall as Flonne would usually be and is equally as long on each side. \"Oh, this will do nicely!\" says Etna, before she pours Flonne into the box. Flonne yelps as she sloshes around in the container, filling it up about a quarter of the way.<br>\r\n<br>\r\n\"Can you at least tell me what you have in mind, Miss Etna?\" asks Flonne soon after she becomes mostly still.<br>\r\n<br>\r\nEtna hops up and holds onto the side of the box, and peeks over the edge to take a look at Flonne. \"Heheh, don't worry too much about it, Flonne, you'll know what's going on soon enough~\" She then hops down and starts to roll the box over to where the dimensional transporter is. She's asked where she'll be going, but she says she'll set the destination herself as to keep where she's planning on taking Flonne a surprise.<br>\r\n<br>\r\nThe first hint as to where they are is a sudden coldness, made more intense due to her not having much in the way of insulation besides the box she's sloshing about in. \"Ah...it's so cold...\" says Flonne, as she starts to recognize the sky. It then comes back to her, of course she knows where this is, this is the Frozen River area. \"Ah! This is where I first joined up with you!\"<br>\r\n<br>\r\nEtna smiles. \"Nice, you remember! Heheh, think of this as an unofficial anniversary, Flonne~. Plus...I didn't want to go somewhere <b>too</b> cold, since I want you to fill up as much of this container as possible before you start to freeze.\"<br>\r\n<br>\r\n\"Ah...f-freeze? And...huh! It does seem like I'm a little higher in the container than I was before, how's this even happening, Miss Etna?\" asks Flonne, her curiosity rising.<br>\r\n<br>\r\n\"Well, to make it simple, fluid things like to expand as they're about to freeze or boil, and you're getting closer to the first one.\" Etna explains, as she takes a peek over the edge to see how Flonne is doing. She notes that Flonne is up to the halfway point of the container. \"Looks like you're getting there, Flonne!\"<br>\r\n<br>\r\nAs this progresses, Flonne feels herself getting colder. \"Brrr...every last drop of me feels so icy cold...and it actually feels really nice...especially when it comes in a wave. In fact...I feel o- \" she says, being suddenly interrupted by a sudden cold wave going through her, which causes Flonne to shiver intensely. \"M-m-m-m-m-m-m-mmmmm! Hehehe, just like that!\" Flonne says, giggling a little as her body still wobbles from shivering.<br>\r\n<br>\r\nEtna grins as she sits on the edge of the box, looking Flonne over. \"Heh, it won't be long until you're a nice big ice cube, then.\" says Etna, as her tail is close enough to dip it into Flonne's icy body. Suddenly...</span></div></div>",
            "created":1287291600,
            "id":976651,
            "title":"Back To Where It Began"
        },
        "11411211222":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "The rest of her sinks into Flonne's body.",
                "She gets strtetched out."
            ],
            "content":"<div class=\"\"><div> <span>Etna tries to jump off the box to be able to get Flonne completely freezes, but she loses her balance and suddenly starts to fall into the box. At this point, Flonne's body is rather viscous, so instead of making a splash, she hits Flonne's surface with a loud plop and sinks into Flonne's frozen body up to her chest.<br>\r\n<br>\r\n\"Oh no, Miss Etna! Are you alright?!\" exclaims Flonne, concerned that what's good for her might not be so good for Etna.<br>\r\n<br>\r\nEtna nods, and tries to hold her arms out to keep aloft. She's not sure how deep she'll end up sinking, and at the moment she doesn't really want to find out. Etna feels like Flonne's body is trying to swallow her, since it's trying to push down on Etna's more dense body.<br>\r\n<br>\r\nSoon, Etna's arms start to falter. \"G-geez...this cold is making my arms weak. I can't hold on any longer!\"  she says, as she's forced to relax her arms. This causes Etna to sink further in, up to only her head and hands. She can't even move the rest of her body, which still feels like it's being pushed on by Flonne's body. After struggling for a little, the feeling of being pressed downward starts to be a pleasant one for her, almost relaxing, in fact, and after all her struggling she certain feels like relaxing, even if it means she ends up completely submerged in Flonne's body.<br>\r\n<br>\r\n\"Heh...I'm getting exhausted, Flonne, so I think I'll just sink right in and get comfortable~\" says Etna. Flonne offers no objections as Etna stops struggling entirely. The moment she does...</span></div></div>",
            "created":1287291600,
            "id":976670,
            "title":"She falls into the box."
        },
        "114112112222":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Stretch her head out as well.",
                "Make her as thin as thread."
            ],
            "content":"<div class=\"\"><div> <span>As Etna relaxes, she feels every part of her that has sunken into Flonne are getting tugged on even more, while her hands and head still stick out of the surface. She feels like she's being consistently tugged on with enough force to cause her body to stretch out. Flonne is able to feel it too in the form of her body having more contact with Etna.<br>\r\n<br>\r\n\"Oooh...this feels nice, it certainly beats completely sinking in~\" says Etna. She then feels her feet touch the bottom of the container. And then, she feels a new sensation, that of her feet starting to spread across the bottom of the container. \"W-whoa! Geez, it feels like my feet are getting really wide and flat!\"<br>\r\n<br>\r\nFlonne giggles. \"It feels like more of you is in contact with me, Miss Etna! It's not a problem, is it?\"<br>\r\n<br>\r\nEtna grins, as her stretched out feet continue to get pressed between Flonne and the bottom of the container. \"Heh, I was just surprised, that's all, this actually feels pretty awesome~\" she says, as her feet spread out all along the bottom of the box. Her arms have also been stretching the entire time, but not straight to the bottom, causing them to get stretched out a lot more on their way to the bottom. As her legs start to become the next part of her to be squashed along the bottom, Etna's arms start to feel like they're floating upward. Etna sees something stringy start to surface, and realizes quickly that it's her arms, stretched out so thinly that they're just barely thicker than thread. She gets her fingers around a part of her arms that has flowed close to them and rolls it between them.<br>\r\n<br>\r\nShe shivers in delight as she feels her wire-thin arm twist as if it was made of rubber. \"Ahhh...amazing~. I hope a lot more of me gets stretched out like this. Heh, I'm sure you'll be able to handle that, Flonne~\" she says, as she feels her arms continue to stretch out even more.<br>\r\n<br>\r\nThis makes Flonne giggle. \"Alright! I'll see what I can do, Miss Etna!\" she gleefully exclaims. While her control over her body is limited, it's enough to be able to move Etna's body around so that it doesn't stretch straight down.<br>\r\n<br>\r\n\"Ooooh...heh, you really know how to move me, Flonne~\" says Etna in a flirty way. Flonne giggles, and continues to move Etna's body around. As Etna's body from her legs to her neck start to get thinner, Flonne starts simply bumping the more dense parts that are floating back down upward.<br>\r\n<br>\r\nEtna becomes especially excited when she starts to see more than just her continually stretching arms begin to stay at the surface. Not long after that starts happening, more of Etna's body starts to rapidly float up to the surface on it's own. As Etna's body forms into a loose mesh along Flonne's surface, both girls seem to be pleased with how this is going. Etna in particular feels great, as she feels like her body stretches for miles.<br>\r\n<br>\r\n\"Ahhhhh...now this is more like it! Everything but my head and feet are all stretched out~.\" says Etna, as her head gently bobs in the middle of Flonne's body.<br>\r\n<br>\r\nFlonne then starts to get an idea. \"You know, Miss Etna, I think I might be able to stretch you out even more!\" she exclaims gleefully.<br>\r\n<br>\r\nEtna smirks. \"Oooh, well, by all means, go ahead~\"</span></div></div>",
            "created":1287354300,
            "id":976745,
            "title":"Stretched Thin"
        },
        "1141121122221":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Make Miss Etna completely wire thin from head ot toe.",
                "Leave her feet be."
            ],
            "content":"<div class=\"\"><div> <span>Etna feels Flonne tug on her head a bit, which causes a bit of it to sink under the surface. Immediately she feels the part of her head that went under starts to stretch out like the rest of her body. \"Oooh...so you're going to stretch out everything but my feet, then? Mmm...I love the way you think, Flonne~\"<br>\r\n<br>\r\nFlonne giggles as she keeps gently pulling Etna's head under. \"I knew you would, Miss Etna, after all, it's all that's left to stretch out!\"<br>\r\n<br>\r\nAs Etna hears this, she smirks a bit. \"Well, almost everything. There are these flat feet of mine, but you'd probably be left with a lot less of me rubbing up next to you, but I think they would end up stretching out nice and long too~\" suggests Etna.<br>\r\n<br>\r\nFlonne takes a moment to think about if she'd really want to do that.</span></div></div>",
            "created":1287355560,
            "id":976761,
            "title":"Stretch her head out as well."
        },
        "11411211222211":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Flonne can do it on her own.",
                "Flonne needs Etna's help."
            ],
            "content":"<div class=\"\"><div> <span>Flonne giggles. \"If including your feet is what you want, Miss Etna, I'll be more than happy to do so!\" she says, as she starts to pull the part of Etna's body that's connected to her feet as well. Etna's eyes light up as she sees and feels a lot more of her made as thin as string. Seeing this, she relaxes and shuts her eyes as that part of her head gets pulled under. Before long, every last bit of Etna's head has been stretched out, and now Flonne is focusing on stretching out her feet, which thanks to the earlier flattening are getting stretched longer than even her legs.<br>\r\n<br>\r\nIt takes a while with her feet, but after a while Flonne has completely stretched Etna out into a very long string. \"And there we go, Miss Etna, you are now a string girl!\" Flonne exclaims as Etna floats atop her.<br>\r\n<br>\r\n\"Mmmm...this feels wonderful, Flonne~, thanks for doing this for me.\" says Etna, her body wriggling with delight. \"I'm really liking this form~\"<br>\r\n<br>\r\nSomething then comes to Flonne's mind. \"Ah, Miss Etna, speaking of forms, I seem to have a lot of control over my body now. Do you think I might have enough control to mold myself into something?\"<br>\r\n<br>\r\nThis seems to catch Etna's interest. \"Hum...maybe...and even if you can't, maybe once I start to get used to this form I'll be able to do the molding for you.\" Etna says.<br>\r\n<br>\r\nOf course, for the first order of business, Flonne had to get them out of the box. She manages to get the box to rock back and forth enough for Flonne to be freed from the box. She plops out of the box looking like a cube, and for the most part stays that way for now. \"Brr...I was getting so cozy in the box that I forgot how cold it was.\"<br>\r\n<br>\r\nEtna chuckles. \"Mmm, I'm still nice and cozy, though~\" she says.<br>\r\n<br>\r\n\"Hehe, anyway, let's see if I can do this.\" says Flonne, as she prepares to try to change her shape.</span></div></div>",
            "created":1287358920,
            "id":976790,
            "title":"Etna the Living String"
        },
        "11413":{
            "choices":[
                "Etna ties her up and waits for her to wake up",
                "Etna uses another spell"
            ],
            "content":"<div class=\"\"><div> <span>Etna then says to Flonne. \"Well you see I was just joking before, I really just wanna test a spell and need help.\" Flonne just says. \"Um ok what did you need?\" Etna whispers back \"A subject.\" After a second or two of chanting green energy flows from her hand hitting Flonne in the face. \"Well I don't feel so good, did it work.\" Etna purrs \"But it worked just fine, you're just gonna fall asleep.\"<br>\r\n<br>\r\nSo what does Etna do with Flonne?</span></div></div>",
            "created":1317010140,
            "id":1195123,
            "title":"Helpless lil' angel"
        },
        "14":{
            "author_id":"shadowprophet",
            "author_name":"Stumblesmagoo",
            "choices":[
                "...the ancient library.  Maybe there's some cool things in there.\"",
                "...the arcade room.  Maybe we can find some fun games.\"",
                "...the towers.  Who knows what's up there? We hardly ever go there.\"",
                "...Laharl's bedroom.  Maybe we can find a secret of his or two? ;)\"",
                "...yeah, I dunno. *sweatdrops*  Do you know any places, Miss Etna?\""
            ],
            "content":"<div class=\"\"><div> <span>           Flonne suddenly shot up, her eyes ablaze with inspiration. \"I know! How about we both explore around the castle some?\"<br>\r\n<br>\r\n          Etna looked at the fallen angel as if she had just suggested the two of them joining the Prism Rangers.  \"...uh, Flonne, why the heck would we want to do that?  In case you've forgotten, we <b>LIVE</b> here - In fact, I've been living here longer than <i>you</i> have.\"<br>\r\n<br>\r\n           Flonne responded, \"Exactly.  We live in a CASTLE!  There's bound to be some cool places hidden here, right?\"  She clenched her fists together in excitement. \"Just think of all the amazing things that could be here!\"<br>\r\n<br>\r\n           Etna countered, \"Not really.  As I've said before, I've been living here longer than you have, and I haven't seen anything even remotely interesting in my time here.\"<br>\r\nFlonne turned to her demoness friend and asked, \"Have you even <i>looked?</i>\", surprisingly skeptical, especially for her.<br>\r\nEtna defensively replied, \"Yes!  Of course I have, who wouldn't?\"<br>\r\n\"......really?\"<br>\r\nEtna paused for a moment.......then she sighed, defeated. \"....no....\"<br>\r\n\"Then wouldn't it be fun to go explore?\", Flonne asked. <br>\r\nEtna sighed again. \"Sure, why not?\"<br>\r\n<br>\r\n           Flonne suddenly hugged Etna, then let go just as quickly.  \"<b>YAAAAAAY!!!!</b> We're gonna explore a CASTLE!!!!\"<br>\r\nEtna lazily asked, \"So where are we going then, Einstein?  Or have you even thought of a place where to begin?\"<br>\r\nNow it was Flonne's turn to be defensive. \"Of course I have!  Why wouldn't I have?  After all, I suggested it, didn't I?\"<br>\r\n <br>\r\n\"Well, then where do ya wanna explore?\", Etna replied.<br>\r\n<br>\r\nFlonne answered, \" Well, I was thinking about going to.....<br>\r\n</span></div></div>",
            "created":1244782800,
            "id":707291,
            "title":"Exploring Overlord Laharl's castle. (...uh-oh....)"
        },
        "142":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Arcade",
                "Theater",
                "None-Of-The-Above"
            ],
            "content":"<div class=\"\"><div> <span>Etna blinks for a moment. \"Wait, what? Arcade room? Why would we even have something like that here?\" asks Etna, wondering if Flonne is more high on life than she usually is.<br>\r\n<br>\r\nFlonne giggles. \"Well yeah, of course we do! I wouldn't have suggested something that doesn't exist!\"<br>\r\n<br>\r\n\"Knowing you, Flonne, you'd probably suggest something that's only in that airy little head of yours.\" says Etna. \"But, I'll bite, let's go see this 'Arcade room', then.\"<br>\r\n<br>\r\nIgnoring the insult, Flonne giggles with enthusiasm. \"Now then, we need to actually find it! I know I saw it, I just forgot where...\"<br>\r\n<br>\r\nEtna can't help but facepalm at this. \"Oh well, we've got nothing better to do anyway, let's get moving, then.\" With that, the two girls wander around in search of something that may or may not be a figment of Flonne's active imagination.<br>\r\n<br>\r\nEventually, the girls find a light source that's brighter than what is normal for the castle. \"Ah, those lights look like the lights used for the arcade! This must be it!\" Flonne says, as she runs ahead of Etna. Etna runs after Flonne in order to prevent Flonne from absentmindedly trigger what might be a trap for all they know.<br>\r\n<br>\r\nEtna looks over the entrance while Flonne eyes light up from all the pretty lights. \"So, you've been inside, right? I mean, I'm sure you wouldn't think this place is an arcade just from the entrance, but I just want to make sure.\"<br>\r\n<br>\r\nThis seems to frustrate Flonne just a little. \"Come on, Miss Etna, give me some credit! I know things besides arcades use pretty lighting like this! Like theaters, and...\"<br>\r\n<br>\r\nEtna interrupts. \"...and Arcades and elaborate traps, right?\"<br>\r\n<br>\r\n\"Exactly!\" says Flonne. \"And all of those things could be fun, but I'm sure this is an arcade! Or...maybe it's an arcade that's an elaborate trap...or a theater that's an arcade, or even a theater arcade that's an elaborate trap?\"<br>\r\n<br>\r\nEtna shrugs, knowing Flonne's moments away from running in anyway. \"Well, what are we waiting for, then? That trap's not going to trigger itself.\"</span></div></div>",
            "created":1287032400,
            "id":974941,
            "title":"Those Options are All Traps, Unless They Are Not"
        },
        "1421":{
            "author_id":"oddpersona",
            "author_name":"OddPersona",
            "choices":[
                "A Whack-A-Prinny game",
                "A Zero Gravity room",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Upon investigating the lights the two were greeted with the sight of a grand room filled to the brim with arcade games and other gimmicks.<br>\r\n<br>\r\nEtna quirks an eyebrow, \"Well I'll give you this you space case, at least you're right about the arcade trap thing.\"<br>\r\n<br>\r\nFlonne however was already taken in by the arcade's bright lights and game sounds to even here her demon friends compliment.<br>\r\n<br>\r\n\"Welcome to Nethercade.\" A polite voice comes from next to Etna, shocking the demon girl to almost out of her skin.<br>\r\n<br>\r\n\"Woah what the?\" Etna turns to find, to much of her surprise, a maid standing next to her with a warm smile on her face. Shaking out of her shock Etna gives the maid a questioning look, \"Who are you, what are you doing here, and what the heck is this place?\"<br>\r\n<br>\r\nThe maid only giggles before bowing a bit, \"Forgive my manners, my name is Igasa. I am a maid task in the management of the Nethercade.\"<br>\r\n<br>\r\n\"Okay I see...I think.\" Etna responds before looking at the arcade, \"So the Nethercade right? How is it that I've never heard of it?\"<br>\r\n<br>\r\nThe maid's face soon turns pale, yet she still retains her smile, \"Nobody actually comes to the arcade anymore.\"<br>\r\n<br>\r\nThe demoness backs away a bit from the aura of gloom radiating off the maid, \"Right, sorry I ask. So you don't mind me checking this place out a bit?\"<br>\r\n<br>\r\nIgasa's face soon regains its color before the maid shakes her head no, \"I do not mind at all. Arcades were meant for enjoyment.\" She points, \"Why don't you ask your friend?\"<br>\r\n<br>\r\nEtna turns around in the direction Igasa was pointing to find Flonne playing what looks like a fighting game.<br>\r\n<br>\r\nEtna sighs a bit, \"How that ditz lived this far is a miracle beyond words. Thanks Igasa.\" She soon proceeds on over to the arcade.<br>\r\n<br>\r\nIgasa bows a bit, \"Please, do enjoy yourselves.\" The smile on her face soon turns slightly devious. \"Please do.\"<br>\r\n<br>\r\n\"AND WAH-CHA!\" Flonne shouts as delivers a twenty five hit combo to deplete her opponent's health guage down to zero.<br>\r\n<br>\r\n\"You look like you're having fun Flonne.\" Etna says as she joins up with her friend.<br>\r\n<br>\r\nFlonne turns towards the red hair with stars in her eyes, \"THIS PLACE IS SO AMAZING, WE'VE GOT TO CHECK OUT EVERYTHING!\"<br>\r\n<br>\r\nEtna giggles a bit to herself, \"All right slow down you air head, now let's see what's good around here?\" Looking around Etna tries to find any game of interest. Her gaze soon focuses on...</span></div></div>",
            "created":1291439160,
            "id":1007881,
            "title":"Welcome to the Nethercade"
        },
        "1423":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "Airhead?",
                "Bubbly?",
                "Love-Freak?"
            ],
            "content":"<div class=\"\"><div> <span>Flonne and Etna enter whatever the place is and are greeted by a bright light out of nowhere. When the light dies down, the two of them do not seem to be where they were just a minute ago. Their location looks nothing like where they just were, nor does it look like an Arcade or a Theater, or anything remotely recreational.<br>\r\n<br>\r\n\"Ah...this isn't an arcade at all!\" exclaims Flonne.<br>\r\n<br>\r\nEtna sweatdrops. \"Yeah, it was in the first paragraph, Flonne, but fourth wall smashing aside, we need to find out where this is.\"<br>\r\n<br>\r\n\"I...can't see anything at all, really. It looks so gray and bleak...it really could use some flowers, and a whole lot of other plants, too!\" she says, as a picturesque meadow comes to her mind.<br>\r\n<br>\r\nEtna laughs. \"It's always flowers with you, huh?\" Etna says, moments before a tree pops up under her. She shouts as the tree tosses her in the air and she lands ungracefully on a mushroom that conveniently appeared moments before she lands. She looks around to see the picturesque meadow Flonne was picturing. \"Flonne, how long have you been able to do this?\" asks Etna.<br>\r\n<br>\r\nFlonne apparently still has meadow on the brain and nowhere else. \"Do what?\" Flonne says, then notices the beautiful countryside she created in her mind. \"Oh! Much better!\" she says gleefully.<br>\r\n<br>\r\n\"Yeah, I guess you wouldn't be surprised by a forest out of nowhere.\" snarks Etna.<br>\r\n<br>\r\nFlonne shakes her head. \"Oh no, I'm very surprised, but it's a good surprise!\" exclaims Flonne. \"I wonder if this place grants your heart's desire? That would be so cool!\"<br>\r\n<br>\r\nEtna shrugs. \"If it's really something like that, we'd probably be doing something more interesting than getting tossed around by a tree out of nowhere.\"<br>\r\n<br>\r\n\"Yeah, it could be very specific about what can be done, or even who can change things around? Maybe you're just not picturing it well enough?\" Flonne speculates.<br>\r\n<br>\r\n\"Picturing it, huh...hum...\" she says, thinking of some way to play on one of her traits.</span></div></div>",
            "created":1287032400,
            "id":974969,
            "title":"Wishes Do Come True"
        },
        "14232":{
            "author_id":"nelsonj",
            "author_name":"NelsonJ",
            "choices":[
                "A bubble?",
                "Bubble gum?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><i>\"Hum...she's always so carefree and bubbly...now what can I do with that...\"</i> Etna thinks, as Flonne's attention is currently on a colorful butterfly that decided to wander by.</span></div></span></div>",
            "created":1287032400,
            "id":974970,
            "title":"Bubbly?"
        },
        "144":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "Etna and Flonne find something perverted in Laharl's bedroom...",
                "Etna and Flonne find Jennifer in Laharl's bedroom..."
            ],
            "content":"<div class=\"\"><div> <span>\"I think we should peek around in Laharl's room!\" Flonne chirped.<br>\r\n<br>\r\n\"Oooh~! How <i>evil</i>!\" Etna grinned.<br>\r\n<br>\r\nFlonne gasped. \"AH! Y-you're right...\" tears started to well up in her eyes. \"WAAA~AAH!\" she wept, \"I don't wanna be evil!\"<br>\r\n<br>\r\nSMACK! Etna slapped the fallen angel on the back of the head. \"Get a hold of yourself, sheesh! What do you think you are, an <i>angel</i>?\"<br>\r\n<br>\r\nFlonne sniffled. \"... y-yes...?\" she said uncertainly.<br>\r\n<br>\r\n\"LIKE, WRONG-O!\" Etna smacked Flonne a second time. \"Now let's get going, already, Li'l Miss Flower Girl. After all, who <i>knows</i> what kind of naughty stuff we might find in the prince's room?\" Etna insisted.<br>\r\n<br>\r\nFlonne perked up. \"Oh my goodness, you're right!\" she exclaimed, \"We must make sure that Laharl isn't getting his innocent young mind corrupted!\"<br>\r\n<br>\r\n\"...innocent...?\" Etna sighed. \"I guess once a love freak, always a love freak,\" she shrugged before following after her exuberant senior.</span></div></div>",
            "created":1281762000,
            "id":935888,
            "title":"Morals, Schmorals"
        },
        "145":{
            "author_id":"jaden117",
            "author_name":"J117",
            "choices":[
                "Separated.",
                "Somewhere down the hall.",
                "More places."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uncertain of where to go, the 2 demons begin walking around the large castle and find themselves in a hallway?</span></div></span></div>",
            "created":1295166720,
            "id":1036309,
            "title":"A hallway? Maybe?"
        },
        "1451":{
            "author_id":"jaden117",
            "author_name":"J117",
            "choices":[
                "Follow Etna.",
                "Follow Flonne.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Etna: Whatever, lets just start walking, who knows, maybe we'll find something interesting that way.<br>\r\nFlonne: Alright! And thats a very positive way of thinking! I'm sure we will find something to help us pass the time!<br>\r\nEtna, with an annoyed look, \"......yeah.....\".<br>\r\n<br>\r\nThey are walking for over 10 minutes and find themselves in some random hallway.<br>\r\n<br>\r\nFlonne: Where are we?<br>\r\nEtna: I have no idea. Even I've never been here.<br>\r\nFlonne: This place is bigger than I thought!<br>\r\n<br>\r\nA few more steps down the creepy hall and Flonne triggers a trap on the floor. They watch as the stone sinks into the floor, then look at each other. Flonne smiles, and says, \"heh....oops\".<br>\r\n<br>\r\nThe floor suddenly opens up beneath Etna and she falls into the pit, but not before saying, \"Flonne you idiot!\".<br>\r\n<br>\r\nWith the 2 of them now separated, what happens?</span></div></div>",
            "created":1295167260,
            "id":1036313,
            "title":"Separated."
        },
        "14511":{
            "author_id":"jaden117",
            "author_name":"J117",
            "choices":[
                "Try something.",
                "Something happens."
            ],
            "content":"<div class=\"\"><div> <span>Etna ends up falling onto a slide, as she continues down the dark tunnel, twisting and turning here and there, she has no idea where it was taking her. It spits her out into some room, in the air, and she falls and lands on her ass.<br>\r\n<br>\r\n\"Ow!\", she says, getting to her feet, with 1 hand on her butt, \"Now where am I?\".<br>\r\n<br>\r\nA sweet smell suddenly surrounds her, she gets a better look around and finds herself in the kitchen of what looks like a bakery. There are all kinds of baked goods, from pies, to breads, to cookies, and so much more, as well as prinnies with chef hats running here and there.<br>\r\n<br>\r\nEtna: Why did it take me here?<br>\r\n<br>\r\nShe starts to look around the kitchen.....</span></div></div>",
            "created":1295167680,
            "id":1036318,
            "title":"Follow Etna."
        },
        "1452":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "The Teddy Bear Door (FAB)",
                "The Circle Door (Blueberry Expansion)",
                "The Catgirl Door"
            ],
            "content":"<div class=\"\"><div> <span>Ugh, what's with this castle!?!\" Etna yells, getting frustrated by the predicament she and Flonne were in. <br>\r\n<br>\r\nHowever, Flonne tried to calm down Etna's spontaneous temper tantrum as she said, \"Etna, please calm down. It's not exactly that bad.\" Even though Flonne calmed her down, Etna was still blowing out some fumes.<br>\r\n<br>\r\nTrying to have a good time with Etna, the fallen angel Flonne then noticed 3 large doors ahead of them and asked, \"Any chance we can see what's behind those doors, Etna?\" \"Oh sure, get us even more lost by going through one of those doors!\" Etna sarcastically replied, as Flonne grabbed Etna's hand and dragged the young succubus with her toward the 3 doors.<br>\r\n<br>\r\nChoice I: A large pink door in the shape of a teddy bear<br>\r\n<br>\r\nChoice II: A large blue door in the shape of a circle<br>\r\n<br>\r\nChoice III: A large door in the shape of a catgirl</span></div></div>",
            "created":1371665640,
            "id":1613673,
            "title":"Numerous Doors"
        },
        "14521":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Enta & Flonne split up to investigate the strange place",
                "Etna and Flonne stay together for their own safety"
            ],
            "content":"<div class=\"\"><div> <span>When Etna and Flonne opened the Teddy Bear Door, they were in a completely different area of the castle. <br>\r\n<br>\r\nThe entire area had a bright and babyish feel to it, as it was completely different from the rest of the castle. The walls were a baby pink and the ceilings were white, as there were multiple rooms inside this large house-like area that both Etna and Flonne have entered.<br>\r\n<br>\r\nEtna looked around and was disgusted by the location she and Flonne were at, as she let her tongue in disgust and said, \"BLEH! What kind of demon would have a place like this?\" \"I don't know, Etna. I think this place is sooo cute!\" Flonne replied, as she seemed to thought their new environment was cute.<br>\r\n<br>\r\nAlthough Flonne thought the place she &amp; Etna were in was really cute, but Etna had a bad feeling about what was going on.</span></div></div>",
            "created":1371738720,
            "id":1614174,
            "title":"The Teddy Bear Door (FAB)"
        },
        "15":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "\"Sumo Realm\"",
                "\"Wonka Factory\"",
                "\"Beach\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hey, miss Etna. I got an idea.\" said Flonne to Etna as she snap her finger.<br>\r\n<br>\r\nThen Etna ask to Flonne \"What was it, Flonne?\"<br>\r\n<br>\r\nThen Flonne answer to Etna \"We can go to the realm call......\"</span></div></span></div>",
            "created":1355325660,
            "id":1486708,
            "title":"Go somewhere else."
        }
    },
    "info":{
        "author_id":"nelsonj",
        "author_name":"NelsonJ",
        "brief_description":"What happens when a couple of demon girls get bored? Pretty much anything, really.",
        "created":1187056920,
        "description":"<td align=\"left\" class=\"norm\">Another one of my almost-anything-can-happen interactives, this time featuring the main girls of the first Disgaea game, Etna and Flonne. This takes place after the second game, so pretty much anything can go. Feel free to throw in other characters from the NIS Multiverse as well, or possibly even characters from other universes entirely, though try to at least keep Etna and Flonne as the main characters in this story. Pretty much anything goes, except most male transformation, though I will accept a few exceptions if I don't mind the character being altered.<br>\r\n<br>\r\nFeel free to break the 4th wall, too. It happens in the games, especially Makai Kingdom and Disgaea 2.</td>",
        "id":1305146,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1390425960,
        "modified":1390425960,
        "pretty_title":"Etna and Flonne's Misadventures"
    }
}