{
    "chapters":{
        "1":{
            "author_id":"45powerman",
            "author_name":"45Powerman",
            "choices":[
                "Princess Bubblegum, with Peppermint Butler no less! ",
                "A certain radical dame who likes to play games",
                "Flambo",
                "Lumpy Space Princess",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Morning had come once again, as the early morning light of the rising sun shone throughout the Land of Ooo. The sky looked almost as if it were straight out of a painting, with remarkable shades of orange and blue filling up.  From the various kingdoms that made up the despotic monarchy (save for the Fire Kingdom), to the villages and cities, the sun would waste no time with greeting everyone. That included a certain tree fort, as the sunlight beamed through the window and straight into the bedroom of Jake the dog and his adopted kid brother (as well as his best bud), Finn the human. <br>\r\n<br>\r\nFinn's face scrunched up a bit, as he felt the rays greet his young sleeping face. Still, he nonetheless yawned, smacking his lips softly as he opened his eyes. Since Jake was still fast asleep in his drawer (er, bed..), he guessed that he had woken up a bit earlier than usual, probably around 6:20. Upon maneuvering himself out of his sleeping bag, the human teen stretched his arms out and up to the ceiling, proceeding to slide himself off the bed and get his feet onto the wooden floor.<br>\r\n<br>\r\nThis caused the seat of his red footie pajamas to ride up a bit, which was promptly fixed by reaching a hand to the back flap and plucking it out of his crack. Finn decided to watch the sunrise a bit, as he climbed up to the boat on the very top of the tree fort. As it was usually used as a look-out-view, this naturally gave him a great view of the sunrise, even as he was climbing up the steps. As he got into the boat it didn't take long for him to notice something walking towards the tree fort. <br>\r\n<br>\r\nHe immediately took the telescope and used it to see who it was, only to find, to his surprise, that it was..</span></div></div>",
            "created":1487988660,
            "id":2281890,
            "title":"Intro"
        },
        "12":{
            "author_id":"wedgielordess",
            "author_name":"WedgieLordess",
            "choices":[
                "Marceline wastes no time, and starts playing with the boy.",
                "Marceline wants to ask him a few questions.",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>Zooming in, besides seeing the dark grey skin of the subject, he noticed that her hand was currently flipping him off. <br>\r\n<br>\r\n\"Oh, well. She's good at identifying herself.\" <br>\r\n<br>\r\nIndeed, it was the vampire babe herself, Marceline. The cocky vampress was holding a hand on her hip, cocked out at an angle. Her midriff was bare underneath her high-riding tee, and her skinny jeans captured her tall, lanky bod.<br>\r\n<br>\r\nPulling her flipped finger down to her side, she popped it in her pocket before blowing the tip like a smoking gun, nodding toward the teen boy up in the treehouse. He waved back enthusiastically, keeping this up for several moments before he saw her hold a hand up to her mouth, as he leaned forward to listen. <br>\r\n<br>\r\n\"LET ME IN, YOU NUMB NOD!\"<br>\r\n<br>\r\nMildly frustrated, the vampire hipster tapped her foot and played with the exposed string of her thong, as the teen boy quickly dashed down his stores, and out his door.</span></div></div>",
            "created":1488907260,
            "id":2286147,
            "title":"A certain radical dame who likes to play games"
        },
        "123":{
            "author_id":"fricker50533",
            "author_name":"Fricker",
            "choices":[
                "Marcy wants to bring Finn and Jake with her somewhere",
                "Another unexpected visitor arrives",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1488915780,
            "id":2286186,
            "title":"Something else "
        },
        "15":{
            "author_id":"thegreatdragon",
            "author_name":"Greatdragon",
            "choices":[
                "His 'flamin' hot' ex, Flame Princess",
                "A human girl who was dressed exactly like him",
                "The giant Susan Strong",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Finn's eyes widened in surprise, he couldn't believe his eyes. He stopped looking through the telescope and rubbed his eyes so he could be sure it was who he thought it was. Upon looking through the telescope again, he confirmed it.<br>\r\n<br>\r\nIt was indeed...</span></div></div>",
            "created":1488719940,
            "id":2285265,
            "title":"Someone else"
        }
    },
    "info":{
        "author_id":"45powerman",
        "author_name":"45Powerman",
        "brief_description":"WEDGIE TIME",
        "created":1487984280,
        "description":"<td align=\"left\" class=\"norm\">So yeah.. <br>\r\n<br>\r\nUnlike my first attempt at making a wedgie based Adventure Time, this will be a bit more linear, with an actual story. <br>\r\n<br>\r\nBasically, this is about Finn the Human, various characters, and the amount of wedgies he gets throughout the Land of Ooo .. Duh..<br>\r\n--<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1.) <b>NO PLAGIRISM</b><br>\r\n<br>\r\n2.) Female characters are allowed to give.<br>\r\n<br>\r\n3.) Make sure the characters are KEPT IN CHARACTER. <br>\r\n<br>\r\n4) When writing the dialogue, character interactions, etc, try your best to capture the spirit of the show.  That includes the humor!<br>\r\n<br>\r\n5.) Proper grammar, spelling, spacing, paragraph indentation, use of quotation marks, and so on... All of these are important, I do NOT want to claw my eyes out because of illegible or incoherent additions that looked Iike someone wrote it with their butt-cheeks slamming on the keyboard. <br>\r\n<br>\r\n6.) Please, be descriptive as possible. But not to the point where it disrupts the flow of the story. <br>\r\n<br>\r\n7.) I don't want one sentence chapters.. Please at least write 3-5 full paragraphs minimum.<br>\r\n<br>\r\n8.) Be creative. <br>\r\n--<br>\r\n<br>\r\nOn a side note, if anyone is unfamiliar with the show itself, you may use the Adventure Time wiki and/or watch the show (I reccomend using Kisscartoon, as it has almost all of the seasons and episodes on there for free).  </td>",
        "id":2113297,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1540341960,
        "modified":1540341960,
        "pretty_title":"What Time Is It?"
    }
}