{
    "chapters":{
        "1":{
            "author_id":"dawn2",
            "author_name":"sunsun",
            "choices":[
                "Mary Jane Watson",
                "Yuri Watanabe",
                "Silver Sable",
                "Black Cat",
                "Screwball???"
            ],
            "content":"<div class=\"\"><div> <span>Before you choose a lovely lady, let's go over the rundown. <br>\r\n<br>\r\nBasically the premise is simple, you pick one of the ladies and then pick the scenario. Simple. However, what we're really doing here is writing are <i>What If?</i> scenario. This is an old Marvel concept where events happen differently than they do in the main story. <br>\r\n<br>\r\nFor example: <br>\r\n<br>\r\nLet's say you want Spider-Man to fatten up Black Cat. Well, do to the story, he'd have to break up with MJ, right? Wrong. You can make it so that Peter and MJ just never got back together again. Or maybe they already broke up. <br>\r\n<br>\r\nBasically, you are free to warp the universe/story of PS4 Spider-Man to fit whatever you want to write. <br>\r\n<br>\r\nWith that out of the way, what woman are we focusing on?</span></div></div>",
            "created":1553228580,
            "id":2633200,
            "title":"The Setup"
        },
        "11":{
            "author_id":"dawn2",
            "author_name":"sunsun",
            "choices":[
                "Peter's become an good cook.",
                "The Big Scoop",
                "More Scenarios",
                "More Options",
                "More Prompts"
            ],
            "content":"<div class=\"\"><div> <span>So why is MJ getting fat? <br>\r\n<br>\r\nPeter's become a crazy good cook- Basically, ol' Pete somehow found the time to get really good at cooking and has been making MJ breakfast, lunch and dinner. She just can't get enough! <br>\r\n<br>\r\nThe Big Scoop- MJ starts investigating some kind of cult who have been kidnapping women around the city. She ends up a little over her head when they capture her.</span></div></div>",
            "created":1553228880,
            "id":2633202,
            "title":"Mary Jane Watson"
        },
        "111":{
            "author_id":"shadowfox83",
            "author_name":"Fox",
            "choices":[
                "MJ's put on ten pounds",
                "MJ's let herself go and put on fifteen pounds",
                "Holy Marvel! MJ's put on an astounding twenty pounds"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Pete, question?\"<br>\r\n<br>\r\n\"Yeah?\" Peter Parker responded to Mary Jane Watson while he was busy cleaning up in her kitchen.<br>\r\n<br>\r\n\"You think I've been putting on.\"<br>\r\n<br>\r\n\"Putting on what, news scoop after scoop heck yeah MJ you're awesome at it.\"<br>\r\n<br>\r\n\"No you silly man. I mean weight, tiger. Be honest.\"<br>\r\n<br>\r\nHe didn't need his Spider-Sense to warn him to catch the plate from falling right out of hands but Peter like an respectable man knew a woman's weight was often a touchy subject, one that MJ rarely brought up but if have been on her mind for a while now for her to just bring it up like that.<br>\r\n<br>\r\n\"MJ you're fine. Look I know we've been eating in a lot since I found a knack at cooking but honestly you're fine your figure is still as solid as ever.\"<br>\r\n<br>\r\nMJ trusted Peter to be honest with her and while a part of her felt like he was just being kind for sake her not getting angry with him Mary Jane took solace in the fact that Peter believed she wasn't gaining any sort of weight.<br>\r\n<br>\r\n\"Hey tiger how about some desert then?\"<br>\r\n<br>\r\n\"Coming right up, red!\"<br>\r\n<br>\r\nTwo weeks later Peter had left the apartment early, Spider-Cop having to do a few morning patrols MJ pointing out to loose the persona before speaking with Yuri Watanabe Pete pointing out that she came around MJ rebutting that she just as quickly came unaround. The two sharing a laugh together before he was on his way and MJ started to change from her sleeping attire to something more casual.<br>\r\n<br>\r\n\"What the? I don't remember these pants being this tight before. Shoot Pete and I were in a hurry at the wash the other day maybe I screwed up and got them shrunk.\"<br>\r\n<br>\r\nMJ continued to struggle to properly line and close up her jeans.<br>\r\n<br>\r\n\"I mean he won't mind the tightness in my pants but I sure will.\"<br>\r\n<br>\r\nThe redhead muttered to herself as she continued fight with her jeans unaware that the reason she was struggling in the first place was because she had in fact put on some weight.</span></div></div>",
            "created":1553232720,
            "id":2633212,
            "title":"Peter's become an good cook."
        },
        "1113":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Soon enough, Peter goes and brings out dessert",
                "Seeing how stuffed MJ is, Peter waits a little to give her dessert",
                "Skip to next day. Is MJ starting to run into problems?",
                "A month later, MJ is really starting to balloon. Is Peter worried?",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>After MJ had finished putting her clothes on, albeit with a struggle, she had went to do her typical work time at The Daily Bugle. In her lunch break she went and got herself some food at a local cafe and buffet restaurant, having gotten in Peter’s cooking a rather larger appetite, her belly bulging out more than desirable for one like her and yet one good thing was that it was not exposed at least yet.. After MJ’s work day, she called Peter and they agreed for a special dinner together at her place where they were living at together. On her way out to head back to work she got some rather unusually extra large bags of snacks of typical cafe types, like cookies, cupcakes, muffins, chocolates etc. When she got back, she then got herself with a far briefer struggle into her pajama clothing and placed herself on her couch more tiredly than normal, especially after how it was that her clothes were getting a little more tighter with her jeans a little more snug. Since Peter was not yet back, she decided to have a personal appetizer feast for herself.<br>\r\n<br>\r\nShe started with her muffins, which consisted of chocolatey kinds etc., then got to some chocolate bars which consisted of ones without and with nuts but starting with the latter of those and saving the former kinds for last, and as she ate those, she grunted in pleasure of how tasty that they were. Then she headed for her other such delicious snacks besides the described ones like cream-filled pastries among chocolatey kinds etc., brownies, from regular chocolatey brownies to ones with vanilla and chocolate icing sandwiched between them. Soon MJ’s pajama attire, as stretchy as it was, even itself was becoming slightly snug from the pants part of it with her shirt as a little tighter, especially as her belly was bulging more and more.<br>\r\n<br>\r\nAfter MJ finished those, she then went for her chocolatey muffins and cupcakes with the latter of those consisting of all manner of styles of chocolatey flavored kinds including ones with vanilla and with chocolate icing covering all those, and eventually went for saving for last her cookies from icing covered cinnamon ones, to ones with vanilla sandwiched between them and peanut butter and chocolate chip and all other such sweet kinds of chocolatey and peanut butter type with the chocolate chip types saved for last. As MJ ended up eating those and saving them for last, considering how large the amounts of them she got were, she decided to have the remaining amounts of those mixed in with some large bowl with large scoops of all chocolatey and vanilla type flavors she had in her freezer with some chocolate syrup and some milk to wash it all down with, and she grunted in pleasure at the tastes in her mouth that she felt, ignoring how snug her PJ Pants were getting and how tight her PJ Shirt was getting on her. “So good.” Mumbled MJ.<br>\r\n<br>\r\nAs MJ had those snacks she watched some educational documentary show channel to pass up all that time. Finally MJ had finished those and yet despite how much she had eaten, was only feeling partly full from how much she had eaten by having eaten all of those goods, and was looking forward to the food feast that she and Peter were planning, and yet as she was disposing of those bags into the trash can, she did so rather slowly and did the same with her bowls and then went to have the rest of her cookies that were chocolate chip kinds that were not with any ice cream for last as there were still more left. Seating MJ’s own self back down on her couch, she then went and finished those off and after disposing of those somehow with some still good talent at doing such things in such styles throwing them into her trash can, she then began quite absent-mindedly rubbing her particularly round belly that had now caused her shirt to just become rather skin tight, her eyes closed with her smile rather dreamy from the pleasure of these foods.<br>\r\n<br>\r\nFinally Peter got back, and changed from his “The Spidey” outfit into some sleeping attire.<br>\r\n<br>\r\nMJ saw him come in and pulled him in to kiss his lips and both his cheeks. Then Peter went to cook up what he said he would, the types of foods he was good at cooking as always, including with additional kinds and with additional recipes to it, including of Indian food and Italian food types, and set up a lot of those, only one serving of which he had for himself and gave the rest for MJ to eat, all with MJ sitting on their couch whilst eating.<br>\r\n<br>\r\n“Oh Peter,” she giggled, “you are <i>really</i> <i>starting</i> <i>to</i> <i>be</i> <i>spoiling</i> <i>me</i>.”<br>\r\n<br>\r\nSimply Peter had shrugged. “Well MJ, you are my girlfriend. What I am supposed to be expected of over that is what exactly?” And MJ had giggled at this.<br>\r\n<br>\r\n“O-O-O-O-Oh My Sweet Peter.” Said MJ, giggling from feeling quite giddy from how much food she would get to eat up. And MJ did eat it up, and groaned in pleasure at how delicious it all was.<br>\r\n<br>\r\nSoon MJ surprisingly did eat it all up and was now starting to feel really full from it all, but as Peter was taking the dishes to be put in their dishwasher, MJ soon had soon just noticed what had resulted from it all, as she saw her particularly round belly that she thus began to be quite rather-semi-absentmindedly-soothingly rubbing had now pushed up her PJ Shirt.<br>\r\n<br>\r\n“Seriously My Sleep Shirt?” Mumbled MJ. She leaned back as she rubbed her belly.</span></div></div>",
            "created":1581014820,
            "id":2783342,
            "title":"“Twenty Pounds?”"
        },
        "11131":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Ms. MJ is stuffed/let Peter feed and/or stuff her.",
                "Skip to The Next Day/Free Choice."
            ],
            "content":"<div class=\"\"><div> <span>Although MJ <i>did</i> <i>not</i> <i>either</i> <i>notice</i> <i>nor</i> <i>care</i> <i>much</i> <i>about</i> <i>it</i> <i>all/i}, the so quite unconscious stroking of <i>did</i> <i>not</i> escape the notice of her sweet boyfriend Peter <i>and</i> <i>nor</i> <i>so</i> <i>here</i> <i>for</i> <i>that</i> <i>matter</i> <i>yet</i> ever did the quite so engorged form of Miss MJ’s round belly. Not that Peter cared about it, yet still he noticed it, yet he would not comment on it either, being the so ever gentleman like one he was and still at these points is one known to be, yet still so all of the same had what he brought on in still thus got MJ’s attention, prompting her to snap her head in attention, and then <i>really</i> <i>struggle</i> <i>to</i> <i>refrain</i> <i>from</i> <i>drooling</i>.<br>\r\n<br>\r\nHere Peter had brought tons of banquets of feasts of dessert foods for her all to eat up, some of which were like what she got on her way home from amongst all of the likes of muffins, cupcakes, cakes among small pound and even typical quite large cakes including ones she did not get which in turn included ones among the quite so really very extra large kinds all cut into slices and ice-cream-mixed-in-with-cakes cut into slices and all other such desserts from strawberry flavoured up to tons of more or vanilla flavoured up to several tons and several tons of lots more of quite so far beyond incredibly absolutely so delicious amazingly chocolaty flavoured kinds and even all of those among cookies of which were along with all of the other hand hold snack dessert foods yet with all the cookies themselves were most so very especially there tons of enough to have separate and mixed whilst all on in alike whilst with and tons of ice cream in a few large bowls both separately and for mixture all so on in alike. Some of those in tons had Peter bought and the rest of the tons had he baked himself but set up as a surprise - in part because today yet had his so ever dear sweet amazing brave girlfriend had been from within The Daily Bugle Company been promoted to a part in her chief editor position above her initial one wherein upon her return from Symkaria all so purely truly very surprisingly really safely in one piece all thanks to some help from Silver Sablinova Also To Know As Silver Sable - during which had they and as well as Peter - whilst as “The Spiderman” of course exposed and had then brought to True Justice none so else other whilst than Norman Osborn who had at all such points been turned thus into “The Pure Green Goblin” but after some utter commotion stopped and then incarcerated whilst with Harry Osborne freed and cured and a mysterious black goe like parasitic “alien rooted” living organism known as “A Symbiote” put into some other laboratory for research - thus so would she not have to do things as a photographer and/or reporter would have to but instead be in a managing position for such ones at the place itself - whether there or at home - and so Miss MJ chose a balance in between both - and when she confirmed this to Peter did he say they ought to celebrate - but upon the sight of this which he brought to her did he decide without her knowing it to be for them to celebrate - her having feasts of food to eat and tons of such stuff at it yet on seeing it thus did MJ’s jaw drop as she had struggled to refrain from drooling.<br>\r\n<br>\r\nMs. MJ had then squeed in delight at all of this so quite indeed very adorably at least if one were to ask her sweet boyfriend Peter, and she had thus clapped her two and somehow yet here truly very mildly chubby hands together in her delight all whilst very adorably if one were to ask her boyfriend perhaps so at least. Almost like she had not eaten in even a few days - even after a few weeks after her return alongside all else that has been described as ever taking place - which is whenever all of this here takes place after - and she turned her head to look at her boyfriend Peter with her hands placed together, as he brought it all and placed it on the large coffee table whilst set in front of her.<br>\r\n<br>\r\n“Oh-Peter, you-are-just-so-awesomely-absolutely-incredibly-very-so-amazing!” Squealed MJ in all out of her excitement. Then MJ had heaved herself all on up and squeezed her sweet boyfriend Peter in a quite so tight bearhug with her albeit yet very truly really mildly yet still equally chubby arms around his neck, and so then quite very passionately going for both his cheeks to have done so on there and then pressing her own against his lips to have absolutely incredibly truly very equally really passionately kissed him, a groan all so coming during the cheeks parts and more of one on that lips kiss as she did that.<br>\r\n<br>\r\nAnd Peter, a little bit hardened because of his genuine and truest of romantic love for her that was and is reciprocated whilst by her and even if because of that all alone, still had wrapped as much of his muscular and far more fitting and strong and muscular bodied body arms around as much as he could of all so from thus around her waist, very equally deepening their kiss so especially very so on their lips and a few moments later as they released each other she then sat back down and proceeded to “dig in” or so to say, using a spoon Peter also brought for her ice cream portions including so whilst in all her ice-cream-cake-foods, and she absolutely incredibly very clearly quite indeed did not even need to be told by Peter even so either of once or even twice to dig in very especially before her ice cream parts had melted and so she did “dig in all those” and then her ice cream bowls with which all very separately to eat and then she did then eat up the ones to mix in with all of what to mix it all in with and saving the cookies for last, including from among the large ice cream bowls ones with strawberry and hazel brown made and vanilla and lots of most so very especially very chocolaty syrups and saving all the ones with that third said stuff for last too. As she ate them all whilst very speedily, all so most here incredibly especially what with however so great her appetite was all so here becoming very increasingly quite massive etc and Peter sat as much of beside her as he could so, with she herself as paying very truly absolutely incredibly no heed whatsoever to her so ever here overindulged stomach turning into a so here very really spectacularly particularly all yet so quite very massively so bloated, distended, round and swollen big fat belly, not that either of them cared about it all here, just so long as ever so very truly absolutely increasingly to MJ as long as she could eat and Peter as long as he could even as so much as even so try whilst to ever even please her even if up to the point of proceeding on to “spoil her also put in as to spoil his girlfriend”.</i></span></div></div>",
            "created":1600027380,
            "id":2902416,
            "title":"Soon enough, Peter goes and brings out dessert...."
        },
        "111312":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Direction Choice Option I.",
                "Direction Choice Option II."
            ],
            "content":"<div class=\"\"><div> <span>Which Choices here will it be?<br>\r\n<br>\r\nDirection Choice Option I: - Firstly MJ eats up a huge majority of it, after which MJ eats the next ton of all these banquets of desserts, and then when she requests for Peter to feed her all remaining desserts despite how “so stuffed” she is feeling like from out of how massive her appetite is, immediately then is it all seen to by Peter all of the so whole while all whilst that suddenly, he right then and there up and stuffs MJ right to and then beyond right to the very brim, in which case he gently soothingly sweetly rubs MJ’s belly, after which either MJ sleeps on their couch or bed.<br>\r\n<br>\r\nDirection Choice Option II.) Miss MJ eats all said desserts throughout the rest of the night via a mixture of Peter feeding MJ, MJ feeding herself as he rubs her belly, Peter feeding MJ again whilst she rubs her belly, MJ feeding herself with one of and rubbing her belly with her other hand and Peter throughout it all feeding her with one of and using his other hand to be rubbing her belly and in either one of those cases does MJ fall asleep whether on their couch or bed.</span></div></div>",
            "created":1589432400,
            "id":2835674,
            "title":"Which Choices ...?"
        },
        "11133":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Choice I",
                "Choice II"
            ],
            "content":"<div class=\"\"><div> <span>Which Choice Option List will it be for Miss MJ?<br>\r\n<br>\r\nChoice Option List I: - Then Peter brings very incredibly large desserts made and purchased by him for her to eat, only for him to then proceed to spoil through proceeding to feed them to her.<br>\r\n<br>\r\n?<br>\r\n<br>\r\nOr Everyone, perhaps so: -<br>\r\n<br>\r\nChoice II: Later Peter brings very incredibly large desserts made and purchased by him for her to eat, only for him to then proceed to spoil through proceeding to feed them to her.<br>\r\n<br>\r\n?</span></div></div>",
            "created":1584507600,
            "id":2803281,
            "title":"Which One our of all these will it be for Miss MJ?"
        },
        "111331":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Then Peter brings & feeds or up & beyond stuffs Mary Jane right to the brim.",
                "Then Peter brings & feeds and Miss MJ feeds herself as he rubs her belly."
            ],
            "content":"<div class=\"\"><div> <span>Choice Offer Option I: - Then Peter brings very incredibly large desserts made and purchased by him for her to eat, only for him to then proceed to spoil through proceeding to feed them to her, or else all but up and thus so and then far beyond even that is it that he stuffs Mary Jane right to the brim.<br>\r\n<br>\r\n?<br>\r\n<br>\r\nOr Folks, perhaps so: -<br>\r\n<br>\r\nChoice Offer Option II: Then Peter brings very incredibly large desserts made and purchased by him for her to eat, only for him to then proceed to spoil through proceeding to feed them to her, or elsejust so simply he sees to it whilst that she eats all of them through a mix of him feeding them all to her and her feeding them to herself all whilst as he ensures to have rubbed her belly.<br>\r\n<br>\r\n?</span></div></div>",
            "created":1584507600,
            "id":2803284,
            "title":"Which Offered Choice Options just so here might it"
        },
        "111332":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Later Peter brings & feeds or up & beyond stuffs Mary Jane right to the brim.",
                "Later Peter brings & feeds and Miss MJ feeds herself as he rubs her belly."
            ],
            "content":"<div class=\"\"><div> <span>Choice Offer Option I: - Later Peter brings very incredibly large desserts made and purchased by him for her to eat, only for him to then proceed to spoil through proceeding to feed them to her, or else all but up and thus so and then far beyond even that is it that he stuffs Mary Jane right to the brim.<br>\r\n<br>\r\n?<br>\r\n<br>\r\nOr Folks, perhaps so: -<br>\r\n<br>\r\nChoice Offer Option II: Later Peter brings very incredibly large desserts made and purchased by him for her to eat, only for him to then proceed to spoil through proceeding to feed them to her, or elsejust so simply he sees to it whilst that she eats all of them through a mix of him feeding them all to her and her feeding them to herself all whilst as he ensures to have rubbed her belly.<br>\r\n<br>\r\n?<br>\r\n</span></div></div>",
            "created":1589000400,
            "id":2833016,
            "title":"Which Offered Choice Options over here?"
        },
        "113":{
            "author_id":"yeetman1",
            "author_name":"yeeterman ",
            "choices":[
                "Depression Gaining",
                "Jiggly Jealousy",
                "Oscorp’s Indulgent Incident"
            ],
            "content":"<div class=\"\"><div> <span>How about these scenarios instead?<br>\r\n<br>\r\n1. After her and Peter break up, MJ comfort eats, but does she take it to far? <br>\r\n<br>\r\n2. Seeing Peter swinging around with a fatter Black Cat inspires MJ to put on a few pounds herself. <br>\r\n<br>\r\n3. An accident in an Oscorp lab gives MJ some new powers, and some extra weight on top of them. </span></div></div>",
            "created":1604978400,
            "id":2937561,
            "title":"More Scenarios"
        },
        "12":{
            "author_id":"dawn2",
            "author_name":"sunsun",
            "choices":[
                "Maggia Stopped",
                "Exposure",
                "More Scenarios",
                "More Options",
                "More Prompts"
            ],
            "content":"<div class=\"\"><div> <span>So how will Yuri become large and in charge?<br>\r\n<br>\r\nMaggia Stopped- In the games, things with the Maggia and Hammerhead got out of control. However, Spider-Man and Yuri are able to stop Hammerhead from getting away and keep him behind bars. With the city cleaning itself up, crime at a low and her personal nemesis gone for good, Yuri actually starts to relax...<br>\r\n<br>\r\nExposure- During a drug raid, Yuri gets dosed with some strange experimental drug. Weighty problems abound as it starts spreading through her system.<br>\r\n</span></div></div>",
            "created":1553229180,
            "id":2633203,
            "title":"Yuri Watanabe"
        },
        "121":{
            "author_id":"psuedophobic",
            "author_name":"Bobo the Hobo",
            "choices":[
                "pretty chubby—she'd gone and gotten a good starter gut!",
                "kinda fat—Yuri's officially a chunky desk squasher!",
                "really big—she's let herself go to seed, and everyone knows it!"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><u><b>HAMMERHEAD BEHIND BARS</b></u></div><br>\r\n<br>\r\nYuri wasn't a big fan of the Daily Bugle, even after old Brush Head started up his weird Alex Jones-esque podcast. But she'd bought up every copy she could find after that fateful showdown between Spider-man, Silver Sable, and that monster. One for her mother, one for her office, and one for her scrapbook. Plus a couple of extras, just in case. You can never be too careful when you're unofficial allies with one of the most <i>destructive</i> saviors that New York had to offer.<br>\r\n<br>\r\nWas there a part of her that wishes that she could have done it? Absolutely. Just looking at his smug face, the camera flash catching against the steel plate on his disfigured face, made her seethe from the inside. But what he became towards the end there, thanks to Project Olympus... there was no way she could have taken him down. <br>\r\n<br>\r\nAll that metal, he wasn't even human anymore. Spider-man, radioactive spider-bite and all, had to have a PMC-grade jet to fire a laser at his skull <i>multiple times</i> while dodging rockets, getting shot at, and dealing with that pint-sized ball buster Sablinova. Yuri would have never made it that far. Hell, she would have never made it even close. He probably would have just headbutted her and taken her out then and there. It was a grim fact to accept, but... Yuri's hatred for the Maggia had to take a backseat to making sure monsters like Hammerhead were put behind bars.<br>\r\n<br>\r\n\"Or behind glass, in this case.\" she said with a small smile, touching the glass and leaving small streaks from the grease on her fingertips.<br>\r\n<br>\r\nThe Maggia were finished—or at least close enough as could be. Most of the smaller thugs had been absorbed into the power vacuum that Fisk's presence had brought in, trading their three-piece suits and gold chains for hoodies and less distinctive outerwear. All of the SableTech was slowly being routed back to Symkaria to help with the rebellion, which meant that the City that Never Sleeps was finally put to bed, as it were.<br>\r\n<br>\r\nThere was still work to be done, of course. Shootouts, robberies, the <i>occasional</i> super villain attack. But what was she going to do about that? Her precinct pulled its weight and Spider-man took care of most of what fell through the cracks. The Avengers, Doctor Strange, and even Daredevil had been making appearances in town again, so almost everywhere <i>else</i> was fine too. Not like she'd ever transfer out of Chinatown, but the opportunity would have been nice. Now that the Maggia were done for, <i>really</i> done for... what else was there for Captain Yuri Watanabe to do?<br>\r\n<br>\r\nThat rage, that purpose that had driven her throughout her career, what had defined her as a police officer was just... gone.<br>\r\n<br>\r\nThat being said, as a certain Friendly Neighborhood Spider-man had once said, \"Nothing fills an existential hole like Eddie's Pizza\"<br>\r\n<br>\r\nAnd damn if he wasn't right. <br>\r\n<br>\r\nShe'd started ordering from there pretty regularly. They really did have the best pies in town; she could see why the Webhead wouldn't shut up about it. A few slices became more, then a few more, until the delivery guys started to learn her by name. \"The Captain Watanabe Special\" had undergone quite a few changes since she'd started getting her fix there on the regular...<br>\r\n<br>\r\n\"Oof...\" Yuri grunted to herself as she nestled back into her office chair, \"Gotta remember to wipe down before I start handling those case files after lunch.\"<br>\r\n<br>\r\nShe raised the greasy, cheesy, triangle to her mouth and bit eagerly into it. Sauce dribbled from the corners of her lips, down onto her red-and-black button up.<br>\r\n<br>\r\n\"Mmm...\" she said in a hungry voice, \"I love this city.\"<br>\r\n<br>\r\nEveryone around the precinct knew that the Captain had let herself go. The only question was... how fat was Yuri these days?</span></div></div>",
            "created":1553567940,
            "id":2634923,
            "title":"Power Vacuum"
        },
        "1213":{
            "author_id":"psuedophobic",
            "author_name":"Bobo the Hobo",
            "choices":[
                "Yuri gets a visit from the Web Head... Pizza Time!",
                "There's a break-in at an old Olympus Warehouse... Yuri wants in!",
                "Just in time for the Police Physical Exam. Yuri flunks SO hard."
            ],
            "content":"<div class=\"\"><div> <span>Captain Watanabe had officially let herself go—and then some.<br>\r\n<br>\r\nOnce toned and athletic, the peak physique of a policeman <i>just</i> teetering towards the edge of taking the law into her own hands had become buried under an avalanche of pizza, booze, donuts, and wallowing in self-pity. Without her grudge against the maggia, Yuri was left with a hole the size of Staten Island to fill inside of her, and she'd been doing a great job of trying to clog it with enough grease to squeeze her through the cells in Lockup.<br>\r\n<br>\r\n\"Dammit, my shirt...\" Yuri's double chin creased in distaste as she surveyed the damage, \"I just got this dry-cleaned.\"<br>\r\n<br>\r\nShe knew full well what a dollop of Eddie's sauce could do to a girl's wardrobe. She needed to get it out before it stained.<br>\r\n<br>\r\nMaking sure no one was watching, Yuri closed the blinds and began to undress.<br>\r\n<br>\r\nHer thick fingers fumbling with the buttons on her ill-fitting top, Yuri made small grunts of exertion as she struggled to get them going. Once she'd unbuttoned, the corpulent captain began wriggling in her office chair, her incredible amounts of belly fat wobbling as she struggled. Her pale gut hung down between her legs, settling comfortably on her pillowy thighs as she was forced to untuck it from her pants. Her fat arms caught in the sleeves slightly—they jiggled in exertion as she shimmied them out awkwardly.<br>\r\n<br>\r\nDamn, her \"emergency\" shirt was all the way across her office...<br>\r\n<br>\r\nBolstering herself, Yuri gripped either of her armrests. The poor chair shook with strain as she pushed off from the seat, doughy cheeks following behind her. The poor woman was mostly belly; no unrealistic body proportions for <i>this</i> unlucky New Yorker. Not like that damn Black Cat. What she wouldn't do for a chest like that... hell, a <i>body</i> like that. She might have even considered giving up pizza for good, if it weren't so tasty.<br>\r\n<br>\r\nYuri's plush body jiggled with her every step, belly bouncing beneath her bra as it hung freely in the open air. Reaching into her cabinet, past a few forgotten (and empty) boxes of Pop Tarts, Yuri found her own \"Alternate Costume\"...<br>\r\n<br>\r\n\"If the Web-Head can change his outfit, then why not me?\" Yuri curled a flat nostril in distaste as she pulled the cobalt blue tarp over her head, over her chest, and past her belly...<br>\r\n<br>\r\n<i>and past her belly</i>...<br>\r\n<br>\r\n\"Dammit!\" she tugged at the hem of her shirt, which failed to cover that last stubborn roll of belly blubber, \"I can't believe I've got to go up another size...\"<br>\r\n<br>\r\nCaptain Yuri \"What a Whale\" Watanabe—reporting for duty.<br>\r\n<br>\r\nRight after lunch.</span></div></div>",
            "created":1553572200,
            "id":2634941,
            "title":"Yuri \"What a Whale\" Watanabe!"
        },
        "14":{
            "author_id":"dawn2",
            "author_name":"sunsun",
            "choices":[
                "Love through the Stomach",
                "Motherhood",
                "Fat Cat Treatment",
                "More Scenarios",
                "More Prompts"
            ],
            "content":"<div class=\"\"><div> <span>So why would the sultry thief become a real fat cat? <br>\r\n<br>\r\nLove through the Stomach- Black Cat really misses being with her Spider and wants to win him back over. She then remembers hacking into his laptop when they were together and seeing that he didn't mind a larger woman. She never told him that she did that and he never showed that he knew. She never thought such a thing would come in handy. Until now... <br>\r\n<br>\r\nMotherhood- Felicia wasn't actually lying that she had a son. Now that she's faked her death and has more money than she'd ever know what to do with, she retires to give her child a good life. It just so happens that it takes a toll on her waistline. <br>\r\n<br>\r\nFat Cat Treatment- Instead of trying to kill her, Hammerhead captures Felicia and gets...creative. He decides that he'll make her an example of those who cross him and that there are worse things than death.    </span></div></div>",
            "created":1553574900,
            "id":2634956,
            "title":"Black Cat"
        },
        "144":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "“AU Truly Actually Sincere Retirement Scenario”.",
                "“AU True Retirement Scenario” with partying, relaxing & especially eating.",
                "“AU Actual Motherhood Scenario” involving things from first two or more options."
            ],
            "content":"<div class=\"\"><div> <span>“Some AU Actually Sincere Retirement Scenario” - Felicia Hardy, after her “directly previous Spiderman Encounter”, actually does decide to “retire from a cat burglar’s life” - in part due to her own moral ambiguity and in part due to her own “inability to find out about any potential new heists of her types” - yet at such points she has already been able to not only obtain more than enough money for it to be more than even she can even try to think of what to do with it all but also more than enough money for her to be able to be “set up for life”, including all of the while whilst via through her having “a-completely-rent-free-penthouse-apartment-home” and as well as “a-completely-bill-and-tax-free-mansion-home” with both such places as in New York City Of New York, with her all of the while being able to be “as rich as any entrepreneur and philanthropist and socialite” and yet be able to be such a one all “whilst quietly”. Thus Felicia, as such, in the very many events following all this, due to the described reasons, along with “a very enormously amazingly great depression over not being able to have “her spider””, soon starts to develop “a-becoming-increasingly-very-greatly-enormously-massively-incredibly-amazingl y-insatiably-far-beyond-unbridled-and-uncontrolled-appetite” that soon starts to “take a toll on her figure”.<br>\r\n<br>\r\n“Some AU Actually Sincere Retirement Scenario in which it all is what is involving Felicia Hardy whilst after taking up then here so indeed much quite very truly sincerely comes to enjoy as part of her simple life all but a combination of partying and relaxing and most especially eating” - Felicia Hardy, after her “directly previous Spiderman Encounter”, actually does decide to “retire from a cat burglar’s life” - in part due to her own moral ambiguity and in part due to her own “inability to find out about any potential new heists of her types” - yet at such points she has already been able to not only obtain more than enough money for it to be more than even she can even try to think of what to do with it all but also more than enough money for her to be able to be “set up for life”, including all of the while whilst via through her having “a-completely-rent-free-penthouse-apartment-home” and as well as “a-completely-bill-and-tax-free-mansion-home” with both such places as in New York City Of New York, with her all of the while being able to be “as rich as any entrepreneur and philanthropist and socialite” and yet be able to be such a one all “whilst quietly”. Thus Felicia, as such, in the very many events following all this, due to the described reasons, along with “a very enormously amazingly great depression over not being able to have “her spider””, soon starts to develop “a-becoming-increasingly-very-greatly-enormously-massively-incredibly-amazingl y-insatiably-far-beyond-unbridled-and-uncontrolled-appetite” that soon starts to “take a toll on her figure”; whether in a few weeks or in a few months; along with that kind of a scenario but also with it soon leading thus so <i>perhaps</i> <i>here</i> <i>to</i> <i>a</i> <i>combination</i> <i>of</i> <i>partying</i> <i>and</i> <i>relaxing</i> <i>and</i> <i>eating</i> <i>and</i> <i>most</i> <i>especially</i> <i>relaxing</i> <i>and</i> <i>eating</i> <i>whether</i> <i>with</i> <i>or</i> <i>without</i> <i>partying</i> <i>yet</i> <i>still</i> <i>with</i> <i>lots</i> <i>and</i> <i>lots</i> <i>of</i> <i>relaxing</i> <i>and</i> <i>eating</i> <i>and</i> <i>most</i> <i>especially</i> <i>eating</i>.<br>\r\n<br>\r\n“Some AU Actually Sincere Retirement Scenario Involving Truly Actual Motherhood” - Felicia Hardy was still in actuality not lying about becoming a mother to a son yet <i>not</i> <i>only</i> is it <i>not</i> <i>with</i> “Her Spider”, yet also as such “the events involving all The Magia leaders including The Hammerhead never did at all ever happen” and furthermore, Felicia Hardy had at these points already chosen to “actually so retire from a cat burglar’s life” due to a combination of her own moral ambiguity, her own “inability to find out about any potential new heists of her types” and during these points starting from such a choice, she has successfully already obtained enough money for it to be both more than enough for it to be more money than she can even try to think of what to do with and as well as more than enough money in order for her to be able to “set up for life” including all of the while whilst via through her having “a-completely-rent-free-penthouse-apartment-home” and as well as “a-completely-bill-and-tax-free-mansion-home” with both such locations being in New York City Of New York, with her all of the while being able to be “as rich as any entrepreneur and philanthropist and socialite” and yet be able to be such a one all of the while here thus so “whilst quietly”. Thus Felicia, as such, in every single one of all events following this very “retirement choice” of her’s, <i>not</i> <i>only</i> due to the described reasons along with a very enormously amazingly great depression over not being able to have “her spider””, soon starts to develop “a-becoming-increasingly-very-greatly-enormously-massively-incredibly-amazingl y-insatiably-far-beyond-unbridled-and-uncontrolled-appetite” that soon starts to “take a toll on her figure”, whether in a few weeks or a few months; along with that kind of a scenario but also with it soon leading thus so <i>perhaps</i> <i>here</i> <i>to</i> <i>a</i> <i>combination</i> <i>of</i> <i>partying</i> <i>and</i> <i>relaxing</i> <i>and</i> <i>eating</i> <i>and</i> <i>most</i> <i>especially</i> <i>relaxing</i> <i>and</i> <i>eating</i> <i>whether</i> <i>with</i> <i>or</i> <i>without</i> <i>partying</i> <i>yet</i> <i>still</i> <i>with</i> <i>lots</i> <i>and</i> <i>lots</i> <i>of</i> <i>relaxing</i> <i>and</i> <i>eating</i> <i>and</i> <i>most</i> <i>especially</i> <i>eating</i>, all one way or another leading her to her pregnancy and her giving birth, all of the while with her appetite increasing as a side effect of her simple life leading up to, her very pregnancy itself and her pregnancy’s aftermath combined; all with this very scenario itself allowing for options that can involve watching as events occur before, events occurring whilst as Felicia Hardy goes on through her pregnancy and after her pregnancy or else feature events before and skip through and continue from after Felicia Hardy’s pregnancy onwards.<br>\r\n<br>\r\nOtherwise Folks, the third option can be an invitation to more options with more scenarios and prompts to all add as a means to offer up and/or to look at and take into some consideration.</span></div></div>",
            "created":1581799800,
            "id":2787749,
            "title":"More Scenarios"
        },
        "1443":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Scenario/Prompt Choice Option I: - “AU Actual True Motherhood”.",
                "Scenario/Prompt Choice Option II: - Like first two but c/room for third.",
                "Scenario/Prompt Choice Option III: - As 1st two but more free whatever happens."
            ],
            "content":"<div class=\"\"><div> <span>Which Options for this?<br>\r\n<br>\r\nOption I: - “Actual Motherhood Scenario With Things From First Two Options”?<br>\r\n<br>\r\nOr Folks, perhaps so: -<br>\r\n<br>\r\nOther Scenario/Prompt Option II: - Something more very primarily like the first two scenarios alongside and yet with more and more freedom enough to perhaps allow for “a pregnancy and also post-pregnancy scenario alike”?<br>\r\n<br>\r\nOther Scenario/Prompt Option III: - More like the first two whilst very primarily but most so very especially the second one a thing more and yet with more and more freedom still regardless of whatsoever happens that is acceptable by this story’s rules, whether so “with or without a pregnancy and post pregnancy scenario”.</span></div></div>",
            "created":1597039980,
            "id":2883194,
            "title":"“AU Actual Motherhood Scenario” involving t..."
        },
        "14432":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                " Felicia Hardy goes in for her incoming job interview.",
                "A Curious Felicia Hardy very finally decides to “weigh herself”."
            ],
            "content":"<div class=\"\"><div> <span>Felicia Hardy struggled to get her skintight suit on all the way. She hadn't found any truly good places to hit on top of her final encounter with The Spiderman and its aftermath yet still so and after her final moral ambiguity fueled thief activities, and thusly was sitting on a pile of priceless gems and other trinkets. So all she had really done for the past twenty four weeks that had passed since she had obtained so much money and jewels and the likes more than what to think of as to what to do with it all as at the same time so well as enough for her to be set for life which promoted for her to be able to also get a fancy apartment room place owned by her and somehow tax free etc and a huge mansion/manor too also tax free etc and remain set up for life, which could allow for her to be with money for very practically the rest of her life even so still here in consideration with how much she had even before it all, was sit on her rear and eat. For so obvious reasons, she got quite the round potbelly, which was her current problem with getting her “Black Car” outfit on. \"Come..on! Why *huff* won't you... *huff* FIT!\" Grunted Felicia as she, as if by some sort whilst of a natural gift, got the zipper over her stomach. Before she could celebrate, she hit her second roadblock, her small yet still slightly curvy breasts. Already well endowed enough, Felicia had the top of her outfit already enlarged. Given her flabbier form however, she once more struggled for a good 3 or so minutes to get it on before she finally got her outfit completely on her body.<br>\r\n<br>\r\nFinally getting her wardrobe malfunctions settled, Felicia Hardy decided to have ascended to the top of her apartment home that was one of two homes with her other as her mansion/manor yet still with both as being in New York City Of New York. Readying herself for her next target, an old gold evaluating shop just closing, she then somehow also as if with such relative ease even now very successfully getting enough gold and jewels from this place that was some unethical practice using single rich male’s personal front that had been exposed and also had been left for his money somehow being sent to her thanks to her secret involvement in his being exposed, it was on her way back that when all of a sudden, she caught whiff of the most intoxicating food she'd ever smelled. Looking around, Felicia Hardy spotted a car driving away from a local for-now-blacked-out-bakery-and-other-food-offering-all-one-can-eat-buffet-fancy- restaurant, presumably taking some of the goods to somewhere for one final delivery for today. <br>\r\n<br>\r\nThus Felicia ran across the rooftops to get herself some of those baked and perhaps other food goods. At least, if she were thin as she were two dozen weeks ago. She slowly jogged, if that, across the rooftops, abandoning them halfway and taking the fire escape down to the streets.<br>\r\n<br>\r\nAbout Fifteen Minutes Later Felicia Hardy had so finally managed to make it into the place thus itself, known as “New York City Of New York Various Forms Of And Foods Among Goods”, and then using a special remote gadget to disarm whatsoever alarm detected upon her activation of said gadget in her outfit’s arm sleeves, then had she slipped on in after lockpicking the door.<br>\r\n<br>\r\nThen The Now So Formerly Speedy Platinum Blonde Haired And Young Woman was greeted by each indeed and all of the greatest assortments of foods including of pastries that she had ever seen. With Miss Felicia Hardy herself as getting right down to work, she dug right in to a box of two dozen cupcakes, indeed savouring really every delicious bite of frosting. After that, she went after the twelve times extra large chocolate flavoured and chocolate flavoured icing covered cake in front of her. Not even bothering with a plate, forks or the like, she shoveled handful after handful of cake with one hand, the other rubbing her distended belly that was straining on the somehow still stretchable material made her still increasingly very tight fabric of her “Black Cat” outfit whilst at that.<br>\r\n<br>\r\nA Quite Literal Few Minutes Later Felicia Hardy afterwards then had sat therefore licking her fingers for whatsoever remnants left of her feast. “Oh I must say it all is so *HIC*-*HIC* soooo goooood. Now however can and will I get some more...\"<br>\r\n<br>\r\nThen Miss Felicia Hardy, as if by luck, saw some poster hanging out front. “Help Wanted”, it read, “combination of server and taste tester needed”. Therefore Felicia, in part from her depression from being also unable to ever have “Her Spider” yet still had licked her lips very eagerly with that itself also as being at the prospect of getting paid to eat this, and so with that had she grabbed a box with two dozen of cookies and two dozen muffins and two dozen cookies and two dozen cupcakes and returned to her apartment home and set up a resume and cover letter to apply whilst online before switching into some very surprisingly even good her still very really stretchable fabric made pajama shirt and pants each of black colours and ending up as having her late night sweet food snack feast, excited for the next day.</span></div></div>",
            "created":1597044420,
            "id":2883219,
            "title":"“Black Cat’s retirement begins”."
        },
        "144321":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "A few days at her other place not far from this or bakery/restaurant.",
                "Skip to her job’s first day."
            ],
            "content":"<div class=\"\"><div> <span>With Miss Felicia Hardy having a briefcase containing a copy both of her resume and of her cover letter at the ready, she then dressed herself up in all her best in a form-fitting business suit amongst several in turn part of a vast collection she was also able to get thanks to her being with so much money and all of the likes in order to “set up Felicia Hardy herself all for life” that in turn all very actually “had managed to fit all whilst of “her so very currently a far rather at all that indeed quite larger form” rather indeed so all quite well enough as ever so, and somehow without ever completely physically exposing had yet somehow “very nicely showed off her curves”. Then Felicia, whilst upon taking a look at herself into her closet mirror for a minute, had noted that while “she had even whilst at these points looked rather good”, for so indeed her skirt was at the least doing as all as well as ever so possible in order to cover her still small and yet so mildly curvy and also “really very slightly ballooning behind” yet most very fortunately was it incredibly absolutely not ever so at all exposed.<br>\r\n<br>\r\n“<i>Ah</i> <i>I</i> <i>do</i> <i>say</i> <i>just</i> <i>what</i> <i>the</i> <i>heck</i>, <i>and</i> <i>therefore</i> <i>so</i> <i>just</i> <i>forget</i> <i>it</i>.” Thought Felicia. “<i>Besides</i> <i>I</i> <i>do</i> <i>know</i> <i>that</i> <i>there</i> <i> <i>are</i> <i>women</i> <i>wearing</i> <i>even</i> <i>almost</i> <i>skimpier</i> <i>outfits</i>.<br>\r\n<br>\r\nWhile Felicia was riding the bus to the bakery-and-all-one-can-eat-buffet-restaurant, she got her fair share of looks as she sat herself down, at all no doubt due to “her quite larger form”. Yet Felicia had just started without even knowing or even caring about it all with the development of such a quite so soon to be whilst ending up very increasingly massive appetite that she had ended up really only thinking about her being hired for what she was on her way to a job interview for that she had ended up as, and so all whilst ignoring them, she had looked out the window for the rest of the ride. Finally arriving at the same place as from last night not that she would mention it at all, she then walked inside, “hips swaying” in part here from out of “hoping to fall back on whatsoever sensual appeal whilst that she still had left”. The interview was nothing special but instead consisted of all typical job interview questions such as whilst involving age, experience, why she wanted the job etc with her as mentioning herself to be in her earliest twenties etc and at all here not even five minutes after the interview had thus so even started, the male job interviewer whosoever was interviewing with Felicia Hardy somehow decided that he knew this was the best he and all the rest would get and so he had her declared as hired right on the spot.<br>\r\n<br>\r\nThen Miss Felicia Hardy, from out of feeing quite so “confident with her success”, had decided to have rewarded herself, getting for herself a quadruple extra large pint sized quadruple vanilla and chocolate flavoured eight-scoop ice cream cup and plastic spoon with it on her way back to the bus stop. Since Miss Felicia Hardy did not start her new job until a week from the one upcoming Monday Weekday with that itself as also four days from this day which was a Wednesday Weekday, she therefore still so had four days up whilst to until then.<br>\r\n<br>\r\nTherefore Felicia, upon her return to her home, therefore had decided to take her attire for her now at these points just passed job interview and switch into her black pajama pair described from the night prior to this here occurring day, then heading towards her fancy wealthy apartment home’s living room set up large-and-capable-of-being-converted-into-a-bed-from-couch-furniture, she placed herself onto it via her back on it in the fashion of a “<i>ker</i>-<i>plop</i>”, after that then breathing <i>very</i> <i>heavily</i> <i>from</i> <i>sweet</i> <i>relief</i>. She was looking forward to when it would all get to happen, but for now decided to take up a nap, something she had rather <i>incredibly</i> <i>rarely</i> done even before this, if so ever here at all.</i></span></div></div>",
            "created":1597091220,
            "id":2883587,
            "title":" Felicia Hardy goes in for a job interview...."
        },
        "1443211":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Progress through all days passing before the night before her first job day.",
                "Skip to the night before her first job day."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Options from here?</span></div></span></div>",
            "created":1597091640,
            "id":2883593,
            "title":"Which Options from here?"
        },
        "15":{
            "author_id":"divablair",
            "author_name":"divablair",
            "choices":[
                "Gwen Stacy",
                "Liz Allen",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>No, how about either Gwen Stacy or Liz Allen?</span></div></span></div>",
            "created":1595739600,
            "id":2875835,
            "title":"Screwball???"
        },
        "153":{
            "author_id":"xander764",
            "author_name":"Xander764",
            "choices":[
                "sure",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ursula Ditkovich?</span></div></span></div>",
            "created":1599886800,
            "id":2901493,
            "title":"Someone Else"
        }
    },
    "info":{
        "author_id":"dawn2",
        "author_name":"sunsun",
        "brief_description":"Swing by and make the ladies gain!",
        "created":1553228040,
        "description":"<td align=\"left\" class=\"norm\">Simply put we're here to make the ladies of the fantastic PS4 Spider-Man game gain weight. <br>\r\n<br>\r\nMore info on how will be inside. <br>\r\n<br>\r\n<b>Rules: </b><br>\r\n<br>\r\n<i>1. Use proper grammar. If a chapter is utterly unreadable, I reserve the right to delete it. <br>\r\n<br>\r\n2. No crazy gains in a chapter. EX: <i>Yuri then gained 1,000 lbs!</i>. <br>\r\n<br>\r\n3. Don't kill Spidey or the main girl. <br>\r\n<br>\r\n4. Please be courteous to writers. By this, I mean don't just take over a storyline, try and leave options for people to take the story in their own direction.<br>\r\n<br>\r\n5. As the creator, I do reserve the right to edit or delete chapters.<br>\r\n</i><br>\r\n</td>",
        "id":2185965,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604978400,
        "modified":1604978400,
        "pretty_title":"Marvel's Spider-Man Female WG"
    }
}