{
    "chapters":{
        "1":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Weight Gain",
                "She Shrinks",
                "Gender Change",
                "Personality Change",
                "Body Swap"
            ],
            "content":"<div class=\"\"><div> <span>Jenny walked down the street with he friends. They had just finished school for the day and as usual everything went perfect for our princess. Of course there were some minor distractions. <br>\r\n<br>\r\nFirst in English class that cow Daphne was blocking her view of Professor Blake, but she quickly pinched her fat called her the names of some barnyard animals, and she swiftly ran out crying. Thus her view was restored.<br>\r\n<br>\r\nThen at lunch that geek Jessica tried to sit with her and her cheerleader friends at lunch. That situation was quickly fixed by knocking down her lunch tray and tripping her as she walked away.<br>\r\n<br>\r\nOn the upside she had finally gotten some \"alone time\" with her boyfriend Josh during study hall.<br>\r\n<br>\r\nAnd, after getting Katie kicked off the cheersquad for gaining a few pounds she was now top of the pyramid.<br>\r\n<br>\r\nShe says good buy to her friends and turns the corner. She is passing Georgio's Fruit stand when Baba Yusefni back's out.<br>\r\n<br>\r\nBaba is a large, and old gypsy women who can not help but back into Jen as she walks out spilling her fruits onto the sidewalk.<br>\r\n<br>\r\n\"Watch it you old hag.\" Jen screams.<br>\r\n<br>\r\n\"Mind you're manners young lady.\"<br>\r\n<br>\r\n\"Ya know maybe if you weren't such a cow you wouldn't take up the hole damn sidewalk.\"<br>\r\n<br>\r\n\"You won't always be so young and slim my dear.\"<br>\r\n<br>\r\n\"Yeah right. I take care of my body. Unlike you. You're huge. How could some one let themselves go like that. You're a cow.\"<br>\r\n<br>\r\n\"Watch you're mouth.\"<br>\r\n<br>\r\n\"Moo.\"<br>\r\n<br>\r\nJen walks away but Baba whispers a curse upon her. What kind of curse is it?</span></div></div>",
            "created":1153026000,
            "id":332247,
            "title":"Jenny"
        },
        "11":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Slow and Steady",
                "Rapidly",
                "She wakes up fat",
                "Her reality is changed so she has always been fat",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Quickly so we can move to the story.<br>\r\n<br>\r\nHow does she gain.</span></div></span></div>",
            "created":1153026000,
            "id":331708,
            "title":"One BIG question"
        },
        "111":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She notices",
                "She doesn't notice"
            ],
            "content":"<div class=\"\"><div> <span>As Jen walks away the gypsy woman curses her to gain weight slowly throughout today and tomorrow.<br>\r\n<br>\r\nThe next morning when Jen woke up she had lost all he muscle definition. Her tight abs were replaced by a thin layer of fat which rolls over her waistband as she sits in her bed. Her thighs are no longer tight and are instead soft, flabby, and dabbed with cellulite. Her ass is bigger and sags behind her. Her arms are softer, and a double chin is fighting her way onto her face. The only things that haven't seemed to grow were her breasts. <br>\r\n<br>\r\nOverall she looks like she has gained twenty pounds over night!</span></div></div>",
            "created":1153630800,
            "id":333871,
            "title":"Fatter"
        },
        "1111":{
            "choices":[
                "Try to climb out of the window, but fall to the ground.",
                "March down the stairs, trumpeting like an elephant."
            ],
            "content":"<div class=\"\"><div> <span>Screaming at the top of her lungs, Jenny stared at herself in the mirror in horror. She hysterically tears at her hair as her mother bursts into her room, alarmed by her shriek. <br>\r\n<br>\r\n\"Jennifer!\" she gasped, abhorred by the double chins and the saggy, huge body that took her daughter.<br>\r\n<br>\r\n\"Mom! Help me!\" she cried.<br>\r\n<br>\r\n\"I'll call the doctor,\" she said, quickly leaving the room. \"It might be a reaction!\"<br>\r\n<br>\r\n\"Reaction?!\" she screamed. \"I'm not allergic to anything!\"<br>\r\n<br>\r\n\"You don't know that, honey!\" her mother called.<br>\r\n<br>\r\n\"Maybe, but I do know one thing!\" Jen grimaced. \"That fat witch's gonna get what's coming to her!\"<br>\r\n</span></div></div>",
            "created":1154494800,
            "id":336791,
            "title":"Jen's Threat"
        },
        "11111":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "No one saw her. She's in the clear.",
                "A group of her friends are coming up the sidewalk."
            ],
            "content":"<div class=\"\"><div> <span>With her expanded frame, Jen squeezes her way out the window. Not an easy task generally, but with her ballooning waist, it's become a real trial. She had snuck out plenty of times before. With a mighty heave, she unwedges her self, rolling headlong into the lawn. <br>\r\n<br>\r\nWith a grimace and shake, she looks around and...</span></div></div>",
            "created":1275541200,
            "id":894009,
            "title":"Try to climb out of the window, but fall to the..."
        },
        "11112":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Her mother",
                "The smell of food in the kitchen."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Frowning wide, Jen busts through her door. She rushes down the stairs, but is stopped by...</span></div></span></div>",
            "created":1275541200,
            "id":894011,
            "title":"March down the stairs, trumpeting like an eleph..."
        },
        "1112":{
            "author_name":"a_nother2002",
            "choices":[
                "JENNY? Is that you?",
                "Who the hell is this fat cow?"
            ],
            "content":"<div class=\"\"><div> <span>Jenny rushed a shower and put on her favourite mini and crop top both black, She unthinkingly adjusted her clothes not noticing the under hang and her ass sticking out under her skirt. She put her hair in a ponytail, thinking she can do something fancy later.<br>\r\n<br>\r\nArriving at school, Jenny was out of breath despite living only 5 minutes away. 'Weew I need to go to the gym tonight'Unkown to her she had grown another 10 pounds on the journey. AS she walked down the corridor she saw people turning to look at her 'Yep still got it' she muttered to herself. She spotted Josh and shouted him as she approached he looked puzzled 'Hey!'Said Jenny, Josh looked at her before saying<br>\r\n<br>\r\n</span></div></div>",
            "created":1154235600,
            "id":335988,
            "title":"Meetings"
        },
        "11121":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Go to Gym Class",
                "Cut Gym to get something to eat."
            ],
            "content":"<div class=\"\"><div> <span>\"Jenny? Is that you?\" said Josh confused as to why his girlfriend had mysteriously gained 30 pounds of fat over night.<br>\r\n<br>\r\n\"Of course its me Joshiepoo. You must not recognize me with my hair in a ponytail. I was trying something different. Well I've gotta get to class. See yah later.\"<br>\r\n<br>\r\nJosh cringed as he watched Jen walk away, her but clearly visible below her short skirt. Claire, another one of the cheerleaders, came walking up to him.<br>\r\n<br>\r\n\"Jeez, Jen really has let herself go. Say why don't you dump the cow and lets make out.\"<br>\r\n<br>\r\nJosh smiled and the two headed off to the janitor's closet.<br>\r\n<br>\r\n<br>\r\n-----Meanwhile----------<br>\r\n<br>\r\nJen's next class was gym, but she was feeling unusually hungry today.<br>\r\n<br>\r\nDoes she?</span></div></div>",
            "created":1154322000,
            "id":336220,
            "title":"Is that you Jen?"
        },
        "111211":{
            "choices":[
                "There was a girl in there still making fun of her",
                "She was starting to get late"
            ],
            "content":"<div class=\"\"><div> <span>Jen had went to gym class normally without her new poundage affecting her life, despite she was 30 pounds overweight.<br>\r\n<br>\r\nEveryone had been looking at her as if she had been hitting the groceries severely. Some chuckled at her because of that.<br>\r\n<br>\r\nShe waddled into the change room and all the girls who were in the change room had laughed at her and called her names, telling her that she was a fat ass a fat cow, slapping her larger expanded belly.<br>\r\n<br>\r\nThis had annoyed her, as the thin girls were pushing her around.<br>\r\n<br>\r\n\"Hey lard butt!\" One of the girls yelled.<br>\r\n<br>\r\n\"Been hitting the groceries?\" Another girl asked.<br>\r\n<br>\r\nOne girl even pinched it and another one poked it, \"You are supposed to say 'woo-hoo'.\"<br>\r\n<br>\r\nShe had ignored her classmates and they had left the change room as she was struggling into her clothes, her belly was hanging well over her gym shorts as gravity was kind of taking effect. Her belly was blobby and hung with its own weight that it had jiggled, it was soft and plush to the touch.<br>\r\n<br>\r\nShe looked down in utter disbelief as her fat belly rippled as she struggled to get into her gym clothes, she grabbled a roll of her fat from her belly. \"I hate this, I hate being the fat slob that I am! Why can't I be thin!?\"<br>\r\n<br>\r\nShe kept on complaining about her self image that she had forgot...</span></div></div>",
            "created":1157605200,
            "id":345208,
            "title":"Gym Class"
        },
        "1112111":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Got down and began to 'Oink.'",
                "Snapped out of it and got in the other girl's face."
            ],
            "content":"<div class=\"\"><div> <span>\"Because you're nothing but a sow. Cripes\"<br>\r\n<br>\r\nJen's face went hot, as tears began to creep from her eyes, \"Just leave me alone.\"<br>\r\n<br>\r\n\"Hey, I have a candy bar in my locker. I'll give it to you if you get down on all fours and oink.\"<br>\r\n<br>\r\nJen frowned, \"What?\"<br>\r\n<br>\r\nThe girl pulled a Snickers bar from the bag, and Jen felt her mouth begin to water.<br>\r\n<br>\r\nShe wanted that candy bar more than anything, and her knees began to bend as she...</span></div></div>",
            "created":1275541200,
            "id":894014,
            "title":"There was a girl in there still making fun of her"
        },
        "1112112":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Forgot Her Shirt!",
                "Tripped and ripped her shorts!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Quickly, she realized that she was alone in the locker room, and immediately rushed out, heading to the gym. In her haste she...</span></div></span></div>",
            "created":1275541200,
            "id":894016,
            "title":"She was starting to get late"
        },
        "111212":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "The Principal had caught her cutting class!",
                "She was scot free!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Quietly, Jen snuck down the hallway, and as she rounded the corner to the back door of the school, which would allow her to explore the downtown food options, she found that...</span></div></span></div>",
            "created":1275541200,
            "id":894017,
            "title":"Cut Gym to get something to eat."
        },
        "11122":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "Her skirt splits in half",
                "Someone helps her up"
            ],
            "content":"<div class=\"\"><div> <span>          Jenny thinks there must be an obese girl behind her so she plays it off.  \"Don't worry about her.  I'm here and I want some affection\" she says sweetly.<br>\r\n<br>\r\n          She leans in and puckers her lips.  A look of disgust flashes across Josh's face.  \"Get away from me cow.  Go find a pig to roll around in the mud with like that animal you are.\"  With that he pushes her to the ground and everyone starts laughing.  Jenny finally looks at her body and sees how much she has changed.  Her once flat stomach now bursts from beneath her shirt.  All the muscle she had worked so hard for is now gone, replaced with 250lbs of fat.  <br>\r\n<br>\r\n           Jenny tries to get up but only succeeds in rolling over.  As she lays there crying...</span></div></div>",
            "created":1157691600,
            "id":345423,
            "title":"Rejected"
        },
        "111221":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Leave School",
                "Get her gym clothes and hope her shorts are elastic enough."
            ],
            "content":"<div class=\"\"><div> <span>As she lays on the floor, she shifts awkwardly, causing a tear to ring through the air. As she looks down, she sees her skirt has totally split in two. She hurries to cover herself, her panties now several sizes too small. With Herculean effort she sits up, jiggling mightily. She sprints down the hallway, through the laughing crowd. She decides to...</span></div></div>",
            "created":1275541200,
            "id":894020,
            "title":"Her skirt splits in half"
        },
        "111222":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Another large girl.",
                "A geeky guy, leering at her exposed stomach."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She's pulled to her feet and sees:</span></div></span></div>",
            "created":1275541200,
            "id":894022,
            "title":"Someone helps her up"
        },
        "112":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Her stomach  gaining the most",
                "Her ass gaining the most",
                "Gaining evenly all over."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Feeling a burst of motion, Jen notices her rapid expansion. She looks down and sees...</span></div></span></div>",
            "created":1275541200,
            "id":894025,
            "title":"Rapidly"
        },
        "113":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "100  pounds bigger",
                "250 pounds bigger"
            ],
            "content":"<div class=\"\"><div> <span>The next day Jen wakes up. She tries to move out of her bed but she feels like something is weighing her down. What she doesn't realize is that her stomach is keeping her from getting up. She sinks her hand into her massive gut and pulls it back. She looks at her newly fattened hand with its sausage like pictures.<br>\r\n<br>\r\nShe finally manages to heave herself and finds herself waddling over to her full length mirror.<br>\r\n<br>\r\nWhen she gets a good look at herself in the mirror. She touches one fat hand to her rounded face She screams. Jen is...<br>\r\n<br>\r\n</span></div></div>",
            "created":1153630800,
            "id":333894,
            "title":"Waking up fat"
        },
        "1131":{
            "choices":[
                "first food then deit",
                "deit",
                "run it off"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She saw the fat girl in full length mirror and passed out. When she woke up she saw she was now 234lbs. She had to work this off she had to diet. Just then she feel like she needed to eat.</span></div></span></div>",
            "created":1212123600,
            "id":537814,
            "title":"100  pounds bigger"
        },
        "1132":{
            "choices":[
                "She gains more weight",
                "A huge hunger overcomes her ",
                "Mommy dearest walks in and is fatter then Jen"
            ],
            "content":"<div class=\"\"><div> <span>Jen is 250 pounds bigger. Her once slim face and toned muscles are now fat. The once 150 pounds muscular head cheerleader is now 400 pounds. Jen thinks for a moment \"Wait, before I scream and faint, lets rationalize. I'm 400 pounds and still whereing clothes. Wait, I should be naked! I'm a whale.\" Jen waddled to her closet to find all her designer clothes enlarged, even her cheerleading uniform. <br>\r\n<br>\r\nJen saves herself the screamd and she is about to change when....</span></div></div>",
            "created":1214024400,
            "id":546957,
            "title":"250 pounds bigger"
        },
        "11321":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Gained 100 more pounds all over",
                "Gained a hundred more pounds in a specific body part."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A pleasurable tingle overcomes all of Jen as her body begins to grow. It's all she can do not to touch herself, reaching low, under her hanging belly. Just as suddenly as it comes, it fades and Jen sees that she's...</span></div></span></div>",
            "created":1275541200,
            "id":894028,
            "title":"She gains more weight"
        },
        "11322":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "A bucket of ice cream",
                "A Tub of cooking lard."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jen nearly doubles over with crushing pain as her stomach calls it's emptiness out to her. She rushes down the stairs and hurries into the kitchen, grabbing the first thing she sees...</span></div></span></div>",
            "created":1275541200,
            "id":894031,
            "title":"A huge hunger overcomes her "
        },
        "11323":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "\"Breakfast is ready!\"",
                "\"My, my, you're not growing fast enough at all. Come down and let mommy feed you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her mother waddles in, grinning. She takes one look at Jen and says:</span></div></span></div>",
            "created":1275541200,
            "id":894033,
            "title":"Mommy dearest walks in and is fatter then Jen"
        },
        "114":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "100 pounds heavyier",
                "200 pounds"
            ],
            "content":"<div class=\"\"><div> <span>The next day Jen wakes up and is in a room she doesn't recognize. Its so pink and geeky. She tries to move out of her bed but she feels like something is weighing her down.<br>\r\n<br>\r\nShe finally manages to heave herself and finds herself waddling over to her full length mirror.<br>\r\n<br>\r\nWhen she gets a good look at herself in the mirror. She screams. The girl looking back at her is someone she doesn't recognize. Her normally primmed and proper blond hair is much messier and shorter. Her face is covered in acne and she has slivery metalic braces with pieces of food stuck in it.<br>\r\n<br>\r\nThe most shocking thing though is she's....</span></div></div>",
            "created":1153630800,
            "id":333876,
            "title":"Waking up in a new reality"
        },
        "1141":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Snorting laugh",
                "Sob.",
                "Fart"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Touching her new 250 lb body, she gasps and then lets out a huge...</span></div></span></div>",
            "created":1275541200,
            "id":894036,
            "title":"100 pounds heavyier"
        },
        "1142":{
            "choices":[
                "Continue to eat",
                "Get to School"
            ],
            "content":"<div class=\"\"><div> <span>Jen looked in the mirror in horror she was 200 pounds heavier, she felt her blobby belly, looked at her wide butt and flabby arms in disbelief as she nearly screamed at the unrecognizable person in the mirror with unsightly acne, and braces.<br>\r\n<br>\r\nShe waddled out of the room and her hot sister Alison leered at her, \"Well if it isn't the wide load Jen!\"<br>\r\n<br>\r\nAlison was smoking hot, she had a hot body that any guy would go mad over.<br>\r\n<br>\r\nShe waddled downstairs as her hips brushed against the banister and wall into the kitchen where her mother... her own mother criticized her for eating.<br>\r\n<br>\r\n\"Are you sure you need that tubby?\" Jen's mom asked as she slapped her daughters belly.<br>\r\n<br>\r\n\"I am hungry...\"<br>\r\n<br>\r\n\"You are always hungry, go on a diet and you won't be!\"<br>\r\n<br>\r\nJen's mom and her sister used to be fat, but they are thin and her mom was former model due to the hard work and dedication, she at times despized fat people because of their weight, and Jen being in the 300 pound club was facing the taunts and criticism of her family.<br>\r\n<br>\r\nJen had decided to have some waffles and pancakes drenched in syrup and butter.<br>\r\n<br>\r\n\"Are you sure you need that tubby?\" Her sister asked rudely, \"There are third world countries out there who are starving but are suffering from malnutrition.\"<br>\r\n<br>\r\nShe was confused about her new appetite and looked at her flabby body in disbelief especially her large doughy stomach which stood about two and a half feet infront of her, though after eating her hefty meal she had decided to...</span></div></div>",
            "created":1157518800,
            "id":344988,
            "title":"200 pounds heavier"
        },
        "11421":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Squeal like a piggy",
                "Tried to hold on to some dignity"
            ],
            "content":"<div class=\"\"><div> <span>Jenn was done with her meal, one that more than what she would normally eat in a weeks worth of breakfeasts, but found she was still hungry. She lifted herself, with some effort, and headed to get some more waffles.<br>\r\n<br>\r\n'Oh, Jesus, Jenn, haven't you had enough?' moaned her mother.<br>\r\n<br>\r\nJenn was now near tears, and turned to face her mother.<br>\r\n<br>\r\n'I'm hungry' she simply stated.<br>\r\n<br>\r\n'Have you seen all the fat you have stored? I think you can afford to starve for a bit' her sister commented.<br>\r\n<br>\r\nShe simply waddled up to the counter, and reached for the waffles. However, they were by the wall. Normally, she could have reached them easily, but she found that her stomach was so far out, that her chubby little arms couldn't reach it. She kept reaching, and found herself starting to sweat, her tubby body not used to even a little bit of exercise. <br>\r\n<br>\r\nAlison laughed.<br>\r\n<br>\r\n'Look, mom, Scotty can't reach the controls!'<br>\r\n<br>\r\nHer mom smirked at the sight. Jenn couldn't believe what was happening. In her world, they were always kind to her, even when she made some cracks about their weight. She couldn't believe they could be so cruel.<br>\r\n<br>\r\nAllison walked up and grabbed the waffles.<br>\r\n<br>\r\n'Tell you what, porky, I'll give you some food if you squeal like the piggy you are.'</span></div></div>",
            "created":1200373200,
            "id":487521,
            "title":"Continue to eat"
        },
        "114211":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Go to school",
                "Try to talk Allison to not put her humilation on the web"
            ],
            "content":"<div class=\"\"><div> <span>'No!\" Jenn cried out. She wanted to leave, but she was still so hungry. Allison dangled the waffles in front of Jenn's face (though Jenn was older, in this universe her sister was taller than her)<br>\r\n<br>\r\nJenn closed her eyes.<br>\r\n<br>\r\n'Oink, oink, oink'<br>\r\n<br>\r\nAllison laughed.<br>\r\n<br>\r\n'Look mom she's actually doing it!'<br>\r\n<br>\r\nShe then took out her mobile phone to record it.<br>\r\n<br>\r\n'Okay, do it again. And snort!'<br>\r\n<br>\r\nTears in her eyes, Jenn snorted like a piggy. She used to do this to mock others. <br>\r\n<br>\r\nAllison tossed the waffles to Jenn, who reflectivly gobbled them up at once.<br>\r\n<br>\r\n'This'll be on YouTube within the hour.'</span></div></div>",
            "created":1200459600,
            "id":487779,
            "title":"Squeal like a piggy"
        },
        "1142111":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "She takes a car to school",
                "She takes a bus"
            ],
            "content":"<div class=\"\"><div> <span>Jenn then looked at the clock.<br>\r\n<br>\r\n'Oh, God, I got to get to school!'<br>\r\n<br>\r\nShe waddled up the steps to her room.<br>\r\n<br>\r\n'Careful Jenn, we don't want you to break the stairs again!' Allison cried out.<br>\r\n<br>\r\nShe got in her room, and started to breath heavily. She looked at herself in the mirror, and saw that she was sweating. What was once a simple activity now felt like running a mile.<br>\r\n<br>\r\nShe saw her backpack, and picked it up. Looking in it, she saw it was filled with candy bars and chips. She just hoped that beneath them were the books she needed.</span></div></div>",
            "created":1207371600,
            "id":516318,
            "title":"Go to school"
        },
        "11421111":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "The Creepy Old Janitor Comes Limping Up",
                "Her Former Friends Appear."
            ],
            "content":"<div class=\"\"><div> <span>Jen walks outside and sees her now tiny, cramped car. She manages to wedge herself behind the whee, and slowly makes her way to school. Upon arriving in the parking lot, she opens her door, and finds that because of her massive belly and jiggling ass, she can't get out of the car.<br>\r\n<br>\r\nAfter a moment of struggling, she screams for help, and in a few minutes...</span></div></div>",
            "created":1275541200,
            "id":894037,
            "title":"She takes a car to school"
        },
        "11421112":{
            "author_id":"burke_rakers",
            "author_name":"Burke Rakers",
            "choices":[
                "Jenny finds herself becoming facinated with everything he says.",
                "At school, Jenny finds that she's now a terrible student. Flunking out in fact."
            ],
            "content":"<div class=\"\"><div> <span>   Riding the bus is like torture, but her mother refuses to give her a lift. \"You're the one who's stuffed yourself that much, fatso. I'd think you'd have learned to deal with it by now.\"<br>\r\n   <br>\r\n   So, she trundled out the door...humiliated by the fact that all she had to wear in her size were faded pairs of sweat pants (the ones she was wearing were pink) and huge, billowy t-shirts. She looked down at her shirt, which was yellow and featured Hello Kitty on the front, and had to stop twice before she got to the bus. She realized that she was exhausted...and yet she'd only waddled half a block!<br>\r\n   <br>\r\n   She took out several candy bars and started eating to keep her strength up, the suger firing her feeble muscles with just enough strength to get her onto the bus. She waddled in and dropped into a seat, before opening a bag of Doritos and starting to chow down again.<br>\r\n   <br>\r\n   \"Freakin' pig...\"<br>\r\n   <br>\r\n   \"Damn, she's fat as a HOG...\"<br>\r\n   <br>\r\n   \"Her sister's hot, though. Guess she got all the good genes, and Fat-Ass Jenny got what was left.\"<br>\r\n   <br>\r\n   \"Looks like she went back for thirds when God was passing out the blubber, huh?\"<br>\r\n   <br>\r\n   Had she talked like this? As if she wasn't able to hear every word? She wanted to cry, and she swore that she'd never pick on anyone else again if only she could be normal again.<br>\r\n   <br>\r\n   \"Shut up, you bastards!\" someone shouted, and the bus driver warned \"Watch the foul tongue, Mister Porkland!\"<br>\r\n   <br>\r\n   Jenny looked up, and saw that Donny Porkland - a fat, slovenly young man with glasses, ginger hair and an acre of freckles was standing up to the kid behind her. His normally passive features set into a mask of crimson anger.<br>\r\n   <br>\r\n   He turned towards her, and asked \"Are you alright, Jen? You know what these guys are like. Buncha jerks.\"<br>\r\n   <br>\r\n   He couldn't sit on her bench, but he did sit across from her and offer to share a box of Ding Dongs with her. It was geeky as heck, but it was also the only nice thing that anyone had said to her that day. She blushed and looked away when he touched her hand, but didn't pull it back. Instead, she just smiled and listened passively as he spoke about his \"Lost in Space\" fan fiction, what comic books he was reading, and how well his Dungeons and Dragons game had gone last week.</span></div></div>",
            "created":1222923600,
            "id":589947,
            "title":"She takes a bus"
        },
        "114211121":{
            "choices":[
                "She is pregnant with Triplets",
                "Late"
            ],
            "content":"<div class=\"\"><div> <span>Jenny takes out her glasses and asks Donny if he wants to go to the All You can eat Dinner Place. Donny agress they clear the restraunt out. They are in love be on anyone can beleve and they start kissing and go in a closet. Jenny finds she missed her period</span></div></div>",
            "created":1264482000,
            "id":825906,
            "title":"Jenny finds herself becoming facinated with eve..."
        },
        "1142111211":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Remain in school",
                "Drop Out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With this news over her head, Jen is forced with a difficult decision. Does she...</span></div></span></div>",
            "created":1275541200,
            "id":894039,
            "title":"She is pregnant with Triplets"
        },
        "1142111212":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Feeder",
                "Mutual Gainer"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Thankfully, her period *does* come, but that doesn't stop her expansion, you see Donny is a bit of a...</span></div></span></div>",
            "created":1275541200,
            "id":894042,
            "title":"Late"
        },
        "1142112":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Goes to school in a tank top and mini skirt three sizes too small",
                "Can lose 20 pounds this month"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bawling, Jen begs her sister not to post it online. Allison responds with an ultimatum: She won't put the video on YouTube if Jen...</span></div></span></div>",
            "created":1275541200,
            "id":894045,
            "title":"Try to talk Allison to not put her humilation o..."
        },
        "114212":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Begins to shove the food into her sister's mouth",
                "Slaps Jen across the face"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jen, sobbing hard, spits in her sister's face, \"I'm still a person, dammit!\"<br>\r\n<br>\r\nGlowering, Allison...</span></div></span></div>",
            "created":1275541200,
            "id":894046,
            "title":"Tried to hold on to some dignity"
        },
        "11422":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Stopped.",
                "Disappeared into the distance."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hurrying out the door with an excited waddle, Jen saw the bus ahead of her. She chased after it, late again because she couldn't stop eating. As she wheezed and huffed, clearly over-exerted, she looked up to see that the bus had...</span></div></span></div>",
            "created":1275541200,
            "id":894062,
            "title":"Get to School"
        },
        "114222":{
            "author_id":"deliman092262",
            "author_name":"DELIMAN092262",
            "choices":[
                "Her BFF Jessica",
                "The now very chunky Katie"
            ],
            "content":"<div class=\"\"><div> <span>Jen stopped, her shoulders slumped and with a big sigh she turned toward home.  She knew what she must do.  She would have to beg her mom to drive her to school.  No doubt her mom would bitch and complain that if she did not eat so much then she would not have missed the bus.  With the final insult that a good hard walk would help her lose weight.<br>\r\n<br>\r\nOf course, Jen knew what was really going on.  From her weight gain to the insults by her family to missing the bus must have been part of a plan by that fat cow Baba Yusefni to humiliate her.<br>\r\n<br>\r\nWith her head down and dreading what was about to happen; Jen was surprised when an old Ford Explorer pulled up with a short beep on it's horn.  After a brief moment the passenger door opened and a voice asked if she wanted an engraved invitation to get in so they could go to school?<br>\r\n<br>\r\nWith a bit of hesitation Jen got her huge body in.  (She knew she had to get to school and this way avoided dealing with her mom.)  The driver was Ronald Green who was the biggest nerd in the school.  He then leaned in a gave Jen a big kiss on the lips.  Jen surprised herself when she actually kissed back.  <br>\r\n<br>\r\nWhen “Ron” stopped and put the car in gear; he reminded Jen just how beautiful she was and he hope she was as happy as he was that they found each other and were dating.<br>\r\n<br>\r\nOf course, as the car drove to school Jen was reminded of a conversation from what must have been the other reality.  (Where did that thought come from?)  She and her “thin bitchy” friends … (What???)  Were making fun and insulting “her” boyfriend Ron.  (Wait a minute???)  Jen could remember saying “The only girl that would ever go out with that “loser” Ronald Green would have to be a huge fat whale who was desperate.”<br>\r\n<br>\r\nThat thought caused Jen to gasp.  Was she talking about herself?  Was this part of the plan to humiliate her?  Ron was her boyfriend and she loved him.  (Oh, my God!) <br>\r\n<br>\r\nAt that point Ron asked if she was ready for the calculus test?  Looking down at her calculus book resting on her massive thighs; Jen said of course she was.  <br>\r\n<br>\r\nWait … calculus was an Advanced Placement class that only really smart nerds took.  Was Jen a nerd?  Was that part of the plan?<br>\r\n<br>\r\nAt school who had a locker next to her?</span></div></div>",
            "created":1502686800,
            "id":2368892,
            "title":"Disappeared into the distance."
        },
        "115":{
            "author_id":"boywithpen",
            "author_name":"boywithpen",
            "choices":[
                "Inflation",
                "Not my style..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>None of those? Well if you insist...how about good ol' fashion inflation? Not into that? Oh well...</span></div></span></div>",
            "created":1173675600,
            "id":388955,
            "title":"Inflation Domination"
        },
        "1151":{
            "author_id":"boywithpen",
            "author_name":"boywithpen",
            "choices":[
                "The inflation stops....for now...",
                "She keeps infalting!"
            ],
            "content":"<div class=\"\"><div> <span>As Jenny scoffed and continued she didn’t even look back, or give Baba a return look. She just kept walking…<br>\r\n<br>\r\nHowever, even though everything else seemed the same, there was something different. As Jenny trotted back to her house something inside her was changing. All the sudden the small fat deposits in her abdomen, arms, legs, chest and belly were absorbing air. Slowly Jen’s cells were inhaling oxygen and very quickly they started to inflate…<br>\r\n<br>\r\nAfter a while Jen took a seat on a bench and stared up at the blank sky with curios eyes, unaware of the changed happening to her. However and instantaneously her small pouch of a belly started growing and growing!<br>\r\n<br>\r\nIt popped out from under her shirt like a turtle head and it started expanding rounder and rounder! Jenny gasped as she put her hand on her small but spherically belly in horror…<br>\r\n</span></div></div>",
            "created":1173675600,
            "id":388957,
            "title":"And so it begins...."
        },
        "11512":{
            "author_id":"jackson5000",
            "author_name":"TheNewJaxson",
            "choices":[
                "Jenny can't find Baba, but her friends find her",
                "Baba is found and curses Jenny further"
            ],
            "content":"<div class=\"\"><div> <span>Jenny stumbled towards a fence, where she leaned forward and held herself up against it.  She gritted her teeth as she felt a pressure inside her begin to build up and push outwards.  Her body began to swell everywhere with fat, rounding her out as her spherical belly seemed to engulf the rest of her body.  Long seconds passed as Jenny felt her body turn into what was essentially a ball of fat.  Her waist was as big around as she was tall and her arms and legs were line cones that tapered to her hands and feet.  Her boobs were huge, as was her butt, but still small when compared to her belly, which dominated her body.  Her face developed a slight second chin and some fuller cheeks, but was essentially the same.  <br>\r\n<br>\r\n“What the Hell?” she whispered as she looked herself over.  Her clothes were taught but not undersized, which was oddly strange.  “What’s happening to me?” she took a tentative step and realized she didn’t weigh anything near what she looked to.  She was fat, but as light as before.  “I’m a freaking beach ball,” she said in anger.<br>\r\n<br>\r\n“Baba!” Jenny snarled as she looked back down the road from whence she came.  Not caring how she looked Jenny stormed down the street towards the elderly woman.  As she moved, with surprising speed, down the sidewalk her giant body knocked people out of her way or to the ground.  It was like they had been hit with a giant air filled balloon.  It took her less time to return to Baba then it had to walk away from her.<br>\r\n<br>\r\n“You!” Jenny growled and grabbed the elderly woman by her collar and slammed her into the wall.  “You did this to me!”<br>\r\n<br>\r\n“I advised you to watch your weight,” Baba cackled.<br>\r\n<br>\r\n“I weigh the same, thank you very much,” Jenny hissed back.  Suddenly she stopped, her ears perking up at t a small imperceptible sound that only she seemed to hear.  Her head moved ever so slightly to the side, her eyes going sideways as if she was trying to see behind her for the noise.<br>\r\n<br>\r\nffffffffrrrrrrrrtttttttttthhhhhhhhhhhhhppppppppppppppppttttttttttttt!<br>\r\n<br>\r\n“Did I just let out a long, high-pitched, smelly fart?” Jenny asked with a look of utter disbelief.<br>\r\n<br>\r\n“Well what did you think happens to the extra air trapped inside of a balloon of a girl?” Baba smirked at her.<br>\r\n<br>\r\n“I’m going to kill you.”<br>\r\n<br>\r\n“I doubt it,” Baba smiled and tapped Jenny on the nose.  She lurched forward as her butt exploded with a more violent fart, surprising her.  She let go of Baba as she tried to regain her balance and the old woman scarpered away.  <br>\r\n<br>\r\n“I’m seriously going to kill her,” Jenny restated with murder in her eyes.  She began to look for her, wincing whenever she stepped to heavily.<br>\r\n</span></div></div>",
            "created":1472101200,
            "id":2201592,
            "title":"Jenny Fills Up Like A Parade Balloon"
        },
        "115122":{
            "author_id":"jackson5000",
            "author_name":"TheNewJaxson",
            "choices":[
                "Jenny is mocked by some small children",
                "Her friends find Jenny floating down the road"
            ],
            "content":"<div class=\"\"><div> <span>Jenny moved carefully through the area, gritting her teeth every time she put too much weight on one foot and farted as a result.  Her body was still inflated and thus drawing stares and whispers from those who saw her, but Jenny didn’t care.  She didn’t care at all, and she wouldn’t until she got her hands on Baba.  “Where the Hell is she?” Jenny yelled as she slammed open the door to Georgio's Fruit Stand, (fruit stand was misleading as it was actually a corner market store with a nice fruit selection outside.)<br>\r\n<br>\r\n“Damn she’s fat,” a customer whispered to her boyfriend.<br>\r\n<br>\r\n“She reminds me of those giant beach balls they toss around at concerts,” he whispered back.<br>\r\n<br>\r\n“Shaddup!” Jenny yelled back at them.  She bent over and pointed her butt at them and farted.<br>\r\n<br>\r\ntttttthhhhhhhhhhhrrrrrrrrrpppppppttttttttttttttttttttttttttttttttttt!<br>\r\n<br>\r\nThey fanned the smell from their faces, visibly sick from it, as Jenny pushed past them.  She smirked at them in triumph, “If this cure can shut others like those two morons up, maybe it isn’t all bad!”<br>\r\n<br>\r\nPushing her way to the back office, while simultaneously knocking everything off the shelves due to her inflated body, Jenny forced the door open and made her way through finding Baba.   <br>\r\n<br>\r\nBaba didn’t want to show it, but she was scared.  Scared of the balloon-bodied brat who seethed in front of her with murder in her eye.  Jenny seemed to take up the whole doorway, and Babb could see her mass easily spread past it.  The girl seemed to be wedged in the doorway but her own bulk prevented her from fully entering.  She flailed her arms in anger at the older woman, and grew even angrier as she always came up just a little short.  “…Hey, there you are…” Baba tired to mock her.  “How’s it going?”<br>\r\n<br>\r\n“Change!”<br>\r\n<br>\r\nffffffrrrrrttttt!<br>\r\n<br>\r\n“ME!”<br>\r\n<br>\r\nFFFRRRAAAPPPTTTTTT!<br>\r\n<br>\r\n“<b>BACK</b>!”<br>\r\n<br>\r\n<b>BBBBRRRRRPPPPPPTTTTTT</b>!<br>\r\n<br>\r\n“Will you admit you were a rude girl, then?” Baba asked with a cocked eyebrow.<br>\r\n<br>\r\n“Hell no!” Jenny refused adamantly.<br>\r\n<br>\r\n“Then not only are you rude, but you’re also full of HOT AIR!” Baba cackled.<br>\r\n<br>\r\nJenny took a step back, popping herself free of the doorway, “No.  You didn’t…”<br>\r\n<br>\r\n“Didn’t I?” Baba laughed.  She bolted form her seat and pushed past Jenny who tried to grab her as she ran by but missed.<br>\r\n<br>\r\nJenny turned to waddle after her prey, but found she wasn’t turning very quickly.  Using her feet to feel around she realized she was now floating ever so slightly off the ground, just far enough that she could barely get her big toe to touch.  “I’m a freaking floating balloon,” she huffed.  “How in the holy Hell am I suppose to move now?”  She let out a small fart and floated forward a few inches.  <br>\r\n<br>\r\nClosing her eyes, as if suddenly resigned to her new twist of fate, Jenny sighed and farted again sending her along her way.<br>\r\n<br>\r\nBbbbbbbbbbrrrrrrrppppppppppptttttttttttt!<br>\r\n</span></div></div>",
            "created":1472446800,
            "id":2203469,
            "title":"\"So You Want Another Curse?\""
        },
        "1151221":{
            "author_id":"jackson5000",
            "author_name":"TheNewJaxson",
            "choices":[
                "Jenny catches up with a scared Baba",
                "Jenny loses Baba thanks to the kids"
            ],
            "content":"<div class=\"\"><div> <span>Jenny floated down the road following the cackle of Baba, determined to pursue the woman to the ends of the Earth if she had to, in order to get the curses on her lifted and changed back to normal.  The people around her stared as she moved by them; but looking like an overinflated Beach Ball, with some rather large tits and ass, two tiny hands and two tiny feet flapping uselessly, accompanied by a rather furious looking little blonde head with a beautiful face being propelled by some decidedly rank flatulence will do that.  Her farts propelled her about as fast as she could briskly walk and she was losing ground to Baba.  And that just made a murderous Jenny even angrier.  So it was only the foolish that would dare to vex the balloon girl.<br>\r\n<br>\r\nAnd no one is more foolish than young, privileged, white boys.  Their names were Jared, Chad, and Bradley.   They were each 8-yerars-old and used to getting their way.  But Jenny was Jenny and she would make them sorry they ever decided to mock the Queen of her Universe.  “Look guys!” Bradley called out to his friends, “Look at the freak!”  Jenny frowned more but just kept using her toots to putter on down the street.<br>\r\n<br>\r\n“She’s like a fat balloon!” Jared pointed and laughed.  Her eye twitched but she kept quiet, and Jenny continued on.<br>\r\n<br>\r\n“And she stinks like a Port-A-Potty!” Chad waved the air under his nose as Jenny silently went by him.  She was so livid you could almost see steam coming from out of her ears.<br>\r\n<br>\r\n“What a fat farting loser!” Bradley laughed as he slapped Jenny’s ass.  <br>\r\n<br>\r\nJenny stopped dead in her tracks.  A small hissing fart turned her balloon body so that she faced the boy.  “Kid, I will end you,” she hissed at him in a voice that was no louder than her normal speaking voice but seemed to be louder than thunder.  No one thought she was bluffing and many who heard her were afraid her wrath wouldn’t stop with him.  Jenny stared a hole through Bradley, daring him to say something else.<br>\r\n<br>\r\nBradley was not a smart child, and caved easily to peer pressure, so when his friends looked at his as if to say, “Don’t let her speak to you like that,” he decided to show Jenny he was as tough as he looked.  He didn’t actually look very tough, but in his mind he was the stuff of nightmares.  “Fuck you,” gulp, “Bitch.”<br>\r\n<br>\r\nJenny’s eyes flared wide, and a low growl came from deep inside her balloon body.  She forced a fart from deep inside her with uncommon force and rocketed forward into Bradley, pinning him to the wall and smothering him with her inflated body.  She kept farting as hard as she could, preventing Bradley from forcing her off and away.  She looked at Chad and Jared and yelled, “You want some of this too you little jack offs?  Do you?”  Neither would make eye contact with her.  Jenny wouldn’t let awkward silence act as an answer and asked again slowly raising her voice with each word, “I said:  Do you want some too?”<br>\r\n<br>\r\n“No,” Chad said quietly.<br>\r\n<br>\r\n“What bitch?”<br>\r\n<br>\r\n“He said no,” Jared gulped.  “Neither of us wants any,” he gulped again, even louder, “Ma’am.”<br>\r\n<br>\r\n“Better show me some respect,” Jenny sneered at them.  She pushed back against Bradley and slowly floated away from him, letting the boy drop to the ground and gasping for breath.  “How about you numb-nuts?  You got anymore trash to talk?”  Bradley couldn’t answer, as he was still desperate for breath.  “Thought not,” Jenny spit at them.  She used a little fart to turn herself to face back down the street, and a little bigger and longer one to get her moving back after Baba.<br>\r\n<br>\r\nBbbbbbbbbbrrrrrrrppppppppppptttttttttttt!</span></div></div>",
            "created":1499317200,
            "id":2348719,
            "title":"Jenny Don't Take No Guff"
        },
        "1152":{
            "choices":[
                "Appetite growth, with mild weight gain",
                "Stuffing herself full, major weight gain",
                "other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about appetite growth or stuffing herself silly? Or maybe another choice...</span></div></span></div>",
            "created":1214802000,
            "id":550189,
            "title":"Not my style..."
        },
        "11522":{
            "author_id":"bloxxerstudios",
            "author_name":"Bloxxer",
            "choices":[
                "Indeed I do.",
                "Lets go on with plain old glutting."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now, we could also try some sort of slob if you like that? I like that, perhaps you do?</span></div></span></div>",
            "created":1472446800,
            "id":2203518,
            "title":"Stuffing herself full, major weight gain"
        },
        "11523":{
            "choices":[
                "Changed",
                "Didn't change"
            ],
            "content":"<div class=\"\"><div> <span>After partying for the rest of the day you decide to head home after a long day of partying, insulting, and mocking. You walk in the door and immediately head upstairs to your room and slip on your pajamas. You'll shower in the morning like you always do but in the mean time it's time for bed. In the morning Jen woke up and found that she:<br>\r\n<br>\r\n1.changed <br>\r\n<br>\r\n2.didn't change</span></div></div>",
            "created":1226293200,
            "id":606297,
            "title":"setting the stage"
        },
        "115231":{
            "choices":[
                "Baba",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>In the morning you woke up and noticed something felt different about today. Like gravity was pushing down harder then usual on you. When your morning haitus quickly lifted you realized why. You were fat and thst wasn't the only thing.<br>\r\n<br>\r\nThe first thing you felt was your newly made gargantuan belly. Your once rock hard abs gone melting away to give way for a giant bloating plushy jumbo belly that hanging below your waist line and is about to fold over into a roll. Your formerly tight arms and legs are now beefy and jiggly as they quiver with each lilttle movement. Your thighs rub and smack together even if you spread your legs as far apart as possible they are covered in dimples and are equal to in proportion to your hips. Your hips spread out ridiculously far and covereed in soft fat. Your butt is no longer perfectly round and firm but rather it is large, suishy, and jiggly. It creates such a large shelf that the average person could sit on it. Your love handles connect your belly with the rest of your body as teh rest on your shelf and create large pyramids on your butt. Your face has rounded out with a once firm chin that's become a double chin with a tiny third being formed. Your cheeks are rosey red and have dimples on them. Yor once thin and admired feet and fingers are now fat and your ankles now cankles. But at least one thing feels appealing to you and that's you boobs. Once a modest cc there now a kk and still perky and plush. You also find your ass fantastic for some reason but you don't know why. But these aren't the only changes.<br>\r\n<br>\r\nYou find that your hair is now below shoulder length and that its pin straight bleach blonde quality is gone. You hair is now almost black and it's gone from pin straight to wavy. Your once deep blue eyes are now a grass green and you feel and look more mature. You stare in the mirror as you look 32, easily 250 pounds heavier, and almost unrecognizeable except for your vice. Yesterday you were a slim blonde and bitchy 18 year old. Today your fat brunette 32 year old whose even 5 inches shorter. <br>\r\n<br>\r\nAngry and confused you wonder why this has happened. After missing your bus to miss school and eating all the junk food in the house (and looking even fatter) you finally realize who it is to blame. You blame:<br>\r\n<br>\r\n1. Baba<br>\r\n<br>\r\n2. Somethingelse</span></div></div>",
            "created":1226293200,
            "id":606379,
            "title":"Changed"
        },
        "1152311":{
            "choices":[
                "Has changed ",
                "Has not changed"
            ],
            "content":"<div class=\"\"><div> <span>You drop a box of Twinkies and say only one word \"Baba.\" You realize that that bitch turned you into this 32  year old fat brunette. But for the life of you, you can't figure out why she made you older. Driven by anger you deicide to go up to Baba and confront her. You waddle back upstairs to your room as fast as you can and open up your closet. You stare in shock to find that all of your clothes has been replaced with spandex, short shorts, and really big bras. You grab the first spandex you can find and the first pair of shorts you see. You take your shirt off and place the tighter then tight spandex on. You pull down on it and try to make it go as far down as possible. It won't go any farther then half down your belly. Aggravated you pull off your pajama shorts on put on the short shorts. It takes you all of 10 minutes to put them on because you could reach far past your belly. They reach below your belly but are hardly visible from the front because your belly is so huge. From the back they make your butt look even bigger and jigglyer because of their elastic quality and red color.<br>\r\n<br>\r\n<br>\r\n Looking like a fat slut you slip on your flip flops and waddle out the door. Heading straight for your car you stare in disbelief as your 2008 escalade decked out with the latest technology is now a 2002 volts wagon beetle. After some screaming some nasty things about Baba you get into the little beetle and try to get comfortable. Your belly presses against the wheel and your large boobs obscure your view but somehow you manage to drive off. Driving down main street in town towards Baba's shop you drive really slow due to traffic. You see people on the sidewalks and in stores staring and snickering at you while others point and make nasty jokes about you. Trying to ignore them you make it to Baba's shop with to much trouble. You get out of the car and stare at the sign to the shop. It read \"Madame Baba's Fruit and Magic.\" Trying to retain some dignity you swank your hips back in forth on your way into the shop in a vain attempt to catch the eye of some looker. <br>\r\n<br>\r\nWhen you enter the shop you see Baba standing behind the counter looking mellow and congenial. You notice right away that Baba...<br>\r\n<br>\r\n1. Has changed<br>\r\n<br>\r\n2. Has not changed</span></div></div>",
            "created":1226379600,
            "id":606572,
            "title":"on the way"
        },
        "11523111":{
            "choices":[
                "Weight gain",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>When you enter the shop you see Baba standing behind the counter looking mellow and congenial. You notice right away that Baba has changed, and changed a lot. She looks about 14 years younger and thinner too. Her once mesy dark brown hair is now bleach blonde and down nicely. Her once lard liek body is now smaller and smoother although still kind of chunky. Her once evny green eyes are now a deep blue and she is a little taller then your remembered. Her skin is much fairer then you thought it was too. In total awe you stare at her and she just smiles at you. Pissed off you want to say something but can't get it out of your mouth. She says it for you:<br>\r\n<br>\r\n\"I know, I've change a lot and so have you my little piggy. I'm younger, prettier, and much thinner then I was even though I am still a little chunky. You on the other hand are fatter, less pretty, not as fair skinned, and as you can see, very very fat. I took some of the things i didn't like bout myself and traded them with your qualities. I couldn't just remove them so they had to go somewhere. And you were just a perfect little piggy for them to go into. i'm not longer a 52 year old fatty that's not pretty. I'm now a sexy 38 year old who may be a little chunky but doesn't care. You now a fat 32 year old who weights over 300 pounds. You better be nice to me or I could do worse to you. Remember I still have weight to lose and there are plenty of spells I can whip up in no time. And still plenty of people in that school of yours who you have demoralized.\"<br>\r\n<br>\r\nThe only thing that you can get out of your mouth are the words: \"You BITCH!\"<br>\r\n<br>\r\n\"I told you to be nice, but because this was a first offense i'll be generous.\" With a snap of her fingers you watch as:<br>\r\n<br>\r\n1.You gain weight <br>\r\n<br>\r\n2. Something else</span></div></div>",
            "created":1226379600,
            "id":606579,
            "title":"Down, In, and Out"
        },
        "115231112":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>How about a diaper. Jen would be put into a diaper which she can't change. Only a few people can change it and she has no bowel or bladder. Her clothes would become a little babish and there's te option of everybody acting like it's always been there. Other effects can be added also. </span></div></div>",
            "created":1226466000,
            "id":607007,
            "title":"maybe..."
        },
        "1152311122":{
            "author_id":"grimtuesday",
            "author_name":"sorrow",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about making her older and Baba younger?</span></div></span></div>",
            "created":1265778000,
            "id":834159,
            "title":"Older?"
        },
        "11523111222":{
            "author_id":"mikepreston",
            "author_name":"MikeyP",
            "choices":[
                "Yes",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Making Jen into an fat, air-headed nympho-bimbo?<br>\r\n</span></div></span></div>",
            "created":1275541200,
            "id":894065,
            "title":"No"
        },
        "115231112222":{
            "choices":[
                "yes ",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe making jan into a fat four year old and baba kidnaps jan and she keep fatting up jan</span></div></span></div>",
            "created":1350104400,
            "id":1445750,
            "title":"No."
        },
        "115232":{
            "choices":[
                "Eat",
                "Mall"
            ],
            "content":"<div class=\"\"><div> <span>Jen got up out of bed like every other day of her life. She did her usual pre-shower stretch to stay limber for the day. Jen slowly dragged her feet over to the bathroom and locked the door behind her. Jen turned on the music on the built-in wall stereo and put on soothing sounds for the morning. The room filled with the sound of calming ambience and the sounds of a soft saxophone and piano. She gently slipped off her night tee and her night leggings. After taking some time to admire her slim and trim figure in the mirror she turned on the hot water to the shower. She swiftly went into the shower and stroked the curtain to close it. She let the hot water run down her body to warm her up as she reached for the soap. <br>\r\n<br>\r\nJen started to rub the soap over her body while keeping tempo with the music. She rubbed her rock hard abs with the soap and unbeknownst to her they started to melt away. Her once perfect abs started to flatten out, then puff out. Jen ended up with a medium sized pot belly jutting out from her body. She looked  5 months pregnant. Jen moved the soap down her body to her thighs and hips. The once sleek and curvy quality immediately changed as they puff out and became dimpled. Her thighs gently touch each other with each movement and her hips had gobs of fat on them. Jen moved the soap across her body to her butt and rubbed it with the soap for a good 5 minutes. Her ass grew and grew until it's tight aerobic form was no more. It was now a large fatty squishy mountain of flesh that came out of her body. It create a large shelf that had huge love handles sit a top it. Jen whisked the soap across her arms and legs allowing them to follow in suit as they gain some flesh on them until the reach the point of blatantly swaying with each with move of her body. The soap came to her breasts and almost instaneously they jutted out. They went from a modest c cup to a large gg cup. They became fleshy and large and some how they retained their perkiness. Jen began to wash her face and it conformed to the rest of her body. Her face puff out a little and began to show a trace of a double chin. Her fingers and toes fattened up as her ankles washed away to form cankles. Jen finished her shower by washing her hair and heading straight out of the shower. <br>\r\n<br>\r\nStill unaware of the changes she looked in the mirror and smiled. She said: \"If I get any thinner and sexy I might just disappear.\" With that she leaned back and tried to flex her abs as she rubber her belly like she was rubbing her abs. After drying off she turned off the music and went to her closet in her room. She pick out a tiny tube top that was very revealing and a pair of small mini skirt. She force on the mini skirt and tugged the tube top down as hard as she could. She sucked in as hard as she could and it fell right on her. She let out a deep sigh of relief her belly instantly filled out the whole top. Jen said \"Wow, my clothes must be shrinking in the wash again. Better tell mom to be more careful with my clothes.\"<br>\r\n<br>\r\nOn that note Jen walk down the stairs with her belly and her whole body jiggling on the way down. Still unaware of the changes that occurred, she went down to the kitchen and saw that all the food in her house was replaced by Twinkies. Even funnier she thought they appeared to glow. Jen heard her belly roar for food and could decide whether to stay and eat Twinkies all day or go to the mall. She thought \" I’m stick skinny a can afford a day of binging on Twinkies. But I really want to go to the mall and shop, and eat.\" <br>\r\n</span></div></div>",
            "created":1226379600,
            "id":606753,
            "title":"If  I Can't See It Then It Must Not Exist"
        },
        "12":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She shrinks slowy",
                "She Shrinks rapidly",
                "She wakes up shrunken",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she shrink?</span></div></span></div>",
            "created":1153026000,
            "id":331713,
            "title":"A small question"
        },
        "122":{
            "choices":[
                "Drops her off at a men’s prison, or boy’s school?",
                "Takes her to the zoo or a pet store?"
            ],
            "content":"<div class=\"\"><div> <span> As Jenny turned the corner, she started to feel a little funny. Then the chills set in and they started to become violent. She fell down to the ground in an isolated area; her seventeen-year-old body was shaking like crazy and then she passed out. Her body was quickly becoming smaller, but her clothes remained the same. The whole shrinking process only took about twenty seconds. After Jenny shrank down to around 3 inches tall, Baba walked over to her and laughed. Baba then took Jenny’s clothes and tossed them in the trash. Baba then looked down at the tiny sleeping Jenny, as she rested on the ground completely nude. Baba then reached down and gently grabbed the tiny girl. Baba then     </span></div></div>",
            "created":1160802000,
            "id":352628,
            "title":"3 inches tall and nude"
        },
        "1221":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "He sells you as a tiny sex slave",
                "He keeps you for himself",
                "A hunky prison guard finds you"
            ],
            "content":"<div class=\"\"><div> <span>Jenny awakens and heres sounds...<br>\r\n\"Yes, to cell number---\" The sounds are hard to here, and Jenny remains half asleep. After a few moments, she realizes she is naked and seems to be in what appears to be a long, hallow paper room with no doors.<br>\r\nEventually, she hears Baba speak words \"Enjoy life in men's slammer, little girl...kakakak!\"<br>\r\n<br>\r\nLater, Jenny awakens again, and the envelope opens. She is pulled out by a giant, titanic hand, and once out, sees the man holding her. He is big, muscular, hunky, hairy, and matured. He looks to be around 40. Eventually, Jenny realizes his orange jumpsuit, he's a prisoner!<br>\r\n\"Hohohoho! Look at what I got here, a little loud bitch!\"<br>\r\n<br>\r\n\"What the fuck!? What am I doing here? IS this a fucking dream!\"<br>\r\n\"Heh, what should I do with you?\"<br>\r\nJenny stomps her feet in anger,<br>\r\n\"I mean, what are women really good for, especially one this tiny, hoho!\"<br>\r\n\"Shut the fuck up and put me down!\"<br>\r\n\"Hmm, have it your way...\"<br>\r\nHe lowers his hand to his penis, which is very erect. He unzips his suit and places her inside, squishing her against his balls. He moans in pleasure at Jenny's expense. She screams and struggles. It smells as though the prisoner hadn't showered in weeks. \"Yeah, keep screaming, little slut, while the man decides what you're good for. Oh yeah...\"</span></div></div>",
            "created":1357275600,
            "id":1501529,
            "title":"Tiny girl in Man's Prison"
        },
        "12211":{
            "author_id":"timmoomoo",
            "author_name":"timmoomoo",
            "choices":[
                "Boy's school",
                "Continue this"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wtf there was no options between a boys school and a prison</span></div></span></div>",
            "created":1508475600,
            "id":2403876,
            "title":"He sells you as a tiny sex slave"
        },
        "12212":{
            "author_id":"gg05",
            "author_name":"brownbooty",
            "choices":[
                "The prisoner keeps going",
                "Someone walks by"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to have with you around\" he says. The prisoner picks up Jenny and places her in the back of<br>\r\nhis jumpsuit. \"I've got this itch I need to scratch, so get to work!\" Jenny lands in his underwear and <br>\r\non one of his flabby butt cheeks. The smell has doubled from being on his crouch and it's much more<br>\r\nhumid and very stinky. It was obvious that the prisoner does not care about personal hygiene, much<br>\r\nless about washing his foul butt. \"I said, start scratching, bitch!\"<br>\r\n<br>\r\nJenny squirms around and scratches the filthy crack. The deep space was full of hair, sweat and <br>\r\nleftover shit and the smell lingers, causing Jenny to feel nauseous. Just then, the prisoner's<br>\r\nstomach starts to rumble. BBBRRRFFSSTTTTT! A gust of flatus escape from his butt onto<br>\r\nJenny's face. \"Oh yeah! Smell that, slut!\" he barks.<br>\r\n<br>\r\nThe foul odor consists of eggs, beans and other crap that he had eaten, since the prison did<br>\r\noffer the best of meals for a good diet. Jenny coughs and gags at the smell. \"There's plenty<br>\r\nmore where that came from!\" PPPAAMMMPPP!, he lets another one go. Jenny has fallen<br>\r\neven deeper into his crack and the prisoner goes to sit down, adding even more pressure<br>\r\non her.<br>\r\n<br>\r\n\"Get off of me, you dirty fucker!\" Jenny screams at him. \"Your ass stinks!\" The prisoner rubs his<br>\r\nbutt all over the young girl, to keep the stench on her. His cheeks spread to push her into the tight<br>\r\nspot, between his cheeks and butthole. BBBBRRRUUMMMPPPP! FFRRRRTTTTT! BBBOOOOMMFFF!<br>\r\nJenny cries and screams for help.</span></div></div>",
            "created":1358312400,
            "id":1509876,
            "title":"He keeps you for himself"
        },
        "122121":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "...takes her out of his ass to pleasure his dick",
                "...lets out another fart"
            ],
            "content":"<div class=\"\"><div> <span>The prisoner continues to rub his butt on Jenny, laughing deeply while doing so. He is in full control of this teenage girl, and he intends on enjoying every minute of it. He eventually stops, and begins to press down on the poor girl. Realising what her life may officially become, Jenny begins to cry. The prisoners shit smells putrid, and presses into the pores of Jenny's skin.<br>\r\nAs Jenny cries, she continues to squirm,<br>\r\n\"JUST LET ME OUT YOU GROSS FUCK!!\"<br>\r\nThe prisoner responds with great timing, letting out another huge fart [FFRRRRRRRTTTTT] followed by a groan of relief,<br>\r\n\"Still acting up? What a lively bitch you are.\" he states, with tears in Jenny's eyes, she responds,<br>\r\n\"Get off of me! This is fucking disgusting dammit!\"<br>\r\n\"Mmm, a woman in need of discipline haha!\" the mean, muscular prisoner gloats, \"I'll soon train you into a bitch that will happily lick my ass clean!'<br>\r\n\"WHAT!?!\" Jenny yells, even opening her mouth in such a putrid place is difficult for Jenny, the prisoner's ass stinks so bad that even if she weren't so embarrassed, she'd be tearing up anyway.<br>\r\n<i>This has to be a dream</i> Jenny thinks, <i>But why am I having such a freaking gross dream???</i><br>\r\nFeeling an itch, the prisoner reaches his hand back and uses Jenny to scratch his ass crack, pushing her deeper in. As Jenny feels the manly hand push her into the putrid, hairy buttocks of this man, she realises what anyone else would have realised much sooner; this is not a dream. As she realises this, the prisoner lets out another fart, [BOMPHHHHHHHHHHH]. Not wearing any clothes, Jenny feels the fart vibrate inside of her vagina, tickling her clitoris and making her feel aroused. This makes her even more hysterical and causes her to begin balling.<br>\r\n\"NOOO! STOP, PLEASE!\"<br>\r\n\"Oh yeah, cry some more, bitch, cry as you learn a woman's place!\" the prisoner states proudly as he sits back, patting his muscular, rumbling gut, still full of gas.<br>\r\n\"I'll feed you my gas every day, as well as my urine and my sperm.\" He states, \"You'll lick my ass clean every time I take a good shit,\" The prisoner nods his head in a very cocky manner, \"Women are so pathetic without a man.\" He states to himself before clenching his ass cheeks, squeezing Jenny greatly. Jenny cries as he...</span></div></div>",
            "created":1387602000,
            "id":1711057,
            "title":"The prisoner keeps going"
        },
        "123":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Baba is standing there",
                "She explores her room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The next day Jen woke up and found herself covered in her own bedsheets. She pushes her way out only to realize that everything in her room is now huge and she has shrunken to half an inch tall! Jen looks around and screams.</span></div></span></div>",
            "created":1153630800,
            "id":333897,
            "title":"Shrunken!"
        },
        "1231":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "puts Jen in her adult diaper",
                "swallows Jen whole"
            ],
            "content":"<div class=\"\"><div> <span>The Gypsy woman herself was standing there.<br>\r\n<br>\r\n\"Dear dear little one, no one can hear you scream everyone else has left the house. Its just you and me pipsquek. I warned you not to make fun of me. Now I'm going to teach you a lesson.\"<br>\r\n<br>\r\nBaba snatches Jen up as she tries to run away and brings her to her face.<br>\r\n<br>\r\n\"It no use. You're mine now.\"<br>\r\n<br>\r\nBaba then....</span></div></div>",
            "created":1153630800,
            "id":333911,
            "title":"Baba the Giant"
        },
        "12311":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "she farted again",
                "something worse"
            ],
            "content":"<div class=\"\"><div> <span>\"I hope you enjoy it where you're going. Altough I doubt you will.\"<br>\r\n<br>\r\nBaba shoved the screaming Jen into her adult diaper. The smell alone was enough to make Jen gag. Baba let out a long silent but deadly fart making Jen's eyes water.<br>\r\n<br>\r\n\"Consider yourself lucky dear in my old age sometimes I can't control myself. Hence the diaper.\"<br>\r\n<br>\r\nJen screamed more at the thought of what she might be faced with.<br>\r\n<br>\r\nBaba was on her way home when...</span></div></div>",
            "created":1153630800,
            "id":333924,
            "title":"Into Baba's diaper"
        },
        "1232":{
            "author_id":"boywithpen",
            "author_name":"boywithpen",
            "choices":[
                "She falls of the table.",
                "Gets lost in the dust fog."
            ],
            "content":"<div class=\"\"><div> <span>Jen lifted the heavy sheet over her head and slowly crawled out. She looked around and saw towering walls around her, huge castle-sized pillows covering her view. She hesitated and lifted herself on her pillows to get a better view of things.<br>\r\n<br>\r\nEverything was huge; the room was pretty dark with the exception of her glowing alarm clock and now very bright night light. She gingerly tippy toed and slid down her pillows and landed on her night stand. <br>\r\n<br>\r\nThe wood was cold and creaked with every step. Jen coughed up a storm of dust as she walked towards her lamp. “I never knew how dusty it was up here…” Jen said as she approached a day old bowl of cereal that she never brought downstairs. <br>\r\n<br>\r\nHer room was cold and Jen had no clue what to do. Her nightstand was filled with papers, dust, and apple jacks. She was a fairly messy person and now it came back to bite her in the butt. <br>\r\n<br>\r\n</span></div></div>",
            "created":1173330000,
            "id":387942,
            "title":"Day Old Cereal"
        },
        "13":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Partial Gender Change",
                "Full Gender Change",
                "New Curse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One question. How does she change?</span></div></span></div>",
            "created":1153026000,
            "id":331715,
            "title":"The Gender Question"
        },
        "131":{
            "author_id":"dragon_wizzard",
            "author_name":"The Dragon Wizzard",
            "choices":[
                "Men's Locker Room",
                "Women's Locker Room"
            ],
            "content":"<div class=\"\"><div> <span>The next morning, she wakes up late because her power went out during the night. She hurries in the shower and dresses as she runs out of the house. Barely making it to class on time, she starts to talk just a little bit deeper. Not too noticeable at first, but by the time she gets to cheer practice, the entire squad is talking about how deep her voice has gotten. Now there are some women who have a really sexy deep voice, but hers has gotten really rough. The last thing they do before the end of rehearsal is the pyramid. Kelly, the girl on the bottom right on the second level just happens to look up and see something not quite right with Jenny. There is a bulge at her Hello Kitty picture on her thong, and that's not all that's appeared. Kelly turned her head as fast as she can and screams at the top of her lungs! doing so, crumbled the pyramid and the entire squad runs to see what's wrong with Jenny, who is running to the locker room. She gets to the door and sees both men's and women's doors and is confused which one to go in to.</span></div></div>",
            "created":1153544400,
            "id":333683,
            "title":"The Next Morning"
        },
        "1311":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "She uses the urinal",
                "she uses the stall"
            ],
            "content":"<div class=\"\"><div> <span>      When she rushes into they boys locker room she is relieve to see that only one boy is still in there, Charlie.  He always has his nose in a book and for years you have enjoyed pushing him around because he is so timid.  <br>\r\n<br>\r\n    Charlie pauses his sixth time reading \"Lord of the Ring : The Two Towers\" long enough to realize a girl has entered forbiddened territory.  \"Hey, You can't be in here.\" he cries weakly.<br>\r\n<br>\r\n    \"Shut up nerd, I'll go where I please\" Jenny roars in a husky voice.  As Charlie cowers from her, sje feels almost herslef agian.  However, that feeling doesn't last long when she realizes that her bladder is full.  At first she heads to on of the stalls then reconsiders.  \"Charlie won't say anything\" she mutters to herself.  She has harbored a secret dream to use a urinal at least once in her life.  Now is her chance.</span></div></div>",
            "created":1154408400,
            "id":336550,
            "title":"To Stall, or not to Stall"
        },
        "13111":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "It was Charlie",
                "It was her boyfriend Josh"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jen rushed over and used the urinal. She let her urine rush out of her and, altough it felt good, she couldn't help but feel wierd.<br>\r\n<br>\r\nWhen she was done she noticed someone staring at her wide mouthed.</span></div></span></div>",
            "created":1154408400,
            "id":336555,
            "title":"Using a Urinal"
        },
        "131111":{
            "choices":[
                "The girls step aside, allowing her to go after Charlie.",
                "The girls pull her back into the br, stripping her clothes from her."
            ],
            "content":"<div class=\"\"><div> <span>\"You'd better not say a thing if you know what's good for you!\" Jen muttered darkly, still holding her penis. Unknowingly, she had started stroking it and it was growing hard.<br>\r\n<br>\r\nCharlie grinned and asked, \"Or what?\" as he whipped up his cell and snapped a picture. He was off like a shot, leaving Jen standing there dumbfounded. She took off after him, her penis bobbing up and down as she ran. <br>\r\n<br>\r\nJen hesitated when she got to the gym door. She tucked her erection back into her thong, then raced out. The cheerleading squad was waiting there. \"What's going on, Jen?\" several of them called as they surrounded her.<br>\r\n<br>\r\n\"Move!\" she bellowed as she started to push her way through, intending to beat the crap out of Charlie.</span></div></div>",
            "created":1157778000,
            "id":345524,
            "title":"Bluff?"
        },
        "13112":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "Charlie",
                "The entire football team"
            ],
            "content":"<div class=\"\"><div> <span>      \"I don't care if it is only Charlie, there's no way I'm peeing infont of someone else.  Thats just gross\" Jenny mumbles to herself.<br>\r\n<br>\r\n     When she enters the stall she plans to sit down like she always did.  However, the toilet seat is dripping with urine.  Standing there, she lowers her skirt and panties then terntatively grabs her new tool.  When she relases a steaming stream of piss her aim is off.   She doesn't care since the seat was already filthy.  Soon she learns how to contol it properly and the sound of water splashing can be heard.  <br>\r\n<br>\r\nWhen done, she pulls up her clothes and opens the door.  Standing outside is...<br>\r\n<br>\r\n   </span></div></div>",
            "created":1154581200,
            "id":337008,
            "title":"Her Aim Is Off"
        },
        "1312":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She discovers other changes in her body",
                "The girls walk in"
            ],
            "content":"<div class=\"\"><div> <span>Jenny runs into the girls lockeroom wondering why she even considered going into the boys lockeroom. As she runs in she can feel somthing bouncing in her thong.<br>\r\n<br>\r\nShe pulls off her pants and screams as she grabs her penis. She bounces it in her hands and screams again, in a deep manly voice.</span></div></div>",
            "created":1153544400,
            "id":333685,
            "title":"Jen's discovery"
        },
        "13121":{
            "author_id":"boywithpen",
            "author_name":"boywithpen",
            "choices":[
                "The smell is masked.",
                "Her BO isn't going away!"
            ],
            "content":"<div class=\"\"><div> <span>As Jenny flails her arms in the air she notices a foreign fragrance in the air. She sniffed around and smelt that she had terribly outrageous body odor! Jenny screamed as she took a seat trying to figure out what to do. She held her small but stiff cock in her hand as her odor spread through the room. <br>\r\n<br>\r\nShe brushed back her hair and tried to tuck away her penis. She combed through her locker for her deodorant which she couldn’t find. “What the hell?” Jenny said because of the lack of a deodorant.<br>\r\n<br>\r\nAs she frantically went through the other girl’s bags she finally found a deodorant and she quickly rubbed it in her sweaty armpits. She sniffed the air once more…<br>\r\n</span></div></div>",
            "created":1173157200,
            "id":387276,
            "title":"Odor Alert"
        },
        "132":{
            "author_id":"dolphin87",
            "author_name":"Shagerzol",
            "choices":[
                "She claims to have a sore throught",
                "She freaks out"
            ],
            "content":"<div class=\"\"><div> <span>She was going to go see Josh now it was Friday night and they had a great date planned.  Josh was the most popular guy in the high school.  Jenny thought they were the perfect match, because every guy wanted her and every girl wanted him.  She loved rubbing the fact that she had him and noone else could in every nerd and fat girl's face.<br>\r\n<br>\r\nThe date went great and they ended up at Josh's house his parents where out of town on a buissness trip for the weekend.  The watched a chick flick and things started getting a little hot and heavy.<br>\r\n<br>\r\nThey made out for what seemed like hours when Josh started kissing Jenny's neck again, when suddenly he stopped.<br>\r\n<br>\r\n\"Is something wrong baby?\" She asked.  He had never done this before.<br>\r\n<br>\r\n\"Ya, ya, you have an adam's apple!!!\" He blared.</span></div></div>",
            "created":1153544400,
            "id":333696,
            "title":"A Night with Josh"
        },
        "1321":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She notices other changes in her body",
                "She is a little tubbier"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Ummmm.... it must be a sore throat. Maybe I should leave. Don't want you to catch anything.\"<br>\r\n<br>\r\nJen hesitantly ran out leaving Josh sitting on the couch curiously.<br>\r\n<br>\r\nWhen Jen gets home...</span></div></span></div>",
            "created":1153630800,
            "id":333863,
            "title":"Jen fakes it"
        },
        "13211":{
            "author_id":"dolphin87",
            "author_name":"Shagerzol",
            "choices":[
                "Her parents run to see whats wrong",
                "She shaves it off"
            ],
            "content":"<div class=\"\"><div> <span>She goes to take a shower hoping to get it off of her mind.  She felt her throat it felt so real what was happening to her?  She said forget it and was exauhusted from all of the days activities and just wanted some rest.<br>\r\n<br>\r\nShe was hungrier than usual and wandered if something wrong.  SHe thought of what seemed to be the worst case senero was she pregnate?  Josh would kill her; she would have to get an abortion there is no way she would be able to tell her parents.  The hated JOsh enough already said he was a bad influence.  What would the people from school think, and josh's parents would hate her for sure then.  Especially with the football scholarship he was gaurennteed.<br>\r\n<br>\r\nShe stepped in her room to get dressed and caught a glimpse of herself in the mirror and let out a blood curtling scream.  She was growing chest hair!!!!!!</span></div></div>",
            "created":1153717200,
            "id":334278,
            "title":"HAiry Changes"
        },
        "132112":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "More hair",
                "She has something \"extra\" between her legs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jen quickly shaved off the hair on her chest. Freaking out she rushed to put on her underwear when she notices...</span></div></span></div>",
            "created":1153717200,
            "id":334317,
            "title":"Shaving time"
        },
        "1321121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There was even more hair and it was on parts of her body, where she never had hair before. For example her arm pits now had a very think and dark bush of hair and while glancing into the mirror again she saw that she had now a 5'o clock shadow….</span></div></span></div>",
            "created":1278306000,
            "id":911976,
            "title":"More hair"
        },
        "1321122":{
            "author_id":"peterhenry",
            "author_name":"Random Reader",
            "choices":[
                "Try escape from your bedroom somehow.",
                "Try fool your mother somehow."
            ],
            "content":"<div class=\"\"><div> <span>Jenny couldn't believe what she was seeing. Between her legs, the most feminine symbol possible was no longer the same. On the contrary, it had become the most masculine symbol of all. Jenny can't comprehend but she has a penis. <br>\r\n<br>\r\nShe freaked out and lays on the corner of her bedroom walls. \"This is a bad dream! There's no way I have this thing on my perfect woman body!\"  She doesn't care what her eyes see as she refuses to believe the sight of the reddish hairy member between her thighs. Suddenly, her breasts begin to shrink and hair grows back in her chest, as well as in her armpits. \"No! No! No! Please no! I don't understand! Somebody help me!\". She scream, but her voice didn't seems the same, it looked more manly, in fact.<br>\r\n<br>\r\nMinutes pass with her screaming and crying as the transformation continues and concludes. She was scared and speechless, took off her clothes and went to look in the mirror. There was no doubt, \"She\" is \"He\" now. \"Oh my god! Think Jenny! There must be some kind of logical explanation for this illogical problem, I like men but I don't want to be one. Will I pinch myself to wake up from this dream or-\"  \"His\" voice was cut off when there was a knock on the door.  \"Honey, I heard a boy's voice here. First I thought it was Josh but it doesn't sound like him. Who's there?\" It was the voice of Jenny's mother. \"Crap, what i gonna do?\"</span></div></div>",
            "created":1578718800,
            "id":2772242,
            "title":"The transformation completes."
        },
        "1322":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Run out crying.",
                "Tell him he better keep his mouth shut."
            ],
            "content":"<div class=\"\"><div> <span>\"What?\" Jenny squawked, reaching up to grab her throat.  Sure enough, there was a decent sized lump in the middle of her throat.  She looked at Josh, seeing his disgusted, questioning look.  She tried not to panic.  \"It's not an adam's apple,\" she said earnestly. \"It wasn't there this morning.\"  Then she tried a new tactic.  \"Oh god, what if it's cancer?\" <br>\r\n<br>\r\nJosh looked like he was thinking over this situation real hard.  She didn't blame him, she was thinking over it too.  What the hell was this on her throat?  And what was that feeling between her legs?  That definitely wasn't something that should be there.  She crossed her legs and grabbed one of the pillows, holding it in front of her, trying to make it look like she was hugging it for comfort instead of to hide what was going on down there. <br>\r\n<br>\r\n\"Maybe you should go get it checked out,\" Josh said, leaning a bit closer and looking at her neck again.  His face twisted in disgust.  \"Like right now.\"<br>\r\n<br>\r\n\"It's like two in the morning,\" she protested, knowing he was just trying to kick her out.  The truth of the matter was, she wasn't sure whether she should stay or go.  She'd hate to have Josh see something he shouldn't.  Hell, she hated to see something she shouldn't.  <br>\r\n<br>\r\n\"Well it's an emergency, right?\" he asked, standing up and walking to the door, opening it up for her.  \"Get your mom to drive you or something.\"  <br>\r\n<br>\r\nJenny sighed, felt tears stinging in her eyes.  What was happening.  She stood up and saw Josh's eyes widen and his face pale.  <br>\r\n<br>\r\n\"What is that?!\" he yelled and pointed at her.  She looked down at herself and saw a lump in her jeans that shouldn't be there either.  She looked up at him, mortified. </span></div></div>",
            "created":1155099600,
            "id":338139,
            "title":"New Parts"
        },
        "133":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "She leaves for school",
                "She farts agian"
            ],
            "content":"<div class=\"\"><div> <span>      After leaving the party, Jenny went straight home and went to sleep.  She was enjoying a pleasant memory of her first time with Josh when things start to change.  Josh's hair grows long and blonde then suddenly he has become a human representation of a barbie doll.<br>\r\n<br>\r\n     Jenny bolts upright in her bed.  \"I must have drank too much last night, that dream was scary\"  she mutters to herself.  Then she realizes something is different between her legs.  Pulling up her nightgown she lets out a shriek as a six inch boner protrudes from her genital region.  <br>\r\n<br>\r\n     \"What has happened to me?\" she cries as she lets her nightgown fall down.  Just then she feels gas building up and decides to let it out.  She feels a change in her private area but before she can inspect it her door slams open.<br>\r\n<br>\r\n     \"What's wrong ,honey\"  her father questions as he enters her room.  \"I heard you scream.<br>\r\n<br>\r\n     \"It was just a nightmare, go back to bed dad\"  Jenny tells him.<br>\r\n<br>\r\n     \"Back to bed?  It's already 7:15.  You better hurry or you'll miss the bus.\"  With that he leaves.<br>\r\n<br>\r\n     As soon as he is gone she checks herself agian.  \"It must have really been a nightmare\" she whispers, but doesn't really believe it.  Quickly she picks out an outfit and gets dressed.  The bus will be here in five minutes.</span></div></div>",
            "created":1154408400,
            "id":336565,
            "title":"Morning Wood"
        },
        "1332":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "The Bus Ride"
            ],
            "content":"<div class=\"\"><div> <span>Jen let another one rip. What was wrong with her? She never did this.<br>\r\n<br>\r\nShe got dressed and went downstairs. She went outside and farted again and got on the bus.<br>\r\n<br>\r\nShe hoped no one would notice the slight bulge in her skirt.</span></div></div>",
            "created":1154408400,
            "id":336567,
            "title":"Unusual Gas"
        },
        "13321":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "She farts then gets off the bus",
                "She gets off the bus without farting"
            ],
            "content":"<div class=\"\"><div> <span>      As she sits on the bus by herself another air demon forces its way out.  Luckily it was silent and no one could tell where the smell can from.  However, once it was released her new friend appears once agian.  She keeps her book bag on her lap so no one will notice it.  <br>\r\n<br>\r\n<br>\r\n     \"Every time I break wind I change\"  she realizes in her head.  \"If only I could fart agian, perhaps it would disappear.\"  Luck is not on her sside as the bus pulls up to school and she still hasn't laid an air biscuit yet.  She just sits there as everyone leaves.  The driver gives her a dirty look.  </span></div></div>",
            "created":1154494800,
            "id":336715,
            "title":"Now you see it, now you don't"
        },
        "133212":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "She sits there until all the students leave",
                "She tries to hide in the crowd leaving the classroom"
            ],
            "content":"<div class=\"\"><div> <span>    When the driver starts stomping down the ailse towards her, she knows she can't stall any longer.<br>\r\n<br>\r\n     \"Alright, I'm going\"  She calls out as she gets up from her seat.  Her new little friend has gone limp so perhaps no one will notice it.  After exiting the bus, she heads toward her home room.  She takes her seat in the front of the class and continues to ponder her problem.  However, her thought are interrupted when the teacher walks in the door and everyone starts to giggle.  <br>\r\n<br>\r\n     Miss Tompkins just started teaching this year.  Most of the students like her because she is only 22 and can relate with them better than most of the older teachers.  She hasn't been teaching for the past two weeks and today is her first day back.  Jenny looks up and sees the source of everyones laughter.  It seems that Miss Tompkins had a bit of plastic surgery done andnow her breasts are quite large.<br>\r\n<br>\r\n     \"You may all have noticed something different about me\" the hot teacher says.  \"Well, I'm young and I deserve to look the best that I can.  Just so there are no wild rumors flying around, I'll answer any questions that you have now.\"<br>\r\n<br>\r\n   All of the guys raise their hands and alot of the girls too.  One by one she answers them openly and honestly, but Jenny isn't paying attention.  Her eyes are glued to Miss Tompkins new assets.  While she doesn't raise her hand, something else is standing straight up, begging to be noticed.  Jenny folds her arms in her lap to cover her erection, but must make a choice when the bell rings.</span></div></div>",
            "created":1157173200,
            "id":344069,
            "title":"Boob Job"
        },
        "14":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She becomes a geek",
                "She gains an incredible appetite",
                "Other",
                "Choose a different curse",
                "Make a totally different curse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One quick question.<br>\r\n<br>\r\nHow does her personality change?</span></div></span></div>",
            "created":1153026000,
            "id":331710,
            "title":"Just a quick but important question"
        },
        "141":{
            "author_id":"agentj",
            "author_name":"agent cheiftain",
            "choices":[
                "Slow",
                "Fast",
                "Immediate"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How fast are the changes?</span></div></span></div>",
            "created":1301115600,
            "id":1076519,
            "title":"She becomes a geek"
        },
        "143":{
            "choices":[
                "started flirting with  Daphne ",
                "asks Katie on date",
                "ask Jessica to be your lab partner"
            ],
            "content":"<div class=\"\"><div> <span>Jen wakes up the next day and it seems to be normal she got dressed in the most reveling thing she could. She want to school as she walked down the hall she couldn't keep her eyes off the girls even as she passed them she was checking out ever girl she passed and she thought why was she doing this it like her body was taking over her. When one of her fellow cheer leaders came over to talk to her she gave them a big hug feeling there body on hers and grabing there butts. the rest of the day want like this but the weirdest thing was that she...</span></div></div>",
            "created":1212210000,
            "id":538122,
            "title":"lesbain"
        },
        "1432":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "girly girl clothes",
                "just boxers",
                "pulled over buy a girl cop "
            ],
            "content":"<div class=\"\"><div> <span>\"Uhm sorry Jen Im not into girls\" she said In a joking maner. \"but hey Ill stop buy later to see how your doing your acting very odd today\" Ok katie make sure you shorten that skirt\" you say with a creepy grin and walk away. You think why in the world you would say taht as you get into your car in a very un-lady-like way. \"Shit this is uncomfertable why am I wearing this stuff, I need some guy clothes.\" you say and grab a bag on the passenger seat of your car. <br>\r\n<br>\r\nwhats in it</span></div></div>",
            "created":1275541200,
            "id":893893,
            "title":"asks Katie on date"
        },
        "14322":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Go to An Army Surplus Store For New Butch-Like Clothing",
                "Go Somewhere Else to Get New Clothes"
            ],
            "content":"<div class=\"\"><div> <span>Jenny opened the bag and took out its contents: a pair of boxers.  That's right, those were her boyfriend's (soon to be <i>ex</i>-boyfriend's).  Josh had left them at her place and she was going to give them back to him.  But ... looking at them, she had a better idea.<br>\r\n<br>\r\nShe took off her skirt and her panties, then put on the boxers.  They were a little loose on her feminine frame (mostly around her legs), but she felt a whole lot better.  But why stop there?  She needed to replace all this other girly shit she was wearing too, so why not do it right now?  Then, when she's properly dressed, she can out scoping for chicks.  At the back of her mind, she knew that there was something wrong with all of this, but she chose to ignore it.</span></div></div>",
            "created":1365656400,
            "id":1569826,
            "title":"Josh's Boxers"
        },
        "143221":{
            "author_id":"aceking",
            "author_name":"Ace of Kings",
            "choices":[
                "On the way back home Jenny meets up with Katie",
                "Jenny arrives home withou incident "
            ],
            "content":"<div class=\"\"><div> <span>As Jenny drove home the strange feeling she had when she got into her car grew worse. It was like everything about her felt wrong and misshapen, her hair was too long, her muscles were too small, her clothes were to girly, and she wore to way to much make up. The boys boxers helped this strange itch, but it was still getting stronger. <br>\r\n<br>\r\nLuckily for Jen she was able to hold out for the entire drive home. But upon entering her bedroom her will power just dissolved into nothingness. It was just too girly. The walls where a bright pink and lined with posters of boy bands and male models, there where pictures of her in dresses and cheerleader outfits, the closest and draws were filled with said dresses and cheerleader outfits as well as a collection of other high-end fashion items. There were make up sets, cheesy romance novels, stuffed animals, all about the room and a collection of Play-Boy magazines beneath her bed that once would have made Jen horny just thinking about them, now made her feel dirty. <br>\r\n<br>\r\nJenny had to get rid of all this crap, she knew this wasn't how she normally feel, but she just had to get rid of all this crap. So Jen changed into her least femmine outfit that she had, a pair of tight gray sweat pants, pink running shoes, and a black t-shirt. She then made a shopping list of everything she was going to need with clothes at the top of the list. Then after thanking God for having her parents gone on a cruise for the next three weeks and left her their debit card, Jen got into her car and drove off. <br>\r\n<br>\r\nThe closest place to buy the clothing she needed was an Army Surplus store. Jenny couldn't believe that she was going into this lower class rat nest, but her body demanded that she put on something a lot more masculine than just some boxers. So through the double glass doors she went and the moment the musty smell of the store hit her face the strange feelings decreased a little bit. Some of the other customers give her some strange looks, but Jen ignored them and started browsing. Not wanting to be seen by someone she knew, Jen quickly picked up a whit t-shirt with the word ARMY in big black print, camouflage pants, and black army boots. Bearly stopping to see if they were the right size, Jen paid an old guy with white hair, and quickly went into the fitting room to change. <br>\r\n<br>\r\nPutting on her new clothes Jen noticed that they where a bit big on her, but felt SO much better than that sissy shit she had been wearing. Leaving the store Jen also couldn't help but noticed all the different kinds of weapons they had on display and how cool they all looked. <br>\r\n<br>\r\nGetting into her car Jenny drove to her next destination, a fitness store where she picked up some protein shakes and other muscle building products, then to a clothing store where she got some boy clothes for her to wear, and followed by going to the video store where she bought a couple of action movies and new posters for her bed room and new life style. After this Jenny had one finally place to visit, the hair salon. When she arrived her normal stylist Judy was almost in shock to see Jenny go through such a radical change and was even more shocked when Jenny asked her to give her a short Mohawk cut. When asked about her new style Jenny replied that she was just going for a new look. <br>\r\n</span></div></div>",
            "created":1397451600,
            "id":1779452,
            "title":"Going Shopping "
        },
        "1432211":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Baba's Curse is Spread to Katie, Turning Her Into a Lesbian Too",
                "Katie Runs Away and Tells Her Other Friends About Jenny's Change"
            ],
            "content":"<div class=\"\"><div> <span>Katie was on her way to Jenny's house.  Her friend had been acting strange all day.  In fact, if she didn't know any better ...<br>\r\n<br>\r\nThat thought died in her head the moment she saw Jenny driving towards her from the opposite direction.  It was definitely her car, that's why she assumed that it was Jenny.  But the person driving didn't look anything like her friend.  Dressed in army surplus clothes and having a short Mohawk hairstyle.  She couldn't even tell if the person was male or female.  Nonetheless, when the driver spotted Katie, the car pulled up alongside her and the driver's side window slid downward.<br>\r\n<br>\r\n\"Hey, bitch,\" the driver said, smiling.<br>\r\n<br>\r\nIt took Katie a moment to realize that this was, in fact, Jenny.<br>\r\n<br>\r\n\"Jenny?  Is that you?  What ... what <i>happened</i> to you?\" Katie asked, stunned.  \"Is ... is this part of a prank or something?  Did someone dare you?\"<br>\r\n<br>\r\n\"What?  <i>This</i>?\" Jenny asked, gesturing to herself.  \"Nah.  I just wanted something new.  I was tired of all that girly shit.\"<br>\r\n<br>\r\nThis <i>was</i> Jenny.  It was her voice and her face.  But the rest of her ... it was like she was another person.<br>\r\n<br>\r\n\"Jenny, I don't know what's gotten into you, but ...\"<br>\r\n<br>\r\n\"Cut the crap, Katie, and get in the car.\"<br>\r\n<br>\r\n\"What?  Why?\"<br>\r\n<br>\r\n\"Cause I wanna have sex and you look too smokin' hot right now to pass up.\"<br>\r\n<br>\r\nKatie was appalled.  \"I'm not into girls!\"<br>\r\n<br>\r\n\"But I am.  Now get in the car before I make ya, bitch.\"<br>\r\n<br>\r\nKatie was really getting afraid now.  What had happened to her friend?</span></div></div>",
            "created":1397883600,
            "id":1782586,
            "title":"Katie Meets the New Jenny"
        },
        "14322111":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Katie Will Become the Same Type of Lesbian as Jenny",
                "Katie Will Become a Different Type of Lesbian"
            ],
            "content":"<div class=\"\"><div> <span>Katie was frozen in fear.  What had happened to Jenny?  Why was she acting this way?<br>\r\n<br>\r\nSeeing that Katie wasn't doing as she was told, Jenny reached out and grabbed her arm, pulling her closer to the car.  \"I said get in the car, bitch.\"<br>\r\n<br>\r\nAnd then it happened.  What felt like an electric shock had passed between them.  Jenny had unknowingly passed on Baba's curse to Katie.  Within the next 24 hours, Katie would become a lesbian too, and most likely, Jenny's lover.  But what kind of lesbian would she become?  The same as Jenny?  Or a different kind?</span></div></div>",
            "created":1397883600,
            "id":1782589,
            "title":"Katie Gets the Lesbian Curse Too"
        },
        "143221112":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "A Lipstick Lesbian",
                "Some Other Kind of Lesbian"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Within the next 24 hours, Katie would become a lesbian too, and most likely, Jenny's lover.  But she wouldn't become the same type of lesbian as Jenny, so what kind <i>will</i> she become?</span></div></span></div>",
            "created":1397883600,
            "id":1782591,
            "title":"A Different Type of Lesbian"
        },
        "1432211121":{
            "author_id":"aceking",
            "author_name":"Ace of Kings",
            "choices":[
                "Jenny keeps her promise",
                "Jenny acts like a pig"
            ],
            "content":"<div class=\"\"><div> <span>Katie was worried about her friend Jenny, she went from captain of the cheerleaders to a lesbian dyke in the span of just one day. It scared her to see her friend change so rapidly, which is why Katie decided to go with her, so she could figure out what happen to Jen. That was the one and only reason for her to agree to this date, and her decision had nothing to do with the tingly feeling that she felt in her neither regions. None what so ever. <br>\r\n<br>\r\n\"Fine Jen, I'll go on a date with you.\" Katie replied sternly as she pulled out of Jen's grasp. \"But we are laying down some ground rules for you to follow. First if we are going to do this we are going to do this properly. This is to be an actual date and not just a half harted attempt by you to get me in bed, I am not the type of woman who just passes from lover to lover. Rule number two, no more calling me bitch or babe and most certainly no more grabbing, you are to act like a civilized person and not like some horny street thug. Rule number three, you don't get to ask me to have sex, I will be the one to decide if this date ends in the bedroom, not you.\" <br>\r\n<br>\r\n\"So there is a chance I'm getting laid to night!\" Jenny said with glee. <br>\r\n<br>\r\n\"I said no such thing!\" <br>\r\n<br>\r\n\"You just said, and I quote, 'I will be the one to decide if this date ends in the bedroom,' which implies you may want to have sex with me\" <br>\r\n<br>\r\n\"Fine. If you wish to interpet it that way then you may do so, as long as you agree to follow my rules.\" <br>\r\n <br>\r\n\"Sounds fair to me.\" Jen said with a big smile on her face. </span></div></div>",
            "created":1398229200,
            "id":1785485,
            "title":"A Lipstick Lesbian"
        },
        "14322111212":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Katie Ends the Date ... Jenny is Pissed, But Lets Her Go",
                "Katie Finds That She Kind of Likes How Jenny is Treating Her"
            ],
            "content":"<div class=\"\"><div> <span>The date didn't start off very well, and to tell the truth, the date itself wasn't too good either.<br>\r\n<br>\r\nFirst, they went out to a public place (the mall, specifically), which Katie was against, but it wasn't breaking one of her rules, so she couldn't complain.  She was just humoring Jenny, going out on this date with her.  She wasn't a lesbian or even bisexual.  If anyone she knew saw her ... she'd never be able to deny this to anyone.<br>\r\n<br>\r\nAnd if that were the only problem, Katie figured it would have been a fair enough price to pay.  But it wasn't the only problem.<br>\r\n<br>\r\nJenny didn't just break one of her rules.  She broke <i>all</i> of her rules.  Apparently, she couldn't stop herself from calling Katie an assortment of names, including \"bitch\", \"babe\", \"slut\", and others, and she was being very loud about it, grabbing a lot of attention from other people.  Katie just wanted to crawl into a very dark space and hide.  She was so embarrassed.  And mad.  Jenny had no intention of acting civil.  She just wanted to get Katie into bed with her.  And she broke rule number three at least <i>five times</i>, asking her if it was time that they end their \"date\" and get to fucking already.<br>\r\n<br>\r\nKatie was so turned off.  Jenny used to be a close friend, but now she didn't want anything to do with her.  Jenny really was like some kind of horny lesbian street thug.  And more than anything, she wanted to get out of her \"date\" with her.<br>\r\n<br>\r\nBut even so, there was something ... some intangible feeling at the back of her mind that compelled her to stick with their \"date\".  She most certainly was not interested in sex with another girl, but ... she felt some kind of connection to Jenny that she hadn't felt before.<br>\r\n<br>\r\nWhat Katie failed to realize was that she was slowly turning into a lesbian.  A lipstick lesbian, to be exact.  And as the hours passed by, she was going to start feeling and acting more like one, and accepting all of the changes as they happen.</span></div></div>",
            "created":1398402000,
            "id":1786525,
            "title":"Jenny Acts Like a Pig"
        },
        "1432211122":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "A Leather-Loving Overweight Biker Dyke (Katie Will Slowly Gain Weight)",
                "Some Other Kind of Lesbian"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Within the next 24 hours, Katie would become a lesbian too, and most likely, Jenny's lover.  But she wouldn't become the same type of lesbian as Jenny, or even a lipstick lesbian, so what kind <i>will</i> she become?</span></div></span></div>",
            "created":1397883600,
            "id":1782594,
            "title":"A Different Kind of Lesbian"
        },
        "144":{
            "choices":[
                "Pregnancy Spell",
                "\"Fake\" Pregnancy",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a Pregnancy Spell? Jen could either really be pregnant or just a \"fake\" pregnancy which gave all the effects of pregnancy and a permanent belly. </span></div></span></div>",
            "created":1214197200,
            "id":547696,
            "title":"How about Pregnancy or \"Fake\" pregnancy"
        },
        "1442":{
            "choices":[
                "Jen's fake pregnancy happens like a real one.. but with no end.",
                "Jen suddenly wakes up overnight lookng pregnant",
                "Jen's always seen herself as looking pregnant? "
            ],
            "content":"<div class=\"\"><div> <span>Will Jen's \"fake\" pregnancy happen over time, like a real one? <br>\r\n<br>\r\nOr will she wake up suddenly one morning with a pregnant looking stomach?<br>\r\n<br>\r\nIs it sudden and happens overnight. But.. Jen seems to think she's always been that way?</span></div></div>",
            "created":1308286800,
            "id":1128181,
            "title":"\"Fake\" Pregnancy"
        },
        "14422":{
            "author_id":"frank1885",
            "author_name":"Frank",
            "choices":[
                "They'll notice. ",
                "They think shes always been preggo."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The next morning Jenny will wake to her new form and notice the change. But will everyone else, or will they think she's been all preggo before hand?</span></div></span></div>",
            "created":1313298000,
            "id":1167925,
            "title":"Jen suddenly wakes up overnight lookng pregnant"
        },
        "144222":{
            "author_id":"frank1885",
            "author_name":"Frank",
            "choices":[
                "1-5",
                "6+"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How many babies is her fake pregnancy?</span></div></span></div>",
            "created":1313298000,
            "id":1167929,
            "title":"How many? "
        },
        "1442222":{
            "author_id":"frank1885",
            "author_name":"Frank",
            "choices":[
                "6",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How many babies?</span></div></span></div>",
            "created":1313298000,
            "id":1167931,
            "title":"How many?"
        },
        "14422222":{
            "author_id":"frank1885",
            "author_name":"Frank",
            "choices":[
                "7",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How many babies?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1313298000,
            "id":1167933,
            "title":"How many?"
        },
        "144222222":{
            "author_id":"frank1885",
            "author_name":"Frank",
            "choices":[
                "8",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How many babies?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1313298000,
            "id":1167935,
            "title":"How many?"
        },
        "1442222221":{
            "author_id":"frank1885",
            "author_name":"Frank",
            "choices":[
                "Early on, smaller belly.",
                "Much later on, bigger belly. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How far along will Jenny be?</span></div></span></div>",
            "created":1313298000,
            "id":1167937,
            "title":"How far?"
        },
        "14422222212":{
            "author_id":"frank1885",
            "author_name":"Frank",
            "choices":[
                "She interupted as her mother enters the room",
                "She struggles to get out of bed. "
            ],
            "content":"<div class=\"\"><div> <span>Jenny woke up the next morning feeling different. For some reason she was propped up on some pillows. She opened her eyes and looked down at herself and gasped in shock. Her normally large and perky DD breasts were most likely twice that size. Past her breasts she could see an enormous mass that was her stomach. It was perfectly round, gigantic, and hers. And it wasn’t there only hours ago. <br>\r\n<br>\r\nWhat does Jenny do?<br>\r\n</span></div></div>",
            "created":1313298000,
            "id":1167945,
            "title":"Insta-Octomom"
        },
        "145":{
            "author_id":"me_duh_inc",
            "author_name":"me_duh",
            "choices":[
                "She goes to find Baba",
                "She tries not to insult anyone else"
            ],
            "content":"<div class=\"\"><div> <span>The rest of the day continued as normal. At the corner of her street, Jenny and her friends parted ways. Across the street from her house an overweight child fell off his bike, and Jenny didn't hesitate to rub it in his face, ceasing only when one of her neighbors went to make help the boy up. <i>Kids like that should be sent away until, and if, they look better.</i> Jenny thought as she walked through her front door. <br>\r\n<br>\r\nThe next morning, as usual, Jenny spent 15 mintues admiring and scrutinizing her body in her full length mirror. Satisfied that she still looked perfect, Jenny decided to finish getting ready for school. Just as she was turning around, however, she noticed something in her reflection. Spinning around fast enough to give anyone else whiplash, Jenny looked intently into the mirror again. This time her face so close her eyelashes nearly touched the glass. What she saw nearly gave her a heart attack.<br>\r\n<br>\r\n\"No way is that a zit. I cannot have a zit!\" Once her initial denial had passes, she pulled out her makeup, and used a riduculous amount of concealer.<br>\r\n<br>\r\nFinally accepting that her appearance hadn't completely deteriorated, Jenny went to school. Despite the large zit on her forehead, Jenny considered her morning very successful. Before her first class, she, her boyfriend, and the cheerleading squad stutting the hallways, everyone parting before them. She almost managed to insult two kids to tears.<br>\r\n<br>\r\nAfter her first class, Jenny decided to stop by the bathroom to see if the blemish had disappeared yet. To her unbearable horror, two more zits had appeared on her face (one on her chin, and one right on the tip of her nose). As she frantically tried to cover up the two new developments marring her beauty, Katie walked to the sink next to her to wash her hands. Catching Katie's eye, Jenny's rage at her zits was transferred to Katie. \"What are you staring at you cow! You hefer! Do you like being ugly, is that it? Is that why you gave up cheerleading just for food? Are you attracted to those rolls of fat around your stomach? You disgust me! Do me a favor and go to a fat farm. I can't stand the sight, or smell, of you any longer!\"<br>\r\n<br>\r\nJenny didn't even care that Katie's eyes had begun to water by the time she turned away and left Jenny alone in the bathroom. Once she had covered up the zits, Jenny looked at herself in the mirror and could not believe her eyes. He stomach was no longer flat, but was sticking out from under her shirt. \"This can not be happening. I make fun of people who look like this and I.... Oh my god, that bitch. Baba what's her name must have done this to me. I insult people and I turn ugly, that's got to be it.\"</span></div></div>",
            "created":1160629200,
            "id":352299,
            "title":"Karma"
        },
        "1452":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "grabbed her now even softer stomach and ran off to gym class",
                "Let the insults fly again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenny tried to go through the day without insulting more people, but she ran into Dahpne as soon as she exited the bathroom.<br>\r\n<br>\r\n\"Watch out cow!\" screamed Jenny.<br>\r\n<br>\r\nSuddenly she....</span></div></span></div>",
            "created":1166936400,
            "id":367901,
            "title":"Trying not so hard not to insult people"
        },
        "14522":{
            "choices":[
                "Body swap with Daphne",
                "The more you make fun of her the more you appear like her"
            ],
            "content":"<div class=\"\"><div> <span>Your so fat people jog around you for excerise! Take a lesson from them.\"<br>\r\n<br>\r\n\"Your so fat on Halloween you say trick or fried chicken when you go to the door.\"<br>\r\n<br>\r\n\"Your so fat it takes me 2 buses and a train jsut to get to your good side. Which I still haven't found.\" <br>\r\n<br>\r\nAnd Jenny continued on insulting Daphne to the point of tears. Daphne bursted out crying and waddled away as best she could from this mean, mean girl. But what Jenny didn't realize is that as she keep insulting Daphne her weight became more and more like Daphne's. Daphne weighed around 350 pounds and with all the insulting Jenny did to her Jenny ended up around 300 pounds herself. <br>\r\n<br>\r\nWith each insult the weight just piled on. Slowly but surely she ended up almost as big as daphne herself. Good thing this was in an empty part of the second floor because Jenny's clothes were slmost right off her. Jenny's short shorts almost rip in two. Her now gigantic ass overflowing from the top and bottom. Cellulite covered her ass all the way down to her thighs. Those once sleek toned thighs now huge thunder thighs that rub together when she walked. Her belly shirt riding up so much it looked like a sports bra. Her belly made a spare tire forming 3 huge rolls that just sat under her waist line. Her boobs became huge about the size of DD spilling out of her bra. <br>\r\n<br>\r\nHer face wrapped in a double chin and two rosey red cheeks with dimples. Her arms with flab hanging from the bottom that didn't stop quivering. Her hair even turned Jet black and her face started to show traces of East Asian decent. She started to look almost exactly like Daphne. The only difference was about 50 pounds and a snotty attitude. Since it was the end of the day Jenny not realizing she looked like Daphne drove home to her empty house finding a note from her parents telling her they were on business in London for the next 3 months. <br>\r\n<br>\r\nJenny walked by a mirror to fix her makeup when she realized what had happened. She screamed at the top of her lungs and fainted. About two hours pass and you look in teh mirror to find the same result. Not believing what had happened still she slapped herself in the face and batted water on it. She waddled back over to the mirror and saw that she was a spitting image of Daphne Zhou. Jenny screamed \"Damn that Ba-\" but couldn't finish the sentence because she sounded like her. \"Well\" Jenny thinks \"I either was body Swapped with that Damn pig or the more I make fun of her the more I am like her. Wait, does that me Daphne looks like me? Whatever. \"  Jenny continued \"Screw that Baba, I know what it was, it's...</span></div></div>",
            "created":1212037200,
            "id":537342,
            "title":"fickle irony"
        },
        "145222":{
            "choices":[
                "check out the BBW dateing",
                " the go to school the next day as a new girl"
            ],
            "content":"<div class=\"\"><div> <span>she looked at herself some more and said.\"If Daphne losed 200lbs she would look good.\" when she said that the zits on her face where gone. Jen what on line and check her email it was all junk when she ready one about BBW dateing and said to herself. \"why would any one dat a fat girl like them?\" just then her faced started to look more european decent but now she looked haft Asian haft white but just then her belly grew into one big bawl.</span></div></div>",
            "created":1212210000,
            "id":538071,
            "title":"The more you make fun of her the more you appea..."
        },
        "1452222":{
            "choices":[
                "Daphne looked like her old body",
                "Daphne looked like her old body but fatter"
            ],
            "content":"<div class=\"\"><div> <span>Pissed off at baba for this damn curse Jen went off on how fat Daphne was. jenny jsut let the fat jokes fly and before you knew it she was looking exactly like Daphne. But something was different... Jen was fatter then Daphne ever was. She was waddled to the bathroom and found herself at 450 pounds. That's 100 pounds fatter then Daphne ever was! <br>\r\n<br>\r\nJen waddled to her room to find some of her older sister Roxanne's maternity clothes that she gave Jen in case she returned home. But when Jen opened the door something was different. The room was filled with empty food containers and Spice girl CDs. Her room was being transformed to look like Daphnes. Jen looked at her family photo in her room and saw that her sister was the same, her mom and dad the same, but she was different. She was fat and startung to look like Daphne. <br>\r\n<br>\r\nThat night Jen cried herself to sleep and went to school in her sister's maternity clothes. Everybody was calling her Daphne. She went to third period which she had with Daphne and when Daphne sat down she noticed that....</span></div></div>",
            "created":1214197200,
            "id":547695,
            "title":" the go to school the next day as a new girl"
        },
        "14522222":{
            "choices":[
                "Go to a magic shop to find some answers or curses to put on Daphne",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>When Daphne sat down in 3rd period lunch  Jen noticed something was really different about her. She looked exactly like your old body, but FATTER. Daphne was wearing what looked like your smallest halter top and tightest most revealing spandex short shorts.<br>\r\n<br>\r\n But they didn't show off tight abs or sleek legs instead they revealed a large gut and huge thighs. Daphne looked like a plus sized you and you looked like an even bigger Daphne. Daphne had a double chin with a tiny third chin being formed. She had flabby arms and legs that shook with each quiver of her body. Her boobs were at least a DD and her gut was hanging below belt line and was composed of two large rolls. Her bottom half was a real sight to see though. It was amazing how her ass didn't break out of the stretched beyond limit spandex short shorts. Her thighs looked like they were glued together and her hips were beyond wide. Her waist was hidden someweher underneath all of the fat but her butt was beyond noticable. It stuck so far out and was so huge that if Daphne were to move it hit sometbody.<br>\r\n<br>\r\nYou do nothing but stare in awe about all that's gone on the past few days. Your becoming more and more like Daphne Zhou with each insult and now Daphne looks like you but a 250 pound version. Outraged you drag Daphne by the halter top to the back of cafeteria and start to get at her. <br>\r\n<br>\r\nYou say:<br>\r\n<br>\r\n\"What the Hell. Why are you in my body, or rather my body times two.\"<br>\r\n<br>\r\nDaphne smirks and repleys:<br>\r\n<br>\r\n\"A nice sorceress by the name of Baba came up to me after you verbally attacked me said she'd help me. She said that with each insult you put towards me or any big fit on anyone you will slowly become me and gain weight. Even more with each step closer you become towards me I become you but fatter, much fatter. Then maybe one day we'll switch back and I'll revert to any weight I want and you'll be stuck at what ever mountainous weight you insulted yourself into. Oh, and don't worry your clothes will grow to fit you in any body your in, but they'll be just big enough for you to squeeze into. Last but not least at any given time a curse can be placed on you.\"<br>\r\n<br>\r\nOutraged at Daphne for her boldness and directness you begin to verbally assault her with everything you can think of in your fat fury. From fat jokes to calling her a bitch you just insult her until your in tears. But by the time you finish your insult storm your notice that Daphne was not lying. Your both way fatter. Daphne's belly looks pregnant of quints in 3rd trimester and you can barely see past your JJ boobs or move with your 5x size ass. Last but not least you see Daphne gain another 50 pounds all over just in spite. <br>\r\n<br>\r\nSeriously pissed you want to puch her but realize that could lead to trouble and another possible 100 pounds on both of your frames. Annoyed you leave the lunch room and waddle to the library to think about your options. You leave it down to 2 options:<br>\r\n<br>\r\n1. Go to a Magic shop to find some answers or curses to put on Daphne<br>\r\n<br>\r\n2. Something else</span></div></div>",
            "created":1218862800,
            "id":570856,
            "title":"Bitter fickle suckish Irony"
        },
        "145222222":{
            "author_id":"burke_rakers",
            "author_name":"Burke Rakers",
            "choices":[
                "Jennifer is picked-up by her new family after school.",
                "Jennifer swears to find Baba and convince the old woman to help her."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, if you want to be that big, say what you want. But I gotta warn you...the curse isn't going to just turn you into me. I was NEVER that fat, for one thing. In fact, as you've let the curse run this far without learning your lesson, It'll now take everything you say - every insult you toss - and reflects it back at you. Didn't you get that yet? It's a little unstable (like how you lost your acne a bit ago), but it's still pretty obvious. Keep that mouth moving, and you'll end up so changed that nothing will rescue you. Got it? Now, if you'll excuse me...I and my new boyfriend have a date. Did you know that Lance Goldman of the football team was a closet Chubby Chaser?\"<br>\r\n<br>\r\nThe fatter version of herself giggled and waved to the handsome Lance, who - good looking or not - Jennifer couldn't stand because he was Jewish. If Daphne Zhou starts dating Lance while everyone thinks she's me...my reputation will be ruined! My family will disown me, for goodness sakes!<br>\r\n<br>\r\nJennifer turned and waddled away from the table, but as she passed Lance she sneered \"What's the difference between a Jew and a pizza? The pizza doesn't scream when you put it in an oven!\" then chuckled at the crass, hurtful nature of her joke.<br>\r\n<br>\r\nLance gaped at her cruel joke, then said \"You know, Daphne...the worst Jews are the self-hating kind.\"<br>\r\n<br>\r\nThat didn't make any sense to Jennifer...till she felt a tingling in her face...and knew something else had changed! <br>\r\n<br>\r\nShe waddled as fast as she could (not easy, with her body now swelled to 500 lbs) and burst into the girls restroom, and saw in the mirror...<br>\r\n<br>\r\nThe Daphne Zhou who was reflected back now seemed only half Asian...and the other half of her ethnicity...the larger nose an fuller lips...was obviously Jewish.<br>\r\n<br>\r\nShe screamed \"What the FUCK? This can't keep happening! I'm like some...half Chink and half Heeb! It's...\"<br>\r\n<br>\r\nShe felt disoriented again, and saw that her skin had taken on an aggressively yellowish tint, and her eyes - once softly rounded - now slanted like a Chinese character in a 1940's comic book. Her mouth was fuller and more voluptuously Hebrew, and her nose was bigger, with an obviously hooked appearance. She looked like...like a blending of two separate stereotypes into one. Her clothes were no longer normal, and her swollen body was now squeezed into a Japanese Schoolgirls Uniform, with a Star of David patch as the school symbol. Her hair was long and black, worn in a ponytail and bound with \"Hello Kitty\" hair ribbons.<br>\r\n<br>\r\n\"Even when Daphne insult herself, she change rike dat girl say!\" she gasped...then cried out again. Her voice had a whiney \"Fran Dresher\" quality about it, and she seemed to only be able to speak in the third person...and with a racist parody of an Asian accent!<br>\r\n<br>\r\nShe tried to speak again. \"Herro? Daphne Zhou say herro? What wrong wit' Daphne voice? Daphne no say rike she want to say! Daphne talk rike...rike a JOKE!\" then she started to cry. The obese, cartoonish looking Chinese-Jewish girl sat down on a toilet and bawled herself sick, unable to think of any way to fix this situation. <br>\r\n<br>\r\n\"Are you okay, Daphne?\" someone asked, and Jennifer looked up to see a girl she didn't recognize. She blotted the tears from her cheeks, then said in her whiney voice - exchanging her R's and L's like a Chinese stereotype. \"Daphne Zhou so solly she make such fuss. Daphne Zhou go to crass now. Daphne Zhou so solly.\"<br>\r\n<br>\r\nJennifer waddled out of the restroom and to her next class. She was VERY careful to avoid saying anything to anyone if she could help it, but was mostly sure to keep an eye out for the REAL Daphne Zhou. She HAD to get through the day and find that witch Baba. If she could convince her that she'd changed, maybe Baba would reverse her changes?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1222923600,
            "id":589961,
            "title":"something else"
        },
        "1452222221":{
            "choices":[
                "Insult Daphne's mom",
                "somehting else"
            ],
            "content":"<div class=\"\"><div> <span>Jennifer went the rest of the day without saying a word to anybody. Everyone in the halls keep calling her Daphne but she didn't care she just wanted to leave and find a way to change all of this. She waddled out the front door of the school and tried to find the white windstar that Daphne's mom drove. She spotted it and quickly tried to waddle over, but two snotty white girls stood in her way. They slapped ass and jiggled her stomach as they insulted her because of her weight.<br>\r\n<br>\r\n\"Lookie here Jan this one could win the fat pig contest in the county fair.\"<br>\r\n<br>\r\n\"I know Brook, she's so big we could be orbiting around her due to her gravity pull.\" <br>\r\n<br>\r\nLaughing as loud as possible the two nasty white girls began to walk away. <br>\r\n<br>\r\n\"Damn rittle (little) bitchy clackers (crackers).\"<br>\r\n<br>\r\nAnd with that insult Jen began to change again. Her yellowish skin turned bright white and her curly jewish hair became long and greesy. Her nose shrank and her lips lost some volume as her thighs thickened up even more unitil  they could never not touch. Jen pulled out her mirror from her pocket book and stared at her reflection. \"Wow one actually helped me, except for the lesser lips, thicker thighs, and gressy hair. At least the third person talk is gone.\" <br>\r\n<br>\r\nJen turned her huge body and looked at the two white girls who stood by the doors. They didn't look the same. They looked as if each one of them gained 50lbs. Brook and Jan were both way porkier. They now had little pot bellies, touching thighs, and porkier limbs. Daphne must have accidently placed a curse that makes any girl that insults you gain weight. Guys were making fun of you all day and nothing happened. <br>\r\n<br>\r\nJen said: <br>\r\n<br>\r\n\"That asian idiot put a reverse curse on all girls who insult me. Her blubber mouth is so stupid.\" And with that your eyes become asian looking and your lips plumped up. Your ass grew even larger  as your teeshirt became a sports bra and your pants became spandex shorts. Once again Jen was an Asian-American but even fatter still. <br>\r\n<br>\r\nHell bent on revenge you make your way to the windstar and sit in the shot gun and tell Daphne's mom to drive. The only funny thing was Daphne's mom wasn't exactly a small woman herself. She must have weighed 300 pounds. </span></div></div>",
            "created":1223096400,
            "id":590958,
            "title":"curses, curses, oh my!"
        },
        "14522222212":{
            "author_id":"burke_rakers",
            "author_name":"Burke Rakers",
            "choices":[
                "Jennifer begs for forgivness from Mister Xang, ",
                "Jennifer clonks him on the head with the empty bowl, and runs!"
            ],
            "content":"<div class=\"\"><div> <span>   Daphne's mother Beverly watched her daughter waddle towards her vehicle, and had a sudden thought that this...this behemoth couldn't be her daughter. But then...Bev also seemed different. Unaware that magical shrapnel from Baba Yusefni extremely powerful spell was affecting everyone who was closely related to her, she didn't herself realize that she'd only weighed 120 lbs a few hours ago. But as Jennifer had replaced her daughter, then swelled into a comically obese version of Daphne, Beverly Zhou's own body had grown large and rotund with fat. After all, what sort of trim, athletic woman has a daughter who weighs in at over 500 lbs? Slowly, over the course of the day, her once trim body had swollen and bloated, as more and more of Daphne's snack foods appeared in their pantry, and soon in her own hands. She was totally unaware that she'd started the day off as an exercise junkie who'd always given her plump daughter a hard time about her weight, and now thought she'd always been a glutton.<br>\r\n<br>\r\n   \"Come on, Daphne. We're going to meet your father at the 'Golden Dragon' for dinner.\"<br>\r\n<br>\r\n   Jennifer lumbered to the windstar and tried to squeeze into the passenger seat, but simply couldn't fit. At nearly 600 lbs, she was just too big. Several nearby students jeered at this, and those who were female suddenly acquired an additional 50 lbs of fat added to their bodies. The entire cheerleading squad was now buldging out of their uniforms, plump little bellies and husky thighs jiggling as they giggled. They were  utterly unaware of the change, and they went on as they were...their boyfriends arms encircling their plump waists and all of them snacking on candy bars and potato chips while they looked forwards to dinner.<br>\r\n<br>\r\n   Jennifer slid open the side door and dropped into the back seat, panting and tired. Beverly smiled and handed her replacement daughter a Hershey bar, saying \"Here you go, honey. To keep up your strength till we eat. Right now, we've got to get home and change for dinner. You can't dine out dressed like that, after all. I'm glad you're so proud of your body, but you're practically naked in that outfit.\"<br>\r\n<br>\r\n   Jennifer was still very much a bitch, but she was grateful for the candy...and the fact that Bev hadn't made fun of her or insulted her. She said \"Thanks mom.\" without thinking about it, and ate the chocolate in three big bites. She wanted to ask questions, but instead decided to just sit back and stay quiet. She couldn't very well start telling her that she wasn't her daughter...or this fat. It wouldn't make any sense to the woman.<br>\r\n<br>\r\n   They passed 'Georgio's Fruit' on the way home, and Jennifer made sure to remember exactly where the location was. After all, that was the place she'd insulted Baba Yusefni...and probably where the REAL Daphne Zhou had gone to get Jennifer cursed like this. She had to remember that location...and that awful name. \"Baba Yusefni...\" she said over and over again in her head \"...is the one who cursed me. Baba Yusefni. Baba Yusefni. Baba Yusefni...\"<br>\r\n<br>\r\n   Once they got home, she dressed in a loose, billowy pink muumuu, and she met her new father. Jiang Zhou was apparently from Hong Kong, meeting Beverly while in the states on business, and was now just as fat as his wife. A rotund, yet handsome Chinese fellow with a big laugh and dancing eyes, he hugged his 'daughter' and said \"Well, don't you look healthy this evening! Come on, girl. the 'Golden Dragon' awaits!\"<br>\r\n<br>\r\n   The 'Golden Dragon' was the cities best known Chinese restaurant, a huge place with just the sort of decor you'd expect. Red and gold were the dominant colors, with Golden Dragons motifs and all the gaudy \"Chinese\" gee-gaws and objects that always clutter-up such places. Jennifer saw their waitress, a tiny Chinese girl dressed in supposedly traditional costume, and smirked.<br>\r\n<br>\r\n   \"Would you LOOK at this? The whole place looks so fake and over the top. And the staff all look like extras from some moronic chop-socky movie! Nothing could be as garish and fake as this...uh-oh...\"<br>\r\n<br>\r\n   She felt it building in the pit of her stomach, and spread throughout her body. Man, when was she going to get control of her mouth! She was under a curse, after all...she KNEW she was under a curse...but she was far to used to simply speaking her mind whenever she wanted.<br>\r\n<br>\r\n   Finally, the feeling passed, and Jiang Zhou asked \"Miss? Are you alright?\" in lilting, singsong Cantonese. It was a Chinese dialect...and Jennifer had never heard it before. Despite that, she understood exactly was he'd said, and answered in the same language \"I'm sorry, but I felt faint for a moment.\"<br>\r\n<br>\r\n   Jiang Zhou smiled and waved it off. \"It's fine, Madame Dragon. Just have this girl show us to our table.\"<br>\r\n<br>\r\n   Jennifer looked up at the man who had become her father...and knew that he wasn't her father any more. The Zhou family didn't HAVE a daughter anymore, instead Jiang and Beverly Zhou had come alone to the 'Golden Dragon' alone...and Jennifer was just a member of the restaurants staff.<br>\r\n<br>\r\n   She was now dressed in a clinging, one-piece Qipao (sometimes erroneously called a Cheongsam or \"Mandarin Dress\") of red silk decorated with peacocks and dragons, cut tight to accentuate the globe-like shape of her figure. Her hair was now drawn back into a tight bun and held in place with red lacquered hair forks, her make-up was thick and immaculately applied - heavy foundation, blood red lipstick, blush, eye shadow and black eyeliner and mascara to accentuate her eyes. Long, red nails decorate with golden peacock symbols and a long. red lacquered cigarette holder completed her transformation into an exaggerated \"Dragon Lady\" archetype.<br>\r\n<br>\r\n   \"Oh...my goodness...\" she moaned in Mandarin Chinese (she now spoke several dialects of Chinese fluently), as she realized she'd changed again. The waitress took the Zhou's to their table, and a man walked up to Jennifer and asked \"Tiao, are you feeling okay? I can't have you blowing off the customers. It's important that you smile, be friendly, and accentuate the diners pleasure at being here at the 'Golden Dragon', you understand? They come for the food, but also to see the bizarre character of 'Madame Dragon' that you portray. You HAVE to play the part to the hilt, you understand? No time for slacking! Get to work!\"<br>\r\n<br>\r\n   Jennifer almost told the man (who she somehow knew was her boss) to shut up, but found that she couldn't. He had told her what to do...and she felt compelled to do exactly what he'd said. Was this part of the curse, or was he a magician as well? Instead, she smiled and said \"I understand, Mister Xang. I will do just as you say. Please forgive this unworthy one for her failure. 'Madame Dragon' will not fail you again.\"<br>\r\n<br>\r\n   When the next customers entered (a Caucasian couple) she smiled and gestured with her cigarette \"Ah, most welcome to the Golden Dragon, noble Amelicans! I - 'Madame Dragon' - am your hostess! Missy Tang, preese to take this most honored couple to a table and serve them well. If you have any probrems, please to tell 'Madame Dragon' and she make every'ting jus' fine!\"<br>\r\n<br>\r\n   She was a huge, vast joke. A gaudy, fake stereotype from a B-Movie. The waddling punch-line to a racist joke. Yet...she couldn't help it. Under the gaze of Mister Xang (was he another sorcerer or something?) she felt compelled to act this way. She spoke English in that buffoonish amusing way Asians in old movies did. What was now jokingly called \"Engrish\", and she couldn't stop. Finally, as the night ended and 'Madame Dragon\" waved goodbye to the last guests (Jiang and Beverly Zhou both left hours ago, obviously not remembering her as their daughter at all) and she was asked back into the office by Mister Xang. She was offered a bowl of General Tso's Chicken and rice, and she ate hugely...but made sure not to smudge her make-up.<br>\r\n<br>\r\n   \"So, how are you enjoying playing the part of 'Madame Dragon', Jennifer?\" he asked, obviously aware of her real identity.<br>\r\n<br>\r\n   Jennifer (or 'Tiao Zheng' as her new memories identified her) looked worried, and unconsciously she slipped a cigarette into the red holder, and smoked for a moment to calm her nerves. She hadn't smoked before, but now...she knew she did. </span></div></div>",
            "created":1223182800,
            "id":591214,
            "title":"'Madam Dragon'?"
        },
        "145222222122":{
            "author_id":"burke_rakers",
            "author_name":"Burke Rakers",
            "choices":[
                "Jennifer decides to try having some fun with her coustomers",
                "Jennifer decides to try having some fun with her employees"
            ],
            "content":"<div class=\"\"><div> <span>\"How...how you do this to Tiao Zheng?\" Jennifer asked, then gasped as she realized she'd referred to herself as Tiao Zheng and not Jennifer. <br>\r\n<br>\r\n\"Tiao Zheng? Tiao Zheng! My name Tiao Zheng! Why I keep saying that?\" <br>\r\n<br>\r\nThe Asian gentleman smiled indulgently, and took one of her fat hands in his. \"My, because you ARE Tiao Zheng now, my dear. I saw the rather interesting - if somewhat primitive - spell that someone had laid upon you, and on a whim...I decided to peek into your head. THIS is what I saw, Jennifer. You are a bigot. An astonishingly imaginative bigot. If you weren't such a repulsive person, I might have been tempted to offer you a position as my apprentice. But, after see the person you were...still are, in many ways...I decided instead to simply hijack you and use that fine mind of yours, after I'd sufficiently broken your spirit. You really ARE an obese, Chinese woman named Tiao Zheng. A gluttonous woman with a theatrical streak that compels her to dress and act as a buffoonish parody of her former opinions. As the altered spell runs through your soul...twisting and warping you into the perfect conduit for my magic, you will forever...\"<br>\r\n<br>\r\nMister Xang had turned away from the absurd woman in the gaudy costume and makeup, smoking as she glared at him. He reached for an ornamental wand mounted on the wall. An ancient thing carved from jade during the life of the first Emperors.<br>\r\n<br>\r\nAnd that was when Tiao Zheng raised the empty bowl over her head and struck Mister Xang on the back of the head.<br>\r\n<br>\r\nWith a groan, he fell over and clutched his head...and she hit him again. He dropped the wand, and a thin, greenish smoke rose from the fragments of the wand. The twisted, firmed into a serpentine shape and hissed \"Who dares to shatter the First Wand? Who has broken the most ancient source of true magic?\"<br>\r\n<br>\r\nMister Xang looked up, and started to scream...as the Smoke Dragon darted towards him, wrapped about him, then dissolved him. His body crumbled to dust, and a feeling of enervation filled Tiao Zheng with his spent life-force...and his magical power.<br>\r\n<br>\r\nIn a moment...it was over. Tiao Zheng still had Jennifer's old mind and personality, but she now also had the sort of magical power she'd need to take revenge on that bitch Daphne - who was still pretending to be her while she dated that loser and stuffed her fat face with food. And perhaps...just perhaps...she'd also be able to get revenge on Baba Yusefni. Mister Xang had said that the spell was primitive. Now that she had his magical knowledge, she knew she was more powerful than Baba Yusefni. <br>\r\n<br>\r\nThe cute, little Chinese girl from earlier knocked, then entered the room. She asked \"Where's Mister Xang?\"<br>\r\n<br>\r\nJennifer smiled, then gestured a simple spell at the girl. \"There is no Mister Xang, girl...\" she said in fluent Mandarin Chinese \"...He never was here. I am Tiao Zheng...and I have always run the 'Golden Dragon' restaurant. Do you understand, girl?\"<br>\r\n<br>\r\nThe girl looked confused, then smiled and nodded. \"Sorry, Madame Zheng. I forgot.\"<br>\r\n<br>\r\nJennifer pointed at the remains of Mister Xang, and said \"Sweep that mess up first, girl. I must have spilled my ashtray.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1223528400,
            "id":592957,
            "title":"Jennifer clonks him on the head...but then..."
        },
        "1452222221222":{
            "author_id":"julesteak",
            "author_name":"Jules Teak",
            "choices":[
                "1 day later",
                "1 year later"
            ],
            "content":"<div class=\"\"><div> <span>With Xang's power, now resting inside her, Jennifer knew that her brief time at the bottom was over. Now she could get back her body, her old life, then revenge on the witch and the fatso... though why the rush? <br>\r\n<br>\r\nNo need to worry about tests or highschool; she now owned of one the best restaurants in town, that was behind her. She was free to do whatever she wanted. Let Baba and Daphne enjoy themselves, with the belief that they had beaten her. Let them have fun and let their guard down, thinking that the battle was won. It would just be all the sweeter when the time came... plus it would give her time to plan the revenge to a T.<br>\r\n<br>\r\nUntil that day, however, she would make do with her life here. \"For starters\" she thought, approaching the full length mirror in the corner of her (formerly Xang's) office, \"I really should do something about my look.\" Jennifer's look was still that of Tiao Zheng; fat cliche of a woman, so a reinterpretation was deffinately in order. Now she could just zap the weight gone.. but then again, turning towards the girl as she bent over the ashes, perhaps she could just... transfer it. With that, she felt her body tingle as her fat shrunk back into her. Still clingy; the qipao no longer accentuate a globe-like shape, but showed off her slende figure. Its cut now revealling her long slim legs up the side, as well as her ample bust (of which she'd chosen to keep a generous amount). Her make-up was lighter and more understated; from beast to beauty. Less Madame Dragon, more a elegant phoenix rising rising from the embers. A cursorily glance over her shoulder showed the secondary effect of her spell. Where before there had been a little girl bent over while sweeping, there was now a huge ass... attached to a \"not so little\" girl bent over while sweeping. As she got up, Jen could see the full extent of the damage. While having not gained any more weight than Jen had done, it was much more apparent on the girls smaller stature. The costume which Jen had mocked was almost bursting at the seems; another few pounds, an she'd probably get her own leg revealling cut... with the thick pudginess showing through her tights. <br>\r\n<br>\r\n\"Madame Zheng, I've finnished sweeping, what do...\" Her gaze was transfixed on Jennifer, seemly unaware of her own transformation. \"Madmae Zheng? How did... you look beautiful madame\"... Admiration... Adoration... The friends Jen had missed most of all.<br>\r\n<br>\r\n\"Thank you, um...\"<br>\r\n<br>\r\n\"Cindy Wu, madame\"<br>\r\n<br>\r\n\"oh it's nothing Cindy, I just thought it was time that we had some changes around the here... what do you think?\"<br>\r\n<br>\r\n\"Well I'm sure you know best madame\" Obedience... this was becoming more and more like a much needed reunion<br>\r\n<br>\r\n\"I'm glad you think so Cindy\" Jen moved over to the desk, allowing Cindy the full view of the mirror. <br>\r\n<br>\r\nWhen the screaming/crying ended and the quiet sobbing began, Jen gestured for her to sit down which she does. <br>\r\n<br>\r\n\"Look here Cindy, no doubt this is a shock\" she said, looking up at the girl's tear-coated chubby face (actually 20, according to the personel file on her desk) \"but if I were you, I'd get on board...I've got plans for this place Cindy, and when I'm done you won't recognise t\"</span></div></div>",
            "created":1289797200,
            "id":994298,
            "title":"fun with the staff"
        },
        "15":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Baba Yusefni the angry gypsy",
                "Daphne the fat girl",
                "Jessica the geek",
                "Katie the dejected cheerleader",
                "Another person"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lets get this out of the way quickly. One question and we can move to the story.<br>\r\n<br>\r\nWho does she switch with?</span></div></span></div>",
            "created":1153026000,
            "id":331706,
            "title":"Simply question"
        },
        "151":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "Jenny wakes up in the hospital still in Baba's body",
                "Jenny wakes up in another body"
            ],
            "content":"<div class=\"\"><div> <span>Jenny finds herself back at the fruit stand.She is in the gypsy woman's obese and old body!She gets mad and starts throwing fruits and dumping them on the ground.She spots Baba Yusefni pass by in her beautiful thin body.The old witch is smiling at her.Jenny croaks\"Change me back you bitch or I\"ll kill you!\"Her heart starts beating fast and she collapses.Baba calls an ambulance for her with Jenny's new cellphone.</span></div></div>",
            "created":1153544400,
            "id":333578,
            "title":"Turnabout"
        },
        "152":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Go to school",
                "Try to fake sick"
            ],
            "content":"<div class=\"\"><div> <span>Jen woke up and found herself struggling to move out of bed. It was like something was pushing on her stomach. She finally heaved herself up and nearly feel forward like gravity was pulling her down. She struggled to walk and found her thighs were rubbing together. She didn't recognize the room. Everything seemed different. Jen didn't know where anything was.<br>\r\n<br>\r\nShe waddled over to a mirror and screamed. She was HUGE! And her once blond hair was now jet black. She was asian. She was that cow Daphne!<br>\r\n<br>\r\nJen screamed again when she heard Daphne's mother yelling that she was going to be late for school.</span></div></div>",
            "created":1153630800,
            "id":333931,
            "title":"Waking up as Daphne"
        },
        "1521":{
            "choices":[
                "Skip first period and find her old self",
                "Go to first period"
            ],
            "content":"<div class=\"\"><div> <span>As horrified as she was, she decided the only thing to do would be to just go to school. Waddling to the closet she looked through the rack of clothes in sizes she didn't even know existed. She took a huge pink sweater and some worn out jeans to throw on, it was the best she could find. <br>\r\n<br>\r\n\"Daphne,\" She heard daphne's mom call, \"breakfast\"<br>\r\n<br>\r\nJen sighed and walked slowly down the stairs, not used to lugging around all this weight, watching it jiggle as she moved. She reached the bottom and sat down at the table as her mom set a plate in front of her. She suddenly felt the urge to eat, a lot. She started digging in, engulfing the food faster than she ever would have before. She let out a satisfied burb as the plate was finished and her mom plopped a few more on her plate<br>\r\n<br>\r\nA half hour and 7 plates later, daphne waited at the bus stop. She stepped on and watched the stares of the students around her, although she quickly looked away, too embarrassed with her new size. She sat down in one of the empty seats, her size taking up the whole thing. <br>\r\n<br>\r\nArriving at school she had several choices to make, she needed to find her old self at some point though.</span></div></div>",
            "created":1154408400,
            "id":336338,
            "title":"Being mean has a price"
        },
        "15211":{
            "choices":[
                "You gain a load of weight and your clothes don't rip ",
                "You  gain a load of weight and go home to Spells.com to figure out what to do. "
            ],
            "content":"<div class=\"\"><div> <span>You get off the bus and head straight away from school. Power walking in your fat body every step you take makes you jiggle. About 3 milies, 4 water breaks, and a burger king stop later you arrive in town. You know that somewhere in here is your body you jsut don't know where. <br>\r\n<br>\r\nAll day your walk around town trying to find your old self, wondering where your body may be. Walking in and out of shops with a picture of your old body asking if they'd seen her. But everytime yous saw a food place you would walk in and start to gorge yourself. One after another food place your appeitite never ceased. The whole block was lined with food places and by 5:00 p.m you walk out of KFC with Family of Ten Pack you just finished and you look down at you/her new belly. <br>\r\n<br>\r\nIt was bigger than before hanging under your/her pink sweater and bulging above the jeans. It was reduced to a fuzzy belly shirt. You must have gained fifty pounds. Your/her already big belly was bigger, you/her breasts breaking your/her DD bra. Your/her ass not even fully covered by those jeans. Your/her arms and legs were very beefy and your double hin became a triple. You/her must be at least 300lbs be now. Baba must have also made weight come easier to you now also. <br>\r\n<br>\r\nStart to sob a little bit you walk towards \"home\" when you see a Geogre's Luncheonette. Hungry still you want to walk in but start to walk away. But with one quick glance in the mirror you see something. A girl of your age and hair color in there with plates staked high around her. She looked liek you but you couldn't beleive it. You stare into window at your old body and she looks up and all she does is wave. Her evil smile perking covered with food. <br>\r\n<br>\r\n\"Daphne must not have been satisfied with me in her body and she in mine.\" you think to yourself. Now 's she's trying to beef me up!\" Enraged you walk inside and sit right arcoss from her. Your/her fat spilling over the chair and your puffy arms folded. <br>\r\n<br>\r\n\"Hello Daphne\" you say. <br>\r\n<br>\r\n\"Daphne? my name is Jen, you know that Daphne\" she replys very sweetly. <br>\r\n<br>\r\n\"I see your enjoying my body and the food. Baba was all too generous for you\" you say in a calm yet pissed voice. <br>\r\n<br>\r\n\"Oh I know what Baba did for me and I was ver grateful. I waited for revenge on you and know it sat before me in the form of a 112lbs cheerleader queen. But I thought about it for a second. She told me I had your body for the next six months and all I was going to do is parade around in it. No! I wanted revenge. I realized that I didn't have to give up my now your love of food. I could still eat as much as I wanted if not more in your little body and now I don't have to worry about my weight. So I skipped school, drove here and have been eating it all day. I can even afford all this beacue you- I mean my daddy is filthy rich. Now If you'll excuse me I have some ribs to eat and put the enchanted calories spell I placed on this body to work. Oh and one last thing, this spell isn't reversable. So bye Daphne and buy some bigger clothes you cow!\"<br>\r\n<br>\r\nCrying you run out of George's and into an all-you-can-eat buffet. You pile more and more food on your plates to comfort yourself. And you start to consume it all. For the next 6 months you had to be in this cow's body and now worry about your own body becoming a cow. All you could do is eat your heart out and hope your clothes don't rip on you...</span></div></div>",
            "created":1211864400,
            "id":536601,
            "title":"Around town I go to find me"
        },
        "152112":{
            "choices":[
                "gets back into her own body",
                "try to make  Daphne/her life better"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Daphne/Jen has gained 30lbs. When she gets home she go on to spells.com. she see the the spells but she don't know what to do.</span></div></span></div>",
            "created":1212123600,
            "id":537848,
            "title":"You  gain a load of weight and go home to Spell..."
        },
        "15212":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She confronts her old body",
                "She goes to gym class"
            ],
            "content":"<div class=\"\"><div> <span>Jen waddled off to Geometry class knowing she would find her old body there. When she walked into class she saw her old body gathered with her friends pointing and laughing at her. She waddled over to Daphne's seat and struggled to squeeze into it. Her fat ended up squeezing out through the holes mad by the arms.<br>\r\n<br>\r\nShe felt her old body yank her in the hair.<br>\r\n<br>\r\n\"Hey fatty. Try not to block my view today.\"<br>\r\n<br>\r\nClass went along and all Jen could think about was how to get out of this body.<br>\r\n<br>\r\nAfter class...</span></div></div>",
            "created":1154494800,
            "id":336869,
            "title":"Class time"
        },
        "152121":{
            "choices":[
                "Kick that blonde B****'s ass.",
                "Skip the rest of school and find the Gypsy lady."
            ],
            "content":"<div class=\"\"><div> <span>You wait untill first period is over and wait at your old locker. You spot yourself talking to your friend April. Then your body walks over to you and snaps, \"Hey fatass, this is my locker. I thought you were just fat, but it seems you're just dense as well. \"Daphne get out of my body now!\" you bark. \"What ever do you mean?\" your body says, \"I'm Jen, a stuck up pretty little cheerleader. Not a fatass named Daphne.\" Your body grins. \"So, Jen, how do you like it in there? Comfortable enough for you?\" your body laughed. \"So you do know who you are!\" you say amazed. \"Ofcourse, an old lady appeared in your... excuse me, my room and explained what happend. I didnt beleive her at first but then i found myself at only 112 pounds and blonde hair.By the way, I love how my jeans actually fit me.\" your body sees your boyfriend and says, \"That tub of lard is your body now, this is body is mine for keeps. Enjoy it.\"<br>\r\nShe walks away and kisses your boyfriend. Enraged you...</span></div></div>",
            "created":1155531600,
            "id":339357,
            "title":"Confronting yourself"
        },
        "1522":{
            "choices":[
                "Weight Gain",
                "Diaper Spell ",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Jen's first reaction was to avoid school. If she didn't go she could piece this all together. Jen yelled  \"I'm not feeling so well mom. My tummy keeps on gurgling.\" After Jen said that she heard a rumbling and felt the ground shake. Daphne's mom entered the room. Jens' eyes widened. <br>\r\n<br>\r\nMrs. Zhou was a mountain of a women. She must have weighed over 400 pounds. Daphne's mom said \"You must be really hungry today honey. You only ate 10 plates dinner and 2 cakes. I'll order food in for you today. You just stay home and help you poor little 300 pound belly.\"<br>\r\n<br>\r\nAs Daphne's mom let the room Jen took a deep breath and thought over yesterday. Only one thing stood out to Jen, Baba. Jen thought \"That old fat bitch must have put me in this Cow's lard ass body.  Well.... I'm probably gonna switch back sometime, so I might as well 'modify' this body. Maybe I should have her gain weight.\"</span></div></div>",
            "created":1214024400,
            "id":547026,
            "title":"Try to fake sick"
        },
        "15222":{
            "choices":[
                "eat now spells later",
                "spells now eat later"
            ],
            "content":"<div class=\"\"><div> <span>Jen wanted to make Daphne's body in the worst shape it could possibily be in when Jen thought they would switch back. Jen's only hope to do that was to add some \"modifications\" to Daphne's body. The only way Jen knew how to do that was by putting spells on Daphne's body. <br>\r\n<br>\r\nJen quickly went on Daphne's computer to the internet to ifnd the right spell. She used Spells.com the site in which Jen found the spell which helped her lose 200 pounds. <br>\r\nJen scrolled down the spells as fast as she could and found the perfect spell - the diaper spell. <br>\r\n<br>\r\nThe diaper spell would cause the user to instantly get a diaper on them that only a few people could change. Their clothes would look like a babies and all bowel/bladder control would be lost. Even more everyone would go as if this always was. <br>\r\n<br>\r\nJen put an evil grin on her face and clicked the cast button. Almost instantaniously she felt the magic flow through the body she was in. The spell effects instantly took place. <br>\r\nHer pajama pants ripped off her (Daphne's) body. Her panties bulker up and became a huge diaper that padded her ass and held in part of her belly. Her thighs swelled up to make her waddle like a baby. Her loose fitting pajama shirt tightened up into a form fitting tee that hugged every roll and particle of fat. Her long ass length black hair was put into 2 big pigtails and her face became dimpled with rosey red cheeks. Jen then proceeded to wet herself.<br>\r\n<br>\r\n<br>\r\nJen looked quite satisfied with her work. Her new fat body is now looking like a baby, not bad not bad at all. But Jen wanted to do more to Daphne's body until a big pang of hunger came upon her. She smelled all the food that Daphne's mom ordered for her to devor. <br>\r\n<br>\r\n<br>\r\nJen was torn eat now spells later or spells now eat later.</span></div></div>",
            "created":1220504400,
            "id":578515,
            "title":"Diaper Spell "
        },
        "153":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Time for school",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jen woke up in a room she didn't recognize. It was all pink and uber girly. The room was for someone no where near as cool as her.<br>\r\n<br>\r\nJen got up and wondered how she got here.<br>\r\n<br>\r\nThen she saw herself in the mirror. Her hair was red and done up in pigtails. Her face was covered in freckles and acne. She had one of those big braces thar came out of her mouth and forced her to eat only soft foods. She was the geek Jessica.</span></div></div>",
            "created":1153630800,
            "id":333933,
            "title":"GEEK!"
        },
        "154":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "Jenny finds the gypsy",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Jenny stared at the restroom mirror.It was Katie's not her reflection she saw in it.She got her kicked off the cheerleading squad for gaining too much weight.\"This can't be.I'm Jenny not what's her name.\"she said.Jenny knew it must have been that fat gypsy who did this.Jenny ran out to go find Baba and make her give her her thin body back.She bumped into a girl who looked exactly like her walking with her friends.\"Katie, what are you late for the all you can eat buffet?\" the other Jenny asked.Her friends laughed.Jenny wondered if Katie was in there.She said \"Very funny.\"out of breath and walked the rest of the way.</span></div></div>",
            "created":1153112400,
            "id":331913,
            "title":"She Got her Off the Squad  Now She's Her"
        },
        "1542":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Baba walks up to her laughing",
                "She eats some more and goes home"
            ],
            "content":"<div class=\"\"><div> <span>The girl that looked just like her old self pinched a roll of her new tummy fat and let it jiggle.<br>\r\n<br>\r\n\"God Katie!\" she said.<br>\r\n<br>\r\n\"You'd think getting kicked off the cheer team would be a wake up call to get off you're lard but and lose some poundage, but you're fatter then ever.\"<br>\r\n<br>\r\nJen could hardly control herself as tears welled up in her eyes.<br>\r\n<br>\r\nThe girls walked off laughing.<br>\r\n<br>\r\nJen went back to looking for Baba but ran into and All You Can Eat Buffet. She didn't know why but she couldn't help but stop in. She stuffed herself silly with all sorts of fattening foods.<br>\r\n<br>\r\nAn hour later her face was covered in various crumbs and sauces.<br>\r\n<br>\r\n\"O my go what am I doing?\"<br>\r\n<br>\r\n\"I'm making such a pig of myself. I should be looking for that gypsy.\"</span></div></div>",
            "created":1153198800,
            "id":332283,
            "title":"Lose of self-control"
        },
        "15422":{
            "author_id":"mid-knight",
            "author_name":"Divine Bandit",
            "choices":[
                "Jenn spots her",
                "Jenn leaves"
            ],
            "content":"<div class=\"\"><div> <span>She thinks for a minute. This isn't her body, Katie was just mean to her, and they would just switch back anyways! She should really fatten up her body so she's in for a big surprise. <br>\r\n<br>\r\nJenn stuffs food in her face. It feels good to let it loose. And this fatty food tastes so delicious! It's almost a shame to have to give up the ability to eat it, unless she wanted to get fat.<br>\r\n<br>\r\nWhile jenn stuffs her face, Baba sits at a nearby table. \" Oh my, she thinks that shes going to switch back.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1155186000,
            "id":338444,
            "title":"Free Eating"
        },
        "154221":{
            "author_id":"mid-knight",
            "author_name":"Divine Bandit",
            "choices":[
                "Ariel",
                "Baba"
            ],
            "content":"<div class=\"\"><div> <span>Jen stops eating when she heard people muttering and laughing, cautiously pointing. They're all making fun of me, she thought. Then she spotted Baba sitting at a table and walked up to her. \"Change me back to normal!!\" <br>\r\n<br>\r\n\"No, everyone is happy from the change. I can't do anything.\" she lied. <br>\r\n<br>\r\n\" But I'm not happy!\"<br>\r\n<br>\r\n\"Judging by how you stuffed your face, you love to eat. You like being able to. Cow.\"<br>\r\n<br>\r\nJen lost all control. She was toying with her. Jen leaped on the woman and Baba screamed for help. She was too heavy. During the struggle, Jen managed to tap some wierd necklace and blacked out. When she woke up, she was...</span></div></div>",
            "created":1155186000,
            "id":338446,
            "title":"Struggle in the Buffet"
        },
        "1542211":{
            "author_id":"mid-knight",
            "author_name":"Divine Bandit",
            "choices":[
                "Go outside",
                "Call her cell"
            ],
            "content":"<div class=\"\"><div> <span>Jen opened her eyes and found her self on the floor of some bed room. The first thing she noticed was her lack of wieght. She was average sized again, but not herself. <br>\r\n<br>\r\nShe stood up and brushed her bangs from her eyes. She was an average looking girl with brown hair a little past her shoulders. What was strange was the fact she was wearing a sweat shirt, denim skirt to her knees, and fuzzy pink Ugg boots. None of that was suitable for california. <br>\r\n<br>\r\nShe took a look at an envelope on the dresser. It was addresed to Ariel Ellis, in... Massachusets?!?!<br>\r\n<br>\r\n\"What the hell is going on?\" Jen cried out. Switching bodies wasn't the real surpirse, it was the fact she was on the other side of the country!<br>\r\n<br>\r\n</span></div></div>",
            "created":1155186000,
            "id":338447,
            "title":"Cross Country Swap"
        },
        "15422111":{
            "author_id":"mid-knight",
            "author_name":"Divine Bandit",
            "choices":[
                "She freaks out from not being poplar",
                "Enjoys the benefits of being regular"
            ],
            "content":"<div class=\"\"><div> <span>Jen runs outside to a big surprise. Theres snow covering the ground. Jen imidiately grabs her arms and shivers. \"Brrrrr!!!!\" She blerts out. She's never been this cold in her life! <br>\r\n<br>\r\nThe door opens behind her, and a woman with curly brown hair hands her a pink back pack. \"Ari, you forgot your bag. Have a wonderful day at school.\" She leaned down and kissed her on the cheek. Her own mother was never that nice. Ariel slung the bag over her shoulder as a yellow bus pulled up. She had to find a way to get back home.<br>\r\n<br>\r\nThe bus ride was a different experience for Jen, Ariel wasn't popular, or unpopular for that matter. <br>\r\n</span></div></div>",
            "created":1155186000,
            "id":338450,
            "title":"Average girl"
        },
        "154221111":{
            "author_id":"mid-knight",
            "author_name":"Divine Bandit",
            "choices":[
                "Baba shows up",
                "She changes back to katie"
            ],
            "content":"<div class=\"\"><div> <span>Jen relaxes in a seat by the window and stares at the snow through the window. Eventually, a not very atractive boy sat next to her. \"Hey Ari, I was wondering if you-\"<br>\r\n\"Leave me alone, Lard ass.\"<br>\r\nThe boy looked like he was about to cry. \"But Ariel, I want-\"<br>\r\n\"LEAVE ME ALONE!!!\" Jen screamed at the top of her lungs. Everyone on the bus stared at him as he broke down in tears and moved to another seat. Unknowingly to her- somethiong was going to happen at school</span></div></div>",
            "created":1155186000,
            "id":338487,
            "title":"Poor Boy"
        },
        "154222":{
            "choices":[
                "Realizes the new weight ",
                "Baba comes in"
            ],
            "content":"<div class=\"\"><div> <span>Just as Jen leaves Baba zaps her gentle in the rear, unbeknownst to her. Katie's body slowly begins to expand, her very loose fitting XXL sweat pants which were once falling off without a belt are now filling out. <br>\r\n<br>\r\nThe thin belt snaps into pieces as the pants now are very tight on Jen. Her ass sticks out of them, covered in dimples all the way down her legs. Her thighs rub harder, and harder together with each little step. Her waist disappers and her lower legs melt into cankles. Her belly hangs freely under waistband as it rolls over for a third time. Her breasts grow from a double c to a triple e. Her neck melts away as a triple chin forms. Rosey red dimpled cheeks cover her puffed out face. Her arms flab out and jiggle with each quiver of her body. Jen has yet to notice but her strechy spandex shirt is reduced to nothing but a sports bra. <br>\r\n<br>\r\nJen's prison cell of Katie's body went from 200 pounds to 350 pounds ina matter of seconds, and Jen hasn't noticed. Jen goes \"home\" to Katie's house when \"her\" \"mom\" greets her like nothings changed. Jen goes into Katie's room and finds food filled the room. All sorts of food, from candy to cake. Jen no longer holds back and eats the whole smorgasbord filling out her almost endless gut. Jen then...</span></div></div>",
            "created":1214024400,
            "id":546965,
            "title":"Jenn leaves"
        },
        "155":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Her baby brother",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who sould she swap with?</span></div></span></div>",
            "created":1153026000,
            "id":331716,
            "title":"So you like questions."
        },
        "1551":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Jenny goes into her own room to confront her brother.",
                "Jenny's parents run in."
            ],
            "content":"<div class=\"\"><div> <span>Jenny went to bed that night dreaming of her boyfriend.  She couldn't wait for tomorrow, they were going out on a date, just the two of them.  It was going to be a good day. <br>\r\n<br>\r\n<br>\r\n<br>\r\nIn the morning, when Jenny woke up, she yawned and stretched, frowning when her body felt different.  She opened her eyes and frowned deeper.  Where was her Orlando Bloom poster?  Had her Dad taken it down again.  Oh, she was going to throw a fit. <br>\r\n<br>\r\nRolling over, she took a look at the room and realized why it wasn't there.  She wasn't in her own bedroom.  She was in her brother's!  How had that happened?  She remembered going to bed in her own bed, so how did she end up here?  <br>\r\n<br>\r\nOh well, better get ready for the day.  It was Saturday and she had a date tonight!  Standing up, she immediately felt something else was wrong.  She seemed...shorter.  And not properly aligned.  Getting the feeling that all was not right, she ran over to the mirror and looked at herself.  <br>\r\n<br>\r\nJenny let out a scream. <br>\r\n<br>\r\nShe'd swapped bodies with her brother!</span></div></div>",
            "created":1154408400,
            "id":336498,
            "title":"Body Swap Little Brother"
        },
        "15511":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "They go tell their parents.",
                "Jenny calls her boyfriend."
            ],
            "content":"<div class=\"\"><div> <span>Running out of the room, she headed down the hall towards her own bedroom and threw open the door.  It was awkward to see herself still sleeping in bed, especially in that position, arm stretched above her head, mouth open, snoring.  It was definitely her little brother.  How could this have happened?<br>\r\n<br>\r\n\"Wake up!\" Jenny yelled and gave her brother, in her own body, a harsh shove.  He woke up with a jerk, sitting up and looking around the room.  <br>\r\n<br>\r\n\"What am I doing in your room?\" he asks and then puts a hand to his throat.  \"What's wrong with my voice?\"  His eyes travel to you and he lifts his eyebrow.  \"Are you a clone?\" <br>\r\n<br>\r\n\"No, you idiot,\" Jenny gives him another push.  \"We've switched bodies. I don't know how, but we've got to fix this.\" <br>\r\n<br>\r\nJenny watched as he looked down at himself.  \"I'm a girl?\" he asked.  \"Sick!\" </span></div></div>",
            "created":1154408400,
            "id":336499,
            "title":"Realization"
        },
        "155112":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "Zack cancels the date",
                "Zack confirms the date, planning to go himself"
            ],
            "content":"<div class=\"\"><div> <span>     Jenny picks up her phone to call Josh, but pauses for a moment.  Josh would just think it was Zack, her brother, playing a prank.  There must be a way for her to cancel the date tonight.<br>\r\n<br>\r\n     She looks over to her body and sees her brother tentatively touching her breasts. Revoltion and wonderment cloud his face.  He is still at the age that girls are yucky but the newness of the situation intrigues him.<br>\r\n<br>\r\n    \"Stop touching my body, twerp.\" Jenny scolds him.  \"Look I need a favor.  You have to call up Josh and cancel our date tonight.  Then we can try to figure out how to change back.\"<br>\r\n<br>\r\n    Zack doesn't like having you as a big sister and hates Josh even more.  Jenny is suprised when he actually picks up the phone.  You tell him to hit the first speed dial and he does.  Maybe he isn't such a brat after all</span></div></div>",
            "created":1154494800,
            "id":336781,
            "title":"Calling Josh"
        },
        "1551122":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Jenny makes Zack go on the date and tags along to keep him in line.",
                "Jenny decides she needs to call her best friend for help."
            ],
            "content":"<div class=\"\"><div> <span>Jenny watches as Zack waits for Josh to pick up the phone.  She can hear it ringing.  Finally, Josh picks up.  \"Hey sexy,\" Zack says into the phone.  Jenny glares at him.  He can be such a little idiot sometimes. <br>\r\n<br>\r\n\"Hey, babe!\" Jenny hears Josh say on the other end.  \"You ready for our date tonight?\" <br>\r\n<br>\r\nZack looks over at Jenny, mischief in his eye.  \"Of course I am.\"  Jenny's eyes go wide.  What is he doing.  She holds her hands out to the side in a 'what's up' gesture.  \"Just calling to confirm.\" <br>\r\n<br>\r\n\"What are you doing!?\" Jenny finally can't take it anymore and yells out.  <br>\r\n<br>\r\nZack snickers, but he stops when Josh says, \"Is that your brother?  Tell him to bug off, he's such a little brat.\" <br>\r\n<br>\r\n\"Hey!\" Zack says.  \"I am not!\" <br>\r\n<br>\r\nJenny reaches for the phone and promptly hangs it up, not wanted to confuse her boyfriend anymore.  \"What was that?\" Jenny demands. <br>\r\n<br>\r\n\"What?\" Zack tries to look innocent. <br>\r\n<br>\r\n\"I told you to cancel the date,\" she growled.  \"You're such a little jerk.  You ruin everything.\" <br>\r\n<br>\r\nJenny doesn't notice the hurt look on Zack's face as she jumps on the bed and tries to think of something to do. </span></div></div>",
            "created":1154494800,
            "id":336841,
            "title":"Confirming a Date"
        },
        "15511221":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Jenny apologizes.",
                "Josh calls back."
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, here's what we're going to do,\" Jenny said, jumping off the bed and pacing back and forth in the room.  Zack crossed his legs and watched her.  She hated that he was making her body look like such an idiot.  They'd have to work on that.  \"You're going on that date, but you're taking me with.  We'll say Mom made you do it.  And I'm going to teach you how to be me and I'll tell you what to do when we're out there.\" <br>\r\n<br>\r\n\"Like a covert operation?\" Zack asked, beeming suddenly with glee.  Jenny frowned, he was such a little freak.  <br>\r\n<br>\r\n\"Whatever,\" Jenny said, shaking her head. <br>\r\n<br>\r\nZack grabbed his feet and rocked backwards.  \"I'll be like a G.I. Joe,\" he said, already daydreaming.  Jenny reached forward and smacked his arm.  He let out an, \"Ow!\" and Jenny pointed her finger at him. <br>\r\n<br>\r\n\"Stop doing that,\" she growled. <br>\r\n<br>\r\n\"Doing what?\" he asked.  <br>\r\n<br>\r\n\"Acting like a dork,\" she said. <br>\r\n<br>\r\nZack frowned and then got upset.  \"I'm not acting like a dork!\" he yelled. <br>\r\n<br>\r\n\"Yes you are,\" Jenny told him. <br>\r\n<br>\r\nZack pouted and crossed his arms over his chest.  \"You're mean.  I'm gonna make you break up with Josh.\" <br>\r\n<br>\r\n\"You better not,\" Jenny warned. <br>\r\n<br>\r\n\"I will!\" Zack retorted.  <br>\r\n<br>\r\nJenny sighed.  She couldn't handle this body swap thing. </span></div></div>",
            "created":1154494800,
            "id":336844,
            "title":"Covert Operations"
        },
        "15512":{
            "choices":[
                "Diaper Change",
                "A Feeding"
            ],
            "content":"<div class=\"\"><div> <span>Jenny's parents run in thinking something was wrong, she was a baby, everything about her has changed she couldn't say anything as she hasn't really developed a vocabulary.<br>\r\n<br>\r\nHer parents didn't know what the baby boy wanted until they checked her out...</span></div></div>",
            "created":1160802000,
            "id":352698,
            "title":"Baby"
        },
        "155121":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Round Two",
                "Jen's friend comes in looking for her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jen was so embarrassed. Eventhough she was a baby she was ashamed of messing her diaper.<br>\r\n<br>\r\nJen's mom started to change her when....</span></div></span></div>",
            "created":1166936400,
            "id":367863,
            "title":"Diaper change"
        },
        "1552":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Yes",
                "No, keep trying"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still not satisfied? How about her boyfriend?</span></div></span></div>",
            "created":1153026000,
            "id":331717,
            "title":"More Choices"
        },
        "15521":{
            "choices":[
                "oh my god",
                "wait and see what will happen"
            ],
            "content":"<div class=\"\"><div> <span>\"--Jen!\" she hears her boyfriend Markus say, as she came to him. \"Hey Markus, what's up!\"<br>\r\n\"Ugh...\" he groans, and suddenly started shaking as well as Jen. They both looked up and as everything shifts back into focus and Jen sees herself and her pretty face. \"Jen?\" her body asked.<br>\r\n</span></div></div>",
            "created":1153112400,
            "id":331837,
            "title":"switch"
        },
        "155211":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "they pretend to be each other",
                "they continue looking for the gypsy"
            ],
            "content":"<div class=\"\"><div> <span>Jenny looks down to see her boyfriend's muscular male body instead of her thin female one.\"No way!This isn't possible!\"she says with Brian's deep voice.\"Jen,did you mess with that gypsy?\"he asks with her cute voice.\"Yeah, maybe a little.She is a fat bitch.\"Brian says\"You better go apologize to her.\"Jenny refuses.\"If you don't were going to be stuck in each other's bodies.I don't know about you but I don't want to be a girl.\"Brian says.\"Oh all right.Come with me.\"Jenny finally agrees.The swapped couple go to her spot but Baba isn't there.  </span></div></div>",
            "created":1153544400,
            "id":333574,
            "title":"Jenny and Brian Switch Bodies"
        },
        "1552112":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "It's Baba!",
                "Its Josh's secret girlfriend Katie the chubby cheerleader"
            ],
            "content":"<div class=\"\"><div> <span>\"Look I think we should split up we might find her faster.\" says Josh.<br>\r\n<br>\r\nJen agrees and they both split up. Jen is walking down the street when she hears a feminine voice behind her.<br>\r\n<br>\r\n\"I've been looking for you.\" The voice whispers.<br>\r\n<br>\r\nJen turns around.</span></div></div>",
            "created":1153630800,
            "id":333903,
            "title":"Split up"
        },
        "15521122":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Go to eat and learn more",
                "Decline and continue looking for Baba"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey baby.\" says Katie as she carress Jen on the shoulder.<br>\r\n<br>\r\n\"I saw you with that bitch Jen. Its good to see we've finally got some alone time.\"<br>\r\n<br>\r\nShe kisses Jen, who she thinks is Josh, and brings her hand to rub her belly and then her ass.<br>\r\n<br>\r\n\"I can't believe it.\" Jen thinks.<br>\r\n<br>\r\n\"He's cheating on me. And with this fat bitch. What the Hell!\"<br>\r\n<br>\r\n\"I know what you need Joshiepoo. Why don't we go and grab something to eat.\"<br>\r\n<br>\r\nJen looks and Katie dumbfounded. How could Josh be so interested in such a cow.</span></div></div>",
            "created":1153630800,
            "id":333915,
            "title":"Cheater!"
        },
        "15522":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Yes",
                "NEXT!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're hard to please. How about her dog?</span></div></span></div>",
            "created":1153026000,
            "id":331720,
            "title":"Even more choices"
        },
        "155222":{
            "choices":[
                "cat",
                "human"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>not not a dog- either a cat or a human beeing</span></div></span></div>",
            "created":1153112400,
            "id":331821,
            "title":"not an option"
        },
        "1552222":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "Terri calls the guys with a straight jacket",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Jenny faints.She wakes up in the school nurse's office.She sees she is dressed like a nerdy boy.She is wearing glasses ,has a pocket protector and her pants are too high.She gets up off the couch and looks in the mirror.She screams!She has turned into Arnold Myers!The nurse comes out of her office.She is a slim brunette.\"What is the matter,Arnold?\"she asks.\"I am not Arnold.That is what is the matter.\"Jenny yells.She grabs the nurse\"Turn me back right now!\"she orders.\"Calm down.You say you are not Arnold.Then who are you?\"Terri, the nurse asks.\"I am Jenny the Captain of the cheerleading squad.\"Jenny says flipping Arnold's greasy hair back.    </span></div></div>",
            "created":1153717200,
            "id":334297,
            "title":"Jenny Swaps Bodies with a Nerd"
        },
        "15522222":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Gym",
                "English"
            ],
            "content":"<div class=\"\"><div> <span>\"Now now Arnold you've obviously hit you're head hard. Why don't you calm down take some ice and head back to class.\"<br>\r\n<br>\r\nJen took the ice and took off down the hall nearly screaming. She looked down at her next class and found it was...</span></div></div>",
            "created":1153717200,
            "id":334318,
            "title":"Get to class"
        }
    },
    "info":{
        "author_id":"thewriter",
        "author_name":"B$fan",
        "brief_description":"Every fethish fed. Every fantasy fulfilled. Any wish granted.",
        "created":1153086540,
        "description":"<td align=\"left\" class=\"norm\">Jenny is a spoiled brat. She is also the most popular girl at West Clairmont High. Slim, trim, and the leader of the cheer leaders Jen is used to having her way. One day she tangles with a gypsy and is cursed. Can she overcome it or will her life be forever changed.<br>\r\n<br>\r\nThis story is designed to have everything. The curse is open ended so she can experince, Weight Gain, Gender Change, Body Swap, Change her personality, Turn her into a geek, Shrink her. Basically you get to punish her in any way you want. Feel free to cross over affects and keep changing what happens.<br>\r\n<br>\r\n<br>\r\nAnything goes.... For now.<br>\r\n<br>\r\n<br>\r\nIf you enjoy my stories then join this group<br>\r\n<br>\r\n<br>\r\n<table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" width=\"90%\" style=\"position:relative;\" class=\"norm\"><tr><td align=\"center\" valign=\"middle\" width=\"56\" style=\"position:relative;\"><div style=\"position:relative;\"><a rel=\"awardlightbox\" title=\"... About this awardicon ...\n\n Given by haremprincess \n\n Given to wenston \n\n Date Awarded: August 1, 2006\" href=\"https://www.Writing.Com/main/awardicons.php?action=show_case&amp;award_id=110686\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/awardicons13/plaque_oval-200.png\" align=\"center\" border=\"0\" valign=\"middle\" width=\"50\" height=\"62.5\"></a></div><script><!-- \n\n\t$(\"body\").on(\"click\", \"a[rel='awardlightbox']\", function (event) { if (event.clicked) { return; } event.clicked= true; event.preventDefault();\n\tvar options = { onClosed: function () { $('.awardLightBox').attr('skipGo', '0'); }, \n\thref:$(this).attr(\"href\"), maxWidth :'515px', maxHeight :'400px', innerWidth :'85%', innerHeight :'85%', initialWidth :'400px', initialHeight :'200px', iframe:true, fixed :true, speed :100, fadeOut :50, opacity :.6 }\n\tif (parent) { if (parent.parent && parent.parent.$.colorbox) { parent.parent.$.colorbox(options); } else { parent.$.colorbox(options); } } else { $.colorbox(options); } });\n\t\n\n//--></script></td><td align=\"center\" valign=\"middle\" width=\"63\" style=\"position:relative;\"><a style=\"padding:0px 0px 0px 0px;\" target=\"_top\" href=\"https://www.Writing.Com/main/handler/item_id/1137521-Pathfinders\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/icon-4200.gif\" border=\"0\" width=\"30\" height=\"25\" valign=\"middle\" align=\"center\"></a></td><td align=\"left\" class=\"norm\" style=\"padding-left:15px;color:#000000;\"><a href=\"https://www.Writing.Com/main/handler/item_id/1137521-Pathfinders\" target=\"_top\" class=\"blue2roll\" style=\"font-weight:bold;font-size:1.3em\">Pathfinders</a> <a title=\"\" href=\"https://www.Writing.Com/main/handler/item_id/1137521-Pathfinders\" target=\"_blank\"><img loading=\"lazy\" style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a> (<a class=\"blue2roll\" href=\"javascript:LaunchPop('https://www.Writing.Com/main/tools.php?action=pop_rhelp&amp;crating=10',%20'crhelp10',%20'500',%20'350');\">E</a>)<br>-On hiatus-<br><b>#<span class=\"selectAll\">1137521</span></b> by <span class=\"noselect\" style=\"cursor:pointer;\" oncontextmenu=\"uport_ajax_rt_opts (event, this, 'wenston', '', '', '', '10', '', 'OFF', '100023441'); hide_uport (); this.shown=1; return false;\" onclick=\"uport_ajax_opts (event, this, 'wenston', '', '', '', '10', '', 'OFF'); hide_uport (); this.shown=1;\"><a title=\"Username: wenston\r\nMember Since: February 10th, 2001\r\nClick for links!\" style=\"line-height: 1em;font-size:1em;font-weight:bold;cursor:pointer;\">Wenston</a></span> <span class=\"noPrint\">(<a title=\"View wenston's Community Recognition\" class=\"blue2roll\" rel=\"nofollow\" href=\"javascript:LaunchPop('https://www.Writing.Com/main/authors/action/overall/user_id/wenston',%20'CommunityR_100023441',%20'400',%20'650')\">221</a>)</span> <a class=\"imgLink imgPortLink\" onmousedown=\"if(event.which == 3) { event.preventDefault(); var mywin = window.open('https://www.Writing.Com/main/portfolio/view/wenston','_blank'); mywin.focus (); event.stopPropagation(); return false; }\" href=\"https://www.Writing.Com/main/portfolio/view/wenston\" target=\"_top\" onmouseover=\"uport_ajax2 (event, this, 'wenston', '&lt;span style=\\'color:#990000;font-weight:bold\\'&gt;Offline or Private&lt;/span&gt;&lt;br&gt; Last On:  1/30/20', '1/30/20', 'February 10, 2001', '', '', '10', 'Registered Author');\" onmouseout=\"hide_uport ();\"><span style=\"padding:0px 2px 0px 0px;vertical-align:middle;\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/costumicons/ps-icon-regular-10.gif\" width=\"30\" height=\"15\" border=\"0\"></span></a><a rel=\"nofollow\" onmousedown=\"if(event.which == 3) { event.preventDefault(); LaunchPop('https://www.Writing.Com/main/em/action/new/toid/100023441',   'mess100023441_1591661413', '710', '540');  event.stopPropagation(); return false; }\" href=\"https://www.Writing.Com/main/em/action/new/toid/100023441/in/1\" target=\"_top\" title=\"Email User: wenston [Offline / Private]\" class=\"imgLink imgPortLink noPrint\"><span style=\"vertical-align:middle;padding:0px 0px 0px 0px;\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/mail-off.gif\" width=\"22\" height=\"15\" border=\"0\"></span></a><span class=\"noPrint\"><span id=\"new_ffwenston\"><a class=\"imgLink\" style=\"cursor:pointer;\" onclick=\"doAjaxO('ffwenston', '', 'post', 'https://www.Writing.Com/main/my_favorites.php', 'action=fanfav&amp;fav=1&amp;user_id=100023441&amp;nopad=1&amp;new=1&amp;ajax=new_ffwenston');\" rel=\"nofollow\" title=\"Click to add wenston to 'My Favorites'. \r\nClick again to become a 'Fan'. \"><span id=\"ffwenston\" style=\"padding:0px 3px 0px 3px;vertical-align:middle;\"><img border=\"0\" src=\"https://images.Writing.Com/imgs/writing.com/writers/favplus.gif\" style=\"padding-right:1px;\" width=\"15\" height=\"15\"></span></a></span></span></td></tr></table></td>",
        "id":1132482,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1578753780,
        "modified":1578753780,
        "pretty_title":"Cursed"
    }
}