{
    "chapters":{
        "1":{
            "author_id":"uberking422",
            "author_name":"yougurt",
            "choices":[
                "Female canon character (With powers)",
                "Male canon character",
                "Original female character (With powers)",
                "Original male character, or original female without powers",
                "Female Anthro Pokemon (With powers)"
            ],
            "content":"<div class=\"\"><div> <span>First things first, lets choose the character from who's perspective we'll view this new Pokemon World!<br>\r\n<br>\r\nNote that canon characters can be from the games, anime, or manga. Most if not all notable canon females have giantess powers.</span></div></div>",
            "created":1388638800,
            "id":1720083,
            "title":"Who to follow?"
        },
        "11":{
            "author_id":"uberking422",
            "author_name":"yougurt",
            "choices":[
                "Misty",
                "May",
                "Dawn",
                "Iris",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character?</span></div></span></div>",
            "created":1388638800,
            "id":1720086,
            "title":"Female canon character (With powers)"
        },
        "113":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Bed",
                "Breasts",
                "Panties"
            ],
            "content":"<div class=\"\"><div> <span>You were training with your friend, Dawn. You met her while she was traveling with Ash and Brock. Afterwards, you start to develop feelings for her. Though, you didn't want her to find out about that. After training, a bright green light came out of nowhere and hits you. You start to shrink until you're about 5 inches before Dawn going up to you. \"Oh no! Are you okay?!\" Dawn asked in concern. \"Yeah. I'll be alright. Though, this is quite unexpected.\" You said. \"Well, let's get you to my house to keep you safe.\" Dawn suggested. You nodded and she picks you up before walking to her place. She made it back with no problem whatsoever and puts you on her bed. \"What am I going to do now?\" You wondered about your predicament. \"I'm sure we'll think of something.\" Dawn said. \"Well, I'm feeling sleepy a little. I'm going to rest for a bit.\" You said as you rubbed your eyes. \"Well, I know a place you can sleep.\" Dawn suggested with a dark pink blush on her face. \"Really? What is it?\" You wondered. \"You can sleep in my</span></div></div>",
            "created":1475038800,
            "id":2216190,
            "title":"Dawn"
        },
        "1132":{
            "author_id":"mr.gtslove123",
            "author_name":"GiantesLover",
            "content":"<div class=\"\"><div> <span>\"Your boobs please.\" You say fast. \"Okay then.\" Dawn says pulling her shirt off and taking her bra off. \"You wanna suck on them.\" Dawn teases. \"Yes please.\" you say feeling happy. \"Okay but later now climb in.\" Dawn says happily. \"Now good night Dawn.\" You say feeling comfy in between the two soft towers of flesh. When Dawn wakes up she playfully squishes you between her breast \"Wake up.\" You wake up ready \"Morning Dawn.\" \"Hey can you suck my nipples cause I've been waiting to feel you suck on them.\" Dawn says wanting to feel pleased. \"Sure.\" You say. \"Okay then go ahead.\" Dawn says putting you on her breast. You start to suck her nipples making Dawn moan in pleasure. Dawn gropes her boobs together making sure she feels pleasure. You start tasting her beast milk and lick its delicious taste. Dawn passes out with the pleasure \"I love you.\" You feel happy \"I love you to Dawn.\"</span></div></div>",
            "created":1475038800,
            "id":2216288,
            "title":"Dawn's Big Breast Play"
        },
        "1133":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Lick her pussy",
                "Get inside her pussy",
                "Wait for her to wake up"
            ],
            "content":"<div class=\"\"><div> <span>You were surprised by what Dawn just offered. Before you could respond, she lifts her skirt and revealed her white panties with a pink bow on it. She grabs you and opens her panties before dropping you inside. Dawn gently closes them and rubs the spot that you're in. \"You feel comfortable in there?\" Dawn asked. \"Strangely, yes. To be honest, I thought you were going to put me in a dresser or something.\" You said. \"Well, think again. Now, sleep okay?\" Dawn said. You then fall asleep next to her pussy and Dawn lays in her bed. After a while, you wake up and you're still in Dawn's panties. You can hear her breathing smoothly. She must've fallen asleep while you were. You then decided to</span></div></div>",
            "created":1475038800,
            "id":2216276,
            "title":"Dawn's Frabric Tent For You"
        },
        "11331":{
            "author_id":"mr.gtslove123",
            "author_name":"GiantesLover",
            "content":"<div class=\"\"><div> <span>You lick her pussy wanting to please her. \"Mmmmmmm\" Dawn feels you licking her pussy \"More make me cum.\" You start licking her pussy fast tasting the cum thats starting to eject. \"Haaaaaaaa mmmmore please. Dawn says cumming. After getting covered in cum Dawn passes out. \"I will forever please you my love.\" You say as you sleep.</span></div></div>",
            "created":1475038800,
            "id":2216277,
            "title":"Lick her pussy"
        },
        "11332":{
            "author_id":"mr.gtslove123",
            "author_name":"GiantesLover",
            "content":"<div class=\"\"><div> <span>You start to climb inside her. Dawn starts to feel you climb into her \"Hey if you wanna climb inside me you have to make me cum.\" You start to squirm and struggle within Dawn and she starts breathing heavily.  \"Ohhhhhhhh.\" Dawn sighs as you squirm. You go in deeper and lick her. Dawn masterbates to your movement and cums pushing you out. Dawn pulls you out \"You are the best and I love you.\" She admits. \"I feel the same way.\" You say as you fall asleep.</span></div></div>",
            "created":1475038800,
            "id":2216281,
            "title":"Get inside her pussy"
        },
        "11333":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Wanted Dawn to fart on you",
                "Kissed her butt"
            ],
            "content":"<div class=\"\"><div> <span>You decided to wait for Dawn to wake up from her beauty sleep. Dawn wakes up and can still feel you in her panties, much to her delight. \"Having fun in there, Cutie?\" Dawn asked slyly. \"Yeah. I am.\" You also responded with a kiss to her vagina which causes her to moan a little. \"Could you do more of that?\" Dawn asked. You responded by kissing again and again on her vagina and Dawn likes it much to her pleasure. \"Yes. That feels so good. I love you doing this.\" Dawn moaned. You finally finished and Dawn took you out to her face before kissing you. \"You did great. I want you to try my butt now.\" Dawn suggested. You nodded and Dawn moved over to her front area and places you on butt. \"Go ahead, my little toy. Please me with any way possible.\" Dawn ordered. You go down and you</span></div></div>",
            "created":1475038800,
            "id":2216290,
            "title":"Wait for her to wake up"
        },
        "113332":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Dawn's mother comes in",
                "Dawn wants to continue where you two left off"
            ],
            "content":"<div class=\"\"><div> <span>You begin to bend over and kissed her white panty clad butt. Dawn smiles at what you did and wants you to continue. You did just that and you keep on kissing her ass for the next half hour. \"Wow! You really know how to turn a girl on. You want to keep on doing more of that?\" Dawn asked. \"Sure. But, you look worned out from all of that sex.\" You stated. \"Yeah. I guess I do. How about we get some lunch?\" Dawn suggested. \"Okay. I'm starving.\" You said. Dawn took you downstairs and she made some sandwiches for you and her. Dawn made yours smaller by using her powers to shrink it. You know about this because she told you about her size changing powers, much to your interest, on the way down the stairs. \"Hey? Do you want to be my boyfriend?\" Dawn suggested. You nearly choked on your sandwich when you heard that. \"For real?\" You asked. \"That's right.\" Dawn answered. It took a few moments. But, you nodded with happiness and Dawn picks you up to her lips for a long kiss. After the kiss,</span></div></div>",
            "created":1475125200,
            "id":2216381,
            "title":"A Love Dawning Over"
        },
        "1133321":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Johanna wants to try you",
                "Dawn takes you back to her room"
            ],
            "content":"<div class=\"\"><div> <span>You and Dawn turned to see her mother, Johanna, come into the kitchen with a soft smile. You can figure out in where Dawn got her looks from because she's as good like her.<br>\r\n<br>\r\n\"Oh! Hi Mom!\" Dawn greeted.<br>\r\n<br>\r\n\"Hello, Sweetie. I see you found yourself a nice small young man.\" Johanna said.<br>\r\n<br>\r\n\"Yep. Ain't he cute?\" Dawn teased.<br>\r\n<br>\r\n\"He sure is. He reminds me of your father.\" Johanna said.<br>\r\n<br>\r\n\"Ladies! Please!\" You said while blushing and rubbing the back of your head.<br>\r\n<br>\r\n\"Don't be embarrassed. So, Dawn? Did you two manage to do it?\" Johanna teased her daughter.<br>\r\n<br>\r\n\"Mom!\" Dawn yelled in embarrassment.<br>\r\n<br>\r\n\"It's okay. As long it's out of love, I don't mind.\" Johanna said.<br>\r\n<br>\r\nYou and Dawn blushed madly to her teasing. Afterwards,</span></div></div>",
            "created":1475125200,
            "id":2216544,
            "title":"Johanna"
        },
        "11333211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Bra",
                "Panties"
            ],
            "content":"<div class=\"\"><div> <span>\"Dawn? Would it be fine if I would try him out?\" Johanna asked.<br>\r\n<br>\r\n\"Sure, Mom!\" Dawn answered.<br>\r\n<br>\r\nYou were shocked to hear what they just said as Dawn hands you over to Johanna. This could be an opportunity to have some MILF action with her.<br>\r\n<br>\r\n\"Thank you, Sweetie. I'll be sure to give him back to you.\" Johanna said.<br>\r\n<br>\r\nShe brings you to her bedroom and sits on the bed. She starts off by putting you in her mouth and play with you with her tongue. She felt you erection and licked it. She takes you out and then put you in her bra. She squeezes them together on you softly and you go to her nipple and lick it. Johanna felt you licking and she moans in pleasure. She took you out and puts you in her panties. She moans even louder as she feels you moving and licking on her vagina. She finally cums all over you and pulls you out to lick you clean of her juices. She finally puts you on her bed and gently sit on you. You rubbed her jean covered ass and Johanna like it very much. She gets off and brings you to her face.<br>\r\n<br>\r\n\"That was really good. You're a one of a kind.\" Johanna admitted.<br>\r\n<br>\r\n\"Thanks. I'm glad you like it.\" You said.<br>\r\n<br>\r\nJohanna goes to Dawn's room. But, she sees her daughter sleeping. Johanna then thought of something. She goes to Dawn and she puts you in her</span></div></div>",
            "created":1475125200,
            "id":2216562,
            "title":"Pokemon Milf Time!"
        },
        "113332112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Swallowing you",
                "Stepping on you"
            ],
            "content":"<div class=\"\"><div> <span>Johanna quietly opens her daughter's white panties and places you in them. She closes them gently and leaves Dawn's room. After a while, Dawn wakes up and feels something in her panties. She smiles slyly as she knows it was you. Should you out and brings you to her face.<br>\r\n<br>\r\n\"You really love being in my panties, don't you? I might have to make it your new home. Anyway, did you have fun with my mom?\" Dawn asked.<br>\r\n<br>\r\n\"Sure did. She was really getting into it.\" You said.<br>\r\n<br>\r\n\"I bet. Oh! I forgot to mention. With you being shrunk, I wanted to keep you alive and well. So, I made you impervious to pain and you can't die.\" Dawn explained.<br>\r\n<br>\r\n\"You really love me that much, huh?\" You wondered.<br>\r\n<br>\r\n\"Sure do. I hate to see what would happen if you wind up dead.\" Dawn said in a sweet tone.<br>\r\n<br>\r\n\"Thank you so much. But, how do you know if it even works?\" You asked.<br>\r\n<br>\r\n\"I'll show you.\" Dawn said.<br>\r\n<br>\r\nShe would show off to prove your immortal abilities by</span></div></div>",
            "created":1475125200,
            "id":2216799,
            "title":"Panties"
        },
        "1133321121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Cat and mouse",
                "Hide and seek"
            ],
            "content":"<div class=\"\"><div> <span>Dawn tosses you into her mouth and plays with you with her tongue. She loves the taste of you and savors it.<br>\r\n<br>\r\n\"You taste really good. I'm gonna take my time with this.\" Dawn said as she taste your tiny body.<br>\r\n<br>\r\nShe then tilt her head back and she swallowed you whole. You traveled down her throat until you reached her stomach. You can see the acid on you. But, it doesn't seem to stinging or melting away at your skin. It proves that Dawn was right. You are immortal at this size.<br>\r\n<br>\r\n\"You were right, Dawn. I'm still okay.\" You said out loud.<br>\r\n<br>\r\n\"Told you so. Though, you might going to be in my stomach for a few hours. I can't get you out myself.\" Dawn said.<br>\r\n<br>\r\n\"Okay. I'll wait for nature to take it's course.\" You suggested.<br>\r\n<br>\r\nYou sit in Dawn's stomach for a while now. The acid doesn't appeared to be bothering you at the moment. That's when it's time to get down to her you know what. You managed to reach to her southern exit and Dawn picks you up. She goes to the sink to wash yoo up until you smelled and looked nice and clean.<br>\r\n<br>\r\n\"That was something else.\" You said.<br>\r\n<br>\r\n\"I know what you mean. Now that you're clean, how about a game?\" Dawn suggested.<br>\r\n<br>\r\n\"Sure. What do you have in mind?\" You wondered.<br>\r\n<br>\r\n\"How about</span></div></div>",
            "created":1475125200,
            "id":2216810,
            "title":"And they told you not to play with your food"
        },
        "11333211211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "You win",
                "Dawn and/or Johanna wins"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay. What do I have to do?\" You asked.<br>\r\n<br>\r\n\"Basically, you run around while I chase you so I can catch you. Let's make this more interesting. If you win, you get to explore my body without question.\" Dawn stated.<br>\r\n<br>\r\n\"If you win?\" You wondered.<br>\r\n<br>\r\n\"Then you'll have to pleasure me as my sex toy. Either way, we both win.\" Dawn said.<br>\r\n<br>\r\n\"Sounds fair. I'm game.\" You said as you get ready.<br>\r\n<br>\r\nYou took a head start and Dawn was right behind you. Johanna heard what was going on and wants in on it.<br>\r\n<br>\r\n\"You two don't mind if I join in on this, right?\" Johanna asked.<br>\r\n<br>\r\n\"No problem, Mom! Well, Cutie. Looks like you have two sexy cats to deal with.\" Dawn said.<br>\r\n<br>\r\nYou took this as a major challange and you begin running again. You dodged Dawn but got Johanna on your tail. You run to her bed and got underneath it. You noticed that Johanna is nowhere to be found. You turned and see that Dawn found you and you start running out of the bed. At the end of the game,</span></div></div>",
            "created":1475211600,
            "id":2216827,
            "title":"Cat and mouse"
        },
        "113332112112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Both",
                "Either one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be either on or both?</span></div></span></div>",
            "created":1475215380,
            "id":2216828,
            "title":"Dawn and/or Johanna wins"
        },
        "1133321121122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Dawn",
                "Johanna"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of them won?</span></div></span></div>",
            "created":1475215500,
            "id":2216831,
            "title":"Dawn or Johanna"
        },
        "115":{
            "author_id":"uberking422",
            "author_name":"yougurt",
            "choices":[
                "Serena",
                "Cynthia",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Next pair of choices.</span></div></span></div>",
            "created":1388638800,
            "id":1720087,
            "title":"Other"
        },
        "1151":{
            "author_id":"mr.gtslove123",
            "author_name":"GiantesLover",
            "choices":[
                "Cleavage",
                "Panties",
                "Shoes"
            ],
            "content":"<div class=\"\"><div> <span>Its a lovely day in the Kalos Region you find yourself in a battle with a girl named Serena. \"Alright Arcanine flame thrower!\" You yell ready to finish the battle. \"Now dodge Mime.Jr then use minimize!\" Serena said. The Mime.Jr dodged the attack and used minimize but it missed and hit you. \"Ahhhg!\" You say as the attack hit you causing you to shrink to 5 inches. \"Stop the battle!\" Serena says rushing to you. \"Are you okay.\" Serena say picking up the tiny trainer. \"Yeah but I'm the size of a pencil.\" You say pissed about your new size. \"I'm sorry please let me make it up to you.\" Serena says. \"You don't have to just take me to the pokemon center.\" You say trying to calm her down. \"The nearest pokemon center is about a week away.\" Serena says. \"Well then we better get going.\" You say calling back your pokemon. \"Wait I'll take you it's to dangerous for some one your size.\" Serena says \"Alright then.\" You say getting ready to be picked up. Serena picks you up. \"Hey can you put me in your.\"</span></div></div>",
            "created":1475038800,
            "id":2216154,
            "title":"Serena"
        },
        "11512":{
            "author_id":"mr.gtslove123",
            "author_name":"GiantesLover",
            "choices":[
                "Rub her vagina",
                "Climb inside her vagina"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey can you put me in your panties?\" You say nervous. Serena blushes as red as pokeball. \"I'm sorry please don't kill me.\" You say in fear for what happens. S-sure I guess but please be gentle if you wanna do anything.\" Serena says flipping up her skirt revealing a black thong. \"Okay thanks but if you don't want me in them just let me know.\" You say as you're put against the wet vagina. Serena starts walking as you are inside her panties. You get an idea to.</span></div></div>",
            "created":1475038800,
            "id":2216168,
            "title":"Panties"
        },
        "115121":{
            "author_id":"mr.gtslove123",
            "author_name":"GiantesLover",
            "content":"<div class=\"\"><div> <span>You get the idea to rub her vagina. You start to rub her gently and lick it. Serena starts to feel pleasure. \"H-hey what are you doing in there.\" She says stopping and sitting on a rock. \"Rubing your vagina.\" You say starting to speed up. \"Well then go ahead after all I said if there is anything I can do I'll do it.\" Serena says starting to rub you into her crotch. You feel Serena starting to cum then get covered in it. Serena pulls you out and washes you off with a rag covered in water. \"So did you enjoy that Serena?\" You say happily. \"Yeah thanks.\" Serena says then kisses you. You blush. \"What was that for?\" You say in shock. \"As thanks for making me happy.\" Serena says blushing red. \"Well I'll always make you happy cause I've decided to be travel with you at this size.\" You say happily. Serena blushes \"Well if you say so then fine by me.\" </span></div></div>",
            "created":1475038800,
            "id":2216176,
            "title":"Rub her vagina"
        },
        "115122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Breasts",
                "Butt"
            ],
            "content":"<div class=\"\"><div> <span>You wiggled yourself into Serena's vagina and she stops when she felt you going into her.<br>\r\n<br>\r\n\"You're going inside of me! Keep going! Just be gentle!\" Serena said as she goes behind a tree out of sight.<br>\r\n<br>\r\nYou continue to squirm inside of her vagina and even licked the walls around you. You then see the sex fluids coming in and you were washed back out of her vagina. Serena reaches in and pulls you out to her face. You got nervous at first, but then she leans in and kisses you.<br>\r\n<br>\r\n\"Why did you just kissed me?\" You asked in shock.<br>\r\n<br>\r\n\"For that great feeling you just give me.\" Serena said with a dark blush.<br>\r\n<br>\r\n\"Ehehe. It was nothing.\" You said.<br>\r\n<br>\r\n\"Could you stay in my panties for a bit longer? I really like having you in there.\" Serena suggested.<br>\r\n<br>\r\n\"Sure. I'm okay with it.\" You said.<br>\r\n<br>\r\nSerena drops you back into her panties and gets up to continue the journey. After a while, you were sleeping in her panties and you wake up to see yourself being pulled out. Serena gently puts you on a bed that you see and she looks at you with a pleasant smile.<br>\r\n<br>\r\n\"Bet you had fun. Now let's try something else.\" Serena said.<br>\r\n<br>\r\n\"Like what?\" You wondered.<br>\r\n<br>\r\nSerena leans on the bed and gently lays on you with her</span></div></div>",
            "created":1478663280,
            "id":2234600,
            "title":"Climb inside her vagina"
        },
        "1151222":{
            "choices":[
                "Yes, she pulled you out and gave you an embarrassed apology.",
                "No, she sat fully down on you and slid you into her thong."
            ],
            "content":"<div class=\"\"><div> <span>Serena bends over and looks down at you with a smile accompanied by a soft giggle, which she follows up by turning her gargantuan-sized body on a 180 degree angle, leaving you only a few inches below her huge, soft-looking rear end. Her butt blots out the light and casts a dark, oppressive shadow over you. You think you can see Serena's face looking down and smiling from way up above, but you can't really tell.<br>\r\n\"Since you've had some fun in my front end, want to experience the back?\" She teased, and began to lower her ass on to the bed. \"Do you want my skirt on top of you, or... What's beneath it?\" She said that as though she genuinely wanted some input, but you knew she couldn't hear your tiny vocal cords down there. Regardless, she flopped her skirt up so that the back fell behind you, quickly and abruptly coating you in darkness. In the faint light, you could make out her bare butt-cheeks enveloping a crack that was barely covered by a seductively small amount of fabric - courtesy of her thong. It dawned on you that her enormous butt was seriously coming down on you. Even if it was kind of hot, it was still terrifying. And in your completely inaudible state, there was nothing you could do about it.<br>\r\n<br>\r\nSoon, you began to feel a heavy sensation in your feet and calves that seemed to jiggle slightly. You recognized that as her butt making itself comfortable on your lower body. The sensation slithered up your thighs soon enough, completely immobilizing you. Even if you wanted to run, you couldn't. You were just a slave to Serena's ass. Soon enough, her butt was positioned firmly on everything but your head. It was at this point, as your lungs were being crushed beneath her, that you realized how dangerous this could be. So much pressure was on your legs that you were getting genuinely scared that they'd break, but that wasn't even the biggest of your problems. You could barely breathe. An enormous butt was sat firmly on top of everything including your chest, and to top that off, the pubic scent you'd become accustomed to in her vagina was mixing with the heat to create a torture chamber beneath her. In a way, the worst thing was that she wasn't doing it on purpose. She was gently sat on you, happily enjoying her new seat cushion. She wasn't even trying to create this hell!<br>\r\n<br>\r\nYou began to slam your head against the black fabric above you, your last hope, with your lack of free hands. It quickly comes to your understanding that the flesh beneath the fabric was her butthole - made apparent by the smell of... Well, whatever last came out of it. <br>\r\nYour whole body is cramping up soon enough, and the back of your neck starts to burn horribly from the strain of relentlessly slamming your head against her ginormous asshole. You clearly stimulated it a little, at least, because a loud roar that would normally be indicative of the return of the dinosaurs ripped from the 'vortex' above your head and a putrid smell half reminiscent of rotten eggs, half reminiscent of fecal matter, infiltrated your nostrils. You definitely heard Serena giggle at that. Whether it was an embarrassed, apologetic giggle or a sadistic one at this point you didn't know.<br>\r\nBut was her fart enough to make her pull you out?</span></div></div>",
            "created":1534767480,
            "id":2536065,
            "title":"Butt"
        },
        "1153":{
            "author_id":"uberking422",
            "author_name":"yougurt",
            "choices":[
                "Erika",
                "Sabrina",
                "Nah, next choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about one of the remaining original female gym leaders?</span></div></span></div>",
            "created":1388638800,
            "id":1720090,
            "title":"Other"
        },
        "11533":{
            "author_id":"uberking422",
            "author_name":"yougurt",
            "choices":[
                "Jessie",
                "How about someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the popular anime villain?</span></div></span></div>",
            "created":1388638800,
            "id":1720091,
            "title":"Nah, next choice."
        },
        "115331":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Crushing you with her breasts",
                "Stuffing you in her panties"
            ],
            "content":"<div class=\"\"><div> <span>You were knocked out a little while ago before waking up. You noticed that you're caught in a dark room with no way out. The door then suddenly open and you see the long red haired Team Rocket member, Jessie, standing before you. \"There's no need to struggle, Twerp. Just give me all of your Pokemon and I'll let you go.\" Jessie offered. \"No way. Whatever you'll do to me, I'll take it. But, you'll never take my Pokemon.\" You said in defiance. \"If that's what you want, then this is gonna be fun.\" Jessie said wickedly. Jessie raises her hand and it glowed as you start to shrink until you're about 6 inches tall. Jessie picks you up and brings you to her face. \"Ready to give them up?\" Jessie wondered. \"In your dreams.\" You said with no fear. \"I was hoping you would say that.\" Jessie said before</span></div></div>",
            "created":1475038800,
            "id":2216230,
            "title":"Jessie's Tiny Captive"
        },
        "1153312":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "\"Hmm. This gives me an idea.\" (Giantess)",
                "She plays with her new toy."
            ],
            "content":"<div class=\"\"><div> <span>Jessie pulls up her white skirt and reveals her black panties. She opens them up and drops you in them. She closes them and rubs her crotch with you against it. \"If you won't give me your Pokemon, then you won't mind staying in there for a while, would you?\" Jessie asked wickedly. You squirm a little in her panties and Jessie starts moaning. \"I'll take that as a yes.\" Jessie said.</span></div></div>",
            "created":1475038800,
            "id":2216239,
            "title":"Stuffing you in her panties"
        },
        "11533121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Crushed the buildings with her butt",
                "Get more toys for her pleasure"
            ],
            "content":"<div class=\"\"><div> <span>Jessie then used her powers to grow her clothes and herself until she's about 500 feet tall. She then go to a town and the people were so scared of her and just run for their lives. Jessie starts grabbing people until she's got a handful of them. She opens her black panties and drops them all in. \"That's right, everyone. You all being to me now. My panties are where you'll stay in forever.\" Jessie said. Her prisoners keep on squirming and it caused Jessie to moan and get even more horny. With that done, Jessie</span></div></div>",
            "created":1475038800,
            "id":2216245,
            "title":"Jessie's Gigantic Capture of Pleasure"
        },
        "115331211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "1000 feet tall",
                "5000 feet tall"
            ],
            "content":"<div class=\"\"><div> <span>Jessie looks around the city and sees the buildings around it. Jessie then forms an evil idea in that wicked brain of hers. \"Looks like you won't be needing these buildings anymore.\" Jessie said before growing again to about 700 feet. She turns around and lands her butt on the building this crushing them instantly. She continues on crushing the buildings with her butt until there's absolutely nothing left standing. \"Well, that was fun. Moving on now.\" Jessie said before leaving. As she was walking, the thousands of people in her panties continues on squirming making Jessie feel good. \"They feel so good in there. I want more in my panties. Much more.\" Jessie thought with so much lust. First, she wants to grow until she's</span></div></div>",
            "created":1475038800,
            "id":2216261,
            "title":"Being a Giantess is so much fun!"
        },
        "1153312111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Crush some more buildings",
                "Eat something"
            ],
            "content":"<div class=\"\"><div> <span>Jessie continues to grow even bigger until she's about 1000 feet tall. She walked to the next town and sees the people she wants to pleasure herself with. She grabs everyone with only one hand and stuff them in her panties with the ready of her sex slaves. She can feel them hitting her vagina and she moans. \"Yes! Pleasure your goddess! I want more of you in my panties!\" Jessie said with lust. She found more people and keep on stuffing her panties until she has about 100,000 people in her panties. \"Oh yes! Don't stop! You're doing amazing!\" Jessie moaned until she cummed all over the people and stained her panties. \"Wow! That felt really amazing! Make yourselves at home in there, my little slaves.\" Jessie said before going to</span></div></div>",
            "created":1475038800,
            "id":2216273,
            "title":"1000 feet tall"
        },
        "11533122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Get inside me",
                "You could use some company"
            ],
            "content":"<div class=\"\"><div> <span>Jessie gets on the bed in the dark room and rubs the spot of her black panties that you're in. \"I guess Pokémon is out the window. I've got something better in mind. A little toy to keep in my panties to please me.\" Jessie thought. You begin to squirm around next to her vagina and Jessie smiles with glee at your actions. \"That's right, my little slave. Pleasure your new goddess. You're gonna be in there for a long time.\" Jessie said wickedly. You continue your movements and her vagina starts to get wet. \"Alright, Twerp.</span></div></div>",
            "created":1475038800,
            "id":2216310,
            "title":"Forced Pleasing the Main Villainess"
        },
        "115331222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Cassidy",
                "Madame Boss"
            ],
            "content":"<div class=\"\"><div> <span>\"Company?\" You thought in confusion as you're still stuck in Jessie's panties. Jessie gets up and pulled out a glass jar full of tinies that she'd shrunk before you. She opens the jar and opens her panties before spilling them all inside. \"You all feel so good in there. You can all stay in there.\" Jessie said. Everyone starts moving around next to her vagina and Jessie starts to cum. \"I see you're having fun without me, Jessie.\" A female voice said. Jessie looks and smirks as she sees</span></div></div>",
            "created":1475038800,
            "id":2216330,
            "title":"Some Roommates"
        },
        "1153312222":{
            "choices":[
                "Jessie sucks the bosses tit with you on it",
                "Tit to tit smothering"
            ],
            "content":"<div class=\"\"><div> <span>\"What did I tell you about getting pleasure from tinnies, you can't unless you allow me to join in\" and you notice that the boss was taken get off her bra and panties and started working on taking off Jessie's clothes and her nipples were so close to you that you could feel how hard they were, and suddenly the boss noticed you on Jessie's pussy and grabbed you and put you on top of her tit and ask Jessie \"are you ready? :)\" \"yes boss\" replied Jessie and then suddenly...</span></div></div>",
            "created":1475125200,
            "id":2216770,
            "title":"Madame Boss"
        },
        "115332":{
            "author_id":"uberking422",
            "author_name":"yougurt",
            "choices":[
                "Whitney",
                "Next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's try the gen two gym leaders...</span></div></span></div>",
            "created":1388638800,
            "id":1720092,
            "title":"How about someone else?"
        },
        "1153322":{
            "author_id":"drakeforatue",
            "author_name":"The ColdBlood King",
            "choices":[
                "Officer Jenny",
                "Nurse Joy",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Officer Jenny or Nurse Joy?</span></div></span></div>",
            "created":1468472400,
            "id":2180035,
            "title":"Next!"
        },
        "11533222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Cleavage",
                "Panties"
            ],
            "content":"<div class=\"\"><div> <span>You were walking, or in this case, limping, to a Pokemon Centee because you were attacks by a fire based Pokemon who then burned your legs and your bones were shattered because of it's physical attacks. You made it to the center and Nurse Joy was there to see you injured. \"Oh my goodness! Are you alright, Sir?\" Nurse Joy asked. \"Not really. I was attacked by a fire Pokemon and my bones were crushed and my skin got burned.\" You explained. \"Oh you poor boy. Here. Sit right here.\" Nurse Joy ordered. You sit on the bed and Joy checked on you. \"You're more in pain than I thought you would be. I'm gonna have to keep you until you recover.\" Nurse Joy stated. \"You're the nurse. So, where do I stay?\" You wondered. You got your answer as Nurse Joy raises her hands and it glows as it shrunk you to about 6 inches. You were surprised and you looked up at Joy to see her gigantic sexy face. She picks you up and brings you to her face. \"You'll be staying in here.\" Nurse Joy said before putting you in her</span></div></div>",
            "created":1475125200,
            "id":2216383,
            "title":"Nurse Joy"
        },
        "11533223":{
            "author_id":"drakeforatue",
            "author_name":"The ColdBlood King",
            "choices":[
                "MILF TIME!",
                "Nah; moving on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Delia Ketchum?<br>\r\nY'know...Ash's Mom?</span></div></span></div>",
            "created":1468472400,
            "id":2180036,
            "title":"Obvious choice"
        },
        "115332231":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Growing",
                "Shrinking"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Delia grow it does she shrink people?</span></div></span></div>",
            "created":1484011440,
            "id":2261401,
            "title":"MILF TIME!"
        },
        "1153322312":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Her son, Ash",
                "Other people"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does she shrink?</span></div></span></div>",
            "created":1484343780,
            "id":2263088,
            "title":"Shrinking"
        },
        "11533223122":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ash included</span></div></span></div>",
            "created":1535574780,
            "id":2540491,
            "title":"Other people"
        },
        "115332232":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>alola girls</span></div></span></div>",
            "created":1534815300,
            "id":2536386,
            "title":"Nah; moving on"
        },
        "1153322321":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "lana",
                "lillie",
                "mallow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1534815420,
            "id":2536387,
            "title":"yes"
        },
        "1153322322":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>bonnie then</span></div></span></div>",
            "created":1534815540,
            "id":2536388,
            "title":"no"
        },
        "11533223222":{
            "author_id":"aleshie",
            "author_name":"Rodeaux",
            "choices":[
                "Lola",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She only appeared a few times, but how about Brock's youthful mom, Lola?</span></div></span></div>",
            "created":1543721040,
            "id":2584548,
            "title":"Brock's Mom"
        },
        "115332232222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gloria of Galar</span></div></span></div>",
            "created":1577965020,
            "id":2768222,
            "title":"someone else"
        },
        "13":{
            "author_id":"hornet217",
            "author_name":"Hornet",
            "choices":[
                "Crystal",
                "Carla",
                "Lexy",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Take your pick</span></div></span></div>",
            "created":1486950360,
            "id":2276837,
            "title":"Original female character (With powers)"
        },
        "14":{
            "author_id":"uberking422",
            "author_name":"yougurt",
            "choices":[
                "Kanto",
                "Johto",
                "Hoenn",
                "Sinnoh",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which region are you in?</span></div></span></div>",
            "created":1388638800,
            "id":1720115,
            "title":"Where will your adventure take place?"
        },
        "141":{
            "author_id":"uberking422",
            "author_name":"yougurt",
            "choices":[
                "At the beginning of your journey, about to recieve your first Pokemon.",
                "About to encounter a female gym leader, who turns out to be a giantess!",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright. So you're a trainer journeying in the Kanto region. Where do you start?</span></div></span></div>",
            "created":1449378000,
            "id":2070973,
            "title":"Kanto"
        },
        "1412":{
            "author_id":"uberking422",
            "author_name":"yougurt",
            "choices":[
                "Misty, the Tomboyish Mermaid!",
                "Sabrina, The Mistress of Psychic Pokemon!",
                "Erika/Janine"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which gym leader are you about to meet?</span></div></span></div>",
            "created":1449378000,
            "id":2070974,
            "title":"Gym Goddesses of Kanto!"
        },
        "143":{
            "author_id":"pshaw",
            "author_name":"Somedaynotsoon",
            "choices":[
                "Storyline 1",
                "Storyline 2",
                "Storyline 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I believe I'm obligated to split this into Storylines, so if someone doesn't want to add to one but still wants to add to Hoenn they can. So then...</span></div></span></div>",
            "created":1469768400,
            "id":2188084,
            "title":"Storyline Divide"
        },
        "1431":{
            "author_id":"pshaw",
            "author_name":"Somedaynotsoon",
            "choices":[
                "Venus, the Gentle Goodra",
                "Hannah, the Fun - Loving Leafeon",
                "Reina, the Monarchical Mareep"
            ],
            "content":"<div class=\"\"><div> <span>((I assume it's okay if pokemon from later generations appear in regions from earlier games, right?))<br>\r\n<br>\r\nFelix was not an easy fellow to read. It could be that his face wasn't really visible most of the time, it could be be because his voice didn't really carry that often, or maybe it was his attitude. Let's be honest, it was probably his size, though. <br>\r\nFelix had been a trainer for a little while, now just past his 19th birthday, and his dull hair was matted with experience and various fluids. He wore some sort of special clothes that dried quickly and always scaled with him, not that that happened often. Casual gray sweatpants, long sweater, short socks. And no shoes most of the time (He didn't do a lot of walking). Felix had a bit of a straying mood, likely induced by his company. Felix, as a Pokemon trainer, had three pokemon he kept with him. Unfortunately for him, they were each girls blessed with the power to change the size of anyone, including themselves, and especially including him. They were:<br>\r\n<br>\r\nVenus , the Goodra, who was rather chubby and curvaceous, and tended to use her power to toy around with Felix. She was the leader out of the three, and the one he caught first. She's generally rather dominant, but he knew she would never cross any sort of line. She was rather social and enjoyed sharing company. Her favorite thing:  hot days when everyone is outside. <br>\r\n<br>\r\nHannah, the Leafeon, who was built the tallest and most slender of the three, and liked to use her power on everybody, especially herself. Hannah was caught second, as an Eevee, and was evolved most recently of all Felix's companions. She was a party girl,  and made situations that she thought were fun without really giving it a second thought. She wasn't very responsible, but didn't really care for violence or anything extreme. She was loud and boisterous and braggy, but definitely the most gentle of the three. Her favorite thing: small, tight rooms and spaces. <br>\r\n<br>\r\nAnd Reina, the Mareep, who was fluffy and voluptuous, and tried to be as clear as possible that she owned Felix, not the other way around, thank you very much. Reina didn't talk to many, but around him she was booming, and expressed that she was his queen often. She was the most rough with Felix of the three girls, and treated him like a toy, a slave, a servant, it all. She was a bit egocentric, and certainly loose in the empathy department, but Felix loved her nonetheless. She was caught last. Her favorite thing: privacy.<br>\r\n<br>\r\nFelix was traveling in the Hoenn region, shrunken to a handheld size by his Pokemon. He had trouble keeping them in their ball. They had just set up camp, when one had taken him away from the other two girls. <br>\r\n<br>\r\nWho got first crack at you? </span></div></div>",
            "created":1469854800,
            "id":2188336,
            "title":"Storyline 1"
        },
        "14311":{
            "author_id":"pshaw",
            "author_name":"Somedaynotsoon",
            "choices":[
                "The girls compromise, and pass the tiny trainer around.",
                "One of the girls uses their power on you/themselves...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Felix was pulled aside by your Goodra, Venus. She had taken him into the tent, leaving the other two girls outside. She held him in one hand, and then sat down in one corner of the tent, unfurling her thick fingers from around his pocket-sized form. He sat in her palm for a brief moment before speaking up.<br>\r\n<br>\r\n\"What's going on, Venus? Why have you done this?\" He asked. Felix had a tendency to speak in a roundabout and arbitrary fashion, often using grammatical tenses that don't fit with the flow of conversation. He was an odd bird, even without the strange and powerful company. <br>\r\n<br>\r\n\"I just thought we could play a little, Licks, is that so bad?\" The purple dragoness tried to justify herself. \"Licks\" was the most recent in a number of attempts on her part to give Felix a diminutive nickname. Whenever she gave him a nickname, it trickled down through the other two girls before it dropped out of use and Venus came up with another one. He used to respond with some variant of \"eww, don't call me that\" but that usually got him in trouble, and with girls several times his size, staying out of trouble was definitely preferable.<br>\r\n<br>\r\n\"We could play a little <i>what</i>, exactly? I'm none too keen to spend another night in -\"<br>\r\n\"That was <i>one time!</i>\" Venus interrupted. Some extra color pooled in her cheeks. \"And I <i>wasn't </i>lying when I said I couldn't get you out! It was my bad, but seriously, let go, dude, it's embarrassing.\"<br>\r\n\"I shall in the future make the attempt to let go.\"<br>\r\n\"Weirdo.\" <br>\r\n<br>\r\nThey sat in awkward silence for a couple seconds. Felix shifted awkwardly in her cupped hand, lying on his stomach now. <br>\r\n\"I'll repeat, then. We could play a little what,\" he took a breathy pause, and then he said with more impact this time, \"Exactly?\" <br>\r\nVenus blushed heavily, sucking in her lips a little at his prodding. She pushed the hand he lay upon up between her breasts, dropping him in the canyon. He was caught between them, and she shook them once just to show him who was boss. <br>\r\n\"We could play 'til you drop, Licks, so don't be so rude,\" Venus retorted, then poked her trainer's head, and pushed him deeper in the canyon. \"I could shrink you until you're a microbe if I wanted to, you know.\" <br>\r\nFelix gave some kind of muffled reply in between the large orbs, but she couldn't make it out. She didn't really care too much, anyway. <br>\r\n\"We've gotta get moving to Fortree City tomorrow. Tonight, let's just enjoy each other, huh? You'll just be mine and mine alone for the night, 'kay?\"<br>\r\nA muffled groan came from between the two hefty spheres, and the struggling slowed down. Venus let out a sigh, and sat back, leaning against a pair of legs. She looked up. Hannah was staring back at her, leaning over invasively. <br>\r\n<br>\r\n\"Whatcha up to???\" She asked, drooping over to look at the goo girl. <br>\r\n\"Uhh, nothing, nothing, really -\" Venus tried to sound bored.<br>\r\n\"Oh, 'zat so? If you aren't doing anything, can I have my little Felix, please? I want to rub him all over my - hm?\" Hannah  fell forward as Venus slid away, and the Leafeon tumbled forward and over on top of her. Her legs lay at weird angles on Venus' shoulders, her arms down and straight past her navel, face pushed in a scrunched up mess at the Goodra's ankles, and her pelvis was right on top of Felix, who was pushed on the right and left by Venus' boobs and on top by Hannah's crotch. Venus turned away and tried to get the slender but surprisingly heavy figure off her. <br>\r\n<br>\r\n\"H-Hey! Get off me! Your butt's in my face!\"<br>\r\n\"I'm trying, but I can't get up! Eww, you're so sticky all over!\"<br>\r\n\"This is your fault! You had to be so nosy, Hannah, jeez!\" <br>\r\n<br>\r\nThis went on for a few minutes before Reina came in, as well. <br>\r\n\"Well, well. Are you two fighting over my little servant again? Well, I'll wrench him out from you two if I must.\" She scoffed, then paced over to the other two pokegirls and stuck her arms into the pile of girl, also. Eventually, she found her target, and pulled him out from betwixt Venus' breasts. \"I believe you'll be tending to me tonight, tiny.\" She pinched him tightly, starting to leave before being tackled by Hannah, then Venus shortly thereafter. The three of them fought in a messy heap, each crawling all over one another to grab Felix away. He tried to protest, as he was messily tossed about from boob to hand to fist, and as he got caught under and between his three pokemon, but such was not to be. These girls were unyielding. In his world, there was no choosing between these three. <br>\r\n<br>\r\nEventually, they all tuckered themselves out, and Felix found himself slipping downward, out of the clutches of the girls and back in between Venus' large tits. Looks like she got what she wanted after all. Felix yawned, and dozed off to sleep...<br>\r\n<br>\r\nThe next morning...</span></div></div>",
            "created":1470027600,
            "id":2189903,
            "title":"What's a little insanity among friends?"
        },
        "144":{
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a boy or a girl?</span></div></span></div>",
            "created":1449291600,
            "id":2070617,
            "title":"Sinnoh"
        },
        "145":{
            "author_id":"dbarricade",
            "author_name":"Detective Barricade",
            "choices":[
                "Unova",
                "Kalos",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's the remainder of the regions from the main games...for now. Plus an other option.</span></div></span></div>",
            "created":1388638800,
            "id":1720215,
            "title":"Other"
        },
        "1451":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Storyline 1",
                "Storyline 2",
                "Storyline 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright solid choice. Now then pick a storyline.</span></div></span></div>",
            "created":1401771600,
            "id":1806609,
            "title":"Unova"
        },
        "14511":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Go talk to the stars.",
                "Go to the premier."
            ],
            "content":"<div class=\"\"><div> <span>You had just arrived at the entrance to Pokestar studio, the crowds of people inside. Accompanying  you was your mother and younger sister. Your family was going to the premiere of \" The Giant Woman 2 \". The original was your mothers favorite movie, you loved it for a whole different reason. You looked at the large poster outside, it depicted one of the stars of the film, Sabrina about to stamp on a house with people running in fear as the other star, Monica attempting to stop her.<br>\r\n<br>\r\n        As you walk along you notice the stars of, said film giving an interviews and sighing autographs.<br>\r\n<br>\r\nDo you go to the premier, or meet the lovely Starlets. <br>\r\n<br>\r\n</span></div></div>",
            "created":1401771600,
            "id":1806617,
            "title":"Storyline 1"
        },
        "15":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Slot 1",
                "Slot 2",
                "Slot 3",
                "Slot 4",
                "More slots"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, let's have some slots!</span></div></span></div>",
            "created":1431838800,
            "id":1979346,
            "title":"Female Anthro Pokemon (With powers)"
        },
        "151":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Nothing much - fun with your trainer around the house!",
                "He plans on levelling you up! More power is always a good thing, right?",
                "New character!"
            ],
            "content":"<div class=\"\"><div> <span>\"Iris?\" your trainer meeps, a deep blush creeping its way onto his cheeks. Giggling, you pull him in closer to your body and shrink him a tiny bit more, rolling onto your back as you do so. Child-sized trainer laying atop you, you splay out your legs, taking advantage of the available space on the bed. Rubbing your trainer's back with a black-furred paw, you push him into your fur, smooshing his head in between your large breasts. He liked - no, loved your breasts, but he would never admit it. He was just a bit too shy and afraid of you to do that. <br>\r\n<br>\r\nAnd who in their right mind wouldn't be afraid of an anthropomorphic Lucario that could change her own size, and the size of others? Having come from a village where size-changing powers were unheard of, your trainer received a shock to the system when he realised you could shrink or grow him at will - though you very much preferred to shrink him. Or grow yourself. He had caught you, believing that you were merely an anthro Lucario, not a goddess, and you had decided to allow him to command you and take you on his travels - he was a rather cute thing, after all. <br>\r\n<br>\r\nShifting uncomfortably, your trainer attempts to remove his head from your cleavage, before you undertake two actions: firstly, one of your paws presses his head back in. Secondly, your breasts suddenly fwoomp out larger, instantly enevloping his entire head in warm, jiggling flesh. \"G-goodnight, Luca...\" her mumbles from within your cleavage. <br>\r\n<br>\r\nSmiling, you allow yourself to drift into sleep, wondering what your trainer had planned for tomorrow...</span></div></div>",
            "created":1431838800,
            "id":1979508,
            "title":"Luca"
        },
        "1511":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Shrink him and trap him in your cleavage!",
                "Shrink him, then lightly sit on him!",
                "Grow until you fill a room completely!"
            ],
            "content":"<div class=\"\"><div> <span><i> It appears that 'Iris' got left in as opposed to deleted. Whoops, my bad. Thought I'd replaced it.</i><br>\r\n<br>\r\nYawning cutely as you open your eyes, you smile at your trainer, head wedged into the cream-coloured fur of your cleavage. Patting his back to wake him up, he jerks awake, pulling his head from your cleavage. As you go through your morning routine, you think up ways to play with your trainer, all of them mischevious. You didn't want to hurt him, but having fun at his expense was on the table. <br>\r\n<br>\r\nYou were going to...</span></div></div>",
            "created":1431838800,
            "id":1979511,
            "title":"Nothing much - fun with your trainer around the..."
        },
        "152":{
            "choices":[
                "A giant adventure or should I say giantess adventure",
                "Shrink 4 pleasure",
                "Other storyline"
            ],
            "content":"<div class=\"\"><div> <span>Gardevoir <br>\r\n<br>\r\nMy trainer wasn't always the brightest but he did save me from some dangerous houndooms so I allowed him to take me with him on his juries a becoming a teen really has made him desperate at which one point he looked up my dress and looked at my boosums while I was bathing well what he doesn't know is that I am no ordinary yards out I have the physic power to change size whether it is to shrink things or grow them it is all up to me. Well me and my trainer are going on a camping trip and so I decided to try and use my powers so I wonder what I should do, I could grow myself and take my master on a giant journey or I can shrink him and have him pleasure me for it has been so long\"</span></div></div>",
            "created":1475125200,
            "id":2216762,
            "title":"Slot 2"
        },
        "1522":{
            "author_id":"hornet217",
            "author_name":"Hornet",
            "choices":[
                "Change me back ",
                "Fine I'll stay this size"
            ],
            "content":"<div class=\"\"><div> <span>We check in to a hotel for 3 days. That night when he fell asleep I shrank him to 4in. I gently place him in my breast and fall asleeep. When I wake up he is still asleep. I poke him on the top of his head. He wakes up an looks around confused. Then he looks up and see my giant face then starts to freak out. I pull him out of my cleavage and cradle him in my arms witch calms him down. Gard he said. Did you do this to me. I nod. Can you undo it he says. I nod. Will you undo it he says. I shake my no and give him a kiss witch covers his intire face and hold him to my chest. I lift him to my face and he says </span></div></div>",
            "created":1487785140,
            "id":2280773,
            "title":"Shrink 4 pleasure"
        },
        "15221":{
            "author_id":"hornet217",
            "author_name":"Hornet",
            "choices":[
                "Try to get him to accept being small",
                "Toy with him some more"
            ],
            "content":"<div class=\"\"><div> <span>Please Change me back. He says. I use Telepathy and tell him no I plan on keeping you this way for a wile. After you say that he jumps of your hand and starts sprinting for the side. Grab him and say, Some one needs a time out and put him in you cleavage. He starts to climb out but you push him deeper in to where he can't move but breath.</span></div></div>",
            "created":1487785740,
            "id":2280775,
            "title":"Change me back "
        }
    },
    "info":{
        "author_id":"uberking422",
        "author_name":"yougurt",
        "brief_description":"Female trainers and anthro female Pokemon can grow themselves and shrink others!",
        "created":1388706660,
        "description":"<td align=\"left\" class=\"norm\">Inspired by one of my favorite DeviantART RPs, this interactive takes place in an alternate version of the Pokemon world, where gifted female trainers and rare anthropomorphic female Pokemon are blessed with the ability to grow themselves and shrink others!<br>\r\n<br>\r\nThis is an 18+ interactive, so most anything goes, though I myself am partial to:<br>\r\n<br>\r\nButt<br>\r\nBreast<br>\r\nInsertion<br>\r\nSoft Vore<br>\r\nFart<br>\r\nGentle/Playful<br>\r\n<br>\r\nThings such as feet, violent, and toilet are allowed as well.<br>\r\n<br>\r\nI will award good additions with up to 1000 points depending on how I judge the quality.<br>\r\n<br>\r\nBased on this RP: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://uberking422.deviantart.com/art/Pokemon-Giantess-Error-RP-375915140\" target=\"_blank\">http://uberking422.deviantart.com/art/Pokemon-Giantess-Error-RP-375915140</a></td>",
        "id":1969656,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1577965020,
        "modified":1577965020,
        "pretty_title":"Goddesses of the Pokemon World"
    }
}