{
    "chapters":{
        "1":{
            "author_id":"noisrrah",
            "author_name":"noisrrah",
            "choices":[
                "Mathew (16 years old/medium lenght brown-haired/5'10\"/skater boy/careless)",
                "Connor (13 years old/short blonde hair/5'4\"/averaged sized/extremely horny)",
                "Oliver (14 years old/medium length black hair/5'8\"/skinny/shy)",
                "Josh (16 years old/short brown hair/6'1\"/built/arrogant) ",
                "Charlie (12 years old/short red hair/5'4\"/average sized/absentminded)"
            ],
            "content":"<div class=\"\"><div> <span>It all started in a small store somewhere at the edge of the city. You sat in a glass cage, with four other naked sweaty kids, pounding at the glass, trying to break free. Apart from them, your cage was empty, with nothing but some old socks piled in the bottom of the cage for warmth and comfort.<br>\r\n<br>\r\nThe door opened and you saw a boy enter. You and all the other tinies hid inside the socks. Which giant boy just entered the store?</span></div></div>",
            "created":1356152400,
            "id":1492665,
            "title":"It Begins"
        },
        "11":{
            "choices":[
                "Sweat and Smell Enhancing Room (Armpits, Feet...)",
                "Virtual Vore Room ",
                "Other Rooms",
                "Other Rooms",
                "Other Rooms"
            ],
            "content":"<div class=\"\"><div> <span>A sweaty older teenage boy with shoulder length brown hair, and skateboard tucked under his arm (his T-shirt visibly decorated with warm oozing pit stains there.) had entered the store and approached the cages with a dark chuckle.<br>\r\n<br>\r\nThe shopkeeper, having heard the jingle of the door's bell, came out from the back and stood behind the clerk's desk, he saw the tall boy with the skateboard and pit stains and grinned. \"Can I help you?\" <br>\r\n<br>\r\nMatt looked up and smirked, \"Need a slave, one that can tolerate a LOT of funk and sweat, not just from my feet either.\" With a goofy grin, the boy scratched underneath his underarm and sniffed his finger afterwards with a content sigh.<br>\r\n<br>\r\nThe shopkeep's grin only grew, \"I think we have just the slave, or if you would rather, a number of them?\" <br>\r\n<br>\r\nMatthew leaned on the counter, \"Depends if you're having a sale or not.\"<br>\r\n<br>\r\n\"You're just in time for one, young man.\" The shopkeeper smiled kindly, betraying the evil that went on here in his store.<br>\r\n<br>\r\n\"Fine...give me three of your best slaves!\" <br>\r\n<br>\r\nReaching into one of the glass containers, the shopkeeper selected some of the fresher slaves he'd just got in, young ones...with a lot of vigor. <br>\r\n<br>\r\nHe put them in a container with air holes, of course these holes were not big enough to escape from. \"Should I keep them in here? Or would you like to test them out first in the back room? We have a room designed to enhance every designated method of torment you could inflict upon a slave.\"<br>\r\n<br>\r\n\"Sounds fun, show me.\" Matthew said grinning deviously as he followed the older man to the back.</span></div></div>",
            "created":1400734800,
            "id":1800681,
            "title":"Mathew (16 years old/medium lenght brown-haired..."
        },
        "12":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "You",
                "The blonde boy",
                "The brown haired boy",
                "The black haired boy",
                "The ginger haired boy"
            ],
            "content":"<div class=\"\"><div> <span>The door opened and a young boy walked in, he was small for his age and wearing a bright red T-shirt, black shorts and a pair of white sandals with orange designs on them. he walked in and went to the owner and said \"Hey man, got any new stock, my last one dies on me\". His childish giggle sent shivers down your spine. The owner laughed and pointed at your cage and said \"Just got them finished training this morning, fresh as ever, take your pic Connor\". Connor giggled as he came over to our cage, he grinned down at us as we all screamed and begged to be let go. He smiled down reached in and grabbed..........</span></div></div>",
            "created":1356152400,
            "id":1492669,
            "title":"Connor (13 years old/short blonde hair/horny)"
        },
        "122":{
            "author_id":"randomer185",
            "author_name":"Randomer0987",
            "choices":[
                "A 5'8'',14y Boy with Wild Brown Hair.",
                "A 5'10'', 15y Boy with Dirty Blonde Hair.",
                "Someone Else..."
            ],
            "content":"<div class=\"\"><div> <span>Connor snatched at the blonde boy standing next to you, then removed his hand from your cage. The blonde boy began to flail wildly in Connor's hand, as he kicked off his right sandal. As quick a flash, Connor lay the boy, face up, on the surface. The small boy attempted to get to his feet, but was immediately subdued by the giant's sole.<br>\r\n<br>\r\nConnor smiled at the owner, turned, then strolled out of the door with his new slave smothered beneath his foot!<br>\r\n<br>\r\nNo less then 5 minutes after Connor left, another teenager entered the shop. He was...</span></div></div>",
            "created":1362632400,
            "id":1545532,
            "title":"That Was Close..."
        },
        "1221":{
            "author_id":"randomer185",
            "author_name":"Randomer0987",
            "choices":[
                "Lick Between His Toes.",
                "Do Nothing."
            ],
            "content":"<div class=\"\"><div> <span>The door opened and a young teen walked inside, dressed in football kit, and coated from head to toe in sweat. He strolled up to the counter, then began conversing with the owner, who referred to him as Lewis, about how his 'previous one' couldn't handle his feet. The owner nodded, and told him to take which ever slave he wanted. The boy walked over to you, and your fellows. He was very good looking, with a few feminine features. However, he had a mild look of insanity in his eyes, as he looked over his shoulder to see that the owner was not paying attention. Then he span around, placed his hand inside and grabbed both you and one of the other boys, and stuffed you into his short's pockets.<br>\r\n<br>\r\nAbout 20mins later, he removed both of you from his pocket, and grasped you in his sweaty palm, then dropped you onto a cold surface. You looked around and noticed that you were in a locker room, with two giant trainers either side of you. <br>\r\n\"I HAVE TO GET SLAVES VERY REGULARLY, DUE TO THE AMOUNT OF SPORTS I PLAY. THIS MAKES MY FEET VERY SORE, SO YOU GUYS WITH RUB MY SIZE 9'S FROM WITHIN MY SWEATY SOCKS!\" As Lewis finished talking, he began flexing his toes from within his large trainers. \"ALSO, I HAVE MADE A BET WITH A FRIEND, THAT IF HE SCORES MORE GOALS THAN ME, I WILL GIVE HIM THE SLAVE THAT IS THE LEAST DEDICATED TO MY FEET!\" <br>\r\n<br>\r\nWith that, Lewis untied his trainers and pulled them off his feet. A horrendous scent filled the air, and Lewis smirked as he peeled his soaked socks off his rancid feet. Once removed, he lifted your unconscious comrade off the ground, and suspended him above the left sock and released him into the pit of sweat. Then Lewis grabbed you, smiled psychotically at you, and dropped you inside the right sock.<br>\r\n<br>\r\nWhen you hit the end of the sock, you barely managed to retain consciousness against the furnace-like heat that emanated from every part of this teen's sweaty football sock. Then you looked up, and your heart sank. Five gargantuan toes descended into your prison, flexing, and dumping lint upon you. Then you pinned against the smooth surface of Lewis' sole, whilst you face was smothered deep between his long, cheesy toes. The pressure and scent dramatically increased when your master's foot was sealed within the tight, leather football boot, that had absorbed his sweat and foot odour for the past few years.<br>\r\n<br>\r\nLewis then stood up, stomped each foot to encourage his slaves to rub his feet, then his jogged onto the pitch, with tiny men beneath his giant soles, smelling and massaging as he ran.<br>\r\n<br>\r\nAs the game drew longer, and you became more intoxicated by this teens foot stench, while your face was smothered deeper between Lewis' long, moist toes. It occurred to you that in order to stay with your psychotic master, you would have to really commit yourself. So you decided to...  </span></div></div>",
            "created":1384318800,
            "id":1693899,
            "title":"Worst Case Scenario"
        },
        "12211":{
            "author_id":"nope666",
            "author_name":"Nope",
            "choices":[
                "Stay here",
                "Risk it"
            ],
            "content":"<div class=\"\"><div> <span>You quickly dunk your head between his toes as you close your eyes and began licking the sweat, lint and toe jam. At first it was horrendous but all your conditioning made it easy. As you lap up skin you begin to remember 6 months ago before you were forced to lick between someone almost as old as you toes. Before you were condemned to this life.<br>\r\n<br>\r\nAt the age of 14 your fate was decided. You either go on to be a normal citizen or you become a toy for those hard working citizen. You had been selected because of your fetish which was a goldmine for microcorp, a footslave that wanted to be a slave they made a reward for anyone who exposed these fetishist. <br>\r\n<br>\r\nOne day you had a sleepover with your friend Josh he was a mischievous kid with great feet after a long night of video gaming and pizza. Josh had passed out and with his feet right next to your face. You took a deep breath and the musky odor plunged into your nostril. You immediately get hard. You begin to go over the con and pros of doing something about it. After a few minutes of debating you flick his foot to get a reaction, nothing.You licked his sole, still nothing. You began licking between his toes, after a few seconds of licking you moan and pull down your pants and your dick slapped your stomach you began fucking his feet until you hear a moan. “Oh man you're one of those people.” Josh said laughing. You went white with fear. He began tugging your dick with his feet. “What's the matter Garret don't want to fuck my feet when I'm awake.”you were shocked your friend was giving you a footjob. “Hell I'll give you some pleasure before your shrunk.” He said grinning evilly. He rubbed his sole up and down your shaft making you gasp in pleasure. “Like that?” You nodded. He grabbed your head with his toes and rubbed his sole down the bottom of your shaft gaining another moan of pleasure from you.In a spectacular finale he tugs your member and you spill your seed all over his feet and and pants. “There now there is genetic sample, microcorp will love your fetish.” Josh said laughing maniacally.<br>\r\n“No josh please don't do this, I'll be treated less than human.” You, “sorry Garret but they pay a fuck load of money for your kind, it'll get me through college.” He looked almost guilty but that quickly faded away.<br>\r\n<br>\r\n<br>\r\nYou chuckle to yourself as you lay in between Lewis’s toes, all it took was one moment of weakness to ruin your life forever. After Lewis’s game he complimented you on licking so much he let you sleep in between his toes. He forced the other dude in his sock that he wore during the game. “I don't feel licking down there slave.” You hear Lewis mumble as he played on his phone. You quickly go back to licking. You eventually hear snoring  as you realize that Lewis is asleep. You have two options, stay in his shoe or try to escape.<br>\r\n</span></div></div>",
            "created":1474347600,
            "id":2212604,
            "title":"Life before the shrinking "
        },
        "122111":{
            "author_id":"nope666",
            "author_name":"Nope",
            "choices":[
                "Algebra ",
                "Gym"
            ],
            "content":"<div class=\"\"><div> <span>You know that no one would help you even if you did escape. Might as well stay with a giant that currently is treating you better than most slaves. You decide to get some rest between his warm sweaty toes… <br>\r\n<br>\r\n You are shocked awake when you hear a ear piercing screeching sound of lewis’s alarm. You hear Lewis groan and hit his alarm you sit up and looked down to see your one eye monster happy to see you, you had loss the shorts you were given by microcorp. “Oh fuck.” You slap your hand against your forehead.<br>\r\n<br>\r\n“MORNING SLAVES.” Lewis says laughing you see him bring his pointer finger over to you and rubbed you out of his toes rubbing your face and cock into his toe flesh it was to hard for you to gain any pleasure from it. “OH I SEE WE HAD SOME FUN IN BETWEEN MY TOES.” Lewis said laughing, “WELL I'LL BE SURE TO WEAR MY SHOES SOCKLESS JUST FOR YOU.” , “WELL NOW IT'S JUST US, I GAVE THE BAD SLAVE TO MY FRIEND SO IT'S JUST YOU AND ME.” He laughs. He then drops you in his trainer. You look up and see Lewis's foot enter the shoe and his toes grab your tiny naked form and drags across the sole to the toe section. After 30 minutes of scrunching rubbing and a awkward boner you hear a bus stop and Lewis step on. What class does he have first.<br>\r\n</span></div></div>",
            "created":1474347600,
            "id":2212631,
            "title":"Stay the night"
        },
        "1222":{
            "author_id":"randomer185",
            "author_name":"Randomer0987",
            "choices":[
                "Home",
                "Back to School",
                "A Friend's House"
            ],
            "content":"<div class=\"\"><div> <span>A reasonably tall boy entered, wearing what appeared to be a school uniform, his curly, blonde hair swaying from side to side. He walked up to the counter as the clerk cried in delight, \"Ollie, I haven't seen you for a while!\" The boy named Ollie smiled at the store owner, then requested a new slave, stating that he had lent his old one to someone called Tom. The clerk acknowledged him, then told him to take his pick from your cage. Ollie moved towards you, then grasped you in his hand. \"A fine choice!\" said the owner. <br>\r\n<br>\r\nOllie then went into a room off the side of the shop, sat down and placed you on the floor in front of his looming figure. \"I think firstly, you need to get up close and personal with my feet!\" Ollie then knelt down and undid his right shoelace. He then proceeded to pull his shoe off. The smell and heat were overwhelming, you were stunned that such a smell could have come from a teenager's shoe. \"I wear these shoe for around 7 hours a day, so they get pretty smelly.\" He removed the insole and showed you it. There was a large, gold number 10 emblazoned upon the black surface and it was covered in a large layer of sweat and grime. He replaced it in his shoe and then peeled off his right sock. Then Ollie picked you up and dangled you above the opening. \"I have worn these socks for a week straight and they have captured the smell and sweat of a weeks hard work!\" Ollie flexed his long, dexterous toes. \"I think you'd quite like to get a first hand experience!\" You shook your head violently and began to shout at him. \"Bad move,\" he said with a menacing smirk.<br>\r\n<br>\r\nWith that, he released his grip and let you plummet into the rancid prison beneath you. The scent was incredible and it was like being dumped into a furnace. You slipped on the sweaty surface and looked up. Ollie's sweat drenched toes came speeding towards you. Now your body was pinned under the teenager's powerful sole and your head was smothered between is moist toes. He began to laugh as you squirmed. \"You'd better massage my sore soles, or you'll be in a world of trouble!\" he called down at you. Then without a second thought of his sock captive, his slipped on his size 10 and walked out of the door.<br>\r\n<br>\r\nWhere does Ollie go...</span></div></div>",
            "created":1362632400,
            "id":1545713,
            "title":"Sole Captive"
        },
        "1223":{
            "author_id":"randomer185",
            "author_name":"Randomer0987",
            "choices":[
                "Aaron (16) is 5'10 with short blondish hair. He is arrogant and wears Size 10s",
                "Toby (16) is 5'7 with short brown hair. He is self-confident and wears Size 7.5s",
                "Someone Else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of these two...</span></div></span></div>",
            "created":1401080400,
            "id":1802572,
            "title":"Someone Else..."
        },
        "12233":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Joey",
                "Josh"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Joey, 7/o<br>\r\nBlond hair<br>\r\n<br>\r\nJosh, 8 y/o<br>\r\nBrown hair</span></div></span></div>",
            "created":1413867600,
            "id":1875634,
            "title":"Someone Else..."
        },
        "13":{
            "author_id":"bofig",
            "author_name":"Riwert",
            "choices":[
                "Oliver goes home",
                "Oliver wants that you lick his sole",
                "Oliver wants to show slave his friends "
            ],
            "content":"<div class=\"\"><div> <span>Oliver is a boy from the village. He recently moved to your town. He had heard of the sale of tiny slaves, but there were no stores in his village to buy them. Oliver really wanted a tiny slave boy who would worship his tired feet. He often worked on a farm with his relatives, so his feet could be sweaty and dirty for days. Oliver loves to walk barefoot. He is shy, but can be rude if he wants.<br>\r\n<br>\r\nHe is wearing a white T-shirt, shorts and flip flops. He went to the store owner, said a few words quietly and put $ 7 on the cashier. After that, he went to the cells and put his hand in there. He grabbed you and pulled you out. The giant grinned at you. You were hoping that he would carry you home in his pocket, but the world is cruel. Oliver put you on one of flip-flops and started putting it on. He has a big feet for his age. This is your new life under the dirty sole of a teenager boy ...</span></div></div>",
            "created":1562302800,
            "id":2682380,
            "title":"Oliver 14 years, rustic boy"
        },
        "132":{
            "author_id":"bofig",
            "author_name":"Riwert",
            "choices":[
                "Oliver goes to his friend",
                "Oliver goes to home"
            ],
            "content":"<div class=\"\"><div> <span>“L-Lick my foot,” Oliver said uncertainly. Because of pressure and smell, you thought slowly, so you did not fulfill the order. Suddenly, Oliver increased the pressure, so that your face was in the skin of the sole. \"Lick my foot, you stupid slave!\" This time you opened your mouth, and with disgust you began to lick Oliver's sole. The hideous taste of sweat, dirt and dead skin filled your mouth. You swallowed a drop of salt sweat, your tongue turned black from dirt.<br>\r\n<br>\r\nOliver closed his eyes with pleasure. Finally he has a slave who is ready to be so humiliated. The tiny tongue of a slave cleans his big sweaty sole. Oliver was happy.<br>\r\n<br>\r\nYour giant master has begun to walk. You breathed in the smell of the teenager's feet, continued to work with your tongue, and lost the hope of ordinary life.<br>\r\n* BUUM * *lick lick lick lick* * BUUM * *lick lick lick lick* * BUUM * *lick lick lick lick* * BUUM * *lick lick lick lick* * BUUM * *lick lick lick lick*...</span></div></div>",
            "created":1562648400,
            "id":2684378,
            "title":"Oliver wants that you lick his sole"
        },
        "1322":{
            "author_id":"bofig",
            "author_name":"Riwert",
            "choices":[
                "Prehistory of Garret(you)",
                "Oliver tells you about your duties."
            ],
            "content":"<div class=\"\"><div> <span>Every step of your giant master crushed your little body. But it did not break. Your body has been made very strong so that it can withstand pressure. You kept licking. It was very humiliating, but ... you liked it. You hated yourself for it. Most boys become slaves because of bad behavior, bad grades, or misconduct.<br>\r\nThe only reason for your slavery under Oliver's foot is your fetish. Damn it, you are the same teenager as he, you want to live, and not to sniff and lick the sole. This is unfair. But who will listen to the tiny boy slave. It is foolish to hope, you need to obey and... lick.<br>\r\n<br>\r\nOliver went to his home. The tiny slave under his foot tickled him slightly with his movements. But Oliver liked that. The slave very hard licked his sole. The teenager did not even imagine that he would make such a good choice from all the tiny boys. \"I want more slaves. He can't handle my guys alone.\" Oliver smiled and moved his toes. \"Although this slave is trying very hard. Maybe my cousin will like him.\"<br>\r\n<br>\r\nFinally Oliver came home. In the hallway, he took off his flip-flops. You are very weak after a trip under a sweaty foot and could not get up. Oliver grinned, and put you in his palm ...</span></div></div>",
            "created":1562907600,
            "id":2685661,
            "title":"Oliver goes to home"
        },
        "13222":{
            "author_id":"bofig",
            "author_name":"Riwert",
            "choices":[
                "ShrinkingGram with foot and you",
                "Little btother(little to Oliver of course)"
            ],
            "content":"<div class=\"\"><div> <span>Well, fine, fagot. - said Oliver and you felt an unpleasant smell emanating from his mouth. But you just a moment ago, freed from under his feet, which smelled much worse. “I like your work.” As long as you lick and execute my other orders, everything will be fine. “You moaned a little, the foot of Oliver caused your body a lot of pain. Oliver laughed. “If you think my feet are the worst, then I can give you to my brother.” He practices karate, his feet stink worse than rotten eggs. And if you shirk work, my father will be happy to show you what AD is. “Oliver put you on the table and spat on you.” Now your body was not only sweat but also in saliva. –Customize this and do not expect compassion. So as you have no compassion, you like it. “Then Oliver looked at something on the phone.” - All my friends have slaves, we invent ways to humiliate them and post them on the Internet. So your friends will be able to see how you lick my ass. - Oliver grinned, and you trembled. This teenager can do anything with you, you are meant to be his complete slave. You will have to lick his feet very carefully, or you will be forced to do more vile things.<br>\r\n<br>\r\nP.S. If you have an idea that happen with tiny Garret but you do not want write it yourself , you can write on my email. Let's make this boy suffer under big sweaty feet of others boys(maybe they will be more younger than he).</span></div></div>",
            "created":1563944400,
            "id":2691371,
            "title":"Oliver tells you about your duties."
        },
        "14":{
            "author_id":"rockethead",
            "author_name":"subboysworld",
            "choices":[
                "You are chosen as a slave.",
                "You are chosen to be eaten.",
                "You are one of the unchosen two."
            ],
            "content":"<div class=\"\"><div> <span>\"Hello, Sir.\"<br>\r\n<br>\r\nThe teenager was an inch taller than the shopkeeper, evidently athletic. \"Do you sell tinies for food?\"<br>\r\n<br>\r\n\"Why yes, sir. You may do whatever you want with them once you purchase them.\" I could hear the the gasps from my tiny peers. None of us expected or have been trained to be eaten.<br>\r\n<br>\r\n\"Hahaha, perfect.\" The cocky jock laughed. \"But, you only have these five?\"<br>\r\n<br>\r\n\"Yes sir, five is all we have today, we will be getting another twenty or so tomorrow.\"<br>\r\n<br>\r\n\"I'm uncertain if I want food or a slave, and I know my little brother definitely wants a play toy. What are they trained in as slaves?\"<br>\r\n<br>\r\n\"Our tinies are full trained servants,\" the shopkeeper began. \"They lick my feet every morning, or my twelve year old son's. They are taught to give tiny massages, and more.\"<br>\r\n<br>\r\n\"Wonderful. I want a slave, but I'm also hungry.\" The jock thought to himself. \"I'll take two slaves, for me and my brother, and then could you cook one up for me right now?\"<br>\r\n<br>\r\n\"Sure thing, sir. Which would you like as slaves, and which would you like for food?\"<br>\r\n<br>\r\n\"For slaves..,\" the jock looked at the the five of us, \"I'll take these two! How about you cook up...this one!\"</span></div></div>",
            "created":1467090000,
            "id":2172275,
            "title":"Josh (16 years old/short brown hair/6'1\"..."
        },
        "141":{
            "author_id":"rockethead",
            "author_name":"subboysworld",
            "choices":[
                "Josh eats his food, and carries the two of you out."
            ],
            "content":"<div class=\"\"><div> <span>Before you could think to run, you and the tiny next to you were clenched into the shopkeepers hand. You were put in a transparent little box, which he quickly capped with its top, and tied together with a cute ribbon. Holding onto each other, you try to prepare for your life ahead, so overwhelmed you are late at noticing the fate of your other peer.<br>\r\n<br>\r\nScreaming, the fattest of the tinies is held up and brought over to the stove. There is already a pot. The shopkeeper turns on the stove and you can see the popping oil burst a bubble or two into the air. The fat tiny is still screaming bloody murder.<br>\r\n<br>\r\n\"Wait!\" The jock yelled. The shopkeeper turned around and hesitated from lowering your companion into the vat of frying oil.<br>\r\n<br>\r\n\"I like them with a little salt.\"<br>\r\n<br>\r\n\"Of course, Sir!\" With his other hand, the shopkeeper sprinkled a little salt onto your friend. You heard him shrill as the salt burned some of his skin, his cry was then muted by the roar of the oil as he was dropped into it. It was done.<br>\r\n<br>\r\nThe jock chuckled. \"I'm starving, it was a long practice.\" The shopkeeper fried your friend for about a minute, and handed the visibly fried and dead tiny to your new master.</span></div></div>",
            "created":1467090000,
            "id":2172306,
            "title":"You are chosen as a slave."
        },
        "1411":{
            "author_id":"rockethead",
            "author_name":"subboysworld",
            "choices":[
                "Proceed to your new home."
            ],
            "content":"<div class=\"\"><div> <span>As he was pushing the door open with his arm, you and your friend watch your new master shove your fried equal into his mouth. You can hear the crunching and see thee moving of his jaw as tiny little crumbs fall from his mouth onto the sidewalk. \"Ughhh,\" the jock groans satisfied with his food.<br>\r\n<br>\r\nThe jock sits down on the bench against the wall, looking out at the parking lot. He brings you guys, in the gift box, down onto the floor beside his shoes. He's wearing large, white Nike running sneakers. He just barely unlaces each one, and pries, with his finger at the back of his shoe, his large feet out and onto the top of his sneakers. He's wearing white, Nike, athletic calf socks. Unlacing the gift box, he tosses the lid away, and picks the both of you up. He holds you, facing him, and laughs and smiles at you for a moment before reducing you to your new fate. You are pushed into one shoe, and your friend is pushed into another. You can feel the stickiness and the sweat.<br>\r\n<br>\r\nHe holds his feet up for a moment, giving you a shrug of his head, his clearly finds you both pathetic, and then returns his socked feet into his shoe. You see his giant toes knock you forward into, you are clamped under his toes. He clenches his toes, and you feel the oozing sweat of his socked feet soaking you into a raunchy, unfortunate sponge of foot sweat. You can feel master stand up. \"13.5s\" he laughs, and walks. Old master, the shopkeeper, only had 13s.<br>\r\n<br>\r\nYou can feel and hear the oozing sweat with every step. You hear the opening of a car door, and feel the swing of legs as he sits into the seat. You hear the car ignite. You are the pedal, and feel yourself dizzingly be swung in and out of inclines as the car moves. You hear the roar of the tire against the road from underneath you.<br>\r\n<br>\r\n\"So, slaves,\" master was now speaking at the two of you within his shoes. You know from training to hold your arms out and allow your face to become the arch that massages the sole and toes. \"I am your God. Your new life will consist of either worshiping and serving me, or my annoying little brother, depending on who he picks.\" You swallowed in fear, and understood your friend in the other shoe to have done the same. \"Your duties will be various, but most importantly you will worship my body, licking where I instruct, largely my large feet and blessed, jock manhood. You will be quiet, but you will be excited.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1467090000,
            "id":2172313,
            "title":"Josh eats his food, and carries the two of you ..."
        },
        "14111":{
            "author_id":"rockethead",
            "author_name":"subboysworld",
            "choices":[
                "Worship him."
            ],
            "content":"<div class=\"\"><div> <span>You feel the steps up the stairs, and hear the closing of a door. You can tell that your master has sat upon a bed, hearing the creak of the mattress. You hear the other shoe first, and then feel a waft of fresh air as your shoe is untied and pushed off. Master's foot slides out. The shoe is held up, and you fall out onto the carpet floor. You have enough time to turn around so that you are on your back, when you then see Master's foot return to clamp you to the ground. He is rubbing you and your friend into the carpet.<br>\r\n<br>\r\n\"Ahhh,\" he feels the soothing feeling of little tinies as foot massagers beneath his big feet. \"My brother is not home yet,\" he speaks, still using you two as foot massagers. \"I will be training you in the meantime.\"<br>\r\n<br>\r\nMaster, who you learned from his room that his name is Josh, holds his feet up, comanding you two both on your backs, and to position your feet towards the best. His feet return to clamp you, but this time he pushed you up so that your face is clenched in the arch of his toes. You kiss your masters feet, understanding the respect you owe to give, the way you've been trained. He continues to rub you into the floor. </span></div></div>",
            "created":1467090000,
            "id":2172314,
            "title":"Proceed to your new home."
        },
        "142":{
            "author_id":"rockethead",
            "author_name":"subboysworld",
            "choices":[
                "\"I like them with a little salt, if you don't mind.\"",
                "\"I think I'd rather eat him raw.\""
            ],
            "content":"<div class=\"\"><div> <span>The jock points to you as the tastier looking tiny. The shopkeepers hand first removes the two tinies destined for slavery to this hyper-masculine jock. The hand was faster than their ability to run. Your heart sinks knowing your fate, you attempt to scramble within the case, the shopkeeper is too quick, and you are grabbed and brought out. The shopkeeper walks over to the stovetop. You see the other two tinies put into a transparent gift box and handed to the jock. The shopkeeper turn on the stove, there's a pot already in it and the oil starts to bubble and heat up.<br>\r\n<br>\r\nYou see the jock lick his lips. The shopkeeper starts to lower you into the splattering oil.<br>\r\n<br>\r\n\"Wait!\" The jock calls for attention.</span></div></div>",
            "created":1467090000,
            "id":2172278,
            "title":"You are chosen to be eaten."
        },
        "1421":{
            "author_id":"rockethead",
            "author_name":"subboysworld",
            "content":"<div class=\"\"><div> <span>\"Of course, sir.\" The shopkeeper takes a little bit of salt with his other hand and sprinkles it on you, you feel the larger salt pellets burn your skin, cut you and suffocate you. You go blind from the oozing salt in your eyes. You can only open your eyes enough to see the evil and excited grin of your purchaser awaiting his snack. You imagine to yourself the eventual life of the slaves he just purchased, and think to yourself maybe this is better. You imagine becoming such a slave to your new master that you are in fact his food, to live forever inside of him, thinking of this as the shopkeeper finally drops you into the pot. There is an ultimate pain for two seconds until you no longer have sensation, you understand, and feel yourself frying.</span></div></div>",
            "created":1467090000,
            "id":2172281,
            "title":"\"I like them with a little salt, if you don..."
        },
        "1422":{
            "author_id":"rockethead",
            "author_name":"subboysworld",
            "choices":[
                "Tell your predator that you worship him as your God.",
                "Start crying, unable to speak."
            ],
            "content":"<div class=\"\"><div> <span>\"Of course, sir.\" The shopkeeper turns off the boiling oil, and instead hands you over to the jock. He drops you into the palm of his hand. The jock grips onto you with one hand, and carries the transparent gift box of purchased slaves in the other.<br>\r\n<br>\r\nYou return to his car, he sits in the drivers seat and puts the gift box onto the passenger seats. He holds you above his head, admiring you. \"My, this is why we shrink poor kids and losers when they're young...\" he gives you a speech, \"you have better purposes, or rather, we have better purposes, and you are better off as our support.\" <br>\r\n<br>\r\nThe jock licks his lips. He opens his mouth enough for you to see his white teeth and eager tongue flop around inside. He closes his lips again and holds you to them, he kisses you, savoring your taste on lips, then gives you a small lick. \"Mmmm, yes.\" He opens his mouth more and slides you onto his tongue, he closes his lips and you are engulfed into his humid, sticky mouth. He opens his mouth and pull you out, now damp.<br>\r\n<br>\r\n\"I only had my last tiny serving yesterday, but I can't help but just savor it sometimes...\" he tells you. He holds his tongue out and licks your entirety. \"Admit to me that I am now your God, and then you will worship me and give me the ultimate respect by me eating you.\"</span></div></div>",
            "created":1467090000,
            "id":2172288,
            "title":"\"I think I'd rather eat him raw.\""
        },
        "14221":{
            "author_id":"rockethead",
            "author_name":"subboysworld",
            "content":"<div class=\"\"><div> <span>\"Yes, please!\" You are pleading to him. \"I worship you, I am your God. Please don't eat, overlord.\" Your training has told you how to refer to your master. \"Please let me be your slave and worship you forever.\"<br>\r\n<br>\r\nThe jock chuckled at your desperation and pleading. \"Yes, I am a God.\" You almost flattered him. \"These two,\" he held tighter onto the gift box, \"are destined to worship me forever as well, being regularly pinned under my athletic socks and licking my size 13.5, football-player feet clean, among other things.\"<br>\r\n<br>\r\nYou relished for a moment over the thought of your master removing his white Nike sneakers, and placing you under his white Nike ankle socks. Your training with the shopkeeper taught you to love being under a man's feet more than anything in the world. You imagined rubbing his toes, kissing them, showing true admiration for your master.<br>\r\n<br>\r\n\"But,\" the jock continued, \"You, are bound for the even sooner forever privilege of feeding me, becoming my food. There is no better way to sacrifice for your master than to have him eat you.\" He laughed at your imminent fate.<br>\r\n<br>\r\nHe held you by your legs into his lips, he sucked on your legs like a lolly pop. \"Mmmm, such good flavor.\" His tongue reached out and wrapped around your whole, his tongue had serpentine flexibility. The drool and sticky tongue cage around you dragged you into his mouth. He savored you. Opening his mouth occasionally, you saw him stroke his giant, jock cock, and you can feel the vibration from his moving hand from down below into his stomach and body. You kissed your masters tongue, accepting your fate.<br>\r\n<br>\r\n\"Good boy.\" You pleased your master. He turned you around with his tongue so that you were head first toward his tongue. His tongue pushed you a little outward, his mouth opened, you saw his risen teeth, and they then crashed together on your legs, slicing them off. You shrill in absolute horror and deathly pain. Your pain was short-lasting, as he swallowed you, gulping you down into his stomach acid where all your nerves melted away, allowing you a few moments of piece as you became food to your God.</span></div></div>",
            "created":1467090000,
            "id":2172299,
            "title":"Tell your predator that you worship him as your..."
        },
        "14222":{
            "author_id":"rockethead",
            "author_name":"subboysworld",
            "content":"<div class=\"\"><div> <span>\"Pathetic.\" Your crying just makes you look weak, reminding the jock of why you are in this position to begin with.<br>\r\n<br>\r\nHe holds his head back, bringing you above him as he opens his mouth, dropping you, and closing his mouth as you fall into his throat.</span></div></div>",
            "created":1467090000,
            "id":2172293,
            "title":"Start crying, unable to speak."
        }
    },
    "info":{
        "author_id":"noisrrah",
        "author_name":"noisrrah",
        "brief_description":"A Tiny's Story of Being a Boy's Slave",
        "created":1356166020,
        "description":"<td align=\"left\" class=\"norm\">You are Garrett, a 14 year old boy who has become prisoner of a store that sells tinies as slaves to boys for pleasure. You have been trained to worship and clean boy's feet and you have been shrunken down to an inch because that size is convenient for your giant masters. Some masters can be pretty rough, so you better be careful.</td>",
        "id":1909681,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1563955020,
        "modified":1563955020,
        "pretty_title":"Tiny Foot Slave Store"
    }
}