{
    "chapters":{
        "1":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "One of his Pokemon",
                "One of his companions",
                "A wild Pokemon",
                "Other (choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash is outside in a park, when he opens his Pokedex and he shrinks to one inch tall. Before he can contemplate anything, he is found by...</span></div></span></div>",
            "created":1242277200,
            "id":691293,
            "title":"Who finds him first?"
        },
        "11":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "pikachu",
                "turtwig",
                "starly",
                "chimchar",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1265000400,
            "id":828786,
            "title":"One of his Pokemon"
        },
        "111":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "It's ash (phew)",
                "It's food (uh oh)",
                "It's a doll (oh boy)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pikachu came looking for ash but found that he shrunk.Pikachu picks him up &amp; thinks that...........................</span></div></span></div>",
            "created":1265000400,
            "id":828789,
            "title":"pikachu"
        },
        "1111":{
            "choices":[
                "Brock",
                "Dawn",
                "Gary"
            ],
            "content":"<div class=\"\"><div> <span>Pichacu notices it is Ash. Pichacu then decides the only way to protect Ash is to put him into a pokeball. Pichacu throws the ball and catches Ash. As pichacu walks off ths pokeball containing Ash falls out. Pichacu doesnt notice it fall and keeps walking. The pokeball containing Ash is found by?</span></div></div>",
            "created":1269147600,
            "id":854417,
            "title":"It's ash (phew)"
        },
        "1112":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pikachu raises ash above his mouth and drops him in.<br>\r\n\"Pikachu\" ash yells.<br>\r\nDoes Pickahu hear him?</span></div></span></div>",
            "created":1399093200,
            "id":1790826,
            "title":"It's food (uh oh)"
        },
        "11121":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Wants to play",
                "Is tired"
            ],
            "content":"<div class=\"\"><div> <span>Pikachu suddendly stops; he is sure be heard the voice of his beloved trainer and friend, but it was just a bit mire of a squeak. Then it hits him. It was his trainer that he has just put in his mouth. He quickly spits him out. Ash is covered in saliva. Pikachu repeats his name twice in apology \"I forgive you Pickachu\" Ash says. Pikachu nuzzles his trainer happily when he looks down at him \"What is it Pikachu?\" Ash asks. Pikachu...</span></div></div>",
            "created":1458795600,
            "id":2122109,
            "title":"Yes"
        },
        "111212":{
            "author_id":"8ghtboy",
            "author_name":"Cartoon Link",
            "choices":[
                "Captured (Please don't let it be Team Rocket)",
                "Ash is still sleeping on Pikachu"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pikachu yawned and felt exhausted from all of this.  Ash notices this and decides to sleep too.  Pikachu picks up Ash and lays down and put Ash on his chest.  They sleep for awhile.  When Pikachu wakes up he see's....</span></div></span></div>",
            "created":1478840400,
            "id":2235651,
            "title":"Sleep"
        },
        "11122":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pickachu doesn't hear him so he closes his mouth. Pickachu then swallows and Ash is digested without Pickachu knowing.</span></div></span></div>",
            "created":1399093200,
            "id":1790828,
            "title":"No"
        },
        "1113":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Play dress up with Ash",
                "Play with Ash body",
                "Play with Ash for while until Pikachu got bored"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He was doll, as Ash said Pikachu it me, but Pikachu look at Ash with smirk as Pikachu start?</span></div></span></div>",
            "created":1436418000,
            "id":2005537,
            "title":"It's a doll (oh boy)"
        },
        "115":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Bayleef ",
                "Muk",
                "Snorlax"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash think it must be his? </span></div></span></div>",
            "created":1389762000,
            "id":1727955,
            "title":"more"
        },
        "1153":{
            "author_id":"timekeeper00",
            "author_name":"timekeeper",
            "choices":[
                "snorlax",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do you really want snorlax or do you want another one.</span></div></span></div>",
            "created":1457413200,
            "id":2114525,
            "title":"Snorlax"
        },
        "12":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "Misty",
                "May",
                "Dawn",
                "Brock",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who finds him?</span></div></span></div>",
            "created":1242277200,
            "id":691304,
            "title":"One of his companions"
        },
        "121":{
            "choices":[
                "He lands on her head.",
                "He jumps to early and falls down her shirt.",
                "He gets caught by a pokemon behind him."
            ],
            "content":"<div class=\"\"><div> <span>Ash, finding himself shunken on a jungle path,begins to panic. He knows the pokemon world is dangerous, especially when shrunk. When he calms down and remembers why he was on the path to begin with, he remembers him and Misty were supposed to catch pokemon together. Knowing she wouldn`t notice him on the ground, he begins to climb a tree. Though it was very difficult, he eventually climbed to a branch over the path. Seeing Misty about to walk under the branch, he prepares to jump, hoping to land on Misty's head and get her attention.</span></div></div>",
            "created":1266728400,
            "id":840599,
            "title":"Misty"
        },
        "1212":{
            "choices":[
                "Misty decides to eat Ash.",
                "Misty decides to help Ash.",
                "Misty shoves Ash back between her breasts."
            ],
            "content":"<div class=\"\"><div> <span>Ash took a breath and jumped off. As he fell toward Misty, he thought, \"This will work. I'm going to lend on her head and she will help me.\"<br>\r\nUnfortunately for Ash, he misjudged. He jumped just a bit to early, and he fell down her shirt! The momentum carried Ash into Misty's cleavage, and he stopped stuck inbetween her him from both sides by Misty's two enormous breasts kept Ash in his hot, fleshy, dark prison just on the other side Misty's blouse. Misty seemed not to notice, continuing to walk along the path. As she walked, her breasts swayed back and forth, making Ash's fleshy walls shift and move, causing Ash to be rolled and pressed on as Misty walked along. Ash knew he had to get Misty to notice him if was ever going to get out from between her boobs. He frantically started to to move and shake, and grabbed and pulled Misty's boobs. To Misty, this was just like an itch. She reached inbetween her breasts to scratch it and instead grabbed Ash and pulled him out.<br>\r\n\"Ash!\", she said, \"What are you doing inbetween my boobs. And why are you so small?\"<br>\r\n\"I don't know...\" Ash replied, \"I was hoping you could help me.\"<br>\r\nSuddenly, Misty got a strange look on her face.</span></div></div>",
            "created":1267938000,
            "id":847468,
            "title":"In a uncomfertable position..."
        },
        "12121":{
            "content":"<div class=\"\"><div> <span>Misty continued to look at Ash strangly, which made Ash very uncomfertable.<br>\r\n\"Why are you looking at me like that?\" Ash asked.<br>\r\nMisty replied, \"I don't know... I just...\" Then her voice trailed off.<br>\r\nAfter a few akward moments, Misty slowly lifted Ash above her head, and opened her mouth.<br>\r\nAsh shouted, \"HEY! No, wait... WHAT ARE YOU DOING?\"<br>\r\nBut, it was too late. Misty let Ash go and Ash fell down into her gaping mouth.<br>\r\nAsh fell on Misty's tounge with a PLOP. Inside Misty's mouth, it was moist and her tounge was wet with saliva. She wasted no time in rubbing and wrapping her tounge around Ash, soon covering him compleatly in her saliva. Once Ash was dripping the gooey saliva, Misty started sucking on Ash. Ash was so suprised and scared he didn't even say a word. Misty then started to rub her tongue all over Ash, and Misty let out a Mmmmmmm... of content. Finally, Misty used her tongue to force Ash into the back of her mouth and into the entrence of the throat. Her throat started pulling Ash down. Soon, Ash found himself pressed in from all sides by the throat, being slowly forced downward by the pulsing walls, still dripping wet from the saliva in Misty's mouth. Eventually, the throat forced Ash into Misty's stomic. Her stomic was a medium sized room. It was wet and hot inside it, and the walls were very slippery. Ash fell into the greenish-brown liquid at the bottom of her stomic. Once he touched it, his skin felt strange and his clothes started coming undone. <br>\r\n\"NOOOOOO!!!\" Ash screamed, as he realized Misty was digesting him. He tried to climb the walls of the stomic, but they were too slippery and he just fell back down. A few hours later, Ash was no more. Outside, Misty smiled and patted her stomic, content with her meal.</span></div></div>",
            "created":1268110800,
            "id":848629,
            "title":"Misty decides to eat Ash."
        },
        "12123":{
            "choices":[
                "go to my nipple",
                "do something else with it"
            ],
            "content":"<div class=\"\"><div> <span>She smiles and puts Ash back between her enormous breasts. <br>\r\n\"Hey Misty what are-!\" Ash was interrupted when her boob covered him.<br>\r\nMisty giggled. \"Sorry Ash but this is a once and a life time chance.\" She continued her walk, with her boobs continuing to squish Ash back and forth. Ash opened his mouth to protest but when he did, some of her soft breast entered his mouth. Ash, liking the taste, started to lick. This made Misty moan in pleasure. When the redhead got to her house, she went straight to her bedroom with Ash still licking and she still moaning.<br>\r\nOnce on her bed, she removed her shirt to look at Ash sucking her giant breasts. She smiles, \"Ash I want you to-\"<br>\r\n  </span></div></div>",
            "created":1276664400,
            "id":900869,
            "title":"Misty shoves Ash back between her breasts."
        },
        "121231":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "licking",
                "rubing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"no\" ash said \"too bad\" misty said. your my slave now, so get up there and start .......... it</span></div></span></div>",
            "created":1282885200,
            "id":945182,
            "title":"go to my nipple"
        },
        "121232":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "she is very nice",
                "she is mean"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ash looked up at misty and saw how beautiful she looked. her orange fiery hair made her look hot. and her breasts were huge<br>\r\n\"you know ash you do look cute like this\"misty said \"but it looks like im in charge now\"</span></div></span></div>",
            "created":1310446800,
            "id":1146307,
            "title":"do something else with it"
        },
        "1212321":{
            "author_id":"azure007",
            "author_name":"Azure striker",
            "choices":[
                "Make this like we are dating.",
                "A other idea?"
            ],
            "content":"<div class=\"\"><div> <span>\"WAIT you're not going to make do slavery are you?\" Ash asked her in fear of the beautiful giantees. \"No of course not! I mean you and have some time to gather. You just to get to know each other more and stuff.\" Misty answers him in a loving tone with a warm smile that makes him feel like melting on her D-cup boobs. \"S-So what d-do you h-have in m-mind?\" He asked the beautiful redhead he was setting on in between her boob's feeling hopeful of what the beautiful redheaded goddess has in mind? \"Hmm? Let's try...\"<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1570165200,
            "id":2727907,
            "title":"she is very nice"
        },
        "1213":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Rattata",
                "Skwovet",
                "Riolu"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash jumped, but he was caught. looking back he saw it was a...</span></div></span></div>",
            "created":1585069080,
            "id":2806373,
            "title":"He gets caught by a pokemon behind him."
        },
        "12133":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "lets Ash go",
                "decides to keep him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash found himself in the blue paw of a female Riolu. She cocked her head and sniffed the small human in her grasp. She rubbed her chin. She could let him go, but the world was dangerous for a tiny being. What to do?</span></div></span></div>",
            "created":1585079640,
            "id":2806500,
            "title":"Riolu"
        },
        "122":{
            "choices":[
                "Eats him",
                "Crush him",
                "Take out munchlax"
            ],
            "content":"<div class=\"\"><div> <span>Ash sees may coming down the path as she steps on him.<br>\r\n\"Oh my\" she says ash she sees Ash and picks him up.<br>\r\n\"I'm sorry, I didn't see you\"<br>\r\n\"Can you help me?\" he says, just then, her stomach rumbles.<br>\r\nShe </span></div></div>",
            "created":1399784400,
            "id":1794910,
            "title":"May"
        },
        "1221":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Sorry ash, but I'm just too hungry\"<br>\r\nShe then throws him in the air and swallows him.<br>\r\n\"Hey Ash, i guess we will always be together\"<br>\r\n</span></div></span></div>",
            "created":1399784400,
            "id":1794912,
            "title":"Ash the ultimate Pokemon trainer food"
        },
        "1222":{
            "choices":[
                "She slams get foot down",
                "She stops and spares him",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>May's grip started to tighten. Ash struggled futiley as she smirked. \"I think that sounds like way too much of a hassle.\" She carelessly dropped him onto the grass and raised her foot. <br>\r\nIn desperation, he started to beg. \"Wait! No! I'll do whatever you want, just stop!</span></div></div>",
            "created":1471237200,
            "id":2196132,
            "title":"Crush him"
        },
        "12222":{
            "author_id":"blade007",
            "author_name":"Azure007",
            "choices":[
                "She has him for a Slava for the rest of the day!",
                "Try to hypnosis him to make Ash fall in love with may?"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait! I'll do anything you want just don't squash me!\" Ash scream at May then stops her foot  \"Anything I want?\" May asking \"YES! Anything you want just say it and I'll do it.\" Ash answers \"Hmm yeah you got a deal but if it's not worth it say hello to my tummy for me OK!\" May said then move her giant foot and pick him up \"List see what I'll have you do for me first hmm?\" May questions herself.<br>\r\nThen she has tow ideas......?</span></div></div>",
            "created":1558933200,
            "id":2664912,
            "title":"She stops and spares him"
        },
        "122221":{
            "author_id":"blade007",
            "author_name":"Azure007",
            "choices":[
                "May has a bad ich on her body can't get it in public but Ash and not be seen.",
                "May has sore feet all day but Ash can rub the Sorensen away."
            ],
            "content":"<div class=\"\"><div> <span>\"OK I want you to be my slave for the rest of the day.\" May response \"But May I'm shrunk! How will I be a slave if I'm tiny?\" Ash asked \"Do as I say or it's (look out tummy here he comes) what do you think?\" May threats him \"Fine you win so we're do I start?\" Ash asked  in defeat \"Let see hmm? OH I know you can start by......?</span></div></div>",
            "created":1559192400,
            "id":2666770,
            "title":"She has him for a Slava for the rest of the day!"
        },
        "122222":{
            "author_id":"azure007",
            "author_name":"Azure striker",
            "choices":[
                "Love her like a goddess and her angel servant lovers.",
                "Maybe a other idea?"
            ],
            "content":"<div class=\"\"><div> <span>May was thinking of what to do with a tiny Ash Ketchum? That's when she got in idea to hypnotize Ash in to loving her forever and then she was smiling like a evil person. \"May? Your keeping me out with that smile. WHAT ARE YOU DOING MAY!?\" HE asked in shock of May unzipping her shirt to reveling her giant E-cup's breasts and polls something out in-between them to reveled a Hypnos's pendant. \"Oh Don't worry Ash. My boob's are not the only thing that you should be starring at. Because you're going to be my boyfriend for life! HAHAHA!\" She answers and shoves the pendant in front of him and he is starting too feel lost in thought with a glazed look in his eyes. \"YEY! It's working now and now for the last touch.\" May said now thinking of how he should love her?<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1570251600,
            "id":2728319,
            "title":"Try to hypnosis him to make Ash fall in love wi..."
        },
        "12223":{
            "author_id":"azure007",
            "author_name":"Azure striker",
            "choices":[
                "sad about what she did and apologize to him. Maybe can be friends again + more. ",
                "Angry at his word's she yelled at and lives him! Hurt by a boy you have a crush."
            ],
            "content":"<div class=\"\"><div> <span>As Ash was whetting for his end to come. He could've heard a chalking coming from May and open his eyes to see her giant foot over him but stomping? plus she looks like she about to laugh at any moment. Then she explodes out laughing so hard May falls on her back crying at him. \"Hahaha y-you actually believe me? Hahaha you actually believe I was going to kill? NOT IN THIS LIFE TIME! HAHAHA!\" May said through her laughter to put Ash's fears To reset. But his fears turn to anger as he was going to tell May how he feels now. \"Do you know how scary that was? I actually thought I was going to die and then you just laugh about it. I thought we were friends!\" Then she stops laughing just to hear what Ash was saying. \"And to think I've had a crush on you for so long that maybe even I would love you as girlfriend! But then you just put me that through just you can laugh at me some friend.\" Ash side in frustration that he turns from looking at May to siting on a pebble for chair. <br>\r\nBut what does May do?</span></div></div>",
            "created":1585077420,
            "id":2806465,
            "title":"Just kidding hahaha!"
        },
        "1223":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>May takes out munchlax.<br>\r\n\"munchlax, I have food for you\"<br>\r\n\"What!\" Ash yells ash he tossed to Munchlax.<br>\r\nMunchlax grabs him and swallows him.</span></div></span></div>",
            "created":1399784400,
            "id":1794914,
            "title":"Munchlax's dinner"
        },
        "123":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "in her mouth",
                "in her panties",
                "in her nose"
            ],
            "content":"<div class=\"\"><div> <span>Ash turns around &amp; sees a hand reaching after him it was Dawn.She picks him up,looks at him &amp; says\"OMG ASH IS THAT YOU?!?\".He says\"yes Dawn please help get back to normal\".she wanted ash to get back to normal,although she wonders how much fun she could have with ash this small.She smiles at him &amp; says\"awww but your so cute at this size ash,sorry but I want to have fun with you first *giggles*.Then she puts him..................................................</span></div></div>",
            "created":1261285200,
            "id":808591,
            "title":"Dawn"
        },
        "1231":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "\"you become my boyfriend\"",
                "\"you eat my boogers\"",
                "\"you let me suck on your dick\""
            ],
            "content":"<div class=\"\"><div> <span>Dawn drops ash on her tounge &amp; closes her mouth.she begins sucking all over his tiny body,ash could hear her say\"mmmmmmmmmmmmmmmm yummy.\"she takes him out &amp; says\"wow ash you taste super yummy,tell you what I won't eat you if..............................................................</span></div></div>",
            "created":1261371600,
            "id":809082,
            "title":"in her mouth"
        },
        "12311":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "\"to be your  boyfriend\"",
                "\"to be swallowed\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash looks at her says\"but misty is my girlfriend.\"Dawn gives him that look &amp; says\"well either you become MY boyfriend or you go in my belly &amp; get digested by my stomach acids.\"Ash then says\"I choose............................</span></div></span></div>",
            "created":1261544400,
            "id":809968,
            "title":"2 choices, one fate"
        },
        "123112":{
            "choices":[
                "Misty stops her",
                "Dawn swallows him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I might as well get swallowed then\" Ash said.<br>\r\n\"Alright\" Dawn then lifts Ash over her mouth and drops him in.</span></div></span></div>",
            "created":1399266000,
            "id":1792092,
            "title":"\"to be swallowed\""
        },
        "1231121":{
            "choices":[
                "Let them bring him to Iris, how bad can she be",
                "Agree with Misty"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait!\" Misty runs to Dawn and takes Ash out. \"Remember, we were supposed to bring him to her\"<br>\r\n\"Oh yeah\" Dawn giggles. \"I forgot.\" Ash is placed in Misty's pocket when it starts to go dark and they decide to go to sleep tonight. During the night, Misty wakes Ash up.<br>\r\n\"I can save you, but you must become my slave, if you don't, Iris will own you and she will not be as nice.\"<br>\r\nAsh thinks for a minute,</span></div></div>",
            "created":1462251600,
            "id":2142880,
            "title":"Misty stops her"
        },
        "1231122":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Digested",
                "Immune and now lives inside Dawn unable to escape (story continues)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is he digested, or immune to the stomach acids and now lives in Dawn unable to escape?</span></div></span></div>",
            "created":1462510800,
            "id":2143974,
            "title":"Dawn swallows him"
        },
        "12311222":{
            "author_id":"blade007",
            "author_name":"Azure007",
            "choices":[
                "She bubt in to someone?",
                "She got home safely."
            ],
            "content":"<div class=\"\"><div> <span>Dawn then swallowed ash hole. Ash was kicking and screaming for help but no one can hear him. A blogging shaped like Ash was sliding down dawn's throat to her c-cups then disappear in her body. Dawn was in heaven as she was shivering because her belly was swelling fitting ash's new home inside her. \"(HICCUP!?)ah he really hit the spot.\" Dawn said as she was rubbing her new potbelly in joy that no one will take Ash away for her anymore.<br>\r\n\"Dawn please let me out! I don't. What to be disgusted!\" Ash screaming \"oh well you relax I can't digest live food silly.\" Dawn said will patting her belly happily \"Then can you let me out please?\" Ash asked his new home \"hmm let me think about it.....NO!\" Dawn answered her new belly pet \"but Dawn I thought  we we're friends?\" Ash asked \"we are friends. I just wanted to be more then friends that all so get comfy in there my sweetheart.\" Dawn was about to leave till she feels gas coming up her throat till \"BBUURRPP!? Excuses me.\" Dawn see said.<br>\r\nthen she was hiding home wail rubbing her belly till....?</span></div></div>",
            "created":1558933200,
            "id":2664657,
            "title":"Immune and now lives inside Dawn unable to esca..."
        },
        "123112221":{
            "author_id":"blade007",
            "author_name":"Azure007",
            "choices":[
                "May? How understand  Dawn and try to help her out?",
                "Misty! If she finds out that Ash is in her belly she'll get really mad!"
            ],
            "content":"<div class=\"\"><div> <span>\"BBUURRPP!? Excuse me.\" Dawn said will giggling to herself \"come on Dawn let me out of here!\" Ash yelled at her will squirming in his belly home named Dawn \"Nope you are staying in me till you change your mind and that's final!\" Dawn ordered him will waking home \"But keep moving around my tummy it feels so good.\" She said will robbing her belly in pleasure \"then I'll stop moving if you like it so much till you get me out haha.\" Ash tented her \"why you little-oomph!?\" Dawn was interrupt by bumping in to someone \"aww that hurt awe.\" Dawn and Ash said complaining wile she rubbing her belly pain away \"oh I'm so sorry I wasn't looking were I was going!\" A girl voice said \"it's OK just be careful next time All right?\" Dawn said  not looking up to the girl \"no need to worry Dawn\" the girl said in a voice she remembers (that voice it can't be her can it?) Dawn through then looked up to see how the girl was?<br>\r\n<br>\r\nHow is the girl Dawn was talking to?</span></div></div>",
            "created":1559019600,
            "id":2665508,
            "title":"She bubt in to someone?"
        },
        "1231122211":{
            "author_id":"blade007",
            "author_name":"Azure007",
            "choices":[
                "May has a plan to hypnotize Ash to loveing Dawn like a girlfriend.",
                "Other choice. It's up to you."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh May!? Hi how are you doing today? But it looks like it's going to rain so I'll just be getting home quickly so goodbye!\" Dawn said really nervous but May was blocking the way and sees Dawn's squirmy potbelly then she knew what she wanted. \"So let me guess what you're doing with a blotted tummy? You had meats with tan skin, black hair, chocolate brawn eyes and zigzag birth makes right?\" May question Dawn how is sweating really badly now. \"I have no idea what you're trying to say?\" Dawn said in fear that May will find out what she did! \"(Help me get out of here May!? Dawn ate me and I can't get out!)\" Ash shout out to May for help! \"I can explain this-OH yeah that feels good.\" Dawn beginning explain but erupts her as she was rubbing Dawn's belly like she's pregnant and smiling at her? \"If you need help caching Ash you could have asked.\" May question Dawn then she snaps out of her transition. \"You're going to help me win Ash heart but way!?\" Dawn asked. \"Because you're my friend that's way!\" May said...?</span></div></div>",
            "created":1560661200,
            "id":2674265,
            "title":"May? How understand  Dawn and try to help her out?"
        },
        "1231122212":{
            "author_id":"blade007",
            "author_name":"Azure007",
            "choices":[
                "Dawn says she's pregnant and Misty believes her.(and Ash wasn't load enough.)",
                "Dawn says she's pregnant but Ash yelled load enough for Misty to heir him Ohno!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Dawn have a good I'm hoping?\" Misty asked in a cherry mood \"ahh JUST FINE! HICCUP!?\" Dawn said really quickly \"Dawn are you feeling OK?\"  Misty asked in worried voice \"your acting little strange are you having trouble with Kenny again?\" Misty said in concerned as Dawn as starting to sweat \"Ahh yeah that dude didn't don't show up for are data and I ate a lot of food will waiting hehe.\" Dawn answered nervous that Misty will find out \"well that explains the gut you look three months pregnant girl. Why wear you waiting for him\" misty asked seriously as Dawn was sweating bullets that she was curious and was thinking of a plane (what do I do now? Wait she said I look pregnant maybe i can pretend to pregnant for real!)<br>\r\n<br>\r\nDoes it work or will something happen that Misty will find out that her boyfriend is inside of Dawn's potbelly?</span></div></div>",
            "created":1559192400,
            "id":2666813,
            "title":"Misty! If she finds out that Ash is in her bell..."
        },
        "1232":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "front",
                "back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Front or back?</span></div></span></div>",
            "created":1261803600,
            "id":811102,
            "title":"in her panties"
        },
        "12321":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "ash fall in dawn pussy",
                "he chimb fast"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>dawn drop ash in front pantie and she leave ash inside her pantie.ash now in front a dawn pussy he try chimb you but dawn see ash try to get out she hit her pantie.did ash</span></div></span></div>",
            "created":1379566800,
            "id":1665414,
            "title":"front"
        },
        "123211":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "dawn push ash deeper ",
                "dawn stop and rexlax"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ash on her pussy he try get out.dawn feeling ash on her pussy and say oh ash i not know you love my pussy so much i give you what you want dawn start use her hand to push ash deep in her pussy she love ash move around in her pussy dawn decide to</span></div></span></div>",
            "created":1379566800,
            "id":1665421,
            "title":"ash fall in dawn pussy"
        },
        "12322":{
            "choices":[
                "butt crush him",
                "shove him up her ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dawn lifts the back of her skirt, opens up the back of her panties, and drops ash in. closing her panties, she smooths him onto her butt cheek with one hand. getting a satisfying feel, Dawn decides to...</span></div></span></div>",
            "created":1338786000,
            "id":1352657,
            "title":"Dawn's ass"
        },
        "125":{
            "choices":[
                "Max",
                "Richie",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of these?</span></div></span></div>",
            "created":1283230800,
            "id":947723,
            "title":"More companions"
        },
        "1253":{
            "author_id":"ajbomb333",
            "author_name":"AJBOMB",
            "choices":[
                "sure",
                "next  1",
                "next 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>why not iris?</span></div></span></div>",
            "created":1412398800,
            "id":1866641,
            "title":"Other"
        },
        "12531":{
            "choices":[
                "Up a tree for privacy",
                "To her house"
            ],
            "content":"<div class=\"\"><div> <span>\"What a kid\" Ash turns around and sees Iris looking at him.<br>\r\n\"Can you help me\" Ash asked.<br>\r\n\"Like I said, a kid\" Iris says smiling. \"You get shrunk down in front of a beautiful girl and the only thing you think is getting to normal\"<br>\r\n\"Well\" Ash doesn't know how to respond.<br>\r\nIris grabs him \"Sorry but your mine now, right Axew?\"<br>\r\n\"Axew\" Axew responds happily. She takes him . . .</span></div></div>",
            "created":1461128400,
            "id":2136593,
            "title":"sure"
        },
        "12532":{
            "author_id":"azure007",
            "author_name":"Azure striker",
            "choices":[
                "Serena finds Ash first and is going to make him love her hopefully. Maybe?",
                "Bonnie finds Ash first and what's to play with him?! Oh no!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Serena or Bonnie? But witch one of them finds Ash first and what will they do to him?</span></div></span></div>",
            "created":1573482840,
            "id":2745248,
            "title":"Maybe Serena or Bonnie?"
        },
        "12533":{
            "author_id":"azure007",
            "author_name":"Azure striker",
            "choices":[
                "The Aloha girls oh yeah. It's beach time!",
                "Maybe someone else please?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Lilley, Lana and Mallow is my next guess<br>\r\nBut if you have a other choice. <br>\r\nGo on and try you're because I'm running out of ideas </span></div></span></div>",
            "created":1585072200,
            "id":2806392,
            "title":"next 2"
        },
        "13":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "Pichu",
                "Buizel",
                "Charmander",
                "Lickitung",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's that wild Pokemon?</span></div></span></div>",
            "created":1242277200,
            "id":691297,
            "title":"A wild Pokemon"
        },
        "131":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "It drops him in altogether",
                "It gives him some good licks",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A pichu comes from behind Ash and picks him up, sniffing his body. Ash can't believe his own eyes as he looks at the huge face. It then licks its lips and holds him up over its wide open maw, the soft pink tongue laying there.</span></div></span></div>",
            "created":1242277200,
            "id":691302,
            "title":"Pichu"
        },
        "1311":{
            "author_id":"mythicalmayhem",
            "author_name":"Mythical",
            "choices":[
                "Ash gets through to Pichu and it releases him and wanders off",
                "Pichu decided to keep Ash as a playmate",
                "Pichu swallows Ash "
            ],
            "content":"<div class=\"\"><div> <span>As Ash begged Pichu to let him go, Pichu decided to do so, yet, due to the fact it was a baby, it didn't know that Ash meant on the ground instead of over it's mouth. Thinking it complied with the trainer's wishes, Pichu dropped Ash while it was above it's mouth </span></div></div>",
            "created":1497416400,
            "id":2335645,
            "title":"It drops him in altogether"
        },
        "13113":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pichu hummed at Ash's taste and tossed him about, taking in his taste. Then, Tilting her head back, she swallowed Ash, sending him to her belly to gurgle.</span></div></span></div>",
            "created":1585325460,
            "id":2808330,
            "title":"Pichu swallows Ash "
        },
        "1312":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "It slurps him up",
                "It makes him slide inside",
                "It carries him to another pichu"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait! What are you doing?!\" Ash is met by the pichu's tongue lapping at his now naked body, tasting every part. He screams at most of the licking, then gets scared stiff at being covered in saliva. It has extreme pleasure in tasting his feet over and over, making him laugh uncontrollably. In all of this, the pichu makes its decision.</span></div></div>",
            "created":1243918800,
            "id":701815,
            "title":"Tasting"
        },
        "13122":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "He stays there alive",
                "He is digested"
            ],
            "content":"<div class=\"\"><div> <span>In Ash's confusion, the pichu gives him one last lick while letting him go inside its mouth. He slides down its slippery tongue, getting himself together. He then screamed as he entered its slimy throat, sliding down the entire way down before plopping into the soft stomach. He tries to crawl back up, but the walls are too slippery and the whole organ jiggles a bit as the pichu makes a little burp.</span></div></div>",
            "created":1243918800,
            "id":701819,
            "title":"It makes him slide inside"
        },
        "131222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "A few minutes later"
            ],
            "content":"<div class=\"\"><div> <span>Ash plops into the pichu's stomach. How had his life come to this? Shrunken so small that pokemon could eat him!  He went over to the stomach walls and started to bang. <br>\r\n<br>\r\nA low rumbling is heard. Unfortunately, your banging just provided the \"key\" to unlocking his acids. A \"faucet\" in the upper right corner of the stomach started spewing acid into the chamber. <br>\r\n<br>\r\nAsh climbed up on some food, which was slowly melting. He bought himself a few minutes at most.</span></div></div>",
            "created":1374037200,
            "id":1629763,
            "title":"He is digested"
        },
        "134":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "It eats him",
                "It tastes him",
                "It leaves"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He tries to open his Pokedex when he grows to only one foot tall. At that moment, a lickitung came and gave his back a good lick, paralyzing him.</span></div></span></div>",
            "created":1243918800,
            "id":701273,
            "title":"Lickitung"
        },
        "1341":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "It digests him",
                "He makes himself at home",
                "It is caught by someone"
            ],
            "content":"<div class=\"\"><div> <span>The lickitung then uses its long, wet, slippery tongue as a third arm, wrapping around his still body, dropping him into its maw, and giving a wet slap of his tasty feet before sending him down in a single gulp. Once the paralysis wears off, he tries to punch his way out, but only makes happier and make a loud burp.</span></div></div>",
            "created":1243918800,
            "id":701283,
            "title":"A simple snack"
        },
        "13413":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "She gets hungry",
                "She calls for help"
            ],
            "content":"<div class=\"\"><div> <span>Then, the lickitung is caught by a mysterious pokeball. A trainer steps out, May, and picks it up, releasing it. She notices a bulge in its belly and pokes it. Then, the pokemon makes an even bigger burp, sending Ash flying out and landing in May's palm. \"Ash? Is that you?\"<br>\r\nAsh replied, \"Yes! It's me! I've had the worst day ever! I've--\" Then, what does she do next?</span></div></div>",
            "created":1244005200,
            "id":701811,
            "title":"May"
        },
        "134131":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "let him go",
                "eat him anyways"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly May's stomach begins to rumble.She then looks at Ash &amp; licks her lips.Ash began to shake as he said\"May why are you looking at me like that?\"She smiles at him &amp; says\"well Ash I was thinking about eating you.\"She dangles ash over her mouth &amp; sticks out her tounge going \"ahhhhhhhhhhhhhhhhhh\".Ash begs\"please don't eat me May we're friends.\"after ash said that May decides to.................................</span></div></div>",
            "created":1261285200,
            "id":808558,
            "title":"She gets hungry"
        },
        "1341312":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>May shrugged &amp; dropped Ash on her tounge,then reels it back into her mouth.She tastes all over his body &amp; lets out an \"MMMMMMMMMMMMMMMMMMMMM\".She tilts her head up &amp; *GULP* down he goes into her stomach.ash can't believe he was eaten by his own May his own friend.</span></div></div>",
            "created":1261285200,
            "id":808577,
            "title":"eat him anyways"
        },
        "1342":{
            "choices":[
                "The lickitung takes Ash to a female lickitung.",
                "A tiny Misty runs in front of the lickitung."
            ],
            "content":"<div class=\"\"><div> <span>Ash, paralyzed with fear and the tounge attack, finds himself unable to do anything as lickitung moves slowly toward him. It then sticks it's tongue out and wraps Ash up. With a quick flick, it put it's tongue back in it's mouth along with Ash. It then rubs it's tongue all over Ash's body. Ash is horrified as the wet but strong tongue pushes him around the moist mouth. As the lickitung sucks on Ash, he finds himself drenched with saliva. All around him he can hear a faint sound that sounds like water shloshing around. The lickitung starts rubbing Ash along the sides of its mouth. Ash spots the hole in the back with pulsing walls, and thinks it's all over for him. Suddenly, he feels the air on his face and hears birds chirpping, a sound he would not be able to hear muffled inside the mouth. He looks around and sees the pokemon is holding him in its hands now. The lickitung looks content, Ash realizes he must be a very tasty meal. Wondering why he wasn`t eaten by the lickitung, he feels a bouncing as the lickitung carries him into the forest. Ash was thinking how this could have happened when...</span></div></div>",
            "created":1266814800,
            "id":841031,
            "title":"It tastes him"
        },
        "13422":{
            "choices":[
                "I was hoping you would know\"",
                "Everybody was shrunk\""
            ],
            "content":"<div class=\"\"><div> <span>\"Stop!\" Misty yelled.<br>\r\nThe lickitung stopped, confused.<br>\r\n\"Drop him and leave\" the lickitung obeyed.\"I can't believe that worked.\" She said.<br>\r\n\"How did you get small\" Ash asked.<br>\r\n\"Well . . .</span></div></div>",
            "created":1447304400,
            "id":2060506,
            "title":"Misty saves Ash from the lickitung"
        },
        "134221":{
            "choices":[
                "Try to get the cage door open",
                "Just wait it out and see what happens"
            ],
            "content":"<div class=\"\"><div> <span>\"I woke up like 10 minutes ago, trying to figure out what happened. That's when I found you\"<br>\r\n\"Well let's first find some help\" Just then the ground started shaking and someone grabbed them. Ash looked up. \"Mom?\"<br>\r\nDelia looked at both of them and smiled. \"Can you help us Mrs. Ketchum\" Misty asked.<br>\r\n\"No, I don't want to.\"<br>\r\n\"What why?!?\" Ash asked a little panicked.<br>\r\n\"The reason is Ash, you always leave me home alone. You go on your adventures and worry me, well now I think I'll teach you a lesson mister.\"<br>\r\n\"Why me though?\" Misty questioned.<br>\r\n\"You're the first girl who went with him, who knows what kinds of things you two did alone.\"<br>\r\n\"Actually Brock and our Pokemon were with us through a lot of our adventures\" Ash replied.<br>\r\n\"Don't be a smart mouth young man\" Delia said a little angrier. She took both of them back home and into her bedroom. \" I'll get dinner started, and for dessert, a tasty little girl.\" She put both of them in a cage and went to go make dinner.<br>\r\n\"What are we going to do Ash? I don't want to end up in her stomach.\" Ash thought for a second and decided . . .</span></div></div>",
            "created":1460091600,
            "id":2129804,
            "title":"The real villain"
        },
        "1342211":{
            "choices":[
                "Ash decided to wait for a while",
                "Ash decided to have a peek"
            ],
            "content":"<div class=\"\"><div> <span>Misty lifted up Ash and tried to open the lock. They tried for about 5 minutes until they got it.<br>\r\n\"Come on\" said Ash. They dropped to the ground and ran to the door. They saw Delia cooking a pizza. She was watching TV from across the room. Ash and Misty sneaked up under the table. Delia's bare feet smelled pretty badly. They tried to sneak behind her, however Misty tripped. Delia looked behind her feet.<br>\r\n\"Trying to escape huh\" Delia said smiling. She reached down and grabbed Misty. Ash ran and hid under the couch. Delia bent down and saw Ash. Then got up and walked away.</span></div></div>",
            "created":1461042000,
            "id":2136045,
            "title":"Misty gets caught"
        },
        "13422112":{
            "choices":[
                "Started eating the pizza without either of them",
                "Put misty on her piece"
            ],
            "content":"<div class=\"\"><div> <span>Ash peeked his head out and saw his mother laying down. She was wearing yellow bikini now. Delia also had Misty over her mouth and was toying with her. Ash knew he had to think of something, otherwise Misty would end up as food. Ash ran and hid behind a table. His mom was a lot closer now.<br>\r\n\"I wonder what you'll taste like.\" Delia said, licking Misty. Ash thought for a minute about his plan. Just then, a large hand grabbed him. \"I knew you would try and save her.\" Suddenly, they heard a sound from the kitchen. \"It looks like my pizza is done. Delia went and got the pizza out. She cut herself a piece and . . .</span></div></div>",
            "created":1466830800,
            "id":2170799,
            "title":"Pizza is ready"
        },
        "134221122":{
            "choices":[
                "Misty re-spawned on the table",
                "Delia put Ash on a dessert"
            ],
            "content":"<div class=\"\"><div> <span>Delia then put Ash in a bottle in front of her.<br>\r\n\"Hope you have a good view of your little friend and me.\" She said. Misty struggled as Delia brought the piece up to her face. She licked her lips.<br>\r\n\"Please, don't do this.\" Misty said.<br>\r\n\"In you go, my sweet treat.\" Delia takes the first bite. Then another. Misty is inches away from her mouth. Delia sticks the pizza in her mouth and bites it, making Misty trapped in her mouth. She chews it up and swallows. \"You're next.\" She said, looking at Ash. Then . . .</span></div></div>",
            "created":1468472400,
            "id":2179972,
            "title":"Delia's misty pizza"
        },
        "1342211222":{
            "author_id":"mythicalmayhem",
            "author_name":"Mythical",
            "choices":[
                "Wait",
                "Try to escape"
            ],
            "content":"<div class=\"\"><div> <span>Delia then gives Ash  a stare which meant \"your next\". Trapping Ash on her hand, she pepper sprays Ash to blind him and then ties Tim up with thin but strong dental floss. Of course, Ash couldn't do anything as Delia then dropped him in some wine while untying Ash from the dental floss. Ash then regains his sight and begs his mom to let him go. Delia complies and Ash is relieved, when all of a sudden, Delia puts Ash in a cup of water! \"MOM! please Let Me Out\" whimpers Ash. \"Well Ashy, since today marks the end of your journey, I'll keep you on display until I die!\" explained Delia, much to Ash's horror. Delia then put some foil on top of Ash to prevent his escape, and put him in the freezer.</span></div></div>",
            "created":1497416400,
            "id":2335639,
            "title":"Delia put Ash on a dessert"
        },
        "1342212":{
            "content":"<div class=\"\"><div> <span>They both sat in the cage, holding each other close. Misty kisses Ash on the cheek. He turns towards her and kisses her back. They lay down next to each other waiting for Delia to get back.<br>\r\n\"I wonder how she will eat us.\" Misty said. Ash nodded and put his arms around her.<br>\r\n\"At least we will be together.\" He said. After about ten minutes, Delia finally came back and grabbed both of them. She took them to the kitchen. They saw a bowl of macaroni and cheese. Ash was dropped into it, while Misty was placed in a cage that had an excellent view of Delia eating Ash.<br>\r\n\"YUM YUM, HERE I COME COME\" Delia said loudly. Ash fled as Delia teased him. She almost kept getting him on her fork. She just giggled. Finally, Delia put her fork down and licked her lips.<br>\r\n<i>What's she doing now?</i>Misty wondered. Delia tipped her head and grabbed Ash with her mouth, pulling him up so Misty could see. Delia swallowed and licked her lips. \"Now, my dessert.\" Delia said looking at Misty. She grabbed her and went into the living room. On a table, there was a chocolate sundae.<br>\r\n\"No! Please!\" Misty yelled, as she was lowered in the sundae.<br>\r\n\"Quit complaining, you shall be with your lover, and I shall have my dessert, so we both win.\" Delia dropped Misty in. She then used a straw to drink it. Misty was almost sucked up in the straw. When it was almost gone, Delia threw away her straw. \"Almost done, and then you can be with Ash, if he's still alive.\" Delia raised the Sundae up to her lips and drank the rest, along with Misty. She was tossed around her mouth and traveled to her stomach. Ash was there, almost unconscious.<br>\r\n\"Oh Ash.\" Misty said, and hugged him. Delia rubbed her belly.<br>\r\n\"So tasty.\"</span></div></div>",
            "created":1476853200,
            "id":2225812,
            "title":"Ash and cheese + Misty sundae"
        },
        "134222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "figuratively",
                "litterally"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>define everybody</span></div></span></div>",
            "created":1537765200,
            "id":2552602,
            "title":"Everybody was shrunk\""
        },
        "1342221":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "more",
                "less"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>all companions</span></div></span></div>",
            "created":1538197200,
            "id":2556781,
            "title":"figuratively"
        },
        "135":{
            "author_id":"dan101",
            "author_name":"harek",
            "choices":[
                "Lugia",
                "Lucario",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More list here</span></div></span></div>",
            "created":1242277200,
            "id":691306,
            "title":"More"
        },
        "1352":{
            "choices":[
                "Eats him",
                "Licks him",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash sees a giant lucario in front of him. The lucario looks down and picks him up and looks at him. What does the lucario do?</span></div></span></div>",
            "created":1265259600,
            "id":830551,
            "title":"Lucario"
        },
        "13521":{
            "choices":[
                "He stays alive.",
                "He gets digested."
            ],
            "content":"<div class=\"\"><div> <span>As the lucario is staring at Ash, it makes its decision. The lucario lifts Ash up and drops him into its mouth. Ash falls into darkness and lands on lucario's soft, slimy tongue. The lucario tilts its head back and swallows. Ash passes down its sticky esophagus and lands in the stomach. The lucario lets out a burp and continues on. The stomach is hot and wet inside and there is sticky saliva on the walls. Ash soon passes out from the lack of oxygen that lucario burped out. What happens to Ash?</span></div></div>",
            "created":1265432400,
            "id":831595,
            "title":"Swallowed"
        },
        "135212":{
            "author_id":"mythicalmayhem",
            "author_name":"Mythical",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When Ash next wakes up, he sees that Lucario's acids have slowly been filling it's stomach. Ash tries pounding his captors stomach, yet to no avail. As he sits down, he slowly resigns himself to his fate</span></div></span></div>",
            "created":1497416400,
            "id":2335632,
            "title":"He gets digested."
        },
        "13523":{
            "author_id":"8ghtboy",
            "author_name":"Cartoon Link",
            "choices":[
                "He'll take care of him",
                "Takes him to mew"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yeah I would agree with you reader, I wod choose this option instead of he first choices Errrr.  </span></div></span></div>",
            "created":1478840400,
            "id":2235656,
            "title":"Second "
        },
        "1353":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "a kangskong",
                "a piplup",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about?</span></div></span></div>",
            "created":1261890000,
            "id":811260,
            "title":"More"
        },
        "13533":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "It wild kadabra",
                "It wild swellow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then which wild pokemon found ash? </span></div></span></div>",
            "created":1389762000,
            "id":1727948,
            "title":"other"
        },
        "135331":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Kadabra",
                "Other pokemon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure it's a Kadabra?</span></div></span></div>",
            "created":1483419600,
            "id":2258505,
            "title":"It wild kadabra"
        },
        "1353312":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Legendary choices",
                "Normal pokemon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe legendaries that Ash met before?</span></div></span></div>",
            "created":1483419600,
            "id":2258507,
            "title":"Other pokemon"
        },
        "13533121":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Mew",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which legendary does he re-encounter?</span></div></span></div>",
            "created":1483419600,
            "id":2258508,
            "title":"Legendary choices"
        },
        "135331212":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Celebi",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Celebi?</span></div></span></div>",
            "created":1483419600,
            "id":2258509,
            "title":"Other"
        },
        "1353312122":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Latias",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps Latias?</span></div></span></div>",
            "created":1483419600,
            "id":2258510,
            "title":"Other"
        },
        "13533121222":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Meloetta",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Meloetta?</span></div></span></div>",
            "created":1483419600,
            "id":2258512,
            "title":"Other"
        },
        "135331212221":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "She will help, and brings Ash to his friends.",
                "She won't, and keeps the tiny trainer for herself."
            ],
            "content":"<div class=\"\"><div> <span>While wondering how did he got in such predicament, Ash suddenly hears a sound. A sweet sound. It almost seems like... a song.<br>\r\n'Wait, where did I hear this song before?' the small trainer asks to himself, listening to the very familiar sound. It doesn't take long for him to remember.<br>\r\n'Wait a minute! I know this song! She must be around here!' Ash thinks, before starting following the sound, searching for its source.<br>\r\n<br>\r\nIt takes a while (mostly because of his reduced size), but eventually Ash makes it to a bush, where the sound is at its loudest.<br>\r\n<br>\r\nPeeking in between the leaves of the bush, Ash... Nothing. Even though the sound is obviously coming from here, this bush is empty apart from the one inch tall trainer.<br>\r\n<br>\r\nBut then, the song suddenly stops. A figure appears out of nowhere. It has long, green hair, a blue gem on its face, bright blue eyes. A black 'dress' covers its body, leaving out two white, slim legs. Ash smiles. As he guessed, it was Meloetta the cause of the sound.<br>\r\n<br>\r\nApparently having felt the small trainer thanks to her psychic abilities, Meloetta looks around to spot the presence she felt. But... no pokemon nor human is in this bush, just herself.<br>\r\n<br>\r\nThen, a faint voice, almost like a squeak, calls out to her.<br>\r\n\"Hey Meloetta, it's me, Ash! Down here!\" the voice calls.<br>\r\n<br>\r\nLooking down, Meloetta spots her friend, the same one that saved her from those three crazy humans and the talking Meowth. But... Something's different about him... Last time she saw him, he was taller than her... Now she could easily crush him in her fingers.<br>\r\n<br>\r\nPicking up the shrunken trainer, Meloetta nuzzles him, glad to have met him again. Ash laughs.<br>\r\n\"Yeah Meloetta... I'm happy to be seeing you again too...\" he says while being nuzzled.<br>\r\n<br>\r\nIt takes a bit to explain the situation to the giant pokemon, bur eventually Ash does, ending his story with a question.<br>\r\n\"So Meloetta, will you help me grow back?\" he asks. The Melody pokemon looks at her little friend, taking in his words, before smiling warmly...</span></div></div>",
            "created":1486270800,
            "id":2273734,
            "title":"Encounter with an old friend."
        },
        "1353312122212":{
            "author_id":"dhshend",
            "author_name":"Overlird",
            "choices":[
                "Feet",
                "Pokemon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Meloetta was thinking of keeping ash for herself but what should she do with ash lick her feet or be come her pokimon<br>\r\n</span></div></span></div>",
            "created":1573364940,
            "id":2744640,
            "title":"She won't, and keeps the tiny trainer for h..."
        },
        "135331212222":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Victini",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Victini maybe?</span></div></span></div>",
            "created":1483419600,
            "id":2258513,
            "title":"Other"
        },
        "1353312122222":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Keldeo",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keldeo? Does he meet Keldeo again?</span></div></span></div>",
            "created":1483419600,
            "id":2258515,
            "title":"Other"
        },
        "13533121222222":{
            "author_id":"cratos",
            "author_name":"Blue Fox",
            "choices":[
                "Mewtwo",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Mewtwo?</span></div></span></div>",
            "created":1483419600,
            "id":2258516,
            "title":"Other"
        },
        "135331212222221":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Male Mewtwo",
                "Female Mewtwo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it the male mewtwo from the first movie or the femalemewtwo from the movie with the genesect?</span></div></span></div>",
            "created":1483419600,
            "id":2258581,
            "title":"Mewtwo"
        },
        "13533122":{
            "author_id":"tinymikey",
            "author_name":"InchHighMike",
            "choices":[
                "Got Milk? Yes!",
                "Let's Mooooove on to the next Pokemon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a wild Miltank finds Ash?</span></div></span></div>",
            "created":1550984400,
            "id":2622705,
            "title":"Normal pokemon"
        },
        "135331222":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Ash is found by a Machamp",
                "Next choice of pokémon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about something that'll cause Ash to really have his hands full while he's shrunk and have a Machamp be what finds him?</span></div></span></div>",
            "created":1586215620,
            "id":2814535,
            "title":"Four buff arms?"
        },
        "1353312222":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Hail to the Queen, Ash!",
                "Next choice of pokémon",
                "Next choice of pokémon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, suppose a Nidoqueen comes across Ash while he's shrunken?</span></div></span></div>",
            "created":1586590320,
            "id":2817039,
            "title":"Venom Queen, then?"
        },
        "135332":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Crawl inside the small hole",
                "Stay in swellow stomach"
            ],
            "content":"<div class=\"\"><div> <span>It wild swallow found ash and the wild swellow pick up ash with it beak and the swellow plan on eat ash for it next meal and then the swellow tosses ash inside it mouth and the swellow take few minute to enjoy it meal struggle inside it mouth.Ash scream to swellow to let him out but then swellow title it head back and swallowing ash with one *GULP* ash screaming is he  get sliding down into swellow throat and then ash got sliding down into swellow stomach,ash can't believe that he got eating by pokemon but meanwhile swellow started to fly back to it nest but meanwhile ash don't know what to doing but then ash saw a small hole beside swellow stomach,ash decide to?   </span></div></div>",
            "created":1391317200,
            "id":1737275,
            "title":"It wild swellow"
        },
        "1353321":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "To find he is now a baby female taillow",
                "To see a angry swellow"
            ],
            "content":"<div class=\"\"><div> <span>Ash decide to crawl inside the small hole and then ash crawl out of the small he fall in strange yellow liquid,ash struggle trying to get out of the strange yellow liquid and then ash felt dizzy and he pass out.The next morning ash started wake up after hear strange rumble sound near him and ash feel like he movement but meanwhile swellow wake up from it nest to find it self slowly opening her vagina and swellow slowly sliding out a new birth egg out of her vagina and then her egg *PLOP* into the nest,swellow confuse about lay a egg but then swellow humiliated kick in and now all swellow care about is be a good mother to her new birth egg so she sat down on her egg waiting for her baby to hatch but swellow unaware that ash was inside the new birth egg.Ash trying get out but ash keep bump into wall and then ash realized he somehow got inside swellow pokemon egg,ash screaming for someone to help him but ash think break the egg will be the better thing right now,so ash trying break the egg.After 9 week ash finally break the egg but?  </span></div></div>",
            "created":1391490000,
            "id":1739146,
            "title":"Crawl inside the small hole"
        },
        "13533211":{
            "author_id":"mythicalmayhem",
            "author_name":"Mythical",
            "choices":[
                "Wait until he can fly to try and solve the problem",
                "Something happens (write whatever you want)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Yes!\" Ash chirped in triumph. Then Ash realized... that he chirped. That meant.... \"Oh No\" thought Ash.<br>\r\nWhat will I do now?</span></div></span></div>",
            "created":1497416400,
            "id":2335643,
            "title":"The Hatchling Ash"
        },
        "14":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "jessie",
                "nurse joy",
                "officer jenny",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who finds him?</span></div></span></div>",
            "created":1261371600,
            "id":808989,
            "title":"other girls"
        },
        "141":{
            "author_id":"tinymikey",
            "author_name":"InchHighMike",
            "choices":[
                "Jessie found Ash by herself",
                "James and/or Meowth found Ash",
                "Jessie, James and Meowth found Ash together"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it really Jessie who found Ash? Or was it either James and/or Meowth who found him or did they all find Ash together?<br>\r\n<br>\r\nSo who in Team Rocket found Ash?</span></div></span></div>",
            "created":1538456400,
            "id":2557730,
            "title":"Prepare for Trouble and Make it Double"
        },
        "1412":{
            "author_id":"tinymikey",
            "author_name":"InchHighMike",
            "choices":[
                "James found Ash",
                "Meowth found Ash"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who found Ash, Was it James or was it Meowth?<br>\r\n</span></div></span></div>",
            "created":1549688400,
            "id":2614770,
            "title":"James and/or Meowth found Ash"
        },
        "14121":{
            "author_id":"flavored",
            "author_name":"Kat",
            "choices":[
                "Ask for help",
                "Stay hidden"
            ],
            "content":"<div class=\"\"><div> <span>Ash shuffled through the tall grass, which to anyone else would be considered a normal height for grass of about a couple inches. Through the blades, he found a periwinkle headed man with slightly tanned skin and emerald green eyes. It was James.<br>\r\nDespite James had been Ash's nemesis since he ventured through the Kanto region for him, Jessie, and Meowth persistently trying to steal pikachu, the boy was growing desperate. He's been this size for hours, but it felt like days for him and feels like he could ask for help from anyone.<br>\r\nShould he?</span></div></div>",
            "created":1578103680,
            "id":2768936,
            "title":"James found Ash"
        },
        "141211":{
            "author_id":"flavored",
            "author_name":"Kat",
            "choices":[
                "Yes, he wouldn't hurt me",
                "No, I'm starting to get second thoughts!"
            ],
            "content":"<div class=\"\"><div> <span>Ash has known James for so long, he even sees him more than his own mother nowadays. Despite the relationship the two hold, the trainer knew that James was the kindest member in the trio and wouldn't hurt him. After all, he's never tried to do so before.<br>\r\nJames scavenged through some bushes for some berries after some pesky skwovets and a fat greedent stolen his dinner, but it seemed to him that they had taken all the berries too. <br>\r\n\"Those varmints have no decency, I couldn't even catch any to show to the boss.\" the agent sighed, feeling his stomach grumble from hunger and rubbing it as if to soothe it.<br>\r\nAsh marched through the green surroundings until he was met with the agent's foot. He jumped up and pulled on James' white pant leg in order to get his attention.<br>\r\n\"Hey, James! Can you hear me!?\" the boy shouted as a second measure to make sure he can be heard.<br>\r\nJames' head shot up hearing Ash's voice, darting his eyes around the area to see where he was, almost returning to work until he looked at the ground. Before him was Ash, but the young trainer had shrunken to a mere inch and was even shorter than the grass. The agent stared wide eyed at the tiny Ash before his face softened.<br>\r\n\"What happened to you?\" he asked in a concerned manner, bending down to get a better look at the young trainer. But he still couldn't get a good look at him due to his height, so he held out a hand to Ash as if to invite him to jump on. <br>\r\nShould he trust him?</span></div></div>",
            "created":1585651200,
            "id":2810787,
            "title":"Ask for help"
        },
        "1412111":{
            "author_id":"flavored",
            "author_name":"Kat",
            "choices":[
                "Yes, I bet it's lovely inside James' stomach!",
                "Don't eat me!"
            ],
            "content":"<div class=\"\"><div> <span>Ash hopped up onto James' gloved hand, the team rocket member inspected the tiny trainer with his giant emerald eyes. He looked down at the black fabric of the glove and to his white sleeve, before looking up at the lavender haired man.<br>\r\n\"I-I don't know, I just opened my pokédex and it shrunk me.\" he admitted. \"I can't believe I'm saying this to a Team Rocket member, but...I need your help. I don't know where anyone else I know is at.\"<br>\r\nHm. Helping a twerp, that's something James has never done before. Well, at least on this level. Other times where the two teamed up had almost never required this much trust. Besides that, he didn't even know where to start. What if he did something wrong? But he didn't have much choice.<br>\r\n\"Well...\" he glanced to the bottom left corner of his eye before shifting them to the helpless trainer. \"...okay, I'll help you.\" he sighed.<br>\r\nAsh grinned in relief. \"Thanks, James. Maybe you're not such as bad guy after all!\" <br>\r\n\"Don't push it, twerp..\" James responded. A few seconds after, his stomach rumbled. His face turned red for a second as he glanced down at it. He was a lot hungrier than he thought, the agent even got a few hunger pangs from it. That was when he looked back at the twerp when he got a twisted idea to ease his hunger as a thought crossed his mind: <br>\r\n<i>\"I wonder how good he'll taste..\"<i><br>\r\nHe knows he shouldn't even think about it, but he was starving, dammit!<br>\r\n\"I'm sorry about this, I promise I won't hurt you. Even if you are an enemy, you're still a child.\" The agent licked his lips at Ash. Said trainer gave him a look before James' mouth opened, warm and minty breath washed over him as he was drawn nearer towards the cave.<br>\r\nDoes he want to go along with this?</i></i></span></div></div>",
            "created":1591418400,
            "id":2846539,
            "title":"Yes, he wouldn't hurt me"
        },
        "14121112":{
            "author_id":"flavored",
            "author_name":"Kat",
            "choices":[
                "Struggle",
                "Nothing. It's not like there's much he can do at this size, anyway"
            ],
            "content":"<div class=\"\"><div> <span>\"JAMES! What are you doing!?\"<br>\r\nHe was easily scooped up by the wet, squishy tongue. Ash tried to stand back up, but he fell with a grunt. He turned around to the entrance of the maw, only for the light that illuminated it to disappear as James shut his mouth.<br>\r\nThe only way to go was down.<br>\r\nAsh felt himself start to slide down his throat, he gripped onto a fang to prevent himself from falling any deeper. That only worked for a second before he lost grip and slid down his slick tounge and entered the esophagus feet first.<br>\r\nJames tipped his head back when he felt the feet touch his throat and swallowed, placing two fingers on his neck and felt Ash travel down his snug throat.<br>\r\nOnly a few seconds later, the boy landed into James' stomach. He felt the fleshy and smooth wall next to him as he tried to collect his senses. All around him were pink fleshy walls and the sound of soft gurgling echoing around him along with the sound of a heartbeat and breathing. It could be considered soothing in a weird way.<br>\r\n\"I'm sorry about that, again. I was just so hungry...\"<br>\r\nWhat should he do next?</span></div></div>",
            "created":1591419900,
            "id":2846549,
            "title":"Don't eat me!"
        },
        "141211122":{
            "author_id":"flavored",
            "author_name":"Kat",
            "choices":[
                "Yes, today was exhausting! Finally, I can get some rest",
                "I'm not tired yet"
            ],
            "content":"<div class=\"\"><div> <span>Ash looked up to where he came from, where he could hear James' voice from up there. He sat up and leaned forward. <br>\r\n\"You're really not gonna hurt me?\" the trainer asked, his voice tense as he gathered what strength he had to prepare for an answer.<br>\r\n\"Of course I wouldn't. Catching your pikachu be a lot easier if I digested you, but it's not worth it. Everyone needs a nemesis, after all.\"<br>\r\n\"When are you going to let me out?\"<br>\r\n\"Depends on whenever there's other food available, which won't be for awhile. Or if you have to go to the bathroom, I don't want you to do your business in there!\"<br>\r\n\"I have to go to the bathroom!\"<br>\r\n\"Nice try, twerp.\"<br>\r\nAsh huffed out a laugh before nestling into a stomach wall. He might have to be here a while, so he'd might as well get comfortable in the fleshy chamber. In fact, Ash is getting a bit too comfortable.<br>\r\nWill he fall asleep?</span></div></div>",
            "created":1591421700,
            "id":2846565,
            "title":"Nothing. It's not like there's much he ..."
        },
        "143":{
            "choices":[
                "Her place to punish him",
                "His mom to report him",
                "A group of Pokemon to feed him"
            ],
            "content":"<div class=\"\"><div> <span>A white glove grabs Ash and pulls him up.<br>\r\n\"Who are you?\" Ash looks up to see Officer Jenny. Ash tries to explain, but she cuts him off. \"This is a restricted area, violators are shrunk and arrested.\" Officer Jenny takes him to . . .</span></div></div>",
            "created":1464238800,
            "id":2154355,
            "title":"officer jenny"
        },
        "1431":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "she was going to keep him for herself!",
                "she was going to a reunion of ALL the Jennys and Ash was going to be their pet!",
                "Ash was going to be used as a playmate for her pokemon"
            ],
            "content":"<div class=\"\"><div> <span>Ash sighed as he was carried off by the officer, wondering WHICH one this Jenny was, seeing as every one of the beautiful, all-female police family were all police officers, all of them looked identical, plus were all named \"Jenny\" (he wasn't Brock, so he couldn't tell them apart), as she went to her police motorcycle and took out a shoe box and dropped him into it and shut the lid. A second later, he heard the bike's motor start.<br>\r\n<br>\r\nAfter a few hours in the dark box, the bake stopped and the motor was shut off before the box Ash was in was picked up and carried somewhere.<br>\r\n<br>\r\nFeeling his box be set down, Ash was blinded by sudden light as the lid was removed, before he was suddenly cast in a massive shadow, which actually helped his eyes adjust, before Ash looked up to see the massive face of Officer Jenny looking at him.<br>\r\n<br>\r\nShe sighed and then plucked him out from the box and set him down.<br>\r\n<br>\r\nAsh looked around. This wasn't a police station, instead, it was a coffie table in someone's living room...and the framed pictures of a bunch of identical ladies and the hung up police academy graduation credentials made whose it was obvious!<br>\r\n<br>\r\nHe was in Jenny's house! He gulped. Wondering WHY she'd taken him here of all places, then looked up at the giantess of the law.<br>\r\n<br>\r\n\"Can I at least explain myself?\" he asked, as much to distract himself from why he had been taken here as to tell his side of things.<br>\r\n<br>\r\nShe nodded.<br>\r\n<br>\r\n\"Look, Officer Jenny...I'm sorry I was there, but I didn't know it was somewhere I wasn't allowed to be.\"<br>\r\n<br>\r\n\"Ignorance of the laws is no excuse for breaking it.\" Jenny said firmly.<br>\r\n<br>\r\n\"Yeah, but how easy is it to break laws you don't know about? If it was a restricted area, why wasn't there at least a sign to warn about that?\" Ash asked.<br>\r\n<br>\r\nJenny frowned. As much as she didn't like it, he had a valid point. The law was made for the sake of keeping people safe, those whom upheld it couldn't be unfair or unreasonable. \"True enough...still, the fact remains that I just can't let you go. Besides, even if I informed the ones who set that up about this, the re-enlargement process is a long one to prepare. So you'll have to stay here until then.\" Jenny told him.<br>\r\n<br>\r\nAsh sighed. He should have expected as much. Still...at least she was being reasonable. He was thankful for that. However, the fact that he was on \"house arrest\" with this Jenny still bothered him.<br>\r\n<br>\r\n\"So...what happens now?\" Ash asked, not looking forward to the answer.<br>\r\n<br>\r\nJenny looked at him, then smirked as she informed Ash that...</span></div></div>",
            "created":1464670800,
            "id":2156730,
            "title":"House Arrest"
        },
        "14311":{
            "author_id":"demon12345",
            "author_name":"Alexthelover",
            "choices":[
                "she fart while she asleep ",
                "ash gags at the smell all night "
            ],
            "content":"<div class=\"\"><div> <span>you are mine now, she takes off her shoes and her socks.<br>\r\nstart licking my feet or you go here, she point to her belly.<br>\r\nstart to lick her feet, they smell so bad, <br>\r\nWhen 2 hours has pass Jenny get bored.<br>\r\nshe picks me up, well it time for some sleep<br>\r\nshe open the back of her panties and put ash up her ass,<br>\r\nHave a nice time there and I ate beans for lunch,<br>\r\nshe farts PRRRRRRRRRRRRRRRRRRRRRRRR<br>\r\nI just gag at the smell, she goes to her bed to sleep.</span></div></div>",
            "created":1499576400,
            "id":2350629,
            "title":"she was going to keep him for herself!"
        },
        "14312":{
            "author_id":"dhshend",
            "author_name":"Overlird",
            "choices":[
                "Misty",
                "Ash mom"
            ],
            "content":"<div class=\"\"><div> <span>Ok now as punishment for breaking the law you will now be my foot pet and i will put you my shoes for you're new home you must kiss my feet and my sister feet when they are here ash ok and he starts to kiss each of here toes as of now you must call all women how enter my house godess if you do not i will feed you to my pokemon for desert now be a good pet and rub my feet and if you do a good job for one year  all let you go to one person to take you home now rub harder <br>\r\n<br>\r\n</span></div></div>",
            "created":1572757200,
            "id":2741868,
            "title":"she was going to a reunion of ALL the Jennys an..."
        },
        "1432":{
            "author_id":"dhshend",
            "author_name":"Overlird",
            "choices":[
                "Between my toes",
                "Bettwen mt boobs",
                "In my panties"
            ],
            "content":"<div class=\"\"><div> <span>To his mom house officer jenny shinks ash to the size of a penny and put him in her shoes in between her toe he cood not handle the smell ofgicer jenny told ash to lick her toes he did for one hour then past out when they get there ash wakes up and see he is on is mom lap and see officer jenny talking with her and she said the shrinking last for 1 year and ash starts crying and they see ash is awake and his mom said it going to be ok but you can't be a pokemon trainer not yet so you will stay with me for now i don't what to lose you so all put you in here</span></div></div>",
            "created":1572757200,
            "id":2741877,
            "title":"His mom to report him"
        },
        "144":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Sabrina",
                "Erica",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well then how about?</span></div></span></div>",
            "created":1262754000,
            "id":816448,
            "title":"other"
        },
        "1441":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "little girl",
                "gym leader"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one the little girl or the gym leader?</span></div></span></div>",
            "created":1262754000,
            "id":816449,
            "title":"Sabrina"
        },
        "14411":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Tea party",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Ash looked up and gawked, horrified, at who was looming over him<br>\r\n<br>\r\nA humongous green-haired little girl in a white silk dress and a big white hat with a red bow on her head. And although her eyes were shaded, Ash could sense them staring down at him! <br>\r\n<br>\r\nWhat was worse was that he recognized the girl. She was that doll that was supposed to represent that separate personality of Sabrina. Her childlike emotion incarnate!<br>\r\n<br>\r\n\"My dolly!\" the little girl started to giggle as the skin of the girl's hand took up his vision.<br>\r\n<br>\r\n\"Hi, dolly. Remember me?\" the little girl said.<br>\r\n<br>\r\n\"No... this can't be. This is impossible! You disappeared!\" Ash stampered.<br>\r\n<br>\r\n\"Yes, it is true that I vanished from your own world, but I was always a part of Sabrina. I simply resided in her mind, waiting for the right time to return once my own psychic strength built up. Once that happened, I separated from her and shrunk you with the psychic powers and teleported you to me!\" the little girl said.<br>\r\n<br>\r\n\"What do you want with me!?\" Ash asked.<br>\r\n<br>\r\n\"It's quite simple. I want to play! You did agree to being my friend the first time Sabrina beat you, and you're SO CUTE this size! I just HAVE to keep you!\" the little girl said.<br>\r\n<br>\r\n\"No way!...I'm not a toy!\" Ash cried in alarm.<br>\r\n<br>\r\n\"Oh, I'm afraid you have no choice in the matter. Let me show you what I mean.\" the little girl said. She then started stepping towards Ash.<br>\r\n<br>\r\n\"No! You won't catch me!\" Ash took off running in the other direction. The girl simply giggled.<br>\r\n<br>\r\n\"Heeheehee! There is no escape, Dolly!\" the little girl said. Just then, her eyes glowed a bright white, and Ash suddenly collapsed to the ground, screaming in pain.<br>\r\n<br>\r\n\"Don't worry, Dolly. We'll play together all the time and we'll be friends forever.\" the little girl said. Ash was able to turn around finally, only to see the skin of that girl's hand taking up his vision.<br>\r\n<br>\r\n\"No... please don't hurt me! NOOOOOOOOO!!!\" Ash shouted before the little girl doll of Sabrina picked him up and hugged him.<br>\r\n<br>\r\n\"I love my dolly!\" Doll-Sabrina pretty much swooned. \"What game shall I play first with my brand-new dolly? Maybe we can have tea!\"<br>\r\n<br>\r\nAsh groaned as he was hugged to the doll's silk dress as she decided on a game to play with him</span></div></div>",
            "created":1399438800,
            "id":1793069,
            "title":"little girl"
        },
        "144111":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Ash tries to escape",
                "Ash stays put for now"
            ],
            "content":"<div class=\"\"><div> <span>The little girl giggled again as she felt Ash struggle in her grip “keep it up dolly Ash” she said “a little more of that and you might manage to tickle me!” The little girl giggled as she started to walk.<br>\r\n<br>\r\n“Let me go!” Ash demanded again.<br>\r\n<br>\r\n“Be quiet little dolly, if you keep whining I’ll just have to strap a diaper on you then we can play a game of house with baby Dolly!” said the little girl with a giggle. Suddenly she stopped moving “here we are!” she said. The little girl lifted her hand which held Ash who found himself looking down at a red picnic blanket, there was a child’s picnic basket, a tiny tea set, and several other dolls (and Ash hopped that’s all they really were). “Look Dolly there’s room for you between Mrs. Princess and Professor Bearington!” said Sabrina as she set Ash down between an average doll dressed in a princess dress and a teddy bear wearing a formal coat with a monocle on his right eye. “There you are dolly” the little girl added as she placed a tea cup in front of Ash. “And now that we are all gathered I would like to welcome you all to my tea party” she told her guests as she took a tea pot out of the basket and began pouring each guest a cup “now everyone wait till everybody has there cup full!” said the little girl momentarily taking her attention away from Ash…</span></div></div>",
            "created":1400043600,
            "id":1796529,
            "title":"Tea party"
        },
        "1441111":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Your Punish will be turn into girl dolly!",
                "Your Punish will be turn into cute baby girl Pokemon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash tried to escape while little girl was busy but Ash didn't get that far! Little Girl pick him up and said Oh No Dolly Ash, You need to be punish for tried to escape from me!</span></div></span></div>",
            "created":1456981200,
            "id":2112596,
            "title":"Ash tries to escape"
        },
        "14411111":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Fancy Princess dress",
                "Pretty pink dress "
            ],
            "content":"<div class=\"\"><div> <span>“Oh I know, I made you into girl and then you be my girl dolly, I have Lot pretty doll dress.” As she use her ability and immediately change Ash gender into girl!<br>\r\n<br>\r\n “Ahhh I have girl vagina and breasts, please change me back Sabrina!” Ash cried but she just giggled and reply. “I am sorry dolly but this your punishment for tried to escape me, but anyway I think it time, I change your old clothes into some more girly outfits.” <br>\r\n<br>\r\n(What kind of girly outfit?)</span></div></div>",
            "created":1570424400,
            "id":2729564,
            "title":"Your Punish will be turn into girl dolly!"
        },
        "14412":{
            "choices":[
                "Eats him",
                "Licks him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash sees Sabrina looking down at him, she then picks him up.<br>\r\nShe raises him above her mouth and . . . </span></div></span></div>",
            "created":1399266000,
            "id":1792084,
            "title":"gym leader"
        },
        "144121":{
            "choices":[
                "Live",
                "Get digested"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She drops him in and swallows<br>\r\n\"Don't do this\" Ash yelled but Sabrina didn't care<br>\r\nDid he . . . .</span></div></span></div>",
            "created":1399266000,
            "id":1792085,
            "title":"Eats him"
        },
        "144122":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "\"Love to get better taste of you\"",
                "\"Not like your taste So I go have fun\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sabrina slowly lick Ash body to get better taste of him as she tried to decide if she like Ash flavor.. <br>\r\nAsh scream \"SABRINA PLEASE NOT EAT ME\" and then Sabrina said Oh Ash I</span></div></span></div>",
            "created":1423717200,
            "id":1932489,
            "title":"Licks him"
        },
        "1441222":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "\"Put you inside my Pantie\"",
                "\"Put you inside of something\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Not like your taste So I going have fun with you by?</span></div></span></div>",
            "created":1428382800,
            "id":1960434,
            "title":"\"Not like your taste So I go have fun\""
        },
        "14412221":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Back, Ass.",
                "Front, Pussy."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'm going to put you on the ______ of my panties. I hope you enjoy my ________.\"</span></div></span></div>",
            "created":1436245200,
            "id":2004511,
            "title":"What side of Sabrina's Panties?"
        },
        "144122212":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Ash Pov",
                "Sabrina Pov"
            ],
            "content":"<div class=\"\"><div> <span>Ash see Sabrina front of her panties as he yell \"SABRINA PLEASE NOT DO THIS!\" as Sabrina said now be gentle to me Ash, and with that she open front of her Panties and drop Ash inside. Sabrina snap her panties close and feel Ash against her Vagina  as she moan little bit and soon get up as she continue her day with Ash be her tiny prison inside her panties.</span></div></div>",
            "created":1444712400,
            "id":2047085,
            "title":"Front, Pussy."
        },
        "1443":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Cassidy",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it Cassidy from the \"other\" Team Rocket?<br>\n<br>\n(images of Cassidy: <a rel=\"nofollow\" href=\"http://www.trsrockin.com/cassidy.html\" target=\"_blank\">http://www.trsrockin.com/cassidy.html</a>)</span></div></span></div>",
            "created":1266555600,
            "id":839045,
            "title":" Cassidy "
        },
        "14432":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Yes, Georgia ",
                "moving onto another choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Georgia, the self-proclaimed \"Dragon Buster\" from the Unova Region being who finds the shrunken Ash?</span></div></span></div>",
            "created":1388206800,
            "id":1716118,
            "title":"Georgia "
        },
        "144321":{
            "author_id":"colorespio",
            "author_name":"colorespio",
            "choices":[
                "georgia eats ash",
                "ash convince her to use him as slave"
            ],
            "content":"<div class=\"\"><div> <span>Ash was grabbed by a yellow glove hand and carried over to iris's rival georgia who was licking her lips amd rubbing her stomach<br>\r\n<br>\r\n\"georgia!!\" ash replied shock \"what are you doing here?\"<br>\r\n<br>\r\n\"about to have a snack\" georgia replied before licking ash<br>\r\n<br>\r\n\"eww gross\" ash said \"wait you mean i'm the snack\"<br>\r\n<br>\r\n\"duh i shrinked you so i can eat you nothin personal but i think eating you will piss off iris\" georgia said as she lifted ash to her mouth while ash tried to think of something fast<br>\r\n<br>\r\n</span></div></div>",
            "created":1580008140,
            "id":2778474,
            "title":"Dragon Buster "
        },
        "144322":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "oui",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>that French girl burgundy</span></div></span></div>",
            "created":1522213200,
            "id":2471443,
            "title":"moving onto another choice"
        },
        "1443222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes she does",
                "not her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Duplica sounds cool right?</span></div></span></div>",
            "created":1524027600,
            "id":2481205,
            "title":"someone else"
        },
        "14432222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "aria",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>kalos queen</span></div></span></div>",
            "created":1528261200,
            "id":2503781,
            "title":"not her"
        },
        "144322222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "miette",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>miette    </span></div></span></div>",
            "created":1532494800,
            "id":2524376,
            "title":"someone else"
        },
        "1443222222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "zoey",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zoey      </span></div></span></div>",
            "created":1532494800,
            "id":2524378,
            "title":"no"
        },
        "14432222222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "bianca",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bianca    </span></div></span></div>",
            "created":1532494800,
            "id":2524380,
            "title":"no"
        },
        "144322222222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "shauna",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>shauna    </span></div></span></div>",
            "created":1532494800,
            "id":2524381,
            "title":"no"
        },
        "14433":{
            "author_id":"drakeforatue",
            "author_name":"The ColdBlood King",
            "choices":[
                "Sure",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about his mom - Delia Ketchum?</span></div></span></div>",
            "created":1406178000,
            "id":1832913,
            "title":"Delia Ketchum"
        },
        "144331":{
            "author_id":"drakeforatue",
            "author_name":"The ColdBlood King",
            "choices":[
                "- I'm going to Eat You.\"",
                "- So I can fit you Up my Ass.\""
            ],
            "content":"<div class=\"\"><div> <span>Ash was shocked - he was standing only one inch off the ground. In front of him was his Pokedex; it was gigantic, he dropped it when he started to shrink. He had no idea what happened, but he knew he was in trouble. He had to get out of the park somehow.<br>\r\n<br>\r\nHe suddenly felt some tremors shake the ground he was walking on. They were so strong and so frequent that he fell off of his feet and onto the ground. Earthquakes this frequent must've meant footsteps; someone was coming this way. He turned around and looked up to see...His mom?! Yes, it was his mom. She was walking casually along the path. He wondered what she was doing here? Although; he had just had a visit with her back in Palette Town, so maybe she came looking for him.<br>\r\n<br>\r\nIf she was looking for him, then maybe he could get her attention and she would find him. She's his mother; she had to help him. He got up on his feet and began waving his arms. He began to get a little worried when he saw her high heels coming closer and closer with no sign of stopping. Delia wasn't even looking down; she was looking about the park, from tree to tree.<br>\r\n<br>\r\nHowever, she suddenly stopped and took a look around. She looked down at the path and saw Ash's Pokedex on the floor. She looked about and suddenly she saw Ash waving his arms. Ash smiled when he noticed that she spotted him. But...then he realized that instead of being shocked that he was so tiny, she was actually smiling.<br>\r\n<br>\r\n\"Oh, there you are Ash,\" Delia said reaching down for him. Ash was a bit alarmed as she began to wrap her fingers around him, as well as picking up his Pokedex with her other hand. Ash thought he was going to be sick as she raised him off of the ground. \"Oh, I'm so glad you're alright; you could've gotten hurt staying on the path like this.\"<br>\r\n<br>\r\n\"Mom!\" Ash shouted. \"Are you not in the least bit alarmed or even surprised that I'm only an inch tall at present?!\"<br>\r\n<br>\r\n\"Oh of course not, Sweetie,\" Delia said.<br>\r\n<br>\r\n\"What?!\" Ash shouted, now being shocked himself.<br>\r\n<br>\r\n\"Well this was inevitable, my little Ashy-Boy,\" she called him. \"These Pokemon Journeys of your keep you away from home for so long...On your last visit home, when Professor Oak updated your Pokedex, I added a new feature of my own.\" She took the Pokedex and lifted up the panel over the speaker, revealing some kind of broken capsule. \"Inside was an inhalant that shrinks whoever breathes it in - and it was activated when you opened your Pokedex. Good thing you did it so close to Palette Town, or I'd never have gotten here in time. Oh my you're so cute.\" Delia began rubbing his head with one of her fingers, pressing it down and around. \"You always were my little baby boy...Now you can be like this forever!\"<br>\r\n<br>\r\nThe sensation was uncomfortable, and Ash was angry. He couldn't believe that his own Mother shrunk him! And not only that, she was planning on keeping him like this forever. He finally pushed his head out from under her finger and shouted up to her again.<br>\r\n\"Mom! I cannot believe you did this!\" Ash said. \"Why did you Shrink me?!?!?!\"<br>\r\n<br>\r\nDelia stared at him a little bit surprised, like she didn't understand his objection. She slowly smiled and closed her eyes, making a very cheery and nonchalant face. \"Why...Isn't it obvious sweetie? -</span></div></div>",
            "created":1406264400,
            "id":1833201,
            "title":"Giantess Mother"
        },
        "1443311":{
            "choices":[
                "Take revenge on team rocket",
                "To make Delia a Pokemon trainer"
            ],
            "content":"<div class=\"\"><div> <span>With that she lifts him above her mouth, and inserts him in.<br>\r\n\"Mm\" she loved his taste. She almost got him in, until Iris appeared.<br>\r\n\"Not yet, we need him for the plan.\"<br>\r\n\"Oh alright\"<br>\r\n\"What plan?\" Ash asks. They both look at him.<br>\r\n\"Obviously to . . .</span></div></div>",
            "created":1461301200,
            "id":2137684,
            "title":"- I'm going to Eat You.\""
        },
        "1443312":{
            "author_id":"drakeforatue",
            "author_name":"The ColdBlood King",
            "choices":[
                "Stick him down the front of her panties",
                "Stick him down the back of her panties."
            ],
            "content":"<div class=\"\"><div> <span>\"WHAT?!\" Ash asked, doing a sudden double-take. He honestly couldn't believe what he just heard.<br>\r\n<br>\r\n\"It's much easier at this size, believe me,\" Delia said with the same cheery attitude from before.<br>\r\n<br>\r\n\"You - You - You wanna stick me up your-?\" Ash stuttered.<br>\r\n<br>\r\n\"Yes - isn't it wonderful?\" Delia said, still not having opened her eyes to look at him.<br>\r\n<br>\r\nAsh couldn't believe it. He refused to think this was real; it could not be happening. This was impossible! How could his mother have shrunken him so that she could shove him up her butt? And more importantly why would she want to do that? Why would his own mother want to do something so vile to her only son?<br>\r\n<br>\r\n\"Now I know that it will take some getting used to,\" Delia spoke again. \"It will be an adjustment for the both of us.\"<br>\r\n<br>\r\n\"MOM!\" Ash shouted, at her attitude suggesting he will have to live like that. \"Wha-Wha...WHY?! Why would you want to do such a thing?!\"<br>\r\n<br>\r\n\"Well Ash it's simple,\" she said finally opening her eyes to look at him. \"It's something I realized a long time ago; the Pokemon are dangerous wild animals, and you're still just a boy. How long would it be before one of those dangerous monsters tried to kill you? I wanted you to give up being a Pokemon trainer so that you could stay safe. But I also knew that you wouldn't quit on your own...You'd have to be forced to. So I shrunk you so that I could always keep you safe. But with how stubborn and tenacious you are, I know that you could get away from me if I just carried you around in my pocket. So I thought of the one place where I could always keep you close to me and where you'd be safe from the outside world...My ass.\"<br>\r\n<br>\r\n\"B-but Mom, that's disgusting,\" Ash pleaded.<br>\r\n<br>\r\n\"Oh no sweetie; it's all natural,\" Delia told him, still with her cheery mood. \"You'll absolutely LOVE being tucked away up there.\" Ash noticed that Delia gave a shake and raised her rump a bit when she said that. Ash was in shock.<br>\r\n<br>\r\n\"But - But - But,\" Ash stuttered trying to find words to change her mind.<br>\r\n<br>\r\n\"No Buts young Man,\" she said stern and motherly. But then her serious demeanor changed back to a cheery smile and then she giggled slightly. \"Except Mine of course.\" Her giggles became full blown laughter. She cleared her throat and became serious again. \"Now - enough of this.\" Delia suddenly moved her other hand down, and to Ash's horror, she began hiking up her skirt.<br>\r\n<br>\r\n\"NO - Mom, Please!\" he begged.<br>\r\n<br>\r\n\"No more arguments, Ash,\" she said. \"Believe me; this is for your own good.\"<br>\r\n<br>\r\nWhat does she do with him?</span></div></div>",
            "created":1407301200,
            "id":1838376,
            "title":"- So I can fit you Up my Ass.\""
        },
        "14433121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Continue",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Ash watches as his mother, Delia, continues to hike up her long dark blue skirt to reveal her white lacy panties and she pulls on the back of her panties to prepare to drops him in by her ass. But then, Delia stopped as she has another idea for her shrunken son. She closes the back of her panties and brings Ash back to her face. He was relieved that he didn't go into his mother's ass, but he was confused by her sudden halt from what she was goons do.<br>\r\n<br>\r\n\"You know what, Ash? You're right. Having you in my ass doesn't really sound like the best idea.\" Delia said.<br>\r\n<br>\r\nAsh was feeling better now when she decided not to put him in her huge ass. But, his time of relief was short-lived as he hears what his mother had anything else in store for him.<br>\r\n<br>\r\n\"But, I think I might have thought of a better place for you to be in.\" Delia said.<br>\r\n<br>\r\nShe moves her hand to the front side of her panties and she pulls on them to have Ash see her vagina from where he is now. Ash felt himself getting paled as he figures out what she's gonna do now.<br>\r\n<br>\r\n\"Now, get ready to be in your new comfy home, Ash. I promise that you'll love it very much.\" Delia said with a seducetive smile on her face.<br>\r\n<br>\r\nShe then let Ash go to have him fall down into her panties. Once there, he rolls down the fabric and soon hits her vagina. Delia felt it as she closes her panties shut and pats on the spot that her son is in.<br>\r\n<br>\r\n\"There you go, Ash. Nice and safe from any danger that might happen to you. You're gonna enjoy being inside Mommy's panties, Dear. Now, let's go home.\" Delia said.<br>\r\n<br>\r\nDelia fixes her skirt and goes off to head home while caring her tiny son in her panties. Ash was in disbelief by what just happened. His own mother shrunk him and now she has him trapped in her panties and against her vagina with no way out. Ash doesn't know what she'll have him do now, but it's gonna be crazy on so many levels when they get back home.</span></div></div>",
            "created":1486270800,
            "id":2273922,
            "title":"Change of plans"
        },
        "144332":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Yes",
                "No, more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Ash getting shrunk and discovered by the Pokemon Master that's the champion of the ENTIRE  Sinnoh region, Cynthia? </span></div></span></div>",
            "created":1416373200,
            "id":1889512,
            "title":"Battle Goddess of Sinnon and a Shrinkee?"
        },
        "1443322":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Finally! This'll be GOOD!",
                "No, More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, how about Serena, Ash's female companion from the Kalos Region who has a crush on him? Just imagine what her finding Ash while he's shrunk could lead up to. </span></div></span></div>",
            "created":1423285200,
            "id":1929182,
            "title":"Serena"
        },
        "14433222":{
            "author_id":"mr.gtslove123",
            "author_name":"GiantesLover",
            "choices":[
                "Lillie/Lana",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Lillie or Lana?</span></div></span></div>",
            "created":1489554000,
            "id":2290244,
            "title":"No, More choices"
        },
        "144332221":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Lillie",
                "Lana"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>well which one?</span></div></span></div>",
            "created":1489554000,
            "id":2290280,
            "title":"Lillie/Lana"
        },
        "144332222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about mallow?</span></div></span></div>",
            "created":1524027600,
            "id":2481206,
            "title":"Other"
        },
        "1443322222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cilan then?</span></div></span></div>",
            "created":1524027600,
            "id":2481207,
            "title":"no"
        },
        "14433222222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "clemont",
                "bonnie",
                "niether"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Clemont or Bonnie?</span></div></span></div>",
            "created":1524027600,
            "id":2481209,
            "title":"no"
        },
        "144332222223":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "kiawe",
                "sophocles",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>kiawe or sophocles</span></div></span></div>",
            "created":1524027600,
            "id":2481210,
            "title":"niether"
        },
        "1443322222233":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "max",
                "tracey",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about these</span></div></span></div>",
            "created":1528261200,
            "id":2503783,
            "title":"other"
        },
        "14433222222333":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "dark ash",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>evil version of himself</span></div></span></div>",
            "created":1528261200,
            "id":2503784,
            "title":"other"
        },
        "144332222223332":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "ARCEUS",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>GOD OF POKEMON</span></div></span></div>",
            "created":1528261200,
            "id":2503785,
            "title":"no"
        },
        "1443322222233322":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "yes, Angie",
                "no, a different human",
                "no, a different pokémon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Angie from the pokémon summer academy be who finds Ash while he's shrunk?<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://m.youtube.com/watch?v=TGeydPcQtJw\" target=\"_blank\">https://m.youtube.com/watch?v=TGeydPcQtJ...</a></span></div></span></div>",
            "created":1541307600,
            "id":2572911,
            "title":"Angie then?"
        },
        "14433222222333222":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "sorrel",
                "verity",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about these</span></div></span></div>",
            "created":1549342800,
            "id":2613540,
            "title":"no, a different human"
        }
    },
    "info":{
        "author_id":"dan101",
        "author_name":"harek",
        "brief_description":"Ash from Pokemon shrinks and fights to stay alive...",
        "created":1242357900,
        "description":"<td align=\"left\" class=\"norm\">Ash Ketchum shrinks to one inch tall and everyone sees him as live food. Who finds him first?<br>\r\n<br>\r\noral and tail vore only<br>\r\nno sexual content<br>\r\nno killing except digestion<br>\r\nmay have footplay and plenty of licks</td>",
        "id":1560519,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1591421700,
        "modified":1591421700,
        "pretty_title":"Ash shrinks"
    }
}