{
    "chapters":{
        "1":{
            "author_id":"coatbike",
            "author_name":"Coatbike",
            "choices":[
                "Viest Prime and the others",
                "Go out and see a movie with her",
                "Go to the Beach",
                "Stay Home and Play some video Games",
                "Or ride Acree on her vichelle mode"
            ],
            "content":"<div class=\"\"><div> <span>As i was waking up from bed i sundelly notched something strange. The bed i was sleping in was Huge and i also notchied that my entire house had increased in size. I got from under the covers and stared thinking to myself \" How could this happen\".  Then i started to hear load thumps coming up the stairs and they were getting closer and closer to my bed room door. Just then the door openned and to my surprize it was Arcee from Transfromers prime. She is all tall blue and good looking i said to myslef.<br>\r\n<br>\r\nThen she said  \" Hey Honney glad you are Awake from your nape\". Uh thanks Acree. So sweetie what do you think we should do with her Starinng at me. Uh i let you know once i am done chanjing. K she you in a few Honey muffin. So then i put on a  reguler blue shirt with a samurai on it and camouflage  shorts. So then i walkied down stairs and Acree said Well Baby what do you whant to do</span></div></div>",
            "created":1306187340,
            "id":1111441,
            "title":"Meeting your Robot wife"
        }
    },
    "info":{
        "author_id":"coatbike",
        "author_name":"Coatbike",
        "brief_description":" And Some of you could be thinking it to so do not judje me. Here it is",
        "created":1306174560,
        "description":"<td align=\"left\" class=\"norm\">It is where you wake up and you are married to Transformers Prime Acree. The details is where any of the prveios gen can apper but not diffrent Opptiums primes can apper in the same charpeter. Just choise which can be in the stroy</td>",
        "id":1778722,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1306187340,
        "modified":1306187340,
        "pretty_title":"Married To Transformes prime Acree"
    }
}