{
    "chapters":{
        "1":{
            "author_id":"angelslayer",
            "author_name":"Just a guy ",
            "choices":[
                "Briefs (Boy)",
                "Panties(Girl)"
            ],
            "content":"<div class=\"\"><div> <span>Well tomorrow is the big day my first day of high school! I can't believe how much time passes by! Not that anyone would guess I would be a high schooler as I'm only 4'10! Yeah I'm pretty short but hey maybe I'll grow taller this year! After brushing my teeth and putting on my Pajamas I jumped into bed excited. \"Anon wake up get in the shower the bus will be here in 40 minutes!\" my mom shouted out. I got out of bed and into the shower and once I got out I opened my underwear drawer and put on my most comfortable pair of.... </span></div></div>",
            "created":1600907040,
            "id":2908921,
            "title":"The beginning of the worst first day ever!"
        },
        "12":{
            "author_id":"angelslayer",
            "author_name":"Just a guy ",
            "choices":[
                "Cheerleader ",
                "Football team member ",
                "Girls basketball team member",
                "Rich preppy girl",
                "More options "
            ],
            "content":"<div class=\"\"><div> <span>I put on my most comfortable pair of panties they were pretty pink ones with frills. before putting on my jeans and sweater sliding on my sneakers before rushing down and eating breakfast once I finished I headed to the bus stop once the bus arrived I quickly got on it heading to a seat my panties were slightly showing once I sat down I shoved them back into my pants I didn't want a repeat of my time as weight lifting practice. <br>\r\n<br>\r\nI still remember it far from fondly where the girls basketball team tricked me into a training session claiming I would be assisting them unfortunately that help turned out to being used as a weight by being lifted up with my underwear. <br>\r\n<br>\r\nThe more I think of it the more it humiliates me 'but it's a new school it won't be as bad as the last time!' I thought to myself which instantly restored my confidence! Once the bus stopped I got out smiling and took several confident steps towards the entrance. Before immediately bumping into someone and little did I know my confidence was about to be brutally killed. \"Watch where you're going!\" The voice belonged to a very irritated...</span></div></div>",
            "created":1600907280,
            "id":2908922,
            "title":"Panties(Girl)"
        }
    },
    "info":{
        "author_id":"former182",
        "author_name":"Former182",
        "brief_description":"wedgie high is remade this time with gender equality! Boys and girls get wedgies fairly!",
        "created":1600816920,
        "description":"<td align=\"left\" class=\"norm\">Note from Former182 : This is a story that belongs to <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://www.writing.com/main/portfolio/view/angelslayer\" target=\"_blank\">https://www.writing.com/main/portfolio/view/angelslayer</a><br>\r\nPretty much this is their story from this point on and this was written from their POV.<br>\r\n<br>\r\n<br>\r\nIn case you're wondering this is based off of the wedgie high story of the same name I loved the story but the one thing I disliked about it was that only guys could get wedgies and girls were not allowed to receive them meaning that complete jerk girls could give the protagonist a wedgie karma free! That didn't sit well with me why should only boys get wedgies? Girls should be able to get them as well! That's why I decided to create this one! In this high school boys and girls can get their undies pulled equally!<br>\r\nRules 1 no scat,vore,unbirthing,shrinking,etc<br>\r\nRule 2 the characters name is Anon so keep it at that.<br>\r\nRule 3 while other types of bullying is allowed like swirlys and stuff like that well mostly deal with wedgies.<br>\r\nRule 4 Boys and girls can both give and receive wedgies equally a boy can give a girl a wedgie vice versa.<br>\r\nRule 5 make sure your dialogue is natural<br>\r\nRule 6 don't kill characters this isn't a violent story.<br>\r\nRule 7 have fun writing.</td>",
        "id":2233029,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600914540,
        "modified":1600914540,
        "pretty_title":"The Gender Equal Wedgie High!"
    }
}