{
    "chapters":{
        "1":{
            "author_id":"joerandom",
            "author_name":"Joe Random",
            "choices":[
                "\"We'll see,\" you say, as you sign.",
                "\"Probably,\" you say, as you sign.",
                "\"I don't think so,\" you say, refusing to sign. ",
                "Something utterly random happens before you say anything.",
                "\"Seriously, let's go over this Hell thing again,\" you say."
            ],
            "content":"<div class=\"\"><div> <span>\"It's the deal of a lifetime,\" he said. \"Literally.\" <br>\r\n<br>\r\nYou probably should have walked away the second he came over to you. He was lean and hungry-looking, and despite his tailored suit, there was something off-putting about him, a vague sense of soot and sulfur. But he knew your name. He knew you were fresh out of a relationship, knew you had just been laid off from your job, he knew everything about you. And though what he was offering was impossible...you knew, somehow, that it wasn't. <br>\r\n<br>\r\n\"It's the power of a god,\" he said. \"Oh, there are limits – you can't get too flashy with it, or literally become a weapon of mass destruction. But you won't use it for anything like that. You aren't the flashy type.\" <br>\r\n<br>\r\n\"What I don't get,\" you say, \"is why me? Why are you offering this to me?\" <br>\r\n<br>\r\n\"Simple,\" he says, with a razor smile. \"My whole job is to make things worse. And with these powers, you will increase evil in the world. Maybe a lot, maybe a little, who's to say?\" <br>\r\n<br>\r\n\"But...I mean, these powers...I could be a superhero. Change my shape to anything? Change my size to anything from dust to the size of a refrigerator? Relatively immune to damage? I could, like, fight crime with these powers. Make the world a better place.\" <br>\r\n<br>\r\n\"You? No. Some people would. And you think you will. And that's cute, but you're right now thinking about how you could use this to become, like, a middle-school girl's bra.\" <br>\r\n<br>\r\n\"I am not!\" <br>\r\n<br>\r\n\"Dude, I don't care! Like I said...I'm evil. You're gonna use this to creep on women and stuff. Maybe men too. Again, I don't care. But you aren't gonna use this for good, we both know that. Now...with that said...are you gonna sign?\" <br>\r\n<br>\r\nHe hands you a glowing pen. \"You're not lying about Hell, right?\" <br>\r\n <br>\r\n\"No! There's not real Hell, not for most people, you either get reincarnated or if you're really bad, like Hitler or someone, your soul gets destroyed. You <i>can</i> move up the ranks, of course, if you're good or bad enough – and you might just find yourself working for me in a few hundred years – but that's not bad at all, no sir. Now, you gonna sign, and help make this world a worse place?\" <br>\r\n<br>\r\nYou look at the demon, and back to the form.  <br>\r\n<br>\r\n\"Come on, I don't have all day. You get power, the world gets more awful. Win-win, right?\" </span></div></div>",
            "created":1516338000,
            "id":2442810,
            "title":"Sign on the Dotted Line"
        },
        "11":{
            "author_id":"joerandom",
            "author_name":"Joe Random",
            "choices":[
                "You decide to protect your local bank from criminals!",
                "You decide to protect your fellow citizens from your local bank!",
                "You decide to protect the local college cheerleading squad! That's good, right?",
                "You decide to patrol the beaches. Like a lifeguard, only...you.",
                "You have another great idea."
            ],
            "content":"<div class=\"\"><div> <span>\"I know that look,\" the demon says. \"You think you're gonna go be a do-gooder doing good. Good luck! You'll screw it up. I chose you for a reason, after all.\" And with that, he tucks the contract in his pocket, and disappears.<br>\r\n<br>\r\nYou are going to do good, though. You mean it! Sure, that demon thought you'd just use this to spend a year as Kate Upton's vibrator...oh, that's a...no, focus! You can use this power to do good in the world! You just need to find a place where a hero is needed.</span></div></div>",
            "created":1517889840,
            "id":2449881,
            "title":"Do a Good Turn Every Day"
        },
        "12":{
            "author_id":"joerandom",
            "author_name":"Joe Random",
            "choices":[
                "You decide to perv on middle school girls.",
                "You go check out the coeds.",
                "Back to work!",
                "To the mall, good sir.",
                "You're gonna do that other thing...."
            ],
            "content":"<div class=\"\"><div> <span>Let's be honest...the demon is right. You're totally going to use this to perv on women. <br>\r\n<br>\r\nYou've always had a voyeuristic streak. You've always imagined shrinking down in the women's locker room, or what it would be like to spend a day as Emma Stone's panties. And now you can do that. Is it ethical? Hell, no, but you just signed on with a demon, you aren't the kind of guy who's going to be restrained by ethics.<br>\r\n<br>\r\nSo many old fantasies bubble up. One of them was the very first one you remember -- the one the demon mentioned, the time you imagined being Julie Smith's bra back in seventh grade. Or the one where you were gonna camp out in the women's dorm at your old college. Or the one where you were going to transform into the panty hose of that secretary at work. Or that one where you were gonna be shrunk to insect size in a changing room...or that other one....<br>\r\n<br>\r\nSo many options. You could choose any of them. Well, not Julie Smith's bra...I mean, that would be silly, she lives in Scranton. But you could probably find a kid who looked like her at the local junior high. Okay, again, so wrong...but you've given up on morals. Then again, college girls are legal, and while your old college is a couple hours away, there's a college a couple blocks from where you are now. That secretary at work is still there, of course...and there's a mall a couple of miles from here...or....<br>\r\n<br>\r\nIt takes a few minutes of dithering, but you decide that this is the perfect way to start. <br>\r\n</span></div></div>",
            "created":1516338000,
            "id":2442813,
            "title":"\"Probably,\" you say, as you sign."
        },
        "121":{
            "author_id":"ruleit1",
            "author_name":"Bird",
            "choices":[
                "Let's try being a bra and go for a ride.",
                "Let's shrink down and have some fun.",
                "A teacher finds you in the bathroom before you can do anything!"
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe that demon was right about me...\" you say to yourself, as Julie Smith's face stared back at you from your the bathroom mirror. Well, her face from seventh grade.<br>\r\n<br>\r\nYou were standing in the girl's bathroom of Liberty Middle School, currently around four and a half feet tall, dressed in a pink shirt and purple leggings, and carrying a full of school supplies. You also looked as close to your childhood crush as you could remember. It was the perfect disguise for...<br>\r\n<br>\r\nWhat exactly were you doing here? You weren't going to do anything <i>to</i> the girls here; you were a weirdo and a creep, sure, but not a monster. But, you had come all the way here and gone through the effort of sneaking in; you were going to use this power for something.<br>\r\n<br>\r\nThat original thought about being a bra floated back into your mind. It'd be pretty fun, right? And no one was getting hurt, so no skin off your back. All you had to do was sneak into the locker room and wait.<br>\r\n<br>\r\nIt would be a pretty passive way to spend the day, though. Maybe you'd shrink down instead, so you could keep <i>some</i> agency. Of course, that leaves the question of where to shrink. The locker room still seems reasonable, but it'd be pretty dangerous and you're not exactly experienced with this power. Maybe a classroom, where everyone is sitting peacefully, would be a better testing ground.<br>\r\n<br>\r\nNo rush. If what that demon said was true, you'd have all the time in the world to play around.</span></div></div>",
            "created":1519090740,
            "id":2454834,
            "title":"Just can't get over that childhood love"
        },
        "1211":{
            "author_id":"ruleit1",
            "author_name":"Bird",
            "choices":[
                "Be a bra and hitch a ride.",
                "Climb into a locker and wait.",
                "Find a hiding spot and shrink."
            ],
            "content":"<div class=\"\"><div> <span>It only takes a couple minutes to find the girl's locker room, and to your delight it's both empty of people and full of clothes.<br>\r\n<br>\r\n\"This is surreal,\" you say, admiring the world from your four foot vantage point. To think, you woke up this morning expecting a perfectly normal day.<br>\r\n<br>\r\nThe room had a faint... smell, to it. Not overpowering, but underneath the floor wax and cleaner, you caught the signs of exertion: sweat. Your mind began to wander again, pictures of sweat and effort filling your head.<br>\r\n<br>\r\n<i>Holy shit,</i> you think, <i>I'm aroused?!</i> And, true to the form you've taken, you feel a slight dampening between your legs. You've felt a vagina before, but never from this side. <i>Neat.</i><br>\r\n<br>\r\nThe clock catches your eye. Twenty 'til; probably enough time to find a suitable spot to transform. Did you still want to be a bra? You saw a strap dangling from a bench, and you were sure that you could become it easily enough.<br>\r\n<br>\r\nBut, now that you're here, now that you're breathing in this locker room air, maybe you don't want to join a girl as she's <i>leaving</i> the gym. You could shrink down, slip into a locker, and become a piece of gym clothing. It'd be a bit of a wait, but that payoff...<br>\r\n<br>\r\nAnd of course, nothing says you have to be a piece of clothing. Maybe just, shrink down and watch or something. Be a voyeur, enjoy the show.<br>\r\n<br>\r\n\"Damn it, I'm a perv.\"</span></div></div>",
            "created":1519617780,
            "id":2457766,
            "title":"Destination: Locker Room"
        },
        "12111":{
            "author_id":"joerandom",
            "author_name":"Joe Random",
            "choices":[
                "She puts you on.",
                "Distracted, she forgets to put her bra on, and slips her dress on instead."
            ],
            "content":"<div class=\"\"><div> <span><i>No, no. Stick to the plan,</i> you think. You've got as long as you want to play around with this. There will be time to become a seventh-grade volleyball player's shorts. For now, keep it simple.<br>\r\n<br>\r\nYou go over to the bra hanging from the bench. It's an A cup, but that's okay; not like you expected these girls to be wearing DDs. You do wonder a little why some girls put their clothes back in their lockers and some didn't, but you shrug -- probably an organization thing, not worth worrying about. What you do check quick is the dress laying next to the bra. It takes you a moment to adjust it based on your current stature, but it's a pretty straightforward and functional dress for a girl built a lot like you presently are.<br>\r\n<br>\r\nAll right, this will work. Now, how to do this? You could throw away the bra and just replace it, but that's kind of rude. Poor girl would lose her bra! No, you focus, and lay your hand on top of it, and imagine yourself merging into it.<br>\r\n<br>\r\nYou blink in surprise. No...you don't blink. You can't blink. You're a bra. A small, basic white bra laying next to a dress that now dwarfs you.<br>\r\n<br>\r\nIt's agonizing waiting for your owner to come back in. Will she be tall? Short? Blonde hair, or brown, or -- oh, could she be a redhead? You've always liked redheads. No matter, it's going to be awesome. When you finally hear the an echo of feminine voices approaching, you find yourself aroused all over again. This time, it's not a dampness in your legs, because you don't have them; instead, the feeling is all over and through you. This is going to be awesome.<br>\r\n<br>\r\nThe first girls pass you by, chattering away; you're below hip-height, and you have a great view of them as they begin to strip down. For a moment, you're a little disappointed -- one of them looks a lot like Julie Smith, but with a flatter chest.<br>\r\n<br>\r\nBut your disappointment lasts only a moment, as a skinny redhead walks over and looms over you.<br>\r\n<br>\r\n\"Why do you keep forgetting to put your clothes in your locker?\" calls the girl who looks like Julie.<br>\r\n<br>\r\n\"I got distracted,\" your owner says. \"And you know how Janezich is, if you get out ten seconds late....\"<br>\r\n<br>\r\n\"You're gonna get something stolen someday.\"<br>\r\n<br>\r\n\"I put my purse in my locker,\" the girl says, taking off her shirt and sportsbra. <br>\r\n<br>\r\nOh, my. She isn't a sixth-grader. Probably seventh grade, maybe eighth. Those breasts are spectacular. Small, sure, but firm and perky. You would be salivating if you weren't made of cloth.<br>\r\n<br>\r\nYour owner stuffs clothes into her locker, and pulls out her purse. She's wearing only panties, and you are quite happy that luck brought you to this girl. She puts on some deodorant, and slams the locker shut. And then she turns back to you.</span></div></div>",
            "created":1519692600,
            "id":2458168,
            "title":"Work Your Plan"
        },
        "121111":{
            "author_id":"ruleit1",
            "author_name":"Bird",
            "choices":[
                "\"...To class.\"",
                "\"...Home.\""
            ],
            "content":"<div class=\"\"><div> <span>She turns towards you, finally giving you a chance to see her face. Cute, lightly freckled, little button nose, wide smile, dull red hair shining with sweat. You tried to take it all in but in just a moment she was on you, her palms filling the sky as she reached for you.<br>\r\n<br>\r\n<i>Oh, this is something else~</i>. You're practically purring in your head; it feels like your whole body's become a big, thirsty erogenous zone. Her fingers, soft, with short-clipped nails, ran along your straps as she slung you around her shoulders. It's a massage, slow and sweet, and you only look forward to its conclusion because of what's waiting after.<br>\r\n<br>\r\nHer breasts stare down at you, small pink nipples acting as targets for your form. You know that at full size that this girl would be practically flat, but from this point of view she was a mountain of bust, and you a waiting climber.<br>\r\n<br>\r\n<i>Annd... Contact.</i> You feel it more than see it, the soft flesh filling your every nook and cranny. She clips the back together and adjusts; her chest moves in you, and you move with it, a dance that strokes your fancy, lifting your mind to higher and higher heights. You were one with her now, and as she slipped her dress over you did not lament the loss of the outside world. This girl, who's name you did not know and whose face you hardly saw, was everything. Her beating heart, her uneven breaths, her lilting voice each sent waves of pleasure ricocheting through you. And despite it all, she didn't have a clue.<br>\r\n<br>\r\nIn the back of your mind a small voice berates you, but you push it aside. No one's getting hurt, and anyway this is why that devil gave you this Power in the first place.<br>\r\n<br>\r\n\"Come on,\" she says, probably to her friend though from your vantage it was hard to tell and harder to care, \"Let's get going...\"</span></div></div>",
            "created":1519973700,
            "id":2459560,
            "title":"Put on and turn on"
        },
        "1211112":{
            "author_id":"joerandom",
            "author_name":"Joe Random",
            "choices":[
                "Stay a part of the bra.",
                "Figure out a way to merge with her panties.",
                "Become a tiny person and go exploring."
            ],
            "content":"<div class=\"\"><div> <span>You had wondered if being a bra would be too passive, and to be sure, you're not in control of your motion, but that doesn't mean that you are a passive spectator. Bras serve a purpose, and while this girl is at best a high A cup, you are too, and with each step she takes, the soft-yet-firm orbs you hold strain against you, while you hold them in place, a dance you were literally designed for. But it's so much more than that. All your senses spread through the bra -- you can pinpoint them if you want, look from a spot in the bra, but if you don't, the sense gets smeared around it. And that means that you can smell and taste and feel this young girl, the dry sweat on her young flesh, the delightful nubbins of her nipples. You are more aroused than you ever thought possible, and you've been incredibly aroused. <br>\r\n<br>\r\nThe outside world is distant to you; this girl is everything. You do catch snippets here and there -- she has homework, maybe get together later -- but you pay it little heed. You simply ride with the girl as she rides a bus, then hops off and heads home. Each step is rapturous, each breath delicious.<br>\r\n<br>\r\nAnd then, and then, just when you thought you had reached your apex, she goes up to her room to read for class, as she always does, laying face down on her bed. Not that you know she always does this. You discover it as the world tilts and the girl's breasts push hard up against you, pinning you against the fabric of her dress, which is pinned against the bed.<br>\r\n<br>\r\nShe lays like that for over an hour, reading and texting and so forth. Then she gets up, and goes about the nightly routine. You sense that there is dinner being eaten and conversations with family; you hear a mother, a father, and a sister -- older sister, maybe? You're not sure, and you're finding it very hard to pay attention. Even when your owner speaks, and her voice rumbles through you, it feels more like a force of nature than conversation.<br>\r\n<br>\r\nIt is the greatest seven hours of your life, but alas, all good things must come to an end. Your owner finally strips the dress that had covered you off, and you see her looking in the mirror briefly. She's in a bathroom, and there's water running in the shower. <br>\r\n<br>\r\nShe's a very pretty young thing, and you are disappointed as she slips her hands behind her and unclasps you, dumping you atop the dress on the floor. You feel a bit cold, and sad, but you do at least get one final great view of the girl sliding her panties off, and dropping them on top of you. She then steps into the shower to clean up before bed.<br>\r\n<br>\r\nThere is part of you that feels very much like sitting still. You realize, distantly, that by merging with the bra, you have taken on the bra as part of yourself, and that part calls to you like a siren, telling you to wait with it, just a wash and a few days of waiting, and she'll wear you again, you can wait....<br>\r\n<br>\r\nThen again, you can taste and smell the panties above you. And that gives you an idea. True, those panties are used, but if you're quick, there should be a fresh pair on the counter. You've been a bra; why not try her other underwear?<br>\r\n<br>\r\nBut the call of staying a bra is strong enough that you think maybe you should decouple, and become animate again. No, not a full-sized guy, that would creep the girl out. But if you transformed into an inch-tall person, you could explore the house, get the lay of the land.<br>\r\n<br>\r\nMuch to think about, but little time, the girl won't shower forever.</span></div></div>",
            "created":1540449180,
            "id":2568340,
            "title":"Homeward Bound"
        },
        "12111123":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "10 Y/o boys room",
                "Baby's Room",
                "Parents room"
            ],
            "content":"<div class=\"\"><div> <span>You decide that before anything else, you should get a lay of the land, so to speak. There may be prettier girls or even guys that you would want to wear you. Considering you're Bi, the guys part is equally as tempting. You shrink to about 3 inches tall and exit the room from the open door. It seems you're on the second floor of a house, and it seems there are plenty of rooms to explore. <br>\r\n<br>\r\nSince the girl's room was on the far right, there was only one direction to go. You jog to the left, while being sure to stick to the wall to avoid detection and/or being stepped on. When you reach the first door you see a room with a 10 year old boy playing on a GameCube, a rather old system, but still a good one. You pass by the room for now and peek into the room next door. There are two cribs, which you assume is for two babies, possibly twins.<br>\r\n<br>\r\nWhile you were big, the thought would never cross your mind but, with your powers any kink is possible, even being a baby's diaper. You pass by the room like before and look into the second room which appears to be the parents room, a king sized bed and different gender clothing strewn about.<br>\r\n<br>\r\nAfter surveying all the options, you decide to...<br>\r\n<br>\r\nA: Go to the 10 year olds room and do something pervy.<br>\r\nB: Go to the Baby's room and scout the area for a location to lie in wait.<br>\r\nC: Go to the parent's room and scout the area for a location to hide and possibly find something to transform into in the meantime.</span></div></div>",
            "created":1543194660,
            "id":2582115,
            "title":"Splunking"
        },
        "1213":{
            "author_id":"joerandom",
            "author_name":"Joe Random",
            "choices":[
                "Stay as Young!Julie, and mess with Old!Julie",
                "Take advantage of Old!Julie's confusion to get out of there.",
                "You know...Old!Julie is pretty hot for a teacher...."
            ],
            "content":"<div class=\"\"><div> <span>You hear the door open, and turn, expecting to see another girl your...uh...\"age.\" But instead, a rather pretty teacher, about your real age, is checking the bathrooms.<br>\r\n<br>\r\n\"Hello, do you have a hall....\" she asks, and then stops. And blinks.<br>\r\n<br>\r\n\"I don't have a hall pass, I'm sorry, I'll get back to....\"<br>\r\n<br>\r\n\"What in hell?\"<br>\r\n<br>\r\nThe woman keeps staring at you. You look back at her face, and suddenly, yours breaks into a wide grin.<br>\r\n<br>\r\nYou haven't seen Julie Smith in at least eight years, but this is her. You knew she'd gone into teaching, but you had no idea she was teaching here. What were the odds?<br>\r\n<br>\r\nWell, given that you're working with demonic powers...probably pretty good. But you don't dwell on that. Instead you think about what to do next.</span></div></div>",
            "created":1540444020,
            "id":2568306,
            "title":"Irony Can Be Pretty Ironic"
        },
        "122":{
            "author_id":"ruleit1",
            "author_name":"Bird",
            "choices":[
                "Find a door and slip under it.",
                "Find a cute girl and hitch a ride.",
                "Someone stops you before you can make up your mind."
            ],
            "content":"<div class=\"\"><div> <span>\"This is... uncanny,\" you mumbled, staring at the selfie you took of your suddenly youthful face. That demon wasn't kidding around; all you had to do was think about looking college-aged, and poof, suddenly your skin was smoother, your hair was fuller, and your body was stronger.<br>\r\n<br>\r\nAnyway, now you've got the hang of this. Turning back to normal, you jump in your car and set the navigation towards the closest place of higher education: Harmony Valley College. You could see it now; women of all builds and colors and backgrounds, in the prime of their youths...<br>\r\n<br>\r\nYou shook your head; no point in finishing before you've began, right?<br>\r\n<br>\r\nThe few blocks felt like miles, but soon enough you were pulling your car into a parking spot just beyond the campus outskirts. For a quick second you wonder if it'll be okay to just leave it there, but whatever. You won't take too long. This is just a trial run, after all; a test of The Power, nothing more. And if you end up liking it here, you can always come back by bus next time.<br>\r\n<br>\r\nNow, where too? The college, of course, but it's a big place. Do you want to head to the on campus gym, check out the sweaty babes as the work their hard bodies? Maybe just stop in a class and admire the female work ethic? No, you were here for the full co-ed experience. You needed to find a girl, hitch a ride, and be just an insignificant passenger on her daily routine. Probably. At least, that's where you're gonna start. And for that, you need to go to the dorms.<br>\r\n<br>\r\nA quick google search reveals that, for some reason, Harmony Valley still has gender-segregated dorms. On one hand, convenient, so you can guarantee your time with a lady. On the other hand, a hassle, because you wouldn't be very inconspicuous strolling into a women's dorm like this...<br>\r\n<br>\r\nRight, The Power. Focusing on your ideas of femininity, you felt yourself change. \"Jesus,\" you exclaim, feeling the weight on your chest as your new boobs dragged you down. \"Guess I went a little overboard.\" You check yourself out in the car's mirror; damn, were you smokin'. Flawless skin, hourglass figure, massive rack... Yeah, you over-tuned it. You want invisible, blending in, not \"barbie doll.\"<br>\r\n<br>\r\nOne body adjustment and a short walk later, you find yourself entering Hurlbut Hall. A funny name, but the student site said there was history behind it so who are you to judge? Standing in the hall's entrance, you are suddenly struck with a sense of confusion. Now what? You guess you could just pick a room at random and sneak in, but that seemed like leaving a lot to fate. Then again, just picking a girl because she looked good was also kinda chancy...<br>\r\n<br>\r\nWell, if today's adventure doesn't pan out perfectly, you had plenty more opportunities in the future.</span></div></div>",
            "created":1518993360,
            "id":2454296,
            "title":"The Power... to perv"
        },
        "124":{
            "author_id":"ruleit1",
            "author_name":"Bird",
            "choices":[
                "Stay on the first floor.",
                "Head up to the second.",
                "Adventure up to the third."
            ],
            "content":"<div class=\"\"><div> <span>You took in a deep breath, savoring the scent of the floor polish. Center Mall, the one stop spot for all sorts of shopping, and now, for shrinking.<br>\r\n<br>\r\nHow could you have chosen anywhere else? Your first inklings of this whole fetish were developed at a mall just like this one, when you were just a boy watching teenage girls pick out shoes at Payless. You'd nearly forgotten, but those fantasy's of getting caught up in the footsteps of passing women had helped shape what'd you'd come to enjoy. It was only fitting that you'd honor that time by testing out the new power here.<br>\r\n<br>\r\nBut, \"here\" is a big place. Center Mall was three stories of commerce gone wild, with stores catering to every niche and need. The bottom floor had the clothes and shoes belonging to the big chains; Hot Topic, Old Navy, Foot Locker, Dick's, just to name a few. The second floor was half taken up by the food court, which in turn was half local American chains and half more exotic tastes from around the world. The rest of the floor was dedicated to more diverse stores. You recall watching a cute pink haired girl leaving an anime shop, and a couple of nerdy types gathering around a game store.<br>\r\n<br>\r\nThe third floor... Well, you've never been up there. That's where the mall kept the weirder stores. The directory only gave names, like \"House of Pleasure\" and \"Dom's Palace.\" A coworker told you that there was a wide selection of sex shops up there, although you doubted a mall this big would really have a floor dedicated to just kinks. Still... could be worth a look.</span></div></div>",
            "created":1528244520,
            "id":2503405,
            "title":"Welcome to Center Mall"
        },
        "13":{
            "author_id":"joerandom",
            "author_name":"Joe Random",
            "choices":[
                "Sign.",
                "Decide to take the curse. Maybe you can earn your way into Heaven, right?"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, well, okay then,\" the demon says.<br>\r\n<br>\r\n\"Really?\"<br>\r\n<br>\r\n\"No, you nincompoop! If you don't sign, I curse you with this power. Only it won't work exactly right.\"<br>\r\n<br>\r\n\"Wait...how does....\"<br>\r\n<br>\r\nThe demon sighs. \"Oh, you'll be able to do whatever you want. It's just that sometimes, when you'd really like the power to work...it won't. And if you happen to be in a mortal form when that happens, well, then you die. And you still go nowhere. But faster.\"<br>\r\n<br>\r\n\"I don't get it,\" you say, \"why would you....\"<br>\r\n<br>\r\n\"I told you, you plus this power makes the world more evil. You can be a willing agent of evil, or an unwilling agent of evil. The first one lets you basically live as long as you want, with power aplenty. The second...might! The payoff is that it doesn't matter, you're dead in the end. So sign.\"<br>\r\n<br>\r\nYou sigh. \"You could be lying about hell.\"<br>\r\n<br>\r\n\"I'm a demon, it's always a possibility. Sign.\"<br>\r\n<br>\r\nYou....</span></div></div>",
            "created":1517806800,
            "id":2449878,
            "title":"It's a deal with the devil. Come on."
        },
        "131":{
            "author_id":"ghostdog1235",
            "author_name":"TheFriendlyReviewer",
            "choices":[
                "decide to go out and cause mischief",
                "decide to help people",
                "decide to do bad things"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright. It's pretty much bad either way.\" You sign your name on the dotted line, as it flashes red once it's signed fully. Suddenly a dark twister swarms around you, and you feel this power grow inside of you. Your eyes and body began to glow bright, before you felt your body pass out. You wake up to the sight of the demon hovering above you, talking on his phone which look like a red samsung phone. <br>\r\n<br>\r\n\"Yes, um I think I'll have the cheesy breadsticks, pepperoni pizza large. And um, yes I think I'll have your 30 piece wings and I'll be paying with credit.\" You heard the demon say. \"The number? 5578-\" You sit up straight at the sound of your credit card number being used.<br>\r\n<br>\r\n\"Hey!!\" You shout startling the demon.<br>\r\n<br>\r\n\"I'll call you back.\" The demon hangs up annoyed. \"You fell asleep bro, and you ran out of good food after a few hours.\"<br>\r\n<br>\r\n\"A few hour- how long was I out?!\" You questioned shocked by this information.<br>\r\n<br>\r\n\"About nine hours, Dominos was almost closed and I had to get delivery somehow.\" The demon remarked. \"You act like this is the first time gaining a demonic power.\"<br>\r\n<br>\r\n\"It is.\"<br>\r\n<br>\r\n\"Well since you're up, I'll just go.\" The demon was about to leave.<br>\r\n<br>\r\n\"Wait, could you give me an audience as I use this power?\" You asked curiously, as the demon smirked with a nod. <br>\r\n<br>\r\n\"Alright kid dazzle me.\" The demon states happily, as you soon began to showcase your new power. You soon began to glow bright as your body began to shift and contort to the form you were thinking of. When the light faded, you were now a fine bodied woman with light lavender hair done into a ponytail. You had amber eyes that matched your crimson red long earrings, with a gold necklace to complete the ensemble. You were wearing a purple tube top, along with purple bellbottom pants to match. <br>\r\n<br>\r\n\"Damn kid, your hot!\" The demon smirked. <br>\r\n<br>\r\n\"That's princess to you Mr. Demon.\" You smile playfully, as he examines your body.<br>\r\n<br>\r\n\"My apologies your royalness.\" The demon smirked and looked at the necklace. \"Hey maybe you can use this power for good~\" A hint of sarcasm was in his voice as he was transfixed on the necklace. You then smirked playfully swatted his hand away, going 'ah-ah-ah'. You smirk and then spin around, soon being surrounded by another flash of light and turning into a princess. You had long raven black hair, light blue eyes with matching snowflake earrings, and lovely moon necklace with a snowflake in the center. Wearing and completing the outfit with a lovely blue snow gown with snowman and snowflake designs on the rim of it.<br>\r\n<br>\r\n\"I do like this dress, say um are my clothes apart of me because I shapeshift?\" You ask curiously.<br>\r\n<br>\r\n\"What? Nah. Your clothes are self generated. They turn your normal clothes into this.\" The demon answers.<br>\r\n<br>\r\nYou smile a bit and then</span></div></div>",
            "created":1523339040,
            "id":2477645,
            "title":"Sign."
        },
        "132":{
            "author_id":"ruleit1",
            "author_name":"Bird",
            "choices":[
                "You become Ana-Marie's panties",
                "You become something else on Ana-Marie",
                "You become something else in the shop"
            ],
            "content":"<div class=\"\"><div> <span>\"I can't do it,\" you say, handing the pen back. \"I'm just not comfortable making a literal deal with the devil, you understand.\"<br>\r\n<br>\r\nHe was scowling, his eyes alive with fire. \"Oh, I understand all right. You're greedy and selfish, and you think you can just bullshit your way into eternal bliss by rejecting who you are.\"<br>\r\n<br>\r\n\"That's harsh.\"<br>\r\n<br>\r\n\"Have a wonderful, short, life,\" the demon says, and in a flash you find yourself in your bed, curtains draw, alarm blaring.<br>\r\n<br>\r\n<i>Weirdest fuckin dream of my life,</i> you thought, wiping the sleep from your eyes, trying your best to ignore the faint scent of brimstone that lingered in the air.<br>\r\n<br>\r\n<br>\r\nTwo weeks go by without any incidence, and you successfully push the encounter out of your mind. And then one otherwise normal workday, you're called into the boss's office.<br>\r\n<br>\r\n\"I'm what?\" you gasp, blindsided by this news.<br>\r\n<br>\r\n\"Fired. And you should be lucky that's all we're doing. Do you know how many reports HR gets about you?\" The boss flips her computer around, revealing a hefty list of complaints, all directed towards you. \"Not only do you not get any work done, you spend all your time ogling you coworkers - men and women alike!\"<br>\r\n<br>\r\n\"I- Let me see that!\" you say, and grab computer. You hated to admit it, but these reports were all really, dreadfully accurate. Brenda caught you drooling over rear, Thomas complained about you feeling up his biceps, and Lydia protested your theft of her work shoes. Damn, were you really this obvious?<br>\r\n<br>\r\nThe boss flips the screen back around to her, frowning. \"You understand why we have to let you go now, right? And, don't think you're getting any sort of severance, either. You've lost the right to that.\" You open your mouth to complain, but she shuts you off. \"Or, would you rather we let these cases go public? Any judge in the country will get you registered as a sex offender just by glancing at these reports.\"<br>\r\n<br>\r\nYou slump in your chair. \"Can I at least have a box to gather my things?\"<br>\r\n<br>\r\n<br>\r\nAn hour later, you were parked at a small coffee shop a few blocks down, nursing an ice tea and trying to gather your thoughts. Where would you go from here? You'd never get a reference from your old place, your marketable skills had long since gone rusty, and you didn't exactly have enough money to live the rest of your life on.<br>\r\n<br>\r\nMoping, you stare out into the shop. The waitresses here were your favorite part of this place. It was run by a young lady, fresh out of college with a business degree, and she wasn't shy about only hiring her friends. And as luck would have it, she had some smoking friends.<br>\r\n<br>\r\n\"Ana-Marie,\" you mumbled, staring at the name tag of the bright looking girl who was helping a table across the room. She bent down to hand the group their drinks, giving you a fine look at her rear assets. Her short skirt didn't hide <i>anything.</i> You felt warm...<br>\r\n<br>\r\nOddly warm. Was there something wrong with this tea? Your heart begins to beat faster, but despite the panic rising in your throat you find yourself unable to avert your eyes, forced to watch Ana-Marie's fine ass bounce as she stood back up, her cheeks wiggling as she began to walk away. Your insides twisted, and suddenly you caught a massive whiff of brimstone.<br>\r\n<br>\r\nThe encounter rushed back to you, as everything went dark.</span></div></div>",
            "created":1518996000,
            "id":2454316,
            "title":"Rejection"
        },
        "1321":{
            "author_id":"joerandom",
            "author_name":"Joe Random",
            "choices":[
                "Ana-Marie is off to a date with her boyfriend",
                "Ana-Marie is going on a first date with a girl from school",
                "Ana-Marie is going home. After that, who knows?"
            ],
            "content":"<div class=\"\"><div> <span>The first thing you are aware of is the smell. A wonderful smell, musky and womanly, heavenly. Then you gain taste, and this is much like the smell, salty, umami. Touch activates next, and it is...weird. You are dimly aware that you aren't <i>you</i>, but something else. But while you are aware of that, you are also aware that what you feel is so good that you don't care. Soft skin, a thin patch of hair, two firm-soft pillows...no, not pillows. <br>\r\n<br>\r\nSight and sound come back last, at the same time, and you struggle to figure out what it is you are seeing. You realize that you can look around, but it's not like you can turn your head -- you can see all around you, inside and out, like you're moving your eyes around. Looking one direction, you see long, slender legs, ending in simple, practical tennis shoes. You feel like they're familiar. Look up a little more, and there's a dark horizon eclipsing the world around you. And if you move your eyes inside....<br>\r\n<br>\r\nOh, god. It's a pussy. Neatly trimmed hair crowning it. And there...that's an ass. A glorious one that you can study up close. <br>\r\n<br>\r\n\"All right, that's my last table,\" a voice drifts down from above, and you realize it shakes the pussy and ass and you just a bit. <br>\r\n<br>\r\n\"Thanks, Ana-Marie,\" a voice replies. \"Any plans tonight?\"<br>\r\n<br>\r\nThe voice chuckles. \"You know what plans I have tonight.\"<br>\r\n<br>\r\nThe other voice laughs. \"I figured. Good luck.\"<br>\r\n<br>\r\nOh my God, you're Ana-Marie's panties.<br>\r\n<br>\r\nWait.<br>\r\n<br>\r\nThinking back on an odd dream from a couple weeks ago....<br>\r\n<br>\r\nGod probably doesn't have anything to do with this.<br>\r\n<br>\r\nAna-Marie walks outside, and you find yourself unconcerned with the theology. You can feel her perfect buns shift and bounce as she takes each step. If you look, you can watch her pussy slightly move, opening and closing ever-so-slightly depending on her motion. You don't know why this happened, but for the moment, you aren't questioning it.<br>\r\n<br>\r\nThe only concern you have is what Ana-Marie's plans are, but if you get to hang out as her panties, you're willing to chance it.</span></div></div>",
            "created":1540709520,
            "id":2569629,
            "title":"The Impossible Dream"
        },
        "14":{
            "author_id":"ruleit1",
            "author_name":"Bird",
            "choices":[
                "She will punish you herself.",
                "She shrinks you down and leaves you somewhere.",
                "She transforms you into a helpless insect.",
                "She turns you into an abused object.",
                "She has a more fitting punishment in mind."
            ],
            "content":"<div class=\"\"><div> <span>The pen feels heavy in your grip. You were literally signing a deal with the devil, and you're pretty sure Sunday school classes taught you that this kinda thing was a no-go. Of course, those lessons always felt more allegorical than this...<br>\r\n<br>\r\n\"He's lying to you.\"<br>\r\n<br>\r\nYou look up, and see a tall woman in flowing white robes. She smiles, a radiant smile that complements her perfect, flawless face, he grin doubling when the demon turns and sees her.<br>\r\n<br>\r\n\"I am not lying. Everything I've said so far has been truthful.\" The words are directed towards you, but his eyes, and his grimace, never leave the woman.<br>\r\n<br>\r\nShe spreads her arms, her piercing blue eyes locked onto yours. \"A lie by omission is still a lie in the eyes of our Lord.\"<br>\r\n<br>\r\n<i>Oh shoot, does she mean capital-G god?</i> The idea of the divine creator of all being tied into this whole affair hadn't even occurred to you, despite the literal demon from hell. You look towards the devil, who was now looking sheepishly at you. \"W-what does she mean by that?\"<br>\r\n<br>\r\n\"There's no hell, I wasn't lying.\"<br>\r\n<br>\r\n\"But, but there's something else?\" This was all starting to get out of control. <br>\r\n<br>\r\nThe woman, still smiling that glowing grin of hers, speaks up. \"Sins do not go unpunished, and unclean souls do not taint the domain of our Lord.\"<br>\r\n<br>\r\n\"...What?\"<br>\r\n<br>\r\n\"Purgatory,\" the devil says, sighing. \"You people got a bit confused there for a while, and while eternal torment isn't a thing, Purgatory is. You sin in life, then if you want to go through the pearly gates you've gotta let your soul be cleansed. And it's not a pleasant sort of cleaning, more steel wool than wash cloth, if you get what I mean.\"<br>\r\n<br>\r\n\"So... if I had signed that contract...\"<br>\r\n<br>\r\n\"Nothing would have happened! Listen, I already told you, I hadn't lied. It's just...\" He pauses, then looks towards the woman. \"Well, I suppose the angel can explain it best.\"<br>\r\n<br>\r\n<i>Angel?</i> you think, realizing just what you've been talking to.<br>\r\n<br>\r\n\"The kingdom of our Lord is pure and unblemished. If one's soul is to continue on, it cannot be allowed to stain the sanctity of His divinity.\"<br>\r\n<br>\r\nThe devil slapped his forehead. \"She means you can't go to the afterlife with too many sins.\" You open your mouth to ask a question, but he cuts you off. \"And, that means no reincarnation without going through Purgatory, because-\"<br>\r\n<br>\r\n\"Because all souls, cursed or blessed as they may be, must first pass through Heaven.\"<br>\r\n<br>\r\n\"Unless!\" He says, stepping in front of the angel, \"Unless you take me up on my offer to work for me. In fact,\" he says, grabbing the contract and very quickly changing some lines, \"I'll sweeten the pot. Look, see, if you sign here then the moment you die you'll start work for me. No Purgatory, no punishments, no reincarnation, just a rewarding job you can really enjoy.\" He's smiling now, but the expression looks strained and his eyes don't smile with him.<br>\r\n<br>\r\nStill, it's a tempting offer. \"Is what he said all true?\"<br>\r\n<br>\r\nThe angel's smile dims, but does not go out. \"His words are honeyed but honest. I must advise against such actions, however. Heaven's realms turn their backs to those who do the same.\"<br>\r\n<br>\r\n<i>What is she on about?</i> Shaking your head, you look down at the contract. It offers such power... and a ticket out of an afterlife of punishment? \"Okay,\" you say, clenching your eyes. \"I've decided.\" Looking at first the angel, then at the devil, you sigh. \"Give me the pen. I'll do it.\"<br>\r\n<br>\r\nThe demon shouts with glee. \"Ha! It's a good deal for both of us, isn't it. In your face, lady!\"<br>\r\n<br>\r\nShe's not smiling, however. Her face suddenly looks a whole lot fiercer. \"This choice of yours was a mistake you will regret.\" Her eyes fade to pure white, her body sprouting wings of pure light. You fall to the ground, cowering.<br>\r\n<br>\r\n\"W-w-what's happening? What are you-\" You're cut off as a pillar of light slams down from above. You scream, agony coursing through you as your flesh melts from your bones, and in an instant, you die.<br>\r\n<br>\r\n\"Oh, come on! I earned that soul, damn it, and you know that.\" The devil pouted, holding the unsigned clipboard in his hands. The angel, smiling once more, patted his shoulder.<br>\r\n<br>\r\n\"Take solace in knowing that he will not enjoy what's to come.\"<br>\r\n<br>\r\n\"... What are you going to do to him?\"<br>\r\n<br>\r\nShe turns, and vanishes, her last words drifting on the empty wind, lingering long after she was gone.<br>\r\n<br>\r\n\"A punishment to fit the crime.\"</span></div></div>",
            "created":1524798480,
            "id":2484771,
            "title":"Divine Justice"
        },
        "144":{
            "author_id":"luisfer2427",
            "author_name":"Luisfer",
            "choices":[
                "Sex Shop",
                "Clothing Shop",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I warned you about this and you didn't care. Your soul is full of sin but since I ended your life I'll make this easy on you.\" She said with your soul in her hand and searched for a new 'body' for your punishment.<br>\r\n<br>\r\nThe only thing you could do was hear her voice, this wasn't fair. You were just walking on the street earlier, then you met a devil that offered you amazing powers, and now you are just a small ball? on an angel's hand.<br>\r\n<br>\r\n\"I'll grant your wish, since you wanted really badly to be an object, that's exactly what you are going to be\" She said to you went to a _________ looking for something to introduce your soul</span></div></div>",
            "created":1595279820,
            "id":2872220,
            "title":"She turns you into an abused object."
        }
    },
    "info":{
        "author_id":"joerandom",
        "author_name":"Joe Random",
        "brief_description":"A demon grants you the power to shrink and transform, because you suck.",
        "created":1516408860,
        "description":"<td align=\"left\" class=\"norm\">A demon gives you a chance at a miraculous power -- the ability to shrink and transform at will, all while remaining impervious to harm. Why would he give it to you? Well...because he figures you're going to use it to perv on women and maybe men and generally act like a schmuck, thus increasing the amount of evil in the world.<br>\r\n<br>\r\nBut you're not going to do that, are you?<br>\r\n<br>\r\nAre you?<br>\r\n<br>\r\n<i>Rules</i><br>\r\n<br>\r\n1. You can get as small as dust (about 1/64th inch) and as large as a refrigerator (about 7 feet). <br>\r\n<br>\r\n2. You can transform into anything, animate or inanimate.<br>\r\n<br>\r\n3. You can't do something foolish, like transform into antimatter or a nuclear bomb. That's not cool.<br>\r\n<br>\r\n4. If you start making too big a name for yourself, you might draw the notice of the non-demon folks...and they won't be happy with you.<br>\r\n<br>\r\nOther than that, literally anything you want to do is okay, because a demon granted these powers, and demons don't have morals.</td>",
        "id":2146472,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595279820,
        "modified":1595279820,
        "pretty_title":"The Power"
    }
}