{
    "chapters":{
        "1":{
            "author_id":"thatpersonhere",
            "author_name":"ThatHiddenPerson",
            "choices":[
                "Male!",
                "Female!"
            ],
            "content":"<div class=\"\"><div> <span>           You have always been a cat person. You have always begged your mother for one and she never had the time to go out and get one for you. That made you sad, but you never gave up on getting one. When you were 17, and had enough money to go out and get one of the kittens at the nearby pet store, you went. You would not have passed up a chance like that. While you were in the pet store, you found a wide variety of the snugly creatures, which made your eyes sparkle with joy. The only problem was, you could only have 1 of these magnificent pets.<br>\r\n<br>\r\n           As you browsed the different kittens at the pet store, you found one that you really like, and brought it to the store clerk. As you exchanged a few words and paid for the kitten, the store clerk said something unusual underneath his breath. \"Picked a rare one there.\" You had no idea what he meant, but you continued on your way home and never thought about it twice. Now, you're 19 years old and some strange things have been happening around your apartment, of late. You, being you, searched for the cause of these occurrences.<br>\r\nBefore we continue, would you mind telling me one thing? Are you male or female?</span></div></div>",
            "created":1313780940,
            "id":1171316,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"thatpersonhere",
            "author_name":"ThatHiddenPerson",
            "choices":[
                "A light blue one?",
                "A black one?",
                "A white one?",
                "A pink one?",
                "A purple one?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you're male. Now, answer another question. What kitten did you pick?</span></div></span></div>",
            "created":1313785680,
            "id":1171353,
            "title":"Male!"
        },
        "111":{
            "author_id":"thatpersonhere",
            "author_name":"ThatHiddenPerson",
            "content":"<div class=\"\"><div> <span>          It was another one of those days. You were in your apartment when you hear another strange noise. The noise of another person walking around, and clumsily walking into things. You hope that it's not a burglar trying to steal your things.<br>\r\n<br>\r\n          You found the room that the noise was coming from, and when you opened the door, you saw your light blue Cat. She was sitting on the bed, looking at you with her ocean blue eyes. You sigh before saying, \"It's only you again.\" You close the door before going on with your daily routine.<br>\r\n<br>\r\n          You filled your cat's bowl up once more and left your apartment, off to your new job.<br>\r\n<br>\r\n          This job was offered to you a while ago, back when you were 17, the time when you got you kitten. You got the job to save money up for college, but you took a bit of the money you made to pay for your adorable, obedient kitten. Amazingly, you didn't have to quit your job due to going to college, mainly because you decided to go to a nearby school. It was a lot less tedious, and cheaper, to go to a nearby school, rather than moving somewhere else. Your job, a store clerk at a nearby clothing store named Thallinars, kept a good bit of money coming in for you. As you have worked there for two years now, you make more than the minimum wage, which <i>really</i> will help you with your student loans later on. Another good part, which you think is actually the best part, is that you work with a female co-worker, who you went to high school with and currently go to the same college as. Her name is Ashley Crumm, and she is one of the most beautiful, yet anti-social, people you have ever met. You've had a crush on her since day one, but you never knew how to confess, and Fate seems to be pointing and laughing at you, as it's teasing you with keeping her near. Either that, or it's giving you a chance.<br>\r\n<br>\r\n          While you were running over your past with her, which wasn't much, since she mostly avoided you, you nearly walked right into a couple walking on the sidewalk. The man went off on you about watching where you walk, but you didn't pay any mind to that. You had a job to do, and you somehow nearly ran into them in front of you workplace. The black scripted letters, each letter elegantly flowing into the next, were protruding out of the dark blue background, which was cut into the building. You ignored the sign as you walked in through the double door and went off to sign in for the day.<br>\r\n <br>\r\n          Thallinars had gotten famous for its quality goods, but it doesn't market its goods other than through its customers, so there aren't really that many people around most of the time. Besides that, the small shop still made great profit off of what customers actually came here. The inside was like many other famous clothing places you see. Plentiful of clothing hung up on racks around the place, with those scattered spots where there would be folded clothing on the counter-like areas. Although, it was different through the way that the inside was designed in a circular fashion, so there was a large support beam, painted white, in the center of the shop, with clothing placed in even segments circling this beam. The cashier, which is where you work for the day, is located right in front of the doors, right up against the beam. As you looked up, since you held your head down in thought, you saw the figure of your co-worker Ashley standing inside the cashier booth. He smiled on the inside, delighted at being able to work with her. Her long, luscious, dark brown hair cascaded over her shoulders and swayed ever so slightly with each of her movements. Her light green eyes enchanted your vision every time you saw them, and her lips were coated with a barely noticeable pink glossing she wore everyday. She was wearing the uniform of Thallinars, as expected, which was a simple dark blue t-shirt with the name of the place scripted on the left side of the chest area and simple, plain black pants to accompany it.<br>\r\n<br>\r\n-To be continued.-</span></div></div>",
            "created":1313787720,
            "id":1171367,
            "title":"A light blue one?"
        },
        "112":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "boy kitten ",
                "girl kitten ",
                "futa kitten "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was it a boy or girl kitten </span></div></span></div>",
            "created":1422598440,
            "id":1925434,
            "title":"A black one?"
        },
        "1121":{
            "author_id":"oliverking",
            "author_name":"Noire",
            "choices":[
                "Your cat looking down at you",
                "The man looking down at you",
                "That it's night & your late for work"
            ],
            "content":"<div class=\"\"><div> <span>You were walking home from your classes, your 19 and in your first term of the college year and living partially home alone. Your mother had raised you alone and had to travel so much for work she was hardly ever home.<br>\r\nThat's part of the reason you were so happy to be finally aloud to get a pet (it being a cat was a bonus)<br>\r\n<br>\r\nYou arrived at the door dropping the bag of convince store bought supplys at your feet as you unlocked the door still groggy from your night of craming in last minute study before an exam. <br>\r\nYou were so sleep deprived because of it ended up going home early, thinking it'd be worse if you ended up sleeping through your part time job rather then your classes.<br>\r\n<br>\r\nAs you walked in the door, before you could even close it you heard foot steps upstairs.<br>\r\nYour body tensed up. <br>\r\nNo one was ment to be home, what the heck are you supposed to do?!<br>\r\nYou panic looking for something- ANYTHING to defend your self with. <br>\r\n<br>\r\nYour arc the door closed.<br>\r\nIf you have to be attacked there's no reason Carlo should get out because of it.<br>\r\nYou slink up stairs with your newly weaponised umbrella at the ready you crept up the stairs.<br>\r\nThe only door open was your bedrooms.<br>\r\nAfter working up the confidence you charged in<br>\r\n\"HAAAAAAAA!- huh?\" The room is a mess (more so then usual) snacks were everywhere spilled all over the floor.<br>\r\n\"mmmmmmmh, why are you being so loud?\"<br>\r\nYou turn to see a pale skinned man spread out over your bed, his hair was jet black and shaved around the sides bare a long fringe swept to the side of his long, tired and honestly handsome face as he sat up. Even on top of the bed sat up he was taller then you (not that you had much in way of hight).<br>\r\nUsually in a situation like this the most shocking thing would be the pair of pointed black cat ears pointing from his head, or the slinky long tail curling out from his waist, or even the long sharp looking finger nails painted black. <br>\r\nBut no.<br>\r\nIt was the fact that besides the red collar around his neck,<br>\r\nHe was completely nude!<br>\r\n<br>\r\n\"Awwwww, why're you home so early?\"<br>\r\n\"........?!\"<br>\r\n\"I usually get more time to stre-tch, but I guess that now the cat is?-\"<br>\r\n\"........?\"<br>\r\n\"-Out of the bag?\" <br>\r\n\"......\"<br>\r\n<br>\r\nYou don't remember everything that happened after that, it all just went dark<br>\r\n<br>\r\nYou wake up and find-</span></div></div>",
            "created":1584218880,
            "id":2801444,
            "title":"Black male kitten "
        },
        "113":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "boy kitten ",
                "girl kitten ",
                "futa kitten "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the kitten was it a boy. girl, or futa</span></div></span></div>",
            "created":1422598500,
            "id":1925435,
            "title":"A white one?"
        },
        "114":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "boy kitten ",
                "girl kitten ",
                "futa kitten "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>whats your kittens gender </span></div></span></div>",
            "created":1422598620,
            "id":1925436,
            "title":"A pink one?"
        },
        "115":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "boy kitten ",
                "girl kitten ",
                "futa kitten "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>whats your kittens gender </span></div></span></div>",
            "created":1422598680,
            "id":1925437,
            "title":"A purple one?"
        },
        "1153":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "An alien.",
                "A genetic experiment gone wrong.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was an unusual cat you had gotten, to say the least. Not only was the cat purple in fur color, but also a futanari! Something was off about this cat... And there was a reason for that! Unknown to you, this cat was...</span></div></span></div>",
            "created":1511095260,
            "id":2417059,
            "title":"An abnormal cat."
        },
        "11532":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "See the origin story.",
                "Stick with the kitten."
            ],
            "content":"<div class=\"\"><div> <span>Unbeknownst to you, the Neko kitten you had gotten was the byproduct of a genetic experiment gone wrong. It would explain the purple fur, and the Futa qualities. There's quite an origin story to go with this, but it's unimportant... Unless you'd like to hear it.</span></div></div>",
            "created":1517760240,
            "id":2449271,
            "title":"A writer's convenience."
        },
        "12":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "American.",
                "African.",
                "Native American.",
                "Japanese.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, what's your look?</span></div></span></div>",
            "created":1497543660,
            "id":2336479,
            "title":"The lady's story."
        },
        "125":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Chinese.",
                "Russian.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of person are you?</span></div></span></div>",
            "created":1504442400,
            "id":2379363,
            "title":"Neko owner's look- what is it?"
        }
    },
    "info":{
        "author_id":"thatpersonhere",
        "author_name":"ThatHiddenPerson",
        "brief_description":"What would you do, with your own Neko?",
        "created":1313779800,
        "description":"<td align=\"left\" class=\"norm\">This story is about YOU. You have always been a cat person and got one when you were 17. Now, there have been unusual things going on, ever since you moved away when you turned 19, meaning that your cat is 2 years old.<br>\r\nYou, being a curious person, like cats, searched for the source of these unusual things. Read on... to find out more.<br>\r\n<br>\r\nI'm going to make this a Diversified Story, meaning that you won't only have to be one gender. I'm going to make a female character aswell!! Of course, you get to pick your own cuddly kitten, who'll then become your neko! For the people that are going to add, I have a few rules that I'd like you to follow. If you don't your add might get deleted, unless I like it, then I'll only revise and then edit it.<br>\r\n<br>\r\nRules:<br>\r\n1. You must add atleast 1 paragraph for a good add. The only adds that don't have to be 1 paragraph, are the selecting chapters. Which I'll write myself, and others will write if they get to a chapter like that.<br>\r\n2. Please have good grammar. An example of that, is the way that I've been writing so far. I'd like this so that the readers can understand what they're reading.<br>\r\n3. 1 paragraph for me is ATLEAST 8 good sentences.<br>\r\n4. No changing a gender throughout the story arc.<br>\r\n5. Have fun while writing!</td>",
        "id":1803430,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584218880,
        "modified":1584218880,
        "pretty_title":"Your own Neko"
    }
}