{
    "chapters":{
        "1":{
            "author_id":"isle101",
            "author_name":"Isle",
            "choices":[
                "explore Danny's Birkenstocks",
                "explore Danny's well worn flip flops"
            ],
            "content":"<div class=\"\"><div> <span>You, Kevin, are a toned good looking kid.  Your roommate Danny is a rugged preppy athlete, and you have always kind of had a crush on him  You one day are cleaning under your bed when a poof of dust hits you in the face.  You black out and when you wake up everything is huge.  The world around you has grown astronomically.  You look out in the huge expanse under the bed and see something that catched your eye.  You see a pair of massive leather Birkenstocks as well as an endless pair of well worn flip flops.  You have always had a bit a foot fetish and Danny's smelly sized 14 feet always caught your eye.  You decide to ...</span></div></div>",
            "created":1179982800,
            "id":410476,
            "title":"Unexpected Shrinking"
        },
        "11":{
            "author_id":"sockerslave",
            "author_name":"sockerslave",
            "choices":[
                "Danny, your roomie, returning from a workout.",
                "Jared, your roommates best friend, a 6'5 soccerplayer.",
                "Rudy, your neighbor down the hall, who came to borrow some soap for the showers."
            ],
            "content":"<div class=\"\"><div> <span>You slowly creep out from under the bed and approach the now truck sized birks.  There is a slight musky odor coming from them that you had never noticed at your full size before.  You pull yourself up onto them and lose your footing on the slight slope down to where there are darkened toe prints from your roommate's huge feet. <br>\r\n<br>\r\nYou are in heaven.  You sit down... realizing that you are sitting in the imprint left by just one of Danny's toes.  It makes you instantly turned on.  When suddenly, you hear the knob turn on your dorm door.  You look up to see....</span></div></div>",
            "created":1181624400,
            "id":415825,
            "title":"Leave no footprints"
        },
        "111":{
            "author_id":"isle101",
            "author_name":"Isle",
            "choices":[
                "Stay where you are in between Danny's toes",
                "Climb Danny's foot and try to get his attention"
            ],
            "content":"<div class=\"\"><div> <span>You here the key in the lock and the see the doorknob turn.  There in the doorway walks in your absolutely breath taking roommate, Danny.  You stare at the sweaty muscular Adonis as he trudges across the room.  His chest and back are soaked with sweat.  You are in awe at how huge his sneakered feet are and you could smell them from here, afterall he did just come back from an intense workout.  <br>\r\n<br>\r\nDanny plops into his computer chair and kicks off his sneakers and peels off his sweaty socks.  His putrid footware is thrown just out of reach of his Birkenstock sandals.  You can still smell the leathery sweat of his feet all in the air.  As much as you are enjoying it, you decide to get off of your roomie's footware for obvious reasons.  You didn't want to become a smudge on Danny's huge soles!<br>\r\n<br>\r\nAll of a sudden Danny gets an IM from his friend James who lives upstairs asking him to hang out.<br>\r\n<br>\r\nWithout showering and a second thought Danny complies and stomps over to the bed.<br>\r\n<br>\r\nYou are walking to the edge of Danny's sandal when the ground begins to shake.  You look behind you and see almost in slow motion as your roommate's feet bare down on you.  You start sprinting to the edge of the sandal.  You trip face first into the sweaty toe section.  Kevin has not time to react.  Within a second, Danny's size 14 foot is sliding into the Birkenstock sandal.  All Kevin can do is watch as Danny's bulbous toes surround him.  Luckily for you, his toes do not crush you.  Instead you are snuggled in between his big toe and the next.  The smell is unbelieveable.  You really never thought a man's foot could reek so horribly.  You stand up and watch the building sized toes wiggle around to get comfortable.  You can see all the details of his foot like the ridges going all over his toes, the hairs on top of each toe, and some dirt under his nails that he may not even notice. You cannot believe after fantasizing about your roommate's feet for so long that you are really standing in between his toes in his sandal.  You decide it would be best to ...</span></div></div>",
            "created":1183611600,
            "id":423065,
            "title":"Up Close and Personal"
        },
        "1111":{
            "author_id":"koplio000",
            "author_name":"koplio000",
            "choices":[
                "\"Holy shit James, I think my roommate is on your leg!\"",
                "\"Ewww, there's a bug on your leg.\"",
                "\"Let's take this to the bedroom, James, I want to fuck you.\""
            ],
            "content":"<div class=\"\"><div> <span>You decide it would be best to stay where you are in between Danny's toes. You would just wait until he got to James' room and then you could figure out your situation. Until then, you would just enjoy your situation as best as you could. <br>\r\n<br>\r\nYour fantasies about Danny's feet are extensive to say the least. Every time Danny was out of the room, showering after a tough workout, you would take the pleasure of smelling his shoes and jacking off. His scent was intoxicating, and you hoped in the back of your mind that he was gay so he would fuck you, or at least let you worship his feet. <br>\r\n<br>\r\nNow, at the size you are, you can worship Danny's entire muscular body without him knowing. You can be his unaware servant-boy, licking and massaging his body as he sleeps, living in his shoes and maybe in his bubble butt. The possibilities are endless for you. Maybe Danny would worry about where you are since you kind of just disappeared, but honestly, he was a pretty independent guy and would probably just think you took a trip somewhere or something. <br>\r\n<br>\r\nFrom your place on Danny's smelly shoe, you can't really see beyond his toes, but whenever Danny lifts his foot to take a step, you can see his face for a moment. He has the most beautiful features, and you wished that you could make out with him, but at the moment, you probably could only be in his mouth like a piece of food.<br>\r\n<br>\r\nYou'd really like that, though. You would love to just be digested by his huge, strong, muscular body and become a part of his godly figure.<br>\r\n<br>\r\nYour sexual fantasies have distracted you for a bit, but you return to reality when you see that Danny is knocking on James' door. You didn't know James very well, but you always thought he was super attractive. He had dark hair, a tan complexion, and was bulky, but ripped. Unlike Danny, who was perfectly toned but lean, James looked like the stereotypical meathead bodybuilder. He was also much taller than what you used to be and Danny. Danny stood at about 5'7\", and James was about 6'6\".<br>\r\n<br>\r\nDanny always seemed a bit self conscious about his height, but you were always shorter, standing at about 4'11\" at your normal height. Danny didn't let you forget that he was taller than you, which made sense because he wasn't able to hold his height over many other people. <br>\r\n<br>\r\nJames opens the door to his room and lets Danny in. You look up ahead of you and see James' massive ass held in by a pair of black gym shorts. James was shirtless, and seemed to have just gotten back from some sort of exercise. James was a big sports player; he was probably getting back from basketball or something. <br>\r\n<br>\r\nJames and Danny start to talk, and their voices rumble through you. <br>\r\n<br>\r\n\"Hey Danny, it's good to see you, as usual,\" James says while giving a smirk.<br>\r\n<br>\r\n\"Yeah, I've missed you buddy.\" Danny's reply confuses you. You know Danny and James are good friends, but Danny has never seemed like the kind of guy that would miss another guy.<br>\r\n<br>\r\nDanny takes off his birkenstocks, leaving you in the shoe while he walks to the couch where James is. You're covered in sticky sweat and Danny's musk, but you have no time to enjoy the smell; you start to make your way to the couch. <br>\r\n<br>\r\nAlthough it would only be about 5 feet away at your normal height, right now, the couch seemed to be infinitely far away. Danny and James' figures were clear in the distance, though, and you knew you had to make it to them. <br>\r\n<br>\r\nYou pick out markers in front of you as checkpoint on your way to the couch. Luckily there is tile on the ground, else you'd probably sink into a rug. About halfway to the couch, you look up and see something that gives you even more of an erection than you already had. Danny and James were hooking up! You had never been so aroused and confused in your life. Cum spurts out of your dick and you feel weak from the sexual pleasure you're getting. <br>\r\n<br>\r\nDanny is on top of James and making out with him while rubbing his body against James. You had no idea that Danny was gay and you wished that you had done something while you were normal-sized. Danny never brought home any girls, despite his cocky demeanor, but you just thought he fucked them somewhere else. Now, he is on top of an equally attractive muscle giant.<br>\r\n<br>\r\n\"Danny, I want you to fuck me,\" James cries out with a voice that knew how it feels to take Danny's manhood.<br>\r\n<br>\r\n\"Yeah, you want that, you dirty dick-slut?\" Danny replies in the sexiest voice you've heard in your life. You come again and begin to run to them before they make their way to the bedroom. You are almost to the couch and see that you can climb James' feet up to them. <br>\r\n<br>\r\nWhen you get to his feet, it seems like they are going to stay on the couch, at least for a little bit. Danny is rubbing his dick up and down James' body, and James is loving every bit of it. You look up and saw Danny's naked bubble butt. You hope that soon enough I would be inside of there. <br>\r\n<br>\r\nYou begin to climb up James' foot and leg, which is much easier than expected, probably due to your low mass. You make it up to James' enormous thigh and catch your breath for a second. You look up and see Danny straddling James with his dick in James' mouth. You don't know what to do to get their attention, so you begin to jump up and down. It seems that you may have gotten Danny's attention, because he looks in your general area.<br>\r\n<br>\r\nDanny says...</span></div></div>",
            "created":1471358100,
            "id":2196692,
            "title":"Stay where you are in between Danny's toes"
        },
        "11111":{
            "author_id":"koplio000",
            "author_name":"koplio000",
            "choices":[
                "\"Hey James, do you know what would be hot?\"",
                "\"Are you hungry, James?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Holy shit James, I think my roommate is on your leg!\"<br>\r\n<br>\r\nDanny says, while looking down straight at you. You see his eyes staring into you, and you feel James start to move.<br>\r\n<br>\r\n\"Wait, James, don't move, you don't want to make him fall.\" <br>\r\n<br>\r\n\"Wait, what the hell are you talking about? Your roommate?\" James is obviously confused, but he complies to Danny's command and stays still while Danny gets up off of James. You look up at Danny as he stands up and you see his throbbing dick drift above you. Currently, you're surrounded by James' leg hairs and his thigh for a large distance. James' thighs were massive, obviously a result of his constantly working out. His body's definition was unbelievable, and it was crazy to think that you were small enough to almost hide on his leg. Almost, though, since Danny was somehow able to spot you. <br>\r\n<br>\r\nYou look up at James' deep brown eyes and see him staring at you. After a moment, you see his has a moment of realization when he recognizes you as a tiny human being on his giant leg. Maybe that realization was accompanied by all of the things he realized he could do with a tiny man, since he seems to develop a bit of a grin. <br>\r\n<br>\r\nYou were so distracted by James' face, though, that you didn't realize that Danny's face was right behind you, almost at your arm's length. All it took for you to know it, though, was when Danny started to talk.<br>\r\n<br>\r\n\"Kevin, is that you?\"<br>\r\n<br>\r\nYou're pushed forward by the breath of air released by Danny's voice, and you fall forward. You land on the ridge of James' thigh muscles and begin to roll towards his veined penis. Danny sees what's happening and reacts quickly, putting his hand out in front of your tumble.<br>\r\n<br>\r\nYou land in Danny's hand and are immediately brought up to his face.<br>\r\n<br>\r\n\"Kevin, what happened?\" he says, not mentioning the fact that you almost just had a collision with his lover's dick. A little bit disoriented, you look up to Danny's face. His bright blue eyes and soft red lips that are double your size seduce you, and you become rock solid. <br>\r\n<br>\r\nDanny notices your erection, and his lips curve into a smile taller than you.<br>\r\n<br>\r\nYou try to explain your predicament, but it seems that he either can't hear you or isn't interested. Danny looks over to James with a devious grin, and says...</span></div></div>",
            "created":1476640080,
            "id":2224069,
            "title":"\"Holy shit James, I think my roommate is on..."
        },
        "1112":{
            "author_id":"sockerslave",
            "author_name":"sockerslave",
            "choices":[
                "Try to make it back to your own room",
                "Duck into the closest room to get out of the hallway"
            ],
            "content":"<div class=\"\"><div> <span>In a last-ditch effort to grab your roommates attention before he leaves the room, your climb up on his massive big toe, hopeing he will notice you.  <br>\r\n<br>\r\nTo do so, you reach your arms over the top and grab a few strands of his dark toe hair.  You then place your legs against the inside of the toe and climb it, much like the rockclimbing from your mini-course at the gym.  You get near the top when you have to flop your arms across the top of the toe to hold on.  Danny has just spun around, whipping you almost off the huge smelly foot and across the room.  Luckily, you grabbed on just in time and were able to stay close to your hot roommate.  <br>\r\n<br>\r\nYou straddle the toe and try to stand up.  Looking up, you find youself now following a towering leg all the way up to the most handsome face you could imagine.. now at mega-size. Suddenly, you see that face looking right back at you.  You are unsure if Danny has seen you, or if he is just looking down at something else.  But either way, you use this opportunity to try to grab his attention as best as possible.  You start to wave your arms and flap around, hoping your hot roommate will see you.<br>\r\n<br>\r\nUnsure if it worked or not, you notice that Danny has looked back up.  The toe under you lifts up as he takes a step, then falls again as he plants his foot back on the ground.  This action repeats itself as he leaves the dorm room and enters the dorm hallway.  You feel as though you are riding some sort of bull or bucking horse.  But the movement also gets you turned on a bit.  Danny stops at the elevator.  Lucky for you, he is not taking the stairs.  You try to regain your balance.. in doing so, you must of tickled those hairs on his feet a bit too much, and Danny looks back down at you.  <br>\r\n<br>\r\nYou again wave your arms in anticipation, but hear your roommate say,  \"Nasty Bugs.. Kevin needs to learn how to clean!\" and he shakes his foot trying to get you off.  In doing so, you fly off into the middle of the hallway, just as the elevator opens and Danny gets in.  <br>\r\n<br>\r\nYou are left in the hallway of your dorm.  Your room some 50 feet away.. now miles to you.  You have to decide what to do...<br>\r\n</span></div></div>",
            "created":1184734800,
            "id":426914,
            "title":"Ride em Cowboy"
        },
        "11121":{
            "author_id":"deanthrocyte1",
            "author_name":"Deanthrocyte1",
            "choices":[
                "Caught on his feet",
                "Still in the hallway, dazed, but intact"
            ],
            "content":"<div class=\"\"><div> <span>You head for the door that you assume is your dorm. But from your perspective, all the doors look alike, and the dormitory numbers are slanted to an unreadible degree. But you remember it and play it over and over in your head.<br>\r\n<br>\r\nBut a thunderous noise drowns out your thoughts. You look behind and see Marcus.<br>\r\n<br>\r\nMarcus is a prominent member of the college swim team, slim but heavily muscled. Tall and handsome, he has some attractive elements...but you have only encountered him a few instances. Other than that, you are perpetually unknown to him - worsened by your shrunken state.<br>\r\n<br>\r\nMarcus returns back from swim practice, dripping slightly from his exercises and dressed only in bleached swim trunks.<br>\r\n<br>\r\nHis bare foot pound closer and closer towards you. Though you mean no harm to the handsome colossus, you are in his way.<br>\r\n<br>\r\nMarcus' shadow falls over you. He raises one foot, toes splayed like a savage giant, ready to fall upon you.<br>\r\n<br>\r\nIn an instant, the ordeal is over. Marcus walks off and you are...</span></div></div>",
            "created":1188018000,
            "id":439203,
            "title":"Caught up with someone else..."
        },
        "111211":{
            "author_id":"engineering",
            "author_name":"Spencer",
            "choices":[
                "Marcus woke up to you trying to get free",
                "Marcus went about his day as if you were not there"
            ],
            "content":"<div class=\"\"><div> <span>The giant Marcus is walking at you very fast. You had no time to reach as the giant feet slammed towards you. You wanted to cry because trying to live like a bug was just hard and you couldn't figure out how bugs can even last like they do now. Marcus progresses closer to you and soon his massive sole casted it's shadow of doom over you.<br>\r\n<br>\r\n\" MARCUS!!!\" you screamed as loud as you could.<br>\r\n<br>\r\nMarcus didn't even stop. His sole slammed down on you making a horrible vibration on the floor. You thought it was all over but you were surprised to see that you were, in fact, living. The only problem was, now, you were stuck between the giant's toes. The odor was awful, you wanted to throw up but you couldn't, your body had no time to reach as he stomped to his dorm. <br>\r\n<br>\r\nUp and down, up and down you went with his feet and Marcus didn't even notice a little bug between his smelly toes or maybe he didn't care, he liked the feeling. What ever the reasoning, Marcus wasn't stopping. Marcus soon reached his dorm room and slipped in, then shut the door. He jumped onto his bed and laid down for a while. You figured he had a rough work out and was tired.<br>\r\n<br>\r\nYou could barely see Marcus's face. He drifted to sleep and you were still stuck between his toes. You couldn't get free because his toes were close together and left no room to move. You were stuck and there was nothing you could do...</span></div></div>",
            "created":1250461500,
            "id":745182,
            "title":"Caught on his feet"
        },
        "111212":{
            "choices":[
                "crawl under the door to Beau's room",
                "continue towards your room"
            ],
            "content":"<div class=\"\"><div> <span>You can't believe you survived being slammed into the ground by Marcus' foot. You are painfully bruised from being trampled, but alive nonetheless. You turn around just intime to see Marcus trodding off towards his own room. You are a little dizzy, and it is hard for you to regain your balance. You re-focus on your mission, to get back to your dorm room. you are almost there, but as you pass your neighbors room, you hear the unmistakable sounds of intercourse. You stop and think for a minute. Your neighbor, Beau, was a hot skater boy. He was kind of short and stocky. About 5'6\" with wavy brown hair, green eyes, and massive, muscular, hairy calves. You have had a secret crush on Beau, and you even suspected that he had gay tendancies as well, but you never said anything. Now you were faced with the opportunity to see Beau in action. Do you...</span></div></div>",
            "created":1291077300,
            "id":1004722,
            "title":"Still in the hallway, dazed, but intact"
        },
        "1112121":{
            "choices":[
                "They finish, stand up, and you hide in Beau's shoe.",
                "You continue towards the bed."
            ],
            "content":"<div class=\"\"><div> <span>You realize you may never have another chance like this, so you rush over to the door, and try to squeeze under the door. You can barely fit in the tight space, but you are determined to make it. You are slowly but surely making your way to the other side. You can already smell that the air inside is thick with the odor of sweat and lovemaking. With one last tug, you are in! The room  before you is pretty dark, with few of the setting sun's dim rays making in through the closed blinds. You stand before two large pairs of skater shoes. You figure they both belong to Beau, but then you see that they are two different sizes. And since they were both men's shoes, and there were no girl's shoes in sight...you realize you suspected correctly. Beau was gay. You look towards the bed and see Beau pounding the other guy doggy style. What happens next..</span></div></div>",
            "created":1291077840,
            "id":1004729,
            "title":"crawl under the door to Beau's room"
        },
        "11121212":{
            "choices":[
                "He pushes is cock into Beau's ass",
                "Beau bends down and sucks the cock"
            ],
            "content":"<div class=\"\"><div> <span>Eager to get a closer look, you rush to the bed, where the bottom's arm is haging over the side. You decide to try to climb up, but as soon as you grip his index finger, he pulls his arm up and reaches down into the danger zone where all the action is happening. He grabs his cock and begins to stroke it hard. Squeezing you tightly between it and his sweaty palm. With every upswing of his arm, you are put face to face with his piss slit, which is dripping with pre-cum. Your face is messily pushed into the warm, sticky goo, that acts as a lubricant. He removes his hand and you stick to his cock, face stuffed inside his piss slit. What happens next?</span></div></div>",
            "created":1291078380,
            "id":1004737,
            "title":"You continue towards the bed."
        },
        "111212121":{
            "author_id":"momonewt",
            "author_name":"momonewt",
            "choices":[
                "The Bottom has felt you and is pulling out",
                "The bottom begins to pound harder"
            ],
            "content":"<div class=\"\"><div> <span>With you face firmly planted into the piss slit there is little you can do as the bottom pushes his cock into  Beau's ass. The added pressure pushes you further into the cock and your shoulders are pressed into the slit.  As the bottom slides his cock out and in again you are pushed further into the dick: at first up to your nipples, then down to your navel, after your cock and ass were enveloped, before finally your feet slid into the cock. From your confinement inside you can hear the racing of this guy's heart and a very load moaning, What is happening?</span></div></div>",
            "created":1494350940,
            "id":2316964,
            "title":"Sung as a bug in a cock in an ass"
        },
        "1112121212":{
            "author_id":"momonewt",
            "author_name":"momonewt",
            "choices":[
                "You remain inside the cock",
                "You cummed out"
            ],
            "content":"<div class=\"\"><div> <span>The Bottom begin to furiously pound in and out of Beau's Hole all the wile you are sinking deeper and deeper into his depths. Your sense of perspective has disappeared and you don't know haw far down the cock you are,  but you can sense the heat of the body getting closer and closer. A sudden jolt runs through the cock and the walls clam down on you holding you in place as you feel pressure building ahead of you. Then a blast of hot sticky cum pummels your face and begins to push you backward, But how far do you go?</span></div></div>",
            "created":1494351180,
            "id":2316965,
            "title":"The bottom begins to pound harder"
        },
        "111212122":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "Notices you. (Toying with you and swallowing) ",
                "Notices you and has Eager anal fuck"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You let out a scream as Beau sucks on his cock. All you hear was the sicken sound of Beau's slurping and and the moaning of his lover. Eager moans laughing.  <br>\r\n<br>\r\nEager: Oh yeah eat that tiny fuck.<br>\r\n<br>\r\nBeau..<br>\r\n</span></div></span></div>",
            "created":1573838220,
            "id":2747122,
            "title":"Beau bends down and sucks the cock"
        },
        "112":{
            "author_id":"deanthrocyte1",
            "author_name":"Deanthrocyte1",
            "choices":[
                "Jared sees the birks you're on and puts them on",
                "Jared makes himself at home in the dorm"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, the door creaks open and an impressive figure enters the dim room.<br>\r\n<br>\r\n\"Jared,\" you mutter. \"Maybe he can help me.\"<br>\r\n<br>\r\nBut Jared to your perspective is nothing more than a mountain of well-toned muscle supported on thick redwood legs kept well toned with soccer practice. Still, the rest of him appears just as brawny as his friend Danny.<br>\r\n<br>\r\nJared stops by occasionally and he has met with you once in a while. Now comes the time where you must put this relationship to the test.<br>\r\n<br>\r\n\"Hey, Jared!\" you shout and jump on the sweaty birk surface. \"Over here!\"<br>\r\n<br>\r\nBut Jared can not hear you. Instead...</span></div></div>",
            "created":1187845200,
            "id":438670,
            "title":"Nothing but Jared"
        },
        "1121":{
            "author_id":"sockerslave",
            "author_name":"sockerslave",
            "choices":[
                "Jared goes to his dorm room",
                "Jared goes to the locker room"
            ],
            "content":"<div class=\"\"><div> <span>You notice Jared's eyes looking down towards you.  <br>\r\n<br>\r\n\"Cool\" he says, and you think that you must have been spotted.  In relief, you stop jumping and screaming, but the as this hot giant approaches, he kicks his own sandals off and slides his huge size 14 foot into Danny's left birk.  Knowing that your sandal is next, you panic and try ot find an escape.  <br>\r\n<br>\r\n\"Danny won't mind if I borrow these for the night\" Jared says, obviously NOT seeing you, and you are quickly pushed off the end fo the sandal by the huge hairy tanned toe of Jared.  <br>\r\n<br>\r\nYou tumble in front of the huge man as the whole sandal slides forward.  You fear that you will be steamrolled by Danny's huge sandal, on Jared's huge foot.  WHAT A WAY TO GO!<br>\r\n<br>\r\nBut then, Jared leans down to pick up his own sandals, and in a swoop, you find yourself on his fingers as well.  Grasping on for dear life, you leave the room on Jared's hand.</span></div></div>",
            "created":1190869200,
            "id":447963,
            "title":"Sandal swap"
        },
        "11212":{
            "choices":[
                "Make a move on Jared. He could be gay, and you've already seen him naked.",
                "Go back to your room and hope you don't shrink again."
            ],
            "content":"<div class=\"\"><div> <span>Jared starts out of the room and down the hallway, to the locker room. You realize noone will be there around this time of day, and crawl up his arm to his shoulder. You briefly consider pulling a Horton Hears A Who, and quickly decide against it. Before you have time to consider another option, he takes off his shirt, and you're flying through the air, screaming. You land on his back, and he takes off his shorts and boxers to shower. You run as fast as you can, and barely climb onto his shoulder. You always thought he was gay, but never really knew him too well. He begins to shower, and you see how hot he is naked. Suddenly, a burst of hot steam knocks you out, and you hit the ground, dazed. Everything looks different, smaller, and you realize that you're normal sized again. Jared looks behind him and screams. He pulls a towel around himself and stares at you.<br>\r\n<br>\r\n\"What the hell, Kevin?!\"<br>\r\n\"Sorry, Jared. I...uh...tripped over..on..some of the water in here. Sorry...\"<br>\r\n\"Oh, man. Are you okay? Anything broken?\"<br>\r\n\"No...I'm good, I guess.\"<br>\r\n<br>\r\nYou awkwardly get up, your whole body aching, and walk to the other side of the locker room. You assess the situation, and decide to...</span></div></div>",
            "created":1200636540,
            "id":488251,
            "title":"Jared goes to the locker room"
        },
        "112122":{
            "author_id":"nootletootle",
            "author_name":"NootleTootle",
            "choices":[
                "The dorm of the captain of a sports team",
                "A study area"
            ],
            "content":"<div class=\"\"><div> <span>Hurrying out of the locker room you hope to make it back to your dorm. Questions race through your head. <br>\r\n<br>\r\nYou take a detour hoping to get to room faster when you get a dizzy feeling and suddenly you have shrunk again, looking around you see that you are close too..</span></div></div>",
            "created":1559615700,
            "id":2668829,
            "title":"No such luck"
        },
        "12":{
            "author_id":"sockerslave",
            "author_name":"sockerslave",
            "choices":[
                "Danny invites Jared over to watch a game",
                "Danny makes plans to meet Jared for a bite to eat",
                "Danny tells Jared to come over so they can finish working on \"The Project\""
            ],
            "content":"<div class=\"\"><div> <span>Wandering out to the flip flops, you crawl up on top and head up to the toes. It is SO unbelievable to you that you are standing in the impression of the foot of your roommate.  And it is RANK!  You knew that Danny had some foot odor, but at this size, you are overwhelmed by it.  You hold on to the worn strap of the flip flop and close you eyes, imagining what it would be like for someone the size of Danny to find you like this.  You always had a crush on the huge roommate.  Even MORE huge now that you have shrunk.  <br>\r\n<br>\r\nJust then, you feel the vibrations and look up to see Danny coming in.  He tosses his gym bag on the fold out sofa and kicks off his trainers.  You stay tucked up close to the strap in an effort to hide.  His huge sweaty socked feet come directly towards you...<br>\r\n<br>\r\nHe sits down on the bed, peels off his socks and tosses them aside.  Just then, the phone rings, and Danny gets up to answer it.  Causing even more vibrations thoughout the room as he walks.  It's his soccer friend Jared.  They seem to be making plans..</span></div></div>",
            "created":1184648400,
            "id":426758,
            "title":"Danny enters"
        },
        "121":{
            "choices":[
                "You are crushed like a twig",
                "Your bones hold up, barely"
            ],
            "content":"<div class=\"\"><div> <span>\"The game starts in a little bit, why don't you swing by my dorm room and we can watch it?\" says Danny. You don't hear Jared's response, but you assume he is coming because Danny hangs up the phone, looks around and says \"Man this place is nasty, I better pick some of my crap up before he comes over\". First Danny picks up the massive trainers and dirty socks and tosses them under the bed. Then he fills his arms with other dirty clothes and throws them all in the closet and shuts the door behind him. You watch in awe as the giant walks around the small room. A few times he walks close enough that you catch a whiff of his rank feet. He seems to be finished tidying up, so Danny reaches into the mini fridge and pops open a beer, he starts walking towards his desk to put the can down, but his foot brushes the end of the flip flop, causing you to lose your grip and land flat on your back on the well worn bed of the dirty flip flop. You were in the deepest part of the impression, where the ball of Danny's foot would usually rest. You hear him set the can down, and before you can get up, Danny walks towards the flip flops and slides his feet in. The warm, moist toes beat you up as they carelessly slide into place. The ball of his foot comes to a rest on top of your torso, and your face is between his toes. As Danny puts his weight on you, you see stars as your miniscule frame creaks like a rickety old chair. The pain is great, and tears pour from your eyes. Danny wiggles his toes, and tufts of residiual sock lint and toe jam rain down onto  your face. As Danny begins to walk on you...</span></div></div>",
            "created":1291075380,
            "id":1004680,
            "title":"Danny invites Jared over to watch a game"
        },
        "1211":{
            "content":"<div class=\"\"><div> <span>The weight of Danny's body is great, and with one step, every ounce of his muscular body is bearing down on you. You never stood a chance. It all goes quickly. He comes down on you and squeezes all the air out of your lungs first and then your ribcage shatters, and then your entire torso flattens disgustingly. Your innerds are squeezed out of your mouth, as though you were a tube of toothpaste. Your heart pops like a water balloon, and blood covers Danny's thick, beautifully proportioned toes. He walks around for a few more minutes, unaware of the tragically disgusting mess under his soles. Your remains continue to be pulverized until Jared arrives.<br>\r\n<br>\r\n\"Hey Danny, did you spill spaghetti sauce on your toes?\" asks Jared, observing the thick goop on Danny's toes. Danny looks down and sees the mess for the first time and says \"Sick! I don't even know what that shit is!\". He quickly grabs a napkin and walks into the bathroom where he rubs your squashed remains off and disposes of the catastrophe in his toilet. Not wanting to waste a flush, he pulls his pants down and sits proudly on his throne. In the ultimate act of humiliation and domination, he squeezes out a huge turd on top of your crushed and broken corpse, and flushes without hesitation, completely unaware he had just crushed, walked on, shat on, and then flushed one of his best friends. <br>\r\n<br>\r\nAs Danny exits the bathroom he says to Jared \"I wonder where my roommate Kevin is. He sure will be mad if he misses this game\". </span></div></div>",
            "created":1291076280,
            "id":1004698,
            "title":"You are crushed like a twig"
        },
        "122":{
            "author_id":"mussostache",
            "author_name":"Musso",
            "choices":[
                "Jared",
                "Danny"
            ],
            "content":"<div class=\"\"><div> <span>Danny seems to talk on the phone FOREVER. But that's just usual him. He talks to Jarred, the soccer player, about a snack they could have while watching the game tonight. Football season was just starting, and it has to be memorable, right? It didn't really matter to you if you didn't get back to full size though...<br>\r\n<br>\r\nDanny hung up the phone, and walked to you. It felt like an earthquake when he stepped.  He reached the flip flops you were on and before you could even respond, kicked you into the air unintentionally. Your tiny, ant sized body, flew into the air. So far that it landed in a bowl in the kitchen down the hallway!<br>\r\n<br>\r\nDanny walked into the kitchen and grabbed the exact bowl you were in. He then grabbed his famous nacho cheese from the fridge. It was delicious...but you knew where this was going. The cheese cascaded onto you and you were coated in the sticky mess. Danny added Nachos into the mix, and then the doorbell rang.<br>\r\n<br>\r\nJared walked in, and the two muscular guys sat down with the bowl of nachos and enjoyed the game as you fought to not drown in the gooey cheese.One by one, the shirtless guys grabbed a nacho, dipped it in, and chewed. There wasnt much cheese left...but they were still hungry. <br>\r\n<br>\r\n\"GUYS! DOWN HERE!\" you yell. But it's too late. A huge chip scooped up the world beneath you, and you stared directly in the hungry face of....</span></div></div>",
            "created":1411856820,
            "id":1862970,
            "title":"The Game Food"
        },
        "1221":{
            "author_id":"mussostache",
            "author_name":"Musso",
            "content":"<div class=\"\"><div> <span>The soccer player licked his lips, and tossed the chip in. You fell into his huge mouth, still covered in cheese and unable to move. There was almost no light, and only when Jared opened his mouth to put in another chip, did you see that you were staring at his huge molars. \"JARED! STOOO-\"<br>\r\n<br>\r\n*CRUNCH*<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ---------------------------------------------------<br>\r\n<br>\r\nJared felt a small cruch and a rush of liqiudy \"cheese\". \"You know Danny, you always make them taste special.<br>\r\n<br>\r\nDanny laughed, grabbed another chip, and enjoyed the rest of the game.But for some reason, he never saw Kevin again.</span></div></div>",
            "created":1411857120,
            "id":1862972,
            "title":"A Delicious Demise"
        }
    },
    "info":{
        "author_id":"isle101",
        "author_name":"Isle",
        "brief_description":"What happens when you shrink to the size of ant in an all guys dorm?",
        "created":1179984960,
        "description":"<td align=\"left\" class=\"norm\">You, Kevin, are a gay male and have shrank to the size of an ant in your dormroom. Your roommate, Danny, is a well-built attractive athlete who has absolutley no clue you have shrank.  He is a cocky guy always dressed in a polo and sandals.<br>\r\n<br>\r\nKeep the man character unknown to the other guys in the dorm.<br>\r\n<br>\r\nMALE INTERACTION ONLY!!!!<br>\r\n<br>\r\nOtherwise feel free to introduce new characters and anything you like.<br>\r\n<br>\r\n</td>",
        "id":1266475,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1573838220,
        "modified":1573838220,
        "pretty_title":"You shrink in an all male dorm"
    }
}