{
    "chapters":{
        "1":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Cameron (aka Camie)",
                "Alexander",
                "Andrew",
                "Alec",
                "more boys"
            ],
            "content":"<div class=\"\"><div> <span>Before we begin, which fat boy grows into a fat giant? And here are the list as follows:<br>\r\n<br>\r\nCameron (aka Camie): 12 year old, 5'1ft, 123lbs, brown hair<br>\r\n<br>\r\nAlexander: 14 year old, 5'7ft, 123lbs, brown hair<br>\r\n<br>\r\nAndrew: 14 year old, 5'2ft, 115lbs, black hair<br>\r\n<br>\r\nAlec: 13 year old, 5'2ft, 106lbs, brown hair<br>\r\n</span></div></div>",
            "created":1290056400,
            "id":996425,
            "title":"Which fat boy?"
        },
        "11":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Growth Machine",
                "Drinking Potion",
                "Magic Candy Bar",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Cameron got effected by...?</span></div></span></div>",
            "created":1290056400,
            "id":996430,
            "title":"Cameron (aka Camie)"
        },
        "111":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996435,
            "title":"Ray Gun"
        },
        "1111":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...50ft tall.",
                "...100ft tall.",
                "...150ft tall."
            ],
            "content":"<div class=\"\"><div> <span>A 12 year old boy named Cameron (which everyone called him Camie) who weighs a whooping 500lbs of fat was in his bedroom reading the magazine while eating the hamburger at the same time. He loved being fat &amp; most of all he loved the size of his butt which in fact he's so big that he's the size as a sumo wrestler. Camie reads the magazine which is one of his favorite hobby as he then finds the page of something which that he is interested in. <br>\r\n<br>\r\nCameron: Growth Ray 3000? Cool! That looks awesome!<br>\r\n<br>\r\nAs he reads about a growth ray 3000 which it grows things whatever they want. And he thought about what happens if the ray gun grew people as well.<br>\r\n<br>\r\nCameron: Boy I like this now. Looks like someone needs a new size up &amp; that would by me. I'll have it right away.<br>\r\n<br>\r\nCamie wrote down his name &amp; address on the form, then he cuts it with his scissors, sends it through the post box &amp; all he needs now is wait until the delivery comes to his door. The next day after he had a practice how to be a fat giant, Camie was at his backyard swimming pool wearing his black speedos which it fits him well &amp; eating his slice of pizza when the mail service came to deliver the ray gun in his mail box. He gets out from the pool &amp; walking around the block towards the mail box.<br>\r\n<br>\r\nAfter he got the parcel &amp; walks back to his backyard. Camie then opens up &amp; it was a ray gun. Just a dream he had been waiting for since Yesterday.<br>\r\n<br>\r\nCameron: YES! Just as I looking for! Or I have to do now is make me bigger right now.<br>\r\n<br>\r\nCamie's not wasted any as starts pointing the ray gun towards his man-boobs &amp; shoots it with an grin on his face. And then just few seconds later after the ray gun effects him, He then felt somethings getting hotter &amp; hotter as he then suddenly knew that it's was coming.<br>\r\n<br>\r\nCameron: Man I think it's...It's..Yes it is! I'm growing! I'm growing!<br>\r\n<br>\r\nCamie has officially started to grow as he first looked at his hands were getting bigger &amp; then he looks all over his fat body that was the same as well. He looked down &amp; saw the streets were getting smaller as he started to giggle from his lungs. The growth then stops as he's now at...</span></div></div>",
            "created":1290056400,
            "id":996557,
            "title":"The birth of Camie's fat giant growth."
        },
        "11112":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...the city.",
                "...the fast food restaurant as he started to get hungry."
            ],
            "content":"<div class=\"\"><div> <span>Camie has officially started to grow as he first looked at his hands were getting bigger &amp; then he looks all over his fat body that was the same as well. He looked down &amp; saw the streets were getting smaller as he started to giggle from his lungs. The growth then stops as he's now at 100ft tall.<br>\r\n<br>\r\nCameron: WOW! Look how big I am? I'm just turned myself into fatzilla. And good job my speedos grew with me. Otherwise I would be embarrassed If my speedos ripped off. But this size looks amazing.<br>\r\n<br>\r\nHe giggled as he looked down at the building that came to his ankle as he is now a fat giant when he pats, rubs &amp; shake his fat juicy butt feels that he's got the power in his hands. He then picks up a tiny pizza &amp; eats it like a small pea.<br>\r\n<br>\r\nCameron: *giggle* Well I'll gonna show those tiny little insects a lesson to the new fat God. Me! Camie the fat giant 12 year old boy is on my way right now.<br>\r\n<br>\r\nAnd Camie then move off as he took a one large step &amp; lands with the boom &amp; same to the other. Then few minutes when continued walking, stepping on cars &amp; people without him knowing, he then approaches to...   </span></div></div>",
            "created":1290056400,
            "id":996563,
            "title":"Attack of the 100ft fatzilla."
        },
        "111121":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "eating the city.",
                "growing bigger"
            ],
            "content":"<div class=\"\"><div> <span>Camie then move off as he took a one large step &amp; lands with the boom &amp; same to the other. Then few minutes when continued walking, stepping on cars &amp; people without him knowing, as Camie approaches to the city where he can rule the place. Few minutes later at the city where traffic are very busy indeed but all came to an halt as they all hear a rumble which made the city shook. They hear it louder until they all saw the  gigantic fat 12 year old boy appear at the city as the people run screaming one side to the other.<br>\r\n<br>\r\nCameron: Aww! look at them! There's so tiny and already there're too scared of me? Really? So let's see how scared you really are as I'm taking over this city to see how powerful I really am. *laughs*<br>\r\n<br>\r\nCamie laughed loudly as he then started to move off with a massive booms as the tiny citizens screams wildly as they run one side to the other. He looked down again with a grin on his fat face as the 500 pounder starts to rampage the city. And that's when he starts walking by stomping the tiny citizens, the vehicles, the small buildings &amp; etc. He then move on the main buildings as Camie shoves it over which made the building capsized on the middle of the main streets &amp; did the same to the rest.<br>\r\n<br>\r\nHe then approach to the small but big wide shape building which came up to to his fat thighs as he taunts them with a suitable idea which came from his mind.<br>\r\n<br>\r\nCameron: Oh yes! Just the building that I was needed &amp; just in time to use my favourite giant crush move. Looks like you insects are gonna be trapped in there as I Camzilla am gonna sit on you by my famous fat gigantic butt. And once I done that, I'll will takeover this city forever.<br>\r\n<br>\r\nAfter Camie marked his words carefully, he then turned around with the building behind as he shake his butt before he was on the sitting position &amp; then *SMASH* as Camie finally squash the building by being sat on with a grin on his face.<br>\r\n<br>\r\nCameron: Hey! Did you know that you been butt squashed? *laughs*<br>\r\n<br>\r\nA laughter of joy as Camie celebrates as he now runs the city &amp; will last a very long time. Just as he's about to stand up in full height, his right butt cheek got hit lightly which there no effect on Camie because of his size. He then turns around and looks down at the army just as they newly arrived on the scene. He then stands up with his hand rubbing his sore butt cheek as the army sergeant comes out from the tank mobile.<br>\r\n<br>\r\nSgt: Alright fat mammoth! Playtime is over! I want you to deport the city or else.<br>\r\nCameron: Or else what? Trying to shoot me like? In fact you shouldn't shoot me behind my back you know or I'll crush you to death if you don't careful what you doing.<br>\r\nSgt: Oh Really? Well let tell you something Santa wannabe, You don't disobey my orders from the sergeant pal. And you know what? You had your warming mammoth. Boys! Shoot this monster down NOW!<br>\r\n<br>\r\nThe tanks fires at Camie as he cover himself in danger but he already noticed that the bullets can't hurt him. So he stands up straight as he's walk towards the army tanks in a foul mood while the army keeps shooting towards him.<br>\r\n<br>\r\nCameron: You know what? Since you shoot me purposely, I'll gonna teach you &amp; your little toy soldiers a lesson by taking you out at each and everyone of you.<br>\r\n<br>\r\nCamie then turns around once more as the army sergeant knew what he's doing as he gets in the tank &amp; retreats himself as the army keeps doing the shooting. Camie then looked at the bus as he puts his left foot in &amp; then he slips purposely and sat on the tanks by his massive butt. He then looked at a feared sergeant as he made it clear from his actions.<br>\r\n<br>\r\nCameron: Hey Sergeant! Looks like your little toy soldiers have been flattened like a pancake *lol*<br>\r\nSgt: Oh yeah! But you missed one and you're never gonna stop me.<br>\r\n<br>\r\nSergeant then tries to retreat but got caught as Camie lifts up the tank and picks up the sergeant from the vehicle and then drops the tank on the middle of the street and stomps it to finish it off. But he's not done with the sergeant yet.<br>\r\n<br>\r\nCameron: Now I'll ordering you to kiss my sore right butt cheek or I'll crush you. Do you understand what I'm saying to you?<br>\r\nSgt: Fine! I'll do it whatever you wanted.<br>\r\nCameron: then do it NOW!<br>\r\n<br>\r\nCamie lowered his hands with the sergeant to his butt cheek &amp; forces him to kiss his sore mark which he did what Camie ordered by avoid getting crushed by his hands. He then lifts up the sergeant once more as Camie made his decision what to do with him.<br>\r\n<br>\r\nCameron: That's better! Looks like you'll not gonna get crushed after all don't you? But instead I'll just eat you anyway. Bye bye!<br>\r\n<br>\r\nThe Sergeant is shocked &amp; pleading to let go as Camie opened up his mouth &amp; then swallows the sergeant.<br>\r\n<br>\r\nCameron: Well! that's the end of the fallen sergeant. Now time back to business of destruction then.<br>\r\n<br>\r\nSo Camie looked down at the carnage he smashed &amp; was proud of what he's doing as he now focus on...<br>\r\n</span></div></div>",
            "created":1293253200,
            "id":1022068,
            "title":"The city of rampage"
        },
        "1111211":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...continue to rampage more.",
                "...was tied up all around his fat body."
            ],
            "content":"<div class=\"\"><div> <span>So Camie looked down at the carnage he smashed &amp; was proud of what he's doing as he now focus on eating the city. And that's when he saw a ice cream van drove past between his massive feet as Camie turns around &amp; began to chase the van. The driver tried his best to get away from a 12 year old fat giant but got caught when Camie lifts it up in the air with two hands as is went towards his fat face. <br>\r\n<br>\r\nBy wasting no time, Camie sticks his tongue out in a hungry kind of way as he rips off the back door &amp; starts to eat it over his mouth as he shakes the ice cream van trying to getting out not only the ice creams but the van driver too. When he finally ate all of them out, he then crush the van by his two hands together &amp; then ate the scrap van as his fat gut started to rumble loudly few seconds later when he place his hands on his fat gut &amp; was getting hungrier.<br>\r\n<br>\r\nCameron: Ooooohhhh! Man I'm feel hungry already. But oh well! I can eat whatever I want because I certainly can.<br>\r\n<br>\r\nCamie looked around the city when he thought he would try &amp; eat the building first to start with. He waddles towards the building which came up to his man-boobs as he rips half of it off &amp; turned it upside down from them getting out of here. He then lift's up high above Camie's head as he again turned it back the way, but this time the tiny employees &amp; the rest of the furniture went straight through Camie's wide mouth &amp; began to swallow the all as they all let by. After Camie ate whole lot of them when he made a loud burp, he then dropped the half building &amp; began to smash it by using his his foot to finish it off at the end.<br>\r\n<br>\r\nCamie then waddles off once again &amp; this time he stops there when he looked down &amp; saw his favorite fast food restaurant that he ever had, McDonalds! And he's loving it indeed. He then puts down on his knees as he began to smash the windows &amp; pinches 25 french fries, 25 big macs, 25 McFlurries &amp; 25 drinks of soda which he then gathered them up together as he sits up with his fat legs spread out &amp; was begin to eat. But all this he gets was too small to eat. So Camie thought he would took out the ray gun &amp; began to shoot the meals as it grew larger right up to the correct size from his point of view which he then finally began to eat as he starts off with the french fries.<br>\r\n<br>\r\nAbout half an hour later, Camie finally finish his meal when drank the last of the sodas as he then rubs his fat gut with a loud burp &amp; was getting exhausted after having a nice long meal from McDonalds.<br>\r\n<br>\r\nCameron: *yawns* Boy that was a nice meal &amp; I think I like to stay bigger for a very long time. But now I like to have a long nice sleep at last. <br>\r\n<br>\r\nCamie began yawning again as he laid down on his back &amp; was sleeping when he starts snoring which was heard around the city from the far side. Few hours later, Camie finally woke up when he... </span></div></div>",
            "created":1296795600,
            "id":1047247,
            "title":"Feeling Hungry?"
        },
        "11112112":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...I going to stand up & I'm gonna crush you all.",
                "...why all of your bugs tied me up in the first place?"
            ],
            "content":"<div class=\"\"><div> <span>Just as he woke up few hours later, he really felt tight that he can't even move his fat gigantic body around as his eyes are moving to see what's going on. And all the sudden that Camie's been tied up by the tiny green army men who had him surrounded.<br>\r\n<br>\r\nCameron: Oh them again? I thought I had these stinking bugs already. But now they want revenge just to tie me up in the middle of this tiny city? Really? What a piece of joke!<br>\r\n<br>\r\nIt is almost that he really is Gulliver but young to his age &amp; the strings (from his point of view) got deeper on the rolls of his fat stomach. But now Camie doesn't know if he's going to struggle to get out of that tiny ropes &amp; rampage them or if he let himself calm down &amp; ask them why did they tied him up in a nice way. <br>\r\n<br>\r\nBut the problem is that's the same army that they shot at his right fat humongous butt cheek which he then destroyed the soldiers &amp; the tanks afterwards just before he swallowed the sergeant (who was very rude compared to Camie's point of view) which he thought that was it for them.....yet.  <br>\r\n<br>\r\nBut now they're back this time with a commanding officer who holds on Camie's speedos for him to climb as he then walk on his fat body avoiding by couple of the ropes until he halted at between his man-boobs so he can see Camie's fat gigantic face.<br>\r\n<br>\r\nCommander: So you know why you here fat behemoth?<br>\r\nCameron: Well let me get your answer ok, and that is...<br>\r\n<br>\r\n</span></div></div>",
            "created":1303534800,
            "id":1092978,
            "title":"Fat Junior Gulliver."
        },
        "1111212":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...for my fat giant interview with you little lady.",
                "...to show off my fat sexy body."
            ],
            "content":"<div class=\"\"><div> <span>So Camie looked down at the carnage he smashed &amp; was proud of what he's doing, but what he's not proud of is most of the building are still taller than Camie height.  But then Camie did remember he still got the ray gun with him.  So he took out from his speedos and starts to look at it with a grin on his face by using it once more.<br>\r\n<br>\r\nCameron: If this stinking buildings thibk they're still taller than me eh?  Then not for long!  Because fatzilla Camie is still have my ray gun and using it to grow myself even bigger once again. lol<br>\r\n<br>\r\nCamie laughed by the moment as he pointed the ray gun towards his man-boobs again and shoots it once more and this time, the citizens are watching this dreadful impact as he lays here at (insert your city here) and started to grow once more rapidly.  Camie has all the giggles he want for his extra fat gigantic size up, but the citizens knew they are in mega trouble while one of the news van quickly storm to the scene to broadcast live with this impact of the fat behemoth 12 year old still growing bigger by the second.<br>\r\n<br>\r\nNews Lady: This is NBC News Live from (insert your city here) where we come to this threat of what is look like a fat giant 12 year old boy who named himself as Camie had already started the cause in about half an hour ago.  But right now this fat monster is getting bigger by the minute and it will cause this city far from worse.<br>\r\n<br>\r\nJust as the citizens were having a serious threat of their lives, Camie's growth finally came to a halt about seconds later.  He was 100ft tall when he first having his fun fanatics, but now Camie is 500lbs (nornal size weight) and stands at 200ft tall and he's now taller than all the buildings he wanted to be the size that way.<br>\r\n<br>\r\nCamie: *giggles* That will show these puny buildings I'm far more bigger, badder, stronger and better than before.  Now this is really mine forever! *giggles*<br>\r\n<br>\r\nAs Camie walks off once again, the citizens started running once more but however the TV crew still standing there broadcasting this footage when they filmed fatzilla Camie coming towards them.<br>\r\n<br>\r\nNews Lady: This fat monster is far more dangerous as he is ever.  I advise you to stay indoors until the fat giant boy has WHAT???  What do you want stu?  <br>\r\nStu the camera man: Umm the fat giant's coming this way and he's coming to get us.<br>\r\nNews Lady: Oh stop it you!  You wanna think that this fat monster was coming this coming without noticing us?  (Then it was pitched dark as the News Lady finally turns around to look at the size of Camie humongous butt.) I second thought, You're right Stu!  He's gonna sit on us!  RUN!!!<br>\r\n<br>\r\nThe TV crew tried to run as they can when Camie is about to sit on them right in the middle of the city.  Inching away from their fate but somehow survived when Camie had finally sat down on the middle of the streets where the TV crew were still broadcasting the impact of that move when they now filmed at Camie's back with a little bit of butt crack was shown above his black speedos when he then turned around with a cute like smile from his face.<br>\r\n<br>\r\nCamie: Oops!  I didn't know I was about to sat on you bugs, but you all manage to escape from my big sexy butt didn't you? *giggles*  Hey!  How about you can film this right now...</span></div></div>",
            "created":1325912400,
            "id":1253973,
            "title":"Just a little bit bigger I think?"
        },
        "112":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996438,
            "title":"Growth Machine"
        },
        "113":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996441,
            "title":"Drinking Potion"
        },
        "1131":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...go to the city & destroy them once & for all?",
                "...go to the lake to have a swimming party?",
                "...put you inside my back of my speedos?"
            ],
            "content":"<div class=\"\"><div> <span>Peter a 15 yr old lad who is 5'5ft &amp; weighs 131lbs has finished his latest chemical that envolves size change. Yes a drinking potion &amp; was thought he would let his younger brother Cameron (but he likes to be called Camie for short) getting bigger. Cameron a 12 yr old boy who is 4 inches smaller than him (5'1ft) but was fatter than Peter by weighing a massive 500lbs because he use the drinking potion a month ago which made himself fatter &amp; he like it.<br>\r\n<br>\r\nBut 2 days ago, he asked his older brother Peter to make himself bigger by becoming fatzilla. Peter wasn't sure it was a good idea to let his brother go on carnage but he doesn't want to let Cameron down so he starts mixing the potion right away. And now the potion is finished &amp; he cannot wait to see Cameron's face when he see's this as he goes straight to the living room where Cameron lays on the sofa reading a magazine only wearing his speedos because the rest of his clothes couldn't fit him very well so but he gets used to his size where he is anyway. As Peter appoaches towards him, Cameron then stands up &amp; stares at him in a friendly way.<br>\r\n<br>\r\nPeter: Hey Camie! Guess what I got for you?<br>\r\nCameron: What is it?<br>\r\nPeter: Remember you said you wish to be a tall brother 2 days ago?<br>\r\nCameron: Yeah! Why?<br>\r\nPeter: Well you gonna love is. It's because I made a drinking potion &amp; you're gonna be the one who's gonna grow yourself bigger. So I thought I would pass it on to you. You can keep it whatever you want.<br>\r\nCameron: WOW! That's amazing! I been waiting for this for a while thank you so much. But are you sure it's too dangerous to do this thing?<br>\r\nPeter: Too dangerous? How do you think it's too dangerous to use that when I used Chemistry for nearly two years?<br>\r\nCameron: Oh yeah! Let's try out right now!<br>\r\nPeter: Yeah but we might as well do it ouside in case you gonna outgrow our house.<br>\r\nCameron: Yeah that might be a good idea then. <br>\r\n<br>\r\nSo the 2 brothers went outside their backyard where Cameron's going to be grew at. And Peter brought the video camera with him so Cameron can watch his actions as a fat giant when they come back.<br>\r\n<br>\r\nPeter: So Camie! Are you sure you ready to do this?<br>\r\nCameron Yeah of course I will! I'll be just fine!<br>\r\nPeter: Ok then! I'll just get my camera out ready for you &amp; just ready where you are ok.<br>\r\n<br>\r\nCameron has got the bottle in his hands as Peter began to record the camera with the words from Cameron himself.<br>\r\n<br>\r\nCameron: Hello peoples! It's me Camie once again! As you may know that this is my first month since I put on weight by the potion I use the last time &amp; I love this size very much indeed. Now I got another bottle with me once again &amp; this time, It makes me grew taller &amp; I'm so excited to get this &amp; guess what? I'm going to use it right now.<br>\r\n<br>\r\nHe finish half of his speech when he then walked away from Peter &amp; the camera to give it a better view as Cameron then drinks the potion to see the results of the formula. And just a few seconds later, His fat body's getting warmer as he's started to grow very quickly indeed. His growth continues until he came to a massive height of 200ft tall. And boy Cameron was stunned about this &amp; he loved it as he looked down at the buildings &amp; little Peter, still wearing speedos which it grew with him well as he gives a reaction of the formula.<br>\r\n<br>\r\nCameron: Wow! first I'm weighed at 500lbs last month &amp; now I'm standing at 200ft tall. Boy I'm huge! I'm Camiezilla! lol<br>\r\nPeter: Well! There goes big Camie then!<br>\r\n<br>\r\nCameron then began to sit down as he lands with a massive boom which made Peter a jump there.<br>\r\n<br>\r\nCameron: Man this is awesome! I think I begin to love my new size after all. And now I'm about to beat the hell out of the city where I will become the king of the world. And your invited to watch my action once I entering the city so I'll catch up with you all later. Have fun now!<br>\r\n<br>\r\nHe finally end his speech when Peter then stops recording as he came closer to looked around of Camie's fat gigantic body with a look of his reaction.<br>\r\n<br>\r\nPeter: Wow Camie! You look..... bigger!<br>\r\nCameron: Lost words heh? Thank you Peter for making me bigger. I love it very much indeed &amp; I think I could stay like for a long time.<br>\r\nPeter: You welcome brother! And yeah I lost words because I been dreaming about you as fatzilla destroying the city &amp; I couldn't beleive it's happening<br>\r\nCameron: And you know what? Your dream came true because I really am a fat giant thanks to you brother.<br>\r\nPeter: Aww cheers Camie! That's why I wouldn't let you down because that's what brothers do really.<br>\r\n<br>\r\nCameron then grab Peter with his large hands as he give him a big hug from Camie's right shoulder &amp;  Peter does the same as well but as a normal size brother. He then stands up on his feet &amp; puts Peter right on top of his right shoulder as he gives an idea what to do first.<br>\r\n<br>\r\nCameron: Say Peter! How about you can come with me if I can...</span></div></div>",
            "created":1299733200,
            "id":1068283,
            "title":"It's time to get bigger Camie!"
        },
        "11311":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...I'm going to rampage the city right now.",
                "...I want you all to worship me right now."
            ],
            "content":"<div class=\"\"><div> <span>Cameron: Say Peter! How about you can come with me if I can go to the city &amp; destroy them once &amp; for all?<br>\r\nPeter: Yeah that's fine by me Camie!<br>\r\nCameron: Alright then! Hold on tight! Because it's gonna be a bumpy ride.<br>\r\n<br>\r\nPeter holds on his shoulder as Cameron then starts to waddle with a massive boom as he approaches to the city which it will be his forever. Few minutes later at the city where traffic are very busy indeed but all came to an halt as they all hear a rumble which made the city shook. They hear it louder until they all saw the gigantic fat 12 year old boy Cameron (and his tiny sidekick Peter on top of Cameron's shoulder) appear at the city as the people run screaming one side to the other. <br>\r\n<br>\r\nCameron: Hey Peter! What do we got here eh?<br>\r\nPeter: Well there just people screaming running around each other at one place?<br>\r\nCameron: You quite right about that but in my point of view, I just call them little insects &amp; I like it when they all react on me like that.<br>\r\nPeter: Oh! That was my second guess. But good luck on your first action as fatzilla. I should be on my way to record all of your actions from my video camera.<br>\r\nCameron: No problem! I'll put you down to the ground &amp; i'll let you film the greatest view of your entire life.<br>\r\n<br>\r\nCameron grabbed Peter once more to put him down to the ground as he gets his postion to get a better view. He started to record when Cameron starts to talk trash to the tiny insects in front of him.<br>\r\n<br>\r\nCameron: Well well well! Look what do we have here? Does these tiny insect never seen the size like this before? Well you do now because I'm run this city for now on. And I'm about to destroy of your precious city once &amp; for all. lol! Oh! I forgot to introduce myself don't I? Well then I'm fatzilla Camie, but please call me Camie for short, and... <br>\r\n</span></div></div>",
            "created":1299733200,
            "id":1068357,
            "title":"It's Camie's city now!"
        },
        "113112":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "follow Camie's pov",
                "follow Ryan's pov"
            ],
            "content":"<div class=\"\"><div> <span>Cameron: Well well well! Look what do we have here? Does these tiny insect never seen the size like this before? Well you do now because I'm run this city for now on. And I'm about to destroy of your precious city once &amp; for all. lol! Oh! I forgot to introduce myself don't I? Well then I'm fatzilla Camie, but please call me Camie for short, and I want you all to worship me right now. That's includes you! You down there! You in that vehicle over there and by the way if you're all in there, get out &amp; get over here now! And you in the buildings right now. I want you all worshiping me right in front of me. But if you don't do exactly what I'm saying to you, you will be facing punishment &amp; I will do something that you never feel anything that hard of your entire lives. Do you understand what I'm saying to you right now? Then do it now! And that is an order!<br>\r\n<br>\r\nCameron made a long statement that he demanded to worship him at once &amp; the tiny citizens did what they all been told. Down on their knees &amp; bow to the new fatzilla, and Camie is very impressed indeed from their efforts. So he thought of having a stroll with a loud boom once more to check to see if all of them are worship him with some respect.<br>\r\n<br>\r\nCameron: That's right! Keep doing it without stopping until I said so.<br>\r\n<br>\r\nCamie then checks through the building and saw all of them bowed towards him. He kept looking through their windows one by one but he stops his tracks when he saw two men not bowing to him at all. They were all sitting in their sofas laughed off the television which it featured live on news involved fat gigantic Camie himself. Camie wasn't happy at all but more importantly, he wasn't happy because that his bullies when he saw them right now.<br>\r\n<br>\r\nBefore he was a 500lb plump 2 months ago, two of the bullies named Ryan &amp; Nick had making fun of Camie every single day because he was so small that he wouldn't take the advantage on them. Camie was embarrassed &amp; decided enough is enough when he ask his brother Peter to work on the liquid potion for his revenge a month later. He then became 500lbs of fat which he loves to keep it which he was then tried to confront them but failed because they forced him to do a truffle shuffle which was added on youtube 1 month ago just a day after his weight gain potion effected. And Camie was so embarrassed once more that there's way that he can stop these bullies once &amp; for all....yet! Because he found the idea by becoming a 200ft tall fat giant &amp; that's the story right up to now as Camie is now a 200ft, 500lbs monster finally gets his what he wanted.<br>\r\n<br>\r\nThe two bullies still watching news laughed at Camie's size (which they thought it was a fake story) until now as he then put his hands through a window &amp; grabbed both Ryan &amp; Nick out from the building which made his brother Peter very proud indeed for standing up for himself as he's still recording his camcorder at the same time.<br>\r\n<br>\r\nPeter: Woohoo! Way to go Camie! That's the way you do it brother!<br>\r\n<br>\r\nPeter still celebrating in joy as Camie confronts them by holding one bully in each hand. Nick on his right &amp; Ryan on the other as he then given them a massive grin as he now finally controls both of them.<br>\r\n<br>\r\nCameron: Hello boys! You thought you're going to embarrassed eh? But I'm afraid not! Because this time to embarrassed you two on what you both did to me over the last 2 months. And guess what? I'm bigger than both of you now you little pipsqueaks. *giggles*<br>\r\nRyan: Pipsqueak? Us? Is that you can say to us? Really? Listen fatty that was the worst jokes we ever heard of our entire lives.<br>\r\nNick: Yeah! You said it Ryan!<br>\r\nRyan: And we got some business to attend to. So if you do mind put us down this instant you fat ass monster.<br>\r\nCameron: Oh Really! Well I would love to drop you two down to the ground right now, but I'm not gonna do it because you never bowed to the new fatzilla. I'm in charge here from now on &amp; that's Camie to you. Do you hear me you little bastards.<br>\r\nThe Bullies: Oooohhh!<br>\r\nRyan: Shocking! And speaking about bowing. Why's that dickhead holding the camera over there not bowing to you eh?<br>\r\nNick: Yeah! why blame us like for god's sake?<br>\r\nPeter: Oi! You know I can hear you from here you dirtbags. <br>\r\nCameron: He can't do it because that's my brother &amp; I love him so much that I wouldn't be mean to him alright! But I will punish both of you for not worshiping me in the first place, you will never feel anything like this of your entire lives. Any last words you little pipsqueak?<br>\r\nNick: Yeah! Fuck you! <br>\r\nCameron: Alright! That's it! You're first you little swine! And do you know what? You making me hungry right now! Yum yum! And Oh yeah! Fuck you too! Bye Bye!<br>\r\n<br>\r\nNick was shocked as Camie opened his mouth wide and then tossed Nick towards his mouth when he began to swallow one half of his bullies. He was then having a loud burp when rubbed his fat belly round in circles.<br>\r\n<br>\r\nCameron: Ah! That is so tasty!<br>\r\nRyan: Now you just wait a minute! You think you want to eat as well eh? do you?<br>\r\nCameron: Eat you? Why do I do such a thing? I never had a chance to play with you yet.<br>\r\nRyan: Play with you? For what? <br>\r\nCameron: Well since you call me a fat ass monster, then I thought I decided to put you inside my back of my speedos. *giggles*<br>\r\nRyan: WHAT! NO! I AM NOT GOING IN!<br>\r\nCameron: You are now! Have fun spending time with my bare humongous butt cheeks now. <br>\r\n<br>\r\nRyan was shocked as well but this time Camie puts him inside his back of his black speedos where he placed him against his right butt cheek towards Ryan's face. He then shuts his speedos as he began to laugh out load, as but his brother Peter who looked like he was about to puke there but he didn't &amp; concentrate on the camcorder viewing towards his fat giant brother Cameron.<br>\r\n<br>\r\nPeter: Man! How the hell did he get that move from? That's almost disturbing!<br>\r\n<br>\r\n*We have reach to the choice section but this time we have point of view between Cameron &amp; his bully Ryan. But the question I like you you is this. Who's pov are you going to? <br>\r\n<br>\r\nWould you follow fatzilla Camie's pov as he then began to rampage the city?  <br>\r\n<br>\r\nOr<br>\r\n<br>\r\nWould you follow Ryan the bully's pov as he's been placed inside of Camie's black speedos as we will find out how does he gets on in front of Camie's right fat juicy butt cheek. </span></div></div>",
            "created":1304226000,
            "id":1098301,
            "title":"Not everyone's worshiping the new fatzilla!"
        },
        "11313":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...I'm now gonna sit on you.",
                "...you will watch as I rampage this puny city."
            ],
            "content":"<div class=\"\"><div> <span>Cameron then grab Peter with his large hands as he give him a big hug from Camie's right shoulder &amp; Peter does the same as well but as a normal size brother. He then stands up on his feet &amp; puts Peter right on top of his right shoulder as he gives an idea what to do first.<br>\r\n<br>\r\nCameron: Say Peter! How about you can come with me if I can put you inside my back of my speedos.<br>\r\nPeter: You mean...?<br>\r\nCameron: Yep!  You get to chance to see my ginornous butt by putting you in my speedos.<br>\r\nPeter: Why?<br>\r\nCameron: Because I'm a fat giant and you are my tiny brother.  So therefore you have to do exatcly what I tell you to do.<br>\r\nPeter: *sigh* Well I made you fat and then I made you taller. So...well...I don't know Camie.  I'm not sure if I can do this.<br>\r\nCameron: Relax!  Listen, I'll put you in here for now and when he headed to the city, I'll take you out and you're be alright no problem.<br>\r\nPeter: Ok fine!  If you want me to do this, then that's fine, but only just once!<br>\r\nCameron: Thanks Peter!  Now sit tight!  Because it's gonna be a bumpy ride.<br>\r\n<br>\r\nAs by saying this, Camie grabbed his tiny brother and lower him down towards his huge massive butt.  He opened his speedos and then he dropped Peter into it before he close his speedos again.  In Peter's view, his face has been planted against Camie's left butt cheek, even though that was only the beginning when Camie pats his butt cheek where his tiny brother was placed and after all that, he started to jiggle his big butt sideways and then up &amp; down the way.<br>\r\n<br>\r\nCameron: Hey little brother!  What do you think of that then?<br>\r\nPeter: mmmmhhhh<br>\r\nCameron: My bad!  Don't worry!  I'll get to that puny city in no time.  But just hold on tight for a while ok?<br>\r\n<br>\r\nCamie began to waddle with loud footsteps because of his size as he heads towards the city with Peter still inside Camie's speedos and his face pressing against his butt cheek everytime he waddled along.  Few minutes later, Camie finally made to the city where he looked down and saw the tiny citizens screaming and running around his bare feet.  Camie just got a nasty grin from his face when he lifted his right foot and plants it down, killing most of the citizens that didn't made it.<br>\r\n<br>\r\nAfter all that, Camie opened his speedos and takes out a burned face Peter from his melon sized rear and closed his speedos once more.  He then placed Peter on top of the building which to his lower thighs and give him a giggle for his tiny brother's embarrassment.<br>\r\n<br>\r\nPeter: Well I don't have say, but I think I'm getting used to your big ass.<br>\r\nCameron: You do?  That's awesome!  Oh by the way, the reason I'm putting you on top of this small building right now it's because... </span></div></div>",
            "created":1325912400,
            "id":1254170,
            "title":"In you go, butt lover!"
        },
        "1132":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...his growth started as he fills up his room.",
                "...he gets outside & started to grow.",
                "...nothing happens yet as he was getting hungry."
            ],
            "content":"<div class=\"\"><div> <span>Cameron is a 12 year old boy who just came home from some kind of the magic shop. He tells the counter named merlic the wizard about the reason why he needs it for. He was a small lad who was just 5'1 feet tall &amp; he is the smallest of the famliy &amp; he hates being small when some of them insults him, even his weight when they called him skinny as he was a fuzzy eater years ago but for 123lbs is still progressing indeed but he thought that was not enough.<br>\r\n<br>\r\nSo Merlic decided to gave him a magic bottle which contains growth formula &amp; tells him to take a light sip or else something goes wrong. So Cameron thanked Merlic for the bottle &amp; that's why it all started as he went to his room which his house got a bungalow. Cameron smiles as he wasted no time but to drink the magic bottle. But he knows what Merlic has said to him about a light sip but he didn't care &amp; he wants to be big anyway.<br>\r\n<br>\r\nHe's gonna be the biggest of the family as he drinks the whole bottle of magic potion waiting for his growth to begin until... </span></div></div>",
            "created":1299646800,
            "id":1067879,
            "title":"This is Cameron's story."
        },
        "114":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996448,
            "title":"Magic Candy Bar"
        },
        "12":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Growth Machine",
                "Drinking Potion",
                "Magic Ring",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Andrew got effected by...?</span></div></span></div>",
            "created":1290056400,
            "id":996450,
            "title":"Alexander"
        },
        "121":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth</span></div></span></div>",
            "created":1290056400,
            "id":996453,
            "title":"Ray Gun"
        },
        "122":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996458,
            "title":"Growth Machine"
        },
        "123":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996463,
            "title":"Drinking Potion"
        },
        "1231":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...drink it now.",
                "...save it for later.",
                "...phone a friend for a help."
            ],
            "content":"<div class=\"\"><div> <span>When it comes to farming, then you know it matter for these generations.  14 year old Alexander have been working on the farm since he was seven and he's the 3rd generation fielder after both his father and grandfather were working for many years and and he wants this to continue what family have down and still going strong.  Today, Alexander is going to seed the sets of vegetables to grow after the last sets have fully grown to its right amount so it's the right time to plant them once again.<br>\r\n<br>\r\nSo Alexander left the house from the back of the house because the shed he is approaching are in the backyard for safe keeping and when I mean 'the' shed, the family has two.  One for the tools and the other for the bags of soil and other things to plant, plus the other place in the backyard is a greenhouse in which where the plants that are in the pots are kept in storage.  He comes through the the tool shed to get gloves and a small spade which he only needs anyway since it was the small seeds to plant it in.  He got what he needed but before he would go and straight out to go the other shed, he spotted a item it shined into his eyes and he wondered what it was when it was all left in confusing to Alexander when he see's a unlabled bottle with liquid still filled it up and maybe it haven't been opened in ages.<br>\r\n<br>\r\n\"Mmm, that looks a bit strange to be left in there for ages.\"  Said Alexander before he holds the bottle looking curiously before he asks. \"I wonder what it tastes like?  I mean, should I drink it now or later after planting?\"  <br>\r\n<br>\r\nSo a big thought from Alexander who thinks of two ways by staring at the bottle and the vegetable pit with wood surrounding it.  It is a curious bottle he find but he was destined to drink it just to give it a try if it tastes good or not.  So he made his mind already and shrugged before he decided to...<br>\r\n</span></div></div>",
            "created":1385269200,
            "id":1698795,
            "title":"Usual day in the morning, but not one day!"
        },
        "12313":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Now",
                "Later"
            ],
            "content":"<div class=\"\"><div> <span>So a big thought from Alexander who thinks of two ways by staring at the bottle and the vegetable pit with wood surrounding it.  It is a curious bottle he find but he was destined to drink it just to give it a try if it tastes good or not.  So he made his mind already and shrugged before he decided to pick up a phone and call his friend to choose what Alexander should do instead.  He gonna call his friend named Peter who met him throughout their lives although he is older than him by a year and a month gap between them.  He understands that family traditions are more important than just doing whatever leisure they got but as long Alexander is free which he does, then that wouldn't be a problem for them anyway.<br>\r\n<br>\r\nHe waited for Peter to answer phone for the few seconds before he answered the phone.  \"Hello?\"  Peter's voice asked.<br>\r\n<br>\r\n\"Hey Pete it's me, I'm kinda into this strange thing and I need help.\"  Alexander replied.<br>\r\n<br>\r\n\"Struggling to find a tools you looking for again isn't?\"  Peter asked with a bit of a joke.<br>\r\n<br>\r\n\"It's not that, it's that strange bottle I found and it still filled in and I'm not sure should I drink it now or later?\"  Alexander was concerned while looking at the bottle again.<br>\r\n<br>\r\n\"But why do you ask me for that anyway?\"  Peter was curious to ask his friend's reason.<br>\r\n<br>\r\n\"It's just I got that planting thing to do and I'm not too good at choices when I'm working, so I thought I'm asking you for a help.\"  Alexander explained his reasons.<br>\r\n<br>\r\n\"Okay, it's either up to you, no matter what you want waiting to do.  But I might suggest that you should drink it _____ so that your mind would get you off choosing curiously.\"  Said Peter, telling his advice to what Alexander should do and stick with it.</span></div></div>",
            "created":1385269200,
            "id":1698811,
            "title":"Phone a friend"
        },
        "124":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996466,
            "title":"Magic Ring"
        },
        "13":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Growth Machine",
                "Drinking Potion",
                "Spell Book",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Andrew got effected by...?</span></div></span></div>",
            "created":1290056400,
            "id":996452,
            "title":"Andrew"
        },
        "131":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996457,
            "title":"Ray Gun"
        },
        "132":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996460,
            "title":"Growth Machine"
        },
        "133":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996465,
            "title":"Drinking Potion"
        },
        "134":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996467,
            "title":"Spell Book"
        },
        "14":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Growth Machine",
                "Drinking Potion",
                "Magic pills",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Alec got effected by...?</span></div></span></div>",
            "created":1290056400,
            "id":996473,
            "title":"Alec"
        },
        "141":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996482,
            "title":"Ray Gun"
        },
        "142":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996484,
            "title":"Growth Machine"
        },
        "143":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996496,
            "title":"Drinking Potion"
        },
        "144":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996497,
            "title":"Magic pills"
        },
        "145":{
            "choices":[
                "Yes.",
                "No.",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about he just suddenly starts growing?</span></div></span></div>",
            "created":1452920400,
            "id":2090088,
            "title":"more choices"
        },
        "1451":{
            "choices":[
                "More growth happens.",
                "Alec plays with his fat.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>It was the start of the summer vacation. At 10 a.m most teens would be outside, enjoying the sun, but not for Alec. He liked sleeping in at this time around, exspecialy when he had nothing to do today.<br>\r\n<br>\r\nWhen his alarm clock hit 10 a.m, it sounded a typicle alarm clock cry. A hand banged agianst it, shutting the cry off. Alec groaned as he got up. He threw the covers off if him, exposing that he was only dressed in a boxer.He got up and went down stairs for breakfast. <br>\r\n<br>\r\nThe kitchen was deserted. Alec founded a note on the fridge left by his dad. It said, 'Off to work early. Would be back tonight. Love-Dad.' Alec smiled to himself. The hole house was his for today. <br>\r\n<br>\r\nAlec went to the fridge and opened it. He pilled numorous items on it: leftover chicken from last night, dozens of donuts, and a tub of ice cream.<br>\r\n<br>\r\nHe started to eat and eat and eat, until the food was gone. He patted his engorged stomach, letting loose a belch. \"That was *urp* nice,\" he said. He got off from the kitchen chair and went to the living room to watch some TV.<br>\r\n<br>\r\nHe he was about to enter the living room, he felt something strange. His belly began to growl. Suddenly, for some reason, the world began to shrink around Alec.<br>\r\n<br>\r\nHis boxer became very tight around his waist. He looked at himself and saw a belly growing fourth from his body. Soft moobs followed, sagging from his chest.<br>\r\n<br>\r\nWhen the growth finally stoped, Alec saw tgat he was atleast 7 feet tall and gained 50 pounds. Alec was scared but intreaged. He had little idea what happened, but he was starting to like it.</span></div></div>",
            "created":1452920400,
            "id":2090097,
            "title":"Alec's growth."
        },
        "15":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Peter",
                "Leo",
                "Jack",
                "Thomas",
                "more to come"
            ],
            "content":"<div class=\"\"><div> <span>How about this choice:<br>\r\n<br>\r\nPeter: 15 year old, 5'5ft, 131lbs black hair<br>\r\n<br>\r\nLeo: 13 year old, 5'2, 179lbs, black hair<br>\r\n<br>\r\nJack: 12 year old, 5'1, 113lbs, long blonde hair<br>\r\n<br>\r\nThomas: 16 yr old, 5'5ft, 125lbs, brown hair<br>\r\n</span></div></div>",
            "created":1290056400,
            "id":996443,
            "title":"More Fat Boys"
        },
        "151":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Growth Machine",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Peter got effected by...?</span></div></span></div>",
            "created":1290056400,
            "id":996475,
            "title":"Peter"
        },
        "1511":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996481,
            "title":"Ray Gun"
        },
        "1512":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996486,
            "title":"Growth Machine"
        },
        "152":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Drinking potion",
                "Magic pond (like he fell down & lands from his butt",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Leo got effected by...?</span></div></span></div>",
            "created":1290056400,
            "id":996492,
            "title":"Leo"
        },
        "1521":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996493,
            "title":"Drinking potion"
        },
        "15211":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...right now?",
                "...the day at the nationals. a month later."
            ],
            "content":"<div class=\"\"><div> <span>At just 13 years of age and 5'2, Leo is the member of the Peterhead sumo wrestling just weighed at 500lbs.  He's been a member of the club for a past year, despite he was still chubby from his original size, he still likes the heavy bloated kid that he always wanted to be when he learned from his uncle.  Since he joined the club, Leo was on the roll when he recently won the county tournament against other local clubs 4 months ago in the Aberdeenshire area.  Even his coach (which is his uncle) is very proud what his nephew done during the past year.<br>\r\n<br>\r\nToday as by winning the tournament, Leo is just got a month to prepare to compete for the national championship tournament in Edinburgh where the winner will represent Scotland to compete for the World Championships at New York City in United States in 4 months time.  But this time there's a big twist where his uncle named Joe met Leo (his nephew) for the big change for the two big tournaments happening.<br>\r\n<br>\r\nJoe: Hey Nephew! How's it goin buddy?<br>\r\nLeo: Hey Uncle Joe! What's up?<br>\r\nJoe: Well remember you got a month before we heading down to Edinburgh for the nationals yeah?<br>\r\nLeo: Yeah I'm working on it! Why? <br>\r\nJoe: Well there's a big change we need to know from now until the big day.  The HQ announced that for the first time ever, the challengers who are competing next month which is you Leo are gonna compete as gigantic sumo wrestlers. That's including any major championsips including the worlds.<br>\r\nLeo: WOW! Really? This is gonna be awesome! Me as a fat giant I would love to tower all over the universe including you uncle.<br>\r\nJoe: Yeah but remember your challengers also be fat giants you know.<br>\r\nLeo: Oh Yeah I remember! But How does it possible of me becoming a fat giant?<br>\r\nJoe: Well the HQ gave me this bottle contains growth formula itself and the rules say that the height must be at 200ft tall for the same avantage as the rest of the competitors. But they also said to gave the competitors a drink to test them out with their new size and to practice to wrestle their purpose robotic Godzilla to give yourself a warm up before the big day only if you want to do this right now or on the day at the nationals?<br>\r\nLeo: Ok then! How about I'm doing this...<br>\r\n</span></div></div>",
            "created":1318741200,
            "id":1207780,
            "title":"Sumo championship with the twist for Leo"
        },
        "1522":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996494,
            "title":"Magic pond (like he fell down & lands from his ..."
        },
        "15222":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...he grew 5 feet tall making him 10'2ft tall.",
                "...it was only a dream."
            ],
            "content":"<div class=\"\"><div> <span>It was a wet &amp; cold day as Leo a 13 year old boy who weight a massive 400lbs is walking home from the indoor fair which in fact it was a overweight  people's fair day. He really enjoyed the fair &amp; more importantly he enjoyed the moment that he finally had a chance to sit on skinny people's face as part of the lesson that he learned from his club.<br>\r\n<br>\r\nJust as he's approaching home from the fair, a biker rides in unsteady as he was drunk &amp; nearly runs over Leo as he fell his butt right on the pond &amp; he wasn't happy about what a biker nearly did to Leo.<br>\r\n<br>\r\nLeo: Hey! Watch where you doing you idiot!<br>\r\n<br>\r\nHe shouted as a drunk biker rides away from him. Leo struggles to get up as he saw the the back of his gym pants was so wet as he let's out with sigh! But he continued walking home anyway until he had a strange feeling all over his fat body. Then he noticed that the bench was getting smaller &amp; so does the trees &amp; some of the people passes him. Leo didn't know what was going on until he noticed that ...<br>\r\n<br>\r\n</span></div></div>",
            "created":1290056400,
            "id":996524,
            "title":"Leo's unusual growth."
        },
        "153":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Drinking Potion",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Jack got effected by...?</span></div></span></div>",
            "created":1290056400,
            "id":996499,
            "title":"Jack"
        },
        "1531":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996504,
            "title":"Ray Gun"
        },
        "1532":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996507,
            "title":"Drinking Potion"
        },
        "154":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Growth Machine",
                "Magic Diamond",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Thomas got effected by...?</span></div></span></div>",
            "created":1290056400,
            "id":996502,
            "title":"Thomas"
        },
        "1541":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996506,
            "title":"Growth Machine"
        },
        "1542":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1290056400,
            "id":996509,
            "title":"Magic Diamond"
        },
        "1543":{
            "author_id":"classics_nerd",
            "author_name":"Classics_Nerd",
            "choices":[
                "Conventional.",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          More conventional weight-gain or something else?</span></div></span></div>",
            "created":1477890000,
            "id":2231018,
            "title":"more choices"
        },
        "155":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "James",
                "Bradley",
                "More boys please!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these 2 boys I present to you now?<br>\r\n<br>\r\nJames: 16 years old, 5'2ft, 118lbs, brown hair<br>\r\n<br>\r\nBradley: 12 years old, 4'9ft, 123lbs, brown hair</span></div></span></div>",
            "created":1331874000,
            "id":1295748,
            "title":"more to come!"
        },
        "1551":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Drinking Potion",
                "more items"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did James got effected by...?</span></div></span></div>",
            "created":1331874000,
            "id":1295749,
            "title":"James"
        },
        "15511":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1331874000,
            "id":1295750,
            "title":"Ray Gun"
        },
        "15512":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1331874000,
            "id":1295751,
            "title":"Drinking Potion"
        },
        "1552":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Growth Machine",
                "more items"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Bradley got effected by...?</span></div></span></div>",
            "created":1331874000,
            "id":1295752,
            "title":"Bradley"
        },
        "15521":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1331874000,
            "id":1295753,
            "title":"Ray Gun"
        },
        "15522":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "fast",
                "slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or a slow growth?</span></div></span></div>",
            "created":1331874000,
            "id":1295754,
            "title":"Growth Machine"
        },
        "1553":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "matthew",
                "ben",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>hows about these<br>\r\n<br>\r\nmatthew: 13 years old 4'9ft, 100lbs, blond hair<br>\r\n<br>\r\nben: 12 years old, 4'5ft 95lbs, blond hair</span></div></span></div>",
            "created":1391922000,
            "id":1742832,
            "title":"More boys please!"
        },
        "15533":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Carson Lueders",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So I’m gonna use this as a internet celebrity/singer for this one.  So we’ll see how it goes.<br>\r\n<br>\r\nCarson Lueders: 15 years of age, 5’3, 100lbs, bleach blonde hair</span></div></span></div>",
            "created":1522472400,
            "id":2472607,
            "title":"How about this celeb?"
        },
        "155331":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Drinking Potion",
                "Growth Machine",
                "A Wishing Ring",
                "More Items"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you chose Carson Lueders to grow into a fat giant.  But how does he grow so much larger to get there?</span></div></span></div>",
            "created":1522472400,
            "id":2472609,
            "title":"Carson Lueders"
        },
        "1553311":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want this as a fast growth or a slow growth</span></div></span></div>",
            "created":1522492920,
            "id":2472610,
            "title":"Ray Gun"
        },
        "1553312":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want this as a fast growth or a slow growth?</span></div></span></div>",
            "created":1522492920,
            "id":2472611,
            "title":"Drinking Potion"
        },
        "1553313":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want this as a fast growth or a slow growth?</span></div></span></div>",
            "created":1522492980,
            "id":2472612,
            "title":"Growth Machine"
        },
        "1553314":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want this as a fast or a slow growth to start the story?</span></div></span></div>",
            "created":1601075640,
            "id":2909933,
            "title":"A Wishing Ring"
        },
        "155332":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Gavin Magnus",
                "Walker Bryant",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Alright, so what about these two online stars then!<br>\r\n<br>\r\nGavin Magnus, aged 13<br>\r\n<br>\r\nWalker Bryant, aged 13<br>\r\n<br>\r\nI wouldn’t want to guess their height and weight since some of the bios can be inaccurate, so you can make use the imagination figure it out, so yeah! </span></div></div>",
            "created":1601075760,
            "id":2909936,
            "title":"How about these two online celebs?"
        },
        "1553321":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Potion",
                "Growth Machine",
                "A Wishing Ring",
                "More Items"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You chose Gavin Magnus to grow into a giant fat boy.  How did that happen to start off the story?</span></div></span></div>",
            "created":1601075820,
            "id":2909938,
            "title":"Gavin Magnus"
        },
        "15533211":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want the fast or slow growth to start the story?</span></div></span></div>",
            "created":1601075880,
            "id":2909939,
            "title":"Ray Gun"
        },
        "15533212":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want the fast or slow growth to start the story?</span></div></span></div>",
            "created":1601075880,
            "id":2909940,
            "title":"Potion"
        },
        "15533213":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want the fast or slow growth to start the story?</span></div></span></div>",
            "created":1601075940,
            "id":2909941,
            "title":"Growth Machine"
        },
        "15533214":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or slow growth to start the story?</span></div></span></div>",
            "created":1601076000,
            "id":2909942,
            "title":"A Wishing Ring"
        },
        "1553322":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Ray Gun",
                "Potion",
                "Growth Machine",
                "A Wishing Ring",
                "More Items"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You chose Walker Bryant to grow into a fat giant boy.  But how did it happen to start off the story?</span></div></span></div>",
            "created":1601076060,
            "id":2909943,
            "title":"Walker Bryant"
        },
        "15533221":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or slow growth to start the story?</span></div></span></div>",
            "created":1601076120,
            "id":2909945,
            "title":"Ray Gun"
        },
        "15533222":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or slow growth to start the story?</span></div></span></div>",
            "created":1601076180,
            "id":2909946,
            "title":"Potion"
        },
        "15533223":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or slow growth to start the story?</span></div></span></div>",
            "created":1601076180,
            "id":2909948,
            "title":"Growth Machine"
        },
        "15533224":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Fast",
                "Slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a fast or slow growth to start the story?</span></div></span></div>",
            "created":1601076240,
            "id":2909949,
            "title":"A Wishing Ring"
        }
    },
    "info":{
        "author_id":"pedro01",
        "author_name":"pedro01",
        "brief_description":"The boys see's themselves getting taller and fatter at the same time. ",
        "created":1290129300,
        "description":"<td align=\"left\" class=\"norm\">Just a remind you before we get any further, this story is actually a sequal from \"Teen Boy's Weight Gain\".  So if you to read that one then you're very welcome.  So as for this rules as follows:<br>\r\n<br>\r\n*No sex &amp; No toilet stuff (Stay it clean)<br>\r\n<br>\r\n*Only the main characters of this story can grow into fat giants but not others.<br>\r\n<br>\r\n*They must stay mobile as they're keep on balance<br>\r\n<br>\r\n*Their  can rips but not the underwear/speedos I don't want them nude<br>\r\n<br>\r\n*All of the charcters are human so no weird stuff please.<br>\r\n<br>\r\n*Please use good grammar &amp; spelling 100%!<br>\r\n<br>\r\n*This is not a shrinking or a weight loss story so please stay in topic<br>\r\n<br>\r\n*Please do not add charcter's future age. Stay with the character's current age!<br>\r\n<br>\r\n*They cannot die in this story<br>\r\n<br>\r\n*I don't want the end of this story. Keep Adding!<br>\r\n<br>\r\nAnd one last thing, Have fun &amp; enjoy this story.<br>\r\n<br>\r\nUPDATE 27/1/13: This is a warning for those who adds the chapters of this story from this update as from now on I don't want any short chapters of this story at all. If you add any chapters with one sentence, one paragraph or less then three lines of this story will be automatically deleted indefinitely so please read the rules before adding.<br>\r\n<br>\r\nUPDATE 5/10/19: I'm also interested in roleplay, if you want to have a go?  If so, either let me know either here or on Discord pjc-fc#4186 and I’ll see what we can come up for this.</td>",
        "id":1725611,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1601076240,
        "modified":1601076240,
        "pretty_title":"Attack of the Fat Giant Teen Boys"
    }
}