{
    "chapters":{
        "1":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Man",
                "Woman "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a man or a woman? </span></div></span></div>",
            "created":1440997200,
            "id":2028065,
            "title":"Who are You"
        },
        "11":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Be Tickled ",
                "Tickle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would you like to be tickled or tickle? </span></div></span></div>",
            "created":1440997200,
            "id":2028066,
            "title":"Man"
        },
        "111":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Disney",
                "Pixar ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What movie studio or TV show company is the female tickler(s) from?  </span></div></span></div>",
            "created":1440997200,
            "id":2028067,
            "title":"Be Tickled "
        },
        "1111":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Snow White",
                "The Blue Fairy (Pinnochio) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Disney female(s) will be tickling you? </span></div></span></div>",
            "created":1440997200,
            "id":2028072,
            "title":"Disney"
        },
        "11113":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Alice (from Alice in Wonderland) ",
                "Wendy Darling (from Peter Pan) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more options:</span></div></span></div>",
            "created":1440997200,
            "id":2028074,
            "title":"Other"
        },
        "111131":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Normal sized",
                "Giant-sized Alice is even better!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be regular sized Alice or giant-sized Alice doing the tickling?</span></div></span></div>",
            "created":1452142800,
            "id":2085677,
            "title":"Alice (from Alice in Wonderland) "
        },
        "1111312":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "To playfully tickle you(licking you,kissing,playful taunts,blowing raspberries ",
                "the tickling turns sexual(sadism,tickle tools,taunting"
            ],
            "content":"<div class=\"\"><div> <span>You were stuck in a Disney movie (Alice In Wonderland to be exact), having no idea how you could have gotten there, and were busy trying to find your way out when you were startled by booming earthquaking footsteps that made the ground tremble violently <br>\r\n<br>\r\n\"First White Rabbits,disappearing cats, mad hatters and now earthquakes?\" you though to yourself. You didn't know how much more you could take when the huge shadow appeared over you and you shivered: it was a gigantic Alice; she must have eaten a entire mushroom to be towering over the trees like that! She was curiously looking right at you!<br>\r\n<br>\r\n\"Oh my! A tiny boy, how delightful! I thought I was the only person stuck here! I'm so happy to see someone other than me! Hello there who are you?\" the giant girl asked cheerfully as she slowly reached down for you. <br>\r\n<br>\r\nThe moment you saw those huge fingers reaching for you, panic and fear set in. As you began running for your life, a puzzled look came over Alice's pretty face as she muttered \"Well that was very rude of him he didn't even introduce himself to me! I believe he needs to learn some manners!\" <br>\r\n<br>\r\nAs she began stomping after you you couldn't get any solid footing as her booming footsteps send you flying into a nearby tree. Alice managed to grab onto you before you hit it at full force. You screamed as you saw her huge billboard sized face. <br>\r\n<br>\r\n\"Why did you run away from me?\" she asked. \"I wasn't going to hurt you. Tell me who you are please maybe I can help you.\" But you were far too frightened, and a bunch of swear words escape from your mouth. Gasping loudly, Alice cried out \"Oh my, how rude of you to say such horrible words, especially to someone as young as me! You deserved to be punished for that! Since you want to act like a rude person I'll treat you like one!\" With that she begins to </span></div></div>",
            "created":1452142800,
            "id":2085836,
            "title":"Giant-sized Alice is even better!"
        },
        "11113121":{
            "author_id":"phantomz",
            "author_name":"Phantom Z",
            "choices":[
                "Run for it!",
                "Talk to Alice"
            ],
            "content":"<div class=\"\"><div> <span>\"I wonder what would happen if I...\"<br>\r\n<br>\r\nAlice takes two fingers and begins to tickle your tiny stomach, causing you to laugh.<br>\r\nSeeing your reaction, Alice's face turned into a large devious grin,<br>\r\n<br>\r\n\"OoOoh, the tiny boy is ticklish!\"<br>\r\n<br>\r\nBefore you could catch your breath, Alice took her two fingers and began to pull your shirt over your head, but she accidentally ripped it. The fabric fell to the ground as she removes your pants, leaving you in your underwear,<br>\r\n<br>\r\n\"Look at the wittle ticklwish baby,\"<br>\r\n<br>\r\nShe cooed as she brought you closer to her mouth, placing ticklish kisses on you, that touched your whole body at once.<br>\r\nSuddenly, she inhaled and blew a huge raspberry on you, sending you into hysterics,<br>\r\n<br>\r\n\"You're all wed, what the matter, does it tickle?\"<br>\r\n<br>\r\nAlice teased before planting another raspberry on you, you try to squirm around but you couldn't move far enough to get any relief.<br>\r\nAfter what felt like a million raspberries, Alice pulls you away from her mouth, a huge grin on the blonde girl's face.<br>\r\n<br>\r\n\"You're so red!\"<br>\r\n<br>\r\nShe could barely manage to speak without giggling,<br>\r\n<br>\r\n\"You must be a lollipop!\"  <br>\r\n<br>\r\nAlice playfully concluded, before pulling you back in, but this time she took a long slow lick with her giant tongue from your feet to your head. This tickled immensely, but the blonde girl wasn't done, she licked you again and again causing a total outburst of laughter.<br>\r\n<br>\r\n\"Mmmmh! This lollipop is soooo goood!\"<br>\r\n<br>\r\nAlice teased as she continued to lickle your tiny body. Eventually you passed out from laughing so much. <br>\r\nWhen you woke up, you were lying in the grass by the tree, Alice sitting next to you looking at the sunset. She probably wouldn't notice if you tried to get away...<br>\r\n</span></div></div>",
            "created":1574372820,
            "id":2749837,
            "title":"To playfully tickle you(licking you,kissing,pla..."
        },
        "11113122":{
            "choices":[
                "You ask Alice to get nude"
            ],
            "content":"<div class=\"\"><div> <span>\"Well my little man, I guess I'll have to teach you some manners by tickling you.\" <br>\r\n<br>\r\nAlice takes her two fingers and starts tickling your little stomach which causes you to laugh. The light brush of your pale girlish fingers made you squirm with delight. <br>\r\n<br>\r\nAlice starts laughing as she sees you squirming in her hand laughing.<br>\r\n<br>\r\n\"No please! Alice, haha, please stop!\" You both are laughing uncontrollably as you continue to be tickled by the giant blonde girl. <br>\r\n<br>\r\n\"You're so adorable, I really wonder what you look like without those clothes.\" <br>\r\n<br>\r\nYou stop laughing.<br>\r\n<br>\r\n\"Wait my clothes?\" Alice doesn't stop tickling you, instead her fingers go south from your stomach and start tickling your penis. You feel the sensation of the giantess tickling your tiny crotch when she pulls on your pants, and pulls your shirt over your head. You are squirming in her giant hand wearing only your tighty whities. <br>\r\n<br>\r\n\"My tiny little man in his underwear, let me get those for you.\" Alice reaches down and removes your underwear leaving you completely naked in the girl's palm. Alice then sticks out her tongue and tickles your naked penis with it. You laugh uncontrollably as precum starts to drip from your penis. Alice's giant tongue tickles your penis, your legs, butt, and arm pits. You lie down exhausted from all of the tickling and look up at the smiling blonde girl looking down at you with delight. <br>\r\n<br>\r\n\"My goodness gracious, tickling and tasting you was one of the most delightful experiences I've ever had, and may I say that your tiny penis is absolutely adorable. My tiny friend, is there anything that I can do for you now that you've given me so much pleasure.\" <br>\r\n<br>\r\nYou look into the big curious and beautiful blue eyes of the giant Alice and think about what you really want. </span></div></div>",
            "created":1509918780,
            "id":2411524,
            "title":"Alice's Tickle Toy"
        },
        "111131221":{
            "choices":[
                "\"I want to play in your butt\"",
                "\"I want you to taste me\" "
            ],
            "content":"<div class=\"\"><div> <span>You feel increasingly more aroused as the young giantess holds you delicately in her hand, yet you still feel a little self conscious about being naked in front of Alice. You decide to maybe even the score a little bit.<br>\r\n<br>\r\n\"Well Alice, my dear, if you enjoyed seeing me naked, I would love to watch you undress as well.\" <br>\r\n<br>\r\n\"Oh dear, everything?\" <br>\r\n<br>\r\n\"You took all of my clothes, it's only fair, pretty please, my cute beautiful giantess.\" Alice blushed and smiled.<br>\r\n<br>\r\n\"Well I suppose fair is fair.\" Alice set you down at her feet and began to remove layers of clothing starting with her stockings and shoes leaving her barefoot with her cute lovely legs standing above you like skyscrapers. Alice then pulled her dress over her head leaving her in a small b-cup white bra and light blue panties on. \"This is rather strange, I must say\" Alice says as she became aware of her state of undress.<br>\r\n<br>\r\n\"Please just a little bit more, Alice, you stripped me down to nothing.\" Alice once again blushed a bright crimson, and in response, Alice unsnapped her bra and let it drop down. You actually hide to jump out of the way so that the bra wouldn't crush you.<br>\r\n<br>\r\nYou looked up and saw Alice's cute and perky boobs, which although not enormous, looked huge to you. Alice then bit her lip and like a band-aid pulled down her panties revealing her full naked body. Alice then awkwardly covered herself with one hand over her chest and the other between her legs. <br>\r\n<br>\r\n\"Alright little one, I suppose we're both naked now.\" Alice said with a chuckle.<br>\r\n<br>\r\n\"Yeah, I guess we are,\" you say also laughing. Alice when smiling reaches down with one of her hands, still trying not to show her breasts to you, she picks you up and holds you close.<br>\r\n<br>\r\n\"You are a very handsome little man, I do have to admit I haven't felt a feeling like this before.\" Your boner extends even farther then it probably has ever been.<br>\r\n<br>\r\n\"Well I know what it is, you think I'm sexy.\"<br>\r\n<br>\r\nAlice giggled an adorable laugh, \"I suppose I do find you sexy.\" <br>\r\n<br>\r\n\"And if I may say so my gigantic friend, you are really sexy too.\" Alice blushed at the compliment.<br>\r\n<br>\r\n\"Oh, you don't mean that.\" <br>\r\n<br>\r\n\"Of course, I do, in fact I don't know why you bother wearing clothes, you look better without them.\" Alice's entire pale white nude body was blushing due to your compliments. Alice then brought you up to her face and gave your naked body several long, wet, and sexy kisses. <br>\r\nYou felt you were in cloud nine as the sexy giant girl continued to kiss your nude form. The soft gargantuan lips of the precious beautiful blonde girl pressing into and away from your body nearly made you blow your load, but luckily you never reached that point. One final kiss onto your penis caused you to finally cum all over Alice's hand.<br>\r\n<br>\r\n\"Goodness, I never expected that playing with a tiny naked man would be so sticky.\" Alice rubbed the mess of your cum on her bare thigh. You stood up in Alice's hand proud of what you did.<br>\r\n<br>\r\n\"Excuse me, Alice my dear, there is something else that I would like to do if it would please you.\" Alice, still naked in her birthday suit looked down at you with curiosity.<br>\r\n<br>\r\n\"What do you want to do my little friend?\" </span></div></div>",
            "created":1510345380,
            "id":2413438,
            "title":"Alice's UnBirthday suit"
        },
        "111133":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Tinkerbell (from Peter Pan) ",
                "Princess Aurora (from Sleeping Beauty) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options:</span></div></span></div>",
            "created":1440997200,
            "id":2028077,
            "title":"Other"
        },
        "1111333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Shanti (from Jungle Book) ",
                "Princess Eilonwy (from the Black Cauldron) ",
                "Little Mermaid?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options:</span></div></span></div>",
            "created":1440997200,
            "id":2028078,
            "title":"Other"
        },
        "11113333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Princess Ariel (from Little Mermaid) ",
                "Melody (Ariel's daughter) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe from The Little Mermaid?: </span></div></span></div>",
            "created":1440997200,
            "id":2028081,
            "title":"Little Mermaid? "
        },
        "111133331":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Poking and tickling the sides of her smooth sexy stomach",
                "You simply use the seaweed to tie the mermaid to a old anchor"
            ],
            "content":"<div class=\"\"><div> <span>You are a  young undersea explorer exploring the Great Barrier Reef near the Atlantic Ocean dressed in your scuba gear and armed with a handcrafted harpoon in case you ran into any sharks or other predators harmful to humans for a while you see nothing but usual schools of fish swimming about which you snap pictures of with your underwater proof camera then as you began to search through a deep hidden underwater trench you see something far more fascinating than any fish or part of the Great Barrier Reef:A strange red haired girl with a purple seashell bra and bright green fish tail a mermaid swimming around humming to herself you were beyond awestruck by this and if you were underwater and didn't have a tank full of oxygen you would have choked to death due to your heavy breathing simply by staring at her was she a illusion or trick of the mind? You blinked twice and still she was there not even noticing you were a mere twenty feet away you had to get close enough to observe her but at the same time avoid her seeing you then looking around you spot a nearby long piece of seaweed you grab it and slowly you stretch it out enough to reach her midriff and began to</span></div></div>",
            "created":1458018000,
            "id":2117868,
            "title":"Princess Ariel (from Little Mermaid) "
        },
        "111133332":{
            "author_id":"hiccan",
            "author_name":"Hiccan",
            "choices":[
                "Eat up! This is your life now I guess.",
                "Make a break-err swim for it.",
                "Melody has some friends who she wants to show her new toy."
            ],
            "content":"<div class=\"\"><div> <span>Well this was bad. <br>\r\n<br>\r\nYou'd always dreamed of going to sea your entire life. You'd waited until your 19th birthday and immediately signed on with the first ship that had sailed into your little port town regardless of how drunk the captain had been.You'd accomplished your dream of going to sea! Falling overboard was not something that was part of that though.<br>\r\n<br>\r\nNow here you were stuck on a rock barely big enough to lie down on. You'd been here for a couple days now and it was taking it's toll. Thankfully it rained alot so you were ok on water but food was something you hadn't had in a while. Your ribs were very noticeable due to that and you'd gotten very skinny. You hadn't eaten in days. At first you'd tried catching some yourself but you'd seen something swimming around that was about your size and it kept getting closer so you'd decided to play it safe and stay on the rock until it left.<br>\r\n<br>\r\nThat was two days ago. Whatever it was still around sometimes it left but anytime you spent too much time in the water it was back. Today though it did something new it had just stayed still when you were in the drink. You'd watched it for a bit and it had watched you until eventually it had swam off and let you relax in the sea. You'd fallen asleep in the waist deep sea-water after awhile and had an amazing dream, You had been rescued and had food in front of you. Each bite of syrup soaked-deliciousness was like heaven to you and each tastebud in your mouth savored it.<br>\r\n<br>\r\nYou woke you up from your dream feast right before you got to take even a single bite. You'd been soaking your feet in the water and had fallen asleep. How long had you been out? You felt something odd swishing between your toes and looked down to see a girl in the water playing with your toes.<br>\r\n<br>\r\n''WAIT WHAT?!''<br>\r\n<br>\r\nShe started at your scream of confusion and clutched your feet almost protectively to her chest.<br>\r\n<br>\r\n''Oh.. your awake now..''<br>\r\n''Where'd you come from?!''<br>\r\n''What do you mean?''<br>\r\n''We're out in the middle of the ocean! Did you get shipwrecked too?''<br>\r\n''Oh no I live out here.''<br>\r\n<br>\r\nShe pulled herself out of the water and you gasped at her legs..or more like the lack there of. Instead there was a fishy lower half that betray ed her as...<br>\r\n<br>\r\n''YOU'RE A MERMAID?!''<br>\r\n''YOU'RE A HUMAN?!''<br>\r\n''Wh-?!''<br>\r\n''I thought we were saying obvious things at each other? Are we not? Of course I'm a mermaid why else would I be out here in the middle of the sea on top of a mermaid's home?''<br>\r\n''W-what'd you mean?''<br>\r\n''You are on top of of where I keep my collection what don't you understand?''<br>\r\n''Your collection?''<br>\r\n''Yes my collection of human things. They really interest me, humans like you. It's a quirk I picked up from my mother.''<br>\r\n''So can you help me?!''<br>\r\n''Help you what? Be rude?! You don't seem to need help with that.''<br>\r\n''...Sorry?''<br>\r\n''You should be after staying on top of my collection for so long taunting me?''<br>\r\n''I didn't mean- I wasn't taunting you!''<br>\r\n''What else would you call dangling these in front of me?''<br>\r\n<br>\r\nShe pulled hard on your feet again ending your attempt at getting up and returning to her inspection of them. She stuck one dainty finger into your toes and observed how it got you giggling.<br>\r\n<br>\r\n''He-hey hehe don't heh.''<br>\r\n''Hmm?''<br>\r\n<br>\r\nShe continued playing with your poor toes not really noticing your giggles. She absentmindedly started singing to herself as your protests continued unheard.<br>\r\n<br>\r\n''C'm-*snnnrk* stop hehe. Hey hahee stop it. Leheego!''<br>\r\n''This little pufferfish went to market and this little pufferfish stayed home. This little pufferfish had grilled kelp and this pufferfish had none!''<br>\r\n''Are yo-haha . Are you hahaha even lihihistening to mEHE AHH GAHAWD!!''<br>\r\n''AND THIS LITTLE PUFFERFISH WENT BLUB, BLUB, BLUB ALL THE WAAAY HOME!''<br>\r\n<br>\r\nShe scratched a lane down to your heel then followed back for another round as you went wild. You were so weak from hunger that you didn't have enough energy to try and pull away. She spider-tickled up and down your sole but ceased when she realized you needed a break.<br>\r\n<br>\r\n''Oh I love that. What do you humans call that again?''<br>\r\n<br>\r\nShe pulled herself out of the water and crawled up next to you on your rock as you gasped like YOU were the fish out of water. She pouted and lifted up your tattered shirt, so that she could rest her hand on your smooth and ticklish belly making her threat clear.<br>\r\n<br>\r\n''T-tickling! W-we call it t-tickling! Please no-no more, I'm begging you!''<br>\r\n''That's better now. My name is Princess Melody and my family rules over the sea and I am delighted at this situation and can see you smiling at having met me already.''<br>\r\n<br>\r\nShe stroked along your belly making you quiver and whine. She stuck one finger into your belly button and continued.<br>\r\n<br>\r\n''I've always been fascinated by humans. They've been sailing along out here for years but honestly I just don't like crowds. I've watched your kind and they're just so delightfully quirky. What with your sensitive fins and how you just love attention.''<br>\r\n''Wh-whaHAHA nonononhoho''<br>\r\n''Hush I'm still talking. You'll want to know these rules since this is how your life will be from now on. Are you hungry?''<br>\r\n<br>\r\nThat snapped you out of it.<br>\r\n<br>\r\n''YE-YES! YES!''<br>\r\n''Ohh? You are? How hungry are you?''<br>\r\n''S-SO HUNGRY!''<br>\r\n''Well what would you do for some tasty oysters''<br>\r\n''An-anything please just let-''<br>\r\n''What place on you would tickling be the worst?''<br>\r\n''Hu-what?!''<br>\r\n''Tell me.''<br>\r\n''Bu-but I-''<br>\r\n''Where is your worst spot? As your new owner I think I'm entitled to know.''<br>\r\n''My wha-HAHAHA''<br>\r\n''Don't you want something tasty in this belly-welly of yours? You can either tell me and have some food in there or clam up and and I'll just play with it.''<br>\r\n''Pleeheease I'm so haha so haha so haha- I'M STAHAHrVING!''<br>\r\n''Then tell me silly. I'll give you some food and bring you some amenities.''<br>\r\n''Alright! Alright hahahee stop!''<br>\r\n''Oh? Got something to say?<br>\r\n''Yehhehes!! Ahahall over!''<br>\r\n''Mmm what was that?''<br>\r\n''I'm ha ha- I'm ticklish all over!''<br>\r\n''Oh boo that's so non-committal. C'mon I live in the ocean and I think that's just too wishy-washy. You've got to have one specific spot that's worse.''<br>\r\n''But-but I doOHOHO-OH PLEASE NO~''<br>\r\n<br>\r\nShe'd dug on in to your ribs. Sticking her fingers in between them and vibrating them as you thrashed weakly below her. She smiled at the tears starting to creep out of your screwed shut eyes. She dipped low and ran her fishy, clammy feeling tongue up your chest then licked her lips.<br>\r\n<br>\r\n''OK!-OKHOHK!! MY BUTT! HAHAHA IT'S MY BUTT!''<br>\r\n''Ohh? See was that sooo bad?''<br>\r\n''It...it wasn't great.''<br>\r\n''Now roll over and take your pants down.''<br>\r\n''Ohh no come on-''<br>\r\n''Don't worry I'm not a mean princess. I'm going to go get your rewards and change a bit just for you. I want a nice sight when I come back up. Now do it my sweet little sea cucumber.''<br>\r\n''Fi-fine just no more tickling.''<br>\r\n''For now sure now do it.''<br>\r\n<br>\r\nAs you pulled down the rags that passed as your pants she slipped back into the water as you rolled over onto your stomach. She surfaced on the other side of the rock quickly to make sure you were following orders then submerged once more. Your eyes screwed shut and the tears came forth as you thought about the this unbelievable situation you were in. How had just wanting to be a sailor turned into being a pet?!..But food did sound amazing right now and it's not like you could swim away on an empty stomach.<br>\r\n<br>\r\n''COME ON!'' you screamed to nobody in particular. A passing seagull cawed back at you almost as if it was saying ''Sucks to suck nerd.''<br>\r\nYou tried to get up but had no energy and just fell back on your face. The sun was hot but at least the part of your face on the rock was cool on the rock. Time passed and you had no idea until a pair of feet snuck into your vision and eventually filled them. You felt a female frame sit down on your back pinning you to the ground.<br>\r\n<br>\r\n''Now that's EXACTLY what I wanted to see when i came back.''<br>\r\n''F-food was promised.''<br>\r\n''How cruel. I go and change into my human legs just for you and you don't even mention it.''<br>\r\n''Wai-wait what?''<br>\r\n''Oh yeah I've got someone for that. Human legs are fun but they're not really practical for getting around. A fin ways better to get around in the seas but why not have ten toes for right now to match with my brand new pet. Seems like it'd be more comfortable for you for us to match. Y'know since we're about to sleep together.''<br>\r\n''We're what!? I-I-''<br>\r\n<br>\r\nYour innocent stammering's were cut off by the feeling of a wet yet warm cheek on your cheek's and not the ones on your face. You jumped like the sweet little cherry you were but were pushed back down.<br>\r\n<br>\r\n''Simmer down my little sea cucumber. I've heard that humans like this and I've heard quite a few times the expression. 'Ass like a pillow'''<br>\r\nPrincess Melody the crazy mermaid who now claimed to own you yawned almost cutely.<br>\r\n''Time to test that. It is nice and soft though.''<br>\r\n''Th-there was talk of foo-''<br>\r\n''What a one-track mind you have it's pretty cute to me honestly. Hang on just a minute.''<br>\r\n<br>\r\nThe two cute pink feet that looked that they'd barely ever touched ground disappeared from your view and came back a few seconds later bearing gifts sitting on the soles was now a good few raw oysters on each one. The toes flexed almost as if saying come hither and if you weren't absolutely starving you'd say that was the most beautiful part. But you were starving so it was still the food.<br>\r\n<br>\r\n''Eat up lover boy then have a good full ticklish belly sleep with your new owner. Cause tommorow's another day.''</span></div></div>",
            "created":1513981080,
            "id":2431515,
            "title":"Melody (Ariel's daughter) "
        },
        "1111333321":{
            "author_id":"hiccan",
            "author_name":"Hiccan",
            "choices":[
                "Melody's friends are Suckerfish with a taste for toesies!",
                "Melody's friends are a gaggle of naughty sea-monkey's!",
                "A certain Sea-Witch see's her chance...."
            ],
            "content":"<div class=\"\"><div> <span>Some men would have tried to wiggle themselves free and spilled those delicious oysters in the process. Some men would have refused as an act of defiance.They would have told this princess that they were a man and not her toy. Found some way to swim out of here and leave this tickle hungry trout of a woman to find a new pet. Those men had never been as hungry as you were when you immediately went face down into that delicious food. You swallowed a good few whole by virtue of just trying to cram as many as you could into your mouth as fast as you could. Your tongue went to town so as to get the last remaining slime of the delicious meat and earning you a hard slap on the bottom from oh so generous benefactor as she giggled.<br>\r\n<br>\r\n''Heeehee cahalm down there sweetie. No funny stuff back there. Just eat your food and head off to sleep. We'll have a long time to play with each other tomorrow.''<br>\r\n''Bu-but-''<br>\r\n''You don't get any butt's here. I do though! And mmmhmm is it comfy!''<br>\r\n<br>\r\nWith that she withdrew her legs and used them to force you face first into the ground. You lightly struggled as she once slipped her soles back under your face. The cool wet skin felt amazing on your hot flushed face and despite yourself you drifted off to the land of nod with barely a whimper.<br>\r\n<br>\r\nWhen you woke up the next day you thought about that weird dream you'd had. Mermaids, Slavery and Shipwrecks yeah right! No dumb dream would keep you from signing on with the next ship tha-Wait no there was a set of arms around your waist and you were on a beach. Yep that was real, crap. You gingerly and quietly wiggled your way out of the tangled limbs of the sadistic and fishy princess who now claimed to be your owner. What exactly would a life as her pet be like you thought?<br>\r\n<br>\r\nSurely eventually she'd get bored of tickling you. Sure at first your toes would be twiggled, Your pitties scritched raw and oh the things that would go into your poor belly button would make you squeal but eventually it'd get better right? She'd lay off gradually and that's when your new life with the mer-folks would begin and start getting better! <br>\r\nAs you swam desperately from the island with the sleeping princess you chuckled under your breath thanking the gods that you weren't that naive,she was a heavy sleeper and that you'd always been a bit light on your feet. That last thing worked against as you as the feeling of something light brushing against your foot beneath the waves got you giggling again and sputtering as some salt water snuck it's way in. You kicked at whatever was to get free but only felt your leg sink into a big mass of something down there that felt the same as whatever you were trying to dislodge. With a stark realization you exclaimed to nobody in a panicked voice.<br>\r\n<br>\r\n''SOMETHING JUST TICKLED ME!''<br>\r\n<br>\r\nYour leg now stuck up to the knee in whatever almost feathery mess you'd blundered into your bad decisions for the days kept on coming as you tried to pull it off with one of your hands. It was worming it's way between your toes and swimming while laughing seemed like a bad idea. You blinked the saltwater from your eyes shocked at the fact that the thing that was now wrapped around your leg and arm now seemed to be nothing more than a free floating patch of seaweed! As if to mock you a few tendrils of the damned thing worked itself into your armpit to tease you and between your toes as well. You jerked reflexively at it driving your soft stomach into it and entangling you further in this horrible trap. Invading your belly button now a new problem popped up. You were in water and getting the bejeezus tickled right out of you was not helping your backstroke and because of that you were starting to sink. Kicking both legs in unison would help you but that would also lead to both your feet being unified inside your so-so-so stupid tickle prison. It really spoke to how dumb you thought this was that it wasn't until you were choking and sputtering out the seawater that you did it.<br>\r\n<br>\r\n''BLUHUHUHGHAAHAABLU-GEHEEEE''<br>\r\nWhoever you were calling out for help too though probably wouldn't understand that. Almost immediately it felt like it knotted around your big toes just strong enough to pull them back and immediately make you regret this. You started to sink down finding that using one arm wasn't enough to propel a laughing young adult through choppy waters. However just as you sank a strong pair of arms suddenly slipped into your prison and pulled you up. Some men would have thanked their lucky stars. Those men would have been so thankful to have just been saved from drowning. You however were swept up in a pair of extremely strong mermaid princess arms which were tickling away at your poor one exposed armpit. Melody played that pittie like it was a guitar and as she dragged you up to the surface where she hit the solo. As the pair of you headed back to your island prison with you serenading her with your frantic laughter, Melody fumed almost cartoonishly at your attempted escape.<br>\r\n<br>\r\n''I can't believe you tried to run away. After I went to all the trouble to save you twice now!''<br>\r\n''Hahahaahaplease''<br>\r\n''We're almost there you big ticklish baby.''<br>\r\n<br>\r\nShe threw you still trapped in your sopping seaweed prison onto the shore. You groaned and struggled as she snickered at your predicament and rolled you over towards a rock. You kicked and struggled hard inside the seaweeds but Melody slapped your hands away whenever they got in her way. She pulled you out of the feathery prison but tore off a few strips to tie your wrists behind your back. She then leaned you up against the rock and stared at you pouting.<br>\r\n<br>\r\n''Are they all as mean as you? When somebody saves you from drowning is the first thing all humans think of doing running away without even answering the generous offer that they were given? Or are you just as classless as you are weak,ticklish an-?''<br>\r\n<br>\r\nYou kicked her in the face with your wild struggling and the two of you immediately froze. Her in shock at your rudeness and you in fear at the expression of rage overtaking her face.<br>\r\n''Bad idea buddy.''<br>\r\n''I'm-I'm so-orry!''<br>\r\n''Oh you will be buddy. At first I was planning to keep you myself. Now though? Between the running away and the violent outbreaks I think my baby boy is a bit more than I can deal with all on my lonesome.''<br>\r\n''Wai-''<br>\r\n<br>\r\nA torn strip of seaweed silenced your plea as she gave you a stern look. She tied your ankles tightly as she lectured you about what you'd earned.<br>\r\n<br>\r\n''Now I think I'll have to get my sisters and ask them for help. Can you even imagine how embarrassing that is for me? For me to have to go and beg to my six older sisters for help with an unruly child? I could just die! To think I'd even brought you a treat!''<br>\r\nShe pointed to a pile of oysters she'd brought seemingly as a reward. In spite of your plight your stomach growled longingly at it causing the irate princess expression to soften a bit.<br>\r\n''Well it can't be helped I suppose. You're just lucky that a human as good looking as you doesn't just come floating along everyday. Can't have you running away again though so we'll have to take away your exercise privileges until I get back.''<br>\r\n<br>\r\nWith that she tied your ankles together tightly then tossed you over shoulder with frightening ease. She took you over to the shore and plopped you down by one of the tide pools. Then she placed your feets into the water and propped you up against another rock.<br>\r\nShe smiled then whistled before sticking her hand into the water.<br>\r\n''There now to keep you from getting too lonely while I'm out and to keep you out of trouble as well. I called a few of my fishy friends to keep an eye on you and a smile on your face. When my sisters get back we'll see about getting you back on the straight and narrow. Until then though...''<br>\r\n <br>\r\nWith that she went down and blew a saltwater raspberry on your poor exposed tum-tum.<br>\r\n''PPBBTT!''<br>\r\n''Haaagohohd noohoho pl-pleeease doon't!'' <br>\r\nShe looked up at your red face and smiled at your red face begging her to stop. She smiled devilishly and mouthed ''No'' before going back for seconds.<br>\r\n''PPPBBBTTT''<br>\r\n''NahaAHHAAHAA!!''<br>\r\n''Awww what's the matter baby? You've got a case of the giggles! Know what's good for that?<br>\r\n''What?''<br>\r\n''PPPBBBTT!''<br>\r\n''AHHHAHAA''<br>\r\n''You walked into that sweetie. Couldn't resist it to be honest. Be good now, at least until I get back sweetie.''<br>\r\n<br>\r\nWith another pinch of your ribs Melody slipped off into the surf and swam away. You pulled at the seaweed as soon as the ripples stopped trying to desperately to get free. With all your might you strained but whatever kind of stupid seaweed this was it stayed strong not only around your tied wrists behind your back but also to what she had looped the binding's around your ankle's to. Those were also immobile down in that pool. You flexed your toes and wiggled your feet as best as you could which was mainly from side to side. The cool water did feel good and hey maybe a nap wouldn't be the worst thing in the world right now....<br>\r\n<br>\r\nOut of the corner of your eyes you spotted some ripples as something drew closer... <br>\r\n<br>\r\n</span></div></div>",
            "created":1526112840,
            "id":2492022,
            "title":"Eat up! This is your life now I guess."
        },
        "111133333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Belle (from Beauty and the Beast) ",
                "Princess Jasmine (from Aladdin) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options: </span></div></span></div>",
            "created":1440997200,
            "id":2028082,
            "title":"Other"
        },
        "1111333332":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "A simple feather;she's going to torture your feet",
                "A entire array of tools meant for tickle torture she's going all out on you!"
            ],
            "content":"<div class=\"\"><div> <span>Long story short you're one of those annoying wealthy,snobbish princes the sultan is forcing his daughter the lovely Princess Jasmine to wed by her 16th birthday and she finds you incredibly cold,self-centered and completely unlikable so she decides to make you pay for treating her like a object rather tan a person whose destined to be your wife so she quickly knocks you over the head with a saucer and next thing you know you're lying on your back strapped by ropes on her couch she looks over at you with a cool smirk \"Ughh my head......what happened where am I? Huh I-I can't move.....You...you did this? Release me at once! What is the meaning of this?\" You scream as Jasmine giggles \"You were pretty mean and cold to me before for such a handsome person you sure know how to make a girl feel less worthy of herself and non important you humiliated me! So I'm going to return the favor you self-centered windbag!\" You feel utterly terrified once you see her come closer and you find you have been reduced to your underwear and looking up you see Jasmine's armed with</span></div></div>",
            "created":1458018000,
            "id":2117887,
            "title":"Princess Jasmine (from Aladdin) "
        },
        "1111333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Pocahontas (from Pocahontas) ",
                "Esmeralda (from Hunchback of Notre Dame) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options: </span></div></span></div>",
            "created":1440997200,
            "id":2028083,
            "title":"Other"
        },
        "11113333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Megara (from Hercules) ",
                "Jane Porter (from Tarzan) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options: </span></div></span></div>",
            "created":1440997200,
            "id":2028084,
            "title":"Other"
        },
        "111133333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Princess Kida (from Atlantis: The Lost Empire) ",
                "Princess Rapunzel (from Tangled) ",
                "Treasure Planet? "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options:</span></div></span></div>",
            "created":1440997200,
            "id":2028085,
            "title":"Other"
        },
        "1111333333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Captain Amelia (from Treasure Planet) ",
                "Sarah Hawkins (from Treasure Planet) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps the women from Treasure Planet?:</span></div></span></div>",
            "created":1440997200,
            "id":2028088,
            "title":"Treasure Planet?"
        },
        "11113333333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Elsa (from Frozen) ",
                "Anna (from Frozen)",
                "Furry characters?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options:</span></div></span></div>",
            "created":1440997200,
            "id":2028090,
            "title":"Other"
        },
        "111133333333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Perdita (from 101 Dalmations) ",
                "Duchess (from Aristocats) ",
                "Foxes?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps some furry options?</span></div></span></div>",
            "created":1440997200,
            "id":2028093,
            "title":"Furry characters?"
        },
        "1111333333333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Maid Marian (from Robin Hood) ",
                "Vixey (from The Fox and the Hound) ",
                "Lionesses?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options: </span></div></span></div>",
            "created":1440997200,
            "id":2028094,
            "title":"Foxes?"
        },
        "11113333333333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Nala (from The Lion King) ",
                "Kiara (from The Lion King 2: Simba's Pride) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some lionesses?: </span></div></span></div>",
            "created":1440997200,
            "id":2028096,
            "title":"Lionesses?"
        },
        "111133333333333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Dixie (from The Fox and the Hound)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options:</span></div></span></div>",
            "created":1440997200,
            "id":2028330,
            "title":"Other"
        },
        "1111333333333333332":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Grimhilde (the Queen from Snow White)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Grimhilde?</span></div></span></div>",
            "created":1448686800,
            "id":2067741,
            "title":"Other"
        },
        "11113333333333333321":{
            "author_id":"hiccan",
            "author_name":"Hiccan",
            "choices":[
                "You woke up in a dark place naked and cold. Your first night as her toy.",
                "You awake in a skimpy outfit of bells and ribbons. You're to be the new fool.",
                "You awake in shackles. You're to be cleaned and trained first."
            ],
            "content":"<div class=\"\"><div> <span>It was another beautiful day in the village you'd lived in for 22 years. The birds were chirping, the sun was shining and the young children were out playing. It was perfectly warm out but not enough to be uncomfortable instead it was in the perfect zone where it almost felt like the sun was personally kissing your skin. You'd had your favorite breakfast and the taste of that ham and eggs still lingered on your tongue. Such a shame that such a great day was getting spoiled by the village getting a visit from the evil queen Grimhilde, ruler of this kingdom.<br>\r\n<br>\r\nYou'd heard tell of her around the village but she'd stayed away from here for a long time but apparently she was visiting all the townships and village under her control to celebrate some kind of victory (Apparently somebody went to sleep? Weird thing to celebrate in your opinion) and this was the next stop. You actually planned to just stay out of the village entirely. So you'd decided to go hunting for some boars while you avoided the royal pain.<br>\r\n<br>\r\nA noise in the brush snapped you out of your narrative introspective and back to reality. You readied your bow and stalked towards the source of the sound thinking of the meal that this particular piggy would be. A large furry form drew your eye and you smiled as you notched an arrow and took aim on the boar. No way you'd miss as it was an easy shot. Just as you had the beastie dead to rights you felt a rough tongue slurp up along your ankle causing you to jump and yelp releasing the arrow in a wild direction. You wheeled around and saw a boar piglet licking away happily at your ankle peeking out of your leather shoes. It enjoyed the smell and taste of your sweat apparently as it was staying at the source licking away, not at all scared of you. With each lick though you jumped a bit since you were so ticklish but hey the little thing was cute.<br>\r\n<br>\r\n<div align=\"center\"><font class=\"size5\" style=\"\">AMBUSH!! WHO FIRED THAT ARROW!?!</font></div><br>\r\n<br>\r\nThis time it wasn't a little jump as you fell over at the powerful words booming through the forest and causing your new little friend to bolt with just as much fear as you felt right now at that booming voice.Where did it come from?! Who was it? Maybe you could explain the situation to them? It was all a silly misunderstanding perhaps they were a reasonable sort? As if to answer your question...<br>\r\n<br>\r\n<div align=\"center\"><font class=\"size5\" style=\"\">PROTECT THE QUEEN!!</font></div><br>\r\n<br>\r\nOh no....no no no no. The Queen?!! The Queen Grimhilde!? The EVIL Queen Grimhilde who'd hung a man for his horse smelling foul in the next town over!? THAT WAS WHO YOU'D JUST SHOT AN ARROW AT!?!  She'd burned down an inn over loud patrons, gods knew what she'd do to who she perceived as an asassin! <br>\r\n<br>\r\nYou had to get out of here! You had to run! Nodody'd seen you yet so maybe if you got back to the village you just hide and pretend to know nothing! Say you'd been asleep all day at your home and..and...<br>\r\n<br>\r\n''I SEE SOMEONE! OVER HERE I SEE SOMEONE!''<br>\r\n<br>\r\nThat woke you up. You dropped your bow and ran at full stop away from the noise of your observer and took off towards the village. Your normal hunters instincts had been left back there in a metaphorical puddle so you paid no attention to keeping it down, leaving no trail or even your protection as that led to several small branches ripping at your clothes and scratching your face. To protect yourself you put your hands up to protect your face and made yet one more incredibly stupid choice as you didn't see the root that tripped you up and sent you sprawling down the hill and right into the center of a trio of Grimhilde's guards. Before you could even get your hands under you a boot slammed down on your head and it all went black.<br>\r\n<br>\r\nYou awoke to the unsmiling face of the dark Queen Grimhilde looking you over seated alongside a goblin. A window behind her showed forest passing by letting you know that you were inside her royal carriage. The small green goblin laughed and pointed alerting her your awakening.<br>\r\n<br>\r\n''M-my Queen! Pl-please let me explain! It's all a misunderstanding you see a piglet liked my skin!''<br>\r\n''My boy you have much to answer for. Firing upon your grand and beautiful Queen is a serious crime that carries a hefty punishment.''<br>\r\n''I-I am no killer my liege please believe me!''<br>\r\n''Do you take me for a simpleton? I do not think so little of any of my enemies that they would send such a pathetic champion as you to try and kill me. No I believe that you are simply an unfortunate fool in a terrible situation. You are to be pitied my new pet.''<br>\r\n''Ahh so then you'll release my Queen?''<br>\r\n''No your crime is still grave and a death penalty is something I already set my mind on.''<br>\r\n''MY QUEEN!-''<br>\r\n''Calm down child you still have a chance. I want to administer a test first to see something. You might have noticed your bondage.''<br>\r\n<br>\r\nYou had not. Now that you were taking in your surroundings you noticed that your hands were not free. Each of your wrists were bound to the wall of the carriage on either side of your head. You gave a few experimental pulls at them to confirm that their was no give.<br>\r\n<br>\r\n''Wh-what kind of test?''<br>\r\n''Go my chief torturer.''<br>\r\n''Wai-wait tortur-WHAT ARE YOU DOING!?''<br>\r\n<br>\r\nThe goblin rushed forward and lifted up your tunic before crawling in under it and pressing herself to your chest.<br>\r\n<br>\r\n''My-my Queen plEEEHEEPP!''<br>\r\n''Now what was that reaction my dear?''<br>\r\n''AHH My Queen pleeease!''<br>\r\n''Are you perhaps ticklish my dear unlucky assailant?''<br>\r\n''NoooHAHA not at all my QueeNAHT THE NIPPLES PLEEHEESE!''<br>\r\n''I will take that as a yes. Soo your nipples are sensitive than?''<br>\r\n<br>\r\nYou answered her query with hysterical laughter as the chief torturer's long nails pinched and scratched at your pink and sensitive nipples. They were standing at attention beneath your tunic due to both the cold of the forest and now the devilish little greenskin was working them a pair of volume controls for your torment. Your voice cracked at the feeling of a slimy, long goblin tongue lapping at your chest.<br>\r\n<br>\r\n''So those nipples of yours seem sensitive enough.Test his ribs next Nilbog my dear.''<br>\r\n''Nilbog?! AHHHHH''<br>\r\n''Yes dear it's Goblin spelled backwards. Now count along with Nilbog as she gives attention to those little peasant spareribs of yours. ''Don't do it and she will start over so I'd recommend against any rebellious or heroic thoughts here. So?''<br>\r\n<br>\r\nA pair of pinching fingernails in your ribs confirmed her statement to you and as they traced down along that rib and back you played along. ''Ahhh! One!'' you squealed at the goblin's touch earning a disappointing cluck from Grimhilde which started the nails going back the other way on the rib making you strain against your bonds.<br>\r\n''One AHHH my Queen one!<br>\r\n''Very good''<br>\r\nThe damned fingers let it alone finally but the respite was short lived as a long fingernail now attacked another one.<br>\r\n''Hahaha two my Queen!''<br>\r\nA tongue lapped at another of your ribs causing you to cringe back into your seat and bite your lip to hold back. This raised an eyebrow from Grimhilde and drew her closer to you with a look of serious interest.<br>\r\n''Do go on.''<br>\r\n''Nnng t-three my-my Queen.''<br>\r\nNow a pair of rough and scaly lips brushed the next rib causing you to bang your head against the wall repeatedly as you struggled to hold it in.<br>\r\n''Counting giving you trouble my dear?''<br>\r\n''Nnno my AAHHHH Queen! FOUR!?''<br>\r\nThose same damn lips buzzed against another of your ribs showing you that it could get worse.<br>\r\n''Hahahehee no please don't do that!! Hahaha fiHAHAve! MY QUEEN PLEASE MAKE THIS STOP!!''<br>\r\n''Hmm maybe.''<br>\r\nNow a small set of sharp teeth nipped at another of your ribs. Not hard to break the skin or cause pain. Instead it was done just delicately enough to drive you wild as they held you steady for that devilish tongue to torment.<br>\r\n''Pl-hahaha!-pl-HAHEHAHA! Please my Queen! AHH SIX! SIX LET IT GO NOW! SIHIHIHX!''<br>\r\n<br>\r\nGrimhilde adopted a thoughtful expression betrayed by the fact that she was obviously enjoying this before making shocking statement as she crossed her legs and patted her lap.<br>\r\n<br>\r\n''Very well than. Give me your feet.''<br>\r\n''AHHNYTHING! Gahahahanoo Seven! Seven! Seven!''<br>\r\n''Then give them here boy.''<br>\r\n<br>\r\nWithout you pulled your feet out from under yourself and placed them in the Queen's lap at her her command. If there was even the slightest chance of this getting you out of counting class with Nilbog you'd do anything. As you the goblin raked it's nails over another one you squealed.<br>\r\n<br>\r\n''Eiiighthahahaha!''<br>\r\n''Now say that you'll be my servant.''<br>\r\n''I'll behehee your servant myhaha Queen! Just mahahake it stahahap, ''<br>\r\n''Oh you forgot to count you stupid boy. She'll start over now since you broke the rules and for troubling her I think I'll take back that offer. Don't worry you still have a chance. You only have to say you'll be my slave now.''<br>\r\nBefore you could even begin to question that a fresh new attack started on another under your blouse.<br>\r\n''I'LL DO IT AHAHA!! I'LL BE YOHOHUR SLAVE!''<br>\r\n''That was a bit slow I think. I am your Queen and your just such a ticklish little thing that maybe your not even fit to serve me that way. A pet seems like your option now and you should be happy for that. Look your so happy that you can't stop smiling. Well?!''<br>\r\n''AHHHAHA YES! YES! I'LL BE YOHOHUR SLAVE. JUST MAKE IT STAHAHAP!''<br>\r\n''Wonderful. Now only one thing left. Eat this.''<br>\r\n<br>\r\nThe chief torturer finally ceased her attack and scrambled out of your clothes as you gasped for air. Grimhilde shoved an apple into your face as the damned goblin started clawing at your shoes the Queen practically shoved the Apple into your mouth. The second you bit into it everything went black once again...</span></div></div>",
            "created":1515315540,
            "id":2437803,
            "title":"Grimhilde (the Queen from Snow White)"
        },
        "111133333333333333211":{
            "author_id":"hiccan",
            "author_name":"Hiccan",
            "choices":[
                "LET ME OUT PLEASE! I'm sorry!!",
                "Suddenly a certain goblin hand clamps over your math.",
                "You manage to fight them off"
            ],
            "content":"<div class=\"\"><div> <span>You woke slowly to absolute darkness and a soft bed beneath you. You struggled to get your bearings and realized a few things.<br>\r\n-Unlike before now your hands were free and no longer bound above you.<br>\r\n-Ironically now your ankles were bound with your bare soles in the air.<br>\r\n-The cold air on your soles seemed to inform that your feet were outside of whatever container you were in.<br>\r\n-A fair bit of pulling confirmed that they were solidly in there.<br>\r\n-Using your toes to probe around you discovered that wherever your feet were they were surrounded by soft things.<br>\r\n<br>\r\nYour investigation was cut short by the feeling of hot breath on your feet. Suddenly you felt warm skin to skin contact on your soles which made you slightly jump. This drew a groan from above you deepening your confusion.<br>\r\n<br>\r\n''Ahh your finally awake.''<br>\r\nA candle flickered to life revealing a familiar face.<br>\r\n''Nilbog?''<br>\r\n''This is not my name. You can refer to me as the chief torturer. That is actually just Goblin spelled backwards.''<br>\r\n''Where am I?''<br>\r\nYou felt hands pull your feet closer to the skin and a pair of what felt like lips lightly brushed your heel.<br>\r\n''This is the first day of your new life. This is how you will begin and end your days here. The Queen has always had unique predilections and your new purpose to fulfill this. As such she has chosen your feet to share her bed with her.''<br>\r\nA tongue peeked out and grazed your instep causing you to to quietly squeal into your hands before the sadistic goblin.<br>\r\n''This is the first part of your day now. The Queen had this addition to her beddings prepared in anticipation for a certain princess but those plans fell through. So upon finding you she was all to eager to put you in that sleeping fool's place.''<br>\r\n<br>\r\nYou tried to say something but the beginning of the sentence was choked out as the sleeping form Grimhilde clutched your feet closer above changing your response to a simple.<br>\r\n''YEEP!''<br>\r\n''Mmmmhrrm? Ohh my are you up my precious little jewel?'' questioned the groggy voice of Grimhilde from above your sleeping place.<br>\r\n''Ahh the Queen has been woken by your carelessness. Your tour will begin soon so enjoy that as I will leave you to tend to others she has left in my care. Enjoy your new life pet.''<br>\r\n<br>\r\nWith that the small goblin blew out the candle and once placed you back into darkness. You fumbled around in the darkness until a fingernail dragging up your sole brought you to the cold light of reality.<br>\r\n''WHAhahaha!''<br>\r\n''Mmm so you are awake. How rude to not greet me then. Seems like a certain pet has some tendencies we'll need to work on.''<br>\r\nYou tugged at your bonds in response trying to worm your feet out and away but all that earned was a melodious giggle from dark queen.<br>\r\n''Now you attempt to leave the Queen Grimhilde's bed without so much as a word? Dear me what manner of lothario has replaced the sweet village boy I chose to take under my wing and house beneath my beddings? I wonder is this your true nature? Was the stupid, innocent and unlucky routine all just an act to fool an emotional monarch?''<br>\r\n''My Queen I'm just not comfortable in thiiIIIHHI!!'' Cutting off your protests she pinched your index and middle toes together on one foot then placed her own pointed nail into your heel menacingly.<br>\r\n<br>\r\n''Wait please my Queen!''<br>\r\n''My Queen'' is for loyal subjects. Pets who are hiding things will use Mistress. Now you will tell me some secrets before this day begins. So go on sing for me my pretty bird.''<br>\r\n<br>\r\nWith that the nail dragged up on an unmistakable path that caused you to break out in a cold sweat through your stifled giggles from your down-low dwellings. Your mind raced as it the nail did the same up your sensitive sole.<br>\r\n<br>\r\n''My favorite color is red!''<br>\r\n''Mmm like your face is under there I imagine. Do better dear please.''<br>\r\n''I wehehet the bed occasionallEEEHEEHEENOHO'' She drew erratic zigs and zags along your arch, Not moving upward just yet but not stopping either.<br>\r\n''Till what age precious.''<br>\r\n''LaAHAHHAst month my Mistress.''<br>\r\n''Foul yet not uninteresting. You'll have to do better though.'' With that she resumed her climb.<br>\r\n''I-I've washed myself everyday since I was 3! The village elders wouldn't allow us that much water from the well so I would sneak down to the forbidden lake to wash myself when needed!''<br>\r\n''Am I your friend from school? Even though I appreciate your own efforts to keep yourself pristine for when the divine Queen Grimhilde added you to her treasury, I asked for secrets boy now do tell!''<br>\r\n <br>\r\nShe pinched both your toes tighter now as if she was reminding you where she was heading before deviating to travel over the sides and to the tops of your feet so that she could draw lazy circles over your instep, cooing at the distressed wiggling it made her little catches do. Eventually she grew tired of that though and found her way back to your soles and zeroed in on on the ball of your foot circling her nail around it like a shark smelling blood.<br>\r\n''I stoHOHOle breHAHAd when I waHAHAs fiHEEHEEve!!'<br>\r\n''So you are a criminal then? What good fortune that we got such a dangerous person off the streets.''<br>\r\n''I alwAHAHAys dreaHAHAHAmed of maHAHAHArrying a noble!''<br>\r\n''And now your the pet of a Queen! Overshot a bit there didn't you?''<br>\r\n<br>\r\nWith that last taunt she reached the end of the road and dove in between your toes, pinching and kneading the so sensitive skin. You flailed your arms and banged your fists beneath the bed. She swiped a nail in and out as you howled in your prison. You desperately tried to pull your feet out of the stocks above you and away from the devil woman who was tormenting your toes up there but they held fast. Even your attempts to try and turn were thwarted as she held your ankles still.<br>\r\n''PLEASE GAHAHA STAHAH-AHA-AHAP~ PLEEHEE-HEESE AH'LL DIHIHIHE!''<br>\r\n''Hmmph such a flair for the dramatic. Very well though must'nt break my new toy on the first day again.''<br>\r\nAfter a few more quick tickles she stopped and judging from the creaking above sat up in the bed and stretched.<br>\r\n<br>\r\n''Nnnnnahh!! What a delightful way to start the day! You are going to have such fun as my new pet!''<br>\r\n''Heeheh nooo''<br>\r\n<br>\r\nYou heard a clicking and unlatching noise above you and your ankles were finally free. You pulled them down and away from that demon so that you could pulled knees to your chest in your hole. The Queen chuckled at the speed at which you scampered away.  You heard the sound of her getting to her feet and taking steps towards you. Suddenly light flooded your prison and squinting into it  you saw her surprisingly toned legs awaiting you outside.<br>\r\n<br>\r\n''Come on out then and let's you get dressed my dear.''<br>\r\n''NO WAY! So that I could be a toy again? I-I'm staying in here!''<br>\r\n ''My dear please do come out we've got a busy day ahead of us here.''<br>\r\n''Never!''<br>\r\n''Suit yourself it's time for your room to be cleaned anyway.''<br>\r\n<br>\r\nWith that she closed the door and tapped her bare foot on the stone outside. Everything was quiet for a minute until you heard it. The sound of tiny little legs in the millions. At first you thought that somehow it was Nilbog playing a trick on you to scare you but when the  wave of spiders crawled over you any thoughts about the little greenskin vanished. Millions of spiders poured over you and their hairy little legs tickled like the dickens. You tried to slap them off but all that did was let the little monsters into your armpits where they set to work keeping them open for there friends. <br>\r\n''WHAAHAT?! GEHEHET AHAHAHFFF SHIIT!''<br>\r\nYou banged on the door the but found it sealed shut trapping you in this new tickle hell as a some of the spiders bound your big toes together tightly.<br>\r\n<br>\r\n''Oh? Now you want out? Aren't you an indecisive boy. They'll only be cleaning for another few hours. Are you sure?''</span></div></div>",
            "created":1516389900,
            "id":2442742,
            "title":"You woke up in a dark place naked and cold. You..."
        },
        "11113333333333333322":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Maleficent (from Sleeping Beauty)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps Maleficent?</span></div></span></div>",
            "created":1448686800,
            "id":2067742,
            "title":"Other"
        },
        "1112":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Elastigirl (from The Incredibles)",
                "Mirage (from Incredibles) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Pixar woman will tickle you?</span></div></span></div>",
            "created":1440997200,
            "id":2028135,
            "title":"Pixar "
        },
        "1113":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Nickelodeon ",
                "Video Games",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more options:</span></div></span></div>",
            "created":1440997200,
            "id":2028069,
            "title":"Other"
        },
        "11131":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Avatar: The Last Airbender",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some possible TV shows: </span></div></span></div>",
            "created":1440997200,
            "id":2028107,
            "title":"Nickelodeon "
        },
        "111311":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Katara",
                "Ty Lee",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What women from Avatar the Last Airbender do you want to tickle you? </span></div></span></div>",
            "created":1440997200,
            "id":2028111,
            "title":"Avatar: The Last Airbender"
        },
        "1113113":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Korra ",
                "Asami Sato ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options: </span></div></span></div>",
            "created":1440997200,
            "id":2028112,
            "title":"Other"
        },
        "11131133":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Jin ",
                "Opal",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options:</span></div></span></div>",
            "created":1440997200,
            "id":2028113,
            "title":"Other"
        },
        "111311333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Jinora",
                "Ikki",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options:</span></div></span></div>",
            "created":1440997200,
            "id":2028115,
            "title":"Other"
        },
        "11133":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Dreamworks",
                "Cartoon Network",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options:</span></div></span></div>",
            "created":1440997200,
            "id":2028097,
            "title":"Other"
        },
        "111331":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Princess Fiona (from Shrek) ",
                "Vanessa Bloom (from Bee Movie) ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which ladies from Dreamworks movies will be tickling you? </span></div></span></div>",
            "created":1440997200,
            "id":2028098,
            "title":"Dreamworks"
        },
        "1113313":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Valka (from How to Train Your Dragon 2) ",
                "Roxanne Ritchie (from Megamind) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options:</span></div></span></div>",
            "created":1440997200,
            "id":2028099,
            "title":"Other "
        },
        "11133133":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Tzipporah (from Prince of Egypt)",
                "Miriam (from Prince of Egypt) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options: </span></div></span></div>",
            "created":1440997200,
            "id":2028100,
            "title":"Other"
        },
        "111331333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Chel (from Road to El Dorado) ",
                "Susan Murphy (from Monsters vs Aliens) ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options:</span></div></span></div>",
            "created":1440997200,
            "id":2028102,
            "title":"Other"
        },
        "111332":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Starfire",
                "Raven",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Cartoon Network women will tickle you?</span></div></span></div>",
            "created":1440997200,
            "id":2028132,
            "title":"Cartoon Network"
        },
        "1113323":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Justice League Girls",
                "DC Superheroines Girls Web miniseries"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe someone else from The old Justice League Cartoon(2001-2004) or the newest web series DC Superheroines Girls?</span></div></span></div>",
            "created":1458018000,
            "id":2117890,
            "title":"Other"
        },
        "111333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Jessica Rabbit",
                "Daisy Dingo (from Blinky Bill)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options</span></div></span></div>",
            "created":1440997200,
            "id":2028332,
            "title":"Miscellaneous"
        },
        "1113331":{
            "author_id":"ottologon",
            "author_name":"Otto",
            "choices":[
                "''OH YES!! TICKLE ME JESSICA!!! I LOVE BEING TICKLED!!!''",
                "''OH NO!!! PLEASE DON'T TICKLE ME JESSICA!!! I HATE BEING TICKLED!!!''"
            ],
            "content":"<div class=\"\"><div> <span>You find yourself groaning and trying to open your eyes. You don't remember how you got here. All that you know was that you're walking in the streets by yourself, and some mysterious figure managed to put a chloroform in your mouth to knock you unconscious.<br>\r\n<br>\r\nYou try to rub your eyes, but suddenly, your arms and legs won't move. Then you find out that you're tied up in a X-frame position and a rather large, cozy, and warm bed naked.<br>\r\n<br>\r\nYou hear footsteps walking closer and closer to you and the voice said, ''Well well well, looks like you've been naughty today.'' The figure emerged from the shadows revealing to be the sexiest and beautiful female character herself, Jessica Rabbit. Your eyes has gone wide and your penis has gone erect and tall from the looks of her.<br>\r\n<br>\r\n''You know baby, I would normally get angry with you for taking a peep on me while I was changing, but since I love perverts like you, I figure I give you something special.'' She said. <br>\r\n<br>\r\nYour face is now blushed red, and you smile nervously. ''I uhhh….Umm..Well…I…..Uh….'' You try to say something, but nothing is coming out of your mouth. She decides to tease you by slowly stripping herself, which made your face blush dark red.<br>\r\n<br>\r\n''Get ready for this, my dear, because I'm going to give you some hot……Sexy……And most amazing tickle sex you'll ever have.'' Her response made you made your eyes go even wider, and your face is now the exact same color from the bed you're tied up in. Your response to this is…..<br>\r\n</span></div></div>",
            "created":1452661200,
            "id":2088869,
            "title":"Jessica Rabbit"
        },
        "11133311":{
            "author_id":"ottologon",
            "author_name":"Otto",
            "choices":[
                "''My feet and my dick.''",
                "''My armpits and my belly.''"
            ],
            "content":"<div class=\"\"><div> <span>Your response gave Jessica a seductive grin, and she managed to strip herself naked.<br>\r\n<br>\r\n''That's great, my dear, I promise you won't forget this.'' She then picks up two paintbrush from the table, and she walks close to your body. Your penis is now more and more erect than ever before, and your entire body is now filled with sexual excitement. ''Now then, which of your body parts is the most ticklish, my darling?'' She asked you.</span></div></div>",
            "created":1452661200,
            "id":2088871,
            "title":"''OH YES!! TICKLE ME JESSICA!!! I LOVE ..."
        },
        "111333111":{
            "author_id":"ottologon",
            "author_name":"Otto",
            "choices":[
                "''I think I wants some pleasure on my dick and some more tickling on my balls.''",
                "''I think I want MORE tickling on my dick and balls.''"
            ],
            "content":"<div class=\"\"><div> <span>''Aaaaaahh……You like some naughty tickling on your dick as well huh? Very good.'' She then starts her tickling using the paintbrushes to tickle your precious feet, making you laugh loudly in delight.<br>\r\n<br>\r\n''AHAHAHAHAHAHAHAHA OHOHOHOHOHOHOHOHOHOHO BAHAHAHAHABY!!! AHAHAHAHAHAHAHAHAHAHA OHOHOHOHO YES!!! HAHAHAHAHAHAHAHAHAHAHA DON'T STAHAHAHAHAHAHAHAHAOP!!! DON'T STAHAHAHAHAHAHAHAHAHAHAHAHAHAOP!!'' She has an even wider grin on her face and she grants your wish by tickling your feet some more.<br>\r\n<br>\r\n''I see a naughty boy loves to get tickled by a sexy girl.'' She teased. Your penis has gone taller and taller and more erect. You felt like you're being seduced and tickled by the hottest girl in the world. <br>\r\n<br>\r\n''Now prepare to have your toes tortured.'' She went after your toes, making you laugh harder than ever before.<br>\r\n<br>\r\n''AHAHAHAHAHAHAHAHAHA YEAHAHAHAHAHAHAHAHAHAHAHAHES!!! THAHAHAHAHNK YOHOHOHOHOU SOHOHOHOHOHOHO MUHAHAHAHAHAHAHAHACH!!!'' She stares at your toes and your dick with a teeth bared grin.<br>\r\n<br>\r\n''Hmhmhm….You're welcome my dear.'' She continues to tickle your precious toes for about 5 minutes until she stops to give you a breather. You stare at the sexy female tickler with a horny smile while breathing heavily.<br>\r\n<br>\r\n''Well well well……It seems you really DO love being tickled. I wonder if your dick loves some ticklegasm.'' Your body is now filled with even more sexual excitement as she slowly moves the paintbrushes to your cock and balls. You're more excited than ever before, you felt like the luckiest man in the world, and that your dreams have come to reality. <br>\r\n<br>\r\nShe uses her paintbrushes to tease and tickle your cock and balls, making you laugh and moan in pleasure.<br>\r\n<br>\r\n''Ahahahahahahahaha *Moan* Ahahahahahahahaha *Moan* Ohohohohoho yes *Moan* This ishahahahahahaha *Moan* Amazing.'' Her evil grin makes you more aroused as she continues to tickle your erect cock and balls.<br>\r\n<br>\r\n''Aren't you a naughty boy? Coochie coochie coochie coo……Coochie coochie coochie coo…'' She teased, making you more aroused than ever before. You felt like you're in tickle torture heaven, as your cock and balls starts getting harder and harder, and you start moan louder and louder and louder in pleasure.<br>\r\n<br>\r\n''Ahahahahahaha…..AAaaaa….AAAAaaaaa…..J-Jessica…..I'm going to…..Aaaaa…..AAAAAAAAAAAAAAAAAAAA!!!'' You scream in pleasure as your dick squirts out lots and lots of cum, staining her face and your chest. Jessica licks all of the cum from face and your chest, and she looks at you with the same evil grin.<br>\r\n<br>\r\n''I'm glad you enjoyed the tickling, my dear. Would you like me to rub your dick with my breasts and tickle your balls, or do you just want some more dick tickling?'' She asked you.</span></div></div>",
            "created":1452661200,
            "id":2088881,
            "title":"''My feet and my dick.''"
        },
        "1113331111":{
            "author_id":"ottologon",
            "author_name":"Otto",
            "content":"<div class=\"\"><div> <span>''Mwhahahahahaha.'' She said doing her evil laugh. ''You really ARE a naughty boy. Very well.'' She then put the paintbrush from her left hand on the table, and she uses her breasts to attack your dick and her paintbrush to attack your balls, making you laugh and moan loudly in pleasure.<br>\r\n<br>\r\n''Ohohohohohoho…..OHOHOHOHohohohoho….OHOhohohohyeahahahahahahaha hahah……Plehehehehehehse tickle myhahahahahaha bahahahahahahahahahalls.'' Her evil grin grants you that wish and she tickles your balls in a faster rate, while she rubs her breasts in a faster rate, making you laugh and moan even louder.<br>\r\n<br>\r\n''AHAHAHAHAHAHAHA OHOHOHOHOHOHOHOHOHOHOHO HAHAHAHAHAHAHAHAHOHOHOHOHOHOHOHOHOHOHOH OHOHOHOHOHOHO YEAHAHAHAHAHAHAHAHES OHOHOHOHOHOHOHOHOHOHOHOHOH!!'' Your body is filled with pure ecstasy as the heavenly pleasure from her breasts continue to make you warmer and warmer and warmer. Her merciless tickling on your balls makes this the greatest tickle sex you've ever experienced. You're now sweating profusely from the heat coming from her really hot breasts.<br>\r\n<br>\r\n''AHAHAHAHAHAHAHAHAHAHAH JEEHAHAHAHAHAHAHAHAHAHASICAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA I'M GOHOHOHOING TOHAHAHAHAHAHAHAHAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHH!!!'' You scream in pleasure again, squirting out a lot more cum on her mouth. She breaks away from your dick and balls, and she puts down the paintbrush on the table. Then she gets on top of the bed and straddles you.<br>\r\n<br>\r\n''Now then, ready for the grand finale?'' She asked. You're now getting EVEN MORE excited than ever before. This could be the best day of your life.<br>\r\n<br>\r\n''I ready when you are.'' She then slowly insert her anus into your dick and rides it up and down, and she uses her fingernails to tickle your armpits, making you laugh and moan in heavenly pleasure.<br>\r\n<br>\r\n''AHahahahahahahahahaha *Moan* Ahahahahahahahaha *Moan*'' You couldn't even reply due to an awesome feeling you have in your body, she moans in pleasure as she rides your dick and tickle your armpits at a faster rate.<br>\r\n<br>\r\n''AHAHAHAHAHAHAHAHAHAHA *Gasp* AHAHAHAHAHAHAHAHAHAHAHAHAHA *Moan*''<br>\r\n<br>\r\n''Yes baby….*Moan*……Enjoy this torture.'' She flirted. She continues to ride your dick and tickle your armpits faster and faster and faster until….<br>\r\n<br>\r\n''JESSICAAAHAHAHAHAHAHAHAHAHAHA LET MEHEHEHEHE CUUUUAAAAAAAAAAAAAAAAAAAAAA!!!'' You and Jessica scream in pleasure as you squirt out more and more cum on her pussy. Your body is now sweating with bullets, and you breathe heavily. You are offically the luckiest male in the world. Not only did you find yourself captured by the hottest women in the world, but you also get to have some tickling on your feet, dick, and balls, while having some more sex while she tickles you. She gets out of her bed, and she unties you. You get out of the bed as well, and you stare at the sexy lady with a horny puppy-like look.<br>\r\n<br>\r\n''So baby, will you go on a date with me?'' Came her reply.<br>\r\n<br>\r\n''Ohohohoh YES BABY!!!!'' Your body's excitement could not be contained, due to how much you love her. She then uses her fingernail to tickle and caresses your chin, making you close your eyes and have a really big smile.<br>\r\n<br>\r\n''That's a good boy, now don't forget, you'll get another tickle sex after that.'' <br>\r\n<br>\r\n''Ohohoh I won't forget, honey.'' Your sexual relationship with Jessica starts to develop and you're now obsessed with her, begging her to tickle torture your naked body everyday, and for years and years she always grant you that wish with enthusiasm. You both got married after 5 years, and your relationship with her will go on forever…..And forever…..And forever…..</span></div></div>",
            "created":1452661200,
            "id":2088894,
            "title":"''I think I wants some pleasure on my d..."
        },
        "1113331112":{
            "author_id":"ottologon",
            "author_name":"Otto",
            "content":"<div class=\"\"><div> <span>''Hmhmhmhm……Very well, my dear.'' She then uses her paintbrushes again to attack your dick and balls in a faster rate, making you laugh and moan EVEN louder in pleasure than ever before.<br>\r\n<br>\r\n''AHAHAHAHAHAHAHA OHOHOHOHOHOHOHOHOHOHOHOH HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH OHOHOHOHOHOHOHOHOH!!!'' You're unable to form a word, due to how awesome you're feeling right now. This could be the best day of your life.<br>\r\n<br>\r\n''Yes my dear…….Enjoy the tickling……Enjoy being tickled by the most evil and attractive women in the world.'' She flirted, making you more and more aroused than ever before.<br>\r\n<br>\r\n''AHAHAHAHAHAHAHAHAHAHAHAHA OHOHOHOHOHOHOHOHOHOHOHOHOH YEHAHAHAHAHAHAHAHAHAHAH!! OHOHOHOHOHOHOHOHOHOHOHOHOHOHOHOHOHOHOHOHOHOHOH!!'' Your body continues to get more and more sexually excited as she continues her merciless tickling on your dick and balls until…..<br>\r\n<br>\r\n''JEHAHAHAHAHAHASSICAHAHAHAHAHAHAHAHAHA LET MEHEHEHEHEHE CUUUUUAAAAAAAAAAAAAAAAAAAAAAAAAAA!!!!'' You scream in pleasure, squirting out a lot more cum on her mouth. She then puts down both the paintbrush on the table and gets on top of the bed and straddle you.<br>\r\n<br>\r\n''Now then, are you ready for the grand finale?'' She teased. Your body is now filled with EVEN MORE excitement than ever before.<br>\r\n<br>\r\n''Ooooh yes Jessica, please rape my dick.'' She has the most evil grin imaginable as she slowly inserts her pussy into your dick.<br>\r\n<br>\r\n''Very well, my dear, I'll rape your cock, and tickle torture your armpits.'' She then rides your dick up and down and use her fingernails to tickle your armpits, making you laugh and moan EVEN LOUDER than ever before.<br>\r\n<br>\r\n''AHAHAHAHAHAHA *Moan* AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA*Moan*'' Your body is now sweating with bullets due to how hot her pussy is on your body, as she moans in pleasure.<br>\r\n<br>\r\n''*Gasp*…..Oooooooh yes baby…*Moan*…..Enjoy the tickling and sex.'' She flirted. She then tickles your armpits and rides your dick in a faster rate, making you scream in laughter and pleasure.<br>\r\n<br>\r\n''AHAHAHAHOHOHOHAHAHAHOHOHOHOHOAHAHAHAHAHOHOHOHOHOHOAHAHAHAHAHAHAHAH AHOHOHOHOHAHAHAHAHAHA!!!!'' The heat and ecstasy overtakes your body, as she rides your dick and tickles your armpits faster and faster and faster and faster until…..<br>\r\n<br>\r\n''AHAHAHAHAHA JESSICAAAHAHAHAHAHAHAHAHAHAHA I'M GONNAHAHAHAHAHAHAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA!!!!'' You and Jessica scream in pleasure as you squirt out more and more cum into her pussy. Your body is now sweating more and more bullets. You are officially the luckiest male in the world. Not only have you found yourself being captured by the hottest women in the world, but you also have some ticklegasm and a hot sex with her. She gets out of the bed and untied you. You get out of the bed, and you stare at the sexy women with a horny puppy-like look.<br>\r\n<br>\r\n''Now then, will you go on a date with me?'' She asked.<br>\r\n<br>\r\n''Ohohohohohohoh YES JESSICA!!!!'' Your body's excitement couldn't be contained due to how much you love her. She then uses her fingernail to tickle and caresses your chin, making you close your eyes and have a really big smile.<br>\r\n<br>\r\n''That's a good boy. Don't forget that you'll have some more tickle sex after that.''<br>\r\n<br>\r\n''Oh don't worry, honey, I won't.'' Your sexual relationship with Jessica has developed later on, and you're now obsessed with her, begging her to give you more and more ticklegasms, and for years and years, Jessica grants you that wish, and gave you more tickle torture and pleasure on your dick and balls. You both got married after 5 years, and your relationship with Jessica will go on forever…..And ever……And ever….</span></div></div>",
            "created":1452661200,
            "id":2088899,
            "title":"''I think I want MORE tickling on my di..."
        },
        "11133312":{
            "author_id":"ottologon",
            "author_name":"Otto",
            "choices":[
                "Your feet and dick.",
                "Your armpits and belly."
            ],
            "content":"<div class=\"\"><div> <span>Your begging and pleading only gave her an evil grin, and she manages to strip herself naked. ''That's too bad, baby, you're the one that took a peep into my changing room, so it's time for your punishment.'' She then picks up two paintbrushes from the table and she walks closer to you. <br>\r\n<br>\r\nYour body is filled with absolute fear and nervousness. ''Hmmm…..Which body part should I tickle first?'' She asked herself.</span></div></div>",
            "created":1452661200,
            "id":2088872,
            "title":"''OH NO!!! PLEASE DON'T TICKLE ME J..."
        },
        "1113333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Minerva Mink",
                "Kim Possible",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options:</span></div></span></div>",
            "created":1440997200,
            "id":2028334,
            "title":"Other"
        },
        "11133333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Dr. Ann Possible",
                "Shego",
                "Balto?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options:</span></div></span></div>",
            "created":1440997200,
            "id":2028336,
            "title":"Other"
        },
        "111333333":{
            "author_id":"si91",
            "author_name":"Dilius the Bearded",
            "choices":[
                "Jenna ",
                "Aleu",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the furries from Balto?</span></div></span></div>",
            "created":1440997200,
            "id":2028337,
            "title":"Balto?"
        },
        "112":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Video Game",
                "TV Show/Movie",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose the path that will lead you to the animated girl that your heart desires. If she is not there, simply add her. </span></div></span></div>",
            "created":1440997200,
            "id":2028230,
            "title":"The Male Tickler"
        },
        "1121":{
            "author_id":"tailziscool123",
            "author_name":"foxhound",
            "choices":[
                "Mario",
                "Sonic",
                "Zelda (or something else)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay let's start this list off with a few well known game franchises</span></div></span></div>",
            "created":1447995600,
            "id":2064800,
            "title":"Gaming list..!"
        },
        "11213":{
            "author_id":"tailziscool123",
            "author_name":"foxhound",
            "choices":[
                "Zelda",
                "Mega Man",
                "(Something current gen)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda, or...?</span></div></span></div>",
            "created":1447995600,
            "id":2064802,
            "title":"Zelda (or something else)"
        },
        "112133":{
            "author_id":"tailziscool123",
            "author_name":"foxhound",
            "choices":[
                "Street  fighter",
                "COD series",
                "(Something else)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Street  fighter or the COD series</span></div></span></div>",
            "created":1448082000,
            "id":2065168,
            "title":"(Something current gen)"
        },
        "1121331":{
            "choices":[
                "Chun-Li",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, so we want to go into the world of Street Fighter. Which female do you want to tickle?</span></div></span></div>",
            "created":1448082000,
            "id":2065204,
            "title":"Street  Fighter"
        },
        "11213311":{
            "choices":[
                "Bound in a chair",
                "Something different"
            ],
            "content":"<div class=\"\"><div> <span>You walk silently behind your leader, a small part of you fearful of the giant. His cloaks sways in the slight draft brought by the long corridors and vents. <br>\r\n<br>\r\n\"You best not fail me subordinate. You are asking a lot of me to delay brainwashing my dear captive.\" His booming voice terrifies you, but your muster the courage to respond with a strong voice. <br>\r\n<br>\r\n\"I will not fail, the woman will submit to the will of Shadaloo through my methods.\" Your leader, Bison, smiles wide. <br>\r\n<br>\r\n\"We'll see. Fail me, and suffer the consequences.\" Bison turns to leave you outside the chamber where the captive is being held. You suck in a lungful of air, and let out a deep breath. Truth be told, while you enjoy catering to your fetish with the future dolls, you truly wish to keep them from being brainwashed the old fashion way. <br>\r\n<br>\r\nStepping inside, you find your captive...</span></div></div>",
            "created":1452402000,
            "id":2087476,
            "title":"Chun-Li"
        },
        "112133112":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "Street Fighter?",
                "Police Business",
                "nope"
            ],
            "content":"<div class=\"\"><div> <span>Maybe take this in a different direction?<br>\r\n<br>\r\nStreet Fighter? - While in the middle of a battle with her, you pull out some unusual(ly ticklish) techniques. <br>\r\n<br>\r\n<br>\r\nPolice Business - You have a run-in with her during her detective work.</span></div></div>",
            "created":1454475600,
            "id":2098590,
            "title":"Something different"
        },
        "1121331122":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "A woman staring you down from the other end of the alley.",
                "Someone in a mask running towards you",
                "Nothing at all..."
            ],
            "content":"<div class=\"\"><div> <span>You were making your way home as usual one night when you ended up taking a wrong turn and heading down an alleyway. You were ready to turn around and ask for directions when you suddenly heard something behind you. It sounds like...footsteps. You turn around to suddenly see-</span></div></div>",
            "created":1454475600,
            "id":2098591,
            "title":"Police Business"
        },
        "11213311221":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "Start running",
                "Wait to see what she wants",
                "do something else"
            ],
            "content":"<div class=\"\"><div> <span>Turning around you see a woman wearing what appears to be a blue qipao, with brown pantyhose and large white boots. She also has some menacing-looking spiked wristbands. Before you can say anything she quickly starts making her way toward you.<br>\r\n</span></div></div>",
            "created":1454475600,
            "id":2098592,
            "title":"A woman staring you down from the other end of ..."
        },
        "112133112211":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "No! does she have you confused for someone else?",
                "Of course you do! you're one of his minions!",
                "???"
            ],
            "content":"<div class=\"\"><div> <span>Fearing for the worst, you start running the other way, but she quickly catches up with and corners you. With nowhere else to run, she speaks.<br>\r\n<br>\r\n\"I finally found you...this time, there's no running away! You're telling me everything you know about Bison's plan, NOW!\"<br>\r\n<br>\r\nBison? Have you ever heard that name before?<br>\r\n<br>\r\n</span></div></div>",
            "created":1454475600,
            "id":2098593,
            "title":"Start running"
        },
        "1121331122111":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "try to grab her leg mid-kick",
                "distract her somehow",
                "---->"
            ],
            "content":"<div class=\"\"><div> <span>You try to tell her that you don't know who she's talking about, but she's too confident in her search to believe you.<br>\r\n<br>\r\n\"Don't you play dumb with me! If you won't tell me, I'll beat the answers out of you!\"<br>\r\n<br>\r\nShe suddenly launches a series of kicks at you that you just barely manage to dodge. Talk about dumb luck! Still, it doesn't seem like she'll be letting up anytime soon. What should you do?</span></div></div>",
            "created":1454475600,
            "id":2098595,
            "title":"No! does she have you confused for someone else?"
        },
        "11213311221111":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "you attempt to slip off her boot",
                "she reels back hard enough to escape, but her boot comes off in the process",
                "she starts throwing punches"
            ],
            "content":"<div class=\"\"><div> <span>In the midst of her kicking insanity, you think to do something so stupid it may just work! Dodging kick after kick, you wait for the right moment before suddenly wrapping your arms around her leg before she can retract it. Trying to pull it back, she expresses confusion as she resists.<br>\r\n<br>\r\n\"W-what the hell do you think you're doing?\"<br>\r\n<br>\r\nThat's a good question. </span></div></div>",
            "created":1454475600,
            "id":2098597,
            "title":"try to grab her leg mid-kick"
        },
        "112133112211111":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "start running your fingers along her sole",
                "ask her what she's so scared of",
                "do something different entirely"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You start pulling as hard you can and manage to slip off the boot while still keeping a grip on her leg. You toss it aside and notice her eyes following it. She looks at you angrily, but she almost seems nervous about something...<br>\r\n</span></div></span></div>",
            "created":1454475600,
            "id":2098598,
            "title":"you attempt to slip off her boot"
        },
        "1121331122111111":{
            "choices":[
                "She falls on her butt after a good tickle",
                "You scribble your fingers up her leg. "
            ],
            "content":"<div class=\"\"><div> <span>Taking a chance, you run your fingers along her stocking covered sole. Her angry look immediately changes; she starts giggling incessantly. <br>\r\n<br>\r\n\"Oh ho. Did I find your weakness? Are you sorry you chased me?\" <br>\r\n<br>\r\nYou taunt as you keep ticking her foot. She can't respond, she's too busy giggling and hopping on her one foot. You decide to tease her by swinging her foot side to side, upsetting her balance of gravity. The brunette keeps hopping on her foot, weakly grabbing a nearby dumpster for leverage. <br>\r\n<br>\r\n\"Stahhhapppp...I'llll....fallll!\" She warns, though you ignore her and keep tickling. </span></div></div>",
            "created":1456117200,
            "id":2108191,
            "title":"start running your fingers along her sole"
        },
        "11213311221111111":{
            "choices":[
                "She manages to scramble to her (bootless) feet",
                "She squeals as you grab her hips"
            ],
            "content":"<div class=\"\"><div> <span>You keep up the tickling, adamant at seeing this woman fall to her ground. Tears form in her eyes as she laughs harder and harder. You can tell she's losing the battle to stay upright. Her foot is slowing down in its hopping, and her grip is getting weaker and weaker. <br>\r\n<br>\r\n\"Pllleeeassssseeeeee!\" She manages to squeal out, before her foot gives out. She lands on her bottom hard, wincing. She is too distracted to see you work on her other boot. The woman only notices when you slip it off, eyes widened at seeing both feet exposed. <br>\r\n<br>\r\n\"I can't take it!\" <br>\r\n<br>\r\nThe woman, having lost her cool demeanor, turns over and starts to crawl away on her hands and knees. You laugh, and can't help but admire her rear as she's scurrying. <br>\r\n<br>\r\n\"Where are you going?\" You call and start to chase her. </span></div></div>",
            "created":1456290000,
            "id":2109233,
            "title":"She falls on her butt after a good tickle"
        },
        "112133112211111112":{
            "choices":[
                "Give her bum some more treatment",
                "Slowly pull her back "
            ],
            "content":"<div class=\"\"><div> <span>You keep pace with the woman as she crawls away. It's no real contest; she is too tired and weak from the foot tickling to get away. You enjoy watching her try to flee for a few more seconds. Her shapely butt is clear to you, trapped beneath her dress and tights. You wonder if it's as sensitive as her feet. Slowly, you grin as you reach forward with your hands. The woman sees your movement, and tries to increase her speed. <br>\r\n<br>\r\n\"I don't think so.\" <br>\r\n<br>\r\nYou taunt as you grab her hips. She squeaks, knowing that she is doomed. You grin, and find yourself squeezing her hips a little. She giggles, and sways left and right in desperation. You love enjoy little movement she makes in your grip, and allow her a few minutes. She looks freaked out, afraid of what is going to happen, and speaks it plain. <br>\r\n<br>\r\n\"I'm scared.\" Her voice is a whisper, but full of fear. Inwardly, you frown. You want to tickle her into submission, but to go any farther like what you see in the news disgusts you. <br>\r\n<br>\r\n\"I'm not going to hurt you, just tickle you.\" You try to reassure her. <br>\r\n<br>\r\n\"That's why I'm worried, I'm very ticklish.\" <br>\r\n<br>\r\nShe moans out. You smile, and then plant a kiss on her tush through her dress. She giggles, and moves her butt around. Wanting to go farther, you gently push her dress aside to give her another kiss through her tights. You give her a few more kisses, loving every touch of her perfect bum. <br>\r\n<br>\r\n\"Perhaps I should tickle there, or should I drag you back into the alley?\"</span></div></div>",
            "created":1465102800,
            "id":2159107,
            "title":"She squeals as you grab her hips"
        },
        "11213311221113":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "try to keep dodging",
                "fight back",
                "do something unexpected"
            ],
            "content":"<div class=\"\"><div> <span>You try to tell her that you don't know who she's talking about, but she's too confident in her search to believe you.<br>\r\n<br>\r\n\"Don't you play dumb with me! If you won't tell me, I'll beat the answers out of you!\"<br>\r\n<br>\r\nShe suddenly launches a series of kicks at you that you just barely manage to dodge. Talk about dumb luck! Still, it doesn't seem like she'll be letting up anytime soon. What should you do?</span></div></div>",
            "created":1454475600,
            "id":2098596,
            "title":"---->"
        },
        "11213311222":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "turn around to see who said that",
                "stop where you are ",
                "Something different"
            ],
            "content":"<div class=\"\"><div> <span>A man in a mask goes rushing past you before climbing the fence at the end of the alley. He dropped a sack of something on his way out. You pick it up and look inside to find an assortment of jewels and other valuables. As you look back up you hear something behind you.<br>\r\n<br>\r\n\"Freeze! Stop where you are! Hands where I can see them!\"<br>\r\n</span></div></div>",
            "created":1454475600,
            "id":2098600,
            "title":"Someone in a mask running towards you"
        },
        "112133112221":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "try to explain what happened",
                "grab the jewels and run for it ",
                "she attacks before you can do anything"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You slowly turn with your arms in the air, bag already dropped. You see a woman coming toward you in some kind of blue outfit with pantyhose and large white boots. She's showing off her badge as she gets closer.<br>\r\n</span></div></span></div>",
            "created":1454475600,
            "id":2098601,
            "title":"turn around to see who said that"
        },
        "1121331123":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "the bet",
                "playful",
                "not yet"
            ],
            "content":"<div class=\"\"><div> <span>The bet - you bet her that she can't beat you in a fight. She ends up losing this bet and reluctantly accepts your terms once you've won.<br>\r\n<br>\r\nPlayful - you've become good friends with her and decide to start tickling her during a casual visit. Maybe you've even done this before. Maybe she actually likes it! </span></div></div>",
            "created":1454475600,
            "id":2098602,
            "title":"nope"
        },
        "11213311233":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "beach",
                "challenge",
                "still not it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Beach - you encounter her relaxing on the beach, already barefoot and off-guard.<br>\r\n<br>\r\nChallenge - you offer an endurance challenge to her and she accepts, not realizing just what you had in mind until it's too late.</span></div></span></div>",
            "created":1454475600,
            "id":2098603,
            "title":"not yet"
        },
        "112133112333":{
            "author_id":"apersontypeguy",
            "author_name":"whatismynameeven",
            "choices":[
                "trap",
                "mad science",
                "NO"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Trap - You've managed to catch her in a trap of some sort.<br>\r\n<br>\r\nMad Science - you've created a machine that can bring game characters into the real world and decide to test it out on an old favorite.</span></div></span></div>",
            "created":1454475600,
            "id":2098604,
            "title":"still not it"
        },
        "11213312":{
            "choices":[
                "Yep!",
                "Next please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The schoolgirl powerhouse Sakura?</span></div></span></div>",
            "created":1456117200,
            "id":2108197,
            "title":"More options"
        },
        "1121333":{
            "author_id":"tailziscool123",
            "author_name":"foxhound",
            "choices":[
                "Metroid",
                "The Mother/ Earthbound series",
                "(Keep the list going)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Metroid or the earthbound/mother series</span></div></span></div>",
            "created":1448082000,
            "id":2065175,
            "title":"(Something else)"
        },
        "1122":{
            "choices":[
                "Animated TV character",
                "Animated Film character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So which is it?</span></div></span></div>",
            "created":1490936400,
            "id":2297625,
            "title":"TV Show/Movie"
        },
        "11221":{
            "choices":[
                "Tickle Daphne",
                "Someone else from tv"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Daphne from Scooby Doo? </span></div></span></div>",
            "created":1490936400,
            "id":2297631,
            "title":"Animated TV character"
        },
        "112212":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "Avatar the Last Airbendee",
                "Totally Spies",
                "Pick a different show"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about we start with picking the show these girls come from?</span></div></span></div>",
            "created":1546625520,
            "id":2598685,
            "title":"Different TV shows"
        },
        "1122121":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "Katara",
                "Toph",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your girl:</span></div></span></div>",
            "created":1546625640,
            "id":2598686,
            "title":"Avatar the Last Airbender"
        },
        "11221213":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "Mai",
                "Ty Lee",
                "Different girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about someone from the fire nation?</span></div></span></div>",
            "created":1546642200,
            "id":2598756,
            "title":"Someone else"
        },
        "112212132":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "You're one of her friends from her circus days",
                "You're an Earth Kingdom soldier seeking information ",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how did you get in this situation with the cute acrobat?</span></div></span></div>",
            "created":1546728180,
            "id":2599360,
            "title":"Ty Lee"
        },
        "1122121321":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "Up at her underarms",
                "On her exposed stomach",
                "Down at her feet "
            ],
            "content":"<div class=\"\"><div> <span>You lay down in the field outside your cabin and close your eyes as you reflect your life. You'd spent the early years of your life both living and performing with the Fire Nation Circus. You performed all over the Fire Nation and the colonies during the war. Some of the highlights included a personal performance to princess Azula herself, a brief period of performing with an actual sky bison under the guise of a \"wind buffalo\", and a show in the briefly occupied Ba Sing Se. You got out after the war and bought a small cabin in the countryside.<br>\r\n<br>\r\nThe biggest highlight of your time there however was a girl by the name of Ty Lee. She was the star acrobat during her time there, but was unfortunately drafted by Azula during the war. The two of you got along well during your time together and she became your closest friend. You had even formed a crush on the cute girl, but you never got the chance to tell her about it before she left.<br>\r\n<br>\r\n*****<br>\r\n<br>\r\nYou are snapped out of your daydreaming by something brushing your nose. Assuming it to be nothing more than just some grass blown on the wind, you blow it away without opening your eyes. When it lands back however, you're starting to get annoyed and this time bat it away with your hand, again keeping your eyes closed.  When it lands on your nose a third time, you decide to open your eyes to see what's been bothering you.<br>\r\n<br>\r\nRather than see a blade of grass sitting on your nose, all you see is Ty Lee's cute face smiling down at you. She was staring you in the eye while doing her famous handstand. You see that it was her braided ponytail that kept messing with you. She sees that you've noticed her and takes a seat on your chest. <br>\r\n<br>\r\n\"Hey there (your name). Long time no see.\" She says with a warm smile.<br>\r\n<br>\r\n\"Ty Lee? What are you doing here? How did you find me? I heard that you were with the Kyoshi Warriors now.\"<br>\r\n<br>\r\n\"I'm here to see my old friend. I went to see you at the circus, but the ringleader told me you left the circus and pointed me to your new home. As for Kyoshi... Suki told me that I needed to take some time off, so I took the chance to come find you.\" She gets off your chest and flops down onto the grass beside you. <br>\r\n<br>\r\n\"Well it's good to see you either way.\" You say as you run a finger along the side of her exposed midriff, forcing a giggle out of her.<br>\r\n<br>\r\n\"Stop that, you know my sensitive skin makes me super ticklish.\"<br>\r\n<br>\r\n\"Oh I know. I also know that I'm the one guy that can tickle you without risk of you hurting me.\" You chuckle as you get up and throw your leg over her, pinning her. \"I think it's time we had some fun for old time's sake.\" You say, wiggling your fingers to tell her your intention. <br>\r\n<br>\r\nWhere do you start?</span></div></div>",
            "created":1546795800,
            "id":2599617,
            "title":"You're one of her friends from her circus days"
        },
        "11222":{
            "choices":[
                "Tickle the tiny fairy",
                "Someone else from a movie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Tinkerbell?</span></div></span></div>",
            "created":1490936400,
            "id":2297627,
            "title":"Animated Film character"
        },
        "112221":{
            "choices":[
                "You tickle her right away",
                "You strip her naked first"
            ],
            "content":"<div class=\"\"><div> <span>You are a horny 16 year old boy. Your whole life you had dreamed about finding a beautiful, sexy woman and tickling her in all of her most private areas. You had a couple of girlfriends in your life but neither of them were wiling to be tickled by you.<br>\r\n<br>\r\nYou were really bummed about this, especially considering how hot they were. <br>\r\n<br>\r\nYou stood in the center of the forest in your backyard, trying to get some peace of mind when suddenly you see a bright glow flying above your head. You decide to follow the glow around deeper into the forest. <br>\r\n<br>\r\nYou chase the glow to a small area with a pond. On a tiny stone, you can't believe what you see. It's Tinkerbell from Disney's Peter Pan. She sits on the rock, basking in the sun. She's just like in the film, 5 inches tall with beautiful blonde hair, bright blue eyes, a tight green dress, and an hourglass figure. <br>\r\n<br>\r\nYou realize that you have a hairnet in your pocket for when you worked your fast food job. You walked slowly over to the unsuspecting fairy and pulled it over her. <br>\r\n<br>\r\n\"Gotcha!\" Tinkerbell struggles to fly out of the hairnet but she's trapped. You take her into your bedroom and take a tiny thing of pliers to remove her wings so that she can't fly away. <br>\r\n<br>\r\nEach wing removed caused Tinkerbell to let out a tiny yelp. You hold the 5 inch tall cutie in your hand knowing that she is yours to tickle. <br>\r\n<br>\r\n\"Hey Tink, I hope you're not ticklish,\" you said. <br>\r\n<br>\r\nTinkerbell was in a state of complete fear knowing she was going to be tickled forcefully. <br>\r\n</span></div></div>",
            "created":1490936400,
            "id":2298005,
            "title":"Tickle Tinkerbell"
        },
        "1122212":{
            "choices":[
                "You tickle her with your tongue ",
                "You tickle her with a cotton swab"
            ],
            "content":"<div class=\"\"><div> <span>You decide that if you were going to give Tinkerbell a tickling, you should do it to her full and exposed form. You grab onto the end of Tink's green dress and pull it up over her head, leaving the tiny blonde fairy totally nude. <br>\r\n<br>\r\nTinkerbell's face immediately turns red with embarrassment as she tries to hide her lady parts with her little hands. <br>\r\n<br>\r\n\"Tickling naked girls is so much fun, don't you think so Tink?\" You throw her little dress into the garbage and begin tickling her. Tinkerbell tries not to laugh but she can't help it. You lightly touch underneath her little fairy arms causing her to squeal. \"Do you like that, baby?\" <br>\r\n<br>\r\nYou use your finger to tickle different parts of her exposed body. You search for Tinkerbell's most ticklish spot and you discover that her inner thighs are the perfect target. <br>\r\n<br>\r\nYou take your pinky finger and place it just underneath Tinkerbell's tiny butt cheek and right before her pussy. You vigorously tickle Tink's teeny thighs while using your other finger to tickle her gorgeous fairy tits. The naked Tinkerbell can't speak but you can tell that she's trying not to laugh but she can't help. <br>\r\n<br>\r\nTink lets out several silent squeals as you tickle her thighs and boobs. Finally the little fairy runs out of breath and falls backwards on your palm. You can feel the warmth of her tiny ass on the hand of your skin. <br>\r\n<br>\r\n\"Don't get too comfy, Tink, we're not done tickling yet!\" </span></div></div>",
            "created":1491022800,
            "id":2298217,
            "title":"You strip her naked first"
        },
        "11222121":{
            "choices":[
                "Tink starts to tickle you back (she's still naked)",
                "You continue to tongue tickle her"
            ],
            "content":"<div class=\"\"><div> <span>You're having a blast using your hand to tickle the naked fairy girl in your hands but you decide that there might be a more \"delicious\" way to tickle her. <br>\r\n<br>\r\n\"Hey Tink, I think I'm gonna try to tickle you with my tongue.\" Tink quickly shook her head no, she had already been violated and stripped to her birthday suit, she didn't want to be tongue tickled. <br>\r\n<br>\r\nYou stick out your massive tongue and hold the butt naked girl up to your mouth.<br>\r\n<br>\r\n\"This is gonna be fun, Tink, just wait.\" <br>\r\n<br>\r\nYou decide to tongue tickle her cute little nose. You reached the tip of your tongue and gently touched and tickled her nose. Your muscly shark sized tongue caused a twitch inside of Tinkerbell's nose. The inside of her cute little schnoz started to tickle and after lightly licking her nose for 30 seconds, she let out an adorable little sneeze. <br>\r\n<br>\r\n\"acheeeeww\" Tink sneezed and it sounded as if a tiny little mouse sneezed while ringing a bell. <br>\r\n<br>\r\nYou then turned you attention to your favorite part of the nude fairy girl, her lovely bottom. You took your tongue and fit it inside of Tinkerbell's perky yellow ass. Tinkerbell couldn't help but laugh as your tongue tickled her little butt hole. She tried to reach behind her to pull your tongue out of her ass but she couldn't reach you. The inside of her tiny fairy ass tasted like sweet strawberries and you loved hearing her teeny tiny laughter as you penetrated her cute little booty. <br>\r\n<br>\r\nNEXT</span></div></div>",
            "created":1492318800,
            "id":2306057,
            "title":"Tink gets tickled with your tongue"
        },
        "1123":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Go tickle Liliana",
                "Different MtG character",
                "Something else that isn't Magic related"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about we go tickle Liliana Vess from Magic: The Gathering?</span></div></span></div>",
            "created":1524089760,
            "id":2481389,
            "title":"Liliana Vess"
        },
        "11231":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Lock a magic blindfold over Liliana's eyes",
                "Drizzle honey over Liliana's butt"
            ],
            "content":"<div class=\"\"><div> <span>You are a planeswalker, a godlike wizard able to hop between planes of existence. You specialize in White Magic, especially spells used to restrain, bind, or otherwise immobilize your victims.<br>\r\n<br>\r\nOne day, you were wandering the hillsides collecting feathers when you saw a woman dressed in black and purple planeswalk in through a glowing portal right in front of you.<br>\r\n\"Aw cool! Another planeswalker! Hey, how's it going? My name's...\" You started to talk, but she interrupted you.<br>\r\n\"Shut up! I didn't ask you who you were.\" The woman said.<br>\r\nShe was clearly flustered about something.<br>\r\n\"Wew, somebody woke up on the wrong side of the bed. So ,where you from?\" You asked.<br>\r\nThe woman scowled, her patience wearing thin.<br>\r\n\"Ah, you're annoying. I'm going to make you into a zombie to join my undead army. Undead don't talk so it will suit you better.\" The woman said.<br>\r\nYou gave her a smug smirk.<br>\r\n\"Oh yeah? I don't think you know who you're dealing with.\" You said.<br>\r\nThe woman scowled.<br>\r\n\"Die already and serve under your new overlord, Liliana Vess!\" She called out.<br>\r\n<br>\r\nLiliana waved her arms and summoned a few zombie warriors from the Aether to fight you. Smirking, you cast Shackles on both of them, leaving them chained to the dirt. Then, you cast a spell on Liliana, binding her arms and legs together.<br>\r\n\"Hey! What is the meaning of this?\" Liliana said.<br>\r\nYou ignored her arrogant whining and got out a magical artifact, a Tickle Wand. Tickle Wands were shunned by most artificers for being useless in battle, but you weren't here to battle, you were here to torture. You moved the wand to Liliana's legs and began using the wand to tickle her, right under her knees. Liliana, for a moment, broke her gruff exterior and giggled.<br>\r\n\"Ha ha! S... Stop it! Ha ha! I said stop it! Ha ha ha!\" She cried out between uncontrolled laughter.<br>\r\nYou continued softly moving the wand up from her knee to her inner thighs. Liliana laughed harder now.<br>\r\n\"What... ha ha! What are you doing?\" Liliana screamed.<br>\r\n\"Tickling you, you idiot.\" You said, with a smug grin.<br>\r\nYou tickled her inner thighs some more. The strong scent of her crotch could be smelled wafting through the air. It was clear she was getting hot and bothered by all this. Liliana laughed some more, feeling totally humiliated to be reduced to this by a commoner planeswalker like yourself. You eventually let up so she could breathe. Liliana was left panting and gasping for air, her old lungs preserved by necromantic magic only barely able to hold a breath now.<br>\r\n\"Now, here's the deal, woman. I captured you, so I can do whatever I want to you. And I feel like tickling.\" You said.<br>\r\n\"What? You can't do that!\" Liliana said.<br>\r\nYou smacked her across the face.<br>\r\n\"Bitch, you don't got a choice!\" You bellowed.<br>\r\nLiliana growled and hissed at you like a captured wildcat. you laughed at the helpless woman and victoriously put your foot on her back, as if you had bagged a prize buck while hunting.<br>\r\n<br>\r\nWhat do you do to Liliana next?</span></div></div>",
            "created":1524092760,
            "id":2481396,
            "title":"Go tickle Liliana"
        },
        "112312":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "The honey attracts flies",
                "Rip off Liliana's blouse and tickle her nipples"
            ],
            "content":"<div class=\"\"><div> <span>Well, you had Liliana where you wanted her now, you felt it was time to make her as uncomfortable as possible. With a wide perverted grin, you began pulling off her skirt.<br>\r\n\"Hey! Stop that! That's my skirt, you little creep!\" Liliana growled.<br>\r\nYou tossed it aside, revealing Liliana's black sexy panties. You gently touched your finger to her fabric-clad crotch. Liliana's eyes went wide.<br>\r\n\"Oh, if you go there, you have my word I'll do everything in my power to rot you alive over and over again, you wretch!\" Liliana screamed.<br>\r\nYou weren't intimidated by her in the slightest. She talked a big fight, but you had her bound and restrained, unable to even cast a spell.<br>\r\n\"Relax, I'm not gonna rape you. You're a gross zombie lich girl and I'd get stinky zombie slime on my cock if I did that. But I <i> will</i> do the next best thing.\" You said.<br>\r\nYou ripped off Liliana's panties, revealing her well-groomed crotch. It was quite pretty and clean, like the crotch of a high-class zombie hooker. But that wasn't the part of her body you were after. No, you flipped Liliana over and got to her soft, round undead ass. You gave it a good sniff, taking in her musky aroma of ass, savoring it in your nostrils for a second.<br>\r\n\"Oh, that's a good ass...\" You moaned.<br>\r\nLiliana let out a frustrated grumble. She couldn't believe this was actually happening.<br>\r\n<br>\r\nYou gave Liliana's ass a soft smack before you went to business.<br>\r\n\"Now I summon... Honey!\" You said.<br>\r\nFrom the Aether, a cascade of honey began drizzling all over Liliana's ass. The thick, soft feeling made her giggle. She was, to her dismay, quite ticklish on her ass, and even a drizzle of honey was enough to set her off.<br>\r\n\"Oh, giggling already? Well, I've barely started.\" You said.<br>\r\nYou bent down and began licking the honey from Liliana's butt cheeks. She let out a discomforted giggle with every stroke of your tongue.<br>\r\n\"S... Stop, this is gross. Why are you doing this?\" Liliana groaned.<br>\r\nYou paid her no heed and continued to lick the honey from her ass.<br>\r\n\"Needs more...\" You mumbled.<br>\r\nYou waved your hands and summoned more honey, whole gobs of it inside Liliana's anus.<br>\r\n\"Ha ha! Hey! What are you doing? Ha ha... Stop!\" Liliana said.<br>\r\nHoney began surging from the aether directly into her butthole. You moved your neck and invaded her butt with your tongue, flicking in and out to lick up every drop of Liliana's sweet, sweet ass honey. Liliana groaned and laughed and grimaced all at once. This wasn't quite like getting raped... but it certainly wasn't pleasant either. It was a uniquely horrible experience and she felt an increasing sense of anger, exasperation, and humiliation all at once. Here she was, the great and powerful Liliana Vess tied up and getting her ass filled with honey and licked by some no-name nobody planeswalker that no one had ever heard of. She felt the whole thing was entirely beneath her, and thought that it should be her raping you instead of you doing... whatever the hell this was to her. Liliana silently promised herself she'd find a way to rape you some day (she can't, you know the Circle of Protection: Black spell and she can't really harm you or even destroy the enchantment)<br>\r\n<br>\r\nYou lapped up more honey from the laughing Liliana's ass and with one of your free hands, began to use your tickle wand on her inner thighs again.<br>\r\n\"Oh... Oh... I swear I'll get you back for this!\" Liliana said between giggles.<br>\r\n\"Right, right. Whatever you say, lady.\" You said after swallowing a thick gob of ass honey.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1524113400,
            "id":2481549,
            "title":"Drizzle honey over Liliana's butt"
        }
    },
    "info":{
        "author_id":"si91",
        "author_name":"Dilius the Bearded",
        "brief_description":"Be tickled by/tickle your favorite animated women! ",
        "created":1440997680,
        "description":"<td align=\"left\" class=\"norm\">This is an interactive story where a man or woman, gets to have a tickling experience with women from animated movies or TV shows. Here are a few ground rules:<br>\r\n<br>\r\n1) This is a story for adults only, because I intend for it to have sexualized tickling scenarios, and I will award gift points for well-written, detailed, descriptive chapters in this vein. If you are interested in knowing how much, please contact me by private message.<br>\r\n<br>\r\n2) All chapters must be written from a second person perspective (ex: you opened the door)<br>\r\n <br>\r\n3) No males tickling males. Only females tickling males, males tickling females, or females tickling females.  I personally prefer the male POV being tickled by female characters, and will thus award more points for well written chapters of this type than either of the other two types, but all well written chapters of these three types will receive gift points.<br>\r\n<br>\r\n4) Scenarios where the tickler(s) uses her/his hands, feet, mouth (licking, kissing, sucking, nibbling, blowing, raspberries, etc) are encouraged.<br>\r\n<br>\r\n5) The use of tickle tools (ropes, chains, feathers, oil, honey, brushes, gags, blindfolds, etc.) is encouraged. No part of the body is off limits (hence the 18+ rating)  <br>\r\n<br>\r\n6) Taunting/teasing and sadism are encouraged.<br>\r\n<br>\r\n7) No anime characters. By anime I specifically mean animation of Japanese origin (like Pokemon or Yu-Gi-Oh) and not animation that merely looks like anime (like Avatar: The Last Airbender). I don't have a problem with anime per se, it's just that tickling stories regarding animated characters are generally dominated by anime characters, and I want to create something different. <br>\r\n<br>\r\n8) Proper word usage, punctuation, spelling, and grammar, are essential. There are WAY too many interactive stories filled with garbled, barely intelligible chapters, and I don't find that acceptable. I'm not demanding perfection, but I do demand excellence, and will not give gift points for lazily written work.    <br>\r\n<br>\r\nPlease feel free to contact me with questions/suggestions! </td>",
        "id":2055543,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1574372820,
        "modified":1574372820,
        "pretty_title":"Tickling with Animated Women"
    }
}