{
    "chapters":{
        "1":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Be Jace",
                "Be Rhea",
                "Be Marek",
                "Be Tara"
            ],
            "content":"<div class=\"\"><div> <span>A few centuries ago humans went to war with an alien race called Namorns, they look like humans with too-large eyes and hands. Though it didn't last very long there was much bloodshed, <i>way</i> to much. People call it the Great War. After awhile the Great War moved to Yadar and humans and namorns met the lizard people. Now, the Lizard people are pretty peaceful, you leave them alone they'll leave you alone. But the humans and namorns saw the lizard people fight and decided that the lizard people were dangerous and had to be killed before the lizard killed them. So that added more bloodshed. \r<br>\n\r<br>\nThis really doesn't <i>have</i> to have anything to do with the story, just lets you know what has happened.</span></div></div>",
            "created":997678800,
            "id":69115,
            "title":"The Great War"
        },
        "11":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Working",
                "Relaxing at home seconds before there is a knock on the door",
                "Talking to Marek",
                "Waking up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you doing?</span></div></span></div>",
            "created":997678800,
            "id":69116,
            "title":"What are you doing?"
        },
        "112":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "A tall, cloaked figure leaning against the door frame",
                "A man half alive clinging to the door frame"
            ],
            "content":"<div class=\"\"><div> <span>You loung in a chair in front of the fire, listening to the rain outside and your mother in the kichen, making dinner. You look out the small window, night falls early in the slums. There is a knock on the door, \"Jace, could you see who that is?\" your mother calls. \"Sure.\" \r<br>\nYou open the door to see...</span></div></div>",
            "created":997678800,
            "id":69123,
            "title":"The knock"
        },
        "1121":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Who is it?"
            ],
            "content":"<div class=\"\"><div> <span>You hear sniffing noises from under the hood of the cloak. Whoever is under the cloak takes a deep breath, lets it out slowly, then says, \"Is this the house of a healer?\" The stranger has a low hissing voice that sounds female and holds her S's a milisecond to long. \r<br>\n\"Yes, do you need one?\" Anyone should know that this is the house of a healer. You have the sign of healers, a bowl and herbs with a brown circle around it, at your small gate.\r<br>\n\"I do need a healer, and will pay good money for it,\" the stranger says. This, too, puzzles you, people don't usually offer a lot of money for your mothers services.\r<br>\n\"Who is it?\" Rhea has come downstairs.\r<br>\n\"Tell mother it's someone who needs her.\" Rhea goes into the kichen.\r<br>\n\r<br>\nYou help the stranger into the kichen, to your waiting mother and sister. All the way you hear sniffing noises from under the hood. \r<br>\n\r<br>\nMother helps you lay the stranger down on a table. Mother takes the cloak off and she, Rhea, and you gasp in unison. </span></div></div>",
            "created":997678800,
            "id":69125,
            "title":"The stranger"
        },
        "11211":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "You mother agrees to heal the lizard person",
                "Your mother doesn't heal the lizard person"
            ],
            "content":"<div class=\"\"><div> <span>The stranger is a lizard person, only a handful of inches under eight feet. The lizard person is so thin she looks fragile. You notice the unusual angle of her right arm. You also see a gash down her two feet of tail. There are more deep cuts on her five-clawed hands and three-clawed feet. Her eyes are all white - she's blind. That explains a lot. Her scales and hair are a drak orange-red and she is wearing a black sleevless sirt and black pants.</span></div></div>",
            "created":997678800,
            "id":69132,
            "title":"A lizard person"
        },
        "112111":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "You share Rhea's feelings",
                "You don't share Rhea's feelings"
            ],
            "content":"<div class=\"\"><div> <span>\"Please. I can heal myself, but it is rather...difficult,\" the lizard person says. Mother looks at her for a minute, when she doesn't answer the lizard person says, \"Please. It will not be forgotten. We <i>do</i> hold honor and pay debts.\" \r<br>\nAfter a moments hesitation mother says, \"Rhea could get some splints, please.\" \r<br>\nRhea's eyes light up, she's always thought that if people had been nicer to lizard people the Great War wouldn't have been so. bad</span></div></div>",
            "created":997840740,
            "id":69326,
            "title":"Please"
        },
        "1121112":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Rhea comes back",
                "Someone burst's through the door"
            ],
            "content":"<div class=\"\"><div> <span>You quickly move to Mother's side, \"Mother, that is a lizard person. They are dangerouse. As soon as she's healed she will most likly kill us,\" you talk in a hushed tone.\r<br>\n\"I am blind not deaf, human,\" the lizard person mutters. Her scales have become darker, blacker.</span></div></div>",
            "created":1006369020,
            "id":82230,
            "title":"Lizard people are dangerous"
        },
        "113":{
            "choices":[
                "Help Marek, and take the Archaeologist's job",
                "Don't help Marek, but ask about the Archaeologist"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on Jace!\"<br>\r\n\"I said no Marek!\"<br>\r\nHere he is, once again, asking for a run...<br>\r\n\"Jace, please.\" Marek sputters, \"The only way I can get these to my customer is through your shipper.  I've GOTTA get them through!  I'll give you a cut...\" <br>\r\nYou lower your head.  \"I'm sorry Marek, but I'm not smuggling in a shipment of weapons, no matter how small it is.  Money isn't-\"<br>\r\n\"They're not weapons, they're Namorn artifacts.\" Marek cuts in suddenly.<br>\r\nYou blink at him stupidly. \"Na...Namorn?  Artifacts?\"<br>\r\n\"Yup.  My customer is an archaeologist studying the civilization who lived before the Namorn.  He's even offering a job to help him, but who wants to go to some stupid planet?  There's money to be made, right?\"<br>\r\nWell this changes things entirely...there had been rumors going around about artifacts and their power, but you thought none had been true...will you do it?  </span></div></div>",
            "created":1123118040,
            "id":265263,
            "title":"A business proposition"
        },
        "12":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "'Working'",
                "Relaxing at home seconds before there is a knock at the door",
                "Talking to Mother",
                "Waking up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you doing today?</span></div></span></div>",
            "created":997678800,
            "id":69118,
            "title":"What are you doing?"
        },
        "121":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Steal from the cloaked figure",
                "Steal from the man the the suit"
            ],
            "content":"<div class=\"\"><div> <span>You are walking down one of the allies that people call streets looking for someone who has some money.\r<br>\n\r<br>\nYou turn the courner and see two people. One is a tall cloaked person who is walking quickly down the street with thier head down. The other is a man in a black suit carring a briefcase that looks a bit to heavy.</span></div></div>",
            "created":997678800,
            "id":69136,
            "title":"Stealing"
        },
        "1211":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Yell at the cloaked figure, hey your angry",
                "Throw a rock at the cloaked figure"
            ],
            "content":"<div class=\"\"><div> <span>You figure that cloaked figure won't know what happened until they were at home so you follow them down the street. \r<br>\n\r<br>\nYou spend a few minutes looking for a pocket and soon find it. You slip your hand into the pocket and pull out a small pouch. As you turn away something wraps around your ankle and brings you in front of the cloaked figure, upsidown. You twist around and see that the things tail has you.\r<br>\n\"No one steals from me...human. Give whatever you stole back now.\" The thing holds out a black clawed hand. \r<br>\n\r<br>\nWhen you pause the scales on it's hand get a pinkish tinge and it says \"I usually make it a rule not to eat other intelligant forms. But I don't think I'll be breaking it to much in your case. I'm giving you three seconds to give it back, or I just found dinner. One...two...\" you drop the pouch into the persons hand. The things tail lets you go. You fall on your head in a pile. The thing steps over you and keeps walking.</span></div></div>",
            "created":997678800,
            "id":69140,
            "title":"'No one steals from me'"
        },
        "12112":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "The figure keeps walking",
                "The figure turns around"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You find a rock by your feet and throw it as hard as you can at the figure. It's tail comes up and knocks it aside.\r<br>\nWhat does it do?</span></div></span></div>",
            "created":997752960,
            "id":69144,
            "title":"The rock"
        },
        "121122":{
            "choices":[
                "Go left",
                "Go right"
            ],
            "content":"<div class=\"\"><div> <span>'Stupid girl,' the figure mutters. 'I gave you a chance to leave, didn't I?'\r<br>\nRhea watched as the figure walked slowly back in her direction. She moved back, keeping her eyes on it.\r<br>\n'Hey...hey, it was a mistake, no need to get violent...' she said.\r<br>\nThe figure shrugged.\r<br>\n'You tried to steal from me, then threw a rock. I can get as violent as I want.'\r<br>\nRhea risked a glance backwards, saw the way was clear, and ran for it.\r<br>\nShe dodged round the old debris that was found in all alleys, crates, garbage, old furniture. She thought she heard foorsteps behind her, though she couldn't be sure.\r<br>\nRhea came to the end of the alley, and looked to her left, where she knew a market was going on, and to the right, where she could get lost in the warren of twisting streets.</span></div></div>",
            "created":997978020,
            "id":69560,
            "title":"Chase"
        },
        "1211222":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Follow the lizard person",
                "Go home and tell Jace and mother what you saw"
            ],
            "content":"<div class=\"\"><div> <span>You run down you twisting roads pulling every trick you know to lose the figure. You are about to make a sharp turn left when you suddenly fall over and in the next second you are upsidown, again, looking at the cloaked figure. It was you by the feet with it's tail. The figure reaches out it's clawed hands and feels yout face, you hear sniffing from under the hood. It brings you closer and you see the tip of a reptilian snout. Your fear subsides a little. Why is it feeling your face like this?\r<br>\n\"What a brave human child you are,\" the stranger says mockingly, \"You must learn when to act and when not to.\" You swing your fists, desperet to get away. You hand catches it's hood and pushes it back. You gasp: It's a lizard person! It's hard to make out it's features, it's scales and hair are pitch black, blending it with the night. One thing that stands out is it's all white eyes. It's blind. That's why it was feeling your face and sniffing, it's can't see you.\r<br>\nThe lizard person cocks it's head to the side, as if listening. \r<br>\n\"My hands are already to tainted as it is,\" it mutters, it's voice sounds female. The lizard person grabs your arms and holds you upright, so that your eyes are level, \"I will let you go, but don't steel from me again. I will know it is you. Stay away from here tonight. If I am not mistaken there will be much bloodshed tonight.\" She sets you down gently, then side steps you and walks down the street. She takes off her cloak and tosses it to the side without stopping. She is so thin she looks fragile. What was she talking about? 'There will much bloodshed tonight'? What did she mean by her hands were 'to tainted as it was'? \r<br>\n\r<br>\nWhat are you going to do now?</span></div></div>",
            "created":997986600,
            "id":69576,
            "title":"Caught and let go"
        },
        "12112221":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Say 'The was ...'",
                "Run home"
            ],
            "content":"<div class=\"\"><div> <span>You follow the lizard person down the streets with the stealth of a cat. She holding something in her hand, turning it over. \r<br>\n\r<br>\nShe finally stops in front of a section of street that widens into almost a circle. There are people in front of her. One is a richly dressed man standing ahead of a half circle formed by man with guns and bullet proof vests.\r<br>\n\r<br>\n\"Do you have it?\" the richly dressed man asks.\r<br>\n\"Whould I come if I didn't?\" The lizard person throws the pouch you tried to take at his feet.\r<br>\n\"Of course. I was thinking, what was the agreed price?\"\r<br>\n\"Your company was going to find a way to give me back my sight.\" You stare at the man in shock. What could be <i>that</i> important. The man continues to talk to the lizard person. Movement at the courner of your eye makes to look at the shadows behind the lizard person. There is a man getting ready to shoot her. Before to can yell a warning her tail wraps around the mans neck and you hear a snap as the man drops.\r<br>\n\"That was rather stupid Mr. Staghorn. Don't you know that when you lose one sence the others sharpen,\" the lizard person says calmly even as she is being shot at. She ducks then runs toward the half circle. She grabs two men, one by her tail the other with her hand, jumps up and grabs a lamp post with her feet so that she is above the rest. With the other hand she takes one of the mens guns. She brings the two men she has together then lets then drop, liflessly, to the floor, all the wile soohing the other men with the gun in her other hand. \r<br>\n\r<br>\nSoon the only one that is left is the one she called Mr. Staghorn, she kills him as well. \r<br>\n\r<br>\nShe crouches down and picks up the pouch, \"What am I going to do with you?\" she asks it. She lifts her head to the wind, sniffs, then says, \"I thought I told you to leave.\" The lizard person turns her head toward you.\r<br>\n\r<br>\nYou...</span></div></div>",
            "created":998061180,
            "id":69738,
            "title":"Mr. Staghorn"
        },
        "121122211":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Finally go home",
                "Catch up to the Snake and try to talk"
            ],
            "content":"<div class=\"\"><div> <span>You slowly walk up to the lizard person, \"That was... Wow there isn't even a word for what that was,\" you say, voice filled with awe, \"What's your name?\" The lizard person's scales and hair get a pinkish tinge that you think means she is annoyed, \"People call me the 'Snake'. I don't know why...\" \r<br>\n\"You mean the mercenary the Snake? The lizard person who lived throught the Great War, the Snake? The <i>blind</i> lizard person, the Snake--\"\r<br>\n\"The mercenary who kills, and has killed, countless numbers of people, the Snake? The lizard person who has the blood of innocens on her hands, the Snake? The lizard person who enforces the myths that lizard people are mindless, bloodthirsty, killers, the Snake? Yes,\" the Snake's bitter voice is full of hate and...shame? \"I am she.\" The Snake grabs two of the men she killed and wraps her tail around the shoulder strap of another man and walks away.\r<br>\nWow. You never thought about <i>that</i> side of the Snake's fame.</span></div></div>",
            "created":998063460,
            "id":69745,
            "title":"Meeting the Snake"
        },
        "124":{
            "author_name":"hiddy",
            "choices":[
                "Jace",
                "A HUGE EVIL MONSTER"
            ],
            "content":"<div class=\"\"><div> <span>Marek is laying in bed enjoying the peaceful silence.<br>\r\nYou hear that!?<br>\r\nNothing<br>\r\nno noise<br>\r\nno kids<br>\r\nnothing<br>\r\nno mother<br>\r\nAh the good life<br>\r\nSuddenly a knock at the door.Marek growls and mutters\"come in\"</span></div></div>",
            "created":1134879120,
            "id":290429,
            "title":"who is knock-knocking"
        },
        "1241":{
            "author_name":"hiddy",
            "choices":[
                "In a back alley",
                "To Jace's home"
            ],
            "content":"<div class=\"\"><div> <span>Jace pads into the room.<br>\r\n\"What up?\"he asks.<br>\r\n\"I WAS enjoying the silence that YOU broke!\"marek snapps.<br>\r\n\"Shut up and follow me,Rhea called some stupid meeting.\"Jace explains.<br>\r\n\"Well if it's so stupid,\"Marek starts,hopping off the bed.\"then why are we going?\"<br>\r\n\"Cause I said so\"Jace telles him.Marek mutters something incoherent and follows Jace outside.<br>\r\nWhere do they head</span></div></div>",
            "created":1134879360,
            "id":290430,
            "title":"convo"
        },
        "13":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Working",
                "Talking to Jace",
                "Talking to Rhea",
                "Waking up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you doing now?</span></div></span></div>",
            "created":997678800,
            "id":69119,
            "title":"What are you doing?"
        },
        "132":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "'Nothing important'",
                "'She says she met the Snake'"
            ],
            "content":"<div class=\"\"><div> <span>You walk up to Jaces house and knock on the door. \r<br>\n\"The door is open!\" You hear Mistress Falconer call. You open the door, \"Hey Jace!\" you call. \r<br>\n\r<br>\n\"Yeah Rhea, whatever you say.\" Jace comes down the stairs as he says this. You both grip eachothers arm in greeting, \"C'mon, Rhea is beong weird again.\" Jace leads you outside.\r<br>\n\"What is it this time?\"</span></div></div>",
            "created":998599020,
            "id":70992,
            "title":"Talking"
        },
        "14":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Talking to  a furture employer",
                "Sitting at your home sett, thinking",
                "Finishing a job",
                "Waking up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you doing?</span></div></span></div>",
            "created":997678800,
            "id":69120,
            "title":"What are you doing?"
        },
        "141":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "What is the job"
            ],
            "content":"<div class=\"\"><div> <span>You sit in a comfortable arm chair, your tail draped over the side, the end is twitching. People come through the crack in the sewer wall that serves you as a door. You heard them coming long ago. You sniff the air. A million smells come to you. You sort through them to find the sent of the newcomers. They are Namorns...six of them. Five of them must be bodygaurds, they smell of metal, leather, their personal sent, sweat, the sewer fumes, cotton. The other one must be Nazzar, the one who hired you. He smells of expensive fabrics, sweat, many different kinds of metal, his personal sent, hair oils, and rich foods. You breath deep, making sure you rememberthe sents.\r<br>\n\"Have a seat, Nazzar. I would offer food but I doubt you would want what I have to offer.\" A bitter sent becomes stronger - fear. Everyone knows you are blind and it scares him to have you waiting for him. You hear the scratching of the chair against stone and the rustle of fabric. The bodygaurds take places around their boss and draw their weaponds, they smell like swords but you can never be sure. You breath deeply turning your head. Now you know where all the gaurds are.\r<br>\n\"Is it true what they say?\" Nazzar asks in a high piched voice that hurts your ears.\r<br>\nHad you been able to see you would see your scales and hair get a pinkish tinge, you hate it when people want to know if what 'they say' is ture, \"I must speak to this scholar 'They'. For They have many things to say about everything, and it is rarely true. I must also speak the scholar 'Everyone'.\" You wait for Nazzar to say why he hired you. \r<br>\n\r<br>\nYou sigh and the pinkish tinge in your scales and hair gets stronger, \"How can I tell you if what 'they say is true' if I don't know what it is?\"\r<br>\n\"Right. They say that you fought in the Great War. Is it true?\"\r<br>\n\"Yes. I was defending my clan, it is how I lost my sight.\"\r<br>\n\"But you weren't able to save your clan, you're the only one.\"\r<br>\nYour scales turn into a light shade of red, \"Do you have a job for me or not? I have better things to do then relive memories with a namorn.\" </span></div></div>",
            "created":997805460,
            "id":69214,
            "title":"A job"
        },
        "1411":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Later that day out in the slums",
                "That night out in the slums"
            ],
            "content":"<div class=\"\"><div> <span>Nazzar tells you about another Namorn and the defences he has in his house. You are slightly interested. You quickly push the intrested away in disgust.\r<br>\n\"What do you want me to do?\" you ask.\r<br>\n\"I need you to deliver a mess - \" You have stood up wraped your tail around the short Namorns neck and lifted him up to eye level before he knew what happened. You hold him inches away from your snout, the gaurds can't do anything.\r<br>\n\"Listen to me <i>Namorn</i>. I am no...lapdog sent to run your errands! If you want your message delivered send some errand boy to do it!\" you tell him, your scales and hair the deep scarlet of rage, \"Get out. And is you come near my sett again you will leave with no tongue, hands, or feet. Do I make myself clear?\" For all you are blind you still make your point, the smell of fear wipes out all others on Nazzar. \r<br>\n\r<br>\nYou throw him out of your sett with your tail. To emphasize your point only two of the five gaurds leave with Nazzar.</span></div></div>",
            "created":997807800,
            "id":69223,
            "title":"Grrrrrrrr"
        },
        "143":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "You make it across the gate",
                "Something stops you"
            ],
            "content":"<div class=\"\"><div> <span>You run down the long driveway at top speed, your long legs taking you far. You can smell the metal of the gate not far ahead. You hear something speeding toward you and smell a different kind of metal: A bullet. You jump to the side.\r<br>\n\r<br>\nOnce you think the gate is close enough you jump...</span></div></div>",
            "created":998331360,
            "id":70250,
            "title":"The gate"
        },
        "144":{
            "author_id":"blackdragon",
            "author_name":"The Nameless Hermit",
            "choices":[
                "Walk around the slums",
                "Stay in your house all day"
            ],
            "content":"<div class=\"\"><div> <span>You wake from your dream to stare into darkness. You open your eyes, nothing has changed. You get out of the small padded courner that serves you as a bed and walk over to a small pool of water in the back of the small cave you live in. You reack into the icy water and pull out another shirt and pants. You dry them out as best you can then change into them, putting the other pair into the pool. You do some quick stretches, you have to think of more - you don't even breath hard anymore. Then think about what you're going to do today.</span></div></div>",
            "created":997842960,
            "id":69340,
            "title":"Another day *sigh*"
        }
    },
    "info":{
        "author_id":"blackdragon",
        "author_name":"The Nameless Hermit",
        "brief_description":"Four people looking for adventure, and dealing with past demons",
        "created":997743660,
        "description":"<td align=\"left\" class=\"norm\">The year is 7084 aliens have landed on Earth and that's old news. Now four young people set out to look for adventure, or just get out of the slums that they live in and see the world.\r<br>\n\r<br>\n<u>Jace Falconer</u>: Jace is a human, he has short reddish brown hair with brown eyes and is 23. He lives in the slums with his mother and sister Rhea. He's the leader type, always takes control and keeps a pretty cool head no matter what. He never knew his father, and is not sure he ever wants to. Jace works at a shipping company, loading and unloading, his mother works as a healer and midwife, his sister is a pickpocket.\r<br>\n\r<br>\n<u>Rhea Falconer</u>: Rhea is a human with shoulder length black hair with brown eyes and is 18. She knows the best way to travel, the quickest way and slowest way and things like that. Rhea always looks on the bright side of things, and can find good in almost anyone. She belives that if humans had tried being nice to the lizard people instead of hunting them there wouldn't have been so much bloodshed, and she is right(will be explained in 1st chapter). She wants to become friends with Tara sort of understand her better, if you will.\r<br>\n\r<br>\n<u>Marek Moonsword</u>: Marek is a human with short brown hair with ice blue eyes and is 20. He is a merchant and lives in the slums. He is Jaces friend. He knows how to get the best good, weaponds, food for the lowest prices and how to sell them for the highest. \r<br>\n\r<br>\n<u>Tara \"The Snake\" Quickclaw</u>: Tara is a lizard person. She looks like a reptilian human. She is a mercenary, who people call 'The Snake', no one knows her real name. The only thing people know about lizard people is how they fight and the myths people have made up and they are the most hated race in the universe. She has forgotten how old she is. Her scales and hair change to show her emotion(pink: irrated, red: angry)or at will. Other than that they are black. She is one of the best mercenary even though she is blind. Her eyes are all white, if she ever got her sight back they'd be silverblue. She lost her eye sight durning the Great War. Tara has many past demons and enemies. She could get her eyesight back if she went back to her home planet, Yadar, but she doesn't because she is afraid of what her people will think of her. Lizard people are actually rather peaceful, and being a mercenary makes Tara sick.\r<br>\n\r<br>\nPlease, please, please GIVE ME YOUR IMPUT AND ADD CHAPTERS!!!     </td>",
        "id":209084,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1134879360,
        "modified":1134879360,
        "pretty_title":"Looking for adventure"
    }
}