{
    "chapters":{
        "1":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Wakes up shrunk at home.",
                "Shrinks at school.",
                "Shrinks near a playground.",
                "Shrinks at the mall.",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First of all is a question. Where do you want this bully to shrink?</span></div></span></div>",
            "created":1138942800,
            "id":550220,
            "title":"Where?"
        },
        "11":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "One of your sisters comes in.",
                "You get blown off the bed by a gust of wind.",
                "Your mom comes in.",
                "You climb off the bed.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You wake up in the morning and immediately do what you do every morning.  Turn back over and fall asleep.  It was the weekend so you didn't have to worry about school.  Not that you did anyways.  You had skipped school so many times that you've lost count.  The only time you went to school was when you wanted to pick on people.  You turn over and realize something.  Your head wasn't on your pillow anymore.  You open your eyes to look for it when you get the biggest shock of your life.  You were shrunk on top of your bed.  You jump up and take a look around.  Almost everything in your room dwarfed you in size.  Judging by your surroundings, you guess that you must be barely two inches tall.  You take some time to recover from the shock and then...</span></div></div>",
            "created":1138942800,
            "id":299652,
            "title":"Shrunk!"
        },
        "111":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Jessica",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Make your pick.</span></div></span></div>",
            "created":1139029200,
            "id":299772,
            "title":"?"
        },
        "1111":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Her diaper",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The sound of your bedroom door swinging open caught your attention.  You turned and were horrified and amazed at what you saw.  Your two year old sister Jessica was standing in the door.  She was two feet tall but in your eyes she was a goddess.  She could easily crush you between her chubby toddler fingers.  She starts coming towards your bed and she climbs on.  You have no idea what she is doing but then it becomes all too clear.  Your baby sister has come into your room to jump on your bed.  The first jump she takes sends you flying and you land back on the bed.  You are sent up and down with every massive bounce she takes until finally you land in...</span></div></div>",
            "created":1139115600,
            "id":299844,
            "title":"Jessica"
        },
        "11111":{
            "author_id":"lumberpanda",
            "author_name":"Lumber Panda",
            "choices":[
                "you climb out of the diaper",
                "you climb in to the diaper"
            ],
            "content":"<div class=\"\"><div> <span>in her belly button, but cannot hang on as she continues to jump up and down.  This causes you to slip and fell right into her diaper's waist band. You hang onto the plastic like material as best you can, but the jumping is actually causing you to be pushed in! <br>\r\n<br>\r\n<br>\r\n<br>\r\nNow you have a serious choice to make. if you climb out, you are more than likely to fall and you may get crushed by your baby sister. But if you get into the diaper, you will be safe, at least until she stops jumping on the bed where you could then possibly get to safety.</span></div></div>",
            "created":1157086800,
            "id":343732,
            "title":"Her Diaper"
        },
        "111112":{
            "author_id":"lumberpanda",
            "author_name":"Lumber Panda",
            "choices":[
                "Jessica goes to her room to play",
                "Jessica is dressed and put in a stroller by one of her older sisters"
            ],
            "content":"<div class=\"\"><div> <span>you decide to allow yourself to be pushed into your baby sister jessica's diaper so that you will at least be safe. It doesn't take long, thanks to the continuous jumping, you are finally pushed in and fall to the bottom of the diaper. it is dark, but some light does penetrate through the diaper.<br>\r\n<br>\r\nJessica is still jumping, and although it does cause you to bounce around a bit, it's not so bad inside the diaper. you hang on as best you can.<br>\r\n<br>\r\nafter a few more minutes of jumping, Jessica finally stops. you look around for a moment and can see that you are resting at the bottom of the diaper toward the back since you can look straight up her talcum powder covered butt crack and can see a small beam of light shinning through the back of her diaper.<br>\r\n<br>\r\nsuddenly, you feel some pressure put upon you as she sits down on the bed and very carefully lowers herself back onto the floor. she then begins to walk, you can only assume out of the room.</span></div></div>",
            "created":1157086800,
            "id":343733,
            "title":"in you go..."
        },
        "1111122":{
            "author_id":"lumberpanda",
            "author_name":"Lumber Panda",
            "choices":[
                "noticed that Jessica was wet and changed her diaper in the park",
                "put her down so she could go play in the grass with some of her toys."
            ],
            "content":"<div class=\"\"><div> <span>as Jessica is walking, she hears her oldest sister, Jasmine calling to her. \"Jessy!  where are you? it's time to get dressed and go to the park! Jessy, Jessy, come to your room!\" at this your sister begins to run to her bedroom, with you bouncing around in her diaper. <br>\r\n<br>\r\nonce there, Jasmine picks her up and lays her down on the changing table. she then asks Jessica if she needs to be changed. Jessica shakes her head, but Jasmine checks anyways by inserting her finger in the leg band of the diaper. not feeling any wetness, she nods and tells Jessica that she's a good girl and then goes over to the closet and pulls some clothes out.<br>\r\n<br>\r\nshe then asks Jessica to sit up so that she can dress her. she pull some long pants up her legs and over diaper...which by doing so blocks out all light inside the diaper. now you really can't see. Jasmine then puts a pink shirt on Jessica and some socks and mary jane shoes on her feet. she then carries Jessica out of the room into the kitchen, grabs the diaper bag and her purse and then goes out into the garage.<br>\r\n<br>\r\nIn the garage, Jasmine pulls a stroller out of the corner and puts Jessica into it. once Jessica is secured, Jasmine puts the diaper bag in the compartment underneath the stroller and begins to walk.<br>\r\n<br>\r\nyou begin to think that this probably isnt the best place to be and begin to think of a way out. it must be really hot outside because you are starting to sweat inside this diaper. you can hear noise outside, but can't make it out. you could hear pretty well before, but now that your sister is wearing pants you cant really hear that well.<br>\r\n<br>\r\nyou begin to climb out the back of the diaper, but it is so hot that you become exhausted<br>\r\n quite easily and take a break.  <br>\r\n<br>\r\nsuddenly, there is a lot of movement, your sister must have felt you because she is wiggling her butt around in the stroller trying to get comfortable.<br>\r\n<br>\r\nhowever, she was not wiggling around because she felt you, she was wiggling around because she had to go pee, which your sister didnt notice because she was too busy talking to a friend.<br>\r\n<br>\r\nwithout warning you loose your grip and fall back down into the bottom of the diaper, and it hits you...no, it really hits you! your sister just wet her diaper with you in it! the pee is quickly absorbed by the diaper, and you are covered in what remains of it.  great you think.<br>\r\n<br>\r\n despite the fact that Jessica just wet herself, she didnt seem to care too much after the fact. she sat in her stroller for another good 10 minutes or so when they finally got to the park.  there Jasmine took her out of the stroller and..</span></div></div>",
            "created":1157086800,
            "id":343748,
            "title":"going for a ride"
        },
        "11111221":{
            "author_id":"lumberpanda",
            "author_name":"Lumber Panda",
            "choices":[
                "thrown into a nearby trash can",
                "placed into a compartment in the diaper bag"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine lifted Jessica out of the stroller and stood her next to the park bench where Jasmine and her friend sat down to talk. you found yourself once again bouncing around inside of the diaper as Jessica toddled around, her sister keeping a close eye on her. being inside of a urine soaked diaper was not fun, but it was probably the safest place you could be right now all things considered. you could her giggles from above and the sound of the two older girls talking. <br>\r\n<br>\r\nseveral minutes pass when without warning Jessica began peeing again! the stream hit you like a waterfall while the diaper absorbed the urine around you. soon the diaper began to really buldge as it soaked up the urine and Jasmine took notice. she went and picked Jessica up and handed her to her friend for a minute while she got the diaper bag out from underneath the stroller. she then laid Jessica down on a changing pad on the bench between the two girls and pulled down Jessica's pants. suddenly light began to filter in threw the urine soaked diaper and you knew what was about to happen to you had to get their attention as you laid at the base of the diaper awaiting the inevitable.<br>\r\n<br>\r\nthe diaper was opened and light poured in as you saw a massive hand and baby wipe come right at you! you tried to yell and wave but Jasmine wasn't even looking at what she was doing - she was too busy talking to her friend as she changed Jessica's diaper. you were picked up by the wipe and the roughly dropped back into the wet diaper. the wipe completely covered you as you tried to get out from under it. a few seconds later another wipe was dropped on top of you and then you felt the diaper jerk as it was pulled out from under Jessica. Jasmine then rolled the used diaper up and placed it off to the side as she fetched a clean diaper out of the diaper bag. you were now seriously trapped inside the wet diaper and knew you had to get out before she threw it away! you struggled with all your might but to no avail. <br>\r\n<br>\r\nsuddenly you felt the diaper being lifted, you were then</span></div></div>",
            "created":1345006800,
            "id":1404930,
            "title":"noticed that Jessica was wet and changed her di..."
        },
        "111112212":{
            "author_id":"lillyhammer",
            "author_name":"Lillyhammer ",
            "choices":[
                "Escape is unlikely - you’re trapped inside a diaper pail",
                "Escape is possible - you’re in the bathroom trash can. "
            ],
            "content":"<div class=\"\"><div> <span>Jasmine finished changing Jessica and glanced around the park for a trash can - luckily for you there was none in sight. She instead placed the wet diaper into a plastic liner pocket in the diaper bag designed specifically for this purpose. <br>\r\n<br>\r\nYou felt the urine soaked diaper squeeze around you as it was placed in the compartment. A moment later there was motion as the bag was picked up before being placed back in the stroller. Several minutes would pass before you heard some commotion followed by some vibrations, a clicking sound, and finally the motion of the stroller moving again. You couldn’t hear much but could make out some muffled voices in the distance. No light shone through your diaper prison and your senses were overwhelmed by the smell, taste, and feel of urine. <br>\r\n<br>\r\nJasmine pushed Jessica home talking to her friend the whole way while Jessica calmly sat in the stroller. Eventually they arrived home and Jasmine unbuckled Jessica from the stroller before handing her off to her friend to carry inside. She then gathered up her things and grabbed the diaper bag as well before heading inside. She the. remembered the diaper and gently picked it up out of the bag and disposed of it. <br>\r\n<br>\r\nJust as you got used to the movement you felt it come to a stop. The sound of a click was heard followed by some vibrations, voices and then nothing. For a moment anyway- thebag was lifted and you could sense the swaying motion as Jessica carried it inside - a minute later the diaper was squeezed around you as it was lifted before you felt like you were in free fall! A loud thud and some plastic crinkling was all you could make out as everything came to a stop. You realize she just threw out the diaper - but where and will you be able to escape? You begin to struggle as much as you can and after what felt like an hour you’re able to squeeze and arm out of the wadded up diaper - you use all your strength to pull yourself up and eventually get your head free. You realize where you are and determine...</span></div></div>",
            "created":1552688340,
            "id":2630663,
            "title":"placed into a compartment in the diaper bag"
        },
        "1111122122":{
            "author_id":"lillyhammer",
            "author_name":"Lillyhammer ",
            "choices":[
                "Get out of trashcan at all costs!",
                "Try and get someone’s attention while still in the trash "
            ],
            "content":"<div class=\"\"><div> <span>To your relief you found yourself in the bathroom trashcan. A bunch of snotty tissues lay beneath the diaper and some feminine hygiene wrappers. You struggle some more to free the rest of your body from the diaper and eventually get both of your arms free. With all your might you push yourself out and land on the tissues below. Something however broke your fall and you realize wrapped up in some of the tissue was a used tampon! <br>\r\n<br>\r\nJust as you’re getting your bearings, the light the bathroom turns on the door closes, Jasmine enters and immediately walks over to the toilet where she promptly pulls down her pants and begins to pee. A moment later you hear some rustling as she open a new tampon package but first removes her old one, wrapping it in tissue and dropping it in the trash can next to the toilet. You’ve got nowhere to go as it land directly on top of you! Your new wedges between he outer wall of a diaper and two used tampons! Despite not coming in direct contact with the foul fluids you still find yourself disgusted. As if being peed on wasn’t bad enough!<br>\r\n<br>\r\nJasmine finishes cleaning up before inserting a new tampon,  flushing the toilet, pulling her panties up and washing her hands. The light is turned off and you’re once again in silence as you contemplate what your next move is. </span></div></div>",
            "created":1564087440,
            "id":2692229,
            "title":"Escape is possible - you’re in the bathroom t..."
        },
        "11112":{
            "choices":[
                "She wants to go play in her room",
                "She notices a new \"doll\" in her pocket"
            ],
            "content":"<div class=\"\"><div> <span>Jessica comes down again and you are launched into the air. You are flying straight towards Jessica! You slam into her pink t-shirt and slide down into her pocket. As your your 2-year-old sister jumps, you struggle to stand. When you do, you realize how small you are. You are big enough to fit in a baby's pocket! You especially feel small when you see how big her pacifier clip is that is clipped on to her pocket. You hold on to it as your sister jumps. This wasn't good. Jessica loved dolls and you were the right size for her dolls. You had a good feeling that you were going to see the inside of her Fisher Price dollhouse today. You also had a feeling that you would see the inside of her playpen, crib... and even her mouth or diaper! You quickly shake that thought, but you know it could happen... she is only 2. <br>\r\n<br>\r\nJust then, you sister stops jumping. Why?</span></div></div>",
            "created":1139115600,
            "id":299862,
            "title":"Pocket"
        },
        "111122":{
            "choices":[
                "She makes a messs in her diaper while on you",
                "She pulls you out and plays with you"
            ],
            "content":"<div class=\"\"><div> <span>A pugy hand comes into the pocket and wraps around you and takes you out of the dark space and you look into the eyes of you godess 2 year old sister as she giggles and examines her new doll. \" Jessica please go call for anyone and show me to them please\" She ignored your screams for help and started playfully shacking you . She releazes you from her hand and you freefall to the bed where you land and scream in pain as you hit the matress. You look up and she Jessica looking dowm at you. She giggles again and throws  her feet forward and lets her diaper come down apon you in horror. You were now crushed by a diaper clad behind and was being smushed into the ground while she giggled again and again.</span></div></div>",
            "created":1215406800,
            "id":553228,
            "title":"She notices a new \"doll\" in her pocket"
        },
        "1111221":{
            "choices":[
                "She gets changed ",
                "She stands up and you are stuck to her diapered butt"
            ],
            "content":"<div class=\"\"><div> <span>After a while of being under my 2 year old sister I start to smell the scent of crap and feel  the hot air above me. Oh crap I think she's going to mess her diaper on top of me. After  5 giant farts my sister finally poops and the diaper starts to get heavier causing more pressure and I feel like I'm starting to stick.</span></div></div>",
            "created":1406696400,
            "id":1835650,
            "title":"She makes a messs in her diaper while on you"
        },
        "11112212":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "My mom. She is inspecting the new doll Jessica found",
                "Jessica. She is going to give me a closer look at her butt",
                "One of the other sisters"
            ],
            "content":"<div class=\"\"><div> <span>After what felt like forever, I feel my sister bend forward and start to lift her butt off the floor, but I’m stuck to the bottom of her diapered butt.  When she’s finished standing up completely the floor flies by as she turns around to look for me. I start to feel dizzy from all the circles my sisters doing while she looks for me. All the while the smell from her diaper surrounds me and it seems like it’s just getting worse. I tried to struggle to get free, but it’s like glue holding me in place.  Jessica  starts giggling and I  look up to notice she is in front of a full length mirror and staring at me stuck to her diapered butt. “Silly dolly. Do you like my butt?” She says as she bends over, and her hand grabs me, ripping me from the stinky diaper. “If you like it that much I’ll give you a closer look.” Just as she says that Mom walks into my room.<br>\r\n “Jessica what are you doing after brothers bedroom? You know how hateful he gets when anybody comes into his room. I swear that boy is only duty is to make other people’s lives miserable. And have you seen him I haven’t been able to find him yet today?” “ no I not see him. I found new dolly and I now need a diaper change.” “Ok, sweetheart. Lets get that diaper changed, then I’ll go look for your brother again. Plus I’ll look at you new dolly and i just might let you keep it to spite your brother.” <br>\r\n<br>\r\nI try and get loose from my sisters grip, but at this size I’m no match for her. Then I start to get mad at my mom for allowing my sister’s intrusion in my room go unpunished. Also to top it off she just agreed to let my sister keep a doll she found in my room. She would actually let my sister steal my stuff? And she wondered why I didn’t like people in my room. Jessica’s hand swings back and forth, making me sick to my stomach, as she walks to her room. She drops me in her toy box as she walks to the changing table. I stand up and can tell I’m trapped. The walls of the box are too high to climb. I kick the wall in frustration and this causes a pile of toys to fall on top of me. A shadow appear over the box and when I look up I see a hand reaching for me. Once pulled I see the face of....</span></div></div>",
            "created":1516771260,
            "id":2444316,
            "title":"She stands up and you are stuck to her diapered..."
        },
        "111122121":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Makes him be her dolly",
                "Puts him in her diaper ",
                "Readers choice "
            ],
            "content":"<div class=\"\"><div> <span>Mom raised kyle up to her face to look at the “dolly” better. Kyle started to wave his hands and yell for help. “Mom it’s me, Kyle! I need help!” She gasped at knowing it’s really him. “Kyle, what have you gotten yourself into this time.” She said as she went and sat on the rocking chair in Jessica’s room. “I didn’t do anything! I woke up like this! Why would I do anything to make me this small! Get me help right now!” She started to rock in the chair with a scowling look on her face, before getting up and heading over to Jessica. <br>\r\n<br>\r\n<br>\r\n“Jessica this “dolly” is actually your brother, Kyle. He’s being mean to mommy again so I’ll let you punish him. Why don’t you use him as a new toy or whatever you want to do to him till he’s nice again.” She says dropping kyle on the floor in front of his sister. “Hey! You can’t do this! I need help, so help me already!” Mom starts to walk away and Kyle tries to run after her, but Jessica catches him, and grins. “I punish you for being mean to mommy.” She says as she gets up holding kyle in her fist. “You go in time out. You no be mean.” She opens the toy microwave on her kitchen play set and tossed kyle in, before shutting the door. “I be back and you better be nice.” She says and walks off to play. <br>\r\n<br>\r\nAn hour later she comes back and takes kyle out of the play-set. Kyle dodged her hand till she grabbed one of his legs and dangled him upside down. “You nice now!” She demanded. “No! Why would I be nice to you just because you put me in there.” Kyle yelled. Jessica frowned and tried to think of another punishment for Kyle. </span></div></div>",
            "created":1566659940,
            "id":2707049,
            "title":"My mom. She is inspecting the new doll Jessica ..."
        },
        "1111221212":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><div> <span>Jessica looked at her tiny screaming brother dangling in her hand. He’s still being mean and won’t stop. Then she remembered he also was mean when he had to change her diaper and said it was beyond disgusting. Jessica got a grin on her face as she looked at kyle. “I have netter punishment now. You better be nice after.” She said as she pulled open her diaper.<br>\r\n<br>\r\nKyle looked down in horror and disgust as she moved him over the opening. “Don’t you dare! Jessica! Get me help! I won’t pl....” he is cut off as Jessica let’s go and he falls into he diaper.<br>\r\n<br>\r\nWhere did she put him?</span></div></div>",
            "created":1594298700,
            "id":2864734,
            "title":"Puts him in her diaper "
        },
        "1112":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Jasmine",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Make your pick.</span></div></span></div>",
            "created":1139029200,
            "id":299773,
            "title":"?"
        },
        "11122":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Kelly",
                "Chloe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Make your pick.</span></div></span></div>",
            "created":1139029200,
            "id":299774,
            "title":"?"
        },
        "111222":{
            "author_id":"yeetmstr",
            "author_name":"YeetMstr",
            "choices":[
                "Kind and compassionate",
                "Cruel and evil"
            ],
            "content":"<div class=\"\"><div> <span>Chloe, the next oldest in the family, walks in. She was quite small, (5ft 6) when you were normal sized. But at 4 inches, she was a goddess. You jump up and yell at her, trying to get her attention. She casts her eyes on you and gasps.<br>\r\n<br>\r\nHer personality is...</span></div></div>",
            "created":1587382140,
            "id":2821525,
            "title":"Big sis...?"
        },
        "1112221":{
            "author_id":"yeetmstr",
            "author_name":"YeetMstr",
            "choices":[
                "Yes",
                "Nah"
            ],
            "content":"<div class=\"\"><div> <span>Chloe was always known for her kindness and generosity. She wears a worried look and brings her face to eye level with yours. \"What happens?\" She asks. \"I just woke up like this...\" You reply. She picks you up and carries you to her room. It's full of typical 13 year old stuff. She thinks for a moment. \"I'll go get some food.\" She says. You wait.<br>\r\nAnd wait<br>\r\nAnd wait<br>\r\nShe eventually comes back with leftover breakfast. \"I gave mum the excuse you were off somewhere. And ill tell the teachers you are sick.\" You nod.<br>\r\nShe glances at you. \"Would you like to come to school with me?\"<br>\r\n</span></div></div>",
            "created":1587383580,
            "id":2821537,
            "title":"Kind and compassionate"
        },
        "112":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "One of your sisters comes in.",
                "You decide to venture out of your room."
            ],
            "content":"<div class=\"\"><div> <span>You are pacing back on forth on your monstrous bed, contemplating what to do when all of a sudden you feel a strong gust of wind blow in from your open window.  You plant your feet firmly but there is not a lot of traction on your bed and you weren't very strong at this size.  The gust easily overpowers you and takes you off the bed. You scream as you fall and close your eyes.  You land with a hard smack on the middle of your floor.  You lay there for a few seconds, trying to figure out if you're still alive.  You move each of your body parts and see that miraculously, you haven't been hurt.  You slowly get up and find your balance.  The room looks even more gigantic now that you were on the floor.  Then...</span></div></div>",
            "created":1138942800,
            "id":299653,
            "title":"Blown away"
        },
        "1121":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Kelly",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will it be?</span></div></span></div>",
            "created":1138942800,
            "id":301132,
            "title":"?"
        },
        "11211":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Get her attention",
                "Watch what she does"
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden, you see a shadow cross the floor and you turn to the source.  You are shocked to see your sister Kelly standing in the door.  She was only eight years old but she made you feel incredibly small.  Even her feet dwarfed you in size.  She was a very ditzy girl and she barely ever took the time to think about anything.  She always did things out of impulse and she was happy that way.  She also loved bugs.  She was wearing a pink shirt with a heart on it and a pair of jeans.  She had no shoes on and she was walking towards you.  The ground shook as your giant of a little sister slowly made her way across the room.  Each step seemed to you, to be hundreds of meters.  Soon she was standing beside you.  She was looking around the room.  What do you do?<br>\r\n</span></div></div>",
            "created":1141275600,
            "id":304444,
            "title":"Kelly"
        },
        "112111":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Bite her foot (ew)",
                "Climb her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do you plan on doing that?</span></div></span></div>",
            "created":1141275600,
            "id":304445,
            "title":"?"
        },
        "1121111":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "\"A bug!\"",
                "\"Kyle?\""
            ],
            "content":"<div class=\"\"><div> <span>As much as you hate the idea of putting your mouth anywhere near your little sister's disgusting little feet, this way seemed like it would get her attention.  Kelly was always running around barefoot so her feet were covered with dirt, lint and sweat.  You close your eyes and open your mouth and move towards the foot.  You clamp down your tiny little jaws on it and you immediately get a response.  Your sister looks directly at you and says....</span></div></div>",
            "created":1141275600,
            "id":324676,
            "title":"Bite hard"
        },
        "11211112":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Pet",
                "Doll"
            ],
            "content":"<div class=\"\"><div> <span>\"Kyle?\" Your sister says curiously.  She bends over to get a closer look at you.  \"Is that you?\" she asks.<br>\r\n<br>\r\n\"Yes!\" you yell up at her monstrous face, \"take me to mom so she can help me get back to normal again!\"<br>\r\n<br>\r\nYour sister picks you up and brings you in front of her face.  Her hot breath was rebounding off you as she inspected you from head to toe.<br>\r\n<br>\r\n\"Nah,\" she said, \"I'm not going to take you to mom because you're going to be my new....\"</span></div></div>",
            "created":1143176400,
            "id":308313,
            "title":"Kelly"
        },
        "112111121":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Mom calls her down for dinner.",
                "Someone comes in."
            ],
            "content":"<div class=\"\"><div> <span>\"You're going to be my new pet!\" your \"little\" sister says happily.  She skips merrily to her room with you in her hand.  You yell as you see the cage.  This makes your sister giggle.<br>\r\n<br>\r\n\"Your voice is so high pitched!\" she said, \"It sounds just like Harry.\" You gulp in fear.  Harry was the name of her hamster that passed away two days ago.  Kelly dangles you above the cage for a bit before finally dropping you onto a floor of wood chips.  There were glass walls on every side, a hamster wheel, a little hamster house, a feeding bowl and a water bottle.<br>\r\n<br>\r\n\"Kelly,\" you yell up at your sister who is taking great interest in you, \"If you let me go I'll get you a way cooler pet!\"<br>\r\n<br>\r\n\"Nah,\" Kelly says, \"I heard hamsters only live for a few years, and most other pets are the same.  But you oughta live for a really long time  I'll take good care of you as long as you behave yourself. mister!  You were  a terrible brother.  I'm sure you'll make a much better pet!\"  You start to get frustrated and try threatening her.<br>\r\n<br>\r\n\"You're going to get in so much trouble with mom when she finds out.\" you say angrily.  Your sister frowns and wiggles the cage.  You slip on the woodchips and fall hard to the floor.  This makes your sister laugh.<br>\r\n<br>\r\n\"Nah,\" she said, \"You're going to be my pet forever!\"  She wiggles the cage again and you again fall over. to Kelly's great amusement.  Your sister inspects you with great interest until...</span></div></div>",
            "created":1143176400,
            "id":308317,
            "title":"Captured and Caged by Your 8 Year old Sister"
        },
        "112111122":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "Time to play house.",
                "Kelly needs to take a bath."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"You're going to be my new doll, Kyle.\"<br>\r\n<br>\r\n\"Kelly, get Mom. No, Kelly, don't you dare! Kelly!\"<br>\r\n<br>\r\nKelly's hand closed around you and she skipped to her room. She puts you in her polly pocket house.</span></div></span></div>",
            "created":1154494800,
            "id":336732,
            "title":"House"
        },
        "1121111221":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "baby",
                "mommy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's time to play house Kyle said Kelly. But first let's get you dressed because your going to be the............</span></div></span></div>",
            "created":1216702800,
            "id":559141,
            "title":"Time to play house."
        },
        "11211112211":{
            "choices":[
                "ME! ",
                "a larger doll"
            ],
            "content":"<div class=\"\"><div> <span>\"No WAY!\" Kyle screamed, as he attempted to escape.<br>\r\n\"No no baby! That's naughty!\" Grabbing Kyle firmly around his waist, Kelly placed him on her knee with his backside in the air.<br>\r\n\"What the he....ow!\" firm swats came down on Kyle's backside as Kelly punished her naughty 'baby' brother. <br>\r\n\"Now time to play.\" Flipping Kyle over, Kelly ripped off his shirt and jeans easily, leaving him in his underwear as she grabbed the doll sized diaper. Laying it down she went to rip Kyle's underwear off as well. Kyle squirmed even more at this and tried to get away, but Kelly held him firm and ripped the tiny undies away and layed him on the diaper. Pinning him to it with one hand, she accidentally overpowdered Kyle's doll sized bottom, making it completely white. She giggled. \"Ooopsie!\" Then securing the diaper, she grabbed a yellow onsie with a hood that had a duck bill attached to it. Forcing Kyle into it, she buttoned up the crotch and looked down at her new doll.<br>\r\n\"Hmm. WHat are you missing...oh yea!\"<br>\r\nGrabbing a large rubber, pink pacifier Kelly shoved it into Kyle's mouth and smiled at her now adorable 'baby' doll.<br>\r\n<br>\r\n\"now then your mommy is...\"<br>\r\n</span></div></div>",
            "created":1236488400,
            "id":657601,
            "title":"baby"
        },
        "112111122112":{
            "choices":[
                "was in plastic arms",
                "was in his sister's arms"
            ],
            "content":"<div class=\"\"><div> <span>\"You're gonna be Barbie's baby!\" Kelly grabbed a barbie dressed in a pink dress and arms that bent at the elbow. Then she placed Kyle into his 'mommy's' plastic arms, folding her arms to hold him like a baby. Kyle began to struggle to get away but Kelly held her barbie's arms firm around Kyle. Kelly began to make the barbie rock Kyle back and forth, \"Shh It's ok baby! Don't get upset mommy has you!\" <br>\r\n\"KELLY! GET DOWN HERE RIGHT NOW MISSY AND CLEAN UP THIS MESS!\"  Kyle heard his mother bellow for his little sister as she stood with the dolls in her hand.<br>\r\n\"Uh oh! Coming mom!\" Quickly threw down the barbie with Kyle still in the barbie's arms and ran out of the room. The barbie and Kyle hit the floor hard, Kyle's head bounced off the hard floor and passed out. When he woke up he...</span></div></div>",
            "created":1250053200,
            "id":743513,
            "title":"a larger doll"
        },
        "11211112212":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "dress up ",
                "baby doll"
            ],
            "content":"<div class=\"\"><div> <span>You get to be the mommy Kyle said Kelly putting you in a pink dress. Kelly you can't do this to me I'm not a toy now take me to mom you say. You are brought to Kelly's face and she say's \" I do'NT think you'r in any position to be making demands\". Kelly time for dinner said your mother from down stairs. OK mommy be down in a minute said Kelly. I'll bring you some food after my bath but you stay in the doll house or else she said. After Kelly left you look around the doll house still in a dress you open the dresser's and closet's but all you find is skirt's and dresses you find a doll bed and take a nap. When you wake up you see a giant eye looking at you from the near doll house window and then you look around and frown you had hoped that everything that happened was just a bad dream then you went to the window and saw your sister in her pink Barbie pj's her hair was still wet from her bath. Hi Kyle I'm back and I see you like your new home oh and I got you some dinner but if you want to eat you had better get dressed for a tea party you are so hungry you do so and after the tea party it's time for bed and it's back in the doll house. <br>\r\n<br>\r\n<br>\r\nThe next day Kelly want's to play</span></div></div>",
            "created":1216789200,
            "id":559393,
            "title":"mommy"
        },
        "112111122122":{
            "choices":[
                "you're a girl! (get a dress)",
                "have to call me mommy!"
            ],
            "content":"<div class=\"\"><div> <span>You wake up in the hands of Kelly, who is smiling evilly. \"You're so cute when you're sleeping, like a little baby! So I decided we would play baby doll! You be the baby of course! and I'll be your mommy! i've already got everything ready!\" You look around and realize she is taking you to a doll changing table. You struggle, but her grip is firm.<br>\r\n\"Now lay still baby, mommy has to put your diaper on.\" Laying you on the table, she straps you down and grabs the diaper, lotion and baby powder. She rubs the lotion all over you and powders you. Then, slipping the diaper under you she tapes it up and smiles. <br>\r\n\"Ok. Now that you're my baby, I've decided...</span></div></div>",
            "created":1237525200,
            "id":663903,
            "title":"baby doll"
        },
        "1121111221221":{
            "choices":[
                "Pink dress",
                "Pink Shirt and Black Skirt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She runs over to the toy chest and grabs a....for you to wear. </span></div></span></div>",
            "created":1347512400,
            "id":1426421,
            "title":"you're a girl! (get a dress)"
        },
        "11211112212211":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Yes, Kelly started play with her new girl dolly Kyle ",
                "No, Kelly started made Kyle more girly "
            ],
            "content":"<div class=\"\"><div> <span>Pink dress. “You’re a girl now Kyle.” Kelly said while forcefully put pink dress on you!<br>\r\n“KELLY I AM NOT GIRL, SO PLEASE TAKE ME TO MOM, SO SHE CAN HELP ME GET BACK TO NORMAL SIZE!” Kyle yelled.<br>\r\n<br>\r\n“Now Kyle, you must behavior like good girl or else I will made you more girly.” Kelly said.<br>\r\n<br>\r\n(Did Kyle listen?)</span></div></div>",
            "created":1564074660,
            "id":2692158,
            "title":"Pink dress"
        },
        "1121111221222":{
            "choices":[
                "No spanking,mommy.",
                "NO!"
            ],
            "content":"<div class=\"\"><div> <span>\"NO way Kelly! Forget it, GO GET Mom!\" You yell at your 'little' sister as Angrily as you can, snarling with each word. Kelly stares at you a moment, then she sits down and turns you over her knee and begins to hit your bottom. \"OW! Kelly knock it off! Oww.\" Kelly continues to swat you, over and over again. You start to get sore at first and after a few minutes you feel tears running down your cheeks, finally after over ten minutes of a harsh spanking you are crying like a little baby, your face red and wet with tears and snot. Kelly stops her spanking and picks you up under your arms.<br>\r\n\"Now, are you going to call me mommy? Or do you need another spanking?\"</span></div></div>",
            "created":1256792400,
            "id":783603,
            "title":"have to call me mommy!"
        },
        "11212":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Jasmine",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1138942800,
            "id":299657,
            "title":"?"
        },
        "112121":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Get her attention",
                "Avoid her"
            ],
            "content":"<div class=\"\"><div> <span>You turn your head to face the sound of the door opening and you realize just how small you are.  Your twin sister Jasmine, who was a foot shorter then you, was standing at the door.  By your standards she was at least 150 feet tall!  You were born five minutes before her and that fact always seemed to enrage her.  She went nuts when anyone ever mentioned it, so naturally it was your favorite thing to talk to her about.  You two were not very close, but she might be your only chance at being discovered.  You decide to...</span></div></div>",
            "created":1141102800,
            "id":303976,
            "title":"Jamine"
        },
        "1121211":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yell up to her",
                "Climb her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do you get her attention?</span></div></span></div>",
            "created":1396760400,
            "id":1774176,
            "title":"Get her attention"
        },
        "112122":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Jessica",
                "Chloe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1139029200,
            "id":299665,
            "title":"?"
        },
        "1121222":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Get her attention",
                "Run away"
            ],
            "content":"<div class=\"\"><div> <span>You turn towards the door of your room and see a goddess.  Your little sister Chloe, who you always made fun of for her height, was standing at the door.  You could barely call her your little sister anymore.  When you were normal sized you were about one and a half feet taller then her and now she was hundreds of feet taller then you.  Chloe was an absolutely gorgeous girl.  She had a perfect body, blonde hair, blue eyes and a gorgeous face.  If she wasn't your sister, you would date her in a second.  But she was your sister and now she was coming towards you.  You decide to...</span></div></div>",
            "created":1139029200,
            "id":299666,
            "title":"Chloe"
        },
        "11212221":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Yell and jump around",
                "Climb her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to get your \"little\" sister's attention.  After all you would be much better off if someone was there to help you out.  But how were you going to get her attention?</span></div></span></div>",
            "created":1139029200,
            "id":299667,
            "title":"Hello"
        },
        "112122211":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Yes",
                "Other (aka No)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You yell and scream at the top of your tiny little microsized lungs and you jump as high as your half-inch legs will let you.  Does she notice you?</span></div></span></div>",
            "created":1139029200,
            "id":299668,
            "title":"Are you noticed?"
        },
        "1121222111":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Her room",
                "Bathroom"
            ],
            "content":"<div class=\"\"><div> <span>Chloe looks around the room, searching for where the voice she heard came from.  She had a very confused look on her face.<br>\r\n  \"Down here!\" you yell up at her.  You see her gaze head downward and start scanning the floor.  Then her eyes land on you.<br>\r\n  \"What's that?\" she said.  You see her trying to figure out what you are when all of a sudden, you see her hand start to descend to grab you.  You start to run, the idea of being in your little sister's hand did not appeal to you so you would like to avoid it.  But all your efforts are in vain as her bright red painted fingernails come closer and closer and finally wrap around you.  You are whisked to her face at a speed that seems impossible to you.  You are soon eye to eye with your sister.<br>\r\n  \"Holy shit!\" she says \"Kyle is that you?\" You nod slowly as your sister's hot breath rebounds off your face.  You see her inspecting you closely and then an evil grin spreads across her face.<br>\r\n  \"This is perfect!\" she said evilly, \"You always made fun of me for how short I was and now look at you!  When I take a shit it's bigger then you are now!\"<br>\r\n  \"Shut up you stupid bitch\" you yell at her defiantly, \"Let me go right now!\"  With every word you say your sister's smile just seems to get bigger and bigger.<br>\r\n  \"Your not going to push me around anymore,\" she said with a grin, \"In fact, now you belong to me.\"  Your face goes pale when you hear her say this.<br>\r\n  \"I finally can get back at you for all the crap you've done to me,\" she said, \"You don't know how long I've wanted to get revenge and finally it came.  You are now my new pet!\"  She smiles one last time and closes her fist around your whole body.  You feel her arms sway and you realize that she's taking you out of your room.  But where is she taking you?</span></div></div>",
            "created":1139029200,
            "id":322763,
            "title":"Your sister's new pet"
        },
        "11212221111":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Darkness.",
                "The drawer is open and your sister is looking in."
            ],
            "content":"<div class=\"\"><div> <span>   \"I have the perfect place for you Kyle\" your sister says with a devilish little grin that puts fear into your heart.  You have never felt this weak.  Your little sister was carrying you in her hand and had the power to do to you whatever she pleases.  You look around and you see that your sister has taken you to her bedroom.  <br>\r\n   \"It's time for me to go to sleep,\" Chloe says, \"But I have a nice safe place for you.  We'll have some fun tomorrow.\"  You hear your sister open a drawer and suddenly she releases her grip on you.  You land on soft material and scramble to get back on your feet. <br>\r\n  \"Have a nice sleep,\" Chloe says before she shuts the drawer.  It doesn't take you long to figure out where you are.  You are currently residing in your little sister's underwear drawer.  You were surrounded by a 13 year old's bras, panties and thongs.  This was not a pleasent scenario.  But it was comfortable and being tossed around  by your sister had tired you out.  You curl up in some sort of undergarment and fall into a deep sleep.  When you awake...</span></div></div>",
            "created":1150434000,
            "id":324681,
            "title":"Drawered"
        },
        "112122211111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Panty",
                "Bra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> When Kyle woke up, he saw that he was in darkness. But he could hear her sister's voice, and he could FEEL it through him. That meant only one thing, he was being worn by his sister...<br>\r\n<br>\r\n He was in her...</span></div></span></div>",
            "created":1150434000,
            "id":324701,
            "title":"Worn"
        },
        "1121222111111":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Vagina",
                "Ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your entire body quivers as you realize that you are inside your little sister's panties.  You try to figure out which side you're in when a huge motion sends you flying up against her....</span></div></span></div>",
            "created":1151902800,
            "id":328240,
            "title":"Panties"
        },
        "11212221111112":{
            "choices":[
                "You manage to pull yourself free and move away",
                "You can't escape asyour younger sister sits"
            ],
            "content":"<div class=\"\"><div> <span>The sudden movement has pressed you against her butt cheeks with such force that you are trapped in between them. Not only are you in your sister's panties, but you are wedged tightly between her butt cheeks.<br>\r\n<br>\r\nAll of a sudden you feel yourself panicking when you feel your sister bend her legs, and you realise that she is sitting down. Will you survive being sat upon by your younger sister?</span></div></div>",
            "created":1197867600,
            "id":476684,
            "title":"Ass"
        },
        "112122211111122":{
            "choices":[
                "Chloe suddenly notices something pressing into her backside",
                "Chloe eventually gets up and goes downstairs"
            ],
            "content":"<div class=\"\"><div> <span>Chloe is sitting at her dressing table, so that she can apply make-up and generally make herself presentable. She is unaware that you are trapped between her butt cheeks.<br>\r\n<br>\r\nUnfortunately, or perhaps fortunately, that is where you are. Wedged between her butt cheeks, you can feel her body sitting on you, but her backside is pressed against the seat of the chair far more than upon your body. You are still alive and conscious, although perhaps a bit closer to your sister's backside than you would have wanted to be.<br>\r\n<br>\r\nShe seems in no rush to move though. She takes her time applying all the products to herself that she uses when she gets ready, and brushing her hair. You know that women take longer to get ready than men and your sister is no exception.<br>\r\n<br>\r\nShe spends over half an hour sitting at her dressing table, oblivious to your position inside her panties.</span></div></div>",
            "created":1197867600,
            "id":476686,
            "title":"a seat at her dressing table"
        },
        "11212221112":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Puts you somewhere else",
                "Takes you to her room"
            ],
            "content":"<div class=\"\"><div> <span>You look through the cracks in between your sisters massive fingers and manage to make out that you are in the bathroom.  You are a little curious to as why you are here but your sister seems to sense this and she quickly answers your question.<br>\r\n  \"Now that you're my new pet, your going to need a new home!\" she put you in the sink and started to rummage through the cabinets below.  You tried to climb out of the sink but the walls were too slick and plus you also had to avoid the drain.  After a few minutes your sister reappears over the counter with a tiny glass jar. <br>\r\n  \"Ta dah!\" she said happily, \"This is gonna be your new home little guy!\"  She talked to you in a babyish tone and that really got on your nerves, but you knew that it was not smart to get on the bad side of your gigantic sibling.  You see her hand coming at you again and you try to escape.  But she easily snatches you up and puts you in the jar.  You are two inches tall and the jar was three inches wide and three inches tall.  You barely had any room to do anything.  You could hardly sit down.  Chloe screws on a cap and you have to dodge out of the way as she pokes air holes with a nail.  When she is certain that the jar is nice and secure, she brings it up to her face and starts to study you.  Her massive face is even more frightening when the glass distorts it.  She does this for a little while and then she...</span></div></div>",
            "created":1139202000,
            "id":300060,
            "title":"Jarred"
        },
        "112122211122":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "She wants to \"play\" with you",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Your sister smiles and closes her massive hand around the small glass jar that you were in.  Most of the light was blocked off so it was getting pretty dim.  All of a sudden, you feel the jar shake around you.  Your sister must be taking you somewhere else.  You push your hands on either side of the jar so you don't fall over and hold on for dear life.  You are shook around and by the time Chloe stops your arms are incredibly sore.  She puts you down hard and you fall over.  You scramble up to your feet and take a look around.  You were in your sister's room, on her bedside table to be exact.<br>\r\n  \"How do you like your new home?\" Chloe said with an evil grin.  You reply by giving her the finger.  She either didn't see or didn't care because she immediately started to talk again.<br>\r\n  \"Now you be good while I do my homework,\" she said and started to spread some sheets around her bed.  The only thing that you could do was watch your gigantic little sister do her homework.  For two long hours you sat and watched until finally...</span></div></div>",
            "created":1139547600,
            "id":300684,
            "title":"Her room"
        },
        "1121222111221":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Make a break for it.",
                "Lick her toes clean. Yuck!"
            ],
            "content":"<div class=\"\"><div> <span>\"Finally,\" your sister said as she closed up her books and put away her papers, \"Now that all my homework is done, we can finally have some fun together.\"  You knew that by this, she meant that SHE would be having fun while you suffered.<br>\r\n  \"I had a horrible gym class today,\" she said while looking at you evilly, \"The coach made us run soooo many laps.  My feet are so sore and dirty.\"  She removed her white socks and revealed her disgusting feet.  They were covered in sweat and mud and a little bit of nail polish.  She unscrewed the cap of your jar and took you out.  She placed you on the floor in front of her dirty, giant feet.  The smell was the worst thing that you have ever smelt and it was completely overwhelming you.<br>\r\n  \"You are going to lick my feet clean!\" Chloe said happily, \"And if you don't, you will be punished!\"  She moved her feet a little closer to you and the smell got even stronger.<br>\r\n  \"Well?\" your sister said impatiently. You decide to...</span></div></div>",
            "created":1139979600,
            "id":301751,
            "title":"Cleaning Chloes Feet"
        },
        "11212221112211":{
            "author_id":"tourplayer",
            "author_name":"tourplayer",
            "choices":[
                "time for a swim"
            ],
            "content":"<div class=\"\"><div> <span>chloe starts to lift her right foot and move it over me. i couldn't take it!! i take off running, not even sure where, just running from her stinking feet. i move to my left and her foot comes crashing down, just missing me, i then run to my right and her other foot comes crashing down again!! every move i make, she cuts me off with one of her feet, laughing and giggling the entire time. i was finally trapped between her smelly, dirty feet and then she moved her right foot over my body trapping me from the waist up, under her foot.<br>\r\n<br>\r\ni started to kick my legs as hard as i could to try and free myself when i felt what seemed like a vice sqeeze my legs. her foot moved and then i was pulled up, legs first and upside down, straight up in the air. <br>\r\n<br>\r\nchloe dangled me upside in front of her face, swinging me back and forth while poking at me with her finger. she was smiling, laughing and giggling, just enjoying her new toy.<br>\r\n<br>\r\n</span></div></div>",
            "created":1140152400,
            "id":302068,
            "title":"wrong idea!!"
        },
        "112122211122111":{
            "author_id":"tourplayer",
            "author_name":"tourplayer",
            "choices":[
                "pantyhose or shoes??",
                "stay in the tank"
            ],
            "content":"<div class=\"\"><div> <span>she said to me \"i really do not have time for you right now, i need to get ready for the school dance. now, where i can i keep you while i get ready?. ahh. i know..\"<br>\r\n<br>\r\nwith a huge smile and grin she makes her way over to the corner of her room. there, she has a fish tank. with a few exotic fish. i'm saying to myself, no, she wouldn't, she couldn't do what i'm thinking!!<br>\r\n<br>\r\nshe unlatches the top, lifts the lid and dangles me over the water!! she's laughing louder than ever and giggling like crazy. i beg her not to!! but then she let's go and i fall, splashing into the tank. she's looking down at me wading around in the tank and says to me \"enjoy your new fish friends my little pet!! i'll come and get you when i'm finished getting dressed for the dance.\" she closes the lid and locks the latch. <br>\r\n<br>\r\nthe water level is about 5 or 6 inches below the top, which to me seems like 30 or 40 feet!! i know i'm trapped with no way out. she then bends over and starts tapping the glass of the tank and smiling at me. she watches me swim around trying to stay afloat!!<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1140152400,
            "id":302070,
            "title":"backstroke"
        },
        "1121222111221111":{
            "author_id":"tourplayer",
            "author_name":"tourplayer",
            "choices":[
                "in you go...."
            ],
            "content":"<div class=\"\"><div> <span>chloe returned from the bathroom and i have to admit that my younger sister looked beautiful!! she has a great body, awesome legs and very pretty face. she came over to the tank, lifted the lid. she reached for the net she uses for her fish and easily fished me out. she dropped me into her hand that held a towel and dried me off in her fingers. <br>\r\n<br>\r\nshe said to me \"i have great news for you!!\" smiling that evil smile, she continued. \"you're going to come with me to the dance. and you even get to decide where i put you! doesn't that sound like fun!\"<br>\r\n<br>\r\n<br>\r\n\"you can tell me if you would like to spend the night in my shoe or in my pantyhose. whichever you prefer! or, you can stay in the tank, but then i haven't fed my fish today, and they may get hungry.\"<br>\r\n<br>\r\ni tried to free myself form her grip but it was no use. she had me! the longer it took me decide the firmer she was squeezing. finally with about a half breath left, i yelled out, ok your shoe, your shoe!!<br>\r\n<br>\r\nshe smiled, laughed and set me in the jar. but only momentarily.</span></div></div>",
            "created":1140411600,
            "id":302728,
            "title":"decisions, decisions"
        },
        "11212221112211111":{
            "author_id":"tourplayer",
            "author_name":"tourplayer",
            "choices":[
                "toying with her foot toy",
                "time to dance"
            ],
            "content":"<div class=\"\"><div> <span>i hate to admit this, but i watched as my own younger sister sat and slid on her pantyhose. she stood up and walked over to me. she looked beautiful in her silver dress and silky panyhose.<br>\r\n<br>\r\nshe reached her fingers into the jar, squeezed me with three of her red nail painted fingers and lifted me out. i squirmed as hard as i could to get free, but it was no use. <br>\r\n<br>\r\nshe brought me in front of her face and said \"i hope you have as much in there with my toes as i am having you trapped in there!! with an evil grin and laugh, she continued \"if i were you, i would be carefull not to caught under my toes, it may hurt! and don't even think of getting out and trying to escape. if you do, no one will know who you are and you will probably get trampled. besides, you're only hope of returning to size is here, at home\"<br>\r\n<br>\r\nwith that she reached down and lifted her right black high heeled pump and moved it under me. dangled me, enjoying her power, moved me over the insole and dropped me in. she tilted the shoe back and forth, just for fun, then tilted it toe down and i rolled into the toe section.<br>\r\n<br>\r\ni could see the wear marks of her toes and the ball of her foot and quickly tried to find a safe spot. i turned;  and there they were. her nylon covered, red painted toes, and they headed right for me. she stopped wiggled her toes and then they moved towards me. i struggled to stay ahead but she was too fast. <br>\r\n<br>\r\nher toes pushed me against the the front of her shoe. she wiggled her toes, slid her foot back out, then right back in, again pressing me against the inside wall. i was trapped and prepared for a long night. <br>\r\n<br>\r\ni felt her foot hit the floor and with each step i was smushed against her nylon covered toes and the shoe wall. the sound of the soles hitting the floor was loud as well. i could see how her toes crunched togather and smashed against the insole. i was doing all i could not to get caught under them. <br>\r\n<br>\r\ni was nothing but a foot toy for my younger sister at her shool dance!<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1140411600,
            "id":302740,
            "title":"harsh reality"
        },
        "112122211122111111":{
            "author_id":"tourplayer",
            "author_name":"tourplayer",
            "choices":[
                "back home",
                "more fun!!"
            ],
            "content":"<div class=\"\"><div> <span>the night was long and i was running out of air. the sweat, the smell and the reality of my predicament was getting to be to much to take. i was starting to pass out when, she wiggled her toes violently and then removed her foot. <br>\r\n<br>\r\nshe slid her foot half way out of the shoe and stopped her toes in the mid section of the sole. a rush of well needed fresh air came over me, but i still had no energy or ability to move. <br>\r\n<br>\r\nher heel was hanging over the back of the shoe. she then pressed down with her heel causing the toe end to rise. i rolled back towards her toes and as i rolled down she lifted her toes and i rolled underneath them. she curled her toes trapping me under the arch of her toes. if she hasn't been torchering me enough, she started to roll her foot, and me, back and forth under her toes. rolled me like a ball!! she then arched her toes and tilted her foot back, and i rolled into the heel section of her shoe. as i turned, her heel came crashing down on me, squashing me into the insole. <br>\r\n<br>\r\nshe lifed her heel, arched her foot, and tilted it forward, causing me to roll back down into the toe section. i landed on my back and as  i looked up, i could see her smiling at me!!she then slid her toes forward, jamming them, and me, back into the toe section.<br>\r\n<br>\r\ni was back in my original spot. jammed between my little sister's sexy nylon covered toes and the inner sole of her shoe. i took a big breath and passed out from exhaustion!!<br>\r\n</span></div></div>",
            "created":1141534800,
            "id":305029,
            "title":"fun,fun, fun!!"
        },
        "11212221112212":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Ask her to lower her foot",
                "Climb her foot. "
            ],
            "content":"<div class=\"\"><div> <span>You grimaced as your sister wiggled her grimy toes in front of you. It was clear that you were far too small to escape from her, though. Trying not to gag, you approached her massive left foot and started licking her heel.  Sweat, dirt, and clumps of sock lint clubg to your tongue as you tried to imagine you were anywhere else. Because her foot was larger than you, you soon realized this might become problematic.  How would you managed to clean her toes from here?   </span></div></div>",
            "created":1489899600,
            "id":2291864,
            "title":"Cleaning Chloe's Feet"
        },
        "1121222111222":{
            "author_id":"tourplayer",
            "author_name":"tourplayer",
            "choices":[
                "she decides to go out",
                "she finds a new home for me"
            ],
            "content":"<div class=\"\"><div> <span>after she was finished, she cleaned up her papers and walked over to me. she bent down from her waste, put her hands on her knees and smiled a devilish smile and said, \"you look like you're bottled up in there. i bet you would like to get out and excercise a little bit!\" <br>\r\n<br>\r\nshe smiled that devilish smile and  giggled! she then sat on the bed and began to remove her pantyhose. she reached for the jar and moved me towards her face and said \"i have a great idea!\". she opened the jar and dumped me into her left hand. i tried to wiggle free but her red painted finger nails wrapped around me and she sqeezed tighter the more i wiggled. <br>\r\n<br>\r\nshe then moved her hand towards the opening of the right leg of her pantyhose and started to move her hand down the leg. about half way down, she let me go and i fell down into the toe setion. i did my best to get to my feet and break free but the nylon meshing was too strong.<br>\r\n<br>\r\nshe took her hand and dangled me in front of her face, and started to giggle again. she then tied a knot into the other end of her pantyhose, trapping me inside. she then said \"now, i'm going to put you on the floor so you can run around and get some excercise. i can control where you go and you'll never be able to escape the nylon!! with that she smiled widely and laughed at me. <br>\r\n<br>\r\nshe put me on the floor and i was able to move around, but the nylon meshing made it difficult. and just to add to her pleasure, every once and awhile, she would maneuver me around with her toes, just for her fun of course..<br>\r\n<br>\r\nso now, i'm trapped inside my sisters' sweaty panthose, running around her floor while she loks down with amusement at her new toy!</span></div></div>",
            "created":1139806800,
            "id":301306,
            "title":"excercise!!!"
        },
        "11212221112222":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Up",
                "Down"
            ],
            "content":"<div class=\"\"><div> <span>For half an hour your sister had the time of her life making you run around inside her sweaty disgusting pantyhose that she had been wearing the whole day.  Just when you thought that you would be up all night Chloe let out a yawn that to you, looked like she was threatening to swallow a building.  <br>\r\n   \"I'm getting a little bit sleepy,\" she said groggily, \"But where am I going to keep you when I go to bed?\"  Your sister looked around her room and then a thoughtful expression crossed her face.  Unfortunately, this expression was soon replaced with another one of Chloe's evil grins.  This one was even bigger and wider then all of the other ones.<br>\r\n  \"I know!\" she said with a grin that seemed to spread for miles. \"I'll give you a choice Kyle, since I am such a compassionate owner.\"  She giggled loudly at her own joke.  <br>\r\n  \"You have the choice, up or down?\"<br>\r\n  <br>\r\nYou pick...</span></div></div>",
            "created":1139893200,
            "id":301407,
            "title":"Choose your new home"
        },
        "112122211122221":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Later that night.",
                "The next morning."
            ],
            "content":"<div class=\"\"><div> <span>You looked at your sister and pointed up.  A little frown crossed your sister's face. <br>\r\n   \"Awwww,\" she said dissapointedly, \"I wanted you to pick down.  Oh well.  Here's where you will be sleeping tonight.\"  Your sister lifted up your nylon pantyhose prison and put it down on the bed.  She then took the chair from her desk and something else from on top of the desk.  She set the chair up on the bed and then proceeded to pick up the pantyhose that you were in.  You struggle but the nylon was very strong and there was a lot of movement.<br>\r\n   \"You will spend the night looking down at my beautiful body!\" she said.  She lifted the end of the pantyhose that was opposite to you and pressed it against the ceiling.  She then took a thumbtack and pierced it through the pantyhose and the ceiling.<br>\r\n   \"There.\" she said.  You were now dangling over your little sister's bed in a pair of her sweaty pantyhose.  Your sister watched you for a bit as you hung from her roof before she decided to go to bed.<br>\r\n   \"Goodnight \"little\" brother\" she said mockingly, \"See you tomorrow morning.\"  She then got into her pajamas and went to bed.  The worst part about this was that you usually slept on your back, but you were currently facing down and the stretched out nylon prevented you from rolling over.  You were forced to watch your little sister from the inside of her pantyhose, suspended hundreds of feet above her bed.  It took several hours but you finally managed to go to sleep.</span></div></div>",
            "created":1139893200,
            "id":301529,
            "title":"Ceiling"
        },
        "1121222111222212":{
            "choices":[
                "In the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>The next morning comes and you are still asleep. Your sister wakes up and she knows you are a heavy sleeper. So she decides to go and take a shower. She decides to take you down from the ceiling. She removes the thumbtack and carries the pantyhose into the bathroom. When she gets in there she decides to remove you from the pantyhose and while she is doing this you don't wake up until she undresses. Then gets in the shower. Feeling the water beating off your face and body, wakes you up. When she sees that you are awake. She says \"Good Morning, I could tell that you liked what you saw last night because when I was awoken last night to remove my pajamas and decided to sleep naked because I was to hot. I saw that you staring at me while I was getting naked and you were getting a hard on. So I decided to use you as a living bar of soap and for as long as I am your owner. You will be my living bar of soap and my toilet paper and my tampon. That means when I have my period you will be in my vagina to prevent my panties from becoming ruined. Also when I have to use the toilet you will be my personal toilet paper, you will clean my ass and keep it clean. Also when I have to pee you will be in the toilet to drink it. Also if you disobey me you will be up my ass until I decide when to let you out and that could be for a day or a week or you will spend up to a month or a year in my ass. Only letting you out to eat, take care of my personal needs. So if I were you I would not disobey me!!!!!!\" After she gave me that long speech I was scared because if I disobeyed her she may never let me out of her ass.</span></div></div>",
            "created":1248843600,
            "id":734660,
            "title":"The next morning."
        },
        "11212221112222121":{
            "choices":[
                "All-Day Shopping Spree ",
                "Work to work 2 8 hour shifts"
            ],
            "content":"<div class=\"\"><div> <span>While she is showering she is using me as a personal bar of soap and rubbing me all over her body. I end up in many places like the inside of her vagina and my head goes up her ass to clean it out. Then she cleans her breasts and then the rest of her body. After she is done cleaning herself she uses you as a human dildo. Then all of her pussy juices cover your whole body. After she has reached her climax of her orgasm she sees that your all a mess so she washes her self off and exits the shower and places you on the sink while she dries herself off and grabs you after removing her towel drops you into the toilet. That's when you see her ass cover the toilet seat. Then your sister starts to pee and you are forced to drink it. Then it starts to rain big brown chunks of shit. then she picks you out of the toilet and she uses you to clean her ass and in the process you are forced to eat some of the shit. After she washes you off and goes into her bedroom that is connected to the bathroom and all of your sisters have bigger and nicer private bathrooms than yours. She is getting dressed for the day and it is always very cold because you all live in the cold state of Alaska because there father is works for an Alaskan Oil Company. So your sister decides to put you inside her thick pantyhose so she decides to double up on her thick pantyhose. When she drops you she immediately followed by her foot in there you are going to feel like 100 degrees in there to you but not to her. Plus it is going to feel hotter because of all the wool clothing she is wearing along with her Ugg boots. She says \"Make sure you lick all the sweat off my foot.\" She says \"I am going to go to ......................</span></div></div>",
            "created":1248843600,
            "id":734680,
            "title":"In the bathroom"
        },
        "112122211122222":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "The next morning.......",
                "Later that night....."
            ],
            "content":"<div class=\"\"><div> <span>You spend a good long time considering your two options.  You had no idea what either of them meant so this decision was one of the hardest you've ever faced.  You decide to choose down.<br>\r\n  \"What's it gonna be?\" Chloe says impatiently, her smile fading more and more with each second you spend pondering .  You fear that if you don't decide quickly she will decide for you and she won't give you any breaks.  You make a thumbs down gesture to her to signify that you choose down.<br>\r\n  \"Oh goodie!\" she says excitedly, \"We are going to have so much fun, or at least I will.\"  Your sister picks up your nylon pantyhose prison, unties the knot and drops you out into her awaiting hand.  She smiles again at you.<br>\r\n  \"Congratulations!\" she says happily, \"You have picked down!\"  That's when you saw your terrible, terrible mistake.  You had no idea what up was but now you knew all to well what down was.  You looked in horror from your sister's left palm as her right had reaches and pulls down her mini-skirt.  It reveals her sexy red thong that rides her up all the way.  You are too shocked and scared to scream as her right hand continues to remove the thong.  You were now staring at your little sister's pussy which was like a huge cave to you.  <br>\r\n  \"I hope you like your new home,\" Chloe giggles as she lowers her left hand with you on it towards her gaping lips of death.  You could already smell the pungent aroma of her awaiting vagina and as you looked, you saw that it was starting to get wet with anticipation.  You start to run but Chloe's fingers wrap around you tightly and pin your arms to your sides.  You kicked and struggled, but it was no use as her vagina got closer and closer until finally it was upon you.  Chloe wedged you feet first into her pussy and kept pushing.  You felt intense pressure as you went in up to your waist, then your arms and finally your neck.  Your head was the only thing that was showing.  The rest of your body was deep inside your little sister.  The smell was overwhelming and you almost gagged.<br>\r\n   \"Have a nice night,\" Chloe giggled, \"I'll take you out tomorrow morning.\"  With that Chloe gave you a little pat on your head and started to get into bed.  You struggled with all your might, but all that did was get a deep excited moan out of your captor.  You didn't want to pleasure your sister so you decided to stop moving and admit to your disgusting fate until morning.</span></div></div>",
            "created":1139893200,
            "id":301410,
            "title":"Chloe's Pussy"
        },
        "1121222111222222":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Chloe masturbates in her sleep and you are pushed further into her pussy.",
                "You shrink more and fall deeper into her pussy."
            ],
            "content":"<div class=\"\"><div> <span>It was a horrible night.   You would have never imagined that you would ever end up in your little sister's pussy but here you are and you're not enjoying it.  Your entire body besides your head was inside her and it was thouroughly soaked from all of her feminine juices.  It smelt awful and Chloe often moaned in pleasure in her sleep and that didn't help you sleep either.  You were wedged so firmly in Chloe's lips of death that you could barely move any part of your body.  Your arms were pinned tightly to your sides and your legs were pinned tightly together.  It was painful, smelly and terrible but it was about to get worse.</span></div></div>",
            "created":1139979600,
            "id":335513,
            "title":"The night"
        },
        "11212221112222221":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Chloe wakes up",
                "Chloe masturbates more and you are pushed EVEN farther in!"
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden, you hear a large moan of excitement from your captor.  Soon after that you feel pressure on your head!  Your wiggling must have aroused Chloe so much that she was actually masturbating in her sleep.  This was very bad news for you.  The pressure continued and you started to slide deeper into your little sister's pussy.  Soon, you were pushed completely in.  This made you panic.  You started to struggle with all your might.  </span></div></div>",
            "created":1141102800,
            "id":303978,
            "title":"Ouch!"
        },
        "112122211122222211":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Chloe decide to go get help from Jasmine",
                "Chloe decide to enjoy herself "
            ],
            "content":"<div class=\"\"><div> <span>(Chloe Pov) I wake up from insensitive dream I have! But then I quickly remember Kyle was in my vagina! \"Ah that right! I promise Kyle that I pull him out\" as I reach down but quickly notice he was not there and I realized I masterbate in my sleep which mean Kyle complete inside of me but questions is how do I even get him out?! <br>\r\n<br>\r\nMeanwhile inside, Her vaginal muscle push Kyle deeper inside as he struggled to get out but Her vaginal muscle clench tighten as it Undulate around his body and slowly take Kyle toward her Cervix as it open wide and Kyle slip inside as he yell \"CHLOE GET ME OUT OF HERE\" but it was just muffed outside! <br>\r\n<br>\r\n(Meanwhile outside) Chloe felt my brother struggle inside and I start moan because he felt really good! But then I thought Sure I get him out or just enjoy have struggle inside me?</span></div></div>",
            "created":1474434000,
            "id":2212905,
            "title":"Chloe wakes up"
        },
        "113":{
            "author_id":"gunbunny",
            "author_name":"Mad Dog",
            "choices":[
                "You try to escape.",
                "Your mom returns.",
                "Jasmine comes into your moms bedroom."
            ],
            "content":"<div class=\"\"><div> <span>You hear the sound of the handle on your bedroom door turning. Suddenly feeling afraid, you dive under your pillow and crawl as far as you can. You hear the muffled sound of footsteps coming toward your bed and then, after a couple of minutes, the pillow is lifted off you.<br>\r\n<br>\r\n\"Ah, there you are\", you hear your mom say.<br>\r\n<br>\r\nYou roll over just in time to see a giant finger and thumb descend and gently pinch your sides. You cry out in fear as you're lifted off your bed, and then unceremoniously stuffed into the right front pocket of her jeans. You feel a deep sense of confusion and fear, as you lie helplessly in the pocket of your giantess mother. You feel her start walking, though you're not sure where. A few minutes later the walking stops, and you're plucked out of the pocket and thrown onto a hard surface. You slowly get to your feet and immediately notice that you're in a cage, like the one your younger sister, Kelly, keeps her pet hamster in. You're facing the wall right now, but from what you can see, you're on top of a set of drawers or something. And as you slowly turn to your left, you see that you're in your mom's bedroom. And after what she's just done to you, you don't think that's a good thing. From the corner of your eye, you see movement, and with a growing sense of dread, you turn more to your left and find your giantess mom standing right in front of you, with her hands on her hips and a smile on her face.<br>\r\n<br>\r\n\"Good morning Kyle\", she says softly. \"Sleep well\"?<br>\r\n<br>\r\nYou can't help but feel terrified as you look up at your mom. The cage you're now trapped in is at about groin height, and your mom still looks as though she's at least six stories tall.<br>\r\n<br>\r\n\"M..mom\", you say when you finally find your voice. \"what's happened to me\"?<br>\r\n<br>\r\n\"I would have thought that was obvious\", your mom replies. \"You've shrunk. Or to be more precise, you've BEEN shrunk. By me\".<br>\r\n<br>\r\nThe shock of that statement hits you like a baseball bat.<br>\r\n<br>\r\n\"But...why?...How\"? you ask, stunned.<br>\r\n<br>\r\n\"Why\"? Your mom asks, looking surprised. \"Because you're a nasty little creature, that's why. You cause nothing but trouble, and you hurt everyone you come into contact with. You treat everyone as though they were trash. Nobody likes you, and I do mean, NOBODY. So, from now, and until I decide otherwise, you're going to be learning a hard lesson in treating people with respect. And as to how, well as it turns out, magic really does exist. See, I found this weird little magic store at the mall, and the woman who owned it knew all about you, and that I was your mother. And after proving that magic was real, she gave me a potion to drink. It tasted awful, but\". Your mom gestures at you, \"obviously, it works\". <br>\r\n<br>\r\nYour fear suddenly gives way to intense anger.<br>\r\n<br>\r\n\"YOU CAN'T DO THIS TO ME\". You shout. \"PUT ME BACK THE WAY I WAS OR I'LL....\".<br>\r\n<br>\r\nYour mom cuts you off with a loud laugh.<br>\r\n<br>\r\n\"Or you'll what\"? She asks. \"Hit me\"? She laughs again and then says, \"You're pathetic. This is exactly why you're two inches tall and trapped in that cage. Now, I'm going to take a shower. When I get back, you'll apologise for your little tantrum. And you will refer to me as mistress\".<br>\r\n<br>\r\nStill angry, you shout, \"NO I WON'T, YOU BITCH. YOU CAN'T MAKE ME. FUCK YOU\"!<br>\r\n<br>\r\nYour mom smiles evilly as she shakes her head.<br>\r\n<br>\r\n\"Of course you will\", your mom replies softly. \"Because otherwise...well...have you ever wondered what your life would be like, if you were a vagina\"? With that, your mom smiles and winks at you. Then she turns and disappears into the bathroom, closing the door behind her.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1438578000,
            "id":2016129,
            "title":"Enter Mom."
        },
        "1131":{
            "author_id":"gunbunny",
            "author_name":"Mad Dog",
            "choices":[
                "You manage to get out of your mom's bedroom.",
                "You're snatched off the floor by your mom.",
                "You grow to six inches in height."
            ],
            "content":"<div class=\"\"><div> <span>You wait until you hear shower turned on, then you jump up and climb to the top of the cage door. It's takes you a couple of minutes of heavy pushing, but you finally manage to release the clip. The problem is, being at the top of the door means you've added weight to it. Before you can do anything, the door quickly drops open. It lands heavily, and since it forms a ramps, the landing throws you forward and sends you rolling along the top of the drawers. Unfortunately for you, the cage was positioned roughly in the middle of the of the top of the drawers, and your momentum is such that you roll right over the front edge and end up in a freefall.<br>\r\n<br>\r\nIt only takes about three or four seconds, and you scream in terror the whole way down. You hit the carpeted floor hard, knocking the wind out of you. And to your complete surprise, having the wind knocked out of you is all that happens. You're amazed to find that you're in no pain, and even more amazed when you realise that you're not even slightly injured. It seems you're now indestructible. That's probably the one good thing about being shrunk to two inches tall. You lie there for a couple of minutes, while you get your breathe back, and then stand up. You look around trying to think what to do next. Whatever you do, it'll have to be quick. You can't hear the shower anymore, which means your mom is probably drying herself off. So you only have a few minutes.<br>\r\n<br>\r\nYou know that you need to get out of your mom's bedroom, because she's going to be real pissed when she discovers you've escaped your cage. You decide that your only real option is to head for the door. It's slightly ajar, and you may be small enough to squeeze through. You run as fast as you can, but it's pretty surreal to be two inches tall and sprinting across a carpet that seems to be as big as a cornfield. Within about two minutes, you get close to the door. You can see that the door is ajar, and that you should have just enough room to get through it. You start to get excited as you get closer to the door.</span></div></div>",
            "created":1438664400,
            "id":2016894,
            "title":"You try to escape."
        },
        "11312":{
            "author_id":"gunbunny",
            "author_name":"Mad Dog",
            "choices":[
                "A few hours later.",
                "The next day.",
                "Two days later."
            ],
            "content":"<div class=\"\"><div> <span>Just as you get to within spitting of the door, you feel a heavy pinching on your sides as you're lifted high into the air. You get turned around, and find yourself staring at your giantess mother's face. You were, she IS pissed.<br>\r\n<br>\r\n\"You little shit\", she says angrily. \"Did you really think you could escape from me? You're not that smart. I was going to keep you in that cage for a few days, but I can see that I'm going to have be tougher. And your punishment will now last for a lot longer. And I'm going to have to put you in a prison you CAN'T escape from\". An evil grin appears on your mom's face. And I have just the place for you\".<br>\r\n<br>\r\nYou really don't like the sound of that, especially when your mom licks her lips. And you like it even less when she tips her head back, opens her mouth wide, and lifts you above it.<br>\r\n<br>\r\n\"Oh shit\", you say in panic, as your mom slowly lowers you toward her gaping maw. \"NO...NO PLEASE\", you plead. \"I'M SORRY I TRIED TO ESCAPE. I SWEAR I WON'T DO IT AGAIN\". <br>\r\n<br>\r\nYour mom isn't listening, because you're still heading feet first toward her mouth. You try to spread your legs, so you can at least try to stop your mom from eating you, but you find that you're paralysed from the neck down. You can only watch helplessly as your feet and shins enter her mouth, and you feel the wet, warm roughness of her tongue, in contrast to the hard, wet roof of her mouth. Your upper legs descended into her mouth next, and you feel your feet and lower legs slide into your mom's throat. Eventually, only the very top of your head is left outside, and you can feel your mom's lips touching you, just above your forehead, and all that line.<br>\r\n<br>\r\n\"MOM, PLEASE\", you beg, \"DON'T DO THI...\". You suddenly lose the ability to speak.<br>\r\n<br>\r\nYou start to hyperventilate at thought of what's about to happen to you, and you can't do anything to stop it. Suddenly, you feel your mom's throat contract around your feet and ankles, and then you get dragged deeper into your mom's throat. Unable to move, you start crying as you're swallowed alive. You feel the muscles in your mom's throat contract once more, this time around your knees as your mom swallows for a second time, and you sink down her throat to your waist. Then there's another contraction, and you slide into her throat to just below your chest. Another contraction pulls your head in, and then three contractions in quick succession send you falling down her oesophagus, until you drop into her stomach.<br>\r\n<br>\r\nIt's pitch black, and there's a disgusting, almost overpowering smell of stomach acid. You land with a splash and touch the floor of your mom's stomach. You're getting thrown about slightly. Knowing that you're indestructible is small comfort after being swallowed whole by your own mother. Suddenly, the whole place starts to shake violently, and you hear the muffled, yet unmistakable sound of laughter from high above you. After a few seconds, the laughter stops, and you hear your mom say something, but it's quite low and very muffled. Then you hear two quick dull thuds from somewhere outside stomach level.<br>\r\n<br>\r\nOUTSIDE.<br>\r\n<br>\r\nYour mom is slightly out of breathe and pants as she slowly licks her lips. Then she starts to laugh.<br>\r\n<br>\r\n\"I didn't think I'd enjoy that quite so much. Feels quite good knowing he's in there\", she says softly. \"Let's see you get of there, you little prick\".<br>\r\n<br>\r\nShe then pats her stomach twice and heads to her closet.</span></div></div>",
            "created":1438664400,
            "id":2016920,
            "title":"You're snatched off the floor by your mom."
        },
        "11313":{
            "author_id":"gunbunny",
            "author_name":"Mad Dog",
            "choices":[
                "Stuffs your feet into her mouth and starts to eat you.",
                "Breaks your legs.",
                "Rips your legs off."
            ],
            "content":"<div class=\"\"><div> <span>Just as you're about to walk through the door into the hall, you suddenly feel a weird tingling sensation throughout your whole body. Before you know, you grow to about six inches height. You know that there's only way you could have grown, and, with a growing sense of dread, you slowly turn around to find a giant pair of feet and sins. You suddenly feel terrified about what your mom is going to do to you, having found you out of your cage.  You slowly look up, and to your horror, you realise that your mom is completely naked. She's looking down at you with her hands on her hips, and an evil grin on her face.<br>\r\n<br>\r\n\"Well, what have we here\"? She asks. \"Trying to escape from me? That's naughty\". She then sighs and says, \"I guess I'll have to punish you\". <br>\r\n<br>\r\nShe bends over and reaches down for you. You hear her laugh as you turn around and sprint toward the door. It's a futile gesture, because she easily catches you. Your mom wraps the fingers of her right hand around your body, pinning your arms to your sides, and scoops you off the floor. You scream in terror when your mom then throws you onto the bed, from a distance of about eight feet away. You continue screaming as you fly through the air, before landing on your back on the bed. You then bounce up as though you were on a trampoline and hit the bed for a second time. You bounce for a second time, before flipping over and landing front first on the bed. <br>\r\n<br>\r\nYou feel an immense weight push down the bed. With a growing sense of dread, you slowly roll over, and are greeted by the sight of your giant, naked mom kneeling on the bed and grinning as she looks down at you. She's so close that she's practically kneeling astride you. And with her being naked, you have an uncomfortable view of her vagina. It seems to be the equivalent of a couple of stories above you, and you can't see both the inner and outer lips. Strangely, you find yourself surprised to see that your mom completely shaves her pussy. You manage to look away, but then you're struck by the thought of how hot your mom is. It's actually true, but you really don't want to be thinking that about your own mom. Especially right now, because you have a really bad feeling about what's going to happen next.<br>\r\nYour mom reaches down and lifts you off the bed as she turns onto her back and props herself up on her left elbow. She then drops you between her enormous, leaving you in doubt that she intends to do something pretty perverse.<br>\r\nSuddenly, you feel the tingling sensation throughout your body again. This time though, you don't change size.<br>\r\n<br>\r\n\"Here's what's going to happen\", your mom says somewhat sternly. \"I've returned your sense of pain, and taken away some of your invulnerability. You can't die, but you can be hurt. So, you're going to do exactly as I say, or I'll torture you until you give in\".<br>\r\n<br>\r\nTrying to control your anger, you glare up at your mom and reply, \"you can't do this to me. I'm a human being. You're my mom\".<br>\r\n<br>\r\nYour looks down at you coldly. \"I was your mom\", she replies. \"Now I'm your owner. Your mistress. You've been such a shit with everyone...nobody is going to GIVE a shit what happens to you. So, you can either accept that, until I decide otherwise, you are my slave, and obey me. Or I cause you immense pain. I may even eat you...which, when you can't die, won't be very pleasant\".<br>\r\n<br>\r\n\"Fuck off, you sick bitch\", you say defiantly. \"I'm not a slave, or a toy. I told you, I'm a human being\". <br>\r\n<br>\r\nYour mom gives you an evil grin as she snatches up from between her thighs. And then she:</span></div></div>",
            "created":1439614800,
            "id":2021233,
            "title":"You grow to six inches in height."
        },
        "113132":{
            "author_id":"gunbunny",
            "author_name":"Mad Dog",
            "choices":[
                "Your mom slides you inside her feet first.",
                "Your mom slides you inside her head first.",
                "Your mom sucks on your body for a while before sliding you inside her."
            ],
            "content":"<div class=\"\"><div> <span>Your mom pinches your right leg between the thumb and forefinger of her left hand. The thumb is on the underside of your thigh and the forefinger on your upper thigh, just slightly down from her thumb. Before you can say anything, Your applies pressure on your thigh, and you scream out in agony as you feel the bone snap and a searing pain in your leg. Your mom quickly releases her grip on your right leg and takes hold of your left thigh as you try to beg for mercy.<br>\r\n<br>\r\n\"NO...N..AAAAARRRRRGGGHHH\", you scream again, as your mom snaps your left thigh bone.<br>\r\n<br>\r\nThe pain is immense, worse than anything you've ever known. You can actually feel your legs hanging limply where the bones have broken.<br>\r\n<br>\r\nYour mom chuckles and says, \"ooh, that looks really painful. Let's see now, what shall I break next? I know\". <br>\r\n<br>\r\nShe moves her hand toward your left arm and pinches your upper arm.<br>\r\n<br>\r\n\"NO...PLEASE\", you beg. \"I'LL DO WHATEVER YOU WANT. I SWEAR\".<br>\r\n<br>\r\nYour mom pauses and looks at you.<br>\r\n<br>\r\n\"I'LL DO WANT YOU WANT\", you say, crying in agony. \"I'LL DO WHAT YOU WANT\".<br>\r\n<br>\r\nYou feel the tingling again, and then pain begins to subside as your legs are repaired. You're still crying though. You're mom brings you close to her face, an angry expression on it.<br>\r\n<br>\r\n\"If you're lying, or you disobey me\", she says in a soft, menacing tone. \"I will fry you, I will eat you feet first, and then you will spend forever in my stomach being digested, reformed and digested again. Do you understand\"?<br>\r\n<br>\r\n\"Y...yes\", you reply meekly. \"I swear, I'm not lying, and I won't disobey you\".<br>\r\n<br>\r\n\"I am your mistress and you are my slave\", your mom says with an evil grin. \"Your only purpose is to serve me\".<br>\r\n<br>\r\nYou nod your head.<br>\r\n<br>\r\n\"SAY IT YOU MORON\", your mom spits angrily.<br>\r\n<br>\r\n\"YOU ARE MISTRESS AND I AM YOUR SLAVE. MY...MY ONLY PURPOSE IS TO SERVE YOU\", you quickly say, feeling genuine terror.<br>\r\n<br>\r\nYour mom drops you back down between her enormous thighs.<br>\r\n<br>\r\n\"Now,\" she says, in a triumphant tone. \"Kiss my pussy. Slave\". <br>\r\n<br>\r\nYou get to your feet and turn around to face your mom's giant genitals. Despite feeling nauseous, you lean forward and kiss your mom's vagina. You then look up at her.<br>\r\n<br>\r\n\"I didn't tell you to stop, idiot. Keep going\", she says tersely.<br>\r\n<br>\r\nYou begin to kiss your mom's all over, feeling a sense of helpless rage and hatred to accompany your nausea. There's nothing you'd love more than to run away, but you know that's it's a futile gesture. And after demonstrating a willingness to cause you immense pain, you have no wish to test your mom's threat to cook and eat you.<br>\r\n<br>\r\n\"Rub yourself on it\", your mom commands.<br>\r\n<br>\r\nYou stop kissing and take a deep breathe. Then you press your body against her labia and slowly start rub yourself up and down it. Your mom lets out a loud sigh as her inner labia and clitoris fully emerge, and her lubricating fluids start to seep out. It's a deeply unpleasant feeling to be covered in the slick, viscous liquid, and you actually find yourself surprised that you haven't thrown up yet.<br>\r\n<br>\r\nAfter about five minutes of rubbing your six inch tall body on your mom's vagina, she then says. \"Rub my clit, slave\".<br>\r\n<br>\r\nYou stop rubbing your body on your mom's now extremely wet pussy and place both your hands on her clitoris, which to you is just slightly smaller than a basketball. Your mom gasps and then lets out a soft groan as you gently rub her clitoris. She groans again and softly says;<br>\r\n<br>\r\n\"Ooh yes. That's good\"<br>\r\n<br>\r\nYou continue to gently rub your mom's clitoris for about five minutes, constantly trying to summon the nerve to try to escape. But the memory of the intense pain of having your legs broken is still fresh in your mind. Suddenly, you feel the tingling in your body again. You feel a brief tinge of fear as your arms drop to your sides without you thinking about it. Your body suddenly becomes rigid and you grow to about ten inches in height. Now you really are scared. It's been in the back of your mind for some time, but now it's patently obvious that your mom intends to use you for a dildo.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1439614800,
            "id":2021414,
            "title":"Breaks your legs."
        },
        "1132":{
            "author_id":"gunbunny",
            "author_name":"Mad Dog",
            "choices":[
                "Your mom swallows you.",
                "She spits you out a few seconds later.",
                "Your mom eats you."
            ],
            "content":"<div class=\"\"><div> <span>For the first couple of minutes, you consider trying to escape. You even start to formulate a plan. Then you realise that you have one major stumbling block. The set of drawers that your cage is on top of. Even if you manage to get out of the cage, you have to get down from the top of the drawers. You think about climbing down the front of the drawers, but with you being two inches tall, it would be like climbing down the front of a six story building. If you fall, you're dead. So you decide against trying to escape, and just sit in the cage, waiting for your mom to return.<br>\r\n<br>\r\nNow that you have to time to think about the past fifteen minutes or so, you find that you're brain is having trouble comprehending what's happened to you. It shouldn't be possible for a human being to shrink in size. Especially to just two inches. And to find out that it was your mom who shrank you, using magic, was hard to handle. And the more you think about it, the more scared, and angry, you get. Mostly because you have no idea what your mom has planned for you. So you don't like anyone. It's not your fault that your better than everyone else. And it's not your fault that they get upset when you tell them. You certainly don't deserve this.<br>\r\n<br>\r\nYou hear the shower turn off, and you get nervous as the bathroom door opens and your mom walks out. She's wearing a white bathrobe that stops about mid shin. The upper part is open slightly, showing off her cleavage. You can't help but notice firm your mom's breasts are for a 40 year old woman. You're mom does look after herself though, and goes to the gym quite a lot. She walks straight over to your cage, and your fear grows as she looks down at you and smiles. You've already worked out that you're not going to have it easy while you're this small. You just wish you knew what she has planned. <br>\r\n<br>\r\n\"I've been thinking\", she says. \"You don't need to apologise for being a shit. You wouldn't mean it, so it would be pointless. I'll just have to MAKE you sorry. By the way, did I mention that as well as shrinking you, I also made you indestructible. You could have escaped if you'd wanted. It wouldn't have mattered if you'd fallen or jumped off of there. You would have been perfectly fine. Though I'd probably have found you\".<br>\r\n<br>\r\nYour mom then unlocks the cage door and opens it. You jump to your feet, feeling more scared and angry than ever. Your mom reaches in with her enormous right hand, finger and thumb poised to grip you. You manage to dodge to your left and kick her finger.<br>\r\n<br>\r\n\"DON'T TOUCH ME, BITCH\"!  You shout angrily.<br>\r\n<br>\r\nAfter a short chase around the cage, your mom manages to push to the floor of the cage and then pick you up. <br>\r\n<br>\r\n\"PUT ME DOWN. PUT ME DOWN, YOU FUCKING WHORE\"! You shout as you struggle in vain to release your mom's grip on your torso. \"FUCKING BITCH! PUT ME DOWN. NOW\". <br>\r\n<br>\r\nIn your anger, you don't register the tingling sensation throughout your whole body. And you're only vaguely aware that you shrink to one inch.<br>\r\n<br>\r\nYour mom lets out an exasperated sigh, and then an evil smile forms on her lips.<br>\r\n<br>\r\n\"Now didn't I say that from now on, you would address me as, 'Mistress'. Hmm\"? your mom asks. \"And such bad language. I'll just have to add that the list of lessons you need to learn\".<br>\r\n<br>\r\nShe giggles loudly. Your about to launch another tirade at her, when her mouth opens wide. Before you can even think, she tosses you into her mouth and snaps her jaw shut behind you.</span></div></div>",
            "created":1438664400,
            "id":2016520,
            "title":"Your mom returns."
        },
        "11322":{
            "author_id":"gunbunny",
            "author_name":"Mad Dog",
            "choices":[
                "Six hours later.",
                "Four hours later.",
                "The next day."
            ],
            "content":"<div class=\"\"><div> <span>You scream in terror as your mom's rough tongue presses you against the hard, wet roof of her mouth. You're covered in your mom's saliva, even swallowing some of it, as you have visions of being swallowed alive. Somehow, knowing that you can't be killed seems to make it worse. You're aware that you wouldn't be killed by digestion, but either trapped inside your mom's stomach until she decides otherwise, or you'd take a really unpleasant journey through her bowels. Fortunately though, that doesn't happen. The next thing you know, you hear a spitting sound, and you suddenly find yourself flying through the air. Seconds later, you land hard on what you quickly realise is your mom's bed. <br>\r\n<br>\r\n<br>\r\nYou feel an immense sense of relief to be out of your mom's mouth, because you have felt such deep terror. You somehow manage to fight off the urge to cry. You feel the bed sink down under the weight of something immensely heavy. You open your eyes to find that your mom has climbed onto the bed, is kneeling up on it, watching you with apparent amusement. She quickly drops onto all fours, and you roll onto your back as her face descends, and then stops just inches above you. Again, you scream in terror, and start trying to crawl away.<br>\r\n<br>\r\n\"NO, PLEASE\", you shout. \"NOT AGAIN, PLEASE, NOT AGAIN\".<br>\r\n<br>\r\n\"Ooh, fear\", your mom's voice is incredibly loud as she speaks. \"I like that. It's good that your afraid. Where are you trying to go? Stop\". <br>\r\n<br>\r\nIn your panic, you keep moving.<br>\r\n<br>\r\n\"I SAID STOP\", your mom shouts.<br>\r\n<br>\r\nHer voice is deafening, and you feel it vibrate throughout your entire body. This time though, you stop and slowly roll onto your back.<br>\r\n<br>\r\n\"Who am I\"? She asks with an evil grin.<br>\r\n<br>\r\nYou pause for second, surprised by the question. Then you remember what she told you earlier.<br>\r\n<br>\r\n\"Your my mo...mistress\"<br>\r\n<br>\r\nYour mom closes her eyes and shakes her head. <br>\r\n<br>\r\n\"No\", she says softly. \"I your life, started inside me. I created you. So that means, I'm your goddess. Say it\".<br>\r\n<br>\r\nAgain you pause, struggling to control your breathing.<br>\r\n<br>\r\n\"You...your my....goddess\", you reply.<br>\r\n<br>\r\n\"What can I do to you\"? she asks.<br>\r\n<br>\r\n\"A...anything...you...want\"? You reply.<br>\r\n<br>\r\n\"Anything I want\", she says. \"Because I am your goddess, and you are the worthless little worm who worships me\".<br>\r\n<br>\r\nYour mom smiles broadly, baring an enormous set of bright, white teeth. You struggle to maintain control of your bowels as you stare helplessly at them. Realising what you're looking at, your mom lets a loud giggle.<br>\r\n<br>\r\n\"Oh don't worry\", she says in a less than reassuring tone. \"You're not going in mouth again. Yet. I'm not going to eat you\". The evil smile returns, and she says. \"But there is a part of my body that wants to swallow you whole\".<br>\r\n<br>\r\nBefore you can say anything, your mom rears up onto her knees. You hadn't noticed, because her face was the only thing you could see, but she'd unfastened the belt on her bathrobe. As she rises up, her bathrobe falls open, revealing her enormous breasts, and her vagina. You suddenly realise what your mom has planned, and you immediately roll onto your front start to scramble away.<br>\r\n<br>\r\n\"STOP\"! Your mom's voice booms. \"Or I'll pull your arms and legs off\".<br>\r\n<br>\r\nYou immediately stop and roll onto your back, you have no wish to find out if she's bluffing or not.<br>\r\n<br>\r\n\"Good little shrunken boy\", she says.<br>\r\n<br>\r\nShe screws up her nose and thinks for a second. <br>\r\n<br>\r\n\"Mm, no. That doesn't sound right\", she says. \"From now on, your name is...SLAVE. And you will call me, goddess. Do you understand, slave\".<br>\r\n<br>\r\nYou nod your head and reply, \"Yes, goddess\".<br>\r\n<br>\r\n\"Good. Now get on your feet and stand right here\", she says as points between her knees.<br>\r\n<br>\r\nYou get to your feet and slowly walk over to where your mom is pointing. You try not to look at her pussy, but you can't help it. It's directly in front and just above you. You find yourself feeling somewhat surprised that it's completely shaved, giving you a very uncomfortable view of the slit that runs down beneath her. It almost looks like a vertical smile. <br>\r\n<br>\r\n\"Strip\", your mom says. <br>\r\n<br>\r\nYou freeze, desperately trying to think of a way out of this situation. Nothing comes. Your rolls her eyes and sighs impatiently.<br>\r\n<br>\r\n\"This is happening\", she says coldly. \"Nothing is going to stop. And you only have one set of clothes at that height. So unless you want to get them messy...strip, slave\".<br>\r\n<br>\r\nYou slowly take your clothes off. When you're finished, your mom gently picks you up between the thumb and forefinger of her right hand. She moves around until her back is toward her pillow, and then she lies back, propping herself up on her left elbow.<br>\r\n<br>\r\n\"P...Please\", you say meekly.<br>\r\n<br>\r\n\"I told you\", your mom says. \"This is happening. Don't worry, you'll be perfectly alright. And I'll let you out in a few hours\".<br>\r\n<br>\r\nYour mom lowers you between her thighs, and laughs as you make a half hearted attempt to break free of her grip. <br>\r\n<br>\r\n\"Y'know, when I had you in my mouth, I felt powerful\", your mom says softly. \"I mean, I could have taken away the indestructability I gave you. I could have swallowed you, let you dissolve in my stomach, and absorb you back into my body. It was a great feeling. I want to see if I get the same feeling from putting you inside my pussy. Which reminds me, be careful when you move. It's a very sensitive part of my body\".<br>\r\n<br>\r\nYour mom then presses you against her pussy. You cry out in fear as both sets of lips part, and your head slowly slides inside your mom, quickly followed by your shoulders. You feel the muscles in your mom's vagina grip you. At one inch tall, it only takes a few seconds for your whole body to be sucked up you mom's pussy. You then get pulled deep inside her. The muscles release their grip and you lie there in shock. It's only moderately better than being in your mom's mouth, but it's stilly deeply unpleasant.<br>\r\n<br>\r\n<br>\r\nOUTSIDE.<br>\r\n<br>\r\nYour mom closes her eyes as smiles as she slides your head and shoulders inside her. With a little concentration, she finds that she use them to suck you inside her. With a little more effort, she manages to pull you about halfway up her vagina. She gently bites her lower lip and lets out a soft 'mmm', as she feels your tiny body moving up inside her.<br>\r\n<br>\r\n\"Next time, I'll make you bigger. So I can enjoy it more\". She says, before slowly licking her lips.<br>\r\n<br>\r\nYour mom then gets of the bed and walks over to her full length mirror. She looks down at her groin and pats herself between the legs.<br>\r\n<br>\r\n\"Have fun in there\", she says, then goes of to get dressed.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1438664400,
            "id":2016576,
            "title":"Spat Out."
        },
        "115":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Go to one of your neighbors",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You...         </span></div></span></div>",
            "created":1515802140,
            "id":2439911,
            "title":"Something else"
        },
        "12":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "The Gym",
                "The Chem Room",
                "The Locker Room",
                "Home Ec. Room",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in the school?</span></div></span></div>",
            "created":1139029200,
            "id":299677,
            "title":"?"
        },
        "121":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "You're shrunk and a girl's gym class is entering.",
                "You're shrunk and a boy's gym class is entering."
            ],
            "content":"<div class=\"\"><div> <span>The gym was one of your favorite places in the school for one specific reason.  It was the place where you were least likely to get caught.  You mainly went here to do a little smoking.  Today was no different.  You walked out of your English class because the teacher started talking and you needed a place to relax.  You reach the gym and pull out a pack of cigarrettes.  You open it and see something odd about the packet.  One of the cigarrettes was colored completely red.  Meh, you've done worse kinds of drugs then a colored cigarrette.  You pop out your lighter and light it.  Immediately, you realize that this was no ordinary cigarrette.  You felt your head going light and you collapsed to the floor.  When you awoke...</span></div></div>",
            "created":1139029200,
            "id":299679,
            "title":"Red Cigarrette?"
        },
        "1211":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Soccer",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You awake to a big surprise.  Everything was massive!  The bleachers looked like thousands of football fields stuck together.  All of a sudden you started to hear a loud noise that sounded like thunder.  The sound of the door bursting open caught your attention and you immediately turned your head to the source of the incredible noise.  Your jaw dropped as you saw tons of goddesses enter through the massive gym doors.  Each one was at least one hundred feet tall!  You were in luck though.  They had to go to the locker room first to get changed so you had a chance to think things over.  You turned around and saw the gym teacher setting up the gym for...</span></div></div>",
            "created":1139029200,
            "id":299680,
            "title":"Shrunk!"
        },
        "12112":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Volleyball",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Make your pick.</span></div></span></div>",
            "created":1139029200,
            "id":299681,
            "title":"?"
        },
        "121122":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Fitness Testing",
                "Basketball"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Make your pick.</span></div></span></div>",
            "created":1139029200,
            "id":299682,
            "title":"?"
        },
        "1212":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "At Home",
                "In the Showers"
            ],
            "content":"<div class=\"\"><div> <span>You awake and realize how massive everything is. You must be the size of a baby. As you walk out from under the bleachers, you see that the boys' basketball team is leaving. Suddenly, you are picked up by two huge hands. You are lifted up to a huge face, then lowered down and stuck in the pants as the giant walks to the locker room.</span></div></div>",
            "created":1160802000,
            "id":352558,
            "title":"Caught"
        },
        "12122":{
            "choices":[
                "The Giant lets you get crush",
                "The Giant keeps you and decides your fate himself"
            ],
            "content":"<div class=\"\"><div> <span>Its dark and very musty to your tiny nose. You gasp for air and kick and squirm to get free. The giant hand reaches down and grabs you, bringing you out from the dark. You find yourself being held in the hand of a giant while others stand around in amazement at your tiny size. You're shaking in fear as they look at you in amazement. You get a good look at all of them and realize that you've bullied them one time or another.<br>\r\n<br>\r\n\"Let's step on him, \"one person yells. Others cheer on the idea while others suggest other ideas. The one holding you smiles and brings you to his face saying, \"Look whose the tiny little wimp now...\"<br>\r\n<br>\r\nYou look into his eyes and realize he's Alex, the guy you made fun of for being curious about guys. You gave him hell, and it seemed like he was about to return the favor. He brings you dangerously close to his face. \"Hey...I'm sorry, ok? It was just a hard time for me. Sorry for taking it out on you.\" Another kids yells out, \"He's lying!!! He used that excuse when he pounded me face in. Crush his tiny ass. Let me do it...\"</span></div></div>",
            "created":1337922000,
            "id":1345217,
            "title":"In the Showers"
        },
        "122":{
            "author_id":"aerodeth",
            "author_name":"Aerodeth",
            "choices":[
                "Presents you to the rest of the class...",
                "...why is he heating up that bunsen burner?!"
            ],
            "content":"<div class=\"\"><div> <span>\"Wake up Kyle!\"<br>\r\n<br>\r\nYou hear a familiar English accent... when you wake up... You realize youre sitting on a giant hand.. and you notice a giant face staring back at you!<br>\r\n<br>\r\nA student with red hair and blood-red eyes... it's the foreign exchange student, Sadri! You always used to pick on him for being new to the country... you used to bad-mouth where he came from and his accent and such...<br>\r\n<br>\r\n\"Hello Kyle...\" Sadri grins at you! \"Looks like my experiment worked!!\"<br>\r\n<br>\r\n\"W...w...Sadri?! What the hell did you do to me?!\"<br>\r\n<br>\r\nHe just says says, \"Try to remember what happened.\"<br>\r\n<br>\r\nYou think... you remember right before Chemistry class there was lunch... you traded your bottle of gatorade for Sadri's specially-made soda... he kinda snickered while he gave it to you.... oh crap!!<br>\r\n<br>\r\n\"That's right you ignorant American bastard!\" he yells! \"That soda was a special formula Ive invented! It shrunk you down to this size... Now I can PERSONALLY make you pay for desecrating my nationality!\"<br>\r\n<br>\r\n\"Wha...\" you tried to plead with him, \"Im sorry Sadri! Im sorry I said all those nasty things! I was stupid... that was horrible of me, and for that I apologize!\"<br>\r\n<br>\r\nHe just shakes his head, \"Sorry BUD! Too little too late! Now youre nothing but my little science experiment!\" <br>\r\n<br>\r\n\"Sadri...please dont do this! Im beggin you!\" you beg him.<br>\r\n<br>\r\nHe just shoves you into a little jar with airholes... and what does he do next?</span></div></div>",
            "created":1139029200,
            "id":299695,
            "title":"Foreign Exchange Student's Revenge!"
        },
        "1221":{
            "author_name":"Imogine Weber",
            "choices":[
                "Kyle ends up doing the maze in his underwear, in front of the entire class and i",
                "He refuses and ends up trying to fight off the class pet."
            ],
            "content":"<div class=\"\"><div> <span>\"Sadri!\" Says Mrs. Finkle.  \"Would you like to give your presentation on your science project you've been working on?\"<br>\r\n<br>\r\n\"Yes ma'm!\" says Sadri, all excited about the experiment.<br>\r\n<br>\r\nSadri gets up in front of the class and sets on the table a maze, which scientists seem to normally use for lab rats.  He angles the mirror up above the table so that the entire class is able to see.  <br>\r\n<br>\r\n\"My project is about finding out if some rats are smarter than they act.\" Sadri says as he reaches in his back pack for a jar.  <br>\r\n<br>\r\nAs he slowly pulls out the jar, he's chuckling with enthusiasm.  He looks through the glass jar and inside the jar is the biggest bully of the entire school at just 2 inches tall, Kyle.  Kyle is trying his hardest to brace himself from falling over as Sadri shacks the jar up a bit to startle him.  Sadri still has the jar hidden behind the lab counter so none of the students can see what is contained in the jar.  They still think it's an actual lab rat.<br>\r\n<br>\r\n\"It's pay back time!\" Sadri snarls at Kyle.<br>\r\n<br>\r\nHe then holds up the jar and announces Kyle to the class.<br>\r\n<br>\r\n\"This is my newest lab rat, Kyle!\"<br>\r\n<br>\r\nThe entire room gasps at the site of the biggest bully trapped inside a jar.  No one could even believe their eyes.   They all rush to the lab table to get a closer look at Kyle in the jar.  All of them asking eachother how Sadri could do it?  They all huddled around the table to see what Sadri had in store for Kyle.<br>\r\n<br>\r\n\"Now Kyle,\" Sadri says as he takes off the holie lid of the jar. \"See if you can find your way through the maze.\"<br>\r\n<br>\r\n\"You crazy little creep!  You can't do this to me!  Unshrink me now!\" Yells Kyle.<br>\r\n<br>\r\n\"Oh not yet 'lab rat'.  Before I undo anything I want you to find your way through the maze...wearing nothing but your underwear.\" Sadri demanded.<br>\r\n<br>\r\n\"You're insane!\" Kyle cried.<br>\r\n<br>\r\nSadri then pulls Kyle out of the jar and brings him over to the class pet lizzard and holds him above its head.<br>\r\n<br>\r\nKyle is screaming his head off as he notices the astonishing size of the pet lizard.  The same lizard he use to take out of the cage and toss around while the teacher wasn't looking.  That was how much of a bully he was.  At this moment, the lizard was almost the size of a brontasaurous compared to Kyle.<br>\r\n<br>\r\nThe students stood around Sadri as he held him over the cage and giggled hysterically as Kyle continued to squeel like a girl.<br>\r\n<br>\r\n\"Will you do it?\" Sadri asks.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1139115600,
            "id":299850,
            "title":"Show and Laugh"
        },
        "12211":{
            "author_id":"aerodeth",
            "author_name":"Aerodeth",
            "choices":[
                "Go left!",
                "Go right!"
            ],
            "content":"<div class=\"\"><div> <span>\"OK OK! FINE! I'LL DO IT!\" you scream as loud as you can!<br>\r\n<br>\r\nHe drops you in the maze away from the lizard, and you quickly strip down to your underwear!<br>\r\n<br>\r\nSadri grins and says, \"Good choice! But because of your little outburst... there's going to be a twist!\"<br>\r\n<br>\r\nHe then looks to the class and says, \"Ladies and gentlemen, Im going to experiment on how the human instincts are put to the test... WHEN THEIR LIFE IS ON THE LINE!!\"<br>\r\n<br>\r\n\"What?\" you look up to him and ask, \"What are you talking about?!\"<br>\r\n<br>\r\nSadri pulls out a little box from his pocket and opens it... there are 3 little scorpions inside!! He puts each one of them down in a different part of the maze!!<br>\r\n<br>\r\n\"OH CRAP!!!\" you scream!! You dont know where in the maze did Sadri put those scorpions!! They could be ANYWHERE!! And they could be... HUNGRY!!<br>\r\n<br>\r\nSadri says to the class, \"The test is simple.  Can our little labrat, Kyle, rely on human instincts alone to escape the wrath of his predators?\"<br>\r\n<br>\r\nHe looks down at you and says, \"Ready.... GO!!\"<br>\r\n<br>\r\nYou run like hell through the maze... but you wind up getting a little lost, because to you it is a HUGE maze! You eventually spot two paths that go left and right! One could lead you to safety... the other could lead you to a hungry scorpion! THIS is where your instincts are put to the test!</span></div></div>",
            "created":1139115600,
            "id":299903,
            "title":"Human Instinct"
        },
        "122111":{
            "author_name":"Imogine Weber",
            "choices":[
                "A scorpion appears from above",
                "The bell rings"
            ],
            "content":"<div class=\"\"><div> <span>As Kyle turns to the left he is blocked by humongous action figure caught in the maze.  The kids continue to stand around and laugh as they sat and watched.<br>\r\n<br>\r\n\"Mrs. Finkle!\" Kyle cried to the teacher, who was also quite amused by Sadri's experiment.<br>\r\n<br>\r\n\"Yes Kyle?\" Mrs. Finkle chuckled.<br>\r\n<br>\r\n\"Aren't you going to do anything to him for making me his lab rat?\" Kyle cried as he ran behind the action figure, hoping to use it fight off the scorpions if they come.<br>\r\n<br>\r\n\"Hmmm...\" Mrs. Finkle thought for a moment. \"After gluing me to my chair, making rude loud gestures during class, and speaking back to me everyday, I'd say that you're on your own.  And I promise, this won't be explained to anyone Kyle.  Not to anyone!\"<br>\r\n<br>\r\nAll the students laughed hysterically as Mrs. Finkle decided then and there not to interfere with Sadri's experiment.  They all knew that the bully was getting what was coming to him.<br>\r\n<br>\r\n\"Just get through the maze, 'lab rat' and this will all be over with.\"<br>\r\n<br>\r\nKyle was raging mad at this point and began to try and figure out how to get out of the maze when all of a sudden...</span></div></div>",
            "created":1141102800,
            "id":303923,
            "title":"Trapped in a-maze"
        },
        "1221111":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "He wins!....What next?"
            ],
            "content":"<div class=\"\"><div> <span>Kyle unsheaths the figure's pointy blade, sensing danger. Suddenly, the tail of a scorpion strikes next to him. He quickly cuts the tail off, poisoning the sword. The scorpion jumped down, claws grasping at air as it crawled towards him. It grasped part of his underwear and started pulling him closer. Kyle stabbed it between the eyes. He attempts to pull back his underwear, but it is stuck firmly in the claw. He takes off the underwear and continues.<br>\r\n<br>\r\nSuddenly, Kyle sees the end in sight. He dashes toward it.</span></div></div>",
            "created":1160802000,
            "id":352562,
            "title":"Attack from Above"
        },
        "12211111":{
            "author_id":"aerodeth",
            "author_name":"Aerodeth",
            "choices":[
                "Stick with him!",
                "Go with his sis!"
            ],
            "content":"<div class=\"\"><div> <span>Although youve now resorted to running through the rest of the maze naked, youre just relieved youre finally rid of those scorpions! And in case Sadri plans to drop another one in there, you'll be ready for 'em thanks to that brand new weapon of yours!<br>\r\n<br>\r\nYOU DID IT! YOU FINALLY REACHED THE END! The big room with the words 'Finish' on the ground! Still, you aint relieved, cuz Sadri could simply make you do ANOTHER creepy test! You'd poison him with your little sword if he touches you, but he's wearing protective gloves!<br>\r\n<br>\r\nAnyway, all the fellow classmates as well as your teacher stare down at you in disbelief! You actually made it through!<br>\r\nSadri on the other hand is smiling. Not only that, he actually claps for you! And then so does the rest of the class.<br>\r\n<br>\r\n\"Well there you have it!\" the foreign kid tells the others, \"It's amazing how far one would go to save their own life. When courage and determination are tested to the max... ANYTHING'S possible!\"<br>\r\n<br>\r\nJust then the bell rings signaling the end of class. Sadri picks your tiny body out of the maze and sticks you in a mason jar... with air-holes, thankfully! It's a good thing he's not a sadist!<br>\r\n<br>\r\nHis enormous face stares into the jar. Just looking at those big glowing red eyes of his make you quiver in fear!<br>\r\n\"..Excellent work, Kyle!\" you hear him congradulate you, \"I expected no less from the likes of you.\"<br>\r\n<br>\r\nYou shout to him, \"Allright, you had your fun, now CHANGE ME BACK!!!\"<br>\r\n\"Hm? Oh, Im sorry! You'll have to rephrase that. I dont speak 'bastard'!\"<br>\r\n<br>\r\nYou know being an a-hole aint gonna get you free sooner, so you sigh and try to speak to him as nicely as possible, \"Look, Sadri... Im really REALLY sorry for the way Ive been treating you. Please, please I beg you! Change me back! PLEASE!\"<br>\r\n<br>\r\n...No good. \"Why? Youre no good to anyone else. Everyone around here hates you, but no one had the bollocks to stand up for themselves! But not to worry, I'll tell you what: I'll let you decide your fate!\"<br>\r\n<br>\r\n\"What do you mean?\"<br>\r\n<br>\r\n\"Simple!\" Sadri smiles, \"You can either stick with me and join me in Gym, or I can hand you over to my big sister.. I think you remember her... um.. 'that foreign bitch with huge knockers that would be fun to nail'?\"<br>\r\n<br>\r\nOh, of all the comments about Sadri's sis to come back and bite you in the ass!</span></div></div>",
            "created":1165208400,
            "id":363459,
            "title":"To the victor go the spoils.."
        },
        "1221112":{
            "author_id":"aerodeth",
            "author_name":"Aerodeth",
            "choices":[
                "Try to escape!! Any means necessary!",
                "You get to be a part of her cooking class!!!!"
            ],
            "content":"<div class=\"\"><div> <span>*BRRRRRRIIIINNNNNNNNGGGG!!* The bell rings!<br>\r\n<br>\r\n\"Aw great! That means class is over!\" Mrs. Finkle says, \"Sorry Sadri, Im afraid your science project must be cut short!\"<br>\r\n<br>\r\nSadri just smiles, \"Yes, I guess youre right!\" He pulls you out of the maze, away from all those scorpions!<br>\r\n<br>\r\nYou breathe a sigh of relief and thank Sadri over and over, but he just smiles at you wickedly with his bloodred eyes staring into your soul! \"Dont thank me YET Kyle! That bell just means I have worse planned for you!...well actually... my sister does!\"<br>\r\n<br>\r\n\"Y..Y your sister?!\" You remember HER! Sadira! She's about as old as you, with long black hair and bloodred eyes like her brother! You have sort of a crush on her, but she HAAAAATTTTEEESSS you for treating her brother like crap!<br>\r\n<br>\r\nSadri meets with Sadira and tells her, \"Guess what Sadira? The formula worked! Here is Kyle now!\" he brings you close to her face... you kinda get lost in those beautiful...yet EERIE eyes of hers!<br>\r\n<br>\r\n\"Wow!\" she says, \"Can I uh... keep him for a while?\"<br>\r\n<br>\r\nHe smiles, \"That's what I was hoping for!\" He hands you to her and leaves! Sadira looks down at you.... and smiles! \"Hello there, Kyle!\"<br>\r\n<br>\r\n\"Uh...hi Sadira!\" you say blushing!<br>\r\n<br>\r\nBut then she says, \"You thought it was funny to always pester Sadri like you did, didnt you???!!\"<br>\r\n<br>\r\n\"Uh...WAIT! I uh...I-\"<br>\r\n<br>\r\nShe grins wickedly at you, \"Well, if you thought your experience with HIM was fun, youre gonna LOVE me! Guess what I have next period.... HOME-EC!!!\"</span></div></div>",
            "created":1141275600,
            "id":304460,
            "title":"The bell just signals a WORSE fate!"
        },
        "12211122":{
            "author_id":"aerodeth",
            "author_name":"Aerodeth",
            "choices":[
                "Start screaming for help!",
                "Try to escape the bowl!"
            ],
            "content":"<div class=\"\"><div> <span>You cant get away! She wont let you! Sadira hates your guts and you know it! Sometimes it doesnt pay to be an asshole! Sadira closes her fist tight to conseal you as she steps into her home-ec class... You pray she'll be easy on you...<br>\r\n<br>\r\n...she wont!<br>\r\n<br>\r\nThe teacher, Mr. Uranus, announces to the class that theyre gonna be divided into teams to see who can make the best tasting chocolate cake in the class! Sadira was teamed up with her best friends... that ALL despise you with a passion:<br>\r\n<br>\r\nSandy, the blonde ex-cheerleader whom you spread a rumor about her having an STD which got her kicked off the squad! Keisha, the gentle-hearted African-American girl you made a pass at once. When she refused, you said a racist remark to her that caused her to run home crying! And Lenny, Sadira's effeminate male friend, whom you once beat up just because of his sexuality! Yes... you were a REAL jerk!<br>\r\n<br>\r\nSadira put on her apron and tossed you in a tiny pocket of the apron before greeting her friends, \"Hiya guys!\"<br>\r\n<br>\r\n\"Hey Sadira!\" Sandy waved at her, \"That punk Kyle didnt give you any problems, did he?\"<br>\r\n\"Nah!\" Sadira shakes her head and smiles! \"Well, that's good,\" Keisha sighs, \"..it's about time someone made that jerk pay for being Kyle!!\"<br>\r\n<br>\r\nLenny just gritted his teeth and grabbed his mitten, \"Grr!! That.. bastard! I wish someone would just... UGGGHH!!!\" he started twisting the mit!<br>\r\n<br>\r\nBut Sadira just smiles sweetly, \"Oh, I have a feeling we wont have to worry about Kyle... anymore!\"<br>\r\n\"Hmm? Why's that?\" Keisha asked.<br>\r\n<br>\r\nSadira just changed the subject! \"Maybe later... we have a cake to make!\" And so, the team grabbed some chocolate cake mix, water, egg yoke, etc and put it in the egg-beater to make some nice fudge batter!<br>\r\n<br>\r\nSadira bent down to take a good sniff of the batter... causing you 'accidently' slip out of her pocket and into the batter!!<br>\r\n<br>\r\nSadira just grins, \"Mmm... I have a feeling our cake's gonna be GOOD!!\"</span></div></div>",
            "created":1151902800,
            "id":328243,
            "title":"Creme de la creep!"
        },
        "122111222":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you make it out?</span></div></span></div>",
            "created":1476507600,
            "id":2223860,
            "title":"Try to escape the bowl!"
        },
        "123":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "the football team comes in",
                "his friends come in to find him",
                "two of his friends sit down next to his clothes and begin to undress"
            ],
            "content":"<div class=\"\"><div> <span>Kyle has just showered and dressed back into his school clothes. Just then, a strange mist drops down from the ceiling all around him. A moment later, as he walks toward the exit, he steps out of his sport shoes which are now to big for him by two inches. He looks down and sees his t shirt is now by his knees. He steps out of his shoes and peels off his socks and notice his tan, hairless bare feet are shrinking before his eyes. He wiggles his pedicured, slender toes. Soon after, the rest of his clothes fall off him, leaving him naked and only six inches tall. He looks around and can't believe he has shrunk.<br>\r\nJust then...</span></div></div>",
            "created":1511586000,
            "id":2420392,
            "title":"The Locker Room"
        },
        "125":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Bathroom ",
                "Cafeteria ",
                "Other locations "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else in the school?</span></div></span></div>",
            "created":1513841640,
            "id":2430911,
            "title":"Other"
        },
        "13":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "A little girl spots you.",
                "A little boy spots him.",
                "A female teenager spots him.",
                "A male teenager spots him.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You were very familiar with the local playground for a number of reasons. One, it provided you with plenty of young boys and girls to bully and tease.  Two, there were always a few hot girls there to watch over they're younger siblings.  And three, there were barely ever any adults around so you could do pretty much whatever you wanted without getting caught.  Today was a hot summer day and there was not much to do so you decided to head on over there.  Since it was such a nice day, the playground was a pretty populated place.  There were tons of children and plenty of attractive older siblings.  You try to decide which one to go for when an overwhelming dizziness hits you.  You start to stumble and lose your balance and soon you fall.  <br>\r\n<br>\r\nWhen you wake up you are greeted by walls of white fabric.  You realize that you have shrunk and you were standing naked inside your boxers.  You climb out and look around.  Everything is huge.  The children that you bullied now tower hundreds of feet above you.  You think about what to do when....</span></div></div>",
            "created":1149656400,
            "id":323075,
            "title":"Playground fun"
        },
        "131":{
            "author_id":"davidthegrate",
            "author_name":"davidthegrate",
            "choices":[
                "Her Panties",
                "Her Sock/Shoe"
            ],
            "content":"<div class=\"\"><div> <span>You were too busy observing your now massive surroundings to notice the girl coming from behind you.  That is, until you felt pressure on both sides from her giant fingers.  You were lifted very high and then dropped into the palm of the little girl's open hand.  You scrambled to your feet and turned around to look at your captor. <br>\r\n<br>\r\nHer name was Samantha.  You had bullied her a number of times, including pushing her into the mud and throwing rocks at her.  But now the tables were turned and you were quivering in fear at her mighty size.<br>\r\n<br>\r\nShe examined you closely and after a while she must have realized who you were, because without a word she lowered you into...</span></div></div>",
            "created":1170392400,
            "id":378617,
            "title":"Samantha"
        },
        "1311":{
            "choices":[
                "Her crotch",
                "Her right butt cheek",
                "Between her butt cheeks"
            ],
            "content":"<div class=\"\"><div> <span>Samantha  lifts her skirt up and drops her panties slightly. She lowers her hand over her panties and opens her hand, causing you to fall. You feel yourself being dropped a little way, before you hit the fabric of her panties. She then starts to pull them back up again, with you still inside, lifting you up towards the inner thighs. As you make contact with her body you are pressed again her warm skin. <br>\r\n<br>\r\nSamantha pulls her panties up tightly, trapping you within them, then lets her skirt drop back into place. You are now hidden from sight within her panties, concealed under her skirt.<br>\r\n<br>\r\nSamantha tells you that she recognised you straight away, and that she knows just what to do to bullies like yourself. It seems you are in for an adventure, but against what part of her body are you currently resting</span></div></div>",
            "created":1197781200,
            "id":476135,
            "title":"Her Panties"
        },
        "13111":{
            "choices":[
                "She's biking home.",
                "She's going to the park area."
            ],
            "content":"<div class=\"\"><div> <span>Finding yourself plastered on her warm crotch almost all light is obscured by her black knee-length skirt, a rather peachy feminine smell accumulating where you are, just her pale skin visible. It'd be nice given different circumstances, but being pressed into a young girls body isn't something that should ever be done. Alas it doesn't matter anyway, nobody saw you shrink or see her approach, nobody saw her hide you, &amp; you can deduce easily that struggling will do nothing but likely please the girl you used to love bullying so much. Who knows what people will think with clothes lying in the park.<br>\r\nSamantha smiled heartedly as the two-inch man was stuck against her body, beginning to walk toward the swingset. Her thighs pressed forward &amp; this'd pull you down each step, her breathing assisting. Soon heat emanating from her snatch was creeping upwards, your hormones turning you on, but your brain striking fear since it's obviously bigger than you &amp; hot, something that instincts tell not to go near. So vainly you begin struggling to reach her black-cotton panty edge, this only helping your descent &amp; causing a stop.<br>\r\n<br>\r\nLegs were first to be enveloped followed by your crotch, your shameful boner being rubbed off her skin &amp; onto her slightly moist upper vulva, a underdeveloped clit barely pressing into your stomach, uncomfortable. Pleasure like nothing you've felt rushed over, &amp; as you are bouncing against her, its followed by her sitting on a swing.<br>\r\nSamantha hums to herself as she sits, feeling Kyle slide just mostly under her pussy. Her legs closeness caused him to be shoved under her fully, the man struggling to do anything as fear overtook the focus in the euphoric pleasure. She felt him tingle under her as she began to move the swing, knowingly bringing him inward.<br>\r\n<br>\r\n....The first swing back caused you to be dislodged, you thought you might be able to turn &amp; crawl up as the weightlessness was there. However there was barely any time to do so as when she swung forward your legs were arched inwards &amp; you couldn't move, her vaginal folds in way. All the forces were sliding you in, the stickiness isnt helping your situation. Your fear &amp; regretful lust is sustained ahold as each swing slowly drags you in, you barely stopping your torso from being took into her dark abyss by barely holding the soft surrounding vestibule, upper body quickly writhing from pleasure but also major pain, the fabric of her tight panties suddenly hurts your spine massively! As her intensity increases it hurts more &amp; soon you scream as you feel like you'll break, you hear a laughing of joy above &amp; you let go, not handling it. Samantha's aware your ending up in her snatch, enjoying it all, swaying her hips on the swing some. <br>\r\nEnvelopment is quick as your squeezed into her, your hyperventilating hot damp air &amp; not knowing what to try &amp; do. You hear just her insides as pleasure comes back &amp; pain subsides heavily, her vaginal walls move in a repetitive way. The forces keep you held tight in her &amp; almost in perfect place, you can't budge your arms, resignation was well given as you find yourself ejaculating with a ashamed moan. <br>\r\n<br>\r\nAfter swinging for a few minutes more Samantha got off, yanking her panties up as tight as possible through her skirt as she walked somewhere, tensing her vagina some. The fit blondes twelve-year old snatch was closed tight well &amp; her muscles remained trapping, the tensing of her inners hurt some. Your breathing calmed after lengthy mental accustoming, the heat is nigh unbearable. You tell she's walking by her movements, not happy to anticipate what it may be.. <br>\r\n</span></div></div>",
            "created":1544009520,
            "id":2586032,
            "title":"Toy for a girl."
        },
        "13112":{
            "choices":[
                "6 inches",
                "2 inches"
            ],
            "content":"<div class=\"\"><div> <span>Trapped in Samantha's panties, and hidden under her skirt, you find your body is pressed firmly against her right butt-cheek.<br>\r\n<br>\r\nSamantha seems to know where you are, because she says \"I hope you enjoy my backside, I bet you hope I don't sit down somewhere. For right now though you can stay where you are whilst I enjoy the amenities within this playground.\"<br>\r\n<br>\r\nYou are petrified, wondering just what Samantha is going to do to you, being as small as you are, but how small are you?</span></div></div>",
            "created":1197781200,
            "id":476136,
            "title":"Her right butt cheek"
        },
        "131121":{
            "choices":[
                "The swings",
                "The climbing frame"
            ],
            "content":"<div class=\"\"><div> <span>You have been shrunken down to 6 inches in size, probably about the same size as one of Samantha's dolls, but you don't imagine her dolls have ever been trapped in the back of her panties, the way that you are now. Maybe they have though, you don't know much about this young girl.<br>\r\n<br>\r\nSamantha now heads towards one of the rides in the park, but which one?</span></div></div>",
            "created":1197781200,
            "id":476138,
            "title":"6 inches"
        },
        "1311211":{
            "choices":[
                "Samantha tells you that you are a comfortable seat",
                "Samantha gets bored with the swings and does something else"
            ],
            "content":"<div class=\"\"><div> <span>Samantha walks to the swings. One of them is currently empty, and Samantha is making a bee-line for it. You do not know where she is heading, but you do notice when Samantha turns around and bends her legs as she starts to sit on the seat of the swing.<br>\r\n<br>\r\nTrapped in her panties, pressed against her backside, you know and fear what is about to happen.<br>\r\n<br>\r\nSure enough, as Samantha sits on the swing, her butt cheek presses down upon, you, pressing you firmly against the seat of the swing. The pressure becomes even more unbearable as Samantha leans to one side slightly, pressing as much of her weight as possible directly onto you.<br>\r\n<br>\r\nShe lifts her feet off the ground, and for a couple of minutes she is simply sitting on the swing, on you, and her full body weight is upon you.<br>\r\n<br>\r\nFortunately, at your size, you are not so small, that you are crushed beneath her, and she is still a young girl, not a full grown woman. Even so, the weight of her body sitting fully upon you is an agony beyond any you have ever felt before. Her warm backside is crushing you against the seat of the swing.<br>\r\n<br>\r\nSoon whowever, Samantha feels that she may as well make full use of the swing she is sitting on. She grabs the ropes with her hands, and starts to swing backwards and forwards, gently at first, but then with increased vigor.<br>\r\n<br>\r\nSamantha is soon trying to swinging quite fast and high. In fact she is trying to beat the record for how high she can swing, and succeeding admirably. She even lets go of the rope occasionally as the swing is dropping, so that gravity can crush you as firmly as possible beneath her backside.<br>\r\n<br>\r\nYou can tell that Samantha is fully aware of your presence under her right butt cheek as ste puts you through an agony of torture that seems to last for ever.</span></div></div>",
            "created":1197781200,
            "id":476142,
            "title":"Samantha's swing seat"
        },
        "13112111":{
            "choices":[
                "Samantha continues to use the swings for the rest of the day",
                "Samantha goes home to put her babysitting plan into action."
            ],
            "content":"<div class=\"\"><div> <span>As she continues to use you as a swing seat, Samantha tells you that she is delighted to have you there to sit upon. She says that the wooden seats of the swings can be quite hard sometimes. She tells you that your body is much more comfortable. She tells you that she has never enjoyed the swings more than she is doing right now. She even points out that she intends to sit on you on many more occasions.<br>\r\n<br>\r\nShe tells you that when her parents are out tonight, and so she could bring you round to keep her company. She points out that as you are much smaller than her you can be her baby. She also says that all babies need to have a grown up to look after them, be their babysitter. She says that she is more grown than you, considering your size, therefore she would be the babysitter.<br>\r\n<br>\r\n\"It would be fun\" she tells you \"As you are my baby and I am your babysitter, than naturally implies that I should sit on you. I will spend the entire night sitting on you, and that would mean that I am fulfilling my duties as your babysitter at no cost to yourself.\"<br>\r\n<br>\r\n\"I can't wait\" she grins</span></div></div>",
            "created":1197781200,
            "id":476146,
            "title":"Praise from the sitter"
        },
        "131121112":{
            "choices":[
                "She rides home on a bicycle",
                "She walks home"
            ],
            "content":"<div class=\"\"><div> <span>Samantha gets up off the swing, and you feel the pressure of her backside lift from your body, but not completely. She may have stopped sitting on you for the moment, but you are still trapped in her panties, pressed against her right butt-cheek.<br>\r\n<br>\r\nShe tells you that, as promised, she is taking you home so she can babysit you. She does not release you from her panties, pointing out that it would be daft to take you out of there, just to put you back later. She tells you that her home away from the park, and you can stay where you are for now.<br>\r\n<br>\r\nYour body is still extremely sore from being sat upon for a couple of hours whilst she was on the swings. You wonder if you will end up between her backside and a bicycle seat, or whether she will give you a bit of a reprieve and walk home. </span></div></div>",
            "created":1197781200,
            "id":476256,
            "title":"Going home with Samantha"
        },
        "1311211121":{
            "choices":[
                "Samantha goes inside and starts babysitting you",
                "Samantha's mum is just leaving the house"
            ],
            "content":"<div class=\"\"><div> <span>Samantha walks to the railings at the edge of the park where her push-bike is securely fastened. She unfastens the padlock and pulls her bike away from the railings. She lifts one leg over the frame, and starts to lower her backside towards the awaiting seat.<br>\r\n<br>\r\nAs you feel her backside descending once more, you think to yourself that she is either taking a breather on a park bench or she is going to ride her bike home. As Samantha told you she was taking you home now, you realise that the latter is most likely the case. You have spent over an hour being sat upon by her on the swings, and now she will continue your suffering as she uses you as a padding for her bike seat.<br>\r\n<br>\r\nAs Samantha settles herself upon her bike seat, she shifts her position to one side, ensuring that as much of her weight as possible is upon her right butt-cheek, under which you are trapped, and the now familiar crushing bodyweight of this young girl presses you firmly into the seat of her bicycle.<br>\r\n<br>\r\nWhilst Samantha pays no apparent attention to you as she rides home, it is clear she is deliberately making you suffer as much as possible. Whilst she is travelling uphill, the movement of her thighs, especially when she is pressing her foot down on the peddle, grind you into the seat of her bicycle, causing you to feel more pain than you have ever experienced before.On a number of occasions, the intense pain she is causing you makes you to lose consciousness for moments at a time. <br>\r\n<br>\r\nWhen she is going downhill, she sits on the bike seat and lifts her feet off the peddles, putting as much of her weight as possible on you, making you suffer almost as much. So many people say that Samantha is a very kind and caring young lady, but the way she is using the swing, and now her bike to crush you under her backside... vindictive hardly seems to come close, and what is more you somehow know that she is enjoying every moment of your torment.<br>\r\n<br>\r\nIn the end, however, Samantha rides her bike down her own driveway, and stops. She stands up and gets off her bike, and you feel you are in even more pain than you where when she got off the swing. She pushes her bike into the garage, and fits the lock. She closes the garage door and walks towards the front door, telling you she is now going to have some fun.<br>\r\n<br>\r\n</span></div></div>",
            "created":1197781200,
            "id":476271,
            "title":"Bicycle seat"
        },
        "13112111211":{
            "choices":[
                "Samantha tells you a bedtime story",
                "Samantha switches on the TV"
            ],
            "content":"<div class=\"\"><div> <span>Samantha takes the front door key from her bag, opens the door and walks inside. \"Welcome to my home\" she tells you \"not that you can see anything of it, trapped in my panties, and covered by my skirt. You are here because you are too small to be left alone, and you need to be babysat.\" She deactivates the burglar alarm then closes, and locks the door. \"As your self-appointed babysitter, it is my job to ensure your safety and security. I know you can't get out of my panties, but now I know that nobody can enter or leave this home without my consent. To you, this place is more secure than fort knox.<br>\r\n<br>\r\n\"Now that we are here, it is time for me to commence my role as your babysitter\" she announces \" Having already used you as a swing seat and a bike seat, I can assure you that you are the most comfortable baby I have ever sat upon, I enjoy it immensely, and I will take you now in to the living room where I will continue to enjoy sitting on you.\"<br>\r\n<br>\r\nSamantha does indeed now walk into the sitting room, which she says is very appropriately named, She stands in front of her favourite leather chair and starts to bend her thighs, lowering her backside (and you) towards the seat.<br>\r\n<br>\r\n\"OK Baby, Time to be babysat\" she says as the fabric of her skirt touches the leather chair, and then her pantied backside, with you still trapped within, presses into the seat. Once more you feel the intense pressure of this girl's backside upon your body, sitting on you. She lifts her feet off the floor and relaxes, with a contented smile on her face. \"I do love babysitting you\" Samantha states in a dreamy. contented voice \"don't you think so, dear baby?\"<br>\r\n<br>\r\nShe doesn't even hear your reply, as trapped within her knickers, and under her backside, you are suffering terribly, every breath you take is an agony, you can barely speak  never mind  respond, and what sounds you are might make are muffled within her knickers, and the fabric of her skirt.</span></div></div>",
            "created":1197781200,
            "id":476284,
            "title":"Samantha the babysitter"
        },
        "131121112111":{
            "choices":[
                "Samantha picks up the TV remote control",
                "Samantha picks up a cordless telephone"
            ],
            "content":"<div class=\"\"><div> <span>\"OK\" Samantha says \"Now that I am sitting on you, as any good babysitter should, I believe it is customary for babysitters to read the people they are in charge of a bedtime story. I don't know it is bedtime yet, but I think it is time for a story anyway, I am not going to neglect that part of the job.\"<br>\r\n<br>\r\n\"At this point I should ask you if you are sitting comfortably, but trapped in my knickers as you are, I imagine you are anything but comfortable, so I already know the answer to that question. I can assure you however that I am sitting very comfortably indeed, so I will begin.\"<br>\r\n<br>\r\nSamantha tells you a story that you already know. She tells you about a cruel tryrant, a boy who has caused misery and suffering to others, a boy who has spent years bullying a group of girls. She tells how this boy has spent years drawing enjoyment from the pain and anguish of others.\"<br>\r\n<br>\r\nShe tells you that the life of this boy, Kyle by name, is turned upside down one day. She explains how one of his victims sees him in the park one day, and at the time she is terrified. She wishes that she was taller than him, rather than the other way around, figuring that she wouldn't be afraid of him if he was a midget. She is amazed to discover that her wish is somehow granted, she sees you collapse, then shrink before her eyes, until you are no bigger than one of her dolls.<br>\r\n<br>\r\nHaving a quick intelligence, and a strong sense of justice, the girl picked up this boy that had once made her so fearful, and decided to take full advantage of the opportunity that arose. Knowing that, as a form of bullying, the boy Kyle had expressed a desire to get inside her knickers, she decided the time was right to grant his wish, because at this size, trapped inside her knickers, her body would control him, not the other way around.<br>\r\n<br>\r\nOnce he was inside her knickers, she could feel him pressed against the right cheek of her backside, and if she sat down right now, he would be squashed beneath her. She had glanced towards the swings, but had previously found the wooden seats to be less than comfortable. With the boy's body acting as a cushion between her rear end and the wooden seat, she felt that this time the swings might be a bit more comfortable. She thought about how much the boy would suffer, but then she reminded herself of the pain he had caused her and other girls, and the idea appealed to her.<br>\r\n<br>\r\nSamantha hadn't realised how much she would enjoy sitting on the boy. A padded swing seat was much better than a had wooden one. She enjoyed herself immensely, especially when she swung higher and higher, causing gravity to increase her pressure upon the boy's body. She loved it.<br>\r\n<br>\r\nShe couldn't stay on the swing forever though, there were a queue of other people forming hoping to have a go, and none of them were aware of the boy trapped inside her knickers. She wanted to keep sitting on the boy though, knowing how much he was obviously suffering, and knowing he deserved it. She decided that she should take him home with her. At his size he would not be safe on his own, at six inches he was smaller than a baby, then she thought that all babies need a babysitter She knew that a babysitter does not normally sit on the baby in their care, but in his case, she thought that would be the literal truth.<br>\r\n<br>\r\nShe told him where she was taking him, then collected her bike and rode home upon it, sitting on him the entire time.<br>\r\n<br>\r\n\"So what will this bully's fate be?\" she asks aloud \"For now the girl continues to babysit him, although later she may tell more of his one-time victims about his current size and position. She will never kill him though, or let anyone else take his life, but she will make his life a living hell from now on, as he had once done to her, and to others.\"<br>\r\n<br>\r\nAt this point, Samantha glances at the clock and notices that this story has taken her about a quarter of an hour to tell.<br>\r\n<br>\r\nSamantha says that whilst most babies go to sleep after a bedtime story, she doesn't imagine you will get much rest whilst she is sitting on you, so that is probably not an option in your case.<br>\r\n<br>\r\nShe reaches onto the table beside her and picks something up</span></div></div>",
            "created":1197781200,
            "id":476302,
            "title":"Samantha tells you a bedtime story"
        },
        "1311211121111":{
            "choices":[
                "She calls the local takeaway to order a meal",
                "She calls your sister Chloe and invites her over"
            ],
            "content":"<div class=\"\"><div> <span>Samantha picks up the remote control and switches on the television. After flicking through the channels for a few minutes, she notices that one of her favourite programmes is about to start, so she settles down to watch it.<br>\r\n<br>\r\nThe television is loud enough for you to hear the opening credits, although heavily muffled by her backside and the fabric of her knickers and skirt that enclose you. You know that, including commercials this programme will last for an hour, and Samantha is not likely to move until it finishes.<br>\r\n<br>\r\nYou consider your position. The pressure of her body sitting on you is colossal, and almost unbearably painful. You are pleased to note that Samantha's body is clean, as she pays a great deal of attention to personal hygiene, although at such close range you can smell a faint body odour, combined with the flowery fragrance of the soap products that she likes to use. Even in this pitch darkness there is no mistaking the fact that you are being sat upon, firmly, by a girl.<br>\r\n<br>\r\nConsidering the amount of time she has been sitting on you today, you are starting to feel that the intense pain you are feeling beneath her is a normal part of your life. It does not diminish in the slightest, but you are getting used to it, you are getting so used to being sat upon by her that you can't imagine a time in your life when she wasn't doing so. It is expected, natuural, seemingly a normal part of your life, intoxicating even. Perhaps if she ever does get up you will crave it so much that you will beg to be sat upon by her again.<br>\r\n<br>\r\nYou note that Samantha is a very pretty young girl, too. She has long red hair that falls down her back, almost to her waist, and green eyes. She is 11 years old, although you seem to recall somewhere that her 12th birthday is approaching, Her body is well proportioned. She is not skinny, but not exactly fat either. Her backside is not tiny, but not huge either. She is not one of these women who has too much muscle, but she does have a strong build. She does a lot of cycling to keep fit. You would describe her as solidly built, the kind of girl who could become a cheerleader in a couple of years. Right now that young, well proportioned backside of hers is settled firmly upon your entire body.<br>\r\n<br>\r\nYou think about the story she told you. You were never really blessed with much intelligence, but only an idiot could fail to see that she was describing you, and explaining about the events of today and even your future. Even you are not stupid enough to miss this point. You are also sure that if you hadn't grasped that point by now, Samantha would make sure you were aware of it soon.<br>\r\n<br>\r\nThe future, your future, what of that? Samantha will continue to sit on you \"babysit you\" as she calls it for the forseeable future, but then what? She says she will make your life hell for as long as possible, but will keep you alive so you can continue to experience it. She also said she may let other girls you once bullied know about your current predicament. <br>\r\n<br>\r\nFrom what you know of Samantha, she is an honest, intelligent girl with a strong sense of right and wrong, and a gritty determination. You are sure she meant every word of what she told you today.<br>\r\n<br>\r\nAs the programme ends, Samantha mutes the TV and picks up the telephone beside her. Who is she going to phone?</span></div></div>",
            "created":1197781200,
            "id":476319,
            "title":"Samantha the babysitter watches a little TV"
        },
        "13112111211112":{
            "choices":[
                "Chloe will be there in about 10 minutes",
                "Chloe is busy tonight, but promises to come around tomorrow"
            ],
            "content":"<div class=\"\"><div> <span>Samantha picks up the phone and calls your house. Your sister Chloe answers.<br>\r\n\"Hi Chloe\" she says \"You know that great bullying brother of yours, you'll never guess what has happened to him.\"<br>\r\nAt this point, her voice becomes quieter as she explains to Chloe about the events that took place in the park, and afterwards. You do not hear Chloe giggling on the other end of the phone, or the warm words of praise she is giving to Samantha. She tells Samantha that she wishes she could have been there.<br>\r\n<br>\r\n\"Why don't you come around?\" Samantha asks her \"bring your camera\"<br>\r\n\"Chloe states that she would love to come around and see her brother turned into a seat cushion, and asks your mother if it is ok to visit her friend, without pointing out that you are there too. For now that will be their own little secret.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1197781200,
            "id":476324,
            "title":"She calls your sister Chloe and invites her over"
        },
        "131121112111121":{
            "choices":[
                "Samantha continues her babysitting duties",
                "Chloe asks to borrow you for a while"
            ],
            "content":"<div class=\"\"><div> <span>10 minutes later, the doorbell rings and Samantha gets up to answer it.<br>\r\nShe unlocks and opens the door. Seeing Chloe standing outside, she invites her in then closes and locks the door again.<br>\r\n<br>\r\n\"So where is he?\" Chloe asks<br>\r\nSamantha lifts the back of her skirt. Chloe glances at Samantha's panties as she reaches inside and pulls you out of your familiar place against her backside.<br>\r\n\"Here is your brother\" Samantha says \"I must say that I have enjoyed sitting on him, and am quite happy to put him back there and continue to sit on him, as long as you don't object. I have been telling him that he is a baby, and that I am babysitting him.\"<br>\r\n<br>\r\nYou realise that you were right about how you would feel. Once you are released from Samantha's knickers, you find yourself struggling in her hand, trying to get back there. \"Please Samantha\" you beg of her \"Please will you put me back in your knickers and sit on me, or at the very least please will you continue to sit on me.\"<br>\r\n<br>\r\n\"You see\" Samantha grins \"He even wants to be sat upon, how can I refuse such an offer?   And he does make such a comfortable and relaxing seat.\"<br>\r\n</span></div></div>",
            "created":1197781200,
            "id":476325,
            "title":"Chloe turns up"
        },
        "1311211121111212":{
            "choices":[
                "They go back into the sitting room",
                "Chloe does try to escape with her brother"
            ],
            "content":"<div class=\"\"><div> <span>\"Can I borrow him?\" Chloe asks, \"He is my brother after all, please Samantha\"<br>\r\n\"You aren't going to let him go, are you?\" Samantha asks \"suddenly protective of her right to make sure you suffer\"<br>\r\n\"Of course not\" Chloe replies \"I would like to have some fun with him myself, that's all, if you don't object of course\"<br>\r\n\"I know Chloe, I'm Sorry\" Samantha says \"I wouldn't have invited you over if I couldn't trust you, after all. He does deserve what has happened to him\"<br>\r\n\"I know\" Chloe grins \"Lets go back into your sitting room and have some fun with this shrunken brother of mine\"</span></div></div>",
            "created":1197781200,
            "id":476327,
            "title":"Chloe asks to borrow you for a while"
        },
        "13112111211112121":{
            "choices":[
                "Chloe decides to sit on her brother",
                "Chloe does something else"
            ],
            "content":"<div class=\"\"><div> <span>As the two friends walk back into the sitting room, Chloe holding on firmly towards her brother. Samantha once again takes her favourite chair, and invites Chloe to take the chair next to her.<br>\r\n<br>\r\n\"So, what are you going to do to him?\" Samantha asks<br>\r\n\"I know exactly what I am going to do to him\" Chloe replies</span></div></div>",
            "created":1197781200,
            "id":476328,
            "title":"They go back into the sitting room"
        },
        "131121112111121211":{
            "choices":[
                "Chloe drops you into her knickers before sitting down",
                "Chloe drops you onto the chair, then sits on you"
            ],
            "content":"<div class=\"\"><div> <span>\"You tell me that Kyle is a comfortable seat\" Chloe announces, I think I would like to discover what you meant. The idea of sitting on that worthless sibling of mine really appeals to me right now.\"<br>\r\n<br>\r\nSamantha nods and tells Chloe that she won't be disappointed<br>\r\n<br>\r\nChloe is wearing a pale cream dress, and her dark brown hair cascades over her shoulders. Chloe is holding you tightly in her hand as she walks towards the chair she has been offered. You couldn't escape right now if you wanted to, although you have no intention of escaping, not when you know you are going to be sat upon again, this time by your own sister.  Besides, all the time you have spent under Samantha has made you want to be sat upon once more, even you know how painful it will me.<br>\r\n<br>\r\nSo are you going to stuff him in your knickers like I did, or are you just going to drop him on the chair and sit on him?\" Samantha asks </span></div></div>",
            "created":1197781200,
            "id":476331,
            "title":"Chloe decides to sit on her brother"
        },
        "1311211121111212111":{
            "choices":[
                "The girls settle down and watch some more TV",
                "Samantha picks up the phone and orders a takeaway meal"
            ],
            "content":"<div class=\"\"><div> <span>Chloe lifts up the back of her dress and pulls her knickers forward. Lowering you, she drops you into the inside of her knickers then lets them snap shut. You again find yourself trapped inside a girl's panties, Samantha takes a picture of you trapped in Chloe's panties beofre darkness falls once more as she lets go of the back of her dress. You are resting against Chloe's left butt cheek.<br>\r\n<br>\r\nSamantha uses the camera to take a another picture of Chloe's backside in which you are trapped, and the shapeof your body is visible.<br>\r\n<br>\r\n\"Ok brother, it appears that I am going to be your babysitter for a while\" she says as she starts to sit down \"I hope you enjoy being sat upon by me as much as you apparently love being under Samantha.<br>\r\n<br>\r\nAs Chloe's backside makes contact with the chair, you feel the now welcome pressure of a faminine butt sitting on you, and the resulting, welcoming pain of being squashed beneath a girl's rear end.<br>\r\n<br>\r\nThis time, the girl is your own sister Chloe, and the pressure and the pain of being sat upon is even more intense. Chloe is, after all, slightly older than Samantha.<br>\r\n<br>\r\nShe lets out a contented sigh, and tells Samantha that she is right, you are an extremely comfortable seat, and you should spend a long time beneath her. Your sister his become your sitter. </span></div></div>",
            "created":1197781200,
            "id":476336,
            "title":"Your sister becomes your sitter"
        },
        "13112111211112121111":{
            "choices":[
                "She orders a takeaway dinner",
                "She invites more people round to see you"
            ],
            "content":"<div class=\"\"><div> <span>You are trapped in your own sisters panties, concealed by her dress and covered by her left but cheek as she sits on you. Chloe, is quite content to leave you there for the moment too, she hasn't moved or spoken to you since she first sat on you.<br>\r\n<br>\r\nSamantha decides to put the telly back on, and finds another hour-long programme that is about to start. They both relax, chatting amongst themselves whilst watching the TV.<br>\r\n<br>\r\nSamantha asks if Chloe is letting you breathe under there. She replies that she can feel your ear pressed against her butt cheek, so your head is turned to one side, leaving your airway clear. Yes you can breathe, although every breath will be pained, and tiring, with her backside constricting your stomach. That satisfies Samantha. As long as you are not being smothered, that is enough for her, and Chloe has no problem with your situation either.<br>\r\n<br>\r\nSamantha recalls to Chloe the story she told you earlier, about the bullying boy, and the events of the day. Samantha had given a brief description over the telephone, but Chloe found the bigger account to be much more graphic, detailed and enjoyable to hear.<br>\r\n<br>\r\nWhen the next pgoramme finishes, Samantha picks up the phone again.</span></div></div>",
            "created":1197867600,
            "id":476636,
            "title":"The girls settle down and watch some more TV"
        },
        "131121112111121211111":{
            "choices":[
                "Chloe apologises and says she has to go home now",
                "Chloe would be happy to stay for the night"
            ],
            "content":"<div class=\"\"><div> <span>Samantha tells Chloe that she is going to order a chinese takeaway for both of them, and asks what Chloe would like to eat. Chloe knows the takeaway and does not need to see a menu. She orders a sweet and sour dish, whilst Samantha plumps for the special curry. They even order a children's portion of the curry for you.<br>\r\n<br>\r\n\"Well, we are his babysitters\" Chloe points out \"even though I am doing most of the sitting at the moment, we are sharing the role. One of the roles of a babysitter is to feed the small person in your care. No point letting him starve, is there?\"<br>\r\n<br>\r\nHalf an hour later there is a knock on the front door. Chloe answers, collects and pays for the meal, then goes into the kitchen to get plates, knives and forks, as well as a spoon for your meal.<br>\r\n<br>\r\nPresently she returns, and hands Chloe her dinner, whilst keeping her own for herself. She puts yours on a table, saying you will be fed when they have finished their own. They both eat their meals on their laps, with you still trapped inside Chloe's knickers.<br>\r\n<br>\r\nWhen they have finished, they put their plates down, and Chloe says it is time to feed you. She stands up, lifts you out of her knickers, and sits back down - this time with her legs parted slightly. She holds you against the front of her dress, lowering her hand until your legs and groin drop into the gap between her own legs. Chloe then pulls you backwards, towards her panties and presses her legs together, trapping your legs between her thighs. She tells you that she can do a lot of damage to your shrunken body with her thighs, and advises you not to struggle too much whilst she is feeding you.<br>\r\n<br>\r\nChloe then places your plate of food on her lap and spoon feeds your meal to you. At your size you find the child's portion is more than sufficient to fill your tiny stomach. After the meal, Samantha makes you all a hot drink, then whilst Samantha takes the dishes to the kitchen to wash them, Chloe relaxes for a moment, to let her meal go down, and yours too. She doesn't want you to be sick after all.<br>\r\n<br>\r\nSamantha says that Chloe is welcome to stay for the night and continue to assist with the job of babysitting you.<br>\r\n</span></div></div>",
            "created":1197867600,
            "id":476639,
            "title":"The chinese takeaway"
        },
        "1311211121111212111112":{
            "choices":[
                "Samantha wins the toss",
                "Chloe wins the coin toss"
            ],
            "content":"<div class=\"\"><div> <span>\"I'd love to stay\" Chloe says \"I am having so much fun in the company of my best friend whilst we babysit my own dear brother. I have no intention of leaving now - although you had better clear it with my mum first. No need to give her too much detail though, not right now anyway.\"<br>\r\n<br>\r\nSamantha calls you house and speaks to your mother. She asks if Chloe can stay the night. Your mother says that will be fine. \"It's settled\" Samantha announces \"You can stay. Now which of us should take care of Kyle?\"<br>\r\n<br>\r\n\"The way I see it\" Chloe says \"We may find it hard to decide amongst ourselves who gets him right now, lets toss a coin. She takes a coin. Samantha takes a coin out of her pocket, and tosses it. Chloe calls Heads.</span></div></div>",
            "created":1197867600,
            "id":476641,
            "title":"Chloe would be happy to stay for the night"
        },
        "13112111211112121111121":{
            "author_id":"bulletpack",
            "author_name":"bbbbb",
            "choices":[
                "\"Nah, just have him for yourself\"",
                "\"Well what kind of fun?\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oh sweet, I guess I get to take of your wittle brother\" She smiles and picks you up. Samantha looks at Chloe. \"Or we could have fun with him together\" Samantha grins. Chloe then smiles<br>\r\nAnd says:</span></div></span></div>",
            "created":1313557200,
            "id":1170022,
            "title":"Samantha wins the toss"
        },
        "13112111211112121111122":{
            "choices":[
                "Chloe will continue \"babysitting\" you",
                "Chloe decides to do something else with you"
            ],
            "content":"<div class=\"\"><div> <span>Your sister Chloe holds you in her hands \"You're mine, again\" she says delightedly. Now what shall I do with you. Should I simply continue to sit on you for the rest of the night, or should I have some more fun with you?<br>\r\n<br>\r\nYou try to speak, but Chloe covers your mouth with a couple of fingers. \"The decision is not yours\" she tells you \"I am in charge of you, so I decide, and I have reached a decision.\"</span></div></div>",
            "created":1197867600,
            "id":476642,
            "title":"Chloe wins the coin toss"
        },
        "131121112111121211111221":{
            "choices":[
                "You find yourself pleading to be sat upon by Chloe again",
                "You refuse to beg, you will not tell her what she wants to hear"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I am here to babysit you this evening\" Chloe says \"so I will resume my role as your babysitter. Besides, sitting on you feels so delightful, I am sure that even though you were born first, you came into the world for the sole purpose of providing your younger sister with a place to rest her backside.\"<br>\r\n<br>\r\n\"Even if that wasn't your reason for living from the moment you were born, it is certainly your purpose right now, you are about to resume your place beneath me.\"<br>\r\n<br>\r\nFirst, dear brother, I want you to tell me that you love being babysat by me, I want you to tell me that you adore and revere by backside, and that you want nothing more than feel it pressing down upon you, covering you, sitting on you. I want you to beg Kyle, convince me that your only desire in life is to be sat upon by your younger sister. <br>\r\n</span></div></div>",
            "created":1197867600,
            "id":476650,
            "title":"Chloe will continue \"babysitting\" you"
        },
        "1311211121111212111112211":{
            "choices":[
                "Chloe puts you back inside her panties",
                "Chloe drops you onto the chair, before sitting on you"
            ],
            "content":"<div class=\"\"><div> <span>You start to beg as Chloe asked, but she puts a finger to her lips.<br>\r\n<br>\r\n\"Have you got a video camera?\" Chloe asks Samantha \"I want a record of this plea that my brother is about to make.\"<br>\r\n<br>\r\n\"Of course\" Samantha grins \"I should have suggested it.\"<br>\r\n<br>\r\nShe takes a video camera out of one of the cupboards, and switches it on. \"Ready Kyle\" Samantha says, pointing it at you and pressing the record button \"What were you about to say to your sister?\"<br>\r\n<br>\r\n\"Please Chloe\" you say \"Please will you return me to my rightful place beneath you. Please will you rest your backside upon me once more, let it cover me, envelop me, own me. Please will you use me as your seat cushion for as long as possible It is my only desire, to be sat upon by my sister once more, to be her baby and be babysat by her. Please do this to me Chloe, Please I beg of you.\"<br>\r\n<br>\r\nYou are my horrible bullying brother, aren't you Kyle\" Chloe asks<br>\r\n\"Yes, I am Kyle, your horrible bullying brother,\"<br>\r\n<br>\r\n\"You are now a shrunken brother who needs to experience the suffering he caused\" she says next<br>\r\n\"Yes, I am a shrunken brother, yes I need to suffer\"<br>\r\n<br>\r\n\"You are smaller than me, smaller than a baby, and as a baby you need to be babysat don't you Kyle\"<br>\r\nYes, I am your baby, and I need a babysitter<br>\r\n<br>\r\n\"In your case, having a babysitter, means having someone sit on your tiny body doesn't it Kyle\"<br>\r\n\"Yes Chloe, having a babysitter means that I should be sat upon.\"<br>\r\n<br>\r\nYou want and need me to be your babysitter, don't you Kyle?\"<br>\r\n\"Yes, Chloe, I want and need you to be my babysitter, Please will you be my babysitter and sit on me.\"<br>\r\n<br>\r\n\"Ok Kyle\" Chloe says \"I'll do it, and your request has been recorded for posterity,\"<br>\r\n<br>\r\n\"That is the literal truth\" Samantha replies \"as he is about to be covered by your posterior.\" They both laugh at this.<br>\r\n<br>\r\n\"Now, the question is, do I put you back in my knickers or do I simply drop you onto the chair and sit on it\" Chloe asks \"Don't answer this one Kyle, this is my choice.\".  </span></div></div>",
            "created":1197867600,
            "id":476663,
            "title":"You find yourself pleading to be sat upon by Ch..."
        },
        "13112111211112121111122111":{
            "choices":[
                "Samantha turns off the camera",
                "Samantha rests the camera on a nearby table and keeps recording"
            ],
            "content":"<div class=\"\"><div> <span>\"Point the camera at my backside\" Chloe asks \"I am going to put him back in my panties before I sit on him again.\"<br>\r\n<br>\r\nSamantha moves behind Chloe's chair, which she is currently standing in front of, and points the camera towards your sisters backside, which is currently covered by the beautiful pale dress she is wearing.<br>\r\n<br>\r\nSamantha lowers her right hand, currently holding you towards her backside, and with her left hand she lifts up the back of her dress, revealing her panties. Chloe slowly lowers her panties enough to leave sufficient space to drop you inside, and reveals her buttocks once more. Chloe takes her time doing this, making sure to record your incarceration within her panties on film.<br>\r\n<br>\r\nBehind the camera Samantha even points out that these are the butt cheeks that will be covering you for the rest of the night, at your own request.<br>\r\n<br>\r\nChloe moves her hand towards her panties, and drops you into them, making sure that Chloe has recorded the moment of your descent. She then pulls her panties back up tightly, trapping you within, pressing you into her right butt-cheek. Samantha can see the shape of your body pressed against your sister's butt.<br>\r\n<br>\r\nChloe lowers the back of her dress once more, concealing you within, but not hiding the fact that you are recorded on film being imprisoned inside.<br>\r\n<br>\r\n\"OK. Time to resume the babysitting of my brother, at his own request\" Chloe grins, as she sits once more upon her chair and upon your body trapped in her panties.<br>\r\n<br>\r\nOnce more you feel the familiar warmth, feminine aroma and pressure of being sat upon by your younger sister. Chloe lifts her feet off the floor, and puts as much of her weight as possible on her right butt-cheek, upon you her brother, as she possibly can as she sits on you, and you resign yourself to the fact that you are going to spend the rest of the night as your sister's seat cushion.</span></div></div>",
            "created":1197867600,
            "id":476670,
            "title":"Chloe puts you back inside her panties - and sits"
        },
        "131121112111121211111221112":{
            "choices":[
                "In time the girls get tired and decide to go to bed",
                "The girls watch a film on the TV before going to bed"
            ],
            "content":"<div class=\"\"><div> <span>Samantha puts the camera on a table facing the chair in which your sister is currently sitting on you, and the other chair in which Samantha had been sitting. She does not stop recording. She announces that she is going to keep a record of the time your sister spends sitting on you this evening.<br>\r\n<br>\r\nSamantha then goes back to her own chair and sits down.<br>\r\n<br>\r\nChloe points out that it was a great idea, to record her brother's plea followed by the event itself where he was put inside his own sisters panties, at his own request, and deliberately sat upon. She said she wanted to make sure your brother admitted that he deserved and needed to be sat upon by her, that he wanted nothing more, That is why she asked him the questions at the end, She didn't just want him to beg to be sat upon, but to admit that his rightful place in life is beneath is sister's backside, and that by sitting on him she owns and controls him. He succeeded in this admirably. \"You belong to me now, dear brother\" she tells you.<br>\r\n<br>\r\n\"I want this video tape to be widely circulated, make lots of copies, and pass them on to anyone that this brother of mine has ever harmed. Show them that he belongs to me, that of his own free will he admitted that his only desire in life is to be my seat cushion, and and that I, as his kind and generous younger sister granted his request. He is never going to intimidate anyone again.\"<br>\r\n<br>\r\n\"So, do we let him go now?\" Samantha asked \"We have taken away everyting he was, he is harmless now.\"<br>\r\n<br>\r\n\"Not a bit of it\" Chloe replied \"I said I would spend the rest of the night sitting on him, and I meant it. I keep my promises. He may be harmless now but he is still ours, and I for one intend to enjoy owning him. He has seen kind and generous, but there is another side to me as well, and he will spend the rest of his life getting to know that aspect of my personality.\"<br>\r\n<br>\r\n\"And I seem to recall that I am meant to be his babysitter tonight.\"</span></div></div>",
            "created":1197867600,
            "id":476675,
            "title":"Samantha rests the camera on a nearby table and..."
        },
        "1311211121111212111112211121":{
            "choices":[
                "Chloe decides to store you in one of her jewellery boxes",
                "Samantha suggests that one of them should take care you"
            ],
            "content":"<div class=\"\"><div> <span>It is not much later, when Chloe lets out a sudden yawn, and decides that she is getting tired, and should go to bed. \"I'm really tried, I don't know about you, Samantha\" she says.<br>\r\n<br>\r\n\"Yes, we should go to bed\" Samantha replies \" We can have some more fun with your brother tomorrow.\"<br>\r\n<br>\r\nBoth girls leave the room and walk upstairs. Removing you from her panties, Chloe points out that you should be cleaned up a bit first. She takes off all your clothes and holds you above the toilet seat. It doesn't take you long to realise that your sister expects you to relieve yourself, and you realise that you desperately need to do as she suggests. A few moments later she flushes the toilet and takes you over to the sink<br>\r\n<br>\r\nChloe fills the bowl, then using the liquid soap dispenser and a flannel, she cleans your body thoroughly, and even washes your hair with a small drop of shampoo. She even manages to brush your teeth.<br>\r\n<br>\r\nAfter this, you are placed on the window sill and watch as both girls wash and prepare themselves for bed.<br>\r\n<br>\r\nChloe then carries you into her bedroom, where are two bunk beds set out. \"One of these bends used to belong to my sister\" Chloe says, \"but she has now got her own bedroom, and my parents have not got round to redecorating yet. Besides, I like to invite friends round to sleep with me. The top bunk is mine, you can sleep in the bottom one.\"<br>\r\n<br>\r\n\"That's fine\" Samantha replies \"but what do we do with your brother?\"</span></div></div>",
            "created":1198386000,
            "id":478841,
            "title":"In time the girls get tired and decide to go to..."
        },
        "13112111211112121111122111211":{
            "choices":[
                "You remain in the jewellery box until the next morning",
                "One of the girls decides you need their company tonight"
            ],
            "content":"<div class=\"\"><div> <span>\"I know where my brother can sleep\" Samantha grins<br>\r\n<br>\r\nShe goes over to her dressing table and opens one of her jewellery boxes. She then proceeds to empty the contents onto the dressing table.\"<br>\r\n<br>\r\n\"This box is padded, he should be comfortable\" Chloe points out<br>\r\n<br>\r\nShe then drops you into her jewellery box, with your head laid against one corner<br>\r\n<br>\r\n\"Sleep well, dear brother\" she says, before closing the lid.<br>\r\n<br>\r\nSamantha grins,when she notices that the jewellery box is particularly secure, as it is the kind that can be locked with a key. Chloe turns the key, then removes it from the jewellery box and drops it onto the chair in front of the dressing table. \"That'll keep him, until morning she grins.<br>\r\n<br>\r\nWith that, the girls both climb in to bed, leaving you trapped, and in total darkness, inside the locked jewellery box.</span></div></div>",
            "created":1198386000,
            "id":478848,
            "title":"Put to bed in a jewellery box"
        },
        "1311211121111212111112212":{
            "choices":[
                "Chloe squeezes you between her thighs again, and this time breaks your legs",
                "Chloe does something else to you"
            ],
            "content":"<div class=\"\"><div> <span>The look of disappointment on Chloe's face turns to one of annoyance.<br>\r\nShe tells you that if you do not beg, as she asks, the consequences will be even more painful for you.<br>\r\nWhen you still refuse to capitulate, she tells you that you have had your chance, and now she will make sure that you regret your choice.</span></div></div>",
            "created":1197867600,
            "id":476653,
            "title":"You refuse to beg, you will not tell her what s..."
        },
        "13112111211112121111122121":{
            "choices":[
                "You now beg to be sat upon by Chloe",
                "Chloe continues to break your shrunken body"
            ],
            "content":"<div class=\"\"><div> <span>Chloe ones again lowers your body to where it was between her legs, like she did before she fed you, and squeezes her thighs together, trapping you between them.<br>\r\n<br>\r\nThis time, she does not stop at merely trapping you between her thighs, she continues to apply more and more pressure, and you realise your younger sister is a very strong and muscular young woman.<br>\r\n<br>\r\nHer thighs go from merely holding you, to squeezing you firmly between them. At first your ribs start to ache, then as she squeezes tighter and tighter the pain increases Your flesh is pressed firmly into your sides, and the vice-like grip of her thighs applies more and more pressure to the bones of your legs until you are sure they are going to ever break or be smashed to pieces. <br>\r\n<br>\r\nWith one movement of her hand she twists your body from side to side, just a tiny fraction, and breaks both your legs and you scream in sudden agony.<br>\r\n<br>\r\nChloe tells you that you can either beg to be sat upon now, or she will continue to break your body.</span></div></div>",
            "created":1197867600,
            "id":476657,
            "title":"Chloe squeezes you between her thighs again, an..."
        },
        "131121112111121211111222":{
            "choices":[
                "Chloe inserts you into her pussy",
                "Chloe drops you into her cleavage"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'm getting bored with simply sitting on you\" Chloe says \"It is time I had a bit more fun, but where to put you, hmm.\"<br>\r\n<br>\r\n\"Of course\" she grins</span></div></span></div>",
            "created":1197867600,
            "id":476644,
            "title":"Chloe decides to do something else with you"
        },
        "1311211121111212111112221":{
            "choices":[
                "Chloe continues with her plan to insert you into her pussy",
                "Chloe has other ideas"
            ],
            "content":"<div class=\"\"><div> <span>Chloe expresses a desire to insert your body into herself, but Samantha has her reservations.<br>\r\n<br>\r\n\"He is too big\" she says. \"At 6 inches, I am not sure if he will fit. If he were a little smaller, maybe 2 inches, I am sure it would be possible to put him in there.<br>\r\n<br>\r\nChloe is disappointed, she really wanted to feel you squeezed inside her pussy.<br>\r\n<br>\r\n\"We could try something\" Samantha says \"Kyle shrunk when I expressed a strong desire to be bigger than he was. If you somehow wished that he was small enough to fit into your pussy... well, you have nothing to lose.\"<br>\r\n<br>\r\nChloe tried, but no matter how strong her desire she could not shrink you any further \"It's no good\" she states<br>\r\n<br>\r\n\"I'll try\" Samantha said \"Lets see if I express a desire for him to be small enough to fit inside me, he will be small enough for you too. I glanced at him, I made my wish and I closed my eyes for a couple of seconds. Here goes nothing.<br>\r\n<br>\r\nSamantha is amazed to discover that when she opens her eyes you have shrunk to a couple of inches in height.<br>\r\n<br>\r\n\"He should be the right size now\" she says, happily<br>\r\n<br>\r\nChloe grins</span></div></div>",
            "created":1197867600,
            "id":476679,
            "title":"not small enough, you need to shrink some more"
        },
        "13112111211112121111122212":{
            "author_id":"bulletpack",
            "author_name":"bbbbb",
            "choices":[
                "Chloe's plan",
                "Samanthas Idea"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Or.... I could give him more torture and stick him up my butthole\"  Chloe says in horror. That would be weird having your brother in my rear end, Samantha says, but do what you want haha, or I have a good idea!</span></div></span></div>",
            "created":1313470800,
            "id":1169700,
            "title":"Chloe has other ideas"
        },
        "131121112111121211111222121":{
            "author_id":"bulletpack",
            "author_name":"bbbbb",
            "choices":[
                "I cant wait for you to squirm in my Butt :)",
                "Before I shove you in my Butt...."
            ],
            "content":"<div class=\"\"><div> <span>Before considering what Samantha's idea was, Chloe started taking off her pants. \"Or I guess we'll stick him up your booty\" Samantha says as she giggle. \"Just to tell you Kyle, I havent takem a shower in about 2 days, so my butt is pretty smelly\", Chloe smiles. You look up to see Chloe taking her tight jeans off, revealing her Pink Ducky spotted Panties. She is standing up And takes off her jeans, making them fall right onto you. You saw only darkness and her jeans smelled like her. Samantha took her jeans off of you and you saw your sis butt naked standing. <br>\r\n<br>\r\nYou saw her smiling down an looking at you, also getting a glimpse of her tight teen pussy. You also saw samantha sitting on the bed looking at you. \"Hmm......\" you hear her say</span></div></div>",
            "created":1313470800,
            "id":1169712,
            "title":"Chloe's plan"
        },
        "131121112111121211111222122":{
            "author_id":"bulletpack",
            "author_name":"bbbbb",
            "choices":[
                "Yoga Pants",
                "Soffe Shorts"
            ],
            "content":"<div class=\"\"><div> <span>\"Whats your idea?\" Chloe says. Chloe is sitting on Samanthas bed in criss cross applesauce style, you are pushed agianst Chloe's crotch against her tight warm jeans, giving of a small aroma and a small moan from Chloe. Samantha looks down and notices what happened and giggled.<br>\r\n<br>\r\nSo anyways I could put on some Yoga pants or Soffe shorts and press him against my butt, so he can feel how warm my butt is and be forced to smell it. And im feeling weird so I might let out a toot. <br>\r\n<br>\r\nChloe: that sounds great :)  Ill wait here and keep this guy against my happy spot while you put on your.....</span></div></div>",
            "created":1313470800,
            "id":1169704,
            "title":"Samanthas Idea"
        },
        "132":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "He puts you in his pants pocket.",
                "He puts you in his underwear."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you watch, a young boy sees you. He comes over and slowly reaches down to pick you up. He brings you up to his face. His breath smells like cinnamon.</span></div></span></div>",
            "created":1161061200,
            "id":353469,
            "title":"Little Boy"
        },
        "1321":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "The boy is reaching into the pocket for ether you or an object",
                "You climb out of the pocket",
                "Stay put. "
            ],
            "content":"<div class=\"\"><div> <span>The boys finger gripped you around the waist and life's you towards his face. He grins at you. In the distance you can hear someone calling out that it's time to leave. The boy turned his head to look and at the same time his hand lowered towards his pants pocket. You couldn't believe that you are being kidnapped by a young boy. His hand shoves you into his pocket and released you to tumble to the bottom. As the boy walked your constantly knocking against his leg. Also in his pocket is a piece of candy, toy soldier, a few coins, and a tissue. You feel as the mom picks up the boy and sits him in his seat, causing the pocket to tighten around you. Once the cat starts up you try and think of how your going to get away. </span></div></div>",
            "created":1513841400,
            "id":2430910,
            "title":"He puts you in his pants pocket."
        },
        "1322":{
            "choices":[
                "His dog: Rex",
                "His little brother: Jesse"
            ],
            "content":"<div class=\"\"><div> <span>Being that it was nice out the boy was only wearing shorts, the kind that had no pockets. Leaving the only place to hold Kyle in his underwear.  Kyle is dropped into his underwear and feels the boy start to run.  The movement of the causes Kyle to be slamed into the young kids cock.  After awile the boy stops and Kyle hears a conversation in which a older woman ask the kid, Joey if he was ready to go home.  Hearing the boy answer yes the boy starts noving a gain and after a while the boy must have got into a car for he was sitting but Kyle could still feel movement.  After about a time of fifteen minutes the car stopped and Joey went right into his room.  After shutting the door he turn around and gets Kyle out of his underwear.  <br>\r\n\"I hope you liked the ride home cause you will be traveling like that from this moment on\" Joey explained.  Without waiting for a reply Joey walkes to his bed and layes dowm on it.  \"I am going to keep you as a pet and I will not share you with anyone,\" Joey informs him.<br>\r\nJust at that secound the door turns and in walkes...</span></div></div>",
            "created":1165208400,
            "id":363374,
            "title":"bully get bullied"
        },
        "13221":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Rex about to sit on you",
                "Joey reaching for you",
                "Rex looking at you"
            ],
            "content":"<div class=\"\"><div> <span>In walks his dog. Joey sits up on his bed and looks at his dog with a wide grin. “Rex!” Joey yells the dog’s name. The dog looks super excited to see his master that he runs and jumps on the bed. Joey, with no time to prepare, loses his grip on you, as the dog pushes him over. You fly up in the air and land on the bed covers next to the duo. Thinking this is a good chance to escape you try running across the bed, but the two giants movements cause you to keep tumbling around. Getting up you try again only for a huge shadow to appear over you. Looking up you see...</span></div></div>",
            "created":1538988180,
            "id":2560835,
            "title":"His dog: Rex"
        },
        "13222":{
            "author_id":"rockyhorror",
            "author_name":"RockyHorror",
            "choices":[
                "Hide you?",
                "Give you to Jesse?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In waddles 2 year old Jesse. Jesse is a very mischenious toddler and loves new toys. That is why Joey is hesitant on letting Jesse see you. Jesse crawls closer to his big brother and his new little toy. Does Joey...</span></div></span></div>",
            "created":1300078800,
            "id":1070387,
            "title":"His baby brother: Jesse"
        },
        "132221":{
            "author_id":"rockyhorror",
            "author_name":"RockyHorror",
            "choices":[
                "In his underwear?",
                "In his pocket?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No\" Joey thought. \"This is my toy, he's not going to touch it!\" With that Joey hides you...</span></div></span></div>",
            "created":1300078800,
            "id":1070389,
            "title":"Hide you?"
        },
        "1322211":{
            "choices":[
                "taped to chair...",
                "taped to back of underwears..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>joey saw his baby brother trying to get his new toy but he didn't get the toy but he put the toy in his under wears so his little brother didn't get it</span></div></span></div>",
            "created":1354683600,
            "id":1482641,
            "title":"In his underwear?"
        },
        "132222":{
            "author_id":"rockyhorror",
            "author_name":"RockyHorror",
            "choices":[
                "In his mouth?",
                "In his diaper?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Alright, here Jesse.\" he says with a sigh. Jesse examines you for a minute and places you...</span></div></span></div>",
            "created":1300078800,
            "id":1070391,
            "title":"Give you to Jesse?"
        },
        "1322221":{
            "author_id":"dragonlordkai",
            "author_name":"Lunaru",
            "choices":[
                "somehow undigested",
                "digested"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jesse shoves you into his mouth and swallows. You slide down his throat and fall into his stomach. Outside Jesse rubs his belly as he was hungry before you satisfied his hunger</span></div></span></div>",
            "created":1308805200,
            "id":1132778,
            "title":"In his mouth?"
        },
        "13222212":{
            "author_id":"dragonlordkai",
            "author_name":"Lunaru",
            "choices":[
                "kyle reformed",
                "kyle survived but in alot of pain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Joey returns to get the bully back from jesse and asks him where Kyle went and Jesse burped telling joey that he ate Kyle. Joey couldnt help but to laugh as he heard Kyles screams of pain as he was digested by Jesse and soon jesse messed his diaper.</span></div></span></div>",
            "created":1319950800,
            "id":1214797,
            "title":"digested"
        },
        "1322222":{
            "choices":[
                "diaper change and stay with the boy under his butt...",
                "taped to high chair all the time..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>jesse put the toy his bother gave to him but he put it in the back of his diaper and then he sat down while his new toy was in there</span></div></span></div>",
            "created":1354683600,
            "id":1482643,
            "title":"In his diaper?"
        },
        "13222221":{
            "choices":[
                "baby farts",
                "went in the boy butt hole when he sat down"
            ],
            "content":"<div class=\"\"><div> <span>joey had to get a diaper change when his mom saw u she put u under the boys butt when she had to get a diaper from the car he asked her to put u in his buttcheeks until she got back with the diaper to put on the boy so he will have a clean diaper on for the day but u fall from under his butt when his mom lefted the boy up to put the diaper on and u fall in the middle where his butt will go so u had his whole body on u putting a lot of pressure on u when he sat down</span></div></div>",
            "created":1354770000,
            "id":1483108,
            "title":"diaper change and stay with the boy under his b..."
        },
        "13222222":{
            "choices":[
                "stayed taped to a booster seat",
                "car seat being taped"
            ],
            "content":"<div class=\"\"><div> <span>joey puts u on his baby brothers high he didn't want u to move so he taped u to the high so when his baby brother had to eat he sat in the high chair with u under him so u had to stay there for a long time cause jesse liked u there he wanted to tape u there for good and when he had to go to a booster seat he put u on there to sit on u when he was eating at the table...</span></div></div>",
            "created":1354770000,
            "id":1483107,
            "title":"taped to high chair all the time..."
        },
        "132222222":{
            "choices":[
                "taped to the outside of the diaper",
                "tapped to the in side of his diaper"
            ],
            "content":"<div class=\"\"><div> <span>joey's mother brought joey's car seat in so she put it in the car later and when joey saw his car seat he notice the comfy put where he will sit and it had gel for his butt and he put u there so when he rode in the car while he sat in his car seat he sat on u for the ride to go places</span></div></div>",
            "created":1374382800,
            "id":1631543,
            "title":"car seat being taped"
        },
        "134":{
            "author_id":"tinyastro",
            "author_name":"straker",
            "choices":[
                "He Takes You Home With Him",
                "You Get Away"
            ],
            "content":"<div class=\"\"><div> <span>Your straining your head back and you put your arm up and out as if trying toward off the great bulk that is now standing over you. Maybe close to two hundred feet tall is a blue pair of denims. The material looks thick and heavy. Way above the pants is an open white and blue stripped shirt that is covering a white tee-shirt. Beneath the part of the tee-shirt you can see is the curves to his pecs and slightly bulging stomach. A mount Rushmore size face peers down at you. You wonder if he sees you or just thinks your a toy so you try and remain still. Though you have grave doubts.<br>\r\n<br>\r\nWhen he stoops down you become frightened. A pressure of air engulfs you. The air is warm and filled with his scent. A slight body odor smell mixed with a little cologne. You can hear all that massive clothing shifting weight. You feel so small in comparison. The face that stares down at your with two big green eyes, is capped by a forest of curly light brown and golden hair. This round kind of boyish face seems friendly. A face before you would have beaten upon<br>\r\n<br>\r\nStill, you are so very tiny in comparison. The legs that jet out on either side of you several stories above are the size of city buses. This teen boy has a slight smile which sports his large front teeth. <br>\r\n<br>\r\nAs you keep staring up you become dizzy and fall backwards. You slowly turn over and get onto you hands and knees. You hear a deep rumbling voice, \"Oh man this is so cool.\"<br>\r\n<br>\r\nAs he turn around and look up you see two adult tree size width fingers coming for you. You scream. They clamp on to your right leg. <br>\r\n<br>\r\nYou are lifted up upside down and are naked what an indignity. Part of you would like to scream and pound the hell out of him as you have done others, but not when you are the size of a bug. Brought before his huge, clear green eyes you are turned around. A giant index finger touches your naked body. You squeak. You see his huge pupils moving away from you. <br>\r\n<br>\r\nFinding yourself lowering, you see you are being lowered into his shirt pocket as an index finger from another hand opens the lip. You are lowered into the deep pocket. There is movement as he stands up. Naked, you curl up in this young teens pocket. </span></div></div>",
            "created":1170392400,
            "id":378696,
            "title":"Found By The Teenager"
        },
        "1341":{
            "author_id":"tinyastro",
            "author_name":"straker",
            "choices":[
                "Night With Cody",
                "More Probbing"
            ],
            "content":"<div class=\"\"><div> <span>You grab on to a fold of thick warm material as your pocket world sways back and forth. You hear coming through the lining of the pocket, the teen's kettledrum sounding heart beats. And hear his explosive earth rendering footsteps. <br>\r\n<br>\r\nFrom outside of the pocket, your hear the distorted sounds of other giant people and giant cars. <br>\r\n<br>\r\nYou have always instilled fear into others. Made them feel small. Now you are small and clinging to the pocket of a teen as far as you can tell you don't know. <br>\r\n<br>\r\nGathering in courage, you look up past the opening to the shirt pocket. You see the bottom of the colossal face. You observe the large boulder size chin, the dark openings to the several feet wide and long nostrils. And way above is the curly light blond and brown hair that is bouncing around ontop of the giants head. <br>\r\n<br>\r\nIn time you hear the giant enterring through a door. You hear him say in a bellowing voice that makes you cover your ears, \"Hi mom.\" <br>\r\n<br>\r\nYour pocket world sways as he runs up the stairs to his bedroom no doubt. <br>\r\n<br>\r\nGiant fingers, to your great anxiety fish you out. The giant teen has you by the chest in-between his thumb and forefinger. You hope he is aware of the pressure he is exherting, for it would take nothing for him to squish you by accident.<br>\r\n<br>\r\nYou are placed on a large brown surface. Standing up you see several paperbacks that mock you. They mocky you cause they are the size of SUV's and reminds you how small you are. There are other giant items. Pens. large square floppys. A tower of a lamp. Your on his desk. <br>\r\n<br>\r\nThe surface shakes beneath you as he moves in closer to you. The giant bends over placing his hands on his knees. \"I'm Cody,\" says the earnest gigantic face that has that smile with the huge white glistening front teeth. The huge boyish face seems as you hav observed before seems friendly. You are still in shock over your size and find it hard to reply. Plus you don't know if its wise to reveal your name in case he has heard of you. \"Your so tiny,\" his voice rumbles as a giant index finger runs down your back.<br>\r\n<br>\r\nHe picks you up again. You squeak. He chuckles. In his huge palm and laid out on top of a four foot long muscle pad he examines you. His green eyes are very directed and centered. Your uncomfortable being naked as another guy probs your with his finger. He moves your arms. And gently moves your head from side to side. Meanwhile you start to sweat from the heat generated from his hand.<br>\r\n<br>\r\nA loud echoing voice fills the cavern of a room. Cody turns his head, \"Ok, be right down.\" You scream from the pain his voice is causing you. In a gentle voice Cody tells you, \"I have to eat now\" <br>\r\n<br>\r\nHis huge eyebrows wrinkle together in thought. \"I want to keep you with me.\" He picks you effortlessly up and up. He places you on top of his head. Though he works you into his very real forest, to you, of warm soft hair. When he stops, you are surrounded by the rope strand size hairs. There's a slight sweaty smell that engulfs you and warmth. You confess the warm strands of hair are comforting as they press and wrap around your nude body. Still, hard to believe your not in a strange forest but rather, in the hair of a giant teen.</span></div></div>",
            "created":1170392400,
            "id":378700,
            "title":"A Giant Teen Named Cody"
        },
        "13411":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "give him a hand job",
                "give him a blow job"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cody gets really horny after dinner, so he goes to his room, and tells you to...</span></div></span></div>",
            "created":1368766800,
            "id":1591734,
            "title":"Night With Cody"
        },
        "135":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about an animal finds him?</span></div></span></div>",
            "created":1170046800,
            "id":377689,
            "title":"Animal park"
        },
        "1351":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Wild animal ",
                "Someone's pet",
                "Your own pet"
            ],
            "content":"<div class=\"\"><div> <span>Your trying to figure out what to do when a shadow is cast over you. You freeze up not really wanting to look, but you lift your gaze upwards to see what's causing the shadow. At the sight of the huge animal, you try and figure out what to do. It's had to see what it is but yours eye start to adjust and you can see it better, but it's not helping with your fear. The animal looks to be .... </span></div></div>",
            "created":1513832400,
            "id":2430897,
            "title":"yes"
        },
        "1352":{
            "author_id":"orr4eva",
            "author_name":"4eva",
            "choices":[
                "Get her attention.",
                "Decides against it."
            ],
            "content":"<div class=\"\"><div> <span>Kyle's body is shaking from a mixture of exposure and fear as he is naked on the ground. He moves from his clothing realizing that even a toddler could crush him. Many of the individuals at the playground have been victim to his pranks and bullying and he does not doubt that they would take the chance to stomp on him with their massive feet and spit on his mangled corpse. He needs to make it home somehow and get help from his mommy as he feels his tough guy act disappearing and reverting to being what he always has been, a punk little boy with a big emphasis on little now. His house is miles away and first he will have to escape the playground without getting accidently squished or caught.<br>\r\n<br>\r\nThe tiny boy steps away from his clothing and walks by blades of grass that are the size of small trees, some three times his height but because it is the playground, the grass is not too dense allowing him to see the titanic children playing in the distance. The sandy soil shakes from the commotion and constant footsteps like a constant tremor. Along with the sounds of gigantic humans, he can also hear clicking sounds of rasping from the many bugs inhabiting the sparse forests. He cannot help but shudder at the thought of cockroaches the size of beds, ants the size of cats and some bugs that are his size or even bigger! Not to mention other animals that he is now an easy meal for, like birds, mammals and lizards!<br>\r\n<br>\r\nKyle is continuing to walk when sounds of sickening snapping erupts in the distance. He looks back and shrieks as he sees two teenage girls both almost two hundred feet tall casually walking through the park. One is blonde wearing jeans and a pink shirt, the other is brown haired wearing gray gym shorts and a white tank top. Both are barefoot as they enjoy the cool grass under their feet while talking about school. They are completely unaware of the chaos below as they walk towards  the tiny Kyle! The snapping sounds are that of the grass being crushed and snapped into two under their bus-sized feet! At his miniscule size he can view every detail of the feet approaching, the chipping pink and blue nails, grass stains and splotches of dirt marking their wrinkly soles also littered with the remains of ants and beetles they have stepped on! Kyle does not want to share the same fate so he jumps out of the way as the two girls pass by, the brown haired girl's foot stepping right next to Kyle causing the ground to shake ferociously. A grass stalk snapped under her falls on top of Kyle's head which knocks him down. He gets up and wipes off blood from the gaping wound, truly humbled by being pummeled by a mere piece of grass underneath her foot. <br>\r\n<br>\r\nThe girls walk away, carelessly carrying on their conversation while Kyle uses the moment to catch his breath. The bleeding on his head subsides and he continues his walk. The sky is getting darker as the sun starts to set and the once mighty bully cannot help but feel even more afraid of his fate if it is dark and he gets lost or scarier animals approach. <br>\r\n<br>\r\nSuddenly the grounds again along with the sounds of snapping. BAM! A large brown sandal clad foot lands to the side of Kyle. He was so deep in thought that he did not notice a woman walking up to him. Looking up, Kyle sees the blonde hair woman is wearing red short gym shorts, a black shirt with an MMA logo on it. She had to be in her late 20s or early 30s and she is in extremely good shape, even a little muscular which made her look like some kind of goddess. Despite his strength as a successful bully to this point, he thinks at normal size she would give him a run for his money never the less the size of a borderline bug or action figure.<br>\r\n<br>\r\n\"C'mon kids, it's time to go!\" The woman calls out in a thundering, commanding voice. Even Kyle finds himself stiffening in respect of her. He is feeling pretty desperate at this point and knowing that this woman is an adult, maybe she will help him not knowing his reputation. <br>\r\n<br>\r\nKyle decides to..</span></div></div>",
            "created":1404795600,
            "id":1824484,
            "title":"Park Trek"
        },
        "14":{
            "author_id":"candy12345",
            "author_name":"Graff",
            "choices":[
                "try to flag her down ",
                "run ",
                "Disbelive that this is really happening "
            ],
            "content":"<div class=\"\"><div> <span>Kyle, was walking around the mall, with his sisters ,looking at cds and dvds.  he sees a cd on the floor and picks it up , it says open me , Kyle thinks ok,  free stuff as he opens it , a burst of light hits him and in just seconds he sees he has shunk down to the size of a marble  only 2 in in fact,  ,kyle thinks this didnt just happen , but he soon sees giant feet in sneakers walking near him , the sneakers are the size of buses, he sees chloe walking by him not that close for any danger but he feels the ground shake a bit he hears jasmine asking where i went , jasmine  has jessica in a baby stroller and u see her push it around the corner in your  path </span></div></div>",
            "created":1276491600,
            "id":899445,
            "title":"Shrinks at the mall."
        },
        "15":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "A young girl spots you.",
                "A young boy spots you.",
                "A female teen spots you.",
                "A male teen spots you.",
                "Someone else spots you."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were strolling in the park when you faint behind a tree. When you wake up, everything is huge. To your calculations, you are about baby-sized. You plan what to do when.</span></div></span></div>",
            "created":1154494800,
            "id":336734,
            "title":"Baby Time"
        },
        "151":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Jasmine (16 year's old)",
                "Kelly (8 year old)",
                "Chole (13 year old)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look up and see a girl but not just any girl it's one of you'r sister's but which one_______</span></div></span></div>",
            "created":1218258000,
            "id":567915,
            "title":"A girl spots you."
        },
        "1511":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Kyle?",
                "a baby"
            ],
            "content":"<div class=\"\"><div> <span>As you look up you see you'r sister Jasmine pushing you'r two year old sister Jessica in a two baby stroller and holding hands with your 8 year old sister Kelly and on the other side of the stroller is your 13 year old sister Chloe who had just stopped Talking on her cell phone then you think to your self they must be out on a family outing they probably told you but of course you said no. Then all of a sudden Jasmine see's something moving in your clothes . Chloe go see what that is Said Jasmine. OK said Chloe. When she saw you she said__________.</span></div></div>",
            "created":1218344400,
            "id":751087,
            "title":"Jasmine (16 year's old)"
        },
        "155":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a couple?</span></div></span></div>",
            "created":1170046800,
            "id":377690,
            "title":"Couple find a baby you"
        },
        "1551":{
            "choices":[
                "Same sex",
                "different"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it a same sax couple or not?</span></div></span></div>",
            "created":1170046800,
            "id":377691,
            "title":"Hetro or Homo"
        },
        "15511":{
            "choices":[
                "both are twenty year old guys",
                "The couple is a twenty-three year old females"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are they both males or both females?</span></div></span></div>",
            "created":1170046800,
            "id":377692,
            "title":"Male or Female"
        },
        "1552":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Yes, one of the younger two",
                "Yes, one of the older two",
                "no, someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you found by one of your sisters?</span></div></span></div>",
            "created":1297659600,
            "id":1054235,
            "title":"Sister's payback"
        },
        "15521":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Jessica",
                "Kelly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which sister?</span></div></span></div>",
            "created":1297659600,
            "id":1054237,
            "title":"Younger sister's revenge"
        },
        "155211":{
            "author_id":"dragonlordkai",
            "author_name":"Lunaru",
            "choices":[
                "you reform in her new diaper",
                "you reform in front of her"
            ],
            "content":"<div class=\"\"><div> <span>as jessica remembers that you had bullied her her belly rumbled and she found how she was gonna get her revenge. she grabs you and shoves you into her mouth, tilts her head back and swallows. you scream as you slide down your baby sister's throat and when you land in her stomach she digests you soon after. later on she messes her diaper and one of her sisters changes her.</span></div></div>",
            "created":1320037200,
            "id":1215421,
            "title":"Jessica"
        },
        "1552111":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "She looks in her diaper to find what’s tickling her",
                "She uses her diaper",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>It’s dark we’re ever you are, as you open your eyes, and try to remember what happened. Like lightning your memories returned. Jessica had grabbed you and shoved you into her mouth and swallowed you whole. You remember the tight confines of her throat squeezing and pushing you downwards as you screamed. You also remember the long drop into her stomach and trying to stay afloat in the liquid that started to burn and bubble around you. The pain as it ate away at your body till you passed out. <br>\r\n<br>\r\nYou don’t feel in pain or like any of that happened. Maybe it was all a dream, a bad nightmare, but still a dream. Once your eyes adjusted to the surroundings, and the very little light coming in, you tried to figure out where you are. The ground and walls seem to be padded, but the ceiling seems to be smooth and rubbery. Suddenly the ground jolts like an earthquake and your flung into the padded wall. The quake seems to get worse as your now being thrown around like a rag doll. Then just as suddenly as it started it stopped. While you laid there trying to stop the dizzy feeling your having, you feel a drop, like in an elevator, and soon your being pressed between the ceiling and the wall. What ever this is, you try and wiggle free, until you hear a loud giggling, but that can’t be right. You try pressing on the rubbery wall in front of you and the giggle starts again. It’s a familiar giggle too. No it can’t be, but that giggle is familiar, it sounds like Jessica. Then with all this padding, there is only one place you could be, in her diaper! As you panic and wiggle around, Jessica giggles again. Next thing you know....</span></div></div>",
            "created":1519886880,
            "id":2459166,
            "title":"you reform in her new diaper"
        },
        "1552112":{
            "author_id":"adam.e",
            "author_name":"AdamE34",
            "choices":[
                "Down the hatch!",
                "Under her diaper/foot/pussy "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You magically appear in front of Jessica who is planning ways to use you...<br>\r\nShe quickly grabs you giggling at you. Bugwy gonna die again! And again!<br>\r\n<br>\r\nHow does she kill you and do you reform?</span></div></span></div>",
            "created":1421989200,
            "id":1921839,
            "title":"you reform in front of her"
        },
        "15521121":{
            "author_id":"mixedblues88",
            "author_name":"Mixedblues88",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After entering her stomach for the second time something seems a bit different. Jessica completely digests you and messes her diaper. Hehe buggy not coming back this time. He is now my stinky diaper forever.</span></div></span></div>",
            "created":1515587940,
            "id":2439086,
            "title":"Down the hatch!"
        },
        "15521122":{
            "author_id":"adam.e",
            "author_name":"AdamE34",
            "choices":[
                "Shit filled diaper ",
                "Other (foot or pussy)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Under her? </span></div></span></div>",
            "created":1425445200,
            "id":1943662,
            "title":"Under her diaper/foot/pussy "
        },
        "155211222":{
            "author_id":"adam.e",
            "author_name":"AdamE34",
            "choices":[
                "*squishy* her foot comes down on you",
                "*pulls she diaper aside* she sits on you with her pussy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does giant baby Jessica squish you like a bug under foot?<br>\r\nOr Does she learn more about her pussy by inserting you in?</span></div></span></div>",
            "created":1425445200,
            "id":1943665,
            "title":"Other (foot or pussy)"
        },
        "15522":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Chloe",
                "Jasmine"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which sister?</span></div></span></div>",
            "created":1297659600,
            "id":1054238,
            "title":"Older sister's revenge"
        }
    },
    "info":{
        "author_id":"davidthegrate",
        "author_name":"davidthegrate",
        "brief_description":"When Kyle the bully shrinks his victims have the upper hand...",
        "created":1139022360,
        "description":"<td align=\"left\" class=\"norm\">Kyle is a six foot two 17 year old bully and he has no friends.  Why would he want friends?  Other people are scum in his eyes and he's quite content with making their lives living hell.  Then one day he shrinks down.  What will happen to him?<br>\r\n<br>\r\nHe has four sisters:<br>\r\nJessica - 2 years old<br>\r\nJasmine - 16 years old<br>\r\nKelly - 8 years old<br>\r\nChloe - 13 years old <br>\r\n<br>\r\nThere are only a few rules that I need everyone to follow.  First of all, he shrinks to either two inches, or baby sized.  You can make him grow from two inches but don't grow him past baby size.  Secondly, don't ever end the story.  If I feel that the story needs to end I will end it myself so don't kill him.<br>\r\n<br>\r\nEverything else is ok so get cracking people!</td>",
        "id":1066680,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594298700,
        "modified":1594298700,
        "pretty_title":"Kyle gets Shrunk"
    }
}