{
    "chapters":{
        "1":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Olivia Feltzer",
                "Mary Motsky",
                "Cathy Stephens and Florence Morrisson",
                "Candy Burt",
                "Billie Dolph"
            ],
            "content":"<div class=\"\"><div> <span>The previous day had been a good day for Marty Zimp. He had done his final exam before anybody else so that it could be shipped to the Regional Superintendent so as to show their finest student and he had gotten an A+ as the result.<br>\r\n<br>\r\nMarty Zimp attended Westbrooke Academy, a private high school which was one of the country's most prestigious. It was a boarding school and even though most people detested the uniforms they were forced to wear, Marty quite liked his. Sure, Marty's parents lived like only ten blocks away from the school but Marty still preferred to stay at the school dorms.<br>\r\n<br>\r\nFurthermore, the Principal, Mr. Fiddler, had given Marty a very special task. In order to avoid the answer sheet to the final exam from being stolen from his office like the previous year, he gave it to Marty to store it at his parents' house. Since he had already done the test there was no danger of him cheating and since he was an honest kid, they believed he wouldn't give it to anybody else.<br>\r\n<br>\r\nNow it was after class and Marty was almost finished with putting his supplies into his locker. He closed the locker and went up to a nearby classroom. It was the Math class which Marty had promised his teacher to lock up. Before he could close the door, he felt somebody tap his shoulder.<br>\r\n<br>\r\nHe turned around and saw...</span></div></div>",
            "created":1288069200,
            "id":982059,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "He remains silent.",
                "He refuses.",
                "He attempts to escape."
            ],
            "content":"<div class=\"\"><div> <span>...Olivia Feltzer. She stood there in her school uniform, which was a tight, white shirt and a short, knee-length cardigan blue and cyan skirt.<br>\r\n<br>\r\n\"Hey Marty.\" She said.<br>\r\n<br>\r\n\"Hey Olivia, how are you?\" Marty asked awkwardly.<br>\r\n<br>\r\n\"Oh, I'm fine.\" She answered. \"And I hear you're OK too, since you did well in your advanced final exam yesterday.\" <br>\r\n<br>\r\n\"Yeah.\" Marty replied.<br>\r\n<br>\r\nOlivia leaned a little closer to Marty and spoke on.<br>\r\n<br>\r\n\"Listen, I heard a little something else about you and the exams.\" She added. \"Some of the girls and I heard that the Principal may have given you the answer sheets to the final exam. Is that true?\"<br>\r\n<br>\r\nUpon hearing that Marty choked a little and began to stutter.<br>\r\n<br>\r\n\"Well...he...I...he...\"<br>\r\n<br>\r\n\"So he did, huh?\" She concluded from his nervous stuttering. <br>\r\n<br>\r\nAt that point, Olivia got really close to Marty, almost pressing against him.<br>\r\n<br>\r\n\"Look Marty...I really need to pass that test and I would do anything if you could help me.\"<br>\r\n<br>\r\nOlivia reached for her white, schoolgirl shirt and unbuttoned the top one, letting enough skin show so Marty could peer down and look at her cleavage. Olivia pushed forward and tried to press herself to Marty but the boy backed away and walked backwards into the classroom. She slyly closed the door behind herself and kept advancing. He talked while he walked.<br>\r\n<br>\r\n\"Listen Olivia, I know what you're trying to do here and I...\"<br>\r\n<br>\r\nMarty stopped talking when he felt his back press against something very soft. He turned his neck and saw that behind him stood April Torrington, Olivia's best friend, and that the soft thing his back was pressed against was April's DD-cup tits.<br>\r\n<br>\r\n\"Hey Marty...\" She said seductively.<br>\r\n<br>\r\n\"April...\"<br>\r\n<br>\r\nBefore he could go on, Marty felt another soft thing press against him, but this time against his chest. He looked forward and saw that Olivia had now pressed her breasts against him. Olivia reached for her skirt and lifted it up slightly so as to pull it above her crotch. She then pressed her thong-clad pussy to Marty's crotch while April did the same but against Marty's butt. Olivia reached her arms around Marty and groped April's ass under her skirt while April took Marty's hands and slid them under Olivia's skirt. She then pressed his hands to Olivia's ass and since she was wearing a small thong, he was squeezing her bare ass-cheek.<br>\r\n<br>\r\n\"Marty, looks like you're caught between a rack and a soft place.\" April teased, pressing her hooters harder against his back to make a point.<br>\r\n<br>\r\nSlowly Olivia and April began to rub their boobs against Marty's chest and back and their pussies against his crotch and butt while April made Marty grope Olivia's ass. Olivia leaned into his neck and licked, kissed and suckled it slightly before whispering into his ear and whispering.<br>\r\n<br>\r\n\"You see Marty, me and April really wanna pass this test. So if you just give them to us, we'll do anything for you.\" </span></div></div>",
            "created":1288155600,
            "id":982118,
            "title":"Caught Between a Rack and a Soft Place"
        },
        "111":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Fuck Olivia and April.",
                "Get a Strip Show.",
                "Lesbian Show."
            ],
            "content":"<div class=\"\"><div> <span>Marty remained silent. Since a situation like this had never presented itself to him before he did not know what to do and thus stayed quiet, in shock.<br>\r\n<br>\r\n\"Looks like he's a bit startled.\" Said April.<br>\r\n<br>\r\n\"Maybe we should give him a little more 'encouragement'...\" Said Olivia.<br>\r\n<br>\r\nThe girl took her hands off April's ass and then reached for the neckline of her white shirt. With a firm tug she ripped it off, revealing her tits encased behind a red silk bra. April's hands let go of Marty's, which still remained groping Olivia's ass, and then grabbed onto Marty's shirt and tore it off. Olivia then grabbed Marty's hands and slid them under her bra, making him squeeze her boobs. She then pressed herself against his chest again. <br>\r\n<br>\r\nMarty was going to speak when he felt April pull away from his back. Then he heard the sound of a shirt being pulled off and a latch unlatching. Suddenly, two big, soft, round, warm things pressed against his back. There he knew that April had pulled off her top and was squishing her naked tits against his back. Her nipples had hardened and he could feel the tiny peaks pressing against him.<br>\r\n<br>\r\nThen both girls groped each other's asses again.<br>\r\n<br>\r\n\"So Marty, will you tell us now or will we have to strip off every article of clothing and rub against you naked to get your attention?\" Asked Olivia. \"Or maybe you want to see us do something to each other? Huh?\"</span></div></div>",
            "created":1289278800,
            "id":990543,
            "title":"A Bit More Boob..."
        },
        "1112":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Fuck Olivia first.",
                "Fuck April first.",
                "Threesome."
            ],
            "content":"<div class=\"\"><div> <span>\"Girls please...I can't do this.\" Marty pleaded. \"I won't give you the answers.\"<br>\r\n<br>\r\n\"You say that now but maybe you'll change your mind after a little more...encouragement.\" April whispered in his ear.<br>\r\n<br>\r\nApril let go of Olivia's ass and proceeded to grab Marty's hands, which she slid out from under Olivia's bra and then placed on the blonde's ass. She then let go off Marty's hands and proceeded to reach for the front of Olivia's red silk bra. She undid the clasp at the front of the bra, letting it drop to the floor and revealing Olivia's large C-cup boobs to an astounded Marty. He squirmed and tried to get away, but Olivia pressed her bare tits against his chest, causing the soft flesh to mold against him and her erect nipples to rub against his, locking him in place.<br>\r\n<br>\r\nApril grabbed Marty's belt buckle from behind and undid it, subsequently pulling down his zipper and then pants, leaving him in his boxers.<br>\r\n<br>\r\nOlivia placed her hands on April's ass and then Marty began to hear and feel how Olivia pulled off April's skirt and also slid off her underwear. When Olivia was done, April pressed her middle against Marty's again and he felt the wetness and heat of April's pussy through the thin cloth of his boxers. Then April grabbed Marty's hands again and forced him to slide his fingers under the waistband of Olivia's thong. Marty attempted to resist but April managed to force him to pull down Olivia's silky red thong, dropping it to the floor. April undid the buckle of Olivia' skirt and dropped it to the floor, leaving her naked.<br>\r\n<br>\r\nMarty stood in shock, looking at the naked girl in front of him. Olivia pressed up against Marty once more, her large, soft, squishy melons against his chest and her hotm, nude pussy rubbing against his boxer covered erection. Behind him April did the same, pressing her DD-cup bazongas to his back and ehr pussy to his butt. Both girls groped each other's asses and then began to grind their pussies against Marty and rub their boobs against his body. Both naked girls leaned into him and began to kiss and suck on his neck.<br>\r\n<br>\r\n\"So, who do you wanna fuck first?\" Olivia asked.</span></div></div>",
            "created":1294030800,
            "id":1028552,
            "title":"Girl Sandwich"
        },
        "11121":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "They keep fucking him until he passes out.",
                "Another girl comes in and takes Marty away."
            ],
            "content":"<div class=\"\"><div> <span>When Marty did not respond to Olivia's question, the blonde bombshell took the matter into her own hands and shoved Marty down. Of course, since April was standing behind him, she fell as well and Marty landed on top of her, feeling her tits squashed against the back of his head back as he lay on them and the heat of her pussy on his lower back.<br>\r\n<br>\r\nApril locked Marty's legs together with hers and Olivia pulled down his boxers and then straddled him, her pussy rubbing against the side of his dick. She teased him briefly by rubbing her pussy against his shaft before grasping his dick and lining it up with the entrance of her lips.<br>\r\n<br>\r\nOlivia smiled and then slowly slid down on Marty's cock. He moaned as he felt the inside of a girl for the first time and the blonde proceeded to slowly go up and down on his shaft, riding his cock slowly at first but gradually picking up speed. He groaned in pleasure as the moisture of her pussy and the soft slick feeling of her inner walls stroked his cock as she went up and down.<br>\r\n<br>\r\nOlivia moaned at the sensation of being filled once again. She felt the pressure begin to build her stomach, meaning her orgasm was slowly building up. Marty began to groan a little too loud for Olivia's taste and fearing that somebody might hear, she leaned over him and shoved her right breast into his mouth. He began to suckle her boob as she continued to move her hips vertically to impale herself on his cock.<br>\r\n<br>\r\nShe continued to bounce up and down on his penis while he suckled her tit until he coldn't take it anymore and finally came inside of her. Olivia hadn't come yet, so as Marty rested his head back on she continued to ride his cock until she finally achieved climax.<br>\r\n<br>\r\nAfter cumming, it didn't end there. Olivia pulled Marty out of herself and then got up. Then April got up, bringing Marty up with her, she then turned him around and then leaned over a nearby desk, holding up her ass. Marty then felt a cloth be pressed on his chest. He looked down and saw it was Olivia's red strapless bra. Immediately he felt Olivia's soft, cushiony boobs on his back and then held the clip of a bra snapping on.<br>\r\n<br>\r\nMarty looked over his shoulder and saw that Olivia had locked herself and him together with her stretchy bra. She forced him forward and made him press his dick against April's ass.<br>\r\n<br>\r\n\"Girls, I don't think I can go again so fast. I'm tired.\" Marty complained.<br>\r\n<br>\r\n\"We know Marty.\" April said.<br>\r\n<br>\r\n\"That's the point. You see, we're going to keep fucking you over and over until you either pass out or give us the answers.\" Olivia said.<br>\r\n<br>\r\nThen Olivia grabbed Marty's dick and lined it up with April's pussy. She grabbed April's ass, lined-up her crotch with Marty's butt and after giving her best friend/fuck buddy a playful ass squeeze she thrust her hips forward making Marty slide his dick into her pussy.</span></div></div>",
            "created":1301634000,
            "id":1079858,
            "title":"Per-sex-uation"
        },
        "111211":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Marty wakes up in one of the girls' basements, tied to a chair.",
                "Marty wakes up in the girls' room, sandwiched between a naked April and Olivia."
            ],
            "content":"<div class=\"\"><div> <span>After Olivia thrust forward, Marty felt the warm wetness embrace his dick once more but this time even more powerfully since April's pussy was tighter than Olivia's. Both Marty and April moaned in unison when he penetrated her, but Marty kept his reluctance and tried to push himself away.<br>\r\n<br>\r\nSensing his attempts, April raised herself up slightly, grabbed Marty's hands and placed them below her tits. While she did this, Olivia made Marty pull out of her and when she made him enter her again, April slammed her boobs down on the table in pleasure, trapping Marty's hands under her tremendous rack.<br>\r\n<br>\r\nOlivia leaned against Marty, making him lean against April and then grabbed his hips. She proceeded to force him to thrust in and out of April's cunt over and over again until both him and April came. Quickly enough, Olivia unclasped her bra, releasing Marty and then got on her back on top of a table. April grabbed her bra and clipped it onto Marty and herself, joining them by the chest with her tits mashed against his back.<br>\r\n<br>\r\nApril moved Marty to Olivia and after lining up his dick with her pussy she made him thrust into Olivia. April made him fuck Olivia and as soon as they both climaxed, she released him and shoved him to the floor to straddle him and ride him. The girls took turns in forcing Marty to fuck the other until he finally passed out and buried his face between April's melons. Once he was out the two girls looked at each other wickedly.</span></div></div>",
            "created":1309928400,
            "id":1141982,
            "title":"Fuckfest"
        },
        "1112112":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "...Wearing a strap-on dildo.",
                "...Carrying a tray with whipped cream, molten chocolate and strawberries."
            ],
            "content":"<div class=\"\"><div> <span>As Marty slowly regained consciousness he could feel himself surrounded by warmth and softness. As his senses restarted, the sensations became more clear and he could finally realize where the feelings were coming from.<br>\r\n<br>\r\nBreasts.<br>\r\n<br>\r\nHis head was squished between two large pairs of breasts. He realized that he was lying on a bed and that whomever the breasts belonged to, they were wrapped around him as he could feel warm skin against practically every inch of his front and back. He also realized, much to his shock, that he was naked and so were they.<br>\r\n<br>\r\n\"Good morning, Marty.\" Two voices said in unison.<br>\r\n<br>\r\nThen Marty remembered. Olivia and April, along with the way they'd fucked him into unconsciousness.<br>\r\n<br>\r\nThe two girls slid down his body until they were at level with him and he was looking at Olivia's face an inch away from his.<br>\r\n<br>\r\n\"Where am I?\" Marty asked.<br>\r\n<br>\r\n\"In our room.\" Olivia answered. \"We couldn't just keep on fucking in a random classroom so we had to pick a more...private place.\"<br>\r\n<br>\r\n\"Fucking. OK girls, I won't...\"<br>\r\n<br>\r\n\"Oh, you will.\" April said from behind him. \"Not only that, but you'll be doing it whenever we say so. You'll also give us the final exam answers.\"<br>\r\n<br>\r\n\"No, I won't.\" Marty replied.<br>\r\n<br>\r\n\"Yes you will, because if not we will show the whole school the naked pictures we took of you while you were out cold.\" Olivia threatened.<br>\r\n<br>\r\nMarty wanted to counter, but found himself trapped. They had him.<br>\r\n<br>\r\n\"Now, I'm gonna get something fun we can play with.\" Olivia said, getting up. \"April, entertain him until I get back.\"<br>\r\n<br>\r\nApril sat up, dragging Marty along with her and after Olivia went into the girls' large walk-in closet, she pressed her large tits against Marty's back while she wrapped her arms around his front. She then grabbed his chin to hold his head in place while she whispered into his ear.<br>\r\n<br>\r\n\"Relax Marty. After all, you're gonna get to fuck the two hottest girls in the school over and over again. Enjoy it.\" She whispered.<br>\r\n<br>\r\nThen April stuck out her tongue and slipped it into Marty's ear. Marty tried to resist and move away but April held his head in place with her right hand while her exceptionally long tongue made it past the outside of the ear and began to snake it's way into the deeper part of his hearing canal until her tongue was fully inside his ear. The sloppy, wet muscle squirmed inside his ear as he groaned in discomfort and she snickered in enjoyment at his suffering. He could practically feel her tongue licking his eardrum and dampening the inside of his head. To further conflict Marty, April began to stroke his cock with her other hand and also began to rub her boobs against his back.<br>\r\n<br>\r\nApril sexually teased him and licked inside his ear for several minutes until Olivia re-emerged from the closet. April didn't release Marty but she did stop moving her tongue around the inside of his head so that Marty could focus and see Olivia had reappeared and she was...</span></div></div>",
            "created":1313470800,
            "id":1169115,
            "title":"Pleasure Slave"
        },
        "11121122":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "The next day, April or Olivia approaches Marty in the bathroom and fucks him.",
                "Marty gets approached by another girl."
            ],
            "content":"<div class=\"\"><div> <span>Olivia set down the tray she was carrying on the nightstand next to the bed. Marty saw that the tray had two cans of whipped cream, a bowl with strawberries and a bowl of molten chocolate on it.<br>\r\n<br>\r\n\"What's that?\" Marty asked.<br>\r\n<br>\r\n\"This is what we're going to use to get a little kinkier.\" Olivia answered while she picked up a can of whipped cream.<br>\r\n<br>\r\nThe blonde shook the can quickly and then sprayed a dash of the cream on her right nipple, giggling at the cool feeling of the cream while she did so.<br>\r\n<br>\r\n\"Now lick it off.\" She instructed.<br>\r\n<br>\r\n\"Now Olivia, I'm not...\"<br>\r\n<br>\r\n\"Lick the cream off my tit or we'll show people the pictures.\" Olivia threatened.<br>\r\n<br>\r\nMarty sighed and approached Olivia's chest. He stuck out his tongue and ran it over the tip of the girl's well-sized C-cup boob, picking up most the cream in one stroke and the rest in a second lap of his tongue, which made Olivia moan in delight. Not wasting any time, the blonde sprayed more whipped cream on her other breast and moved Marty's head towards it. Seeing that this dash of cream was much bigger, Marty instead took her boob into his mouth, suckling at her nipple while he lapped up the cream, making Olivia moan even more sensually.<br>\r\n<br>\r\n\"Oh Marty...\" April whispered sensually in Marty's ear.<br>\r\n<br>\r\nThe boy turned around and was faced with April's tits covered in whipped cream. She'd covered both her breasts whole and was squeezing them together with her hands to further rouse Marty's attention. She let go of her boobs and then put them on the back of Marty's head, bringing his head into her cream coated tits.<br>\r\n<br>\r\n\"Marty, my titties are so creamy and sticky. Can you please lick them clean?\" April asked teasingly.<br>\r\n<br>\r\nMarty pulled his face away from her creamy cleavage and after wiping off the cream that had been smeared on his face, he began to lick and suckle at April's rack. He kissed, licked and suckled at every part of her melons: the nipples, the cleavage, the tops, the undersides, every last part of her tits covered in whipped cream was licked clean.<br>\r\n<br>\r\nHe was suddenly spun ‘round and face with Olivia holding up a chocolate coated strawberry. She promptly popped into her mouth, leaving the bottom half outside and then kissed Marty. She made sure to hold the strawberry between his and her lips while she licked both the berry and Marty’s tongue. She then bit the strawberry in half, taking one half for herself and letting Marty eat the other half.<br>\r\n<br>\r\n“Like that?” She asked.<br>\r\n<br>\r\nMarty nodded.<br>\r\n<br>\r\n“Then you’ll love this.” She said as grabbed another strawberry.<br>\r\n<br>\r\nOlivia licked the tip of the fruit before sucking on it and then running it down her neck, between her breasts, across her flat tummy and finally against her pussy. Olivia moaned as she pushed the strawberry against her lips, pushing it in until it was completely inside her pussy.<br>\r\n<br>\r\n“Dig in.” She said, her face red from the sensation of the small fruit inside her cunt.<br>\r\n<br>\r\nMarty was about to say not when Olivia used her legs to pull him down to her. Once his face was looming above her pussy, she slammed her thighs closed like a vice on his face, keeping him in place with his mouth right above her lips.<br>\r\n<br>\r\n“Remember the pictures Marty…” She cooed.<br>\r\n<br>\r\nMarty sighed, closed his eyes and took a deep breath before sticking out his tongue and running it up and down Olivia’s pussy. The girl groaned lightly in approval while he kept licking until he finally ventured further and began to slide his tongue into her cunt. Olivia moaned as Marty’s tongue burrowed deeper into her pussy until he reached the strawberry shoved inside it; he hooked his tongue under the berry and began to drag it out but was stopped when Olivia placed her hands on his head.<br>\r\n<br>\r\n“You’re not pulling that out until you make me cum.” She said.<br>\r\n<br>\r\nMarty groaned and began to lick around inside Olivia once again. While he licked, she began to rub her clit, enjoying all the sensations. Finally, she came and Marty extracted the small fruit from inside her pussy with his tongue.<br>\r\n<br>\r\n“Now eat it.” She ordered.<br>\r\n<br>\r\nReluctantly, Marty bit the strawberry in half and then swallowed it.<br>\r\n<br>\r\n“Oh Marty…” April cooed.<br>\r\n<br>\r\nMarty turned around and was surprised to see that April was lying down on the bed and had turned her tits into a huge banana-split. The lower half of both her boobs was coated in molten chocolate, the upper halves were covered in whipped cream and the tips had strawberries on top of her nipples. To top it all off, she had a peeled banana stuffed between her boobs, stuck into the cream that filled her cleavage.<br>\r\n<br>\r\n“Eat it, please, and make sure to lick the two melons when you reach the bottom.” April ordered teasingly.<br>\r\n<br>\r\nMarty began on her left boob, eating the cherry on top and licking the cream off her nipple and areola, which made April giggle in excitement, turned on by the feeling of Marty’s warm tongue running over the cold whipped cream on top of her tit. While licking the chocolate off the base of her breast, Marty noticed Olivia was sensually devouring the dessert on April’s right jug.<br>\r\n<br>\r\nSoon, the desert on top of April’s tits was completely devoured and Olivia ate the banana, sensually sliding it back and a forth into her mouth while biting off small chunks and swallowing them.<br>\r\n<br>\r\nMarty slumped down on the bed, trying to catch a breath when April and Olivia curdled to either side of him and Olivia whispered into his ear.<br>\r\n<br>\r\n“From now on you’re our fuck toy. Whenever we tell you to fuck us, you’ll fuck us and whatever we tell you to do because…” Olivia said, while groping his dick. “…We own you. So now you’re just gonna lie down here and let us have our fun.”<br>\r\n<br>\r\nAnd with those words, Olivia licked around Marty’s ear before sliding her tongue inside his head. At the same time, both girls slid their tongues into Marty’s ears and Marty had to endure the sensation of both the wet, sloppy muscles wiggling inside his ears. Then, both girls took a hold of his dick with their left hands and begun to stroke it. As their tongues squirmed inside his head, they quickly stroked his dick until he came.<br>\r\n<br>\r\n“Get dressed and get out.” Olivia ordered as she pounced on top of April.<br>\r\n<br>\r\nMarty did as he was told and while he left the room, the last thing he saw before closing the door was April and Olivia making out while they began to scissor each other.</span></div></div>",
            "created":1321160400,
            "id":1222824,
            "title":"Titties & Cream"
        },
        "111211221":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "The next day, Olivia finds out about this and punishes Marty and April.",
                "The next day, April joins Marty in the shower again but with another girl too."
            ],
            "content":"<div class=\"\"><div> <span>The day had been a tough one for Marty.<br>\r\n<br>\r\nThroughout all of it, he had to deal with April and Olivia playing their twisted little games with him. In first period math class, Olivia sat next to him and spent the whole class taking away his things and hiding them in her underwear, forcing him to dig around her body if he wanted them back. During English, April sat next to him and gave him a handjob under the desk, not even stopping when the teacher asked him a question. During lunch, he was forced to eat things out of Olivia's cleavage and during all recesses, he had to eat out their pussies in the back of the school library.<br>\r\n<br>\r\nNow, however, he was finally able to relax in the boys' locker room. It was seven in the afternoon, a time when nobody used the showers, which is why Marty decided to use the showers at that time. He took off his clothes, stepped into one of the shower stalls and began to close the ceramic door before a hand stopped him. He turned around and saw April step inside the stall wearing a school bathing suit.<br>\r\n<br>\r\nThe suit was a dark blue one piece suit that was so tight, April's breasts strained not to burst out of it. The neckline was low enough to showcase some beautiful cleavage.<br>\r\n<br>\r\n\"April, what are you doing?! This is the guy's bathroom!\" Marty exclaimed, keeping his voice low. \"We could get caught!\"<br>\r\n<br>\r\n\"Don't worry about that, this place closes from the inside and I threw on the lock...so we're all alone.\" April said, seductively whispering the last part into Marty's ear while pressing her tits against his chest.<br>\r\n<br>\r\n\"Is Olivia here too?\"<br>\r\n<br>\r\n\"No. We're really alone.\" April said. \"Sure, Olivia told me she only wanted us to use you together, but she doesn't like fucking in the shower and I love it, so screw her. What she doesn't know won't hurt her.\"<br>\r\n<br>\r\nWith that, April took Marty's hands and placed them on her round, soft ass. Afterwards, she turned on the hot water, letting it rain down on both of their already hot bodies and leaning back her head so Marty could get a good look at the water trickling down between her boobs. Quickly, she pulled off the straps from her bathing suit and let them go, dropping it to the floor and leaving herself naked.<br>\r\n<br>\r\nThe busty girl shoved Marty onto the ceramic bench attached to the side wall of the shower and knelt down in front of him.<br>\r\n<br>\r\n\"Marty, do you know what a titfuck is?\"<br>\r\n<br>\r\n\"No...\"<br>\r\n<br>\r\n\"Then you're in for a treat.\" April said, giggling wickedly. \"A titfuck is when I take my giant, delicious tits...\"<br>\r\n<br>\r\nShe held up her boobs for emphasis.<br>\r\n<br>\r\n\"Wrap them around your cock...\"<br>\r\n<br>\r\nShe did as she described, sandwiching Marty's boner with her melons. Marty groaned in pleasure upon feeling her fleshy, warm pillows around his dick.<br>\r\n<br>\r\n\"...And get you off with them.\"<br>\r\n<br>\r\nThe girl began to squeeze her knockers around Marty's dick, jerking him off with her massive mammaries while she groped and squeezed them on his boner. She then wrapped her lips around the head of his cock and began to suck on it while she still squeezed her glorious globes on Marty's penis. Soon, the pleasure got to him and Marty came all over April's tits, who proceeded to rub the semen all over her hooters until they blended with the skin.<br>\r\n<br>\r\nApril climbed onto the bench and slid her pussy over Marty's dick before shoving his face into her rack and lowering herself onto his cock, slowly sliding him inside her. They both moaned loudly (though Marty's moan was drowned out by the boobflesh) as she began to ride him, fixing out her own rhythm and forcing Marty to follow it with his thrusts, which she limited considerably since she preferred to drive the whole thing and do most of the work to maintain dominance.<br>\r\n<br>\r\nHe gripped her ass instinctively and helped lift her up and shove her down instead of thrusting, while he groped her soft butt-cheeks. April moaned and threw her head back, letting the warm water spray all over her as she fucked, a sensation she loved like no other. Marty wound up cumming before April, shooting his load into her while she continued to ride the tired boy's cock until she finally came as well, riding out her orgasm for as long as she could while the warm water trickled down all her body.<br>\r\n<br>\r\nAfter finishing off, April sat Marty down on the shower floor.<br>\r\n<br>\r\n\"I'm gonna give you a little treat for making me cum so hard.\" April said.<br>\r\n<br>\r\nThe busty girl grabbed a shampoo bottle and sprayed a bunch on her tits, which she then rubbed together to make a fomay, soapy substance. Afterwards she knelt down and pressed her soapy melons onto Marty's back, rubbing them up and down like two, huge sponges. Marty moaned and relaxed as April gave him a tit bath.<br>\r\n<br>\r\n\"You'll love this...Olivia always does.\" April said.<br>\r\n<br>\r\n\"You do this...with Olivia?\" Marty asked, getting excited.<br>\r\n<br>\r\n\"Yes, I was her back .<i>with my tits</i>.\" April whispered sexily into his ear. \"All the time. Though she only lets me wash her back with my tits. I give full body washes to other girls...\"<br>\r\n<br>\r\n\"Who!?\" Marty asked, getting hard and excited again.<br>\r\n<br>\r\n\"Mary Motsky for example...\"<br>\r\n<br>\r\n\"Really!?\"<br>\r\n<br>\r\n\"Yes. I was her whole body with my tits.\" April whispered, rubbing harder. \"I even was her tits...<i>with my tits</i>.\"<br>\r\n<br>\r\nMarty moaned as April took a hold of his erection and began to stroke it.<br>\r\n<br>\r\n\"Someone likes that...\" April said, stroking and rubbing. \"Let me tell you some more stories...\"<br>\r\n<br>\r\nAnd so she did.</span></div></div>",
            "created":1330664400,
            "id":1287895,
            "title":"Wet And Wild"
        },
        "1112112211":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "After a while, Marty passes out.",
                "After a while, Olivia orders April to please the trapped Marty."
            ],
            "content":"<div class=\"\"><div> <span>Shower sex had been very much pleasant for both Marty and April. So much so that she decided to repeat it the following morning...and the afternoon. April instructed Marty to get up an hour early and head for the bathroom, upon which they fucked in the shower. In the afternoon, she told him to go shower an hour late and once again, they fucked. Due to having extra time on the afternoon shower, April washed Marty with her boobs again and continued to tell him stories of her and Olivia's sexual misadventures, including the time they pulled their \"girl sandwich\" technique to seduce a reluctant Camille Gastling and about Olivia's facesitting fetish.<br>\r\n<br>\r\nAbout an hour and a half after finishing with April, Olivia texted Marty, telling him to come over to their room. For the sake of convenience, Olivia and April had instructed Marty to stay at his room in the school rather than return home every day. When he arrived at their room, Marty knocked on the door and it was opened by Olivia, who was wearing a bathrobe.<br>\r\n<br>\r\n\"Come in.\" She ordered.<br>\r\n<br>\r\nMarty did as he was told and stepped into their room, which had gone through a little re-decoration. Between their two beds, there was now a reclining sofa and a flat screen TV hung on the wall opposite to the sofa. Marty turned around to speak to Olivia and saw that she had shed her bathrobe and was only wearing a pink thong and bra.<br>\r\n<br>\r\n\"April, now!\" She exclaimed.<br>\r\n<br>\r\nBefore he could react, Marty was grabbed from behind and thrown on top of the recliner sofa. He was pinned down by April, whose eyes were lidded and unfocused and whose breasts, crotch and ass appeared to be vibrating.<br>\r\n<br>\r\n\"What the hell is going on?!\" Marty yelled.<br>\r\n<br>\r\n\"I found out about your and April's little shower exploits, so I decided to teach both you and her that you should never go behind my back.\" Olivia said, with an evil demeanour. \"I already got April.\"<br>\r\n<br>\r\nMarty looked at Olivia's taller friend and was simply stunned by her vacant expression and the way she had obeyed Olivia.<br>\r\n<br>\r\n\"I put her on zombie-mode.\" Olivia explained. \"I got her drunk and gave her some doping pills; then I shoved vibrators into her ass and pussy and made her wear vibrating underwear. The pleasure pulled her under and she's so fucked up she'll do anything I say until the stuff I gave her wears off...which I think will be around another ten hours.\"<br>\r\n<br>\r\n\"What are you gonna do to me?\" Marty asked, freaked out by what Olivia had done to her best friend.<br>\r\n<br>\r\n\"For you...I have something very fun in mind.\"<br>\r\n<br>\r\nOlivia reached behind the couch and pulled out a strange strap contraption. It was a large belt with two small steel cables sticking out of it and attaching it to two smaller belts that were separate form each other. Olivia strapped the large belt to Marty's head and then pulled down her thong. Afterwards, she climbed over Marty with one leg to either side of him and proceeded to tighten the two smaller belts around her thighs. By now, Marty had realized what she was doing but it was too late. Olivia handcuffed Marty's wrists to her ankles and then sat down on his face, her large ass covering his entire face. Marty had previously noticed that Olivia had an ass unusually large butt for her thin (but not skinny) frame, which he understood was deliberate after April told him of Olivia's facesitting fetish. Now he was experiencing that unusually large ass first-hand.<br>\r\n<br>\r\nThe mean girl rubbed her sensuous booty over Marty's face, giggling all the while. Despite the pressure that Olivia sitting on his face was exerting, Marty was very turned on by the soft booty on his faced. He could breathe, but not easily.<br>\r\n<br>\r\n\"I'm going to watch TV and until I feel like it, you're gonna be my pillow. Right, Marty?\" Olivia asked, sarcastically.<br>\r\n<br>\r\nMarty tried to answer, but his words were muffled.<br>\r\n<br>\r\n\"Good.\"</span></div></div>",
            "created":1342933200,
            "id":1385222,
            "title":"Olivia On Top"
        },
        "11123":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "Both women cum and deside just to switch places on Marty.",
                "They get off and demand the final exam answers."
            ],
            "content":"<div class=\"\"><div> <span>I,.. I can decide..\"  Marty started.<br>\r\n<br>\r\n\"You can't decide which one you want to fuck first?\"  Olivia asked.  Both naked girls sat up and gave him lust glances.<br>\r\n<br>\r\n\"No, I...\"  Marty started against.  Even this this super hot situration happening right in front of him, he still did know if he could the hot girl the answer.  However both girl didn't let him explain.  They push him down and made such that he was pin.<br>\r\n<br>\r\n\"I can't believe it\"  April gasped.  She was sitting just on the floor above Marty's head.  Marty's arms are pinned above is head in a uncoftable hold.  \"he still resisting us. \"<br>\r\n<br>\r\n\"I know.. \" Olivia replied.   She was sitting and pinning Marty's legs.   She took down Marty's boxers, and revealed his hard erection.  She hold it in her hand.<br>\r\n<br>\r\n \"Who knew the spaz had it in him.  I know the guy would break his back just to get a kiss.  Wel...l, we going to have going to have to raise stakes. \"<br>\r\n<br>\r\nApril nodded her head.  \"Alright, I get his head. \"  April got up and strattled over Marty face, and sat down.  She slowy drag her pussy and ass crack over Marty's nose and mouth. <br>\r\n<br>\r\n\"Good,\"  Oliva stated as she lower herself down on Marty's erection.  She move slowly down until Marty's member filled her up.  <br>\r\n<br>\r\n\"I always want to take a nerd's virginity.  The answer to the final exam are just icing to the cake.\"<br>\r\n<br>\r\nBoth girls move rapidly on Marty body.  They are so hot, they are barely notice Marty as they contiune the slam against his body.  Marty's face was contiune slammed into April's ass over and over.  His nose was inserted in April anus and pussy. Olivia was fuck him hard as well.  She was supried on how good Marty felt.  Not in a million years whould has believe that nerdy Marty would be such a good fuck.<br>\r\n<br>\r\nAs the two girls him to get themselves off,  Marty wondered was was going to happen next..<br>\r\n<br>\r\n</span></div></div>",
            "created":1362069960,
            "id":1541078,
            "title":"Threesome."
        },
        "112":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "Marty goes to the school restroom but instead meets Florence Morrison",
                "Marty escape but is later ambrushs again by the two girls",
                "Marty leave the school, but bump into Mary."
            ],
            "content":"<div class=\"\"><div> <span>Uh, Uhh, \"  was all Marty could say.  <br>\r\n<br>\r\nOliva and April contiune to rubbed their boobs, and pussies against.  It seem that Marty Zimp, a shy grade A student would have no chance against two of the sluttist girl in this private insitution.  But a suddenly, sharp thought enter his head.  <br>\r\n<br>\r\n\"They doing this, just to get the answer to the final exam. \"  his inner voice stated.  \"if it was for that, they would give you the time of day. \"  <br>\r\n<br>\r\nNaturally Marty own voice try to counter this statement, edge on, by the more and more exotic movements.  Subconciously, the inner voice was barely able to win out..<br>\r\n<br>\r\n<br>\r\n\"Uh, Uh, ...I got to go..\"  he says meeky.  Marty squeezed out between the two hot girls, and barely manage to escape.  </span></div></div>",
            "created":1362067560,
            "id":1541054,
            "title":"He refuses."
        },
        "12":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Agree; Tits for Test.",
                "Disagree.",
                "Demand more than just having her breasts.",
                "Attempt to escape."
            ],
            "content":"<div class=\"\"><div> <span>...Mary Motsky. The girl with the biggest rack in all school stood right in front of Marty, dressed in the school uniform, which looked incredibly tight on her huge G-cup tits and her juicy, large, round ass.<br>\r\n<br>\r\n\"Hi there, Marty.\" She said.<br>\r\n<br>\r\n\"Hi.\" He replied.<br>\r\n<br>\r\n\"Look Marty, I'm just gonna cut to the chase.\" She said. \"There's a rumor going about that the Principal gave you the answer sheets to the final exam to hide them. Is it true?\"<br>\r\n<br>\r\n\"What? Well...Huh...I...\"<br>\r\n<br>\r\n\"I'm gonna take that as a yes.\" She said.<br>\r\n<br>\r\nSwiftly, Mary pushed Marty into the vacant classroom and stepped in after him, closing the door right behind herself. As soon as the door was closed, Mary reached for the neckline of her shirt with both hands and pulled them outward, ripping her shirt open by popping all the buttons and showing Marty her huge hooters hidden behind a tight white bra, which appeared to be at least a cup size too small by how the bottom half of Mary's jugs was visible under it.<br>\r\n<br>\r\n\"Look Marty, I wanna pass this test and I don't want to put much effort into it. So I have a deal for ya.\" She said.<br>\r\n<br>\r\nMary quickly took the boy's hands in hers and placed them on her rack. She pushed them in and Marty's heartbeat and dick hardness tripled upon feeling his hands grope the school's biggest boobs through the thin bra. She gently made Marty grope her bazongas, rubbing them with his hands and making sure that he enjoyed kneading her squishy globes.<br>\r\n<br>\r\n\"If you give me the answer sheet I will let you do anything with my boobs...And not just now, anytime. Whenever you want, you just ask and I'll take you to a secluded place, whip out my tits and let you do whatever with 'em. Lick 'em, suck 'em, touch 'em, put your head between 'em...hell, even stick your dick between 'em and get titty-fucked. I'll be your little boobie-slave.\" She bargained with him.<br>\r\n<br>\r\nShe let go of his hands and then put them behind his head. She swiftly dragged his head down and stuck it right in the middle of her cleavage. Marty practically came when he felt his face sink into the wonderful softness of Mary Motsky's huge boobs.<br>\r\n<br>\r\n\"So, what do you say? Tits for test?\"</span></div></div>",
            "created":1288155600,
            "id":982135,
            "title":"Tit-anic"
        },
        "121":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Marty takes her the answers...and notices her tits have somehow grown bigger.",
                "Marty takes her the answers...but finds Mary with another girl.",
                "Marty takes her the answers...but is stopped along the way by another girl."
            ],
            "content":"<div class=\"\"><div> <span>\"OK.\" Marty said, his words muffled by the legendary rack.<br>\r\n<br>\r\n\"Good choice.\" Mary said.<br>\r\n<br>\r\nThe girl released Marty's head, but when he didn't pull away immediately she had to forcefully pull his face away from her boobs, which drew a disappointed sigh from him.<br>\r\n<br>\r\n\"Oh don't get sad Marty, it's only so you can get a better look.\" Mary said teasingly while she reached for the strap behind her back.<br>\r\n<br>\r\nMary reached for her bra strap and unlatched it, letting the bra fall off her body and unleashing her huge tits before Marty's eyes. Like every horny teenager, Marty was dazzled by his first proper look at boobs. Mary hopped on a nearby desk and gently placed Marty's head back on her now bare boobs. Marty reacted immediately and took her right nipple into his mouth, suckling it roughly and sloppily groping her left tit in an experimenting manner. Marty played with Mary's tits for what seemed like hours to him, alternating between groping, licking, sucking and occasionally nibbling and changing boobs every now and then.<br>\r\n<br>\r\nEventually, the sensation got old for Mary and she pulled the eager teen away from her rack.<br>\r\n<br>\r\n\"OK Marty, now let me give you a little treat.\" She said.<br>\r\n<br>\r\nThe girl got off the desk she was on and instead hoisted Marty up onto it. She undid his belt and pulled down his pants and boxers, letting out his dick. A very amused Marty looked on as she put his cock in her mouth once to lubricate it and then sandwiched it between her huge tits. Mary pressed her bazongas together, squishing Marty's dick and encasing it between her two huge fleshy pillows. She moved her tits up and down as she slowly masturbated him with her melons, the warmth and softness of which was too much for Marty, who after about five minutes came all over her rack. Mary released his cock and then rubbed his cum all over her boobs until it had all blended with her skin. She then got off the floor and put her bra back on.<br>\r\n<br>\r\n\"OK Marty, get the answers to the test and then come to my room in a couple of hours.\" Mary instructed. \"After you give me the answers, I'll let you have another go at these babies.\"<br>\r\n<br>\r\nMary groped her massive boobs over her bra and then left the classroom, leaving behind a very pleased and very eager Marty.</span></div></div>",
            "created":1315803600,
            "id":1185968,
            "title":"Tits For Test"
        },
        "1213":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "\"Yes\".",
                "\"No\"."
            ],
            "content":"<div class=\"\"><div> <span>Marty had everything ready. He'd gone to his house and picked up the test answers, which he made a photocopy of and was currently going to deliver them to Mary Motsky, feeling a little guilty over what he was doing but reassured by the idea that he'd get to have Mary's huge tits sandwiched around his dick once again.<br>\r\n<br>\r\nBefore he could deliver them, however, he had to make a brief stop at his best friend's room to drop off some homework. Brenda Saber, who had a room of her own on the school campus, was Marty's best friend since they were kids. Always a quirky and intelligent, yet slightly bubbly girl, who'd only recently discovered just how hot she was and was certainly breaking in her newfound hotness by being a cocktease. She wasn't afraid to tease Marty either, in fact she enjoyed it, and sometimes in dire straits used her assets to get some things out of her best friend.<br>\r\n<br>\r\nWhen Marty walked into Brenda's room, he was greeted with a wonderful sight...<br>\r\n<br>\r\nBrenda's ass.<br>\r\n<br>\r\nBrenda was wearing a tiny, red thong and was bending over while she reached for something; displaying her large, juicy ass for Marty's delighted eyes. Brenda had always used her gorgeous ass to her advantage and it was her favorite asset with which to tease Marty, grinding it against his crotch and sometimes even his face. However, Marty had never gotten to see her ass bare (or virtually bare) until then.<br>\r\n<br>\r\nWhen she realized he was there (and what he was staring at), she smiled cheekily and stood up but didn't turn around, letting him gawk at her butt still.<br>\r\n<br>\r\n\"Hey Marty, I see you like my booty.\" She said, shaking it slightly.<br>\r\n<br>\r\nMarty looked away and tried to play dumb.<br>\r\n<br>\r\n\"Oh, come on. There's no need to hide it. I know you love my booty.\" She giggled.<br>\r\n<br>\r\nBrenda shook her ass slightly and Marty couldn't avoid getting entranced as it jiggled sensually.<br>\r\n<br>\r\n\"You can set down the homework on my bed.\" Brenda said, still giggling.<br>\r\n<br>\r\n\"What? Oh, right!\"<br>\r\n<br>\r\nBrenda giggled as Marty reached into his backpack and pulled out some papers from their history homework that he had been commissioned to give her. Marty laid the papers down on her bed and when he turned around, Brenda shoved him backwards onto her bed before doing something he would have never foreseen. She turned around and promptly sat her delicious ass down on his face.<br>\r\n<br>\r\nMarty tried to shove her off but Brenda resisted and began to rub her soft, butt-cheeks against his face. He could still breathe but rather laboriously.<br>\r\n<br>\r\n\"Brenda, what are you doing?!\" He yelled, muffled but audible.<br>\r\n<br>\r\n\"I'm giving you what you want. A nice, close view of my glorious booty.\" She said, giggling. \"You can't tell me you don't like it...You've told me about your facesitting fantasies.\"<br>\r\n<br>\r\nBrenda highlighted her point by stroking Marty's very much erect cock. She was right, though. Marty was very turned on and very much liking the round butt on his face and he did have a secret fetish for facesitting but he was concerned as to why she was doing this. Fearing the worst...<br>\r\n<br>\r\n\"So Marty, I heard you had the answers to the final exam...\"<br>\r\n<br>\r\nThe worst.<br>\r\n<br>\r\n\"I would have asked as a favour to a friend but you have that morality thing so I figured I could offer you something in return.\" Brenda said.<br>\r\n<br>\r\n\"Brenda...\"<br>\r\n<br>\r\nShe silenced him by rubbing her booty against his face again.<br>\r\n<br>\r\n\"You know I'm a sexually liberal girl, so I don't mind. If you give me those answers, not only will I facesit you all you want...I'll fuck you too.\" She offered. \"I might be mostly into girls but I can do you a couple favors, because it's you. Though only if you give me that test. What do you say? If you say yes now, I'll start by taking off my thong. Think about it. You'll get to feel my full, soft, juicy, round naked booty on your face. What do you say?\"</span></div></div>",
            "created":1331010000,
            "id":1290276,
            "title":"Brenda's Ass"
        },
        "12132":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Yes he does",
                "No he doesn't"
            ],
            "content":"<div class=\"\"><div> <span>Brenda got off of Marty, turned around and said \"Why not?\"<br>\r\n<br>\r\n\"Well, I kind of promised them to someone else.\" Marty said as he got off of her bed &amp; slowly walked backwards to the door.<br>\r\n<br>\r\n\"Who did you promised it to?\" Brenda asked as she walked up to Marty.<br>\r\n<br>\r\nBefore Marty could answer, someone knocked on the door.<br>\r\n<br>\r\n\"Come in.\" Brenda said.<br>\r\n<br>\r\nThe door opened and it was Mary, the one who asked for them earlier. \"It was me.\" Mary said as she must of heard the conversation through the door as she closed it behind him. \"Oh, so if that is the case why don't we share Mary?\" Brenda asked. \"I don't mind!\" Mary said as she and Brenda dragged Marty back onto Brenda's bed as they both hugged him tightly. \"It would take a lot to mentally break you, Marty! What did Mary promise you?\" Brenda said as she was rubbing her B-cup sized boobs on the left side of Marty. <br>\r\n<br>\r\nMarty's face turned bright red as he decided not to answer the question. Mary answered it for him and said; \"I promised him that he could use my boobs whenever he wanted to.\" Mary said as she rubbed her huge boobs on the right side of Marty. \"That makes perfect sense to me. Marty, since you promised her, can you please share them with me too? My offer still stands!\" Brenda said as she rubbed her left hand on his jean covered crotch. <br>\r\n<br>\r\n\"Let's say hypothetically that I say yes, will the both of you put you hands on the bible and swear that this will go on past the last year of high school?\" Marty asked as he was curious, he was about to lose it. \"Yes!\" Mary said enthusiastically. Brenda had to think for a second; then she said, \"Sure why not?\" With this in mind that the fact that this was going to happen a lot longer than 1 year, he was ready to break his promise to the principal. Does he?</span></div></div>",
            "created":1417371780,
            "id":1895864,
            "title":"\"No\"."
        },
        "122":{
            "choices":[
                "She chases after him",
                "Another girl shows up",
                "He gets out of the school safely"
            ],
            "content":"<div class=\"\"><div> <span>\"No Mary I won't.\" said Marty after pulling his head out.<br>\r\n<br>\r\nMary looked shocked...and a little bit insulted \"Why the Hell not?!\" she snarled.<br>\r\n<br>\r\n\"Because it isn't right. I gave the principal my word and I can't break that.\"<br>\r\n<br>\r\nMary paused so her brain could digest this information. \"Besides, you're a senior. I would only have a year at the most to play those titties and you know it.\"<br>\r\n<br>\r\nHe gives her an apologetic look before turning around. Marty quickly runs out the door before he could be tempted further by Mary's mountainous mounds.</span></div></div>",
            "created":1293166800,
            "id":1021967,
            "title":"Disagree."
        },
        "1221":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "The next day Marty gets approached by another girl.",
                "The next day, Billie calls Marty to fuck her.",
                "The next day, Billie calls Marty to fuck Mary in front of her."
            ],
            "content":"<div class=\"\"><div> <span>\"Hell no!\"<br>\r\n<br>\r\n\"Huh?\"<br>\r\n<br>\r\nMarty turned around and was faced with Mary coming at him. She was holding her shirt together at the middle since she had broken off all the buttons when she tore it open. She pressed him against a wall and began to rant at him.<br>\r\n<br>\r\n\"How could <i>you</i> turn <i>me</i> down?\" She yelled. \"Have you seen these tits?!\"<br>\r\n<br>\r\nMary let go of the shirt, flashing him her boobs behind her bra. She cupped them in her hands and groped them for emphasis.<br>\r\n<br>\r\n\"Mary, if someone comes by they'll see you...\"<br>\r\n<br>\r\n\"How?\"<br>\r\n<br>\r\n\"I made a promise...\"<br>\r\n<br>\r\n\"Promise my ass, you just need a close look at my rack!\"<br>\r\n<br>\r\nMary pulled down her bra, flashing Marty her hooters.<br>\r\n<br>\r\n\"Mary somebody could...\"<br>\r\n<br>\r\nBefore he could go on, Mary shoved one of her supple tits into his mouth. Her nipple and a patch of her tit skin were caught between his lips, not allowing him to speak.<br>\r\n<br>\r\n\"See, my jugs are awesome!\" Mary yelled. \"Now give me the answers.\"<br>\r\n<br>\r\n\"I agree...those are awesome jugs.\" A voice proclaimed.<br>\r\n<br>\r\nMary turned her head around, her boob still in Marty's mouth and Marty looked past Mary's shoulder to see Billie Dolph standing behind them, holding a Blackberry and taking pictures of them.<br>\r\n<br>\r\n\"...And now I can look at them being shoved in Marty's mouth whenever, since I mailed a picture of them like that to my email account.\" Billie added.<br>\r\n<br>\r\n\"Billie...there's no need to show pictures...\" Mary pleaded.<br>\r\n<br>\r\n\"Mary, pull your boob out of Marty's mouth, cover yourself up and you two come to my dorm room.\" Billie instructed.<br>\r\n<br>\r\nMary did as instructed and Billie led both of them to her dorm room. Billie was one of the few people in the school who had the privilege of having a single room to themselves because of random selection leaving them roommate-less. When they made it in, Mary was the first to talk.<br>\r\n<br>\r\n\"Billie, I'm sure we can talk about this...\"<br>\r\n<br>\r\n\"Take off your shirt.\"<br>\r\n<br>\r\n\"Yes ma'am.\"<br>\r\n<br>\r\nMary pulled off her shirt, leaving herself topless in front of Billie. The smaller girl approached Mary, cupped her right boob and encircled her lips around the nipple. She began to suckle on the boob while Mary moaned both in pleasure and discomfort. She soon pulled away from the nipple and began to grope and play with Mary's bosom.<br>\r\n<br>\r\n\"I just love these tits...\"<br>\r\n<br>\r\nBillie walked to her bed and sat down, she then spread her legs to reveal she was wearing nothing under her skirt.<br>\r\n<br>\r\n\"Mary, come here and eat me out...\"<br>\r\n<br>\r\n\"What?!\"<br>\r\n<br>\r\n\"Eat out my pussy or I'll show the principal those pictures, which will get you expelled for doing something so sexual in public!\"<br>\r\n<br>\r\nWhining and almost crying, Mary kneeled down in front of Billie, stuck her head under the other girl's skirt and soon a wet lapping sound could be heard, followed by Billie's moans.<br>\r\n<br>\r\n\"Yeah. That's good!\" She moaned.<br>\r\n<br>\r\nBillie turned to Marty and began to talk.<br>\r\n<br>\r\n\"I have a special job for you.\" She said.<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"You're gonna help me get more girls.\" Billie said.<br>\r\n<br>\r\n\"Huh?\"<br>\r\n<br>\r\n\"I want to start my own little collection of bitches that will do anything I say, like Mary here. I'll spread the word that you have the exam answers and more girls like Mary will undoubtedly try to seduce you to get them.\" Billie explained. \"I'll set up a camera in your dorm room and when girls try to get you, you take them to your dorm, fuck 'em, the camera takes pictures of it and I can use them to blackmail the girl and have her fuck me.\"<br>\r\n<br>\r\n\"That's fucking crazy!\"<br>\r\n<br>\r\n\"Maybe, but you have no choice. Or maybe you want me to show the pictures I took of you suckling Mary's tits in the school hallways?\"<br>\r\n<br>\r\n\"No!\"<br>\r\n<br>\r\n\"Then you'll do as I say...\"<br>\r\n<br>\r\n\"Fine!\"<br>\r\n<br>\r\n\"Good...\" Billie said. \"Now leave us alone. I have a very special night planned for Mary here.\"<br>\r\n<br>\r\nMarty turned around and left the room, but not before he could hear Billie say:<br>\r\n<br>\r\n\"Now Mary, grab your tits and rub my clit with your nipples.\"</span></div></div>",
            "created":1295499600,
            "id":1038628,
            "title":"Blackmail."
        },
        "12211":{
            "choices":[
                "April Torrington",
                "Candy Burt"
            ],
            "content":"<div class=\"\"><div> <span>The next day Marty was thinking about his perdictament, and when he said 'his' he really meant Mary's. Seeing Mary so sad when pleasuring Billie, it haunted him. Maybe he was just too old fashioned but he couldn't stand to see a woman, even a slut like Mary, in that kind of trouble. He could always go to the police, blackmail was illegal, but it would be better if the pictures on her email account and her blackberry. He sighed right before he bumped into another girl.<br>\r\n<br>\r\nWho was it?</span></div></div>",
            "created":1310014800,
            "id":1142334,
            "title":"The next day Marty gets approached by another g..."
        },
        "123":{
            "author_id":"swapbodies",
            "author_name":"Lily",
            "choices":[
                "Agree",
                "Disagree",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>no way Mary. these papers are really important.for the papers i want your whole body anytime i want. take it or leave it.</span></div></span></div>",
            "created":1353759540,
            "id":1474232,
            "title":"Demand more than just having her breasts."
        },
        "124":{
            "choices":[
                "She kidnaps him",
                "She tries to seduce him",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>Marty quickly manage to slip his face out of her clevage, much to her surprise, and made a bolt for the door. He dashed down the hallway running past several other girls. He was almost free, Marty could see the exit doors to the school, all he had to do was leave through them.<br>\r\n<br>\r\nHowever, the instant Marty opened one of the doors his face ran into something soft knocking down on to the floor. Marty stared up to see that he had ran into the breasts of the second sluttiest girl, April.<br>\r\n<br>\r\nApril smiled evilly down at him. \"Hello Marty, you sexy thing.\"</span></div></div>",
            "created":1295499600,
            "id":1038780,
            "title":"Attempt to escape."
        },
        "1243":{
            "author_id":"thereaders",
            "author_name":"thereaders",
            "choices":[
                "in a bedroom from one of the girls",
                "in a classroom",
                "in the girls locker-room"
            ],
            "content":"<div class=\"\"><div> <span>you screamed out load when the girls surrounds you,<br>\r\n<br>\r\nthey are surprised by your scream and you try to run to the doors but its not easy to avoid all the girls in your path but you made it.<br>\r\n<br>\r\nyou block the doors with a pair trashcans its not very effective but it gave you 2 more minutes to run to the back of the school behind the gym.<br>\r\n<br>\r\nyou stop to breath but when you rest you heard a voice<br>\r\n<br>\r\n???: hey!<br>\r\n<br>\r\nyou try to turn around but you passed out<br>\r\n<br>\r\nwhere do you awake?</span></div></div>",
            "created":1391992440,
            "id":1742836,
            "title":"Escaped hell"
        },
        "12431":{
            "author_id":"thereaders",
            "author_name":"thereaders",
            "choices":[
                "explore the house.",
                "hide in the room"
            ],
            "content":"<div class=\"\"><div> <span>after a pair hours you wake up on a large soft place you cant see bright but after couple of minutes you have a clear view,<br>\r\nyour in a huge girls room on a huge bed ... wait they aren't huge... you shrunk too 2 inch<br>\r\n<br>\r\nyou cant believe this your fetish came trough you walk to the edge of the bed and look down<br>\r\n<br>\r\nMarty: wow if i fall down i will die<br>\r\nfrom which girl is this room?<br>\r\n<br>\r\ni could explore the house to find out<br>\r\nbut it would safer to hide in a near spot and wait for her<br>\r\n<br>\r\nMarty: hm anyway the girl would seduce me or maybe i am lucky<br>\r\nand she don't want the answers.</span></div></div>",
            "created":1391993400,
            "id":1742841,
            "title":"it is freaky huge!"
        },
        "12432":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Olivia, April & Brenda was there as well",
                "It's Just The 2 of them"
            ],
            "content":"<div class=\"\"><div> <span>Marty woke up in a classroom. \"Why am I here?\" Marty said. <br>\r\n<br>\r\n\"I'll tell you why!\" Mary said as she was behind him. \"Oh, hey Mary.\" Marty said as he walked away from her. \"My offer will still stand. Can you give me the papers please?\" Mary asked nicely. \"I'm sorry but I can't. I have a promise to keep!\" Marty said as his back hit a wall. Mary smiled as she said, \"Fine, you just need a whole lot more encouragement. Come with me!\" Mary said as he grabbed his hand and walked with him to her dorm room. Marty tried to break free, but Mary's grip was strong. When she opened her dorm room...</span></div></div>",
            "created":1417362600,
            "id":1895799,
            "title":"in a classroom"
        },
        "13":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Fuck Cathy first.",
                "Fuck Florence first.",
                "Have a Threesome.",
                "Get a Lesbian Show."
            ],
            "content":"<div class=\"\"><div> <span>...Cathy Stephens and Florence Morrisson.<br>\r\n<br>\r\n\"Hey Marty...\" They both said in a friendly way.<br>\r\n<br>\r\n\"Hi girls.\" Marty replied.<br>\r\n<br>\r\nCathy opened her arms and approached Marty for a hug. Since she was one of his best friends, it was only natural that he returned the gesture and hugged her. However, Marty felt that she was hugging him especially tight this time because he could feel her breasts press tightly against his chest. Marty wasn't a pervert, so he didn't normally focus on girls' bosoms, but when Cathy's tits mashed against his chest he could not help but feel aroused. He tried to keep his \"joy\" down until she let him go, succeeding.<br>\r\n<br>\r\n\"Listen Marty, do you mind coming to our room for a little while? There's something we need a little help with.\" Said Cathy.<br>\r\n<br>\r\n\"Sure.\" Replied the boy.<br>\r\n<br>\r\nThe two girls led the way and talked with Marty while they got to their room in the school's girls' dorm.<br>\r\n<br>\r\n\"So Marty, I hear you did well in the advanced final exam you took yesterday.\" Florence told him to make small talk while they walked to their room.<br>\r\n<br>\r\n\"Yep, I got an A+.\" He bragged.<br>\r\n<br>\r\n\"Very nice. You are very smart.\" Florence complimented.<br>\r\n<br>\r\n\"Thanks.\"<br>\r\n<br>\r\n\"Of course he's smart...after all, he's my friend. I tend to let my brains rub on to other people.\" Cathy teased.<br>\r\n<br>\r\n\"Hardy-har-har, Cathy.\" Marty laughed sarcastically.<br>\r\n<br>\r\n\"Well, here we are.\" Said Cathy, opening the door to their room.<br>\r\n<br>\r\nThe two girls and the boy stepped inside, after which the blonde girl closed the door. Then both of them stood in front fo Marty, between him and the door.<br>\r\n<br>\r\n\"So what do you need my help with?\" He asked.<br>\r\n<br>\r\n\"We've been trying to settle a little dispute between us and we were wondering if you could be a judge here.\" Florence explained.<br>\r\n<br>\r\n\"Sure, what's the question?\"<br>\r\n<br>\r\n\"Which one of us has the best tits?\" Cathy asked.<br>\r\n<br>\r\n\"Excuse me?!\"<br>\r\n<br>\r\n\"Which one of us two has the best boobs?\" Cathy asked. \"Which one?\"<br>\r\n<br>\r\n\"But...I...\"<br>\r\n<br>\r\n\"If you need a little help deciding maybe this will help.\"<br>\r\n<br>\r\nBoth girls grabbed one of Marty's hands and placed them on their chests. Marty's \"joy\" grew to full attention as soon as he felt his hands grope the soft orbs of the girls' breasts. Sure, he was cupping over their shirts but they were still incredibly soft.<br>\r\n<br>\r\nBoth girls smirked confidently and saw that the boy was immobile, the only movement in his body were his hands involuntarily playing with their boobs. They looked at each other briefly before shoving Marty backwards on a chair.<br>\r\n<br>\r\nFlorence turned around and then proceeded to sit down on Marty's crotch, rubbing her ass gently against his hardened dick while Cathy stood behind his chair and then rested her tits on the back of the boy's head while wrapping her arms around his neck.<br>\r\n<br>\r\n\"Listen Marty, I know we're friends and all but my problem here goes beyond friendship. Both Florence here and I want to pass these final exams, but we were both too lazy to study. Now we found out that you're keeping the answer sheets at your house so we're going to cut you a deal. We'll fuck you and do whatever you want for the whole night if you give us the answers.\" Cathy whispered into his ears.<br>\r\n<br>\r\nMarty heard all she said, but found himself unable to answer because he was distracted by the ass on his crotch and the boobs on his head. <br>\r\n<br>\r\n\"We'll take that as a yes.\" Florence commented, rubbing harder.<br>\r\n<br>\r\n\"Now, what do you want? Do you want to fuck Flory first, or me. Maybe you want to fuck both of us at once...you know, a menàge a trois? Or perhaps you want us to give you a little show?\" Cathy listed.<br>\r\n<br>\r\n\"Show?\"<br>\r\n<br>\r\n\"Yes. This kinda show.\"<br>\r\n<br>\r\nSuddenly Florence turned around and leaned into Cathy. Marty watched as both girls joined in an open mouth kiss, briefly massaging each others' tongues before pulling apart.<br>\r\n<br>\r\n\"So? What's it gonna be then?\"</span></div></div>",
            "created":1288242000,
            "id":982586,
            "title":"Double Trouble"
        },
        "14":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "\"After all, what are friends for?\" (no strings attached)",
                "\"But you have to help me get this girl I like to go out with me.\"",
                "\"But you have to agree to serve me as my loyal slave from now on!\"",
                "\"But you have to be my girlfriend from now on!\"",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Candy was running up to Marty with a distressed look on her face.<br>\r\n <br>\r\n\"Marty, you have to help me! My mom wouldn't stop bugging me about her crappy love life last night, and I didn't get any chance to study! You have to let me copy your notes!\"<br>\r\n<br>\r\nThis was actually becoming a regular occurrence lately. Candy's mom was getting up there in age, and was at the point in her life where it was becoming increasingly difficult to hold on to a boyfriend. As Candy stated, her love life was indeed crappy.<br>\r\n<br>\r\n\"Ugh, again?! Why can't your mom just hold down a boyfriend for even a week! What is this, the third one this month?\"<br>\r\n<br>\r\n\"Fourth, actually... But that's beside the point! Come on, Marty! You have to help me! I'll do anything!\"<br>\r\n<br>\r\nShe would do anything? That offer was very tempting. Being friends for years, you were going to share your notes with her anyway, but now that she made an offer like that... Well, it just seemed too good to turn down.<br>\r\n<br>\r\n\"Okay Candy... I'll let you borrow my notes. ______________.\"</span></div></div>",
            "created":1297486800,
            "id":1052918,
            "title":"Candy Burt"
        },
        "141":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Fucks her",
                "Pushes her off him and leaves"
            ],
            "content":"<div class=\"\"><div> <span>Twenty minutes later, Candy and Marty were at Marty's house, in Marty's room while Marty looked for his notes.<br>\r\n<br>\r\n\"Thanks for lending them to me.\" Candy said.<br>\r\n<br>\r\n\"No problem, what are friends for?\" Marty said, rhetorically.<br>\r\n<br>\r\nWhile Marty browsed for his notes, Candy looked around his room, trying to entertain herself. She found nothing of interest until she stumbled upon an official looking envelope on Marty's desk. She looked inside and couldn't believe what she saw...<br>\r\n<br>\r\n\"The answers to the final exam!\" She exclaimed.<br>\r\n<br>\r\nUpon hearing that Marty turned around and saw that she was holding the envelope. The boy quickly snatched the answers from his friend.<br>\r\n<br>\r\n\"Why do you have those?!\" Candy asked.<br>\r\n<br>\r\n\"The principal gave them to me to keep them safe so nobody would steal them from his office like last year.\" Marty explained.<br>\r\n<br>\r\n\"Marty, you have to give them to me!\" Candy said.<br>\r\n<br>\r\n\"What? No! I can't!\" He yelled.<br>\r\n<br>\r\n\"Why not?\"<br>\r\n<br>\r\n\"Because I made a promise to the principal and I don't go back on my promises.\" Marty said. \"What kind of boob do you think I am?\"<br>\r\n<br>\r\nMarty's words hit a note on Candy. She then looked at her chest and came up with an idea.<br>\r\n<br>\r\n\"Boob...\" She muttered.<br>\r\n<br>\r\nCandy looked at Marty, who was giving his back to her. She smiled deviously.<br>\r\n<br>\r\n\"Oh Marty...\"<br>\r\n<br>\r\nMarty turned around and saw Candy stick her hands into one of the openings on her shirt between buttons and then tear them outwards, ripping her shirt open and exposing her firm C-cup breasts tucked inside a white lace bra.<br>\r\n<br>\r\n\"Candy, what are you doing?\"<br>\r\n<br>\r\nCandy approached Marty.<br>\r\n<br>\r\n\"I told you that if you help me I would do...\"<br>\r\n<br>\r\nCandy took Marty's hands and brought them to her breasts, pressing them against her chest and making him squeeze her boobs. She leaned into his ear and whispered.<br>\r\n<br>\r\n\"...Anything.\"<br>\r\n<br>\r\nCandy lowered Marty's zipper and then pushed him on his bed. She undid her skirt and dropped it to the floor, revealing her white panties. She leaped on top of Marty and straddled him.<br>\r\n<br>\r\n\"Now Marty, you just relax and by the time I'm done you'll be giving me those answers without question.\" Candy said in a seductive tone.<br>\r\n<br>\r\nMarty wanted to object but immediately Candy undid her bra and let it fall, showing him her firm, juicy tits. She lowered herself onto him and squished his face between her boobs. Soon Marty felt his boxers being slipped off and then felt the warm moisture of Candy's pussy on him.</span></div></div>",
            "created":1297573200,
            "id":1053250,
            "title":"Friends Will Be Friends"
        },
        "1411":{
            "author_id":"quintes",
            "author_name":"Ej",
            "choices":[
                "\"Now give me the answer sheet\"",
                "\"Fuck me more\""
            ],
            "content":"<div class=\"\"><div> <span>Marty couldn't resist, he started to pound his now hard member into Candy's pussy and started to suck on both of her tits. As she began to moan he managed to get on top of her and banged her harder. Marty cum into her leaving her gasping. Candy says.</span></div></div>",
            "created":1352264400,
            "id":1463293,
            "title":"Fucks her"
        },
        "14112":{
            "author_id":"quintes",
            "author_name":"Ej",
            "choices":[
                "ASS",
                "PUSSY"
            ],
            "content":"<div class=\"\"><div> <span>Now being a virgin, Candy's mind couldnt think straight getting fucked the shit off but she knew she wanted more, she moaned, \"Shove that dick back in!\" She slowly waved her butt back and forth to get his member hard again. He goes for the</span></div></div>",
            "created":1355113620,
            "id":1485113,
            "title":"\"Fuck me more\""
        },
        "141121":{
            "choices":[
                "Blow Job",
                "Go to find some lube"
            ],
            "content":"<div class=\"\"><div> <span>You grab her cheeks and head your erection for her anus but there was a small problem. \"Hey, uh, I was kind of hoping for some anal, mind 'opening' up?\"<br>\r\n<br>\r\nCandy turned her head back to you. \"It is open!\" she almost whined. \"But I think if you want it to fit you need to lube it up first.\"<br>\r\n<br>\r\n\"Lube huh? That gives me an idea...\"</span></div></div>",
            "created":1355260560,
            "id":1486195,
            "title":"ASS"
        },
        "15":{
            "choices":[
                "Yes",
                "No, It's April"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Billie for sure?</span></div></span></div>",
            "created":1295499600,
            "id":1038838,
            "title":"Billie Dolph"
        },
        "151":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Agree",
                "Disagree"
            ],
            "content":"<div class=\"\"><div> <span>...Billie Dolph.<br>\r\n<br>\r\n\"Hey Billie, I...\"<br>\r\n<br>\r\nBefore Marty could finish, Billie shoved him into the classroom and closed the door behind herself. She then shoved Marty on his back on top of a desk and stood over him domineeringly<br>\r\n<br>\r\n\"Hey Marty.\" She said. \"I heard the principal gave you the answers to the final exam so you'd keep them safe. Is that true?\"<br>\r\n<br>\r\nThough Billie asked, it was clear she knew the answer and was only asking for unneeded, official confirmation. However, Marty still went for the defensive.<br>\r\n<br>\r\n\"What?! No! That's...ridiculous...yeah...I d-don't have the answers.\" He lied, quite poorly.<br>\r\n<br>\r\n\"Uh huh. Yeah right.\" Billie replied, now absolutely sure he did have the answers. \"I have a proposition for you...\"<br>\r\n<br>\r\nBillie reached for her shirt and tore it open, displaying her moderate B-cup breasts behind a light green bra. Despite that they were average boobs, Marty was still shocked since he'd never had any experience with actual girls.<br>\r\n<br>\r\n\"See these tits?\" Billie asked.<br>\r\n<br>\r\nMarty nodded, still stunned.<br>\r\n<br>\r\n\"Like 'em?\" Billie asked.<br>\r\n<br>\r\nMarty nodded again.<br>\r\n<br>\r\nSuddenly, Billie's boobs began to expand before Marty's very eyes. Her modest B-cups slowly but steadily inflated in Billie's  chest until they reached DD-cups that rivaled Mary Motsky's bazongas. Her bra was fighting an agonizing war to keep those enormous melons inside itself.<br>\r\n<br>\r\n\"How about now?\" She asked, rhetorically.<br>\r\n<br>\r\nMarty was simply shocked. Billie's boobs had more than doubled in size in front of his eyes.<br>\r\n<br>\r\n\"You see Marty, I've had for a while the power to manipulate my own reality.\" Billie explained. \"I can change my physical appearance...\"<br>\r\n<br>\r\nSuddenly, Marty watched in further astonishment how Billie fragmented and suddenly two identical clones of her appeared before him.<br>\r\n<br>\r\n\"...I can clone myself...\"<br>\r\n<br>\r\nThe two clones rejoined their master and they became one again.<br>\r\n<br>\r\n\"...And I can take over other people's bodies. So...\"<br>\r\n<br>\r\nBillie climbed on top of the desk Marty was on and straddled him, leaning over him to her lips were a millimeter away from his and so that her enlarged DD-cup tits were squished against his chest.<br>\r\n<br>\r\n\"...How about we make a deal? I can fuck you like this, or I can clone myself and fuck you in a group; hell, I could posses a bunch of other girls and make them fuck you...All you have to do is give the answers to the test to me and I'll make all your dirtiest, sexy fantasies come true.\"<br>\r\n<br>\r\nBillie leaned in and kissed Marty briefly before pulling away and smiling deviously.<br>\r\n<br>\r\n\"What do you say?\"</span></div></div>",
            "created":1307077200,
            "id":1119557,
            "title":"A Powerful Girl"
        },
        "1511":{
            "author_id":"kgman6",
            "author_name":"Mr. Pink",
            "choices":[
                "Have sex with her with a sexually enhanced body",
                "Have an orgy of Billie clones",
                "Have Billie posses several other girls and have an orgy with them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You agree to her deal. But how?</span></div></span></div>",
            "created":1307077200,
            "id":1119558,
            "title":"A Powerful Choice"
        },
        "15111":{
            "author_id":"remcob",
            "author_name":"RemcoB",
            "choices":[
                "Yes, yes it is",
                "Nope, this would be even better"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, Ill do it, but I need to fuck you fist in the best body you can possibly create\" said Marty.<br>\r\n\"that can be arranged\" Billie said, as she started growing taller to over 7'5\", her breasts not keeping pace, but growing even bigger, as her ass also grew bigger and all fat melted off her body as she reached 9' tall. As she did, she looked like the thinnest girl he had ever seen, only with EEE-cup breasts and volleyball sized butt. The transformation was still going though, as muscles started to grow on her tall frame. With this muscle growth, her breasts seemed to push out even further, now defying gravity, as did her ass. Next, her hair started changing color to red, as it grew longer, already past her butt, stopping at her incredibly tight thighs.<br>\r\n\"Good enough for you?\" Billie asked with the most seductive voice he ever heard.</span></div></div>",
            "created":1339390800,
            "id":1357786,
            "title":"Have sex with her with a sexually enhanced body"
        },
        "151111":{
            "author_id":"quintes",
            "author_name":"Ej",
            "choices":[
                "Pussy",
                "Ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He nodded as she slowly walked over to him and unzipped his pants and taking off his boxers revealing his hard erection. She sinisterly smiles before expretly sucking him off making him cum easily. She asks, Where do you want to fuck?</span></div></span></div>",
            "created":1355372340,
            "id":1487098,
            "title":"Yes, yes it is"
        },
        "151112":{
            "author_id":"thecanadian",
            "author_name":"Canadian",
            "choices":[
                "Marty the furry",
                "No, another request"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Marty a furry? Ask Billie to become an anthro?</span></div></span></div>",
            "created":1402128900,
            "id":1808437,
            "title":"Nope, this would be even better"
        },
        "1511122":{
            "author_id":"damon416",
            "author_name":"DAMON",
            "choices":[
                "Yeah!!!!!!",
                "No, he doesn't "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Marty actually like short blonde girls with huge tits and ass?</span></div></span></div>",
            "created":1442269920,
            "id":2034558,
            "title":"No, another request"
        },
        "1512":{
            "author_id":"quintes",
            "author_name":"Ej",
            "choices":[
                "Yes",
                "Still no",
                "She teases him more"
            ],
            "content":"<div class=\"\"><div> <span>\"No, i can't, its wrong to do this.\"<br>\r\nBilly was shocked but she gave a small smile to Marty.<br>\r\n\"So you want to do this the hard way, by the time i'm done with you, you will be begging me to do this.\"<br>\r\nShe inched closely and seductively kissed him biting the his lower lip before releasing. She could see Marty's mouth start to quiver. But she didn't stop with that. She got off him and took off his pants and showing his large erection underneath his briefs.<br>\r\n\"Mmmm i knew you liked my body, but i wonder how much you liked this.\"<br>\r\n<br>\r\nShe took off his underwhere and reveals his hard dick to her. She then got back on top of the desk and sat on Marty's hip rubbing her ass on his dick.<br>\r\n\"Oooooooh please Billy, I-\" Marty couldn't speak as Billy layed her DD breast on top of his face.<br>\r\n<br>\r\n\"Well will you say no now?\"</span></div></div>",
            "created":1362244860,
            "id":1542375,
            "title":"Disagree"
        },
        "15122":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Marty takes the ten way",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I really want to Billy...God do I! But Mr Ziff is trusting me! Oooooooh please Billy, just get me off!\" he pleaded. She got off him, her face cold. \"You need a lesson!\" she said. A click of her fingers and Marty screamed. His genitals disappeared in a mist and reformed. A bald female body part took its place. A tingle ran through his body as he felt dizzy.<br>\r\n<br>\r\nA soft kiss on his lips woke him up. \"My, aren't we a sexy girl!\" declared Billy, showing him what he looked like with a mirror. He was a young and naked woman, greatly resembling Emma Watson from Harry Potter. \"NOOO! Please not this!\" he squealed. \"I will make you an offer! You agree and I guarantee you a 10 way with 9 girls before I turn you back! You refuse and I will turn you into a man hungry Nympho! Sucking, pounding, ploughing, spanking, all things guys in the school will do to you! So are you going to say no to lesbian sex?\" she teased.<br>\r\n<br>\r\nBefore Marty could answer, Billy knelt before his womanhood and planting a long french kiss. Marty swooned, wrapping her legs around Billy. Billy slipped away, grinning. \"Besides you aren't Marty anymore! You are Martina! Martina never promises Mr Ziff! Marty did and he is a guy! You're a sexy girl! There's your justification. So is keeping someone's promise worth being screwed first by the football team, then the basketball team, every male student and teacher including Mr Ziff? Then to be permanently horny for guys! Constantly needing heterosexual sex? Or would you rather another girl on kitty cat kiss, before a 10 way?\" she asked. </span></div></div>",
            "created":1397990520,
            "id":1783190,
            "title":"Still no"
        },
        "151221":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "please the girls",
                "secret submissive fantasy"
            ],
            "content":"<div class=\"\"><div> <span>Marty agreed immediately. There was no chance that she would take the risk that Billy was stating. Billy grinned as she removed her clothes. She reached for her phone and made a call. \"Just you wait, honey! Party time is on its way!\" she declared. The door opened, making Marty cover herself. Entering the room was Olivia Feltzer, April Torrington and Mary Motsky. <br>\r\n<br>\r\n\"Let's get started before Brenda, Cathy, Florence, Candy and Camille arrive!\" suggests Billy. To Marty's delight, Olivia and April's chest expanded to match Mary's. She gasped as her own increased a cup size. \"Okay girls, to warm up our lusty, little friend; I saw we all take a spot! I reserve Tina's lower lips!\" she declared, lifting Tina off the ground and spreading her legs. Mary began grabbing her cheeks. Olivia and April took each side of her chest.<br>\r\n<br>\r\nIt was like a concerto of pleasure. Tina buckled as the girls got stuck into her. Billy lifted her by the thighs, while she continued to lick and massage her tender front entrance with her tongue. Mary squeezed her firm globes as her tongue penetrated Tina’s back entrance, pleasing her greatly. Mary had often fantasised about finally having a girl and now that she was having one, she doubted she would ever want a man again.<br>\r\n<br>\r\nApril was no stranger to female love, having developed heavily romantic feelings for Olivia for a very long time. She agreed to her many escapades in the hope that one day; Olivia would realise that April was the one for her. Olivia was just enjoying tasting the flesh and erect body part in her mouth. Olivia cared only for the power of the sexual delights. Of course, monogamy was never gone to sit well with her. <br>\r\n<br>\r\nBut one day, she would enjoy a happy marriage with April, where they would sleep together with whoever they wanted to join them in their bed. Olivia had long since decided that she and April were destined for each other. Tina was moaning loudly as she was pleasured by 4 women. Each of her zones was granted ecstasy as they were stimulated to perfection. Bad luck to Mr Fiddler, the Principal and Mr Ziff, the teacher.<br>\r\n<br>\r\nShe groaned as she drove her further and further towards her climax. April and Olivia rubbed her firm young back as Billy stroked her thighs and Mary massaged those cheeks firmly. The combination of tongues and fingers quickly resulted in release flowing over Billy’s face. Billy quickly licked the source once last time, resulting in a further discharge of female intimate fluids before she called a halt to the session.<br>\r\n<br>\r\nThe 4 girls helped Tina back unto the table. “Well honey, looks like you enjoyed yourself greatly from our hard work! Now I have another offer for you! Either you can please us in return until the 5 other girls get it or we can tickle your pretty body instead! Make your choice quickly!” she advised. The truth was Tina knew exactly what offer to choose. She had dreamed about this since she was 14. She chose….</span></div></div>",
            "created":1398435960,
            "id":1786492,
            "title":"Marty takes the ten way"
        }
    },
    "info":{
        "author_id":"kgman6",
        "author_name":"Mr. Pink",
        "brief_description":"Senior year girls seduce a Straight-A student who is hiding the answers to the final exam.",
        "created":1288153080,
        "description":"<td align=\"left\" class=\"norm\">Third person perspective. The main character is Marty Zimp, a meek, shy senior 18-year old student at a high school. An avarage looking kid with brown hair. <br>\r\n<br>\r\nTakes place in a private school, with uniforms.<br>\r\n<br>\r\nHe gets commissioned by the principal to hide the answer sheets to the final exam at his house so they wouldn't get stolen from his office. However, several girls find out about this and try to seduce him to get the answers.<br>\r\n<br>\r\nAll girls must be senior eighteen year-olds. No underage.<br>\r\n<br>\r\nThe girls are:<br>\r\n<br>\r\n<b>Olivia Feltzer</b> - One of the three sluttiest girls in Marty's classclass. She is medium height, long blonde hair and has C-cup breasts and an alright ass. Always hangs out with her friend April.<br>\r\n<br>\r\n<b>April Torrington</b> - The second of the three sluttiest girls in Marty's class. She is tall and has long-brown hair along with DD-cup breasts and a big ass. Olivia's best friend, whom she always hangs out with.<br>\r\n<br>\r\n<b>Mary Motsky</b> - The third of the three sluttiest girls in Marty's class. She is kinda tall, has curly brown hair. She has the biggest boobs out of the class, with a G-cup and a big, round ass. Slightly chubby.<br>\r\n<br>\r\n<b>Brenda Saber</b> - Marty's best female friend. Openly bisexual. She has long brown hair with a cute face, along with moderately big B-cup boobs and a very juicy, big ass. She's a bit of a cocktease and despite being mostly into women, she enjoys teasing Marty and sometimes using her body to get something out of him.<br>\r\n<br>\r\n<b>Cathy Stephens</b> - A nice but ambitious girl who is one of your best friends. She is a bit of a tomboy. She is kinda short and wears her blonde hair in a pony-tail. She has a moderately big B-cup bust and a pretty fine ass. Best friends with Florence Morrisson.<br>\r\n<br>\r\n<b>Florence Morrisson</b> - Cathy's best friend who is smart but doesn't focus. She is medium height and has short brown hair which she wears in a pony-tail. She has a small but rather decent B-cup pair but the finest, juiciest ass in the class.<br>\r\n<br>\r\n<b>Candy Burt</b> - One of the class' smartest girls, but who couldn't study for the final exam and will do anything to pass. One of Marty's best female friends who has long black-hair. She has moderately large C-cups tits and a good ass.<br>\r\n<br>\r\n<b>Camille Gastling</b> - Considered the classes' hottest girl because of her very skinny frame, yet her unusually large D-cup breasts. Very sweet and kind, though not enough to be scrupulous. She has short light brown hair that she keeps in a ponytail.<br>\r\n<br>\r\n<b>Billie Dolph</b> - A cute and nice girl, who is kind of a cocktease but not a slut. She has long brown-hair and wears it in a pony-tail. She has small B-cup boobs but a nice, tight ass. She also hides some hidden powers...<br>\r\n<br>\r\nNo scat. No toilet. No feet worship. Any of that will be deleted. Also, authro reserves the right to delete chapters, especially if they have a lot of grammatical errors or are just badly-written and one paragraph long. Other than that, enjoy and have fun!</td>",
        "id":1719780,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1442269920,
        "modified":1442269920,
        "pretty_title":"High School Seduction"
    }
}