{
    "chapters":{
        "1":{
            "author_id":"mariogalaxy103",
            "author_name":"Alex ZZZ",
            "choices":[
                "You're a middle aged woman",
                "You're a fat teenage girl",
                "Choose",
                "Choose"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were exausted from school today and being so skinny you sucked in gym. You walk home half awake and a female trips and bumps into you. You get up anxious to go home then notice some VERY different changes when you look down!</span></div></span></div>",
            "created":1340341200,
            "id":1365009,
            "title":"What the...?"
        },
        "11":{
            "author_id":"thebeagle",
            "author_name":"the beagle",
            "choices":[
                "42 year old pear shaped 250 lb woman",
                "50 year old 100 lbs",
                "a very curvy 200 lb woman",
                "55 year old woman that looks even older then that",
                "45 year old 400 lb woman"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of woman are you?</span></div></span></div>",
            "created":1424113380,
            "id":1935164,
            "title":"You're a middle aged woman"
        },
        "115":{
            "author_id":"the_force",
            "author_name":"Midas",
            "choices":[
                "Hispanic, African American??",
                "Asian, other",
                "American?"
            ],
            "content":"<div class=\"\"><div> <span>After your collision, you wake up , and you don’t feel the greatest. You felt groggy, heavy and achy all of a sudden.<br>\r\n<br>\r\nWhen you came to, you see yourself in front of you on the ground. Freaking out you head towards your body. When you put your hand out, you notice red polished and manicured hands, that were also pudgy.<br>\r\n<br>\r\n“What the heck is going on” you ask yourself.  You also noticed that you had long hair and glasses. Your body also jiggled with each step. You had on sweats, your boobs were bigger than your average watermelon.<br>\r\n<br>\r\nThe shirt you are wearing is covering your belly which looks like you have eaten a couple of tires. You noticed a mirror on the other side of where your body is, you decided to walk over and get a good look at yourself. Waddling over you noticed that your a 45 year old 459 lb woman that was</span></div></div>",
            "created":1595143200,
            "id":2871456,
            "title":"45 year old 400 lb woman"
        },
        "1151":{
            "author_id":"the_force",
            "author_name":"Midas",
            "choices":[
                "African American?",
                "Hispanic?",
                "Other option?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you look like your Hispanic or African American?</span></div></span></div>",
            "created":1595261220,
            "id":2872037,
            "title":"Hispanic, African American??"
        },
        "1153":{
            "author_id":"the_force",
            "author_name":"Midas",
            "choices":[
                "Somewhere else.",
                "American",
                "It doesn’t matter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you American, or from somewhere else?</span></div></span></div>",
            "created":1595380380,
            "id":2872840,
            "title":"American?"
        },
        "12":{
            "author_id":"mrsqueejee",
            "author_name":"MrSqueejee",
            "choices":[
                "Choice 1",
                "Choice 2",
                "Choice 3",
                "Choice 4",
                "Custom Description"
            ],
            "content":"<div class=\"\"><div> <span>   You look at your hand. It is very different than it was before. More feminine, with painted nails, yet lustier and chubbier.<br>\r\n<br>\r\n   \"What the hell just happened?\" you say, and it comes out in a feminine voice.<br>\r\n<br>\r\n   \"Hey... need some help?\"<br>\r\n<br>\r\n   You look up and almost have a heart attack. Your own body is offering a hand to help you up. You take it, and he pulls you up.<br>\r\n<br>\r\n   \"Okay, I don't know how this happened, but it looks like you're in my body,\" says whoever is in your body, \"And you're probably in mine.\"<br>\r\n<br>\r\n   Looking down, you see your new form. You are a very fat female, probably in her terns.<br>\r\n<br>\r\n   \"What the hell? Why am I so fat? And a girl?!\" you exclaim, cupping an ample breasted in your sweaty hands.<br>\r\n<br>\r\n   \"Calm down... I don't exactly want to be in your scrawny body,\" says the fat girl in your body, \"By the way, my name's Beth.\"<br>\r\n<br>\r\n   \"I'm Ryan,\" you say, \"So what? We're trapped in each other's bodies?\"<br>\r\n<br>\r\n   \"Unfortunately, it looks like it,\" says Beth, \"So I guess for the time being, we'll pretend to be each other, okay? My house is right over there. We should meet here tomorrow at three. Pretend to be me, and don't do anything you don't think I would do.\"<br>\r\n<br>\r\n   Begrudgingly you agree to live the life of this fatass for a little while. <br>\r\n<br>\r\n   Walking towards Beth's house, you realize how different everything is. Walking is brutal, and you're almost out of breath by the time you get to her house. Not to mention your entire body jiggling with every movement.<br>\r\n<br>\r\n   You open the door.<br>\r\n<br>\r\n   Ok, first thing's first, you think, I have to find out what I look like.<br>\r\n<br>\r\n   You find a mirror and look into it. This is what you see looking back at you:<br>\r\n<br>\r\n<br>\r\n<br>\r\nChoice 1: <a rel=\"nofollow\" href=\"http://fuckyeahchubbygirls.tumblr.com/image/82084665303\" target=\"_blank\">http://fuckyeahchubbygirls.tumblr.com/im...</a><br>\r\n<br>\r\nChoice 2:  <a rel=\"nofollow\" href=\"http://fuckyeahchubbygirls.tumblr.com/image/83352334257\" target=\"_blank\">http://fuckyeahchubbygirls.tumblr.com/im...</a><br>\r\n<br>\r\nChoice 3:  <a rel=\"nofollow\" href=\"http://fuckyeahchubbygirls.tumblr.com/image/82272621704\" target=\"_blank\">http://fuckyeahchubbygirls.tumblr.com/im...</a><br>\r\n<br>\r\nChoice 4:  <a rel=\"nofollow\" href=\"http://fuckyeahchubbygirls.tumblr.com/image/82089304788\" target=\"_blank\">http://fuckyeahchubbygirls.tumblr.com/im...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1398315600,
            "id":1786229,
            "title":"You're a fat teenage girl"
        },
        "122":{
            "choices":[
                "Check out your body.",
                "Check out Beth's room.",
                "Beth's mother comes home early."
            ],
            "content":"<div class=\"\"><div> <span>When you look at the mirror you're a little surprised by the way Beth looks like. Her long red hair which was dyed brown round halfway. A cheery face with red cheeks. Green glasses which her green brown eyes. And then the rest of her body. When she swapped with you Beth was wearing a long blue dress with white spots, showing off an impressive cleavage. Her right arm had tattoos on them of several flowers. While your feet were encased in blue slippers. While she might now have been a knock out she certainly did have her charms. <br>\r\n<br>\r\n\"Especially these.\" You tell your reflection as you heave your impressive cleavage. Something that didn't go unnoticed as you feel your nipples twitching. <br>\r\n<br>\r\nRealizing what you were doing in the living room you quickly back off. There was time for that later. First you needed to check out your surroundings. You looked around the house, spotting several pictures of Beth and her parents. They looked like happy people, at least on the pictures everyone smiled. Going upstairs you saw Beth's parents owned an impressive bathroom, complete with shower cabin and a bath tub. You always wanted to take a bath, your friend David had one too, and you always liked it when you could take a bath at his place.<br>\r\n<br>\r\nYou finally found Beth's bedroom and sat down on the bed, feeling the bed creaking slightly from the added weight, not to mention the feeling of your wider ass. \"I could take a check, can't it?\" You asked yourself feeling your bottom. On the other hand you could check out Beth's room more. </span></div></div>",
            "created":1483300080,
            "id":2257570,
            "title":"Choice 2"
        },
        "1221":{
            "choices":[
                "Secretly start going for a morning run? ",
                "Start going to the gym?",
                "You start having sex with your body?"
            ],
            "content":"<div class=\"\"><div> <span>You strip and look at this body and realised although your fat you do look pretty but after going upstairs you still feel slightly out of breath.<br>\r\n<br>\r\nAlthough you hate exercise you know you have to start something to loose some waight of this body.<br>\r\n<br>\r\nYou study on a computer and check then find out that your.... this body is supposed to be around 8 to 9 stones for you hight but right now your about 15 stones.<br>\r\n<br>\r\nHow do you loose waight?</span></div></div>",
            "created":1489474680,
            "id":2289480,
            "title":"Check out your body."
        },
        "12212":{
            "author_id":"secondary2",
            "author_name":"Secondary",
            "choices":[
                "Keep searching her room",
                "Examine yourself further"
            ],
            "content":"<div class=\"\"><div> <span>With a heavy, reluctant sigh you resolve to start dragging this heavy body of yours to the gym. You may not have been athletic before, but not even being able to get up stairs without breathing heavily is ridiculous. If you're going to be stuck like this for a while you may as well do what you can to make it a little more bearable.<br>\r\n<br>\r\nStill naked, and feeling every jiggle and bounce of your new body, you rifle through Beth's dresser looking for something athletic to wear. You're not surprised that there really isn't anything resembling modern gym clothes, but there is a old pair of red sweatpants and some worn t-shirts that will work well enough for now. <br>\r\n<br>\r\nYou throw them on the bed and pull open her underwear drawer. As a young man you can't help but feel a thrill as you scrounge through her bras and panties to find some plain, sturdy-looking boy shorts and matching bra to go with your makeshift gymwear.</span></div></div>",
            "created":1518134280,
            "id":2450869,
            "title":"Start going to the gym?"
        },
        "122122":{
            "author_id":"secondary2",
            "author_name":"Secondary",
            "choices":[
                "Remember that box under her bed",
                "Stop touching yourself for now"
            ],
            "content":"<div class=\"\"><div> <span>You slump down on the bed, feeling exhausted from the day Beth had before you inherited her body. You look across the room at the small dresser mirror and see the image of a chubby girl laying back with her legs spread. Despite everything that's happened to you today, your teenage brain instinctively responds to the sight.<br>\r\n<br>\r\nYou can't quite see your lower body over your breasts and stomach in your current position, but in the mirror you have a great view of your new pussy. There is a small patch of light hair above a smooth, puffy slit. Momentarily forgetting your problems, you reach down and cautiously touch it, shivering and gasping as soon as your finger presses a little harder against your sensitive spots. <br>\r\n<br>\r\nReaching up to squeeze one of your huge tits, you start slowly rubbing what you assume to be your clit. You try to stifle your moans as you discover that touching yourself in Beth's body actually feels fantastic.</span></div></div>",
            "created":1518138300,
            "id":2450882,
            "title":"Examine yourself further"
        },
        "1221221":{
            "author_id":"secondary2",
            "author_name":"Secondary",
            "choices":[
                "See what else is in the box",
                "You hear the front door open downstairs"
            ],
            "content":"<div class=\"\"><div> <span>Awkwardly, you roll over to the edge of the bed and reach underneath, pulling out the box. Your hunch was right, and under a pile of random personal items there is a small, pink vibrator.<br>\r\n<br>\r\nYou grab it eagerly and fumble around with it until you figure out how to turn it on. Cautiously at first, you reach down between your legs with the humming toy and gently touch it to your pussy. <br>\r\n<br>\r\nImmediately you gasp and jump, a ripple running through your body as you are hot with jolts of pleasure. It doesn't take long for you to figure out what feels good and soon you are slowly circling your clit, covering your mouth with your other hand to try and stifle your moans. <br>\r\n<br>\r\nYou keep going until you feel something building up inside you. It isn't long before you are hit with your first orgasm as a female, and you start to groan out loud as you may on the bed, twitching and jiggling.<br>\r\n<br>\r\nEventually you feel like you can't anymore direct stimulation, and you drop the vibrator and slip a finger inside your pussy, which is now soaking wet. You've never felt anything penetrating your body before and you start moaning again as you work a second finger into your tight slit, curling them inside you. This sets you off again, and you are hit with a second, deeper climax that makes you whimper.<br>\r\n<br>\r\nFinally, gasping, you fall back on the bed and try to catch you breath. </span></div></div>",
            "created":1518283920,
            "id":2451366,
            "title":"Remember that box under her bed"
        },
        "12212211":{
            "author_id":"the_force",
            "author_name":"Midas",
            "choices":[
                "Tell Beth that you have a thing for her",
                "Go to the gym to make her happy."
            ],
            "content":"<div class=\"\"><div> <span>You look inside the box and noticed that there was a lot more toys that Beth has bought for herself.<br>\r\n<br>\r\n You eventually come across a diary. While reading the diary, you find out that she didn’t like how her body looked. One of the things that she has written down has surprised you big time. Beth had a huge crush on you. That was part of the reason why she didn’t like her body.<br>\r\n<br>\r\nSecretly, you had a thing for her to(especially since she was on the bigger side). Contemplating on what you do, you eventually decide to:</span></div></div>",
            "created":1571517720,
            "id":2735408,
            "title":"See what else is in the box"
        },
        "122122111":{
            "author_id":"the_force",
            "author_name":"Midas",
            "choices":[
                "The two of you end up having a little personal fun",
                "Fall asleep spooning."
            ],
            "content":"<div class=\"\"><div> <span>You decide to tell Beth how you really feel about her. She is happy that you like her as well and the fact you don’t care about her size.<br>\r\n<br>\r\nThe both of you talk for hours, getting to know about each other. In doing so, not realizing it, the both of you were cuddling and holding hands. Eventually the two of you end up kissing.<br>\r\n<br>\r\nIn doing so, what happens.</span></div></div>",
            "created":1595103540,
            "id":2871200,
            "title":"Tell Beth that you have a thing for her"
        },
        "1222":{
            "choices":[
                "Check out Beth's closet.",
                "Check out the box underneath Beth's bed.",
                "Check out Beth's computer."
            ],
            "content":"<div class=\"\"><div> <span>There were several things you could check out. You first notice the closet standing inside Beth's room. It probably holds Beth's clothes. Wearing a dress and all was fine, but you wouldn't mind changing into something less feminine. You grin as you also think about Beth's underwear drawer, your horny teenage mind couldn't help but wonder what kind of underwear Beth has. <br>\r\n<br>\r\nWhile sitting on Beth's bed you notice your feet are touching something when they swing backwards and it's not the bed itself. You step off the bed and crouch down, feeling your breasts pulling you down. Underneath the bed is a box or something, would Beth be hiding something inside of it?<br>\r\n<br>\r\nThere's also the computer standing in the room. While you are not really interested in Beth's personal life, the Internet would allow you to do one of your favorite pastimes: browsing the Internet. You don't have to worry about not be able to log in as Beth has a sticky note on the bottom of her screen showing the password.<br>\r\n<br>\r\nSo what should you do?</span></div></div>",
            "created":1498406520,
            "id":2342317,
            "title":"Check out Beth's room."
        },
        "124":{
            "choices":[
                "cry",
                "masterbate"
            ],
            "content":"<div class=\"\"><div> <span>You get home after giving her your contact information and you receive a text from Beth, the fat girl in your body. It says,\" hello Ryan how are you doing in my FAT body, because I love your SKINNY body. Yea and I love your pennies, the feeling is great.\"<br>\r\nSo anyway have fun in my body.</span></div></div>",
            "created":1446504960,
            "id":2056148,
            "title":"Choice 4"
        },
        "13":{
            "choices":[
                "Sure Minus",
                "No way",
                "20",
                "21",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a 23 year old?</span></div></span></div>",
            "created":1362805200,
            "id":1546850,
            "title":"Choose"
        },
        "131":{
            "choices":[
                "Take over this life, search the bag",
                "Head to your house",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Ryan stumbled for a moment, \"that was no regular bump,\" he thought to himself not taking into account the changes that now await him. He walked around a block or two thinking to himself \"did I get taller?,\" maybe he finally hit that growth spurt. After a few more blocks he began feeling that for some reason, he felt like he was breathing easier, maybe all those hours in the gym were finally paying off. Although he noticed, there was a strange feeling on his chest that he really couldn't put his finger on. He entered a Starbucks, where he usually went to relax after another hard day at the gym, and as he entered he looked down, shocked at what he saw. <br>\r\n<a rel=\"nofollow\" href=\"http://thechive.files.wordpress.com/2013/01/womans-pov-14.jpg\" target=\"_blank\">http://thechive.files.wordpress.com/2013...</a><br>\r\nHe was frozen for a moment, trying to think back to what may have caused this. The bump! It had to be, it was the only way this could have happened. He walked into the restroom, trying to see if he knew the person. But, he didn't walking home in the city was like a jungle, he made minimal eye contact with anyone just to avoid any problems. But, now he was stunned by the face he found in the mirror staring back at him. <br>\r\n<a rel=\"nofollow\" href=\"http://www.listofimages.com/wallpapers/2012/02/natural-beauty-beautiful-beauty-blue-eyes-brunette-face-female-girl-natural-smile-woman-1600x2560.jpg\" target=\"_blank\">http://www.listofimages.com/wallpapers/2...</a><br>\r\nHe, no she was a beautiful brunette who could stop the city in it's tracks. A small bag was residing in his clenched fist, funny he didn't even notice it, \"must be muscle memory,\" he thought. Then what lay on his new right hand shocked him. <a rel=\"nofollow\" href=\"http://images.teamsugar.com/files/upl1/0/3362/21_2008/engage.jpg\" target=\"_blank\">http://images.teamsugar.com/files/upl1/0...</a><br>\r\nNot only was he someone else, he was someone's wife or fiance. There was someone in this city who loved him now, simply because of who he became by sheer luck. Ryan was taken aback, he was a ward of the state, an orphan. The only homes he knew were foster homes. And now he's someone who may have a loving family and definitely a loving partner simply because of the size of this rock. What to do? </span></div></div>",
            "created":1362805200,
            "id":1546869,
            "title":"23 "
        },
        "1311":{
            "choices":[
                "Order something while searching the bag",
                "Leave the place",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Ryan grinned at himself for a moment, her perfectly straight teeth showing. <br>\r\n\"Well, here goes nothing,\" she said to herself, embarking on a true voyage into self discovery if there ever was one. She searched through the bag finding a small wallet which contained her new identity.<br>\r\n\"Well, it seems I'm Mrs. Destiny Mitchell,\" she said aloud finding the small wedding photo of her new self laughing with her husband. \"Not bad,\" she said, the guy in the suit looked ripped even in a suit. She walked out of the Starbucks restroom taking in account the lack of people in the place. </span></div></div>",
            "created":1367211600,
            "id":1580800,
            "title":"A Hostile Takeover of Sorts"
        },
        "14":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "a cosplay preteen that is underdeveloped",
                "a videogame loving 10 year old",
                "a 5 year old that loves cats and dressing like them",
                "a mature 3 year old child genius",
                "your choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these options?</span></div></span></div>",
            "created":1402894800,
            "id":1813252,
            "title":"A Young little girl"
        },
        "141":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "sailor moon",
                "card captor sakura",
                "others"
            ],
            "content":"<div class=\"\"><div> <span>Ryan remembered turning the corner and a young girl that looked no older then a five year old ran right into him. The two of them tumble and black out. Ryan slowly started to open his eyes feeling a pounding sensation in his head as he was staring up at the sky. \"Watch where your running.\" He stated but quickly noticed the pitch and sound of his voice was way off and was that of a girls. Blinking he looked down at himself in a _____ costume and wearing pull ups diapers.</span></div></div>",
            "created":1403326800,
            "id":1815748,
            "title":"a cosplay preteen that is underdeveloped"
        },
        "1413":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "pita ten",
                "Tokyo new mew",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Any of these?</span></div></span></div>",
            "created":1403413200,
            "id":1815864,
            "title":"others"
        },
        "143":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "they go home",
                "they go to the beach",
                "try to go to a different body"
            ],
            "content":"<div class=\"\"><div> <span>Opening your eyes you feel weird as you look around you before you take in your body. You was wearing a black hoodie with a white belly and cat ears on top of the hoodie. Below that was a black skirt that followed the same pattern, but from under the skirt behind you came out a cat like tail. Reaching down with tour tiny hand you gently grabbed it. Taking in the size of your hand you blink for a moment before the tail twitched in your hand making you let it go. \"Rain, you okay?\" Asked a tall man and a beautiful lady next to him. That was the name of the girl you switched with.<br>\r\n<br>\r\nNodding your head you watched as he picked you up and smiled at you. \"Is the tail working still?\" He asked and watched it sway. He was an exper in nano technology in the field of prosthetics. Seeing how his daughter loved cats so much he programmed and developed the tail and ears which you felt twitch under the hood. \"You hear me still right, your deft with our the automated ear receivers.\" He stated which gave you more knowledge of the girl you took control of.<br>\r\n<br>\r\n\"Oh, you tore your skirt a little.\" The lady sighed and you watched her look it over. \"I'll fix it and make a new dress for you when we get home.\" She smiled, and you recognized her as a famous clothes designer. You only smile and nod your head not sure what to say yet to your new body's parents. You laid against the man and rested your head on his shoulder as you watched your old body run off as if nothing changed for it. Sighing lightly you watched from the view of your new body as your robotic tail swayed and your ears twitched to pick up sounds around you.</span></div></div>",
            "created":1404621720,
            "id":1823362,
            "title":"a 5 year old that loves cats and dressing like ..."
        },
        "145":{
            "author_id":"peremos",
            "author_name":"Peremos",
            "choices":[
                "yes",
                "no",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a female ( obviously ) anime cosplayer?</span></div></span></div>",
            "created":1489146000,
            "id":2287458,
            "title":"your choice"
        }
    },
    "info":{
        "author_id":"mariogalaxy103",
        "author_name":"Alex ZZZ",
        "brief_description":"Ryan is running and bump into a girl and swap bodies with them! Let your imagination wild!",
        "created":1340390760,
        "description":"<td align=\"left\" class=\"norm\">Ryan a short skinny indian kid always wished he was more powerful though he swaps bodies with a female will this work in his favor or will he be worse off! what will the person he swaps with react like?</td>",
        "id":1875263,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595380380,
        "modified":1595380380,
        "pretty_title":"Body Swap completely random!"
    }
}