{
    "chapters":{
        "1":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Red: Volcanic-themed dungeon",
                "Blue: Aquatic-themed dungeon",
                "Green: Jungle-themed dungeon",
                "Yellow: Desert-themed dungeon",
                "Black: Mystery-themed dungeon"
            ],
            "content":"<div class=\"\"><div> <span><b>Bio:</b> <a rel=\"nofollow\" href=\"https://i.imgur.com/dRGcPvC.png\" target=\"_blank\">https://i.imgur.com/dRGcPvC.png</a><br>\r\n<br>\r\nRebecca was a fair-skinned teenager, 169 cm centimeters tall. She had a thin, voluptuous, hourglass figure with well-endowed breasts. She had pink colored eyes, and long, light-pink hair which she wears in a braid that splits off into two strands starting at her temples and framing her face. She was considered extremely attractive and beautiful by the other gladiators<br>\r\n<br>\r\nAs a gladiator, she wore protective gear made of bronze which includes a scale armor bikini, a ridge helmet, and a pair of greaves. She wore a turquoise paludamentum and a pair of brown gloves. Her right hand was equipped with a medieval double-edged long sword which from the ground up almost reaches her shoulders. She also carried a rounded shield on her left arm.<br>\r\n<br>\r\nFrom the fighter’s preparation room, the ex-princess stepped through a long, arched hallway, heading towards the light and the sound of an audience’s raucous voices. The “Undefeated Woman” had appeared in the colosseum with four cardinal walkways towards the stage surrounded by a moat of water. There were three levels of seating, packed with civilians from the kingdom. On the north side, there were three monitors angled in different directions with the screens portraying the pink-haired warrior stepping onto the stage. <br>\r\n<br>\r\nAbove the screens was a platform where the announcer spoke to the crowd to commence the event. The brown-haired man had the appearance of a Spartan warrior, wearing a golden helmet, a breast plate, and a cape that was white on the outside and red on the inside. He was the commentator who would regularly commentate on the colosseum events live.<br>\r\n<br>\r\n“Ladies and Gentlemen. Today’s event is a once in a lifetime chance for one of our gladiators to gain her freedom. The Undefeated Woman, Rebecca, has agreed to undergo a dungeon trial where she will face all forms of obstacles and challenges. Five different teleportation circles had been prepared on the stage. She will choose to step on one of them which will transport her to the dungeon. If she can escape the dungeon, she will gain her freedom right then and there. But as she’s undergoing the trial, we will have constant footage of her broadcasted to you all.”<br>\r\n<br>\r\nThere were five teleportation circles placed along the perimeter of the circular stage, forming a pentagon.<br>\r\n<br>\r\nThe <span class=\"cred\"><b>red </b></span>magic circle would lead to a volcanic-themed dungeon.<br>\r\nThe <span class=\"clblue\"><b>blue </b></span>magic circle would lead to an aquatic-themed dungeon.<br>\r\nThe <span class=\"cgreen\"><b>green </b></span>magic circle would lead to a jungle-themed dungeon.<br>\r\nThe <span class=\"ctan\"><b>yellow </b></span>magic circle would lead to a desert-themed dungeon.<br>\r\nThe <span class=\"cblack\"><b>black </b></span>magic circle would lead to a mystery-themed dungeon.<br>\r\n<br>\r\nStanding at the center of the five colorful teleportation circles, Rebecca had to make a choice that will dictate the type of dungeon she would undergo. <br>\r\n<br>\r\nWhich should she choose?<br>\r\n<br>\r\n</span></div></div>",
            "created":1600576080,
            "id":2906587,
            "title":"Choosing the Dungeon "
        },
        "11":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "The Forest of Rocky Towers",
                "The Skull-Shaped Formation",
                "The Steel Tower in the Crater",
                "The Volcano Riddled with Caves",
                "Wait and see what the winged creatures are"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca was prepared for what is to come. After a deep breath to calm her nerves, she strode towards the red magic circle with both hands armed with a sword and shield, ready to face the unknown challenge that awaits her. Her pink eyes gazed at the glowing design on the edge of the stage with inner circles, triangles, a hexagon, and strange symbols as if they were written words from an ancient foreign language. <br>\r\n<br>\r\nThe moment the gladiator stood at the center; a pillar of red demonic light shot straight up. The audience, stage, and the sky were all tinted in a fiery red aura until the world she once knows had been completely faded from her vision. Vertigo overwhelmed her senses until she blacks out.<br>\r\n<br>\r\nShe woke up, finding herself lying on her stomach against a warm, rocky surface with hot air pressing against her bare skin. Lethargically standing up, the warrior held her sword and shield firmly as she observed her new environment. <br>\r\n<br>\r\nAs far as she could see, the ground was broken apart into landscapes of blackish-grey islands with glowing, molten lava in between. The air felt uncomfortably hot to breathe down her throat. <br>\r\n<br>\r\nIn the far distance ahead, there was a forest of towering protrusions of rocks, sticking up, standing as high as skyscrapers. A layer of foggy ash obscured the top, covering the sky in grey.<br>\r\n<br>\r\nTo her left, there was a massive skull-shaped formation with a glowing orange light emanating from the open mouth as if it were an entrance. <br>\r\n<br>\r\nTo her right, there was a large crater on the ground which served as the foundation for a large, rectangular tower made of dark steel. It appeared to be the only manmade structure she could find right now.<br>\r\n<br>\r\nTo her rear, there was a large volcano with rivers of lava trickling down a steep slope, diverging and converging like a stream of water would, all pouring into a pool below. There were various dark spots along the mountainside which appeared to be caves.<br>\r\n<br>\r\nUp above her, a swarm of silhouettes loomed in the ashes. They were likely kilometers away from her, but she could make out bat-like wings and humanoid shaped bodies, and they appeared to be flying towards her direction.<br>\r\n<br>\r\nThis hell-like region must be the dungeon she had be teleported to. The magic circle that brought her here was nowhere to be found. Without the slightest clue on how to pass the dungeon, all she could do was to explore.<br>\r\n<br>\r\nWhere should she head towards?</span></div></div>",
            "created":1600829760,
            "id":2908420,
            "title":"Red: Volcanic-themed dungeon"
        },
        "12":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "The Wall of Ice",
                "The Waterfall",
                "The Misty Geysers",
                "The Lake",
                "Dive into one of the small openings between the ice"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca was prepared for what is to come. After a deep breath to calm her nerves, she strode towards the blue magic circle with both hands armed with a sword and shield, ready to face the unknown challenge that awaits her. Her pink eyes gazed at the glowing design on the edge of the stage with inner circles, triangles, a hexagon, and strange symbols as if they were written words from an ancient foreign language. <br>\r\n<br>\r\nThe moment the gladiator stood at the center; a pillar of blue demonic light shot straight up. The audience, stage, and the sky were all tinted in a mystic blue aura until the world she once knows had been completely faded from her vision. Vertigo overwhelmed her senses until she blacks out.<br>\r\n<br>\r\nShe woke up, finding herself lying on her stomach against a cold, icy surface with cold air pressing against her bare skin. Lethargically standing up, the warrior held her sword and shield firmly as she observed her new environment. <br>\r\n<br>\r\nThere was a layer of ice as far as she could see, fractured apart with water in between. There was a heavy downpour from the rainclouds in the grey sky, leaving her soaked. It was so cold that she could see a puff of air for each breath exhaled from her mouth. Her bikini armor was not suited for this chilly environment.<br>\r\n<br>\r\nIn the far distance ahead, there was massive white wall that appeared to be made of pure ice with light snow dwindling from above. <br>\r\nTo her left, there was a massive waterfall from an icy sloped structure. The roaring sound of the water was partly drowned out by the rain. <br>\r\n<br>\r\nTo her right, there were hot steaming geysers occasionally shooting up from various spots. A layer of mist obscured the area.<br>\r\nTo her rear, there was a large lake with a strange light glowing from below.<br>\r\n<br>\r\nBeneath her feet, she could see a swarm of creatures swimming in the waters below the layer of ice. There were numerous small openings that could lead her underwater. <br>\r\n<br>\r\nThis icy, wet region must be the dungeon she had be teleported to. The magic circle that brought her here was nowhere to be found. Without the slightest clue on how to pass the dungeon, all she could do was to explore.<br>\r\n<br>\r\nWhere should she head towards?<br>\r\n</span></div></div>",
            "created":1600831140,
            "id":2908428,
            "title":"Blue: Aquatic-themed dungeon"
        },
        "13":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "The Swamp",
                "The Ravine",
                "The Scent of Smoke",
                "The Weird Exotic Plants",
                "The Treehouse"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca was prepared for what is to come. After a deep breath to calm her nerves, she strode towards the green magic circle with both hands armed with a sword and shield, ready to face the unknown challenge that awaits her. Her pink eyes gazed at the glowing design on the edge of the stage with inner circles, triangles, a hexagon, and strange symbols as if they were written words from an ancient foreign language. <br>\r\n<br>\r\nThe moment the gladiator stood at the center; a pillar of green demonic light shot straight up. The audience, stage, and the sky were all tinted in a lush green aura until the world she once knows had been completely faded from her vision. Vertigo overwhelmed her senses until she blacks out.<br>\r\n<br>\r\nShe woke up, finding herself lying on her stomach against a layer of soft grass with warm, humid air pressing against her bare skin. Lethargically standing up, the warrior held her sword and shield firmly as she observed her new environment. <br>\r\n<br>\r\nThere was nothing but towering trees she could see with exotic plants and fungi here and there. There was a slight drizzle from above as she stood beneath the shade of one of the enormous trees. The ground was uneven with wild mossy roots winding and twisting amount. Some of the branches above appeared almost like bridges that linked between the trunks. Vines dangled like hair. And there was a layer of light mist above her.<br>\r\n<br>\r\nIn the far distance ahead, the layer of mist grew thicker, unusually so compared to the rest of the cardinal directions. The ground looked darker as if it were muddier. Was there a swamp over there? <br>\r\n<br>\r\nTo her left, she took notice of a ravine along the ground. <br>\r\n<br>\r\nTo her right, she could scent of smoke linger in the air as if someone had made a campfire.<br>\r\n<br>\r\nTo her rear, the plants appeared to grow more and more exotic.<br>\r\n<br>\r\nUp above, she noticed a treehouse in one of the high branches, obscured by the mist. <br>\r\n<br>\r\nThis jungle must be the dungeon she had be teleported to. The magic circle that brought her here was nowhere to be found. Without the slightest clue on how to pass the dungeon, all she could do was to explore.<br>\r\n<br>\r\nWhere should she head towards?<br>\r\n</span></div></div>",
            "created":1600831860,
            "id":2908436,
            "title":"Green: Jungle-themed dungeon"
        },
        "14":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Pyaramid",
                "Sphinx",
                "The Civilization",
                "Strange moments in the sand",
                "Let's wait and see what that thing in the sky is."
            ],
            "content":"<div class=\"\"><div> <span>Rebecca was prepared for what is to come. After a deep breath to calm her nerves, she strode towards the green magic circle with both hands armed with a sword and shield, ready to face the unknown challenge that awaits her. Her pink eyes gazed at the glowing design on the edge of the stage with inner circles, triangles, a hexagon, and strange symbols as if they were written words from an ancient foreign language. <br>\r\n<br>\r\nThe moment the gladiator stood at the center; a pillar of yellow demonic light shot straight up. The audience, stage, and the sky were all tinted in a sandy yellow aura until the world she once knows had been completely faded from her vision. Vertigo overwhelmed her senses until she blacks out.<br>\r\n<br>\r\nShe woke up, finding herself lying on her stomach against hot sand with dry, scorching air pressing against her bare skin. Lethargically standing up, the warrior held her sword and shield firmly as she observed her new environment. <br>\r\n<br>\r\nThere was nothing but sand throughout the terrain with an unobstructed blue sky where the bright sun can beam down against her. Dunes of sand shaped the region like stationary waves. If she stayed out here any longer, she feared of getting a sunburn with how much skin she was revealing. Her body was already beginning to sweat and finding a source of hydration was immediately prioritized in her mind. She lifted her round shield over her head, using it to offer her shade from the harsh sunlight.<br>\r\nIn the far distance ahead, there was a massive pyramid. <br>\r\n<br>\r\nTo her left, she took noticed of a large sphinx.<br>\r\n<br>\r\nTo her right, she saw what appeared to be a civilization of some sort.<br>\r\n<br>\r\nTo her rear, she saw strange moments in the sand. Was something moving beneath the surface?<br>\r\n<br>\r\nUp above, she noticed a bizarre, unidentifiable, disk-shaped object moving through the air at unusual speeds with sharp angled maneuvers.<br>\r\n<br>\r\nThis desert must be the dungeon she had be teleported to. The magic circle that brought her here was nowhere to be found. Without the slightest clue on how to pass the dungeon, all she could do was to explore.<br>\r\n<br>\r\nWhere should she head towards?<br>\r\n</span></div></div>",
            "created":1600832880,
            "id":2908439,
            "title":"Yellow: Desert-themed dungeon"
        },
        "15":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "The Mansion",
                "The Village",
                "The Woods",
                "The Tall, Slender, Faceless Man",
                "Wait, one of the tombstones seemed to have moved...."
            ],
            "content":"<div class=\"\"><div> <span>Rebecca was prepared for what is to come. After a deep breath to calm her nerves, she strode towards the green magic circle with both hands armed with a sword and shield, ready to face the unknown challenge that awaits her. Her pink eyes gazed at the glowing design on the edge of the stage with inner circles, triangles, a hexagon, and strange symbols as if they were written words from an ancient foreign language. <br>\r\n<br>\r\nThe moment the gladiator stood at the center; a pillar of black demonic haze shot straight up. The audience, stage, and the sky were all tinted in a gloomy black miasma until the world she once knows had been completely faded from her vision. Vertigo overwhelmed her senses until she blacks out.<br>\r\n<br>\r\nShe woke up, finding herself lying on her stomach against a baren ground with cool air pressing against her bare skin. Lethargically standing up, the warrior held her sword and shield firmly as she observed her new environment. <br>\r\n<br>\r\nShadows everywhere. It was nighttime with gloomy grey clouds. No stars could be seen, but a full moon offered its dim white light while being obscured by the haze above. Tombstones surrounded where she stood on this lifeless ground. She was currently at a graveyard.<br>\r\n<br>\r\nIn the far distance ahead, there was large mansion with no lights from any of the windows.<br>\r\n<br>\r\nTo her left, she saw a small village of sorts with some orange lights.<br>\r\n<br>\r\nTo her right, there was the woods where the trees did not have a single leaf on its branches. Dry, decaying autumn leaves scattered across. <br>\r\n<br>\r\nTo her rear, her heart sank as she saw a tall, slender man in the far distance, wearing what appears to be a suit with faceless white head. If it had eyes, they would be staring right at her.<br>\r\n<br>\r\nThis lifeless, shadowy environment must be the dungeon she had be teleported to. The magic circle that brought her here was nowhere to be found. Without the slightest clue on how to pass the dungeon, all she could do was to explore.<br>\r\n<br>\r\nWhere should she head towards?<br>\r\n</span></div></div>",
            "created":1600833780,
            "id":2908444,
            "title":"Black: Mystery-themed dungeon"
        }
    },
    "info":{
        "author_id":"masuta",
        "author_name":"Zero",
        "brief_description":"Rebecca, a gladiator and former princess, ventures into a dungeon to regain her freedom.",
        "created":1600573200,
        "description":"<td align=\"left\" class=\"norm\">Rebecca was born in the kingdom of Dressrosa as the granddaughter of the king. She once lived a happy life in a small cottage just outside of the kingdom. She used to pick flowers together with her mother and then sell them in town.<br>\r\n<br>\r\nWhen she was six years old, a powerful crew of pirates had taken over her kingdom and usurped the king with a tyrant. Rebecca saw the royal palace burning. After two days on the run, she grew hungry and asked her mother for food. Her mother decided to gather food for them both, leaving her behind but promising to return shortly. But her mother never came back alive.<br>\r\n<br>\r\nWhen she turned fourteen, Rebecca was captured by the pirates and was forced to become a gladiator at the Corrida Colosseum. Throughout the next two years, she earned the title of \"undefeated woman\" as she has never lost a fight, but at the same time, she was bullied by other gladiators. Her mother had taught her not to hurt people, so she won her battles by having her opponents fall out of the ring without directly injuring them.<br>\r\n<br>\r\nHer style of swordsmanship was completely defensive in nature, exploiting her opponents' strength and momentum to defeat them. Speed and evasiveness were her primary characteristics in combat, and as a consequence, her body showed no signs of scars.<br>\r\n<br>\r\nAnyone caught rebelling against the tyrant were placed inside prisons under the Colosseum, and were given the condition that any fighter who wins a thousand matches earns their freedom. Most barely lasted a hundred fights, and any attempt to escape would result in their execution.<br>\r\n<br>\r\nNow sixteen years old, Rebecca, a convicted gladiator and ex-princess, was offered a way to gain her freedom by traversing through a dungeon. She did not enjoy harming other people, and this would bypass the condition of needing a thousand wins. Thus, she accepted the rare offer.<br>\r\n<br>\r\n<b>Gallery:</b> <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.imgur.com/nAQKXWD.png\" target=\"_blank\">https://i.imgur.com/nAQKXWD.png</a></td>",
        "id":2232787,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1600830218/item_id/2232787.png",
        "last_full_update":1600833780,
        "modified":1600833780,
        "pretty_title":"Dungeon Trials - Rebecca, The Gladiator"
    }
}