{
    "chapters":{
        "1":{
            "author_id":"iamadawg",
            "author_name":"DudeAlex",
            "choices":[
                "Alex",
                "Theresa (Mom)",
                "Dad (Jerry)",
                "Justin",
                "Jake"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One day when a family member of the Russo's decides to swap bodies with a spell where you have to swap clothes and say \"You be me, I'll be you, magic swap us.\"<br>\r\n<br>\r\nWho's the one that wants to swap bodies?</span></div></span></div>",
            "created":1284267600,
            "id":955779,
            "title":"Beginning"
        },
        "11":{
            "author_id":"night115",
            "author_name":"Handle",
            "choices":[
                "Alex's Mom Comes Downstairs",
                "Alex keeps putting on all of her Mom's clothes."
            ],
            "content":"<div class=\"\"><div> <span>Alex thought that maybe se should swap with her mom.<br>\r\nShe walked down stairs, and ran into Justin on the way.<br>\r\n\"Hey, if your going into the lair, take this washing\".<br>\r\n<br>\r\n\"Ok this is gonna be fun!\" Alex thought. There was a lot of clothes in their but she saw some of her Mom's clothes. So she took off her shirt and bra, going to put on her Mom's bra.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1292883600,
            "id":1019084,
            "title":"On the way up"
        },
        "111":{
            "author_id":"night115",
            "author_name":"Handle",
            "choices":[
                "Tell her what your doing.",
                "Make up something (your choice)"
            ],
            "content":"<div class=\"\"><div> <span>Alex then try's to put on her Mom's bra but then realizing that her Mom would have to wear her clothes to in order for it to work. Seconds later, Theresa (Alex's Mom) sees this and asks Alex \"Alex what are you doing?\" You then decide to tell her the truth or make up something.</span></div></div>",
            "created":1292884080,
            "id":1019100,
            "title":"Alex's Mom Shows Up"
        },
        "112":{
            "choices":[
                "he continues to play with his body ",
                "he goes to  find alex in his body"
            ],
            "content":"<div class=\"\"><div> <span>but then justin finds the switch bodies spell and trys on alex clothes and swap bodies with her . He lkes his new body and starts to feel up this body he plays with his new breasts and admires them he decides to take off his clothes and hav some more fun with his new body.</span></div></div>",
            "created":1306104420,
            "id":1110903,
            "title":"Alex keeps putting on all of her Mom's clot..."
        },
        "1121":{
            "choices":[
                "Ooo Noo..!! Moom I am Youu",
                "Yes! ( I am Alex..!! ( Boobs Boobs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bodyy swap Alex and mom Yeaah!!</span></div></span></div>",
            "created":1310930400,
            "id":1149396,
            "title":"he continues to play with his body "
        },
        "11211":{
            "choices":[
                "Teresa ( alex ) quiere cambiar de cuerpo con justin",
                "Alex (Teresa) Va al baño a toquetearse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alex: Noo..!! Umm... Yeah ahora zii nadie me podra decir que hacer<br>\r\nTeresa: Yes! ( Quiero tocarme este trasero y estos senos tan grandes que tiene alex ) Ya quiero ir al sanitario</span></div></span></div>",
            "created":1310930580,
            "id":1149397,
            "title":"Ooo Noo..!! Moom I am Youu"
        },
        "1122":{
            "choices":[
                "he ask mum what she is doing.",
                "he wen to change back into his own body to stop his mum"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>alex now in his mum body, went and found his mum playing with her new dick and enjoying it.</span></div></span></div>",
            "created":1306486200,
            "id":1113714,
            "title":"he goes to  find alex in his body"
        },
        "12":{
            "author_id":"elgoodmaster",
            "author_name":"el goodmaster",
            "choices":[
                "Alex",
                "justin",
                "Jerry",
                "Max",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does she want to swap with?</span></div></span></div>",
            "created":1300426020,
            "id":1071961,
            "title":"Theresa"
        },
        "13":{
            "choices":[
                "switch with alex",
                "switch with harper"
            ],
            "content":"<div class=\"\"><div> <span>jerry finds the spell and contemplates on who to switch first until he hears his wife theresa coming up to him so he says the magic words and boom he's theresa, now theresa is a little confused and when she sees her old body decided she wanted to stay like this and was going to have fun that night in bed...what will the new theresa do now?</span></div></div>",
            "created":1301963940,
            "id":1082120,
            "title":"Dad (Jerry)"
        },
        "131":{
            "choices":[
                "Jerry decides he wants his body back.",
                "Jerry (in Alex's body) checks out his new body.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>He then switches his new body (Theresa's body) with Alex on accident while putting on Alex's clothes not realizing that they were Alex's clothes that were beside the bed because she told Jerry (in Theresa's body) to wash her clothes. He is now Alex, Theresa is Jerry, and Alex is Theresa.</span></div></div>",
            "created":1306102740,
            "id":1110882,
            "title":"Switch with Alex"
        },
        "1312":{
            "choices":[
                "Alex (in Theresa's body) checks out her new body.",
                "Theresa (in Jerry's body) checks out her new body."
            ],
            "content":"<div class=\"\"><div> <span>Jerry discovers that his penis is gone and that he now has teenage breasts. He runs to the bathroom and discovers that he is now in Alex's body. Exhausted, Jerry decides it's time for a hot bath. In the tub, he suddenly feels pleasure while rubbing his wet breasts and vagina.<br>\r\n<br>\r\nJerry then slaps himself. \"What is wrong with me?!\" he shouts.</span></div></div>",
            "created":1338535080,
            "id":1349689,
            "title":"Jerry (in Alex's body) checks out his new b..."
        },
        "13121":{
            "author_id":"cjones2009",
            "author_name":"caleb jones",
            "choices":[
                "Shoe store. A salesman named Al Bundy invited Jerry to try on somenew shoes!",
                "Victoria's secret. Alex still slept in PJ's. Jerry/Alex prefered sexy nighties!"
            ],
            "content":"<div class=\"\"><div> <span>As he soaked in the tub exploring the youthful curves of his new body, Jerry realized that, as Alex, he could use magic again!  Since everyone knew Justin would win, Jerry decided that he would cast a spell of acceptance, making everyone comfortable in their new bodies, and get the family contest sped up to a week from now.  Justin still had a lot to learn and Jerry already knew it all as their teacher, so he would obviously be the winner, and could spend the rest of his life as a youthful Wizard.<br>\r\n<br>\r\nIt would of course also mean living in his daughter's beautiful body for the rest of his life.  He squeezed his soft and soapy new breasts, and sighed with feminine pleasure.  He could live with that!  He got out of the tub and still nude, spelled himself through the walls into daughter Alex's room.<br>\r\n<br>\r\nHis new boobs bounced with every move he made and he decided to put on a bra.  Picking a pretty one out of an open drawer, he looked at it and saw a tag.  32C.  His daughter had grown up so fast!  And so big!  No wonder she had to fight off all those boys... Boys who would want to date HIM now.   Jerry pictured it in his mind and the image sent a surprisingly pleasurable tingle down his feminine spine.  His mind might be male but his new body was 100% female!<br>\r\n<br>\r\nPutting on the bra meant adjusting the breasts, and playing with 'the girls' as his wife liked to call them, felt quite nice. <br>\r\n<br>\r\nHe impulsively pulled out a sexy dress Alex like to wear and tugged it on.  A pair of high heels and some hoop earrings finished his first 'outfit' as  a girl.  Looking in the mirror, Alex looked good... which meant he looked good!<br>\r\n<br>\r\nGrabbing his daughter's wand he spelled himself to the mall.  He had a sudden urge to buy something pretty for himself...<br>\r\n<br>\r\nJerry enters a...</span></div></div>",
            "created":1396606080,
            "id":1773230,
            "title":"Jerry has a plan!"
        },
        "131212":{
            "author_id":"cjones2009",
            "author_name":"caleb jones",
            "choices":[
                "Next, Jerry runs into Alex's new boyfriend...",
                "Jerry moves on to more shopping. He wants his own look, not Alex's..."
            ],
            "content":"<div class=\"\"><div> <span><b>Jerry wizarded himself to appear in the mall where no one would see him.  Or rather see Alex, as he now occupied his daughter's beautiful body.  <br>\r\n<br>\r\nSince his new teen girl's body was growing up, he decided it was time to buy some more grown-up clothing for it.  So Jerry entered the local Victoria's Secret. He blushed, expecting to get angry stares as a man in such feminine territory, but realized that wearing his daughter's body was like free pass into the place.  The only looks he got was from a saleswoman who probably suspected all teenagers of being up to no good.  <br>\r\n<br>\r\nThe little girl plain white underwear he was wearing on his new body was too childlike for his tastes.  So he checked out the bra section until he saw matching sets of underwear on sale. His large busted wife had often complained about trying on many bras until she found the right one.  Now possessing a decent sized bust of his own (or rather his daughters) in a plain white bra, he decided to buy a few sexier bras.  Jerry remembered that his new bra size was 32C so he picked out several to try on, plus a few with thongs.  He had often wondered if they were comfortable or not and now he had the opportunity and the body to find out!  <br>\r\n<br>\r\nNext he decided that there would be no more PJ's for his new body.  Curves like the ones he now possessed should be appealing even during sleep, so he looked for several nighties that would make his new body look fantastic.  He took them to the changing area.  There were several women in various states of dress -and undress- asking each other for opinions.  Feeling daring, he walked right up to a hot lady in a hot red bikini and told her that she looked great in that suit.  Mostly Jerry wanted a closer look at her rockin' bod!  The woman thanked him and said she was going to buy it.  <br>\r\n<br>\r\nVictoria's Secrets would appreciate that sale, Jerry thought.  'Maybe they should hire me to stay back here and hand out compliments...' <br>\r\n<br>\r\nAfter admiring his new body in all the clothing he wanted to try on, he selected the best and most appealing and bought them.  His wife was right.  Despite having the same size on the tags, some bras and nighties were either too tight or too loose.  But some were just right...<br>\r\n<br>\r\nHe didn't notice the concern on the saleswoman's face as he paid and left the store.  Still being male-minded despite having a body any woman would envy, he had chosen clothing that appealed to his male mind for his female body.  The saleswoman thought it odd that a young girl bought clothes that would appeal to older men.  Men like Jerry...<br>\r\n<br>\r\n<br>\r\n</b></span></div></div>",
            "created":1397387160,
            "id":1778169,
            "title":"Victoria's Secret. Alex still slept in PJ..."
        },
        "1313":{
            "choices":[
                "alexs tits grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>casts a spell and it back fires</span></div></span></div>",
            "created":1309517820,
            "id":1138324,
            "title":"Something else."
        },
        "14":{
            "author_id":"iamadawg",
            "author_name":"DudeAlex",
            "choices":[
                "Decide to tell her the truth and switch back.",
                "Stay like this forever.",
                "Tell Alex to get out of \"your\" house."
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm. Maybe I could try this on Alex\" Harper thought. Alex always showed off her body in front of guys and she never got to because she didn't look nearly as good as Alex. Alex needed to taste of her own medicine.<br>\r\n<br>\r\nAn hour laster when you come over to Alex's house..<br>\r\n<br>\r\n\"Hey, Alex, can I come in?\", you say.<br>\r\n\"Sure, what's up?, Alex says.<br>\r\n\"I wanted to know if we could try on each other's clothes. I always wanted to feel being a bit more prettier like you.\" you say.<br>\r\n\"Yeah, sure. I see no problem with that\", Alex says.<br>\r\n<br>\r\nYou then both go up to her room..<br>\r\n<br>\r\nYou both strip down until in panties and bras. You decide that you want to try each other's too so both going into a different room you throw the panties and bras into each other's room as far as you can.<br>\r\n<br>\r\nYou then put on Alex's bra and panties. You realize they were way more tighter than what you wear. You then exchange the rest of each other's clothes. Then you say \"You can be me, I'll be you.\" \"Wait what\" as Alex says when your saying the spell.<br>\r\n<br>\r\nYour souls swap into a different body. Harper to Alex's and Alex's to Harper.<br>\r\n<br>\r\nYou then wake up realizing your now Alex. You take off all your clothes and look at yourself in the mirror feeling and checking this new body out. It was way better than your old one. Alex is still asleep so you decide to take off your old body's clothes off because those are Alex's (now yours) to get into the right clothes. Once you put your new clothes on and Alex's new clothes. She wakes up and screams.<br>\r\n<br>\r\n\"Oh my god. How are you in my body?\" Alex (in Harper's body) says.<br>\r\n\"I don't know but I love this body.\" you say.<br>\r\n\"I know. Hey want to check my body out and I'll check yours out?\" Alex says.<br>\r\nAlthough you already did you say yes.<br>\r\n\"Oh my god, your boobs are big\" Alex says in her new body.<br>\r\n\"Ya, ya\" you say.<br>\r\n<br>\r\n\"So what shall we do now? \"Alex says.</span></div></div>",
            "created":1292821200,
            "id":1018670,
            "title":"Harper Finds the Spell Instead of Alex"
        },
        "143":{
            "author_id":"elgoodmaster",
            "author_name":"el goodmaster",
            "choices":[
                "I try to do a spell and realized that he had no powers",
                "alex the spell worked and was back in his body"
            ],
            "content":"<div class=\"\"><div> <span>\"Then Alex (Harper) told Harper (alex)<br>\r\n<br>\r\n\"out of my house<br>\r\nand alex said<br>\r\n<br>\r\n-but this is my house<br>\r\nand answer harper<br>\r\n<br>\r\nno alex is now my home and if you go na I'll get you out of here \"<br>\r\nalex said then, remember that I am of the powers here?<br>\r\n<br>\r\nthen try to do a spell y. ..</span></div></div>",
            "created":1300258020,
            "id":1071114,
            "title":"Tell Alex to get out of \"your\" house."
        },
        "1431":{
            "author_id":"elgoodmaster",
            "author_name":"el goodmaster",
            "choices":[
                "Harper begins to explore his new body",
                "harper goes shopping"
            ],
            "content":"<div class=\"\"><div> <span>then the spell did not work and Alex realized that something was wrong then told harper<br>\r\n<br>\r\nalex was already all planned reading the book I found out all your powers and magical abilities would stay in your body and why did you think I would have done it without being prepared<br>\r\n<br>\r\nalex said, but because I do this to my friends we were supposed to<br>\r\n<br>\r\nBut assuming I'll always envy all you paid attention and I just was not fun but harpe but then told another to go and see Alex came running and crying and said, now that harper</span></div></div>",
            "created":1300259400,
            "id":1071118,
            "title":"I try to do a spell and realized that he had no..."
        }
    },
    "info":{
        "author_id":"iamadawg",
        "author_name":"DudeAlex",
        "brief_description":"Characters of Wizards of Waverly Place swap bodies.",
        "created":1284264180,
        "description":"<td align=\"left\" class=\"norm\">Alex finds a spell on how to swap bodies, having to swap clothes. So she thinks about trying it on her family and friends.</td>",
        "id":1707266,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1397387160,
        "modified":1397387160,
        "pretty_title":"Wizards of Waverly Place - Swap Bodies!"
    }
}