{
    "chapters":{
        "1":{
            "author_id":"mystdancer50",
            "author_name":"DragonWrites~The Fire Faerie~",
            "choices":[
                "Rodney Dukke of Beladim",
                "Derrick Reign of Lorenthe",
                "Samwell Farlses of Mirre",
                "Bruce Ankant of Dark Oak",
                "Remain covered (Trust me...this will get interesting)"
            ],
            "content":"<div class=\"\"><div> <span>The hall is dark and empty with the exception of the five knights that stand in full armor, the metal glistening softly in the torch light.  You stand with them, wondering who each one of them are, wondering if they know you.<br>\r\n<br>\r\nYou study the Sword of Eternity that lays center upon the large table, two swords laying to either side.  Five swords, five knights.  The Sword of Eternity is the ulitmate prize.  It is the sword you deserve and so it shall be yours.<br>\r\n<br>\r\nThe king approaches, his eyes dark and unrelenting.  You feel the sweltering heat of your body collecting inside your armor as the king walks slowly down the line of knights.<br>\r\n<br>\r\n\"Each of you,\" He begins, his voice deep and strong.  \"Are special.  Each of you are strong.  I need you all, the five provinces united under the royal banner.  None of you know who stands beside you, could be brother or stranger, friend or foe.  Here is your solemn vow.\"  The king picks up the Sword of Eternity from the midst of the others.  \"He who weilds this sword shall be the one to trust.  He who bows first will be the one to serve.\"<br>\r\n<br>\r\nYour knee bends of it's own accord and you are humble before the king.  The others growl in thier helmets and you can hear grumbling.  The sword was meant to be yours, you knew and now you have it.<br>\r\n<br>\r\n\"Arise, ser, and remove your helmet.  Show all who we call leader of the realm.\"<br>\r\n<br>\r\nYou stand and move your hand toward your visor...</span></div></div>",
            "created":1058566320,
            "id":166348,
            "title":"The Sword of Eternity"
        },
        "11":{
            "choices":[
                "You return to your chamber to prepare to feast."
            ],
            "content":"<div class=\"\"><div> <span>You remove your helm and smile, showing perfectly even white teeth against a dark tan.  Your muscles hold up the armor effortlessly and you know that the Sword of Eternity will feel good in your hands.<br>\r\n<br>\r\nYou stand as the others look at you in silence.  The king hands you the sword with a soft smile.<br>\r\n<br>\r\n\"Rodney Dukke of Beladim will be the leader of the knights of the realm.  I should have guessed it would be you.\"  He says.<br>\r\n<br>\r\nYou nod softly and watch as all but one removes their helms.  You lift an eyebrow but say nothing.<br>\r\n<br>\r\n\"There is a feast in your honor.  Go, dine, wine and live, my friends, for there is a war on the horizon.\"<br>\r\n<br>\r\nAs three of the knights move toward the door you watch the fourth hesitate.  You back to the door, bowing and wondering what the knight intends.<br>\r\n<br>\r\nBefore you can think of a plausible reason to remain, the king waves his hand and the doors are closed.<br>\r\n<br>\r\n\"Damn!\"  You mutter.</span></div></div>",
            "created":1058568420,
            "id":166359,
            "title":"The Fifth Knight"
        },
        "12":{
            "choices":[
                "You return to your chamber to prepare to feast."
            ],
            "content":"<div class=\"\"><div> <span>You remove your helm and smile, showing all your pale skin and dark hair. Your muscles ache beneath the weight of the armor yet you know that the Sword of Eternity will feel good in your hands.<br>\r\n<br>\r\nYou stand as the others look at you in silence. The king hands you the sword with a soft smile.<br>\r\n<br>\r\n\"Derrick Reign of Lorenthe will be the leader of the knights of the realm. I should have guessed it would be you.\" He says.<br>\r\n<br>\r\nYou nod softly and watch as all but one removes their helms. You lift an eyebrow.<br>\r\n<br>\r\n\"What's this then?\"  You ask as you look at the knight.<br>\r\n<br>\r\n\"It is nothing that need to be addressed now.\"  The king says and before you can argue, he continues.  \"There is a feast in your honor. Go, dine, wine and live, my friends, for there is a war on the horizon.\"<br>\r\n<br>\r\nAs three of the knights move toward the door you watch the fourth hesitate. You back to the door, bowing and wondering why the king allowed the one knight to remain.<br>\r\n<br>\r\nThe king waves his hand and the doors are closed.<br>\r\n<br>\r\n\"Damn!\" You mutter angry that you have been so easily dismissed.  You are determined to find out the secret of the knight.</span></div></div>",
            "created":1058568720,
            "id":166360,
            "title":"The Fifth Knight"
        },
        "121":{
            "choices":[
                "Put on your armour and walk about the lower floor",
                "Put on your armour and walk about the higher levels of the castle"
            ],
            "content":"<div class=\"\"><div> <span>You head up the stone staircase to your bedchamber and are quick through the door, which you fasten. You remove your heavy armour and pull your chest out from behind your cot.  All of this you do automatically, without any real thought, as your mind is raging with more important business.  <br>\r\nYou are to be the leader.  This thought is foremost and you grin to yourself at the idea.  It had not been a surprise; you were confident the sword of eternity, that mystifying blade, would be yours and knew that the mission would be lost with another knight leading.  <br>\r\nYou watched the muscles in your arm flicker as you grasp the sword of eternity firmly.  Moving your eyes up, over the gems to the cold blade your pupils dilate.<br>\r\nBut that other knight.  Blind bravery and insolence he must have to disrespect you in such a way, keeping his face hidden from his new leader.  Yet the king allowed it, even kept him back, and for what reason you will unearth.  A strong knight must know those under his command if he is to succeed.  <br>\r\nYou lift the lid of the battered, leather chest before you and take out a silk pouch and a rag.  The rag you use to polish your helm and the pouch, for now, takes residence by your waist.   <br>\r\nThe feast will start in a while but you want to search for the knight whose face is still unknown before you join the merry fools in the hall.  </span></div></div>",
            "created":1170430440,
            "id":378702,
            "title":"In the bedchamber"
        },
        "1212":{
            "choices":[
                "Take your seat of honour"
            ],
            "content":"<div class=\"\"><div> <span>After what seemed a demi-age of wandering the higher levels of the king's vast castle you decide to head to the hall and eat in your place of honour.  Clambering awkwardly down a spiral staircase you begin to feel angry again, thinking of your futile search.  You pause and lift your helm to release some heat.  Despite the fine layer of sweat you feel, your face is not flushed.  It never does.  It always remains pale, especially in comparison with such thick dark hair.  <br>\r\nFaint steps slowly become audible.  It cannot be a knight, the footsteps would be heavier and would clang on the stone.  No.  It could be a woman or...you straighten your back and replace your helm.  An elf, clothed in the navy of evening, continues up the steps until he is head height with you.  \"You be well, I trust, friend of the elves.\"  Dry sarcasm dusts his echoing voice.  <br>\r\n\"I find you false, Yesterbel.  So do not aggravate me futher.  Particularly as my hand touches the sword of eternity.\"<br>\r\nHe gives a wry smile and leaves you.  He was a sudden reminder that the castle is currently host to many hostile elves.  Well they are hostile to you for reasons caused by your temper and conceit.  <br>\r\nYou go to the hall.  </span></div></div>",
            "created":1170432600,
            "id":378706,
            "title":"Elven foe"
        },
        "13":{
            "choices":[
                "You return to your chamber to bathe."
            ],
            "content":"<div class=\"\"><div> <span>You remove your helm and smile, showing your slightly pudgy face to the helmed men of the realm.  The others seem to be strong and fit beneath their armor and you wonder what they think of you.  Your bulky frame feels weighed down by the heavy metal but you know that the Sword of Eternity will feel good in your hands.<br>\r\n<br>\r\nYou stand as the others look at you in silence. The king hands you the sword with a soft smile.<br>\r\n<br>\r\n\"Samwell Farlses of Mirre will be the leader of the knights of the realm. I should have guessed it would be you.\" He says.<br>\r\n<br>\r\nYou lick your lips and taste sweat.  All you want to do is leave the room and take a bath in your chamber.  Your father forced you into knighthood, but the moment you saw the sword, you saw the possiblities.  You watch as all but one of the knights removes their helms. You turn your gaze upon the remaining knight and fume inwardly at the lack of respect his refusing to unveil shows toward you.<br>\r\n<br>\r\n\"There is a feast in your honor. Go, dine, wine and live, my friends, for there is a war on the horizon.\"<br>\r\n<br>\r\nAs three of the knights move toward the door you watch the fourth hesitate. You back to the door, bowing and wondering what the knight intends.<br>\r\n<br>\r\nYou open your mouth to insist that the knight attend to you but the king lifts his hand and the doors close.<br>\r\n<br>\r\n\"Well, damn him to Hades!\" You grumble as you turn on your heel and wobble down the hall.  \"I want a bath.\"</span></div></div>",
            "created":1058569560,
            "id":166362,
            "title":"The Fifth Knight"
        },
        "14":{
            "choices":[
                "You lead the elves into your bedchamber to meet."
            ],
            "content":"<div class=\"\"><div> <span>You remove your helm and smile, showing striking gray eyes and the pointed ears of your elf heritage.  The others mumble beneath their helms but you smile broadly.  Your slender frame feels weighed down by the heavy metal but you know that the Sword of Eternity will feel good in your hands.<br>\r\n<br>\r\nYou stand as the others look at you in silence. The king hands you the sword with a soft smile.<br>\r\n<br>\r\n\"Bruce Ankant of Dark Oak will be the leader of the knights of the realm. I should have guessed it would be you.\" He says.<br>\r\n<br>\r\nYou tilt your head slightly and watch the king intently.  You have your own reasons for taking the sword, for becoming a knight.  You watch as all but one of the knights removes their helms. You turn your gaze upon the remaining knight and respect the mystery that shrouds him.<br>\r\n<br>\r\n\"There is a feast in your honor. Go, dine, wine and live, my friends, for there is a war on the horizon.\"<br>\r\n<br>\r\nAs three of the knights move toward the door you watch the fourth hesitate. You back to the door, bowing and wondering what the knight intends.<br>\r\n<br>\r\nYou turn on your heel and hear the doors close.  Whatever secret the fifth knight held did not matter.  All that concerns you is speaking with the other elves before preparing for the feast.<br>\r\n<br>\r\n\"Brothers!\" You call as you near the darkest area of the hall.</span></div></div>",
            "created":1058569620,
            "id":166363,
            "title":"The Fifth Knight"
        },
        "15":{
            "author_id":"mystdancer50",
            "author_name":"DragonWrites~The Fire Faerie~",
            "choices":[
                "You place your hands upon your helm and lift it away..."
            ],
            "content":"<div class=\"\"><div> <span>\"Sire.\"  You say gruffly as you keep your visor lowered.  \"Allow them to recognize my armor...and the sword.  They shall answer to me just as well.\"<br>\r\n<br>\r\nThe king nods, knowing full well the secret you harbor then and there.  He was unaware of who was who in their homemade armor but you he knew well.<br>\r\n<br>\r\nHe places the sword in your hand and you bow your head in reverence.<br>\r\n<br>\r\n\"Know this now.  The knight of Golden Elm shall be your leader.  Respect and humble yourself before him as you would me.  There is war brewing.\"<br>\r\n<br>\r\nThe others shift nervously.  Finally, one removes his helmet.  You smile as the others do the same and you recognize each of them.  You would rule them all.<br>\r\n<br>\r\n\"There is a feast prepared for the loyalists of my throne and the five knights that will maintain the peace of the kingdom and the provinces.  Go, feast.\"  As they leave, the king halts you.  \"Remain, Golden Elm.\"  He says.<br>\r\n<br>\r\nThe others are gone quickly, each bowing at the waist at the doorway before leaving to don their best doublets and join the feast.<br>\r\n<br>\r\n\"Remove your helmet.\"  The king commands and you place the sword upon the table once more.</span></div></div>",
            "created":1058566680,
            "id":166351,
            "title":"Seperation"
        },
        "151":{
            "author_id":"mystdancer50",
            "author_name":"DragonWrites~The Fire Faerie~",
            "choices":[
                "Use the secret passage to reach your bedchamber.",
                "Walk boldly down the hall to your bedchamber."
            ],
            "content":"<div class=\"\"><div> <span>Your red hair cascades down about your shoulders and back as you place the helmet beside the sword.<br>\r\n<br>\r\n\"It was bloomin' hot in that metal trap.\"  You say, your voice rising with a gentle Irish lilt.<br>\r\n<br>\r\n\"Princess Emerald Leaffe, an honor.\"  The king says as you quickly plait your hair and smile.<br>\r\n<br>\r\n\"They would never have served a woman.\"  You say as you remove the chainmail gloves.<br>\r\n<br>\r\n\"They would serve whomever I instructed them to serve.\"  The king says forcefully as you tilt your head slightly.<br>\r\n<br>\r\n\"Yes, highness, I believe they would.\"  You agree.<br>\r\n<br>\r\n\"You shall not sit with them at the feast?\"  He asks casually as you gather your helm, gloves and sword together.<br>\r\n<br>\r\n\"I shall sit beside my father.  He is unaware of my intents.\"  You say as you make for the door.<br>\r\n<br>\r\n\"The ruse of your betrothal to my son shall not last long and remain believable.\"  The king says.<br>\r\n<br>\r\n\"Then I had best be quick about finding the source of evil.\"  You say as you reach the doors.  You turn on your heel and face the king once more.  Bowing stiffly at the waist, you straighten and replace the helm upon your head.<br>\r\n<br>\r\nThe king's amused chuckle follows you down the hall.</span></div></div>",
            "created":1058567040,
            "id":166355,
            "title":"Secrets Revealed"
        },
        "1511":{
            "author_id":"mystdancer50",
            "author_name":"DragonWrites~The Fire Faerie~",
            "choices":[
                "You've fallen asleep, you clod!  You're very late!",
                "You dress as you were trained and arrive timely to the feast."
            ],
            "content":"<div class=\"\"><div> <span>With great confidence, you operate the hidden stone to open the small hallway that only royalty knows of.  You immediately take of your helmet to provide yourself with clearer vision.<br>\r\n<br>\r\nMoving rapidly down the narrow hallway is impossible in the armor so you move slow...too slow.  You need to dress for dinner.<br>\r\n<br>\r\nFinally, you reach your room and step out from a tapestry of a large unicorn killing a bear.  You lay it flat agains the wall and walk to the large bed.<br>\r\n<br>\r\nYou open the trunk at the end of the bed and place your gloves, helmet, and sword in it, taking a moment to admire the craftsmanship of the weapon.<br>\r\n<br>\r\nIt glimmers with a light all its own, its hilt inlaid with gold and saphires, its blade long and sharp.  You think of the stories, the tales of elves and dwarves joining together to create the greastest weapon ever made.<br>\r\n<br>\r\nSighing, you remove your armor as quickly as the bulky metal will permit and place it in the trunk as well.  Then, you place your wedding gown atop it all.  You close the lid with a soft click.<br>\r\n<br>\r\nAs you dress for the feast, you wonder what the future held for you, the only female knight of the realm...of the world.  You brush your hair as you sit upon the bed and think of tomorrows... </span></div></div>",
            "created":1058567700,
            "id":166357,
            "title":"Peace"
        },
        "15111":{
            "author_id":"mystdancer50",
            "author_name":"DragonWrites~The Fire Faerie~",
            "choices":[
                "Hours pass and at long last it is time!"
            ],
            "content":"<div class=\"\"><div> <span>The gentle rapping upon your door awakens you.  You mutter an oath and roll over.  If you hadn't promised your father that you would dine at the feast, you would gladly sleep the day away, since you leave that night.<br>\r\n<br>\r\nInstead, you sit up and call for the servant to enter.  She is carrying your emerald gold trimmed gown in her hands, treating it like a royal treasure.  You think back to the uncomfortable armor and wish you could wear that rather than the dress.<br>\r\n<br>\r\nYou allow the girl to dress you and fix up your hair.  All the while you think of the sword calling to you in the chest.  You think of your father and his insistance on leaving the evil up to the king, leaving salvation up to the knights.<br>\r\n<br>\r\nRising slowly, you prepare to make your entrance, knowing that seeing the knights eating at their place of honor was going to make the evening unbarable.<br>\r\n<br>\r\nIt is then, as you enter to fanfare and bowinr, that you decide to slip away and make an appearance as the knight.  After all, you earned the honor and the right to be noticed.</span></div></div>",
            "created":1073421720,
            "id":184134,
            "title":"Preparing for the Feast"
        },
        "151111":{
            "author_id":"me_duh_inc",
            "author_name":"me_duh",
            "choices":[
                "It's your father",
                "It's the king's son"
            ],
            "content":"<div class=\"\"><div> <span>After telling your father you wished for a breath of fresh air, you excuse yourself and return to your chambers. There you resume your armor, and as uncomfortable as it is you feel more at ease with it on. Once again employing the use of the secret passageway, you exit your chambers and make your way to the grand ball room.<br>\r\n<br>\r\nIt is a few moments before anyone becomes aware of your presence. When you are finally noticed a hush envelopes the room. Silently you make your way to the king's table, the crowd parts as if being within two feet of you would be unforgiveable. When you reach the long table at the head of the room reserved for the royal family and honored guests you bow and the king rises and gestures you to the place on his right.<br>\r\n<br>\r\n\"Now that all five of our guests of honor have arrived I would like to propose a toast. Please, everyone take a glass. Rise good sir knights.\" Still standing, you watch as the four other knights arise. They did not appear too pleased that you decided to make an appearance after all, but that disdain quickly melted away as the king made his toast. <br>\r\n<br>\r\n\"It pleases me to introduce the Five Knights of the Realm. Each has come from a different providence; each has left something behind; each has a different reason for choosing to be here. But they share a common goal. They will protect this realm with their lives; they will seek out evil and put an end to it's reign.\" The room erupted in cheers. Raising his hand, the king silenced the guests. \"To the Knights, may they be blessed and successful in their journey.\"<br>\r\n<br>\r\n\"To the Knights.\" Everyone raised their glasses and took a drink. The other Knights emptied their glasses in a single drink. Lifting your viser just enough, you too drain your glass. All resume their seats, and the room once again comes to life. <br>\r\n<br>\r\nHis elbow on the table and his chin resting on his hand the king leans over and says to you, \"I am glad to see you chose to join us.\"<br>\r\n<br>\r\n\"I could not let this moment pass me by your majesty. I cannot stay long however. There is still much to do before we leave.\"<br>\r\n<br>\r\n\"Of course.\" With that he returns to his other guests.<br>\r\n<br>\r\nSitting at your place of honor you don't feel content. You watch the life coursing through the room, the Knights chatting with various guests, some people had begun to dance, but most were still at their tables chatting with families and friends. You remain for a short while longer enjoying the scene. Soon you see your father scanning the room for you, you know it was time the knight from Golden Elm excuses himself. Returning to your chambers, you change as quickly as possible, sad to once again wear your shackle of a gown.<br>\r\n<br>\r\nIn your haste to return to the grand ball room you run into someone as you are leaving your chambers, nearly knocking him to the ground.</span></div></div>",
            "created":1155031020,
            "id":378725,
            "title":"To the Knights"
        },
        "15112":{
            "author_id":"jonilxy",
            "author_name":"xinyi",
            "choices":[
                "As the feast ends, a certain noblity speaks of the Saphirre Arrow of Lea",
                "The castle comes under attack"
            ],
            "content":"<div class=\"\"><div> <span>You were not only exceedingly well trained in the arts of chivalry, but in the maidenly arts as well. Not too much of this not to much of that, with the right amount of flattery from your garments. <br>\r\n<br>\r\nThe noise of the chatters, whether formal or frank, soon reach your ears. <br>\r\n <br>\r\nYou make your way to the feast, and as always, most male eyes were on you, and this especially so in the case of the dear Brandon, Son of the King. Behind the metal plates hiding your identification, you were Princess. A lady. One beloved by the gentleman Brandon. <br>\r\n<br>\r\nHe was only a little older than you, with smoldering gray eyes, tall and lusty, his red, golden hair framing his handsome countenance. He was blessed with a heart melting smile he so often greeted you with. His voice was deep and somewhat musical and was humorous and held the barrier of formality at your favorite height.<br>\r\n<br>\r\nHe arises, bends and kiss your hand, that though slender and smooth on the outside, was covered with calluses and the palm. He pull your chair for you as you settle down<br>\r\n<br>\r\n\"The King arrives!\" The formality of chairs being pushed back begun as the king strode into the room, as always, with passing elegance and dignity.</span></div></div>",
            "created":1261041420,
            "id":806816,
            "title":"You dress as you were trained and arrive timely..."
        },
        "1512":{
            "author_id":"mystdancer50",
            "author_name":"DragonWrites~The Fire Faerie~",
            "content":"<div class=\"\"><div> <span>You stroll quickly down the hall, proud of your power and your possesion of the Sword of Eternity.<br>\r\n<br>\r\nAs you reach your bedchamber, you notice the women whispering a few feet away, watching you place your hand upon the latch.<br>\r\n<br>\r\n\"Damnation!\"  You mutter.  \"What was I thinking?  Ruin my own reputation with my pride.\"<br>\r\n<br>\r\nYou drop your hand to your side and head back the way you came.  You can only hope that your moment of foolishness did not ruin your reputation already.<br>\r\n<br>\r\n<br>\r\n<span class=\"cred\"><b>RETURN TO THE PREVIOUS CHAPTER AND USE THE SECRET CHAMBER, YOU FOOL, BEFORE IT'S TOO LATE!!</b></span></span></div></div>",
            "created":1058567220,
            "id":378726,
            "title":"Decisions Failed"
        }
    },
    "info":{
        "author_id":"mystdancer50",
        "author_name":"DragonWrites~The Fire Faerie~",
        "brief_description":"The days of knights and chivalry flourish...or do they?",
        "created":1058565660,
        "description":"<td align=\"left\" class=\"norm\">Five knights joined under one banner must choose their paths wisely.  As they progress they face greed, lust, bitterness, kindness, compassion, and dragons...just to name a few.  Your mission is to save the kingdom...or damn it.  Choose wisely, for death will meet the faithful and the foolish alike.</td>",
        "id":722041,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1261041420,
        "modified":1261041420,
        "pretty_title":"Knights and Dragons"
    }
}