{
    "chapters":{
        "1":{
            "author_id":"brainiac222",
            "author_name":"The Black Mamba",
            "choices":[
                "In a village of praising giants",
                "By the gates of an enormous city",
                "Inside a court of angry officials",
                "To a shrine inside a forest",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Touchdown. The <i>Blazer</i> landed on the surface of this new, strange planet. Gravity and oxygen levels were detected to be approximately the same as Earth's. Everyone took off their astronaut gear and waited for instructions from the Captain.<br>\r\n<br>\r\n\"Lieutenant Dixon! Front and center!\" shouted Captain Skyler Lewis.<br>\r\n<br>\r\nAn officer from the crowd came and stood in front of the captain. He saluted.<br>\r\n<br>\r\n\"Take your men and scout the planet. We need more intel,\" said the Captain.<br>\r\n<br>\r\n\"Yes, sir,\" said the Lieutenant. He saluted again then waded back into the crowd, taking five men with him.<br>\r\n<br>\r\n\"Private Young! Join Dixon!\" shouted the Captain.<br>\r\n<br>\r\nYou were caught off guard. You marched with them, trying to keep up your pace to be last in line. Lieutenant Dixon led his crew to the vehicle depot, where rows of Ford Escapes were lined up. The Lieutenant pressed a button as he entered. Yellow \"boots\" were released, enabling the cars for deployment. Had the \"boots\" not been active the cars would undertake weightlessness and wreck the depot.<br>\r\n<br>\r\n\"Everyone enter this one! Private Young, take the gun,\" said Dixon.<br>\r\n<br>\r\nEveryone piled into a Ford. Every car was specially equipped with a turret in case of hostile alien activity. All the doors and windows were removed so entering and exiting were easy for any man. You took the turret in the back while the Lieutenant took shotgun. Corporal Thomas Clayton took the wheel with a sneer on his face. The Lieutenant gave orders before the trek.<br>\r\n<br>\r\n\"We are about to scout the planet. Stay sharp and keep an eye out for any otherworldly activity. Intel suggests human-like creatures inhabit the planet, but do not be deceived. Any hostile activity and we go back to the shuttle with as much intel as we saw. Corporal, start the car.\"<br>\r\n<br>\r\n\"Yes sir.\" Clayton exited the vehicle depot and onto the surface, warm and rocky. The Escape stopped only for souvenirs, which they found surprisingly similar to Earth's. Hours later they saw something in the distance.<br>\r\n<br>\r\n\"Lieutenant, what is that?\" you say as you point to two tan pillars that seemed to appear out of nowhere, covered in fog.<br>\r\n<br>\r\n\"I don't know,\" the Lieutenant responds. \"Corporal, drive closer.\" The pillars remained fixed as the Escape headed towards the pillars. You were highly curious why such oddly colored and shaped pillars would be doing in a natural environment similar to Earth's.<br>\r\n<br>\r\nYou entered the fog and the Corporal turned the brights on. Then the car reached a valley, and you couldn't believe your eyes. Were those toes? Was that an enormous foot? That foot was around four times the size of the car. \"T-t-tasers, everyone,\" said Dixon. \"We have ourselves an extremely oversized human.\"<br>\r\n<br>\r\nJust then the \"pillars\" shifted. A voice said boomed from above in a language none of you could understand. Strong impulses forced you to shout, \"Do not hurt us! We have tasers!\"<br>\r\n<br>\r\nLieutenant Dixon shot you a look that said, <i>Private! You're going to get us killed!</i><br>\r\n<br>\r\nThe voice above said, \"So it is true...\" in English, in a very reflective tone.<br>\r\n<br>\r\nSeconds later you see a giant hand loom over the Escape. It grabbed you and you saw the figure walking away, grasping you in its hand. It was a moment of total terror. You yelled at it to try to get its attention, but it quickened its pace, and it turned into a run. Its footsteps were like thunder, deep and loud, but not too loud for you to have to cover your ears.<br>\r\n<br>\r\nYou exited the fog and saw the figure more clearly. It was... human. Rather, it was a beautiful giant woman with you in her right hand, wearing modern clothes. You estimated she was around 200 feet tall, from another world, yet frighteningly similar to a normal human.<br>\r\n<br>\r\n\"Ma'm!\" You tried to get her attention again. To which she responded in fluent English, \"There's no time to explain. My people wish to see you quickly.\"<br>\r\n<br>\r\nSo saying, you were taken somewhere else. Where are you now?</span></div></div>",
            "created":1353713580,
            "id":1473866,
            "title":"Close Encounters of Another Kind"
        },
        "11":{
            "author_id":"brainiac222",
            "author_name":"The Black Mamba",
            "choices":[
                "Spend the night with the Oracle",
                "Meet some of the villagers",
                "Graciously turn down the offer",
                "Obvious trap. Run",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>The woman traveled faster than a car at freeway speed in California. What would take her 3 minutes to walk would take a man over an hour to run. Soon you come across what seemed like a tribal village on Earth. The only thing in between you and that village was a horde of other giants, who seem to be welcoming you to their peaceful planet.<br>\r\n<br>\r\nThe woman carrying you shouted to the group, \"Fellow Atlanteans, our brother has arrived!\"<br>\r\n<br>\r\n\"Atlanteans? Brother?\" You needed answers immediately. Your remarks were drowned out by boisterous cheering. One of the giants took a couple of steps and said to her, \"Oracle, the vision is true! Have our ancestors really set foot on our planet?\"<br>\r\n<br>\r\nYour head was loaded with questions that had to be answered immediately. \"Yes, they have,\" the Oracle continues. \"I found a group of them while I was meditating. However...\" She holds your out towards the group. \"This man matches the prophecy of old. He will unite the Old World and the New World and bring us peace!\"<br>\r\n<br>\r\nMore deafening cheering. The Oracle, or at least what she's called, turns to you. \"I know it seems hard to you to be this clueless. Settle here. We will provide you answers.\"<br>\r\n<br>\r\nSeems tempting. However, you were near a thousand 200 foot tall giants that can bring you instant death. All you had was a taser, with no backup whatsoever. This could be a trap. What will you do?</span></div></div>",
            "created":1353877800,
            "id":1475139,
            "title":"Brother"
        },
        "111":{
            "author_id":"brainiac222",
            "author_name":"The Black Mamba",
            "choices":[
                "In a city suitable for millions of giants",
                "In the middle of a spacious plain",
                "Inside a dark and dreary cave"
            ],
            "content":"<div class=\"\"><div> <span>You decided to do their bidding and settle with them. Since you were a \"special guest\", you were sent to the Oracle's house for an \"orientation\". The houses were enormous and postmodern themselves, but hers was the largest and the most advanced. Toys and gadgets that couldn't be imagined even in sci-fi films were everywhere inside the village.<br>\r\n<br>\r\nThe Oracle stood by the doorway of her colossal home. The door opened automatically with a pleasing voice of \"Welcome, Oracle.\" Inside her home was a huge array of futurism. If you could test everything inside you would.<br>\r\n<br>\r\nThe giantess pushed a few buttons on a nearby machine and out popped a human-sized couch. \"Just for you,\" she says with a smile. \"You don't know how long I've been waiting for your arrival. Sit down, and ask whatever you want.\"<br>\r\n<br>\r\nYou obliged. The first that came to mind was, \"Who are you?\"<br>\r\n<br>\r\n\"I am known as the Oracle by my community, as you may have remembered moments ago. It is a crime to know my real name, much less say it out loud. I provide visions for local villages, mostly by meditation. When you have found me I was meditating, focusing on the exact moment when you would come.\"<br>\r\n<br>\r\n\"How do you know these things?\" you ask her.<br>\r\n<br>\r\nShe answered the question with a story. \"Thousands of years ago, back on the Old World, the planet you call Earth, the Greeks ruled most of Europe. They also had taken control of an island called Atlantis, rumored to have the most advanced technology the world has ever known at the time. The settlers on it were our ancestors.\"<br>\r\n<br>\r\n\"Is that why you're called the Atlanteans?\"<br>\r\n<br>\r\n\"Yes, of course. When the Greek Empire fell, our people were forgotten. We would improve our technology in peace. However, earthquakes threatened us, and we were forced to go to space only days before the island sunk. The trip was harsh, and only a man and two women made a successful trip to a planet much larger and sustains life better than Earth. They called it Hypergaia, Greek for Super-Earth. There the surviving Atlanteans thrived. They took an unusual evolutionary path. Over generations we grew in stature, hence you see how large we are today.<br>\r\n<br>\r\n\"Back when the Greeks took control of Europe, there were women known as Oracles, who had the gift of prophecy as given by the god Apollo. Pythia is an example. They gave out prophecies every so often, and meditated for inspiration. These women still exist today. You are looking at one right now.\"<br>\r\n<br>\r\n\"What does all this have to do with me?\" you ask her.<br>\r\n<br>\r\nJust as she was about to explain, you hear an automated voice blare, \"Incoming foreign transmission!\" followed by voice covered with static, saying, \"Mayday! Mayday! This is Lieutenant Dixon to <i>Blazer</i>. Private Young is M.I.A. Repeat, Private Young is M.I.A., carried away captive by a giant woman. Heading back towards ship with further intel.\"<br>\r\n<br>\r\nSilence. Then the Oracle spoke. \"I believe this 'Lieutenant Dixon' is one of your kind?\"<br>\r\n<br>\r\n\"Yes, he was one of the men in the car,\" you explain. You were beginning the trust the woman, even if she was as tall as a skyscraper.<br>\r\n<br>\r\n\"We must move quickly. They cannot see us. Come with me,\" the Oracle says as she grabs you and moves to a new room. Inside was a massive gray circle. The Oracle pushed a few buttons and the circle began to glow blue. The two of you moved through the circle and instantaneously appeared somewhere else. You felt nauseated.<br>\r\n<br>\r\n\"Teleportation device?\" you ask the Oracle.<br>\r\n<br>\r\n\"Pretty much.\"<br>\r\n<br>\r\nWhere are you now?</span></div></div>",
            "created":1353881220,
            "id":1475204,
            "title":"Answers"
        },
        "1111":{
            "author_id":"brainiac222",
            "author_name":"The Black Mamba",
            "choices":[
                "The scribe",
                "A guard",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>You look around from the palm of the Oracle's hand. It seemed to be a super-sized city, making it easy for giants to live their lives. There was a futuristic look to the setting, with teleporters scattered to and fro, similar to the one you entered earlier. Skyscrapers stretched immeasurably tall, miles in the sky.<br>\r\n<br>\r\n\"We should hurry. The king's palace is nearby, by the way, I should ask, what's your name?\" says the Oracle.<br>\r\n<br>\r\n\"Jacob Young. Why do you ask? And what king?\"<br>\r\n<br>\r\nShe didn't answer. Again moving at incredible speed (at least to a mere human like you), she walked four blocks, passing by other giants. Some of them looked at her as if she was either important or beautiful. Others looked at you, wondering what a tiny man is doing in such a busy place. None of them stopped to ask questions. They all looked in a hurry.<br>\r\n<br>\r\nThe Oracle continued walking until she reached a massive, three-story building. (To you it was more like a hundred stories.) \"We're here,\" she announced as she entered the front door, almost as tall as the building itself. She placed you behind your back, as if she were hiding you. Inside the building was a long, gray hallway, with an empty, gold throne on the top of a set of stairs at the end. Pictures of men in royal robes were placed all along the corridor, probably kings before the current one. A central section of the hallway split into a cross, with rooms by the ends. There was the same futuristic look to it, shiny yet advanced.<br>\r\n<br>\r\nThe only thing between you and the corridor itself were three guards. One of them stood forward and said, \"Identification.\" The Oracle held out her hand and green fire danced on it. The guard in front said, \"What business do you have today?\"<br>\r\n<br>\r\n\"It's about the Great Prophecy,\" the Oracle said to him.<br>\r\n<br>\r\n\"I thought King Stefanos said he doesn't believe in that prophecy.\"<br>\r\n<br>\r\n\"I have evidence. Trust me.\" The Oracle fluttered her eyelashes.<br>\r\n<br>\r\nThe guard blinked twice and said, \"I guess, since you're beau-- I mean, the Oracle after all. The king will be here shortly.\" The guards moved for the two of you, not noticing you behind the Oracle's back. When she was sure they couldn't see you anymore, the Oracle pulled you out and whispered, \"Works every time,\" with a laugh.<br>\r\n<br>\r\nThe Oracle continues walking until she is close to the throne itself, depending on how close she thinks is close. Minutes later the throne glowed with a flash of white light, and a man appeared in gray, royal robes on the throne. With a booming voice, he says, \"I am King Stefanos, ruler of Hypergaia! Who are-- oh... hello, Oracle. What have I to do with you?\"<br>\r\n<br>\r\n\"O king, the Great Prophecy is beginning to be fulfilled. I bring evidence.\"<br>\r\n<br>\r\nThe king began his usual rant. \"I believe the Great Prophecy isn't true. Whoever gave that prophecy is obviously a fraud and I have no reason to deal with it. Get out--\" He stopped talking when from a distance he saw something in the Oracle's stretched hand. He climbed down the stairs for a closer look.<br>\r\n<br>\r\nThere you were, in the Oracle's palm, being curiously viewed by a ruler over billions of giants for the first time. You were still in space uniform, trying to keep a serious face. Besides the typing of a nearby scribe on a keyboard, undoubtedly recording the quotes given at the moment, you could hear a pin drop.<br>\r\n<br>\r\nKing Stefanos began to speak. \"Never before have I saw anything so curious in my life. I do not suppose any man on Hypergaia has either. He's one of us, yet he's extremely undersized. Tell me, where did you find him?\"<br>\r\n<br>\r\n\"O king, let me explain the background information first,\" began the Oracle's explanation. \"The Great Prophecy was given approximately 600 years ago, shortly before the earthquake that sunk Atlantis. It foretold our travel in space, our arrival on Hypergaia, and the coming of a tiny man who will save our civilization. It was given by one of the greatest oracles of all time: Aikaterina. She was one of the women who survived the trip to our new home, and also my ancestor.<br>\r\n<br>\r\n\"After our arrival on Hypergaia, the conditions that made it capable for our people to survive worked too well. We gave birth to many sons and daughters, who astonishingly turned out to average a cubit taller than the average Old Atlantean. Generation after generation it was recorded the next generation was taller than the last, until our average height leveled out to where we are now.<br>\r\n<br>\r\n\"Apparently, the people on Earth haven't experienced the massive changes we have. The tiny man in my hand is from Earth, a descendant of the people we left behind in order for our advanced race to preserve. He has come from the Old World to settle in the New World. He must fulfill his destiny; to unite the two worlds.<br>\r\n<br>\r\n\"Now this miniature man, Jacob Young, was found inside a gray container standing on four black cylinders. He called out to me, and when I noticed him, he matched the picture of the man who would unite the two worlds that I was provided in a vision. I grabbed him and brought him to my village, who brought him praise. If you are to ask one of them about the event, he would probably say that he is a miracle, and would change Hypergaia forever.\"<br>\r\n<br>\r\nThe king took two steps back with a scowl on his face. \"I'm warning you, Oracle, I told you I don't believe in anything related to the so-called 'Great Prophecy'. If you continue, I will have to arrest you for treason. Get out of my palace!\"<br>\r\n<br>\r\n\"Looks like we're on our own,\" the Oracle says to you. But you're not. On the way out, you find _________ ready to greet the two of you.</span></div></div>",
            "created":1353891360,
            "id":1475342,
            "title":"The Throne Room"
        }
    },
    "info":{
        "author_id":"brainiac222",
        "author_name":"The Black Mamba",
        "brief_description":"A world full of giant humans and advanced technology has been discovered. Another GT story",
        "created":1353711060,
        "description":"<td align=\"left\" class=\"norm\"><b>Prologue</b><br>\r\n<br>\r\nIt started a revolution. It was one of the biggest advances in technology. After years of production, the <i>Blazer</i> was finally complete. It will be the new space shuttle for the USA.<br>\r\n<br>\r\nThe Space Race was quicker than ever. A second Cold War was brewing between the US and the Asian Union, consisting of China, Japan, and India, along with other countries. The US beat the AU in constructing a rocket that can sustain hundreds of astronauts' lives for years, while travelling to planets multiple light-years away.<br>\r\n<br>\r\nAfter three years of travelling, the <i>Blazer</i> has reached a planet that sustains life almost as effectively as Earth. Intel suggests the planet is inhabited by billions of organisms similar to humans. The crew decided to explore the planet. Lieutenant Joshua Dixon, along with a few of his men, will scout the planet's surface. Cars were brought onto the shuttle in the event a planet with sustainable life needed to be investigated. Dixon took a couple of cars... and our story begins at the feet of a gigantic woman.<br>\r\n<br>\r\n<b>Characters</b><br>\r\n<br>\r\nName: Private Jacob Young<br>\r\nAge: 22<br>\r\nHeight: 5'11\"<br>\r\nDescription: Lean, slightly muscular, and sensitive. Highly enthusiastic. High intelligence scores, low-mid combat scores. Not afraid to try to stand out. Success level is unknown.<br>\r\n<br>\r\nName: The Oracle<br>\r\nAge: Unknown<br>\r\nHeight: Approximately 200 feet tall<br>\r\nDescription: A leader of the people of the new planet. Beautiful yet a good leader. Little known intel about her.<br>\r\n<br>\r\nName: Lieutenant Joshua Dixon<br>\r\nAge: 32<br>\r\nHeight: 6'3\"<br>\r\nDescription: Muscular. Good leader. Prodigy. Achieved success through high intelligence and proper motivation. Second in command in the <i>Blazer</i>.<br>\r\n<br>\r\nName: Captain Skyler Lewis<br>\r\nAge: 52<br>\r\nHeight: 6'1\"<br>\r\nDescription: Seasoned yet willing. IQ of 142. Chosen to lead the crew on the <i>Blazer</i> in all their missions. The press mentioned he was worried before leaving Earth.<br>\r\n<br>\r\nName: Scientist Katherine Rose<br>\r\nAge: 35<br>\r\nHeight: 5'5\"<br>\r\nDescription: Top scientist aboard the <i>Blazer</i>. Always seeking for more intel. Shocked upon seeing the nature of the new planet. Fears danger.<br>\r\n<br>\r\n<b>Rules:</b><br>\r\n<br>\r\n-Keep this in second person POV of Private Jacob Young<br>\r\n-Giants range from 160 feet to 300 feet tall<br>\r\n-No drug, alcohol, or sexual scenes<br>\r\n-No adult situations<br>\r\n-No gay, bi, or lesbian characters or situations<br>\r\n-No nudity. Everyone must have clothes<br>\r\n-Don't make too many references to one's breasts<br>\r\n-No swearing or vore. This is rated 13+<br>\r\n-No killing any of the characters mentioned above. Anyone else is fine as long as it isn't gory<br>\r\n-Only I can end the story<br>\r\n-Don't have the characters be overly OOC<br>\r\n-250+ characters to every chapter (Longer recommended)<br>\r\n-<b>I claim the right to edit or delete any chapter</b><br>\r\n<br>\r\n<b>EDIT 11-25-12:</b> I reserve the path will all 1's for the main story. You can add to any other part of the story.</td>",
        "id":1905030,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1353937860,
        "modified":1353937860,
        "pretty_title":"Hypergaia"
    }
}