{
    "chapters":{
        "1":{
            "author_id":"davidvincy",
            "author_name":"David Vincy",
            "choices":[
                "Stay at home with his family",
                "Head over to one of his neighbor's houses",
                "Go to the local park",
                "Go to school",
                "Go somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>    Alex let his eyes open slowly to the bright shining sunbeams that flittered through the blinds of his window. Acknowledging the fact that it was the morning, he sat up in his bed and stretched his arm out and yawned. It was days like this that reminded him why life was so great because he had so many options for how to  spend them. Getting out of bed Alex mad his way over to his dresser to pick out something to wear.<br>\r\n<br>\r\n    Seeing how it was the middle of April, the base temperature of the day was roughly sixty-three degrees but other than that Alex would just have to guesstimate on how he should prepare for the day. Finally he put on a pair of jeans, and a T-shirt with a logo on it from one of his favorite games.<br>\r\n<br>\r\n    After getting his sneakers on Alex sat down in the chair next to his desk to think about what he wanted to do today.<br>\r\n<br>\r\n    Finally he decided to...</span></div></div>",
            "created":1553749200,
            "id":2636416,
            "title":"Rise and Shine"
        },
        "11":{
            "author_id":"davidvincy",
            "author_name":"David Vincy",
            "choices":[
                "Holly, coming in to check on him.",
                "Jessica, coming in to borrow his computer.",
                "Suzy, coming in to play a game.",
                "Chelsea, coming in to bother him.",
                "nobody, the footsteps past by."
            ],
            "content":"<div class=\"\"><div> <span>    Alex decided to hang out with his family at home today. Unfortunately they aren't actually at home right now but they will be soon. \"Better find a way to kill the time\" He thought to himself. <br>\r\n<br>\r\n    After taking off his shoes and leaving them by his desk, Alex lay back down on his bed and whip out his phone. He began by texting his mom that he would be home and then started looking through his texts and pictures. All of a sudden a dirty idea pops into Alex's head and he got online. Alex went to one of your favorite sites to read some stories about giantesses, and begin reading. After a while of that he found himself drifting off to sleep.<br>\r\n<br>\r\n    Alex suddenly awoke to his world suddenly shaking and darts up, but as he gathers himself and wipes the tired from his eyes his vison is consumed with something very wrong. Alex looks around and sees that he has shrunk and is sitting on top of his pillow which now seemes to span out to the size of a parking lot. Given a look at his surroundings he guesses that he's about an inch tall. <br>\r\n<br>\r\n    While thinking about all of this he hears voices in the distance, which he guesses belong to his family, which would mean that what woke him up was the vibrations from the front door closing.<br>\r\n<br>\r\n    Suddenly he hears the sound of footprints coming from outside his door. Who could it be. <br>\r\n<br>\r\n    It was...</span></div></div>",
            "created":1553749200,
            "id":2636435,
            "title":"Things Get Strange"
        },
        "111":{
            "author_id":"froakie",
            "author_name":"Froakie",
            "choices":[
                "It was a story about a shrunken person being used as a sex toy!",
                "It was a story about a shrunken person being eaten by their sister!",
                "It was a story about a shrunken person being crushed by their own mom!"
            ],
            "content":"<div class=\"\"><div> <span>\"Alex, Alex? Are you in there?\" Alex heard his mother Holly from the outside.  The door opened up and the giantess mother peeked her head inside.<br>\r\n<br>\r\nThe tiny man watched as his mother walked into the room, rubbing her hands through her dark brown hair.  She was wearing a light coat that revealed her large D cup breasts as she moved her hands down her body and touched her short dark multicolored exercise shorts.  They were primarily black but with little strings of pink designed onto them.  <br>\r\n<br>\r\nHe quickly started making his way towards the end of his bed.  Given how small he was, he wasn't sure if he'd be able to get to the ground without hurting himself.  He had to get her attention, it might be the only way for him to get safe.<br>\r\n<br>\r\nAs he ran towards the end of the bed, he saw his mother bend down to pickup some trash he had not thrown away in his room.<br>\r\n<br>\r\n\"Alex, when you get back here, you are going to get it for not picking up.\" she said, still bent over unknowingly giving her tiny son a nice view of her cleavage.  Alex started to feel somewhat aroused at his new size.  He had to shake his head and focus.  This was his own mother after all.<br>\r\n<br>\r\n\"And you left your phone here too.\"<br>\r\n<br>\r\nAlex watched as his mother sat on the bed, throwing him up and into the air.  He flew up until finally landing on his own mom's lap.  She had not even noticed as she picked up her son's phone.<br>\r\n<br>\r\nSwiping the phone, the phone immediately unlocked which was unusual because Alex had a password on it.  He realized that he must have shrank really quickly for it to still be unlocked.<br>\r\n<br>\r\n\"Hmm. . \" Holly said looking at the phone. \"Alex, I can't believe you like the idea of being. . small.\" she said.  Oh no, she had seen the giantess sites!!! Alex felt terrified of the stories he had been reading.  <br>\r\n<br>\r\nAlex needed to get out of this situation and now.  Moving across his mother's shorts, he started to try and get down from his current location.  As he moved downward, he started to stir as he touched the bare thigh of his mom.  A sudden motion happened as his mother reached down and grabbed him in her hand.<br>\r\n<br>\r\n\"W-wha. . what is. . A-Alex. . is. . is that you?  D-did you. . did you do this because of your website?  Is this what you really want?\" she said, a look of disgust on her face with your phone in hand still.<br>\r\n<br>\r\n\"M-mom, no. . it. . I never wanted to be small!!\" Alex said fearfully as his mother looked down at him puzzled. \"P-please. you have to help me!!\"<br>\r\n<br>\r\nThinking about it, which kind of story was the last thing he read before Alex passed out?  Who knew how bad the story was she was looking at?</span></div></div>",
            "created":1554872400,
            "id":2643147,
            "title":"A much bigger Holly"
        },
        "1112":{
            "author_id":"davidvincy",
            "author_name":"David Vincy",
            "choices":[
                "He's just seeing things, Holly's really worried.",
                "Nope, he saw correctly, she's getting curious.",
                "Someone comes in, interrupting them."
            ],
            "content":"<div class=\"\"><div> <span>            Holly truly had no idea what to do in this situation. She was holding her tiny son in one hand, and a truly bizarre story in the other. It's not that she was disgusted by the situation, she was just lost for an answer.<br>\r\n<br>\r\n            She turned her gaze back to the phone and spoke. \"Please Alex, try and help me understand what I'm looking at here.\" Holly began scrolling through the story till she came to a particularly weird part. <br>\r\n<br>\r\n             Holly read the section aloud. \"Looks like it's time to put you where you belong, little bro\".  As she read the description of the sister in the story dropping her brother in her mouth and sending down her throat, Alex got more and more nervous. <br>\r\n<br>\r\n              It might just be that because he's smaller so he may just be noticing things he couldn't before, but the way the corners of his mother's lips were rising to form a smirk was freaking him out. <br>\r\n<br>\r\n               Or maybe he's just seeing things.<br>\r\n</span></div></div>",
            "created":1559538000,
            "id":2668544,
            "title":"The story about the sister"
        },
        "1113":{
            "author_id":"shadowplayer",
            "author_name":"Shadow",
            "choices":[
                "She wanted to roleplay the mother and son in the story.",
                "She wanted to tease him with her foot.",
                "She wanted to play a game of cat and mouse.",
                "Before she could respond, Jessica entered the room.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span> Holly read a bit of the story. It was fairly disturbing yet…intriguing. She wondered just how long her son had been into this sort of thing. Alex kept trying to get her attention, becoming nervous as to what might happen next.<br>\r\n<br>\r\n“Mom, we have to find a cure for this, please!” He called out.<br>\r\n<br>\r\n“David could do nothing as his mother taped him down to the chair. She was done toying with him and was ready to fulfill his new destiny. The boy screamed as his mother turned and aimed her large ass towards him. The woman giggled and started to lower it. The boy struggled but was unable to do anything as his mother’s butt came down on him, ready to send him into…” She started to read.<br>\r\n<br>\r\n“MOM!” Alex screamed, startling her. “Focus…please.” He pleaded.<br>\r\n<br>\r\n“How long have you been into this?” She asked. Alex blushed and turned away.<br>\r\n<br>\r\n“For a while.” He said. The giantess smiled and kissed him.<br>\r\n<br>\r\n“It’s ok, I don’t mind.”<br>\r\n<br>\r\n“Really?”<br>\r\n<br>\r\n“Sure, it’s ok to be different. Take me for example, I actually have a foot fetish. I’m not entirely sure why, it’s just that the smell is appealing and their toes…but never mind that. Now that you’re tiny, why don’t we have a bit of fun with your new size.” She suggested. Alex became worried once more.<br>\r\n<br>\r\n“Like…how?”</span></div></div>",
            "created":1591074000,
            "id":2844686,
            "title":"Interest Entering the Heart of Holly"
        },
        "114":{
            "author_id":"davidvincy",
            "author_name":"David Vincy",
            "choices":[
                "Just Chelsea",
                "Double the trouble"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>    Was it just Chelsea, or was Suzy with her?</span></div></span></div>",
            "created":1553749200,
            "id":2636436,
            "title":"Oh Dear God"
        },
        "12":{
            "author_id":"davidvincy",
            "author_name":"David Vincy",
            "choices":[
                "the Smith's house to his right",
                "The Fisher's house to his left",
                "Somebody else aproches him before he can leave",
                "Everything goes black and he faints",
                "The mailman is here"
            ],
            "content":"<div class=\"\"><div> <span>    Alex leaves his room and heads downstairs to the front door, as he exits he notices a bit of cloudiness in the distance. Still though other than that, it was a fairly beautiful day. Now to choose, which of his neighbors did Alex decid to visit. <br>\r\n<br>\r\n    Rightt or left</span></div></div>",
            "created":1553749200,
            "id":2636454,
            "title":"Head over to one of his neighbor's houses"
        }
    },
    "info":{
        "author_id":"davidvincy",
        "author_name":"David Vincy",
        "brief_description":"Your name is Alex Mathews, and one day you shrink. F/m story.",
        "created":1553795400,
        "description":"<td align=\"left\" class=\"norm\">Time to set some rules real quick.<br>\r\nNo giant Male interaction. <br>\r\nNo scat<br>\r\nNo one sentence chapters (unless your adding a quick choice.<br>\r\nHave fun with it. I want this to flourish.<br>\r\n<br>\r\n<br>\r\nSynopsis: Your name is Alexander Mathews, and one day you begin to shrink. What kind of adventures or troubles will you get yourself into?<br>\r\n<br>\r\n<u>Character Intros</u><br>\r\n<br>\r\nMain Family:<br>\r\n<br>\r\nAlexander (Alex) Mathews- Main Character/You are 16 years old with light brown hair and blue eyes. Your height is 5'8\" and you have a pretty muscular build. Despite the fact your strong, you also scare pretty easy. You actually have a bit of a giantess fetish, so this should be interesting.<br>\r\n<br>\r\nHolly Mathews- Your mother is 39 with dark brown hair and hazel eyes. A bit on the shorter side, she stands at 5'4\" and is a bit chubby with D cup breasts, a big ass, and full lips. She loves her children very much, but also likes to tease them from time to time. Holly isn't super happy that she is the shortest member of the family.<br>\r\n<br>\r\nJessica Mathews- your older sister at the age of 19, with white blonde hair and blue eyes. She is actually slightly taller than Alex at 5'10\" and enjoys looking down on her siblings. She is fairly fit with C cup breasts and a nice ass.<br>\r\n<br>\r\nSusie Mathews- your younger sister is 14 with dirty blonde hair and hazel eyes. She is 5'5\" and on the heavier side with C cup breasts and a big ass. She loves messing with her brother, usually through causing him some sort of pain, or suprising him.<br>\r\n<br>\r\nSide Family:<br>\r\n<br>\r\nKristen Wellings- this is Alex's aunt. At the age of 37 Kristen is a no nonsense woman standing at 6'1\". She has DD cup breasts and a thick ass. <br>\r\n<br>\r\nMaria Wellings- Maria is Kristen's wife. She is 36 and stands at 5'9\". Maria always messes with Alex and sometimes flirts with him. She wrestles with him from time to time usually coming out on top. She has D cup breasts with a thick ass<br>\r\n<br>\r\nAbigail- She is Kristen's and Maria's adopted daughter. She is 10 years old, 4'6\", and has a sweet personality. She wouldn't hurt a fly but we'll see what happens.<br>\r\n<br>\r\nLisa Morris- this is Alex's other aunt. She stands short at 5'6\". Lisa is a bit on the boorish side usually not caring whe she burps or farts<br>\r\n<br>\r\nNeighbors:<br>\r\n<br>\r\nTo the left<br>\r\nRebecca Fisher- this klutz is 40 years old but pretends like she's 25 with how flirtatious she is. Black hair, silver eyes, stands at 6'2\" with DD cup breasts.<br>\r\n<br>\r\nJulia- Rebecca's daughter. Julia is 13 years old and a major trouble maker. she's 4'11\" and likes to pick on Alex for being a \"scaredy cat\"<br>\r\n<br>\r\nTo the right<br>\r\nSara Smith- Sara is a black business woman. She is 42 years old, stands at 5'8\" and is looking for an outlet so she can relieve some stress. She has shorter curly hair, is very trim and has C cup breasts and a nice ass to match.<br>\r\n<br>\r\nBelle- Belle is Sara's daughter. She is 17 years old with dark skin, 6'1\" with C cup breasts, and a thick ass. Belle has had a crush on you since you were children but usually takes that out on you by doing random things like licking you on the cheek.<br>\r\n<br>\r\nOther People:<br>\r\n<br>\r\nKatie- This girl of 12 collects bugs, but no one knows what she does with them. best not to get caught by her unless you want to tempt fate.<br>\r\n<br>\r\nAshley- 15 years old and doesn't like people, except for you.<br>\r\n<br>\r\nChelsea- susies's best friend. 13 and loves messing with you when she's hanging out with your sister.<br>\r\n<br>\r\nIris-This spoiled little brat is 8 years old and hates you for not letting her get her way when you caught her picking on some other younger kids.<br>\r\n<br>\r\nMegan-35 years old and hates her hieght of 5'. Despite this though, she loves making jokes about being tall.<br>\r\n<br>\r\nGwen- 27 years old and kinda keeps to herself. She's a bit of a drifter who came to town one day and just decided to stick around. noe one knows where she's been living though.<br>\r\n<br>\r\nFor everybody else, I'll add the discriptions as they become relevant.<br>\r\n<br>\r\n</td>",
        "id":2186520,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/102149.jpg",
        "last_full_update":1591103940,
        "modified":1591103940,
        "pretty_title":"Shrinking Can Be Dangerous "
    }
}