{
    "chapters":{
        "1":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Final Fantasy XIII",
                "Final Fantasy X",
                "Final Fantasy VII",
                "Final Fantasy VI",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>From which game will the shrinking ladies be from?</span></div></span></div>",
            "created":1349413200,
            "id":1440903,
            "title":"Game Selection"
        },
        "11":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Lightning",
                "Serah",
                "Fang",
                "Vanille",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which lovely lady will get shrunk?</span></div></span></div>",
            "created":1349413200,
            "id":1440906,
            "title":"Final Fantasy XIII"
        },
        "111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Final Fantasy XIII",
                "Final Fantasy XIII-2",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which version of Lightning?</span></div></span></div>",
            "created":1349413200,
            "id":1440907,
            "title":"Lightning"
        },
        "1111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "A monster",
                "An ordinary animal",
                "Someone she knew"
            ],
            "content":"<div class=\"\"><div> <span>          The day had started off normal enough for Lightning. She got up, got ready for her day, went about doing her usual activities. A little after noon Lightning thought it might be nice to go for a walk outside. So she grabbed her gunblade and went out the door. As she walked around outside she lost sight of her house in the distance after a few minutes. At this point Lightning decided it was time to start heading back, but before she could she was engulfed in a blinding bright light. As she tried to sheild her eyes with one hand she quickly drew out her gunblade ready to defend herself, but she wasn't sure were to aim and the bright light was getting brighter. Suddenly, Lightning began to lose consicness. Tried as hard as she could to remain conscious, but it was a futile effort. She felt her gunblade fall out of her hand just as she passed out.<br>\r\n<br>\r\n          After an unknown amount of time Lightning woke up. She slowly got back on her feet and noticed that her surroundings had changed. She seemed to be in a forest with large strange looking trees. Then she noticed her now massive gunblade.<br>\r\n<br>\r\n          \"I've shrunk to about an inch in height,\" Lightning said stunned by her new size. This was a major problem for her, especially since her gunblade was now to big for her to use. Lightning tried to keep calm and figure out what to do when the ground beneath her feet began to shake, nearly making her lose her balance. She quickly glanced around for the source of the tremors, and saw that being made by...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1349413200,
            "id":1440989,
            "title":"1 Inch Lightning"
        },
        "11111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Ceratoraptor",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of monster?</span></div></span></div>",
            "created":1349413200,
            "id":1441192,
            "title":"A monster"
        },
        "111111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Became Ceratoraptor Chow",
                "Avoided the maw"
            ],
            "content":"<div class=\"\"><div> <span>          Lightning saw a now massive ceratoraptor heading her way. Again she was stunned by justhow small she was now. She was less than the size of a breath mint to it. As the ceratoraptor got closer Lightning realized she had to get out of sight before it noticed her. She quickly ran behind her gunblade. There was no possible way she could defend herself at her current size without a weapon. As Lightning hid behind her gunblade she couldn't help but wonder if she had gotten out of sight in time. Cautitously she looked out from behind her gunblade to make sure it hadn't noticed her. She was greeted by the sight of the ceratoraptor's open maw heading right for her. Lightning attempted to get out of the way and...</span></div></div>",
            "created":1349413200,
            "id":1441210,
            "title":"The Ceratoraptor Cometh"
        },
        "1111111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>          Lightning did her best to avoid the ceratoraptor's hungry maw, but before she realized what happened she found herself laying on the monster's tongue. Lightning looked around the mouth in disbelieve as she became drenched in saliva. The ceratoraptor rolled her around in its mouth and licked her against its palate as it savored her delicious flavor. Eventually, the tongue settled down and began to push Lightning towards the back of the throat. She tried to hold onto the tongue, but she was too slick from the saliva. Once she reached the throat the ceratoraptor swallowed her whole with a loud gulp. Lightning found herself slowly traveling down the esophagus headfirst, getting covered in even more saliva on the way. She struggled as much as she could within the confineing tube, but only succeeded in makeing herself travel down the esophagus faster. Soon her journey came to an end, and Lightning screamed as she landed in the stomach with a plop. She struggled even more than she had been able to in the esophagus, but she knew it was useless. Soon the digestive jucies began to flow and started to work on dissolveing her. 'I never thought I would go like this' Lightning thought to herself as she closed her eyes for the last time.</span></div></div>",
            "created":1349413200,
            "id":1441332,
            "title":"From Lightning to Eclair"
        },
        "1111112":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Out of the Way in Time",
                "Stepped on"
            ],
            "content":"<div class=\"\"><div> <span>          Lightning rolled past the ceratoraptor's jaws just as they were about to close on her, and found herself behind its head just out of sight. The ceratoraptor looked left and right for Lightning not realizing that she was on the ground right behind its head. Eventually, the ceratoraptor let out loud screech, frustrated that its prey had gotten away, that forced Lightning to cover her ears in order to keep from going deaf, and began to walk away. As Lightning uncovered her ears she noticed a shadow come over her. She looked up and saw the ceratoraptor's foot coming down towards her. Acting quickly, Lightning attempted to dodge the foot, just as she had with the maw, and got...</span></div></div>",
            "created":1350450000,
            "id":1448536,
            "title":"Still in Danger"
        },
        "11111121":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "She found something",
                "Something interrupted her search"
            ],
            "content":"<div class=\"\"><div> <span>          Thanks to her quick thicking, Lightning managed to get out of the way before the ceratoraptor's foot came down on top of her and ended up in a patch of tall grass that continued to keep her hidden from the monster. She watched the ceratoraptor leave for a few moments, and then when she was sure it wouldn't turn around and see her, she ran off in the oppisite direction. Lighting wasn't sure how long she had run, but she stopped running once she came across a rock that was taller than her. Panting heavily, she leaned back against the rock and slid down it.<br>\r\n<br>\r\n          \"I *pant* keep going *pant* on *pant* like this,\" Lightning thought out loud to herself as she slowly began to regain her breath. \"I *pant* need *pant* a weapon *pant* that I can *pant* use.\"Lightning continued to rest for a bit against the rock. Then once she felt back to normal she got up and walked away. As she walked Lightning looked all around her surroundings. Trying to find anything she could use to make a weapon to defend herself with. Eventually...<br>\r\n<br>\r\n</span></div></div>",
            "created":1350450000,
            "id":1448543,
            "title":"Weapon Needed"
        },
        "111111211":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "She was thirsty",
                "It was getting dark"
            ],
            "content":"<div class=\"\"><div> <span>          As Lightning searched for anything that she could use to make a weapon, she came across a twig that was small enough for her to carry. So she picked it up and started to rub one end of the twig against a nearby rock. She did this until the end of the twig became pointed and sharp. Then she took a step back from the rock and examined the makeshift spear she had just made.<br>\r\n<br>\r\n          \"It's not a gunblade, but I'll have to make do with this for now,\" Lightning said as she examined her new spear. When she finally stopped examining the weapon, she realized that...<br>\r\n<br>\r\n</span></div></div>",
            "created":1350882000,
            "id":1451659,
            "title":"Makeing Do"
        },
        "1111112111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "The water hole",
                "The puddle"
            ],
            "content":"<div class=\"\"><div> <span>          Lightning smacked her lips together as she realized just how thirsty she was. She needed to get some water and soon. So, useing her hand to shield her eyes from the sunlight, she quickly scanned the surrounding area for any signs of water. Almost imeadeately she spotted a water hole that didn't seem to be too far away. However, Lightning knew that water holes attracted all types of creatures, and she wasn't quite used to her makeshift spear yet. So if she went to the water hole there was a good chance something could step on or worse, gobble her up. She shivered a bit at the thought. Then Lightning noticed a small puddle that might be safer for her to get a drink from, but it was farther away. She knew that both of those opitions involved great risk for her, but she wasn't exactly sure which was the greater risk. Eventually, Lightning decided to go to...</span></div></div>",
            "created":1350968400,
            "id":1452321,
            "title":"Thirst"
        },
        "11111121111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "She gave into temptation",
                "A shadow loomed over her"
            ],
            "content":"<div class=\"\"><div> <span>          Lightning figured that it would be too risky to try and make it to puddle. So she began to make her way to the water hole which was closer. She kept an eye out for any sign of danger as she made her way to the water hole, and even got some experince in useing her makeshift spear when a rather large bug showed up and tried to make meal out of her. Lightning had managed to hold the bug at bay with her spear until she was able to get it off of herself, and then she proceeded to stab it the eye. The bug made a hissing sound at her and scurried off, and she continued her journey to the water hole.<br>\r\n<br>\r\n          Eventually, Lightning made it to the shore of the water hole. Cautiously she knelt down, placeing her spear by her side, cupped her hands together in the water, brought them up to her lips, and took a sip of the water. It was cool and refreshing, and Lightning continued to drink from the water until her thirst was satisfied. Then she just sat there for a moment and watched the waves of the water come and go from the shore. Lightning soon realized that she was actually tempted to go for a swim in the water. However, she knew that wouldn't be the wisest idea at her current size, and she debated with herself about what she should do when...</span></div></div>",
            "created":1353992400,
            "id":1476639,
            "title":"Refreshing."
        },
        "111111211112":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Some creature's foot descening towards her",
                "A Frog"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          Suddenly, a shadow loomed over Lightning. She quickly turned around and saw...</span></div></span></div>",
            "created":1353992400,
            "id":1476641,
            "title":"Impending Danger"
        },
        "1111112111121":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the creature a Chocobo?</span></div></span></div>",
            "created":1359435600,
            "id":1519454,
            "title":"Some creature's foot descening towards her"
        },
        "11111121111211":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "She holds the spear over her head",
                "She tries to make a rub for it."
            ],
            "content":"<div class=\"\"><div> <span>          The chocobo's foot was descending rapidly towards Lightning. She quickly picked up her makeshift spear and prepared for her next course of action. She knew she only had two options. One she could hold the pointed end of her spear over her head and hope that it would cause the chocobo to back away. Two she could try and run out from under the chocobo's foot before it came down. Lightning had to decide quickly as the foot was nearly upon her.</span></div></div>",
            "created":1359435600,
            "id":1519466,
            "title":"The Chocobo"
        },
        "111111211112111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Ate her",
                "Stepped on her"
            ],
            "content":"<div class=\"\"><div> <span>          As the Chocobo's foot came down Lightning raised her make shift spear over her head. As the chocobo's foot was just about to crush her, the point of her spear buried itself into the foot. The chocobo squawked loudly in pain and pulled its foot away with such force that the spear was ripped from Lightning's hands. As the chocobo's foot came back down on the ground she heard the unmistakable sound of her spear being crushed to pieces. <br>\r\n<br>\r\n          The chocobo squawked in pain and anger as the tip of the spear was still stuck in its foot. Then it spotted Lightning. It quickly put two and two together and came to the conclusion that she was responsible for the pain it was in. It squawked angrily at her.<br>\r\n<br>\r\n          \"Crap,\" was all Lightning could say just before the chocobo...<br>\r\n<br>\r\n</span></div></div>",
            "created":1359435600,
            "id":1519478,
            "title":"The ANGRY Chocobo"
        },
        "1111112111121111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>          The chocobo squawked angrily at Lightning and pecked her up so quickly it took her a moment to realize that she was now inside of its beak. Lightning's stay in the beak wasn't long though as the chocobo's tongue quickly pushed her to the back of the throat. Then the chocobo tilted its head back and swallowed her whole with a loud gulp. Lightning slowly traveled down the esophagus. She quickly became covered from head to toe in saliva and mucus. While the muscles massaged her down towards the stomach Lightning struggled as much as she could within the confining tube, hoping to get the chocobo to choke and spit her out. Unfortunately, she only succeeded in making herself travel down the esophagus faster. Lightning could hear the chocobo's heart beating like a drum as she passed by it. She could also hear the gurgles of the stomach growing louder as if calling to her. She knew her destination was inevitable, but she still continued to struggle. Soon she came to a ring of flesh hat was none other than the stomach sphincter. Recognizing Lightning as food it opened up and she fell into the stomach landing with a plop. Lightning quickly stood up and began kicking and pounding on the stomach walls, unwilling to accept her fate as a chocobo's meal. When the digestive juices began to flow, Lightning passed out from a lack of air and exhaustion, collapseing into a puddle that had already formed next to her. Soon she was floating around the stomach in digestive jucies; her unconciousness saveing her from the pain of digestion. Meanwhile, the chocobo was still in pain, but it felt a little satisfied after eating Lightning. Not only had it gotten revenge upon her, but she had actually been a tasty and decent meal. While it digested Lightning the chocobo went about its life endureing the pain in its foot until the rest of Lightning's spear fell out. </span></div></div>",
            "created":1359522000,
            "id":1520216,
            "title":"Chocobo Chow"
        },
        "1111112111121112":{
            "author_id":"numerio",
            "author_name":"Tex",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>planted it's foot on Lightning. It slowly increased pressure until it became too much for Lightning, and she exploded.</span></div></span></div>",
            "created":1359608400,
            "id":1521160,
            "title":"Stepped on her"
        },
        "1111112111122":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>          Lightning quickly turned around to see a frog stareing at her. She was just about to reach for her spear when the frog opened its mouth and shot its long sticky tongue out at her. The tongue hit Lightning front and center and quickly retracted back into the frog's mouth, takeing her along with it. Inside the frog's mouth she quickly became soaked from head to toe in the frog's sticky saliva. Lightning struggled as best as she could in order to keep from becomeing the frog's main course, but like a great many insects before her the frog easily swallowed her. She traveled down the short esophagus, the muscles working quickly to massage her into the stomach. As Lightning slid into the cramped stomach she resumed her futile struggles. However, her movement was restricted by how cramped the stomach was and the sticky saliva that covered her entire body. She soon gave up though, exhausted. It was then that Lightning noticed how warm and soft the stomach walls were. It felt nice, and Lightning allowed herself to drift off into a deep sleep, that she wouldn't awaken from, just as the digestive jucies began to flow.</span></div></div>",
            "created":1353992400,
            "id":1476653,
            "title":"An Eclair for an Amphibian"
        },
        "1111112112":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "The hole",
                "The cave"
            ],
            "content":"<div class=\"\"><div> <span>          \"Crap!\" Lightning said as she realized what was happening in her surroundings. She could see that the sun was setting and it was getting dark. She knew that she looked like a tasty treat to the daytime creatures, but she would be an irresistible buffet to any nocturnal ones. What made things worse though was that she hadn't had time to practice with her spear yet, so it would be no help to tonight. She realized she had to find shelter and quickly. So with spear in hand she set off to find shelter. Eventually, Lightning came across two possible places for her to take shelter in. One was a hole in the ground, and the other seemed to be a rather small cave. She knew that they both had their risks. If either one was already occupied she could wind up in some creature's belly. As the sun sank lower in the sky, Lightning knew she had to make her decision quickly.</span></div></div>",
            "created":1350882000,
            "id":1451669,
            "title":"Seeking Shelter"
        },
        "11111121121":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "A sleeping animal",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>          Makeing her decision quickly, Lightning made a mad dash for the hole as the sun continued to set. She quickly dove towards the hole and made it inside just as the sun disappeared below the horizen. Standing up she quickly dusted herself off, and procceeded deeper into the hole where she would most likely be safer while staying alert for any possible danger from within the hole istself. At first the floor of the hole was a gentle incline, but as Lightning progressed farther into the hole she noticed that the floor was becoming steeper and steeper. Eventually, the floor became so steep that she actually lost her footing. Lightning screamed as she suddenly found herself tumbleling down he hole unable to stop herself, causeing her to lose her grip on her spear. After a few moments she came to a hard stop at the bottom of the hole.<br>\r\n<br>\r\n          \"Damn,\" Lightning cursed as she slowly got back on her feet and dusted herself off. Then she noticed that her spear was lying close by, and went over to pick it up.<br>\r\n<br>\r\n          \"It's lucky I didn't impale myself on this on the way down,\" Lightning said as she held her spear in her hand once again. Then she noticed there was something in the hole with her. On closer inspection she realized with shock that it was...</span></div></div>",
            "created":1350968400,
            "id":1452316,
            "title":"Down the Hole"
        },
        "111111211211":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "A tortise",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Lightning was surprised to see that she was not alone the dark hole. She was sharing the hole with an animal that was much larger than her. Lightning stood still for a moment then breathed a sigh of relief as she realized the creature was asleep, or at least resting, so it hadn't noticed her. I'd like to keep it that way, Lightning thought to herself as she slowly started backing up away from the creature and back towards the entrance that she came through. Then she stopped in her tracks as she saw the creature suddenly stirring. What had aroused it from its slumber, or rest, Lightning had no idea. However, she knew for sure the creature was now aware of her presence as it lifted its head and looked straight at her. What kind of animal was it? </span></div></div>",
            "created":1379096580,
            "id":1662322,
            "title":"Not Alone"
        },
        "1111112112112":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it a snake?</span></div></span></div>",
            "created":1379096580,
            "id":1662323,
            "title":"Snake?"
        },
        "11111121121122":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it some sort of worm like creature?</span></div></span></div>",
            "created":1379096700,
            "id":1662324,
            "title":"Worm Creature?"
        },
        "111111211212":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Hissing sound",
                "Cracking sound"
            ],
            "content":"<div class=\"\"><div> <span>Lightning saw that a group of strange looking eggs was at the bottom of the hole with her. She realized that she had fallen down into some kind of nest. However, she wasn't sure what kind of creature made this nest. She approched the eggs in order to get a closer looked, and placed a hand on one of them.<br>\r\n<br>\r\nLightning had never seen eggs like these before. All of them were about as big as she was and were a bright purple color. The shells of the eggs felt hard and fairly smooth.<br>\r\n<br>\r\n\"I wonder what kind of creature laid these?\" Lightning said aloud. \"Doesn't matter, I need to get out of here before either these things hatch or the mother comes back.\"<br>\r\n<br>\r\nSo Lightning removed her hand from the egg she had been touching and turned around to try and leave. She had only taken a few steps when she heard a sound, that not only made her stop in her tracks, but made her blood run cold. From behind her she heard a. . .</span></div></div>",
            "created":1377882360,
            "id":1654278,
            "title":"The Nest"
        },
        "1111112112121":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Leave the nest",
                "Eat her"
            ],
            "content":"<div class=\"\"><div> <span>Lightning turned around to see a large and rather strange reptilian looking creature. The creature had a long serpent like body, with only two short legs just below its long neck, and a head that looked similar to that of an adamanchelid's. It was a dark red color and was easily larger then Lightning. She wasn't sure how she could have possibly missed seeing such a large creature hideing around the eggs earlier, but that didn't matter now. What mattered was the fact that an angry looking creature, that she could only assume was the mother, had its full attention on her.<br>\r\n<br>\r\nThe creature hissed at Lightning once more and procceeded to make its way toward her at an incredible speed. Not being someone who was scared off easily, Lightning held up her spear and threw it at the creature as hard as she could. Unfortunately, the creature caught her spear in its mouth, crushed it to peices with its powerful jaws, and continued its charge towards her.<br>\r\n<br>\r\nNow haveing no weapon to defend herself with, Lightning was forced to run away as she could. She headed towards the entrance that she had into the nest from, with the creature in close pursuit. If she could make it to the entrance and climb out of there then the creature might stop chaseing her. It was good idea but the creature wasn't far behind and Lightning wasn't sure if she could out run it in time, but she had to try. She was almost to the entrance when suddenly something hit her from behind and caused her to fall forwards.<br>\r\n<br>\r\n\"What the?\" Lightning said as she looked back to see what had happened.<br>\r\n<br>\r\nTo her surprise, she saw that there was now some kind of resin covering her legs now. That's what had caused her to fall, but where had it come from? Lightning didn't have to wait long to find out as she looked up to see the creature now towering over her. Staring down at her the creature opened its mouth and spat more of the resin at her. When the resin hit this time it covered Lightning's entire torso and pinned her arms to her side. Now she found herself trapped in a cocoon made of the resin with only her head and feet sticking out. It constricted Lightning's movements and left her unable to get back up on her feet. She struggled in vain to break free, but she was just too constricted the resin. Giving up for a moment Lightning looked back up at the creature that had imprisoned her like this in order to see what it would do next. The creature procceeded to . . .</span></div></div>",
            "created":1377885060,
            "id":1654319,
            "title":"Strange creature"
        },
        "11111121121211":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>The creature hissed again, and then to Lightning's surprise it left nest via the way she had come in. Lightning was confused as to why the creature left. She thought for sure that it was going to eat her or something equally as horrible. However, she couldn't bother with that at the moment, and resumed trying to break free of the cocoon. Once again though it proved to be useless. <br>\r\n<br>\r\nThere has to be some way for me to break free, Lightning thought to herself. Then she suddenly remembered her survival knife. She could try useing it to cut herself free. So Lightning began to try and get her survival knife out, which was alot easier said and done since the cocoon restricted her movent and kept both of her arms pinned to her sides. As she was trying to reach her knife, Lightning heard a bone chilling sound that made her pause. She could hear faint hissing noises coming from within the eggs. It was then that Lightning realized the had done something far worse than eating her as punishment for her intrusion. Beginning to panic she hurried to try and reach her knife so she could escape before the eggs hatched.<br>\r\n<br>\r\nLightning finally got her survival knife out of her pocket and began struggleing to open it just as the first craking sounds began. Come on, come on, she pleaded in her head as she struggled to open the knife. Eventually she managed to get it open. Yes!, Lightning thought as began trying to cut the resin open with it. Then her heart sank in despair and she became filled with dread as she dicovered that the resin was too strong for her knife to cut through.<br>\r\n<br>\r\n\"No damn it,\" She said and looked over to the eggs to see how much time she had left. Lightning's dread turned to horror as she saw that eggs had finished hatching. The creatures that had hatched from the eggs looked like smaller versions one the that had cocooned her. She only became more terrified as the hatchlings began to move closer and closer to her. Eventually, Lightning screamed in terror, unable to control herself anymore, just before the hatchlings began to eat their very first meal. The pink haired meal that their mother had cocooned for them before leaveing.</span></div></div>",
            "created":1377887100,
            "id":1654346,
            "title":"First Meal"
        },
        "11111121121212":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>The creature lowered its head down and procceeded to take Lightning's cocooned lower half into its maw. Then the creature lifted her up and tilted its head back. As Lightning struggled to get free of both the cocoon and the creauture's mouth, it made a quick gulp and brought her cocooned torso into its maw. With dread she realized the creature was eating her.<br>\r\n<br>\r\n\"Noooo!\" Lightning cried out in despair as the creature made another gulp and brought her head into its maw. The creature then snapped it mouth closed imeadeatly. Inside the maw it was too dark for Lightning to see as she become covered in saliva, and she wasn't able to get a good look at the inside before it snapped shut. However, that didn't really matter too her since she wasn't going to be there long. With one final gulp the creature swallowed her whole, cocoon and all.<br>\r\n<br>\r\nLightning quickly found herself travelling the creature's long esophagus as she became covered from head to toe in mucus and saliva. She couldn't see how it could have turned out any worse. She had been shrunk to an inch in height and then swallowed alive by a creature she had never seen before. What made it worse was that she was still trapped in her resin cocoon so she was rather uncomfortable as the muscles in the esophagus slowly massaged her down to the stomach. Lightning couldn't even struggle a little since the cocoon was too restrictive and the esophagus too confined. So all she could do was wait until she reached the stomach.<br>\r\n<br>\r\nEventually, Lightning's journey into the creature came to a sudden halt, and she found herself lying in long and confining, though not as confining as the esophagus, chamber. This must be the stomach, she realized. Then, almost as soon as she came to that conclusion, the digestive jucies started seeping in and began to go to work on her as they quickly covered her from head to toe. Lightning cried out in pain as she and her resin cocoon were slowly digested. Fortunately, for her though she passed out from the pain and lack air well before she was turned into a nutritous soup and sent to the intestines. At least Lightning didn't have to suffer from the pain of being digested for too long.</span></div></div>",
            "created":1377889320,
            "id":1654377,
            "title":"Craveings For Lightning"
        },
        "11111121122":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>          Thinking it over quickly Lightning decided to take shelter in rather small cave. She rushed in as fast as could just as the sun finished setting. Once iside she took amoment to catch her breath and took a look at her new surroundings. Lightning couldn't see much though because there was very little light in the cave. Suddenly, Lightning remembered that she was still rather close to the entrance of the cave and decided to head farther in. As she moved deeper into the cave she stayed alert for any potential danger as her eyes slowly began to adjust to the low lighting. Eventually, she came to a stop in a part of the cave she felt was safe enough to get some sleep. So she leaned her makeshift spear against a wall, and laid down on floor, quickly drifting off to sleep.<br>\r\n<br>\r\n          Lightning suddenly woke up when she felt something wet drip onto her head. She imeadately noticed that the ground beneath her had become wet and squishy, and that there was a warm fowl smelling current of air constantly washing over her. She reached for her spear but found that it wasn't there. That's when she realized she was in the mouth of some creature she had never seen before and never would. Then the creature started licking Lightning against the roof of its mouth and rolling her around on its tongue. This went on for quite sometime as the creature savored her delicious flavor. Then the tongue settled down and began to push her to the back of the throat. Once there, Lightning felt the creature tilt its head back, and with a loud gulp swallow her whole.<br>\r\n<br>\r\n          Lightning slowly traveled down the esophagus. She struggled as much as she could within the confineing tube in hopes of getting whatever creature that just ate her to choke and spit her out, but she only succeeded in makeing herself travel down the esophagus faster. Eventually, Lightning landed inside the stomach with a splash. The digestive jucies imeadeately began to go to work on her. She screamed in pain as she felt herself slowly began to dissolve. However, Lightning soon passed out from the pain and closed her eyes for the last time.</span></div></div>",
            "created":1350968400,
            "id":1452311,
            "title":"The Unknown Danger"
        },
        "111111212":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "A Bird",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          As Lightning searched for anything she could use to make a weapon she noticed that her surroundings had gotten darker. She knew it was late in the day, but it shouldn't already be getting dark out. Lightning quickly realized that it wasn't getting dark, but instead there was a large shadow looming over her. She turned around quickly and saw that the shadow was being cast by...</span></div></div>",
            "created":1350536400,
            "id":1449120,
            "title":"The Shadow"
        },
        "1111112121":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Ate her",
                "Took off with her in its beak"
            ],
            "content":"<div class=\"\"><div> <span>          Lightning looked up as she turned around and saw that the shadow was being cast by a bird that was quickly discending out of the sky. It was the direction that bird was heading that concerned her though.<br>\r\n<br>\r\n          \"Crap,\" Lightning said as she quickly realized that the bird was heading towards her.<br>\r\n<br>\r\n          She hadn't been able to make a weapon yet and she didn't have time to make one, thus she was defenseless against the bird. So Lightning did the only she could do and ran for cover. Unfortunately, she underestimated just how fast the bird was, and before she knew it the bird had landed right in front of her and pinned her down with its foot. The bird looked at Lightning curiously for a moment as she struggled in vain to get out from under its foot. Then all of the sudden the bird lifted its foot off of her. As Lightning began to get back up she was soon swept off her feet again. The bird clamped its beak shut around her upper half and lifted her into the air. The bird held Lightning in its beak for a moment while she kicked her legs uselessly in the air as she attempted to struggle free. Then the bird...<br>\r\n<br>\r\n</span></div></div>",
            "created":1350536400,
            "id":1449253,
            "title":"Attack From Above"
        },
        "11111121211":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>          Lightning could see just about every detail of the inside of the birds beak thanks to the bit of light that came through. She could even see the entrance to the dark tunnel, that was the throat, that she might be going down soon. She refused to let that happen and did everything she could to try and escape. She kicked her legs, which were stil dangleing outside, in hopes of makeing contact, and even tried punching the inside of the beak. Unfortunately, nothing worked. The bird wasn't even fazed as it licked Lightning with its tongue tasting her. Her entire upper half became drenched with saliva as it continued to taste her. Then the bird tilted its head back and with a gulp brought the rest of Lightning into its beak. It then proceeded to taste the rest of her as well. She quickly became covered in saliva from head to toe as the bird licked her and rolled her around on its tongue. Lightning knew she was in serious trouble, but there was nothing she could do about it. The bird savored her delicious flavor for a few moments, and then it started pushing her towards the back of the throat. Then the bird tilted its back and quickly gulped her down. Lightning struggled as best as she could as she slowly traveled down the esophagus, but only succeeded in makeing herself travel down it faster. Soon her journey came to an end and she landed with a splash inside a small chamber filled with saliva and stones. She was inside the bird's crop. She felt a sudden jolt the nearly made her lose balance as the bird took off again. Lightning began struggleing any way she could in order to escape her fate as bird food. However, she quickly passed out from exhaustion just as the crop prepared her for digestion.</span></div></div>",
            "created":1350536400,
            "id":1449268,
            "title":"Food Lightning Fast"
        },
        "11111121212":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Tried to reach the hole",
                "Tried to fight off the chick"
            ],
            "content":"<div class=\"\"><div> <span>          Lightning struggled as best she could in the bird's beak. She continued kicking her legs in the air hopeing to hit the bird and force it to spit her out. However, Lightning ceased her struggles as she suddenly felt the bird take off back into the air. As the bird carried her through the air in its beak she knew she was doomed. If she struggled and the bird dropped her she would fall to her death, and she had no doubt that once they arrived where ever the bird was takeing her it would eat her. A chill ran up Lightning's spine as she realized just how hopeless her situation was. So she just waited as the bird continued to fly away with her.<br>\r\n<br>\r\n          Lightning could not see where the bird was takeing her since her entire upper half was in its beak, and she couldn't tell for sure how long the had been flying but it felt like a long time. Eventually, she felt the bird begin to decsend, and, not too long afterwards, land. Then the bird tilted its head forward and spat her out. Lightning was dazed for a moment as she landed hard on the ground, but she quickly sat up took a quick look at her surroundings. The ground seemed to be comprised of twigs and leaves, and all around her were walls also made of twigs and leaves. It didn't take her long to realize she was in a nest, and to make matters worse she heard a hungry sounding cheap come from behind her. She truned around and saw a small chick, but still larger than her, eyeing her hungrly.<br>\r\n<br>\r\n          Her situation was worse than she had first realized. The bird had taken her back to its nest to feed her to its chick. Normally the chick wouldn't have been any threat to her, but now LIghtning was nothing more than a tasty snack to it. The chick soon began to approach her, eager for its tasty meal. Lightning noticed a small hole in the floor of the nest not too far to her left that looked like it would be large enough for her to fit through. She could make a mad dash for it and use it to escape. However, the chick was smaller than its parent so she might be able to fight it off. As she decided on a course of action the chick came closer and closer. Lightning had to act fast or she would become baby food. Makeing a quick decision she...</span></div></div>",
            "created":1350536400,
            "id":1449339,
            "title":"The Nest"
        },
        "111111212121":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes, she made it!",
                "No, she was snapped up!"
            ],
            "content":"<div class=\"\"><div> <span>          Lightning realized that even though the chick was smaller than its parent it was still large enough to easily devour her, and fighting it would most likely get her eaten. So she decided that the hole would most likely be her best bet for survival. Thus, Lightning started running as fast as she could toward the hole, just barely getting out of the way as the chick tried snapping her up. <br>\r\n<br>\r\n          The chick squeaked in annoyance as its meal was getting away. Lighting was halfway towards the hole when she heard the parent cry out in irritation as well. She took a quick over her shoulder as she ran and saw the beak of the bird that had brought her there quickly approaching, ready to snap her back to the hungry chick. At this sight she began run even faster, determined not to become a baby bird's lunch. Lightning was almost to the hole, but she could almost feel the bird's breathe as its beak came closer. She wasn't sure if she would make, but she wasn't willing to give up. Soon the hole was just a few feet away, and Lightning leaped towards the hole just as the bird was about to snap her up. Did she make it?</span></div></div>",
            "created":1384393140,
            "id":1693944,
            "title":"Dash for the Hole"
        },
        "111111212122":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>          Lightning quickly got up onto her feet and prepared to fight off the hungry chick. She stood ready as the chick came closer and closer. However, once the chick reached her it struck with such speed that Lightning found her entire upper half completely inside the chicks beak. Her head was almost in the back of its throat. Then the chick tilted its head back, lifting her legs up into the air as they kicked wildly as she struggled to get free. The chick then opened and closed its beak as it began to gulp Lightning down. It took only three gulps to swallow her alive, and she began to quickly travel down the esophagus struggleing all the way. Soon she landed in the cramped stomach with a splash. As Lightning attempted to make herself comfortable she couldn't believe what just happened. The chick had just gobbled her up with lightning speed. If she had tried to make it to the hole she might have survived, but instead she had decided to fight and now she was baby food. It didn't take long for the digestive jucies start eating away at Lightning, and cried out in pain as she slowly began to dissolve. She passed from the pain before she was completely digested though. Meanwhile, the chick wondered if its mother would bring it more tasty bugs like the one it just ate.</span></div></div>",
            "created":1350536400,
            "id":1449376,
            "title":"Lightning Fast Baby Food"
        },
        "1111112122":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A lizard perhaps?</span></div></span></div>",
            "created":1351054800,
            "id":1452888,
            "title":"Lizard"
        },
        "11111121221":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>          Lightning turned around to find a ginormous lizard standing before her. The lizard flicked its tongue out as it stared down at her. Lightning didn't like the way it was looking at her. Esecially since she still didn't have a way to defend herself. So she slowly started to back away when the lizard suddenly charged and scooped her up in its mouth. Lightning found herself lying on the lizard's tongue before she even realized what had happend, and it didn't take long for her to become drenched in saliva from head to toe. Then the lizard started licking her against the roof of its mouth and rolling her around on its tongue. The lizard savored Lightning's delicious flavor for quite some time. After a while the tongue settled down and started to push her towards the back of the throat. Then the lizard tilted its head back and swallowed Lightning whole with a loud gulp. She slowly traveled down the esophagus, becomeing covered in mucus and even more saliva. She struggled as much as she could in the confineing tube, but only succeeded in help the muscles massage her down into the stomach faster. Eventually, Lightning's journey came to an end as landed in the stomach with a splash. She cried out in pain as the digestive jucies quickly began to digest her. Fortunately, Lightning passed out from the pain before she was completely digested.</span></div></div>",
            "created":1353301200,
            "id":1471127,
            "title":"Lizard Snack"
        },
        "11112":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "A wolf",
                "A bear"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of animal?</span></div></span></div>",
            "created":1350882000,
            "id":1451647,
            "title":"An ordinary animal"
        },
        "111121":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Walked straight into its paw",
                "Found herself all alone"
            ],
            "content":"<div class=\"\"><div> <span>          Lightning looked around and saw that the tremors were being caused by a wolf heading her way.<br>\r\n<br>\r\n          \"Crap,\" she wispered as she realized the seriousness of the situation. Lightning was just a bite sized snack compared to the wolf and she had no way to defend herself at that moment. So Lightning quickly hid behind her gunblade and waited. When the tremors finally stopped she catiously walked out from behind her gunblade to make sure the wolf was gone and...<br>\r\n<br>\r\n</span></div></div>",
            "created":1353992400,
            "id":1476591,
            "title":"The Wolf"
        },
        "1111211":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>          Lightning was knocked off her feet as she walked straight into a large furry wall. Looking up she noticed she had walked straight into the wolf's paw. Shifting her gaze upward even more she noticed the wolf looking down at her its big amber eyes. The wolf had somehow noticed her go behind her gunblade and merely waited for her to come out.<br>\r\n<br>\r\n          \"Crap,\" Lightning said again as the wolf quickly procceded to pin her down with its paw. She immeadeately began to squirm around in an attempt to escape. The wolf lowered its head and began to sniff Lightning, trying to determine weither or not she would make a good meal. She soon realized she must have smelled quite tasty, as the wolf began to drool on her and lick its lips. Lightning began to squirm even more under the wolf's paw, and hoped that the wolf wouldn't consider her worth the effort. However, the wolf wasn't a picky eater and Lightning did smell quite tasty. With that the wolf lifted its paw off her, but before she could try to escape the wolf brought out its tongue and lapped her up.<br>\r\n<br>\r\n          Lightning found herself lying on the wolf's massive tongue. The wolf's foul smelling breath washed over her as she quickly became drenched from head to toe in saliva. Then the wolf started licking her against the roof of its mouth and rolling her around on its tongue trying to see if she tasted as good as she smelled. The wolf found that Lightning actually tasted better than she smelled, much to its delight. The wolf savored her delicious flavor for several minutes as she attempted to fight off its tongue. Eventually, the tongue settled down and began to push Lightning towards the back of the throat. She tried grab onto something, but she was too slick from the saliva that covered her. Then the wolf tilted its head back and swallowed Lightning whole with a loud gulp.<br>\r\n<br>\r\n           Lightning slowly traveled down the esophagus. It almost felt as if she was going down a slimey water slide as she became covered in mucus and even more saliva. Lightning struggled as much as she could within the confining tube in order to get the wolf to choke and hopefully spit her out, but all she succeeded in doing was helping the muscles massage her down faster. Soon Lightning's journey came to an end as she came to a wall of flesh that seperated her from the stomach. It quickly opened up, accepting her as food, and she fell into the stomach landing with a plop. Lightning looked around her new home in disbelieve. She had just been eaten by a wolf. A wolf just literally swallowed her alive. Lightning refused to accept her fate as wolf food and began struggle and pound on the stomach walls. She soon began to grow tired and laid down exhausted. Lightning fell asleep just as the digestive jucies began to flow, and thus was spared the pain of being digested.</span></div></div>",
            "created":1353992400,
            "id":1476626,
            "title":"Delicious Lightning"
        },
        "11113":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Snow",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was it?</span></div></span></div>",
            "created":1350968400,
            "id":1452345,
            "title":"Someone she knew"
        },
        "111132":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes",
                "No it was someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it Fang?</span></div></span></div>",
            "created":1377666000,
            "id":1652968,
            "title":"Fang?"
        },
        "1111322":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps it was Serah?</span></div></span></div>",
            "created":1377666000,
            "id":1652970,
            "title":"Serah?"
        },
        "11113221":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Lightning!",
                "A bug"
            ],
            "content":"<div class=\"\"><div> <span>Lightning looked up to see that the source of the tremors was her sister Serah, who was probably out looking for her, walking towards her location.<br>\r\n<br>\r\n\"I have to get her attention somehow,\" Lightning figureing that Serah might be able to help her.<br>\r\n<br>\r\nSo she boldly ran closer towards her sister, but makeing sure she was still far enough away to not get stepped on, and proceeded to wave her arms in the air while yelling Serah's name at the top of her lungs. Unfortunately, she was too small to be heard and Serah continued to advance towards her. Lightning knew that if she didn't get her attention soon she might end up a bloody stain on the bottom of her sister's shoe. Then she saw a rock that looked small enough for her to throw but big enough for Serah to feel.<br>\r\n<br>\r\nWasteing no time Lightning picked up the rock in both hands, and threw it with all her towards her sister.<br>\r\n<br>\r\n\"Ow,\" Serah said as the rock hit her shin, \"What was that?\"<br>\r\n<br>\r\nSerah looked down to she what hit her, and saw a tiny figure that she recognized as. . .</span></div></div>",
            "created":1377752400,
            "id":1653835,
            "title":"Getting Noticed"
        },
        "111132211":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Something interrupts her",
                "She enters one of the bedrooms"
            ],
            "content":"<div class=\"\"><div> <span>\"Lightning?!\" Serah gasped upon seeing her now one inch tall sister. \"Is that really you?\"<br>\r\n<br>\r\n\"Yes,\" Lightning replied as Serah picked her up. \"I'm glad I was able to get your attention.\"<br>\r\n<br>\r\n\"So am I. Everyone has been looking for you,\" Serah said. \"How did you get so small?\"<br>\r\n<br>\r\n\"I'm not quite sure myself,\" Lightning answered. \"But I'll try to explain as best as I on the way home.\"<br>\r\n<br>\r\nSerah nodded in agreement and proceeded to carry her tiny sister back to their house. Along the way Lightning told Serah about how she had decided to go for a walk, the strange blinding light that caused her to pass-out, and how when she awoke she only an inch tall.<br>\r\n<br>\r\n\"I'm going to need help if I'm to return to my normal size,\" She said as they entered their house.<br>\r\n<br>\r\n\"I'm sure there's someone who can figure out what to do,\" Serah said.<br>\r\n<br>\r\n\"I'm sure of it,\" Lightning agreed.<br>\r\n<br>\r\n\"Then you wait here while I go find someone who can help,\" Serah said.<br>\r\n<br>\r\n\"Serah,\" Lightning began to protest.<br>\r\n<br>\r\n\"Don't worry 'little' sis,\" Serah teased as she lowered Lightning to the floor. \"Everything is going to be fine.\"<br>\r\n<br>\r\nWith that Serah quickly exited the house to find someone who could help. Lightning sighed in exasperation. She was going to tell Serah that she should come along in the likely event that no one believed the story. No use dwelling on it, Lightning thought. Looking around at her surroundings she eventually decided to see what exploring the house at her new perspective. So Lightning wandered into the hallway and began walking through it as she figured out where to start.</span></div></div>",
            "created":1377752400,
            "id":1653959,
            "title":"Home"
        },
        "1111322111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Noticed",
                "Hadn't Noticed"
            ],
            "content":"<div class=\"\"><div> <span>As Lightning wandered the hallway she heard a sound coming from behind her.  She quickly turned around to see Serah's pet cat, Snow, enter the hallway. She tensed up at the sight. Lightning had never really been fond of that cat, and the feeling was mutual. She soon relaxed a little though when she realized that Snow hadn't noticed her. That's good so far, she thought to herself. Lightning knew she was probably about size of a tasty treat with no way to defend herself. If Snow had noticed her and was hungry, then she might likely be in. . . well she didn't want to think about that. So slowly Lightning began to back away, trying as best she could to not get noticed. Unfortunately as she was backing away she tripped over a discarded pencil that was just lying in the hallway. She would have to talk to Serah about that later, but at that moment Lightning had other things to worry about. She looked to see if the cat had noticed the noise she made when she tripped. Snow. . .</span></div></div>",
            "created":1377752400,
            "id":1653966,
            "title":"Caution: Cat About"
        },
        "11113221111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Nope, she's cat food",
                "Yes, she's safe"
            ],
            "content":"<div class=\"\"><div> <span>Lightning looked up to the terrible sight of Snow looking hungrily at her and licking its lips.<br>\r\n<br>\r\n\"Crap,\" was all she said as she realized at that very instant that the cat had noticed her and that she was now on its menu.<br>\r\n<br>\r\nLightning quickly scrambled back up onto her feet and started running in the opposite direction. Snow purred in anticipation and took off after her. As they ran down the hallway Lightning knew that she had to do something soon or else she'd become cat food. She was like a mouse that was smaller and slower than the rest, and the cat would eventually catch her. Then she saw what was probably the only way to save herself. The door to Serah's bedroom was closed, so if she could make it under there she would be safe.<br>\r\n<br>\r\nLightning started to head towards her sister's room. Snow was not far behind though. As the cat got closer and closer Lightning quickened her pace as much as she could. Soon she was just a few feet from the door. Does she make it?</span></div></div>",
            "created":1377829560,
            "id":1653971,
            "title":"Cat and Mouse"
        },
        "111132211111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>Snow was much faster than Lightning realized, and before she knew it the cat was right in front of her, forcing her to come to a complete stop. Snow lowered its head and sniffed her a bit. The cat hissed a bit as it recognized her scent. Now she was a really special treat. <br>\r\n<br>\r\nThen before Lightning could try to run away again, Snow opened its mouth and lowered it over her upper half. The cat closed its mouth on her waist, all the while making sure not to hurt her, and lifted her into the air. Then Snow started to run off as Lightning's legs kicked the air as she struggled to get free. The journey was not a pleasant one for Lightning as inside the mouth the cat's rough tongue constantly licked her upper half, and it was only made worse by the fact that Snow was purring. Either the cat enjoyed how she tasted or it was happy to finally be able to eat her. It was probably both though.<br>\r\n<br>\r\nEventually Snow reached their destination. A cat bed that Serah had gotten it. The cat approached the bed and spat Lightning out onto it. Shaking in disgust at being covered in cat saliva, Lightning stood up and was about to make a break for it when Snow started to bat her around with its paws. When the cat stopped batting her around for a moment she stood up once more and tried to run for it only for the cat to grab her cape in its mouth and start dragging her around. Eventually, it released her cape and started batting her around again. Lightning couldn't help but wonder why Snow didn't just eat her and get it over with, and then she remembered that cats always play with their food before eating it. Great, she thought to herself, now not only am I going to be eaten by a cat, but I'm also going to be tortured by it.<br>\r\n<br>\r\nSnow continued to play with Lightning by batting her around and dragging her by her cape for several minutes. Then the cat grabbed her by cape one last time and instead of dragging her around it tossed her up into the air so hard that her cape was ripped off as it got stuck on the the cat's teeth. Then as Lightning began to fall back to earth she looked down to see Snow's mouth wide open ready to catch her. She flailed her limbs wildly as she desperately tried to alter her course, but was useless. With a plop she landed on the cat's tongue as it closed its mouth, thus sealing her in darkness.<br>\r\n<br>\r\nLightning found herself laying face down on the rough tongue inside the cat's dark humid maw. Soon the cat started licking her against the roof of its mouth and rolling her around on its rough tongue, quickly soaking her from head to toe in saliva. The rough tongue hurt as it continued to taste Lightning, and it was made worse by the fact that Snow was purring at her taste again. She prayed that the cat would stop tasting her soon and just swallow her so the torment would end. However, Snow had no intention of doing that anytime soon. The human that it didn't like was just too delicious to eat quickly. So Snow savored her delicious flavor for quite sometime. Eventually, the rough tongue settled down and Lightning sighed a breathe of relief when it started pushing her towards the back of the throat head first. Then the cat tilted its head back and with a loud gulp swallowed her.<br>\r\n<br>\r\nNow Lightning slowly started to travel down the esophagus, becoming covered from head to toe in mucus and even more saliva. She would have tried struggling within the confining tube, but she was too exhausted from being played with and tasted. However, Lightning found that she didn't really mind as she felt like the muscles were soothingly massaging her while they pushed her down to the stomach. It was only made more soothing by the purring, despite the fact that it hurt her ears, vibrating her body. The soothingness of the esophagus, plus her exhaustion, actually caused Lightning to fall asleep halfway down. By the time she landed in the stomach with a splash, Lightning was in such a deep sleep that she didn't wake up even as the digestive juices began going to work on her. Thus she was saved from much pain as she digested alive.<br>\r\n<br>\r\nMeanwhile, Snow laid down on its bed and fell asleep as it digested the most delicious meal it ever had. Later Serah came home alone, because no one believed her story. When she didn't see Lightning anywhere she looking for her. She found the cat lying in its bed and Serah leaned down to pet it. <br>\r\n<br>\r\n\"Hey, Snow you haven't seen Light. . .\" She began to say until she saw the red fabric hanging out of the cat's mouth. <br>\r\n<br>\r\nShe quickly pulled it out, and saw that it was Lightning's cape. With horror Serah realized that her cat had eaten her sister. For the rest of her life Serah would feel guilt over her sister's death. She felt as though she had intentionally fed Lightning to the cat.</span></div></div>",
            "created":1377834540,
            "id":1654023,
            "title":"Farron Brand Cat Food"
        },
        "11113222":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps it was Sazh?</span></div></span></div>",
            "created":1383759480,
            "id":1690399,
            "title":"Sazh"
        },
        "1113":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Lightning Returns Final Fantasy XIII",
                "Dissidia 012",
                "Theatrythm Final Fantasy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1359435600,
            "id":1519483,
            "title":"Other"
        },
        "11131":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Her default outfit",
                "More Options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will be Lightning's outfit from the game?</span></div></span></div>",
            "created":1359435600,
            "id":1519486,
            "title":"Outfit"
        },
        "111312":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Lightning's Dark Muse outfit?</span></div></span></div>",
            "created":1359435600,
            "id":1519487,
            "title":"Dark Muse?"
        },
        "1113122":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Absolutly",
                "What else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about her Shadow's Dust outfit?</span></div></span></div>",
            "created":1359435600,
            "id":1519488,
            "title":"Shadow's Dust"
        },
        "12":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Lulu",
                "Rikku",
                "Donna",
                "Lucil",
                "Elsa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks?</span></div></span></div>",
            "created":1350968400,
            "id":1452555,
            "title":"Final Fantasy X"
        },
        "13":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Tifa",
                "Aerith",
                "Elena",
                "Yuffie",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Final Fantasy girl will shrink?</span></div></span></div>",
            "created":1350968400,
            "id":1452313,
            "title":"Final Fantasy VII"
        },
        "14":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Terra Branford",
                "Celes Chere",
                "Relm Arrowny",
                "Elayne",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which lovely lady from FFVI shrinks?</span></div></span></div>",
            "created":1377878820,
            "id":1654246,
            "title":"Final Fantasy VI"
        },
        "15":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Final Fantasy IX",
                "Final Fantasy IV",
                "Final Fantasy XII",
                "Final Fantasy V",
                "Even more options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these Final Fantasy games?</span></div></span></div>",
            "created":1350536400,
            "id":1449232,
            "title":"More Final Fantasy"
        },
        "155":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Final Fantasy X-2",
                "Final Fantasy XIII-2",
                "more still"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these games?</span></div></span></div>",
            "created":1351054800,
            "id":1452827,
            "title":"Even more options"
        },
        "1551":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yuna",
                "Rikku",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will shrink?</span></div></span></div>",
            "created":1351054800,
            "id":1452830,
            "title":"Final Fantasy X-2"
        },
        "15511":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Final Fantasy X",
                "Final Fantasy X-2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which version of Yuna?</span></div></span></div>",
            "created":1351054800,
            "id":1452833,
            "title":"Yuna"
        },
        "1553":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Type-0",
                "Final Fantasy XV",
                "Still more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1453304880,
            "id":2091782,
            "title":"more still"
        },
        "15531":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Seven the lucky lady to be shrunk?</span></div></span></div>",
            "created":1453305180,
            "id":2091785,
            "title":"Lucky number Seven?"
        },
        "15532":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Let's shrink this princess!",
                "Another option please."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shall we reduce Lunafreya Nox Fleuret in size.</span></div></span></div>",
            "created":1475605800,
            "id":2218929,
            "title":"A Tiny Princess?"
        }
    },
    "info":{
        "author_id":"model7",
        "author_name":"Gojira6",
        "brief_description":"Final Fantasy girls get shrunk to an inch in height.",
        "created":1349461020,
        "description":"<td align=\"left\" class=\"norm\">Girls from the Final Fantasy series shrink to about 1 inch in height. Will they be able to survive at their new size?<br>\r\n<br>\r\nRules:<br>\r\n1. Soft vore is the only the type of vore allowed<br>\r\n2. Characters may not shrink or grow anymore in size<br>\r\n3. No nudity<br>\r\n4. Talking animals, furs, and anthros are not allowed<br>\r\n5. Just about anything goes.<br>\r\n<br>\r\nP.S. This is a fanfiction so the characters will most likely act out of character from time to time.</td>",
        "id":1895774,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1475605800,
        "modified":1475605800,
        "pretty_title":"Final Fantasy Girls Shrink"
    }
}