{
    "chapters":{
        "1":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "at Camp Crystal Lake",
                "in Winnie's tribe",
                "at the school",
                "walking to the school",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>(note you might wanna read Jason at ghoul school first) Jason wakes up rubbing his eyes geeting ready for a new day school is going to strat again and he will get to see his friends again and there is nothing to fear Freddy is permantly dead but he killed your dad as you think of all this where are you</span></div></div>",
            "created":1302152400,
            "id":1084013,
            "title":"a new day"
        },
        "12":{
            "author_id":"john1yaya",
            "author_name":"torro888",
            "choices":[
                "take the trail to school.",
                "get a bite first."
            ],
            "content":"<div class=\"\"><div> <span>Jason wakes up in his new home.<br>\r\n<br>\r\n\"Yawn\" Morning Winnie Whats the plan for today.<br>\r\n<br>\r\n\"don't  you know its time for another school year\"<br>\r\n<br>\r\nJason gets up \"damn already\" thought we had a few more days.</span></div></div>",
            "created":1329062280,
            "id":1275702,
            "title":"in Winnie's tribe"
        },
        "14":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "one of the girls",
                "one of the teachers (shaggy,scooby,scrappy,miss grimwood)"
            ],
            "content":"<div class=\"\"><div> <span>as you think all of this you are walking to the school on the way you stop by an old town walking in a diner to get something to eat as you finish eating you pay the waitress walking out and continue walking to the school as you get there you see someone who</span></div></div>",
            "created":1302238800,
            "id":1084572,
            "title":"walking to the school"
        },
        "141":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Winnie",
                "a different girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one of the girls is it Sibella Phanty Elsa Winnie or Tannis </span></div></span></div>",
            "created":1302238800,
            "id":1084576,
            "title":"one of the girls"
        },
        "1411":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Sibella or Phanty",
                "Elsa or Tannis"
            ],
            "content":"<div class=\"\"><div> <span>you notice Winnie playing with a vollyball as you sneak behind her grabbing her as she lets out a small suprised scream as you shift the grab to a hug as she turns around happy to see you \"ha Winnie you screamed like a little girl\" you say making fun of her \"thats because i am a girl\" she responds throwing the vollyball at you bouncing off your head\"hey jason you notice anything a little different about me?\" she asked \"no you responed well 1 my tail is starting to grow she said liftting of the back end of her dress exposing a short tail,2 i have breasts Winnie said grabing your hand putting it on her chest and 3 my Wolf teeth have been growing she said opening her mouth exposing her teeth which are more sharp and pointy then the last time you meant \"wow impressive the Teeth make me a little nervous about kissing you\" you joking with her \"i got a new mask\" you tell her as she see's your mask is not solid white but has blue lines (the mask from friday the 13th pt5) as you two lokk at eachother about to kiss \"hey jason\" the two her a voice say as you turn to see another one of the girls</span></div></div>",
            "created":1302238800,
            "id":1084583,
            "title":"Winnie"
        },
        "14111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Sibella",
                "Phanty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it Sibella the Vampire or Phanty the Phantom</span></div></span></div>",
            "created":1302238800,
            "id":1084585,
            "title":"Sibella or Phanty"
        },
        "141111":{
            "author_id":"john1yaya",
            "author_name":"torro888",
            "choices":[
                "walk to school together",
                "wait for the rest of the girls"
            ],
            "content":"<div class=\"\"><div> <span>Sibella was walking to the school and when she turned around the corner she bumped into Jason and Winnie.<br>\r\n<br>\r\nJason its Fangtastic to see you again how was your summer.<br>\r\n<br>\r\nJason replied with  \"I met the love of my life, I have a new tribal mask to go with my normal one.<br>\r\n<br>\r\nand its supposed to have special power. and i couldn't be more happy considering the circumstances from last year.<br>\r\n<br>\r\n</span></div></div>",
            "created":1329062700,
            "id":1275704,
            "title":"Sibella"
        },
        "141112":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Shaggy, Scooby, and Scrappy",
                "The Other Ghoul Girls"
            ],
            "content":"<div class=\"\"><div> <span>   Phantasma sneaks up behind Jason and quickly phases her head through his chest and waves at him. <br>\r\n<br>\r\n\"Hiya Jason\"! She exclaims. \"BWAAH\"! Jason yells in surprise falling flat on his butt. \"Well your as <br>\r\n<br>\r\njumpy as ever\" said Phanty joining Winnie, giggling at her little prank.\"Hey Phanty\" says Jason, <br>\r\n<br>\r\nembarrassed that she actually caught him off guard. \"Good one Phanty\" said Winnie. \"How was your <br>\r\n<br>\r\ntime away from school\"? \"Great\" Phanty replied. I went over to the states with daddy and enjoyed a <br>\r\n<br>\r\nlittle haunting spree across the Gulf Coast. It was great\". \"Awesome. My dad and I went to Mexico and <br>\r\n<br>\r\nstayed with the Chewbacabra family. What did you do Jason\"? Asked Winnie. Jason let out a heavy <br>\r\n<br>\r\nsigh. \"The same boring things I always do every summer, wait by the lake for unsuspecting victims and <br>\r\n<br>\r\nmake creepy echoing sounds threaten to hack them with a machete blah blah blah” Jason said in a very <br>\r\ndull and monotone voice. \"Sorry to <br>\r\nhear that\" said Phanty. \"Yeah, but it's fine now\" said Winnie. \"Cuz you get to spend another school year <br>\r\n<br>\r\nwith your super awesome girlfriend\" she said hugging Jason. The three continued their trek to <br>\r\n<br>\r\nGrimwood. After a short while they made and were met by........</span></div></div>",
            "created":1323147600,
            "id":1235976,
            "title":"The Reunion Continues"
        },
        "14112":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Elsa",
                "Tannis"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it the oldest girl Elsa or the youngest Tannis</span></div></span></div>",
            "created":1302238800,
            "id":1084586,
            "title":"Elsa or Tannis"
        },
        "141122":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "miss Grimwood and Col. Calloway ",
                "Shaggy, Scooby and Scrappy"
            ],
            "content":"<div class=\"\"><div> <span>you turn to see Tanis waving at you with her dad \"hey Tanis how you doing?\" you ask her \"i'm doing great and you?\" she asked \"i'm fine still getting over my dad's death but i'm doing fine\" you reply \"yeah i'm sorry about that but thanks for helping us last year you gave your life to save us\" winnie said taking your suitcase rolling it in the house \"well Freddys dead we have nothing to worry about anymore\" you say as you head inside as Tanis hugs her dad and heads inside \"so Jason how have you been taking your dad's death?\" Winnie asked \"well all my life my dad wanted me to grow up to be him just like an exact copy he died and peolpe have returned to the lake i try my best to scare them off without hurting anyone i might trash there cars cut off the electricity in the cabins that work but i don't kill them\" you say as the 3 of you walk inside to see</span></div></div>",
            "created":1308718800,
            "id":1132456,
            "title":"Tannis"
        },
        "1411221":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Regular human food",
                "Something gross"
            ],
            "content":"<div class=\"\"><div> <span>the three of you look to see miss Grimwood talking to a man dressed in an official looking outfit \"Who is that guy?\" you ask facing Winnie \"That is Col. Calloway our school's rival he and his Cadets always beat us at vollyball every year\" Winnie said as Tanis turned to her \"Not true we beat them 2 years ago remember\" Tanis said as you turned to her \"How come there was no game last year?\" you ask as Winnie replied \"There was Jason it was before you entered the school we lost\" Winnie answered as Miss G was escorting out Col.C \"We were just discussing the anual match it's in 1 week\" Miss G said as the 3 of you went to the dinning room for lunch what kind of food was on your plate</span></div></div>",
            "created":1309842000,
            "id":1141233,
            "title":"School Rival"
        },
        "14112212":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "back at school",
                "at the castle"
            ],
            "content":"<div class=\"\"><div> <span>you look down at your plate \"oh my god what is that?\" you ask as Winnie turned to you \"spider pie\" she replied as you slid the plate away \"I forgot to pack my own lunches\" you think to yourself as Shaggy turns to you \"Hey Jason you can have some of our food\" Shaggy said giving you a juicy red apple and a can of coke \"Jason how can you eat that it's fresh?\" Winnie asked \"Look Winnie i understand monsters like Rotton and gross food but i'm a human therefore i like fresh food\" you say removing your mask eating the apple *****(at the remains of Revolta's castle) the wind blew sand off an object revaled to be a bladed glove as an arm popped out out of the ground as a man crawled out putting on the glove \"Those kids have not heard the last of me\" he said as he heard an Ahem he turned around seeing Revolta \"Well Krueger you're finally awake did you have a nice sleep?\" she asked in sarcasm \"for your info i was in hell making a deal the Devil gets the souls of people i kill and he made me more powerful to crossover between reality and dreams at will, use my powers in the real world oh and yeah i'm eternal now i can never die\" Freddy said \"very well but i got some help for you as three men entered one wearing a muddy apron and a human skin mask carrying a bloddy chainsaw another dressed in blue wearing a white mask the third wearing a black cloak with a white mask \"meet Leatherface, Michael Myers and Ghostface i spawned these demons to take on the form of old Halloween costumes they are your soldiers\" she said they bowed their heads at Freddy \"Exellent\" Freddy Replied. the next chapter takes place  </span></div></div>",
            "created":1309842000,
            "id":1141262,
            "title":"Freddy's Return"
        },
        "141122122":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "at the school"
            ],
            "content":"<div class=\"\"><div> <span>next thing Michael and Ghostface grabbed Freddy holding him \"Hey what is this!\" he yelled as Revolta and Leatherface walked up to him as Leatherface cut off Freddy's right gloved hand with his chainsaw \"If your going aginst the kids again your gonna need this\" see said pulling out a robotic hand with Knived fingers (imagine it like the prototype glove from wes cravens new nightmare) as she placed and attached it on Freddys arm as he showed off the blades manically \"that robotic hand is unbreakable and razorsharp much more deadly than some glove made in a boiler room and you can control it mentally even if it's not on your wrist\" she said as Freddy picked up a dark black trenchcoat putting it on over his Signature Red and Green Sweater as Revolta gave him a new Black Fedora which he put on considering his old on got destoryed and the new looking in the mirror (he looks like Freddy from the New nightmare with the prototype glove \"I like it Ghostface ,Michael ,Leatherface we will strike soon he said pulling Jason voorhees's old hockey mask out of the ground slicing it with his new diamondsharp claw crushing the remains</span></div></div>",
            "created":1310014800,
            "id":1142784,
            "title":"The New Freddy"
        },
        "1411221221":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Jason's POV",
                "Winnie's POV"
            ],
            "content":"<div class=\"\"><div> <span>back at the school you were talking with the girls when 3 new girls entered the room that you didn't see before \"Hey Miss Grimwood who are the new students?\" you asked looking at the three girls \"well girls introduce yourselves\" Miss Grimwood said as they walked up \"i'm Goonie Daughter of the creature of the black lagoon\" one looking like she was made out of brown seaweed \"I'm Godzina\" the greyish reptile said as everyone could figure out her father as the third one spoke in a whole different mechanical langauge \"this is Mary the Martian she dosn't speak in english\" Tanis said translating for her. \"Tanis and Mary have become really good Friends \"Hi i'm Jason Voorhees Jr.\" you said as Goonie turned to you \"You're Jason Voorhees as in the Camp Crystal Lake Killer?\" she asked as you shook your head \"No he was my dad\" you tell her \"i can't wait to meet him\" she replied \"well you can't he was killed\" you tell her \"what who could have killed him?\" she asked \"Fre...\" you said as Winnie cut you off \"Jason don't tell them if they don't know they can't dream him up and he can't hurt us\" Winnie said \"Winnie Freddy Krueger is dead I killed him last year remeber ******(Flashback) \"Every stop Fearing Freddy\" you say as you the girls and the Fathers lost fear in Freddy as you satb his with your dad's Machete \"Shit!!\" he yelled as he faded into dust leaing his clothes and his glove as you kicked it as far as you could********(Flashback ends).\"Well from What i Heard Pure Evil Can never die\" Goonie said as you turned back to her \"Trust me he's Dead i saw it witrh my own Eyes\" you said as all You go to your rooms to sleep (the next chapter is told in)</span></div></div>",
            "created":1310187600,
            "id":1143665,
            "title":"New Students"
        },
        "14112212211":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You walk down the hall seeing Miss Grimwood carrying some laundry<br>\r\n\"Hey Miss G, you need some help?\"<br>\r\nyou ask her as she looks at you smiling<br>\r\n\"That would be very nice of you Jason\"<br>\r\nshe said handing you the basket<br>\r\n\"Hey Miss Grimwood there are only 8 student rooms and 9 students so how's the room selection room?\"<br>\r\nyou ask out of curiousity <br>\r\n\"Well, I'd have to say two of the students would have to share a room\"<br>\r\nMiss Grimwood said<br>\r\n\"Ok, i just wanted to know\"<br>\r\nyou say carrying the basket you stop at the first two doors which were Goonie's and Tanis's as the walked out<br>\r\n\"Hey i brought you your laundry\"<br>\r\nyou say handing Gonnie a brown dress made of seaweed and Tanis a roll of bandages<br>\r\n\"Thanks Jason\"<br>\r\nTanis said as you waved going upstairs Handing Sibella, Phanty,Elsa, Mary and Godzina their clothes as you smiled realizing you were almost done climbing to the top floor which was Winnie's room<br>\r\n\"Why does Winnie's room have to be on the top floor\"<br>\r\nyou think to yourself knocking on the door as Winnie opened it wearing a short light blue nightgown witha small dark blue neck-bow and torn lacing similar to her dress<br>\r\n\"Here's your laundry\"<br>\r\nyou say handing her a dark blue dress a light blue bow and dark blue panties<br>\r\n\"I wonder why she wears the same thing everyday?\"<br>\r\nyou think to yourself as she blushes slowly taking the laundry as you share a romantic moment as you turn down stairs<br>\r\n\"Hey Jason you wanna hang out for a while?\"<br>\r\nWinnie asks fumbling with her curly red hair<br>\r\n\"Sure Winnie, i would love to\"<br>\r\nyou respond<br>\r\n</span></div></div>",
            "created":1323234000,
            "id":1236279,
            "title":"Laundry"
        },
        "14112212212":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "A Dream",
                "A Nightmare"
            ],
            "content":"<div class=\"\"><div> <span>As everyone went in their room me and Jason were alone in the hall.\"Hey Jason\" i called out to him as he responded \"Have a nice night\" i said Kissing him on the Lips \"Man it's been almost a year and i forgot how good a kisser you are Winnie\" he said to me \"Well don't worry my Teeth will not hurt you\" i said going into my room closing the door changing into my Nightgown laying In my bed Thinking about Jason but i also Started thinking about Freddy what if we have not heard the last of him \"Well if we don 't Dream him up he can't Hurt us\" i said to myself  falling asleep.(what kind of dream does Winnie have?)  </span></div></div>",
            "created":1310187600,
            "id":1143671,
            "title":"Bedtime"
        },
        "141122122122":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Alone",
                "Everyone with him"
            ],
            "content":"<div class=\"\"><div> <span>As you fell asleep you dream of you and jason laying outside looking up at the sky \"Jason i really like looking up the sky\" you said turning to see he wasn't there \"Jason?\" you ask for him seeing a shadow of a man as you were going to walk to him you realize something \"wait if Freddy thinks i'm falling for the same nightmare again where i think he is jason he is wrong no matter what happens i'm not leaving this spot\" you say as the man walks up to you reveled to be Jason vines wrap around you as he falls over with Freddy's claw glove popping out of his chest as he lands dead Freddy walks up to you (using his dream powers to like his old self).\"Miss me Bitch?\"he said putting a clawed finger from his glove under your chin \"I liked you better dead\" you said breaking the vines picking up Jason's machete cutting off Freddy's arm \"Owww Not my arm\" Freddy said vanishing as you ran out off the woods you realized a door walking threw it you were in Freedy's boiler room as you turned to leave there was no door as you hear a laugh you turn to see Freddy wering a black trenchcoat and a black Fedora with his arm still missing as a new arm grew out but insted of his razor glove he had a Robotic hand with 5 claws \"Like the new look?\" he asked you as you took the machete swinging at Freddys wrist knocking the hand off as a mechanical device popped out of the remainder of his wrist as he toyed with the device \"you forgot the power glove\" he said as the Severed hand started crwling on it's fingers jumping up and slashing your dress you wake up sceaming you examine your chest the dress was torn your chest had minor scrathes but wasn't bleeding as Jason entered your room worried was he alone or was everyone with him </span></div></div>",
            "created":1310446800,
            "id":1146570,
            "title":"Miss me Bitch?"
        },
        "1411221221222":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "the next morning",
                "Later that night"
            ],
            "content":"<div class=\"\"><div> <span>(Back in Joson's POV)everyone enetered the room wearing there sleepware \"Winnie are you ok?\" i asked \"yeah we heard screaming and not the good kind\" Tanis said \"It's Freddy he's back\" she said looking at me \"Winnie you know Freddy is Dead I killed him you were there everyone was execept Gonnie Zina and Mary\" you said \"I have Proof\" she said pulling off the sheet revaling the claw marks. Mary examined the marks speaking in her alien language \"I can't believe Mary is a super advanced alien and dosn't know English\" you say as she looks at you clamping a device on her neck responding \"Happy now Human\" she said in an mildly disturbed tone \"why didn't you just do that when i first met you?\" you ask as she cutts you off \"not important what is imporant is what happened to Winnie\" said as Winnie cut her off\" I told you Freddy\" she said as you look at her chest \"wait Freddy has 4 Blades there are 5 marks you probaly clawed yourself in your self don't freak out in your nightmares of trim your nails Winnie \" you say as she still said it was freddy as Miss Grimwood interupted \"It's the middle of the night lets talk about this in the morning she said as everyone left to go to bed as you and Mary were left in the hall \" hey Mary\" you call out to her as she turns to you \"Yes Earthling\" she responded still mad \"i'm sorry about impling you were stupid you do seem very smart\" you said apoligizing and she seem to cheer up \"It's Ok Jason i should have put this at the start no hard feelings as you turned from her she kissed you as you pushed her off \"What the... Mary why did kiss me i have a Girlfreind already?\" you ask her angery at her \"Kiss? i was just giving you the Martian symbol of Friendship what is a kiss?\" she asked in a defensive tone \"oh sorry I didn't know a kiss is something romantic between a boy and a girl \" you said to her \"Ok I didn't know what it meant on earth i still have a lot to learn about earth culture\"  she said as you two went back to your rooms    </span></div></div>",
            "created":1310446800,
            "id":1146576,
            "title":"Freddy's Back?"
        },
        "14112212212222":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Stay Awake",
                "Go back to Sleep"
            ],
            "content":"<div class=\"\"><div> <span>(This chapter is told in Sibella's POV) as i went back to my room i couldn't sleep as i tried sleeping i layed in my coffin for a while as time passed i opened looking at the clock 3:20 AM i thought while i'm up i might as well shower i  thought while getting some clean clothes heading in the bathroom locking the door and taking off my robe and removing my undergarmets stepping in the shower as the warm water beat down on my body a grabbed a bar of soap rubbing it on my body as suddenly the water pressure increased pinning me to the as i reached toward the knob the water started red as i smelt it i realized it was blood. i tried moving the shower door but it wouldn't budge asthe blood filled up the shower almost drowning meas the knob grabbed me turning into a hand made of pipes throwing me throgh the shower door mildly cutting myself on the glass as i looked up i saw i was in a boiler room as a mechanical hand pull me up seeing a man wearing a Trenchcoat and a black hat i couldn't see the face coved by the shadow of the hat \"who are you...\" i said getting cut off as the man lift up his head revaling to be Freddy \"suprise!\" he said rubbing his metal hand on my naked body \"What Freddy You're dead!\" i said as he raised the claw to my chin \"Listen I can't die let see first they tried Burning me\" said holding up his left thumb cutting it off \"Next they tried Burying me\" he said holding up his pointer cutting it off \"But this one is my favorite\" he said holding up his middle finger in front of my face \"they even tried Holy Water\" he said cutting it off as Green blood ran out of his finger stinging me \"But i just keep ticking\" he said flashing his hand with all fingers \"Because thats what they promised me in dreams i am forever too bad you're not\" he said \"Wait who promised you\" I said as he was  walking out the door not aswering as i woke up in my coffin looking at the clock 11:15 PM I deicided to</span></div></div>",
            "created":1310533200,
            "id":1147391,
            "title":"Morning Shower"
        },
        "141122122122221":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Stayed out",
                "Entered the Room"
            ],
            "content":"<div class=\"\"><div> <span>Thinking about falling asleep again i decided to stay awake. as i waited for morning as it came i changed from my nightgown to my day-clothes getting in the shower room with the rest of the girls \"Hey Winnie you said you had a dream of Freddy last night\" i said to her as he was rubbing Shampoo on her fur \"Yeah why?\" she asked \"what did he look like any different\" I asked picking up a bar of soap rubbing it own my chest \"well now that you mention he was wearing a Black coat he looked more cut up and slightly zombie-like\" Winnie responded \"hey i had a dream of a man like that too and he had a metal hand\" Gonnie said washing soap suds off her body \"Oh he had a metal hand but it wasn't a glove it was like some high tech robot claw that he controlled mentaly when i knocked it off his hand\" Winnie said \"I had a Dream of him Too\" Tanis said brushing her teeth \"well it can't be coincidince Freddy must be back\" I said hearing a knock on the door \"how long are you 8 girls gonna be in there?\"Jason asked from the other side. \"Jason you know you're allowed in open shower\" Winnie said putting her head under one of the shower heads cleaning out the suds \"I don't want to make any of you girls fell like i'm a pervert or anything\" he said \"Jasoln it's it's open shower we know your not a pervert\" i said as thinking Jason </span></div></div>",
            "created":1311397200,
            "id":1153174,
            "title":"Shower Discussion"
        },
        "1411221221222212":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "the school",
                "Revolta's castle"
            ],
            "content":"<div class=\"\"><div> <span>entered the room wearing towel caryying his clothes and a Hockey mask \"Fine i will shower with you girls but if any of you look at my crotch i will hurt you\" he said hanging his mask on the hook. in Miss Grimwood's office she as doing paper work when she heard a phone call \"Hello\" she responded hearing a deep voice \"I'm gonna cut you up\" he said in a deep tone \"What?\" she asked \"I'm gonna chop you like liver and...\" he said as Miss Grimwood hung up it rang agian she didn't answer it \"Hello you reached Miss Grimwood's finishing school for ghouls leave a message after the beep\" a recorede message said \"I know your there i do this for a living pick up the phone\" the voice said as it rang again \"listen stop calling me or the call the cops on you sicko\" she yelled as a voice responded \"Miss Grimwood it's me Col.Calloway how dare you call me an insult\" he said as she responded \"Sorry Col.\" she said hanging up felling a finger tapping on her shoulder she turned around seeing a cloaked man  \"who are you how did you get in here?\" she asked \"You can call me Ghostface\" he said pulling out a knife running towards Miss G as she ran out into the hallway with ghost face chasing her as she ran into the den seeing the students relaxing as she looked Ghostface was gone \"Kids there is a killer in here\" she responded \"what who was it?\" Tanis asked \"He wore a black cloak and a white Ghost-like mask\" she said as Jason started looking up something on  his laptop \"Is this the guy?\" I asked showing the page \"yes exactly\" she said as i read \"Ghostface alias the Woodsboro Killer,Deathface,Phantom Death,G-Face and The Scream\" A Killer who wears a Novelty co. \"Phantom Death\" Halloween Costume he is well known to call people using the \"The Phantom Dailer\" an Untrackable Cell Phone stolen from the U.S.Police to Trivia people on Horror movies before Killing them\" he speaks with a voice distorter\"I read as a Phone Rang behind me i answered it \"Hello who is this?\" I asked \"look Behind you\" the voice said as Everyone Turned Seeing Ghostface \"Get lost before we hurt you\" Winnie said extending her claw out \"What makes you think you could hurt me\" he said pulling out a knife \"for one your a just a costume wearing punk who give monsters a bad name\" she said swinging her claw though Ghostface \"That tickled\" he said \"He's not real\" Sibella said as he pulled out his knife \"Is this real\" he said rubbing the Knife acoss her arm leaving a cut \"Lets see who's behing the mask\" I said jumping as i went through him as he pulled his knife at me his phone rang \"Hello?\" he asked as Phanty Grabbed him Pulling of his rubber mask revealing a pale white messed up face like he was undead as he twisted aroung Throwing her Through a wall \"What how can he pick up Phanty\" Tanis asked as Ghostface answered the phone \"Ghostface get to the castle\" a voice responded \"Sure Krueger cool your jets\" he said Hanging up \"as he grabbed me and held me up putting his mask back on \"To be continued Voorhees\" he said jumping through the floor. the next chapter takes place in     </span></div></div>",
            "created":1311483600,
            "id":1153874,
            "title":"A Real Ghostface"
        },
        "14112212212222121":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Went the to Showers",
                "Kissed You"
            ],
            "content":"<div class=\"\"><div> <span>After Ghostface left the school i headed around seeing Winnie in the gym \"Hey Winnie what are you up too?\" you asked seeing her hit a punching bag \"Building up my defense if Ghost-freak wants a piece of me bring it on\" she said whacking the bag \"Winnie from what i know about killer considering i'm the son of one they go after your mind\" you said handing her a bottle of water \"how would they find that out?\" she asked taking a drink \"Killers are best at finding out what scares you the most Freddy found out my dad's one fear\" you said uncapping another bottle drinking with her \"you promise you will protect me\" she said \"Winnie your my best friend you can count on it\" you said finishing your bottle throwing it in the trash yelling 2 points \"Did i ever tell you when i have a mate i'm glad it's gonna be you i'll never let anything happen to you\" she said screwing the cap on her bottle \"Winnie did I ever tell you that you look sexy when you're sweating\" you said complementing her \"Thanks Jason\" she said as we sat there sharing a romantic moment as she   </span></div></div>",
            "created":1311570000,
            "id":1154247,
            "title":"the Gym"
        },
        "14112212212222122":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Back at the school",
                "At the battle site"
            ],
            "content":"<div class=\"\"><div> <span>as Ghostface left the school he teleported back to revolta's Castle \"What is it Krueger i almost had them\" he said as Freddy replied \" I gave you no premission to enter the school your mission was to call and frighten them now we have to move ahead of planned time\" he said slashing his claw through Ghost face shocking him \"sorry master\" he said as Freddy stopped \" so Revolta what do we do?\" Freddy asked \"Well Parent's night should be tonight and then we will strike here's the plan <br>\r\n1 Ghostface will hide in the school invisible until comanded to attack <br>\r\n2. Micheal will infaltrate the school unseen when we give the signal he will strike <br>\r\n3.Freddy you will you your Dream powers to Pretend to be Voorhees's dad pretend you survived <br>\r\n4. Leatherface you Enter the school like the chainsaw weilding manic you truly are that is when you all strike not a moment before espically you Freddy you must make Jason believe you are his dad i know you hold a gurdge\" Revolta ordered \"I promise but what if the real Voorhees shows up?\" Freddy asks <br>\r\n\"make sure he makes no contact with jason\" Revolta ordered \"so we bring the girls but what about the fathers\" Ghostface asked \"they are of no use to me but also bring Jason\" Revolta replied \"What are we gonna do with them\"Ghost face asked \"we will clone them to obey us\" Revolta replied \"and the originals?\" Freddy asked \"Dispose of them\" she replied</span></div></div>",
            "created":1311570000,
            "id":1154267,
            "title":"Secret plans"
        },
        "141122122122221222":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Jason Voorhees Sr ",
                "Leatherface"
            ],
            "content":"<div class=\"\"><div> <span>back at the old castle a man starts pulling himself out of the ground revealing to be Jason Voorhees \"How long have i been out?\" he thought to himself walking aroung seeing the Hockey mask slashed up he put a burlap sack over his head knotting it cutting in an eyehole for his good eye \"I have to let jason know i'm ok\" he thought pulling his Machete out of the pit ***** Back at the school you and the Girls were talking \"How could we not beat Ghostface he is just a human in a costume?\" Tanis asked \"I dont know when i grabbed him i didn't even touch him\" you said \"He must be a real ghost that would explian how he could pick up and throw Phanty\" Winnie said \"He was talking to Freddy on the phone Freddy must have summoned him and he must be working with him\" you said \"If he summoned Ghostface who knows who else he summoned\" Sibella said as the door blew off it's hinges who was on the other side   </span></div></div>",
            "created":1312261200,
            "id":1159760,
            "title":"Return of Jason"
        },
        "1411221221222212221":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "She kissed you",
                "Someone entered the room"
            ],
            "content":"<div class=\"\"><div> <span>as a man wearing a burlap sack over his head entered Jason looked at the man \"What the...dad you're still alive\" you said seeing your dad \"Hey you're dad is alive that's great he can help us fight of Freddy again\" Winnie said as your dad handed you a file as you opened it looking at it closing it after reading it \"These are Revolta's plan for tonight\" you said letting the girls read the file \"well now we will have the advantage\" you said handing him the file as miss Grimwood entered the room shocked seeing your dad \"Mr.Voorhees\" she responded dropping some papers \"like i said before you knock down a voorhees but they always get back up\" you said as he left the room with Miss Grimwood carrying the file as you sat down on the sofa as Winnie jumped on landing right next to you \"Wow you're dad is still alive you know i wondered how did you survive last year when Freddy killed you\" she asked curiously \"weel i did die but the Grim Reaper brought me back to life he said i had god on my said i think it was because i gave my life to save you\" you said as she put her arm around you sharing a romantic moment as  </span></div></div>",
            "created":1312606800,
            "id":1162587,
            "title":"File"
        },
        "14112212212222122211":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Tell ",
                "Don't tell"
            ],
            "content":"<div class=\"\"><div> <span>next thing you know your faces were pressing as she kissed you inserting her tounge in your mouth enjoying the kiss. After the two of you kissed Winnie left the romm walking down the hall (the rest of the chapter is told in Winnie's POV) you walked down the hall to your bed room brushing your hair in front of the mirror in your room (werewolves care about apperance too) as you hear the phone ring you answer it. \"hello\" you respond picking up the phone hearing your father on the other end \"Hey sweetie just wanted to tell you i might not make it tonight,something came up\" he said as you continued brushing your hair \"It's OK dad i understand\" you say putting down the brush. \"I hope you and your boyfriend have a nice time and good luck against Freddy it should be easy with his plans\" he said as you blanked for a sec \"dad how did you know Freddy was back and we have his plans!?\" you asked ina shocked tone as the voice on the other side shifted to the voice of Ghostface. \"I know you do\" he said in his normal voice \" What do you want?\" you replied shocked \"I want to see what your insides look like\" he said letting a sinister laugh \"what!\" you yelled \" do you know what it feels like to have a silver blade dig in your flesh and scrape the bone underneath\" he responded .\"if you keep this up Jason and his father will kick the shit out of you!!\"you yell into the phone \"No you don't if you do such much as tell anyone i will gut your boyfriend right infront of you...and i'll save you a front row seat\" he said hanging up.<br>\r\n<br>\r\nshould she tell anyone they need to know about Ghostface's threats but if he finds out he will kill Jason while she watches  </span></div></div>",
            "created":1316322000,
            "id":1189883,
            "title":"Phone call"
        },
        "141122122122221222111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Everyone",
                "Just Jason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Should she everyone or just Jason</span></div></span></div>",
            "created":1316322000,
            "id":1189886,
            "title":"decision"
        },
        "1411221221222212221112":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Ass",
                "Pussy"
            ],
            "content":"<div class=\"\"><div> <span>You know Ghostface could hurt you but you know you should tell Jason after all he is your boyfriend and this does affect him as Winnie told him about Ghostface (rest of chapter in Jason's POV) Winnie was telling you about all Ghostface calling her as the put your hand on her shoulder \"winnie I'll be fine\" you tell her as she calms down as you can tell she was worried as her worry turned to joy as she remembered something \"hey Jason remember that promise you made to me last year\" Winnie said as you look at her \"What promise?\" you ask as she rubs her legs sitting down on her bed next to you \"you know she said in a flirty tone as Jason remembered \"Winnie are you sure about that\" you asked as she nodded as she got up and locked the door as she crawled back on the bed unzipping your jeans as you loosen your mask as she puts her furry hand over it \" i would like you to keep the mask on\" Winnie said in a suductive tone as you slid her Panties off her licking her leg as she giggled softly speading her legs bending over in a \"Doggy-style\"(no pun intended) as you walk up to her which hole do you stick it in? </span></div></div>",
            "created":1318741200,
            "id":1207868,
            "title":"Promise"
        },
        "141122122122221222112":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine\"<br>\r\nyou say hanging up, you know you should tell but Jason was your best friend and you didn't want anything happening to him as Winnie ran back to the main room<br>\r\n(Rest of Chapter in Jason's POV)<br>\r\nWinnie came running to the main room jumping on the sofa<br>\r\n\"Hey, Winnie\"<br>\r\nyou call out as she blushes turning away as you look at her<br>\r\n\"Winnie whats the matter?\"<br>\r\nyou ask her as she looks at you <br>\r\n\"Nothing, nothing's the matter\"<br>\r\nShe responded defensively<br>\r\n\"Winnie is there something you're not telling me?\"<br>\r\nyou asked her<br>\r\n\"no\"<br>\r\nshe quickly responded<br>\r\n\"Winnie, you're my friend if anything is bothering you i wanna help\"<br>\r\nyou said as she looked away <br>\r\n\"Winnie don't make me use my Enhanced Werewolf Interrogation Technique\"<br>\r\n you said as you slid your hand on her chest pinching her as she laid down<br>\r\n\"Please, Jason stop\"<br>\r\nWinnie said grunting<br>\r\n\"Then tell me what i want to know\"<br>\r\nyou said twisting her nipple as she grunted<br>\r\ndoes she tell you yes or no?  </span></div></div>",
            "created":1322197200,
            "id":1229118,
            "title":"Enhanced Werewolf Interrogation Technique"
        },
        "1411221221222212221121":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You continue piching her nipple as she grunts harder<br>\r\n\"Jason, please stop i'm begging you\"<br>\r\nWinnie said laughing uncontrolably<br>\r\n\"I'll stop when you tell me\"<br>\r\nyou say twisting her nipple with your fingertips getting rock-hard as she grunted in a mixture of pain and pleasure, more on the pain side<br>\r\n\"Fine, I'll tell you!,Ipromise just stop!\"<br>\r\nWinnie said as you release your grip<br>\r\n\"now what were you keeping secret?\"<br>\r\nyou ask as Winnie re-adjusts her neck-bow which you removed when pinching her as she starts crying<br>\r\n\"Oh,Winnie i'm sorry i hurt you but i wanted to know\"<br>\r\nyou say looking down hating yourself for hurting your own girlfriend as you painfully yank on your hair as she gently grabs your hands<br>\r\n\"Jason i'm not mad,i could never stay mad at you\"<br>\r\nWinnie responded as wrapped her warm furry arms around you as she proceeded to hug you <br>\r\n\"Ghostface,he called me said if i told anyone he would kill you that's what i was crying about, I love and i don't want anything happening to you\"<br>\r\nWinnie said as she stopped crying<br>\r\n\"well if thats all i woln't tell anyone if you don't want\"<br>\r\nyou respond<br>\r\n\"Maybe we should\"<br>\r\nWinnie said<br>\r\nDo you and winnie tell everyone</span></div></div>",
            "created":1323147600,
            "id":1235846,
            "title":"Sorrow"
        },
        "14112212212222122211212":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Let the Training Commence",
                "Switch to Freddy"
            ],
            "content":"<div class=\"\"><div> <span>(This portion will be told from Jason's POV)<br>\r\n<br>\r\nYou both decide to keep to yourselves for now. It seems like everyone else has enough to worry about <br>\r\n<br>\r\nat the moment. You yourself then come to a realization. Winnie can see the stern look on your face. <br>\r\n<br>\r\n“What's the matter Jason”? She asked. “”Nothing. It's just, with all that's going on I can't help but feel <br>\r\n<br>\r\nthat I'm ill equipped to handle what's to come” you reply. You get up making your way to Ms. <br>\r\n<br>\r\nGrimwoods office. “Where are you going”? She asks again. You turn back to her. “To see my dad”. You <br>\r\n<br>\r\ngo to open the office door but it flings open and your dad is standing in the doorway. You look up at <br>\r\n<br>\r\nhim. “Dad let's walk”. He nods in agreement and you both walk out side. You both begin walking <br>\r\n<br>\r\naround the grounds. “Dad, I can't even begin to tell you how happy I am that your alive” you say as you <br>\r\n<br>\r\nembrace him in a hug. He returns the hug and pats you on the head in reassurance. “Yes, but putting all <br>\r\n<br>\r\nthat aside, we need to think about what comes next”. You dad nods in agreement. “You know better <br>\r\n<br>\r\nthan anyone what Freddy is capable of, and I'm not prepared for what's to come”. He continues to nod <br>\r\n<br>\r\nin agreement. “I need your help dad. Train me, give me the strength to take these jokers down for the <br>\r\n<br>\r\ncount. Your dad puts a hand on your shoulder and nods. Your dad reaches into his coat and pulls out his <br>\r\n<br>\r\nmachete and hands it to you. “Y-your machete”? You ask. He nods again in approval. He motions for <br>\r\n<br>\r\nyou to follow him. You both begin walking towards the woods when Winnie comes running out. “Now <br>\r\n<br>\r\nwhere are you going”? She asks in concern. You walk over to her, putting your hands on her shoulders. <br>\r\n<br>\r\n“Winnie, my dad and I need to train and prepare ourselves for what comes next. I don't know exactly <br>\r\n<br>\r\nwhere were going or how long I'll be, but know this.” you say lifting her chin so that she may meet <br>\r\n<br>\r\nyour gaze. “Everything I'm doing is for you”. You both then kiss passionately. “I'll be waiting” she says. <br>\r\n<br>\r\n“Stay safe” you reply. Then you and your father resume your trek into the wilderness.</span></div></div>",
            "created":1323406800,
            "id":1237012,
            "title":"Father and Son"
        },
        "141122122122221222112121":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "back in the woods",
                "Switch to Freddy's POV"
            ],
            "content":"<div class=\"\"><div> <span>You leave the school with your dad as the two of you walk out thru he woods.As you notice a small town you tell your father you're gonna get a bite to eat you ask him if he wants you to bring him back anything as he shakes his head you realize probly being dead for decades he dosn't need food as you walk to the town you go into a diner and order a burger as you finish it and exit you walk by a small pawn shop inside as you walk around you notice a Detriot Wingers hockey mask similar to your dad's old one as you walk up the the counter<br>\r\n\"How much for the Winger mask?\"<br>\r\nyou ask pulling out a wallet<br>\r\n\"Considering it's an official mask made in 93 i'd say $150\"<br>\r\nhe responded as you only had 100 as you pulled out your knife<br>\r\n\"How much would this be worth?\"<br>\r\nyou ask showing him the knife<br>\r\n\"I'd say that and 100 wold be a fair trade\"<br>\r\nhe said opening the glass case handing you the mask<br>\r\n\"Thanks man,my father will love it\"<br>\r\nyou say<br>\r\n\"Your fathers a Wingers fan?\"<br>\r\nhe asked<br>\r\n\"Nope, but he likes hockey masks\"<br>\r\nyou say leaving  </span></div></div>",
            "created":1323406800,
            "id":1237069,
            "title":"A New Mask"
        },
        "1411221221222212221121211":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Continue with training",
                "Skip to returning to school"
            ],
            "content":"<div class=\"\"><div> <span>You return to the woods at your cabin where you see your dad hacking logs with his machete as you walk up to the camp he raises his blade to an attack pose and turns around lowering it seeing it's you<br>\r\n\"I see you still have your keen ears\"<br>\r\nYou say as he looks blankly but you could tell he got the joke<br>\r\n\"Here i was in town and i saw this, I thought i'd buy it for you\"<br>\r\nyou say handing him the mask as he inspected it giving you a short hug as he turned his face away from you removing the burlap sack placing the shiny white over his face turning aroung as you held your thumb up<br>\r\n\"Lookin' good dad\"<br>\r\nYou say as he hands you an axe as you drop it<br>\r\n\"Boy this thing is heavy\"<br>\r\nyou grunt picking it up with both hands as he point to small tree swinging his hands in an axe motion, you knew he wanted you to whack it as you pulled your mask with the blue triangles over your face swinging the blade as it got jammed in the trunk you straining to pull it out as you dad walks up yanking it out with one hand in less than a second taking a deep beath through the mouth-holes of his mask<br>\r\n\"I know dad, it's gonna be a long day you say as he pulls out his machete stabbing the tree the blade popping out of the other side   </span></div></div>",
            "created":1323666000,
            "id":1238811,
            "title":"Training"
        },
        "14112212212222122211212112":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The week was rough but after training you and your dad decided to return to Grimwood's you were more muscular than before although it rarely showed as you stopped in the woods your dad pulled out a machete less damaged and dented and slightly smaller and lighter handing it to you <br>\r\n\"Thanks dad, I promise i'll try not to let you down\"<br>\r\nyou say him noding as you jam the blade thru a pocket in your jacket making a holder as your dad placed his back in his poket holder as the two of you continue walking to the school as you walk you notice a toolshed in the forest as your dad turns the handle it didnt open as he jammed his fist through the door breaking a hole ripping it off the hinges as the two of you went inside looking for anything you could use as or make a weapon as you ransacked the place putting everything you considered usable in a potato sack tying it shut as you walk back to the school you get pounced on from behind and pinned on the ground as you use your strengh to flip the figure revealing it to be Winnie as she tightly hugged<br>\r\n\"Jason,I missed you so much!\"<br>\r\nshe said out of joy </span></div></div>",
            "created":1323666000,
            "id":1238820,
            "title":"Weapons Hunt"
        },
        "141122122122221222112121121":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "The Romance Continues",
                "One of Freddy's Minions Show Up"
            ],
            "content":"<div class=\"\"><div> <span>Both you and Winnie embrace each other in a passionate hug. “I missed you too” you say. “So how was <br>\r\n<br>\r\nthe training”? She asked. “It was pretty tough, but the hardest part was being away from you” you reply <br>\r\n<br>\r\nas you place your thumb and index finger under her chin. “Aww, that's the corniest thing I've ever <br>\r\n<br>\r\nheard” she replied as you lift up your mask and the two of you lock lips in a romantic kiss. “Sigh, that <br>\r\n<br>\r\nwas the highlight of my week” you say. This makes Winnie blush and giggle. You both begin to walk <br>\r\n<br>\r\nback to the school, holding each others' hand. Before you get there however, you have an idea. You stop <br>\r\n<br>\r\nwalking and Winnie feels a snag. She looks back to you slightly confused. “Come with me” you say in <br>\r\n<br>\r\na soothing voice. “It's been over a week since I've seen you”. “Whoa”! Winnie yells in surprise as you <br>\r\n<br>\r\npick her up, holding her in a bridal position. “And I think it HIGH time that we got some ALONE <br>\r\n<br>\r\ntime” you say looking deeply into her eyes. “Ooohhh. Teehee” She giggled. “Well then” she replied, <br>\r\n<br>\r\nplacing a hand on your cheek. “I'm all yours” she whispered. You carry Winnie into the woods and into <br>\r\n<br>\r\nthe bog. You reach the edge of the swamp and set Winnie down. “This is my favorite spot” you say. <br>\r\n<br>\r\n“The swamp, the muck, the sludge, the eery mist”. “Yeah, it's beautiful” Says Winnie. “Not as beautiful <br>\r\n<br>\r\nas you” you reply. “Oh stop” she says blushing even more intensely. Time passes and the sun sets and <br>\r\n<br>\r\nthe moon rises high into the sky. You see that it's a full moon. “I love how the moon reflects in the <br>\r\n<br>\r\nswamp at night” says Winnie. “I love how how exuberant your eyes look in the moonlight” you reply. <br>\r\n<br>\r\nYou both lean in close to each other. “I love you”. She says. “And I love you” you reply, lifting up your <br>\r\n<br>\r\nmask. You both then begin to kiss each other passionately as you wrap your arms around one another, <br>\r\n<br>\r\nholding each other tight. Winnie then pushes you forcefully to the ground. You look up at her, seeing <br>\r\n<br>\r\nher eyes continue to shine brilliantly in the moonlight. “You know” she begins to say seductively. “It IS <br>\r\n<br>\r\na full moon tonight, and I am feeling rather aggressive” she says, smiling, bearing her sharp teeth. She <br>\r\n<br>\r\nthen leans in close to you, licking her lips in a very coy manner. What happens next?</span></div></div>",
            "created":1323838800,
            "id":1239508,
            "title":"Winnie and J.J."
        },
        "1411221221222212221121211212":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Winnie walks up to you as you're worried and excited at the same time as she cmilbing up to you kissing as you two hear a mechine starting you turn to see a man wearing a skin face strating a chainsaw as he raises it above his head waving it as you push her off<br>\r\n\"Run Winnie Run!\"<br>\r\nyou yell as Leatherface walks up to you slowly as you and her run seeing him chasing you<br>\r\n\"Split up,Whoever he isn't chasing can get help\"<br>\r\nyou yell as Somehow he ended up infront of you as you bump into him he rasies his chainsaw as your hear a PUTTPUTT as his saw runs outta gas he throws it on the ground gabbing Winnie by the chest picking her up with one arm <br>\r\n\"Hey you skin-faced freak put her down!\"<br>\r\nyou shout out as stare you dead in the eye<br>\r\n\"I said put her down, she's my girlfriend,i love her and i'm not gonna let you or any of your friends hurt her\"<br>\r\nyou say pulling you machete out of conselment as he throws Winnie with his brute strengh pulling out a slege-hammer he charges you two clash weapons before he strikes the hammer you swing the machete cutting thru the handle the metal part flying in the woods as he whacks you with the wooden stick causing you to hit the ground as he walks up to you holding you<br>\r\n\"Hey, Leave my future husband alone\"<br>\r\nWinnie yells as you try to hurt him (no anvil) as you get back up the two of you continue fighting for a good 10 minutes as your dad appers out of nowhere pulling out his machete swinging it at Leatherface leaving a huge gash in his arm as he lets out a loud grunt as he runs into the fog as you try to chase him the three of you can't find him<br>\r\n\"He just dissappered?\"<br>\r\nyou say confused </span></div></div>",
            "created":1323838800,
            "id":1239560,
            "title":"Three is a crowd"
        },
        "14112212212222122211212112121":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "At the castle",
                "At the school"
            ],
            "content":"<div class=\"\"><div> <span>You and your return to where you were fighting Leatherface as you help Winnie out of the swamp as she shakes her head in a dog-like manner chattering her teeth<br>\r\n\"That wa...water is fr...freezing cold\"<br>\r\nshe stutters out as you take off your coat putting it on her as she clenches it for warmth <br>\r\n\"Thanks Jason\"<br>\r\nshe said grateful as the three of you walk back to the school Winnie looks at your arm where Leatherface hit you with the wooden handle<br>\r\n\"Jason i could have sworn your cut was bigger\"<br>\r\nshe said noticing it was only 1/3 of the size<br>\r\n\"Winnie,I have regenerative powers\"<br>\r\nyou responed blankly <br>\r\n(At Revolta's Castle)<br>\r\nLeatherface entered the main room<br>\r\n\"Hey mr buzzy try checking your gas level next time\"<br>\r\nFreddy said as Leatherface sat down next to him<br>\r\n\"No worries, I have a plan, Creeper bring the bullets\"<br>\r\nRevolta ordered as he gave her a box<br>\r\n\"These bullets are made of a special substance created by me this should take care of Voorhees Jr.\"<br>\r\nRevolta said  <br>\r\n\"Bullets are you serious, he and his father can regenerate it woln't kill him\"<br>\r\nGhostface said<br>\r\n\"I know it woln't but think we shoot him in head physically his brain will regenerate but mentally it woln't, in other words it will destroy his memories\"<br>\r\nRevolta cliamed<br>\r\n\"Why not just use those his old man?\"<br>\r\nFreddy asked<br>\r\n\"You'll see\"<br>\r\nRevolta said</span></div></div>",
            "created":1323895320,
            "id":1239782,
            "title":"New plans"
        },
        "141122122122221222112121121212":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Winnie's POV",
                "Jason's POV"
            ],
            "content":"<div class=\"\"><div> <span>Back at the school you walk in as Miss Grimwood and the rest of the girls saw you were back as they welcomed you as you laid down on the couch tired as Winnie walked up to Miss Grimwood<br>\r\n\"Miss Grimwood, since you gave Jason's room to Goonie where will he be staying?\"<br>\r\nWinnie asked as she thought about<br>\r\n\"I don't know where he could sleep, i suppose he could stay in someone else's room\"<br>\r\nMiss Grimwood responded<br>\r\n\"Would it be OK for him to stay with me\"<br>\r\nWinnie asked secretly hoping she would say yes<br>\r\n\"I don't see any reason why not, you two are close friends\"<br>\r\nMiss Grimwood said as Winnie led you upstairs to her room<br>\r\n\"Wow nice room\"<br>\r\nyou said seeing it was a little bigger than your old school bedroom<br>\r\n\"What side of the bed do you want?\"<br>\r\nshe asked (poorly) strighting up the sheets which were mildly clawed and sewn<br>\r\n\"I don't mind\"<br>\r\nyou responed<br>\r\n\"We can discuss it later I'm gonna take a warm bath,that water was freezing\"<br>\r\nWinnie responded giving you back your jacket as you look at her<br>\r\n\"Go ahead, i'll just unpack my things\"<br>\r\nyou said opening your bag removing your mask placeing it on a bed post<br>\r\nnext chapter is told in </span></div></div>",
            "created":1323903300,
            "id":1239853,
            "title":"Warm Welcome"
        },
        "1411221221222212221121211212121":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You walk in the bathroom locking the door removing your dress and undergarments throwing them down the luandry chute and turning on the hot water pouring in some shampoo in the tub as the water fills up coating your furry body in suds as your rub a bar of soar on yourself thinking to yourself<br>\r\n\"I can't belive J.J. is back and he's staying with me\"<br>\r\nyou think to yourself as you rinse the suds out of your fur blow-drying it looking in the cracked dusty bathroom mirror admirering how cute you looked and you can tell why Jason likes in addition to your great personality and common intrests you have a nice body as your wrap a towel around your waist as you walk back to your room still dripping water as you open the door you approch the bed not seeing Jason who was in the corner dusting an old acoustic guitar his dad gave him as you hear a (poor attempt at a) \"wolf whistle\" as you turn shocked<br>\r\n\"Jason!,i didn't see you there don't look\"<br>\r\nyou say covering your nipples (and newly grown breasts)as in poor timing as if on cue your towel knot came un-done as Jason's face turned bright red turning away as you changed into your nightgown approching Jason putting a hand on his shoulder<br>\r\n\"J.J. you can look now\"<br>\r\nyou said as he turned back<br>\r\n\"I'm so sorry about what happened by the way why did you call me J.J.?\"<br>\r\nhe asked as you responded <br>\r\n\"Jason Junior it's a nickname\"<br>\r\nyou reply<br>\r\n\"In a way i like it\"<br>\r\nhe said working on a drawing the corner of the room<br>\r\n\"Nice artwork\"<br>\r\nyou say admirering how realistic it looked<br>\r\nThanks\"<br>\r\nhe responded<br>\r\n\"do you think you could draw me?\"<br>\r\nyou ask<br>\r\n(rest of chapter in Jason's POV)<br>\r\n \"sure i would love to draw you\"<br>\r\nyou respond as Winnie lays on the bed striking a cute playful pose</span></div></div>",
            "created":1323920580,
            "id":1240016,
            "title":"Brief Encounter"
        },
        "14112212212222122211212112121211":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "The Next Morning"
            ],
            "content":"<div class=\"\"><div> <span>Jason continues to sketch Winnie as she lays on her bed. “How's it coming”? She asks. “I'm just <br>\r\n<br>\r\nabout done” he said as he looked back down at the paper to put on the finishing touches. “Alright <br>\r\n<br>\r\nWinnie, I'm fini-” he stopped in mid sentence when he saw that Winnie was no longer on her bed. He <br>\r\n<br>\r\nthen felt someone grab him from behind. “Whoa” said Jason as he was thrown onto Winnie's bed. He <br>\r\n<br>\r\nlooked up to see that Winnie had hopped up on top of him, wearing nothing but her bra and panties and <br>\r\n<br>\r\nshe let out a soft, teasing growl. “You know” she began to say in a seductive tone. “It's getting pretty <br>\r\n<br>\r\nlate, and I'm sure everyone else is asleep by now.....and guess what” she said leaning in close to <br>\r\n<br>\r\nwhisper in his ear. “I'm not tired”. Jason's eyes went wide. He didn't have to be told twice. He threw off <br>\r\n<br>\r\nhis jacket, shirt, and pants faster that you can say slasher film. Now in nothing but his underwear he <br>\r\n<br>\r\ncame back to bed and pulled himself under the covers on top of Winnie. “Are you sure about thi- <br>\r\n<br>\r\nMMPH”! He was interrupted as Winnie gave him her answer in the form of a passionate kiss. He <br>\r\n<br>\r\nquickly began doing the same. As things got heated, Jason unhooked Winnie's bra, revealing her small <br>\r\n<br>\r\nbut perky breasts. Winnie in return, ripped off Jason's undergarment and tossed it across the room, <br>\r\n<br>\r\nrevealing his more than ready member. They looked into each others' eyes as they were both blushing <br>\r\n<br>\r\nintensely, not from embarrassment, but from the sheer ecstasy of the moment. Then Jason removed <br>\r\n<br>\r\nWinnie's panties and prepared himself for what came next. “Are you ready for this” he asked one last <br>\r\n<br>\r\ntime, looking for reassurance. Winnie wrapped her arms around him, embracing him as she brought her <br>\r\n<br>\r\nface closer to his. “More than you know” she replied. Jason took that as his cue and took the plunge. <br>\r\n<br>\r\nThe bed began to squeak softly, the sheets were being ruffled, and the soft exhales of Jason and Winnie <br>\r\n<br>\r\nwere let out as small, almost inaudible  moans. The two began moving in a rhythmic up and down <br>\r\n<br>\r\nmotion under the sheets as the two were in a world of pure pleasure and ecstasy. They both continued <br>\r\n<br>\r\nfor some time and eventually fell asleep in each others' arms.</span></div></div>",
            "created":1324062000,
            "id":1240851,
            "title":"Love and Romance"
        },
        "141122122122221222112121121212111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The next morning you woke up from on of the best nights of sleep you've ever had as Winnie still had her arm wrapped around you as you gently moved it getting out of the bed,not wanting to wake her as you got dressed and picked up the mask still on the bedpost as you slid it on your head over your face as you open the heading to bathroom as the hallway sunlight aimed at Winnie's face as she woke yawning <br>\r\n\"Jason, where are you going?\"<br>\r\nWinnie asks Putting her undergarments back on and Pulling her dress over her head <br>\r\n\"I'm gonna take a shower you say exiting the room. After showering you put on a pair of jeans and a dark tan T-shirt which read \"Camp Crystal Lake\"<br>\r\nwritten in blue as you headed back to the room you shared with Winnie <br>\r\n\"Nice shirt\"<br>\r\nWinnie said as you entered<br>\r\n\"Thanks,lets go downstairs for some breakfast\"<br>\r\nyou say as she nods getting out of the bed whispering in your ear<br>\r\n\"By the wayJ.J,what happened between us last nights stays between us\"<br>\r\nshe whispered as you two got downstair Miss G was frying (way past sell by date) eggs as Shaggy handed you some fresh scrambled eggs with a slice of toast<br>\r\n\"Good moring you two,Jason how did you sleep last night i hope Winnie didn't keep you up?\"<br>\r\nMiss Grimwood asked<br>\r\n\"Nah, I slept great\"<br>\r\nyou say sitting down. after eating you and the other students go to gym class as Shaggy tells you the vollymatch was today and Miss G reschulded it so you could play as you practice with the other girls playing extremly well<br>\r\n\"Wow Jason, that's amazing\"<br>\r\nthe girls said as growing on in a summercamp you played alot<br>\r\n\"OK enough practice, time to meet the cadets at the court\"<br>\r\nShaggy said   </span></div></div>",
            "created":1324071720,
            "id":1240904,
            "title":" Gym Class"
        },
        "1411221221222212221121211212121111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You head to the court <br>\r\n\"OK let the game begin\"<br>\r\nMiss G said<br>\r\n\"That's a negitive Miss Grimwood, you have 9 students and i only have 5\"<br>\r\nCol C. said pointing to Tug,Miguel,Grunt,Jamal and baxter<br>\r\n\"Well 4 of us could sit out and we could take shifts\"<br>\r\nGodzina said as everyone agreed that as You,Tannis,Goonie and Sibella sat out first as the game went on smoothly until Jamal serverd the ball as Phanty phased through the net hitting it <br>\r\n\"That's a foul, she passed the net!\"<br>\r\nCol. C yelled as Phanty sat on the blechers pouting as you took her place as you take off your coat streching your arms heading up<br>\r\n\"Hey why are you with them, you're a boy?\"<br>\r\nMiguel asked<br>\r\n\"Long story\"<br>\r\nyou say as Tug shrugs serving the ball as you hit in scoring a point as the game continues Grunt serves the ball as Godzina hits it al the way in the forest<br>\r\n\"I'll get it\"<br>\r\nGrunt said walking in the woods looking for the ball as out of sight he gets picked up and thrown on the feild by a single arm as a man wearing a blue jumpsuit and a white mask walks out of the bushes pulling a kitchen knife out<br>\r\n\"You've gotta be kidding me\"<br>\r\nYou say to Winnie</span></div></div>",
            "created":1324072320,
            "id":1240913,
            "title":"Grimwood Vs. Calloway"
        },
        "14112212212222122211212112121211111":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The boys from the Calloway Camp were in a frightened frenzy as they ran and hid from the masked <br>\r\n<br>\r\npsychopath. “It's Michael Myers”! One of the girls shrieked. The masked giant remained silent as he <br>\r\n<br>\r\nbegan to slowly walk up to girls, knife in hand. Jason Jr. knew of what Myers was planning to do and <br>\r\n<br>\r\nwas intent on stopping him. He stepped away from Winnie and quickly pulled out his machete. “J.J.! <br>\r\n<br>\r\nWhat are you doing”?! She asked. “Hey Myers, why don't you quit scaring little girls and take on <br>\r\n<br>\r\nsomeone your own size. Myers slowly turned his head towards Jason Jr. He then began walking <br>\r\n<br>\r\ntowards him in a sluggish manner. J.J. Stood his ground waiting for the lumbering giant to make his <br>\r\n<br>\r\nway over to him. Then everyone heard a loud BANG! And shuttered. Everyone immediately clasped <br>\r\n<br>\r\ntheir hands over their ears. J.J. Turned to see a smoking gun in the Colonel's hand and a bullet hole in <br>\r\n<br>\r\nthe side of Myers' mask. “You aren't going to put a FINGER on these children mister”! Said the <br>\r\n<br>\r\nColonel, thinking he had vanquished the giant. To his horror however, Myers simply turned his head <br>\r\n<br>\r\ntowards him, and he started trudging his way towards Calloway. “What”?! Said the Colonel. He began <br>\r\n<br>\r\nfiring round after round into Myers as he continued to make his way over to him. To no avail however <br>\r\n<br>\r\nas he ran out of bullets and Myers was still standing. Just as he was about to reach Calloway he raised <br>\r\n<br>\r\nhis knife over his hand, arching it to strike. Calloway flinched, expecting the worst. “KYAH”! Yelled <br>\r\n<br>\r\nJ.J. As he slashed Myers in the back, leaving a huge gash going down from his shoulder, to his hip. <br>\r\n<br>\r\nThis had no affect however. All it managed to do was draw his attention back towards J.J. Myers turned <br>\r\n<br>\r\nto face him and threw a hard punch right at J.J.'s chest, sending him flying back and crashing through <br>\r\n<br>\r\nthe school. “Jason”! Yelled Winnie, worried for her boyfriend's safety. Myers then started walking <br>\r\n<br>\r\ntowards Winnie. Before he got to her however, another figure caught hi eye. A man in a hockey with a <br>\r\n<br>\r\ntorn trench coat, and a large machete in hand. It was Jason Sr.! Both killers stared each other down as <br>\r\n<br>\r\nthey walked towards one another. Then they came face to face, neither saying a word. Then Myers <br>\r\n<br>\r\nthrust his knife into Jason's heart. Jason merely looked down to see it, then slowly looked back up at <br>\r\n<br>\r\nMyers. He then threw a solid punch to Myers' face, sending him flying fifty feet back into the woods, <br>\r\n<br>\r\nknocking over trees and debris. Jason slid the knife down to his belly as he took the liberty of taking out the knife and <br>\r\n<br>\r\ntossed it to the ground. Once the debris cleared, everyone could see Myers back up on his feet. Before <br>\r\n<br>\r\nJason could go after his unarmed adversary however, he vanished in a cloud of black smoke. Everyone <br>\r\n<br>\r\nbreathed a sigh of relief as Myers departed. “Oh no! J.J.!” said Winnie as she ran to the hole J.J left in <br>\r\n<br>\r\nthe school after he was sent crashing through it. She and the others began excavating through the debris <br>\r\n<br>\r\nlooking for Jason Jr.</span></div></div>",
            "created":1324170360,
            "id":1241575,
            "title":"Duel of the Silent Slashers"
        },
        "141122122122221222112121121212111111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Winnie moved the broken remains of wall seeing Jason knocked out as she pulled him out as Jason Sr walked up carrying him inside laying him down as Mary pulled out some high tech laptop-looking thing doing a search on Micheal <br>\r\n<i>\"Michael Audrey Myers was born on October 19, 1957. He had an older sister named Judith and a younger sister. The family resided in a two-story house at 45 Lampkin Lane in the surburban town of Haddonfield, Illinois. On October 31, 1963, a six-year old Michael dressed as a clown for Halloween and watched his sister &amp; her boyfriend kissing before going upstairs to have sex. Taking a knife out of the kitchen drawer and waiting for Judith's boyfriend to leave, Michael then snuck up the stairs and repeatedly stabbed his sister to death. After watching her die, he left the house only to be discovered by his astonished parents, who had just returned home. Michael was sent to Smith's Grove Warren County Sanitarium for his crime, where he would remain until his twenty-first birthday until he could be tried as an adult. At Smith's Grove, Michael received psychiatric treatment from Doctor Sam Loomis. Upon spending time with the boy, Loomis concluded that it was a hopeless case that Michael Myers had no humanity left. He pleaded his case that Myers be moved to a more secure facility, but his superiors refused to listen and ordered that he remain in the \"adequate\" Smith's Grove In 1965, Michael's parents were killed in a car accident, and his little sister was adopted by the Strode family, who renamed her Laurie. The Strodes brought Laurie to visit Michael at Smith's Grove on at least one occasion when she was still a little girl. <br>\r\nOctober 30, 1978, the 21-year-old Michael Myers destroyed his room at Smith's Grove and carved the word \"sister\" on his door before breaking out. He also released the other patients from their rooms. At the same time, Dr. Loomis and Nurse Marion Chambers were arriving at the facility to transfer Myers for his court hearing. Noticing the patients roaming around outside the hospital, Loomis got out the car to investigate as Michael attacked Marion and sped away in their station wagon. As he drove across Illinois, Michael stopped to murder a truck driver to steal his boiler suit. Travelling to Haddonfield, Michael returned to his childhood home. The next day on Halloween, a teenaged Laurie Strode dropped off a key at the Myers house for her realtor father, and was immediately recognized by her brother. Michael proceeded to stalk her and her friends Annie and Lynda throughout the afternoon. He also stole Judith's gravestone from the local cemetery, and broke into Nicol's Hardware to acquire knives, rope, and a white Halloween mask. Meanwhile, Dr. Loomis had followed Michael to Haddonfield and warned town sheriff Leigh Brackett of the danger he posed. That night, as Laurie and Annie were babysitting across the street from each other, Michael watched them from the shadows. He murdered Annie first, strangling her in her car as she left to meet her boyfriend, before slitting her throat. Later, Lynda and her boyfriend Bob showed up, only to fall victim to Michael as well. Worried about her missing friends, Laurie crossed the street to investigate, only to find Annie's body arranged under Judith Myers' gravestone, and Lynda and Bob hidden in the closets. Michael lunged at his sister, catching her on the arm with his knife, and she ran for help. Michael followed her across the street, and Laurie was forced to stab him with both a knitting needle and his own knife. As Michael rose from apparent death to resume his attack on Laurie, Dr. Loomis appeared and shot him six times, causing him to fall off the balcony. When Loomis went to check the body, Michael had vanished.Michael Myers' body was never found in 1978, although many simply assumed him dead.Michael Myers seemed to contain superhuman strength, having been able to lift a tombstone out of the ground  and also seemed to withstand critical injuries that would normally result in death, such as being shot, stabbed, electrocuted, or even burned. He also seems to be able to regenerate lost tissue</i>\"<br>\r\nthe webpage read <br>\r\n<br>\r\n</span></div></div>",
            "created":1324172940,
            "id":1241592,
            "title":"The story of Michael"
        },
        "1411221221222212221121211212121111111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>A few hours later J.J. woke up as his wounds healed as Winnie embraced him in a tight hug<br>\r\n\"Jason i thought we were gonna lose you\"<br>\r\nshe said as the two of them hugged eachother<br>\r\n\"So what now\"<br>\r\nJ.J. responded<br>\r\n\"Well the halloween party is tonight and i can't help but feel those killer will have the urge to crash it\"<br>\r\nSibella said <br>\r\nOutside of the school Freddy was looking thru a Venus Spy trap<br>\r\n\"Now we know his weakness\"<br>\r\nFreddy said grinning<br>\r\n(the night of the party)<br>\r\nThe fathers showed up and were shocked to see Jason Sr. everything was going smoothly there was fun,games, free food (Which shaggy, Scooby, and Scrappy enjoyed) and everything was going well as the Wolfman walked up to you and your dad as you waved to him<br>\r\n\"Hey Mr.Wolf\"<br>\r\nyou say out <br>\r\n\"Hey Jason, I just wanted to ask if you could help me look for Winnie\"<br>\r\nHe asked in a stern yet kind tone not wanting your father to feel you were being forced as the school phone rang Miss Grim wood answered it as Ghostface answered<br>\r\n\"How's the Party?\"<br>\r\nhe asked in a joking voice<br>\r\n\"Who is this!\"<br>\r\nDracula demanded snatching the phone <br>\r\n\"Quit the attitude before i cut off your eyelids so you woln't blink when i ram a wooden steak right thru your face plus don't you notice one of your guests missing turn on the back lights\"<br>\r\nGhostface responded as they did seeing Winnie tried up in a chair with a vertical Gillotine blade on a platform which could decapatate her as everyone thretened Ghostface as they approched the door<br>\r\n\"Stop, one move and i kill her right now\"<br>\r\nGhost face said as they backed away<br>\r\n\"Good i want to play a game answer right she lives, wrong she dies, question 1 name Leatherface's weapon\"<br>\r\nGhostface asked<br>\r\n\"Chainsaw\"<br>\r\nJ.J. replied <br>\r\n\"Freddy Krueger's address\"<br>\r\nGhost face asked<br>\r\n\"1428, Elm st\"<br>\r\nJ.J. replied<br>\r\n\"Name of Michael Myer's older sister\"<br>\r\nGhostface asked<br>\r\n\"Judith\"<br>\r\nJ.J responded<br>\r\n\"Final question: Name the Crystal lake killer\"<br>\r\nGhostface asked<br>\r\n\"Jason Voorhees\"<br>\r\nThe Wolfman quickly yelled<br>\r\n\"Wrong answer, you should know Jason's mother Palma Voorhees was the orignal Crystal Lake killer\"<br>\r\nGhostface said asthe blade started only to be stopped by a rotten hand which belonged to Jason Sr. as he broke the chair grabbing Winnie dragging her in the school<br>\r\n\"That was a close shave\"<br>\r\nJ.J. said shocked<br>\r\n   </span></div></div>",
            "created":1324225800,
            "id":1241852,
            "title":"Halloween Party (pt1)"
        },
        "14112212212222122211212112121211111111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You stood there shocking seeing the fate that almost fell on Winnie as the Wolfman hugged her snatching the phone<br>\r\n\"Who is this,you tell me or i'll rip your limps off?!\"<br>\r\nhe asked in a demanding tone<br>\r\n\"You can't hurt me\"<br>\r\nGhostface responded thru the phone<br>\r\n\"Then how about showing your face you fuc...\"<br>\r\nhe said as Ghostface responded<br>\r\n\"My pleasure\"<br>\r\nGhostface said appearing out of nowhere as Wolfman tackled him phasing right thru him as Ghostface turned laughing as they heard Freddy<br>\r\n\"That's our cue boys\"<br>\r\nFreddy said melting thru the floorboard cracks forming as Michael jumped thru a window<br>\r\n\"What the...Voorhees kid is still alive\"<br>\r\nFreddy said as Winnie jumped clawing him in the face as he caught her throwing her against a brick wall as the five clawmarks started bleeding as he rubbed his finger licking it as the wounds vanished<br>\r\n\"Winnie,you probaly shouldn't have done that\"<br>\r\nyou say as Leatherface broke down the door<br>\r\n\"Leatherface,take care of her!\"<br>\r\nFreddy yelled whispering in his ear<br>\r\n\"I want her alive but cut her up as much as you wish\"<br>\r\nFreddy whispered as Leatherface slowly walked up to Winnie as Wolfman and Frankenstein jumped in front of her as Leatherface started his chainsaw preparing to strike as your dad tackled him to the ground as the saw made a deep gash in the Wolfman's leg as he screamed in pain as Leatherface got up<br>\r\n\"Run and split up\"<br>\r\nyou yell as everyone except your dad split in groups and ran away<br>\r\n\"Oh no you don't\"<br>\r\nGhostface said turning into a cloud of black smoke seperating into 3 Ghostface clones<br>\r\n</span></div></div>",
            "created":1324511280,
            "id":1243992,
            "title":"Halloween Party (pt 2)"
        },
        "141122122122221222112121121212111111111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>The 3 Ghostface clones started laughing as they each pulled out a weird gun-looking thing firing a green mist as the killers put on some fumagation masks as everyone else started getting sleepy as they fell over knocked out<br>\r\n\"Ok get these girls loaded, and you i special treatment\"<br>\r\nFreddy said pointing at J.J.as they killers loaded them on a truck driving off as it was traveling away inside the truck bed Ghostface,Freddy and Micheal were playing cards as Leatherface was driving <br>\r\n\"Freddy why did we have to leave i could've cut their fathers up good\"<br>\r\nGhostface said<br>\r\n\"Because Ghosty we have to transport the kids before they wake up\"<br>\r\nFreddy said smacking Ghostface as Micheal hit Freddy<br>\r\n\"Why you son of a bitch\"<br>\r\nFreddy said throwing micheal hitting Leatherface as he stood up<br>\r\n\"Leatherface!,the wheel you idiot\"<br>\r\nFreddy and Ghostface shouted as the truck drove over a big tree as two of the bodybags flew out of the back un-noticed as Leatherface grabbed the wheel driving off<br>\r\n\"Keep hold on that wheel\"<br>\r\nGhostface said <br>\r\nthe two bodybags started moving as a blade cut thru one of them as Jason Jr. crawled out seeing the other bag he pushed on it hearing muffled screaming as he cut the bag seeing Sibella <br>\r\n\"Where are we?\"<br>\r\nyou ask her as she has no idea but saw the truck fading in the distance<br>\r\n\"That's the truck we were in, i'm gonna fallow it\"<br>\r\nSibella said taking on her bat form flapping off<br>\r\n(at the castle)<br>\r\nthe truck pulled up unloading 7 bodybags<br>\r\n\"Micheal you idiot you left 2 behind\"<br>\r\nFreddy yelled at him <br>\r\n\"Well just tie them up already\"<br>\r\nRevolta said meeting them     </span></div></div>",
            "created":1324522140,
            "id":1244091,
            "title":"kidnapped"
        },
        "1411221221222212221121211212121111111111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Butterfingers here left 2 of the kids behind\"<br>\r\nGhostface said pointing at Freddy<br>\r\n\"No Leatherface was the one who loaded them\"<br>\r\nFreddy said as the yelled at eachother until Ghost turned his head to a tree<br>\r\n\"I sense something\"<br>\r\nhe said throwing his knife in a tree as Sibella (in bat form) fell out with the knife stuck in her wing as Ghostface pulled it out as she changed back<br>\r\n\"Girl, you've got guts, it's a shame i'm gotta rip em out\"<br>\r\nFreddy said as Sibella yelled out for Jason<br>\r\n\"Voorhees jr. can't help you\"<br>\r\nGhostface said as Leather picked her up giving her another dose of the green gas as the killers carried them inside J.J. popped outta hiding sneaking around them inside the castle the girls were tied up with handcuffs that prevented them from using their powers as J.J. snuck inside thru small passages fiding the cage as the girls saw J.J. cheered up as he put his finger over his mouth<br>\r\n\"Be quiet'<br>\r\nhe whispered inspecting the cage he jammed the tip of his curved machete in the keyhole of the lock jingling it as the cage popped open <br>\r\n\"Hold out your hands and put them on that stone\"<br>\r\nJason said as the girls did as told J.J. swung the machete breaking the handcuffs <br>\r\n\"Not so fast!\"<br>\r\nthe heard turning to see a boiling red Freddy <br>\r\n\"Voorhees i'm gonna rip out your lungs for this\"<br>\r\nFreddy yelled as the girls cowarded in fear as Freddy laughed <br>\r\n\"I got it girls sit on the ground close your eyes and do nothing\"<br>\r\nyou say to the girls as the reluctantly do what you say <br>\r\n\"Pay attention to me you bags of flesh,you can't ignore me\"<br>\r\nFreddy said as they heard knifes sharpening Leatherface's chainsaw and Ghostface laughing as they continued to close their eyes as the sounds died out they opened their eyes seeing Freddy and all the killers gone<br>\r\n\"What happened?\"<br>\r\nMary asked<br>\r\n\"All along Freddy needed one thing from us,Fear and when we couldn't give him what he nedded he couldn't live\"<br>\r\nyou say as the 9 of you leave the castle<br>\r\n\"Does anyone know stickshift?\"<br>\r\nWinnie asked as you and the girls got in the car</span></div></div>",
            "created":1324660140,
            "id":1245192,
            "title":"The Final battle"
        },
        "14112212212222122211212112121211111111111":{
            "author_id":"majorallen",
            "author_name":"Major Allen",
            "content":"<div class=\"\"><div> <span>You drove the girls back to the school as their fathers hugged them<br>\r\n\"So what happened?\"<br>\r\nSwampman asked<br>\r\n\"It was Jason,he defeated Freddy\"<br>\r\nGoonie told him<br>\r\n\"How did he kill Freddy,not even his old man could do that?\"<br>\r\nThe Mummy asked<br>\r\n\"I defeated him mentally, stabbing shooting and burning him wouldn't do anything but i took back his fear and it drained him of his life\"<br>\r\nYou responded <br>\r\n(Eight months later)<br>\r\nIt was the last day of school and you were in the woods writting in a journal <br>\r\n\"<i>This year was the best one yet we killed of Freddy krueger, we beat Calloway in the vollyball match,we got to see Elsa'd graduation and it's a shame she wouln't be us next year but this year was very peaceful, my relationship with Winnie is still strong as ever, i'm gonna invite them to Crystal lake for a summer vacation and their father said they could go i think they know their kids are safe in my hands plus my dad'll be their to \"take care\" of anyone inteneding otherwise, i just hope next year will be even better</i>\"<br>\r\nyou finish writting closing your book admiring the trees as Winnie sat down next to you<br>\r\n\"Hey J.J. thanks for saving us...twice\"<br>\r\nshe said grateful<br>\r\n\"Anytime\"<br>\r\nyou responded as the two of you sharing a kiss<br>\r\n\"I can't wait to see you in the summer\"<br>\r\nWinnie said playing with her hair<br>\r\n\"I can't wait for you girls to show up\"<br>\r\nyou said as she pulled a box of from under her dress handing it to you as you opened it seeing it was your drawing of her<br>\r\n\"I was wondering if you could sign it for me\"<br>\r\nshe said as you pulled out a pencil signing it as you two sat their as you pulled out a knife <br>\r\n\"Hey Winnie, lets carve our names in the tree\"<br>\r\nyou said carving a heart writting J.V.+W.W. inside a heart<br>\r\nas you two looked up at he sky  <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1324661280,
            "id":1245200,
            "title":"The final chapter"
        }
    },
    "info":{
        "author_id":"majorallen",
        "author_name":"Soulripper13",
        "brief_description":"this takes place after Jason at ghoul school  (scooby doo related)",
        "created":1302221100,
        "description":"<td align=\"left\" class=\"norm\"><b>(note feel free to add)</b>this story takes place right after Jason at ghoul school where Jason return to the school (note in the the last story he went through the Mate ceramony with winnie but they are NOT married they can't until they are adults they are reserved for eachother but being a mate means they will always be there for each other) here is a list of the charecters<br>\r\n<b>Students</b><br>\r\n<b>Jason Voorhees(Jr.)</b>-age 13 son of Jason Voorhees artististic wears the mask from part 5(blue lines)and Winnie's boyfriend<br>\r\n<b>Elsa Frankenteen</b> -age 18 daughter of frankenstein's monster strong but also mentally slow<br>\r\n<b>Sibella Dracula</b> - age 16 daughter of Count Dracula the most strongwilled<br>\r\n<b>Phanty Phantom</b> - age 15 daughter of the Phantom likes playing the pipe organ and is very funny<br>\r\n<b>Winnie Werewolf</b> -age 11 daughter of a Werewolf very athletic and tomboyish Jason's girlfriend<br>\r\n<b>Tannis the Mummy</b> - age 8 daughter of a Mummy very shy but very nice<br>\r\n<br>\r\n<b>The Villians</b> <br>\r\n<b>Revolta</b> - a witch with magic powers who wants the girls for an evil army<br>\r\n<b>Freddy Krueger</b> - a demon who can kill people in there dreams has a new unbreakable claw<br>\r\n<b>Michael Myer</b> - a killer who wears a blue jumpsuit and a white mask dosn't talk and (unkillable)<br>\r\n<b>Leatherface</b> - a killer undead who wear human faces as masks and carries a Chainsaw (unkillable super strong durable)<br>\r\n<b>Ghostface</b> -a ghost who wears a black cloak and a white rubber mask calls people on the phone before killing them (unkillable teleport multiply phase through object ghost powers) <br>\r\n <b>other charecters</b>  <br>\r\n Shaggy, Scooby , Scrappy Miss Grimwood the Calloway Cadets   <br>\r\n </td>",
        "id":1766033,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1379477820,
        "modified":1379477820,
        "pretty_title":"jason's return to ghoul school"
    }
}