{
    "chapters":{
        "1":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "swap bodies",
                "swap personalities",
                "swap age and gender"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Tim Thorn, you work at a small research laboratory that was started by your late Father. You are the lab's chief scientist and you have been working on a complex and slightly bizarre project. You were trying to build a device that could do a near instantaneous psychological and physical examination of a person.<br>\r\n<br>\r\nThe other people in the Lab include: Jake Corton, a 29 year old scientist who is working on an alternate energy source; Rachel Bonn, a 22 year old university student working at the lab on an 18 month internship; Carl Crank, the 40 year old lab manager who had been a close friend of your Father; Janet Pearl, 31 years old and the lab's accountant and financial advisor.<br>\r\n<br>\r\nIt was a quiet February morning today and you were enjoying your drive to work. Turning into a snow bound parking lot you turn off your car. You then get out of your car and survey the other cars in the lot.<br>\r\n<br>\r\n\"Mrs. Vandenburg?\" you mutter to yourself, refferring to the bitchy investor Janet had managed to hook late last year, \"Why must you come in to ruin such a wonderful morning?\"<br>\r\n<br>\r\nAs you pass by Mrs. Vandenburg's Porshe you spot Hillary, Jake's younger sister, locking her bike to the rack adjacent to the building.<br>\r\n<br>\r\n\"No school today?\" you ask the cheery teenager.<br>\r\n<br>\r\n\"Not today Tim!\" replies Hillary, she comes by to hang out and help her older brother with his research from time to time.<br>\r\n<br>\r\nAs you walk into the building you feel a blast of warm air hit you.<br>\r\n<br>\r\n\"Hello Janet!\" you say as you pass by her office and into the laboratory component of the facility.<br>\r\n<br>\r\n\"Tim! We need to talk about last quarter's finances!\" shouts out Janet as the door to the laboratory closes.<br>\r\n<br>\r\n\"Hello Dr. Thorn,\" says Rachel, holding a clipboard up to her bosom, \"I have the data from the circuit checking I did yesterday!\"<br>\r\n<br>\r\n\"I told you, don't call me Dr. Thorn,\" you say, taking the clipboard from Hillary, \"I don't have a PhD! Call me Tim or, if you must use a title, use Mr. Thorn.\"<br>\r\n<br>\r\n\"Sorry about that Mr. Thorn,\" replies Rachel, moving over to her station.<br>\r\n<br>\r\n\"Tim! Later could you help me read over the data from last week's test run?\" asks Jake from across the lab.<br>\r\n<br>\r\n\"Sure thing Jake!\" you reply, waving in his direction.<br>\r\n<br>\r\n\"Good Morning people!\" comes the booming voice of Carl Crank, \"Ready to push the edge of what is known?\"<br>\r\n<br>\r\n\"Always Mr. Crank!\" replies Rachel.<br>\r\n<br>\r\nAs you sit down at your desk you read over the report Rachel had handed you. From what it said, there was a flaw in one of the connections on the power distribution node. You start to work at fixing it.<br>\r\n<br>\r\nBy lunch time you think you've made real progress. As everyone in the laboratory heads out for lunch you see that Mrs.Vandenburg is shouting at Janet about something.<br>\r\n<br>\r\nAfter lunch you go into the lab, only to come face to face with an angry Mrs Vandenburg.<br>\r\n<br>\r\n\"Mr. Thorn!\" hisses the annoying lady, \"I do hope you are nearing completion of your little project?\"<br>\r\n<br>\r\n\"Research takes time Ma'am,\" you reply, trying to push past her.<br>\r\n<br>\r\n\"I demand that you provide a demonstration of what it can do at this time!\" insists Mrs. Vandenburg.<br>\r\n<br>\r\n\"Its not ready for that level of testing Ma'am,\" you reply cooly.<br>\r\n<br>\r\n\"Would you rather I withdrew my funding for your little black hole facility?\" she retorts.<br>\r\n<br>\r\n\"Please Tim!\" pleads Janet.<br>\r\n<br>\r\n\"Fine!\" you say reluctantly.<br>\r\n<br>\r\nMrs. Vandenburg finally steps aside allowing you access to the device you had been working on. You and Rachel set to work connecting up its various components and placing it in its case.<br>\r\n<br>\r\n\"Here goes!\" you say.<br>\r\n<br>\r\nYou connect its power supply and engage the switch. You then feel a small jolt travel up your arm shortly before the device catches fire.<br>\r\n<br>\r\n\"Damn!\" you blurt out, putting down the device so that Jake can hit it with a fire extinguisher.<br>\r\n<br>\r\n\"I see,\" says Mrs Vandenburg, turning and leaving the room.<br>\r\n<br>\r\nYou run out after her.<br>\r\n<br>\r\n\"That only happened because you forced us to do a full blown test run before we were ready!\" you shout at your investor.<br>\r\n<br>\r\n\"And it didn't work,\" replied Alexandra cooly.<br>\r\n<br>\r\n\"Give me a week and a half!\" you demand, \"We have a duplicate model that we should be able to get functioning by then!\"<br>\r\n<br>\r\n\"Fine,\" replies Mrs. Vandenburg, \"But if it doesn't work then, then I am withdrawing my funding for your little black hole enterprise.\"<br>\r\n<br>\r\nMrs. Vandenburg then storm out the front entrance.<br>\r\n<br>\r\n\"Tim?\" you hear Janet say weakly.<br>\r\n<br>\r\n\"Why the hell did you ever bring her into this?\" you demand.<br>\r\n<br>\r\n\"We needed the money Tim! She had it!\" was the reply.<br>\r\n<br>\r\n\"Find us another damned investor!\" you order before returning to the laboratory to help clean up after the fire.<br>\r\n<br>\r\n\"Yes Tim,\" was Janet's whispered response.<br>\r\n<br>\r\n<b><div align=\"center\">17 days later</div></b><br>\r\n<br>\r\nTim was feeling rather happy about how things had gone over the past week and a half. He and Rachel had managed to get the replacement device not only up to working condition but also to fit into a smaller and more portable case.<br>\r\n<br>\r\nJake had brought along both his sister and his daughter for the demonstration and Mrs. Vandenburg was there as well, urgently waiting to leave as she had an important business meeting to be going to in half an hour.<br>\r\n<br>\r\n\"Lets see this demonstration of yours,\" demanded Mrs Vandenburg, her hand resting on her hip, clearly not expecting much.<br>\r\n<br>\r\nYou put the device down on a table. It is made up of a small box like object, a little screen and controls as well as a pair of antennae.<br>\r\n<br>\r\n\"The device needs a controller and a test subject who will be scanned,\" you announce, \"For the purposes of this demo I'll be the controller. Any one who wants to be our first subject, please stand on the other side of the device from me.\"<br>\r\n<br>\r\nSomeone moves into position and you activate the device.<br>\r\n<br>\r\n<b>What power does the device have?</b></span></div></div>",
            "created":1249189200,
            "id":781533,
            "title":"A demonstration"
        },
        "11":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Mrs. Vandenburg",
                "Rachel",
                "Janet",
                "Hillary"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was the test subject?</span></div></span></div>",
            "created":1249189200,
            "id":737559,
            "title":"swap bodies"
        },
        "111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "answer him, pretending to be Mrs. Vandenburg",
                "answer him, saying you are actually Tim",
                "see that Mrs. Vandenburg (in your old body) is waking up"
            ],
            "content":"<div class=\"\"><div> <span>\"Ready Mrs. Vandenburg?\" you ask, carefully pointing the antennae at her.<br>\r\n<br>\r\n\"Get this over with will you?\" hisses back your investor, anxious to get to her meeting.<br>\r\n<br>\r\nYou throw the switch and feel a strange tingling sensation before blacking out.<br>\r\n<br>\r\nWhen you come to, you see Carl kneeling at your side.<br>\r\n<br>\r\n\"You alright?\" asks Carl, reaching out a hand to help you up.<br>\r\n<br>\r\n\"Fine, just a bit woozy,\" you say, failing to notice the strange pitch of your voice.<br>\r\n<br>\r\nYou reach out a thin, manicured hand and lift yourself to an unsteady standing position. You then take a step, stumble and almost fall over again.<br>\r\n<br>\r\n\"What the?\" you say, before looking down to see what caused you to stumble. \"Holy mother of God!\" you blurt out when you see Mrs. Vandenburg's body in place of your own.<br>\r\n<br>\r\n\"Are you allright Ma'am?\" asks Carl, leading you to a chair.<br>\r\n<br>\r\nYou then...</span></div></div>",
            "created":1249189200,
            "id":737571,
            "title":"Mrs. Vandenburg"
        },
        "1111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Mrs. Vandenburg's meeting",
                "Mrs. Vandenburg's home",
                "somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>You decide that it would be best if you just pretended to be Mrs. Vandenburg for now.<br>\r\n<br>\r\n\"Of course I'm fine Ca- Erm... Mr. Crank. Now if you'll excuse me, I really must be going,\" you say, trying to imitate Alexandra's aloof attitude.<br>\r\n<br>\r\n\"Will you continue to support our lab?\" asks Janet, turning away from the collapsed body that is now home to the real Mrs. Vandenburg.<br>\r\n<br>\r\n\"Certainly,\" you reply curtly before walking out of the room, only tripping due to Alexandra's heels three or four times.<br>\r\n<br>\r\nOnce outside you feel the cold winter air blowing past your new and exposed legs.<br>\r\n<br>\r\n\"Damn! Why did she have to wear a skirt on today of all days?\" you mutter in Mrs. Vandenburg's firm but feminine voice.<br>\r\n<br>\r\nUnlocking her car with keys from the purse you were holding, you get in and set off to...</span></div></div>",
            "created":1249189200,
            "id":737593,
            "title":"answer him, pretending to be Mrs. Vandenburg"
        },
        "1112":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "you switch you and Mrs.Vandenburg back",
                "something goes wrong",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>\"Actually I'm Tim.I think the device switched our bodies.\"you whisper to him in the b's voice.\"You are a genius.\"a guy says.You look and see it's Mrs.Vandenburg in your body.She is hunched over and looking at her masculine hands.\"Thanks.You aren't mad?\"you ask your swapped investor.This is the first time she has ever said something nice.\"Assuming you can reverse this,no my dear.You have exceeded my expectations.Body swaping I-we will make a fortune.\"You smile and say\"It's not what we planned but I guess I am a genuis.I think- I know I can swap us back.\"She says \"Good.Do it now I have a meeting to go to.Later we will have drinks and celebrate.\"She is now standing erect in your body.</span></div></div>",
            "created":1249621200,
            "id":740540,
            "title":"answer him, saying you are actually Tim"
        },
        "1113":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "go to the restroom",
                "go outside",
                "relax in one of the chairs"
            ],
            "content":"<div class=\"\"><div> <span>As everyone crowds around your old body you make your way over to one of the lab's windows. Managing to stay upright despite the high heels you are now wearing, you look at the faded reflection of your new body in the glass.<br>\r\n<br>\r\nThe first part of your new body that you examine is your head. Your new hair is black and is done up in a tight French Twist. Your face is rounder than your old one. Alexandra's nose is slightly upturned and is lined to either side by Navy Blue eyes. Above the eyes are carfully plucked eyebrows. Your new lips have on them some dark magenta lipstick. You run a feminine hand along your new Jawline, from Alexandra's pointed chin up to her pierced ear. From what you see and feel, you notice the distinct lack of any obvious imperfections in your smooth skin.<br>\r\n<br>\r\nMoving your attention downwards you see that you are now dressed in a Black suit jacket with matching, knee length skirt. Beneath the suit jacket you can make out a deep green, almost black itself, silk, strapless tank top. Your new feet are at the end of long, straight legs and are wearing a pair of black stilettos. Examining your thin yet strong hands you notice Mrs. Vandenburg's wedding band.<br>\r\n<br>\r\nYou are starting to find the reflection in the glass a bit strange, not only because you aren't used to having the reflection of your strong willed investor but also that you aren't used to see her slouching like you now are. Straightening your posture you try and hold your new body as you'd seen Mrs. Vandenburg do so.<br>\r\n<br>\r\n\"What is the meaning of this!?\" you hear your old voice exclaim.<br>\r\n<br>\r\nYou turn around and stiffly walk towards a very frightened and confused looking Tim Thorn. You are stopped by Janet part way to your target.<br>\r\n<br>\r\n\"This isn't a good time Mrs. Vandenburg,\" whispered Janet, her hand against your new shoulder.<br>\r\n<br>\r\nYou re-adjust your posture and focus your gaze on your old body.<br>\r\n<br>\r\n\"What have you done?\" whimpered Mrs. Vandenburg from behind your old eyes.<br>\r\n<br>\r\n\"I have no idea how this happened Mrs. Vandenburg but from what I can tell, we've exchanged bodies,\" your reply in the most officious air you can, your new voice greatly helping in that effort.<br>\r\n<br>\r\nJanet withdraws her arm and tips her head, her normally calm face twisted in confusion.<br>\r\n<br>\r\n\"Tim?\" asks Janet, worry showing through the confusion in her voice.<br>\r\n<br>\r\n\"Yes Janet, its me,\" you reply, smiling at Janet with one of your lopsided, toothy grins.<br>\r\n<br>\r\n\"I'll sue you over this!\" snapped your old body, her hand pushing down at what you assume is Alexandra's new, erect penis.<br>\r\n<br>\r\n\"Let me know when she calms down!\" you tell Janet before glaring at your old body and stepping through the doors and into the lobby of the building.<br>\r\n<br>\r\nOnce in the lobby you decide to...</span></div></div>",
            "created":1249275600,
            "id":739010,
            "title":"Mrs. Vandenburg (as Tim) awakes"
        },
        "11131":{
            "author_id":"anich1456",
            "author_name":"Shafiksz",
            "choices":[
                "Janet",
                "another woman"
            ],
            "content":"<div class=\"\"><div> <span>Since there was no one in the restroom you used this as an advantage. You started to slowly slip of your clothes. You realise how soft you skin was. Then you glanced down at your breast. They were very bouncy, big and soft. When you touched it you had a strange feeling as if u were excited yet not excited. It was an unexplainable feeling. When you were about to take of your bra someone walked in.......</span></div></div>",
            "created":1252126800,
            "id":755930,
            "title":"go to the restroom"
        },
        "111311":{
            "author_id":"drake010",
            "author_name":"penpal",
            "choices":[
                "janet is happy with the swap ",
                "janet is upset and wants her body back"
            ],
            "content":"<div class=\"\"><div> <span>janet walked in to the restroom and saw what you were doing.looks like you are starting to enjoy some feminine pleasure says janet .its not like that you reply.janet comes closer to you and she places the body switching machine in the table near you .listen tim this is a chance for us get anything we want in our life we can be anyone we want to be think of what we can do with this power says janet.you like the idea you pick up the device  and point it towards janet.janet smiles and you smile back the next moment you press the button and the swap happens </span></div></div>",
            "created":1252299600,
            "id":756940,
            "title":"Janet"
        },
        "1113111":{
            "choices":[
                "You tell her the truth.",
                "You make up something."
            ],
            "content":"<div class=\"\"><div> <span>Standing in front of you is Rachel inside Mrs. Vandenburg's body. She looks happy as she looks at her reflection in the mirror. <br>\r\n<br>\r\n\"Are you sure this is what you want?\" You ask Rachel to be sure. <br>\r\n<br>\r\n\"Of course this is what I want. Look at me, I'm Alexandra Vandenburg now, I'm a beautiful woman who is married to a senator. Look at this.\" She says pointing to her wedding ring. \"This is real diamond.\"<br>\r\n<br>\r\n\"Okay, okay. I'm glad you like it.\" You say backing off. You didn't know Rachel would be this excited. <br>\r\n<br>\r\n\"So how are we going to do things now?\" You ask Janet as she admires her new legs (you couldn't help be drawn to them too).<br>\r\n<br>\r\n\"The machine will only let you swap with them, right? Well, I'm pretty sure that \"I\" have some fairly interested contacts. I'll make sure to bring them to the lab and then we can swap you with them.\"<br>\r\n<br>\r\n\"That sounds pretty easy.\" You tell Janet.<br>\r\n<br>\r\n\"Most plans are easy, it's just that people think too much about them.\" Janet replies as she looks at you.<br>\r\n<br>\r\n\"Look we just go back in there and just pretend to be our bodies selves? What could go wrong?\" She asks you.<br>\r\n<br>\r\n\"The fact that Mrs. Vandenburg is still in my body.\" You tell her. <br>\r\n<br>\r\n\"Oh, don't worry about her. I know how to deal with her.\" Janet says brushing her hair.<br>\r\n<br>\r\nJanet leads the way back to the lab where she sees Mrs. Vandenburg standing there looking uncomfortable. \"I want to speak with Mr. Thorn in private.\" She says leading them back to the hallway. <br>\r\n<br>\r\n\"Wonder what they're talking about?\" Hilary asks you.</span></div></div>",
            "created":1445026980,
            "id":2048105,
            "title":"janet is happy with the swap "
        },
        "11131111":{
            "choices":[
                "You swap with Hilary.",
                "You don't swap with Hilary."
            ],
            "content":"<div class=\"\"><div> <span>You know that you can trust Hilary so you take her to the bathroom where you just went with Janet. There you explain her how you are Tim and how you first switched with Ms. Vandenburg and then with Janet. <br>\r\n<br>\r\n\"Wow, that is so cool. But why don't you switch back with Ms. Vandenburg?\" Hilary asks confused.<br>\r\n<br>\r\n\"Because then Ms. Vandenburg might figure out that Janet is in her body and might ruin it.\" You explain her.<br>\r\n<br>\r\n\"But you told me that Janet doesn't want to swap back now?\" Hilary asks even more confused than before.<br>\r\n<br>\r\n\"Well yes, I, I'm just curious about being a woman myself. I mean scientific purposes.\" You add seeing Hilary's gaze. <br>\r\n<br>\r\n\"Oh I know you want to look at Janet's body for yourself.\" Hilary says grinning.<br>\r\n<br>\r\n\"I do not. I just want to keep it safe and find out what the differences are. You know for research purposes.\" You explain yourself to Hilary though you suspect she have seen through you. <br>\r\n<br>\r\n\"I get it, but could I perhaps swap with Janet's body? I really want to try out being an older woman.\" Hilary asks you.<br>\r\n<br>\r\n\"I don't know.\" You hesitate. That would mean you would need to swap with Hilary.<br>\r\n<br>\r\n\"You can check out my body if you like, I don't mind.\" Hilary says pulling her shirt down a little showing off the straps of her bra.<br>\r\n<br>\r\n\"Hillary!\" You say out loud being embarrassed by this display.<br>\r\n<br>\r\n\"Just kidding. Though I wouldn't mind. So you're going to swap with me?\" Hilary asks.</span></div></div>",
            "created":1456512840,
            "id":2109881,
            "title":"You tell her the truth."
        },
        "11132":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Hillary",
                "Rachel"
            ],
            "content":"<div class=\"\"><div> <span>Walking outside you barely manage to avoid falling down.<br>\r\n<br>\r\n\"Damn its hard to walk in these things,\" you curse in Alexandra's firm voice.<br>\r\n<br>\r\nOnce outside you feel the cold February air on your exposed lower legs. Not only is is rather cold but lazy flakes of snow are drifting down from the heavens. You take a step forward and out from under the shelter of the building's small awning. Taking in a deep breath you begin to relax. You bite your new lip and manage a half hearted smile.<br>\r\n<br>\r\n\"Tim?\" you hear a quiet voice say behind you.<br>\r\n<br>\r\nYou reach out a manicured hand and rest it against the cold metal bike rack. Your other hand is in a fist, pressed against your lips and nose as you fight back tears.<br>\r\n<br>\r\n\"I'm not exactly Tim anymore,\" you blurt out, your new firm voice filled with much distress.<br>\r\n<br>\r\nYou slam your hand against a nearby car, causing its lights to start flashing. Falling to your knees you can't help it anymore.<br>\r\n<br>\r\nYou feel a hand come to rest on your shoulder. Turning to look up at it, Alexandra's business like face streaked with freezing tears and flecks of snow in her silky hair you see the sad face of ______ looking down at you.</span></div></div>",
            "created":1249275600,
            "id":737950,
            "title":"go outside"
        },
        "111321":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "She want you to go to her meeting as her",
                "she doesn't know what to do now"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm sorry,\" you whimper just moments before Hillary grabs you in a tight hug, her head leaning against yours, her dirty blond hair getting in your eyes.<br>\r\n<br>\r\n\"Tim,\" says Hillary, concern for you filling her young voice, \"Come inside! I'll help you clean up!\"<br>\r\n<br>\r\n\"Is she calmed down?\" you ask, done with your little crying fit for now.<br>\r\n<br>\r\n\"Yes Tim, she is much calmer now.\"<br>\r\n<br>\r\nYou agree to go with Hillary and just a few minutes later you are back in the laboratory, the tear lines cleaned off of your flawless face and the snow brushed out of Mrs. Vandenburg's old hair.<br>\r\n<br>\r\n\"So, Mrs. Vandenburg,\" you say smugly, your arms crossed just below your new bosom.<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"What do we do now?\"</span></div></div>",
            "created":1249275600,
            "id":737954,
            "title":"Hillary comforts you"
        },
        "1113211":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "go to the meeting calmly, pretending to be Alexandra",
                "freak out first"
            ],
            "content":"<div class=\"\"><div> <span>\"You've got to be kidding!\" you say before blurting out with laughter.<br>\r\n<br>\r\nMrs. Vandenburg appears to be most unsettled by your response.<br>\r\n<br>\r\n\"Is this meeting really that important to you?\" you ask, fighting back the laughter.<br>\r\n<br>\r\n\"Yes,\" is the deadpan response.<br>\r\n<br>\r\n\"And you think I'll be able to fool people into thinking that I'm you?\" you ask, pointing at your new bosom.<br>\r\n<br>\r\n\"You do look like her,\" states Jake.<br>\r\n<br>\r\n\"While you look like me,\" lectures Mrs. Vandenburg in your old body, her hands on her new hips, \"you'll have to try and be a bit more civilized than your normal immature self. Otherwise I think it would be better for you to stay here until you and your crew of nerds figure out how to reverse this.\"<br>\r\n<br>\r\nTaken aback by her insults you decide to...</span></div></div>",
            "created":1249362000,
            "id":738994,
            "title":"She want you to go to her meeting as her"
        },
        "11132112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "go to the meeting",
                "skip ahead to the end moments of the meeting"
            ],
            "content":"<div class=\"\"><div> <span>You straighten your back, throw back you head and look down the bridge of your feminine nose at Mrs. Vandenburg's new masculine form.<br>\r\n<br>\r\n\"You know what bitch?\" you yell at your old body, \"I've had enough of you and your holier than thou attitude. So guess fucking what! I'm going to that damned meeting of yours and you can bet you ducking ass that I will be acting, at the very least, exactly as I wound if I were still in my own damned body. Worst case scenario for you is that I act a hell of a lot worse.\"<br>\r\n<br>\r\n\"You wouldn't!!\" exclaims your old body, tears forming in the corner of its eyes.<br>\r\n<br>\r\n\"Like hell I wouldn't Missy! While I appreciate your financial assistance, I've had it with your pissy attitude. Research takes time and money! Live with it!\" you hiss, enjoying this opportunity to say what you had been tempted to say for all this time.<br>\r\n<br>\r\n\"Tim...\" says Janet, stepping towards you, hand outstretched.<br>\r\n<br>\r\n\"I'm sorry Janet but my father built this lab to do cutting edge research not to follow heel and toe behind some arrogant bastard,\" you explain, \"When I'm done doing my duties as Mrs. Vandenburg then I'll come back here and we'll see about getting me out of this damned body.\"<br>\r\n<br>\r\n\"I'm sorry Mr. Thorn! I really am!\" whimpers a weeping Alexandra, on her knees, begging to you.<br>\r\n<br>\r\n\"You're sorry? Like hell you're sorry! If this hadn't happened you'd have withdrawn all your damned funding and left us all to dry. You're just lucky that I'll send you back to your friggin body when this is done,\" you spit down at your former form.<br>\r\n<br>\r\n\"Tim! Stop!\" shouts Janet, her usually kind face filled with fear.<br>\r\n<br>\r\n\"I'm sorry Janet. I'm sorry,\" you say, your stern voice softening as you look into her eyes, \"I think I just needed to get that out of my system. I'm off to the meeting now, see you all soon.\"<br>\r\n<br>\r\n\"Mr. Thorn?\" asks Alexandra, her new eyes pleading for your help.<br>\r\n<br>\r\n\"Don't worry about it Alex!\" you say, back to your normal cheery self, \"I won't try to screw up your life too bad.\"</span></div></div>",
            "created":1249362000,
            "id":738995,
            "title":"Freaking out as Alexandra"
        },
        "111321121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "continue with the meeting",
                "skip ahead until a meal break"
            ],
            "content":"<div class=\"\"><div> <span>You gather a bit of information from the still panicked Mrs. Vandenburg and go out to her car. Sitting down in the driver's seat you flick off the high heels you had been wearing and start the engine. You then take a moment to gather your thoughts.<br>\r\n<br>\r\nTilting the rear view mirror so you can see your new, mascara lined, piercing Navy blue eyes. You look deep into the reflection of Alexandra's eyes and ponder your current situation.<br>\r\n<br>\r\nLooking back towards the lab you see Janet standing beside Hillary under the shelter of the awning. You smile and wave in their direction, straighten the mirror and back out of the parking stall. Taking off down the street you recall the address to which you are heading.<br>\r\n<br>\r\n\"The Huntman building,\" you say to yourself, \"that's on the other side of town, better take the Collins street bridge.\"<br>\r\n<br>\r\nAfter a half hour drive you arrive at the huntsman building where you are greeted by a rather tall, thin, spectacle wearing man. Getting out of the car, you are led by the men to the elevator.<br>\r\n<br>\r\n\"How was the demonstration madam?\" asks the man in a snivelly voice, \"Shall I withdraw the funds?\"<br>\r\n<br>\r\n\"No, that won't be necessary,\" you say, hoping that your tone of voice tricks the man into thinking that you actually are the person you appear to be.<br>\r\n<br>\r\n\"Certainly madam,\" replies the man curtly, his long, thin nose cutting through the air like a knife.<br>\r\n<br>\r\nWhen the elevator stops you wrench your gaze from the man's nose and follow him down the hall to an enormous meeting room. He then pulls out a chair for you and tilts his balding head towards you. Carefully walking over to the chair you sit down, noticing how the eyes of everyone in the room are following you. From the looks on some of the other people's faces, there are some who are watching out of a distinctly less professional and more personal interest.<br>\r\n<br>\r\n\"If you need me I'll be in my office madam,\" states the thin man before abruptly turning and exiting the room.<br>\r\n<br>\r\n\"Shall we begin?\" says a booming voice as you look at the other people seated at the table.<br>\r\n<br>\r\nYou turn to face the source of the voice and see an older, bald gentleman dressed in a black business suit and sporting a goatee.<br>\r\n<br>\r\n\"Certainly,\" came the reply from the person seated opposite you.<br>\r\n<br>\r\n</span></div></div>",
            "created":1249362000,
            "id":739022,
            "title":"go to the meeting"
        },
        "1113211211":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "stand up and look out the window",
                "try to pay attention to what people are saying"
            ],
            "content":"<div class=\"\"><div> <span>Overall you find the meeting to be rather dull. After a few minutes seated at the table with sombre discussion of the minutes of the last meeting you noticed that the gentleman opposite you was peering under the table in a curious manner. Looking at him quizzically you wonder what he is looking at until you realize that you had been sitting in a most unladylike manner. Bringing your knees together you smirk as a look of dissapointment flashes across his face. He then looks up at you and blushes.<br>\r\n<br>\r\nRolling your eyes you turn to look at the gentleman beside you, who happens to be speaking at the moment. He was rather short, his head barely making past your new shoulders and spoke in a thick Australian accent. His flattened, round hear is adorned with thick red hair and on his finger he wore a wedding band.<br>\r\n<br>\r\n\"What do you think Mrs. Vandenburg?\" asks the man with the booming voice.<br>\r\n<br>\r\nStartled you turn to look at him, you realize that you hadn't been paying any attention.<br>\r\n<br>\r\n\"I think Mr. uhh...\" you start to say, motioning towards the man beside you.<br>\r\n<br>\r\n\"Bigland,\" assists your neighbour, tilting his head in your direction.<br>\r\n<br>\r\n\"Yes, Mr. Bigland had a very interesting point,\" you lie, having no idea what this Mr. Bigland had been saying.<br>\r\n<br>\r\n\"Why thank you ma'am,\" says Mr. Bigland before launching off back into a long monologue.<br>\r\n<br>\r\nImpatient for the meeting to end you...</span></div></div>",
            "created":1249362000,
            "id":739034,
            "title":"continue with the meeting"
        },
        "11132112111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Return to the table",
                "stay by the window"
            ],
            "content":"<div class=\"\"><div> <span>Waiting until Mr. Bigland had finished his speech, you stand up and wander over to the window.<br>\r\n<br>\r\n\"Is everything alright ma'am?\" asks the man with the booming voice, already to his feet and turning to face you.<br>\r\n<br>\r\nLooking back at the man over your shoulder you shake your head and say, \"Its quite alright, I'm simply looking out the window. Continue on, I can hear you.\"<br>\r\n<br>\r\nWhen the men resume their discussion, you smile at how well you had seemed to imitate the actions of your current body's original owner. Looking back out the window you watch as snowflakes lazily drift down to the streets of your hometown. As a young boy, you had always loved the winter months. You had enjoyed building snowmen, running after jack rabbits and sliding down hills with your sled.<br>\r\n<br>\r\n\"I wonder if Mrs. Vandenburg ever did anything like that,\" you think to yourself as you watch the hypnotic dance of the snowflakes through the glass.<br>\r\n<br>\r\nYou take a step back and try and focus on your faded reflection in the window. Having always been busy with research you had never gotten the chance to really look at the body of your chief investor.<br>\r\n<br>\r\n\"Never thought I'd be looking her over from this point of view,\" you whisper to your new body so that no one else can hear.<br>\r\n<br>\r\nNow that you had the chance, you couldn't help but admit that Mrs. Vandenburg was actually quite a beautiful woman.<br>\r\n<br>\r\n\"Just wish she wasn't so pushy all the time,\" you think as you feel some moistness form in your crotch. Smirking, knwoing gull well what the moistness meant, you jokingly whisper, \"Hah! There I go, getting her all hot and bothered again!\"</span></div></div>",
            "created":1249362000,
            "id":739064,
            "title":"stand up and look out the window"
        },
        "111321121112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "a tray of caviar and crackers and a bottle of Vodka",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you stand by the window, you manage to avoid answering too many questions. After what seemed like an eternity the meeting is interrupted by some people coming in with...</span></div></span></div>",
            "created":1249362000,
            "id":739089,
            "title":"stay by the window"
        },
        "1113211211122":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "A birthday cake",
                "guns, it is a hostage taking",
                "files and charts"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did they enter with?</span></div></span></div>",
            "created":1249362000,
            "id":739091,
            "title":"something else was being carried by the people"
        },
        "11132112111221":{
            "author_id":"cjones2009",
            "author_name":"caleb jones",
            "choices":[
                "In the fancy rich bedroom, you strip & explore when her husband walks in!",
                "You find your former body on the couch, exploring your lost manhood..."
            ],
            "content":"<div class=\"\"><div> <span>They roll in a cart with a birthday cake with dozens of candles, far more than your last birthday cake, and everyone starts singing, wishing Alexandra a happy birthday.<br>\r\n<br>\r\nAnd she was you for now!  You were given the first piece of cake and soon everyone had a piece, toasting you wit the cake as if it were a glass of champagne.  Speaking of which, someone popped a cork and champagne was distributed among all of you.  <br>\r\n<br>\r\nYou looked at the alcohol and figured what the heck.  You were a grownup woman now and you downed the whole glass.  <br>\r\n<br>\r\nEveryone cheered you on as you chugged it down.  <br>\r\n<br>\r\nThe meeting and celebration over, you drove to your new home.  You wanted a little time alone with your new curvy body!<br>\r\n<br>\r\n</span></div></div>",
            "created":1491027360,
            "id":2298045,
            "title":"a birthday cake!"
        },
        "111321121112211":{
            "author_id":"cjones2009",
            "author_name":"caleb jones",
            "choices":[
                "let him have his way with you...",
                "Grab your abandoned clothes and run to get your body back!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Honey! I'm home!\"<br>\r\n<br>\r\nYou jump up to your feet in shock, dropping the skirt and bloouse you had just removed. Who the heck is that? <br>\r\n<br>\r\nYour eyes catch a glimpse of the man in the mirror and then you spot a picture of him and your new body on the bureau. Mrs V. is all decked out in white. It's a wedding gown! Then this must be her husband. Oh Crap! you think to yourself...<br>\r\n<br>\r\nThe man puts his coat away and walks toward you. he gets closer and closer and.... Too close! His arms surround you and he plants his hungry lips on yours! You want to shove him away but somehow your traitorous new body refuses. You realize the kiss is... not bad? Your new boobs feel very nice as they are smashed against his hard firm chest. His hands lower to your wide rear end and he gives you a gentle squeeze. You were strangely beginning to enjoy it when he lets go. and leads you dressed only in a bra and panties and high heels to the dining room.<br>\r\n<br>\r\nHe heads to the kitchen and makes you both a superb dinner. You get the smaller steak but it is more than enough to fill you up. Champagne flows again! <br>\r\n<br>\r\nYou both start to put the dishes in the sink only to feel his big strong arms wrap around you from behind, until both hands begin to grope your new chest melons. That made you weak in the knees!<br>\r\n<br>\r\nHe lifts you up in the air as if you barely weighed anything and heads back into the bedroom. he gently tosses you on the king sized bed and slides in next to you.  More kissing ensues...<br>\r\n<br>\r\nYou were feeling strange feelings of attraction towards him but that was wrong.  He and you were both male. Looking down at your new female body you realized you were now all woman! He gently began to undress the rest of your body, settig your boobs free.  Your nipples swell suddenly, either from the cold or the excitement!<br>\r\n<br>\r\nYour mind says no but your body is saying \"yes, yes YES!\"<br>\r\nWhat do you do now!!!</span></div></div>",
            "created":1491028260,
            "id":2298052,
            "title":"In the fancy rich bedroom, you strip & explore ..."
        },
        "11133":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Rachel comes to talk with you",
                "you do something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You collapse into one of the chairs and lean your head back, looking up at the fluorescent lights.<br>\r\n<br>\r\n\"What the hell am I doing here?\" you ask to no one in particular.</span></div></span></div>",
            "created":1249534800,
            "id":740216,
            "title":"relax in one of the chairs"
        },
        "111331":{
            "choices":[
                "You agree. Being Mrs. Vandenburg makes sense right now",
                "You shake your head. There's no way you're staying in this body"
            ],
            "content":"<div class=\"\"><div> <span>\"How are you feeling Tim?\" Rachel asks as she walks over. <br>\r\n<br>\r\nYou sigh. \"About as well as could be expected considering I've just been turned into Mrs. Vandenburg. Ten minutes ago I was a single 25 year old guy working on a mind-reading machine. And now...\" You gesture to your new body to make the point. Rachel gives a comforting smile, silently saying <i>I understand</i>. \"Can we get the machine to switch us back?\" You ask. \"I'd like to, you know, <b>not </b>be her.\"<br>\r\n<br>\r\n\"About that.\" Rachel slides into the chair next to you and puts a hand on your arm comfortingly. \"Janet, Jake, and I were talking. Jake thinks he knows how it happened. He could probably reproduce the event and get you back to your original bodies without a problem.\"<br>\r\n<br>\r\n\"Oh thank god.\"<br>\r\n<br>\r\n\"But we'd rather you didn't.\" Rachel cuts your relief short. You eye her with a bewildered look and she continues. \"Tim, you know how short our funding is. We're barely scraping by right now, and Mrs. Vandenburg is sure to cut us off entirely after all of this. But right now, <b>you're</b> Mrs. Vandenburg. You've got the influence and the control of the purse strings to not just keep our lab funded, but to increase our funding dramatically. Double it, or even triple it! Think of what that would mean for our projects. Think of what that would mean to your late father.\"<br>\r\n<br>\r\n\"I doubt my father would approve of me becoming a middle-aged woman,\" you interject blithely.<br>\r\n<br>\r\nRachel squeezes your arm lightly. \"Maybe Tim, it wouldn't be permanent. Just until we could secure enough funding for a couple more years and make sure Mrs. Vandenburg couldn't cut it off. Then we'd get you back to your old self and everything will be back to normal. What do you say?\"</span></div></div>",
            "created":1291568280,
            "id":1008898,
            "title":"Rachel comes to talk with you"
        },
        "1113311":{
            "choices":[
                "Pass on that, but hang around",
                "Decide to talk to Alexandra yourself"
            ],
            "content":"<div class=\"\"><div> <span>\"If I do this...\" You pause as Rachel's face begins beaming with excitement. \"<b>If </b>I do this, I'm going to need some help. I don't know how to be a woman, much less Mrs. Vandenburg.\"<br>\r\n<br>\r\nThat is all the answer Rachel needs, as she immediately jumps forward and hugs you tightly. \"You're the best, Tim! Erm, I guess it's Alexandra now!\" She chuckles a little.<br>\r\n<br>\r\n\"I'll never get used to that...\"<br>\r\n<br>\r\nThe both of you stand, which is still a bit disorienting for you given that you are currently wearing heels. <i>Horribly uncomfortable</i>, you note to yourself. Maybe she knows what you're thinking, as she says, \"don't worry Tim, I'll help you get used to all the girl things you need to know. In a week or two you might make a better Alexandra Vandenburg than she ever did.\" You audibly groan at the suggestion, something which does nothing to diminish the permanent smile etched in her face.<br>\r\n<br>\r\n\"So what now?\"<br>\r\n<br>\r\n\"Oh, we've already talked about a couple excuses we can make to Mrs. Vandenburg about why we can't return you two to your bodies yet. Don't worry about that, Jake and I will tell her. Unless you want to do it yourself?\"</span></div></div>",
            "created":1308699900,
            "id":1131429,
            "title":"You agree. Being Mrs. Vandenburg makes sense ri..."
        },
        "11133112":{
            "choices":[
                "head to a board meeting",
                "retire to her apartment"
            ],
            "content":"<div class=\"\"><div> <span>It was a conversation that went about as well as you hoped, which is to say terribly. \"What do you mean it could take months for this machine to be repaired!?\" screamed Mrs. Vandenberg. \"What kind of incompetent morons are you all? I want out of this disgusting body and back in mine now!\"<br>\r\n<br>\r\nYou've never seen yourself from a third-party perspective before, and you could only assume 'you' looked better normally than 'you' do right now, with Mrs. Vandenberg letting loose all her anger and rage. It's a frightening sight, actually; you grow concerned she might throw something. Plus, she's training all her anger on you, as if she knows you are lying and planning to steal her life for the short term.<br>\r\n<br>\r\n\"I'll sue you all!\" She threatens. \"I'll bankrupt every one of you!\"<br>\r\n<br>\r\nThis had gone on long enough. \"Mrs. Vandenberg!\" You snapped, a scowl across your borrowed face and your hands on your hips in an intimidating manner much like you'd often seen Mrs. Vandenberg herself do. \"I've had enough of your threats. If you sue and bankrupt us, we'll never be able to afford to fix this device and return you to your own body. Is that what you want. <i>Is it</i>?\"<br>\r\n<br>\r\nShe barely mumbled out a 'no' before you continued. \"Now understand, this was an accident. The only reason we were even testing out this device today was because YOU rushed us and insisted we do so. Well, now here's the result. I'm stuck as you and you are stuck as me until we fix this. Now you can shout and pout and throw a fit all you want, but it doesn't make a damn difference for as long as that thing isn't working. Do you understand?\"<br>\r\n<br>\r\n\"I... I suppose you are right,\" she says with defeat in her voice.<br>\r\n<br>\r\n\"In the meantime, I'll need to keep appearances as you. I'll do my best, I swear. Just stay calm and we'll have this fixed in no time,\" you reassure her. After a more private conversation with her filling you in on what you can expect in your day-to-day life as her (her seething anger still very visible the entire time you both talked), you excuse yourself to-</span></div></div>",
            "created":1312131780,
            "id":1158639,
            "title":"A harsh dialogue"
        },
        "111331122":{
            "author_id":"ergoiam",
            "author_name":"Bytheway",
            "choices":[
                "You change into normal clothing",
                "Mrs. Vanderburg's husband arrives home"
            ],
            "content":"<div class=\"\"><div> <span>It's one thing to have suddenly gone from a man in his mid-twenties to a woman in her mid-thirties, but to then immediately attend business meetings as her? That's a bridge too far. You need time to adjust.<br>\r\n<br>\r\nCalling her assistant, you explain that you aren't feeling well and want more time to review the lab's finances. \"Please reschedule us two days from now,\" you say, marveling at how authoritative your borrowed voice sounds. <br>\r\n<br>\r\nThen you climb into her Cadillac, trying not to notice either Mrs. Vanderburg's dark glaring at you or Rachel's deeply bemused face. You've never been in such a nice car before and it should've been a more enjoyable drive, but you have a hard time handling the gas and brakes in these stilettos. \"How do women do this?\" You ask aloud.<br>\r\n<br>\r\nBut then you're at Mrs. Vanderburg's apartment building, and a valet takes you keys from you at the pull-in. \"Same spot as usual, m'am?\" He asks.<br>\r\n<br>\r\n\"Certainly,\" you respond, and then belatedly realize you are meant to tip him. Without seeing the denomination, you pull out the first bill you can find in your purse and hand it to him. Apparently, it's more than the right amount, because his face lights up and he says, \"Thank you, m'am!\" before pulling the car into this building's parking garage.<br>\r\n<br>\r\n\"He called me m'am,\" you think. \"Another thing to get used to, but... I kind of like the sound of it.\" You've never been treated all that respectfully before. It's a nice change.<br>\r\n<br>\r\nAlexandra's apartment is the penthouse suite at the top of the building, and you get a little nervous as the elevator number keeps climbing. Floor 25, 30, 35... But when the door slides open at the 42nd floor and you unlock the apartment door, you're taken aback by what you see. This space is incredible! The open living room stretches for most of the floor, with a fancy kitchen at one end and tastefully decorated sofas and bookshelves on another. But more impressive is the view. Two walls are floor-to-ceiling glass, and you can see a huge part of the city from here. It's <i>amazing</i>.<br>\r\n<br>\r\nYou slip off your heels, which your feet are most thankful for, and walk gingerly around the apartment, exploring every detail. From the crystal wine classes to the smooth kitchen counters to the designer armchair sitting just below a Picasso painting, this entire place reeks of wealth. And for the moment it is yours.<br>\r\n<br>\r\nIt's still early in the day, but you're feeling a little overwhelmed and have the sudden urge for a drink. You pick a bottle from the wine rack - \"Malbec, aged 25 years. Must be good, right?\" - and pour a generous amount into one of those crystal glasses. Then you situate yourself onto the sofa and have a drink to the view. One glass turns to a second, and before long you've had half the bottle and are feeling a strange mixture of bewilderment, nervousness, and outright giddiness. You are Alexandra Vanderburg. How on earth did this happen?<br>\r\n<br>\r\nYou lay across the couch, taken in awe by the thought. Her business clothes fold awkwardly around you. \"Perhaps I should get out of these before I ruin them,\" you say.<br>\r\n<br>\r\n</span></div></div>",
            "created":1445711940,
            "id":2051942,
            "title":"retire to her apartment"
        },
        "1113311222":{
            "author_id":"cjones2009",
            "author_name":"caleb jones",
            "choices":[
                "You help out by undressing him until you are both ready for a 'good night!'",
                "You pretend to cry and run off into the bathroom until you think of a way out! "
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Honey!  I'm home!\"<br>\r\n<br>\r\nYou jump up to your feet in shock.  Who the heck is this?<br>\r\nYour eyes catch a glimpse of the man in the hall mirror and then you spot a picture of him and your new body on the wall.  Mrs V. is all decked out in white.  It's a wedding gown!  Then this must be her husband.  Oh Crap!<br>\r\n<br>\r\nThe man puts his coat away and walks toward you.  he gets closer and closer and....  Too close!  His arms surround you and he plants his lips on yours!  You want to shove him away but somehow your traitorous new body refuses.  You realize the kiss is... not bad?  Your new boobs feel very nice as they are smashed against his hard firm chest.  His hands lower to your wide rear end and he gives you a gentle squeeze.  You were strangely beginning to enjoy it when he lets go.  <br>\r\n<br>\r\nHe heads to the kitchen and makes you both a superb dinner.  You get the smaller steak but it is more than enough to fill you up.<br>\r\n<br>\r\nYou start to put the dishes in the sink only to feel his big strong arms wrap around you from behind, untill both hands begin to grope your new melons. That made you weak in the knees!<br>\r\n<br>\r\nHe lifts you up in the air as if you barely weighed anything and heads into another room.  A room with a... king sized bed?<br>\r\n<br>\r\nYou were feeling strange feelings of attraction towards him but he and you were both male.  Only looking down at your new body you realized you were now all woman!  He gently placed you on the floor again beside the bed and began to undress your body!<br>\r\n<br>\r\nYour mind says no but your body is saying yes, yes YES!<br>\r\nWhat do you do now!!!</span></div></div>",
            "created":1473924360,
            "id":2210387,
            "title":"Mrs. Vanderburg's husband arrives home"
        },
        "113":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "running after Mrs. Vandenburg",
                "running to the bathroom",
                "collapsing into a chair"
            ],
            "content":"<div class=\"\"><div> <span>\"Ready Janet?\" you ask, carefully pointing the antennae at her.<br>\r\n<br>\r\n\"Ready Tim,\" replies Janet, grinning at you, \"I sure hope this works!\"<br>\r\n<br>\r\n\"Me too,\" you say just before throwing the switch.<br>\r\n<br>\r\nYou feel a strange tingling sensation throughout your body and see Janet step back as though in shock before blacking out.<br>\r\n<br>\r\nWhen you come to, you find yourself looking up at Carl, who is offering you a hand to stand back up, and Mrs. Vandenburg. Once back in a standing position, Mrs. Vandenburg turns to go.<br>\r\n<br>\r\n\"I think I've seen enough!\" snapped Mrs. Vandenburg, standing by the door, \"I'll have my accountants contact you Miss Pearl.\"<br>\r\n<br>\r\n\"C'mon lassie! Go do your stuff!\" urges Carl, giving you a slight push towards the door.<br>\r\n<br>\r\n\"Wha-\" you begin to say and then notice your unusual yet familiar voice.<br>\r\n<br>\r\nYou look down and see the fit body of Janet where you would normally expect to find your own.<br>\r\n<br>\r\n\"How?\" you ask in Janet's voice before...</span></div></div>",
            "created":1249189200,
            "id":737578,
            "title":"Janet"
        },
        "1131":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Tell her to come back for another demo later that week",
                "Tell her to come back for another demo and be the subject this time",
                "tell her you are actually Tim and that the machine caused a body swap"
            ],
            "content":"<div class=\"\"><div> <span>\"Mrs. Vandenburg!\" you shout out in Janet's voice.<br>\r\n<br>\r\n\"Miss Pearl,\" was the cold reply, \"The only way you will be able to stop me from withdrawing funding from your pitiful little lab is to convince me that you have something of value to offer.\"</span></div></div>",
            "created":1249448400,
            "id":739105,
            "title":"running after Mrs. Vandenburg"
        },
        "11312":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "I am willing to do it",
                "I am far to busy for this nonsense. Goodbye."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Miss Pearl, I fail to see what this could accomplish,\" came Mrs. Vandenburg's reply to your request, \"but if you truly believe that I'll be swayed by another failed demonstration then you must know that\"</span></div></span></div>",
            "created":1249448400,
            "id":739108,
            "title":"Tell her to come back and be the subject this time"
        },
        "113121":{
            "author_id":"drake010",
            "author_name":"penpal",
            "choices":[
                "janet or mary",
                "something wrong"
            ],
            "content":"<div class=\"\"><div> <span>very well then i will give you one more chance said mrs. vandenburg.thank you was your reply.with this you place mrs.vandenberg as the controller and places mary as the test subject. with the still confused tim(janet)looking at you . you tell mrs.vandenberg to hit the switch and she presses it</span></div></div>",
            "created":1262944560,
            "id":817386,
            "title":"I am willing to do it"
        },
        "113122":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "you stay silent",
                "the two of you talk about what might have happened"
            ],
            "content":"<div class=\"\"><div> <span>You run out after her and stand by her car window.<br>\r\n<br>\r\n\"Miss Pearl, I do believe I have already said goodbye to you. My accountants will be in touch. Do not make me add in my Lawyers along with a harassment charge,\" hissed Mrs. Vandenburg before driving off.<br>\r\n<br>\r\n\"No,\" you whimper in Janet's voice, \"What about the lab... What about me...\"<br>\r\n<br>\r\n\"Funny, that is about what I'd have said right then,\" you hear a familiar male voice say.<br>\r\n<br>\r\nTurning around you see your old body, a jacket over its arm, a grin on its face.<br>\r\n<br>\r\n\"Janet?\" you ask shyly.<br>\r\n<br>\r\n\"Tim?\" came the slightly scared reply.<br>\r\n<br>\r\n\"I'm sorry Janet! I don't know how this happened...\" you begin but she places one of your old fingers against her old lips.<br>\r\n<br>\r\n\"How about we go for a short walk?\" asks Janet, offering you the jacket on her arm.<br>\r\n<br>\r\nFinally realizing exactly how cold it was, you take the jacket and put it on. You and Janet then start to walk down the street, the fluffy snowflakes drifting down into your new hair. Throughout the walk...</span></div></div>",
            "created":1249448400,
            "id":739111,
            "title":"I am far to busy for this nonsense. Goodbye."
        },
        "1131221":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "the lab",
                "somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>After a few dozen yards, you feel an arm go around your thin new waist. Leaning your head against Janet's new shoulder you wonder what could have caused this swap to happen. After a short while Janet stops and looks at you. She then fights back tears and stomps off in the direction of...</span></div></div>",
            "created":1249448400,
            "id":739113,
            "title":"you stay silent for your walk in the snow"
        },
        "11312212":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "back to the lab",
                "follow Janet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As it seems like Janet may want some time alone, do you follow her or go back to the lab?</span></div></span></div>",
            "created":1249448400,
            "id":739116,
            "title":"somewhere else"
        },
        "1133":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Janet (as Tim)",
                "Rachel, to Janet (as Tim)",
                "Jake, to Janet (as Tim)"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't just sit there!\" freaks Carl before running off after Mrs. Vandenburg himself.<br>\r\n<br>\r\n\"Tim?\" you hear a familiar voice say.<br>\r\n<br>\r\nLooking towards the source you see that your old body is awake and that the voice you heard was that of...</span></div></div>",
            "created":1249275600,
            "id":738022,
            "title":"collapsing into a chair"
        },
        "11332":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Jake",
                "Hillary"
            ],
            "content":"<div class=\"\"><div> <span>Swivelling around you look into the shiny metal surface of the counter at your new reflection. What you saw looking back at you was the gentle face of Janet, your friend and the lab's accountant. Her brown hair done was up in a ponytail that now lay limp done what used to be her back. Her kind eyes from which you saw your new self were slightly sad and didn't show the warmth to which you were accustomed to see in them.<br>\r\n<br>\r\n\"Janet?\" you hear a voice say behind you.<br>\r\n<br>\r\nTurning around you lock eyes with...</span></div></div>",
            "created":1249275600,
            "id":738027,
            "title":"Your new reflection as Janet"
        },
        "114":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Hillary's (as Tim) POV",
                "Tim's (as Hillary) POV",
                "Jake's POV"
            ],
            "content":"<div class=\"\"><div> <span>\"You ready?\" you ask Hillary, you hand resting on the switch.<br>\r\n<br>\r\n\"Flip the switch Tim!\" exclaims the excited young girl.<br>\r\n<br>\r\n\"Okay then!\" you reply as you flip the switch.<br>\r\n<br>\r\nYou suddenly feel a strange tingling sensation and then black out.</span></div></div>",
            "created":1249275600,
            "id":737958,
            "title":"Hillary volunteers"
        },
        "1142":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "pretend to be Hillary until you figure this out",
                "tell him you are Tim",
                "faint again"
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes to the sight of Jake Kneeling beside you.<br>\r\n<br>\r\n\"You okay?\" he asks you.<br>\r\n<br>\r\nNot quite sure what your answer should be you reach up to wipe your eyes and brush something unexpected on your chest. Looking downwards you see the body of Hillary where you had gotten used to seeing your own body.<br>\r\n<br>\r\n\"What the?\" you say in Hillary's voice.<br>\r\n<br>\r\n\"Hillary?\" asks Jake, helping you up to a sitting position.<br>\r\n<br>\r\nYou turn to face Jake, your new, young face showing some fear and confusion.<br>\r\n<br>\r\n\"Are you okay?\" asks Jake, gripping you by the shoulders.</span></div></div>",
            "created":1249275600,
            "id":738019,
            "title":"Tim's (as Hillary) POV"
        },
        "11422":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm not Hillary,\" you reply to Jake's query.<br>\r\n<br>\r\n\"What do you mean you are not Hillary?\" asks Jake, pulling back his hands.<br>\r\n<br>\r\nUsing a chair you stand up on your new feet. You then brush yourself off and turn back to face Jake.<br>\r\n<br>\r\n\"Jake, you are not going to believe this,\" you say thinking how strange it must be for Jake to be having this conversation with his sister's body.<br>\r\n<br>\r\n\"Who the hell are you?\" demands Jake, backing up against a table.<br>\r\n<br>\r\n\"Jake! Relax!\" soothes Janet, coming over to stand beside Jake, \"What's wrong?\"<br>\r\n<br>\r\n\"Its me, Tim,\" you say, shrugging your new shoulders.<br>\r\n<br>\r\n\"Hillary? Are you alright?\" asks Janet, her face suddenly wrought with worry.<br>\r\n<br>\r\n\"I told you, I'm Tim! Not Hillary!\" you blurt back.<br>\r\n<br>\r\nYou turn around and slam your hand down on a table in frustration. Did you accidentally activate the device?</span></div></div>",
            "created":1249448400,
            "id":739599,
            "title":"Tim admits to be Hillary"
        },
        "114221":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "choices 1-4",
                "choices 5-6"
            ],
            "content":"<div class=\"\"><div> <span>Who were swapped? (remember, 1 in front of antennae, 1 in front of screen)<br>\r\n<br>\r\nChoices:<br>\r\n1. Rachel and Jake.<br>\r\n2. Carl and Janet.<br>\r\n3. You (as Hillary) and Janet.<br>\r\n4. You (as Hillary) and Jake.<br>\r\n5. Mrs. Vandenburg and Jake.<br>\r\n6. Mrs. Vandenburg and Janet.<br>\r\n7. Mrs. Vandenburg and Carl.<br>\r\n8. Mrs. Vandenburg and You (as Hillary).</span></div></div>",
            "created":1249448400,
            "id":739601,
            "title":"You caused another swap"
        },
        "1142211":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "choice 1 or 2",
                "choice 3 or 4"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choices:<br>\r\n1. Rachel and Jake.<br>\r\n2. Carl and Janet.<br>\r\n3. You (as Hillary) and Janet.<br>\r\n4. You (as Hillary) and Jake.</span></div></span></div>",
            "created":1249448400,
            "id":739602,
            "title":"choices 1-4"
        },
        "11422111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Rachel and Jake",
                "Carl and Janet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>1. Rachel and Jake.<br>\r\n2. Carl and Janet.</span></div></span></div>",
            "created":1249448400,
            "id":739609,
            "title":"choice 1 or 2"
        },
        "114221111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "demonstrate by swapping him with someone",
                "explain to Carl what happened"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, Jake and Rachel collapse. You also spot your body, laying unconscious on the ground under the prone body of Rachel. After a few moments, Rachel's body stirs.<br>\r\n<br>\r\n\"What the...\" you hear Rachel's body say before standing up.<br>\r\n<br>\r\n\"Hi Jake, believe me now?\" you saw to Jake from behind your cheery teenaged eyes.<br>\r\n<br>\r\nYou then notice Rachel (as Jake) and Hillary (as Tim) starting to wake up.<br>\r\n<br>\r\n\"Tim?\" asks Jake, stepping towards you, \"What the hell is going on?\"<br>\r\n<br>\r\n\"Beats me!\" you reply before going over to a thoroughly confused Hillary.<br>\r\n<br>\r\nAs Jake and Rachel step towards eachother you bend down and grab Hillary's arm.<br>\r\n<br>\r\n\"Come on Hillary! Up and at 'em!\" you say, helping the new Tim to her feet.<br>\r\n<br>\r\n\"Tim?\" asks Hillary, confused as to why she is in your body.<br>\r\n<br>\r\n\"Yuppers!\" you joke, enjoying the extra energy you seem to have in Hillary's old body. You then point at the newly breasted Jake and be-dicked Rachel and say, \"And meet Jake and Rachel, now played by eachother.\"<br>\r\n<br>\r\n\"Can anyone tell me why my lab seems to have gone crazy?\" demands Carl, looking around at everyone.</span></div></div>",
            "created":1249448400,
            "id":739646,
            "title":"Rachel and Jake swapperoo"
        },
        "1142211111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Mrs. Vandenburg",
                "Janet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Grabbing the device, you turn it so that the screen points at Carl and the antennae point at...</span></div></span></div>",
            "created":1249448400,
            "id":739647,
            "title":"demonstrate by swapping him with someone"
        },
        "11422111111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Mary and Janet have switched too",
                "Hillary (as Tim) is holding Mary away from the device"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Carl and Alexandra slump to the floor, Mary runs over and pushes you aside, your hand brushes the device and you hit your head on a chair and pass out.<br>\r\n<br>\r\nWhen you come to...</span></div></span></div>",
            "created":1249448400,
            "id":740218,
            "title":"Mrs. Vandenburg and Carl exchange places"
        },
        "11422112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "You (as Hillary) and Janet",
                "You (as Hillary) and Jake"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>3. You (as Hillary) and Janet.<br>\r\n4. You (as Hillary) and Jake.</span></div></span></div>",
            "created":1249448400,
            "id":739608,
            "title":"choice 3 or 4"
        },
        "1142212":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "choice 5 or 6",
                "choice 7 or 8"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>5. Mrs. Vandenburg and Jake.<br>\r\n6. Mrs. Vandenburg and Janet.<br>\r\n7. Mrs. Vandenburg and Carl.<br>\r\n8. Mrs. Vandenburg and You (as Hillary).</span></div></span></div>",
            "created":1249448400,
            "id":739603,
            "title":"choices 5-6"
        },
        "11422121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Mrs. Vandenburg and Jake",
                "Mrs. Vandenburg and Janet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>5. Mrs. Vandenburg and Jake.<br>\r\n6. Mrs. Vandenburg and Janet.</span></div></span></div>",
            "created":1249448400,
            "id":739607,
            "title":"choice 5 or 6"
        },
        "11422122":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Mrs. Vandenburg and Carl",
                "Mrs. Vandenburg and You (as Hillary)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>7. Mrs. Vandenburg and Carl.<br>\r\n8. Mrs. Vandenburg and You (as Hillary).</span></div></span></div>",
            "created":1249448400,
            "id":739605,
            "title":"choice 7 or 8"
        },
        "12":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Mrs. Vandenburg",
                "Rachel",
                "Janet",
                "Hillary"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was the test subject?</span></div></span></div>",
            "created":1249189200,
            "id":737558,
            "title":"swap personalities"
        },
        "121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Rachel asks you what is wrong",
                "Mrs. Vandenburg leaves for her meeting",
                "You try again with another test subject"
            ],
            "content":"<div class=\"\"><div> <span>\"Ready Mrs. Vandenburg?\" you ask, carefully pointing the antennae at her.<br>\r\n<br>\r\n\"Get this over with will you?\" hisses back your investor, anxious to get to her meeting.<br>\r\n<br>\r\nYou throw the switch and feel a strange tingling sensation.<br>\r\n<br>\r\n\"So?\" asks Mrs. Vandenburg, her posture suddenly much worse and mood much calmer.<br>\r\n<br>\r\n\"I'll let you know when this works!\" you hiss, straightening your posture and brushing your hair back into place.<br>\r\n<br>\r\n\"Hey,\" blurts Alexandra, now slumped over in a chair, \"can't you be polite for once?\"<br>\r\n<br>\r\n\"I'll be polite when it suits me,\" you hiss back, straightening out your clothes and holding your head a bit higher.</span></div></div>",
            "created":1249189200,
            "id":737567,
            "title":"Mrs. Vandenburg"
        },
        "1211":{
            "choices":[
                "Rachel figures that you two must have switched personalities",
                "No one can figure out what happened",
                "Rachel suggest you redo the test run on the machine"
            ],
            "content":"<div class=\"\"><div> <span>You shake your head in disbelief that someone of Alexandra Vandenburg's caliber would even dare to talk to you this way.  Just as you are about to launch a verbal tirade to put you back in her place, Rachel interrupts you \"Hey, Dr. Thorn, are you feeling alright?\".<br>\r\n<br>\r\nFeeling extremely irritated, you think to yourself 'What is up with these people, don't they know they work for me?\".  Trying to compose yourself, you reply as politely as you can (which isn't very polite at all) \"Yeah, I feel just fine\".  You then point at Mrs. Vandenburg \"Can't you get her out of here.  People like her disgust me.\".<br>\r\n<br>\r\nEveryone in the room is taken aback at your sudden change in demeanor, but are even more shocked by Mrs. Vandenberg's reaction of crying over what you just said.</span></div></div>",
            "created":1263812700,
            "id":822063,
            "title":"Rachel asks you what is wrong"
        },
        "1213":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "try the device again with you still as the controller",
                "try the device with some one else as the controller (tim still flips the switch)",
                "take a break"
            ],
            "content":"<div class=\"\"><div> <span>Jake moves in to stand opposite to you and you flip the switch again.<br>\r\n<br>\r\n\"Did it work?\" demands Jake.<br>\r\n<br>\r\n\"Nope!\" you reply cooly.<br>\r\n<br>\r\n\"Well Fuck!\" snaps Jake as he storms out of the room and then the building.<br>\r\n<br>\r\n\"I have a meeting to go to, is it okay if I leave?\" asks Mrs. Vandenburg shyly.<br>\r\n<br>\r\n\"Sure, you can go,\" you reply, gazing off into the distance.<br>\r\n<br>\r\nAs the door closes again you decide to...</span></div></div>",
            "created":1249275600,
            "id":737962,
            "title":"You try again with another test subject"
        },
        "12131":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Hillary or Mary",
                "Janet or Rachel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who stood opposite to you?</span></div></span></div>",
            "created":1249275600,
            "id":737963,
            "title":"try the device again with you still as the cont..."
        },
        "121311":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Hillary",
                "Mary"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hillary or Mary?<br>\r\n<br>\r\nWhich was it?</span></div></span></div>",
            "created":1249275600,
            "id":739642,
            "title":"Hillary or Mary"
        },
        "121312":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Janet",
                "Rachel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Janet or Rachel<br>\r\n<br>\r\nWhich was it?</span></div></span></div>",
            "created":1249275600,
            "id":737965,
            "title":"Janet or Rachel"
        },
        "12132":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Carl",
                "Rachel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is the 'controller'?</span></div></span></div>",
            "created":1249275600,
            "id":737966,
            "title":"try the device with some one else as the contro..."
        },
        "121321":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Hillary or Mary",
                "Janet or Rachel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is the subject?</span></div></span></div>",
            "created":1249275600,
            "id":737967,
            "title":"Carl takes control"
        },
        "1213211":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Hillary",
                "Mary"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was the subject?</span></div></span></div>",
            "created":1249275600,
            "id":737969,
            "title":"Hillary or Mary as subject for Carl?"
        },
        "1213212":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Janet",
                "Rachel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was the subject?</span></div></span></div>",
            "created":1249275600,
            "id":737970,
            "title":"Janet or Rachel as subject for Carl"
        },
        "121322":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Hillary or Mary",
                "Janet or Carl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is the subject?</span></div></span></div>",
            "created":1249275600,
            "id":737968,
            "title":"Rachel takes control"
        },
        "1213221":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Hillary",
                "Mary"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is the subject?</span></div></span></div>",
            "created":1249275600,
            "id":737971,
            "title":"Hillary or Mary as subject for Rachel"
        },
        "1213222":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Janet",
                "Carl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is the subject?</span></div></span></div>",
            "created":1249275600,
            "id":737972,
            "title":"Janet or Carl as subject for Rachel"
        },
        "122":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "\"Why are you acting like Rachel?\"",
                "\"Stop acting so girly\"",
                "\"fix the damned machine\""
            ],
            "content":"<div class=\"\"><div> <span>\"Ready Rachel?\" you ask, looking over at your pretty, young lab assistant.<br>\r\n<br>\r\n\"Yes Dr. Thorn!\" she laughs back at you.<br>\r\n<br>\r\n\"What did I say?\" you ask before the two of you say in unison, \"Don't call me Dr Thorn!\"<br>\r\n<br>\r\nLaughing you throw the switch and feel a strange tingling sensation.<br>\r\n<br>\r\n\"Did it work?\" asks Rachel, the usual cheer gone from her voice.<br>\r\n<br>\r\n\"Ummm...\" you mumble.<br>\r\n<br>\r\n\"I asked a question,\" stated Rachel, coming to stand beside you.<br>\r\n<br>\r\n\"I... Errr... I don't think so,\" you finally say.<br>\r\n<br>\r\n\"I've seen enough!\" hissed Mrs. Vandenburg before charging out of the room followed close behind by Janet.<br>\r\n<br>\r\n\"I'll go get the test equipment!\" you say cheerily before walking over to the closet, your hips swaying side to side.<br>\r\n<br>\r\n\"Mhmmmm...\" was Rachel's quiet reply.<br>\r\n<br>\r\n\"Tim!\" snapped Carl.<br>\r\n<br>\r\n\"Yes Dr... Erm... Mr. Crank?\" you respond, turning to face Carl, your posture straighter than normal.<br>\r\n<br>\r\nMr. Crank took in a deep breath and said...</span></div></div>",
            "created":1249189200,
            "id":737584,
            "title":"Rachel"
        },
        "1223":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Mrs. Vandenburg is withdrawing all funding",
                "Mrs. Vandenburg wants another demo later that day",
                "Mrs. Vandenburg will keep on funding the lab"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Certainly Mr. Crank!\" you reply excitedly before fetching the test equipment.<br>\r\n<br>\r\nJanet then comes back into the room and says that...</span></div></span></div>",
            "created":1249362000,
            "id":739077,
            "title":"\"fix the damned machine\""
        },
        "12231":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "blushing",
                "going back inside"
            ],
            "content":"<div class=\"\"><div> <span>Your good mood is gone, what is the lab going to do without funding. Skulking over to your desk you feel a lone tear roll down your cheek.<br>\r\n<br>\r\n\"For Fuck's Sake!!!\" you hear Rachel yell before charging out the door.<br>\r\n<br>\r\n\"Tim, if you will...\" asks Mr. Crank, pointing after Rachel.<br>\r\n<br>\r\nYou run after Rachel and find her outside cursing at the receding silhouette of Mrs. Vandenburg's car.<br>\r\n<br>\r\n\"Miss Bonn?\" you ask.<br>\r\n<br>\r\n\"That bloody...\" starts Rachel but you put a finger to her lips, stopping her.<br>\r\n<br>\r\n\"I'm sorry Tim,\" whispers Rachel, her chest still heaving with anger.<br>\r\n<br>\r\nYou put your arms around Rachel and lean your head on hers.<br>\r\n<br>\r\n\"We'll just have to make do I guess,\" you say.<br>\r\n<br>\r\n\"Ummm, Tim? Rachel? What is going on?\" you hear Janet say behind you.<br>\r\n<br>\r\n\"Nothing Miss Pearl!\" you snap, pulling back your arms and...</span></div></div>",
            "created":1249362000,
            "id":739082,
            "title":"Mrs. Vandenburg is withdrawing all funding"
        },
        "122312":{
            "author_id":"clockworange",
            "author_name":"Clockworange",
            "choices":[
                "Rachel's POV.",
                "Tim's (your) POV.",
                "Dr. Crank discovers that you two swapped personalities."
            ],
            "content":"<div class=\"\"><div> <span>Your boots crunch in the February morning snow as you follow Janet back into the laboratory. Rachel takes a bit longer to cool off, grumbling under her breath as she returns inside a few minutes later.<br>\r\n<br>\r\n\"I'm sorry about... what happened back there, Miss Pearl,\" You apologise awkwardly, feeling the need to explain yourself about hugging Rachel. \"I felt I just needed a shoulder to cry on.\"<br>\r\n<br>\r\n\"I'm the one who should be sorry, Tim. You were right, we never should have solicited Vandenburg for funding.\" Janet replies. \"But I think I can buy us some time. She can't withdraw her money immediately. I've read the venture capital agreement, and I'm certain I can delay the process for a week. Maybe two weeks.\"<br>\r\n<br>\r\n\"That might give us enough time to fix the machine,\" You finish her proposal.  \"Gosh, I sure hope you're right.\"<br>\r\n<br>\r\n\"I'll do whatever I can.\" She nods determinedly, pushing her glasses up the bridge of her nose. \"In fact, I've received interest from a few other investors about a potential buyout to help keep the lab afloat. No commitments yet, but I'm certain we might have a backup in case that bitch does pull the plug.\"<br>\r\n<br>\r\n\"Oh, how wonderful!!\" Your mood brightens considerably, clapping your hands together even though you bristle at Janet's vulgar language. \"But you mustn't call her bad names like that, Miss Pearl. After all, she just wants to protect her investment.\"<br>\r\n<br>\r\nJanet gives you a strange look as you leave her office and head for the testing room.<br>\r\n<br>\r\n\"I don't get it,\" Carl rubs his chin, reading over the latest inspection of the device. Handing the report to you, he paces the room like he usually does when he's trying to solve a puzzle. \"No malfunctions, no burnt circuits, no frayed wires... no indication that anything went wrong with the experiment. By all accounts, that device should have worked.\"<br>\r\n<br>\r\n\"I don't feel any different, Dr. Crank...\" You reply.<br>\r\n<br>\r\n\"Are you sure? What about Rachel? Have you noticed anything different about her?\" Carl asked frustrated.<br>\r\n<br>\r\n\"She seemed pretty upset about Miss Vandenburg threatening to pull our funding.\" You suggest.<br>\r\n<br>\r\n\"Too right! She can't hold our funding hostage just because of a few snags in development. Can't squeeze blood from a stone with that woman.\" Carl grumbles. \"Look Tim, I want you and Rachel to finish assembling a second prototype using these schematics. I'll work on diagnosing whatever problem might have caused this and see about fixing the original.\"<br>\r\n<br>\r\n\"Yes, sir!\" You smile, going over to Rachel's work station and telling her the news.<br>\r\n<br>\r\nYou and Rachel spend the next few hours taking apart the device and running tests individually on each component. Rachel looks impatient, observing while you carefully run a laser over the central motherboard. You gently tell her to be patient. <br>\r\n<br>\r\nBefore long, noon arrives and you and Rachel open your packed lunches in the break room. Due to the lab's shoestring budget, the room has only a small refrigerator, water cooler, and plastic table where you and Rachel sit. You press your legs together in the chair in a very ladylike fashion, while Rachel slouches in her seat with her legs spread far apart.<br>\r\n<br>\r\n\"Excuse me, Miss Bonn?\" You pipe up.<br>\r\n<br>\r\n\"What's up, Tim?\" She barks, looking down at her kale salad sullenly.<br>\r\n<br>\r\n\"This might sound like a strange question,\" You say cautiously, \"But do you mind if we trade lunches for today please?\"<br>\r\n<br>\r\n\"I was about to ask the same thing,\" Agrees Rachel, passing you her salad in exchange for your leftover steak. \"After what's happened today I could go for something meaty.\"<br>\r\n<br>\r\nYou grimace, \"Eugh, please take it.\" Rachel heats your dish in the microwave before tearing into it ravenously, even though she had told you on several occasions that she was a vegetarian. Digging in to her salad, you continue, \"So, you're going back to class this afternoon?\"<br>\r\n<br>\r\nRachel finishes her bite and replies, \"Yeah... some bloody seminar where we sit in a circle and talk about Russian literature. It satisfies the humanities credit I need for my degree. I used to think it was interesting, but I guess the novelty wore off.\"<br>\r\n<br>\r\nYour mind flits to your (rather limited) knowledge of literature. The way authors can paint a landscape, create rich and complicated characters, and make you feel things you never could before...<br>\r\n<br>\r\n\"I don't know, it sounds nice to me.\" You sigh, tilting your head. \"Not that I've read very much, mind you.\"<br>\r\n<br>\r\n\"It's not as important as preserving this lab.\" Rachel leaned back, folding her arms. \"If I could get out of class, I would. But the professor likes to give pop quizzes.\" <br>\r\n<br>\r\nShe tosses her rubbish away and hangs up her lab coat. Underneath she's wearing a short-sleeved pink blouse cut off at the midriff with her bellybutton piercing showing. That's in addition to her black miniskirt, tan stockings, and ballet flats. What a cute outfit, you think to yourself.<br>\r\n<br>\r\nNoticing you staring at her, Rachel blushes. Trying to pull her skirt down a bit, she mutters, \"I don't know why I dressed myself like this today. Damien and I are going out later tonight to celebrate six months of being together. But I could have changed after class...\"<br>\r\n<br>\r\n\"Don't worry, it looks nice on you.\" You smile. \"And congratulations on six months! Damien must be a pretty lucky guy.\"<br>\r\n<br>\r\nRachel frowns, \"Y-yeah, I guess so. Hey... never mind. See ya later, Tim.\"<br>\r\n<br>\r\n\"Have fun tonight! And see you tomorrow, Miss Bonn.\"<br>\r\n<br>\r\nShe scoffs. \"What have I said before? Don't call me Miss Bonn!\"<br>\r\n<br>\r\nYou laugh as she gathers her purse and leaves. She's worked as an intern at your laboratory now for 18 months, and every time she brightens up the room. You're relieved to see she's finally dishing out some of the banter and asserting herself more. Visibly appearing more confident and headstrong even in the face of a setback like what happened this morning.<br>\r\n<br>\r\nWhose story do we follow next?<br>\r\n</span></div></div>",
            "created":1536007920,
            "id":2542383,
            "title":"going back inside"
        },
        "13":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Mrs. Vandenburg",
                "Rachel Bonn",
                "Hillary Corton",
                "Carl Crank"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was the test subject?</span></div></span></div>",
            "created":1256446800,
            "id":781535,
            "title":"swap age and gender"
        },
        "133":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Switch to Hillary's POV",
                "switch to Mrs. Vandenburg's POV",
                "stay as Tim"
            ],
            "content":"<div class=\"\"><div> <span>Hillary stands opposite you and you activate the device. Suddenly you feel a tingling sensation all over your body. Your skin then begins to hurt and you stumble over to a desk where you put the device down.<br>\r\n<br>\r\n\"What is this supposed to be Mr. Thorn?\" asks Mrs. Vandenburg, eyeing you strangely.<br>\r\n<br>\r\n\"I don't...\" you begin but stop when your voice cracks.<br>\r\n<br>\r\nYour bones and internal organs now feel like they are aflame. It takes you a moment to notice that you are much shorter than you used to be. Your clothes feel like they are several times your size.</span></div></div>",
            "created":1256520120,
            "id":781537,
            "title":"Hillary Corton and Tim age and gender swap"
        },
        "1333":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "tell him to leave you alone",
                "notice your new form",
                "switch to Jake's POV"
            ],
            "content":"<div class=\"\"><div> <span>Your pants and underwear fall to the floor as you continue to change.<br>\r\n<br>\r\n\"Hillary? Are you all right sweetie?\" asks a scared Jake to the room.<br>\r\n<br>\r\n\"It hurts Daddy,\" a strange male voice replies.<br>\r\n<br>\r\nYour vision begins to blur as you become numb to the pain throughout the rest of your body. You feel sick and stumble out of the crumpled heap that was your pants and underwear and over to the trash can. There you puke for about a minute. Finally the pain stops and you collapse in relief against a table leg.<br>\r\n<br>\r\n\"Mr. Thorn! I have no idea what just happened but would appreciate an explanation,\" snaps Mrs. Vandenburg.<br>\r\n<br>\r\n\"Let me figure that out first! Okay?\" you retort, not noticing your different voice.<br>\r\n<br>\r\n\"Tim? Are you okay?\" asks Carl, crouching by your side, \"Or more importantly, is that really you?\"</span></div></div>",
            "created":1256520540,
            "id":781540,
            "title":"turning young and female"
        },
        "134":{
            "choices":[
                "Carl POV",
                "Stay as Tim"
            ],
            "content":"<div class=\"\"><div> <span>\"Ready Carl ?\" you ask, carefully pointing the antennae at him.<br>\r\n<br>\r\n\"I'm ready Tim\" say Carl. You than press the device.<br>\r\n<br>\r\nSuddenly you feel a tingling sensation, and you feel like your back hurt, as you look at your hand, you saw your hand starting to get older. Your body feel tired.<br>\r\n<br>\r\nYou feel your stomach starting to bulging, and u feel your cloth getting tighter.<br>\r\n<br>\r\n\"I think i need to buy some new cloth\" you talk to yourself.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1378902180,
            "id":1661147,
            "title":"Carl Crank"
        }
    },
    "info":{
        "author_id":"mystarfleet",
        "author_name":"Federation",
        "brief_description":"a device allows you to do strange body/mind changing actions on those around you.",
        "created":1249238820,
        "description":"<td align=\"left\" class=\"norm\">Your name is Tim Thorn, you work at a small research laboratory that was started by your Father shortly before his untimely death. While working there you create a device that allows you (and you alone) to perform a certain kind of body/mind changing actions on yourself and other people.<br>\r\n<br>\r\nThe device can swap between whoever is standing in front of its screen with the person the antennae are pointed at. Note: it can only swap between 2 people at a time and Tim must be the one to turn it on.<br>\r\n<br>\r\nThe power of the device is <b>ONE</b> of the following:<br>\r\n1. Swap bodies<br>\r\n2. Swap personalities<br>\r\n<br>\r\nThe initial Characters are:<br>\r\n<b>Tim Thorn</b>, 25, single, lives alone in a basement suite, shy, chief scientist at the lab<br>\r\n<b>Rachel Bonn</b>, 22, has a boyfriend, lives with a roommate, on internship at the lab as a lab assistant<br>\r\n<b>Alexandra Vandenburg</b>, 37, married to a senator, lives in a penthouse suite, is a chief investor in the lab<br>\r\n<b>Jake Corton</b>, 29, widower, lives in an apartment, Scientist in the lab<br>\r\n<b>Hillary Corton</b>, 14, has a crush on a boy at her school, lives with Jake, Jake's younger sister<br>\r\n<b>Mary Corton</b>, 7, Jake's daughter<br>\r\n<b>Carl Crank</b>, 40, married, the lab manager<br>\r\n<b>Janet Pearl</b>, 31, single, lives in a condo, the accountant for the lab<br>\r\n<b><div align=\"center\">Feel free to add more characters</div><br>\r\n<br>\r\nSome basic rules:<br>\r\n1. No killing the main character<br>\r\n2. No personality changes<br>\r\n3. Try to keep good grammar<br>\r\n4. The device can do one thing and can only be operated by Tim (no matter which body he is in)<br>\r\n5. No other devices with powers similar to the first one<br>\r\n<br>\r\n<br>\r\nMost importantly: HAVE FUN!<br>\r\n<br>\r\nAlso, please add chapters, characters to the story.<br>\r\n</b></td>",
        "id":1587428,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1536007920,
        "modified":1536007920,
        "pretty_title":"Tim's Device"
    }
}