{
    "chapters":{
        "1":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "A teenage girl's room",
                "A young girl's room",
                "A teenage boy's room",
                "A young boy's room",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>A boy named Adam stared out the window of a taxi as it drove down the road. Adam was 16, and he was rather bored from the long ride he had been through. <br>\r\n<br>\r\nA new dorm was openning for an all-ages private school. The dorm is free, has everything neccessary already provided for its occupants, and co-ed which is why many are trying to get in, including Adam, who will be starting at the private school during the next year. However, as great as it seems, their are two catches:<br>\r\n<br>\r\nThe first is that in order to stay at the dorm, you have to move into it during June, and stay there all summer as well. For Adam, since he is from out of town, and lacks the means to travel to it freely, this means he has to leave his friends earlier and spend all summer away from them, as well as the school year. He would have to get there during the start of the month.<br>\r\n<br>\r\nThe second catch is that dorm used to be the house of a very large family that just one day disappeared. There is a rumor that the family still haunts the place, but Adam has never believed in superstition or ghost stories.<br>\r\n<br>\r\nHowever, despite that, he decided to move in without a second thought. The private school was said to be one of the best, so he knew he could get a good education, which was important to him. His taxi pulled up outside of the gate of the dorm, and he unloaded his things. He didn't have much though, since he was an orphan. Just clothes and a few other things.<br>\r\n<br>\r\nPulling his suitcase up to the door, he hit the button for the doorbell, and almost instantly the door opened. The one who answered the door looked to be a middle aged woman. \"Hello there. You must be one of the student here to use the dorm.\"<br>\r\n<br>\r\n\"Yes ma'am.\" Adam repplied. \"My name is Adam.\"<br>\r\n<br>\r\n\"Well then come on in.\" she said with a smile as she stood aside so that Adam could enter. \"You know, you're actually the first one to arrive, though I expect we'll be getting many more arivals over the week. I'm Ms. Sterious, and I'm in charge of the dorm.\"<br>\r\n<br>\r\nLooking around, the entrance area looked really big, and their were two staircases a few feet away from the door. \"So can you tell me where the room I'll be staying is?\"<br>\r\n<br>\r\n\"Oh, we're really lenient, so you can have whatever room you want, just so long as it isn't taken. Not that you'll have that problem since you got here first. The place is four stories tall, and all of the rooms on the second, third, and fouth floors. The first floor has facilties such as a living room, a kitchen, and other things.\"<br>\r\n<br>\r\n\"Really? That sounds pretty cool.\" Adam commented.<br>\r\n<br>\r\nShe then pulled out a sign that had his name on it and handed it to Adam. \"Just put this on the door to the room you pick so that others will know its yours.\" she said, then started to walk away, but then turned around to say one last thing. \"Oh, by the way: I'm sorry but none of the rooms have been cleared out of the stuff that used to be in them. Its a big house, so I haven't been able to do it. So whatever is in the room you pick might as well belong to you from now on, so do with them what you wish.\" Ms. Sterious said as she walked out of the room, and Adam headed upstairs. Looking around, he picked a door close to the stairs, and when he opened it, he found himself standing in the doorway of...</span></div></div>",
            "created":1280120400,
            "id":924617,
            "title":"The beginning"
        },
        "11":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "He heard a single persom arrive",
                "He heard several people arrive",
                "He decided to go for a walk around the 1st floor",
                "He decided to take a brief nap",
                "He decided to get something to eat"
            ],
            "content":"<div class=\"\"><div> <span>Looking inside, it looked like a typical teenage girl's room. The room had a lot of clothes, shoes, makeup, and other things all around it. He guessed it used to belong to a girl who was 16, though he didn't know why he thought that it was that age specifically. Adam briefly considered finding a different room, but then decided he might as well use it. \"Why not? I'll just clear the stuff out later. Its pretty close to the stairs, so I don't have to walk too far back and forth when going downstairs.\" he reasoned. He put his bags in the room.</span></div></div>",
            "created":1280120400,
            "id":924619,
            "title":"A teenage girl's room"
        },
        "111":{
            "author_id":"capitalism",
            "author_name":"Capitalism",
            "choices":[
                "Boy ",
                "Girl",
                "Some adult or something someone not currently living there"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He then walks out into the hall to see who it is </span></div></span></div>",
            "created":1421125200,
            "id":1917571,
            "title":"He heard a single persom arrive"
        },
        "113":{
            "author_id":"capitalism",
            "author_name":"Capitalism",
            "choices":[
                "His clothes are gone ",
                "Someone is in it",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As he walked around the first floor he saw a few people greeted and talked to them<br>\r\nHe met a few guys and they decided to go and play a game of football out in the park <br>\r\nAfter the game Adam was sweaty and covered in mud<br>\r\nHe heads back to his room</span></div></div>",
            "created":1421125200,
            "id":1917573,
            "title":"He decided to go for a walk around the 1st floor"
        },
        "1131":{
            "author_id":"capitalism",
            "author_name":"Capitalism",
            "choices":[
                "Wear them and wait to see if she comes back",
                "Shower and see what happens",
                "Just change into the least girly clothes there"
            ],
            "content":"<div class=\"\"><div> <span>He walks into his room and sees that all his boxes are gone he opens the drawers to see that it is nothing but girls clothes<br>\r\nThe girl who lived here before must've thought she packed everything but grabbed his stuff but what does he do now all he has now are the clothes he has on and those are really dirty </span></div></div>",
            "created":1421125200,
            "id":1917575,
            "title":"His clothes are gone "
        },
        "11313":{
            "choices":[
                "Try to find his lost clothes?",
                "Go for a drink and try to figure out what to do?"
            ],
            "content":"<div class=\"\"><div> <span>He looks around the room and find a pair of plain black microfibre briefs, skinny jeans, black vest top and a plain blue hoody and puts them on, he doesn't like them but it's better then wearing a dress or skirt.<br>\r\n<br>\r\nHe then tries to decide what to do next?</span></div></div>",
            "created":1424754000,
            "id":1939744,
            "title":"Just change into the least girly clothes there"
        },
        "114":{
            "author_id":"blargman7",
            "author_name":"Blarg Blargington",
            "choices":[
                "Explore the house.",
                "Look around the room some more.",
                "Finish unpaking."
            ],
            "content":"<div class=\"\"><div> <span>Feeling kind of tired, Adam decided to take a quick nap. He took off his shoes and hopped into the bed.<br>\r\n<br>\r\nAdam woke up a few hours later feeling rested. Once he got up, he felt like he needed a shower as well. He undressed and headed into the bathroom attached to his new room. He turned the water in the shower on and, once it was hot, stepped in. A few minutes later, Adam realized he had forgotten to bring his shampoo into the bathroom.<br>\r\n\"Oh well.\" he said to himself, \"I'll just use the shampoo in here.\" He picked up a bottle of what was clearly girl's shampoo and squirted some out. \"This actually smells pretty nice.\" Adam said as he began lathering up his hair.<br>\r\nOnce he has washed everything, Adam shut the water off and got out of the shower. He dried himself off and headed back into his room to change. He decided he might as well start putting his clothes in the dresser drawers in the room. He opened a drawer and then realized he needed to empty them first. Adam decided to get dressed first now that he realized he needed to do some extra work. He pulled out a t-shirt a pair of jeans and a pair of boxers from his suitcase. He was about to put the boxers on when he noticed the panties in the drawer and he became curious. He pulled out a black pair with a slight lace trim and put them on instead of his boxers. He then put his jeans and and shirt on. Not wanting to rummage through his messy suitcase to find a pair of socks he just grabbed a pair of socks from one of the drawers and put them on, not caring that they were pink. He put his shoes on and then decided what to do.<br>\r\n<br>\r\nAdam decided to...</span></div></div>",
            "created":1295240400,
            "id":1037023,
            "title":"A nap and a shower"
        },
        "1142":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Someone comes in",
                "Adam yells \"just a minute!\"",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Adam looked around the room some more, just more girly stuff, it was a generic teenage girls room...<br>\r\n<br>\r\nSome time Later Adam was putting the finishing touches on his makeup and stood up, admiring himself when he shook his head groggily, what had he been doing... Then all of a sudden the last hour came back to him, as he explored the room, for some reason he realized that the girl who lived here seemed to be about the same size, and that reasoning was good enough to try on some clothes, and then one thing lead to another and he was painting his nails and doing his makeup. What was wrong with him.<br>\r\n<br>\r\nHe looked at the mirror in front of him, ruby red lipstick, some blush, eyeshadow and mascara, he stood up, he was wearing black high heels and a denim skirt, he had even shaved his legs! checking under the skirt, panties of course, he had on a padded bra and Tight pink T-shirt, his nails were painted a ruby red matching his lips.<br>\r\n<br>\r\nHe hurriedly washed his face as he started taking off the clothes.<br>\r\n<br>\r\nAs he got the last of it off, he went to put on his clothes, looking through the drawers, none of his clothes were, there!<br>\r\n<br>\r\nHe was sure he'd put his stuff in the drawers, he looked for his luggage, it was gone as well, the only things left in the room was the stuff he'd found here when he moved in.<br>\r\n<br>\r\nHe had stripped off the clothes, so he stood in the girl's room naked, when he heard a knock on the door, and the knob start to turn</span></div></div>",
            "created":1332478800,
            "id":1300827,
            "title":"Look around the room some more."
        },
        "1143":{
            "author_id":"blargman7",
            "author_name":"Blarg Blargington",
            "choices":[
                "Follow Adam as he explores.",
                "Skip to the end of the day."
            ],
            "content":"<div class=\"\"><div> <span>Now that he was dressed, Adam began unpacking his suitcase and putting his clothes in the drawers. Not knowing where to put the clothes already in the drawers, he just left them in there alongside his clothes because there was plenty of room. Once he was unpacked, Adam decided to explore the house and see if anyone else had showed up.</span></div></div>",
            "created":1295240400,
            "id":1037026,
            "title":"Finish unpaking."
        },
        "11431":{
            "author_id":"jazziedreamz",
            "author_name":"Echo",
            "choices":[
                "...and followed the scent to the kitchen",
                "...to the snacks he had in his room"
            ],
            "content":"<div class=\"\"><div> <span>The house was bigger than Adam had imagined. He climbed the stairs warily, careful not to reveal the pink socks to anyone silently lurking behind him. The floor above was light and airy. Specks of dust shone through the window like diamonds. He paused on the top stair to admire the pretty effect. Pretty?! Adam was suddenly very aware of the lace itching against his skin, as if somehow the fabric had planted the word in his head. Pretty...he'd barely used that word to describe girls he liked. He hitched his jeans up a little higher and decided to turn back. It seemed that Ms. Sterious was right - no one else was here yet, and exploring could wait until he was well rested and feeling less...\"pretty\".<br>\r\nA doughy smell wafted through the floorboards. That's what he needed - food. Food would clear his head. Turning his back on the 3rd floor, he made his way downstairs...<br>\r\n</span></div></div>",
            "created":1295326800,
            "id":1037462,
            "title":"Follow Adam as he explores."
        },
        "11432":{
            "author_id":"blargman7",
            "author_name":"Blarg Blargington",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>At the end of the day Adam was feeling very tired, so he went right to bed and quickly fell asleep.<br>\r\n<br>\r\nThe next morning, Adam woke up and headed for the shower. He turned the water on, undressed, and stepped inside. He washed his hair with the girl's shampoo again because he decided that he liked the smell of it better than his own shampoo. He washed off his whole body and was about to get out of the shower when a razor caught his eye. He picked it up and shaved off his body hair, not thinking anything of it. He then got out of the shower and dried himself off. Once he was pretty dry, Adam absentmindedly wrapped the towel around his chest like it was the normal thing to do. He went back into his room, and opened the underwear drawer. He pulled out a red pair of panties and put them on. His eyes fell on his boxers and he made a face of disgust.<br>\r\n\"Why did I ever wear those things?\" he asked himself. He then pulled out the bra that matched his panties and put it on because he felt like he needed to wear them together. He then put a pair of his jeans and one of his t-shirts on along with a pair of girl's socks. He opened the closet to get his shoes out but noticed a pair of girl's tennis shoes and put them on instead. He then headed downstairs for breakfast.<br>\r\n<br>\r\nDownstairs, people are wearing clothes from their rooms. Does Adam think that it is normal?</span></div></div>",
            "created":1295240400,
            "id":1037030,
            "title":"Skip to the end of the day."
        },
        "114322":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "head back to the room to clean himself up.",
                "Go swimming "
            ],
            "content":"<div class=\"\"><div> <span>Since most of  the people had only recently moved in themselves they're changes were small and mostly unnoticable, Adam did notice that a few oddities, he saw a Young man applying pink lipgloss onto his lips and slip it back into his pocket, and another young teenage boy seemed to be wearing high heels, not very high, but definitely high heels., but he couldn't judge, he was wearing girl's tennis shoes.<br>\r\n<br>\r\nHe got himself a bowl of cereal and a muffin, meeting some of the other people in the house. he got to know the guy that was wearing lip gloss they seemed to have a lot in common, his name was Pete, and he too was in a room of a teenage girl.<br>\r\n<br>\r\nPete said \"we could have a slumber party and do eachothers nails and talk about boys\"<br>\r\n<br>\r\n\"that would be so much fun!\" Adam replied enthusiastically, then caught himself \"I'm kidding, you know.\"<br>\r\n<br>\r\n\"of course... so was I\" pete replied.<br>\r\n<br>\r\nAfter breakfast Adam figured he'd work out for a bit, there was a apparently a small gym inside this building so he went back to his room to get his workout clothes.<br>\r\n<br>\r\nHe was about to grab his workout clothes from his bag but then got curious. he checked the closet and found a sports bra, he didn't know why but felt intrigued by it and decided to put it on, and wear it instead of an undershirt.<br>\r\n<br>\r\nHe put it on and then put on his T-shirt he would wear to the gym.<br>\r\n<br>\r\nNext was his gym shorts, he instead found a pair of Lycra running shorts that would show off how good his legs looked, he put those on and was about to head out.<br>\r\n<br>\r\nThe sports bra he was wearing instead of his undershirt wasn't tight enough well it was tight around him, but loose and annoying in his chest area, he solved the problem by taking several pairs of socks and tights aand stuffing them into the chest area of the sports bra, there now it was tight and supportive. he headed to wear they kept the gym equipment.<br>\r\n<br>\r\nWhen he got there he found that he wasn't in the mood to lift weights like he'd been planning, he even decided against the treadmill.<br>\r\n<br>\r\nHe found a yoga mat, and though he wasn't big into yoga he had been to a class or two, and new some of the basic positions.<br>\r\n<br>\r\nHe found it much more enjoyable than he had before, he just felt all his tenseness and worries slipping away, and before he knew it he had been stretching and relaxing for well over an hour.<br>\r\n<br>\r\nHe was sweating and felt gross, he decided to...</span></div></div>",
            "created":1298610000,
            "id":1060233,
            "title":"No"
        },
        "1143221":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "The Next Morning",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Adam headed back to his room, started the shower, stripped off his clothes and hopped in, sud-sing up using the girl's soap shampoo and conditioner. His mind wandered.<br>\r\n<br>\r\nHe liked the feeling the sports bra had on his chest, especially after stuffing it like he did, it was tight, but comfortable and soothing, the slight pressure on his chest, he'd have to continue doing it, along with the yoga, he wondered why he hadn't enjoyed i when he first tried it.<br>\r\n<br>\r\nAfter washing up he got out of the shower, and wrapped the towel around his chest. and looked in the mirror. his hair had gotten longer, he hadn't even noticed, it used to be pretty short, but now it went down to his chin, he must not have been paying attention the last few weeks. he found a blow dryer and brush and dried his hair. Looking in the mirror again, he liked his hair like this, he'd probably keep it, but then he wondered something.<br>\r\n<br>\r\nGoing back into his room, he found what he was looking for, the last occupants makeup supply, he grabbed a few things and decided to experiment, he was only doing it to see if he could bring out his own natural features, using a little bit of makeup, just to make himself look manlier, and at first he was, but after sitting there in front of the mirror a bit, he started to have fun with it, using more makeup, but promising not to get seen wearing it like that. he tried several styles and things.<br>\r\n<br>\r\nafter playing around for a while, he looked at himself in the mirror, he looked really cute, pink lips purple eyeshadow that faded to pink some blush, and the foundation hid all of his skins flaws.<br>\r\n<br>\r\nhe realized how long he'd been doing it and decided he get changed and get some lunch.<br>\r\n<br>\r\nHe put on a pair of panties as usual, and then a bra, but this time, to get that feeling like before he stuffed it with socks. and then his own T-shirt and jeans.<br>\r\n<br>\r\nyou notice that the bra stuffed with socks leaves noticeable lumps on his chest, but he didn't care, he enjoyed the tight comforting feeling, who cares what other thought.<br>\r\n<br>\r\nhe was about to leave when he remembered he was still wearing makeup. he looked in the mirror one last time, and begrudgingly took it off, \"he couldn't go out in public wearing makeup, what would people think\", he thought, absent minded fiddling with his bra strap and getting his panties unwedged from his butt<br>\r\n<br>\r\nHe cleaned the makeup off, but decided to keep the foundation and did a bit to make his own features look more pronounced, but didn't use enough makeup to get noticed.<br>\r\n<br>\r\nHe went down to the kitchen and was about to make a sandwich, but instead saw that someone had just bought a head of lettuce.  He found some more ingredients and made himself a salad. and turned on the TV and ate.<br>\r\n<br>\r\nHe flipped through the channels when he saw Pete, the guy from earlier plopped down on the couch beside him, he noticed that Pete was definitely wearing lip gloss, and his nails were painted pink now too, and another thing he was wearing girl's jeans. he knew some guys did, but Pete hadn't been earlier, but whatever, he just figured Pete was kind of an odd guy, but he liked him.<br>\r\n<br>\r\nAdam ate his Salad forgetting to look for something to watch, the channel was on some chick flick. He and Pete sat through the whole thing.<br>\r\n<br>\r\nAt the end Adam said \"that was funnier than I expected, it wasn't half bad.\"<br>\r\n<br>\r\n\"yeah i hate to agree but it was a pretty good movie.\"<br>\r\n<br>\r\nAdam asks \"hey pete, I... uh noticed that you painted your nails.... Whats up with that?\"<br>\r\n<br>\r\n\"oh, yeah I know its weird but I just got really OCD about how my nails looked, they looked dirty so I cleaned them, and then cleaned them again but it didn't help they just looked ugly to me, so I found this stuff and decided to wear it.\" Pete replied<br>\r\n<br>\r\n\"oh ok i guess that makes sense.\" Adam said checking out his own nails, he kind of felt the same, they were dirty but it wasn't dirt under his nails or anything, just that the nail itself was ugly, but he dismissed the thought, he didn't want to paint his nails.<br>\r\n<br>\r\nHe Bid Pete farewell,saying they should hang out tomorrow, he agrees. Adam heads back to his room. He closed and locked the door and goed back to the mirror, he undoes his makeup, and this time redoes it like he had before. he couldn't resist, he loved the face that looked back at him while wearing makeup like that. Bright red lips eyeshadow, mascara, and some eyeliner and blush.<br>\r\n<br>\r\nHe decided to play some of his video games, but after only 30 minutes of Halo he found himself getting bored, and shut it off, and for the rest of the afternoon, just surfed the internet.<br>\r\n<br>\r\nhours went by and before he knew it, it was dark out, he wanted to get some food, since he didnt have dinner, but wasn't sure he wanted people seeing him with makeup on. so he decided to wait until later when most people would be asleep.<br>\r\n<br>\r\nAt about 11:30 he snuck out of his room and into the common area kitchen and got some food and went back to his room and ate.<br>\r\n<br>\r\nand At 12 he decided to go to sleep, he washed off the makeup and changed into a pair of pink silk PJ's he found, leaving his stuffed bra on, it would help him sleep.</span></div></div>",
            "created":1298610000,
            "id":1060245,
            "title":"head back to the room to clean himself up."
        },
        "11432211":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "To the pool",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Adam woke up the next morning and quickly showered, noting that his hair was now just past his shoulders, he dried it again, not finding it that strange at how fast it grew, it also had highlights, he just chalked it up to being in the sunlight more this summer, gave him some natural highlights.<br>\r\n<br>\r\nhe went to his desk, and did his makeup deciding that he no longer cared what other people thought of him Pete didn't seem to.<br>\r\n<br>\r\nToday he used pink lipstick and lipgloss and black eyeshadow using it to extend his eyelids giving his eyes an exotic look.<br>\r\n<br>\r\nOpening a drawer he hadn't looked in before he noticed several colors of nail polish... he hesitated, all last night after Pete told him why he painted his, Adam couldn't get the thought out of his head, he hated how his nails looked, and couldn't resist covering his hated nails in purple nail polish, and decided since he did his hands he might as well paint his toe-nails too.<br>\r\n<br>\r\nHe let his nails dry before he got changed into into a pair of matching blue panties and bra, stuffed with socks of course, then a pair of his Jeans, and decided to go with a girl's T-shirt, it wasn't that much different than his own, it was just baby blue and a little more form fitting than usual.<br>\r\n<br>\r\nAdam put on a pair of pink socks and then put on a pair of flats that he found in the closet, they're soft and comfortable.<br>\r\n<br>\r\nhe headed to the common area kitchen and saw Pete eating cereal and there's some lady getting something out of the fridge, He's not sure but he could swear that she's wearing a diaper under her skirt, when she turns around he sees shes sucking on a pacifier has a teddy bear in one hand and a newly filled bottle of milk in the other.<br>\r\n<br>\r\nAdam poured himself a bowl of cereal and sat next to Pete. Today he's wearing a skirt he notice, and he's got a few bracelets on his arms and rings on his fingers, next you notice that he's got the same lumps on his chest as you, he must get the same feeling from the bra as Adam did.<br>\r\n<br>\r\nWhile eating Adam asks pete \"whats with the skirt? You some sort of crossdresser now?\"<br>\r\n<br>\r\nDefensively Pete replies \"It's not a skirt! look its a skort.\" pete lifts up the skirt and Adam see that its only a flap around a pair of shorts. \"and what about you? I see you're wearing nail polish now too, not to mention makeup and that's definitely not you're own shirt.\"<br>\r\n<br>\r\nNow it was Adams turn to get defensive, \"I'm not crossdressing, I only painted them for the same reason you did! and the makeup is only to bring out my own features it makes me look hot- I mean handsome, and this shirt is completely unisex\"<br>\r\n<br>\r\n\"ok whatever, I didn't mean anything by it, oh! anyways I was planning on going swimming after breakfast, you want to join me?\" Pete asked<br>\r\n<br>\r\n\"definitely that sounds like fun.\"<br>\r\n<br>\r\nBoth of them finished eating and headed back to their respective rooms, Adam was about to grab his swim trunks when he stopped, it didn't feel quite right to be topless as of recently, he'd been wearing a bra as an undershirt constantly for the 4 days he'd been here, and there was just something off-putting about being without it. He wondered if he could wear the trunks and the bra still, maybe have a shirt over it for modesty but that wouldn't work, he decided to see what the closet had, he came out victoriously with two swimsuits a one piece red one, and a two piece purple and pink one, he decided on the two piece cuz he thought the one piece would make him look too girly.<br>\r\n<br>\r\nThe way he saw it, the two piece was like wearing a speedo, which would make him look sexy, and wearing a bra, or as he'd been wearing them as undershirts, so he stripped down and donned the two piece bathing suit, making sure his penis was nice and hidden away, he didn't want any wardrobe malfunctions, next he donned the bathing suit top. his only concern was that he couldn't think of anything to stuff his bathing suit with to give him that calming pressure on his chest.  He decided to search through the room, looking for anything that would work.<br>\r\n<br>\r\nHe found in the back of the closet a small box, he opened it and found a treasure chest, in it were two perfectly sized realistic breasts that not only would fit in any of the bras he wore, but he could also use an adhesive and attach them to his chest to they'd stay in place.<br>\r\n<br>\r\nQuickly since he didn't want to keep Pete waiting, he used the adhesive and followed the directions, and after letting the breasts hold there for a few minutes tested to see if they'd hold, he jumped up and down, getting a realistic feeling and view of them bouncing, it was great, now he'd always get that feeling he'd been enjoying and he wouldn't even need to stuff his bra.<br>\r\n<br>\r\nHe donned his top again and, not wanting to be indecent he found a thin piece of fabric that was stored next to the bathing suit, and realized it was a sarong, he tied it around his waist, not thinking of it as a skirt, but more of a thin towel wrapped around his waist. he grabbed an actual towel, cleaned his face of makeup and headed towards the building's pool</span></div></div>",
            "created":1298610000,
            "id":1060260,
            "title":"The Next Morning"
        },
        "114322111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "To Dinner",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Adam walked through the dorm building dressed in his bathing suit, a sarong and a pair of yellow wedge flip flops he found before leaving, they were quick and easy to put on but they were about 3 inches thick and he had to get used to walking on them.<br>\r\n<br>\r\nHe arrived at the pool, Pete was already there in a baby blue one piece swimsuit, he too seemed to be wearing breasts like the ones he had, Pete's were smaller though<br>\r\n<br>\r\n\"cute swimsuit he said\" Adam wanted to say that it was really girly but he didn't want to go through that again, and even though his foggy mind saw what he was wearing as masculine in a way, he had to admit, he was wearing a girls swimsuit no matter how much he made himself believe otherwise.<br>\r\n<br>\r\n\"yours too, I didn't know you had a body for a two piece suit.\"<br>\r\n<br>\r\nThe compliment filled Adam with pride, he noticed that Pete had long hair, like mid-back long hair, he wondered if it had always been that long, he thought back to meeting pete, but couldn't get a clear memory of his hair, but he did sort of recall his long hair, he just hadn't noticed it before.<br>\r\n<br>\r\nPete's hair was braided and set in a bun so that he could keep it out of the water.<br>\r\n<br>\r\n\"hey pete, could you do what you did with your hair, to mine? I don't feel like getting it wet and haveing to dry it again.\"<br>\r\n<br>\r\n\"oh sure, I didn't even know I could do this, I just fiddled with it and ended up like this I guess I'm naturally talented with hair.<br>\r\n<br>\r\nA few minutes later Pete had Adam's hair all braided and set like his was.<br>\r\n<br>\r\nThey swam, and did laps, and raced, both were careful not to get their hair wet but still had fun, after a while they got out and sat in the jacuzzi<br>\r\n<br>\r\nAdam asked \"hey you wanna get dinner somewhere later tonight, I haven't left the dorm since moving in, and could use some other food.\"<br>\r\n<br>\r\n\"yeah sounds good I've got no plans, but first could you help me do makeup like you had earlier, I tried it and just couldn't get it right, and you seem so good at it.<br>\r\n<br>\r\n\"yeah sure I've only just started with it too, guess I'm just naturally talented at it, like you with hair.<br>\r\n<br>\r\nA bit later they both headed back to their rooms, Adam wrapped a towel around his chest as usual and surfed the internet until it was time to get ready<br>\r\n<br>\r\nAdam took off his bathing suit and noted that his false breasts stayed on perfectly, he jumped up and down to make sure they were still on tight, they held firm, he wondered what he should wear tonight. i might get chili once it got dark to he grabbed a light jacket he found in the closet. and he'd heard that girl's wore leggings when it was cold, he wasn't planning on wearing a skirt or anything, but he could wear them under his pants for extra warmth he figured. Next he chose a top from the closet that he found to be \"too cute\" but thinking that it was quite feminine he'd just zip up his hoodie and nobody would be able to see it.  <a rel=\"nofollow\" href=\"http://image.packshot.com/erez4/cache/NLW_189425366_tif_3fa00a6fccb61990.jpg\" target=\"_blank\">http://image.packshot.com/erez4/cache/NL...</a><br>\r\n<br>\r\nhe put on a pair of white frilly panties and then the black leggings then a pair of his own pants, then a demi-bra, then the girly red top, and then he throws on the hoodie. and puts on the girls flats he wore earlier, then gets to work on his makeup<br>\r\n<br>\r\nAdam heads over to Pete's room, he lets you in, you notice that Pete's mid-back length hair has been curled and styled he's wearing a pair or red 3 inch heels, which makes sense he was kind of short, he's wearing a skirt again, this time you're sure its a skirt, and pantyhose too, and he's one of his own long sleeve T-shirts on, Adam sees the breasts Pete's wearing as bumps under his shirt, again Adam feels oddly proud that he have bigger ones.<br>\r\n<br>\r\nPete lets him in and says, \"in return for the help with my makeup I figure I could style your hair for you.\"<br>\r\n<br>\r\n\"that'd be great you say, lets start with you.\" Adam says realizing his hair is still braided and in a bun from swimming<br>\r\n<br>\r\nYou find the makeup his last room owner used and after figuring out what colors you'd use you help Pete get all made-up.<br>\r\n<br>\r\nAfter you finish Pete has Adam sit, and undoes his hair, brushing it out, the blond highlights he noticed earlier seem even stronger than before, seems almost half of his brown hair is now a blond color, Pete gets to work with a curling iron and some spray. after thirty minutes of work Pets lets Adam see his work. It's amazing his hair instead of lying flat across his face now cascades down, in curls and Adam thinks it looks awesome.<br>\r\n<br>\r\n\"what do you think Addy?\"<br>\r\n<br>\r\n\"I love it, it looks amazing... Addy?\"<br>\r\n<br>\r\n\"eh was just playing with your name.\"<br>\r\n<br>\r\n\"well Addy is kind of an odd name, if your gonna call me anything but Adam, make it Abby, got it, Penny?\"<br>\r\n<br>\r\nPeter laughed, \"you got it Abby.\"<br>\r\n<br>\r\nShall we go? Penny?\"</span></div></div>",
            "created":1298610000,
            "id":1060523,
            "title":"To the pool"
        },
        "1143221111":{
            "author_id":"jimmyslavakia",
            "author_name":"Jimmy",
            "choices":[
                "Pete was dressed and ready to go",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>On their way out to dinner, \"Abby\" and \"Penny\" decided that they should go to an Italian restaurant to eat. They took a taxi from outside of their building and arrived shortly after. The waiter showed them to their seats and they received a number of looks from other people in the restaurant who thought they were dressed strangely. Ignoring the other people, they both ordered salads (despite usually ordering steaks) and began to chat. Thinking that they had spent too much time in their new home, Adam suggested that the pair went out on the town for the night and said they should go out to a local club. Pete agrees to the idea and they order a bill.<br>\r\n<br>\r\nReturning to their bufing shortly after, Adam and Pete return to their rooms to get ready for the night out. Stripping out of his outfit, Adam begins to plan what he should wear for the night. Usually he would wear a shirt and jeans while going out but felt that he needed to dress up to impress Pete. He opened up his wardrobe and could easily see the outfit that the former owner of his room wore when she went out at night. On a hanger, he found a blue sparkiling dress that had a deep plunging neckline and on the same hanger found a pair of tights. Thinking that his current underwear would show through the dress, Adam searched through his drawers and found a thing that would be much better suited along with a bra that would blend in with his dress. He pulled the thong up legs, finding the sensation to be unified but enjoyable and positioned the bra to hold his false breasts. He then rolled the tights up his legs, finding them to be similar to the leggings he was wearing earlier but a lot more see through. Deciding to bite the bullet, Adam climbed into the dress, finding it was a lot more form fitting than he was anticipating but liked it none the less. He then applied some make-up to his face on top of what he already had on, finding it more suitable for a club. He then found a pair of high heels in the closet that matched his dressed and pulled them on, balancing in them as if he had worn them for years. <br>\r\n<br>\r\nMaking his way to Pete's room, Adam was secretly hoping that his dress would be hotter than Pete's, thinking he was more likely to meet someone as his boobs were bigger and his figure was better. Opening Pete's door he found...</span></div></div>",
            "created":1435986000,
            "id":2003285,
            "title":"To Dinner"
        },
        "11432211111":{
            "author_id":"thumbs13",
            "author_name":"potato",
            "choices":[
                "They meet other dorm residents",
                "Trouble at the club"
            ],
            "content":"<div class=\"\"><div> <span>Adam goes over to Pete's, and he can't believe his eyes. He's wearing a sparkling red dress, with matching heels.<br>\r\n<br>\r\n\"You really dressed to impressed, huh Penny\"<br>\r\n\"I could say the same for you, Abby\"<br>\r\n<br>\r\nAdam and Pete go over to the club. There...</span></div></div>",
            "created":1497589200,
            "id":2336791,
            "title":"Pete was dressed and ready to go"
        },
        "1143221112":{
            "author_id":"darkone4000",
            "author_name":"Exar",
            "choices":[
                "Follow Adam and Pete",
                "Switch to James and Aimee"
            ],
            "content":"<div class=\"\"><div> <span>Adam and Pete head downstairs to the parking lot when they met someone new on the stairs.  Adam had been a rather reserved person, but that was suddenly no longer the case.<br>\r\n<br>\r\n\"Hi!\" he said energetically. \"I'm Ab- Adam, and this is Pen- Pete.\" it wasn't time for nicknames yet.<br>\r\n\"Hello.  I'm James.\" the red haired stranger replied.<br>\r\n\"You must have just arrived.\" Pete said. \"If you need any help settling in we can lend a hand.\"<br>\r\n\"I'm alright, thank you.  Someone else arrived just after me though.  She had several bags so maybe she could use a hand.\"<br>\r\n\"Alright.\"<br>\r\n<br>\r\nAdam and Pete continued down to the parking lot.  As James had said, a dark-haired girl was there getting her bags together.  There weren't as many as James had made there out to be, but the girl (Aimee was her name) appreciated the help.  Even James came down to assist.  <br>\r\n<br>\r\n\"Aimee, I thought I recognized  you.\"  James said.<br>\r\n\"James, good to see you too.\" she replied.<br>\r\n<br>\r\nAs they continued into the building, James told Aimee that his room was big enough for two, and had once been inhabited by two sisters.  James offered to share the room with Aimee, and she quickly accepted.  After James and Aimee were settled in, Adam and Pete continued off to their dinner appointment. </span></div></div>",
            "created":1426309200,
            "id":1948378,
            "title":"New Arrivals"
        },
        "11432211122":{
            "author_id":"darkone4000",
            "author_name":"Exar",
            "choices":[
                "Continue with James and Aimee",
                "Switch back to Adam and Pete"
            ],
            "content":"<div class=\"\"><div> <span>James walked into the room, Aimee a few steps behind him.  He was glad she agreed to room with him, the room just didn't feel right with one person.  The room was fairly large, near the staircase on the second floor.  It was also fairly near the second floor bathroom.  The room had two beds, each with a separate closet, desk, boudoir, and bookshelf.  Between the two beds were a couch and table, with a large window above the couch.<br>\r\n<br>\r\nThe closets and desks were still full of the previous occupants clothes and items.  James decided to leave their things in the closet, just move them to make room for his own.  As he pushed the hangers to one side, he noticed a dark green dress.  <a rel=\"nofollow\" href=\"http://threadsmagazine.assets.tauntonnet.com/assets/uploads/posts/8314/ResavedCfromFB_edited_lg.jpg\" target=\"_blank\">http://threadsmagazine.assets.tauntonnet...</a>  It looked rather beautiful, as did just about everything else in there.  As he was looking through the desk when he found half of a picture.  It was of a girl with long red hair who James figured must have been one of the previous occupants of the room.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://img0.etsystatic.com/009/0/5610032/il_fullxfull.436520176_4wi0.jpg\" target=\"_blank\">https://img0.etsystatic.com/009/0/561003...</a><br>\r\nThe name \"Lily\" was written on the back.<br>\r\n<br>\r\nAimee's closet had similar clothes, though she wouldn't be caught dead in a dress or even a skirt.  Still, though, she had to admit some of them were very pretty.  She found the other half of the picture of the two sisters.  How one of them had red hair and the other black she couldn't quite tell.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i.imgur.com/Gkf7o.jpg\" target=\"_blank\">http://i.imgur.com/Gkf7o.jpg</a><br>\r\nThe name \"Raven\" was written on the back.</span></div></div>",
            "created":1426482000,
            "id":1949154,
            "title":"Switch to James and Aimee"
        },
        "114322111221":{
            "author_id":"darkone4000",
            "author_name":"Exar",
            "choices":[
                "Stay with James",
                "Go see what Aimee is up to"
            ],
            "content":"<div class=\"\"><div> <span>James was still putting his things in the desk, leaving the picture of Lily on the desktop.  Aimee, in the meantime, had been messing with her hair.  She almost always wears her long, black hair in a ponytail, but now she was keeping it down.  <br>\r\n<br>\r\n\"James, I'm going to go have a look around the house.\" she said.  <br>\r\n\"Fair enough.  I might join you shortly.  I'd like to get the feel of the room a bit more.\"<br>\r\n<br>\r\nAimee headed out, leaving James to himself.  He decided to keep looking through Lily's desk and boudoir, trying to find more information on her.  After about five minutes of looking at scraps of paper and pencils in the desk drawers, he finally found something promising in one of the bottom drawers.  It was a small wooden lever built into the side of the drawer.  James pulled it and a hidden compartment under the top of the desk.  Reaching under, James pulled a thick book from the compartment.  The book was in surprisingly good shape; James had thought that anything left by Lily would be rather old since he figured she must have left the house a long time ago.  But this book suggested that she might have been living here much more recently.<br>\r\n<br>\r\nOpening the book's front cover, James found a large monogram letter L.  This must have been Lily's diary.  A quick glance at the first few pages confirmed this.  Apparently Lily had been keeping this diary from the first day she could write, which must have been when she was quite young.  Tucked into one of the first few pages was a photograph of Lily.  It must have been taken at about the same time as the picture on the desk.  The photo in the book was of Lily sitting on her bed reading a book.  Her legs were crossed at the knee and her chin was resting on her hands, with the book sitting in her lap.  It was hard to see, but James was pretty sure she was reading a collection of poems.  James set the photo aside, and started reading through the first few pages.  He was sitting on the bed reading.  His legs were crossed at the knee and his chin was resting on his hands, with the book sitting in his lap.   </span></div></div>",
            "created":1426482000,
            "id":1949223,
            "title":"Continue with James and Aimee"
        },
        "1143221112211":{
            "author_id":"darkone4000",
            "author_name":"Exar",
            "choices":[
                "James Heads Out",
                "Adam and Pete have returned."
            ],
            "content":"<div class=\"\"><div> <span>The first several pages were nothing special, mostly relating Lily's childhood life.  The entries were sparse and didn't have much of interest.  There was one story from when Lily was about eight.  Apparently she, her sister Raven, and their cousin Karly, who used to live three doors down the hall, were out playing at a nearby lake.  The three girls had been swimming for a few hours when Lily tricked Karly into jumping from the High Rock (yes, that's what they called it.)  The drop was so far that when Karly hit the water, the top of her swimsuit went flying.  Lily and Raven laughed for an hour.<br>\r\n<br>\r\nJames put the book aside, deciding to keep looking around the room.  The few other pictures of Lily he could find showed that she almost always had long red hair with that beautiful braid.  A few more minutes of searching turned up a rather strange wig.  It looked identical like it was made to match Lily's hair exactly.  Almost absentmindedly, James put the wig on.  It actually made him look rather like Lily.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/736x/b9/11/16/b91116c437efcd0c2141eac7abebac57.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/736...</a><br>\r\n<br>\r\n\"Aimee will laugh her head off when she sees this.  Just like that time we made Karly's swimsuit fly off!\"<br>\r\n<br>\r\nJames had a good laugh at the memory, and it took a few seconds to remember that that was Lily and Raven who did that, not James and Aimee.  <br>\r\n<br>\r\n<i>Must just be Lily's writing, it's very immersive.</i><br>\r\n<br>\r\nJames decided he should have a walk around the house as well, dinner would be soon and it would be good to stretch his legs.  He opened his suitcase to get some fresh socks when he noticed a pair of stockings sitting in Lily's closet (he should really start calling it \"his\" closet.)  He walked over to them, they were white with a rather pretty design.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.corset-story.com/media/catalog/product/cache/14/image/9df78eab33525d08d6e5fb8d27136e95/w/h/white_opaque_stockings_with_lace_trim.jpg\" target=\"_blank\">http://www.corset-story.com/media/catalo...</a><br>\r\n<br>\r\nHe decided to put them on, since they were already out and he didn't have to sort through his suitcase to find socks.  His pants would hide them anyway, but he wasn't sure why he needed to hide them.  </span></div></div>",
            "created":1429074000,
            "id":1964770,
            "title":"Reading Lily's Diary"
        },
        "1143222":{
            "author_id":"yogi-bear",
            "author_name":"Undbitr",
            "choices":[
                "on the way there"
            ],
            "content":"<div class=\"\"><div> <span>Adam had finished doing yoga and felt like going for a swim so he went back to his room and showered off the sweat. when he went to go and get his swimsuit he realized that he had left it back at his parents house, so he decided to see if there was one in his new room.<br>\r\nHe finds a two piece blue bikini then as he's about to go to the pool he realizes how odd it'd look for a guy to be swimming in a bikini so he also grabs a shirt to put on over the top.</span></div></div>",
            "created":1301893200,
            "id":1081748,
            "title":"Go swimming "
        },
        "11432221":{
            "author_id":"thumbs13",
            "author_name":"potato",
            "choices":[
                "Meet up with Pete.",
                "While swimming."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Adam starts to get uncomfortable with a shirt on, so he takes it off and puts a bikini on. Adam justifies it by saying it's more comfortable</span></div></span></div>",
            "created":1497589200,
            "id":2336789,
            "title":"on the way there"
        },
        "115":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Go All out",
                "Masculine as possible",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>going to the main kitchen you see a few other people there as well, you introduce yourself.<br>\r\n<br>\r\nOne girl, Amy says hi and then tells you that theres gonna be a party/get together tonight in the common room, and that for fun everyone is going to dress in the clothes left in their room.<br>\r\n<br>\r\nYou're a bit put off, not sure you want to dress like a teenage girl, especially in front of a bunch of strangers.<br>\r\n<br>\r\nShe sees the hesitation<br>\r\n<br>\r\n\"don't worry about it, everybody somehow ended up in weird rooms, me and my roomate are in a room with a mother and baby daughter, we flipped a coin, I'm the baby, My friend got a little boys room, I'm sure somebody else thats a guy will be dressed as a girl, please come, it'll be fun\"<br>\r\n<br>\r\nYou agree, she tells you they're starting in two hours, so you should start getting ready, and she says \"don't worry about looking perfect, this is for fun, but as for me, I'm going all out, so you can too if you want.<br>\r\n<br>\r\nYou head back to your room, looking through the dressers and closet, you find anything from girls jeans and T-shirts to skirts dresses and girly tops, in one section theres makeup, and for shoes, theres every type you can imagine, tennis shoes, girls flats, low heels, medium heels and pretty high heels. You just have to decide if you just want to do it and get it over with, wear the most masuline stuff you can find, or really go all out</span></div></div>",
            "created":1334984400,
            "id":1319914,
            "title":"He decided to get something to eat"
        },
        "1151":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "At the Party",
                "Later",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>That Amy girl was pretty cute, and after she told you she was going to go all out for her outfit it didn't seem like a lot of others would, she'd definitely be happy if you went all out too, who knows, maybe dressing like a girl would be the thing that got you a girlfriend, that'd be ironic.<br>\r\n<br>\r\nyou begin to browse through the girls clothes in the closet, you want to pick the girliest thing you can find to do this well. Browsing through the closet you find what seems to be a halloween costume, a sexy school girl, putting that aside, there's a prom dress, which would work, but you want to look like a normal teenage girl, so you put that aside, you find a denim mini-skirt, \"perfect\"<br>\r\n<br>\r\nyou continue browsing, girly T-shirts, aren't good enough, a few plain tank tops, finally finding a dress-like top thats really feminine, but somehow you realize that it doesn't go well with the denim skirt, you settle on a white long sleeve top, with the words glamorous with hearts and stars around it, you set it beside the skirt, next is underwear, then shoes.<br>\r\n<br>\r\nYou can't wear your boxers under the mini skirt so you pick the first pair of panties available, same with the bra, making sure its white so it doesnt show through the white top. finally you take a pair of what look like 3 inch heels, after comparing them to the skirt, the lower heels didn't look good, so you settled on the 3 inch<br>\r\n<br>\r\nBefore changing you decide to paint your nails, pink is the obvious choice, you do your toes first for practice, then move onto your fingers, they're not perfect, but not bad either.<br>\r\n<br>\r\nYou look at your legs and sigh, you have more to do, you need to shave your legs, luckily you started so early to give you time, you look online for some techniques on how to shave legs and find a few good tips and proceed to take a shower, slowly shaving your legs in there.<br>\r\n<br>\r\nYou use the feminine body wash and shampoo and conditioner.<br>\r\n<br>\r\nAfter getting out of the shower you run your hand down your legs, your impressed how good a job you did, it wasn't even that hard. You proceed to put on the panties, situating your crotch to give a smooth front, then slide the skirt up your legs, you didnt realize just how short it was, it doesnt even make it to your knees, it'll be so easy to accidentally flash your panties, how do girls where skirts this short.<br>\r\n<br>\r\nyou struggle to get the bra on before giving up and clipping it first then slipping it on like a shirt, you put two socks in each cup to fill it, then slipping the White top on over it.<br>\r\n<br>\r\nLooking in the mirror you can honestly say that your body passes pretty well for a girl, your head on the other hand doesn't, you still need to get makeup done well.<br>\r\n<br>\r\nYou know a girl moved into the room next to yours, so you quickly slip out and knock on her door, not really ready to be seen like this just yet.<br>\r\n<br>\r\nShe answers, wearing a thin wife beater, but with a bra underneath and baggy jeans, you can tell shes wearing makeup too, guess shes not going as all out as you are. You both have the same reaction<br>\r\n<br>\r\n\"so you're going to this party thing too?\" she says first<br>\r\n<br>\r\n\"uhh he he yeah... thats why I'm here... I wanted to really go all out... just for fun you know, but... I can't do my makeup, do you think you could help me out?<br>\r\n<br>\r\noh, uh yeah sure why not, I'm finished getting ready anyways, as you can see I was kind of lax with my clothes, I couldn't not wear a bra with this grungy shirt. but you look pretty good so far, good job.\" she says as you lead her back to your room.<br>\r\n<br>\r\nShe sits you in front of the makeup table and goes to work.<br>\r\n<br>\r\nA few minutes later shes finished it looks great, but shes not done she starts on your hair, its not too long so she curls it.<br>\r\n<br>\r\nAlmost half an hour later shes done with your hair instead of the shaggy look you usually have now its tight and bouncy on your head, not to mention feminine.<br>\r\n<br>\r\n\"there, ya go, looks great, see you out there, I'm heading out.\" she says.<br>\r\n<br>\r\nYou get up, examining your made up face, you barely recognize yourself, and you hate to admit it to yourself but you love your hair like this.<br>\r\n<br>\r\nbut you dismiss the thought, not wanting to be late you slip on your shoes, a pair of 3 inch heels, and miraculously don't have any trouble walking in them at all, you'd always imagined them to be hard to walk in but you gracefully take each step without a problem, you must be channeling your inner teenage girl, you joke to yourself.<br>\r\n<br>\r\nYou head out and into the common room, spotting a purse as you leave your room grabbing it, even though its empty</span></div></div>",
            "created":1335070800,
            "id":1320592,
            "title":"Go All out"
        },
        "11511":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Go as a guy",
                "Go as a girl"
            ],
            "content":"<div class=\"\"><div> <span>Nervous, knowing your about to meet a bunch of people dressed like a teen girl you walk into the common area where your nervousness mostly subsides, everyone else here is doing the same thing, though not all are dressed like teenage girls, and most havent gone to the extent you have, but a few did.<br>\r\n<br>\r\nYou see Amy across the room, wearing only a diaper and a plain T-shirt, and she's standing next to a girl who must be her roommate, wearing a pair of 'Mom' Jeans and a T-shirt.<br>\r\n<br>\r\nYou go up to talk to her.<br>\r\n<br>\r\n\"Adam you made it! And damn, you look good, I'm glad, you too this serious, only a handful of other people did, I was hoping I wouldn't stand out, There's that girl over there dressed in a suit and tie, and a guy and girl over their that got a room of twins, other than that, everyone else just took the easy way out and just threw on something from the closet.\"<br>\r\n<br>\r\nYou talk with Amy for a bit before getting a drink and snack.<br>\r\n<br>\r\nYou grab a seat on the couch, crossing your legs so nobody can get a glance up your skirt. A girl you hadn't met before, wearing slightly torn, baggy jeans, and a polo shirt, without a bra, sitting in a chair across the room comes over and sits next to you.<br>\r\n<br>\r\n\"I love that you went all out, you look so good its amazing, almost like you do this often.\"<br>\r\n<br>\r\nYou laugh, \"Nope, Scouts honor, first time I've dressed like this. I just decided to go all out for fun.\"<br>\r\n<br>\r\n\"Well before you crossed your legs I caught a glimpse up your skirt, your even wearing panties, that's commitment.<br>\r\n<br>\r\nYou blush, \"Yeah like I said, I went all out\"<br>\r\n<br>\r\nFor the rest of the party you and Alexa, you learned her name was, talked and laughed, you learned you had a lot in common.<br>\r\n<br>\r\nAs the party was wrapping up, Alexa said.<br>\r\n<br>\r\n\"Hey, if you're not doing anything later, you should come over and we can hang our or whatever\"<br>\r\n<br>\r\n\"Sure\" You respond, \"only been here a day, no time to make any plans, I'll probably be back in normal clothes though\" You laugh<br>\r\n<br>\r\n\"you wear whatever you want.\" she gets up and heads out.<br>\r\n<br>\r\nYou start to leave a few minutes later, passing Amy and her roommate as you go<br>\r\n<br>\r\n\"I'd be happy to babysit if you ever need me too\" You joke to Amy's roommate.<br>\r\n<br>\r\n\"Ha\" she laughs \"I'm not sure you can handle her, she can be a handle at times.\" Amy sticks her tongue out as she hears this.<br>\r\n<br>\r\nYou head back to your room, you were gonna hang out with Alexa in an hour should you change out of this, or meet up with her as a girl.</span></div></div>",
            "created":1382850000,
            "id":1684748,
            "title":"At the Party"
        },
        "115111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Alexa's still dressed as a guy",
                "Alexa's back to being a girl"
            ],
            "content":"<div class=\"\"><div> <span>You decide Alexa might think it was weird if you stayed dressed as a girl after the get together was over. You step out of your heels and slide out off your skirt, take off your shirt and bra, and are about to take off your panties but figure, nobody will know, so you just put on a pair of your own pants on over them.<br>\r\n<br>\r\nYou go to your bathroom and slowly begin removing you makeup, but can't find a way to get your nail polish off, so you leave it on for now you throw on a shirt and try and scruff up your hair and make it look a bit more masculine but only slightly succeed, its still somewhat curly and feminine looking.<br>\r\n<br>\r\nAll dressed and looking almost 100% like a guy again you put on your own socks and shoes and head to the room number Alexa.</span></div></div>",
            "created":1382850000,
            "id":1684754,
            "title":"Go as a guy"
        },
        "1151111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "The next morning",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You knock on the door, and Alexa answers still dressed like a guy like she was at the party.<br>\r\n<br>\r\n\"Oh I was expecting to see you as a girl for the first time.\"<br>\r\n<br>\r\n\"Yeah, I was just being lazy after the party, figured we could just play some video games and hang out, no need to get all dressed up again, especially since this way its almost a guys night.\"<br>\r\n<br>\r\n\"Sounds like fun, yeah I guess it is.\" Alexa lets you in and hands you a 360 controller, she's already got Halo 4 on, and makes it a multiplayer match.<br>\r\n<br>\r\nYou spend the next few hours playing through the campaign, until you realize how late its gotten, You bid Alexa goodnight and head back to your room, deciding to just sleep in your clothes, you head to sleep.</span></div></div>",
            "created":1382850000,
            "id":1684756,
            "title":"Alexa's still dressed as a guy"
        },
        "11511111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Continue",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Your awoken by a knocking on your door, you groggily get up and check who it is.<br>\r\n<br>\r\nIts Alexa once again dressed as a boy, but not like last night like it was just left over, she had redressed and re-made herself into a boy again.<br>\r\n<br>\r\n\"I'm beginning to doubt I'll ever see you as a girl.\"<br>\r\n<br>\r\n\"Ha, who knows, I was wondering if you want to go out into town to get breakfast?\"<br>\r\n<br>\r\nYou almost say yes but pause, \"Only if you go back to dressing like a girl\"<br>\r\n<br>\r\nShe pauses to think about it \"Alright...IF you let me take you out on a date tonight as a girl, And I'll be a guy\"<br>\r\n<br>\r\n\"Your kidding. You want me to dress like a girl again?\"<br>\r\n<br>\r\nThat's my offer, I'll go to breakfast with you as a girl, if you go to dinner and Movie with me as a girl.\"<br>\r\n<br>\r\nyou go back and forth you want to refuse, but something inside you won't let you, alright fine\"<br>\r\n<br>\r\n\"Really? Awesome I'll go change into something more befitting my gender, you wake up and get dressed I'll meet you in half an hour at your door.\" She turns and heads back to her room.<br>\r\n<br>\r\nHad you really promised to go on a date with her dressed as a girl again? Sure you'd done it yesterday but everyone was dressed up how did she expect you to go out tonight like that?</span></div></div>",
            "created":1386824400,
            "id":1706974,
            "title":"The next morning"
        },
        "115111111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Sexy",
                "Classy"
            ],
            "content":"<div class=\"\"><div> <span>You shower and change and meet Alexa in front of your room, she's dressed in a cute sun dress and her hair is curled and she's wearing makeup.<br>\r\n<br>\r\n\"You look great, I don't know why you keep dressing like a guy when you look this good in a dress.\"<br>\r\n<br>\r\nAlexa replies \"Thanks, but I thought you were pretty cute as a girl yourself, cuter than me for sure.\"<br>\r\n<br>\r\nyou laugh it off and head to a nearby breakfast diner and get some food, Alexa even lets you pay, like it was a date, which only serves to remind you that you agreed to swap roles later tonight.<br>\r\n<br>\r\nYou head back and decide to play some video games in Alexas room for a while.<br>\r\n<br>\r\nBefore you know it, its mid afternoon and your starting to get bored of playing video games, which was weird for you, you usually could and would play all day long.<br>\r\n<br>\r\nyou excused yourself saying you needed time to get ready for your date tonight.<br>\r\n<br>\r\nyou head back to your room and look at your options, should you wear a dress or skirt and blouse? What color nail polish should you use, what style of makeup. You felt overwhelmed, you started to understand why girls took so long to get ready, the variety and options was just too much.<br>\r\n<br>\r\nyou decided you needed help, you decoded to go ask Amy, the girl who came up with the whole party event yesterday.<br>\r\n<br>\r\nYou knocked on her door, it took a minute but Amy finally answered looking like she just work up, You noticed all she wore was a diaper and T-shirt, then she suddenly blushed and slammed the door, and reopened it a minute later.<br>\r\n<br>\r\nNow she was wearing pants and a bra under her shirt as well.<br>\r\n<br>\r\n\"Please don't tell anyone I was still wearing a diaper\" she whispers as she let you into the room \"what can I do for you?\"<br>\r\n<br>\r\nDon't Worry, I can't really judge you... Anyways I've got a date with Alexa tonight and I need help figuring out what to wear.\" You reply<br>\r\n<br>\r\n\"Oh yeah? I met her, cute girl, good for you, but why do you need my help deciding what to wear? I'm no expert at guys clothes.\" Amy replies<br>\r\n<br>\r\n\"Well I sort of agreed to let her take me out... You know with her as the guy, and me... The girl.\"<br>\r\n<br>\r\n\"Oh... Hehehe, So I guess I'm not the only one still in my role from the party.\"<br>\r\n<br>\r\nShe agrees to help and you show her to your room, you can see the bulge of her diaper under her pants still.<br>\r\n<br>\r\n\"Lets see, you said it was dinner and a movie right, you should definitely dress...\"</span></div></div>",
            "created":1386910800,
            "id":1707092,
            "title":"Continue"
        },
        "1151111111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Hang out with Amy for a while",
                "Later, rhe dat with Alexa"
            ],
            "content":"<div class=\"\"><div> <span>\"Sexy? Really? Don't you think I could just wear a T Shirt and jeans, maybe a long skirt.\"<br>\r\n<br>\r\n\"No way\" she said, \"you like this girl right? What if you went on s date with a girl. And she wore pants, you'd be disappointed, I know it, Soooo. Wear this skirt, its pretty short but it'll show Alexa that you really like her.\"<br>\r\n<br>\r\n\"Alright, you're the expert.\" you pick out a pair of white panties and take the skirt short baby blue skirt Amy's holding out for you.<br>\r\n<br>\r\n\"Are your legs still smooth from when you shaved then yesterday? Make sure they are.\"<br>\r\n<br>\r\n\"Alright alright, pick out a top for me, while I change.\" You step into the bathroom and stop your jeans and boxers off and slide the panties on, adjusting yourself into them then slide the skirt on over them.<br>\r\n<br>\r\nyou realize now just how shirt the skirt is now, you thought you were wearing a mini skirt yesterday, you weren't even close, this one had trouble covering your thighs, you hoped Alexa appreciated what you were going through for this date<br>\r\n<br>\r\nYiu checked your legs, still smooth as butter, Amy had a Halter top for you.<br>\r\n<br>\r\n\"Find a strapless bra, that's one without shoulder straps and stuff it, then out this on.\"<br>\r\n<br>\r\nYou comply finding just such a bra, the back strap had extra grip so it wouldn't slide off then you stuffed it with pantyhose rather than socks  this time before donning the Halter top.<br>\r\n<br>\r\nAmy then picked out the shoes you'd wear, heels, and the color nail polish you should wear, then sat you down to do your makeup.<br>\r\n<br>\r\nFinally Amy pronounced you ready to go and you still had an hour before you planned to meet Alexa, you thought you looked pretty good you thought, you hoped Alexa would agree.</span></div></div>",
            "created":1386997200,
            "id":1707588,
            "title":"Sexy"
        },
        "11511111112":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Continue",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Later tonight, you meet up with Alexa, though you agree to call her Alex for tonight, and she'll call you Abby.<br>\r\n<br>\r\nThe date goes well, and you both agree to do it again soon.<br>\r\n<br>\r\n================================================<br>\r\n<br>\r\nOver the course of the next three weeks you go out most nights... usually switching back and forth between whos the boy and whos the girl, You're starting to become a natural at girls clothes and makeup.<br>\r\n<br>\r\nnearing the end of the third week, you're hanging out in Alex's room, dressed in a summer dress and strappy heeled sandals with painted nails and makeup, curled up against Alex watching a movie. quite like a girl would with her boyfriend.<br>\r\n<br>\r\n\"You know...\" You start. \"I just realized I've been the girl in the relationship all week, I thought we were alternating.\"<br>\r\n<br>\r\n\"Yeah I thought so too, but after we went to the mall on Sunday, You never brought up what we'd do tomorrow, so we just stayed the course, and I hadn't really thought about it since... You don't seem to mind much wearing dresses.\"<br>\r\n<br>\r\n\"Well... no, not really anymore, its still a bit odd, but you're right... I really don't mind it, any of this, which is weird, I'd never had any thoughts like this before moving here, or dating a girl who's rather be a boy. what about you?\"<br>\r\n<br>\r\n\"Same, I used to be much more girly, but havent been into it since moving here, nor did I ever have feeling for boys dressed as girls, but you are just too cute\" Alex says giving you a quick kiss.<br>\r\n<br>\r\nYou blush \"So... What do we do? Just stay the course? Would you want me to be a girl all the time? not just on our date nights?... Cuz I wouldn't mind...\" You say, surprised at your words yourself\"<br>\r\n<br>\r\n\"I wouldn't mind having a girlfriend full time, if you don't mind having a boyfriend.\"<br>\r\n<br>\r\n\"I'd love a full time boyfriend\" You can't believe you just said that. You stand up, as Does Alex, and you notice that s/he's taller than you... had s/he always been taller?</span></div></div>",
            "created":1391230800,
            "id":1736448,
            "title":"Later, rhe dat with Alexa"
        },
        "115111111121":{
            "author_id":"rodgers12",
            "author_name":"bigtimewinner",
            "choices":[
                "the next morning..",
                "you wake up in the middle of the night startled.."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Alex! you're taller than me now\". you said. Alex notices this change too and seems excited about it.<br>\r\n\"I kinda like being taller for once\" alex exclaimed. \"I feel the same way about being shorter\" you told him. <br>\r\nI could get used to this being a girl thing, you thought with a smile.<br>\r\n<br>\r\n as you look up to kiss your new boyfriend goodnight. you say \" how about we go for a run together in the morning?\" <br>\r\nAlex replies \"Yeah, love to Abby\".<br>\r\n<br>\r\nwith that, you kiss and hug each other for what feels like an eternity.  both of feel like you were walking on air.<br>\r\nwhen you finally let go, you stare into each others eyes and get a rush of warmth and happiness that everything is going to be <br>\r\nokay.<br>\r\n<br>\r\nAlex then asks you if you want to spend the night. You feel a gigantic smile form on your face and you climb into bed and simply fall asleep in each others arms.</span></div></div>",
            "created":1434690000,
            "id":1995304,
            "title":"Continue"
        },
        "1151111111211":{
            "author_id":"rodgers12",
            "author_name":"bigtimewinner",
            "choices":[
                "after your run",
                "later that evening"
            ],
            "content":"<div class=\"\"><div> <span>As you wake up you kiss Alex, and say good morning cutie! Alex smiles and says right back at you pretty thing! <br>\r\nYou decide to head for a quick breakfast before going for a run. After a pleasant breakfast together you return<br>\r\nto your room to pick out some workout clothes.  you find a pair of knee length yoga pants that are mostly black and have a pink stripe on each side. Once you slide them on you notice that you really enjoy the snug feeling they give you.  next you pick out a bright neon green sports bra to wear, you decide that it will be fine to just wear the bra.  You then find some elastic athletic wrap to keep your hair out of your face, it seems overnight your hair has grown because it now droops down and almost covers your face. <br>\r\n<br>\r\nYou then join Alex in the entrance hall, Alex is wearing navy gym shorts and a grey t-shirt with the sleeves ripped off. You smile at each other and compliment <br>\r\none another on your looks, and decide to go for a jog on the path that runs along the creek behind the mansion.    </span></div></div>",
            "created":1434690000,
            "id":1995319,
            "title":"the next morning.."
        },
        "115112":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Alexa's back to being a girl",
                "Alexa's still dressed as a guy"
            ],
            "content":"<div class=\"\"><div> <span>You decide it'd be too much effort  to change out of all this, since you only had an hour to make yourself look like a guy again, but you were somewhat curious about what other clothes were here. You opened up the closet and checked out the closet.<br>\r\n<br>\r\nafter browsing you decide... for some reason to wear a dress to Alexa's that's bound to surprise her, you can't wait to see the look on her face when she sees you looking even more feminine than before.<br>\r\n<br>\r\nYou pick out a <a class=\"duLink\" rel=\"nofollow\" href=\"http://chomp.com.br/blog/wp-content/uploads/2012/10/Vestido-Manga-Babados.bmp\">cute dress</a>  <a title=\"New Window\" href=\"http://chomp.com.br/blog/wp-content/uploads/2012/10/Vestido-Manga-Babados.bmp\" rel=\"nofollow\" target=\"_blank\"><img loading=\"lazy\" style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a> you actually liked and put it on after stripping off your skirt and top. you checked your makeup in the mirror and decided you could use a touch up on your lipstick so you carefully reapplied some before stepping back into your heels and heading to the room number Alexa gave you.</span></div></div>",
            "created":1382850000,
            "id":1684762,
            "title":"Go as a girl"
        },
        "1151121":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Continue with the slumber party",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You see Alexa dressed in a Tight baby blue T-shirt, a skirt she's got her hair down, and is wearing a bit of makeup.<br>\r\n<br>\r\n\"Oh wow a dress! I'd hoped you'd come as a girl but expected you to just stick with what you were already wearing, I love that dress, and for a boy you pull it off so well. Come on inside.\" she motions for you to come in.<br>\r\n<br>\r\n\"Like I was saying I was hoping you'd come as a girl because I kind of want to have a girly slumber party with you... if you want to.\"<br>\r\n<br>\r\nSurprisingly, even to yourself that did sound like fun \"Yeah I want to, wait here, let me run to my room and find some PJ's there's bound to be some.\"<br>\r\n<br>\r\n\"Ok I'll find a movie to watch.\"<br>\r\n<br>\r\nYou quickly mince back to your room and find <a class=\"duLink\" rel=\"nofollow\" href=\"http://lookwhatmomfound.com/wp-content/uploads/2010/11/jammies.jpg\">two</a>  <a title=\"New Window\" href=\"http://lookwhatmomfound.com/wp-content/uploads/2010/11/jammies.jpg\" rel=\"nofollow\" target=\"_blank\"><img loading=\"lazy\" style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a> <a class=\"duLink\" rel=\"nofollow\" href=\"http://media.plussizetech.com/womanwithin/mm/0015_47132_mm.jpg?wid=331&amp;qlt=95&amp;op_sharpen=1\">pairs</a>  <a title=\"New Window\" href=\"http://media.plussizetech.com/womanwithin/mm/0015_47132_mm.jpg?wid=331&amp;qlt=95&amp;op_sharpen=1\" rel=\"nofollow\" target=\"_blank\"><img loading=\"lazy\" style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a> of Pajama's in the closet, you brought both back with you<br>\r\n<br>\r\n</span></div></div>",
            "created":1382850000,
            "id":1684777,
            "title":"Alexa's back to being a girl"
        },
        "12":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "He heard a single persom arrive",
                "He heard several people arrive",
                "He decided to go for a walk around the 1st floor",
                "He decided to take a brief nap",
                "He decided to get something to eat"
            ],
            "content":"<div class=\"\"><div> <span>Looking inside, it looked like a typical young girl's room. Inside, the walls were pink and had girly decorations on them, and it was full of dresses, dolls, and other things that little girl's liked. He guessed it used to belong to a girl who was 8, though he didn't know why he thought that it was that age specifically. Adam briefly considered finding a different room, but then decided he might as well use it. \"Why not? I'll just clear the stuff out later. Its pretty close to the stairs, so I don't have to walk too far back and forth when going downstairs.\" he reasoned. He put his bags in the room.</span></div></div>",
            "created":1280120400,
            "id":924620,
            "title":"A young girl's room"
        },
        "121":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Heather accepts Adam's offer",
                "Heather declines Adam's offer",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>After putting his stuff in the room, Adam heres the doorbell ring. \"I guess another person has arrived.\" he comments to himself. Deciding to get aquainted with the people hes staying with, Adam heads downstairs to meet whoever it is.<br>\r\n<br>\r\nHe walks down the steps just as he sees Ms. Sterious walking out of the room, and sees a girl his age standing near the doorway with several bags. Seeing him coming down the stairs, she greets him. \"Hey there. I guess you're one of the other students staying here, right? My name is Heather.\" she says<br>\r\n<br>\r\n\"Hey. I'm Adam.\" he says. \"Looks like you've got a lot of stuff there. You want me to help you carry them?</span></div></div>",
            "created":1280120400,
            "id":924912,
            "title":"He heard a single person arrive"
        },
        "1211":{
            "author_id":"yogi-bear",
            "author_name":"Undbitr",
            "choices":[
                "teenage boy",
                "younger boy",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"yeah sure\" she says. then she begins to walk up the stairs to a room on the second floor. <br>\r\nAs she approaches the door to the second floor you ask \"hey how about you take the room across from me?\"<br>\r\nShe says \"yeah that would be fun.\"<br>\r\nwhen she opens the door to her room she finds that it's a room for a...</span></div></div>",
            "created":1294808400,
            "id":1034342,
            "title":"Heather accepts Adam's offer"
        },
        "1212":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Follow Heather as she picks a room.",
                "Follow Adam as he goes for a walk",
                "Follow neither and someone new arrives"
            ],
            "content":"<div class=\"\"><div> <span>\"Thanks, but I've got everything handled.\" Heather says. \"I can take care of this.\"<br>\r\n<br>\r\n\"Well, alright. But If you need anything, just find me and I'll lend a hand.\" Adam tells her before he heads off to to walk around the house. Heather meanwhile, made her way upstairs to pick a room.</span></div></div>",
            "created":1280120400,
            "id":925092,
            "title":"Heather declines Adam's offer"
        },
        "12121":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Twenty something male rocker.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>                       Heather chose the  second floor noticing that, Adam the boy she just meet also picked a room on  this floor. She walked further down the hallway to a door that was close to the washroom , common room, and kitchen. She put her bags down to open the door  finding that the previous  occupant was.<br>\r\n</span></div></div>",
            "created":1287032400,
            "id":974711,
            "title":"Follow Heather as she picks a room."
        },
        "121211":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Continue to fallow Heather.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n                                      As  she enter the room she came to discover that  it had belonged to a guy  who was into rock music. She observed that he had quite the music collection from old vinyl records, tapes, and cd’s  from 50’s to today along the back wall of the room.<br>\r\n<br>\r\n “ He must have really liked 80’s and 90’s hard rock and heavy metal since it seems to be the center of this persons collection.” Heather commented.<br>\r\n  <br>\r\n                  She began to explore the rest of the room which was fairly decent sized for one person but then again the hole house is huge. Looking through the closet which  had  lots of room for her stuff . It was filled with rock band t-shirts , various types of pants ,  and bye themselves on the far end were three  leather jackets.  With one looking like has been worn a lot.<br>\r\n                    Heather  forgetting about the rest of the room was transfixed  by the well worn jacket. Taking the jacket of the hanger and put it on and went over to mirror on the wall to get better look at herself.  “It’s a little big for me but,  I like the way it looks and feels and anyway  Ms. Sterious  said that whatever was in here we should view it as ours now” said Heather.  “ Anyhow back to exploring.” she exclaimed. Looking around the room she noticed below the mirror that there was a shelf full of makeup and hair dye. <br>\r\n              <br>\r\n          On other side of the room was dresser for all  her under garments  and knick knacks . Beside it in the corner was an amp with electric  guitar hooked up there was some sheet music sitting on top  of the amp. And in the middle of the room was  queen sized bed  cover in red silk sheets. On top of  a black wooly area rug.  Heather being impressed  went  to bring her suit cases in from out in the hall. Feeling  that she made the right choice for a room.<br>\r\n</span></div></div>",
            "created":1298523600,
            "id":1059861,
            "title":"Twenty something male rocker."
        },
        "1212111":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Explore /Relax",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n                      Heather after halving put her suit cases down on her new bed opened them up to put her cloths away in the dresser. She opened up the first few drawers finding a book  full of concert ticket stubs  and autographs , a few of them very famous names.  After looking through the book  for a while heather remember that she still had to unpack . <br>\r\n<br>\r\n                   “Might as well listen to some music while I am putting things away,” commented Heather. So she went over to the shelves with the extensive music collection.  After looking she found  an AC/DC ‘s Back in Black album record  and put on the full blown stereo system with all the bells and whistles. It was  sitting on the same shelf with all those albums.  Heather cranked the speaker just loud enough  as  to not bother anyone else on this floor.  <br>\r\n<br>\r\n                   She went back to unpacking her things, while singing along the songs and not realizing that she is doing it. She fit all of  clothes into dresser where she found a bunch  boxers , briefs, and socks in the bottom drawers .The last of the  luggage was her shoes so went  the closet and on the end with the leather jackets just below them was shoe rack filled pair combat boots, a snake skin pair of boots, and few fair tennis shoes.  There was enough room on the rack for her few pairs of shoes.  <br>\r\n<br>\r\n                      All the while still wearing the leather jacket and after putting away her suit cases she sat down on her bed trying to decide  weather to go explore the rest of the house , lay back and relax until dinner, or go through the closet .<br>\r\n</span></div></div>",
            "created":1298610000,
            "id":1060244,
            "title":"Continue to fallow Heather."
        },
        "12121111":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "While exploring meeting with Adam again.",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>                                                                                                          After kicking of her shoes Heather  laid back on the bed to relax for a while and drifted off to sleep. Heather woke up a short time later rubbing her eyes  she looked at the clock to see what time it was. “Wow  I must have been more tired than I realized ,”said Heather  seeing that she feel a sleep for over an hour Well might as well go explore the rest of the house before dinner. But, first I should freshen  up first”, said Heather.  Going over to the mirror were she found the makeup  and hair products earlier she picked up  a brush to comb her long hair that went down past her shoulders . After combing her hair back she put it into simple pony tail .she went to put some shoes instead of  hers she grabs sneakers from the closet liking the way they looked and put them on. They are little loose but still fit. <i>The guy living here before must have been on the small side for his jacket and stuff to almost fit me</i>, thought Heather. Grabbing her new jacket she went to explore the rest house.<br>\r\n</span></div></div>",
            "created":1298696400,
            "id":1061084,
            "title":"Explore /Relax"
        },
        "121211111":{
            "author_id":"arclight",
            "author_name":"Pass me some dank fetish memes",
            "choices":[
                "Crank it up to 11.... (Play guitar)",
                "There's a starman, waiting in the sky... (Listen to the tape)"
            ],
            "content":"<div class=\"\"><div> <span>Heather exited her room with her new jacket and headed downstairs. You see a few new people, among them being that kid that wanted to help you out. You think his name was Adam or something...?<br>\r\n<br>\r\nThe conversation between you two goes something like this;<br>\r\n\"Hi heather!\"  \"Hey there... Dude?\" \" did you find your room ok?\" \"Yeah, I did\" \"That is great to hear!\"<br>\r\n<br>\r\nOnce that awkward conversation finished up, you finally actually look at him while he was walking away.<br>\r\n\"Are those... Mary-janes that he is wearing?\" You mumble with curiosity. You also talk to a few other people that seem a bit... Off.<br>\r\nYou now decide that it may be better for you to walk to a different room for now. <br>\r\n<br>\r\n<br>\r\nYou head over to the music room but on the way, you see Adam and some other dude that looked to be about his age watching some princess movie. \"I never took him as the kind of guy who liked princess movies.\"<br>\r\n<br>\r\nNow that you are in the music room, you see a few instruments. Most of them are what you'd consider lame (viola, tuba, clarinet piano, etc) but in the back of the room, you see what appears to be a beat-up old stratocaster electric guitar. You also see a cassette player but you didn't bring any cassettes, did you? Bummed out, you put your hands in your jacket pockets. But you feel an oddly rectangular object in there. By your fantastic luck, there was a cassette in there. It was \"the rise and fall of ziggy stardust and the spiders from mars\". You never remembered being too fond of Bowie tunes, but for some reason, you are incredibly stoked to have it with you. So, now you...</span></div></div>",
            "created":1463288400,
            "id":2148371,
            "title":"While exploring meeting with Adam again."
        },
        "1212112":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Fallow the Benet's .",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>          While Adam and Heather were getting settled in their new rooms . Some one was knocking  at the front door some more of the new tenants arrived  Ms. Sterious  answered the door revealing a party of three  a very beautiful middle aged woman and two kids, a teenage girl  and little boy. “ Well hello please come on in “greeted Ms. Sterious. <br>\r\n<br>\r\n                    “Thank you miss “ said the woman .  “your very welcome and the names Ms. Sterious  you must be the Benet’s” said Ms. Sterious .  “ Correct I am Victoria and these are my children  Sidney my oldest and Mathew my youngest . The academy should have called and made arrangements for us,” said  Victoria. “They have all you need to do is sign  some paper work since your one of the teachers there and have agreed to be one of  the resident advisers to help take of the students that will be staying here.” answered  Ms. Sterious.<br>\r\n<br>\r\n                   “There on the third and forth floors have more family friendly  accommodations’ and  are little more private, just pick which ever rooms you want, “commented Ms. Sterious while handing them each a sign with their names on it. “Go pick out your rooms we’ll do the paper work later . By the way I haven’t had a chance to clear out the previous occupants things out yet so feel free to keep what ever there is,” said Ms. Sterious.<br>\r\n<br>\r\n                    “Thanks Ms. Sterious for your help we’ll see you later, “said Victoria. “Before you go just want let you know that there are already a couple students here and that are around Sidney’s age. Also there is some playground equipment for young  Mathew to play on out back. See you at dinner.” Commented Ms. Sterious. With that she was gone leaving the Benet’s to go pick there rooms.<br>\r\n</span></div></div>",
            "created":1298782800,
            "id":1061341,
            "title":"something else"
        },
        "12121121":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Stay with you.",
                "Go and choose my own room."
            ],
            "content":"<div class=\"\"><div> <span>                   Going up to the forth floor the Benet’s where about to go into one of the apartment sized rooms.Victoria stopped and looked to Sidney an asked, “Sidney, honey if you want to you can go to one of the other rooms and pick one for you? Your old enough to have your own space and it’s not like you are moving far away just to another part of the house.”  Sidney said, “Thanks mom I think I’ll.”<br>\r\n</span></div></div>",
            "created":1302670800,
            "id":1087297,
            "title":"Fallow the Benet's ."
        },
        "121211211":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Three teenage boys.",
                "A family of four."
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n          “Thanks mom I think I’ll stay with you  to help  keep an eye on  Mathew while you get things squired away with the school and here,” replied  Sidney.  “If you are sure. That would be big help maybe later you can move into your own room when things settle down and there still a room available,” said Victoria.<br>\r\n<br>\r\n          Mathew eagerly interrupted  his mother’s and sister’s conversation. “Mom, please hurry up  I want to go play out in the play ground out back,” Mathew said excitedly.  Victoria said, “First do not interrupt someone when they are talking it's rude. Second, you still have to unpack  your things. An  third you have to wait for Sydney to go with you  until we know this place little better so you don’t get lost. Also, you have to ask her  if she will take you before you go.\"<br>\r\n<br>\r\n         Mathew looked a little ashamed after that but went on to ask his older sister a question. “Sid, can you take out to the play ground outback latter,” asked Mathew ?  “Sure thing Matt after we put are stuff away,” replied Sidney. Mathew excitedly waited to put his things away . So with that their mother put the key into the lock and open the door and found that the apartment belonged to.<br>\r\n</span></div></div>",
            "created":1304226000,
            "id":1098071,
            "title":"Stay with you."
        },
        "1212112111":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "See which rooms they chose.",
                "Back to Adam or Heather."
            ],
            "content":"<div class=\"\"><div> <span>              Up on opening the door the Benet’s took in the look of the main room of the apartment  looked like a guys collage dorm room. In the corner their was a mini frig, a desk with a fairly new computer ,and on the opposite side of the room was big screen TV and a video game consol with tones of games. In the middle of the room the was good sized couch and recliner facing the TV. Of the main room there were 4 door three bedrooms and private bathroom for the family.<br>\r\n<br>\r\n                      “Well what do you think,” asked Victoria? Looking it over Sidney was impressed with the size of the apartment and having a private bathroom was huge plus in her book. “I’m kind a glad I chose to stay with you this means I won’t have to share bathroom space with the other tenets and won’t have to worry about someone accidentally coming in while I am in there,” replied Sidney.<br>\r\n<br>\r\n                     “Alright, lets get unpacked and get cleaned up for dinner latter and maybe go out back to the play ground and explore the grounds if there is time. So go pick a room and put your stuff away we’ll decide what to do with all this latter.” said Victoria while looking around the room. With that all three went to a door and went into their new rooms.  <br>\r\n</span></div></div>",
            "created":1305435600,
            "id":1106585,
            "title":"Three teenage boys."
        },
        "121212":{
            "author_id":"yogi-bear",
            "author_name":"Undbitr",
            "choices":[
                "teenage boy",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A teenage boy? or maybe not.</span></div></span></div>",
            "created":1293080400,
            "id":1021277,
            "title":"Something else."
        },
        "1212122":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Finish unpacking",
                "go wonder"
            ],
            "content":"<div class=\"\"><div> <span>Its an old dusty room of an old man's. There was a cane next to a cocker and an old rusty bed and on the dresser there was a shaving kit that looked to be older than the town. \"Gross\" Heather said as she went to turn away then she spoted something on the night stand. It was an old photograph of a beautiful woman. She felt an odd sensation in her groin area and put the picture down. \"Hmmm maybe I could get used to this\" she said while hurling her suit case on the dusty bed. She began to un pack a brightly colored pile of panties. She opened the drawer and noticed they were all filled with old man breifs. She took and pair out and laid them next to her pink lace \"hiptinni\" (VS) panties. \"Panties are so different from breifs they look tight and thoses laces have to itch and bunch. Not like my briefs though nice and relyable and what would people think if they saw pink poking out from my skirt.\" She began to slide her skirt off and said \"And they are diffinetly more comfoertable than this thong I put on! Wow I really must be looseing it wondering around with this thing on...at least its black though.\" She then looked at the rest of her panties and through them in an old trash can next to the door and pulled her white breifs up under her skirt. \"Man that better.\"</span></div></div>",
            "created":1298264400,
            "id":1058524,
            "title":"other"
        },
        "12122":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "He runs into someone else who had just arrived",
                "He gets back to his room"
            ],
            "content":"<div class=\"\"><div> <span>Deciding that he wanted to get to know the place he would be staying at, Adam went for a walk around the building. He passed by several rooms, like the kitchen, dining room, and a living room. He then came to another door that seem to catch his interest and felt like he realy wanted to see what was behind it even though it didn't look any different from the other doors. He then opened it to see it looked like a play room for kids. It was a pretty big room, with a lot of different toys around the room. He looked around at the many different kinds, not noticing he payed the most attention to the toys for girls like the dolls and dollhouse in the corner. He then saw a window and looked out to see a large playground in the backyard. \"Looks like fun for kids.\" he commented.<br>\r\n<br>\r\n\"Someone in here?\" Adam heard someone say, and saw a boy his age poke his head in.<br>\r\n<br>\r\n\"Oh, hi.\" Adam greeted the guy. \"You must be one of the other people staying here. I'm Adam.\"<br>\r\n<br>\r\n\"Hey, my names Mike.\" he greeted in return. \"Lookin around the house too?\"<br>\r\n<br>\r\n\"Yeah, just thought I check out some other rooms and ended up here.\"<br>\r\n<br>\r\n\"Me too.\" Mike said. \"Hey I gotta ask, is your room as stupid as the one I ended up with? I picked a room that used to belong to some 9 year old girl.\" Mike said.<br>\r\n<br>\r\n\"Really? I'm staying in a used to belong to an 8 year old girl.\" Adam said with interest, though he wasn't really sure why.<br>\r\n<br>\r\n\"Our luck sucks, huh? My 14 year old sister Jenny is staying here too, and she picked the room right next to mine and ended up with a room that looked like some high school football player. When I asked if she wanted to switch, she laughed and said no.\"<br>\r\n<br>\r\n\"That sucks.\"<br>\r\n<br>\r\n\"Well anyway, I'm gonna keep looking around. See ya.\" Mike said and left the room.<br>\r\n<br>\r\nDeciding to head back to his room, Adam left the play room as well. As he walked, he had a feeling that him and Mike were gonna get along great even though they had just met.</span></div></div>",
            "created":1291352400,
            "id":1007377,
            "title":"Follow Adam as he goes for a walk"
        },
        "121222":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "He runs into Mike",
                "He runs into some new people."
            ],
            "content":"<div class=\"\"><div> <span>Getting back to his room, Adam was about to get started with cleaning everything out, but then noticed it was getting pretty late, as. \"I guess I'll get to bed. I'll start cleaning everything tomorrow.\" he said with a yawn as he got undressed and got into the bed and fell asleep.<br>\r\n_______________________<br>\r\n<br>\r\nThe next morning, he awoke early and was a bit surprised to find a stuffed animal in his arms. \"Huh?\" he questioned out loud, and then noticed that there were several others in the bed with him. \"Must have grabbed it in my sleep.\" he said as he put it back onto the bed next to the other ones, not paying much attention to the action.<br>\r\n<br>\r\n\"Guess I should take a look around my roomm.\" he comments as he starts to look at all the stuff in the room, from the clothes in the closet and dresser, to all toys that were there. You wonder what you should do with all the stuff. \"It would be a shame to just get rid of all of this stuff; all of the stuff is still usable.\" he says out loud. Thinking it over, he decides to just leave it all here until he figures out what to do with it. He then starts to unpack all of his stuff and puts his clothes into the closet and dresser along with the girl's clothes.<br>\r\n<br>\r\nDeciding that it was now time to get dressed, he stripped out of what he had worn to bed, and grabbed one of his t shirts and a pair of his shorts from the drawers. When he reached in to get a pair of boxers, he was surprised when he accidentally pulled out a pair of panties. \"Whoops.\" he says. However, rather than putting them back, he gets the sudden urge to try them on. Not resisting this, he slipped them on and was surprised to find that they fit him, almost as if they were made for him. He then put his shirt and shorts on and walked out of the room. As he did, he forgot that there was anything strange about the fact that he was wearing them, and slowly started to think of them as his own.</span></div></div>",
            "created":1291352400,
            "id":1007740,
            "title":"He gets back to his room"
        },
        "1212221":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Follow Adam as he hangs out with Mike for a while",
                "Follow someone else"
            ],
            "content":"<div class=\"\"><div> <span>As Adam walked down stairs to get some breakfast, he sees Mike from yesterday at the bottom of the steps. \"Hey!\" he calls out to him, and Mike looks up and sees you walking down.<br>\r\n<br>\r\n\"Oh, hey Adam.\" Mike says. \"You getting some breakfast too?\"<br>\r\n<br>\r\n\"Yeah.\"<br>\r\n<br>\r\n\"Then lets head to the kitchen together\" he says.<br>\r\n<br>\r\nWhen you two get in, you se several other people already there. \"Oh, hey Adam.\" someone says, and you see Heather from yesterday.<br>\r\n<br>\r\n\"Hey Heather.\" he greets her. She then introduces him and Mike to the other people, who she had just met as well. There was Nate, who looked like he was maybe a year older than Adam, and Christine, who was the same age as well, and was Nate's girlfriend. Then there was Dan, who was a year younger than Adam. There was Sam, a girl younger than Adam. Then there was also Greg and Rachel, who both looked to be Adam's age as well. Adam also met Mike's sister Jenny who came in not long after him and Mike did.<br>\r\n<br>\r\nAfter everyone got to know eachother they all went into the dining room to eat. After talking for a bit, they all started talking about what kind of rooms they had ended up with. Adam told them about his room, then Mike, then Jenny.<br>\r\n<br>\r\n\"I ended up in some 8 year old boy's room.\" Heather said.<br>\r\n<br>\r\n\"Me and Christine are sharing a room.\" Nate said.<br>\r\n<br>\r\n\"I think it belonged to a married couple.\" Christine said.<br>\r\n<br>\r\n\"I think I'm in room for an 18 year old girl who is cheerleader.\" Dan said.<br>\r\n<br>\r\n\"I'm in a 28 year old man's room.\" Sam said.<br>\r\n<br>\r\n\"I got some 25 year old woman's room.\" Greg said.<br>\r\n<br>\r\n\"I just got here so I' haven't had a chance to get a room yet.\" Rachel said.<br>\r\n<br>\r\n\"Funny how we amost of us had the bad luck to end up in room for the opposite gender.\" Adam said with a laugh. After breakfast, they all go trheir seperate ways for now.</span></div></div>",
            "created":1291438800,
            "id":1007888,
            "title":"He runs into Mike"
        },
        "12122211":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Follow someone else",
                "Skip to the end of the day"
            ],
            "content":"<div class=\"\"><div> <span>After breakfast, Adam and Mike decide to hang out for a bit. After walking around the house and not finding much else to do, they decide to watch some Tv and sit on the couch. Flipping through the various channels they don't find much that they feel like watching. After a while, they come across a pretty girly princess movie, but rather than changing the channel, they leave it on and what the whole thing. After the end, Adam says \"It was alright.\" with a shrug.<br>\r\n<br>\r\n\"Better than I thought it would be.\" Mike says.</span></div></div>",
            "created":1291525200,
            "id":1008637,
            "title":"Follow Adam as he hangs out with Mike for a while"
        },
        "121222112":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Continue to follow Adam",
                "Switch POV to another character"
            ],
            "content":"<div class=\"\"><div> <span>Later that day, Adam gets ready for bed, and as he lays down into the bed, he sees the stuffed animals he had seen this morning. Without much thought, he takes the one he had woken up with, and holds it as he drifts off to sleep.<br>\r\n_______________________<br>\r\n<br>\r\nThe next morning, Adam gets out of bed with a yawn.<br>\r\n<br>\r\nLooking through his underwear drawer, he pulls out a pair of panties, then notices the boxers in there. \"Yuck. Can't believe I used to wear these.\" he says. He slips on the panties. \"These are much better.\" he says to himself. After that, he puts on a t shirt and shorts, he opens the closet to grab his sneakers, but then notices a pair of mary janes next to them. Without even thinking, he grabs them instead of his sneakers and buts them on, with them fitting his feet perfectly.</span></div></div>",
            "created":1291525200,
            "id":1008645,
            "title":"Skip to the end of the day"
        },
        "1212221121":{
            "author_id":"yogi-bear",
            "author_name":"Undbitr",
            "choices":[
                "Nighty",
                "panties and pink robe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>as he's passing some of the other people on the way to breakfast he sees Mike only he hasn't changed out of his pyjamas. What is he wearing?</span></div></span></div>",
            "created":1293426000,
            "id":1023287,
            "title":"Continue to follow Adam"
        },
        "12122211212":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Continue to follow Adam",
                "Follow someone else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Mike.\" Adam greet him not findinging anything wierd about his attire. After all, he wore panties too. \"Cute robe.\"<br>\r\n<br>\r\n\"Thanks. I'm gonna go take a shower.\" he says as he walks past him.<br>\r\n<br>\r\n\"Alright.\" he says, heading downstairs planning to ger something to eat. Downstairs, Adam passes by Dan. He was wearing a casual t shirt and shorts, but he also noted that Dan's face was adorned with make up, which looked perfectly applied. This of course doesn't seem odd to him.<br>\r\n<br>\r\nIn the kitchen, Adam finds Nate cooking breakfast, and also wearing an apron he had found. \"Morning.\" he said.<br>\r\n<br>\r\n\"Hey.\" Adam greets him. \"You cook?\"<br>\r\n<br>\r\n\"Apparently so.\" he says, and Adam gives him a questioning look. \"I've never cooked before, but it seems to come natural to me, I guess.\" he says. Adam also notice that Nate now has a pair of diamond earings in his ear, though he doesn't recall him having pierced ears yesterday. Shortly after, Sam comes in, looking like she had just come in from jogging. She doesn't seem to be wearing a bra, though neith boy stares. There was then a clicking sound on the kitchen tiles and Greg comes in wearing a t shirt, shorts, and a pair of heels on his feet. Adam then takes a seet, and he absentmindedly start swinging his feet back and forth. Not long after, everyone else joins them.</span></div></div>",
            "created":1295326800,
            "id":1037465,
            "title":"panties and pink robe"
        },
        "121222112121":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Skip to the end of the day",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Once he finished eating, Adam heads off to take a walk around the house. As he does, he wonders around, thinking about what to do today. He first thinks about watching TV. When he gets there, he finds Heather sitting on the couch, watching some cartoons. \"Hey.\" she greets him.<br>\r\n<br>\r\n\"Hey. What are yo watching?\"<br>\r\n<br>\r\n\"Don't know. I just turned it on a little while ago.\" she says. \"But it just seems cool for some reason.\"<br>\r\n<br>\r\nYou stare at the screenm watching the show play. However, unlike Heather, you just can't seem to get into watching it. After a bit, you head off to find something else to do. </span></div></div>",
            "created":1295499600,
            "id":1038796,
            "title":"Continue to follow Adam"
        },
        "1212221121211":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Follow Adam",
                "Follow someone else"
            ],
            "content":"<div class=\"\"><div> <span>Later that day, Adam gets ready for bed, and as he lays down into the bed, he grabs his favorite stuffed animal pulls it into a hug as he drifts off to sleep.<br>\r\n_______________________<br>\r\n<br>\r\nThe next morning, Adam gets out of bed with a yawn. He gets dressed, grabbing a pair of panties and then puts on a pair of shorts and a t shirt. He then pulls out the Mary janes, but before he puts them on, he takes out a pair of socks that go up to his knees and puts them on first. He decides they fit with the shoes better than his regular socks. <br>\r\n<br>\r\nHowever, before he leaves the room, he looks at himself in the mirror. He thinks for a minute, then gets an idea. He looks around on the dresser than sees some hair ties. He grabs them, and then uses them to tie his hair into two pigtails.<br>\r\n<br>\r\n\"There. That looks cuter.\" he says. He then heads down to breakfast.</span></div></div>",
            "created":1295499600,
            "id":1038801,
            "title":"Skip to the end of the day"
        },
        "12122211212111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "At breakfast",
                "Skip to the end of the day"
            ],
            "content":"<div class=\"\"><div> <span>Adam was leaving his room when he ran into Rachel, the girl who didn't have a room last time they met, she was wearing a wife beater T-shirt and some gym shorts, along with the same high heels and expertly done makeup he had seen her in the first time they met.<br>\r\n<br>\r\n\"Hey Adam.\"<br>\r\n<br>\r\n\"oh hey Rachel, where did you end up rooming?\"<br>\r\n<br>\r\n\"Oh some Jock's room, its full of sports equipment and workout stuff, bleh.\"<br>\r\n<br>\r\n\"hey it's still better than my little girl's room.\" he replied, they laughed<br>\r\n<br>\r\n\"oh I like your hair like that, its cute.\"<br>\r\n<br>\r\n\"ah thanks!\" he said enthusiastically and skipped downstairs to breakfast</span></div></div>",
            "created":1295586000,
            "id":1039310,
            "title":"Follow Adam"
        },
        "121222112121112":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Continue to follow Adam",
                "Follow someone else"
            ],
            "content":"<div class=\"\"><div> <span>Later that day, Adam steps back into his room after just having taken a bath. He then puts on a pair of panties, and looks through the drawers to find a shirt to put on. However, instead of a shirt, the first thing he finds is a pink nighty. Looking at it for a bit, he decides that its pretty cute, and puts it on. He then lies down in the bed, grabs his favorite stuffed animal pulls it into a hug as he drifts off to sleep.<br>\r\n_______________________<br>\r\n<br>\r\nThe next day, Adam wakes up with a yawn. Getting out of bed, he starts to get dressed, grabbing a pair of panties. He then pulls out blue girls shirt and puts it on. Looking around for something else to wear, he settles on a pink jumper from his closet. He then ties his hair into pigtails like yesterday, deciding he liked having it that way. Putting on his socks and mary janes, he then heads downstairs.<br>\r\n<br>\r\nWhen he gets to the kitchen, he finds some of the others there. The first he notices was Mike. He was currently wearing a yellow dress and a hair band in his hair. Next to him was his sister Jenny, who was currently wearing a football jersey and shorts. Also prsent was Nate, who was currently wearing white sundress, and shoes with a short heel, and his face also had a light touch of makeup. Heather was present as well, and she was wearing a blue t shirt with a cartoon character on it and shorts. Christine was the next you noticed, wearing a white shirt and khaki shorts. And the las person in the room was Dan, who was wearing a tank top, skirt, and heels, and had his face done up in make up.<br>\r\n<br>\r\n\"Hey Adam.\" Mike says casually as he waves to you.<br>\r\n<br>\r\n\"Just in time.\" Nate says. \"Want to come to the beach? The six of us were talking about going and thought we should ask you if you wanted to join us.\"<br>\r\n<br>\r\n\"Sounds like fun. Sure, why not? I'll join you guys.\" Adam repplies. \"How are we getting there?\"<br>\r\n<br>\r\n\"Theres a van in the garage, and we're allowed to use it if we get permission.\" Christine says. \"And I've already gotten permission.\"<br>\r\n<br>\r\n\"Alright. Now that its decided, we should get ready.\" Nate says, and everyone heads upstairs to get ready.</span></div></div>",
            "created":1295672400,
            "id":1040127,
            "title":"Skip to the end of the day"
        },
        "1212221121211121":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "On the way there",
                "At the beach"
            ],
            "content":"<div class=\"\"><div> <span>Heading back up to his room, Adam looks around and finds a pink one piece girls swim suit. He then takes of his shoes and socks and grabs a pair of pink flip flops in his closet. He then gets undressed and pulls out a sleeveless pink dress from his closet that would be better suited for the beach than his current attire. He then grabs a beachtowel with a princess design on it and puts it in a bag with his swimsuit before heading downstairs to join up with the others.<br>\r\n<br>\r\nHe heads out the door and sees Christine and Jenny loading the van. Once eveything is done, you all get in the car. Christen gets in the driver's seat while Nate sits in the passenger side. In the middle row, Jenny and Dan sit, and you sit in the back with Mike and heather, with Mike inbetween you two in the middle.</span></div></div>",
            "created":1295672400,
            "id":1040136,
            "title":"Continue to follow Adam"
        },
        "12122211212111211":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "At the beach",
                "Traffic on the way"
            ],
            "content":"<div class=\"\"><div> <span>On the ride there, they all decide to stop off someplace for breakfast and pull into a local diner. They exit the car, no one finding their attire to be strange, and head inside.<br>\r\n<br>\r\n\"Family outing?\" the waitress asks them.<br>\r\n<br>\r\n\"No, we're not a family. Just some friends on our way to the beach.\" Nate says.<br>\r\n<br>\r\n\"Really? You could have fooled me. You folks look like you could pass for a regular family.\" she says. \"Anyway, follow me.\" she says and leads then to a table and places menus down.<br>\r\n<br>\r\n\"Huh. She thought we were a family.\" Christine comments. \"Kinda weird.\"<br>\r\n<br>\r\n\"Yeah, but I don't really mind.\" Nate says.<br>\r\n<br>\r\n\"Me neither.\" Adam says, and the others all seemed to agree.<br>\r\n<br>\r\nShortly after that, the waitress returned. Nate, Christine, and Jenny ordered first. Dan was next, but he didn't order too much, saying that he was thinking about going on a diet. Adam, Mike, and Heather went last and found themselves ordering from the kids menu. Not long after, their food came, and once they were finished, they headed back to the van and resumed the drive to the beach.</span></div></div>",
            "created":1295672400,
            "id":1040157,
            "title":"On the way there"
        },
        "1212221121212":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Skip to the end of the day",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Walking around the house, Adam was looking for something to do. Maybe he just wanted to be alone for a bit. As he walked down a hall, he came to the open door of the play room he had seen the other day. Looking inside, there wasn't anybody in there, so he decided to go in for a bit. Walking in, he looks around at all of the toys again, this time, paying a bit more attention. He then saw a large dollhouse in the corner, and walked over to it. He looked at it closely for a bit before taking a seat on the ground to get a better look at it. \"Huh. Its kinda cute.\" he said. He then reached over and picked up a doll. At first, he was just messing around, and just held the doll near the doll house. But that quickly changed, and picked up another one. Within minutes, he was enjoying himself as he played with the dolls, using them in the dollhouse, and pretending they were a family that lived in it. He never knew that playing with dolls could be so much fun. He decided that he would have to come here to play with them more often. Maybe even see if Mike wanted to play with him.</span></div></div>",
            "created":1306126800,
            "id":1111657,
            "title":"Something else"
        },
        "12122211212121":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Follow Adam",
                "Follow someone else"
            ],
            "content":"<div class=\"\"><div> <span>Later that day, Adam steps back into his room after just having taken a bath. He then puts on a pair of panties, and looks through the drawers to find a shirt to put on. However, instead of a shirt, the first thing he finds is a pink nighty. Looking at it for a bit, he decides that its pretty cute, and puts it on. He then lies down in the bed, grabs his favorite stuffed animal pulls it into a hug as he drifts off to sleep.<br>\r\n_______________________<br>\r\n<br>\r\nThe next morning, Adam gets out of bed with a yawn. Last night, he had dreamed that he was a princess. He thought that it was a strange dream for him to have had, but had enjoyed his dream. \"Oh well, its just a dream.\" he shrugged.<br>\r\n<br>\r\nHe then starts to get dressed, grabbing a pair of panties and then a pair of shorts and a t shirt. He puts the panties on, however, before he puts on the rest, he gets another idea. There was all this cute clothes in his room, and they were his now, so why not try something different and try some of them on? He looks through everything, then pulls out blue girls shirt and puts it on. Looking around for something else to wear, he settles on a pink jumper from his closet. He then pulls out the mary janes, but before he puts them on, he takes out a pair of socks that go up to his knees and puts them on first. He decides they fit with the shoes better than his regular socks. He thought how cute and pretty he looked. \"Wow, maybe I should wear stuff like this more often?\" he asked no one.<br>\r\n<br>\r\nHowever, before he leaves the room, he looks at himself in the mirror once more. He thinks for a minute, thinking something was missing, then gets an idea. He looks around on the dresser than sees some hair ties. He grabs them, and then uses them to tie his hair into two pigtails.<br>\r\n<br>\r\n\"There. That looks cuter.\" he says. He then heads down to breakfast.</span></div></div>",
            "created":1308632400,
            "id":1130856,
            "title":"Skip to the end of the day"
        },
        "124":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Meeting the hall",
                "Meeting the hall (2)",
                "Adam notices some strange things with his hall-mates"
            ],
            "content":"<div class=\"\"><div> <span>Adam felt exhausted, moving in had been tiring, plus it had been a long day, so he decided to take a quick nap.<br>\r\n<br>\r\n================================<br>\r\n<br>\r\nAn hour or two later he woke up, feeling like meeting people he got out of bed. Noticing that he slept in his clothes, they were all wrinkled, so he decided to change his clothes, he was about to unpack, but then remembered that there was still all this young girls clothes here, he'd have to clear all thought out before unpacking.<br>\r\n<br>\r\nHe opened the closet and and started to move everything there onto his bed for now, keeping everything together so it would be easier to sort later.<br>\r\n<br>\r\nHe opened up his own suitcase of clothes and pulled out a pair of pants and shirt and an undershirt, and was about to grab a pair of boxers when he glanced over at the stack of panties on his bed. For some reason curiosity got the better of him and he left the boxers in his pack, instead taking a pink pair of frilly panties, and once again glancing at the girl's shirts, they were pretty small, it would be really tight on him, just the way he liked his undershirts, he grabbed a pink one with lace sleeves, putting them both on and putting then covering them with his own pants and shirt.  Not feeling at all strange about this he went out to meet some of his new hall-mates.</span></div></div>",
            "created":1291352400,
            "id":1007201,
            "title":"He decided to take a brief nap"
        },
        "13":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Sam",
                "Tyrel",
                "Tom",
                "Nick",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Okay, but you have many choices in which boy used the room...<br>\r\n<br>\r\nOption 1: Sam = Asian kid, short black hair, swimmer's physique because he was the swim teams all star<br>\r\n<br>\r\nOption 2: Tyrel = African American , dread locks, very muscular for his age, Basketball player<br>\r\n<br>\r\nOption 3: Tom = Brazilian, Tan, light brown hair, decent build, baseball player<br>\r\n<br>\r\nOption 4: Nick = Caucasian, blonde hair, decent build, soccer player<br>\r\n<br>\r\nOption 5: Other = PICKY PEOPLE!!!</span></div></div>",
            "created":1296450000,
            "id":1045453,
            "title":"A teenage boy's room"
        },
        "135":{
            "author_id":"digitalpocket",
            "author_name":"Baby Tai",
            "choices":[
                "ABDL's Room",
                "Art Student Dorm",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some more vague options to branch out from.<br>\r\n<br>\r\nRoom 1 - Room belonging to an ABDL.<br>\r\n<br>\r\nRoom 2 - Room belonging to an art student.<br>\r\n<br>\r\nRoom 3 - Other.</span></div></span></div>",
            "created":1561763100,
            "id":2679893,
            "title":"More Teenaged Rooms"
        },
        "1351":{
            "author_id":"digitalpocket",
            "author_name":"Baby Tai",
            "choices":[
                "Room 1",
                "Room 2",
                "Room 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Leaving some options for people to make their own stories as well.</span></div></span></div>",
            "created":1561763220,
            "id":2679894,
            "title":"ABDL's Room"
        },
        "13511":{
            "author_id":"digitalpocket",
            "author_name":"Baby Tai",
            "choices":[
                "Take a nap",
                "Check out the changing table",
                "See what's in the toy chest"
            ],
            "content":"<div class=\"\"><div> <span>...a baby's room? Well, that's what it looked like at least, if the changing table and pile of stuffed toys in the corner was anything to go by. But this couldn't be a baby's room, everything was just so...big.<br>\r\n<br>\r\nAdam walked in and properly scanned the room, it was definitely the room of a teenager. The bed off to the left side, while still having bars on the side of it, was large enough for him to rest in comfortably and to the side of the door, opposite the stuffed toys, was a TV. So there was no doubt about this being the room of a teenager, a teenager with strange interests but a teenager nonetheless. Adam noticed a door in the far right corner, probably leading to the next room but didn't pay it any mind, it was most likely locked anyway so there was no need. He also spotted a toy chest next to the stuff toys and a desk against the far wall.<br>\r\n<br>\r\nAdam moved over to the bed and with a little effort managed to drop the bars so that he could sit on the side. The only cupboard space seemed to be the drawers underneath the changing table so he'd have to use that until he replaced it with a real cupboard, he wasn't planning on keeping the changing table obviously but he didn't feel like moving it just yet, he was pretty tired after the travel so changing furniture could come later.<br>\r\n<br>\r\nAdam yawns and stretches his arms out before looking over the room once again, it wasn't perfect but it would do. The biggest question now was what to do first.<br>\r\n<br>\r\n</span></div></div>",
            "created":1561764240,
            "id":2679900,
            "title":"A little...childish?"
        },
        "14":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "New born",
                "1-5",
                "6-8",
                "7-9",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay how old is it????</span></div></span></div>",
            "created":1303448400,
            "id":1092738,
            "title":"A young boy's room"
        },
        "142":{
            "author_id":"hossboss",
            "author_name":"FaalofMan20",
            "choices":[
                "A 1-year-old.",
                "A 2-year-old.",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, what age is the room meant for?</span></div></span></div>",
            "created":1332910800,
            "id":1304453,
            "title":"Ages 1-5"
        },
        "1421":{
            "author_id":"hossboss",
            "author_name":"FaalofMan20",
            "choices":[
                "Check out the baby toys.",
                "Check out the changing table.",
                "Check out the crib."
            ],
            "content":"<div class=\"\"><div> <span>Adam stepped into the room, surprised at what he found:<br>\r\n<br>\r\nIt was a simply nursery, made out for a infant. The walls were painted bright blue with clouds and bunnies and had a couple of Winnie-the-Pooh and Barney wall stickers on them. The room was full of baby furniture, the most noticeable was the white crib tucked away in the corner with a little mobile over it. The closet was full of adorable baby clothes, all apparently designed for little baby boys.<br>\r\n<br>\r\nAs he coughed a little from the faint smell of baby powder, he said, \"Well, this can't be right....but it's a baby's room, so how bad can it be?\" He brought up his bags and began to unpack. Adam continued until his curiosity got the best of him; maybe he should look around, he thought.<br>\r\n<br>\r\nAdam then.....<br>\r\n</span></div></div>",
            "created":1332910800,
            "id":1304473,
            "title":"The Nursery (1-year-old)"
        },
        "1422":{
            "author_id":"hossboss",
            "author_name":"FaalofMan20",
            "choices":[
                "Check out the baby toys.",
                "Check out the changing table.",
                "Check out the crib."
            ],
            "content":"<div class=\"\"><div> <span>Adam stepped into the room, surprised at what he found:<br>\r\n<br>\r\nIt was a simply nursery, made out for a 2-year-old baby. The walls were painted bright blue with clouds and bunnies and had a couple of Teletubbies and Barney wall stickers on them. The room was full of baby furniture, the most noticeable was the white crib tucked away in the corner with a little mobile over it. The closet was full of adorable baby clothes, all apparently designed for little baby boys.<br>\r\n<br>\r\nAs he coughed a little from the faint smell of baby powder, he said, \"Well, this can't be right....but it's a baby's room, so how bad can it be?\" He brought up his bags and began to unpack. Adam continued until his curiosity got the best of him; maybe he should look around, he thought.<br>\r\n<br>\r\nAdam then.....<br>\r\n</span></div></div>",
            "created":1332910800,
            "id":1304476,
            "title":"The Nursery (2-year-old)"
        },
        "14222":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "The daytime diapers.",
                "The night diapers.",
                "The disposable training pants.",
                "The wipes and cream and powder."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Adam slid open one of the drawers of the changing table, revealing a few different things, but one interested him most of all.</span></div></span></div>",
            "created":1545195600,
            "id":2590970,
            "title":"Check out the changing table."
        },
        "142221":{
            "author_id":"diaperhero",
            "author_name":"Miquel",
            "choices":[
                "Put a diaper on",
                "Continúe exploring the room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alan sees the daytime diapers meant for a baby but he hace curiosity what Alan do?</span></div></span></div>",
            "created":1552798800,
            "id":2631335,
            "title":"The daytime diapers."
        },
        "1422212":{
            "author_id":"jake_2015",
            "author_name":"Jake",
            "choices":[
                "Feed toddler Adam and reveal that the young girl is, now, his big sis ",
                "Change toddler Adam's diaper and reveal that the young girl is, now, his big sis"
            ],
            "content":"<div class=\"\"><div> <span>Adam decides to walk around the nursery, and look at the other items. As he walks around, and looks around the nursery, he begins to notice a strange gas like smoke enter the room. <br>\r\n<br>\r\nNot knowing what the gas like smoke may be, Adam decides that he should leave the room, but when reaches the nursery's door he notices that the door is locked. <br>\r\n<br>\r\nAs he knocks on the door for someone outside to let him out, he notices that he has peed his pants. Adam rushes over to his suitcases when he notices that his underwear is too big to fit him, so Adam stares at the changing table with the diapers he was, previously, staring at, and decides to put one on since no one else was in the nursery to see him wearing a baby's diaper. <br>\r\n<br>\r\nAdam grabbed on of the diapers, and stared at the baby designs on them. As Adam began to place the pampers baby dry size 4 diaper on, he noticed gas like smoke stop and the nursery's room temperature rise and feeling warm. <br>\r\n<br>\r\nAdam didn't even hesitate to remove every piece of his clothes, and leaving himself in nothing but his diaper. <br>\r\n<br>\r\nAs Adam continued to walk around the nursery, he began to notice that everything seemed bigger. <br>\r\n<br>\r\nThen, Adam looked over at the nursery's door open and saw a young girl walk in the nursery just when Adam's stomach growled out of hunger, and Adam felt poop flow into the back of his diaper which he couldn't hold in as if he had lost his bladder control. <br>\r\n<br>\r\nWhat does the young girl do? </span></div></div>",
            "created":1561388820,
            "id":2677929,
            "title":"Continúe exploring the room"
        },
        "14222122":{
            "author_id":"jake_2015",
            "author_name":"Jake",
            "choices":[
                "Crib time ",
                "Feed time "
            ],
            "content":"<div class=\"\"><div> <span>Adam watched as the young girl, who seemed to have been around nine years old, walked into the nursery and began to pick up little toddler, diaper clad, Adam. <br>\r\n<br>\r\nAs the young girl approached Adam, he could feel some poop slide into the back of his diaper. As he felt the poop squished up in the back of his diaper, he was shocked that he wasn't able to hold it in, or wait to get to the toilet or the bathroom which the nursery didn't have. <br>\r\n<br>\r\n\"Phew.\" The young girl said, as she picked up little toddler, diaper clad, Adam, who was beginning to cry from being regressed back into a toddler boy. \"Smells like someone needs his diaper changed.\" The young girl said, as she carried Adam towards the changing table next to the crib, and on the opposite wall from the nursery's door. <br>\r\n<br>\r\nAdam watched as the young girl strapped his little toddler body to the changing table, and began to change his diaper while explaining what happened to him. <br>\r\n<br>\r\nAdam watched as the young girl untaped his dirty diaper, and placed a fresh pampers baby dry size 4 diaper on him, and taped up the diaper strapping the diaper on Adam's little toddler body. <br>\r\n<br>\r\nAs the young girl picked Adam up, while unstrapping from the changing table, she began to carry him around the nursery and explaining what had happened to him. <br>\r\n<br>\r\nWhat does she say, and where does she take little toddler Adam? </span></div></div>",
            "created":1561401000,
            "id":2677986,
            "title":"Change toddler Adam's diaper and reveal tha..."
        },
        "1423":{
            "author_id":"hossboss",
            "author_name":"FaalofMan20",
            "choices":[
                "A 3-year-old.",
                "A-4-year-old.",
                "A 5-year-old."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(2) Okay, what age is the room meant for?</span></div></span></div>",
            "created":1332910800,
            "id":1304455,
            "title":"More"
        },
        "14231":{
            "author_id":"hossboss",
            "author_name":"FaalofMan20",
            "choices":[
                "Check out the baby toys.",
                "Check out the changing table."
            ],
            "content":"<div class=\"\"><div> <span>Adam stepped into the room, surprised at what he found:<br>\r\n<br>\r\nIt was a simply nursery, made out for a 3-year-old. The walls were painted bright blue with clouds and bunnies and had a couple of Toy Story and Blue Clues wall stickers on them. The room was full of baby furniture, the most noticeable was the white crib tucked away in the corner with a little mobile over it. The closet was full of adorable baby clothes, all apparently designed for little baby boys.<br>\r\n<br>\r\nAs he coughed a little from the faint smell of baby powder, he said, \"Well, this can't be right....but it's a baby's room, so how bad can it be?\" He brought up his bags and began to unpack. Adam continued until his curiosity got the best of him; maybe he should look around, he thought.<br>\r\n<br>\r\nAdam then.....<br>\r\n</span></div></div>",
            "created":1332910800,
            "id":1304479,
            "title":"The Nursery (3-year-old)"
        },
        "142312":{
            "author_id":"awsomesause",
            "author_name":"awsomesause",
            "choices":[
                "AR",
                "Dressed like a baby"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens next?</span></div></span></div>",
            "created":1401339600,
            "id":1804165,
            "title":"Check out the changing table."
        },
        "1423122":{
            "author_id":"diaperboy657",
            "author_name":"DiaperBoy657",
            "choices":[
                "Sit in a beanbag chair and watch blues clues on the kiddie tv",
                "Lay down in the crib and take a nap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Out of curiosity Adam decides to try on some of the stuff he puts on a diaper and blue footed sleeper not thinking twice about why they are in his size he puts a pacifier in his mouth and decides to</span></div></span></div>",
            "created":1543640400,
            "id":2584231,
            "title":"Dressed like a baby"
        },
        "14232":{
            "author_id":"hossboss",
            "author_name":"FaalofMan20",
            "choices":[
                "Check out the toy chest.",
                "Check out the little potty."
            ],
            "content":"<div class=\"\"><div> <span>Adam stepped into the room, surprised at what he found:<br>\r\n<br>\r\nIt was a cute little bedroom, made out for a 4-year-old toddler. The walls were painted purple with glow-in-the-dark stars stickers on the wall, along with some Barney and Cars wall stickers on the wall. The room had a toy chest, a rocking chair, a bed with rails like a crib, a playpen and a small yellow potty with a unnamed logo tucked in the corner. The closet was full of adorable toddler clothes, all apparently designed for little boys.<br>\r\n<br>\r\nAs he coughed a little from the faint smell of urine, he said, \"Well, this can't be right....but it's a little kid's room, so how bad can it be?\" He brought up his bags and began to unpack. Adam continued until his curiosity got the best of him; maybe he should look around, he thought.<br>\r\n<br>\r\nAdam then......<br>\r\n</span></div></div>",
            "created":1332910800,
            "id":1304485,
            "title":"The Toddler Room (4-year-old)"
        },
        "142322":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "He had to go potty-er, use the toilet.",
                "A warm wetness spread around his crotch..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The potty itself seemed normal. It was made of plastic, and it had a removable inside for if it was used to empty it.<br>\r\n<br>\r\nAs Adam examined it, he felt something odd...</span></div></span></div>",
            "created":1541912400,
            "id":2576257,
            "title":"Check out the little potty."
        },
        "1423222":{
            "author_id":"diaperboy657",
            "author_name":"DiaperBoy657",
            "choices":[
                "Dismisses it as a one time thing and puts on underwear",
                "Put on a pull up from the shelve next to the potty just in case"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A warm wetness spread around Adam's crotch as he stood there in shock realizing that he was wetting himself. When he's done he decides to change out of his wet clothes</span></div></span></div>",
            "created":1543554000,
            "id":2584225,
            "title":"A warm wetness spread around his crotch..."
        },
        "14232221":{
            "choices":[
                "The toy chest? ",
                "A bed with rails on the side "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Obviously it’s just jitters from moving, he justified to himself, as he strips the wet clothing and tosses it into a hamper in the corner. He gets himself into some clean clothes and continues looking around the room. </span></div></span></div>",
            "created":1553690280,
            "id":2635568,
            "title":"Dismisses it as a one time thing and puts on un..."
        },
        "14232222":{
            "choices":[
                "It’s been a long day. Maybe a nap would be good. ",
                "Let’s check out these toys "
            ],
            "content":"<div class=\"\"><div> <span>Well, Adam tells himself, they can’t be that bad. And nobody else is going to be using them. He strips off his wet clothing and puts it in a hamper in the corner, before taking a pill-up and trying it on. He’s surprised to find it fits! Now what to do... </span></div></div>",
            "created":1553690340,
            "id":2635571,
            "title":"Put on a pull up from the shelve next to the po..."
        },
        "14233":{
            "author_id":"hossboss",
            "author_name":"FaalofMan20",
            "choices":[
                "Check out the toy chest.",
                "Check out the little potty."
            ],
            "content":"<div class=\"\"><div> <span>Adam stepped into the room, surprised at what he found:<br>\r\n<br>\r\nIt was a cute little bedroom, made out for a 4-year-old toddler. The walls were painted purple with glow-in-the-dark stars stickers on the wall, along with some Barney and Cars wall stickers on the wall. The room had a toy chest, a rocking chair, a red racecar bed, and a small yellow potty with a unnamed logo tucked in the corner. The closet was full of adorable toddler clothes, all apparently designed for little boys.<br>\r\n<br>\r\nAs he coughed a little from the faint smell of urine, he said, \"Well, this can't be right....but it's a little kid's room, so how bad can it be?\" He brought up his bags and began to unpack. Adam continued until his curiosity got the best of him; maybe he should look around, he thought.<br>\r\n<br>\r\nAdam then......</span></div></div>",
            "created":1332910800,
            "id":1304489,
            "title":"The Toddler Room (5-year-old)"
        },
        "142332":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "\"I hafta pee...\" he said, taking off his pants and sitting on the potty.",
                "\"Pee pee...\" He then peed himself and went looking for someone to change him.",
                "\"I hafta poop...\" He said, sitting on the potty and pooping.",
                "\"Boom boom...\" he said as he soiled himself and went looking for a change."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Adam examined the potty, he blurted something out and something happened.</span></div></span></div>",
            "created":1545195600,
            "id":2590972,
            "title":"Check out the little potty."
        },
        "15":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "A young woman's room",
                "A young man's room",
                "A room that belonged to two",
                "An older person's room",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1280120400,
            "id":924618,
            "title":"Something else"
        },
        "151":{
            "author_id":"strech18",
            "author_name":"kiya",
            "choices":[
                "goes down stairs after his nap",
                "Can't sleep as he is curious about the her shoes",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Adam walked into the first room he found on the second floor.  Opening the door he imediatley noticed that it was obviously a room that belonged to a young women.  Walking in he thought that the girl must have been about 21 years in age, and judging by some of the picture that were hung on the wall, she must have been a model.  He was somewhat aprehensive about staying in someone elses room, and didn't like the thought of living in this womens personal space.   The room was quite large and was full of items from around the world. \"Places that she must have worked in\" he thought.  Opposite of a large bay window was a large walk in closet.  Adam opened the door and couldn't believe the amount of clothes and shoes that this person had.  He dropped his duffle bag in the closet and continued to look around the room.  On the wall as a large bouqet of roses that had dried, a not tied to a string had a little message from what appear to be her boyfriend.  The note was addressed to a girl named Megan, \"So that must be the name of the girl.\"  Adam said outloud, even though he was the only person in the room.<br>\r\n<br>\r\nMegan was gourgeous, she had long black hair and judging by some of the pictures and clothes in the closet she must be 5'10\", an inch shorter that Adam.  He was back in the closet and looking for space to unpack.  This was somewhat difficult because of the amount of clothes Megan had.  He opened a drawer that was full of panties and bras, he puched what he could to the side and found enough room for his underwear.  He grabbed one of Megan's bra's and looked for a size. The tag said that she was C cup.  He then found a few empty hangers for his dressier clothes and the rest of his wardrobe would be left on the floor infront of the giant display of Megans shoes.  <br>\r\n<br>\r\nAdam looked at the shoes and noticed that most of them had really high heels, and really fashionable. On the bottom shelf were over 20 pairs of boots.  He gabbed one of the boots and held it up to look at.  He really liked the height of the heel and how clean the black leather looked.  He was thinking that he needed to try it on, when he shook his head in disbelief as he had never ever had a thought or notion to try on womens clothes.  He put the boot back on the shelf and walked out before he gave in to temptation.<br>\r\n<br>\r\n<br>\r\nHe closed the door and desided he better have a nap before the other arrived</span></div></div>",
            "created":1298696400,
            "id":1060970,
            "title":"A young woman's room"
        },
        "1512":{
            "author_id":"strech18",
            "author_name":"kiya",
            "choices":[
                "Puts on the flats and finds Heather",
                "Try's on more of Megan's clothes",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Adam tossed from side to side in Megan's bed.  He was above the sheets and fully clothed.  He was having trouble getting comfortable and the thoughts of Megan's shoes kept poping up in his head.  In his mind he had already begun to picture himself wearing her shoes.  During the few short moments that he was actually asleep, Adam had a dream were he was wearing a pair of Megan 4\" Louibotoun heels.  In his dream he had walked into the kitchen of his new home and was talking to the other house mates.  Most of them complimenting him on his shoes.  In his dream he was about to talk to Heather about his shoes when he woke up and opened his eyes.<br>\r\n<br>\r\nHe sat up on the edge of the bed, looking at the ground and recalling his dream and wondering why he would be dreaming of such a thing.  He quickly brushed the thought aside and walked over to the bathroom to splash some water on his face.  Adam smiled back at himself throught the mirror and started to chuckle about his dream and how odd it was for him to be dreaming of such thoughts.  \"It must be because I think Megan is hot, would love to be with her\".  Adam said to himself still looking into the mirror.  After drying his face, we walked over to a chair that was in the bay window and took off his socks.  A pair of grey wool socks that we really bulky and too warm for the temperature of the room.  He rolled them up in a ball and walked over to the closet to put them in drawer besides Megan socks and Nylons. He found a pair of knee high black stockings of megans and thought that they were probably cooler than his socks so he put them on while staring at the wall of shoes in front of him.<br>\r\n<br>\r\nAdam was having a hard time controlling his thoughts, he was  seeing images of himself in his mind, situations or former occurances were the shoes he was wearing were womens shoes.  He remembered that yesterday was he was riding the bus to town he wasn't wearing his sneakers, we was wearing a pair black ballet flats,  As he regain focus he saw the same ballet flats on the 3rd shelve.  Thinking that this was to wierd, he grabbed them thinking that there is no way that they would fit his feet.  \"Wow\", he thought, not only do they fit my feet perfectly I can actually recall the store in New York that I purchased them.\"  Adam was dumbfounded, and really confused.  He slipped the flats off his feet and looked for another pair of shoes that would not fit his feet and in no way would he ever be caught in.  Being a young hetrosexual man with no crossdressing tendancies, Adam was trying to find a logical reason for his thoughts.  He found the pair of Louibotons that was in his dream.  They had a 1\" platform and a 5\" inch heel.  Inside the heel he say the Louiboton logo and the word Alti stamped in golf leaf.        <a rel=\"nofollow\" href=\"http://www4.images.coolspotters.com/photos/83773/christian-louboutin-alti-leather-pumps-profile.jpg\" target=\"_blank\">http://www4.images.coolspotters.com/phot...</a><br>\r\n<br>\r\nThe shoes fit like a glove.  Adam was still wearing Megan's black knee high tights and couldn't believe how good these shoes felt on his feet.  He walked over to the closest mirror, to his surprise he was having no problem walking in 5\" heels.  He found himself stepping one foot directly in front of the other, similar to what he saw in fashions shoes that his sister would wathc on tv.  Looking back at him in the full length mirror was a regular male, but as his eyes began to look down he saw the shoes, and a very femine pose.  He was standing with his weight on one shoe as the other was tilted up and his ankle was bent towards his other leg.  This almost sent Adam to the floor.  What even made it worse was a picture he saw of Megan, standing with the exact same pose from the waist down.  Still confused by how good the shoes felt and how easy it was to walk in them, Adam sat down to consider his next move.</span></div></div>",
            "created":1298696400,
            "id":1061064,
            "title":"Can't sleep as he is curious about the her ..."
        },
        "15122":{
            "author_id":"strech18",
            "author_name":"kiya",
            "choices":[
                "Knocked on Heather's door",
                "Introduced himself to a shocked newcomer"
            ],
            "content":"<div class=\"\"><div> <span>It was still early in the day, and Adam wanted to look around his room a bit more.  He kept the 5\" platform heels on his feet, and was beginning to feel more comfortable.  Not with how they fit, because they fit like they were made for him, but comfotable with the thought of him actually wearing women's shoes.  Through out the room was pictures and nick nacks of items Megan collected as she toured the world on modelling asignments.  By the look of the room and the items that Adam saw, Megan was a very mature 21 year old.<br>\r\n<br>\r\nAdam went back to the closet to take off and return the shoes to the shelving unit. He stepped out of one shoe and sank 5\" as he kicked off the other shoe.  As he returned the shoe he began to look through the other items in the huge closet.  Megan had alot of skirts and dresses and her favorite pairs of jeans.  Not to mention lots of accessories.  Scarves, hat, jewllery and purses.  \"Must be the benefits of working as a model\", Adam thought to himself.  He grabbed some silver bangles and without thinking he slid them on his arm.<br>\r\n<br>\r\nFeeling the urge to wear another pair of shoes he found the boots on the bottom shelf very appealing and saw a pair of flat knee high black leather boot that he wondered what they would feel like.  Sitting down he had no trouble putting them on as they again seemed made for him.  He did find it hard to tuck in his pant leg as the boots were made to wear outside the pant leg.  Thinking that this might be a problem and that he might have to try on another pair, his eyes looked over at the many pairs of Megans jeans and wondered if he should try on a pair so that the boots could be worn properly.  He thumbed through the 20 - 30 pairs of jeans that Megan had collected.  Different colours, different styles, and different lenths is what Adam found.  He settled on a pair of faded blue skinny leg jean that would make it easier for him to zip up the shaft of the boot.  When he zipped up the front of the jean he discovered that the jean were also low risers and caused another problem, because of the boxer shorts that he wore.  Without a moment of hesitation Adam walked over to the dresser drawer and found a pair of black boy cut panties and slid them up his leg so that he could continue to get dressed.  In his mind he was getting dressed in order to go down stairs and meet some of the other housemates.    He slid on the boots and zipped them up and went over to the mirror to have a final look.  He was wearing a green t-shirt up top and he was all Megan below.  The jeans were tight, but shaped his legs somewhat to make them look long and lean.  The boots looked great but he thought that maybe they are too girly and he should instead go with  the black ballet flats instead.<br>\r\n<br>\r\nAdam walked out of the room wearing Megans' jeans and shoes.  His ankles exposed as the jean only went down to his ankle and making his choice of footwear very visible.</span></div></div>",
            "created":1298696400,
            "id":1061180,
            "title":"Try's on more of Megan's clothes"
        },
        "153":{
            "choices":[
                "A pair of twins.",
                "A newly-wed couple.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who did the room belong to?</span></div></span></div>",
            "created":1280206800,
            "id":925376,
            "title":"A room that belonged to two"
        },
        "1531":{
            "author_id":"fbphoenix",
            "author_name":"Phoenix",
            "choices":[
                "Both female",
                "Both male",
                "One female, one male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What were the twins' genders?</span></div></span></div>",
            "created":1280206800,
            "id":925619,
            "title":"A pair of twins."
        },
        "15311":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "9 years old",
                "16 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old were they?</span></div></span></div>",
            "created":1283230800,
            "id":947973,
            "title":"Both female"
        },
        "153111":{
            "author_id":"strangeperson",
            "author_name":"Some Random Person",
            "choices":[
                "Another guy arrives, and Adam invites him to share his room with",
                "He goes for a walk around the house for a bit before he looks for a roommate"
            ],
            "content":"<div class=\"\"><div> <span>Looking inside, it looked like a typical young girl's room. Inside, the walls were pink and had girly decorations on them, and it was full of dresses, dolls, and other things that little girl's liked. He also noticed that there were two beds. \"Must have belonged to a pair of twins.\" he commented, finding himself guessing that they were 9 years old, though he didn't know why he thought that it was that age specifically. Adam briefly considered finding a different room, but then decided he might as well use it. \"Why not? I'll just clear the stuff out later. Its pretty close to the stairs, so I don't have to walk too far back and forth when going downstairs.\" he reasoned. He put his bags in the room. \"Maybe I should find a roommate, too. Its a pretty big room, and it might be fun having a roommate.\"</span></div></div>",
            "created":1306126800,
            "id":1111570,
            "title":"9 years old"
        },
        "153112":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Adam finds a roommate",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>You look around at the room, finding many girly items and clothing, not only that  but there were two beds, that made you kind of giddy, you could have a roommate to share this stuff!... wait... share? Adam wasn't going to use any of this, but he should get a roommate since there were two beds after all, and this room was pretty cute he should share it with someone</span></div></div>",
            "created":1291352400,
            "id":1007208,
            "title":"16 years old"
        },
        "1531121":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Later that day",
                "End of the day"
            ],
            "content":"<div class=\"\"><div> <span>After a bit of looking and meeting people you finally met someone and offered the other half of the room to them. It was a guy named pete, he seemed like a good guy and they got along, so he'd be a perfect roomate.<br>\r\n<br>\r\nYou showed him the room, and he seemed to like it, he set some of his stuff down on the other bed.<br>\r\n<br>\r\nAn idea popped into your head... \"hey what if, since this room apparently used to have twins in it, we dressed alike tomorrow?\"<br>\r\n<br>\r\n\"ah that would be awesome, it would freak people out, they'd think the room was getting to us or something\"<br>\r\n<br>\r\n\"yeah lets do it!\"<br>\r\n<br>\r\nYou both agree to the idea and as its getting late, go to bed<br>\r\n<br>\r\n==========================================================<br>\r\n<br>\r\nThe next morning you guys  are both waking up and start to look through yours and his clothes finding similar stuff<br>\r\n<br>\r\nyou find similar enough outfits that you'll be noticed at how similar the look, but sadly you don't have matching underwear, you wear boxers and him, briefs... disheartened, Pete Comes up with an idea,<br>\r\n<br>\r\n\"well... the twins that lived here before must have matching underwear.\"<br>\r\n<br>\r\n\"thats true, but its girl's underwear\" you reply<br>\r\n<br>\r\n\"yeah, hmmm but nobody would know.... and we wouldnt really be dressing alike without the same underwear\" pete says.<br>\r\n<br>\r\n\"thats true, you're right, all right lets do it\" you both scrounge through the stuff in the closet, finding that every piece of underwear has a match in the other closet<br>\r\n<br>\r\n\"perfect!\" you exclaim \"lets do the black panties today\"<br>\r\n<br>\r\n\"okay sounds good\" pete replies, and you both get dressed in matching panties green polos and blue jeans.</span></div></div>",
            "created":1294808400,
            "id":1034478,
            "title":"Adam finds a roommate"
        },
        "15311212":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "The Next Morning",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>You and pete are getting ready for bed, you strip off your clothes, leaving on the black panties so does pete.<br>\r\n<br>\r\nPete says \"hey how about we sleep as twins too?\"<br>\r\n<br>\r\n\"I'm up for it, i'm not sure we have anything thats the same though, you up for raiding the closet again?\"<br>\r\n<br>\r\n\"yeah lets see what we find.\"<br>\r\n<br>\r\nYou both find a pair of pink silk Pj's yours have horses on them and Petes have flowers.<br>\r\n<br>\r\n\"soooo, This never leaves the room.\"<br>\r\n<br>\r\n\"exactly nobody but us knows about this.\"<br>\r\n<br>\r\nYou both change and head to bed.</span></div></div>",
            "created":1296450000,
            "id":1045270,
            "title":"End of the day"
        },
        "153112121":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "End of the day",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You and pete get up the next morning, and decide to dress as twins again.<br>\r\n<br>\r\nyou guys put on a pair of red panties and blue jeans.<br>\r\n<br>\r\nYou mention that since Pete is 2 inches shorter than you if he wore a pair of 2 inch heels they'd be the same height.<br>\r\n<br>\r\n\"ooh I don't know about that, especially since then we wouldn't be wearing matching shoes\"<br>\r\n<br>\r\n\"ah your right\" you continue getting dressed, when you think of an idea, what if we both wore a similar pair of heels yours slightly higher so that it would work and we'd match.\"<br>\r\n<br>\r\n\"ok I'm in, lets find shoes that work.\"<br>\r\n<br>\r\nYou both look for heels that would match, and finally success, you have a pair of 2 inch black heels and Pete has a pair of 4 inch heels<br>\r\n<br>\r\n\"ok this will work, but since I'm wearing higher heels its only fair that you do something for me, I want to wear this brown T-shirt but you don't have anything that matches so wear this.  <a rel=\"nofollow\" href=\"http://product-image.tradeindia.com/00083993/b/0/Girls-Top-.jpg\" target=\"_blank\">http://product-image.tradeindia.com/0008...</a><br>\r\n<br>\r\nYou don't really want to wear that, its pretty girly, but for the sake of twin-ness and you are making pete wear 4 inch heels, you accept it and wear it.<br>\r\n<br>\r\n\"their, we look as identical as can be, lets start the day</span></div></div>",
            "created":1298610000,
            "id":1060450,
            "title":"The Next Morning"
        },
        "1531121211":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "The Next Morning",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>during the day several people asked you what was with the twin thing, you didn't let them in on the joke, and just act like you don't know what they're talking about.<br>\r\n<br>\r\nIt was getting late so you and Pete retired to your bedroom, and hung out for a bit.<br>\r\n<br>\r\nPete speaks up \"hey I found this cream stuff in one of my drawars its apparently is for sleeping and is good for the skin, I was gonna use some, you want it?\"<br>\r\n<br>\r\n\"uh sure, can't hurt I guess.\"<br>\r\n<br>\r\npete applied the green cream to his face, and you do too.<br>\r\n<br>\r\n\"hey I had an idea for tomorrow\" you say<br>\r\n<br>\r\n\"oh yeah?\"<br>\r\n<br>\r\n\"yeah since its supposed to by hot I figured we'd wear shorts, but i've got light hair and you've got dark, and you're hairy so it will look different, what if we shaved our legs, then when we are wearing the heels we'll look even more twin-like, people today were asking about it, I think it will be pretty good.\"<br>\r\n<br>\r\n\"yeah I'll shave my legs... only for the joke though\"<br>\r\n<br>\r\n\"oh of course, after we get done with this joke everything will go back to normal.\"<br>\r\n<br>\r\nYou both agree, and to brainstorm more twin ideas and head to bed, tonight in matching nightgowns</span></div></div>",
            "created":1298610000,
            "id":1060581,
            "title":"End of the day"
        },
        "15311212111":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "End of the day",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>In the morning you and Pete talk about more ideas to look like twins, thats when you notice,<br>\r\n<br>\r\nYou are standing next to eachother looking in the mirror, your faces look more similar then they did before... but you think thats impossible it must be a trick of the lighting.<br>\r\n<br>\r\nPete says, our hands would look more similar if we wore these bracelets, and bangles in here. You agree, saying I was thinking about our hands too, what if we painted our nails the same color.<br>\r\n<br>\r\n\"paint our nails? really?\"<br>\r\n<br>\r\n\"i don't know can you imagine it though?\"<br>\r\n<br>\r\n\"you know what yeah I'm in, lets do it.<br>\r\n<br>\r\nYou both decide to wear high heels like you did yesterday, and today you'd wear the bracelets left there, and paint both of your nails red.<br>\r\n<br>\r\nYou both even decide to wear some of the Capri jeans in the closets that match, along with lacy green panties today. and this time you and pete both wear girl's long sleeve blouses.<br>\r\n<br>\r\n\"oh man today we're looking nearly identical, people might even mix us up, this is gonna be great</span></div></div>",
            "created":1298869200,
            "id":1062024,
            "title":"The Next Morning"
        },
        "1531122":{
            "author_id":"yogi-bear",
            "author_name":"Undbitr",
            "choices":[
                "female?",
                "no something other than a person"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Adam finds another room mate?</span></div></span></div>",
            "created":1302152400,
            "id":1083711,
            "title":"Something Else"
        },
        "1532":{
            "author_id":"digijurer",
            "author_name":"Digijurer",
            "choices":[
                "Straight Couple",
                "Gay Couple",
                "Lesbian Couple"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What sort of couple did the room belong too?</span></div></span></div>",
            "created":1533445200,
            "id":2529574,
            "title":"A newly-wed couple."
        },
        "15323":{
            "author_id":"digijurer",
            "author_name":"Digijurer",
            "choices":[
                "Lolita dresses and ballgowns",
                "A different combinations of outfits"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">For Ron and Samantha Cline, snagging this as-is apartment at it's low price was a dream come true.<br>\r\nSo what if it came with all the previous owner's stuff.<br>\r\n\"Crap.\" Ron muttered. \"Somehow, the movers lost all our clothes.\"<br>\r\nSamantha let out a deep breath.<br>\r\n\"I guess we can check what the previous owners left.\" she added and headed over to the closet, finding...</span></span></div></div>",
            "created":1540098000,
            "id":2566781,
            "title":"Lesbian Couple"
        },
        "153231":{
            "author_id":"digijurer",
            "author_name":"Digijurer",
            "choices":[
                "They start to change... slightly",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">...Lolita dresses and ballgowns.<br>\r\n\"Wonderful.\" Ron muttered as the couple looked the stuff over. \"I guess this what we have to work with.\"<br>\r\nHis remark got a sigh from his wife, especially as he pulled out one of the lolita dresses. This one appeared to be a pink one with a whole bunch of lace and frills.<br>\r\n\"You're really not going to put it on, are you?\"<br>\r\nShe got no answer. Instead, Stephanie just watches as her husband strip all the way down. So she grabs a ballgown of her own. This one is a dark blue color with multiple petticoats.<br>\r\n\"I guess we are.\" Ron answered.</span></span></div></div>",
            "created":1551502800,
            "id":2625438,
            "title":"Lolita dresses and ballgowns"
        },
        "1533":{
            "author_id":"tloufletch",
            "author_name":"Useless",
            "choices":[
                "Bro and sis",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A brother and sister?</span></div></span></div>",
            "created":1473051600,
            "id":2206458,
            "title":"Someone else."
        },
        "154":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "It's A Room That Belongs to a Woman in Her Mid-40's",
                "It's A Room That Belongs to a Man in His Mid-40's",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's a room that belongs to a middle aged person (around mid-40's), but which gender is the person?</span></div></span></div>",
            "created":1400994000,
            "id":1802296,
            "title":"An Older Person's Room"
        },
        "1543":{
            "author_id":"randomtime",
            "author_name":"Agechange4u",
            "choices":[
                "A business man in his mid fifties",
                "A woman who just recently retired age 67",
                "An elderly couple in their late eighties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe it is for someone even older. <br>\r\nMaybe it belongs to...</span></div></span></div>",
            "created":1559323020,
            "id":2667166,
            "title":"Something Else"
        },
        "155":{
            "choices":[
                "An old war veteran's room.",
                "A kindly grandmother's room.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other rooms were there?</span></div></span></div>",
            "created":1280206800,
            "id":925373,
            "title":"Something else"
        },
        "1551":{
            "author_id":"prometheus007",
            "author_name":"Prometheus",
            "choices":[
                "Put on the clothes in dresser",
                "Put on his clothes",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Adam stepped into the room and checked it out it had a decent view a couple of dressers a closet and his own bathroom. He also finds maids outfits and cleaning supplies as well as a makeup station. Adam puts his bags down and heads to the bathroom and decided to take a shower. He had forgotten his shampoo so he used the womens shampoo. When he got out he noticed his hair on his body was gone but he didn't pay much attention to it. He went over to his bag but before he got it open he looked at the dresser he decides to...</span></div></div>",
            "created":1549774800,
            "id":2615355,
            "title":"A maids room"
        },
        "1552":{
            "author_id":"randomtime",
            "author_name":"Agechange4u",
            "choices":[
                "He puts his things away",
                "There is a knock on the door",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Adam found a room midway down the hallway on the 2nd floor. He opened the door to see a nice large bed with an quilt on it, as well as an older style wooden dresser with a mirror on it. There was a dressing table, a nice rocking chair with knitting supplies and a magazine holder on either side of it. There were pictures on the wall of family, and plenty of little mementos set around the room. There were a variety of books on the headboard of the bed. <br>\r\n<br>\r\nBy the door were a couple colorful canes, and he noticed a few pairs of glasses left in various locations around the place.Doilies were everywhere.<br>\r\n<br>\r\nHe was amazed, and then noticed a walk in closet. In it, there were a variety of wigs--mostly gray, gray and white, and white in shade and all seemed to be in a style of a grandmother. There was clothing as well, much of it screamed old lady, like the various pairs of polyester slacks, the long skirts, and the colorful blouses. A jewelry box sat on a shelf, and Adam picked up a string of pearls and casually placed them on his neck.<br>\r\n<br>\r\n        A moment later, he checked out the kitchen and decided to make a cup of tea. As he did that, he also decided to bake some cookies. <br>\r\n<br>\r\n        Not long after....<br>\r\n</span></div></div>",
            "created":1559371620,
            "id":2667443,
            "title":"A kindly grandmother's room."
        },
        "15522":{
            "author_id":"randomtime",
            "author_name":"Agechange4u",
            "choices":[
                "I will have one or two",
                "Nah, got a ball game on I want to watch"
            ],
            "content":"<div class=\"\"><div> <span>Just as he put the cookies in to bake, there is a knock on the door.<br>\r\n<br>\r\n\"Oh goodness me, who could that be?\"<br>\r\n<br>\r\nAdam headed across the floor, and when he got to the door he asked who it was.<br>\r\n<br>\r\n\"I am Sarah from across the hall, just came over to say hi.\"<br>\r\n<br>\r\nAdam opened the door and invited her in. <br>\r\n<br>\r\nSarah entered and had a seat on the couch, while Adam checked the cookies and returned to the room and took a seat in a rocking chair.<br>\r\n<br>\r\n\"Wow, this place screams gramma,\" Sarah commented.<br>\r\n<br>\r\n\"Yes, I suppose it does,\" Adam replied, and felt a sense of contentment as he did.<br>\r\n<br>\r\n\"By the way, where did you get that old army shirt?\"<br>\r\n <br>\r\n\"That was in my room across the hall. I think it belonged to an old soldier at some time. There are medals and war pictures, some clothing that looks like an old duffer wore it.\"<br>\r\n<br>\r\nA moment later, a timer went off and Adam excused himself to check the cookies.<br>\r\n<br>\r\n\"They are hot out of the oven, would you like one or two?\"<br>\r\n<br>\r\n\"Hmmm, I think that....<br>\r\n<br>\r\n</span></div></div>",
            "created":1570659840,
            "id":2730617,
            "title":"There is a knock on the door"
        },
        "155221":{
            "author_id":"randomtime",
            "author_name":"Agechange4u",
            "choices":[
                "Time for dinner in main dining area--picks up a shawl to put on",
                "Time for bed--finds a wig with curlers and puts it on"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...I think maybe one or two might be okay,\" Sarah replied as she sat down on the couch.<br>\r\n<br>\r\n Adam went and dished up the cookies onto a plate, and then set it on the kitchen table with some milk as well as some tea. The tea was for himself, and he had the feeling Sarah might like the milk.<br>\r\n<br>\r\n\"Well...aren't you prepared...what a good soldier,\" Sarah responded.<br>\r\n<br>\r\n\"Prepared, oh yes dear. Soldier? Not so much so, though I was a nurse back in the day.\"<br>\r\n<br>\r\nAdam stopped for a moment to consider that comment, as Sarah thought about her comment. However, the smell of the cookies distracted both, and before they knew it the cookies were gone, Sarah had down her milk and Adam was on a second cup of tea.<br>\r\n<br>\r\n\"Well, thanks for the treat,\" Sarah told him.<br>\r\n<br>\r\n\"My pleasure,\" Adam replied, and feel free to stop by anytime honey.<br>\r\n<br>\r\nSarah then headed out the door, and Adam cleaned things up. Before long, it was.... <br>\r\n</span></div></div>",
            "created":1582238520,
            "id":2790338,
            "title":"I will have one or two"
        },
        "1553":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "A room with a single mother and her baby girl",
                "A room",
                "Some"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other rooms?</span></div></span></div>",
            "created":1291352400,
            "id":1007211,
            "title":"Some More Rooms?"
        },
        "15531":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "The Next Morning",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>he looked at the room, it looked like it belonged to a mother of a baby girl. there were women's clothes there, and when he looked into the drawers he even found a package of diapers with pink designs. He picked it up, surprised that something like this would be left here, it was quite strange.<br>\r\n<br>\r\nHe put them back, planning on tossing them out tomorrow, along with a lot of this stuff, on that note this was a pretty big room, a large queen size bed where he assumed the mom slept and a crib in the corner for the baby, he should get a roommate, they could share the large bed as long as the other guy didn't mind. <br>\r\n<br>\r\nHe had moved all of his stuff into the room, but as of now had no where to put it, so he left all of his suitcases in the far corner of the room for now, and decided just to head to bed now, for some reason he was sleepy and it was only about 9:00 now<br>\r\n<br>\r\nhe got ready for bed and turned off the lights and went to sleep, wondering about the other people he'd meet tomorrow and his start for his search for a roommate...<br>\r\n<br>\r\n================================================================<br>\r\n<br>\r\nAdam awoke in the middle of the night, somehow he had wet the bed, this was bad! at least it wasn't too wet, it hadn't really affected the bedding but his pants were soaked, he quickly jumped out of bed and took off his pants and boxers, and put them in the corner behind his stuff hoping theyd stay hidden until he got a chance to wash them.<br>\r\n<br>\r\nHe was worried, what if it happened again, he hadn't wet the bed in forever and was freaking out.<br>\r\n<br>\r\n\"Wait!\" he thought \"the diapers, i could wear one tonight just to make sure that it doesn't happen.\"<br>\r\n<br>\r\nrelieved that he had a plan but still a bit anxious he went to the drawer he found earlier and opened the package, he was embarrassed to do this but nobody would know so, he took one of the diapers, and after fiddling with it got it on, he then grabbed another pair of pants and went back to bed</span></div></div>",
            "created":1295499600,
            "id":1038627,
            "title":"A room with a single mother and her baby girl"
        },
        "155311":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "You are woken up by Pete The next morning",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Adam woke up, damnit he had wet his diaper, was something wrong with him? maybe he was coming down with something, it was a good thing there were diapers in this room.<br>\r\n<br>\r\nTodays mission was to find another guy for his roomate, he'd have to convince them to stay here even though the room was made up for a baby girl and mother.<br>\r\n<br>\r\nAfter changing, once again putting on a diaper since he didnt want any accidents in public.<br>\r\n<br>\r\nHe went downstairs and met a few people, one guy in particular was pretty cool and they got along, his name was pete, Adam told him about his room and invited him to stay with him.<br>\r\n<br>\r\nPete agreed, but didn't want to sleep in the same bed, even if it was a queen size, so for tonight Adam decided he'd sleep in the crib and then they'd switch off.<br>\r\n<br>\r\nyou hung out around the dorm some more and met other people,<br>\r\n<br>\r\nTwice during the day you felt your crotch get warm, you couldn't even feel yourself having to pee, and then you just would, you couldnt stop yourself, you excused yourself to your room and put on a new diaper.<br>\r\n<br>\r\nafter dinner you and pete headed to your room<br>\r\n<br>\r\nPete's surprised at what the room looks like, he takes a look in the closet and holds out a dress, wow a mom and baby really did just leave all their stuff.<br>\r\n<br>\r\n\"I told you\"<br>\r\n<br>\r\nYou go into the bathroom to change into your pjs, noticing that they leave and unsightly bulge around your diaper, hopefully Pete won't notice.<br>\r\n<br>\r\nYou leave the bathroom, and see pete applying some creams to his face. he looks over at you<br>\r\n<br>\r\n\"what? its good for the skin I don't wanna hear it\"<br>\r\n<br>\r\nYou chuckle and climb into the crib, its surprisingly long enough for you to lay straight in, and you quickly fall asleep</span></div></div>",
            "created":1296450000,
            "id":1045281,
            "title":"The Next Morning"
        },
        "1553111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Lets go get some breakfast",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"You slept all night, someone must have been tired, oh boy looks like we need a changing.\" Pete said some what knowing you were embaraced. Your diapers were wet again! You wanted to say \"Tell anyone this and Ill kill you\" but all you heard was baby talk. \"Awww its ok Ill change you\" said pete has he lifted your legs and put a new pink diaper under you. He no longer had anything on his face, he must of washed it off earlier but he was gliding around this morning in a baby blue silk robe over his boxers and his hair was in curlers. \"Nice hair\" you try to laugh but just alot of drool came out of your mouth. \"Oh here you go alex\" pete said while giving you a pasifer to suck on. </span></div></div>",
            "created":1298350800,
            "id":1058649,
            "title":"You are woken up by Pete The next morning"
        },
        "15531111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "To the park!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Alex want to get some breakfast?\" Said Pete with a motherly smile on his face. More baby talk came out and you wobbled in your crib. You felt to tired or week to get out of your crib yourself so you just laid there with your arms in the air hoping Pete would take the hint. \"Dude I already changed you I cant carry you too. Let me get dressed first then Ill worry about you.\" Pete got the curlers out of his hair and admired himself for a moment then took out a D sized pink bra \"Look Alex this lady must have been huge to wear this\" he says putting it on. You arent impressed at all because you're really hungery and tried to yell \"get your ass moving!\" but all that came out were tears. Pete, now with curled hair, boxers and a huge pink bra on quickly ran to your side and stood you up in the crib. He then pulled down the left bra cup and forced ur mouth on his nipple. You didnt know what he was doing at first but then you started to calm down. \"Shhhh its ok Alex. Boy oh boy some one really must have been hungry.\" he said swaying with you in his arms. After a few minutes of him \"breast feeding\" you, he lays you back down and finshes getting ready. He puts on his jeans, sneakers and belt and throws a white flowery blouse on over his pink bra. He dresses you in a matching flowery skirt and your metalica tee shirt and says \"Alright buddy what are we going to do today?\"</span></div></div>",
            "created":1298523600,
            "id":1059811,
            "title":"Lets go get some breakfast"
        },
        "155311111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Joyce and Hank's room",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Dude look, there is a baby stroller here. I wonder if we can ride it down the stairs and out the front door.\" says Pete fiddleing with the buttons on his blouse. He picks you up and rests you in it and wheels you into the hall. Your laying down with your legs hanging off almost touching the floor. You can feel the air from a near by open window blow up ur flowery skirt and show your pink diapers. Pete comes out shoving his wallet in his jeans pocket and pulls your skirt back down. \"Ok ready Alex? 1-2-3\" he says and pushs the baby stroller as fast as he can then jumps on with you.<br>\r\n<br>\r\nYou hit the bumpy stairs hard but some how Pete balences you. The stroller would have crashed into the main door if someone wasnt there at the exact second you were about to hit it. Once outside Pete gets off and rests the stroller by the side walk. \"Oh thank you ever so much I lost control at the top of the stairs and if it werent for you two who knows what would have happened.\" Pete says to the confussed cupple at the door. <br>\r\n<br>\r\n\"Uh sure kid whatever you say, do you live here?\" says the man. \"Oh yes my name is Peter and this is little Alex. Are you two looking for an appartment here?' says Pete keeping an eye on Alex. \"Yes we are. Im Joyce and this is my husband Hank we just married a year ago and we are looking for a new place.\" says Joyce her arm loving attched to Hank. \"Oh well theres many rooms here just go up and pick out a good one. Im taking Alex for a walk in the park we will be back soon.\" Pete grabs the stroller and walks away his blouse blowing in the wind. \"Wow that was weird. Two teenagers half dressed as a mother and baby? Joyce if I ever get that nuts just kill me\" Says Hank as they enter the apartment building.</span></div></div>",
            "created":1298523600,
            "id":1059884,
            "title":"To the park!"
        },
        "1553111111":{
            "author_id":"joyce4244",
            "author_name":"Jill Bauer",
            "choices":[
                "Changes",
                "Dressing up"
            ],
            "content":"<div class=\"\"><div> <span>Joyce and Hank entered the building. Joyce was a c-cup and was wearing a tight purple blouse. She was wearing dome skinny jeans that hug her female curves nicely. Hank was a well built man who was in jeans and a pull over shirt. He wore boat shoes. Hank had been married over a year to Joyce. He had recently lost his job and they had to move out if their condo. They were in the neighborhood looking for a new place.<br>\r\n<br>\r\nThey were shown in and were told that a room was available. It was a third floor loft that was owned by a husband and wife also. The thing was they were a crossdressing couple. The man who lived their previously stayed home and dressed like a woman all day. The wife would leave and go to work and return in the evening.<br>\r\nJoyce and Hank were a very traditional couple. Joyce was used to being pampered and treated like a princess. Hank on the other hand was all male. The jobs he performed was construtio specifically driving a tractor. He loved hunting and fishing in his spare time. When the couple made it to the third floor they opened the door to the new flat. \"well it's not what we are used to do but it will do till you can find a job.\" Joyce said. \"yeah I guess so.\" frank muttered. He was walking around the room opening drawers and cabinets. He stumbled about a closet with clothes in it. There was a weird sign painted onthe wall. It said his and hers. The funny thing was under his was skirts and blouses and the such. They were in rather large sizes. Under hers were <br>\r\n<br>\r\n\" hey Joyce come check this out.\" joyce minced over to see what her husband was on about. \" oh dear were these people freaks?\" Joyce said.</span></div></div>",
            "created":1298523600,
            "id":1059949,
            "title":"Joyce and Hank's room"
        },
        "15531111111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Fun in bed",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Well these have to go\" said Hank as he picked up all of the clothes in the closet and threw them in a near by trash can. See he was a 6'3 28 year old mans man and wouldnt have any suggestion of crossdressing. \"Come on Joyce lets put our clothes away, then maybe we can find out about this cupple.\" he said as he picked up his wifes suit case and began the fill the \"his\" section. Joyce absonmindly did the same and fill the \"her\" section with Hanks clothes. Neither one thought this odd. Joyce hung up her last pull overs and began to fill the drawers with her boxers. She watched Hank put away his panties and was getting alittle turned on. Coming up from behind her husband she started to rub him slowly. Joyce practicaly ripped off her blouse and Hank gave her a quick tease. It wasnt long before they were completly naked Jocye had Hank pinned to a wall. Suddenly there was a Knock on the door. <br>\r\n<br>\r\n\"Hello its ur neighbor Petter I have a question ask.\" \"Damn it\" Joyce said as she put on her boxers. Hank quickly dove under the covers and held the blanket over his chest. Joyce in just her husbands boxers opens the door \"Yes Peter how can we help you we are a little bussy right now.\" \"Oh I dont mean to bother you Joyce but Im going out tonight and was wondering if Hank could watch Alex?\" said Peter back from the park. \"Sure Sure whatever gotta go\" said Joyce closing the door and jumping into bed with her husband.\"</span></div></div>",
            "created":1298523600,
            "id":1059972,
            "title":"Changes"
        },
        "155311111112":{
            "author_id":"joyce4244",
            "author_name":"Jill Bauer",
            "choices":[
                "On each others clothes",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\" look \" Hank said, let's get dressed and head over to the neighbors. \" I wonder what kind if freaks lived here.\" Hank said. Then hr picked up some clothes and walked to the bathroom to get dressed. This left Joyce with what was left. She then proceeded to dress.</span></div></div>",
            "created":1298523600,
            "id":1060089,
            "title":"something else"
        },
        "1553111111121":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "We have to! Ill help u",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Hank got up and grab light pink nylon panties <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www1.macys.com/catalog/product/index.ognc?ID=450838&amp;CategoryID=233#fn=sp%3D1%26spc%3D244\" target=\"_blank\">http://www1.macys.com/catalog/product/in...</a> (only light pink) <br>\r\n<br>\r\nand found a nice white bra to put on. He slid the panties on glently and loved the feel then he snaped the bra on with out any problem. He put on his \"wifes\" tight jeans and left just enough pink lace to peak out, he knew that drove his wife wild. He put on a light blue silk blouse that hugged his \"cuves\" nicely then exited the bathroom. He put on nice luibonton boots and ran into Joyce who was over dressed. She stood there in nice \"fitted\" gray dress pants with a finely pressed dress shirt and gold tie. She had on his shoes and everthing. \"Joyce we are just going to see the neighbors we dont need to dress up...do we?\"</span></div></div>",
            "created":1298523600,
            "id":1060097,
            "title":"On each others clothes"
        },
        "15531111111211":{
            "author_id":"joyce4244",
            "author_name":"Jill Bauer",
            "choices":[
                "Surprise",
                "Hank is hired"
            ],
            "content":"<div class=\"\"><div> <span>\" baby I don't want out new neighbors thinking we are white trailer trash.\" Joyce said as she adjusted her grey slacks. She loved the airy feel of her boxers. \" well how do I look?\" Hank asked as he stood there and put his hands on his hips. He had his right foot pointed sideways in a ballet stance. \" you look great honey you always do.\" Joyce said as they headed to the door.<br>\r\n<br>\r\nJoyce opened the door and held it for Hank. Hank came clicking by.\"do you think I should bring my purse.\" Hank asked. \" no I've got a key and my wallet.\" Joyce said. With that they closed the door and heade across the hall. Joyce walked up to the door and knocked.</span></div></div>",
            "created":1298523600,
            "id":1060102,
            "title":"We have to! Ill help u"
        },
        "155311111112111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Jill's Reaction",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Just then Hank felt a tug on his panties \"No Joyce not here we have to paly that later\" he said then discretly unzipped his jeans and readjusted his panties. \"Your right save it for tonight babe\" \"-I would have Joyce if you didnt promise that I would babysit for that poor woman, we are living in an apartment where freaks crossdressed lets just get some info on them please.\" said Hank swaying as he walked. Joyce took his wife by the hand and lead her to the basement/archive room of the apartment building, when they came aross a stunning burnet named Jill. She had a suite case in hand and looked at them oddly. She caught Hank bye surprise and knocked Jills iphone out of her hand. \"Sorry dear\" said Hank as he bent down to pick it up, flashing his panties again.</span></div></div>",
            "created":1298523600,
            "id":1060116,
            "title":"Surprise"
        },
        "1553111111121111":{
            "author_id":"joyce4244",
            "author_name":"Jill Bauer",
            "choices":[
                "Where is Pete going",
                "Baby sitting "
            ],
            "content":"<div class=\"\"><div> <span>Jill who was rather the reserved type look at Hank very strangely . I wonder what kind of place this is thought jill. She took her phone back and scurried up the stairs. Little did she know she was to become the 12 year old orphan boy. Joyce and Hank headed toward peters apartment. Joyce knocked on the door and Peter answered. He was wearing a white maternity top with a maternity bra strap shoeing through he had on black yoga pants and his hair was in a bun. He had on no shows and his toe nails wear painted a dark purple. <br>\r\n<br>\r\nJoyce extrnded het hand and said, \" hi we ate the chiassons.\" Hank was surprised Joyce just introduced them using her maiden name. For some reason Hank didnt say anything. He felt that he needed to let Joyce lead. Hank thought well it makes him feel good . \" well it's nice to see your husband in more clothes.\" Peter said looking at Hank . Then Peter invited them into the house.</span></div></div>",
            "created":1298523600,
            "id":1060125,
            "title":"Jill's Reaction"
        },
        "15531111111211111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "what now?",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Im a little late as you can see Im barley dressed. Im going on a date, its the first time in a while in fact Hank do you mind coming with me to pick an outfit, we can just leave Joyce with Alex for a moment cant we?\" said pete ajusting his bra stap. \"Baby stay here Ill only be a minute\" said Hank as he swayed away. Pete and Hank go into the other room while Joyce who hates kids is standing in the doorway hands down her pants looking at Alex. \"You better not cry kid\" he said just before burping.<br>\r\n<br>\r\nMeanwhile in the bedroom<br>\r\n<br>\r\n\"I just dont know how nice to go you know its dinner then an art show not a game at some baseball field\" said peter rumiging through his clothes. Sliky slips, thongs tights were all being thrown in the air. \"If its an art show Id say classy pete like wear this\" Hank held up a knee length black lace dress. \"It would need a slip though\" \"Thats fine I have several\" said pete walking out in sexy black lace boy shorts and bra. He went though a bin and pulled out a black slik slip and tights and said \"As for Alex by the way your free to be in here or your place ill leave it unlocked ur really helping me out thank you so much.\" She grabed her heels and pruse and said \"Ok how do I look\" Just then Joyce re-entered and said \"Id do you\" Hank gave him and evil glare then Pete walked out to his date. \"Thanks again Hank\" was the last he said before he glided out.</span></div></div>",
            "created":1298523600,
            "id":1060133,
            "title":"Where is Pete going"
        },
        "155311111112111111":{
            "author_id":"joyce4244",
            "author_name":"Jill Bauer",
            "choices":[
                "Hank helps",
                "Baby spit up"
            ],
            "content":"<div class=\"\"><div> <span>Peter closed the door and that left Joyce and Hank alone. Joyce walked into peters living room and flipped on the television. Joyce flipped through the channels until she came upon a fishing show. Hank clicked into the room and sat on the back of the chair where Joyce was. He put his arms on Joyces shoulders. \" you feeling kind of perky.\" Joyce said.<br>\r\nJust as Hank was about to lean in for a kiss Alex started crying. \" jimminey cricket\" Joyce cried. \" this is why I hate kids.\" Joyce bellowed Hank who was getting up to attend to Alex turned and glared at Joyce.<br>\r\n<br>\r\n\" baby don't say that.\" hank said as he was headed toward the crib. \" as poor baby.\" Hank said S he picked up Alex and hugged him. Alex couldn't help himself as he continued to cry. He was trying to use his voice. Just tel days ago he was able to speak now it seems that all vocal ability has vanished and this frustrated Alex. Hence he was crying.<br>\r\n<br>\r\n\"Joyce honey could you go to the refrigearator and get me her bottle.\" you could tell Joyce wasn't happy. She stomped into the kitchen and open the refrigerator door. \" honey I can't find the bottle.\" Joyce said.</span></div></div>",
            "created":1298523600,
            "id":1060146,
            "title":"what now?"
        },
        "1553111111121111111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Nock on the door...again!",
                "Joyce's turn"
            ],
            "content":"<div class=\"\"><div> <span>\"Here, you just have to bend low enough\" said Hank again flashing his pink panties. Hank practicaly shoved the bottle in Alexs mouth and he quickly became quite again. \"Now what did you say about being perky babe\" said Joyce hand down her pants. \"Well we cant have sex in here with the baby but we can get ready\" said Hank unbuttoning the top on his jeans and blouse. He began to slide his sexy tight jeans off over his heels. He stood there in a slik blue blouse with a white bra peeking out with light pink panties on and sexy high heeled boots all on his male body. \"Alright Joyce your turn.\"</span></div></div>",
            "created":1298523600,
            "id":1060153,
            "title":"Hank helps"
        },
        "15531111111211111111":{
            "author_id":"joyce4244",
            "author_name":"Jill Bauer",
            "choices":[
                "Male vs female",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>Just as Joyce was about to \" get busy\" with his wife. There was a knock on the door. \" sorry \" Pete said as he clicked into the room. \" I forgot my cell phone.\" petr said. \" you guys are really frisky before you know it you will have a little one like me.\" Pete said giggling. He then walked out of the room. \" by the way cute undies Hank .\" \"thanks Pete\" Hank replied.<br>\r\n<br>\r\nJoyce turned and walked by to the couch and plopped down. \" as honey what's wrong? \" Hank said as he minced over to Joyce.\" aw it's nothing it's just what Pete said that's all.\" Joyce said frowning. \" Hank we are still young I am not sure I want to have children .\" Joyce said . \"oh boy ! I know where this is headed.\" Hank sighed.</span></div></div>",
            "created":1298523600,
            "id":1060164,
            "title":"Nock on the door...again!"
        },
        "155311112":{
            "choices":[
                "Daycare",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Actually I just remembered i'm working in an hour. I'll just leave you at daycare for a few hours, huh girl you love daycare don't you?\" he says grinning and talking in a babyish voice. Your horrified here you are dressed in a skirt, unable to talk or move properly and about to be carted off to daycare. Pete oblivious to your concern starts to get a pram out to push you in. He slowly lifts you up while you drool onto his flowery blouse, and then carries you to the pram. <br>\r\nAfter strapping you in he begins to wheel you down the stairs. When you reach the bottom and leave the building you could almost cry from embarrassment as you part through the people while making cooing noises and drooling onto your shirt. After about five minutes you reach the daycare and are slowly pushed, all the while pete talking about how much fun you'll have. </span></div></div>",
            "created":1303621200,
            "id":1093608,
            "title":"Something else"
        },
        "15532":{
            "author_id":"vladdy",
            "author_name":"Vlad",
            "choices":[
                "Stay",
                "Look around more"
            ],
            "content":"<div class=\"\"><div> <span>A nursery?<br>\r\n<i>Well, I guess the family had a baby.</i> Adam thought, as he surveyed the room. The walls were painted white, with yellow stripes. There was a yellow changing table that looked big enough for him.<br>\r\n{{i}i}Maybe the youngest was mentally impaired, or developmentally disabled, Adam thought. There was also a cribike bed, with rails so that the child couldn't roll out. There were also diapers and baby supplies under the changing table.<br>\r\n(Note; If he stays in this room, he'll need a caretaker.)<br>\r\nAdam decided to</span></div></div>",
            "created":1463374800,
            "id":2149184,
            "title":"A room"
        },
        "15533":{
            "author_id":"animecsi",
            "author_name":"Archie Comics Lover",
            "choices":[
                "An Otaku's Room",
                "A Ballerina or Figure Skater"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about</span></div></span></div>",
            "created":1444021200,
            "id":2043890,
            "title":"Some"
        },
        "155331":{
            "author_id":"animecsi",
            "author_name":"Archie Comics Lover",
            "choices":[
                "Does he keep it to himself",
                "Does he get a roommate "
            ],
            "content":"<div class=\"\"><div> <span>he looked at the room, it looked like it belonged to a well he wasn't sure if it was a guy or a girl but they were into anime, manga, cosplaying as there was over a dozen anime series, mangas, costumes and equipment/materials then he also noticed there were girl's clothes in the closet there, and when he looked into the drawers he even found bras and panties.<br>\r\n<br>\r\nHe was surprised that something like this would be left here, it was quite strange but as he was planning on tossing them out tomorrow, along with a lot of this stuff so he didn't really care as he looked at the room he noticed that it was a pretty big room, so if he really wanted to he could get a roommate, <br>\r\n<br>\r\nHe then moved all of his stuff into the room, but as of now had no where to put it, so he left all of his suitcases in the far corner of the room for now, and decided just to grab some food it was around 10:00 when he got back and around 10:30 when he decided to go to bed now, so he got ready for bed and turned off the lights and went to sleep, wondering about the other people he'd meet tomorrow....</span></div></div>",
            "created":1444021200,
            "id":2043895,
            "title":"An Otaku's Room"
        },
        "1553312":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "After a few days",
                "After a whole month..."
            ],
            "content":"<div class=\"\"><div> <span>Misako, who looks to be a 20 year old college student (with medium length green hair), seems to be room-mates with Adam. She also seems to have a no-nonsense and somewhat serious attitude as she bows cordially to Adam.<br>\r\n<br>\r\n\"I hope we'll be good room-mates, Adam-san,\" Misako states without even looking at Adam once.</span></div></div>",
            "created":1582273740,
            "id":2790547,
            "title":"Misako arrives"
        },
        "155332":{
            "author_id":"vypress",
            "author_name":"Vypress",
            "choices":[
                "Ballerina",
                "Figure Skater",
                "Another room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one do you choose</span></div></span></div>",
            "created":1560229920,
            "id":2671748,
            "title":"A Ballerina or Figure Skater"
        },
        "1553323":{
            "author_id":"vypress",
            "author_name":"Vypress",
            "choices":[
                "Stripper",
                "Porn Star",
                "Now for something completly different"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps a stripper, porn star or something entirely different</span></div></span></div>",
            "created":1560229980,
            "id":2671749,
            "title":"Another room"
        },
        "15533231":{
            "author_id":"vypress",
            "author_name":"Vypress",
            "choices":[
                "Continue unpacking",
                "Explore the house",
                "He gets interrupted and his housemate from the room next door comes in"
            ],
            "content":"<div class=\"\"><div> <span>Entering the room Adam found it looked to belong to a woman in her 20s. It was completely pink and from all the decor, seemed like she was a bit of a bimbo. Looking around the most eye-catching thing he saw was a stripper pole right in the centre of the room, all decorations clear from it, so nothing would be hit when she was practising. <br>\r\n<br>\r\nPlacing his suitcase down he decided before unpacking, he would check out the room a little, get to know where everything was and get an idea of what the rooms previous occupant was like. So he decided to start with the wardrobe where it was packed with skimpy clothes in various shades of pink as well as black and white; towering platform heels and surprisingly a bunch of different style wigs that were mainly platinum blonde with a few other colours as well. Adams best guess was it was probably just for different personas for different performances. <br>\r\n<br>\r\nNext he moved onto the make-up stand and drawers, which were packed again with skimpy panties, swimsuits, bras and stockings of various designs. Looking even closer he noticed one draw was even filled with certain adult toys designed for pleasure and self-stimulation, so he knew what draw to never open again. Finally when he looked at the make-up stand, the amount of stuff it had on it from standard make-up to nail extensions, false eyelashes and even coloured contacts was absurd, he had never seen that amount of make-up anywhere outside a stand in a mall. <br>\r\n<br>\r\nSo with a bit of an explore done he pondered, what should he do next</span></div></div>",
            "created":1560231120,
            "id":2671755,
            "title":"Stripper"
        }
    },
    "info":{
        "author_id":"strangeperson",
        "author_name":"Some Random Person",
        "brief_description":"People stay in a house where they start to act like the last person who used their room",
        "created":1280125020,
        "description":"<td align=\"left\" class=\"norm\">Main character's name is Adam, but you may add as many characters you want, can focus on any character at any time.<br>\r\n<br>\r\nMs. Sterious is the nice woman in charge of the dorm. As her name implies, shes very mysterious, though no one ever seems to notice what word her name sounds like. Another peculiar thing about her is that despite running the dorm, she is rarely ever seen, and that unless she is around, everyone seems to forget that she exists.<br>\r\n<br>\r\nGUIDELINES:<br>\r\nThe first room that a person opens the door to, you will feel compelled to just use it, regardless of what it looks like.<br>\r\nEach day, they will slowly start to act more and more like the person the room  belonged to, regarless of whether the current occupant and the previous one are of different genders. This happens very gradually and slowly, so don't make the changes happen to rapidly.<br>\r\nAs days go by, the stuff in the room will slowly start to change as if they were meant for the new occupant, but they will not notice. Ex: Clothes will start to alter in size to fit the occupant of the room.<br>\r\nIf the room belonged to multiple people(like parents, or twins, etc), then they will feel compelled to share the room with someone else, and will invite someone to share with them, who will accept the offer.<br>\r\nIf the the room belonged to people who were together, such as married, they will ask a member of the opposite sex who they have invited to share your large room with. Ex: If a guy picks a room for married parents, the girl he invites can be a girlfriend, a girl he has a crush, or just a friend. Same rules apply, with the character starting to act like the person whose stuff they touch first, with their roommate acting like their partner. <br>\r\nIf the occupants were twins, they will invite someone depending on the gender of the previous occupants. If both were the same gender, they will invite a member of the same gender, and if they were different genders, they will invite someone of an opposite sex. If not twins, they will invite anyone. Same rules apply, with the character starting to act like the person whose stuff they touch first, with their roommate acting like their partner.<br>\r\nRelationships between the occupants will start to mirror those whose rooms they use. Ex: Two people who use the rooms of a brother and sister who never got along will start to not get along themselves.<br>\r\nNo one will be aware of the changes that happen to them. Same goes for the other occupants of the dorm, and even those who don't stay there. Everything will seem perfectly normal about what happens.<br>\r\nFor Adam at least, always leave at least a \"Something else\" option before he picks a room. Leave many different possibilities open. It was a large extended family, so their were many brothers, sisters, parents, aunts, uncles, cousins, etc staying there, so there are plenty of options. Even the ones that have already been done can be used again if you want.<br>\r\n<br>\r\n<br>\r\nBe creative with the guidlines I have provided.<br>\r\n<br>\r\nAdditional rules:<br>\r\nNo physical transformations. Only mental.<br>\r\nNo sex<br>\r\nNo killing off characters<br>\r\nNo skipping ahead days<br>\r\nNo ending the story<br>\r\nAnd most importantly, have fun!</td>",
        "id":1693568,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582273740,
        "modified":1582273740,
        "pretty_title":"Readjusting for the Room"
    }
}