{
    "chapters":{
        "1":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "choices":[
                "Rag doll  (a lot left to do here but most progress)",
                "Action Figure   (a lot left to do here)",
                "Construction Toy (IE: Bionical)  (a lot left to do here)"
            ],
            "content":"<div class=\"\"><div> <span>To think that your owner Max finally got his first his first job, they grow up so fast. The fact that he's bringing you with him while he's watching his neighbor's 5 dogs has you a bit nervous but you're glad to get the chance to see him show responsibility. Currently you're in his backpack next to some snacks and his gameboy listing to the muffled instructions Max needs to follow. But first what kind of toy are you?</span></div></div>",
            "created":1591851600,
            "id":2849465,
            "title":"Your kid's first job!"
        },
        "11":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "choices":[
                "Leave the backpack",
                "Stay in the backpack"
            ],
            "content":"<div class=\"\"><div> <span>So you're a rag doll. A soft fabric that filled with filled with fluff, makes you resistant to most blunt force trauma. Unfortunate you are weaker than most of your fellow toys and don't last long against sharp objects.... like teeth.<br>\r\n<br>\r\nThe closing of the front door snaps you out of your concentration. You hear Max walking through the house from the dark confines of the backpack with what sounds like one of the dogs panting behind him. He comes to a stop and drops the backpack to the ground, undoing the zipper enough for you to see outside<br>\r\n<br>\r\nA loud noise coming from upstairs (presumably a dog knocking something over) causes max to groan then dash up the stairs, with what you can now see is the neighbors golden Labrador following right behind him. Seems like Max might just need  some help after all. So what do you do?</span></div></div>",
            "created":1591851600,
            "id":2849490,
            "title":"Rag doll "
        },
        "111":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "choices":[
                "Dash for the dog door, hide out back.",
                "Hide behind the dog bed, the other dogs give the mastiff his space.",
                "Go to the kitchen, getting up on a counter should to be safe."
            ],
            "content":"<div class=\"\"><div> <span>Well you can't be much help from inside the bag, besides these dogs will keep max far to busy to play with you. Your flimsy arms struggle with the zipper for a little while however you open it up wide enough for you to get out of your confines and into a living room.<br>\r\n<br>\r\nNow that you are outside of the bag you can see more of your surroundings. To your right you see what seems to be the entrance to a kitchen, you never learned much about food since you don't need to eat but you know the rooms purpose. Ahead of you you see a couch and chair, and behind them the stairs to the second floor and the basement. And finally to your left you see the large door / dog door to the backyard which you have seen from the window in Max's  room. also to your left you see AGh- you jump back in surprise as you notice that not too far from you is the neighbors Neapolitan Mastiff sleeping on a dog bed. It looked big when you saw it in their back yard but in person it's a mountain of muscle and joules.<br>\r\n<br>\r\nAs you finish taking in your surroundings your years of listening for approaching people comes in handy. You hear that one of the dogs is about to come up from the basement, which means trouble. What do you do?</span></div></div>",
            "created":1591851600,
            "id":2849810,
            "title":"Leave the backpack"
        },
        "1111":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "choices":[
                "Continue trying to get out back",
                "Freeze, there vision is based on movement... maybe",
                "stay in the house"
            ],
            "content":"<div class=\"\"><div> <span>Thinking fast you decide that outback is your best bet. It is summer after all so all the dogs should be inside, and so you move as fast as your fabric legs can carry you. After you cross the carpeted ground you throw your entire weight at the plastic flap.<br>\r\n<br>\r\nUnfortunate your lighter frame doesn't get the dog door open enough for you to squeeze through imminently. With some more effort you manage to push the flap up enough to maybe squeeze through, that said the dog you heard coming, which you see now is bull terrier, has reached the top of the stairs. Will you continue your attempt, freeze and hope the beast doesn't see you, or risk finding another hiding space inside the house?,</span></div></div>",
            "created":1593493200,
            "id":2859457,
            "title":"Dash for the dog door, hide out back."
        },
        "11112":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "choices":[
                "Try to get back inside.",
                "Just give up. (ends the story)",
                "Try and reach the pool, hope it can't swim."
            ],
            "content":"<div class=\"\"><div> <span>You're legs are already outside, however the plastic flap has you stuck and attempting to move will just bring unwanted attention to yourself. And so you fall back on your factory setting instincts and play inanimate. <br>\r\n<br>\r\nIf you had lungs you would certainly be holding your breath as the bull terrier you were attempting to avoid come into the living room you are still half in. You watch it trot over to Max's now open bag and sniffed around out of curiosity before you hear the crinkling of plastic wrapping at the beast returned to the basement with the snacks your owner had brought here for himself. You continue to stay still as the noises that were just made seem to have awoken the mastiff, however after a moment it goes back to sleep.<br>\r\n<br>\r\nWell then, guess its time to -  Uagh! Panic fills your stuffing as you feel a set of teeth clamp around your exposed legs that currently are hanging out back. A sharp tug yanks you backwards and up as you are plucked from the dog door, as you can now only see black fur as you are now upside down and facing your captor. You are dangling haplessly from its jaws as it takes walks away from the house where your only potential savior is. Then you feel yourself drop a distance. Landing on your back you see the rottweiler standing above you, it seems to be looking around to see if any of the other dogs might be around to disturb its playtime. This is likely to be your last opening you will get.</span></div></div>",
            "created":1593666000,
            "id":2860155,
            "title":"Freeze, there vision is based on movement... maybe"
        },
        "111122":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "content":"<div class=\"\"><div> <span>You lay there on your back thinking to yourself, for a moment. There is no way you can possible get to the dog door before the rottweiler caught you again, and even if you mad it to the pool you can't swim either. and so you lay there and look up at your new owner. <br>\r\n<br>\r\nSeemingly satisfied that it won't be interrupted the rottweiler lays down in the grass pinning your legs under its paw. As the black and brown maw lowers down to you its fleshy pink tongue leaves its mouth and starts tasting your body. You feel as sticky saliva seeps though your fabric skin and soaks into your fluff limiting your ability to even struggle. After a small eternity the rottweiler lifts is head again to late a small break from its assault but you haven't the physical or mental strength required to escape your doom any more. Your brief reprieve ends as your tormentor opens its wide maw full of slightly yellowed teeth and looks at you with complete indifference to your distress stemming from its enjoyment of the situation. You are almost glad when it adjust its posture so that a paw is pressing your head to the grass preventing you from seeing your fate.<br>\r\n<br>\r\nUnfortunate you this does nothing to prevent you from feeling the nearly unbearable experiences that follow. You lay there unable to defend yourself as time after time you the rottweilers teeth compress your torso with such force that your stuffing is displaced enough so that your right and left sides touch  internally. Each compression of the beast's mouth leaves small tears in your form causing small bits of fluff to seep out. Eventually though it seems that simply chewing isn't enough to satisfy the dogs thirst for your destruction. <br>\r\n<br>\r\nYou think for a moment that it has had enough and had decided to find something else to do. Then you feel it clamp down on your arm with full strength, and begin tugging. <br>\r\n<br>\r\n(to be finished)<br>\r\n</span></div></div>",
            "created":1593666000,
            "id":2860164,
            "title":"Just give up. "
        },
        "112":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "choices":[
                "Don't move an inch, Hopefully he goes for the snacks",
                "Stand your ground, you can't let this dog take Max's snacks",
                "Just run for it, get away from those teeth is priority 1"
            ],
            "content":"<div class=\"\"><div> <span>You decide its best to stay in Max's backpack for now, after all he can handle the dogs himself right? Not to mention this is likely the safest place for you to be. And so you wait, you can't see much outside of the backpack other than backpack just couch and some carpet flooring. As you sit there waiting for max to return you also begin to hear the rhythmic breathing of what must be a massive dog sleeping off to your left.<br>\r\n<br>\r\nUnfortunately the calmness of your situation soon ends. You hear what sound like one of the dogs coming up from the basement and, to your horror, towards the backpack you're in. Next thing you know a wet nose is poking in through the hole you were looking through. A second later and what you can now see is the neighbors bull terrier has managed to get the backpack open and is sniffing around the bag, it seems to have taken either an interest in you or the snacks you are next to. You have a second to act, so what do you do?</span></div></div>",
            "created":1591851600,
            "id":2849959,
            "title":"Stay in the backpack"
        },
        "1123":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "choices":[
                "Rush the bull terrier",
                "Try to reach the stairs",
                "Lie still and accept your fate."
            ],
            "content":"<div class=\"\"><div> <span>As the Bull terrier is sniffing around the bag you see your opening where there is enough space for you to escape. You grab onto the bag and the dogs collar to propel yourself out of the bag. Unfortunately as you are leaving the bag the terrier whips his head around with enough force to end you flying. Your fluffy body handles the impact without much of an issue, however the terrier is almost upon you. <br>\r\n<br>\r\nas its narrow maw opens to accept your form you have to make another split second decision. Will you refuse to go down without a fight and rush the dog, try to make it to the stairs, or accept your fate and lie there</span></div></div>",
            "created":1593579600,
            "id":2859515,
            "title":"Just run for it, get away from those teeth is p..."
        },
        "12":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "choices":[
                "Stay in the bag",
                "Leave the bag"
            ],
            "content":"<div class=\"\"><div> <span>So you're an action figure. A hard plastic shell protecting a few simple mechanisms that give you some extra umpf. Unfortunately repairing you is nearly impossible so any damage you do take is permanent, and once you start to break it will only get easier to be damaged.<br>\r\n<br>\r\nThe closing of the front door snaps you out of your concentration. You hear Max walking through the house from the dark confines of the backpack with what sounds like one of the dogs panting behind him. He comes to a stop and drops the backpack to the ground, undoing the zipper enough for you to see outside<br>\r\n<br>\r\nA loud noise coming from upstairs (presumably a dog knocking something over) causes max to groan then dash up the stairs, with what you can now see is the neighbors golden Labrador following right behind him. Seems like Max might just need  some help after all. So what do you do?</span></div></div>",
            "created":1591851600,
            "id":2849508,
            "title":"Action Figure"
        },
        "13":{
            "author_id":"waldothelost",
            "author_name":"dddennis",
            "choices":[
                "Stay in the backpack",
                "Get out of the backpack"
            ],
            "content":"<div class=\"\"><div> <span>So you're a construction toy. You are the sum of your parts, no matter how far apart they are so long as they don't sustain so much damage. Unfortunately it doesn't take too much force to take you apart, but you need at least one arm to re-assemble yourself.<br>\r\n<br>\r\nThe closing of the front door snaps you out of your concentration. You hear Max walking through the house from the dark confines of the backpack with what sounds like one of the dogs panting behind him. He comes to a stop and drops the backpack to the ground, undoing the zipper enough for you to see outside<br>\r\n<br>\r\nA loud noise coming from upstairs (presumably a dog knocking something over) causes max to groan then dash up the stairs, with what you can now see is the neighbors golden Labrador following right behind him. Seems like Max might just need  some help after all. So what do you do?</span></div></div>",
            "created":1591851600,
            "id":2849520,
            "title":"Construction Toy (IE: Bionical)"
        }
    },
    "info":{
        "author_id":"waldothelost",
        "author_name":"dddennis",
        "brief_description":"Attempt to help your owner watch dogs for a day, without getting claimed by one of them.",
        "created":1591855560,
        "description":"<td align=\"left\" class=\"norm\">          This takes place in a mostly normal world with one exception, the toys of children are sentient much like a certain series of movies that will go unnamed since I don't want to dance the copyright tango. That means that above all else you can't reveal the fact you can move to your human even if it means the end of the road for you. Whether you go above and beyond to help them in their tasks or focus on saving your inorganic skin is up to you (I guess if you want to get demoted to a chew-toy go crazy). <br>\r\n<br>\r\n          If you want to add chapters of your own go ahead, though I do ask you follow a few rules. First of all this is a choose your own adventure style interactive so you can only choose your own actions (and what kind of toy you are). Second of all this story has a 13+ rating, please stick to that. I genuinely hope this didn't need to be said but this website can get pretty weird. That is pretty much it, other than that have fun with it!<br>\r\n<br>\r\n</td>",
        "id":2224075,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1593668820,
        "modified":1593668820,
        "pretty_title":"Chew Toy"
    }
}