{
    "chapters":{
        "1":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Inuyasha",
                "Kouga",
                "Miroku",
                "Shippou",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay. who shall be gaining???</span></div></span></div>",
            "created":1122094800,
            "id":263028,
            "title":"??Who??"
        },
        "11":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Puts a fattening spell on them",
                "Puts a lazy spell on them",
                "Makes Inu want to be the fattest demon ever!",
                "When Inu puts them on, all he wants to do is eat",
                "Makes Inu gain 5 pound for every word spoken"
            ],
            "content":"<div class=\"\"><div> <span>(In first person)<br>\r\n<br>\r\nWe were on the road again....to escort Kagome back home...she said we needed supplies, I let her, seeing as we are out of food. She said she would be back in 3 days, and we would get gifts again.  Wonder what it'll be this time...?<br>\r\n<br>\r\n*In Kagome's era*<br>\r\n<br>\r\nI was short on money so I went to a second hand store for gifts...I mean, they're from the feudal era, they wouldnt know the difference between new and used....so I bought each of them a gift!<br>\r\n<br>\r\n*Back in Feudal era*<br>\r\n<br>\r\nKagome came back! EARLY! With gifts!!!  She got Shippou a little fox plushie that reminds him of his father, Miroku a book of pick-up lines, Sango a sun hat, and me...well....she got me something called \"Briefs\".  Wierd white things that you wear under your pants.  I had no problem with them, except that they were a bit large on me...and had a few holes, but other that that I like them!!<br>\r\n<br>\r\n*Naraku's castle*<br>\r\n<br>\r\nYes....I can use those garment the miko gave Inuyasha......<br>\r\n<br>\r\n*Inuyasha again*<br>\r\n<br>\r\nWe all went too sleep after we talked.<br>\r\n<br>\r\n-------------------------------------------------<br>\r\n<br>\r\nWhat did Naraku do to Inu's briefs???</span></div></div>",
            "created":1122094800,
            "id":263336,
            "title":"Inuyasha's Underwear!"
        },
        "111":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Inuyasha wakes up and doesnt notice",
                "Inuyasha wakes up and freaks out"
            ],
            "content":"<div class=\"\"><div> <span>\"I know! I shall put a fat seal on those white garments!\" Naraku mused. He'd been up all night thinking up a way to use Inuyasha's new garment to his advantage, and he had found it! He would make Inuyasha fat....make him OBESE! Naraku pulled out an old spell book and started to recite a spell. \"Oh seal of pudge, make the one who wears the strange white under-graments gain weight while he wears them.\"  After Naraku finished the spell a bright light emitted from the book, after it was over, Naraku laughed evilly.<br>\r\n<br>\r\n-------------------------------------------------<br>\r\n<br>\r\nInuyasha was fast asleep, the only thing he was wearing was his briefs, which started to glow.  Inuyasha's abs lost definition and his stomache started to fill out, the once big briefs now fit Inuyasha, who now sported a belly.....</span></div></div>",
            "created":1122094800,
            "id":263063,
            "title":"Naraku's Plan"
        },
        "1111":{
            "author_name":"Rei",
            "choices":[
                "looked himself over",
                "Continued eating breakfast"
            ],
            "content":"<div class=\"\"><div> <span>Inuyasha woke the next morning. He groaned as he sat up, feeling a little more sluggish than usual. Kagome looked over from breakfast with the others to greet him \"Good morning In-\" She seemed to freeze in mid sentance. Inuyasha's usually baggy clothing was now not as loose fitting. The others looked over at the sudden silence, each at a loss for words.<br>\r\n<br>\r\n\"What?\" Inuyasha growled going to get breakfast and taking a seat. He grabbed something for himself and began to eat, annoyed with the silence.<br>\r\n<br>\r\nMiroku arched an eyebrow \"Are you really sure you need to be eating that?\"<br>\r\n<br>\r\n\"What the hell are you talking about\" Inuyasha said as he...</span></div></div>",
            "created":1122526800,
            "id":264059,
            "title":"Changes"
        },
        "11111":{
            "author_name":"Rei",
            "choices":[
                "...a at slow but steady pace.\"",
                "...and speeding up.\""
            ],
            "content":"<div class=\"\"><div> <span>Inuyasha stared for a moment then hastily pulled his clothing back, revealing a relatively small but very apparent belly. He put both hands to it in shock \"Who did this to me?!\" He demanded, horrified.<br>\r\n<br>\r\nKagome looked away, rolling her eyes \"Well I think it's obvious. It's your own fault.\"<br>\r\n<br>\r\nInuyasha was about to retort when Miroku pressed a hand to his belly \"I wouldn't be so sure Kagome it seems to be growing...</span></div></div>",
            "created":1122526800,
            "id":264093,
            "title":"Shock and dismay"
        },
        "111111":{
            "choices":[
                "There wasn't any illusion... the growing gut on Inuyasha was real."
            ],
            "content":"<div class=\"\"><div> <span>Miroku nodded as he gave Inuyasha's slight paunch a light slap with the tip of his fingers, causing it to jiggle minutely. The monk's dark eyes narrowed as his vision closed in on the hanyou's distended gut and widened when he saw it slowly bulge outward to such a small degree that it was almost unnoticable to the untrained eye. <br>\r\n<br>\r\n\"Yes,\" Miroku noted, closing his eyes and tilting his head down as he rubbed his chin with consideration, \"He seems to be growing, just at a very slow yet steady pace.\"<br>\r\n<br>\r\nInuyasha glared at the purple clad monk and gritted his teeth, \"Yeah? And what do you suggest we do to stop it from getting any bigger?\" he growled impatiently, baring his fangs.<br>\r\n<br>\r\n\"Hmm...\" Miroku thought aloud, not opening his eyes to Inuyasha's outbursts, \"Well, this is all very unnatural to say the least...\"<br>\r\n<br>\r\n\"So is Inuyasha under a spell or a curse?\" Kagome asked, looking at the half-demon in question with a bit of puzzlement in her eyes.<br>\r\n<br>\r\n\"That's the strange thing...\" Miroku said cooly, deftly removing a charm from his sleeve, \"I don't sense any enchantment on him...\"<br>\r\n<br>\r\n\"But why is Inuyasha starting to swell up?\" Kagome asked.<br>\r\n<br>\r\n\"Well, it could be two things,\" he observed, twirling the charm around with his fingers, \"However, this all leads me to believe that an illusion has been placed before our eyes and that Inuyasha isn't gaining any weight at all... either that, or his stomach is just reacting to the huge meals he's had in the past, which is understandable because we haven't had many fights or excercise for that matter besides a little bit of walking her and there for the past few weeks.\"<br>\r\n<br>\r\nMiroku tilted his head towards Inuyasha, \"If you'll just stay still for a second while I slip this on,\" he asked, indicating the charm.<br>\r\n<br>\r\n\"No way- those things shoot out bolts of lightning,\" Inuyasha gasped.<br>\r\n<br>\r\n\"If you'll stay still it will barely hurt!\" Miroku smiled as he squabbled with Inuyasha to get the charm on.<br>\r\n<br>\r\nAfter chanting a few verses, the charm on Inuyasha burst into smoke... and sure enough...</span></div></div>",
            "created":1122613200,
            "id":264208,
            "title":"Miroku's Observation"
        },
        "1111111":{
            "author_name":"Rei",
            "choices":[
                "Inuyasha wants breakfast",
                "Inuyasha demands they get there quickly"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...\" Miroku frowned thoughtfully, moving back a generous distance to avoid an anticipated attack from Inuyasha \"It doesn't seem to be any illusion...\"<br>\r\n<br>\r\n\"What gave you that idea?\" Inuyasha growled irritably, after a short coughing fit in the clouding smoke.<br>\r\n<br>\r\n\"Perhaps we should try to find help in the next village.\" Inuyasha of course had his own two cents to put in.</span></div></div>",
            "created":1122613200,
            "id":264209,
            "title":"No Illusion"
        },
        "11111111":{
            "choices":[
                "in an hour...",
                "in a few hours..."
            ],
            "content":"<div class=\"\"><div> <span>\"First we should have breakfast,\" Inuyasha huffed, turning his face away and crossing his arms, \"I'm starving.\"<br>\r\n<br>\r\nEven through the baggy red cloaks, Kagome and Miroku could see that Inuyasha's gut was still swelling up and pressing against it, indicating that the hanyou was, indeed, still growing with no signs of stopping.<br>\r\n<br>\r\n\"Do you really think that it's such a good idea to stuff your face while we're trying to find a way to stop yourself from mysteriously fattening up?\" Miroku asked, leaning in deviously at the half-demon on his staff, smiling mockingly before bounding halfway into the air, narrowly avoiding a fist packed with the force of a ton of bricks from striking his face.<br>\r\n<br>\r\nKagome sighed and shook her head, \"Sometimes, you're just so dense, Inuyasha...\"<br>\r\n<br>\r\n\"What's that supposed to mean?!?\" the miffed half-demon cried.<br>\r\n<br>\r\nRolling her eyes, Kagome suggested, \"Well, maybe we can find a priestess or healer in the next town that can find out what's wrong with you... maybe you've got some kind of strange sickness. Besides, if it matters to you so much, you can have breakfast there- all we've got here is a bag of potato chips and a couple of- HEY!\" Kagome cried as she saw Inuyasha wolf down the remaining food supplies.<br>\r\n<br>\r\n\"Those were for the trip, Inuyasha,\" Kagome snapped, frustrated that the food she had ever so carefully rationed out was now being devoured almost instantaneously.<br>\r\n<br>\r\n\"So?\" Inuyasha spat, not even looking up from gorging himself, a look of indifference on his face.<br>\r\n<br>\r\n\"Oh... Sit, boy!\" Kagome cried as Inuyasha's necklace began to glow a pale color. Not even seconds later, the hanyou's body impacted the ground with considerable force, his arms twitching with pain.<br>\r\n<br>\r\n\"What was that for?\" he cried as he struggled to get up. That was his second most common response to recieving the 'sit' treatment. The most common usually involved him asking, \"Would you quit it with that, already?\"<br>\r\n<br>\r\n\"Come on, Inuyasha!\" Kagome called out brightly and cheerfully as she started down the pathway in her pink bicycle, as if the entire ordeal hadn't happened, \"If you hurry up, you might make breakfast!\"<br>\r\n<br>\r\nLeaving a growling Inuyasha a few feet behind on the road before he started to pick up his own pace, Kagome started to sweat with anxiety. She hoped nothing that bad had happened to Inuyasha- she suspected that he was experiencing some kind of allergic reaction to some of her food he ate, but then again... What if he was uncontrolably fattening up like she was led to believe?<br>\r\n<br>\r\nThey reached the town...</span></div></div>",
            "created":1122613200,
            "id":264212,
            "title":"More Bickering and Squabbling"
        },
        "111111111":{
            "author_name":"Rei",
            "choices":[
                "An expert on curses",
                "The nearest place to find something to eat"
            ],
            "content":"<div class=\"\"><div> <span>\"I thought the village was supposed to be close,\" Inuyasha grumbled, not in the best of shape to travel long distances anymore.<br>\r\n<br>\r\n\"We are close,\" Miroku said, looking back. The new roundness of Inuyasha's stomach was now clearly visible beneath his clothing  \"The village is just there.\"<br>\r\n<br>\r\n\"It's about time,\" Inuyasha went ahead immediately searching for...</span></div></div>",
            "created":1122613200,
            "id":264248,
            "title":"Road Trip"
        },
        "1111111111":{
            "author_id":"palos",
            "author_name":"Mizu",
            "choices":[
                "At the Inn: Taking a bath in the hot spring?",
                "At the Inn: Dinner time?"
            ],
            "content":"<div class=\"\"><div> <span>Inuyasha quickly hurried over to the nearest villager he saw, who happened to be an elderly farmer, and grabbed them by their collar, and began to shake them. <br>\r\n<br>\r\n\"You. Does the village have a priest or priestess, or an expert on curses?\" The hanyou grinded out.<br>\r\n<br>\r\n\"Sit!\" <br>\r\n<br>\r\nInuyasha grumbled from his place on the ground while Kagome and company rushed over to relieve the somewhat alarmed farmer.<br>\r\n<br>\r\n\"I'm sorry sir, but you see, our friend here is in quite the predicament. If you could, it would be wonderful if you could point us in the direction of anyone skilled in holy power of knowledgable about arcane magic or the dark arts.\" Miroku apologized and bowed, Kagome and Sango following suit.<br>\r\n<br>\r\nThe old man took a deep breath to calm himself and nodded.<br>\r\n<br>\r\n\"Its prefectly fine. An old man such as myself gets frightened by his own shadow on occasion. To answer your question, though, I'm afraid that the nearest priest of priestess would be in a village several miles north of here.\" <br>\r\n<br>\r\n\"That's not far.\" Sango commented. \"If Kagome and Inuyasha were to take Kilala-\" <br>\r\n<br>\r\nSango was cut off as Miroku pointed out the way north from the village; they would have to navigate through a small mountain range and a storm seemed to be brewing on the horizon.<br>\r\n<br>\r\n\"So..there's no one to help us?\" Kagome asked nervously, arms clutched to her chest.<br>\r\n<br>\r\n\"What!? I can't just inflate here like a damn balloon!\" Inuyasha exclaimed.<br>\r\n<br>\r\nThe old man rubbed his chin in thought for several moments before he spoke again.<br>\r\n<br>\r\n\"Well...there is an old woman at the far end of the village who once had a brother that was skilled in the dark arts, before he was burned. He kept many of his materials at her house, and talked to her much. Its possible she could help you.\" The old man advised.<br>\r\n<br>\r\n\"If that's so, then why was she not killed as well as her brother?\" Sango asked.<br>\r\n<br>\r\n\"Both she and her brother are children to one of the lord of this region's siblings, and since she never had any actual connection to the dark arts, and seemed to not practice them, her life was spared.\"<br>\r\n<br>\r\n\"Then's she our only hope.\" Miroku said grimly.<br>\r\n<br>\r\n\"Where did you say she lived again?\" Kagome queried.<br>\r\n<br>\r\n\"At the far end of the village in that direction. Good luck.\" The old man stated and pointed east.<br>\r\n<br>\r\n\"Thank you so much!\" Kagome shouted as the group ran, a bit slower in Inuyasha's case, towards the direction the old man had pointed out.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nAfter a bit of running, the group had finally reached what appeared to be the old womans's hut, and they could see why no one would suspect her of dabbling in dark magic: Her house was completely normal. It was made of wood, was fairly small, and there was some laundry drying outside. Had they not known about the past of the woman inside, the house would be no different than the other house in the village.<br>\r\n<br>\r\n\"Well...shall we knock?\" Miroku asked after a moment.<br>\r\n<br>\r\n\"We're not really in a situation to knock now are we?\" Inuyasha growled and flung the door open, letting himslef in, and leaving the others to stand in silence for a moment.<br>\r\n<br>\r\n\"His manners are atrocious...\"Miroku trailed off as he and the others also went into the hut.<br>\r\n<br>\r\nInside, Inuyasha was growling and looking around frantically. <br>\r\n<br>\r\n\"Damn! That old woman must be gone! Now what am I going to do!?\" Inuyasha shouted. <br>\r\n<br>\r\n\"A hanyou, a monk, a demon slayer, two small demons, and a scantily clad girl with holy powers in my hut. Huh. Well I've seen stranger things.\" <br>\r\n<br>\r\nInuyasha and company whirled to see the old woman and were quite shocked.<br>\r\n<br>\r\nFor an old woman, she looked amazingly young. Of course, she wasn't a fresh flower, like Kagome or Sango, but was nowhere near old enough to actually be described as 'old'. <br>\r\n<br>\r\nShe had a pale face, with only a few wrinkles, framed by long, cascading locks of wispy, gray hair and was equipped with startling violet eyes that seemed to look straight into your soul, analyzing your thoughts, fears, ambitions and emotions. <br>\r\n<br>\r\nOther than that, she was quite ordinary. She was fairly plump and was dressed in a forest green kimono.<br>\r\n<br>\r\n\"A-are you the old woman that lives here?\" Sango questioned. <br>\r\n<br>\r\n\"Perhaps. What has brought you too my home?\" <br>\r\n<br>\r\n\"Well, you see, our friend here, the hanyou, has a problem. We suspect in may be a result of dark magic and were told an old woman resided here that might be able to help us, but you hardly look old.\" Miroku explained.<br>\r\n<br>\r\nThe old woman chuckled and went past her visitors to sit down on a mat on the floor and gestures for the others to do the same.<br>\r\n<br>\r\n\"Just because something is old, does not mean they are required to be ugly and weak. Just the same, young and new things can just as easily be fragile.\" The old woman said sagely.<br>\r\n<br>\r\nFrom his spot on the floor, Inuyasha growled.<br>\r\n<br>\r\n\"Listen, ya old hag, we-\"<br>\r\n<br>\r\n\"You may call me Rumiko.\" Rumiko said harsly and amazingly glared the hanyou into silence. <br>\r\n<br>\r\n\"Forgive our friend, he is at his wits end over his current situation. We were hoping you could help us. You have knowledge of the dark arts?\" Miroku questioned.<br>\r\n<br>\r\n\"And if I do?\" Rumiko asked, hers eyes slightly narrowed.<br>\r\n<br>\r\n\"Recently, Inuyasha has...started to gain weight. We believe that its due to some dark magic.\" Kagome explained.<br>\r\n<br>\r\nRumiko sat quietly for a moment, analyzing the expressions of everyone in the room, seeing if their faces held any traces of deceit. <br>\r\n<br>\r\nAfter a moment she stood and gestured for Inuyasha to as well. Upon heaving himslef off of the floor Rumiko pressed her right index finger to Inuyasha's forehead and closed he eye's in concentration.<br>\r\n<br>\r\nAlmost immeadiately, she jerked her finger away and winced, startling everyone present.<br>\r\n<br>\r\n\"There's no doubt. Inuyasha here is definately under dark magic, either a curse of a hex, and a powerful one at that. The black magic around him has taken a form of a spider.\" Rumiko stated, as gasps were chorused throughout the room.<br>\r\n<br>\r\n\"A spider?\" Kagome asked.<br>\r\n<br>\r\n\"Naraku.\" Sango spat with contempt.<br>\r\n<br>\r\nIgnoring the musings of everyone else in the room, and back to her icy calm, Rumiko turned back to Inuyasha.<br>\r\n<br>\r\nTake your shirt off.\" She commanded.<br>\r\n<br>\r\n\"What?!\" Inuyasha shouted as both he and kagome turned red.<br>\r\n<br>\r\nRumiko's eyes narrowed and her face became a scowl. <br>\r\n<br>\r\n\"If you are truly gaining weight, then I must see the extent of the damage so far. I might be able to repair it, or at least slow down the dark magic.\"<br>\r\n<br>\r\nInuyasha grumbled a moment, but relented and pulled the top of his haori over his shoulders, displaying his new body for everyone present, and it was obvious, he had grown.<br>\r\n<br>\r\nHis belly had grown from slightly swollen to marginally swollen, pooching out a few inches. All traces of abs gone, Inuyasha had also developed a small set of love handles and his pecs were showing the slightest traces of flab, the beginning of breasts. The muscles on his arms also showed a slight layer of fat.<br>\r\n<br>\r\nRumiko slowly walked around Inuyasha, as if critiquing a piece of art. A time of two she pinched a bit of fat layering his arms and poked him in the stomach, all the while Inuyasha's face became more scarlet.<br>\r\n<br>\r\nHe had only gained weight quite recently, and to have someone prod him as Rumiko was, it felt quite...strange.<br>\r\n<br>\r\nFinally, Rumiko stopped to cross her arms and sighed wearily. <br>\r\n<br>\r\n\"Yes, Inuyasha you are definately under black magic, a curse, that's causing you to fatten up. Its working at a slow and staedy pace, but even that's too fast. I could still feel your muscles under the layers of fat. I'd imagines its the same with your legs, though I wasn't going to ask you to drop your pants.\" Rumiko explained.<br>\r\n<br>\r\nInuyasha was about to retort when a thought came to him.<br>\r\n<br>\r\n\"You know, my underwear do actually fit now...\" He trailed off.<br>\r\n<br>\r\n\"Excuse me...underwear?\" Rumiko asked.<br>\r\n<br>\r\n\"Long story.\" Kagome answered quickly.<br>\r\n<br>\r\n\"So..there's nothing you can do to help Inuyasha?\" Miroku asked, worried.<br>\r\n<br>\r\nRumiko bit her lip a moment before wandering over to a chest in the corner of her hut and searching through it. Finally, she emerged with a crystal on a necklace the same size and shape as the Shikon jewel, but clear and filled with water.<br>\r\n<br>\r\n\"This is a charm  filled with springwater from Mt. Hakurei. It should slow the curse down. Instead of gaining at a steady pace, it will be but a few hours of the day and night, though the process will continue.\" Rumiko explained and held out the amulet to Inuyasha.<br>\r\n<br>\r\n\"But Mt. Hakurei is holy, wouldn't it purify Inuyasha?\" Sango asked.<br>\r\n<br>\r\nRumiko shook her head.<br>\r\n<br>\r\n\"The water would, but the crystal channels the power of the water into Inuyasha slowly, si it neutralizes the curse he is under without purifying him...though there is a downside.\" Rumiko warned.<br>\r\n<br>\r\n\"Which is?\" Kagome questioned.<br>\r\n<br>\r\n\"Though the charm will neutralize much of curse, as I said, it will still continue, and the holy power will also have an effect on Inuyasha. Already, his increased weight has made his apetite greater. The charm will do so even further, weakening him more, causing him fatigue and an even greater apetite.\" Rumiko said, all eyes glued to the amulet dangling from her hand.<br>\r\n<br>\r\n\"isn't there anything we could do for a long term solution? To get inuyasha back to his normal weight and stop hiw from gaining any alltogether?\" Miroku queried.<br>\r\n<br>\r\nRumiko chuckled sadly.<br>\r\n<br>\r\n\"For the curce to be broken you have two options. Either destroy the creator of the curse, the one you call naraku, or search for a higher power to break the curse. And even if you did, Inuyasha would have to lose weight on his own, though with his half-demon metabolism, it shoudn't be too hard.\" <br>\r\n<br>\r\nSilence reigned a moment as everyone continued to stare at the necklace in Rumiko outstretched hand. Then, in a moment, Inuyasha had grabbed it and placed it around his neck.<br>\r\n<br>\r\n\"You're sure about this, Inuyasha?\" Miroku asked.<br>\r\n<br>\r\n\"Feh. Look at me. If I don't make use of this charm, I'll be the size of a sumo wrestler before I even have the opportunity to cure myself. At least with this I have a chance.\" Inuyasha reasoned and gestured to his body. It was visible that he had gained a little thorughout his short time in the hut.<br>\r\n<br>\r\n\"I agree. Despite the consequences, this is our best shot.\" Sango voiced her opinion.<br>\r\n<br>\r\n\"We still need to look for a permanent solution, though. Which mean we either have to kill Naraku or...find something or someone even more powerful than him.\" Kagome stated.<br>\r\n<br>\r\n\"The Shikon Jewel?\" Miroku suggested.<br>\r\n<br>\r\n\"To obtain the Shikon Jewel we'd have to defeat Naraku.\" Sango reminded him.<br>\r\n<br>\r\n\"Works for me. I feel like killing him anyway, for what he's done to me.\" Inuyasha grolwed and flexed a claw.<br>\r\n<br>\r\n\"But at the moment we have no idea were Naraku is, not to mention that you're not at your peak physical condition, Inuyasha.\" Miroku said and poked Inuyasha's bare belly, sending the former abs into a quivering fit.<br>\r\n<br>\r\nInuyasha growled and put the top of his haori back on.<br>\r\n<br>\r\n\"It seems that we have no choice at the moment. Our best bet is to probably continue looking for Naraku while keeping our ears open for anything theat we could use to restore him without fighting Naraku.\" Kagome rationalized.<br>\r\n<br>\r\n\"Then should we get going?\" Sango asked standing up.<br>\r\n<br>\r\n\"It has already gotten dark. It's best to stay in the village.\" Rumiko stated, and sure enough, the sky outside was littered with stars.<br>\r\n<br>\r\nRumiko hastily went to a shelf in another corner of her room and came back with a pouch, to whcih she have to Mriroku.<br>\r\n<br>\r\n\"There's an inn not far from here. This should pay for beds and dinner for one night.\" <br>\r\n<br>\r\nMiroku bowed and accepted the money.<br>\r\n<br>\r\n \"Thank you Lady Rumiko. You've been a great help to us.\" <br>\r\n<br>\r\n\"Think nothing of it. I often grow bored in this village. If you are ever in need of anything, please do not hesitate to return here.\" Rumiko greeted and waved farewell as Inuyasha and company left her hut and proceeded towards the inn.<br>\r\n<br>\r\nInside and alone, she lit a fire and began to make some tea.<br>\r\n<br>\r\n\"May Fate be lenient upon them. Their journey will be a long and arduous one.\"</span></div></div>",
            "created":1122786000,
            "id":264533,
            "title":"The Old Woman, Rumiko"
        },
        "11111111112":{
            "choices":[
                "Elsewhere...",
                "The next morning..."
            ],
            "content":"<div class=\"\"><div> <span>The clicking sounds of porcelain chopsticks against chinaware filled the room as the entire party with an exception for one member started to chow down into the medium-sized dinner that the inn had prepared for them. The adventurers had traveled quite a distance during the course of the day to reach the village and back and forth a few miles to the lodgings of Rumiko, so it was only logical that they would be hungry, to say the least.<br>\r\n<br>\r\nThe group sat cross-legged around the low, flat table helping themselves, while Inuyasha sat off in a corner with his eyes closed, cross-legged as well, his back facing the others. His arms were crossed over his red robes which barely showed any sign of his slightly rounded belly. Inuyasha had wisely chosen to not participate in dinner, but Kagome suspected that both his mind and body yearned for some hot, revitalizing food.<br>\r\n<br>\r\n\"I feel so bad for Inuyasha,\" Kagome whispered just low enough so her words barely escaped the afforementioned hanyou's earshot. However, it soon occured to Kagome that he might have picked her voice up anyway with the doglike ears he had on top of his head. Taking another glance at the hanyou, Kagome let out a soft cry of sympathy when she saw that his ears were folded down like those you might find on a sad, whimpering puppy.<br>\r\n<br>\r\n\"Well, I, for one, am grateful that Inuyasha isn't stuffing his face tonight,\" Shippo smiled brightly, helping himself to more of the sauce-covered fishes and rices, but straying clear away from any vegetables, \"That means I get seconds, and the food doesn't even vanish rapidly at all!\"<br>\r\n<br>\r\n\"You're too kind,\" Kagome smiled sarcastically.<br>\r\n<br>\r\nA low gurgle sounded from the corner of the room, and most everyone spun around to see the hunched over backside of Inuyasha obscured by his long, silver mane of hair. Although the others couldn't see it, his eyes gleamed with frustration as he lowered the level of his head weakly.<br>\r\n<br>\r\nAfter dinner had ended, Inuyasha joined the others in finding the room they had purchased for the night from the innkeeper, who was fast asleep by now. In fact, even the cook that had prepared their meal had headed to his quarters right after quickly cleaning up, leaving a majority of his work to do in the morning.<br>\r\n<br>\r\n\"Maybe we came later than we thought...\" Kagome uttered to herself silently as she carefully paced down the hallway, careful not to wake anyone else up. Her digital watch read that it was a little over half past eleven.<br>\r\n<br>\r\n\"Careful, Shippo!\" she whispered sharply as the small fox demon almost walked into a shadowy looking potted plant that was twice the size of him. Shippo squeamed nervously a little as he froze in his tracks before realizing what was in front of him. Kagome couldn't blame him though, as the hallways were very dark and practically pitch black.<br>\r\n<br>\r\n\"How do we know which room is ours if it's so dark?\" Shippo asked curiously before being shushed by someone from inside a room.<br>\r\n<br>\r\n\"If I remember correctly, the innkeeper told us before we went off to eat that we had the second room to the right in the next hall,\" Miroku said softly as the group continued its path through the hallways of the inn.<br>\r\n<br>\r\nThe next hall opened up to a view of the outside and had a little bridge going over a stream. Within minutes, the group was ready to go to sleep, and it was a good thing that they did so when they did, as exhaustion was beginning to take its toll on the party.<br>\r\n<br>\r\nEveryone except for Inuyasha and Kagome had fallen asleep in about a half an hour.<br>\r\n<br>\r\n\"Inuyasha,\" Kagome called before going asleep.<br>\r\n<br>\r\n\"What's wrong?\" he asked curtly, opening up one eye, peering at her as he sat hunched up in a corner.<br>\r\n<br>\r\n\"I don't want you to starve yourself, Inuyasha- you've still got to eat, you know.\"<br>\r\n<br>\r\n\"Yeah, yeah, I'll take care of myself. I'll get myself something in the morning to hold my appetite off.\"<br>\r\n<br>\r\nKagome sighed, \"Good...\" and turned over. She paused but spun around, looking at Inuyasha again, \"Good night, Inuyasha.\"<br>\r\n<br>\r\n\"Yeah, whatever...\" the hanyou mumbled. Kagome huffed in response and turned over again, her back facing Inuyasha.<br>\r\n<br>\r\n\"Good night, Kagome...\" Inuyasha said softly when all was silent and asleep.</span></div></div>",
            "created":1122786000,
            "id":264589,
            "title":"Settling Inn"
        },
        "111111111121":{
            "author_id":"palos",
            "author_name":"Mizu",
            "choices":[
                "Sesshoumaru",
                "Kouga"
            ],
            "content":"<div class=\"\"><div> <span>\"Damn that old woman!\" Naraku cursed, the sound of his voice breaking the usual silence of his castle.<br>\r\n<br>\r\n\"...But my lord, the hag herself said that the charm couldn't stop the curse you've put over him.\" Kagura offered, from her position near the door. <br>\r\n<br>\r\nNaraku looked at her as if she had asked if the sky was blue.<br>\r\n<br>\r\n\"While that is true, Kagura, that infernal charm hindrances my plans quite a bit. If he had not received that charm, Inuyasha could well have been the size of a sumo wrestler by the end of tomorrow. Now, that will take at least a month.\"<br>\r\n<br>\r\nKagura nodded and silence reigned once more in the room until Kanna, standing mutely by Kagura, cleared her throught<br>\r\n<br>\r\n\"Lord Naraku, forgive me, but this has been troubling me for quite some time now. The old woman, Rumiko, said that Inuyasha could also cure himself by seeking a power higher than yours...is there such a thing?\" the small albino girl asked quietly.<br>\r\n<br>\r\nNaraku thought for a moment, a worried look actually plastered to his face, before he grinned with pleasure.<br>\r\n<br>\r\n\"As you know, the charm the hag gave Inuyasha contained water from a spring atop Mt. Hakurei. Its rumored that if you were to bathe in that spring, it will despell any curses, hexes, or traces of black magic from you. However, Inuyasha is a hanyou, and the water would also purify him, and that's providing he wasn't purified from the strong barrier around Mt. Hakurei itself.\" Naraku explained.<br>\r\n<br>\r\n\"But my lord...\" Kagura piped in. \"What if Inuyasha were to visit the spring on the night that he becomes human?\"<br>\r\n<br>\r\nNaraku's eyes widened a moment, and he  appeared panicked, but soon returned to his state of calm.<br>\r\n<br>\r\n\"The path up Mt. Hakurei is said to be long and harsh one. I doubt that they could make it up before sunrise, especiallly with Inuyasha's increased girth.\"<br>\r\n<br>\r\n\"They have the the two-tail, Kilala, though. Could Inuyasha not ride the cat demon up the mountain and bathe before sunrise?\" kanna commented.<br>\r\n<br>\r\nThis time, Naraku's eyes widened and stayed widened. <br>\r\n<br>\r\n\"Damn! That is a possibility!\" Naraku cursed as he tried to think of some way the afformentioned possibility had some holes in it.<br>\r\n<br>\r\nAfter a few minutes of thought, and coming up with no solutions, Naraku turned to his servants.<br>\r\n<br>\r\n\"I want you to keep a close eye on Inuyasha and his group. Report back to me if they even begin to suspect Mt. Hakurei as a way of removing Inuyasha's curse.\" The hanyou ordered.<br>\r\n<br>\r\n\"Yes, my lord.\" Both Kagura and Kanna echoed as they stepped out of the large room Naraku usually resided in.<br>\r\n<br>\r\nAfter they were gone, Naraku's eyes narrowed again and he glared at the ceiling.<br>\r\n<br>\r\n'Inuyasha....this time you shall not escape me...'<br>\r\n<br>\r\n***<br>\r\n<br>\r\nThe Inn, the following morning<br>\r\n<br>\r\n\"Is it any bigger?\" Inuyasha asked, his voice lanced with panic and annoyance.<br>\r\n<br>\r\nInuyasha and company were just outside the inn they had stayed at the night before and the hanyou had tried to sneak a peek at his belly while no one had been looking, to see if the charm had worked well.<br>\r\n<br>\r\nUnfortunately, Kagome had spied him doing so, and before long she, along with Miroku and Sango had gathered around the larger half-demon to examine his growing stomach as well. Luckily, Kilala and Shippo had opted to spend their time playing in nearby meadow.<br>\r\n<br>\r\n\"Hmm.\" Was the only answer his three friends offered him. <br>\r\n<br>\r\n\"Well..its definately not smaller...\" Kagome mumbled, looking hard at Inuyasha's stomach.<br>\r\n<br>\r\n\"He's gained more weight.\" Sango stated simply and sighed.<br>\r\n<br>\r\n\"How can you tell?\" Miroku questioned, poking a love handle and earning a glare from Inuyasha.<br>\r\n<br>\r\n\"Look at his face.\" Sango advised.<br>\r\n<br>\r\nKagome and Miroku then saw how Sango had realized Inuyasha had gained more weight: A tiny bit of flab had been added to his face, giving it a rounder look. Yesterday, the hanyou's mug had been quite angular.<br>\r\n<br>\r\n\"What!? What's wrong with my face, dammit!?\" Inuyasha panicked, feeling his face as if looking for some foreign creature.<br>\r\n<br>\r\n\"Calm down, Inuyasha. Nothing to worry about now...at least not until you get a double chin..\" Kagome said.<br>\r\n<br>\r\n\"Double chin?\" her friends asked.<br>\r\n<br>\r\n\"When fat gathers under a person's chin, making it look as if they had two.\" Kagome tried to explain.<br>\r\n<br>\r\n...Oh.\" Iniyasha muttered as he put his shirt back on, though it looked as though he really didn't understand.<br>\r\n<br>\r\n\"Are your clothes still fitting well, Inuyasha?\" Miroku asked, noting the hanyou's stomach pressing against his haori.<br>\r\n<br>\r\n\"Well, its a little snug, I guess. The sleeves are fine, its the torso that I'm worried about.\" The half-demon replied.<br>\r\n<br>\r\n\"What about your pants?\" Sango questioned, earning looks from the rest of her companions.<br>\r\n<br>\r\n\"Well, I-\" she stammered, a blush coming to her cheeks. \"I mean, its only natural that Inuyasha's legs would be a bit, um, 'meatier' as well, but the last time we saw Inuyasha's legs was...\"<br>\r\n<br>\r\nThere was a moment of silence.<br>\r\n<br>\r\n\"When have we EVER seen Inuyasha's legs?\" Kagome asked to the group, amazed.<br>\r\n<br>\r\nAll eyes were now on Inuyasha, a blush rising to his cheeks. To take ttention off of himself, he decided to answer Sango's question about his pants.<br>\r\n<br>\r\n\"My pants are damn loose enough to not be worrying about!\" Inuyasha shouted, stamping his feet.<br>\r\n<br>\r\n\"You know, you really should tell us these things instead of getting angry you know! If you're uncomfortable, I could bring you back some clothes from my time!\" Kagome returned the shout, her temper rising.<br>\r\n<br>\r\n\"Feh, and walk around like you do all day? Like a madwoman? Ha! No thanks.\" Inuyasha retorted.<br>\r\n<br>\r\nA silent moment.<br>\r\n<br>\r\nKagome's eyebrow ticked.<br>\r\n<br>\r\nMiroku and Sango stepped away slowly.<br>\r\n<br>\r\nInuyasha metally slapped himself for being an idiot.<br>\r\n<br>\r\n\"Sit, boy.\" Kagome said with an amazing calm as Inuyasha plummeted into the earth with a slam.<br>\r\n<br>\r\n\"Augh...why did it hurt more than usual?\" Inuyasha mumured as he tried to stand.<br>\r\n<br>\r\n\"Most likely because you're fat now. You ARE heavier.\" Miroku said obviously as he and Sango approached the duo cautiously.<br>\r\n<br>\r\n\"Well now, if you two have gotten that out of your system, what is our course of action?\" Sango asked.<br>\r\n<br>\r\n\"Ain't it obvious? We have to find Naraku, so I can get rid of this gut!\" Inuyasha exclaimed, now fully upright, his hand on his belly.<br>\r\n<br>\r\nHowever, nefore any of them had a chance to ddo anything, a figure appeared on the scene that none of them were very excited to see...</span></div></div>",
            "created":1122872400,
            "id":264801,
            "title":"Naraku is Angry"
        },
        "1111111111212":{
            "choices":[
                "made a grab for Inuyasha's belly, shaking it and smirking.",
                "started to run off."
            ],
            "content":"<div class=\"\"><div> <span>Thick, cycling clouds of dust swept down, behind, and in front of a figure, obscuring him as he rapidly sped down the road. Watching closely, the gang all squinted to see if they could get a clear view of whoever was hurrying down the dirt path in front of the inn.<br>\r\n<br>\r\nInuyasha could only guess who it was...<br>\r\n<br>\r\nFor a few moments, it appeared as if the figure had passed the inn without question and was continuing rapidly on his sprint. However, the figure stopped abruptly and seemed to do a 180, as if he had just detected something out of the ordinary barely at the corner of his eye... which, indeed, he had.<br>\r\n<br>\r\nMarching his way down the road, his silky strands of ebony colored hair flowing slightly and silently in turn with his steps, the wolf demon known as Kouga looked towards the group with a little glowing repressed eagerness. <br>\r\n<br>\r\nThe wolf demon rushed over to Kagome, attempted to grasp her hands in his. \"Are you alright, Kagome?\" he asked with an adopted sense of concern.<br>\r\n<br>\r\n\"Ah... uhm, yes, I'm fine, Kouga...\" Kagome sighed, turning to the others for a little help, trying to remove her hand from Kouga's rough grasp. <br>\r\n<br>\r\nInuyasha didn't look as outraged at Kouga and ready to jump at him as usual, for obvious reasons. In fact, he was thinking about ways to conceal his gain from Kouga, although not many of them were that good... He could remain hiding behind the tree, but he could never live being found that way, lest he come across as a coward to Kouga, and he didn't want that.<br>\r\n<br>\r\nKagome shuttered as Kouga kept at his attempts to convince her to forget all about Inuyasha.<br>\r\n<br>\r\n\"... and that Inuyasha can't always protect you for long,\" Kouga cried, \"Hey... in fact, where is that poor excuse for a half demon?\" he smirked with his fangs baring. Honestly, he was suprised that the hanyou hadn't tried to rip out his throat by now.<br>\r\n<br>\r\n\"I'm right here, you mangy mutt!\" Inuyasha snarled, as if on cue, curtly shoving Kouga forward with his fists, away from Kagome.<br>\r\n<br>\r\nKouga managed not to fall back. However, when he regained balance in a matter of seconds, his eyes widened once he caught sight on Inuyasha. He made a noise similar to a sneeze, grunted, and cracked a small, toothy smile, biting hard on his tongue, and doing his best to hold back any laughter... or at least save it for later.<br>\r\n<br>\r\n\"Well, well,\" Kouga sneered, placing his hands on his hips, shining with great confidence in himself, \"It sure is a good thing to know that Kagome hasn't been in any immediate danger lately... because dog breath here's too busy stopping at inns to go stuff his face! What's the matter, Inuyasha? Why'd you get so hungry and porky all of a sudden?\"<br>\r\n<br>\r\n\"Why you...\" Inuyasha shuttered and shook as he held back his rage. Sadly, he could feel his belly jiggle slightly. He would have slugged him right there if he didn't see Kagome step in between the two to intervene.<br>\r\n<br>\r\n\"That's enough, Kouga\" Kagome prodded and glared at Inuyasha sharply, warning him not to attack, lest he wish to suffer another 'sit' treatment, especially embarassing in front of Kouga. The wolf demon closed his eyes, sniffed, and turned his face the opposite direction.<br>\r\n<br>\r\n\"Honestly, Kagome, I don't see why you put so much faith in him,\" Kouga huffed, \"Especially now when dog boy's getting so pudgy,\" Kouga smirked as he-</span></div></div>",
            "created":1123304400,
            "id":265778,
            "title":"Kouga Appears"
        },
        "11111111112121":{
            "author_name":"Rei",
            "choices":[
                "snatched the charm from around his neck",
                "was gone"
            ],
            "content":"<div class=\"\"><div> <span>Kouga reached out and took two generous handfulls of the half-demon's new belly and shaking it. Inuyasha of course was quick to aim a blow and several particularly nasty insults at Kouga but a still jiggling belly didn't really inspire the sort of confidence he needed to carry out said threats. Just when he had managed to pull himself back together, Kouga-</span></div></div>",
            "created":1130734800,
            "id":281703,
            "title":"jiggling"
        },
        "111111111121211":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Switch to Naraku",
                "Stay with the Tachi"
            ],
            "content":"<div class=\"\"><div> <span>Kouga noticed that Inuyasha had a new charm around his neck.  \"Well well, a new charm from Kagome?\" Kouga growled and he snatched the charm from Inuyasha's neck. \"HEY!\" shouted Inuyasha as he tried to grab the charm from Kouga. \"If I get get a gift from Kagome, no one can!\" yelled Kouga has he crushed the charm in his hands. \"Later guys!\" he said as he sped off in his tornado. Inuyasha sank to his knees, what was he going to to now? Now the gain will be back to normal...</span></div></div>",
            "created":1132117200,
            "id":284337,
            "title":"Bye-Bye Charm."
        },
        "1111111111212112":{
            "author_id":"amadaeus100",
            "author_name":"scritorio",
            "choices":[
                "30 lbs, instantly",
                "more..."
            ],
            "content":"<div class=\"\"><div> <span>Inuyasha would have cried, were it in his nature. Instead, he fell to his knees. Chasing after Kouga was impossible enough at normal, let alone in his current state.<br>\r\n<br>\r\nAs if to make up for his time under the charm, Inuyasha felt his stomach bulge a little more. <br>\r\n<br>\r\n\"Damnit!\"<br>\r\n<br>\r\nSango grabbed Kagome. \"We can convince him to give it back!\"<br>\r\n<br>\r\nThey leaped on Kirara and chased after Kouga, leaving Inuyasha and Miroku alone.<br>\r\n<br>\r\n\"Are you all right?\" Miroku approached Inuyasha to help him up. But just as he did, the curse had another jump, making up for lost time. Inuyasha gained...</span></div></div>",
            "created":1194219480,
            "id":460656,
            "title":"Stay with the Tachi"
        },
        "11111111112121121":{
            "author_id":"mnandy",
            "author_name":"Nandy",
            "choices":[
                "should they wait for Kagome ",
                "Should they go to the village"
            ],
            "content":"<div class=\"\"><div> <span>Damm that Koga now what am I going to do ...................\" Inuyasha Stopped when he noticed that his kimono started to be tighter and tighter. The reason why was that the curse was catching up to him he gain 30lb.Plus he was felling sad and slugish he could hardly move. \"Hay Miroku can you help me up\"said Inuyasha in a slugish tone.\"Sure Inuyasha ok up one two three\" it was so difficult to pick Inuyasha up goes of his growing gut.\" *Huff* *Huff* man that was tough Inuyasha,I mean you'r like so heavy\"said Miroku in a tired tone.<br>\r\n\"Shut up Miroku\"said Inuyasha in a disappointed way. <br>\r\n\"I'm tired should we go to the village\"</span></div></div>",
            "created":1248726240,
            "id":733310,
            "title":"30 lbs, instantly"
        },
        "111111111122":{
            "author_name":"Rei",
            "choices":[
                "Inuyasha decides to wake the others up and hurry to Mt. Hakurei",
                "Inuyasha leaves the room by himself for a private breakfast"
            ],
            "content":"<div class=\"\"><div> <span>It had been a long night for Inuyasha who had been much too hungry to sleep well. As soon as he saw the sun beginning to rise he promptly got up, placing both hands to his growling belly to survey the damage. It had definately grown somewhat over the night and he shuddered to think what state he would be in had the process not been slowed. Regardless though he was still starving. They would probably sleep a little further into the morning but then again Inuyasha had no qualms with forcing them from their peaceful slumber to hurry things along.</span></div></div>",
            "created":1122786000,
            "id":264624,
            "title":"A Long Night"
        },
        "11112":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Few hours later",
                "Next Day"
            ],
            "content":"<div class=\"\"><div> <span>\"What do you mean?\" Inuyasha said as he continued to stuff his face.  \"Well, you just seem.....bigger.\" said Kagome. \"Keh, I aint any bigger than I was yesterday. Now shut up and give me some more breakfast you wench!\" Inuyasha ordered. \"Fine fine, eat for all I care!\" Inuyasha smirked.</span></div></div>",
            "created":1159074000,
            "id":348514,
            "title":"Doesnt believe."
        },
        "112":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Next Day",
                "That Night"
            ],
            "content":"<div class=\"\"><div> <span>In his new castle Naraku paced, the reason: the silver haired hanyou Inuyasha.  He had been a thorn in his side for some time.  Destroying his incarnations, destroying his castles...such a nuciance.<br>\r\n<br>\r\nWhile wandering his castle Naraku thought of a way to stop his nemesis.  Inuyasha was getting stronger and faster by the day, and he was also learning new techniques for the Tessigua (Tetsuiga), Naraku was puzzled. He needed a way to slow him down...permanently.<br>\r\n<br>\r\nHe stopped his pacing when he came to one room in particular, it belonged to the son of the former castle leaders.  The boy had wierd spells that only worked on men.  Wait, Inuyasha was a man, maybe some of them would work on him.<br>\r\n<br>\r\nAs he looked through the scrolls he noticed such spells as: Hairy Guts, Bigger \"Packages\"...but one caught his eye: Gradual Laziness!<br>\r\n<br>\r\nHe read the scroll, if one were affected by this spell they would become lazier over time, which means they would do nothing but eat all the time. At first the process is slow, but then it speeds up.<br>\r\n<br>\r\nNaraku was standing over a pot putting the necessary ingrediants in.  They scroll said it needed an object of clothing for the spell to be transfused into, Naraku chose Inuyasha's new white garment.<br>\r\n<br>\r\nIn 1 month and a half....Inuyasha wouldnt want to do anything anymore....</span></div></div>",
            "created":1122094800,
            "id":263121,
            "title":"Naraku's De-Inu plan!"
        },
        "1121":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "3 hours later",
                "hour later"
            ],
            "content":"<div class=\"\"><div> <span>Inuyasha woke up with a big yawn and looked around.  The only one at the camp was Shippo, which was weird.  He then looked at himself.  He was still in the white garments Kagome called 'briefs'.  He thought he should put his kimono back on, but thought against it. \"Too much work.\" he yawned again and jumped down to the base of the tree he was sleeping in.  \"Man I'm hungry!\" he said as he plundered through Kagome's yellow backpack. He found 4 chocolate bars, a bag of dried potatoes, 5 rice balls and a smaller bag of dried potatoes. \"Sweeeeeeet!\" Inuyasha said as he began to chow down.<br>\r\n<br>\r\n20 minutes later Inuyasha belched contently, rubbing his chubby little belly. \"That was good.\" Inuyasha said as he yawned.  He fell asleep again, still in his briefs.</span></div></div>",
            "created":1162357200,
            "id":356480,
            "title":"Lazy Binge."
        },
        "11212":{
            "author_id":"somebody1208",
            "author_name":"somebody1208",
            "choices":[
                "Kagome steps in",
                "Shippo steps in"
            ],
            "content":"<div class=\"\"><div> <span>Inuyasha awoke from his nap.  He yawned at scratched at his belly, which began to growl.  Thats when he noticed the area was filled with food!  <br>\r\n<br>\r\n\"Where did all this food come from?\" said Inuyasha.  \"O well, food is food\" and so, grabbing the nearest morsal stuffed it in his face and ate.  He ate slowly and lazily, but continued to eat the seemingly endless supply of food.<br>\r\n<br>\r\nKagura stood nearby, watching Inuyasha eat, his belly beginning to bloat giving him a chubby look.  Naraku's plan is working thought Kagura.  I'll just have to make sure he keeps eating and those other brats don't interfere.  Just as she tought that...</span></div></div>",
            "created":1162443600,
            "id":356658,
            "title":"Food!!!"
        },
        "112122":{
            "choices":[
                "Kagome",
                "Sango"
            ],
            "content":"<div class=\"\"><div> <span>\"Inuyasha, what do you think YOU'RE doing?\" cried the familiar shrill voice of Shippo as he scurried up nearby the lathargic hanyou.<br>\r\n<br>\r\nInuyasha grunted as he beamed down at his short fox demon companion. Quickly, he inched around the pile of food and seemed to heap it all in a pile away from the other. Then, he scooped up a rice ball grumpily and took a bite out of it.<br>\r\n<br>\r\nKicking a dust cloud in Shippo's face, Inuyasha snapped, \"Why don't you high tail it out of here, short stuff? Can't you see I'm a little busy?\"<br>\r\n<br>\r\nShippo lept onto a nearby rock to put himself at least on somewhat of an equal looking level with the dog demon, \"Busy? Looks like you're just stuffing your face!\"<br>\r\n<br>\r\nWith a dart, Shippo lunged up towards Inuyasha's hand and tried to snatch the rice ball from his clutches. The youngster let out a scowl when his grasp missed. He kept on bouncing up and down on his paws, trying to bound up to it.<br>\r\n<br>\r\nThe hanyou caught Shippo before tossing him aside, \"Go get your own,\" he snarled.<br>\r\n<br>\r\n\"No fair!\" Shippo cried, \"You always steal all my food and now you're keeping all this to yourself? You're so greedy, Inuyasha! Besides, I'm a growing demon-\"<br>\r\n<br>\r\n\"So am I!\" Inuyasha blurted in between bites as he made a half-attempt at a muscle.<br>\r\n<br>\r\nKagura narrowed her eyes as Shippo kept on rattling. <br>\r\n<br>\r\nIf this goes on, he might detract Inuyasha from his appetite or even alert the others about his condition should it worsen. Perhaps I should intervene by somehow moving the little one somewhere else, Kagura thought, looking at Shippo. But if I do that, there's too great a chance that I'll be noticed or suspicions will arise...<br>\r\n<br>\r\nKagura decided to wait in the shadows of the trees for just a while more, but to her dismay, the squabbling demons were soon joined by. . .</span></div></div>",
            "created":1162443600,
            "id":356700,
            "title":"Shippo's Complaining"
        },
        "1121222":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Inuyasha continues to eat!"
            ],
            "content":"<div class=\"\"><div> <span>\"What are you two fighting about now?\" asked Sango as she walked into the clearing. \"Inuyasha's hogging all of this food!\" Shippo wailed. Sango looked puzzled, all she saw was Shippo pointing at Inuyasha, who was still in his briefs, and empty space. \"Ummmm....Shippo, there isn't any food here, just Inuyasha in his underwear.\" Sango told Shippo, while patting him on the head.  \"But, but!  Inuyasha is here, stuffing his face with tons of this food!\" Shippo screamed frantically. Sango sighed.  \"Shippo, I think you need a nice long bath, followed by a nap.\"  Sango said as she picked up Shippo and carried him off.<br>\r\n<br>\r\nKagura stood there stunned, did the slayer not see the mountains of food surrounding the half-demon?  The fox cub had obviously seen it, as he had tried to take it.  \"Maybe Naraku did something...\" pondered Kagura.  It then hit her, only demons could see and touch the food, and she, being an incarnation of Naraku, was also able to see it.  Kagura smirked.  \"What a perfect way for those pesky humans not to interfere.\"</span></div></div>",
            "created":1162530000,
            "id":356870,
            "title":"Sango doesn't see it."
        },
        "11212221":{
            "author_id":"somebody1208",
            "author_name":"somebody1208",
            "choices":[
                "Drinks it",
                "Doesn't drink it"
            ],
            "content":"<div class=\"\"><div> <span>*BUUUUUUURP*<br>\r\n<br>\r\n\"O thats good\" said Inuyasha, patting his bloated belly.  Inuyasha yawned, and laid on his back, stuffing more food in his mouth.  Letting out another belch, Inuyasha yawned again and began rubbing his belly.  His stomach had swelled greatly, bulging outward a good foot, sagging over his underwear.  <br>\r\n<br>\r\n\"I'm pretty stuffed\" said Inuyasha, patting his belly again, causing it to slosh and jiggle.  \"I don't think I can eat any more\" he said, feeling very bloated.  His stomach was causing him some pain, and he continued to ease it by rubbing his overstuffed stomach.<br>\r\n<br>\r\nKagura watched the half-demon and laughed to herself.  Taking out a small vial, she began to scope out her next move.  Naraku said to give it Inuyasha after he had eaten alot.  It would speed his digestion and make him hungy again.  Naraku wanted Inuyasha nice and fat before they made their move.  So Kagura took out another vial, and drank it.  Slowly, her body changed to take the form of an old woman.<br>\r\n<br>\r\nShe slowly walked up to the stuffed hanyou and said \"O my, looks like you've eaten quite a bit huh?\"  she said.<br>\r\n<br>\r\n\"Yeah what's it to you old lady\" said Inuyasha, quickly clutching again and his aching belly.<br>\r\n<br>\r\n\"Well I just was passing by, and it looks like I might be able to help\" said Kagura  \"Drink this\" she said, handing Inuyasha the vial.  Inuyasha looks at it for a second, and decides to...<br>\r\n<br>\r\n</span></div></div>",
            "created":1162702800,
            "id":357141,
            "title":"Lets make him nice and fat"
        },
        "1122":{
            "author_id":"rich8",
            "author_name":"rocko",
            "choices":[
                "next week",
                "something happens"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Inuyasha woke up in the midddle of the night. It was his night to keep watch. Inuyahsa began to get up then felt extremely tired. Ah we'll be ok for one night, and inuyasha fell asleep.</span></div></span></div>",
            "created":1123736400,
            "id":266914,
            "title":"lazy"
        },
        "114":{
            "choices":[
                "The next morning...",
                "The next day..."
            ],
            "content":"<div class=\"\"><div> <span>Naraku smirked underneath his pale baboon mask as he faded into the mists. <br>\r\n<br>\r\nOf course, the answer couldn't be any clearer. Inuyasha's strength was getting to the point where the hanyou began to become more unyielding and resistant to his weaker magics and spells, in battle or otherwise. <br>\r\n<br>\r\nThat insolent insect of a hanyou was beginning to get on his nerves, and it was becoming a real strain for Naraku to scrape at him. The foolish hanyou kept on coming back for more. <br>\r\n<br>\r\nThe answer wasn't to seek another battle with Inuyasha right away- he would undoubtably be even stronger, but it's not as if Naraku truly feared that petty nuisance, Inuyasha; he could always wipe Inuyasha out if he wished with a great onslaught of his true essence in one coup de grace.<br>\r\n<br>\r\nNo. It would be absolutely foolish to unleash his full might to destroy someone like Inuyasha- it wouldn't even require half of his full abilities. However if Naraku exerted himself so, he would be disabled for quite a while: too long for his comfort, for he had many other enemies other than Inuyasha, and they were surely much more stronger and powerful than a pathetic half dog demon.<br>\r\n<br>\r\nBut Naraku wanted Inuyasha to be eliminated as soon as possible. Again, it was true that Inuyasha was strengthening himself every day, and it was also true that Naraku was tired of confronting him.<br>\r\n<br>\r\nDirect fighting with Inuyasha would be very impractical if Naraku wished to withhold his dominance as the great demon he was while knocking down the hanyou as quickly as possible. <br>\r\n<br>\r\nAll he needed to do to take down Inuyasha was to approach him in an altogether new fashion: the secret arts of curses and spells. Naraku would strike his unsuspecting prey like a poisoned knife in the dark: a double clencher. He would have to cast a spell on Inuyasha that would disable him greatly... and he had just the curse in mind.<br>\r\n<br>\r\nThe only light in the dark chambers of Naraku's castle was a dim candle, pulsing pale oranges through the cold, damp walls. Devious darkwaters dripped on the floor behind Naraku's back. With deft fingers, he extracted the knuckle bones from a pickled kappa hand with seemingly no effort. The kappa knuckles soon found their way into a mortar and were crushed calmly by the pestle Naraku grasped.<br>\r\n<br>\r\nThen, using his concentreted deliberation, a glass vial containing graveyard soil flew into Naraku's hand. With accurate precision, he mixed the correct proportions of each substance together. Naraku was quite the master of poisons and the arcane, as he was of many things.<br>\r\n<br>\r\nNaraku carried a vase with the mixture he had just created upstairs to a large room full of shelves containing all kinds of scrolls, his study. Of course, to the naked eye, these tomes were nothing but useless sheets of paper, scrolls probably stolen from some lord's castle, which some were. containing the frivolous blather of compassionate poetry, holy sutras, and love for transient things like nature, of course, Naraku was unmoved and untouched by such things. Not one appeared to be a spell scroll, which, of course, was the very nature of every scroll in the room, albeit for a very special one.<br>\r\n<br>\r\nRipping a red bond scroll off the shelve, Naraku placed it on the floor and sat down, breaking the seal with his unique charm that involved casting around dark intentions and pressing his finger down on the seal.<br>\r\n<br>\r\nAs the dry parchment unfolded, Naraku sneered in pity. The characters scrawled across were that of a romance novel. How pathetic. With great care not to spill any of the powder, Naraku put the entire powdery contents of the vase in his palm. Then, with great flourish, he cast it down onto the paper, which enveloped it into a thick cloud.<br>\r\n<br>\r\n\"Reveal your true nature!\" Naraku whispered with no emotion whatsoever. The entire cloud was absorbed into the paper as it turned blood red. The characters rearranged themselves until they transformed from traditional Japanese into a strange dark script, long forgotten by the land and only remembered by a few, lonely, obscure priests, who struggled to linger onto life itself with their dark magic, which of course, took a toll on their souls because of their improper usage of the spells.<br>\r\n<br>\r\nNaraku slightly grinned as he saw that this was indeed the spell he was looking for. Once cast, it would put Inuyasha on the path to destruction at his own hands. No, it would not cause the young hanyou to commit seppuku, although it would be quick, it would be too noticable and brash.<br>\r\n<br>\r\nAt its climax, this spell would cause Inuyasha to want to do nothing at all but eat. Inuyasha could care about nothing at all except for stuffing his face. At first, it would be barely noticable; Inuyasha's appetite would just be slightly larger. But day by day, the hanyou would think less about others and more about his stomach as his tough character and body deteriorated into an absolute soft glutton. He would slowly lose interest in that remarkably powerful Kagome girl, leading them to fight. He might just drop the whole quest of finding the Sacred Jewel shards in favor of finding more food. Then, slowly but surely, Inuyasha would be at a point where he would keep on gorging himself until he burst.<br>\r\n<br>\r\nNaraku smiled a grisly smile. It was perfect. Raising his hands into the air, he began to cast the spell, reading the words perfectly and cursing the garments Inuyasha wore to bind him to that very spell...</span></div></div>",
            "created":1122094800,
            "id":263099,
            "title":"A Poisoned Knife in the Darkness"
        },
        "1142":{
            "author_name":"Rei",
            "choices":[
                "Inuyasha raids the food supply",
                "Someone approuches fromt he woods"
            ],
            "content":"<div class=\"\"><div> <span>After a hearty breakfast, during which Inuyasha had taken several helpings the groups set off once more. They made a stop in a nearby village to gather supplies and with enough food for at least a month headed into the wilderness. They hadn't been walking longer than an hour before Inuyasha was complaining \"Geez, can't we take a break already? I'm starving here.\"  The others were reluctant to loose that sort of time but gave in. No one seemed to be particularly hungry save for Inuyasha who helped himself to several portions. Talking amongst themselves the others barely noticed but after three more stops following this one they were becoming more and more frustrated.<br>\r\n<br>\r\n\"We're never going to get anywhere if we keep stopping like this.\" Kagome complained at the forth. Inuyasha only shrugged \"It's getting dark anyway,\" He said through a full mouth. Kagome fought back to the urge to complain anymore and went to help the others set up camp. After a large dinner, at least on Inuyasha's part, they went to sleep. On the annoyed insistance of the others Inuyasha kept watch but it wasn't long before his stomach was growling again.</span></div></div>",
            "created":1122526800,
            "id":264050,
            "title":"Lunch breaks"
        },
        "11421":{
            "author_id":"somebody1208",
            "author_name":"somebody1208",
            "choices":[
                "Go find more food",
                "Wake everyone up to get more food"
            ],
            "content":"<div class=\"\"><div> <span>Inuyasha's mouth began to water, and then he noticed the food supplies.<br>\r\n<br>\r\nAt first, he tried to resist the urge, but the spell was to powerful, and his stomach ultimatly won.  Inuyasha looked over all the food, and began to gorge himself, eating everything in sight.  <br>\r\n<br>\r\nAfter eating for some time, Inuyasha let out a contented belch and massaged his bloated belly, beginning to bulge out.<br>\r\n<br>\r\n\"Delicious he said\", patting his belly.  \"Although I really could go for more food\"</span></div></div>",
            "created":1161493200,
            "id":354241,
            "title":"So much for rations..."
        },
        "115":{
            "choices":[
                "The next morning..."
            ],
            "content":"<div class=\"\"><div> <span>Naraku shook his head as he saw the sleeping hanyou. He was so simple, yet there were some things about the half dog demon that even astounded Naraku. <br>\r\n<br>\r\nWhat kept Inuyasha going? Why was he so persistant in defeating him? His hands recoiled as he got somewhat of a realization.<br>\r\n<br>\r\nNaraku's white baboon fur robes rose and cascaded in the mist as he took off. He couldn't keep on trying to forcefully defeat Inuyasha, that was a given if he wanted to ensure an effortless victory against the hanyou. Instead of striking his body, Naraku knew that he had to destroy what kept his body going... his heart.<br>\r\n<br>\r\nYes, there was Inuyasha's weakness, his delicate, feeble, human heart. He could love, and he was consumed with love at times, and love was his priority. Could his love for his human companions and his desire to protect them from danger possibly be his major pulsation of power and his source of determination?<br>\r\n<br>\r\nEven stronger than that would be his personal feelings for that Kagome girl who was remarkably spiritually gifted, no matter how much they squabbled with each other. Together they posed a somewhat formidable force, and if their relationship died, certainly they would both be devistated. If there was only a way he could sever that affectionate connection they had with each other.<br>\r\n<br>\r\nAnd he knew that there was a way that he could do so. He would destroy their main source of communication between each other, thus ultimately killing their intimateness. He would take Inuyasha's ability to talk and cause it to be useless, or at least, make him avoid talking, for if he destroyed the hanyou's vocal chords, a hostile attack would certainly be sensed.<br>\r\n<br>\r\nNo, Naraku would make Inuyasha not want to talk to Kagome or anyone else any more. How could this be achieved? He would cast a spell on Inuyasha that would penalize the half demon for every word he spoke... he would gain a substantial amount of weight, and surely it would begin to pack onto the helpless demon if he resisted the spell, eventually making him large, fat, heavy, and slow- an easy target and a weak fighter. Surely Kagome would become disgusted with Inuyasha becoming out of shape and the twosome's relationship would begin to falter, causing instability, and thus giving Naraku the upper hand.<br>\r\n<br>\r\nIt was all perfect. Withdrawing his hands from his cloak, Naraku commenced in casting the spell on Inuyasha's undergarments.</span></div></div>",
            "created":1122094800,
            "id":263102,
            "title":"Naraku's Intentions to Shatter Inuyasha's"
        },
        "1151":{
            "choices":[
                "He would tell the others about what was happening to him ",
                "He would find out about what was happening to himself alone ",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Inuyasha woke up to a beautiful morning. Not only the nature outside, but the beautiful girl sleeping next to him. Kagome had accidentally fallen asleep next to him the previous night. <br>\r\n<br>\r\n\"Good morning, Kagome,\" he said while blushing madly. He didn't know until seconds later that he had just gained fifteen pounds because Naraku had just cast a spell on him to make him gain five pounds for every word he spoke.<br>\r\n<br>\r\nKagome awoke to something soft and squishy. She opened her eyes to Inuyasha. Kagome repeatedly poked Inuyasha's soft belly.<br>\r\n<br>\r\n\"Inuyasha, did you gain weight?\" Kagome asked knewing that Inuyasha would have an argument with her -- which also lead to Kagome uttering the dreaded word that Inuyasha despised. <br>\r\n<br>\r\n\"Fool! I am too muscular and exercise to much to gain weight,\" Inuyasha muttered. Kagome could see a definite change because it looked as if Inuyasha had gained somewhere around sixty pounds. <br>\r\n<br>\r\n\"Inuyasha, go look at yourself!\" Kagome yelled angrily panicking. Inuyasha was annoyed with Kagome's blunt attitude. While he went to go look at himself, he noticed that it was hard to get up and that he thudded and jiggled every time he took a step. When he looked at himself, he saw that Kagome was not lying. In fact, she could have told the truth a little bit more spot-on. He had gained about seventy five pounds ever since he woke up. He had to decide what to do next: </span></div></div>",
            "created":1290994920,
            "id":1003883,
            "title":"The next morning..."
        },
        "12":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "He eats and eats and eats!",
                "He tries to cast a spell on himself",
                "Gets help from Kagome",
                "Drink grease/fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kouga was sitting under a tree thinking....he was tired of his skinny frame, he wanted to be bigger!! He wanted to be obese, over-weight, fat, chubby! Whatever you want to call it! He just needed a way to do it....?</span></div></span></div>",
            "created":1122094800,
            "id":263034,
            "title":"Kouga's Wish"
        },
        "121":{
            "choices":[
                "\"I'm sticking with what I had before, putting on weight. Kagome will hav",
                "\"Fattening up Inuyasha would be our best option, but I'll have to take t"
            ],
            "content":"<div class=\"\"><div> <span>\"Whaaat?!?\"<br>\r\n<br>\r\n\"Kougaaa!?!\"<br>\r\n<br>\r\nKouga's two loyal followers lamented and moaned with great concern as they flailed their arms and made nervous circles around their leader who was now frantically stuffing his face, growling furiously. <br>\r\n<br>\r\nThe afforementioned leader of the now small wolf demon tribe had much a blazing fire of rage and sheer determination burning in his eye. His two subordinates feared they saw some kind of contempt and maybe mania in his eyes, as if he couldn't stop eating even if he tried- as if he'd keep on eating until he died.<br>\r\n<br>\r\nKouga took a large slab of salted pork with two hands, leaned his head down before biting it harder than he had to. Then in one motion, Kouga snapped his head up, ripped the meat and swallowed the chunk he had tore off. He continued to eat the pork in a ravenous fashion until he had finished. <br>\r\n<br>\r\nHe was sitting crosslegged, facing the large, broken, old food cabinet. He leaned forward and started to furiously rampage the closet, knocking over a glass container of flour in the process, causing it to shatter in a loud crash.<br>\r\n<br>\r\n\"What do you think you're doing, Kouga? Is something wrong?\" the two wolf demons that followed him cried, suddenly afraid that something was quite wrong with their chief and friend.<br>\r\n<br>\r\nBut Kouga kept on cramming messy handfuls of rice patties, tuna, cheese, and steak strips into his mouth with wild cycles of his arms, grumbling as he did so. <br>\r\n<br>\r\nGinta and Hakkaku grabbed Kouga's muscular arms, hoping to stop him before he stuffed himself to death. However his arms were only in their grasp for little more than a few seconds before he snapped his arms to the side and roared, \"Get off me, you fools!\" Ginta and Hakkaku were thrown off to the side.<br>\r\n<br>\r\nLanding flat on their bottoms, blinking dumbly, the twosome sensed that there was something obviously wrong with Kouga. He seemed to be perfectly well at the beginning of the day. It was only a few hours ago when they were out with him, running through the forest, struggling to keep up as usual, and all seemed absolutely normal...<br>\r\n<br>\r\nKouga wanted to keep on running, but Ginta and Hakkaku were on the point of collasping, so Kouga agreed to allow them all to break. While the pair of rookie wolf demons were sprawled out on the ground, panting and trying to catch their breath, they took note that Kouga had decided to rest under a tree. Ginta sensed that something might not be right when he saw Kouga's eyes. They were darker and he seemed to be brooding, as if he were missing and wanting something.<br>\r\n<br>\r\nHakkaku figured that he was just yearning for Kagome again, however soon after they came across an abandoned village... Kouga said they would stay the night: something he very rarely said himself until it was well past sundown and his followers seemed about ready to fall asleep anyway. It was even more discerning when Ginta and Hakkaku soon lost track of Kouga- they thought he had took off, but they were shocked to find him inside a deserted kitchen, madly binging on delectables!<br>\r\n<br>\r\n\"Kouga, wait! Slow down! What's going on!\" Ginta protested.<br>\r\n<br>\r\nKouga gave Ginta a death glare and snarled before sighing and putting down a slab of meat and crossing his arms. The two junior wolf demons looked at their leader for answers.<br>\r\n<br>\r\nThere was much silence as Kouga continued to eye the two.<br>\r\n<br>\r\nKouga burped deeply and patted his stomach, which now bulged out and was taut with the huge amount of food he had just consumed. Rising to his feet, Kouga turned his back to his friends who remained on the ground.<br>\r\n<br>\r\n\"What's it to you- none of your business anyway,\" Kouga sneered.<br>\r\n<br>\r\n\"...Kouga...\" Hakkaku sighed, letting his head down.<br>\r\n<br>\r\n\"We just want to know if something's wrong- you seem very upset...\" Ginta meekly admited.<br>\r\n<br>\r\n\"Yeah, and you seem... well, really determined to eat as much as you can get your hands on... what's going on?\" Hakkaku implored.<br>\r\n<br>\r\nKouga scowled before crossing his arms and spinning around to face the twosome, his locks and ponytail of black hair flying in the hair briefly, a look of irritation etched into his face \"Peh, if you have to know I was just... hungry, that's all.\"<br>\r\n<br>\r\n\"Hungry?\" Hakkaku asked, his eyes wide.<br>\r\n<br>\r\nKouga sighed and hung his head low, \"No...\" he admitted, \"Alright...\" he whined hopelessly, \"I can't lie to you guys, especially not about this...\" he stopped and closed his eyes. Upon opening them, the two junior wolf demons gave him a look to continue, and he reluctantly did so.<br>\r\n<br>\r\n\"Alright, alright. I was trying to... put on some weight,\" he confessed.<br>\r\n<br>\r\n\"Put on weight?\" <br>\r\n<br>\r\n\"But Kouga, why?\"<br>\r\n<br>\r\n\"I don't know! Because I keep on getting blown away in battle!\" Kouga snapped suddenly, causing the two wolf demons to cower and shiver. Kouga's fists tightened and his knuckles cracked and turned white. His voice started to waver, \"I have lost, lost fight after fight against Inuyasha or Naraku or whoever.\"<br>\r\n<br>\r\n\"But Kouga, you win a lot of fights!\"<br>\r\n<br>\r\n\"Yeah, you're the best!\"<br>\r\n<br>\r\n\"No!\" Kouga roared, \"Those fights don't matter at all to me. Anyone could defeat half of the minor demons that tread this land. The fights that count are the ones I keep on losing... against Naraku,\" he spat the name out like poison.<br>\r\n<br>\r\n\"And I know,\" he trembled, \"That I can't continue to win like this... Naraku gets stronger every day and Inuyasha does as well, by entire leaps and bounds... I'm going to get nowhere with this skinny boy frame,\" Kouga explained. <br>\r\n<br>\r\n\"And I think if I can put on more weight, then my speed from the Sacred Jewel would be a great advantage because my enemies would be struck hard by my weight and quickly from my speed. It would be a great combination, big weights at fast speeds- normally it couldn't occur and weight would slow me down.\"<br>\r\n<br>\r\n\"Lucky for me I've got these babies,\" Kouga smirked as the Sacred Jewels sparkled in the light.<br>\r\n<br>\r\n\"Ahh...\" Ginta exclaimed, understanding his leader's motives.<br>\r\n<br>\r\n\"But wait,\" Hakkaku protested, \"Your plan only has one big flaw... what about Kagome? Would she still care for you as much as she does if you started packing on the pounds.\"<br>\r\n<br>\r\nKouga's eyes widened slightly as he gasped under his breath, \"Ah. Good point...\" he said before he looked downcast at the ground.<br>\r\n<br>\r\n\"But what if Inuyasha was the one who put on the pounds,\" Ginta suggested, \"Maybe she'd lose interest in him in favor of you!\"<br>\r\n<br>\r\n\"That might work, but like I said before, I need to put on weight if I'm ever going to hope for victory,\" Kouga stated, \"And imagine what could happen if Inuyasha learned to balance extra weight while wielding that sword of his... the results could be fatal!\"<br>\r\n<br>\r\n\"Hmm...\" Ginta thought, \"Well, Kouga, what do you say.\"<br>\r\n<br>\r\nKouga took a deep breath and said:</span></div></div>",
            "created":1122094800,
            "id":263056,
            "title":"Kouga's Frantic Struggle"
        },
        "1212":{
            "author_name":"Rei",
            "choices":[
                "Capture Inuyasha in his human form",
                "Think up something a bit more sneaky"
            ],
            "content":"<div class=\"\"><div> <span>\"We'll have to fatten up Inuyasha as well,\" Kouga declared resolutely, one hand resting on his still distended belly. \"He has a disatvantage, without my speed I doubt he'd be very effective fighting anymore and of course Kagome would loose interest him him.\" His satisfied smile faded. How were they to go about this?</span></div></div>",
            "created":1122613200,
            "id":264252,
            "title":"Planning"
        },
        "122":{
            "choices":[
                "That night, at the campfire with Ginta and Hakkaku...",
                "A Week after the Spell...",
                "He botches the spell, but gets a similar outcome..."
            ],
            "content":"<div class=\"\"><div> <span>Kouga paced up and down the line he had made in the dirt and scattered white pebbles as equally spaced as he could to form a ring around the line. Gathering a fistful of dirt in his palm, Kouga threw it forcefully across the pattern. The dirt exploded into a cloud of dust and Kouga soon started to cough. Even despite the coughing, the dust kept on entering his throat and it soon led to violent hacking which made him lightheaded until the cloud had clear.<br>\r\n<br>\r\nKouga shook his head to keep himself atent and circulating. When he was a young boy, Kouga, like most of the other young wolf demons in his tribe, had to perform many tasks and trials in order to be initiated. Many of these tests required physical strength and endurance, but one test in particular required Kouga needing to know the ancient culture of the tribe, including the magic of the wolf demon.<br>\r\n<br>\r\nEven though wolf demon magic is a primative magic at best compared to the mystical arts of other demons, Kouga never was any good at it. Kouga was still able to just get by with the rudimental healing spells and tonics that helped bones to set. If he could convince his tribe long ago that he had enough experience in the mystic arts to belong, what was keeping him from performing a spell he had heard of long ago that actually grants the hearts deepest wish.<br>\r\n<br>\r\nUnfortunately, Kouga had to strain his mind to remember even what the spell's name was... Well, the name wasn't important anyway. Tapping his head with his index finger, Kouga probed his mind for any strands of thought that might help him remember some of the ingredients- as of now he had only a few.<br>\r\n<br>\r\nKouga sighed... there was no way he could remember the exact ingredients for the spell... it seemed hopeless- Would he have to ask a mage for hel-<br>\r\n<br>\r\nThe young wolf demon's icy blue eyes snapped wide open when he suddenly remembered the three elements that would most likely cause the spell to work, regardless of any minor ingredients he may have missed. These three components worked for any serious spell, bonded the spirit to the spell, and could allow the spell to read the spirit's deepest intentions and figure out for itself what it should do.<br>\r\n<br>\r\nIf he could do this correctly, then the spell could figure out to make him bigger by reading the true intentions of his spirit. It could work, but it was very, very risky...<br>\r\n<br>\r\nBut these three ingredients were so dire... so incredibly strong and final... that even Kouga found himself sweating nervously at what might happen if he improperly acitivated them. Sure, he could do simple spells just fine, but even if he were to move up to spells that were of moderate difficulty, he could seriously hurt himself if he made even one mistake. And when performing spells you don't know and are just recalling from memory, the number ascends to the myriads: countless opportunities to fail.<br>\r\n<br>\r\nIn order to perform this highest level of wolf magic where the spell determines from the soul what to do, the first thing Kouga needed was graveyard soil, which caused a large bead of sweat to creep down his back and chill his entire body. Graveyard soil was something he wanted to stay away from, and it often contained evil auras. Also, he would be making a serious transgression if he were to disturb a grave, but it was possible to take some soil if done correctly...<br>\r\n<br>\r\nThe next thing he needed was the fang of a canine demon... He knew it didn't have to be his own, but it was best if it were so. Kouga couldn't even imagine what dear Kagome would say if she saw his dazzling smile permanently disfigured! Kouga shuttered at that very thought... he supposed that he would have to use his own though, to be safe.<br>\r\n<br>\r\nThe final thing he needed was his own blood: the ultimate bond between spell and spirit. The blood contained the flavor of his life and his spirit... and he wasn't sure how much he needed... Kouga would have to return to that problem later, when he was about to perform the spell, as blood along with true intentions is what Kouga remembered activates the spell.<br>\r\n<br>\r\nBut, again... was it really worth risking? If he failed to do it properly, Kouga could end up permanently harmed in the least, perhaps even dead or suffering an even worse fate.<br>\r\n<br>\r\nHe had to... because he knew that in order to stay fighting he would definitely have to put on weight, and he couldn't remain alive after battle anyways withk such a light frame if his enemies kept on getting stronger and stronger at the rate they were already. What he needed was sturdy stability and substance to impose against his foes- overshadowing them all with his size and strength.<br>\r\n<br>\r\nHe would have to eat more, of course, but eating more just wasn't going to cut it if he was going to get to the size he wanted to be in a short amount of time... when he would encounter Naraku again.<br>\r\n<br>\r\nKouga smirked as he imagined himself much larger than he was now, standing on a short ledge, grinning brightly and cracking his knuckles, glaring down at a pathetic, cowering Inuyasha, enveloped in nothing but his pure shadow.<br>\r\n<br>\r\nSo... if this was the way he was aiming for, it was the way he was going to go. Kouga kicked dirt over the pattern. He would have to try again later... when he was ready...</span></div></div>",
            "created":1122321960,
            "id":696387,
            "title":"Wolf Demon Magic"
        },
        "123":{
            "author_id":"suzukamu",
            "author_name":"SuzuKamu",
            "choices":[
                "Meats the witch.",
                "A month passes and he managed to convince Kagome and Shippo to live with him."
            ],
            "content":"<div class=\"\"><div> <span>Kouga had been hunting last week when he found magazine that belonged to Kagome due to her scent being on it. It was a photo magazine with all the pictures being of huge guys, and by huge Kouga meant obese! They looked like they couldn't even move, there fat was litteraly so huge that the only reason they looked human was because of there faces.<br>\r\n<br>\r\nKouga always wanted to fat but not that huge and since Inuyasha went to hell with Kikyo after they beat Naraku, he thought that he might be able to cheer her up. Whenever he saw here he could tell that the only thing keeping her going was the little kit Shippo.<br>\r\n<br>\r\nWith this idea in his mind he decided to enlist a witch to put a spell on him to make him larger.<br>\r\n<br>\r\nHe decided that after he managed to get Kagome and Shippo to like him he'd leave the pack to live with them.</span></div></div>",
            "created":1354251240,
            "id":1478578,
            "title":"Gets help from Kagome"
        },
        "1231":{
            "author_id":"suzukamu",
            "author_name":"SuzuKamu",
            "choices":[
                "Morning"
            ],
            "content":"<div class=\"\"><div> <span>Hello!<br>\r\n<br>\r\nYes what is it.<br>\r\n<br>\r\nAh it's good thing I found you Etzel.<br>\r\n<br>\r\nWhat do you want Kouga if they saw a youkai here they'd surely arrest me. I'm lucky enough that the village hasn't arrested me for specializing in spells and curses.<br>\r\n<br>\r\nYa-ya Im' going but I need you to do me an important favor.<br>\r\n<br>\r\nI'm listening.<br>\r\n<br>\r\nDo you have a spell to change history.<br>\r\n<br>\r\nYes but it depen-<br>\r\n<br>\r\nI need you to make it so that since the beginning of time that the male youkai were fat and that the males were constantly fed. Also it is important culture.<br>\r\n<br>\r\nI don't thi-<br>\r\n<br>\r\nOver there that's where I saw the wolf demon.<br>\r\n<br>\r\nOkay I'll do the spell <br>\r\nIt shall by the morning, I need you to leave through the back no hurry.<br>\r\n<br>\r\nFine, thanks Etzel, see you later.<br>\r\n<br>\r\n-----------An hour Later--------------------At kaedes Village---------<br>\r\n<br>\r\nKagome are you okay.<br>\r\n<br>\r\nI'm fine shippo you don't have to worry about me. Go play with the other children.<br>\r\n<br>\r\nBu-<br>\r\n<br>\r\nGo Shippo I'm fine I promise.<br>\r\n<br>\r\nI know your lying but okay I'm going. <br>\r\n<br>\r\nSorry Shippo.<br>\r\n<br>\r\nKaaagoomeee!<br>\r\n<br>\r\nHuh who said that. Wait that spunded like Kouga.<br>\r\n<br>\r\nKagome! <br>\r\n<br>\r\nHi Kouga how have you been I haven't seen you in a long time.<br>\r\n<br>\r\nKagome would you like to come back to the cave with me I miss you.<br>\r\n<br>\r\nBut I can't leave Shippo all al-<br>\r\n<br>\r\nYou aren't he's going to come with us.<br>\r\n<br>\r\nBut I can't I have to-<br>\r\n<br>\r\nJust come Kagome we can go tomorrow in the morning if you want.<br>\r\n<br>\r\nKagome trying to not go couldn't think of a further excuse. Fine but you have to stay the night here.<br>\r\n<br>\r\nSounds wonderful I guess I'll go to bed know we need to head off early. <br>\r\n<br>\r\nOh okay Shippo comme on back we need to go to sleep.<br>\r\n<br>\r\nOkay goodnight Kagome.<br>\r\n<br>\r\nGuess I should go to sleep to eveything is packed.<br>\r\n</span></div></div>",
            "created":1354434180,
            "id":1479990,
            "title":"Meets the sorcerer."
        },
        "12311":{
            "author_id":"asdf246",
            "author_name":"McNicky",
            "choices":[
                "Stay here and let Kagome feed him more",
                "Go out and explore and see how things have changed"
            ],
            "content":"<div class=\"\"><div> <span>It was Morning and Kouga was aroused from sleep by the strong scent of food. \"Mmm... that smells really good\" Kouga said as he tried to get up but with much more difficulty than before then he looked down and saw why. Instead of his ripped abs he saw a flabby belly in it's place, \"What the...\" then Kouga remembered the spell he asked for yesterday, it must have worked he thought. Kouga then took time to examine his new heavier body, along with his new belly which stuck out a good foot other parts of him had also got fatter. He had a set a male breasts that rested comfortably on his belly, his arms had also gotten some padding on them, and his once muscled legs had become wide and gelatinous. Kouga also noticed that he now had a double chin, and that he had a bubble butt. Kouga also saw that his armor was now bigger as well to accommodate his size.<br>\r\n<br>\r\nThen Kouga caught a whiff of the food again and realized how hungry he was, then as if on queue Kagame entered the room with a huge tray that was filled all kinds of delicious food, \"Good Morning Kouga\" said Kagame \" it's time for breakfast hope your hungry\", then Kagame sat next to Kouga and before he could get a word out Kagome shoved a big piece of ham into his mouth and it was delicious, Kouga had never had anything this good in his life but before he could savor it anymore Kagame put another piece of food in to his mouth. Kouga realized because of the spell this is how things went now so Kouga just sat back and let Kagame feed him this delicious food<br>\r\n<br>\r\nAfter a while Kagome ran out of food to feed Kouga with, and Kouga was surprised he ate all of that food and he was still hungry. Then Kagome got up and said \"Be right back Kouga\" and after a minute she came back with another large tray of food and resumed feeding Kouga, and this cycle repeated a couple more times when finally Kouga said \" Kagome I'm full now you can stop\", then Kagome said \" oh ok then well then see you at lunch time\" and then Kagome left and Kouga was alone again. Kouga looked at himself again this new fat interested him because he had never been fat before and he poked at his belly which made it jiggle and it felt good, he liked being this big and it made him want to be bigger. Then Kouga decided to ...</span></div></div>",
            "created":1443993120,
            "id":2043628,
            "title":"Morning"
        },
        "124":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Increases the calories and fat content of the grease/fat...",
                "Doubles the amount of grease/fat in the bulding...",
                "Does something to Kouga..."
            ],
            "content":"<div class=\"\"><div> <span>Sighing, Kouga trekked forward, persistant of reaching the place he was headed to.  He had been traveling for a few days now, and he had even left Ginta and Hakkaku behind with instructions to stay put.  The place he was headed too was famous for frying all their food, then keeping all of it's leftover grease and fat.  It was that that Kouga was after.  Looking at the small jewel, Kouga hoped that it would do it's job.  Shaking his head of his doubts, he trekked on.  After a few more hours, he finally saw the village on the horizon.  Grinning, he ran faster toward his goal.  After sneakily entering the village, he easily located the grease and fat stores.  The one thing he didn't expect, was that it was four buildings bigger than the huts the villagers used for homes.  This made Kouga's plan a little more difficult.  But, he decided he had to try.<br>\r\n<br>\r\nTaking out the jewel, he concentrated his will power into it, and it began to glow.  The glow grew, and when it subsided, all four buildings were gone and Kouga was grinning.  It worked, the transportation jewel worked!  Now, to transport himself to where he transported the stores.  Concentrating his will power again, the jewel glowed, and Kouga disappeared as well.  He landed on the ground beside on of the stores and grinned.  It was time to begin.  Walking into one of the buildings he took out another jewel.  He concentrated his will power into this one as well, and it began to glow.<br>\r\n<br>\r\nWhat does this jewel do?</span></div></div>",
            "created":1243179600,
            "id":696386,
            "title":"A Greasy and Fatty Journey Begins..."
        },
        "1243":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "The jewel shard and grease have corrupted Kouga...",
                "Move to storehouse #2...",
                "Find another jewel shard to increase the effects..."
            ],
            "content":"<div class=\"\"><div> <span>As the shikon jewel shard glow intensified, one of the storehouses began to glow as well. All of the grease and fat in the building began to float out of the building and surround Kouga. Once all of it was around Kouga, there was another large flash and Kouga was left standing there albeit different. The wolf demon wasn't exactly muscular anymore. The jewel shard and forced all of the grease and fat into his body, giving him a bit of a flabby belly. His arms and legs weren't defined any more and his armor was really ill fitting now. Kouga frowned. He had thought it would have made a bigger impact on him. It was a lot of fat after all.He fondled his belly in his hands. Sure, this was a great start, but he wanted more. He wanted to be LARGE.</span></div></div>",
            "created":1489674000,
            "id":2290528,
            "title":"Does something to Kouga..."
        },
        "13":{
            "author_name":"wallcrawler86",
            "choices":[
                "A spell placed on his meal",
                "Force fed by a demon",
                "Asked to by Sango"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Miroku will gain, but first, choose how:</span></div></span></div>",
            "created":1185253200,
            "id":428688,
            "title":"How does he gain?"
        },
        "131":{
            "author_name":"wallcrawler86",
            "choices":[
                "His bedroom",
                "The hotspring"
            ],
            "content":"<div class=\"\"><div> <span>It was a quiet and lonesome night on the road, and the crew once again found themselves lodging in the home of a rich family that the ever-vigilant Miroku had suddenly \"discovered\" to be filled with unseen phantoms and demons.<br>\r\n<br>\r\nNot that the others approved of such dealings, but they couldn't complain about having a warm bed, and better yet, a warm meal.<br>\r\n<br>\r\nSpeaking of which, the young monk was eating his in...</span></div></div>",
            "created":1185277680,
            "id":428690,
            "title":"A meal fit for a monk"
        },
        "1312":{
            "author_name":"wallcrawler86",
            "choices":[
                "It was Inuyasha and Shippou, coming to join the bath.",
                "It was Sango and Kagome, unaware that Miroku was there."
            ],
            "content":"<div class=\"\"><div> <span>Miroku sat quietly, sipping a cup of sake as the warm waters caressed his bare chest.<br>\r\n<br>\r\n\"This is so boring...\" He sighed. \"What's the point of a hot bath all alone? It's just useless...\" He slid down under the water until it reached his neck. He put down the sake bowl but felt a squishy substance under his hand. He rose back up and looked to see a platter covered in rich, exquisite foods where his sake bottle had been.<br>\r\n<br>\r\n\"My, I can't complain about the service, though. This looks delicious.\"<br>\r\n<br>\r\nAnd so, he dug in, slowly dining on rice, fish, and more sake. About halfway through the meal, though, he felt warm. Not just from the spring itself, but like a growing warmth from his stomach. He dropped his chopsticks and put his hand to his stomach, growling as the warmth grew in size and intensity. It just kept growing until it felt like it was pushing on his skin. He could feel a small bulge in his stomach growing like a balloon, fitting like a ball into his hands. After a minute or two, though it felt like hours, his stomach was distended by a half meter, and resting in his lap and hands. Though the water covered most of it, a portion rose above the water into plain sight.<br>\r\n<br>\r\n\"What... what manner of sorcery is this?!\"<br>\r\n<br>\r\nJust then, a snapping sound alerted the monk to approaching people. Yet he sensed no malevolence in their approach, especially since they didn't even try to mask their presence. With his gut so heavy and jiggling, there was surely no escape. But who was it that was approaching?</span></div></div>",
            "created":1185997740,
            "id":431052,
            "title":"A bathtime surprise"
        },
        "133":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Eating and Eating",
                "A demon favor",
                "Shippo's magic"
            ],
            "content":"<div class=\"\"><div> <span>After the defeat of Naraku, the crew went there own ways. Kagome and Inuyasha travel back and forth from middle age Japan to modern Japan. Shippo and kohaku both live with Sango and Miroku. One evening after a big dinner and after Shippo and kohaku went to bed Sango sat next to Miroku who had a bloated belly and Sango rubbed it.<br>\r\n<br>\r\n\"That feels so good\" moaned Miroku.<br>\r\n<br>\r\n\"Well if you keep on eating like a ox your going to be the size of an ox\" said Sango.<br>\r\n<br>\r\n\"If that were to happen then there would be more of you to love\" said Sango<br>\r\n<br>\r\n\"What??? Do you want me to get fat??\" said Miroku.<br>\r\n<br>\r\n\"Yes\" answered Sango as she glared at him<br>\r\n<br>\r\n\"Well I would gladly get fat for you and I think I know something to help me\" said Miroku</span></div></div>",
            "created":1335657240,
            "id":1324595,
            "title":"Asked to by Sango"
        },
        "1332":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Miroku drinks the potion",
                "He drinks to potion at home",
                "He drinks the potion, but something went wrong"
            ],
            "content":"<div class=\"\"><div> <span>Miroku go ready for a week’s trip away from his and Sango’s home.  He told Sango that he need to get in touch with an old priestess friend who need some help with her spiritual powers.  After traveling a week, he came upon a beautiful lake. He heard rumors that there was powerful demon and powerful priestess that were seen hear. <br>\r\n<br>\r\nThe monk walked to the surface and called out <br>\r\n<br>\r\n“Old friend, I have come for my favor, please come and repay me. “said the monk. After he said that the late water started trash and storm clouds started to gather and block out the sun. Powerful winds started to shake the trees that surround the lake. In the center of the lake a purple mist started to form and it moved towards the monk.<br>\r\n<br>\r\n“Old friend, it has been many moons since you been here. I am ready to help you in your favor. “said a feminine voice.   <br>\r\n<br>\r\nMiroku felt n fear as this creature is the offspring of a powerful demon lord and powerful Miko. Their child inherited both demonic powers and spiritual powers. During his travels alone, Miroku help this child find balance between the two powers. The entity then told the monk that it can fulfill any favor no matter how simple or complex. <br>\r\n<br>\r\n“What is your favor, old friend?” asked the mist.<br>\r\n<br>\r\n“I am done fighting demons and have married my love. I wish for my physique to grow larger and softer. “said Miroku with passion in his voice. <br>\r\n<br>\r\n“Drink this potion that makes hungrier and make your inner gluttony intensify and surface. Finally, a late wedding gift. Take and wear this rosary. It will help your powerful spiritual powers and create a powerful protection and prosperity enchantment on you and your bloodline.  “said the mist as spoke. A potion appeared in front of the monk. Finally, a rosary necklace appeared and Miroku put It on.  The mist fade and stormy conditions went away. <br>\r\n</span></div></div>",
            "created":1514282040,
            "id":2432656,
            "title":"A demon favor"
        },
        "14":{
            "choices":[
                "A light, or extremilly heavy, lunch sounds good.",
                "Ask someone for help.",
                "Maybe you should shapeshift to \"try before you buy\".",
                "Perhaps a Shikon Jewel shard is a better choice.",
                "Naraku has known of your plight for some time..."
            ],
            "content":"<div class=\"\"><div> <span>Little, little, little. Being a child certainly had it's advantages when you needed to get out of trouble, however it carried far more problems. Inuyasha's attitude was not great to anyone, however you were the only one to recieve his smacks to the head, and you age was obviously the issue. A shapeshifter by nature, changing yourself to a more adult form for a while was of no problem, yet one of the aforemention hits would instantly return you to your true self. <br>\r\n<br>\r\nOf course there was no real way to change your age for good, except to wait; and as a demon that would be quite some time. Shards of the Shikon jewel sometimes caused demons to change shape, but you could not help but wonder if you would be tainted by it's corrupted energies as well. While the idea returned again and again, you continually filed it aside.<br>\r\n<br>\r\nIt was while sketching possible Shikon-enhanced forms with the crayons Kagome gave you that you noticed something. In one of them your hand had slipt, leaving you looking about twice as heavy as normal. Normally you would have just crumpled it up, however this one caused you to pause. You could not help but feel that the Shippou in the picture would get a bit more respect; if you couldn't be taller maybe having more overall mass would work...</span></div></div>",
            "created":1125723600,
            "id":271254,
            "title":"Sketching ideas"
        },
        "144":{
            "author_id":"glennthemoogle",
            "author_name":"Clint",
            "choices":[
                "Shippo's stomach began to rumble",
                "His body began to feel warm",
                "He blacked out"
            ],
            "content":"<div class=\"\"><div> <span>\"Perhaps one of those Shikon Jewel shards might help\" Shippo thought as he took another look at the picture before setting it back down. It was night time and everyone was asleep except himself; he couldn't fall asleep.<br>\r\n<br>\r\nGetting up Shippo carefully tip-toed over to the bag that Kagome held the shards in. Carefully and quietly rummaging through the bag, Shippo found the bottle that they were contained in and opened it. Giving the bottle a few taps, one of the shards came out and landed on his hand. Tucking it away in his clothing for a moment, he corked the bottle back up and put it back into her bag, making sure that it looked as if nothing had happened.<br>\r\n<br>\r\nMaking his way away from where they set camp, Shippo looked around to make sure the coast was clear before taking the shard out and examining it.<br>\r\n<br>\r\n\"I wonder if this will really work\" Shippo said to himself, and for good reason, based on those who have used the shards prior and what it does to them.<br>\r\n<br>\r\nShippo opened up his shirt briefly and embedded the shard into his stomach, wincing a little in pain as a result. Breathing a sigh, he waited a few moment to see if anything was happening.</span></div></div>",
            "created":1461533400,
            "id":2138740,
            "title":"Perhaps a Shikon Jewel shard is a better choice."
        },
        "1442":{
            "author_id":"glennthemoogle",
            "author_name":"Clint",
            "choices":[
                "Return to camp and get some sleep",
                "Attempt to remove the shard",
                "Use more of the shards to make yourself bigger"
            ],
            "content":"<div class=\"\"><div> <span>A strange warmth began to radiate from where he put the shard, it went outward and reached every part of Shippo from his head to his feet. What happened next took the young fox demon by surprise.<br>\r\n<br>\r\nHe began to experience a sudden fullness, like he had eaten. He began to go from feeling full to feeling stuffed, and it didn't let up.<br>\r\n<br>\r\nShippo looked down to see his normally flat stomach begin to gently push out in front of him, starting to strain his shirt as his gut became more noticable, but that wasn't the only thing that was expanding. His once normally thin arms and legs began to soften and thicken, filling out more of his clothing as he continued to grow, even his once flat butt had begun to round out as well. Even developing a small set of moobs on top of his potbelly. <br>\r\n<br>\r\nThe young fox demon didn't know what to do as he saw himself rapidly gaining weight, his body coming to a halt when his belt that he was wearing couldn't take the strain anymore and snapped, creating an audiable pop in the quiet forest they were in; causing his pants to fall to the ground. Shippo looked down at himself and out of curiousity poked his stomach, amazed and shocked that he wasn't an illusion but actual fat. Placing his hands on his stomach he gave his belly a jiggle, further reinforcing that he had gained weight and that a curious hand at different parts confirmed it.<br>\r\n<br>\r\nThinking about it for a moment, what would the others say or think if they saw him like this. A smile and a blush crept onto his face as he thought for a moment...</span></div></div>",
            "created":1461534360,
            "id":2138766,
            "title":"His body began to feel warm"
        },
        "15":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Sesshomaru",
                "Ginta & Hakkaku",
                "Houjo",
                "Kohaku",
                "Souta"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More Choices!</span></div></span></div>",
            "created":1122094800,
            "id":263205,
            "title":"More!!"
        },
        "152":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Ate all of the food there",
                "Stole the food for later"
            ],
            "content":"<div class=\"\"><div> <span>*ggggrrrrroooooowwwwlllllll* \"Im sooooooooo hungry Ginta!\" yelled Hakkaku. \"Me to Hakkaku.\" replyed Ginta.  Kouga had run off on them again, thus leaving them without food.  Kouga had left 3 days ago, and they hadn't eaten since then. \"I'm gonna die of starvation!\" \"Likewise!\"  As they walked on, they smelt a village, and where there's a village, there's FOOD! So they ran toward the village...when they got there, a festival was going on....a food festival! So they ran there and.....</span></div></div>",
            "created":1122094800,
            "id":263077,
            "title":"Poor Hungry Wolves...."
        },
        "1521":{
            "author_name":"Rei",
            "choices":[
                "The feast was a trap",
                "The food is just too good"
            ],
            "content":"<div class=\"\"><div> <span>Naturally the people fled. The village was relatively small and even during a festival they're were not enough of them to take on demons they knew to travel in packs. Once the town was deserted the two dug in much like the wolves the were. \"It's a little overcooked,\" Ginta observed, wrinkling his nose but Hakkaku had already started stuffing his face \"But ith goot\" He managed and Ginta followed suite.<br>\r\n<br>\r\nAfter devouring most of the meat dishes they finally came to their senses \"Do you think Kouga's going to be angry? should we get going?\"<br>\r\n<br>\r\nGinta looked up, swallowing what was in his mouth. \"Probably,\" He groanded, putting putting a hand to his now distended middle, all the food pushing it out firmly against his hand \"I don't think I can do much running right now.\"<br>\r\n<br>\r\nHakkaku considered this, looking down to his own belly which was poking out from under his tops by now. \"We should get going.\" He declared at last...but...<br>\r\n</span></div></div>",
            "created":1122526800,
            "id":264057,
            "title":"The feast"
        },
        "153":{
            "author_id":"naytel",
            "author_name":"Limited-Drive",
            "choices":[
                "Next Day"
            ],
            "content":"<div class=\"\"><div> <span>Walking around his home in his semi-tight white briefs, Houjo was bored.  He had nothing to do since his parents were out of town for the month. \"I am so bored...theres nothing to do...\"  He was walking around in his briefs cause laundry was still being done. \"I know, I check the pharmacy!\"  Houjo walked to the store part of his house, he didnt have to worry about anyone seeing him in his underwear because the store was closed and the blinds were shut.  He was looking through some new shippments when something caught his eye. \"What's this?\" Houjo picked up a bottle with a label that read 'Wish Powder-Grants any wish, just mix with any liquid!'  Houjo was bewildered! He thought of all the possibilities....he had always heard of Kagome's boyfriend from Yuki and Eri (Kagome's friends), suddenly...he felt really jealous.  \"I've got it!\" He would wish that Kagome and her boyfriend would be at the beach tomorrow, there he could mess with him using the powder.  Houjo found a bottle of water and mixed in some of the powder and took a sip. \"I wish Kagome and the boy that Yuki and Eri always talk about went to the beach tomorrow.\"<br>\r\n<br>\r\n*Fuedal Era*<br>\r\n<br>\r\n\"Hey Inuyasha....?\" \"What is it Kagome?\" \"Lets go to the beach tomorrow, it's a thing in my time!\" Inuyasha's eyes went glazed for a second, them returned to normal. \"Alright, we'll go!\"</span></div></div>",
            "created":1122094800,
            "id":263107,
            "title":"Houjo, Briefs and a Discovery!"
        },
        "1531":{
            "choices":[
                "Houjo uses the wishing powder.",
                "The Next Day"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I guess that's it.\" Houjo said.<br>\r\n<br>\r\nHoujo went to check the laundry to see if his clothes were dry. He reached in and picked out his shirt.<br>\r\n<br>\r\n\"Hmm, still a little damp.\" thought Houjo. He dropped it back into the dryer and turned put in on for another 20 minutes. <br>\r\nHe then went upstairs to his room, still holding the water bottle with the wish granting powder mixed in. He entered his room and put the bottle on his desk. Houjo had a nice room, he had a large bed, a desk with a computer, and a tv. Houjo turned on the tv, sat on his bed, and began to watch.<br>\r\n<br>\r\nSoon however he began to wonder.<br>\r\n<br>\r\n\"I wonder what Kagome's boyfriend will look like.\" He thought aloud,\" What it he's one of those really muscular bodybuilder type guys? Or what if he's fat?\"<br>\r\n<br>\r\nHoujo was kind of suprised that he had thougt of that, but then again, he had always wondered what it would be like to be fat. It had all started after he had seen a sumo match as a kid. Once he had even put on one of his baggiest shirts and a pair of sweat pants and then he took several pillows and blankets and filled the shirt and pants. When he was finished he looked obese! <br>\r\n<br>\r\n\"I wonder if the wish worked.\" thought Houjo suddenly. Maybe I should make another wish.\"<br>\r\n<br>\r\nWhat does Houjo do?<br>\r\n<br>\r\n</span></div></div>",
            "created":1128661200,
            "id":277273,
            "title":"A Wish Made"
        },
        "15311":{
            "choices":[
                "Houjo will make a wish on himself",
                "He'll make a wish on someone else first"
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe it would be a good idea to make another wish.\" thought Houjo.<br>\r\n<br>\r\nHoujo got up from his bed and stood infront of the full length mirror on his closet door. He stared at his thin figure wearing only his briefs. He was slightly muscular with hardly any fat on his whole body. He then remembered his dream of being fat. He could make that wish come true.<br>\r\n<br>\r\nBut then again what if there are side effects. Maybe he should try a wish on someone else first.</span></div></div>",
            "created":1128661200,
            "id":277276,
            "title":"Houjo \"Expands\" On His Ideas"
        },
        "153111":{
            "choices":[
                "Some new kind of gum",
                "Some type of suntan lotion."
            ],
            "content":"<div class=\"\"><div> <span>Houjo looked at the clock, then blankly understood he really couldn't do much more beyond that here. . .<br>\r\n<br>\r\nHe took one more glance at the water bottle settled still on his desktop. Its contents reflected the light streaming in through the blinds like any other bottled water would; but close examination would reveal an even brighter substance of particles dancing so rapidly in the drinking water, Houjo couldn't focus in on them in any given moment. <br>\r\n<br>\r\nHe couldn't believe what was before him; it was so unreal, and not to mention too good to be true.<br>\r\n<br>\r\nBut there it was: a bottle full of water laced with 100% pure 'Wishing Powder'. <br>\r\n<br>\r\nIn theory, he could achieve impossible ends with it. . . but the thought never crossed his mind as his brown eyes drifted to the boxer clad reflection staring back at him in the mirror.<br>\r\n<br>\r\nA stray finger made its way over to his slim waist and lightly skimmed across it. . .<br>\r\n<br>\r\nHis thoughts turned to those rumors he heard about Kagome actually meeting with a mysterious boyfriend. <br>\r\n<br>\r\nCould they really be true all along? And if so, what was he missing that said mystery man had? <br>\r\n<br>\r\nHoujo was the top student at school, and not a bad athlete to boot, but. . there always was his figure: maybe seemingly picture perfect, but perhaps a tad too scrawny, lithe, and rather boyish when sized up against some other students who were getting to be quite the muscle bound body builders. Could Kagome's boyfriend actually be one of them?<br>\r\n<br>\r\nThen, a bizarre tinge of curiosity overcame him and his hand shot out for the water bottle. <br>\r\n<br>\r\nHe quickly uncapped it and drank down some of its contents, as thoughts to change himself so he could appeal to Kagome filled his mind.<br>\r\n<br>\r\nAfter he had taken a gulp of the potent waters, Houjo let out a sigh. If the Wishing Powder was really going to work, he hopefully would see some results soon.<br>\r\n<br>\r\nAnd all too soon, unfortunately, he did.<br>\r\n<br>\r\nA deep, unsettling gurgling sounded within his stomach. Instants later, a wavering lance of nausea crept tepidly throughout his body.<br>\r\n<br>\r\n\"Ugh. . .\" Houjo moaned, placing one hand on his griping stomach, and another over his face which was gradually paling out and turning a more and more sickly shade of green, \"I think I'm going to be sic--\" Without any warning, said son of a pharmacist emited a sharp, ominous, and rather juicy belch. Quickly, Houjo bolted for the bathroom door.<br>\r\n<br>\r\nIt slammed behind him with a loud smack-<br>\r\n<br>\r\n* * *<br>\r\n<br>\r\nAnd Houjo bolted himself upright in bed, lightheaded, and dripping with cold sweat.<br>\r\n<br>\r\nWhat a weird dream. . . he thought. The dream was gradually fading away from his memories as he hopped out of bed.<br>\r\n<br>\r\nOnce he was on two feet, a deep rumbling sounded within his belly, beckoning him for the one thing he needed the most.<br>\r\n<br>\r\n\"Oh yeah,\" Houjo chuckled, rubbing the back of his head, \"I kinda forgot about breakfast, didn't I?\" <br>\r\n<br>\r\nHoujo ventured off to the section of his home that led to his parent's currently abandoned store. It felt kinda familiar to him, but he had walked this path millions of times before, no doubt.<br>\r\n<br>\r\nLuckily for him, the blinds were pulled over the large glass display windows of the pharmacy so Houjo could casually stroll around in his boxers only since nobody was home. Taking a left, Houjo looked to see if he could find anything to chow down on.<br>\r\n<br>\r\nTofu bars. . . diet milkshakes. . . soy spreads. . . organic blue corn chips. . . the entire section was stocked full of all health food!<br>\r\n<br>\r\n\"Well, my parents DO own a pharmacy after all,\" Houjo sighed to himself cheerfully, although sometimes he wished he could choose from something other than health food on a regular basis. He took a closer look and tried to scour the area for something that he'd enjoy. He ended up taking quite a few containers of vanilla yoghurt with him.<br>\r\n<br>\r\nHoujo languidly spooned some of the pale confection into his mouth and planted his rear on the register counter, kicking his legs lazily. His eyelids sometimes fell to half mast- it was another lazy Sunday. Good student that he was, Houjo had already completed his homework Friday night. Now he had absolutely nothing to do but sit in a steamy pharmacy on the register half naked and stuff his face with creamy yoghurt.<br>\r\n<br>\r\nWithin a few minutes, his spoon hit rock bottom and scraped what it could into his mouth. Then he cracked out a new container. <br>\r\n<br>\r\nAnd later another. <br>\r\n<br>\r\nAnd another.<br>\r\n<br>\r\nAnother.<br>\r\n<br>\r\nAs he struggled with the last spoonful, Houjo wondered what Kagome was doing right now. She was probably in bed, writhing with pain, struggling with some horrible new illness. <br>\r\n<br>\r\nHe wanted to go and send out his wishes, but he already knew what would happen. She'd either be absent, at some hospital or visiting some relative to get well, or she'd be so sick, she wouldn't be able to take visitors such as himself. Not that THAT would stop him from going, but he had already made his daily sojourn to the Higurashis.<br>\r\n<br>\r\nAs he slid off the register, his belly felt taut and quite full, even bulging a little from its usual flatness. . . he had slurped down quite a lot of yoghurt. But strangely, he felt he needed something to hit the spot- a small dessert?<br>\r\n<br>\r\nHe knew his parents didn't want him scarfing down the candy near the register, but what could one candy bar possibly do? His vision darted towards the tray underneath the counter, but to his surprise it was all empty.<br>\r\n<br>\r\n\"Ah, it probably needs to be restocked,\" Houjo told himself as he went to get the key to the storage room on the shelf behind the counter, then headed to unlock it.<br>\r\n<br>\r\nOnce in, he looked at the pile of new cardboard boxes that had come in. In fact, in the morning he had taken in a delivery before he stripped down for his nap. The candy had to be in one of these.<br>\r\n<br>\r\nLooking to the new box he had taken in, Houjo decided to open it up, just to see what was inside. It was probably some new medicine or product his parents would be selling, and not candy, but he was just curious to find out.<br>\r\n<br>\r\nAs he peeled back the tape and opened the top, Houjo was surprised to find within it was. . .<br>\r\n<br>\r\n</span></div></div>",
            "created":1160370000,
            "id":351529,
            "title":"What A Weird Dream. . ."
        },
        "154":{
            "choices":[
                "Sango and Kohaku are living in peace",
                "Kohaku is enslaved to Naraku"
            ],
            "content":"<div class=\"\"><div> <span>The first storyline in question takes place in the feudal era, anywhere from a few months to a year or two before Kagome first fell down the well. Sango and her younger brother Kohaku are still living with their father, protected by the security of friends, family, and the village.<br>\r\n<br>\r\nThe second storyline will take place at a time where Kohaku is enslaved to Naraku's power, forced to perform whatever deed he orders him to. However, a dim flame of memories of his loving sister and life in the village still lingers on and tries to survive in Kohaku's subconcious.</span></div></div>",
            "created":1132462800,
            "id":284938,
            "title":"Kohaku?"
        },
        "155":{
            "choices":[
                "Souta was being bullyed at school.",
                "Souta was starting to become a real couch potato."
            ],
            "content":"<div class=\"\"><div> <span>Kagome dropped her pencil, rocked back in her seat, shot her arms out and took a big stretch, her deep breath of relaxation soon turned to a sigh, which in turn soon became a yawn.<br>\r\n<br>\r\nIt really had been a long week.<br>\r\n<br>\r\nKagome couldn't really say it was the usual, as there's nothing typical or normal about going back in time to the feudal era, saving a village from the wrath of an evil demon usually possessing the body of a local lord, all with the help of her friends, Inuyasha, a sometimes arrogant half demon, Shippo, a childlike fox demon, Miroku, a monk who was typically described as being lecherous, Sango, a demon slayer, and, of course, Kirara, their two-tailed catlike companion, but the whole scenario was beginning to seem average, as that's what usually happened on her adventures in the feudal era... <br>\r\n<br>\r\nMeanwhile, in the real world, Kagome thought cynically, picking up her pencil again and returning to her Geometry homework, life still goes on without me.<br>\r\n<br>\r\nKagome didn't mind having to go back and stay in the feudal era for a few days, but she had constantly been returning there now to do battle with Naraku and other malevolent demonic forces for almost a year now. It was really beginning to take a toll on not only her social life, but also her grades and even her relationships with her own family! <br>\r\n<br>\r\nKagome was beginning to feel really guilty now. It was either one of those three topics she thought heavily about while catching up on all the homework she had missed in her absence; friends, school, and family. Sure, it was great going back in time, and having crazy adventures every couple of days, but it came with a price. Look at what was being missed...<br>\r\n<br>\r\nEveryone in her family always made sure that she made it to the feudal era with ease and without much trouble or even being noticed, for that matter: a very hard task indeed. Yet time and time again, each did their best. Her mom always had her bike ready and lots of food and supplies ready for her journey. And Grandpa always made sure that he had a new excuse ready to use whenever he was questioned on her whereabouts by the school, her friends, or even Houjo.<br>\r\n<br>\r\nAnd Souta... Kagome was beginning to feel really bad for her little brother. Poor Souta had to find out all of Kagome's homework and evade any questions of his own he might recieve by Kagome's curious friends... even still, Kagome was noticing that lately, Souta wasn't himself. From what little Kagome got to see her brother, she was able to gather that something might be wrong in her little brother's life.<br>\r\n<br>\r\nKagome was starting to believe that...</span></div></div>",
            "created":1125723600,
            "id":271251,
            "title":"Return Journey"
        },
        "1552":{
            "author_id":"palos",
            "author_name":"Mizu",
            "choices":[
                "Grrr....Wench! Havn't you been here long enough?!",
                "Ah, Kagome! I'm glad to see you aren't sick today."
            ],
            "content":"<div class=\"\"><div> <span>It seemed to Kagome, that while she had spent time in the Feudal Era, finding jewel shards and exterminating demons, her brother had grown into a couch potato, not the vibrant, active youth he once was.<br>\r\n<br>\r\nTapping her chin with her pencil, thinking, she realized now how obvious the fact had been.<br>\r\n<br>\r\nOn one of hew previous ventures back into her own time to resupply, her mom had mentioned something to her of Souta quitting the soccer team he'd been on. At the time, Kagome had shgugged the fact off, but know she wondered why would Souta quit something he loved.<br>\r\n<br>\r\n'Or at least..he used to love it...' Kagome thought absently, chewing the eraser on her pencil.<br>\r\n<br>\r\nAnother time, where Inuyasha had grasciously allowed her a few days hime to spend with her family and get caught up in school, it had been a saturday, and she had left early, around 9:00 a.m. for an all day shopping trip with her friends, who, of course, wouldn' take no for an answer.<br>\r\n<br>\r\nAs she had left, she had noticed Souta still in his pajamas ans eyes glued to the television screen,sprawled on the couch and munching on a donuts for breakfast. <br>\r\n<br>\r\nIt had been a shock to her that when she returned, at almost five in the afternoon, to see Souta STILL in his pajamas and this time pigging out at the table on some of their mom's cooking. Looking at the sofa she also noticed the remains of many junkfood containers: A half-eaten bag of chips, a partially eaten box of donuts, several soda cans....the list went on and on.<br>\r\n<br>\r\nOf course, at the time, she's been too tired to notice and decided to skip dinner entirely that evening in favor of a hot bath and a good night's sleep.<br>\r\n<br>\r\nAll of this had been a few months ago as well. She'd spent her last months n the Feudal Era with Inuyasha, Miroku, Sango, and Shippou. She'd immediately went to bed upon arrival in her time, and had to rush to school today to avoid being late.<br>\r\n<br>\r\nIn fact, she'd barely seen her family at all since she'd gotten here. Though...from the few glances she got of Souta, he did seem a bit...pudgey.<br>\r\n<br>\r\nRising from her desk, Kagome left her room and decided to confirm her suspicions, heading for Souta's room, but instead of finding her brother, Kagome found her mom tidying up her Souta's quarters.<br>\r\n<br>\r\n\"Mom, where's Souta?\" Kagome asked as she stepped into her brother's room.<br>\r\n<br>\r\nIt had changed since she'd last seen it as well. Hooked up to his television (which he had gotten half a year ago for his birthday, and which, do to an attack by Naraku, Kagome had missed, appeasing her brother for it only by bringing him a demon tooth from the Feudal Era.) was a new gaming system of some sorts and the soccer trophies Souta had once been so proud of had been shoved into a corner and appeared to be oozing with dust. Kagome also noticed the various junk food wrappers littered around the room that Kagome's mom had been picking up.<br>\r\n<br>\r\n\"Hmm? Oh, Kagome. I believe he's in the kitchen, eating a snack.\" KAgome's mom responded before returning to her task.<br>\r\n<br>\r\n'Of course. I should have known...' Kagome thought sarcastically. <br>\r\n<br>\r\nKagome left silently, quickly coming down the stairs and into the kitchen to find her brother sitting at the kitchen table and digging into a bowl of chocolate ice cream, some of the chocolate confection dried to his face.<br>\r\n<br>\r\nAs she came in, Souta looked up briefly, but soon went back to devouring his frozen treat.<br>\r\n<br>\r\n\"Hey, sis.\" he responded blandly.<br>\r\n<br>\r\n\"Hello Souta!\" Kagome said with false cheerfulness and coming up to lean on the table, the fakest of smiles on her face.<br>\r\n<br>\r\nAlready she could see he indeed put on at least a few pounds. As he bent down to eat his ice cream, fat around his neck doubled over to form a double chin.<br>\r\n<br>\r\nBeing Kagome's brother, however, he caught the tone in her voice instantaneously and squinted his eyes at her.<br>\r\n<br>\r\n\"You're acting weird.\" he accused.<br>\r\n<br>\r\n\"Me? Really? Why would I be acting weird? If anyone is acting weird, its you, Souta!\" Kagome accused right back as she pranced around to the side of the table, where she could get a full profile view of her brother. <br>\r\n<br>\r\nit was worse than she thought.<br>\r\n<br>\r\nNot only had her brother developed a double chin, but he now had quite the beginner's belly as well. it spilled onyto his lap and was quite visible with the medium sized shirt her brother had on.<br>\r\n<br>\r\nHe was definately a large now. He'd put on at least fifteen, if not twenty, pounds.<br>\r\n<br>\r\n\"What are you talking about?\" Souta questioned, still eating his ice cream.<br>\r\n<br>\r\n\"Well, you quit the soccer team. You constantly laze around the house. And look at yourself? You're almost the size of the junior sumo wrestlers!\" Kagome shouted, poiting to Souta's stomach.<br>\r\n<br>\r\nSouta blinked innocently at her a few moments.<br>\r\n<br>\r\n\"...what?\" he asked just as innocently.<br>\r\n<br>\r\nKagome sighed and massaged her temples.<br>\r\n<br>\r\nThis was almost like talking to Inuyasha...<br>\r\n<br>\r\n\"Souta.\" Kagome saif firmly. \"You, my brother ar egetting fat.\"<br>\r\n<br>\r\n\"Fat? Hah, you really have gone crazy sis. I'm not fat.\" Souta denied.<br>\r\n<br>\r\n\"Then what is all this?\" Kagome asked, lifting up her brother's shirt and grabbing quite a good amount in her hands and shaking it.<br>\r\n<br>\r\nAt this, Souta got up and glared at her, but his glare soon faded to a sad look. it looked like Souta HAD known he'd been putting on weight.<br>\r\n<br>\r\n\"I...I can't help it.\" he told her.<br>\r\n<br>\r\n\"Wh..what?\" Kagome replied, dumbfounded.<br>\r\n<br>\r\n\"I can't help it, gaining weight.\" her brother replied.<br>\r\n<br>\r\n\"Waht do you mean? You quit the soccer team. If you had stayed on it, you probably wouldn't have gained weight.\" Kagome countered.<br>\r\n<br>\r\nSouta laughed.<br>\r\n<br>\r\n\"Don't you knwo WHy I quit the soccer team?\" he asked.<br>\r\n<br>\r\nKagome started to reply, but hesitated. She DIDN'T know why her brother had quit the soccer team.<br>\r\n<br>\r\n\"I quit because...well, I couldn't keep up with the others. Kagome...even with soccer, I'd already started to put on weight. So I quit.\" Souta admitted.<br>\r\n<br>\r\n\"What?! You were already gaining weight even then?\" Kagome asked, flabbergasted.<br>\r\n<br>\r\n\"Yeah...but don't worry! I'm going to start exercising! Soon! I promise!\" Souta said, grabbed his ice cream, and left the kitchen quickly and mysteriously.<br>\r\n<br>\r\n\"Well...he seems a bit odd today.\" Kagome trailed off, not hearing the kitchen door behing her open.<br>\r\n<br>\r\nShe realized she wasn't alone when she heard a familair voice....<br>\r\n</span></div></div>",
            "created":1128574800,
            "id":277097,
            "title":"Lazy Brother"
        },
        "15521":{
            "choices":[
                "Takeda Nobunaga?",
                "Someone else. . ."
            ],
            "content":"<div class=\"\"><div> <span>A voice that Kagome hoped she wouldn't have to hear for another day, or at least a few more hours, growled behind her back.<br>\r\n<br>\r\n\"Wench, haven't you been here long enough already?!?\" it griped.<br>\r\n<br>\r\nRotating around, Kagome discovered Inuyasha hanging around, arms crossed, and attempting to glaring around menacingly in the threshold of the kitchen door.<br>\r\n<br>\r\n\"Inuyasha!\" Kagome exclaimed, surprised at the hanyou's sudden arrival.<br>\r\n<br>\r\nAn irritable expression had been etched across his face as usual, \"Don't see why you're so damn suprised to see me,\" Inuyasha muttered gruffly, \"It's not like I haven't come this way before or anything.\"<br>\r\n<br>\r\n\"Well, it's just that I didn't expect to see you here so. . . early,\" Kagome blinked as she found the right word, \"I thought it was agreed I had until Saturday morn-\"<br>\r\n<br>\r\n\"Yeah, well-\" Inuyasha blurted immediately, interrupting Kagome, \"Turns out I'm here now, and I think you've had nearly enough time to get food and pack up.\"<br>\r\n<br>\r\nTaken off guard, Kagome blinked, her shoulders jumping in shock as she suddenly remembered. . . \"Oh yeah, that's right. . . I haven't even thought about asking Mom for more food or supplies. Inuyasha, I haven't even packed yet.\"<br>\r\n<br>\r\n Inuyasha let out a loud scowl. Glaring at Kagome, he spat, \"Listen, you! I'm not gonna wait around one more day, for you to just lay around 'freshening up' instead of getting ready like you were supposed to. It doesn't even take that old woman, Kaede, this long to pack bags. Besides, there's no good reason why you can't just 'freshen up' in the feudal era just like everyone else!\" he barked.<br>\r\n<br>\r\nKagome sighed, \"Well, 'freshening up,' as you so call it, also involves me catching up on my schoolwork, which sorely needs to be done- and soon!\" she stated definitely, wagging an index finger at the half-demon boy, \"And I do find that I do my Geometry best at a quiet table and not in the middle of a demon invested warzone.\"<br>\r\n<br>\r\n\"Look, you can do your Geobotchery or whatever later,\" Inuyasha dismissed brashly, \"What matters now is that you hurry up and come back with me as soon as possible. . . which means now.\"<br>\r\n<br>\r\nKagome shook her head. 'I really didn't get all that much done as I would have liked,' she thought with a note of disappointment, 'but I guess it'll have to do for now. . . Well, I might be putting off math for just a few more weeks, until finals. I really shouldn't have that kind of thinking, especially with some other things,' Kagome thought,' like my family,' she admitted to herself bitterly, when Souta's case was brought to mind.<br>\r\n<br>\r\nPlacing a hand on her forehead, Kagome took a seat by the kitchen table. <br>\r\n<br>\r\nNoticing this, Inuyasha hobbled clumsily over to her, \"What's wrong now?\" he sighed.<br>\r\n<br>\r\n\"Inuyasha, do you think I'm doing the right thing?\" Kagome asked softly as she stared out the window into the moonlit courtyard, the Higurashi family tree standing strong, swaying gently with the cool night breeze.<br>\r\n<br>\r\n\"Wha?\" Inuyasha muttered, \"What do you mean by that, Kagome?\"<br>\r\n<br>\r\n\"Oh, you know,\" she pushed quietly, peering down to see her fingers idly draw circles on the kitchen table, \"Going off to the feudal era and embarking on long adventures to save villages, vanquish demons as well as the like of Naraku, and recover shards of the Shikon Jewel?\" she ventured.<br>\r\n<br>\r\n\"Yeah!\" Inuyasha exclaimed, \"There's no doubt.\"<br>\r\n<br>\r\nKagome smiled bittersweetly, \"Well, of course YOU'D say that,\" she chuckled, before getting up, starting towards the stairs, her back turned to Inuyasha, \"But some times I do really wonder.\"<br>\r\n<br>\r\n\"Do you think saving people's lives is the wrong thing to do?\" Inuyasha asked, skeptically.<br>\r\n<br>\r\n\"No, not at all,\" Kagome shook her head, and turned around walking towards Inuyasha, \"Ah, don't worry about it, Inuyasha. I'm probably just worked up over getting behind in school, you know me,\" she smiled, holding her hands up in defense.<br>\r\n<br>\r\n\"Don't see why you people in the future bother doing it in the first place if it makes you all so crazy and highstrung,\" he muttered lowly.<br>\r\n<br>\r\n\"Alright, Inuyasha, I'll tell you what,\" Kagome proposed, \"It's already pretty late, but I want you to know I won't spend any more time studying. First thing the next day, I'll get what we need, and you can expect to see me on the other side of the well by tomorrow morning. Is that a deal?\"<br>\r\n<br>\r\n\"Sounds fine,\" Inuyasha grumbled, \"As long as you hold your word to it. I'm getting bored just hanging around waiting for you,\" he sighed, getting up, \"And annoyed outta my skull with Shippo bouncing about all over the place. What a headache,\" he moaned, rubbing his head sorely. <br>\r\n<br>\r\n\"It's gonna to be a great thing to get a move on tomorrow, Kagome,\" Inuyasha said positively as he slid the back door open and wandered out toward the well, \"Finally!\" he groaned with much relief.<br>\r\n<br>\r\n\"See you tomorrow, Inuyasha!\" Kagome called out, bidding the hanyou farewell as the red of his robe faded off into the depths of the well with a leaping bound.<br>\r\n<br>\r\nMoving the sliding screen door close, Kagome started to wonder, 'If I had never fell down the well in the first place, what would my life and relationships be like- here, in my time. Am I really making the right choice when I spend nearly all my time with you, Miroku, Sango, and Shippo? People in my time start wondering where I disappeared off to, or, if they buy into Grandpa's stories, whether I'm alright. . . but they never know the true story about what's going on in my life. '<br>\r\n<br>\r\n'And now I wonder if I really know what's going on in their's anymore,' she thought sadly as she reached her room.<br>\r\n<br>\r\nSouta suddenly quitting soccer had been a loud wake up call for her, but she had always more or less acknowledged the fact that she was progressively being in the dark about various aspects of people's lives the more time she spent in the feudal era. It's just that she wasn't nearly as involved in everyone else's lives as she used to be, and thus, wasn't aware of what was happening to them.<br>\r\n<br>\r\nShe payed virtually no attention to the ever-growing complex soap opera that was her friends' love lives anymore, and had no idea of who was going out with who, and by zoning out for even just a month, she would have missed too much to pick herself back up to speed.<br>\r\n<br>\r\nShe had no idea that Hojo had led his team to win the finals in the citywide baseball series, with his team ranking number one, until she finally got home, and found a  surplus of excited messages and hollerings in her answering machine, but by then, said victory had occured almost two weeks ago. . .<br>\r\n<br>\r\nAnd the sad part was she really didn't seem to care that much. . . Could it be that she was at that much of a distance with the rest of her world?<br>\r\n<br>\r\nSnapping her book shut, not unenthusiastically, Kagome put away her schoolwork- maybe for another week or so, to her dismay. <br>\r\n<br>\r\n'I don't even know what chapter our class is on right now,' she thought bitingly to herself, 'I've only gone to, what, maybe two or three classes this month.'<br>\r\n<br>\r\nShe was still struggling to get past a chapter that had been cleared seemingly eons ago.<br>\r\n<br>\r\n'Inuyasha must have had a tough past couple of days. . .' she thought to herself, 'Maybe I'll be able to come back and finally catch up on my Geometry, but still-' she sighed, 'There still is something bothering me. Why would Souta suddenly quit one of his passions, soccer? He said he was gaining weight and couldn't keep up with the others, but I know a little pudge wouldn't stop the Souta I know- especially not completely. That can't be right. I don't buy into that- there must be something going on that I don't know about,' she nodded.<br>\r\n<br>\r\n'But aren't I supposed to know that something?' she thought glumly, 'Aren't I supposed to know that something so I can find out what's wrong and look out for him? Isn't that what big sisters are for? Well, some big sister I'm being.'<br>\r\n<br>\r\n\"I have to get to the bottom of this,\" she told herself, crawling into bed, \"As soon as I get back, I'll look into what's going on, and find out what's wrong. And that's one thing I definitely can't put off until later.\"<br>\r\n<br>\r\n* * *<br>\r\n<br>\r\n\"Hello, everyone,\" Kagome smiled as Inuyasha struggled to pull her out of the well.<br>\r\n<br>\r\n\"Damn, Kagome, what have you been eating? You weigh a ton!\" he yelled as he pushed off the base with his feet and propelled her out as he plopped to the soft, grassy ground.<br>\r\n<br>\r\n\"Hmph!\" Kagome sniffed as she glanced down at the fallen hanyou, \"Nothing at all, as I was rushing to meet you, as ordered,\" she stated, \"But the extra weight would probably be the backpack, if you haven't guessed already,\" she said, attempting to point to it as she turned around, revealing an oversized, overly stuffed, heavy backpack that came falling to the ground with a big plop, making possibly a crater, \"That ought to last us at least a week.\"<br>\r\n<br>\r\n\"All food I bet!\" Shippo cried, happy he wouldn't have to fight with Inuyasha every night to stake control of any morsel.<br>\r\n<br>\r\n\"Well, seeing I missed out on breakfast to pack and rush out here,\" Kagome started, \"I was hoping we could set up a little picnic right here and have a brunch. It is a great day, after all,\" Kagome grinned as she saw the weather was completely ideal; a warm sun, vast, bright blue skies with white fluffy clouds trailing across it, and soft grass to sit upon.<br>\r\n<br>\r\n\"A whaaa?\" Inuyasha urged.<br>\r\n<br>\r\n\"I would assume some sort of meal,\" Miroku said plainly as he helped Kagome unfurl and stretch out a rather large picnic blanket.<br>\r\n<br>\r\nThe two had finished smoothing out the blanket, and now all were sitting more or less on top of it. Kagome had just unzipped the backpack to take out an array of foodstuff, when she absentmindedly peered out onto the rolling hills beyond to the dirt road, and was shocked to see a familiar face strolling down the pathway on their journey.<br>\r\n<br>\r\nIt was. . .</span></div></div>",
            "created":1151038800,
            "id":326087,
            "title":"At a Distance?"
        },
        "155211":{
            "choices":[
                "\"It started at Princess Tsuyu's palace. Those were the best of days.\"",
                "\"It was a dark and stormy night.\""
            ],
            "content":"<div class=\"\"><div> <span>Nobunaga?<br>\r\n<br>\r\nYes, wandering down the hills was none other than one of the very first friends Kagome and Inuyasha had made throughout their long and arduous journeys: Amari Nobunaga, a goodhearted albeit thickheaded ronin with absolutely no sense of direction.<br>\r\n<br>\r\nKagome could identify him from afar; his azure colored kimono and jet-black hair flowing forward in bangs and also plaited from behind. She bet he had those same clueless brown eyes- and there was no doubt his little monkey companion was resting on his shoulder at the minute. But once Nobunaga stumbled even further, giving Kagome a clearer view of the unaware wanderer, she gasped in sheer shock. <br>\r\n<br>\r\nSince she had last laid eyes on him, easily a year or two ago (in feudal time, that is), Nobunaga had changed dramatically, at least in terms of weight! <br>\r\n<br>\r\nIt seemed that the closer Nobunaga ventured toward Kagome and company, the more remarkable of a size increase it turned out he had undergone. <br>\r\n<br>\r\nEven from more than thirty yards away, Kagome could begin to make out the fact that his blue kimono was left open, leaving a large, round tummy exposed for all the world to see. <br>\r\n<br>\r\n“My goodness …” Kagome choked watching the now pudgy boy descend from the hills.<br>\r\n<br>\r\n“What’cha looking at, Kagome?” Shippo chirped from Kagome’s shoulder carrying a pork dumpling in his paw. <br>\r\n<br>\r\n“Inuyasha,” Kagome blurted, pointing incredulously to the approaching figure, “Is that Nobunaga?<br>\r\n<br>\r\n“Nobu-whaa-whaa?” Inuyasha growled in between stuffing his face with dumpling and ramen.<br>\r\n<br>\r\n“Nobunaga,” Kagome reminded the hanyou, “Remember? He was the brave young samurai who was in love with the princess in that one village whose lord, also her husband, was possessed by a demon?”<br>\r\n<br>\r\n“Meh,” he yawned, rubbing his filling belly, “Doesn’t stand out to me. Sounds like almost every other village we stop by.”<br>\r\n<br>\r\nKagome gave Inuyasha an irritated glance. <br>\r\n<br>\r\nShe took a closer glance at the approaching boy and saw an uncharacteristic concerned look on his face, in contrast to his usual carefree nature, “He doesn’t look very well either. I think something might be wrong with him. Maybe we can find out and help,” she thought to herself.<br>\r\n<br>\r\nJust then, Nobunaga approached the group in earshot.<br>\r\n<br>\r\n“Is that you, Nobunaga?” Kagome waved, unable to completely wipe a small look of bewilderment from her face.<br>\r\n<br>\r\nHearing his name called, Nobunaga turned his head to see the group picnicking beside a group of tree. Confusion soon etched its way across his face, “Uhm…”<br>\r\n<br>\r\nBut in an instant, memories started flooding in his head. The identity of the girl dressed in an odd green and white outfit, currently calling his name, and waving to him was coming back to him.<br>\r\n<br>\r\n … Oh yes, her name was Kagome! A year or so ago she and a hanyou, Inuyasha, had helped him infiltrate Lord Fuyama’s castle and stop his frog demon-possessed self from devouring the soul of his beloved Princess Tsuyu . . .<br>\r\n<br>\r\n“Ah, Tsuyu…” Nobunaga sighed, his little heart fluttering, “What wouldn’t I do for you. Tsuyu, Princess Tsuyu…” he rustled, eyes closed in lamentation.<br>\r\n<br>\r\nWhen they finally opened, he found the girl in green and white glaring back at him, “Nobunaga?”<br>\r\n<br>\r\nKagome shook her head. At least he was the same on the inside; that was for sure.<br>\r\n<br>\r\nNobunaga looked a little flustered, “Kagome?”<br>\r\n<br>\r\n***<br>\r\nHaving led Nobunaga to their picnic, Kagome picked out an instant food bowl for him, which he instantly tried to pick apart to instantly get food. <br>\r\n<br>\r\n“This tastes like ice,” Nobunaga mumbled, his tongue frozen to an ice-cold piece of chicken. Kagome just shook her head.<br>\r\n<br>\r\n“Just let me cook this first, okay?” she asked, taking the bowl away from him as he tried to crunch the frozen chicken bit to pieces. Apparently, his initial encounter with potato chips, a future food Kagome brought that he seemed to like, didn’t prepare him the strange ways of other bizarre foods of the future.<br>\r\n<br>\r\nNow that she was setting his food on a flame before him, she could get a close survey of Nobunaga’s appearance. <br>\r\n<br>\r\nSomething was going on. He wasn’t his previous svelte, happy self. He was definitely anxious, definitely plump now and had definitely put on at least a hundred pounds by her estimates- not that Kagome’s Sacred Jewel comprehending powers extended into weight guessing territories only the carnival populace dared to venture. His face had grown rounder since long ago; Nobunaga was on the verge of fully growing into a double chin. His lavender robes as well as the upper half of his blue kimono had been left open, just like a Hawaiian shirt; this allowed his soft, pale, beach ball sized belly punctuated only by a deep navel in the center to drape lazily below his obi-line. And Kagome noticed while the lower half of his flowing kimono still was bound; it did seem a smidgen tight, not to mention the once loose line that held the young samurai’s sword was taut against his waistline. She could only conclude his tush and legs had bulked up since..<br>\r\n<br>\r\n“So this is the fabled Amari Nobunaga,” Miroku remarked coolly, gently sipping a dish-shaped cup of green tea with a single overturned hand<br>\r\n<br>\r\nNobunaga scratched his head and fed his snowy monkey associate a morsel of the instant curry Kagome had provided for him, “Huh?” he blinked.<br>\r\n<br>\r\n“Well, you see,” Kagome started, “During all our journeys to and from the next village or to some sacred site, castle, or the like we usually camp out. And it does get quite boring just eating and jeering at each other out here in the wilderness.”<br>\r\n<br>\r\nSango nodded, “So after dinner every night, we end up telling stories around the campfire, sometimes even our own variations on past adventures.”<br>\r\n<br>\r\n“It has the power of turning even the most ominous of forests into a warm, calm sanctuary,” Miroku affirmed.<br>\r\n<br>\r\nKagome smiled. It was true. What made it even more special was that it helped them grow closer together. Everyone knew each other so well and everyone had their own style of telling stories. Surprisingly, Sango was excellent in her delivery, techniques of suspense, and had a vast memory containing hundreds of folklore tales passed down to her from the demon village where she was raised. Predictably, Miroku was very Shakespearean in both mood and content. Shippo was like a standup comedian in the respect that he liked to go on little rants, subject to subject. And Inuyasha, well…<br>\r\n<br>\r\n“Inuyasha never tells stories,” Shippo chirped, “Because he has the creativity of a rock.”<br>\r\n<br>\r\n“Shut it, runt,” Inuyasha growled, bopping Shippo in the head.<br>\r\n<br>\r\n“Oww…” the little fox demon moaned, “… Sure, that one was real original…” he remarked snidely, glaring up at the hanyou.<br>\r\n<br>\r\nAgain, Kagome took a double take of Nobunaga. She still couldn’t get over how much he had mysteriously blimped up over the course of even a year. Kagome wanted to find out what had befallen Nobunaga, what had him so distraught, but she didn’t want to be rude.<br>\r\n<br>\r\nBut Nobunaga had gotten remarkably plump, meaning it was impossible for him to be seen without bringing about remarks, so Inuyasha got right to it and saved her the discourtesy. <br>\r\n<br>\r\n“Hey you!” Inuyasha yapped, “What happened to you? Why are you such a freakin’ fat-“<br>\r\n<br>\r\n“Inuyasha!” Kagome scolded.<br>\r\n<br>\r\n“Hey, I’m no brat!” Nobunaga exclaimed.<br>\r\n<br>\r\n“Huh? I didn’t say that” he scowled back, “I said why have you suddenly gotten fat?”<br>\r\n<br>\r\n“I’ve suddenly gotten that… that… that what?” he blinked, cocking his head.<br>\r\n<br>\r\n“Fat!” Inuyasha barked.<br>\r\n<br>\r\n“Rat?” Nobunaga repeated, before grabbing his monkey friend, “He’s not a rat!”<br>\r\n<br>\r\nInuyasha fumed and just poked him repeatedly in the belly.<br>\r\n<br>\r\n“No, you idiot, fat!”<br>\r\n<br>\r\nNobunaga just blinked cluelessly, as if nothing had happened.<br>\r\n<br>\r\nInuyasha gritted his fangs and grabbed Nobunaga by his shoulder and started poking his large belly repeatedly, “Grr… don’t you just ignore me!”<br>\r\n<br>\r\n“Eeeh. Why are you touching me?” Nobunaga squirmed, a little alarmed.<br>\r\n<br>\r\n“Inuyasha, sit, boy!” Kagome snapped, forcing Inuyasha to come crashing to the ground.<br>\r\n<br>\r\nWhimpers of pain aside, Kagome ignored the hanyou and asked Nobunaga kindly, “Nobunaga, could you please explain why you… well, why you’ve gotten kind of chubby since we’ve last seen you?”<br>\r\n<br>\r\nNobunaga blinked. Then he kept on staring at Kagome, “What?”<br>\r\n<br>\r\n“Well, Nobunaga, you’ve put on a few since we’ve seen you last. What happened?”<br>\r\n<br>\r\nAs if it slipped out one ear and out another, Nobunaga blinked and continued to look at Kagome, “What?”<br>\r\n<br>\r\nKagome sighed, getting a little frustrated herself, “Nobunaga-“<br>\r\n<br>\r\n“Just a minute, Kagome,” Miroku interrupted, rising from his cross-legged position. He grasped one of Nobunaga’s hands and looked clearly right into his eyes. For a second, Kagome was afraid Miroku had actually been drinking sake and was about to propose to him.<br>\r\n<br>\r\n“Nobunaga,” he repeated, loud and clear, “Kagome says you’ve gained weight since she last met you. Can you tell us any reason why you’ve put on so much weight?”<br>\r\n<br>\r\nAgain, like the words didn’t even enter his stream of awareness, Nobunaga just kept on staring, as if still waiting for Miroku to say something, “… What?”<br>\r\n<br>\r\nMiroku walked over to Kagome and whispered, “Clearly, Nobunaga isn’t understanding, or even hearing what we’re saying when it’s in regards to his weight. I think he might even be completely unaware of it.”<br>\r\n<br>\r\nOnce more, he turned to Nobunaga, clearly enunciating, “Can you at least tell us what’s the matter?”<br>\r\n<br>\r\n“Oh yes,” Nobunaga cheered, as if someone had offered to help him with a deep burden, “I desperately need to get to a holy site before the new moon starts to wax,” Nobunaga explained, “But despite my long journey through the land, I haven’t found it. Hopefully, I’m only a few miles away, but I haven’t seen its peaks in the distance. Perhaps you’ve heard of it- Mount Hakurei?” <br>\r\n<br>\r\n“Yes,” Miroku stated tentatively, “Well, I’m afraid to say you have more than a few miles to go… in fact, you have to travel several days as the crow flies before you’ll get to see the peaks as you’ve mentioned.”<br>\r\n<br>\r\n“What?” Nobunaga exclaimed before groaning morosely, “But I had been following the signs to go east.”<br>\r\n<br>\r\n“The road you were going down is due west,” Miroku added sadly.<br>\r\n<br>\r\n“But the sun rises in the west!” Nobunaga exclaimed on the verge of tears.<br>\r\n<br>\r\nThe red-orange rays of the dying sun stained the sky as it was setting (in the west, of course).<br>\r\n<br>\r\n“Nobunaga,” Sango stepped in, “Not to be rude, but why do you need to get to Mount Hakurei in such a hurry?”<br>\r\n<br>\r\nNobunaga took a breath and composed himself, “I’m afraid I’m under a terrible curse,” he sighed, “that is so terrible, I’m not even entirely sure of what it’s doing to me.”<br>\r\n<br>\r\nMiroku looked at Kagome. Behind them, Inuyasha hastily threw together a stack of dry wood that Shippo ignited with his foxfire. <br>\r\n<br>\r\nNobunaga sat his wide haunch down on a stump before the new campfire and sighed.<br>\r\n<br>\r\n“Nobunaga, could you tell us a story tonight?” Miroku asked, “Your story?”<br>\r\n<br>\r\nWith all eyes on him ready to listen, Nobunaga nodded, trying to think up where to start.</span></div></div>",
            "created":1171083600,
            "id":381287,
            "title":"Unknowing Nobunaga"
        },
        "15522":{
            "choices":[
                "\"Let's go to the movie, I can study later this week.\"",
                "\"I'd like it if we got Geometry out of the way first.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Ah, Kagome,\" sounded the familar voice from the doorway, \"I'm glad to see you aren't sick today!\"<br>\r\n<br>\r\nIt's Houjo again, Kagome thought bitterly to herself.<br>\r\n<br>\r\nKagome's chagrined expression melted and did a 180 as she spun around a similar amount of degress to face him. <br>\r\n<br>\r\n\"Houjo,\" Kagome smiled whitely and maybe a little too widely, with her hands tied behind her back, \"What a surprise! I really wasn't expecting you!\" she exclaimed truthfully.<br>\r\n<br>\r\nShe could now see Houjo standing mildly in the doorframe, carrying a bouquet of fresh daisies in one hand and clinging to a heart-shaped box of what was presumably chocolates in the next. A bulky looking messenger bag had been slung across his shoulders neatly. He was clad in his characteristic black suit and matching pants, however these seemed to be specially pressed and ironed for some occasion Kagome only could guess.<br>\r\n<br>\r\nNow as she looked to face her guest, she noticed he seemed a little flushed, \"I wasn't sure if these would upset your allergies,\" Houjo admitted, his eyes darting to the bundle, \"But I thought you'd like these flowers.\" He held them out for her to take.<br>\r\n<br>\r\n\"Why, thank you Houjo,\" Kagome smiled as she grabbed the bundle, \"Don't worry, they're not a problem at all. These will look great in my room-\" she commented, about to elaborate on which nightstand, but some slight change in Houjo's complexion caught her eye.<br>\r\n<br>\r\nWas he starting to blush?<br>\r\n<br>\r\n\"Ah, good,\" he let out a breath of relief, \"And I brought these too,\" Houjo continued, indicating his second gift, as he opened up the heart shaped box.<br>\r\n<br>\r\n\"Oh, chocolates,\" Kagome said, almost tongue in cheek, \"Houjo, you really shouldn't have.\"<br>\r\n<br>\r\n\"I know, I know,\" he acknowledged, \"Chocolates would only raise your blood sugar, so I picked these out- they're caramel flavored tofu squares.\"<br>\r\n<br>\r\nHolding back an abrupt chortle, Kagome squeezed out a, \"Houjo- how considerate!\" <br>\r\n<br>\r\nAs she gladly accepted the heart chock full of tofu, Kagome contemplated whether or not Grandpa actually disclosed her having some form of diabetes as another excuse for her absence. She really should sit down and have a nice talk with Grandpa about how hindering the ramifications of citing various diseases for-<br>\r\n<br>\r\n\"Uhm, Kagome,\" Houjo blurted, snapping her out of her musings.<br>\r\n<br>\r\nShe swiftly picked herself back up. \"Oh, sorry- yes, Houjo?\"<br>\r\n<br>\r\n\"Uhm, well,\" he muttered again, a growing sense of insecurity and shyness grew on his crimson face. Taking a deep swallow, he cleared his throat.<br>\r\n <br>\r\n\"You see, I was wondering if you'd-,\" he started audibly, paying a lot of attention to the foot he was shuffling from side to side, \"if you wanted to go see 'Anacondas on a Jetliner' at the movies tonight with me?\"<br>\r\n<br>\r\nA date. Kagome tried not to jerk at the sudden proposal. It wasn't entirely unexpected, but. . . Houjo? <br>\r\n<br>\r\nKagome stopped, remembering the open book and work she had left at her table. <br>\r\n<br>\r\n\"That's right, Geometry. . .\" she sighed before, apologizing and explaining herself, \"I'm sorry, Houjo- I'm just worried I'm not going to be able to learn and cover all the material I need to for the test on Monday.\"<br>\r\n<br>\r\nImmediately, Houjo's hand darted into his messenger bag and withdrew a cleanly stapled packet, hot off the printer, \"Here,\" he offered, \"I made a study guide of the chapter you're doing in Geometry; it has all the main points. If you want, we can do it together right now instead. I'll show you all the processes you need to know how to go through.\"<br>\r\n<br>\r\nKagome reached for the study guide, but stopped, \"But Houjo, aren't you taking Precalculus this year.\"<br>\r\n<br>\r\nSaid upper track student's expression flattened, \"Uhm... yeah,\" he mumbled as he tapped two fingers together sheepishly.<br>\r\n<br>\r\nKagome turned around sighing deeply to herself. <br>\r\n<br>\r\nIt wasn't like Houjo was a bad kind of guy to be with. Kagome knew he was quite the sweet and cheerful guy, albeit a little naive when it came to her friends or her grandpa. Heck, according to her friends' speculations he was ranked as the top student in the entire school and was a star athlete at that. Her friends never could understand why she didn't come practically leaping into his arms. It's just that she had already realized her feelings were for Inuyasha, even if he had been a bit of a jerk to her before she left.<br>\r\n<br>\r\n'Houjo went through all that effort to impress me. . I can't just shoot him down like that,' she thought. <br>\r\n<br>\r\nCome to think of it, Houjo was constantly trying to help her out with her troublesome diseases, terminal, pretended, or otherwise. Even when she was away, her family kept on telling her of how Houjo showed up almost every afternoon with her homework, sometimes a gift, and asking how she was, before rushing back to school to make it to his tennis or swimming practice or whatever he did. That elicited an ashamed sigh from Kagome. For as much attention he paid her, she didn't even have a clue what sport he played anymore.<br>\r\n<br>\r\nBesides, it wasn't like she was going on a dinner date or anything. She was just going to see a movie with another guy to have fun.<br>\r\n<br>\r\n\"Well,\" she replied tentatively, \"I don't see why not.\"<br>\r\n<br>\r\nA relieved smile quickly overtook Houjo's face, \"Excellent!\" he exclaimed, \"So shall we go to the movie now or study first?\"<br>\r\n<br>\r\nKagome's immediate answer was...<br>\r\n</span></div></div>",
            "created":1158469200,
            "id":347151,
            "title":"Going to a Movie with Houjo?"
        }
    },
    "info":{
        "author_id":"naytel",
        "author_name":"Limited-Drive",
        "brief_description":"Inuyasha and the boys grow some guts!",
        "created":1122128520,
        "description":"<td align=\"left\" class=\"norm\">Welcome to Inuyasha Guys Gain Weight!<br>\r\n<br>\r\nIn this interactive you may choose a male from the hit TV anime Inuyasha and fatten him up!<br>\r\nYou can do whatever you want to them, and there's no weight restrictions. Well, okay there is. Just try not to make them over 800 pounds, or around there.<br>\r\n<br>\r\nNO: Vore, Inflation, Female Help.<br>\r\nYES: Everything Else.<br>\r\n<br>\r\nHave Fun!</td>",
        "id":993711,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1514282040,
        "modified":1514282040,
        "pretty_title":"Inuyasha Guys Gain Weight!"
    }
}