{
    "chapters":{
        "1":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Clover(For her Pimple)",
                "Sam(Overweight)",
                "Alex(Big Butt)",
                "Jerry"
            ],
            "content":"<div class=\"\"><div> <span>Clover: AAAAAAAAAHHHHH!!!<br>\r\nSam and Alex ran to clovers room.<br>\r\nSam: What is it???<br>\r\nAlex: What is that on your nose???<br>\r\nClover: I have been cursed, Just look at it<br>\r\nSam: Relax Clover its just a little Pimple<br>\r\nClover: There goes my perfect life.<br>\r\nSam: Right, well I,m going under the Shower, Be right Back.<br>\r\nAfter sam finished.<br>\r\nSam: AAAAAAAAHHHHHHHH!!!!!<br>\r\nClover: What is it???<br>\r\nSam: Look at my belly, Its a all Fat.<br>\r\nSuddenly the doorbell ringed.<br>\r\nAlex opened the door.<br>\r\nMan: Hello mis, I have a package for someone known as Alex<br>\r\nAlex: Thats me.<br>\r\nMan: Here you go, Sign here please.<br>\r\nAlex: Here you go<br>\r\nMan: Thanks and have a nice Day.<br>\r\nSam: What did you ordered???<br>\r\nAlex: A Shrink-Fit Machine.<br>\r\nIt can shrink objects.<br>\r\nSam: Why would you need that???<br>\r\nAlex: My butt, look at it, its huge. I already sold 10 of the 25 pants I have.<br>\r\nSam: Beauty doesn,t matter, its the Inner that matters.<br>\r\nAlex: Says the one who thinks itselfe fat.<br>\r\nClover: I suggest we do not use this machine, looks pretty dangerous.<br>\r\nNight came and the girls where all asleep, when suddenly:<br>\r\nSuddenly a door opened and the person walked to the Shrink-Fit Machine, it was.....</span></div></div>",
            "created":1293426000,
            "id":1023449,
            "title":"The Machine"
        },
        "11":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Alex",
                "Sam"
            ],
            "content":"<div class=\"\"><div> <span>Clover activated the machine and aimed it at the Pimple.<br>\r\nClover: Away with you, stupid Pimple.<br>\r\nShe looked into the mirror and saw that the pimple was gone.<br>\r\nClover: YEAY!!!! He is gone, now lets return to bed.<br>\r\n<br>\r\nThe Next Day:<br>\r\nThe sun shined clear throw the windows of clovers room.<br>\r\nClover woke up, but something was wrong.<br>\r\nEverything around her was enormous.<br>\r\nClover: What is this???<br>\r\nThis must have been a dream.<br>\r\nShe pinched herself<br>\r\nClover: This is not a dream. I have been shrunken.<br>\r\nI,m very small, I,m at least 1cm tall, bug size.<br>\r\nMy first priority is to get down and get help. But this bed sems like the grand canyon so high.<br>\r\nBut I have no choice I have to.<br>\r\nShe landed on the ground with just no Injuries at all, cause she is smaller now, so less weight.<br>\r\nClover: Now lets get downstairs.<br>\r\n<br>\r\nAfter a few minutes she arrived downstairs in the livning room where Sam and Alex where having breakfast.<br>\r\nSam was enjoying her cereals while alex was eating a sandwich.<br>\r\nThey both watched some TV so getting their attention was not very easy.<br>\r\nBut which one should she try to get attention<br>\r\n</span></div></div>",
            "created":1293426000,
            "id":1023536,
            "title":"All this for the Pimple"
        },
        "111":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "The Ground",
                "Her Toes"
            ],
            "content":"<div class=\"\"><div> <span>Clover decides that Alex would be a great choice, though she isn't the smartest and sometimes acts like a kid.<br>\r\nStill she needed someone to get help.<br>\r\nSam was busy, and Alex was lying on her back and watched some TV.<br>\r\nSo Alex was her choice.<br>\r\nShe began climbing the bank.<br>\r\nWhen she arrived she saw her massive toes.<br>\r\nLarge brown toes the size of boulders was her only view.<br>\r\nShe continued on her journey and climbed up to her belly.<br>\r\nAlex was wearing a vest and Joggingpants.<br>\r\nShe was now on top of it and began her journey to her face.<br>\r\nAlex then raised her body.<br>\r\nAlex: I,m off fore some jogging, I,ll be back soon.<br>\r\nSam: See you later.<br>\r\nAnd cause she stood up Clover could hardly hold her grip and felt on......</span></div></div>",
            "created":1307336400,
            "id":1120841,
            "title":"Giantess Alex"
        },
        "1112":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "go back in the sock, it are pretty sexy toes",
                "Stay in her shoe",
                "Get out off course!"
            ],
            "content":"<div class=\"\"><div> <span>Clover felt all the way down till she landed on Alex big toe.<br>\r\nAlex was walking to the hallway and putted some socks on.<br>\r\nClover was between Alex Big toe and the fabric of Alex Sock.<br>\r\nAlex then putted some shoes on, and she opened the door and started jogging.<br>\r\nClover was having a bumpy ride, but the ride was just beginning.<br>\r\n<br>\r\nAlex was jogging all the way towards the gym.<br>\r\nShe was sweating already.<br>\r\nAlex was having it fine, but Clover was getting punished by a smell so powerfull that it could destroy the world.<br>\r\nClover was trying to get out, and she managed to get through a gap in the sock.<br>\r\nBehind her was a large foot, the massive foots of Alex.<br>\r\nClover was looking for a way out of the shoes.<br>\r\nBut she was thinking, If she does find an exit, she can get out but she might get crushed or lose Alex!<br>\r\nWhat should she do???</span></div></div>",
            "created":1307336400,
            "id":1120846,
            "title":"A stinky trip"
        },
        "11123":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Foot came",
                "Alex was continued running"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Clover found a gap in her shoe and was going to it.<br>\r\nClover jumped out and.....</span></div></span></div>",
            "created":1323925200,
            "id":1240213,
            "title":"Get out off course!"
        },
        "111231":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Clover jumped out.<br>\r\nClover: Free!!!<br>\r\n*BOOM*<br>\r\nAlex Nike shoes landed on Clovers body crushing her easily. <br>\r\nShe remained on her shoe for the rest of the day.<br>\r\nAlex did not notice a thing.</span></div></span></div>",
            "created":1323925200,
            "id":1240214,
            "title":"Nothing going on"
        },
        "111232":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "EDIT"
            ],
            "content":"<div class=\"\"><div> <span>Landed on the ground.<br>\r\nAlex foot landed meters away from her.<br>\r\nClover: Safe at last.<br>\r\n*BOOM* *BOOM* *BOOM*<br>\r\nClover looked back and saw Mandy, Caitlin and Dominique.<br>\r\nClover ran away and hid underneath a bench.<br>\r\nMandy and the other girls walked towards the bench and sat down there.<br>\r\nDominique: lets do it here.<br>\r\nMandy: Okay.<br>\r\nClover was looking towards Mandy.<br>\r\nMandy's hand reached for her cleavage.<br>\r\nOut of her cleavage came Arnold, but only a centimeter tall.</span></div></div>",
            "created":1323925200,
            "id":1240219,
            "title":"Massive Mandy"
        },
        "112":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Sams Cleavage",
                "Sams Cereal"
            ],
            "content":"<div class=\"\"><div> <span>Clover decides to choose Sam, the Smartest of the group.<br>\r\nFirst she needed to climb the bench and then to Sams face, That isn,t a short distance for bug Clover.<br>\r\nAfter a few minutes she reached the bench and started to climb on Sams body.<br>\r\nClover reached the belly and climbed up.<br>\r\nClover: Sam is right, she is getting fat.<br>\r\nAfter a while clover reached the shoulder, she could not easily find her balance.<br>\r\nClover: SAM!!!!<br>\r\nBut Sam didn,t hear the little Clover.<br>\r\nSuddenly Sam got shocked by a scary TV Commercial and Clover lost balance.<br>\r\nClover felt all the way down to.....</span></div></div>",
            "created":1293426000,
            "id":1023574,
            "title":"Huge Redhead"
        },
        "1121":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Jeremy(Boy which Sam as a crush on)",
                "Library(To study)"
            ],
            "content":"<div class=\"\"><div> <span>Clover was falling down and she saw where she was going.<br>\r\nThe big boobs of Sam.<br>\r\nLuckily clover landed softly but at her bug size the boob was a huge mountain of flesh.<br>\r\nSam always had big boobs, she got the biggest of the 3 girls.<br>\r\nClover: I wish Sam had smaller boobs, this is just not normal.<br>\r\nNow I have to go back up to Sams face, if I just could find a way to get balance on this Mountain.<br>\r\nClover didn,t find balance and felt down and landed between the big mountains.<br>\r\nThen suddenly Sam stood up and cleaned her boil, and then she left the house.<br>\r\nShe was on her way to.......</span></div></div>",
            "created":1293426000,
            "id":1023633,
            "title":"Sams Woman Weapons"
        },
        "11211":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Get her Attention",
                "Jump of the Hamburger"
            ],
            "content":"<div class=\"\"><div> <span>Sam opened the door and began to walk to the MC Donald nearby.<br>\r\nMeanwhile Clover climbed up and settled down on Sams necklace.<br>\r\nClover: Where are you going Sam??? SAM!!!<br>\r\nSam didn,t hear poor little Clover, but Clover had something better on her mind holding on the necklace.<br>\r\nSam walked but for Clover every step felt like a tremor for her so she better hold on.<br>\r\nSam arrived at the MC Donald and began to order a large Milkshake with a large Hamburger and some Fryed Chips with Mayonnaise.<br>\r\nShe sat down at the saloon and watches Jeremy a boy which Sam as a Crush on.<br>\r\nJeremy has Brown hair and is very smart.<br>\r\nSince sam sat at the Saloon, Clover climbed up through the Necklace of Sam.<br>\r\nThings where finally turning good but then Sam bent over And clover felt down on top of the Hamburger.<br>\r\nSam began to eat the Hamburger.<br>\r\nClover: If stay here it sure will be my End, but I can also get her attention more easy.<br>\r\nClover had to think fast, cause Sam started to eat and has taken the first bite.<br>\r\nWhat shall Clover do???</span></div></div>",
            "created":1293512400,
            "id":1023929,
            "title":"MC Donald Jeremy"
        },
        "112111":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><div> <span>Sam eated the Hamburger while Clover was waving her arms and screamed loud.<br>\r\nClover: SAM!!!! SAM!!!!!<br>\r\nBut sam didn,t hear her and she came closer to clover.<br>\r\nClover: SAM!!!!!!!!<br>\r\nSuddenly heared something.<br>\r\nClover: DOWN HERE ON THE HAMBURGER!!!!! SAM!!!!!<br>\r\nSam: I thought I heared something, oh well.<br>\r\nShe took the next bite and Clover with it.<br>\r\nClover was in Sams mouth and under the saliva and food.<br>\r\nand Advantually....<br>\r\nSam: *GULP*<br>\r\nClover felt down Sams throath and landed in Sams Stomach<br>\r\nMeanwhile it rained food while Clover was in her stomach.<br>\r\nAfter 30 minutes she stopped eating and her stomach began to digest the fast food.<br>\r\nClover was under the fast food.<br>\r\nClover: Logically she thinks she,s fat.<br>\r\nThe Clover felt a burning pain, Sams Stomach Acids began to digest Clover.<br>\r\nAnd gone she was, only some bones remains.</span></div></div>",
            "created":1293512400,
            "id":1023941,
            "title":"Sams Stomach"
        },
        "112112":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "She is doomed",
                "Jeremy is going to talk with her"
            ],
            "content":"<div class=\"\"><div> <span>Clover Jumped off the Hamburger, only to land in Sams Mayonaise.<br>\r\nClover: Why does this happen to me, Why me.<br>\r\nSam finished with her hamburger and began to take a sip of her milkshake.<br>\r\nClover: I need to get outta here quick before she is gonna eat me.<br>\r\nClover began to move herself out of the mayo, which was easier said than done.<br>\r\nShe had to move faster because Sam began with the chips.<br>\r\nClover: I need to move.<br>\r\nSam luckily missed Clover only Centimeters away from her face.<br>\r\nBut Clover got no luck anymore.<br>\r\nSoon she was lifted in the air and was going to Sams mouth.<br>\r\nWill she get away???</span></div></div>",
            "created":1293512400,
            "id":1023990,
            "title":"Surviving Mayo"
        },
        "1121121":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><div> <span>Too late to get away clover was putted in the mouth of Sam and she began to chew.<br>\r\nClover dodges the white teeth of Sam and she stood on her tung.<br>\r\nUnfortunately Sam began to drink her Milkshake again and the flued hitted Clover and Clover was on her way to Sams Stomach. Clover was Doomed.<br>\r\n<br>\r\nAfter a few hours Sam went to the toilet and began to defecate.<br>\r\nShe looked at her poop and saw some bones sticking out.<br>\r\nSam: Whats that???, I can,t remember eating something with bones, or it are parts of the Mayo.</span></div></div>",
            "created":1293512400,
            "id":1023992,
            "title":"Clover was delicious"
        },
        "1121122":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "On her right boob(Luckily)",
                "On the ground(Bad luck)"
            ],
            "content":"<div class=\"\"><div> <span>Just before the chip where clover was one got in Sams mouth Jeremy came to Sam.<br>\r\nJeremy: Hey Sam.<br>\r\nSam: Hi Jeremy<br>\r\nSam holded the chip between her fingers.<br>\r\nWhile Sam and Jeremy where having a conservation, Clover escaped the thick Mayo and she landed on Sams left Boob.<br>\r\nClover ran to Sams T-Shirt and cleaned herself, Then she jumped between her big boobs.<br>\r\nJeremy: You got some Mayo on your, breast<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/blush.png\" alt=\"*Blush*\" title=\"Blush\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\nSam: Oh thanks.<br>\r\nSam swipt the Mayo away and placed it in her mouth.<br>\r\nJeremy: I gotta get beack to work, I shall speak you soon.<br>\r\nSam: Wait....<br>\r\nJeremy: Yes???<br>\r\nSam: Do you wanna get out with me tonight, on a date.<br>\r\nJeremy: Sure sounds fun, I,ll come to your house.<br>\r\nSam: Great, see you tonight, bye.<br>\r\nMeanwhile Clover got her position back at Sams necklace.<br>\r\nShe holded on tight again.<br>\r\nBut Sam was so happy she walked like she was drunk, so her necklace swang from side to side.<br>\r\nClover had a hard job on holding tight.<br>\r\nAnd then she loses her grip and she felt.....<br>\r\n</span></div></div>",
            "created":1293512400,
            "id":1024000,
            "title":"Jeremy the hero"
        },
        "11211221":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "In Sams Hair",
                "Sams Nose"
            ],
            "content":"<div class=\"\"><div> <span>Clover felt on Sams right boob, a soft landing.<br>\r\nSam whas to happy and dreamy to feel it.<br>\r\n<br>\r\nAfter a while Sam arrived at home.<br>\r\nShe laid down on the bench and watched some TV.<br>\r\nThis was the chance Clover as been waiting for.<br>\r\nClover walked to her face which was close, but suddenly the doorvell ringed and Clovers chance ended here, once again on her necklace.<br>\r\nSam walked to the door and opened it.<br>\r\nIt was Alex, she came in.<br>\r\nAlex: Sam have you seen Clover today???<br>\r\nSam: Who???<br>\r\nAlex: Clover your best friend, girl with blond hair and style, I haven,t seen her for long.<br>\r\nSam: I,m sorry Alex, I,, just living in the clouds, I,m going out tonight with Jeremy.<br>\r\nAlex: Thats great, but if you g out in those close and that hair, you won,t make a chance.<br>\r\nSam: you,re right I,m going to take a shower and then chance my clothes.<br>\r\nAlex: Okay, see you soon.<br>\r\nSam was heading towards the bathroom.<br>\r\nClover needed to find a safer place, but where.</span></div></div>",
            "created":1293512400,
            "id":1024047,
            "title":"Lucky Landing"
        },
        "112112211":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><div> <span>Clover climbed up to Sams hair, and hided inside.<br>\r\nSam was undressing herself and she turned on the shower.<br>\r\nThen she stood under it and she bagan by washing her hair.<br>\r\nSam grapped the shampoo and putted it in er hair and began to wash it.<br>\r\nClover was shaken apart.<br>\r\nClover: Maybe not the best place to hide.<br>\r\nAnd it became more worse, as Sam started to clean her hair with water, and clover was washed out of Sams hair.<br>\r\nThe water dropping down from Sams body had taken Clover with it.<br>\r\nClover slided down Sams bac, then passed her butt and ended up landing between her toes.<br>\r\nSoon the water made Cloer fall into the pit.<br>\r\nClover was doomed as she was taken throw some pipes she drowned.<br>\r\n</span></div></div>",
            "created":1293512400,
            "id":1024096,
            "title":"Sams Forest"
        },
        "112112212":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "To the Cinema"
            ],
            "content":"<div class=\"\"><div> <span>Clover first climbed to her face and looked for a possibility.<br>\r\nClover: Ear, too far, Mouth, too dangerous, hair, not safe, Nose, perhaps very safe, no gross, I can,t go in Sams nose.<br>\r\nShe had to think fast cause Sam turned on the shower<br>\r\nClover: Time for the Nose.<br>\r\nClover climbed to the Nose as quick as possible, and just before Sam was under the shower, Clover made it and was settled in Sam gross Cave.<br>\r\nClover needed to get more deeper in, and Sam feeled it and pinched her nose.<br>\r\nClover was safe here, at the most gross place in the human body, the Nose.<br>\r\nAfter a long while Sam finished, and she grapped a towel and began to dry herself.<br>\r\nShe went to her room and she began to dress for tonight.<br>\r\nWhile she was Busy chosing her clothes, clover walked carefully out of her nose.<br>\r\nSam feeled it like a little tickle as she began to neese.<br>\r\nClover flyed out and landed on a very familiar place, the boobs.<br>\r\nBut this time the boobs where pushed together so Clover was stuck between them.<br>\r\nClover had to keep her arms open otherwise she will sink into the boobs.<br>\r\nSam walked down, her boobs jiggled on her way downstairs.<br>\r\nAlex: WOW you,re looking great, Jeremy will sure melt down by only seeing you.<br>\r\nSam Blushed.<br>\r\nThe doorbell ringed and Jeremy awaited Sam.<br>\r\nSam opened the door and she went out with Jeremy.<br>\r\nWhere do they go???</span></div></div>",
            "created":1293512400,
            "id":1024128,
            "title":"Sams Shower Show"
        },
        "1121122121":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "While Sam walked back, clover felt.",
                "Sam pulled her bra even more tighter"
            ],
            "content":"<div class=\"\"><div> <span>Sam and Jeremy decided to go to the New Cinema which just been opened in the Groove.<br>\r\nThey left the house and made their way to the cinema.<br>\r\nClover was still safe in between Sams Boobs.<br>\r\n<br>\r\nAfter a while they where at the cinema.<br>\r\nThey entered the room and the movie began.<br>\r\nClover had a god vieuw, but Sam could not sit still so Clovers vieuw was not that good.<br>\r\nSam enjoyed the movie aswell as Jeremy, But clover wasn,t.<br>\r\nClover tryed to get out of the cleavage with all her strenght but everytime she reared up she sank down between Sams boobs.<br>\r\nClover wringled all the time.<br>\r\nSuddenly Sam needed to go to the toilet, luckily the movie was not beginning, first all the commercials needed to pass.<br>\r\nSam was in the restroom and was looking in the mirror.<br>\r\nShe also looked to her cleavage.<br>\r\nShe brabbed her bra and lifted her boobs up.<br>\r\nClover was now between them.<br>\r\nSam pulled her bra more tighter.<br>\r\nClover was now Squished between Sams Big Bumps.<br>\r\nClover: I hate this.<br>\r\nBut it just became worse.</span></div></div>",
            "created":1293598800,
            "id":1024759,
            "title":"Sams Dangerous Date???"
        },
        "11211221211":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Gas"
            ],
            "content":"<div class=\"\"><div> <span>Sam walked back to the room where the movie began.<br>\r\nWhile Sam walked Clover slid throw the boobs, and she felt down.<br>\r\nLuckily for Clover she holded on Sams dress end.<br>\r\nClover had to hold on, luckily she did, but not for long.<br>\r\nSam entered the room and clover could not hold on any longer.<br>\r\nSam flipped the seat open, and clover landed on her eat.<br>\r\nClover: Lucky me, it could have been wo.....AAAAAHHH<br>\r\n*BOOM*<br>\r\nSam sat down and clover was under Sams giant butt.<br>\r\nClover could not move.<br>\r\nBut it became more worse for Clover.<br>\r\nJeremy: Are you comfee???<br>\r\nSam: Not yet.<br>\r\nBut this seat really is comfartable.<br>\r\nClover: Really???<br>\r\nSam was moving alot and so did Clover.<br>\r\nAdvantually Sam sat still, and clover ended up under her butt crack.<br>\r\nShe was imprisoned.<br>\r\nClover: At least I can move a little.<br>\r\nSuddenly she heared something comming from above.<br>\r\nIt could only mean one thing.</span></div></div>",
            "created":1293598800,
            "id":1024777,
            "title":"Under Sam"
        },
        "112112212111":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "1 hour"
            ],
            "content":"<div class=\"\"><div> <span>Clover: I don,t like that sound.<br>\r\n*FART*<br>\r\nSam blushed, but Jeremy didn,t even heared it.<br>\r\nHowever Clover did, and she smelled it aswell.<br>\r\nClover: My Nose Is burning!!!!!<br>\r\nBut this wasn,t the last fart.<br>\r\nShe farted all movie long.<br>\r\nClover: I can,t take this anymore.<br>\r\nClover crawled under out with help of Sams last fart.<br>\r\n*FART*<br>\r\nClover was Blasted from Sams back.<br>\r\nClover: Finnaly I,m out of that.<br>\r\nNow time to do what she used to do, get Sams help.<br>\r\nShe climbed on Sams legs and then climbed to her boobs.<br>\r\nAfter a while she reached the boobs.<br>\r\nClover knew she could not get Sams attention now so she rested on her left boob till the movie ended.<br>\r\nHow long will the movie go on???</span></div></div>",
            "created":1293598800,
            "id":1024797,
            "title":"Oh c,mon Sam!!"
        },
        "1121122121111":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Sam threw the popcorn in the air(Unsafe)",
                "Sam sended the popcorn to her mouth(Safe)"
            ],
            "content":"<div class=\"\"><div> <span>Clover was sitting on Sams boob, but she was getting hungry.<br>\r\nShe looked down and saw a pocket large with Popcorn.<br>\r\nIt was really not that far, but she could risk being eaten by Sam.<br>\r\nBut Clover really was hungry and decieded to make the jump.<br>\r\nClover landed on the Popcorn field and began to eat.<br>\r\nBut then Clover got an Idea.<br>\r\nIf Sam would ick up the popcorn she stood on she could jump to her face, and Get her attention more easier plus she would be safer in Sams hair than on her Boob.<br>\r\nSam eated some Popcorn and finnaly she picked up the Popcorn where clover was , but then it happened.</span></div></div>",
            "created":1293685200,
            "id":1025358,
            "title":"Sams Popcorn"
        },
        "11211221211111":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><div> <span>Sam picked up the Popcorn where clover was on, Clover was ready to make the jump.<br>\r\nBut then the ground Clover was standing on, disappeared. She felt throw and landed  another floor.<br>\r\nThe Sam threw the Popcorn in the air.<br>\r\nClover ran as quick as possible to the top, but when she reached it, it was too late.<br>\r\nThe only thing clover last saw where Sams huge lips, and then her world turned dark.<br>\r\nShe was chewed to death, and then her libs where swallowed.<br>\r\nSome limbs where still lying on her tung, her head and arm where still lying on Sams whale tung.<br>\r\nBut soon that was gone aswell, and Sam continued the night enjoying the movie.</span></div></div>",
            "created":1297400400,
            "id":1052005,
            "title":"Sam threw the popcorn in the air(Unsafe)"
        },
        "11211221211112":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Try and Risk",
                "Stay safe, do nothing"
            ],
            "content":"<div class=\"\"><div> <span>Sam sended the Popcorn Clover was on to her mouth.<br>\r\nClover took a deep breath and jumped towards the huge face of Sam.<br>\r\nShe reached it, but she hang on Sams big lips, lucky for Clover she managed to pull herself up.<br>\r\nClover was under the huge caverns or for Sam, her Nose. Clover quickly managed to climb towards the hair forest of Sam. Safe in her hair and close to her ear. Could this be the right moment, Clover was thinking.<br>\r\nSam would most likely not hear Clover, cause she is distracted at the movie.<br>\r\nBut she could try, what should she do???</span></div></div>",
            "created":1297400400,
            "id":1052008,
            "title":"Sam Its safe for now"
        },
        "112112212111122":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Practice her Dancing Moves",
                "Cleaning up her room"
            ],
            "content":"<div class=\"\"><div> <span>Clover thought it will be too risky, so she only climbed to her ear.<br>\r\nThere she watched the movie aswell.<br>\r\n<br>\r\nAdvantually the movie was finished and Sam and her date went home again.<br>\r\nSam got a farewell kiss, and iwth it Sam went home again.<br>\r\nClover Meanwhile is still safe in her ear, and tried getting her attention.<br>\r\nBut Sam was dreaming around and did not hear Clover.<br>\r\nThen suddenly Sam shoke with her head, which made Clover fall out of her ear.<br>\r\nShe felt on Sams shoulder. Luckily for Clover, she was almost home.<br>\r\nSam opened the door and went to her Room.<br>\r\nShe putted her clothes out, and dropped them on a chair.<br>\r\nClover was also dropped on the chair, and she decided to stay there for the night.<br>\r\n<br>\r\nMorning came and Sam woke up.<br>\r\nClover was still asleep, Unaware of what Sam was going to do.<br>\r\nSam picked up the Clothes where Clover was sleeping on.<br>\r\nClover felt on the ground, the one place she don,t want to be right now, cause Sam is going to....<br>\r\n</span></div></div>",
            "created":1298350800,
            "id":1058769,
            "title":"Going down her Hair"
        },
        "1121122121111222":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Broom+a Sweeper and Tin",
                "Mop"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sam went out of her room for a while.<br>\r\nA few moments later she comes back with a.....</span></div></span></div>",
            "created":1306472400,
            "id":1113778,
            "title":"How to Clean the Dust and Bugs away"
        },
        "11211221211112221":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Recognize someone",
                "Walks to the Trash Bin"
            ],
            "content":"<div class=\"\"><div> <span>Broom and a Sweeper and Tin.<br>\r\nShe begin to clean her room with the broom.<br>\r\nSweeping away dust and little crumbs and sometimes even small insects.<br>\r\nClover was running for her life as Sam came closer to her.<br>\r\nSam: A little bug, it needs to be killed off course.<br>\r\nClover was running towards the door but Giantess Sam soon caught up with her.<br>\r\nSam: There you go<br>\r\nAnd she swept Clover away leaving her dizzy on the ground.<br>\r\nSoon after that, Sam scooped the pile of dust and Clover up.<br>\r\nShe held the tin close to her face.<br>\r\nSuddenly Sam......</span></div></div>",
            "created":1307163600,
            "id":1119847,
            "title":"Here comes the broom!"
        },
        "112112212111122211":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Rub my feet",
                "Massage My Back"
            ],
            "content":"<div class=\"\"><div> <span>Sam saw someone on the tin waving its arm.<br>\r\nSam: Clover???<br>\r\nClover: Thank god, you heared me<br>\r\nSam: You used the Shrink Machine, didn't you<br>\r\nClover: I had a pimple<br>\r\nSam: Oh I knew you would use that thing<br>\r\nClover: please make me normall again.<br>\r\nSam: I will, but you need to do 1 thing<br>\r\nClover: I'll do anything<br>\r\nSam: very well, now........</span></div></div>",
            "created":1307336400,
            "id":1120818,
            "title":"A familiar person"
        },
        "1121122121111222111":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Shrunk even more",
                "Became Normal size"
            ],
            "content":"<div class=\"\"><div> <span>Sam: Can you rub my feet???<br>\r\nClover: What those things???<br>\r\nSam: yes, you said you will do anything<br>\r\nClover: Lets do it then.<br>\r\nSam Sat on a chair and her feets where on the floor.<br>\r\nClover walked to them and started to rub them.<br>\r\n<br>\r\nAfters some hours she was finally done.<br>\r\nClover: Here they are all done, now you need to make me normal again.<br>\r\nSam lowered her hand and Clover climbed on.<br>\r\nShe then brought her hand to her face.<br>\r\nSam: Off course, come with me.<br>\r\nThey walked down stairs and they prepared the Shrink Machine.<br>\r\nShe placed clover on the floor, and she fired the Shrink ray to her and she......</span></div></div>",
            "created":1307336400,
            "id":1120828,
            "title":"Clover is back"
        },
        "11211221211112221112":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><div> <span>ZAPPPPP<br>\r\nA bright light hitted the body of Clover.<br>\r\nAnd in no time she was normal size again.<br>\r\nClover: Yes I,m normal again!!! The Normal me, and the Pimple is gone, so it really works.<br>\r\nSam: You did this because of the pimple???<br>\r\nClover: yes<br>\r\nSam: If you just asked me to deal with your pimple, I do have some cremes for pimples.<br>\r\nClover: could you tell me that before I was ant size <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/rolleyes.png\" alt=\"*RollEyes*\" title=\"RollEyes\" border=\"0\" width=\"15\" height=\"15\"> </span></div></div>",
            "created":1307336400,
            "id":1120834,
            "title":"Normal again!!!"
        },
        "112112212111122212":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><div> <span>was walking towards the trash can, and she dropped all the dust in the Trash Can.<br>\r\nClover was covered in dust and was again very dizzy.<br>\r\nSoon after that, Sam grabbed the Garbage Sack and walked downstairs.<br>\r\nClover was feeling better and looked up in horror as she only sees a big hole of light and the Giant Face of Sam.<br>\r\nClover soon heard the front door opening and she knew where she was going.<br>\r\nShe then saw Sam putting down the Sack and putting a Knot in the Sack.<br>\r\nThere was no way Clover could get out now.<br>\r\nClover heard Sam was walking away.<br>\r\nStill Clover didn't give up and tried to cut an opening in the sack.<br>\r\nBut Clover wasn't strong enough.<br>\r\nClover: I give up, No way that I can get through this.<br>\r\nSoon her world was lifted up again and then everything went upside Down.<br>\r\nThen her world was normal again, but her doom was in sight.<br>\r\nAfter a long while, her world was going upside down aswell and then she was released from her world.<br>\r\nWhen she was finally out she was sitting on a Flat-Belt Conveyor.<br>\r\nShe then saw her new doom in front, the Incinerator.<br>\r\nA Burning Monster burned everything and because the Conveyor was taking everything towards it, so went Clover.<br>\r\nShe could run and was soon Burned to Ash.<br>\r\nNever did Clover knew she was going to be cremated.</span></div></div>",
            "created":1307163600,
            "id":1119852,
            "title":"Walks to the Trash Bin"
        },
        "11211221212":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sam pulled her bra even more tighter.<br>\r\nHer Cleavage was very noticed by now, but for Clover.<br>\r\nClover was now Spuished between her boobs, not fresh air. <br>\r\nShe died between her best friends boobs.</span></div></span></div>",
            "created":1293598800,
            "id":1024761,
            "title":"Death by Boobs"
        },
        "11211222":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Eat the Bug",
                "Place the Bug between your Boobs"
            ],
            "content":"<div class=\"\"><div> <span>Clover could not hold on to the swinging Necklace and she felt on the ground.<br>\r\nClover: SAM!!!! WAIT!!!!!<br>\r\nClover tried to follow but Sams footsteps where to big and she got left behind.<br>\r\nClover  still folowed Sam while she was running and she stopped nearby a bench.<br>\r\nSuddenly she heared some voices<br>\r\nDominique: I,m so bored.<br>\r\nMandy: Yeay, lets play Dare or Truth.<br>\r\nDominique: Mandy trick or Dare.<br>\r\nMandy: Dare<br>\r\nDominique: Dare to....<br>\r\nShe saw the bug(Clover)<br>\r\nDominique: AAAAHHHH BUG!!!!!<br>\r\nCaitlin: Dare.....<br>\r\n</span></div></div>",
            "created":1293512400,
            "id":1024028,
            "title":"Mandy"
        },
        "112112221":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><div> <span>Caitlin: Dare eat the Bug<br>\r\nClover noticed she got the Girls attention, but she knew one thing: Mandy would never eat a bug<br>\r\nSo she was acting like a bug, and she was picked up by Dominique.<br>\r\nMandy: NO way<br>\r\nDominique: I win.<br>\r\nMandy: All right, I,ll do it.<br>\r\nDominique dropped little clover on Mandy,s hand.<br>\r\nClover was in panic and tried to run away from mandy,s hand, but mandy picked her up.<br>\r\nMandy closed her eyes.<br>\r\nCaitlin: Eat it whole, no chewing.<br>\r\nMandy was sweating and bended her head back.<br>\r\nThen clover was even more in Panic.<br>\r\nClover: MANDY STOP!!!!!<br>\r\nBut Mandy didn,t heared her, and she letted go the bug.<br>\r\nClover was dropped ino her mouth and felt directly down Mandy,s throath.<br>\r\nMandy shivered.<br>\r\nClover was imprisoned in Mandy,s belly, soon to be digested and filling just 0,01% of mandy diet.<br>\r\nMandy: That was tasty, but I do not do it again.</span></div></div>",
            "created":1293512400,
            "id":1024035,
            "title":"Eat the Bug"
        },
        "112112222":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Pet",
                "Slave"
            ],
            "content":"<div class=\"\"><div> <span>Caitlin: Dare to put the bug between your boobs.<br>\r\nMandy: I can do that, but let me look at this bug.<br>\r\nShe took the bug close to her eyes. And it was turning bad for Clover.<br>\r\nMandy saw it was clover, but she didn,t tell her friends.<br>\r\nMandy: This is the Boob Bug.<br>\r\nDominique: A what???<br>\r\nMandy: This little bug, is a rare Boob Bug. It only lives between the boobs of girls.<br>\r\nDominique: At least the bug got style.<br>\r\nMandy: Yes, they only take the beautifilust girls around. This one is perhaps looking for sexy boobs for month.<br>\r\nI have to take it home.<br>\r\nDominique: Why<br>\r\nMandy: My uncle collects Boob Bugs for years, he breeds with them.<br>\r\nSee you later girls<br>\r\nBoth girls: Bye.<br>\r\nMandy walked to her home.<br>\r\nMandy went to her room and she picked up the little bug and dropped it in a old hamster cage.<br>\r\nMandy: Welcome to your new home my little....</span></div></div>",
            "created":1293512400,
            "id":1024044,
            "title":"\"The Boob Bug\""
        },
        "1121122222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Massage my feet",
                "Rub my breasts"
            ],
            "content":"<div class=\"\"><div> <span>\"Slave!? In your dreams!!\" Clover said angrily.<br>\r\n<br>\r\n\"If this was my dream, this would also be your nightmare.\" Mandy pointed out.<br>\r\n<br>\r\n\"No joke.\" Clover said softly.<br>\r\n<br>\r\n\"Now, you stay here while I go use my bathroom. Be right back.\" Mandy said before leaving.<br>\r\n<br>\r\n\"Oh man. If only I had my gadgets. I can get out of here in no time. This is gonna be so bad for me.\" Clover thought in her head.<br>\r\n<br>\r\nMandy comes back and picks clover out of the cage.<br>\r\n<br>\r\n\"Okay. First thing I want you to do is</span></div></div>",
            "created":1486691880,
            "id":2275721,
            "title":"Totally Slave"
        },
        "11212":{
            "author_id":"dbasscadillac",
            "author_name":"N/A",
            "choices":[
                "\"We should go; I hate being the size of a crumb!\"",
                "\"We should stay; you really need some time to review.\""
            ],
            "content":"<div class=\"\"><div> <span>Clover held on to Sam's cleavage for dear life as she exited the front door and got into her car. The few seconds it took for her to start it up gave Clover some breathing room to climb up closer to her neck. She stopped dead in her tracks as soon as could tell the vehicle was backing  of the driveway; it felt like an earthquake compared to when she was normal size. The library was only a few blocks away from Clover's house, but the first turn made her lose her grip and slam onto Sam's left boob. She was forced back onto her chest as the car accelerated and had to grab on to the soft boob to stay on, but she was tossed between the melons five more times before she felt the car finally come to a stop. Clover breathed a tiny sigh of relief as she prepared to enter the library trapped between the C cup breasts of one of her two best friends.<br>\r\nThe girl who possessed said breasts, however, shivered slightly as she felt a very light warm breeze somewhere in there, but she pressed on and went through the sliding doors. At this point, Clover climbed out of her shirt and made it high enough so that she could slip on to Sam's left shoulder and slap her neck; she could clearly see her nerves and where she would feel it the most. And she felt it alright; she squealed and ran into the bathroom as fast as she could, her friend jumping and grabbing on to her earlobe before she slammed the door. A nearby guy about the same age as Sam named Ethan noticed her running, and he couldn't help but giggle as he saw her large boobs bounce as she scurried.<br>\r\nOnce inside, Sam pulled off her shirt and looked in the mirror to see a tiny figure resting on her shoulder. She looked more closely to see that it was none other than her friend, Clover! After putting her in the palm of her hand, she spoke.<br>\r\n\"Oh my god! How'd you get here and why are you so tiny?\"<br>\r\n\"I don't know, I used that machine that Alex ordered to get rid of that zit on my nose, and now I'm like this! Looks like it's a shrinking ray too!\"<br>\r\n\"Well I'm glad I didn't use it to get rid of all this fat!\" Sam said as she pointed to the visible fat below her bra-covered breasts. \"Now I wonder how we're gonna get you back to normal!\" <br>\r\n\"Yeah, I don't wanna be the reason we don't get to go to the mall later today!\"<br>\r\n\"I agree! But you're in this mess and I need to study for my AP Calc exam, so what should we do now?\"</span></div></div>",
            "created":1468064940,
            "id":2177515,
            "title":"the library to study some calculus."
        },
        "112121":{
            "author_id":"dbasscadillac",
            "author_name":"N/A",
            "content":"<div class=\"\"><div> <span>\"Alright, I can study later, but for now we need to get back to your house so that you can see the world from a human perspective again!\" Sam put Clover in her purse pocket, slid her shirt back on, then left the bathroom and then the library it was contained in.<br>\r\nThey had a smooth ride home. However, they realized quickly that they were locked out because Sam forgot to grab one of Clover's spare house keys!<br>\r\n\"Dammit, I can't believe I didn't remember! What are we gonna do now?\"<br>\r\nLuckily for them, Alex returned from her morning run just then and headed toward the front door, noticing Sam in the process.<br>\r\n\"Hi Sam, where are you headed off to?\"<br>\r\n\"Ummmm....agh, there's no point in hiding it. Clover tried to use that shrink ray of yours to clear out that awful pimple of hers. It worked, but now she's ant-sized! I went to the library and found her on my shoulder there, and now we can't get in!\" she carefully pulled Clover out of her purse and set her in the palm of her hand.<br>\r\n\"I had no idea it would do this! I'm so sorry! Here, I'll get us in your house so we can make her normal again.\"<br>\r\nAlex pulled out one of Clover's house keys from her joggers and unlocked the door, and the three girls stepped in and went to Clover's room, where the machine was located. She tried to work it again. \"There has to be some sort of reverse option here-AHA! Here it is!\" She turned the knob so that it pointed to \"undo\"  as Sam set Clover down in front of it. \"Ready?\"<br>\r\n\"Yeah!\"<br>\r\n\"And...fire!\" Alex pushed the activation button, which, after a few seconds of charging, shot out a dim red laser at Clover. She started to grow again, but her clothes didn't want to grow with her. Her white bra snapped apart and fell off  first, then her matching panties tore, and her shirt ripped  while her shorts came apart at the seams. After about 30 seconds, she was fully grown, but also fully exposed. To make matters worse, the zit came back as well.<br>\r\nClover immediately looked down at her negative size clothes on the floor and quickly noticed her naked state; she covered up as Alex looked back at her.<br>\r\n\"Yay, it worked! Glad to have you back again! Especially cause it's just you!\"<br>\r\n\"What the...I'M NAKED!!!\" Sam stopped herself from laughing and sprinted to the bathroom; she came back with Clover's red and yellow bathrobe and tossed it to her. Fifteen seconds later she sat down on her bed, relieved to be covered again. <br>\r\n\"That was...so embarrassing! I can't believe my clothes didn't grow with me, yet they still shrunk when I did!\"<br>\r\n\"You might wanna be more concerned about that pimple on your head.\" Sam remarked.<br>\r\n\"WHAT?!\" Clover darted to the bathroom to see that the pimple hadn't disappeared. \"NO! The machine didn't work at all!\" She came back into her room, her B cups bouncing.<br>\r\n\"Relax, Clover. In fact, I just realized something: that isn't anything to worry about at all! We shouldn't care and let people judge us by what we look like, instead we need to feel happy about it!\"<br>\r\n\"What do you mean?\" Sam asked.<br>\r\n\"Well for example, when I was running this morning, I caught several people staring at my butt. But they're admiring it really; it's nothing to be embarrassed about!\"<br>\r\n\"You're right, I should be more careful about my weight, but until then I'll be happy around people as best I can!\"<br>\r\n\"I...guess I see what you mean.\" Clover said weakly, still recovering from her transient nudity in front of her friends. \"This zit wasn't my fault, and I don't think it'll stop me from being fine in public.\"<br>\r\n\"That's what I'm talking about! Now what do you say we do away with this rotten thing and go out to the mall?<br>\r\n\"Sounds good to me!\" Sam responded.<br>\r\n\"Ummm...OK.\" Clover got up and picked out a new outfit; she went into her closet to put it on.<br>\r\n\"Alright! Let's spend a few minutes getting ready and go!\"<br>\r\nSam made sure to remember to get a house key, Clover finished getting dressed and walked out to Sam's car after putting on shoes, and Alex changed, put the shrink ray back in its shipping box, and closed it before joining her friends. They drove off to enjoy their bodies on the outside and inside as well as they last day together prior to Clover's parents coming home.</span></div></div>",
            "created":1468114680,
            "id":2177798,
            "title":"\"We should go; I hate being the size of a c..."
        },
        "112122":{
            "author_id":"dbasscadillac",
            "author_name":"N/A",
            "choices":[
                "Sam's phone rings!",
                "she loses her balance and falls in!"
            ],
            "content":"<div class=\"\"><div> <span>\"Huh? You don't wanna stop being 2 inches?\"<br>\r\n\"You need the study time more than I need my former height.\"<br>\r\n\"Alright, if you say so. Try not to wander off while I'm finding those limits if you don't wanna get stomped to a pulp.\"<br>\r\nClover sighed; she didn't know what to do and might as well have been wasting her time. But she cared for her friend and would hate to see her get a rejection letter cause she couldn't get a 5; both girls knew how tough Georgia Tech was to get into. Sam put her back into her purse, slid her shirt back on, and went back out to find somewhere to sit and work.<br>\r\nIt took just about 15 seconds for Sam to plop down on a soft chair and send the minuscule Clover flying towards the other end of her purse. She slammed into it and let out an \"UGH!\" before falling to the bottom, the impact having knocked the wind out of her.<br>\r\nSam leaned over and whispered \"Clover, be quiet! The last thing we want is for someone ELSE to see you the size of a paper clip!\".<br>\r\nClover was too dazed to respond, and her brainy friend checked to see if anyone heard or saw her. Thankfully, she had no witnesses and set up to practice derivatives.<br>\r\nThree minutes passed, and Clover had regained her senses. She was quickly growing bored with there being nothing to do in Sam's purse, so she tried to climb out and have a \"little\" adventure, having no regard from the not-very-serious warning. She was just about to emerge when suddenly,</span></div></div>",
            "created":1473602160,
            "id":2208951,
            "title":"\"We should stay; you really need some time ..."
        },
        "1121221":{
            "author_id":"dbasscadillac",
            "author_name":"N/A",
            "choices":[
                "Sam goes behind the chair and takes off her shirt.",
                "Sam rotates the chair and takes off her shorts."
            ],
            "content":"<div class=\"\"><div> <span>The buzzing caught Clover off-guard and made the entire bag shake, causing her to let go of the edge and roll down to the bottom. She got up, regained her balance, and shouted \"Hey!\" to Sam a few times until it was loud enough to to get her to notice, as her phone was on vibrate cause they were in the library. She almost slammed her book down and whisper-shouted \"What?!\" to Clover, before noticing the inaudibly vibrating phone. She apologized to her before picking her phone up and answering it.<br>\r\n<br>\r\nClover, meanwhile, didn't hear the apology, as something about the vibration stimulated her. A sort of \"tingly\" feeling, but not one that made her feel uncomfortable. Rather the opposite actually, as it lingered and gave her a sense of pleasure, most concentrated in her nether regions. She moaned softly and felt an extreme need to free them, and almost hesitated to take off her jeans before realizing that she really wasn't at risk of being caught, what with her stature and all. They were unbuttoned, unzipped, and off a few seconds later, and she lowered her black lace panties slightly while moaning more loudly and was about to touch her pleasure area when all of a sudden, the vibration wore off. Clover came to her senses and took in the reality of what just happened, and found herself without her jeans on.<br>\r\n\"Oh crap, where are they?!\" she thought out loud before noticing them at a corner. She walked a few steps towards them when a thought popped up in her head. \"Hmmm...I've always wondered what it would be like to not have clothes on in public. Scary, for sure, but pretty exciting and freeing too. It's always fun to break some rules every once in a while, and I gotta admit being caught wouldn't be the worst thing in the world, especially cause I'm pretty now that that stupid zit is gone! And I'm 2 inches tall, how could I NOT get away with it?!\" The attractive brunette chuckled and reached for her soft red cotton shirt to take it off too, when Sam looked over...<br>\r\n<br>\r\nWhile Clover was going through the whole vibrating ordeal, Sam answered her phone. To her surprise, Alex was on the other end!<br>\r\nShe spoke softly. \"Hey Alex, finished early this morning?\"<br>\r\n\"Nah, not even close! In fact, I think I might've found out a way to have lots of fun running?\"<br>\r\n\"Huh? How? It's running. Running is exercise, and exercise is exhausting. How could you possibly make it FUN?!<br>\r\n\"Well here's the deal. I ran my typical 3 miles this morning, and usually I catch a few guys staring at my butt, the norm. But today I swear I couldn't go a minute without seeing one trying to get a peek! And you know what? I love it!\"<br>\r\n\"Alexandra...you're weird. It's big and showing it off is kinda over-emphasized and gross in this day and age. What's your point?\"<br>\r\n\"My point is that there is none in trying to hide my butt or be pissed that boys wanna have a look! They're boys, it's what they do! So I've decided to go another 2 miles...without my shorts!\"<br>\r\nSam was in the middle of trying to rebuke Alex for doing something that was just crazy when she heard a hang up beep. She angrily but softly sighed and went back to studying, only for her to get a notification. It was a selfie of Alex, laying down on some grass, smiling widely as her body was in view, covered by a white school Cross Country team shirt, a matching sports bra-barely visible thanks to the black Nike logo on the front, and...white athletic panties. The beautiful blonde really seemed to be enjoying herself.<br>\r\nA text followed. \"Relax Im away from the path and behind a tree nobody can see me\"<br>\r\n\"Yet lol\"<br>\r\nSam angrily texted back. \"Alex ur gonna get in a lot of trouble if you keep this up i mean this is ridiculous\"<br>\r\n\"Hey now i dont see a reason why anyone would call the cops on this young super hot chick!\"<br>\r\n\"Besides theres plenty of places i can hide if i actually see one or some angry old man that would call them haha\"<br>\r\n\"Youve gotta be kidding me alex i have problems of my own i cant deal with you if you get arrested\"<br>\r\n\"I think u need to have a little taste of this too lol! where r u rn?\"<br>\r\n\"In the library studying i told you im busy\"<br>\r\n\"Perfect! they have plenty of stuff to keep ya covered and nobodys gonna care anyway\"<br>\r\n\"Cmon youre better than this im fat and i dont want anybody seeing that let alone colleges knowing about it\"<br>\r\n\"I know ur stressed whatever ur studyin cant be easy, live a little!!!\"<br>\r\nSam took some time to think it over. Calculus and Macroeconomics were really no joke to her, or anybody for that matter. She never really thought about it, but studying them took more of a toll on her mind than anything else. If she could ease that stress by shedding some clothes, then maybe it could help her get things done a little better.<br>\r\n\"Ok youre right ill go for it\"<br>\r\n\"Awesome!!! Send me some proof, ive got a big butt to show off!!!\"<br>\r\nSam knew she needed to let Clover know about this, so she leaned over to her...<br>\r\n<br>\r\n...and held back a gasp! Clover had taken off her jeans and was gonna take off her shirt too-her black bra and the medium-large boobs behind it were exposed-if she hadn't stopped her!<br>\r\n<br>\r\n\"The frick are you doing? I don't want you to get caught, let alone caught naked!\"<br>\r\n\"Sam I'm sorry! I was just thinking about-\"<br>\r\nBut what was the big deal anyway? Sam was about to expose just as much, and again Clover was a thirtieth her height. If both were careful they wouldnt get caught.<br>\r\n\"No, I'm sorry. I was gonna do the same thing anyway. Guess if you wanna be naked in there you've got nothing to worry about.\"<br>\r\n\"True, i was gonna tell you that i was just thinking about that. I'm starting out in my bra and panties anyway.\"<br>\r\n\"Me too.\"<br>\r\nAs Clover got back to her own thoughts and finished taking off her shirt. wondered what she should take off first. It could be her shirt, in which case she'd have to hide below the chair, or her shorts, where she'd only have to turn it around to face the wall.</span></div></div>",
            "created":1549269780,
            "id":2612506,
            "title":"Sam's phone rings!"
        },
        "11212211":{
            "author_id":"dbasscadillac",
            "author_name":"N/A",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>(Ok my shirt's been bothering me more, I'll do away with it first. I just need to turn the chair around, duck behind it so no one notices me stripping, take it off, and I'm home free!)<br>\r\n<br>\r\nSam thought a little more about it, then looked around and realized just how lucky she and Clover were that during the entirety of their time at the library, nobody noticed a teenage girl with glasses and brown, curly hair seemingly talking down to her open purse, as if it were sentient and capable of talking back. It was, after all, a sunny Saturday morning, and most students their age would rather sleep in or enjoy it in other ways. Not only that, but Sam's armchair was big, cloth-made, and comfy. It both covered up to her upper back when she was seated and was situated in an alcove between the religion and politics shelves at the very back of the building-the ones that anyone was least likely to drop by. They were even perpindicular to several more aisles!<br>\r\n<br>\r\nNow underwear-clad Clover thought about it too, and called to Sam to tell her.<br>\r\n\"Yeah I know, this is perfect!\"<br>\r\n\"I feel amazing about it. In fact, start calling me Abbie again!\"<br>\r\nAbbie was Clover's real name. Back in freshman year, she started to have a random string of bad luck after passing an Algebra test that everyone else in her class failed. It started with her tripping on a doorstop the next day, where she luckily got away without any major injuries, then it got more serious. From getting locker door slammed several times in the same week, to being bumped into while holding her lunch of pasta and marinara, causing it to end up spilled all over her, to even ending up topless in front of her 10-person cross country group after a sharp tree branch ripped off her shirt and broke her bra clasp! Sometime in the middle of the ordeal, Sam and Alex ironically nicknamed her Clover, which she didn't mind, and it stuck even after her curse was broken with time.<br>\r\n\"Woah! Really?! It's been years!\"<br>\r\n\"Yeah! You know how great things went for us this morning! That couldn't possibly be a coincidence! Sure I shrunk to like 2 inches and I'm a little scared, but at least there's no more zit and I'm loving it! I think this luck turnaround is enough! Don't you?\"<br>\r\n\"I guess...Abbie.\"<br>\r\nSam was awestruck at the sound of that. She never expected her best friend's nickname to pass on, but the situation really did call for it. She needed to focus on her task to disrobe, though. After looking back up and surveying her surroundings again-nobody was close by still-she slowly rotated the chair to face the wall. Then she ducked behind it-and hesitated cause she pondered the reality of what she was going to do.<br>\r\nOut of the three spies, Sam was the shyest and least outgoing. She would let the other two do all the talking with arguments and hesitate to go for a lot of risky activities that they would, including riding the zipline at summer camp and dares in public and the car. This would be something that she could use to get out of her comfort zone;she was graduating this year and she really didn't want to feel left out from any new friend groups she made or joined in college.<br>\r\nSam knew the chair and table which she had her study material on would be enough to conceal her body from view with her sitting up against the chair and on the floor. With that in mind, her fingers found the first button of her short-sleeve white blouse and began to undo it. A shot of adrenaline and goosebumps went up her body when it popped. Sam's heart started racing as they moved down to the second and undid that one as well. She wondered why she was exposing herself like this, belly fat and everything. How much trouble could she get in if caught? Who did she have to impress? She couldn't stop herself and before she knew it, her huge cleavage and white bra were bared. Sam just about had a mini-heart attack when she remembered Alex's request to send proof of her undressing. A reputation boost among her friends was much-needed, and she'd be well on her way to getting it if she could send a figuratively-literal message. She calmed down slightly as the rest of the buttons were undone, until she came to the last one. She struggled to finish the job initially, and told herself to get it overwith, which she did. Her face turned a shade of bright red as her slightly pudgy midriff came into full view, the two sides of the shirt gaining momentum to seperate, then losing it moving over her bra.<br>\r\nShe couldn't believe it. She just unbuttoned her blouse in a place that wasn't at home, a changing room, or a hotel room. This was mortifying.<br>\r\nBut...it shouldn't have been. The whole point of doing this was to make studying LESS stressful, not more so. Thankfully that thought entered Sam's head, and she stopped feeling worked up. She scooted forward a little to give herself more room, and used it to put her palms on the floor and shake the blouse off. It hit the ground with a light crunch. She slipped her arms through the sleeves, and used her right hand to grab her phone, situated on the respective chair arm. After turning on the camera, switching it to selfie mode, and tucking the shirt away behind her to hide it from view, she turned red again as she remembered:<br>\r\n(My belly is in plain sight! If anyone sees me like this they'll KNOW I'm fat! And the only thing seperating the world and my boobs now is my bra!)<br>\r\nSam tried to crack a smile as she took a picture of herself without her shirt on, with a full view of her upper half and khaki shorts. It was at an angle, so her cleavage was more visibly outlined from the top. She ended up making an awkward smile as the button was pressed, and knew it wasn't worth trying to redo given her thoughts on the predicament.<br>\r\n<br>\r\nShe brought up Alex's text board and hit \"send\" after putting the pic in the message box. It took a few minutes for her to get back, and She grew more nervous with each one. <br>\r\n\"AWESOME!!! u look great!!<br>\r\n\"Uhh what no i dont\"<br>\r\n\"Yea u do!! I dont care what that scale says, youre so sexy!\"<br>\r\n\"Why the long face btw?\"<br>\r\n\"Listen alex im nearly topless in the library it may be easy for u cause ur body is perfect but mine is terribl and i h8 it!\"<br>\r\n\"Relax! thats why you took ur top off in the first place, right?<br>\r\n\"How can i relax when\"<br>\r\nThen Sam realized that freaking out about it wasn't doing her any good. She really did need to relax about it; it wouldn't be a good idea to pile on the stress. She was typing something that would tell Alex that she's right again, when she got another selfie.<br>\r\nThis time Alex was standing in the middle of some really tall grass, taller than her. She was smiling widely, having taken off her shirt as well! She was wearing only her sports bra and white panties with her shoes and socks. She looked amazingly fit with no visible fat on her bright golden skinned stomach.<br>\r\n\"Alex where did your shirt go?!\"<br>\r\n\"Its on the floor someone took my shorts and im gonna tie it around my waist\"<br>\r\n\"Gotta be a little decent at least hehe\"<br>\r\n\"I dont know what to do with you anymore i swear\"<br>\r\n\"Its a wonder how you could get away with no shorts but this is ridiculous\"<br>\r\n\"Hey now you took off that blouse thats not?\"<br>\r\n\"Anyway my butt is the greatest gift i swear, i got a TON of looks from boys, one used a great pick up line and tried to get my number! he was soooo cute i couldnt say no lol\"<br>\r\n\"ALEX YOURE GONNA CATCH THE WRONG ONE AND GET ARRESTED\"<br>\r\n\"Pipe down, just relax. Get some studying done. Do what you need to do dont let me stop you.\"<br>\r\nSam accepted her advice and took a few deep breaths. \"Youre right im sorry i overreacted\"<br>\r\n\"Accepted. I need to get back to my run got another half mile to go!\"<br>\r\nSam was no longer worried that her top was off and started to embrace it. She could really feel the difference as far as it being a burden on her skin went. Naturally, it was too risky to move the table into the alcove, so instead she picked up her shirt  and set it against the wall in front of her, got up and sat in the chair, and decided to take her book, worksheet, and pencil from the table and work on her lap. After pushing herself and the chair further in and out of sight, she took comfort in the fact that anyone who walked by wouldn't be able to see her state of dress clearly; Her bra looked enough like a regular top from behind. Sam finally relaxed and continued to study again.</span></div></div>",
            "created":1549979820,
            "id":2616518,
            "title":"Sam goes behind the chair and takes off her shirt."
        },
        "1122":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "content":"<div class=\"\"><div> <span>Clover felt down in Sams Cereal.<br>\r\nShe was down under, and covered in white milk.<br>\r\nClover: This is more worse than that Pimple, not worser than a broken nail, but this is just not good.<br>\r\nSoon Clover was lifted up in the air.<br>\r\nClover: This is not good.<br>\r\nShe had to think fast before the spoon reached Sams mouth.<br>\r\nClover swam to the edge of the spoon and jumped but she jumped to late and was in Sams mouth.<br>\r\nClover holded on Sams whale tung, but the cereal and saliva made it too slippery and she lost her grip.<br>\r\nAnd then she began her long way down to Sams Stomach where the burning acids will digest the blonde to nothing except for her bones.<br>\r\nSam didn,t even noticed and kept eating, she will never know what she did to her best friend.</span></div></div>",
            "created":1293426000,
            "id":1023623,
            "title":"End of Clover"
        },
        "13":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "Sam",
                "Clover",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alex comes into the room and stared at the machine. After some hesitation, she decides to use it on her but. However, when she uses it, she shrinks completly, making her 1 inch tall. Then the door opened and in comes...</span></div></span></div>",
            "created":1431838800,
            "id":1979295,
            "title":"Alex(Big Butt)"
        },
        "131":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "She escapes",
                "She escapes but something else happens",
                "Nope, she gets squashed underfoot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sam came into the room and said: ,, Anybody here? I through I heard something.'' When she walked further into the room, Alex watched in horror when Sam's massive size 12 bare foot started to descend.</span></div></span></div>",
            "created":1431838800,
            "id":1979300,
            "title":"Sam"
        },
        "1313":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "Alex gets crushed to paste",
                "Alex survives, but gets stuck underfoot",
                "Sam feels something under her foot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alex didn't move because she was totally in shock. Her foot came down on poor Alex. Alex tried to scream but it was already too late. Sam's foot was now covering the whole of Alex' body.</span></div></span></div>",
            "created":1431838800,
            "id":1979303,
            "title":"Nope, she gets squashed underfoot"
        },
        "13132":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "Get Sam's attention by licking or beating her foot",
                "She suddenly fell off Sam's foot"
            ],
            "content":"<div class=\"\"><div> <span>Alex had closed her eyes and was prepared 4 the worst. However, it didn't feel like she was getting crushed by the size 12 foot of Sam. Then she began to smell a foul odor and suddenly, she began to lift up. She then realised she was stuck to Sam's sweaty foot! Sam walked around, not knowing that she was crushing Alex with each step. Alex was unawarely being tortured by Sam's foot. Alex decided to...</span></div></div>",
            "created":1431838800,
            "id":1979334,
            "title":"Alex survives, but gets stuck underfoot"
        },
        "131322":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "Alex gets squashed by Clover's foot",
                "Clover walks over her and Alex follows her"
            ],
            "content":"<div class=\"\"><div> <span>However, Alex was getting unstucked from Sam's foot. When Sam lifted her foot up, Alex fell onto the carpet. Alex was happy that she got away from Sam's foot. ,, Finally, I'm free! When I get big again, I need to tell Sam to wash her feet more often.\" She said. Suddenly, she heard something behind her and recognised the familiar shadow of a foot descending untop of her. She saw that the foot was bigger than Sam's and knew already whose foot it was. It was the size 12,5 foot of Clover! She started to run away, but with each 10 steps she took, Clover had to just take 1 step. Eventually...</span></div></div>",
            "created":1431838800,
            "id":1979343,
            "title":"She suddenly fell off Sam's foot"
        },
        "1313221":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "Again to start licking or beating Clover's foot",
                "Waited until she moved"
            ],
            "content":"<div class=\"\"><div> <span>Alex tripped and fell unto the ground. When she looked up, she began to scream and again got crushed under the foot of her giant friend. Clover walked towards Sam. ,, Sam, did you see Alex today?\" She asked. ,,No, I haven't seen her since yesterday.\" She replied. When Clover was talking to Sam, Alex was getting more and more crushed by the foot of Clover. She decided to...</span></div></div>",
            "created":1431838800,
            "id":1979348,
            "title":"Alex gets squashed by Clover's foot"
        },
        "13132211":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "A bug stuck to her foot",
                "Nothing, she didn't see Alex"
            ],
            "content":"<div class=\"\"><div> <span>She couldn't wait no longer and started to beat the foot. When she didn't get a response, she started to get desperate and decided to lick Clover's sweaty foot. ,,Oh man, I need to wash my tongue after this.\" She thought and started to lick Clover's foot. Clover started to feel something under her foot and began to lift her foot up with Sam watching her. Sam asked:,,What are you doing?\" ,,I felt something under my foot.\" Alex was getting excited when she saw the faces of Clover and Sam. Clover saw that it was...</span></div></div>",
            "created":1431891360,
            "id":1979351,
            "title":"Again to start licking or beating Clover's ..."
        },
        "131322111":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "Sam or Clover crushes Alex, but she survives again stuck",
                "They start to stomp Alex into the ground"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ewww, a bug! She whipped Alex from her foot. Alex fell unto the ground again and watched the horrified faces of her friends. Clover and Sam came closer to the so-called bug and...</span></div></span></div>",
            "created":1431891660,
            "id":1979355,
            "title":"A bug stuck to her foot"
        },
        "1313221112":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "content":"<div class=\"\"><div> <span>Sam! Clover! It's me! Don't stomp on me! She started to cry when Clover and Sam started to lift their feet up in the air. Clover then said: ,, We will wait to stomp you, little bug, you may first smell our stinky, sweaty feet!\" ,,Good idea, Clover, it would have been too easy 4 the bug.\" Sam said. They started to lower their feet untop of Alex. Alex was grinded into the ground by the sweaty size 12 and 12,5 feet of Sam and Clover. Sam and Clover lifted their feet up and Sam then said: ,, Bye, bye, little bug!\" First, Sam stomped hard on Alex. Then, it was Clover's turn and so on. With each stomp, Alex was getting more and more crushed and even started to remain stuck to the soles of her former friends feet before falling off again. Sam then jumped up with both her feet in the air and came crashing down on Alex' body. Alex was still alive but it wasn't 4 long. Then Clover jumped up with both her feet in the air and ended Alex' life. Some of her remains was still stuck to her feet. ,,That was fun!\" Clover said. Sam agreed and Clover decided to let the remains on because she didn't want to wash her feet yet. She walked away and Sam followed her. She  unawarely stepped on the remains of their former friend that was still sticking the ground. When she lifted her foot up, the remains remained stuck to the massive size 12 sole of her feet. They never knew what happened to Alex...</span></div></div>",
            "created":1431892860,
            "id":1979370,
            "title":"They start to stomp Alex into the ground"
        },
        "132":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "Sam",
                "Mandy"
            ],
            "content":"<div class=\"\"><div> <span>Clover walked into the room and looked around. ,,Sam, Alex, are you here?\" Not getting any response, she started to walk away, but then she saw the machine. She stared at it 4 a long time and decided to use it on her pimple. Like Alex, she starts to shrink completly until she was the same size of Alex. Alex began to walk to the shrunken Clover. ,,Alex? What are you doing here?\" ,, The same as you, I also got shrunk by the machine.\" Suddenly, they hear giant footsteps heading towards them. She watched the giant form of...</span></div></div>",
            "created":1431933960,
            "id":1979687,
            "title":"Clover"
        },
        "1321":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "Alex or Clover gets squashed underfoot but she survives",
                "They are both getting squashed underfoot, but they survive",
                "They die as part of Sam's feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sam walked into the room towards her shrunken friends. Alex and Clover saw the massive size 12 feet of Sam getting closer and closer. Clover and Alex started to run, but they never could have hoped to escape their friends gigantic feet.</span></div></span></div>",
            "created":1431934200,
            "id":1979689,
            "title":"Sam"
        },
        "13212":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "choices":[
                "They try to get Sam's attention",
                "They accept their fate as part of Sam's soles"
            ],
            "content":"<div class=\"\"><div> <span>They runned as fast as they could, but it was hopeless. Clover tripped when she was running. Alex looked back when Clover began to scream. She witnessed Clover getting crushed by Sam's right foot. ,,Clover, NOOOO!!!\" Then Alex watched as the left foot of Sam began to lift up and was hovering above her. She started to run, but it was already too late. She was going to suffer the same fate as Clover. Sam's left foot started to descend and Alex had disappeared underfoot. However, Clover and Alex were still alive. They were both horrified of the fact that they were now stuck to the soles of Sam's gigantic feet. </span></div></div>",
            "created":1431934920,
            "id":1979698,
            "title":"They are both getting squashed underfoot, but t..."
        },
        "132122":{
            "author_id":"meerkat",
            "author_name":"Meerkat",
            "content":"<div class=\"\"><div> <span>Clover and Alex started to scream to the gigantic Sam, but she never heard them. Clover and Alex started to accept their fate as Sam's soles. Alex could finally accept her footfetish she already had. She started to get this footfetish when Clover and Mandy became giantesses thanks to Smalls. She started to get arroused of the fact that Sam and her were nothing compared to Clover and Mandy. As such, she began to smell, kiss and lick Sam's sole when Sam walked around the house. Alex started to cum on Sam's sole and kept worshipping her friends gigantic sole. Sam was walking around the house not knowing that she was helping Alex' huge footfetish reach a climax. Sam only felt a very good feeling under her left foot and became very happy because of this feeling. Clover, however, cried and screamed of being crushed by the smelly and sweaty feet of her former friend. She was getting hysterical when she accidently licked the foot of her friends sole and started to vomit as well. Clover and Alex remained under Sam's soles 4 the rest of their lives and Sam never knew about it as she was putting missing papers all around town. Under her feet, one was experiencing Heaven and at the same time another was going through a living hell.</span></div></div>",
            "created":1431936060,
            "id":1979704,
            "title":"They accept their fate as part of Sam's soles"
        },
        "13213":{
            "author_id":"dbasscadillac",
            "author_name":"N/A",
            "content":"<div class=\"\"><div> <span>As Sam walked toward the room to get her phone, she heard tiny screams that sounded like they were coming from under her feet. She almost reached the door when suddenly, the screams went silent. Sam looked at the machine that was right next to the door and gasped in horror as she realized what she did to her friends. She started to scream \"OH MY GOOOOO-\" then her vision went blurry as she phased back into reality, finishing her scream there.<br>\r\nSam was panting hard and fast as she took in her surroundings; she was sitting up in a sleeping bag, wearing her long t-shirt and panties. Her friends were laying down next to her, full size an unharmed. The clangor woke up Alex to her left.<br>\r\n\"Are you okay, Sam? What's wrong?\"<br>\r\n\"Oh, I had a nightmare where I think I squished  you and Clover under my own feet by total accident! You must've been the size of ants!\" Sam calmed down after telling her story.<br>\r\n\"Don't worry Sam, it's just a dream. Go back to bed; we have a big day at the mall tomorrow.\"<br>\r\n\"O...OK...\"Sam smiled and let out a big sigh of relief as she laid back down. Alex was right, it's only a dream. She hoped she would have good ones for the rest of the night, and indeed she did. <br>\r\nThe next morning, the three teenage girls woke up bright and early, two of them having completely forgotten the nightmare incident. They felt hopeful as they got prepared for their last day together before Clover's parents got home.</span></div></div>",
            "created":1468060200,
            "id":2177506,
            "title":"They Get Squished Under Sam's Feet"
        },
        "14":{
            "author_id":"zoomaster1994",
            "author_name":"Zoomaster1994!!",
            "choices":[
                "Alex",
                "Clover",
                "Sam"
            ],
            "content":"<div class=\"\"><div> <span>Jerry entered the living room of the girls, while they we're fast asleep.<br>\r\nJerry: Finally, the moment and possibility came, now I can shrink myself and watch the girls! hahaha! this is so good!<br>\r\nHe walked to the machine and he needed to type his ideal size.<br>\r\nJerry: Let me see, 1 cm? no they will still be able to see me, hmmm....1 millimeter? risky but its ideal.<br>\r\nHe typed 1 millimeter and the machine was ready, he only aimed at himself.<br>\r\nJerry: Yes now only to fire the beam, this is so cool since I'm retired.<br>\r\nHe pushed the button and the beam fired towards him and hit his body.<br>\r\nJerry was blinded when the beam hits him.<br>\r\n<br>\r\nWhen he opened his eyes he realized it was already dawn.<br>\r\nJerry: What happened? what...Oh it worked!<br>\r\nHe realized he was the size of a tiny insect, incredibly small.<br>\r\nJerry: This will be good, to the girls!<br>\r\n<br>\r\nAfter some time he arrived upstairs in the hallway and saw the rooms of Clover, Sam and Alex.<br>\r\nJerry: Which one should I spy on, at least, which one first?</span></div></div>",
            "created":1446906600,
            "id":2057817,
            "title":"Jerry the pervert"
        }
    },
    "info":{
        "author_id":"zoomaster1994",
        "author_name":"Zoomaster1994!!",
        "brief_description":"The girls want themselves look perfect, however there is something not right.",
        "created":1293469620,
        "description":"<td align=\"left\" class=\"norm\">The Spies always wanna look perfect on school and everywhere else. But they have some problems with their body. Sam, clover and Alex receive a little machine that will make them look better. But they shall soon find out that it doesn,t matter how you look like or how you are. As soon as they activate the machine their world goes upside down.<br>\r\n<br>\r\nExtra: Gary can also get shrunken in the girls house</td>",
        "id":1736037,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1549979820,
        "modified":1549979820,
        "pretty_title":"Totally spies, Shrink to fit"
    }
}