{
    "chapters":{
        "1":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "A Redhead in glasses, holding a bottle of green liquid",
                "A short Asian student,  holding a remote control",
                "A tall black haired beauty, holding a bottle of pills",
                "A powerful looking Brunette, holding a syringe",
                "Someone Else..."
            ],
            "content":"<div class=\"\"><div> <span>\"Sir, we're ready for you now!\" <br>\r\n<br>\r\nYou are startled awake after falling asleep in the waiting room by the cute blonde receptionist and stand up quickly to your feet.  You didn't want to leave a bad impression, since it was a miracle you were even considered for this in the first place.  It's been a few weeks since you had last had steady work, and money was running tight.  Luckily, you came across an ad in the paper that a company nearby was looking for volunteers.  \"No restrictions to apply, No experience needed, very high pay for one week's participation in groundbreaking study\" was all you needed to see to get your ass into the building.  <br>\r\n<br>\r\nThe receptionist was a very cute blonde girl in her 20's.  She said her name was Kaylee, or Kelly, or something like that.  You weren't really paying attention.  She walks you into a white room, very reminiscent of a walk-in clinic.  There are machines on the walls that monitor heartrate, blood pressure, all those sorts of things.  And you have a feeling some of the more interesting items such as the test tubes and needles of various size may come into play as well.  Good thing you don't have a fear for that sort of thing.  <br>\r\n<br>\r\nThe receptionist quickly goes over a standard checkup.  Heartrate, Weight, Height, that sort of thing.  And just as she wraps up she has you sign a release form.  The form itself is MUCH longer than you'd anticipated and you make it about halfway through before she chimes in \"Umm, the experiment is scheduled to begin soon.  So if you could hurry up and sign it now, that would be great.  I'll make you a copy so you can read it later if you'd like.\"  You figure that's for the best and quickly turn to the back and sign away.  <br>\r\n<br>\r\nShe smiles as she takes the paper and says \"Great.  Just wait right here, and the experiment will begin momentarily.\"  She starts to walk away but you ask her before she leaves exactly what it is you signed up for.  She bites her lip and says \"I'm not authorized to discuss the specifics.  But i CAN tell you it's going to give you a much BIGGER perspective.\"  You look at her in a confused manner.  She just giggles and says \"You'll see.\"  And without another word, she leaves the room, talking to someone outside.  You can hear them conversing for a few minutes, but can't quite make out distinct voices or words.  And after a few short minutes, the door reopens, and you see who is going to give you your test:<br>\r\n<br>\r\n</span></div></div>",
            "created":1516510800,
            "id":2443631,
            "title":"Sign Here, Please."
        },
        "11":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"Apply some of it to the skin.\" (You lose a few inches)",
                "\"Take a small sip.\" (You shrink to half your size)",
                "\"Drink one half of the bottle.\"  (You drop down to six inches tall)",
                "\"Drink a majority of the contents\" (You shrink to about an inch tall)",
                "\"Drink all of it.\" (Nothing happens)"
            ],
            "content":"<div class=\"\"><div> <span>A pretty redhead comes in wearing a bright white labcoat with a green shirt and jeans underneath.  She smiles at you and   \"Hello, i'm Professor Jennifer Freeman.  You can call me Jenny if you'd like.\"  You shake her hand and have a seat as she takes down some notes.  Without looking up at you she says \"Now did they tell you what the experiment would be about today?\"  You said you overheard the secretary say something about mass displacement but you weren't sure exactly what she meant.  The professor looks up at you and says \"Okay, here's what's going to happen.  We've been working on a compound for the past few years that we're convinced could compact a living organism's genetic structure.  Or in layman's terms... make it smaller.\"  You are a bit thrown back by this and you ask what she means by smaller.  She raises an eyebrow and says very plainly \"Exactly what it sounds like.  Tinier.  Littler.  Less big.  But on the plus side, since the body is being compacted, you'll be a little bit denser.  So you'll be a lot tougher.\"  You take all this in and ask how she's going to do it exactly and she says \"With this\"  and pulls out of her coat pocket a small vial of glowing green liquid.  <br>\r\n<br>\r\nYou ask what exactly is going to happen next and she says \"Well, first i'm going to take down some recordings.  We need to examine exactly how small you're going to get when you interact with the compound.\"  She reaches into her bag and pulls out a small electronic tape recorder and presses the big glowing \"R\" button.  She talks into it just like one would a phone.  \"Experiment number one is ready to commence.  Patient is in good physical health, mental capacity is at normal levels, and by all means he's not bad looking either.\"  You laugh a bit at her overall playful tone for the experiment, but you're slammed back to reality when she places a rubber glove on and begins to uncork the beaker.  She hands the vial over to you and says \"Patient is accepting the compound now, and i'm instructing him to...\"</span></div></div>",
            "created":1516683600,
            "id":2444202,
            "title":"Professor Freeman's Potion"
        },
        "111":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"A few hours... there's not enough time to reverse it!\"",
                "\"A few days... We can reverse it if we work fast!\"",
                "\"A few weeks... We have plenty of time to fix this.\""
            ],
            "content":"<div class=\"\"><div> <span>She looks at you expectantly, and you respond by tipping the formula slightly in your hand, letting a small drop land on your hand.  You put the bottle down and rub it into the skin slowly, until it completely dissipates.  Within a matter of seconds you feel the spot where you poured the formula start to tingle, and then that tingling sensation stretches all the way across your body.  In a flash, you feel your clothes become slightly looser, and the world around you jump up just a little bit.  You’ve shrunk a few inches!  Freeman beams a bright smile at you and steps right up next to you, placing a hand on her forehead and matching it up with hers.  She was about a half a foot smaller than you were at first, but her eyes light up when she realizes that now you’re the exact same height.  <br>\r\n<br>\r\nShe holds the recorder up to her face again and says “Test number one is a complete success.  One drop of the formula has reduced the subject by a noticable margin.  More tests to follow.”  She presses stop and stands with her hands on her hips, glowing with pride at her accomplishment.  “Finally, all of the hard work has paid off.  We finally have a formula that works!  How do you feel?”  You respond that you can still feel a bit of a tingling sensation, but otherwise you’re fine.  Freeman taps you on the head and says “Not to worry, that should go away in a few minutes.  What you should probably worry about though is getting some clothes that fit.  You look like a kid playing dressup in those clothes now!”  You look down and see that she’s right.  Your pants are a few inches too long, draping across the floor, your shirt hangs a bit over your belt which now needs to be tightened, and your shoes are loose enough for you to pop your feet in and out.  Freeman seems to be enjoying watching you react to your newly oversized surroundings at first, but you see the smile start to fade from her face.  She looks you up and down and says “... Uh oh.  This is unexpected”.  You don’t know what she’s talking about until she steps back right up beside you and you find yourself staring at her chin.  She’s taller than she was before… which means you’re still shrinking.  Freeman looks confused and says “I don’t understand.  We followed the procedure exactly, the calculations were correct, the chance of this happening is minimal… but not impossible.”  She holds her hand up to her chin in thought, and the tingling sensation begins to take hold again.  You fear that something’s gone terribly wrong and it’s only confirmed when Freeman says “We had successful tests on mice before i gave you this experiment, but there was one outlier.  One of the mice didn’t return to it’s normal size after a while, instead it just… continued to shrink.  We never found it.”  <br>\r\n<br>\r\nYour face goes pale and you ask her if you’re going to disappear too and she says calmly at first but then getting more serious “No!  Of course not!  Maybe not… I don’t know…. Probably.”  She switches gears to damage control mode and says “Normally the process wouldn’t need an antidote, it’s supposed to wear off on it’s own, but you’re shrinking a lot faster than i was expecting, so we may have to counteract the formula with another compound.”  She opens her notes and uses her index finger to quickly scan through the pages of previous experiments.  All you can do is stand there and try not to feel the world get smaller around you, but now that you know it’s happening, your mind is playing tricks with you and you can swear you’re feeling everything getting bigger.  Freeman taps the page she had opened to and looks up at you quicky saying “Okay.  Well....  According to the notes we took from the experiments on the mice, they had completely shrunk to nothingness within...<br>\r\n</span></div></div>",
            "created":1528174800,
            "id":2503229,
            "title":"A Little Dab Will Do You"
        },
        "113":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"MEMORY\" (She has you run a maze in the lab)",
                "\"DURABILITY\" (She puts some pressure on you)",
                "\"STAMINA\" (She puts you through a special cardio test)"
            ],
            "content":"<div class=\"\"><div> <span>You hear Jenny narrating into the device as you drink most of the solution.  It’s not too bad tasting, almost with a fruity tang to it as you feel it enter your stomach.  You feel as though you should drink just a bit more, but the professor grabs your hand suddenly and says “That’s more than enough.  The solution is very powerful.  We’re not sure what would happen if you were to consume every last drop.  Save the other half, we may need it for later.”  You put the glass down and Freeman walks up to you and says “How do you feel?  Any significant changes you can tell?”  You start to say that you’re feeling a bit dizzy, when all of a sudden the room starts to expand around you.  Freeman’s face goes from a look of concern to excited glee as you sink into your clothing.  “It’s working!  I knew it would work, of course, i triple checked the math on everything, but still!  It’s so exciting to see this happen in person!”  She rises further and further into the sky, your shirt forming a warm, clothy cavern around your ever dwindling form.  When you finally stop shrinking, you manage to crawl out of the neck hole of your shirt and look up at the giant professor.  She has crouched down slightly to get a better look at you, her arms slightly resting on her knees.  She brings the recording device up to her face again and says, almost crying from happiness “THE SOLUTION IS A COMPLETE SUCCESS.  SUBJECT HAS BEEN MINIATURIZED WITH SEEMINGLY NO ILL EFFECTS, AND ALL BODY PARTS APPEAR DIRECTLY PROPORTIONAL.  INITIATING DIRECT CONTACT.”  <br>\r\n<br>\r\nYou wonder what she means by direct contact, until a shadow is cast over you and she reaches down to grab you with one hand.  Her massive fingers clasp around your body and grip you tightly in a fist with just your head peeking over the edge of her hand.  You don’t dare struggle, knowing it would be all for naught.  The room seems to whisk right by you as she quickly stands up, bringing you directly in front of her bespectacled eyes.  Her grip on you is definitely solid, you won’t be able to maneuver yourself around much, but it’s far from painful.  Just a solid amount of pressure surrounding your miniature body.  The gigantic eyes in front of you dart back and forth over her fist, and although you’re too high up to actually see her smile, you can tell in the side of her face that she’s beaming from ear to ear.  “THIS CONCLUDES TEST ONE.  JENNIFER FREEMAN, PHD, SIGNING OFF.”  She clicks the recorder off with her free hand and puts the recorder down.  With her other hand free now, she decides to extend her index finger and rub your head gently, as one would a pet or a doll.  “I COULDN’T SAY THIS ON THE RECORDING, BUT YOU CERTAINLY DO LOOK CUTE WHEN YOU’RE THIS SMALL.”  As she compliments you (you guess), you can feel the fingers trapping you moving around slightly.  You can tell she’s definitely enjoying the feeling of holding you in her hand, and the massive digits are molding you around slightly, trying to get a feel for every bit of you.  It doesn’t bother you much, and you feel like you can trust her for the moment… Not like you have much of a choice. <br>\r\n<br>\r\n You try to say thank you, but she just giggles at your attempt to communicate and says “SORRY, BUT YOUR VOICE IS AWFULLY SQUEAKY.  I HAD A FEELING THAT WOULD BE A SIDE EFFECT OF THE PROCESS, I JUST DIDN’T EXPECT TO FIND IT SO FUNNY!”  She continues to stare at you for what seems like an unreasonably long amount of time before you ask her what she plans to do next.  Her eyes go wide with realization and she says “OH!  RIGHT!  YEAH, THERE ARE A FEW MORE THINGS I’D LIKE TO DO WITH YOU NOW THAT YOU’RE THIS SMALL.  WE DON’T KNOW HOW LONG THE EXPERIENCE IS GOING TO LAST, SO WE NEED TO DO A FEW THINGS RIGHT AWAY.”  She puts you down on the table and stands up to her full height, giving you a fantastic view of her proportionally gigantic body.  The table is level with her large, curvy hips and they seem to sway as she stands there playing with her phone a bit.  You’re finding yourself very attracted to this gargantuan redhead.  She bends down over you, moving some of her long curls out of her face as she says “WE’RE GOING TO HAVE TO RUN A FEW TESTS ON YOU TO MAKE SURE THE PROCESS HASN’T NEGATIVELY AFFECTED YOU IN ANY WAY.  AND I THINK THE BEST WAY TO DO THIS IS TO FOCUS ON YOUR…”<br>\r\n</span></div></div>",
            "created":1525150800,
            "id":2486857,
            "title":"A Successful Formula"
        },
        "114":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"WHICH IS EXACTLY WHERE WE NEEDED HIM TO BE.\"",
                "\"WHICH IS NOT QUITE SMALL ENOUGH.\"  ",
                "\"... WHICH MEANS HE IS WAY TOO SMALL.\""
            ],
            "content":"<div class=\"\"><div> <span>You manage to drink down most of the contents of the bottle.  The elixir is pleasant to taste, which makes it all the easier to choke down.  You keep drinking until you see Freeman give you a thumbs up sign and you take that as your cue to stop.   You look down at the bottle and notice that you've drank almost all of it, with just a small amount still remaining.  You're also noticing tha tthe bottle is getting slightly heavier in your grasp.  Damn, this stuff works fast!  You quickly discard your clothes, afraid that you'll become lost in the fabric in a matter of minutes, and just as you get everything off in time, your height drops dramatically.  The bottle that was once in your hand could now hold your body hundreds of times over, and you estimate that you've dropped below an inch tall.  Everything in the room looks gigantic... including the gorgeous redhead standing in front of you.<br>\r\n<br>\r\nFreeman had looked away for a split second, and that was just long enough for you to drop out of her sight.  She bites her lip and grabs the recorder, and slowly crouches down.  Her booming voice carries cross the room as she speaks into the recorder:  \"SUBJECT HAS TAKEN THE APPROPRIATE AMOUNT OF SOLUTION, AND MINIATURIZATION HAS BEGUN.  CURRENTLY LOOKING FOR SUBJECT IN THE CARPET.\" <br>\r\n Her massive hand waves through the carpet fibers of the lab room, desperately looking for your miniscule body.  You jump and wave up to her, but your little voice can't seem to travel up the full distance to her face.  Her feet slam down with epic force as she takes small, calculated steps so as not to crush  you by accident.  You realize that if you want to be noticed by the giant woman, you're going to have to get closer.  You run towards the scientist's massive open toed shoe, hoping beyond hope that she doesn't pivot suddenly and crush you under the heel.  She moves with careful enough motions that you find yourself in front of her toes, and make your way over to the smallest one.  Despite the fact that you are face to face with a woman's pinkie toe, it is still a massive orb of flesh that moves and wiggles on it's own terrifying fashion.  <br>\r\n<br>\r\nThe heat coming off her humongous foot is somewhat overpowering while still inviting.  The scent is somewhat pleasant, a mixture of strawberry scented lotion and leather, with just a hint of sweat mixed in.  You are almost hypnotized by the feeling of being this close to a giant woman's body that you are snapped back to reality by her sudden act of moving her feet just a few inches.  The giantess shuffles her body to one side, and you fall completely over on the space between the sandal edge and her toe.  You are ridiculously tiny and you need to get her attention NOW.  You muster up the courage to approach the toe directly and put your hands against the rugged, tough skin.  You punch it a few times, hoping to get some sort of reaction out of the giantess, and your efforts seem to actually work.  Freeman makes a quick laugh of realization and turns her attention back down to her feet, where she sees you waving up to her at her toe.  She presses the recorder back up to her face and says \"SUBJECT HAS BEEN LOCATED.  HE IS CURRENTLY BESIDE MY LITTLE TOE, AT APPROXIMATELY HALF AN INCH TALL...\"</span></div></div>",
            "created":1525842000,
            "id":2491014,
            "title":"At Freeman's Feet"
        },
        "1141":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She grabs a glass of water... She's going to swallow you!",
                "She removes her shoe... She's going to step on you!",
                "She removes her pants... She's going to sit on you!"
            ],
            "content":"<div class=\"\"><div> <span>With a satisfied nod, Freeman looks down at the recorder and says \"EXPERIMENT NUMBER ONE IS A RESOUNDING SUCCESS.  FURTHER EXPERIMENTATION NEEDED OF COURSE, BUT FOR NOW WE ARE RIGHT ON TRACK.\"  She hits stop on the recorder and moves her long red hair out of the way as she looks down at you.  She's trying to appear as non-threatening as possible, but she's an absolute monolith of humanity, with her shadow casting down on what seems like miles of ground at your height.  She smirks and points down at her toe, saying  \"GOOD JOB MEETING ME IN THE MIDDLE THERE.  SORRY IF YOU FELT LIKE I WAS GONNA SQUASH YOU DOWN THERE.  BUT YOU DON'T HAVE TO WORRY, I'M ALWAYS EXTRA CAREFUL WITH MY LITTLE SUBJECTS.  WHAT DO YOU SAY WE GET YOU AWAY FROM MY TOES?\"  She lays her hand down flat on the edge of the sandal with her pinkie finger laid directly against the sandal material.  You hop over the seemingly troublesome gap between the shoe and her hand and quickly run down the length of her finger to her waiting palm.  Her hand smells like strawberries, which must be the scent of the lotion she uses on her soft skin.  You can tell that she's trying to stifle a laugh as you scatter across the length of her pinkie, trying not to let your little feet tickle her skin.  When you find yourself in the center of the tan, lined surface, the world seems to rise around you as the professor lifts her hand off the ground.  She brings you up to about chest level and looks down at you with the world's largest smile.  She holds her other hand up and brings her index finger up and down, giving you a tiny little wave.  You respond in kind and she giggles, whispering \"HEY CUTIE.\"  You try and shout up to her to say something, but your little voice won't carry that far.  At your height, the only way she'd be able to hear you is if you were actually in her ear pressed against her eardrum.  She notices your efforts and smiles, saying \"SORRY, LITTLE GUY.  I WON'T BE ABLE TO HEAR YOU WHILE YOU'RE MINIATURIZED.  EVEN IF I COULD, I'M SURE ALL I'D HEAR ARE SQUEAKS.\"  You didn't REALLY need to feel smaller than you already were, but if any news were going to do it, that would be it.  <br>\r\n<br>\r\nFreeman uses a magnifying glass from the table to observe you a little bit closer, occasionally taking notes and humming to herself.  Her voice is so deep and loud that even the simplest of hums vibrates through the air and shakes through your feet. <br>\r\n Standing on her palm is an odd but definitely not unpleasant experience, as the pleasurable scent from her lotion and the heat from her body almost rock you into a comfortable haze.  Freeman looks down at you and without missing a beat asks \"TAKING IN EVERYTHING?  HOW DO MY HANDS SMELL?  I HOPE THEY'RE CLEAN ENOUGH FOR YOU.\"  You are a bit startled by this.  Could she actually hear your thoughts or sense your feelings?  Apparently not as she has an answer right away as she puts down the magnifying glass and plays with her hair a bit.  \"THE MOLECULAR COMPRESSION AFFECTS ALL YOUR SENSES AT ONCE.  SIGHT, SMELL, HEARING.  LIKE FOR EXAMPLE, IF IT WEREN'T FOR THE PROCESS, YOUR HEAD MAY HAVE ALREADY EXPLODED JUST FROM THE SOUND OF MY VOICE.  LUCKILY, WE CAN SEE THAT'S NOT THE CASE.\"  You take a big gulp and appreciate for a second how you're still able to understand the giantess.  If what she's saying is true, the deep booming voice from the redheaded goliath could have been MUCH more painful if she wasn't looking ahead.  Her free hand stops touching her long red locks and hovers over you for a quick second.  \"EVEN TOUCH IS AFFECTED.  BUT YOU AREN'T MORE SENSITIVE TO IT.  QUITE THE OPPOSITE.\"  She brings the pinkie finger of her free hand over to you and presses down on you gently.  It doesn't hurt, but you can definitely feel the pressure as she pushes down.  She laughs at your struggling body beneath her fingertip and says \"SEE?  BECAUSE YOUR MOLECULES ARE PACKED SO TIGHTLY TOGETHER, I CAN'T SMUSH YOU LIKE A LITTLE FLEA.  NOT THAT I'M CALLING YOU A FLEA AT ALL, BECAUSE YOU'RE NOT A BUG.  YOU'RE  STILL A PERSON.  JUST MINIATURE.\"  You appreciate that she's at least acknowledging your humanity as you stand there motionless in the center of her palm.  It's good to know that you're not exactly a bug, even if your stature certainly makes you sympathize with one.  She lifts her finger off and taps her finger against the palm in front of you and says \"HOWEVER, WE NEED TO DO A FEW PRESSURE TESTS JUST IN CASE THE PROCEDURE DIDN'T WORK COMPLETELY.  SO WE'LL HAVE TO PUT A BIT MORE WEIGHT ON YOUR TINY LITTLE SHOULDERS.\"  She gives you a wink as she slowly tilts her palm over the edge of the lab table, allowing you to slide off of her skin and onto the cold, hard metal of the table's surface.  She grabs the recorder and begins another entry:  \"PROFESSOR JENNIFER FREEMAN.  SUBJECT IS SHOWING NO ILL EFFECTS OF THE MINIATURIZATION PROCESS.  EXPERIMENT NUMBER 2 IS ABOUT TO BEGIN, AND WILL TEST THE SUBJECT'S ABILITY TO WITHSTAND MASSIVE AMOUNTS OF PRESSURE.\"  You take a deep breath and prepare to face the worst as the professor prepares your next test:  </span></div></div>",
            "created":1526360400,
            "id":2493609,
            "title":"Half Inch Experimentation"
        },
        "11411":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "You seem fine, you can even hear Freeman start on her next test subject",
                "It quickly becomes apparent you aren't immune to Freeman's stomach."
            ],
            "content":"<div class=\"\"><div> <span>You sit on your spot on the desk and watch the doctor as she turns away from you and crosses the room, you couldn't see what Freeman was doing since she had her back to you. You tried to make the best of the situation, this was probably a once in a lifetime experience you were getting here and Freeman had already shown that despite your size you should be pretty safe from being crushed. Just then Doctor Freeman turned back towards you and walked over to the desk, it looked like all she was carrying was a glass of water. You briefly wondered what she'd want to do to test you with a glass of water, but Doctor Freeman had already crossed the room and started explain as she smiled down at you. \"WE'RE ALREADY CONFIDENT ENOUGH ABOUT YOUR RESISTANCE TO PRESSURE WHILE MINITURIZED SO NOW WE'LL BE TESTING YOU IN A SOMEWHAT MORE EXTREME SCENARIO.\" And with that Doctor Freeman laid her hand palm up on the desk for you to hop onto, you obliged but still didn't get what she wanted to do with the cup of water that'd be a more extreme endurance test, something to do with holding your breath? Maybe something about water pressure? But the giantess didn't move you anywhere near the glass of water, instead she brought you to her face. At this close distance she could see your little look of confusion \"YOU'RE PROBABLY WONDERING ABOUT THE GLASS OF WATER, DON'T WORRY, IT'S JUST TO HELP ME GET YOU DOWN EASIER, EVEN AT ONLY AN INCH TALL YOU'RE STILL PRETTY BIG TO SWALLOW WHOLE, ESPECIALLY IF YOU WRIGGLE.\" From this close up the force and sound of Doctor Freeman's voice was multiplied tenfold in addition to the fact that now you could feel her warm breath wash over you, this combined with disbelief of what Doctor Freeman had just said left you stunned for a moment. In that moment Doctor Freeman's grip on you shifted and she tossed you into her waiting mouth. Flying through the massive lips you splatted onto the massive tongue of Doctor Freeman, it shifted beneath you and soon you were soaked head to toe in the giantess's saliva. You tried to get to your feet on the giant tongue but once again the massive lips parted, looking over your shoulder you saw an incoming flood of water of Doctor Freeman had raised the glass of water to her lips. The torrent of water immediately swept you along and down into the throat of the giant researcher. And then you were being carried swiftly down her tight esophagus by the tidal wave she'd swallowed to wash you down, you were quickly pushed through Doctor Freeman's insides and into the dark, noxious stomach of Doctor Jennifer Freeman. You found yourself soaked, in the dark you couldn't be sure how much was the water and how much was Doctor Freeman's saliva and gastric juices. You had nothing to do but keep your head above the liquid and wait to see if whatever the redheaded giantess scientist done to you would save you from her body. As time passes...</span></div></div>",
            "created":1594786860,
            "id":2868808,
            "title":"Taste Test"
        },
        "1142":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"GET ANOTHER TEST SUBJECT\" She says reaching for her phone",
                "\"TRY SOMETHING A LITTLE... UNORTHODOX\" She says reaching for the formula",
                "\"TRY AGAIN TOMORROW\" She says, putting you in a glass box!"
            ],
            "content":"<div class=\"\"><div> <span>Standing next to her littlest toe which absolutely dwarves you in size, you can’t believe you’re hearing her say that you’re still too tall.  She sighs and speaks into the recorder again saying \"EXPERIMENT HALTED TEMPORARILY UNTIL SUBJECT IS AT THE PROPER SIZE.  MORE TO FOLLOW SOON.\"  She presses stop and looks down at you saying \"ALRIGHT.  LET'S GET YOU OFF THE GROUND, SHORTY.\"  In a swift motion, the giant scientist reaches down wth a thumb and forefinger, carefully grabbing you by the waist between her fingertips.  You pray that she has the self control not to bring her digits together even the slightest bit, fearing that she is just  millimeters away from squashing you flat.  She carries you across the room and safely lowers you down to the lab table, next to equipment so oversized you have a hard time seeing exactly what anything is until she picks it up and puts it into view for you.  As she writes down some notes on a small yellow pad, you are astounded by how much your senses pick up at this height.  The scribbling on the notepad, the smell of Freeman’s perfume, even the body heat coming off of her hips as she pivots in place.  Every sensation is amplified to an almost unrecognizable degree.  You call up to her, looking for a little bit of attention, but it is in vain.  Your little voice probably can’t even reach higher than the midriff of her shirtt, even if you were to yell at full volume.  She eventually looks down at you and giggles, the booming laughter shaking you a bit, even knowing that she’s just doing it slightly under her breath.  “YOU ARE PRETTY ADORABLE THERE ON MY TABLE.  LIKE A LITTLE BUG SCAMPERING ABOUT.  IT’S A SHAME YOU’RE ONLY…”  Quicker than you can react, she moves her hand swiftly behind you, holding a large wooden pillar.  It slams into the table behind you and you instinctively stand perfectly still as she narrows her gaze and fixes her glasses.  She bites her lip and says “YUP.  JUST AS I EXPECTED.  ONLY A HALF AN INCH.  YOU SHOULD BE JUST A LITTLE BIT MORE MINISCULE CONSIDERING HOW MUCH OF THE FORMULA YOU DRANK.”  <br>\r\n<br>\r\nWith her head still lowered, you call up to her asking why you’re not small enough.  She shakes her head slightly, standing back up to her full height but not breaking eye contact with you.  “SORRY LITTLE MAN.  YOUR VOICE IS WAY TOO SQUEAKY FOR ME TO UNDERSTAND YOU.  BUT I THINK I KNOW WHAT YOU’RE SAYING.  HOW COULD THIS POSSIBLY NOT BE SMALL ENOUGH.  RIGHT?”  You shake your head up and down, throwing your arms up as if to say “No Shit”.  She sees this and laughs a little before you.  “DON’T GET ME WRONG.  I’M REALLY EXCITED THAT YOU’RE SO SMALL RIGHT NOW.  IT’S JUST… I’M A BIT OF A PERFECTIONIST, AND THIS SOLUTION HAS TO HAVE AN EXACT PROPORTION RATE.  BASED ON THE AMOUNT YOU DRANK, YOU SHOULD BE JUST A LITTLE BIT SMALLER.”  She can’t hear you so you don’t bother asking exactly how small you are supposed to be, but luckily she anticipated your actions and answers to herself “AN EIGHTH OF AN INCH TALL.  SO ABOUT A QUARTER OF THE SIZE YOU’RE AT NOW.  AS HARD AS THAT IS TO BELIEVE.”  <br>\r\n<br>\r\nYou are a little blown away by just how much smaller she was anticipating you’d be, and don’t know if you could handle being THAT small.  Even now talking to her directly is impossible, and every small move she makes terrifies you with how easily she could unknowingly crush you.  She crouches down next to the table so that her huge eyes are level with you, seperated by the thick glass of her spectacles.  The table vibrates slightly as she speaks, making you feel even lower to the ground than you already are.  “THE EXPERIMENT CAN’T CONTINUE UNTIL THE SUBJECTS ARE THE APPROPRIATE SIZE FOR ALL THE TESTS.  SOOOO THERE’S ONLY ONE THING WE CAN DO NOW…”  </span></div></div>",
            "created":1527742800,
            "id":2501314,
            "title":"And you thought THIS was small enough!"
        },
        "1143":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"DISPOSE OF YOU.\"  ",
                "\"PUT YOU WITH THE REST OF THE REJECTS.\"",
                "\"PERFORM A DIFFERENT EXPERIMENT.\""
            ],
            "content":"<div class=\"\"><div> <span>Your jaw drops as Freeman’s smile disappears and she says “SUBJECT WILL BE TAKEN CARE OF.  HUMAN TESTING WILL PROCEDE FROM THE INTRODUCTORY STATE AT NEXT CONVENIENT OPPORTUNITY.”  She presses stop on the recorder and sighs wistfully.  “OH WELL.  WE TRIED.  SORRY LITTLE GUY.”  She reaches into her pocket and pulls out a pair of small metal tweezers.  You see her reach down for you and attempt to escape her grasp, but her huge body moves just too quickly for you to gain any ground.  She snags you up between the oversized metal tongs and whisks you up to her face, holding a palm beneath you to cradle your fall if she was to drop you.  From your perspective you can only see one of Freeman’s eyes, focusing on you intently through the thick lens of her glasses.  Although you can’t see the rest of her face, you can tell she is significantly more upset than when you started.  “I’M SO SORRY, BUT THE EXPERIMENT WAS NEVER MEANT TO PROGRESS THIS FAR.  YOU’VE BECOME TOO LITTLE FOR US TO REVERSE THE PROCESS.  YOU’RE GOING TO BE THIS SMALL FOREVER.”  <br>\r\n<br>\r\nYour whole world collapses as you hear the news.  You’re going to never be able to get back to your normal size?  You can barely contemplate what the rest of your life is going to be like, trapped forever in a body the size of an ant.  You don’t really have a lot of time to think about it though, as Freeman brings her hand up underneath you, this time holding a thin glass tube.  She releases the grip of the tweezers, and you fall down into the container between her fingers.  Luckily, due to your compression, you don’t break your legs upon reaching the bottom, but you do feel the pressure on your knees and fall over.  As soon as you gain your bearings, you look through the glass and pound your little fists against the glass, in an attempt so fruitless, it doesn’t even make a sound that she can hear.  She lifts the container up to her eye again, this time looking even more distorted due to the glass container you’re trapped in.  Her voice echos through the tube as she whispers  “I’M SORRY, BUT THERE’S ONLY ONE THING WE CAN DO NOW....  </span></div></div>",
            "created":1526360400,
            "id":2493613,
            "title":"Too Small For This To Work"
        },
        "115":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She removes her shirt!  (You shrink from arousal)",
                "She slaps you! (You shrink from pain)",
                "She tells you to shrink!  (You shrink from auditory commands)"
            ],
            "content":"<div class=\"\"><div> <span>You ask her if she's serious and she goes \"Yup.  The whole thing.  Bottoms up!\"  You shrug and take a sip, enjoying the taste of the formula.  It's sweet and fruity, without being too strong to resist.  It goes down pretty easy, and before you realize it, it's all gone.  She grabs the glass from you and says \"Thanks!  Now we can move on.\"  You stand in place, waiting for your body to start shrinking, but it doesn't seem to be happening.  She laughs at your confusion and says \"I know, i know.  You were probably expecting to get little right away.  But that's not how the formula works.  It's more of a reactant than a direct compound.  Meaning it needs an external stimuli in order for you to be miniaturized.\"  You kind of get the jist of what she's saying:  Your body will shrink when something particular happens.  She gets up close to you and says \"Alright.  Are you to see what's going to cause you to shrink?\"  You nod up and down and Freeman smiles and says \"Very well.  Test number one begins now...\" </span></div></div>",
            "created":1528174800,
            "id":2503233,
            "title":"What Causes You To Shrink?"
        },
        "12":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She only hits it for a few seconds - You're a foot smaller!",
                "She holds on a little bit - You're six inches tall!",
                "She holds on too long - You're a half an inch tall!",
                "She misses you and hits a mirror... It strikes her instead!",
                "She misses you and hits a mirror... It strikes someone walking in!"
            ],
            "content":"<div class=\"\"><div> <span>You were kind of hoping for someone a little older to be handling the experiments, so there was a bit of unease when the door opened and in walked Mai.  She was a younger Asian girl, couldn't have been more than 21 and was wearing blue jeans with a tight fitting white t-shirt.  She shoots you a smile as she walks in towards you, and shakes your hand very excitedly.  \"Hi there!  I'm Mai, i'll be working with you today!  Thank you sooo much for doing this for me!\"  You ask her exactly what qualifications she has and she says \"Well... I'm a student at the university down the street.  I've been studying biology and bio-mass for the past few years, and if this proves successful, illl be able to get my masters in NOTIME.\"  She gets right to work, pulling out a large book of randomly scattered notes and calculations, along with a silver toolbox.  \"So tell me about yourself.  Where are you from?  What do you do?  Are you allergic to penacilin?\"  She fires question after question at you and you do your best to answer as she hurriedly takes down your measurements.  You stand there amazed as she asks question after question, checking your blood pressure, height, and even tentative grip strength relatively in a flash.  She takes a breath for a moment and looks up at you, shooting an awkward smile and says \"Sorry.  I know i'm breezing through the introductions.  I just don't know how much time they're giving us to work on this and I really want to get some experimenting done before we have to give up the room.\"  <br>\r\n<br>\r\nYou ask her what exactly she plans to do with you and she says \"Oh!  Right!  I never told you.  I'm gonna make you smaller.\"  You do a double take and ask her exactly what she means by that and she says \"Okay, so... you know how we're all made up of atoms and compounds?  I found a way to compress those compounds in a way that proportionally effects a person's size... hypothetically.  We haven't been able to secure the rights to human testing yet, but that changes with you!\"  You ask if she knows what she's doing and she rolls her eyes \"Totally.  I know exactly what i'm doing.  Well kind of.  I haven't tested it out on anything living yet.  But i shrank a couple of chairs and tables and stuff, and they seemed fine!\"  She opens the toolbox and pulls out what looks like a small super soaker toy with a glowing red nozzle.  She flips a switch and the whole thing lights up.  You start to get a bit nervous, especially as she tells you to stand up against a wall.   She places a piece of black electrical tape on the wall right above your head and walks backwards.  \"Keep yourself lined up with the tape on the wall there.  I want to see just how much height you can lose from one shot.\"  <br>\r\n<br>\r\nYou take a deep breath and close your eyes almost like you're facing a firing squad... and in a way you sort of are.  Mai writes down one final note and lifts the gun up, finger on the trigger and closes one eye to aim properly.  \"Alright, get ready to be small... this is gonna be so great!\"  She pulls the trigger and you brace for impact...</span></div></div>",
            "created":1516683600,
            "id":2444205,
            "title":"Mai and her Shrink Ray"
        },
        "121":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She shoots you with the gun, and returns you to normal",
                "She shoots you with the gun, but something goes wrong",
                "Someone entered the room before she could return you to normal"
            ],
            "content":"<div class=\"\"><div> <span>In a bright green flash, almost instantaneous, you watch your worldview change.  You feel as if you've stepped into a small pit of some sort, and you're sinking into the floor.  But you know that's not the case, the girl on the other end of the room just made you smaller.  At first glance it doesn't look like that significant of a difference in height, until Mai takes a few steps directly towards you.  She's knocked a solid foot or so off of your height, and even though you were a good half a foot taller than this girl when you started, you find yourself looking just below her nose when you look straight ahead.  She's now a lot taller than you, and she's the one who has to look down to look in your eyes.  A fact that is not lost on her, as she holds up a palm, flat down on your head, matches it up with herself and lets out a quick laugh before covering her mouth. <br>\r\n You give her a look as if to say \"really?\"  And she collects herself, saying \"I'm sorry.  I'm sorry.  It's just that i'm not used to seeing guys who are shorter than me.  Well... Smaller is the right term.  Everything about you looks like it should be proportionally shrunk to match your height.  I just need to make sure to document everything.  Because i don't want to jinx it, but... I think it worked compeltely!\"  She excitedly rushes over to her bag and pulls out a notebook, matching up your current height against the wall with the height you recorded at earlier.  You can hear her talk out loud as she says \"Starting height was Five foot 10... current height... Four foot ten!  Exactly one foot!\"  That foot makes all the difference in your perspective, and you're still looking around the room, trying to make sense of the random changes in the height and depth of everything around you.  Even though you haven't changed much, the small change is more than a little disorienting.  <br>\r\n<br>\r\nMai leans in uncomfortably close to you , sizing you up bit by bit and writing down notes in her ratty pink notebook.  She'll occasionally pinch and prod your skin, which you really wish she'd stop doing.  WHen she tries to lift up your shirt, you go to grab her arm, but can't move it as easily as you'd thought.  Mai looks down at you and lets out a small laugh of surprise, before asking \"Were you... just trying to move my arm just there?\"  She breaks her arm free and stands with her hands on her hips, regarding you with a much more confident smile than before.  \"Your strength definitely diminished with your height.  You can't overpower me anymore, can you?\" You start to get a little nervous, hoping she doesn't let the sudden influx of power go to her head.  Luckily, she doesn't do anything malicious, just pats you condescendingly on the head and says \"As fun as it is being the big strong one here, I'll just wrap this up and grow you back to normal size.\"  You're kind of surprised with how quickly the test went... at most you've only been there for fifteen minutes.  You ask if you're really done with everything and she shrugs and goes \"Yeah.  That's all we had scheduled for today.\"  Today?  As in you'll need to come back?  You ask her about this and she nods excitedly and says \"Yup!  We've got you booked for at least two weeks.  And each day we're going to make you a different size.  We need to run all the tests in a measured, careful manner.  I really don't want to screw this up.\"  You ask kind of nervously just how much smaller you're going to end up by the end of this, and without a shred of care or sympathy, Mai smiles excitedly and holds her thumb and forefinger with a small space apart, almost touching the tips with how close she brings them together.  \"Reeeeeeal small.  Like I probably won't be able to see you with my regular glasses by the time we're done testing.  Maybe you'll fit under a microscope or something.  But that's a ways away.\"  You take a hard gulp and she catches your obvious dread at being microscopic and under the hyperactive girl's care.  She puts a hand on your shoulder and says \"Don't worry, it's totally safe.  I mean... obviously you being small will come with some crazy dangers and stuff, but i'm gonna take real good care of you!\"  It may be the cute look in her eyes, the beaming smile, or just the overall demeaner she gives you, but even though you're worried about what's to come, you do actually trust Mai.  She puts her notebook down and reaches back for the gun and says \"Alright.  let's get you back to normal.\"  </span></div></div>",
            "created":1525237200,
            "id":2487359,
            "title":"Now You're Shorter Than Mai"
        },
        "1213":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "You",
                "Mai",
                "April"
            ],
            "content":"<div class=\"\"><div> <span>Before anything else can happen, there's a knock at the door.  \"Yo, May-may.  Let me in, I'm here.\"  Mai looks at the door and rolls her eyes saying \"Oh great.  April's here.\"  You ask who that is and she says \"She's my partner for this experiment.  At least she was supposed to be.  We got grouped together based on our last names.  She hasn't done a thing to make this happen.\"  April swings open the door and you are more than a little intimidated by her height.  She's a good eight or nine inches taller than may, which means by now she's almost a foot taller than you. <br>\r\n She's got a classic punk look to her, with a leather jacket, white tshirt underneath, and loose dark blue jeans.  it's hard to tell how long they travel down because her leather boots are all the way up to her knees.  She regards the two of you with a nod and says \"Hey shrimp.  And hey... other shrimp.  God, you short people sure like to hang out together, don't you?\"  Mai is obviously used to the abuse and says \"For your information April... This is our test subject.  He's been very helpful so far, and we've even finished the first test.\"  April looks over at you and says \"For real?  Like you used to be.... taller?\"  You nod your head and she laughs, saying \"Good job, Mai Mai.  I knew teaming up with you was basically a guaranteed A.\"  <br>\r\n<br>\r\nWhile Mai tries her best to ignore the brash young lady, April looks you up and down and says “So this is it, huh?  You know when you said you were gonna shrink a guy i thought he'd be a lot smaller than this”  Mai sighs angrily and says “This was the first experiment.  You would have known that if you actually read the outline i sent you.”  April looks at you and pokes you in the shoulder, saying “You’re lucky i wasn’t doing this test, shorty.  I would have said screw the slow and steady method.  I would have made you bug-sized right away.  In fact…”  She reaches quickly down at the table and grabs the gun at an awkward angle, pointing it at your neck “Why don’t we do that right now?  I’d REALLY like to see a dude shrunk down and scamper around on the floor like a rat!”  Mai tenses up and says “April!  The device turned on when you grabbed it like that!  Just put it down gently and we can talk about this.”  April rolls her eyes and says “I’m just playing around with him.  God, you’re such a buzzkill.”  April does NOT put it down gently and instead drops it onto the table, with the muzzle facing out at all three of you.  A bright beam shoots out across the room and it strikes...</span></div></div>",
            "created":1525842000,
            "id":2490920,
            "title":"Interrupted by April"
        },
        "12131":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "The beam hits Mai, Shrinking her down to your size",
                "The beam misses Mai, hitting something else in the room",
                "The beam hits Mai, Shrinking her down and YOU WITH HER"
            ],
            "content":"<div class=\"\"><div> <span>The light impacts your body square in the chest, and you immediately feel the effects, your whole body shrinking down in size (with your clothing along with it).  Within a matter of seconds, you are no longer the size of a human, instead finding yourself closer to that of a find yourself in a much different world, staring at April’s thigh high boots.  You direct your gaze upwards and see the giant punk staring down at you with wide open eyes.  She lets out a small laugh of surprise and crouches down, casting a menacing shadow over your significantly smaller body.  She reaches out for you and plucks you between two fingers, licking her lips as she says “NOW WE’RE TALKING.”  She lifts you off the ground, dangling you in front of her face.  She giggles at your helplessness and jabs you with the pointer finger of her free hand.  Your body swings with motion and pain as she pokes and prods you with her index finger, which you can tell is about twice as long as you are tall.  “COOL.  YOU WERE A PERSON LIKE A MINUTE AGO.  NOW YOU’RE A TOY.  AND YOU CAN DO THIS TO ANYONE, MAY-MAY?”  <br>\r\n<br>\r\nIn a flash you are surrounded by a different set of fingers as Mai quickly grabs you out of April’s teasing grasp.  <br>\r\n“STOP TOUCHING HIM LIKE THAT, YOU BIG LUMOX!  HE’S INCREDIBLY VULNERABLE LIKE THAT!”  April laughs and says “YEAH, THAT’S WHAT MAKES IT SO FUNNY.  I WAS JUST ABOUT TO SEE IF HE’D SPLATTER ON THE GROUND IF I DROPPED HIM FROM A HEIGHT OF LIKE TWO FEET.  SO PATHETIC.”  Safely nestled in Mai’s palm, you hear her shout out at April in anger “YOU CRAZY BITCH!  THIS IS WHY I DIDN’T WANT YOU TO BE INVOLVED IN THIS PROJECT.  YOU’RE COMPLETELY INSANE.”  Mai looks down at you in her hand and curls her palm to shield you from the dangers of the outside world.  You feel unbelievably safe as she peers down at you and whispers “I’VE GOT YOU NOW.  DON’T WORRY.  SHE WON’T HURT YOU WHILE I’M AROUND”  You don’t relax for too long however, as you hear a booming voice beyond the warm embrace of Mai say very sternly “WHAT DID YOU JUST SAY TO ME, SHORTY?”  <br>\r\n<br>\r\nYou see Mai’s face raise up to face April, and then go cold with her huge mouth agape.  You look backwards over the hills of Mai’s fingers and see in the distance the giant form of April, standing defiantly with the gun pointed directly at you and Mai.  Mai’s palm shakes with the rest of her body in fear as you struggle to stand up in the giant girl’s palm.  April smirks and says with a nasty cackle “YOU WANT TO LOOK AFTER THE BUG?  FINE.  IT WOULD PROBABLY BE EASIER IF YOU WERE CLOSER TO HIS SIZE TO DO IT.”  Without another word, April fires the ray again, and you brace for impact.<br>\r\n</span></div></div>",
            "created":1527138000,
            "id":2498113,
            "title":"April Shrinks You"
        },
        "12133":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Deeper (She's growing!)",
                "Higher (She's shrinking!)"
            ],
            "content":"<div class=\"\"><div> <span>April jumps back as a flash engulfs the room.  The bright beam flies out of the gun and strikes the punk directly in the chest.  She runs her hands over her front, apparently unharmed.  \"Uh oh... April got zapped.  Not good,\"  Mai says.  April grabs her head and says \"Mai, what the hell happened... I feel... funny.\"  You and Mai both caught it as she said it.  Her voice was changing, and therefore her size was too.  When she said that her voice seemed much...</span></div></div>",
            "created":1527742800,
            "id":2501408,
            "title":"April Gets Shot"
        },
        "121332":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Follow Mai and give her back the gun",
                "Test out the gun some more in the lab!",
                "Take the gun someplace new.  Have some fun with it!"
            ],
            "content":"<div class=\"\"><div> <span>“Hey!  Help me!  Help meeeee!”  April’s voice gets higher and higher as she shrinks into her clothes.  You and Mai stand there in awe as she disappears into the fabric, which flops against the ground in a matter of seconds.  You are the first to approach the clothing, carefully going through April’s shirt, jacket and pants, finding nothing.  You look back at Mai and shrug, but Mai slowly approaches and says “I uh.. I think i might know where she is.”  You can tell that mai is trying to hold back laughter as she goes right up next to you and grabs April’s large black leather boot.  She looks into the opening and her eyes go wide with surprise and delight.  “Oh…  My… God… I found her.”  You look into the opening of the boot, and there on the thick black sole inside the shoe is a tiny woman, no more than two inches tall, jumping around angrilly and banging her feet against the thick leather interior.  She looks up at the two of you, and to your shock is not surprised or frightened by what she sees, but filled with murderous rage.  “You giant fucking idiot!  Look what you did to me!  Change me back right now you bitch!”  Mai can’t hold it back any more and lets out a large snorting laugh at the miniscule woman trapped in her own shoe.  <br>\r\n<br>\r\n“Oh my god, April.  You are soooo cute in there!  Walking around inside your shoe all itty bitty like that!”  April is having none of this and screams up at her “Get me out of here right now!  It stinks so bad in here!”  Mai raises an eyebrow and says “Who’s fault is that?  It’s YOUR shoe.  Can’t handle your own foot funk, Ape?”  April gets frustrated and starts to climb up the side of her shoe, screaming up at Mai the whole time.  “When i get out of here… I’m gonna kick your ass… you stupid chink bitch!”  Mai leans her face right into the opening, blocking out most of the light, and frightening April a little more.  She’s finally starting to understand her situation as Mai speaks very softly at her “I’m getting a little tired of hearing you call me a bitch.”  She reaches a hand in and gently pokes April, causing her to lose her grip and fall back onto her own smelly sole.  Mai scans the bottom of the shoe and sees the number that April is sitting on top of and says “Hey, that’s funny… I never knew we were the same size.  Mind if i try it on?”  April squeaks in horror “You… You wouldn’t!”  And Mai looks at you, whispering with no small amount of excitement “Actually, I would.” <br>\r\n<br>\r\nShe places the boot on the ground, removing her own shoe at the same time.  Her bare foot which was contained in a thin black sandal wiggles it’s toes with anticipation and slowly makes it’s way into the boot’s opening.  You can hear the faint high pitched squeal of terror coming from the boot as April desperately tries to make her way to the toe section, avoiding Mai’s giant foot.  Mai giggles as she starts to step down, indicating that she’s found the little girl and has her pressed snuggly underneath her toes.  She sits down to put the other boot on, and looks up at you saying “Don’t worry, she should be safe in there.  The gun compacts molecules down so tightly she’ll never be squished.  But she may feel a little bit of pressure… and there’s not much i can do about the smell.”  You stand there speechless as Mai stands up and grabs the ray gun.  Looking it over, she wordlessly points it at you, zapping you back to your normal size.  She puts the gun away, giving you  aminute or so to readjust to your newly restored surroundings.  She picks up a clipboard and holds a pen out to you saying “I think that’s all i’ll need from you for this experiment.  Sign here please?”  You sign the paper and in a moment of disbelief ask if that’s really it.  She nods quickly and says “Yup.  I was originally going to make you much smaller, but it turns out I have a new test subject.  And i think i'll get a lot more out of the experiment if she's the one that feels insignificant.  Thanks for all your help though!”  She stands up on her tip toes and gives you a kiss on the cheek, shining one more smile before walking out the door.  <br>\r\n<br>\r\nYou hold your cheek reflecting on the moment, trying to figure out exactly what the fuck just happened.  You look around the room one more time and notice something a bit surprising… Mai left the room without the shrink ray!  It’s locked up in the packaging, but she must have been so excited about the shrunken girl at her feet that she had completely forgot about the gun!  So it looks like you have a choice to make on how you’re going to spend the rest of the day….<br>\r\n</span></div></div>",
            "created":1528779600,
            "id":2506240,
            "title":"Trapped In Her Own Shoe"
        },
        "122":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"WE HAVE SOME MORE TESTS TO RUN\" She says before reaching to grab you",
                "\"I DON'T REALLY KNOW HOW\" She says as she stands back up",
                "\"YOU'RE JUST TOO CUTE LIKE TO CHANGE BACK!\" She says as she leans in for a kiss!"
            ],
            "content":"<div class=\"\"><div> <span>You watch in awe as Mai transforms rather quickly from a meek young girl to a towering giantess in a matter of seconds.  She manages to time the trigger just right so when she lets go of it, you are left a mere six inches tall.  And you know this for a fact because of the tape measure glued to the wall behind you.  You aren't at exactly the six inch mark.  You use the markings to determine that you level out at 5.85 inches.  You were around Five-foot 10 when you started the experiment, so it makes sense that the ray shrunk you to a size 12 times smaller than your normal height.  And this doesn't really sink in until you turn around and see Mai's gigantic face peering directly at you.<br>\r\n<br>\r\nShe's laying flat on her stomach, using one arm to hold her chest up.  Her smile seems yards wide as she wordlessly fawns over your much smaller body.  You almost flinch for a second as she brings a hand close to you, extending her thumb and forefinger outwards to match your height.  She looks at you, and looks at the fingers for scale, laughing in a much deeper and louder voice than you're used to hearing come from her petit body.  She whispers in delight \"SOOO TINY!!\"  She rests her chin on her hands face down, and continues to marvel at your little body.  \"YOU ARE JUST THE MOST AMAZING THING.  HOW DO I LOOK FROM DOWN THERE?  I MUST LOOK SO HUGE.  YOU'RE LIKE... THE SIZE OF MY PINKIE.  I JUST WANT TO KEEP LOOKING AT YOU FOREVER.\"  <br>\r\n<br>\r\nShe reaches into her pocket and pulls out a magnifying glass, further treating you like an inanimate object for her study, as she tries to look at every inch of your shrunken form.  She smiles proudly and says \"EVERYTHING LOOKS GREAT.  I MEAN YOU LOOK... YOU LOOK LIKE YOU ALWAYS DID, JUST TINY.  EVERYTHING'S PROPORTIONAL, YOU DON'T SEEM TO BE IN PAIN... I'D CALL THIS A SUCCESS!\"  You can see her resisting the urge to poke you like a pet or a toy, and hope she doesn't take too much advantage of the obvious size difference between the two of you.  You ask her if you can change back now that you've successfully finished the test.  She doesn't hear you correctly and leans her huge head towards you, holding a hand up to her ear.  \"YOU'RE GONNA HAVE TO SPEAK LOUDER.  EVERYTHING'S A LOT SMALLER ABOUT YOU NOW, INCLUDING YOUR ITTY BITTY VOICE!\"  You shout up into the extended ear and repeat your question.  Mai shakes her head and says \"NO CAN DO, LITTLE GUY.\"  You ask why and she says \"WELL, IT'S BECAUSE...\"</span></div></div>",
            "created":1525669200,
            "id":2489613,
            "title":"Zapped to Six Inches Tall"
        },
        "1222":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "You'll go home with Mai.  She seems nice.",
                "You'll stay here in the lab.  Just to be safe."
            ],
            "content":"<div class=\"\"><div> <span>You are stunned by her answer… but more so by the fact that she doesn’t seem too bothered by it.  She uses her arms to prop her body back up and in one fluid motion, the giant girl rises, stomping away to the other end of the room to quickly look at her phone.  You run after her, taking a full two minutes or so to reach the spot it took her three or four large steps to reach.  You approach her feet and hit the exposed toe through her shoe, and she looks down and gasps in surprise.  She holds a hand to her chest and collects herself before crouching down to get a better look at you.  “DON’T SCARE ME LIKE THAT, MAN!  IF I HAD MOVED MY FOOT JUST A LITTLE BIT I COULD HAVE CRUSHED YOU.  WHAT’S THE MATTER?”  She leans out a hand and lays it down palm up, allowing you to climb into it.  Her skin sinks slightly as you take steps over her fingers and into the center, kneeling down so you wouldn’t be tossed around as she lifts you up to her face.  <br>\r\n<br>\r\nShe smiles and her eyes look at you lovingly, as she takes her free hand and uses two fingers to lightly pet you, like one would a doll or a pet.  She tilts her head and says “YOU ARE SO CUTE LIKE THIS.  I’VE GOT HALF A MIND TO TAKE YOU HOME AND PUT YOU WITH THE REST OF MY LITTLE THINGS.”  You start to get a little frustrated, and shake off her massive fingers, looking up at her.  You shout up at her that you want to be normal again, and Mai just lowers her glasses and looks at you sternly.  “I TOLD YOU, LITTLE GUY.  I DON'T KNOW HOW TO MAKE PEOPLE BIGGER.  MY DEVICE WAS ONLY CALIBRATED TO MAKE THINGS SMALLER.  BESIDES, MY BOSSES TOLD ME STRAIGHT UP THAT I WASN'T ALLOWED TO TRY AND REVERSE ANYTHING I SHRUNK.  JUST GET YOU READY FOR THE NEXT PART OF THE EXPERIMENT.\"   You ask who she would need to get permission from and she motions over to the door, saying “MY PROFESSOR, MISS FREEMAN.  SHE’S BEEN STUDYING SIZE MANIPULATION FOR THE PAST FEW YEARS, I’M THE FIRST PERSON SHE’S TRUSTED WITH HER SHARE OF THE WORK.”  You sit back in her palm and think about things for a few moments.  If there’s someone else running the experiment, it may be possible for you to get back to normal.  You just won’t be able to do it through Mai here.  The giant girl obviously cares about you, and fawns over your little body.  It’s obvious she wouldn’t do anything to hurt you or trap you at this size on purpose.  But you can't help but be frustrated that she shrunk you without the power (or permission in this case) to try and bring you back up to normal.  <br>\r\n<br>\r\nShe sees in your eyes that you are a bit worried, and an idea sparks across her mind.  She brings you up to her eyes and says “I’VE GOT AN IDEA.  I’M SUPPOSED TO LEAVE YOU IN THE LAB UNTIL TOMORROW… BUT WOULD YOU LIKE TO COME HOME WITH ME?”  You are a bit taken back by her offer and she immediately tries to justify it.  “YOU WON’T BE THERE FOR LONGER THAN ONE NIGHT.  I JUST FIGURE YOU MAY AS WELL BE COMFORTABLE BEFORE THE EXPERIMENT CONTINUES.  I CAN SET YOU UP IN ONE OF MY DOLLHOUSES, IT’LL BE LIKE A HOTEL RESORT.  WHAT DO YOU SAY?”  You think about it for a moment and conclude....</span></div></div>",
            "created":1527742800,
            "id":2501399,
            "title":"Stuck at this size?"
        },
        "1223":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "You stay in the bag, waiting for Mai to take you",
                "You say \"Screw this\" and climb out of the bag"
            ],
            "content":"<div class=\"\"><div> <span>You don't really have time to respond as the giant girl leans in so quickly and swiftly that it catches you by surprise.  Her eyes are close and her lips are pouted, and all you can do is hold an arm up to stop her, but her huge hand sweeps in behind you and pulls you in close.  She presses you firmly but not painfully into her waiting lips, enveloping you in a gigantic, wet kiss.  You feel two of her fingers hold you in place by your back as she lifts herself off the ground, and you are being carried up for the ride.  When she stands to her full height, she seperates her lips and you fall backwards into her waiting hand, which has been repositioned so you land directly in the center of her palm.  She has her fingers together lifted towards the sky, holding your miniscule frame to face her, almost like a massive chair made of warm, sweet scented skin.  Mai giggles at the sight of you in her palm and holds a finger out with her free hand circling around you in a taunting manner.  \"YOU'RE SOOO CUTE AND PRECIOUS LIKE THAT.   JUST LIKE ALL MY MINIATURES AT HOME.  ONLY LIVING AND MOVING.  JUST LIKE I ALWAYS PICTURED IT WOULD BE LIKE WHEN I FINALLY FIGURED OUT HOW TO SHRINK PEOPLE.\"  She walks over to the table and starts putting her things away with you resting in her hand, too afraid to move.  Even if you shift from side to side there is the threat that you could fall out of her grasp and have a harsh landing on the tiled floor below.  So you just nestle in for the ride as the asian behemoth cradles you as she works.  \"I'VE ALWAYS LOVED LITTLE THINGS.  DOLLS, TOY CARS, MODELS, THAT SORT OF THING.  I'VE GOT A HUGE COLLECTION OF STUFF AT HOME, JUST WAITING TO BE PLAYED WITH.\"  She holds you up to her face and licks her lips, saying with a pleased, somewhat menacing tone \"AND NOW THAT I KNOW THAT I CAN MAKE ANYTHING I WANT SMALLER, I THINK MY COLLECTION'S GOING TO BE GETTING A LOT BIGGER.\"  <br>\r\n<br>\r\nWith a quick shudder of excitement, Mai lowers her palm into her bag, tilting it so you land carefully on the ground.  There is a fair amount of light bleeding through the opening, so you can see you're surrounded by Mai's makeup kit, wallet, and phone.  She waves a finger in your face and says \"NOW DON'T GO ANYWHERE.  I'VE STILL GOT TO FILL OUT THE PAPERWORK FOR THE LAB.  BUT AS SOON AS I'M DONE I'LL TAKE YOU HOME.  TRUST ME, NOTHING BAD'S GOING TO HAPPEN TO YOU WHILE YOU'RE SUPER TINY.  I'LL TAKE SUPER GOOD CARE OF YOU.\"  She stomps out the door and you hear the door close behind her, leaving you alone in the confines of her bag.  You pace around for a minute wondering what to do.  If you stack up some of the items in her bag, there's a chance you could be able to escape from the hyperactive girl.  There's no telling what awaits you when you're only a few inches high, but you're not sure if you want to end up the pretty young lady's plaything.  On the other hand, she may be the only person who can restore you to normal size.  Even if you have to put up with a fair amount of humiliation and all the hassles that come with being Mai's shrunken man... She's the only one you know of who's ever changed a person's size.  Is it worth the risk?</span></div></div>",
            "created":1526360400,
            "id":2493478,
            "title":"Mai Wants To Keep You"
        },
        "12231":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "You stay on the desk for her to return",
                "You climb down the desk to escape"
            ],
            "content":"<div class=\"\"><div> <span>You decide it would be best to stay with this girl and follow through with the rest of her plans.  You already agreed to do the experiment for an extended period of time, so naturally it makes sense for her to bring you home, right?  You decide to stay where at least you know you won't have to worry about being trampled underfoot and wait in the girl's bag.  After a while, the door opens again, and Mai comes in, peering into the bag to affirm that you haven't left and smiles upon seeing you.  \"GOOD JOB, YOU DIDN'T TRY TO ESCAPE!  I KNOW YOU MAY FEEL A LITTLE COOPED UP IN THERE, BUT MY HOUSE IS JUST A FEW BLOCKS AWAY, SO YOU WON'T BE IN THERE FOR MUCH LONGER.  BESIDES, WE HAVE A LOT MORE FUN TO HAVE BEFORE THE EXPERIMENT ENDS.  SO HOLD ON TIGHT AND WE'LL BE OUT OF HERE BEFORE YOU KNOW IT!\"  You start to sigh a breath of relief, hearing her reafirm that she's only going to be keeping you small for the duration of the experiment.  But that relieif is temporarily jolted when Mai closes up her bag, leaving you in darkness.  With every sway of her hips and movement of the world outside, you are shaken from one side of the bag to the other.  You learn from your mistake and sit down next to her change purse, holding onto the zipper to keep yourself steady for the ride back to her home.<br>\r\n<br>\r\nAfter what seems like an eternity, she gently lifts you out of the bag and nuzzles you up against her cheek.  She’s enjoying this a lot more than you are, though you do admit that you’re starting to enjoy the care and affection she’s showing you just a little bit.  She smiles widely in your face and says “I DON’T THINK I’LL EVER GET USED TO THE FEELING OF HOLDING YOUR WITTLE BODY IN MY HANDS.  I FEEL SO GIGANTIC WHEN I DO.”  She holds her hand out in front of her and points behind you, and says “LOOK.  THERE’S THE REST OF MY LITTLE THINGS.  YOU’D FIT RIGHT IN.”  You turn around and you’re faced with a massive glass cabinet, roughly   There is a huge collection of miniatures behind glass cases.  You see an empty case on the wall and you nervously point to it, asking if that’s for you.  She laughs and says “NO, NO.  THAT’S FOR A VERY SPECIAL LITTLE TOY I’VE HAD MY EYES ON FOR YEARS.  I HAD SOMETHING ELSE IN MIND FOR YOU.”  She leans in close and says “BUT REMEMBER THAT EVEN THOUGH YOU’RE MY GUEST, YOU’RE STILL MY TEST SUBJECT.  SO REMEMBER TO DO AS I SAY, OR MAYBE I’LL PUT YOU IN THERE TEMPORARILY AS A PUNISHMENT.  SO YOU’D BETTER BEHAVE, MISTER.” <br>\r\n<br>\r\nShe lowers her hand down to her desk, and you find yourself atop a stack of papers as Mai stands up tall and puts a hand to her chin.  “I SHOULD PROBABLY FIND SOMETHING TO KEEP YOU IN.  I KNOW I HAVE A BUNCH OF SPARE CASES FOR MY COLLECTION AND CAGES FOR SOME OLD PETS… BUT I THINK YOU DESERVE SOMETHING A LITTLE MORE HOMELY.  I’M GONNA SEE IF MY SISTER STILL HAS HER OLD DOLLHOUSE.  DON’T WANDER TOO FAR, LITTLE GUY.  DON’T WANT YOU FALLING OFF THE DESK!”  She turns and skps out of the room, each thunderous step slamming hard against the ground as she leaves.  You look down at the paper you’re standing on and see a blown-up picture of you with all your information next to it.  Birthday, blood type, height and weight (well… PREVIOUS height and weight).  Next to the date on the bottom though is more information relevant to the experiment.  Your desired height of six inches (which was met), a list of possible side effects (none of which thankfully happened), and the length of the experiment.  You can see clearly from your perspective that she had written down “One Week” as her original time frame for the experiment, but that time had been crossed off and replaced with “Two Weeks”.  Was she planning on keeping you longer than you originally agreed?  You get a pit in your stomach as you start looking around the desk, wondering if maybe you should be looking to escape while you still have a chance.  You missed your opportunity back at the lab… maybe you can get one of her family members to help you out?.  <br>\r\n</span></div></div>",
            "created":1526360400,
            "id":2493585,
            "title":"Mai Takes You Home With Her"
        },
        "122312":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Kimi, Mai's Mother.  She's doing Yoga.",
                "Mina, Mai's sister.  She's watching Anime.",
                "It's the bathroom.  The noise is coming from a stereo."
            ],
            "content":"<div class=\"\"><div> <span>You decide that despite Mai's seemingly cheery exposition, you don't feel safe in her clutches.  Especially if she's going to prolong the experiment on a whim.  You look around the expanse of the desk, hoping for some sort of way out.  You see that her phone is plugged intot he wall at the edge of the desk, with the cable reaching down into the wall below.  You feel as though you could be strong enough to climb down, and looking around the room, there isn't really much else of an option for you.  You throw caution to the wind and jump at the cable, grabbing on with both arms and your legs for good measure.  You find it surprisingly easy to latch on, and slide down safely inch by inch.  Luckily, the cord is a bit long, so you're able to ride it all the way down.  And it shouldn't be much of a surprise that your body is so small and light, you don't budge the phone on the desk in the slightest.  You collect your bearings and go straight for the door, taking in the sight of Mai's oversized bed and furniture as you pass by it.  It's truly a remarkable sight, and if you weren't in such desperate need to escape, you'd really want to take it all in for a few more minutes.  You make it to the door, thankful that Mai hasn't returned yet.  You are in no condition to actually reach the doorknob, but luckily there is another way out.  Dropping to your stomach, your body is just small enough to slide underneath the door with relative ease.  You crawl on your hands and knees under the door, into the open world outside.  You walk to the middle of the hallway taking note of your options.  There is a staircase down the hall that you are in no position to climb down just yet.  There are three rooms fairly close to each other.  You suspect at least one of them must be occupied, but you hear noise coming from all of them.  Mai's mother or sister may be behind one of them.<br>\r\n<br>\r\n<br>\r\nYour train of thought is interrupted by the sound of giant feet climbing the staircase.  Not wanting to be caught, you run quickly to the nearest door and dive underneath it, crawling quickly not to be seen as the huge figure approaches.  Taking a peak outside at the booming footsteps, you see Mai coming back into her room, a huge smile on her face, and underneath her arm she's holding a fairly large pink dollhouse.  You also see in her other hand a small rubber piece of lining.  It's a door blocker.  She had been looking to trap you in her room with no means of escaping!  Looks like you made the right decision.  You quickly shuffle under the rest of the door, popping out the other side with relative ease.  Brushing yourself off, you hear the blasting volume of of something in the distance, and that's when you see who's room this is:</span></div></div>",
            "created":1526533200,
            "id":2494441,
            "title":"Escaping Mai's Room"
        },
        "12232":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Shiny Red Pumps... It's the receptionist from before!",
                "Familiar Black Sandals... It's Mai!"
            ],
            "content":"<div class=\"\"><div> <span>Something about the look in Mai’s eyes makes you a little too uncomfortable to stand, and you decide to hedge your bets and climb out of her bag.  It’s surprisingly easy to do as the miniature grooves and stitching of the fabric give you more than enough opportunity to grab onto and lift yourself up.  Not to mention the act of climbing seems relatively simple as compared to when you were normal size.  You think for a second it may be because you’re lifting significantly less weight than when you wer full size, but then again your muscles are the same size so wouldn’t it be just as difficult in theory?  You don’t think about it too long because you’ve already reached the top of her bag and scaled down the side, onto the cold tile of the floor below.  It’s a good thing she left her bag on the ground, otherwise you would have had a real pain climbing down the side of the stainless steel counter.  <br>\r\n<br>\r\nYou look to the door and see that she’s left it slightly ajar.  She didn’t close it the whole way!  If you can make it to the outside of this room, you may be able to escape the laboratory with your life intact.  Or if you feel up to it, maybe you could get help from another person outside!  You scramble across the floor and make it just to the door’s opening, when all of a sudden it swings wildly from it’s stalled position.  You are frozen in fear, and barely have the will to move as a massive foot slams down beside you.  You were so close to an exit, but now you have to contend with the giant who just stepped in!  But that’s when you realize what shoe the giantess was wearing...<br>\r\n</span></div></div>",
            "created":1528002000,
            "id":2502649,
            "title":"Escaping from the Bag"
        },
        "122322":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She's holding string - She's going to tie you up!",
                "She's holding a candy container - She's going to trap you inside!"
            ],
            "content":"<div class=\"\"><div> <span>You stand there still, trying not to make any noise, but as if she can feel your presence, Mai immediately looks down and sees your little body next to her foot.  She gets a look of sad disappointment on her face, and crouches down next to you saying “I SEE YOU’RE GOING TO BE A BIT PROBLEMATIC.   COME HERE.”  She reaches out and grabs you in a fist, a little rougher than she had before.  A little more careless.  Just your little head is poking out of the top of her clenched hand, unable to move while she holds you.  You can tell that she is not happy in the slightest, and now you're being lifted off the ground, trapped helplessly in her grasp and at her mercy.  <br>\r\n<br>\r\nShe shakes her head back and forth in a very condescending manner and says “I THOUGHT WE UNDERSTOOD EACH OTHER.  I’LL TAKE GOOD CARE OF YOU AND MAKE SURE NOTHING HURTS YOU WHILE YOU’RE TINY.  IN EXCHANGE, YOU DO WHAT I TELL YOU LIKE A GOOD LITTLE MAN.  BUT IF YOU INSIST ON SCAMPERING AWAY AT THE FIRST CHANCE YOU GET, I’LL JUST HAVE TO MAKE IT SO THAT IT’S HARDER FOR YOU TO GET AWAY FROM ME.”  She walks over to the table and appraoches the shrink ray, tapping the side of it and messing with it’s controls.  You get nervous in her hand as she continues to work on the dial, and you notice she’s switching it to get even smaller.  You struggle against her mighty fingers, wiggling and shouting out of frustration.  She leans in her ear to hear you clearer, and you make good on your opportunity, pleading up to her not to make you any tinier and that you were sorry for what you did.  Mai looks down at you and breathes out a sigh, saying quietly “I BELIEVE YOU.  I BELIEVE YOU’RE SORRY.”  Her fingers release around you and she tilts her hand, allowing you to kneel down in her open palm.  She gives you a small brush with her fingertip, almost as if she was trying to sooth a small pet.  You feel a small moment of relief, grateful that she’s not going to do anything drastic.  But then she points the barrel of the gun at your little body and says “BUT I DON’T BELIEVE YOU WON’T TRY TO ESCAPE AGAIN.”  <br>\r\n<br>\r\nIn a flash, the girl’s palm extends outwards, and you find yourself much smaller than before.  Almost 10 times smaller it feels like.  By your rough estimates, judging by the size of her face beaming down at you with a cocky smirk, you’ve been shrunk down to about half an inch tall.  She straightens her glasses and looks down at you, whispering “NOW THEN.  YOU WON'T FIT IN A REGULAR CAGE WHILE YOU'RE SO SMALL.  SO LET'S SEE IF WE CAN FIND ANOTHER WAY TO KEEP YOU CLOSE TO ME.”  She reaches into a drawer and pulls out something to hold you with.   She holds it up in front of you, and you dread what's coming next...</span></div></div>",
            "created":1528952400,
            "id":2507078,
            "title":"Caught and Shrunk Again"
        },
        "123":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She feels you and reaches down for you",
                "She doesn't feel you, you're too small",
                "She shakes you off like a bug"
            ],
            "content":"<div class=\"\"><div> <span>Your vision goes a little fuzzy, but you are aware that your size has changed.  It's only made apparent just how small you've become when you feel a mountain move in your general direction and slam uncomfortably close.  The impact shakes you to your core and you are thrown onto your back looking up at the sky.  The ceiling seems miles away from you and the floor stretches on for miles.  More importantly though the petite asian girl who you were a good foot or so taller than just a few seconds ago was now a gigantic mythical goddess standing right beside you.  The thunderous boom just feet in front of you was her stepping ridiculously close to where you were.  \"UH OH.  I THINK I MADE HIM TOO TINY.  THE SETTING ON THIS THING WAS WAY OFF.\"  You hear the goddess rumble above you as she scans the ground for your insignificant body.  You are so small compared to her that she can't see you from all the way up there.  And you have to stop and pause to remember that \"all the way up there\" is like five feet tall.  The cute young giantess is looking around with a nervous look on her face, wiggling her toes in her thick black sandals and whispering to herself  \"I KNOW HE WAS AROUND HERE SOMEWHERE... I HOPE I DIDN'T SQUISH HIM...\"<br>\r\n<br>\r\nYou are stunned by how close you came to being crushed by the careless college girl.  Luckily she may have given you an opportunity by moving so close, as you see the treads of her black soled sandals are grooved and rugged, making them easy to climb.  You brace yourself for the trip ahead and using all your strength manage to scale the side of her monstrous footwear.  You are lucky that she hasn't moved, still checking the device in her hands, which gives you more than enough time to make it to the top of the sandal, directly in front of her humongous toes.  Judging from their size, you can't be more than half an inch tall - even her smallest toe is roughly twice your size.  Her booming voice thunders down to you in her normal voice, which seems much deeper and louder than anyone who looks like her should ever sound.  \"HELLO LITTLE GUY.  ARE YOU STILL HERE?  IF YOU ARE, MOVE AROUND OR SOMETHING.  MAYBE YELL?  I DON'T KNOW IF YOUR LITTLE LUNGS WILL BE VERY LOUD, BUT IT'S WORTH A SHOT.  DON'T WANNA LOSE YOU UNDER MY FEET.\"  You shout up to her, but unsurprisingly you get no response.  You realize  you're going to have to try and get her attention some other way, and decide to start by climbing her foot.  You walk carefully into the space between her big and second toes, marvelling at the somewhat sweet odor her feet are producing.  You can't help but be somewhat attracted to them, as the scent they give off mixed with the warmth of her body heat makes the situation surprisingly intimate.  You attempt to climb the big toe, managing to get a hold on her smooth skin.  You can only hope that she's not very ticklish...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1523250000,
            "id":2477199,
            "title":"A Bug Between Mai's Toes"
        },
        "1231":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"IT WON'T BE FIXABLE FOR ANOTHER FEW HOURS.\"",
                "\"IT'LL TAKE AT LEAST A FEW WEEKS.\"",
                "\"IT CAN'T BE FIXED.\""
            ],
            "content":"<div class=\"\"><div> <span>Mai gets this strange look on her face like she’s surprised and uncomfortable at the same time.  You don’t really understand what that look means until she crouches down slightly and starts to move her hand towards you.  At first you think she may be reaching for you, but she’s only got one finger extended.  She felt you, but she doesn't think you're a person... She thinks you're an itch!  You immediately drop off of her toe and run away from the massive appendage as the hand gets closer.  The finger aggressively rubs against the toe, the nail bringing up a small amount of dead skin underneath it as it viciously scrapes the skin.  You imagine you wouldn't have lasted that long if you were still clinging to the side of it.   Luckily you won't have to try something like that again, as Mai directs her attention to the itchy toe, and spots your little body on the edge of the sandal.  She holds her other hand up to her mouth in shock as if to stifle a scream and she whispers \"OH MY GOD!  OH MY GOD!  I ALMOST KILLED YOU!  I'M SOOO SORRY!  HERE, GET UP OFF THE GROUND BEFORE I STEP ON YOU OR SOMETHING!\"  She lays her palm flat on the ground directly touching the sandal, and you manage to jump over the small gap between the shoe and her skin.  It takes you a good few seconds to run to the middle of her palm, and you immediately sit down on the soft, scaly skin, waiting for her to bring you up.  The experience is extraordinary as she brings you up hundreds of stories to her waiting eyes.  Behind her thick glasses you can see a wave of relief, happiness, and guilt in each one of her expressions.  But you're a little busy being blown away by the sight of her giant face so close to you.  you can't even see the whole thing from your perspective, that's how tiny you've become.  <br>\r\n<br>\r\n“SORRY I ALMOST SMUSHED YOU WITH MY FINGER.  IT’S JUST THAT WHEN I FELT YOUR LITTLE BODY NEXT TO MY TOES, I THOUGHT YOU WERE A BUG OR AN ITCH OR SOMETHING… I’M NOT MAKING THINGS ANY BETTER AM I?”  You shake your head and she sighs saying “SORRY.  IT’S JUST… WOW, YOU’RE TINY.  I MEAN YOU WERE SUPPOSED TO BE SMALL AND ALL, BUT NOT THIS MUCH!  YOU’RE LIKE, SMALLER THAN A PEA!  AN ANT!  LOOKING AT YOU IN MY PALM LIKE THAT IT’S JUST SO… OH, I’M DOING IT AGAIN, AREN’T I?”  At this point you’re visibly frustrated with the giant girl’s involuntary taunting, and she can tell as she blushes and looks down away from you saying “SORRY, SORRY.  I’LL TRY NOT TO MAKE YOU FEEL WORSE.  LET’S TALK ABOUT GETTING YOU BACK TO NORMAL SIZE.”  The giantess moves around the room, heading back to where the shrink ray was on the desk, and you can see from your perspective in her palm a small amount of smoke rising from it’s location.  Mai sees this too and her already enormous eyes grow even wider with shock.  “NO!  NO, NO, NO!  THIS ISN’T GOOD!”  She lowers her hand down to the tabletop, and it takes you  a minute to climb off of it to make sure you don’t break your legs from the fall.  That’s how insignificant you’ve become.  Once you’re clear, Mai puts all her attention on the device, checking the smoking barrel and running all sorts of diagnostics tests on it.  You take the opportunity to walk over to some loose medical supplies on the edge of the table, marvelling at the scale of it all.  There is a pile of Q-tips on the edge of the table, and you walk right up to one of them, falling backwards into the tip.  Maybe being so small will have it's advantages, you think to yourself, as you continue to relax on what you can only describe as the world's comfiest seat.  After a few minutes, Mai scans the table looking for you again, finding you in your resting place and almost snorting with laughter.  She collects herself and leans in closer as you step off the huge ear-cleaner and she addresses you.  <br>\r\n<br>\r\n“SORRY FOR LAUGHING.  THIS IS ALL JUST SO WEIRD.  IT'S A LOT TO TAKE IN.\"  You wave your arms up and down as if to say \"You think YOU'VE got a lot to take in?\"  She recognizes the folly of her mistake and says \"RIGHT, RIGHT.  ON TO BUSINESS.  DO YOU WANT THE GOOD NEWS FIRST OR THE BAD NEWS?”  You don’t like the sound of that, and she doesn’t really wait to let you choose as she says “WELL THE GOOD NEWS IS YOU LOOKED SUPER CUTE ON THAT Q-TIP, AND I’M SURE IF WE TOOK A PICTURE OF YOU ON THERE IT WOULD GET LIKE A MILLION HITS.”  You are unamused and she bites her lip, saying “RIGHT.  SORRY.  BAD NEWS.  HERE IT IS:  THE DEVICE OVERHEATED.  SHRINKING YOU SO MUCH AT ONCE CAUSED IT TO GO A LITTLE HAYWIRE, AND IT WON’T WORK IN IT’S CURRENT STATE.”  You ask her how long it’s going to take to fix, completely forgetting that you’re way too tiny for her to hear you like this.  You can tell she’s stalling as she shrugs her shoulders.  So when she looks back down at you through the magnifier, you aggressively point to your watch.  She gets the message and says “RIGHT.  TIME.  HOW LONG WILL THAT TAKE TO FIX.  UH… THAT’S THE THING…”<br>\r\n</span></div></div>",
            "created":1525928400,
            "id":2491474,
            "title":"Almost Itched Out Of Existence "
        },
        "1232":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "It shot Mai... She's shrinking down to your size!",
                "It shot Mai... She's shrinking down to your size... AND YOU WITH HER",
                "It shot you... You're changing size yet again!"
            ],
            "content":"<div class=\"\"><div> <span>While the giant girl  has stopped walking for the moment, you take the opportunity to reach higher ground... even if that ground is just at the top of her foot.  You climb to the top of Mai’s unpainted big toe and start pounding on the nail but to no avail.  You start jumping up and down but she still doesn’t notice you.  Your weight is just that insignificant that even on her sensitive feet, you can’t cause any sensation that is noticable from her giant form.  All you can do is stand on her toe and try not to get tossed off as she repositions her foot back and forth.  <br>\r\nMai looks around the room, obviously upset that she lost you after just one use of her shrink ray.  She holds the gun up to her eyes and readjusts her glasses, obviously trying to work out what went wrong.  <br>\r\n<br>\r\n“DAMN.  I CALIBRATED THE SIZE RATIO TOO FAR.  I WANTED HIM TO BE SOMEWHERE ALONG THE LINE OF SIX INCHES.  AT THIS POINT HE’S PROBABLY ONLY ABOUT 1/12 THAT SIZE.”  It’s a little unnerving and also calming to realize that you were right about your height.  You’re only somewhere around a half an inch tall.  That doesn’t help your plight any more as your constant attempts to get Mai’s attention still fall on deaf ears.  From up above, you hear the machine whir back to life as Mai continues to tool around with the settings.  You get a bad feeling in the pit of your stomach as Mai says “PERHAPS IF I RESET THIS PARAMETER HERE… AND PULLED THE TRIGGER…”  She’s going to shoot it again?  Where is it aiming?  You don’t even have time to react before you see a bright green light shoot down around you yet again...<br>\r\n</span></div></div>",
            "created":1533787800,
            "id":2530897,
            "title":"Waiting for results on Mai's Big Toe"
        },
        "124":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She asks you to try and unshrink her right now",
                "She asks you to take her home with you",
                "She asks you to take her to see someone "
            ],
            "content":"<div class=\"\"><div> <span>The beam doesn't exactly hit you, it sails over your shoulder and reflects back immediately.  You look backwards to see what happened and see that there is a mirror directly behind you.  Putting two and two together you slowly turn back and no longer see the student.  Just a pile of her clothing lying on the floor, with a moving bulge beneath it.  The bump seems to travel through the clothes and out towards one of the sleeves of her shirt, until it's exposed to the light.  There, clear as day, stands the girl who tried to shoot you with the ray gun, only she's now no more than 5 inches tall.  She looks around the room for a second, trying to take it all in, before focusing on you directly.  She lets out a small shriek of surprise, holding her hands up to her mouth to stop herself.  She takes a few deep breaths and you hear her little voice squeak out \"Okay.  Okay.  Uh, this is bad.  This is really bad and I am really small.\"  She steps over her shirt and onto the cold linoleum of the laboratory floor, inching her way over to you.  You don't really do much, you're too shocked yourself.  She manages to wave up to you from the ground and meekly shout up \"Hey... A little help?\"<br>\r\n<br>\r\nYou slowly drop to your knees and lay your palm flat on the ground for her to climb on to.  She scampers over your fingers and centers herself in your palm, crouching down as she's lifted off the ground.  When you have her at about chest level, she raises up to her full height, finally comfortable with the ground she's standing on, and throws her arms up in frustration.  You can't help but marvel at how adorable she looks standing in your hand.  Like a little doll, perfectly proportional, only living and breathing.  You instinctively poke her with your free hand, almost to prove to yourself that this is real, and she laughs a little bit at your invasive touch.  She waves away your massive finger and says \"Stop that.  That tickles my... Oh my god!\"  In a sudden burst of realization she curls up slightly, shielding her bare breasts and crotch from your view.  \"This is so... SO embarassing.\" She blushes hard as she straightens back up, and you're amazed at how well she's handling the situation.  She doesn't seem scared or humiliated, just frustrated at not only how the experiment has played out so far, but now she's naked in front of someone who was SUPPOSED to be her test subject.<br>\r\n<br>\r\nThe little asian doll paces slowly across your palm, her miniature footsteps tickling you slightly as she moves..  When she faces away from you, you can't help but stare at her cute little bare behind.  She thinks for a second and says \"Well first thing's first, i have to get back to normal size.  Then i have to get some clothes on and try to forget that this ever happened. <br>\r\n Would you mind helping me, it's not like i can use the controls when i'm this small.\"  You look down at her clothes and see what she means:  The shrink ray she was using hasn't gotten small with her.  It's your size.</span></div></div>",
            "created":1523854800,
            "id":2480648,
            "title":"Mai is a doll!"
        },
        "1243":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"... My Professor, Miss Freeman.\"",
                "\"... My lab friend, Amy.\"",
                "\"... My mother.\""
            ],
            "content":"<div class=\"\"><div> <span>You pick up the shrink ray with your free hand, and the little girl in your palm freaks out as she squeaks up \"Be careful with that!  I don't want you shrinking too.... expecially while you're holding me!\"  You carefully pack the gun back up in the bag Mai brought it in, and lifted it up.  You ask Mai where she wants to go and she says \"Well i don't think i can do this on my own.  I'm in way over my head.  And there's only one person who i think is smart enough to help us out right now...\" </span></div></div>",
            "created":1525842000,
            "id":2490931,
            "title":"Who Does Mai Want you to Take Her to?"
        },
        "13":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "One - You shrink to half your size",
                "Two - You shrink to a foot tall",
                "Three - You shrink to 6 inches tall",
                "A handful - You shrink to microscopic size!",
                "You change your mind and spit them out."
            ],
            "content":"<div class=\"\"><div> <span>You are greeted by a tall woman, looking to be in her late thirties, wearing a stylish black work dress.  She's wearing black stilletto heels that match with her ensemble, and she seems very determined in the way she walks towards you.   She extends her hand out swiftly and states \"Hello.  You may refer to me as Mrs. Blair for the duration of the experiment.\"  You are a bit thrown off by her stern british accent, but accept her handshake and sit up straight as she opens a briefcase before you.  She adjusts her thick, brown rimmed glasses and brushes long strands of black hair away from her face as she roots through the back for a second.  \"Have you been pre-screened?\" she asks without looking up at you.  You stammer out a yes and she says \"Excellent.  We can get started right away.\"  She produces from the bag a small pill bottle and hands it to you.  She walks to the other end of the room to grab a chair and says \"Read the instructions very carefully and injest the pills accordingly.  I won't be babying you through the procedure, so I expect you'll be able to read directions without any assistance.\"<br>\r\n<br>\r\nYou read the pill bottle and it all seems straightforward, except for the part about the dosage.  You can see that it says to take it orally, but the actual dose amount has been smeared and you can't quite read out the number.  You start to speak up but she just rolls her eyes and sighs \"Are you an adult or are you not?\"  You sit there silently confused as she sits in her chair, dangling her long heels off of her foot in an effort to amuse herself.  She clicks a pen in her hand and starts to write down some notes as she said \"I trusted you to be able to follow a simple task.  Don't end this experiment before it has a chance to start due to your incompetence.\"  You say screw it, throw caution to the wind and take the pill bottle to your mouth.  Mrs. Blair's eyebrows raise slightly as she smiles and says \"There we go.  Now let's see what effect the pills will have on you...\"  <br>\r\n<br>\r\nHow many did you take?</span></div></div>",
            "created":1516683600,
            "id":2444206,
            "title":"Medicine time with Mrs. Blair"
        },
        "133":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "You climb in quickly, not wanting to upset her",
                "You hesitate and she throws you in",
                "You try to escape from her"
            ],
            "content":"<div class=\"\"><div> <span>You are speechless in front of the domineering woman’s shoes, looking up with awe as she looks down at you.  Her head nods off to the side as she looks down at you, and the air gets tense as you can't tell whether or not she's pleased with your transformation.  Her shoes slightly raise and slam against the ground, the clack of her sole hitting the tile reverberating in your ears.  Finally your fears are quelled as she lets out a small satisfied sigh and says “AT LAST, WE HAVE A PROPER FORMULA.  THE LABORATORY FINALLY DID SOMETHING RIGHT FOR A CHANGE.”  She reaches down and lifts you off the ground swiftly, her fingers not really taking much care as she grabs you.  She grips tightly around your waist, leaving the top half of your body exposed.  With her other hand, she takes your arm and lightly squeezes it, as if testing to see if anything on you is broken.  She's not incredibly careful with your little body, and you fear that she is going to accidentally tear your arm right out of it's socket.  She fixes her glasses, saying very matter-of-factly  “LIMBS SEEM FUNCTIONAL.  SPEAK FOR ME?”  You try and stammer out a sentence but she just shakes her head, visibly irritated and says “LOOKS LIKE DIRECT COMMUNICATION WILL BE IMPOSSIBLE, YOUR VOICE IS RATHER SQUEAKY AND ANNOYING.  SO FROM NOW ON NO TALKING, ONLY LISTENING, UNDERSTOOD?”  You say yes in response and she rolls her eyes, and squeezes her hand slightly, sending a shockwave of pain through your lower back and legs.  You struggle vainly against her huge powerful fingers, when she leans in closer and coldly whispers “I SAID… NO TALKING.  UNDERSTOOD?”  You nod up and down, not wanting to anger her further and she smiles a devilish grin and says “GOOD.  THEN WE CAN CONTINUE.”  <br>\r\n<br>\r\n<br>\r\nShe places you on the metal table in front of her and reaches underneath with both hands, accidentlly exposing her bountiful cleavage right in front of you.  You look for a split second but turn away quickly, trying hard not to anger the giant woman in any way.  She lets out a low chuckle behind you and says \"I SAW THAT.  IT'S GOOD TO KNOW YOU AREN'T A TOTAL PERVERT AFTER ALL.\"  You are almost two embarrased to turn around, but a loud clanging sound shifts your attention back to the other side of the table.  She has placed onto the table next to you a large silver cage.  Well... at least to your perspective it seems large enough.  To a normal person it would be the type of thing you'd carry a hamster or a guinea pig in.  She unlocks the cage door, causing it to swing open in front of you, and then she raises her eyebrows expectedly.  You point to the cage fearing that she's going to be treating you like some sort of rodent for the rest of the experiment, and your worst thoughts are all but confirmed when she says in a visibly annoyed manner \"WELL, COME ON THEN.  WE HAVE A LOT TO DO TODAY, SO STOP MUCKING ABOUT AND GET IN.\"  </span></div></div>",
            "created":1526533200,
            "id":2494504,
            "title":"The Proper Size For Her"
        },
        "134":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She lays her finger down for you to climb onto",
                "She brings her hand down fast to squash you!",
                "You don't let her get  you - Jump!"
            ],
            "content":"<div class=\"\"><div> <span>Almost immediately after you swallow the pills, they start to take effect.  First a tingling sensation surges through your limbs, followed by <br>\r\n a slight chill.  Then, you feel as if your clothing is getting heavier on you.  And the room is rising before you.  The pills she gave you are making you shrink!  You don't really panic as much as you rightfully should in this situation, thinking that if this weren't meant to happen, Ms. Blair would be having a much more surprised reaction on her face.  She doesn't seem surprised... but at the same time doesn't look pleased.  She taps a pen to her notepad and says \"This isn't right.  You're reducing at a much higher rate than originally calculated.  Just how many of those did you take?\"  You reply that you're not sure, maybe more than three.  She sighs loudly and holds the bridge of her nose with two fingers.  Clearly you've taken too much.  \"Every one of those pills was carefully calibrated to your body weight and very expensive.  Not only have you skewed my data, but now you're costing me money.  Well, at the very least we can see what happens when someone overdoses on the medication.\"<br>\r\n<br>\r\nShe continues to belittle you even more so than the pills are already doing for you.  She has now gotten off the chair and is walking up to face you, crouching down so she can look you in the eyes.  You have stepped out of your clothes which are now incredibly oversized, and you continue to pass the height of a child, becoming closer to the size of a Ken doll in a rather quick fashion.  Ms. Blair's voice is slightly deeper and louder now, clearly an indication of just how small you're becoming in her presence. \"ONCE.  JUST ONCE I'D LIKE TO SEE A MAN COME IN HERE WHO DOESN'T HAVE HIS HEAD SO FAR UP HIS OWN ASS THAT HE CAN LISTEN TO A SIMPLE INSTRUCTION.  IF YOU HAD JUST TAKEN THE DOSAGE I TOLD YOU TO, YOU'D BE FINE.  NOW, I'LL BE HONEST, I DON'T KNOW WHAT'S GOING TO HAPPEN TO YOU.  ALL I KNOW IS THAT YOU'RE GOING TO BE MUCH, MUCH SMALLER THAN YOU ARE RIGHT NOW.\"<br>\r\n<br>\r\nThe monolithic woman gets on her knees to see you even more closely,  Her nose is level with the table and her eyes are gazing down at your ever-dwindling form on the lab table.  The giantess shakes her head and says \"PATHETIC.  JUST A PATHETIC LITTLE SPECK.  AT THIS RATE YOU'LL PROBABLY NEVER STOP SHRINKING.  JUST GETTING SMALLER AND SMALLER UNTIL YOU CEASE TO EXIST ALTOGETHER.  OR MAYBE YOU'LL STOP SHRINKING AT JUST SMALL ENOUGH THAT A SPECK OF DUST WILL COME FLOATING IN THE WIND AND CRUSH YOU DO DEATH.  EITHER WAY, YOU'VE RUINED THIS EXPERIMENT FOR ME.  I HOPE YOU'RE HAPPY, YOU LITTLE FLEA.\"  You are just a fraction of an inch tall, staring up at her in awe as she lowers a massive hand towards you.  You know that whatever she has planned for you next, it won't be pretty.</span></div></div>",
            "created":1523250000,
            "id":2477200,
            "title":"You've Overdosed!"
        },
        "14":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "A very diluted strain - You'll shrink slowly for the next few days",
                "a partially diluted strain - You'll shrink every few hours",
                "an untouched strain - you'll shrink every few minutes",
                "an advanced strain - you'll shrink immediately to a pre-determined size",
                "a mutated strain - you'll only shrink under certain circumstances"
            ],
            "content":"<div class=\"\"><div> <span>The doctor walks in, and you try to make eye contact with her, but looking straight ahead your gaze only goes up to the nametag on the breast level of her jacket reading \"Charlene\".  You're admittedly not too short of a guy, but looking at her it's hard to believe that there's anybody on her level.  She was an impressively tall amazon of a woman, maybe scraping just under 6 foot 5.  She removes her jacket almost to make you feel even more insecure as she shows off her incredibly well toned arms and shoulders.  She ties her long brunette hair back into a ponytail and the way she stands and collects herself, she looks like the definition of a fitness model.  She introduces herself as Charlene, and says she's a medical student at the university.  She looks at a chart with your name on it and says \"Everything seems to be in order.  Tell me, do you have a problem with needles?\"  Before you can answer, she swings her arm swiftly into your arm and sticks a needle in.  You yelp in surprise and pain and she just shrugs.  \"Sorry.  It's just easier if it's a surprise.\"  <br>\r\n<br>\r\nShe presses down on the plunger and when the contents are empty, she removes the needle, packing it back away.  She crosses her legs and says \"Now i'll bet you're wondering just what i put in you, huh?\"  She looks very intimidating as she crosses her arms and explains \"A few years ago, a group of our researchers wandered into an abandoned temple near the bank of the Amazon river, after picking up some strange readings.  When the team came out, it was obvious that their bodies had undergone a bit of change  The plants in the area were coated in a particular strain of bacteria.  One that we've managed to store and replicate and... place inside your body.\"  She flexed her impressive muscles, indicating that she had been on the team she was talking about!  \"The women all experienced a bit of growth.  Some extra height.  Enhanced senses, and a much more... shall we say... enlarged muscle mass.\"  You started to put the pieces together in your head and asked what happened to the men.  She shifts her eyes to one side and says \"Oh they gained an increase in stamina, were all in all in better health, it's just... welll... rather than gaining height, theirs seemed to be taken away.\"  You ask how small the people eventually got and she bites her lip and says \"Well.... when all was said and done, all the males on the expedition team clocked in at around... a half an inch.\"  You begin to get incredibly uncomfortable and don't want to ask what happened to them, but Charlene, either not reading the room correctly or just blurting it out randomly said \"And they're all gone.  We either lost them in the jungle or... accidentally smooshed them on the way back.  We weren't prepared for that sort of thing.\"<br>\r\n<br>\r\nYou start to panic, wondering what you did to get yourself into this situation.   You don't want to become a bug!  Charlene holds her hands up and says \"Calm down, Calm down.  It's all under control.  That's why we're doing it in the lab here.  So that we can monitor how long it will take for you to shrink, and how to potentially reverse it.\"  You look at the floor and dejectedly ask how long everything will take and she says \"Well, it depends on the strength of the strain that was used.  The replicated formula we came up with is just as effective, and the higher concentration of the germ, the quicker your body will dwindle down.\"  You ask very logically then, exactly how much of the strain she gave you.  She looked at her notes and replied that you've been administered....</span></div></div>",
            "created":1516683600,
            "id":2444209,
            "title":"Charlene's Disease Control"
        },
        "15":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "A woman with pixie cut hair, wheeling in a large machine",
                "A Brazilian woman, holding what looked like a dog collar",
                "An Indian beauty, holding an unlabeled tube of cream",
                "A blonde woman with glasses, holding what appeared to be a gas maak?",
                "Someone completely different..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>None of those choices describe the woman who had brought you in here!  You were face to face with...</span></div></span></div>",
            "created":1516510800,
            "id":2443637,
            "title":"Someone Else..."
        },
        "151":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "It's a miniaturization device!",
                "It's a teleporter!",
                "It's a time machine!"
            ],
            "content":"<div class=\"\"><div> <span>You look to the door and see a scientist walk in playing on her phone.  She's dressed the part from the neck down, with a very short pixie haircut painted platinum blonde, and thick black-rimmed glasses.  She has sort of a tomboyish look to her, with the sleeves of her lab coat rolled up a bit, showing off her artistic tattoos.  They look pretty cool, possibly self-designed.  She gives you a nod and goes \"Hey.  Are you the guy?\"  You say you guess so and she gives a smirk, saying \"Sweet.  Gimme a second, i'll just bring it right in.\"  <br>\r\n<br>\r\nShe opens the door wide and pulls on a cart, bringing in a massive machine.  There are levers and buttons all along the outer edges of it, and the center appears to be a glass hatch of some sort.  It's large enough for a person to fit into, and you imagine that's where you're headed.  She gently lowers it down to the ground, removing the cart from the room and testing it in a few different ways.  \"Seems to be the real deal.  Glad we finally got our hands on one of these.  She presses a button and the glass hatch opens up automatically.  She motions to the inside and says \"Alright, dude.  Climb on in.\"  You don't really know what's going on, but you want to be cooperative, especially since she seems to be in total control of what's going on.  You enter the hatch and Teresa closes it behind you, telling you the machine will start in just a few moments.  You ask her what's going to happen to you and she just knowingly rolls her eyes.  \"Real funny.  Just stay within the red circle or your parts will be all scattered and we don't want that... again.\"  <br>\r\n<br>\r\nShe carelessly plays with a pen in her mouth as she enters coordinates into the side keybad and presses a large greeen button.  The machine whirs and shakes and suddenly you think back to what she just told you. <br>\r\n You ask her what she means by \"body parts scattered\" and she takes the pen out of her mouth and a look of realization crosses her eyes.  She lets out a nervous laugh and says \"Oh shit... You're not kidding... They didn't tell you what this machine is?\"  You shake your head and she lets out a chuckle and says \"Well brace yourself for this man...  \"</span></div></div>",
            "created":1516683600,
            "id":2444211,
            "title":"Teresa's Massive Machine"
        },
        "1512":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "You're still in the lab... only smaller!",
                "You're in a place you can recognize... only smaller!",
                "You're in a place you can't recognize... only smaller!"
            ],
            "content":"<div class=\"\"><div> <span>You ask what she means by teleporter and she looks at you like you're stupid.  \"You know.  Teleporter.  As in... teleports... things.  We've been trying to work on matter displacement for years and you get to take the first trip!\"  You ask where you're being teleported to, and she looks at the monitor, saying \"I'll be perfectly honest with you man... I don't know.  The readings for this are a little too complex for me to understand.  I'm just doing what i'm told.  Safe travels!\"  And without another word, seems to disappear in a bright flash of light.  You feel as if you're being pulled in all directions for a split second (although it FEELS like an eternity).  When your experience finally ends, you find yourself back on solid ground, and you can get a glimpse as to how far you've travelled...</span></div></div>",
            "created":1516683600,
            "id":2444212,
            "title":"Did she say \"Teleporter\"?"
        },
        "15121":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Cleavage!",
                "Socks!",
                "Panties!"
            ],
            "content":"<div class=\"\"><div> <span>In a flash you are no longer standing on the floor of the teleporter, but instead find yourself squashed between two soft, warm walls.  You dind it hard to move as your arms are pinned at your sides, and you have no idea where you are.  You just hope there's a way to get out of it, and you start to struggle, hoping to get at least one of your limbs free.  Your movements seem to have caused a disturbance as the walls shake in a steady rhythmic motion, and a booming sound appears all around you.  If you were being honest it was deep and disturbing.... but it sounded almost like laughter.<br>\r\n<br>\r\nA thunderous voice, almost as it were coming from the heavens itself seems to have been alerted by your presence and you hear it say \"WHAT IS MAKING SUCH A FUSS DOWN THERE... WAIT A MINUTE.... NO IT CAN'T BE...\"  You look up from your confinement and see light peeking in, and as soon as you adjust to the light, you can clearly see what looks like a massive fingertip pulling some sort of fabric away from the walls... which you can now see are the same color as Theresa's skin.  You realize that the teleporter definitely worked... but you didn't go very far.  You only made it as far as the spot where Theresa was standing, and to make matters worse, it shrunk you!  A shadow creeps over you as another set of fingers reaches in to pluck you out of your hiding spot.  And as you're lifted into the sky, you can clearly see that you had been transported into Theresa's...</span></div></div>",
            "created":1516683600,
            "id":2444214,
            "title":"That was a short trip..."
        },
        "151212":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"THAT'S KIND OF KINKY\" She says as she drops her sock on top of you",
                "\"UGH.  WEIRDO.\"  She says as she puts you on the table"
            ],
            "content":"<div class=\"\"><div> <span>You notice as Theresa lifts you out of your hiding place that the air is becoming much clearer.  There was a distinct odor from your teleported location, and don't realize exactly where you were... until you see Theresa holding her used, tattered sneaker in her free hand.  You look over to her face, which is looking at you with concern as she says \"ARE YOU ALRIGHT?\"  You nod your head up and down and Theresa breathes a sigh of relief, saying \"GOOD.  I MEAN... IF I HADN'T FELT YOU DOWN THERE WHO KNOWS WHAT MIGHT HAVE HAPPENED.  YOU COULD HAVE SUFFOCATED IN MY SOCK.\"  She gently places you on the table, holding her shoe off to the side as she goes onto her phone.  \"I HAVE TO CONTACT MY SUPERVISOR.  I DON'T THINK YOU'RE SUPPOSED TO BE THIS... SHORT.\"  She tries to cushion the blow but it doesn't work very well, as you know she meant \"Small\".  She finishes texting her boss, and props an arm up on her elbow, resting her face against her open hand as she watches you wander around on the desk.  She taps her finger impatiently as she breaks the silence by asking \"SO... HOW LONG HAVE YOU HAD A THING FOR FEET?\"<br>\r\n<br>\r\nW...what?  You wonder why she's asking you this (or how you know about it).  You don't answer, pretending not to understnad what she's talking about and hope she just drops the subject.  She raises an eyebrow and points to the machine where you first took your trip.  \"YOU SEE THAT CHAMBER THERE?  THERE'S NOT A LOT IT KNOWS WITHOUT ANY INPUT.  IT NEEDS A SPECIFIC DIRECTION IN ORDER TO WORK.  THE WAY IT GETS THAT INFORMATION IS THAT IT RELIES ON THE SUBJECT'S BRAIN PATTERNS.\"  She crosses her arms and leans in close to you, her shadow forming an intimidating darkness that shades her face as she talks.  \"SO THAT MEANS YOU WERE THINKING ABOUT MY FEET WHEN YOU WERE IN THERE.  I DON'T KNOW WHY YOU'RE SO SMALL, BUT I DO KNOW THAT'S WHY YOU ENDED UP IN MY SHOE.\"  She looks down at her feet again and then at your little body, which is now practically beat red blushing with embarassment.  She grabs her foot and leans into it, taking a sniff and scrunching her face in response to the stench.  She gives you a confused look and says \"SO KNOWING YOU WERE DOWN THERE IN MY SOCKS, PRESSED UP AGAINST MY FEET... THAT ACTUALLY TURNS YOU ON?\"  You can do nothing but shrug from your perspective, the thought of her gigantic shoe being so close to you at the moment still kind of arousing you.  Theresa notices this and looks down at your crotch, taking note of your ever expanding erection.  You hope you haven't offended her too much, and wait for her response...</span></div></div>",
            "created":1526360400,
            "id":2493644,
            "title":"Theresa Knows Your Fetish Now"
        },
        "1512122":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "I'll hide you in my purse",
                "Time to go squish squish!"
            ],
            "content":"<div class=\"\"><div> <span>Theresa looks at you with a disgusted look, \"YOU SICK LITTLE PERVERT!\" She thinks about what to do with you... After what seems like an eternity, she comes up with two options. \"OKAY, CREEP, I'LL EITHER HIDE YOU IN SOMETHING OF MINE THAT'S THOROUGHLY UNEROTIC, SO YOUR FUCKIN' LITTLE DICK DOESN'T CUM, OR I JUST CRUSH YOU NOW. THE WORLD WOULDN'T MISS A LITTLE FREAK LIKE YOU!\"<br>\r\n<br>\r\nAs you stand there, you immediately vote for the non-death option, but sadly, you probably don't get a vote.<br>\r\n<br>\r\nAfter a few minutes, she says...</span></div></div>",
            "created":1564869060,
            "id":2696685,
            "title":"\"UGH.  WEIRDO.\"  She says as she puts y..."
        },
        "15122":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Your girlfriend, Karen",
                "It's your ex girlfriend, Lori!",
                "It's your hot neighbor, Brianna!"
            ],
            "content":"<div class=\"\"><div> <span>When you get a grip on reality, you take a look around and your surroundings are... Dark.  You seem to be covered in some sort of fabric, that smells... feminine.  There is a distinct perfume stained to the cloth, that you feel as though you remember.  It takes you a good minute or so, but you manage to get the material off of you, but you are NOT ready for what lies on the outside.  You're on a carpeted floor that stretches for what seems like a mile in either direction, with oversized furniture and a massive bed in the corner.  You're in a gigantic bedroom!  And the cloth you just climbed out of... appear to be a pair of gargantuan panties.<br>\r\n<br>\r\nAfter taking a moment to collect yourself, you realize the room itself, while massive, is somewhat familiar!  There is a recognizable wallpaper on the walls and a sense that you’ve been in that room for some reason or another.  Just you know… bigger.  And you almost feel like you want to climb back into the panties just to get another smell of the perfume to help aid in your quest to find out where you are.  But you don’t get the chance, as the massive door starts to open, and a massive figure walks in.  It only takes one booming step into the door for you to realize that this room belongs to none other than...<br>\r\n</span></div></div>",
            "created":1525237200,
            "id":2487418,
            "title":"You know this giant room..."
        },
        "152":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"Shrink\"",
                "\"Grow\"",
                "\"Transform\""
            ],
            "content":"<div class=\"\"><div> <span>The woman who enters the room before you doesn't appear to look like a scientist.  She is an absolute goddess.   She stands tall, a little taller than you in fact, wearing long black stilletto boots, and a tight fitting black dress that is barely covered by a silver leather jacket.  She takes the jacket off and and rubs a hand to your cheek.  \"My name is Sophia.  You are my partner today, yes?\"  Her thick brazillian accent immediately sends shivers down your spine and you don't even respond orally, just nod up and down slowly.  She smiles and says \"Excellent.  Then we can begin right away.  Hold still, please.\"  She walks behind you and rubs her hand on your shoulder in a very sensuous, almost massage-like fashion.  It distracts you completely from what she's about to do as you look ahead calmly, allowing her to slap what feels like a thick metal brace completely around your neck.  In your shock and panic, you feel it snap shut closed, and immediately upon locking, you feel the device pulsing what feels like a steady current through your entire body.  You scream in anger \"Ah!  What was that you bi...\"  And before you can finish it, the woman points at you and shouts \"Be silent!\"  You try and scream at her, but the current continues to pulse into your vocal chords, rendering them useless.  You find it impossible to raise your voice above even the faintest whisper.  A wicked grin crosses Sophia's face and she claps her hands to herself saying \"Excellent.  It works even faster than expected.\"<br>\r\n<br>\r\n<br>\r\nYou ask with a hoarse voice slowly returning to you what the device is and she just laughs and continues pacing around you.  \"This is new invention.  Developed by scientists over past few years.  It was supposed to trick the mind into answering questions immediately, almost like lie detector.  Could be very useful in interrogation.\"  She traces a finger up the length of your chest and says \"Tell me.  This excites you, no?\"  You can not help but feel a bit excited by the control she has over you, but you'd never say that out loud to someone you just met.  That is, if this device weren't forcing your lips to say \"Absolutely.\"  Damn it, it really works!  She walks back around you and says \"However, we find the device works a little TOO well.  It doesn't just make the person wearing it tell the truth.  If they are addressed in the form of a command, it forces their body to obey the demand without any sort of hesitation.  No matter how strange.  Jump!\"  You immediately feel your feet leave the ground as your body jumps without your mind telling it to.  \"Kneel.\"  You drop to your knees in front of the already statuesque woman, making her appear a few feet taller.  She holds out a hand to you, extending her fingers and says \"Kiss.\"  You grab her hand and lay a peck upon her skin, much like a grateful slave would do to a kind and caring master.  She laughs at your subordination and says \"This is most perfect tool for submission.  Anything i ask you to do, you will do for me.  Because the device not only controls your mind.  It allows me to reshape your body into anything i desire.\"  She stands tall and points at you saying \"And to prove it to you, i command you to...\"</span></div></div>",
            "created":1516683600,
            "id":2444217,
            "title":"Submitting to Sophia"
        },
        "1521":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"A BABY.\"",
                "\"A MOUSE.\"",
                "\"A COCKROACH.\""
            ],
            "content":"<div class=\"\"><div> <span>The device around your neck seems to send an overwhelming pulse through your body, and with each impact that courses through your veins, you feel every bit of your body tighten and compress.  You drop to your hands and knees in excruciating discomfort as the collar continues to shrink you slowly and painfully.  Through the misery you look up and see Sophia looking directly into your eyes, gazing into your soul.  She looks you up and down and with an expressionless exclamation of approval, she says “This is good.  You on all fours, like a dog.  And if you are going to be my dog, it only makes sense for you to be small like one as well.”  When the process seems to stop, you realize that the collar has taken a good three feet off of your height.  You lean back on your knees and Sophia looks even more intimidating and amazon-like than before.  She notices the change too and paces around you, getting a look from all sides.  “Very impressive.  Very impressive” she says as she admires her handiwork.  Even her voice is lower and more impactful as she stands at that height.  She stands before you and crosses her arms, looking at you in deep thought before uttering “But you know what?  Not small enough.  Shrink again.”  <br>\r\n<br>\r\nYou feel the pain return as the collar pumps more energy into your dwindling body.  Sophia stands tall before you and belittles you even further by laughing and pointing at your wretched state.  Her voice goes down another octave as she insults you.  “YES, CONTINUE SHRINKING. THE SIZE OF A DOG DOES NOT SUIT YOU.  YOU MUST BE SMALLER.  MORE PATHETIC.  MORE INSIGNIFICANT COMPARED TO ME.\"  As the process continues, she uses the toe of her boot and holds it under your chin.  Lifting her leg upward, she flips your entire shrinking body onto your back and places her oversized high heel directly on your chest.  She presses down firmly and even with the device pumping signal after signal into your body, you can still feel the pain of the heel digging into your skin.  She grinds her foot back and forth, toying with you as you struggle to move the foot even a few inches.  But it is all for nothing as she has become too big, and too powerful for you to do anything about it.  You panic even more as the shoe continues to expand a long with the world around you, threatening to crush you beneath it as you get smaller and smaller.  Sophia smirks and says \"THAT'S RIGHT.  YOU BELONG UNDER MY FOOT.  BUT YOU ARE STILL NOT SMALL ENOUGH.  DO NOT STOP SHRINKING UNTIL YOU ARE THE SIZE OF…”</span></div></div>",
            "created":1525755600,
            "id":2490465,
            "title":"Shrinking for the Mistress"
        },
        "153":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Theory 1 - The shrinking is caused by nervousness",
                "Theory 2 - The shrinking is caused by certain smells",
                "Theory 3 - The shrinking is caused by arousal"
            ],
            "content":"<div class=\"\"><div> <span>Into the room steps a beautiful Indian woman who greets you with a smile.  \"Hello!  Thanks for waiting, things have been kind of hectic today.\"  She puts her things down and you take a minute to take in her beauty.  She is a very fit but curvaceous woman, with thick well toned thighs and long legs.  She is roughly the same size as you, maybe a bit smaller.  She adjusts her shirt slightly and reaches out a hand for a shake.  \"My name is Riya Sadana.  I'm a researcher down the hall from the cosmetics department.\"  You shake her hand and notice that it's a bit slippery.  She looks down and says \"Oh, i apologize.  We are testing out a new hand cream and i may have applied too much.  I'll get you a tissue or something.\"  She reaches into her back and hands you one, and you start wiping your hands.  She flashes you a nervous smile and says \"I'm not really much of a lotion person, but i just loved the way this one smells.  What do you think?\"  You bring your hand up to your nose and take a whiff, and you can't deny it, it smells fantastic.  You don't even have to say anything, she just looks at the expression you've involuntarily made and says \"Right?  So pleasant.\"  She walks to the other side of the room and fills out a form or two.  As she bends over to sign her name, you can't help but look at her perfect round ass. Her shorts are riding up slightly, almost as if she's raising them on purpose to get you to look.  And to further illustrate that this may have been a trap, she doesn't even look up from her paperwork, but she snickers slightly and says \"Like what you see?\"  <br>\r\n<br>\r\nYou immediately feel the color drain from your face and look straight ahead, which causes her to laugh just a little bit more.  You hope she doesn't hold this against you, and you can continue with the program without it being awkward.  Riya puts down the pen and explains to you \"I know they haven't told you much about the research we do here, so let me give you a quick rundown.  There is a strange compound in our fragrances that we haven't been able to alienate yet.  But it seems to have an unusual effect on certain males who fit your profile.\"  You ask what she means by unusual effects and she stand ups next to you and crosses her arms slightly, whispering \"You haven't noticed yet, have you?  I'm taller than you.\"  You look her up and down and realize that she does look a bit taller than before.  Looking down at yourself however, you know for a fact that she hasn't changed size at all.  Your shirt, your pants, everything feel just a little bit looser than before.  You're shrinking!  The lotion she had on before must have been what triggered this.  She didn't put too much of it on her hands, she was just attempting to get it onto your skin without you noticing.  Riya puts a hand on your shoulder and says \"Don't worry.  You're going to be alright, the effects are only temporary.  But while you're in the lab with me, we will be exploring a few different options and well.... that's definitely not the smallest you're going to get.\"  You take a second to collect yourself while Riya looks at a clipboard she brought in with her.  She takes a pen and makes three large circles on the piece of paper attached to the binder and hands it over to you.  \"I have come up with three different theories for why you're getting smaller.  I intend on being thorough, so tell me... which one do you think it is?\"</span></div></div>",
            "created":1516683600,
            "id":2444219,
            "title":"Cosmetics:  Courtesy of Riya"
        },
        "1533":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"Ass.\"  She says before sitting on your lap",
                "\"Feet.\" She says before taking off her shoes",
                "\"Lips.\" She says before giving you a kiss"
            ],
            "content":"<div class=\"\"><div> <span>She throws you a bit off guard by her comments and you sit a little uncomfortable in your chair.  You clearly found her attractive, you just didn't think you'd get busted like this so quickly!  Riya takes the binder from your hands and puts it over to the side, standing very seductively with a hand slowly running through her hair.  \"Don’t lie to me, you’re attracted to me, aren’t you?  You admit to her that you're a bit more nervous than you thought you'd be, and it may have crossed your mind a bit when you were experiencing your first shrinkage that she was a very attractive persont.  She bites her lip and says “I don’t think so.  I think it was something more specific.  You have a fetish, don’t you?”  <br>\r\n<br>\r\nYou didn’t want to get it out, but yes.  She did appeal to your specific fascinations.  You were HOPING you’d be a little less obvious about it, but the cat was kind of out of the bag at this point, but you just sheepishly nod and try to avoid eye contact.  She laughs and says “Look, i didn’t mean to embarass you, it’s just that if we’re going to be doing this correctly, we can’t have any secrets.  And if it helps at all… I’m kind if into the same thing.”  You feel your member start to act up, and just like that you feel as if an inch of height has been taken off.  Clearly she's on to something with this theory.  You just hope you can control yourself around someone as pretty as her, otherwise you'll be sinking into the carpet in a matter of minutes.   Riya comes up close to you and looks down at you saying \"Looks like we hit the nail on the head.  Don't worry, i'll make sure you're able to take care of whatever desires you may experience in this experiment.  After all, it's for research purposes.\"  She raises an eyebrow and says very matter-of-factly \"Besides.  It’s not like i didn’t catch you checking out my…”</span></div></div>",
            "created":1525755600,
            "id":2490392,
            "title":"The Shrinking is caused by Arousal?"
        },
        "15332":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"GIVE ME THE PERFECT MASSAGE\" - She wants you 2-3 feet tall",
                "\"FIT IN MY SHOES\" - She wants you 5-6 inches tall",
                "\"LIVE IN BETWEEN MY TOES\" - She wants you less than a millimeter tall!"
            ],
            "content":"<div class=\"\"><div> <span>Riya reaches behind her back, lifting her leg up to quickly remove her shoe.  She does the same with her other leg, not once breaking eye contact with you.  She points down at her feet and your vision snaps down to her pretty, wiggling toes.  YOu couldn't see them at all with the flats she was wearing, but her toes are naturally beautiful, with well cared for cuticles and long shapely toes.  Riya laughs at your overatentive stare and says \"So yeah.  We're going to try something a bit unorthodox for this experiment.  Since the shrinking is directly impacted by arousal, and you have a fascination for my feet, you will be very close to them for the duration of the test.\"  She takes a seat in the chair across from you and puts both of her feet in your lap.  She leans back in the chair and says \"I assume you know how to give a good foot massage?\"  You are still a bit shocked and distracted by your growing arousal, feeling your body get slightly more miniscule underneath her resting feet.  You reach out for her feet and begin to knead your thumbs into her soles.  Moving slowly from bottom to top, you love the feeling of her soft skin of her feet, admiring every wrinkle and crevice as she leans back in relaxation.  \"Oh, that feels so good.  I can't even remember the last time i've had a good massage.  We should have set this experiment up WEEKS ago.\"  You can smell a faint scent of foot odor coming from her feet and take in the pleasant aroma.  It's an intoxicating mix of the leather of her flats and a thin layer of sweat.  With every breath in, you take in some of her scent and you feel the lotion working faster as you are massaging the feet that are growing with every few seconds.  Riya leans up and notices that you're starting to struggle with her feet but aren't complaining.  You've lost another foot or so in height already, and she giggles and lowers one of her legs off of her lap, allowing you to focus on just her right foot.  You were a little relieved, you didn't know how much longer it would be before taking care of both growing feet would become a chore instead of a pleasure.  <br>\r\n<br>\r\nAfter a few minutes, Riya shoots you a playful look and says \"Do you promise to behave yourself throughout this experiment?\"  You nod up and down slowly and Riya shines a gorgeous smile saying \"Well that's good to know.  If you do what i say, i promise you'll get a lot of pleasure out of the next few phases of the test.  For example, you're quite close to my feet and you've been very respectful.  I think you've earned a kiss. <br>\r\n Right on the soft part of my sole, if you don't mind?\"  You lean in close, first taking a small sniff and savoring the odor, before leaning in close and giving a quick peck to her soles.  You are rock hard and feel the foot get larger in the space between your hands, and Riya along with it.  You focus entirely on her foot, not giving up the massage, but at the same time maneuvering the foot against your crotch, poking her sole with your erection.  You wish this feeling would never end.<br>\r\n<br>\r\nYou are snapped out of your gaze by Riya's dominant but calm voice calling your name.  You look up and see that she's reached into her coat pocket and pulled out a small bottle of thick peach colored liquid.  She dangles it above you and says \"You know what this is?  It's not necessarily an antidote, it won't grow you back to normal size.  That will happen naturally after a few hours.  But what it will do is stop the shrinking process, leaving you unable to disappear on me.  Don't want you shrinking too small and ending up a little horny speck of dust trapped in a wrinkle on my baby toe.\"  You ask her to give it to you, fearing what’ll happen if you shrink too small.  She twirls the bottle around in between her fingers, pondering her next move.  She goes to remove the cap but stops before it's actually opened, slowly panning down at you and greeting your gaze with a smile.  \"Maybe in a little bit.  In the meantime, you've probably got a lot of pent up feelings being that close to my feet.  Why don't you go ahead and stroke your cock for a bit.  I want to see how fast you'll shrink.\"<br>\r\n<br>\r\nYou are speechless and look back at her feet, then back to her face as she leans in a bit and says \"Unless you need me to give you a hand down there?  Or should i say... a toe?\"  She changes the position of her foot, so that her toes are bending to face directly at you.  She takes her big toe and delicately rubs it against your rock hard member, causing it to tremble with excitement.  You lose another few inches, feeling more aroused than you ever have in your life.  You decide to take her command to heart, beginning to pleasure yourself before her beautiful feet.  Every few strokes you shove your face into her sweaty brown skin, basking in her essence.  Riya stares at you with wonder and her voice grows deeper as you get smaller and smaller before her.  \"I'M STARTING TO LIKE THIS POWER I HAVE OVER YOU... AND JUDGING BY THE FACT THAT YOU CONTINUE TO SHRINK, I DON'T THINK YOU'RE GETTING TIRED OF IT YET, ARE YOU?\"  You continue stroking, enjoying the rush of feeling your size drop away with every tug, watching Riya become more and more of a goddess.  You are now only about half of Riya's height, struggling to budge the ever increasing weight of her bare foot.  She uncaps the bottle and teases pouring it over you, but says \"JUST A LITTLE LONGER.  KEEP JERKING OFF FOR ME.  I WANT YOU SMALL ENOUGH TO...\"</span></div></div>",
            "created":1526533200,
            "id":2494628,
            "title":"Shrinking for Riya's Feet"
        },
        "155":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "A wild-haired woman with thick glasses holding a piece of broken alien equipment",
                "A woman with long strawberry-blonde hair, carrying what looks like a model city",
                "Someone Else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were a bit startled by the fact that the woman who entered the room didn't look like your typical doctor or scientist like you were used to seeing in the building... she was:</span></div></span></div>",
            "created":1516597200,
            "id":2443867,
            "title":"A more UNUSUAL science story"
        },
        "1552":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"WELL, DON'T YOU WANT TO EXPLORE A BIT?\"",
                "\"IF I WERE YOU, I'D START RUNNING AGAIN.\"",
                "\"DON'T WORRY LITTLE GUY.  YOU WON'T BE ALONE FOR VERY LONG.\""
            ],
            "content":"<div class=\"\"><div> <span>You expect to see a scientist who’s  abit more prim and proper than normal folk, which is why you’re surprised to see a woman come in who couldn’t have been more than 25, with bright red highlights at the tips of her hair, which was seperated into pigtails.  She was wearing a lab coat so you knew she was from the lab, but beneath it was a dark designed tshirt, and spiderweb stitched leggings that went all the way down to her feet, which were covered in what seemed to be slip-on Airwalks.  She holds a hand out eagerly and says “Hey hey, i’m Alexa.  Nice to meet you.”  You shake her hand and say you’re not sure you’re in the right room.  She pulls a pair of thick black-framed glasses out of her coat pocket and puts them on, looking at your chart then back to you.  WIth a quick smile she says “Nope. You’re with me today.  We’re gonna have some fun.” <br>\r\n <br>\r\nWith a flick of a switch on the wall, Alexa activates some unseen machinery in the floor which causes it to lift up slightly and then seperate.  From underneath the floor comes a scale model of a small town.  There are miniscule buildings , roads, even cars all scaled down proportionally to a person who’d be about the height of a small doll.  “Like it?  We’ve been working on it for years.  Lots of hard work has gone into this project, and now we get to take it to the next level.”  You ask her if you’re going to be working on the model itself…. A little nervously because you’ve never really been the artsy-model building type.  She laughs and says “No, no the model isn’t what the experiment is for.  You’re here to test the app.”  App?  What is she talking about?  She whips out her phone and plays around with it for a bit before holding it up and saying “Say cheese!”  You instinctively smile at the picture as it flashes, and she continues pressing on her screen.  You see her make a motion with her hands as if she’s pinching a picture closer together, and then taps twice.  As soon as the second tap occurs, you immediately feel the world zooming around you as if you’ve been transported to another world.  The ground feels different under your feet, the air seems a bit colder, and your surroundings seem much… bigger.  You slowly pan up to see Alexa crouching down slightly and waving at you.  \"WELL AREN'T YOU JUST THE CUTEST LITTLE DOLL I'VE EVER SEEN...\"  Based on her stature you must only be a few inches tall.  She shrunk you!  <br>\r\n<br>\r\nYou go with your gut feeling of how to react to this by running in the opposite direction of Alexa.  You don’t know where you’re heading, you just know that you want to escape from whatever the giant woman has planned for you.  As you run, you see the scope of themodel beside you and realize she’s shrunk you down to fit into that city.  She’s basically turned you into a living doll for her model!  You don’t gain much ground across the carpeted floor, and feel the tremors of Alexa’s big feet trailing behind you, getting louder with every passing step.  \"WATCH OUT, LITTLE GUY.  I MIGHT STEP ON YOU IF YOU DON'T RUN FAST ENOUGH!\"  Her booming giggling voice fills the air as a shadow is cast over you and you feel your body being lifted up by two massive objects on either side.  You are zoomed up to her face as she dangles you in front of her bespectacled eyes, held tightly between her thumb and middle finger.  She laughs at your plight as you struggle and says “HEHEHE... I'M SO GLAD TO SEE THE APP WORKS.  WE'VE NEVER TRIED IT ON A LIVING CREATURE BEFORE.  COME ON, LET'S INTRODUCE YOU TO YOUR NEW TOWN.”  <br>\r\n<br>\r\nShe slowly lowers you down with her hand, depositing you gently onto one of the roads of the city.  You look around and marvel at the model and the fact that you feel just like a toy in her presence.  But there’s something that’s a bit off… Some of the model clearly looks handmade while the others seem to be much more intricate and detailed.  That’s when it hits you that the app has been used before… some of these buildings and cars aren’t toys, they’ve been shrunk down just like you!  With two booming steps, Alexa stands in the distance, towering over the city with a satisfied smile.  She looks down at you and says ...<br>\r\n</span></div></div>",
            "created":1525928400,
            "id":2491273,
            "title":"Alexa's Model City"
        },
        "1553":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "A tall woman dressed in all black, carrying a large leatherbound book",
                "A midget (although a very pretty one), carrying a small stone tablet",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The person who entered wasn't a scientist at all!  At least not on her looks alone... she looked like a...</span></div></span></div>",
            "created":1516597200,
            "id":2443868,
            "title":"NOT a scientist?"
        },
        "15533":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "A hippie girl with blue hair, holding a joint?",
                "a tan, fit MMA fighter holding a sports bottle",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about instead...</span></div></span></div>",
            "created":1516683600,
            "id":2444220,
            "title":"Someone else?"
        },
        "155331":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Shorter",
                "Smaller",
                "REALLY Small dude"
            ],
            "content":"<div class=\"\"><div> <span>The door opens and a head slowly creeps through the opening.  You can see it's a short, skinny girl with long hair dyed blue, in sort of a trendy half-shaved look.  She looks around the room and says very directy \"Are you a cop?\"  You shake your head no and she looks behind her as if she's been followed.  She says \"Do you smoke?\"  You don't really do it that often but you're no stranger to it, so you nod yes.  With a look of happy relief washing across her face, she enters the room completely and says \"Okay cool.  I managed to grab some stuff from the lab upstairs and I really want to give it a go.\".  She opens the bag and pulls out a bowl, stuffing it with some pre-seeded strands of what you can only assume is medical marijuana.  You ask her where she got that and she says \"Oh, i'm an intern from the lab on the fourth floor.  My name's Becca.\"  You introduce yourself and she lights up the bowl, taking a big puff.  She lets it go, and it seems pretty smooth, she doesn't even choke on it.  \"Oh yeah.\"  she says as she passes it to you.  \"That's awesome.\" <br>\r\n<br>\r\nYou and Becca talk for a while in the office as you smoke the rest of the supply. You find out that she's been working with the lab for a few months, and the lab she works in specializes in testing herbal cures.  This particular strand was in a case that was marked \"Inconclusive\".  She sits back, holding the bowl in her hands and says kind of offhand \"It's the weirdest thing... they said they couldn't get any date from this stuff because there were some weird results with the lab mice.  The female mice had nothing wrong with them, but the males... like... disappeared or something.\"  You don't really dwell on what she says too much, just sitting back and enjoying the high.  You are both almost busted though as a knock at the door causes a bit of panic.  \"Excuse me\" you can hear the receptionist from before call to you.  \"They need this office in 15 minutes, so hurry up whatever you're doing.\"  Becca responds \"Oh shit... Uh, We'll be done soon.  Thank you!\"  The receptionist walks away and Becca packs the bowl and what's left of the pot back in the bag.  She looks around and says \"Shit.  We need to get some of this smoke out of here.\"  She opens a vent in the room to clear out some of the smoke, and through the haze, you start to think you may have had too much.  You've got a numbness in your fingertips, and it looks almost like the room (and Becca with it) is slightly rising.    She turns back to you and doubles back in surprise.  She tries to hold back a laugh as she steps up to you, and you don't know why but she seems to be a bit more imposing than she was before.  She looks around the room and then back to you and she says \"Whoa... i think that stuff may have been laced with something.  The rest of the room is kind of fuzzy, but you look like you're getting...\"</span></div></div>",
            "created":1516683600,
            "id":2444285,
            "title":"You're not a Narc, Are you?"
        },
        "155333":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "An older looking woman holding a small storybook?",
                "An Arabian woman holding a strange looking lamp",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1516770000,
            "id":2444539,
            "title":"More magical options?"
        },
        "1553331":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"Jack and the Beanstalk\"",
                "\"Alice In Wonderland\"",
                "Another story"
            ],
            "content":"<div class=\"\"><div> <span>The door swings open and into the office steps an older looking woman who is... for lack of a better term... SMOKING.  She has shoulder length dark Red hair and a sleek black dress with matching open toed heels.  She is the definition of a MILF.  She snaps her fingers in front of your face and you go red for a split second realizing that she caught you gazing at her beauty rather than paying attention.  She says \"I SAID my name is Donna.  Very nice to meet you.\"  She holds out a hand and you timidly shake it.  She gives you a smirk and turns away from you, enjoying the discomfort she made you feel.  She sets up a camera in the corner of the room and says \"I'm sure you're wondering exactly why we've brought you in today?\"  You shrug and say that money is money and you're ready for the tests.  She raises an eyebrow and says \"Oh you think you're ready?  Let me ask you something.  What do you know about Fantazine?\" You had heard the name before on the news, you respond that it's like a drug.  A hallucinogen of some sort that's been making the rounds lately.  She says \"That's right, but there's more to it than that.  It's not just a regular trip users experience:  It's almost as if the drug takes them to a completely different world for hours on end.  And their mind creates the world around them based on external influence.  It's the latest Schedule I drug to be added to the list, and it's incredibly easy to come by.\"  She opens up her wallet and pulls out what looks like an index card covered in white circles.  \"I've even got some right here.\"  You start to get easy in your chair as she slowly walks over and places the card in your hand and says \"I want you to take a big lick out of two of the circles.  No more, no less.  Understood?\"  You nod and slowly lick the circles on the card as you were instructed.  They are odorless and tasteless and you wonder for a second if you're even doing it right, just as you see Donna go to the corner of the room and press Record on the camera.  <br>\r\n<br>\r\nThe drugs begin to have an immediate effect as Donna's voice gets slightly deeper and creates it's own echo in your head.  \"In case it's not obvious, I'm from the narcotics laboratory in town.  We're working with the police to describe to them the effects of Fantazine, and you're our first lab rat.\"  You can feel the world around you get fuzzy and the only clear image in your brain is Donna as she steadily speaks to you.  \"We're going to be doing something called an Imersion test.  The effects of the drug are supposedly strong enough that they can completely warp the reality of those who take it... but they are incredibly succeptible to their surroundings.\"  She takes a pair of reading glasses out and explains \"Basically your mind is like play doh.  And we're going to reshape it a bit for the next few hours.\"  She opens her bag and produces a  large colorful book printed with pictures on both sides.  There are images of pirates, roman gladiators, all sorts of different characters.  She puts the glasses on and says \"Listen carefully because if our tests are correct, when i start reading this story to you, you should feel yoruself entering the world of the tale itself.  Almost as if you are a main character yourself.  Doesn't that sound like fun?\"  Before you can answer she turns the page and says \"We're going to start with one of my favorites.  It's called...\"</span></div></div>",
            "created":1516770000,
            "id":2444549,
            "title":"A Drug Story"
        },
        "15533311":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She sees you. and she's angry with you",
                "She sees you, and she's excited to see you",
                "She doesn't see you, and you have a chance to escape!"
            ],
            "content":"<div class=\"\"><div> <span>Donna's voice sets the scene, and as she speaks you can feel yourself travel from out of the chair into an endless ocean of smoke and lights.<br>\r\n<br>\r\n<b>Once upon a time, in a far away land, lived a brave little man named Jack.  One day, a beanstalk sprouted out of Jack's backyard, stretching out to the heavens.  When he reached the top of the beanstalk he found a gigantic castle, with a door that seemed to be a hundred stories high!  But he snuck his way in, and found himself on a table fit for a giant!  </b><br>\r\n<br>\r\nIn the blink of an eye, you regain your footing, finding yourself on a huge wooden surface.  The ground is grainy and uneven, and you can clearly see why.  You re standing on a gigantic table, in what appears to be the gigantic castle's dining hall!  You judge for yourself that your height is relatively around three inches to scale of the people who the type of setting would accomidate.  Anyone who walks in would have to be close to 100 feet tall by your standards!  You take a look around and see a bountiful feast on all sides.  Massive slices of meat and cheese, a humongous stadium sized bowl of leafy green vegetables, and ridiculously oversized ornaments of silverware and glasses.  You walk to one of the places set and see that there are only two places set to eat.  The castle must belong to at least two people.  Nothing seems to happen for a few minutes so you spend some time comparing your own height to the enormous silverware. You can easily fit on the spoon as if it was made specifically to carry someone your size.  You try not to dwell on that for too long.  Luckily you are jolted back into the moment as the narrator returns strongly:<br>\r\n<br>\r\n<b>Jack had to pause for a quick moment, because coming through the door was none other than the giant who lived in the castle!  </b><br>\r\n<br>\r\nThe door of the castle opens and you rush behind a building-sized wine glass in order to avoid being seen.  You hear a vicious slam of the door and steady pounding movements as the giant walks into the room.  You manage to peak around the corner of the glass to take a look for yourself and your jaw drops.  \"Youve got to be kidding me\" you mutter to yourself.  It is not an ugly beast as you were fearing, but rather a beautiful and familiar older woman.  She is dressed in a form fitting violet colored dress and the slapping sound the ground makes when she moves insinuates that she is not wearing any shoes.  But other than that, she has the same Auburn hair.  Same piercing blue eyes. Same domineering, powerful expression.  Yup.  The giant is Donna.  <br>\r\n<br>\r\nYou dart from ornament to ornament on the table, trying to get a better look at her, as she walks to one side of the room and appears to be cleaning.  You think you may be able to get away from the castle (or at least away from her) if you stay quiet and leave while she's distracted.  You are almost at the edge of the table when the giant looks up out of nowhere and sniffs the air.  She continues to take large inhales and eventually faces your direction.  A look of sudden realization comes across her face and she whispers \"IMPOSSIBLE.  I HAVEN'T SMELLED THAT SMELL IN YEARS... IS SOMEONE IN MY HOUSE?\"  Oh crap.  You're in for it now.  The Giant Donna scans the floor for you and takes powerful steps that shake the ground beneath you.  With every stomp, she gets closer and closer to the table you're hiding on, and she mutters the classic phrase, with a bit of a twist.  \"FEE FI FO FUM... I SMELL A MAN SMALLER THAN MY THUMB...\"  <br>\r\nYou turn to run away from her ever increasing visage, when your surroundings get the better of you and you trip face first over a well placed giant-sized fork.  You fear that you may have just alerted the giant to your presence, and a shadow completely covers your body...  </span></div></div>",
            "created":1523163600,
            "id":2476686,
            "title":"Donna And The Beanstalk..."
        },
        "155333111":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"I'M GOING TO SQUASH YOU.\"",
                "\"I'M GOING TO EAT YOU.\"",
                "\"I'M GOING TO MAKE YOU MY SLAVE.\""
            ],
            "content":"<div class=\"\"><div> <span>The giant face of Donna lowers down to the table, completely overcasting you in it’s shadow.  Her eyes squint as she narrows her gaze upon you, studying you with a look of disgust.  She scoffs at your existance on her table and says “I KNEW IT.”  You instinctively turn and run, but the giant woman slams a fist down in front of you, blocking your path.  You fly back from the force of her hand hitting the table, and she quickly covers you with the other.  Her fingers wrap tightly around your much smaller body and you feel the force of zero-g as she quickly whisks you up to her face.  She holds you under her nose and your hair flies up with gale force as she takes a big sniff.  She twitches her nose for a second and then booms out at you “JUST AS I THOUGHT.  AN ENGLISHMAN.”  <br>\r\n<br>\r\nYou tried to correct her, but the digits around your little body just get tighter and you find it hard to breathe, let alone talk.  “SHUT UP, BUG.  YOU HAVE NO RIGHT TO SPEAK TO ME AFTER WHAT YOU LITTLE WORMS DID TO MY HUSBAND.  YOU KILLED HIM IN COLD BLOOD AFTER HE CHASED THAT NOSY LITTLE THIEF OUT OF MY HOUSE.”  She stomps across the room and takes a seat in one of the humongous chairs surrounding the table, poking your little head out from the tight grip of her fist, but keeping your arms and legs pinned against her firm fingers.  Her eyes are filled with righteous indignation as she holds you up to her eyes.  “IT’S NOT BAD ENOUGH YOU TOOK MY HUSBAND FROM ME.  BUT EVERY TIME ONE OF YOU INSECTS CLIMBS UP MY BEANSTALK, YOU STEAL FROM ME.  YOU EAT MY FOOD.  SOME OF YOU JUST WANT A PEAK AT A GIANT NAKED WOMAN, LIKE SOME PERVERTED LITTLE WORM.”  <br>\r\n<br>\r\nShe stands up tall and walks to the other end of the room, saying “WELL YOU WON’T GET A CHANCE TO RETURN TO THE REST OF THE BUGS DOWN BELOW.  BECAUSE YOU CAN’T LEAVE MY CASTLE EVER AGAIN.  I’M GOING TO DO TO YOU WHAT I DO TO ALL LITTLE FREAKS WHO SNEAK THEIR WAY INTO MY HOME…”</span></div></div>",
            "created":1526360400,
            "id":2493520,
            "title":"Angering The Giant"
        },
        "1553331111":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "In an empty shoe",
                "Underneath the crack of a nearby door",
                "Underneath a pile of dirty laundry"
            ],
            "content":"<div class=\"\"><div> <span>Squash them - You feel the giantess hover you over the edge of the table and her fingers start to loosen around you.  She shoots you a wicked grin and says “TELL YOU WHAT, SHRIMP.  I’LL GIVE YOU A CHANCE TO SAVE YOURSELF.  WE’RE GOING TO PLAY A LITTLE GAME CALLED ‘HIDE AND GO SQUISH’.  IF YOU WIN, YOU GET TO ESCAPE WITH YOUR PUNY LITTLE LIFE.  IF NOT?  WELL… I THINK YOU KNOW WHAT WILL HAPPEN NEXT.”  She opens her hand completely and you scream as you fall stories down to the ground.  You land hard beside her feet on the ground, but don’t seem to break anything.  Apparently your little frame has given you enough resistance to survive the fall.  You look up at the giantess sitting defiantly in the chair above and see that she’s covering her eyes with her hands. <br>\r\n<br>\r\n“I WON’T PEEK.  GO AHEAD AND RUN AS FAST AS YOUR TEENY LEGS CAN CARRY YOU.  IF YOU CAN MAKE IT TEN MINUTES WITHOUT GETTING CAUGHT, I’LL LET YOU GO FREE.  I’LL START COUNTING.  She counts backwards from thirty, tapping her massive foot as she does so to give you another extra sense of impending dread.  You pick yourself up and run to one end of her room as she continues her count down.  She stops halfway through and wiggles her toes against the ground saying “I CAN ALREADY FEEL YOU IN MY MIND.  YOU’RE GONNA FEEL SO GOOD UNDER MY FEET.”  You pick up the pace not wanting to be squashed under her giant step, and make it to the wall.  Against the wall are a few different choices for hiding places.  What do you choose?<br>\r\n</span></div></div>",
            "created":1531165980,
            "id":2516999,
            "title":"Hide and Squish!"
        },
        "155333112":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"THEY GIVE EXCELLENT MASSAGES\" She says as she carries you into the living room!",
                "\"THEY MAKE WONDERFUL PETS\" She says as she carries you into the kitchen!",
                "\"THEY KNOW HOW TO PLEASE A WOMAN\" She says as she carries you to the bedroom!"
            ],
            "content":"<div class=\"\"><div> <span>“OH GOODY… ANOTHER LITTLE MAN HAS SNUCK INTO MY HOME!”  There is a significant amount of excitement you gleam from her statement as a large clear dome is placed over your tiny body.  Donna has trapped you beneath an empty wine glass, forced to stay on the table before her massive, imposing form.  She lets out a loud belly laugh at your attempts to escape and lowers her face to the edge of the table to get a better look at you.  You scream for help but don’t think the walls of the glass are thin enough for your significantly smaller voice to carry through.  The giant woman extends her hand forward, with her thumb holding back her index finger, and releases onto the glass.  Her fingernail taps against the glass hard, causing you to fall back in surprise.  <br>\r\n<br>\r\nDonna tilts her head slightly and rests her face on her hands which she has placed on top of each other, palm facing down.  She is completely amused by your bewilderment and whispers “DON’T WORRY, LITTLE ONE.  I WON’T HARM YOU.  I JUST DON’T WANT YOU TO ESCAPE, THAT’S ALL.  EVERY TIME A LITTLE MAN CLIMBS MY BEANSTALK AND MAKES IT INTO MY HOUSE, THEY’RE ALWAYS SO TERRIFIED OF ME.  I MUST LOOK ABSOLUTELY MASSIVE, TO YOU, DON’T I?”  As if to illustrate her point, she takes two of her fingers and drapes them against the side of the glass.  To her scale, you’d easily fit underneath her massive hand, and  it would take no effort on her part to snuff you out.  You sit motionless, afraid to make any sudden movements in her presence.  The giant sighs and looks off into the distance in contemplation and says “IT’S BEEN AWFULLY LONELY UP HERE SINCE MY HUSBAND DIED.  ALL I HAVE ARE MY BOOKS AND MY TRINKETS, AND THE OCCASIONAL VISIT OF A SMALL LITTLE VISITOR EVERY SO OFTEN.”  She places a hand on the handle of the glass and looks at you with a very serious face, saying “IF I LIFT THIS GLASS OFF OF YOU AND YOU DON’T RUN AWAY, I SWEAR NO HARM WILL COME OF YOU.  DO WE HAVE AN AGREEMENT?.”  <br>\r\n<br>\r\nYou don’t want to know what happens if you say no, and shake your head in approval.  A quick smile flashes across the giant’s face as she says “OKAY.  JUST ONE SECOND.”  In an effortless motion, the clear prison is lifted off of you, and you are exposed on the tabletop.  You stand up and shake yourself off, as Donna leans in close to you.  She flashes you a quick smile and lays down a hand for you to climb on to.  “HOP ON.  WE’LL TAKE THIS CONVERSATION INTO THE OTHER ROOM.”  You hesitantly step onto her massive fingers, which shake a bit from Donna’s laughter.  Apparently your footsteps are tickling her skin slightly.  As you nestle into her palm and sit indian style, Donna raises off of her knees and holds you out just below her breasts.  Her footsteps are thunderous beneath you as you look up from your seated position, catching eyes with her as she looks down at you.  She smiles as she carries you into another room and says very softly “I’VE HAD A LOT OF LITTLE MEN COME UP TO SEE ME LATELY.  AND THEY’VE ALL HAD SOMETHING IN COMMON…”</span></div></div>",
            "created":1525150800,
            "id":2486884,
            "title":"A Friendly Giantess"
        },
        "1553331123":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "You head north towards her face",
                "You head south towards her lower body",
                "You decide to try and run away!"
            ],
            "content":"<div class=\"\"><div> <span>The giantess laughs at your shocked expression as she opens the door to her bedroom, revealing a massive queen sized bed surrounded by undrawn curtains, red silk sheets, and candles on every bit of furniture surrounding it.  You start to tremble with a combination of anticipation, fear, and excitement all at once as Donna lifts your body up to her face.  Closing her eyes, she pouts her lips and tilts her hand into her mouth, enveloping your body in a massive, warm kiss.  She smacks you off of her lips and licks them, her warm minty breath surrounding you as she whispers “FEE, FI, FO, FUM.  I HOPE YOU’VE GOT WHAT IT TAKES TO MAKE ME COME.”  <br>\r\n<br>\r\nWIthout wasting any time, she plops you down on the sheet and begins to undress,  She lifts her huge shirt over her head and shakes her hair free of it’s conservative bun, her long red hair now draping her naked breasts.  You are so engrossed by the sight before you, you don't really register that she's changed position and now her ass is hovering directly over you.  You immediately panic and run to a side of the bed to escape from her massive rear end falling on top of you.  She plots herself on the bed, changing the landscape before you under her incredible weight.  The bedsheets fold and contort upwards, causing you to tumble backwards towards Donna, falling head over heels until you smack into the side of her uncovered bottom.  She lets out a small hum of surprise and giggles at your plight seeing you in direct contact with her ass.She giggles and says “HMMM, GETTING A LITTLE AHEAD OF OURSELVES, AREN’T WE?  YOU DON’T GET TO TOUCH ME THERE JUST YET.”  She gently plucks you off of her rear end with a thumb and forefinger, depositing you on her pillow, you sit down, afraid to move a muscle.  She shifts her body over towards you and points a finger at you dominantly saying \"DON'T TRY AND RUN FROM ME, SMALL FRY.  OR ELSE YOU'LL END UP IN A SITUATION YOU'LL FIND IT VERY HARD TO ESCAPE FROM.  You gulp and sit down on the bouncy material of the pillow, afraid to move a muscle lest you find out what she means.  As if putting on a show for you, Donna gives you a seductive smile and slowly removed her long nylon stockings.  She was now completely naked from the waist up, with just a thin black string of lingerie covering her nether regions.  Leaning close to you, she says “LIKE WHAT YOU SEE, TINY?”  <br>\r\n<br>\r\nBefore you can answer she wraps her hand around you, adjusting her enormous body on the bed, and dropping you on a soft, fleshy surface.  Looking up at her, you can tell that she’s deposited you on her round, plush stomach.  You can feel the ground moving up and down in time with her breathing, and she's lifted herself up on her pillow slightly to get a better look at you, so the ground is slightly tilted downwards towards her panties.  She traces the area around you with a long extended finger and says \"WE CAN TAKE THIS AS FAST AS YOU WANT, LITTLE LOVER.  I DON'T IMAGINE YOU NEED IDEAS ON WHERE TO START BUT IF I COULD SUGGEST SOMETHING...\"  She takes her hands and cups her breasts with them, pulling them slightly apart.  The chest cavity exposed to you between her tits leads directly up to her face, which is leaned down and looking directly at you now, eyes lit with anticipation.  \"WHY DON'T YOU CLIMB UP HERE AND GIVE ME A KISS.  THEN WE CAN HAVE SOME REAL FUN WITH YOU.\"   You look up at her in awe, almost involuntarily walking up towards the canyon she's formed between her breasts.  You take a quick look backwards and thing that it may be a good idea to just get this whole experience over with quickly and go right for her panties.  Then again... you could always try to escape as well...</span></div></div>",
            "created":1525755600,
            "id":2490194,
            "title":"Pleasing the Giantess"
        },
        "15533311233":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She ties you to her fingertip with a piece of string",
                "She drops you inside a glass dildo",
                "She turns around and sticks you into her ass!"
            ],
            "content":"<div class=\"\"><div> <span>This is way too much for you to handle, and you decide it's better to take your chances and speed off.  You hop off of her stomach and on to the bed below, landing softly thanks to the multiple layers of sheets.  You run across the expanse of the bed as much as you can before you feel her palm slam down right on top of you.  It doesn’t crush or kill you because of the softness of the comforter, but her hand grasps you rougher than normal as she lifts you up to her face.  She's gripped you in such a way that your chest down is trapped between her soft but firm fingers as she holds you in a vice grip facing her.  The look on her face is one that affirms she’s still in control of the situation, but her attitude has changed slightly.  She’s visibly annoyed, almost looking disappointed that you chose to run away from her.  She waves a finger in your face and says “I GIVE YOU THE CHANCE TO LIVE OUT THE SEXUAL FANTASY OF EVERY LITTLE MOUSE ON THE OTHER END OF THAT BEANSTALK, AND YOU CHOOSE TO RUN FROM ME?  TISK TISK.  YOU SHOULDN’T HAVE DONE THAT.”  <br>\r\n<br>\r\nYou struggle in her grasp but can't break free from her powerful tree trunks of fingers.  She notices your attempts and you can feel her body shifting slightly as she says \"DON'T MOVE AROUND SO MUCH JUST YET.  YOU'RE GOING TO NEED TO SAVE YOUR ENERGY.\"  She uses her free hand to remove her panties, bringing them up to you and draping the cloth over your trapped body.  You can smell her strong femininity coming at you in waves from the material as she slowly runs it over the top part of your body which is sticking out from her clenched fist.  She brings it up to her own nose giving it a satisfied whiff before looking down at you with a devilish grin.  “LIKE IT OR NOT, ONE WAY OR ANOTHER YOU’RE GOING TO SATISFY ME, LITTLE ONE.  AND I THINK I KNOW JUST THE WAY YOU’RE GOING TO DO IT.”  </span></div></div>",
            "created":1525755600,
            "id":2490384,
            "title":"A Foolish Attempt to Escape"
        },
        "155333113":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Beside her foot, safely",
                "Atop her foot, in a dangerous position!"
            ],
            "content":"<div class=\"\"><div> <span>To your extreme luck, she happens to gaze just over your location as she scans the table.  Taking advantage of this, you hide behind a well placed candlestick, as she looks fruitlessly for your little form.  With a quick and unexpacted slam, she brings her right hand down upon the table a mere feet away from your location  Judging from it's size, she was correct. you're about as small as her thumb.  You can actually feel the body heat off of the massive hand come towards you in waves as her fingers steadily drum the tabletop impatiently.  \"COME ON OUT, LITTLE INTRUDER.  I KNOW YOU'RE HERE.  JUST WAIT UNTIL I GET MY HANDS ON YOUR ITTY BITTY BODY.\"  <br>\r\n<br>\r\nThe giantess cackles to herself in excitement, and you don't want to know what she has in store for you when she catches you.  You figure that waiting around on the table will do you no good, she'll find you eventually.  Your only option is to get off of it.  But you're so high up from that size, you'd need something to break your fall if you were to drop.  You manage to peak over the side of the table and see that her body is pressed right up against the side of it.  It's a risk, but if you were to jump at just the right angle, you may be able to slide off the end of her dress without her noticing.  You see the giantess lean forward across the table to lift up a teacup hoping to find you, and you take off running.  Heading right for the enormous woman, you say a quick prayer and jump right at the thick rose-colored fabric of her dress, slamming into it and sliding right down.  You drop towards the floor at breakneck speed, using the lining of the dress to navigate your fall.  You can only control it so much and you land...</span></div></div>",
            "created":1526187600,
            "id":2492892,
            "title":"Escaping Out of Sight"
        },
        "1553331131":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "It's the giantess's bedroom!",
                "It's the giantess's bathroom!",
                "It's a door that leads to the outside!"
            ],
            "content":"<div class=\"\"><div> <span>With a hard thud, you land on the wooden floor beside the massive feet of the giantess.  You are relatively unhurt, and brush yourself off, trying to regain your bearings.  You look up at the massive woman, and now it is more obvious than ever just how small you are compared to her.  She is a towering skyscraper of femininity, with the top of your head reaching just the ankle of her nearest foot.  You are only snapped back into reality when the giantess lets out a brief grunt of frustration and stomps her foot down, causing you to fall backwards.  The massive ped landed just a few feet from where  you made your landing, and you scoot back on your behind for a few steps, picking yourself up and running in the opposite direction.   <br>\r\n<br>\r\nLuckily she is so engrossed in finding you on the table, she hadn’t noticed you landing right next to her on the ground.  You bolt to the other side of the room, making your way to a massive door leading out of her dining room.  The door is closed, so you have no way of telling what’s behind it, but from across the room you can hear thunderous footsteps heading closer and closer.  “UGH.  I KNOW I SAW A LITTLE MAN ON MY TABLE.  WHEN I FIND HIM, HE’S GOING TO GET IT.  MARK MY WORDS.”  You don’t want to see what she has in store for you and squeeze your little body underneath the doorframe to the other side.  You manage to get out to the other side, and notice that it’s very dark inside the room.  There is one candle lit on the far side, and with what little illumination you have to work with, you can tell what type of room it is:  </span></div></div>",
            "created":1532982780,
            "id":2526993,
            "title":"Avoiding her sight... and her feet!"
        },
        "15533311311":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Look around the room for anything special!",
                "Get up close and personal with the sleeping giant!",
                "Head for the door!  Escape while you can!"
            ],
            "content":"<div class=\"\"><div> <span>The room is much darker than you anticipated it would be.  You never noticed because the kitchen was so well lit, but the moonlight peaking through the giant's cracked window lets you know that it's clearly night time.  You can hear the giant stomping away in the kitchen and decide to investigate what little you can see from the bedroom in such dim light.  the bedroom is simple, but liveable.  Just a small bed (well, small for a normal sized person), and a few pieces of small furniture.  Walking towards the center of the room, you notice there are bits of clothing lying on the floor.  A few socks here or there, and even a few of the giant's undergarments.  On your left there is a large closet filled with dresses and working clothes, and a small collection of boat-sized shoes.  You can even smell some of them from here, they are clearly well worn.  Standing in the middle of the room and spinning around to take everything in gives you some small idea of just how insignificant you are compared to this woman.  But you can't admire the view for long, as you hear the giant's footsteps on the opposite side of the door.  You immediately run to hide somewhere, possibly under the bed, but you trip and fall face first into a massive collection of fabric.  It doesn't take you long to realize you've managed to get yourself caught in the giantess's discarded panties!  The door swings open and in an act of desperation, you roll into the fabric and cover your body with the lace material.  The smell of the giant woman's sex is all around you, and is a bit distracting, but you remain still and don't make a sound as the giant steps all around you.  She takes off her gladiator style shoes and allows her feet to breathe, wiggling her toes as she enjoys the feeling of the wood under her soles.  The bare feet stomp towards you and stop on either side of you as the giant looks down at her dirty underwear on the floor.  \"THIS PLACE IS A MESS.  GOING TO HAVE TO CLEAN THIS STUFF UP EVENTUALLY.\"  Her body casts a shadow down upon you as she reaches down with one hand and curls her fingers around not only the panties, but your body held captive within it.  She lifts them up off the ground and brings them up to her face saying \"LAUNDRY DAY\"S TOMORROW.  GUESS I'LL THROW THIS IN THE BIN.  UNLESS...\"  You can see an outline of the giant woman's face through the fabric you've hidden yourself in, and she leans in closer, pressing her nose against the outside and giving the panties a big sniff.  She shrugs her shoulders and says \"ACTUALLY THESE ARE PROBABLY STILL GOOD.  I'LL WEAR THEM TOMORROW.\"  You're amazed you haven't been caught while being literally held in her hands, but you don't have too long to celebrate before the panty prison is released from her grip, landing softly on a countertop without even so much as a thud.  <br>\r\n<br>\r\nMaking your way out of your cloth prison, your eyes readjust to find that she's placed the crumpled up panties atop a dresser near her bed.  She is standing in front of her full length mirror, muttering to herself as she undresses.  \"LITTLE MAN.  LITTLE STUPID BUG MAN IN MY HOUSE.  I KNEW I SHOULD HAVE PUT UP MORE GUARDS OUTSIDE.  JUST THE THOUGHT OF ANOTHER PERVY LITTLE MAN SNEAKING HIS WAY INTO MY HOUSE MAKES ME SICK.\"  You look to your left and find the giant woman's makeup kit, a few small jewelry boxes, and a set of deodorants and scented oils.  You manage to find a bottle of perfume scaled at the perfect height to hide your minute body, and in an effort to remain undetected you sneak behind it.  You peak out from your hiding spot to see that she has removed all of her clothes, and is stretching and yawning in front of the mirror.  Her body is well formed with perky D-cup breasts and a large plump ass.  She's not skinny by any means, but definitely far from fat.  Just the perfect amount of curves and beauty.  She turns quickly towards your position, her long red hair whipping back to the other side of her body as she does so.  She takes five massive steps in your direction, and you freeze in fear as she reaches down towards you.  You hold your hands up and brace for impact, but the massive well-kept fingers pluck a small jar of cream next to you, and she doesn't seem to acknowledge your whereabouts.  She takes a finger and dips it into the jar, removing a small amount and placing it just under her eyes.  She continues talking to herself as she does so, whispering \"THEN AGAIN, IT HAS BEEN AGES SINCE I'VE HAD A REAL VISITOR.  MAYBE I WON'T SMUSH THE NEXT MAN WHO FINDS HIMSELF AT MY FEET.  IT'S STILL SO RUDE THOUGH... THE LEAST THE LITTLE MEN COULD DO IS ALLOW ME THE CHANCE TO MEET THEM AT THE DOOR.\"  She slams the jar down onto the countertop and sighs long and hard, turning back towards the wall to put out the candles.  As she blows them out, the moonlight continues to frame her gorgeous body and hair as she slowly makes her way onto the mattress, lays down to rest, and within a few minutes is sound asleep.  You look at her soft bellly rising slowly and falling with each breathe, and you know that she is out cold.  You even hedge your bets by shouting out to her, but your little voice only carries so far.  You let out a sigh of relief as you collect your thoughts, just as a booming familiar narration enters your head.  <br>\r\n<br>\r\n<b>\"IT APPEARS THE GIANT HAS GONE TO BED... BUT THE LITTLE MAN IS STILL WIDE AWAKE.  I WONDER WHAT HE'LL DO NOW THAT THE BIG WOMAN OF THE HOUSE IS FAST ASLEEP...\"  </b><br>\r\n<br>\r\nYou think to yourself and decide to take advantage of the situation...</span></div></div>",
            "created":1572410340,
            "id":2740101,
            "title":"Unseen in the Giant's Bedroom"
        },
        "1553331132":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "It lands behind you, allowing you to make it!",
                "It lands in front of you, blocking your path!",
                "It lands directly on top of you, squishing you!"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately you can’t angle your descent at quite the right angle and when the dress runs out of fabric, you find yourself in a freefall heading right for the giant’s bare foot.  With an unimpressive plop, you land directly on the top of Donna’s foot, your chest and face hitting the soft, giving skin of her dorsal area, rolling off almost immediately next to the massive peds.  Her toes tap the floor in succession, giving you the impression that your landing has caught her attention.  This is only made more apparent when you roll onto your back and see the massive redhead looking down at her feet with a devilish grin.  “I THOUGHT I FELT SOMETHING CRAWLING AROUND DOWN THERE.  YOU’D BETTER COME UP HERE WITH ME BEFORE YOU GET STEPPED ON, LITTLE BUG.” Her massive body crouches down as she reaches between her feet with one arm, fingers extended to pluck you off the ground.  You quickly scamper to your feet and make a b-line for the area between her legs.<br>\r\n<br>\r\nWithout looking, you can feel her hand smack firmly against the ground as she reaches down for you, and a rumbling laughter showers over you as you continue running past her legs.  “OOH, IT LOOKS LIKE THE LITTLE MAN DOESN’T WANT TO BE GRABBED BY THE BIG BAD GIANT… LOOKS LIKE SOMEONE WANTS TO BE CHASED…”  You try to ignore her taunting and you see at the edge of the room is a dresser that appears to be mounted to the wall.  It’s a long shot, but you may be able to crawl underneath it, and even with all her might she probably won’t be able to remove it from it’s place on the side of the room.  You’d be safe… relatively speaking.  But it’s hard to concentrate on your goal as you hear booming footsteps in the distance as the giantess squares herself up to look at you.  While running you take a glance over your shoulder and see her slowly raise her foot up with her hands placed defiantly on her hips.  “OH I SEE WHAT YOU’RE TRYING TO DO.  WELL I THINK I KNOW THE ONLY THING THAT’S APPROPRIATE TO SAY IN THIS INSTANCE… FEE!”  <br>\r\n<br>\r\nHer foot comes down hard on the last word, filling you with dread as you know what’s coming.  It will only take a few of her long strides to catch up to you even when you’re running at top speed.  You try to power over it and keep your eyes on your destination under the dresser, but another footstep lands closer to you with the giantess bellowing down at you “FI!”  The safe area under the dresser is definitely within your reach, however it is entirely up to Donna’s pace whether or not she catches you.  Were she walking at a normal rate, you have no doubt in your mind she’d be able to stop you… or at the very worst crush you beneath her soles.  But you can’t let that thought enter your mind.  You’re almost there.  But that’s when another footstep comes uncomfortably close, followed by Donna’s deep voice shouting joyously “FO!”  With that last step you are almost tossed off your balance as not only the foot’s thunderous stomp behind you shakes the ground, but there is also a gust of wind that accompanies it.  <br>\r\n<br>\r\nYou are so insignificant on her floor that her footstep nearby propels you forward, but also carries with it a faint odor of sweat mixed with perfume.  You don’t want to think of what it will be like being pressed underneath the unforgiving, mountainous foot of a giant woman, so you keep running.  Despite the tired feeling in your bones and the dry breaths coming from your throat, you are almost underneath the safety of the giant woman’s furniture.  And that’s when you feel a shadow cast over you, and the massive woman shouts triumphantly “FUM.”  You can feel the gigantic foot coming down towards you.  The only question is… were you fast enough?<br>\r\n</span></div></div>",
            "created":1533707520,
            "id":2530553,
            "title":"Chased by the Giant's Feet!"
        },
        "15533312":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Alice",
                "The Mad Hatter",
                "The Queen of Hearts"
            ],
            "content":"<div class=\"\"><div> <span>Donna's voice cracks the darkness and with one sentence your entire world changes:<br>\r\n<br>\r\n<b>\"Our story begins with a quick fall down a rabbit hole.\"</b><br>\r\n<br>\r\nYou immediately feel yourself falling for what seems like an eternity, watching a series of clocks, table ornaments, and playing cards whiz by.  Your fall turns into a light floating sensation as you find yourself landing on the ground without a scratch.  You look around and see a beautiful wooded area, with the strangest flowers you've ever seen.  Some of them even appear to be trying to talk to you, but you don't really want to get into a conversation with the wildlife just yet until you figure out exactly where you are.  It doesn't take long however, as the narration returns... <br>\r\n<br>\r\n<b>\"Our hero finds themselves in a very strange place, where nothing makes sense and everything is madness.  They have found themselves in the woods of Wonderland.\"</b><br>\r\n<br>\r\nBeing very familiar with the story of Alice in Wonderland, you're not sure exactly what's going to happen next, but you know a few of the rules:  Nothing makes sense in the slightest, madness reigns, and if you eat or drink anything, you won't be staying at that size for very long. <br>\r\n You start to go over a plan of action in your head, when your thoughts are interrupted by a familiar voice calling out to you saying \"Excuse me, is someone there?\"  It's not as omnipresent as the voice that appears during the narration, but you can clearly tell it's her.  Donna is not only narrating the story, it would appear that she is also playing a major role.  She takes a few more steps towards you, and you can clearly see that she is dressed as...</span></div></div>",
            "created":1523336400,
            "id":2477625,
            "title":"A Trip to Wonderland"
        },
        "155333121":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Shrinking!",
                "Growing!"
            ],
            "content":"<div class=\"\"><div> <span>Through the brush, decked in a billowy white and blue dress stands Donna.  Er…. Alice.  Her originally straight ginger hair is now a bright red stack of curls, held in blace by a long black ribbon.  She skips over towards you and gives you a quick hug.  “It’s so nice to see another person here in Wonderland.  There are quite a few unusual creatures about, have you not noticed?”  You mention that you’ve heard of Wonderland before, but she’s the first person you’ve encountered.  To be fair, you just got there.  Alice sighs a breathe of exhaustion and says “I’ve had quite the adventure today.  I’ve been as big as a house and as little as a thimble in the space of just a few moments.  It’s quite easy to change your size if your’e not too picky about what you put in your mouth here.”  She gasps in realization of something as she reaches into her pockets.  “In fact… The mushrooms that caused me to change size… i still have them!  Would you like to see them?”  <br>\r\n<br>\r\nBefore you can answer she’s already pulled them out and presented them to you.  Her excited smile disappears as she regards the both of them in her hand.  A pensive look crosses her face as she says “Hmmm… in my haste i kind of pocketed the two of them rather quickly… i don’t know which one is which.  One is supposed to make you larger, and the other is supposed to make you smaller.”  She weighs the two of them in her hand, trying to decipher which one has any distinquishing characteristics.  She shrugs and says “Well… there’s really only one way to find out.”  She puts one of the mushrooms away, and while holding the other one, breaks off a small piece between her fingers.  She begins to bring it up to her mouth but then gets a playful look across her face.  She holds the piece out to you and says “On second thought… why don’t YOU try it.  I’ve done quite enough changing of sizes for a while.”  You hesitate for a second, not sure if you want to go through with it.  In your pause, you hear the booming voice of the narration say through the trees “THE VISITOR TO WONDERLAND WOULD HAVE TO TAKE THE MUSHROOM IF HE’D LIKE THE STORY TO CONTINUE.  OTHERWISE, WE’LL HAVE TO STOP HERE FOR NOW.”  <br>\r\n<br>\r\nAlice giggles and says “You heard the lady.  Open wide!”  Before you can question how the character who is CLEARLY Donna is taking instruction from the narration who is the SAME PERSON, Alice takes the piece of mushroom and shoves it between your lips.  It slides down your throat without much chewing and has a surprisingly sweet taste to it.  You feel your insides start to shake as Alice takes a step back.  “Don’t want you to step on me if you get too large… and i don’t want to step on YOU if the opposite were to happen!”  Her giggling rumbles through your ears as the mushroom’s magic begins to take hold… You’re definitely...<br>\r\n</span></div></div>",
            "created":1531371780,
            "id":2518768,
            "title":"Meeting Alice"
        },
        "155333122":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "In her cleavage",
                "On top of a large piece of cake",
                "In Donna's teacup!"
            ],
            "content":"<div class=\"\"><div> <span>Dressed in strange, multicolored clothing and a massive hat, Donna comes in through the brush and approaches you with a smile.  She gives you a big hug and says \"You're just in time!  Come!  Come!  The party's about to begin!\"  You realize that she's playing the part of the Mad Hatter, which means you must be headed to her tea party.  Sure enough, after a few minutes of wandering through the woods, you come across an open field with a huge table, with settings set for roughly 20 or so guests.  Donna grabs you by the hand and leads you to the front of the table, shoving you into a seat and sitting down at the seat at the head, directly next to you.  You admire the colorful array of sweets and flowers decorating the table as Donna begins pouring a small cup of tea for the two of you.  She shoves it in your hands and clanks it in a toast, before taking a quick sip.  Obviously the tea is safe to drink, otherwise she wouldn't have had some, so you indulge as well, taking in the delicious taste and actually enjoying yourself.  The tea party goes about as well as expected, with the Hatter expressing some utter nonsense with every sentence, but you can't help but be engaged with the conversation.  You are so engrossed with your surroundings that you don't even notice that Donna seems to be rising a bit higher than normal.  It's only when Donna cuts herself off and looks you up and down that you begin to feel as if something is off.  <br>\r\n<br>\r\n\"Tell me... where you come from, do people tend to change size often?  Or does it just happen in occasions of fancy dress?\"  You realize she's right, you seem to be shrinking in your seat!  You look down at your empty glass and figure that it was the tea that is changing your size.  You put down the glass and feel yourself get smaller.  The Donna Hatter looks at you with a smile and says in a much deeper voice than before \"BE A SPORT AND PASS THE SUGAR, WOULD YOU?\"  You see the sugar bowl to your left and reach to grab it.  Your arms have gotten way too short to reach it however, and you find yourself leaning over the table to even budge it.  Hoisting yourself upon the table itself, you walk right up to the bowl, and are stunned to find that it's now just under your chin in height.  You put your shoulder into the side, only managing to move it a few inches (by YOUR scale) before it's height surpasses yours.  You are about to give it another go when a massive hand grasps the handle and lifts it out of your line of vision.  As it lifts out of your line of sight, Donna's voice booms overhead with a resounding \"NEVERMIND, I'VE GOT IT.\"  Looking up at the woman on the end of the table, you are shocked into silence by the sight of The Mad Hatter, now appearing upwards of 100 feet tall!  She drops a sugar cube into her tea with a resounding splash, and places the bowl back down right where you are!  You manage to dive out of the way before the humongous server slams against the table, the clanking silverware shaking in your eardrums.  Donna reaches down and effortlessly plucks your shrunken body off of the table, bringing you up to her heavily made-up visage.  She inspects you with increasing curiosity as you dangle helplessly between her thumb and forefinger.  <br>\r\n<br>\r\n\"MY, THERE'S HARDLY ANYTHING LEFT OF YOU AT ALL, IS THERE?  YOU'VE CLOSED UP LIKE A TELESCOPE AND NOW YOU'RE SMALLER THAN A MOUSE!  WHAT AN INTERESTING UNBIRTHDAY THIS HAS BECOME FOR ME!\"  Donna dangles you in front of her face as a wicked smile crosses her lips.  Her eyes dart around her placement at the table as she says \"BUT I CAN'T JUST HOLD YOU ALL DAY, MY HAND WILL GET TIRED.  SO I'LL JUST PUT YOU DOWN HERE FOR NOW...\"  Donna suddenly releases the grip she has on your leg, causing you to freefall back down to the table!  But before you can splat against the ground, your fall is broken by something soft... you've landed...</span></div></div>",
            "created":1526360400,
            "id":2493487,
            "title":"Donna The Mad Hatter"
        },
        "1553331223":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She sips you up!",
                "You manage to avoid her lips!"
            ],
            "content":"<div class=\"\"><div> <span>With a resounding splash, you end up in a hot pool of flavored water.  You resurface, spitting out some of the drink, and notice a human-sized sugar cube slowly melting away in the heat of the water.  You look up and see Donna's massive face staring down at you, a quirky smirk on her face as she taunts you.  \"I THOUGHT YOU'D HAD ENOUGH TEA, BUT NOW YOU'RE GOING TO HAVE SOME OF MINE?  I GUESS I'LL HAVE TO DRINK IT ALL BEFORE IT'S GONE.\"  The cup shakes and lifts into the sky as Donna takes a drink.  Her huge, plush lips are curved around the opening to the cup, and you struggle to swim away from her as she takes a small sip. She smacks her lips loudly and breaks the suction, causing you to float back, with waves of tea crashing at you from all sides.  She continues holding the cup in her hand, and dips a massive finger in, circling it around and trapping you in a pint-sized whirlpool.  You are truly pathetic, being shaken and stirred by the humongous redhead's index finger, unable to escape a cup of tea in her hands.  She licks the tea off of her finger and laughs at your little body bobbing out of the tea, saying \"OH, STILL SWIMMING ABOUT DOWN THERE!  JUST TRY NOT TO DRINK ANY MORE OF MY TEA.  IT DOESN'T SEEM TO BE DOING YOU ANY FAVORS IN THE HEIGHT DEPARTMENT!\" <br>\r\n You didn't even realize it, but the walls of the teacup are much farther apart than when you first fell in.  Donna's face seems even more impressively large.  The tea is still shrinking you when it gets into your mouth!  You have to try not to shrink anymore, but the situation seems hopeless.  It's hard enough to stay afloat in the tea and keep your mouth shut without the giantess holding the cup trying to make you her snack.  This day just will not end.  <br>\r\n<br>\r\nYou try desperately not to drink any more of the tea, not wanting to evaporate out of thin air, but the drink around you starts to wave and shake as the giant hatter brings the cup up to her lips.  With a wicked smile and a satisfied chuckle, she says \"MY, I CERTAINLY AM THIRSTY TODAY.  WILL NOTHING QUENCH THIS THIRST?\"  You start to panic as the entire cup tilts slightly in one direction, with Donna's waiting lips awaiting you on the way out.  She's drinking you!  She's actually going to drink you up!  You try to swim against the current, but the force of her slurping sip is just too much for you to handle.  You are pulled along with an impressive amount of the ocean you're currently swimming in, right towards Donna's mouth.  Her puckered lips form a vaccuum that you don't think you can escape from as you feel the cup empty around you, carrying you with it.</span></div></div>",
            "created":1526533200,
            "id":2494454,
            "title":"A Shrinking Drink"
        },
        "15533313":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Gulliver's Travels",
                "Charlie and the Chocolate Factory",
                "Soemthing else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The story she chose for you is...</span></div></span></div>",
            "created":1516770000,
            "id":2444551,
            "title":"A Different Story World..."
        },
        "155333131":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "You are tied to the ground... surrounded by tiny women!",
                "You are lifted high above the ground, held by a giant woman!",
                "You are found on the beach by a traveller!"
            ],
            "content":"<div class=\"\"><div> <span>Donna's voice carries through the air as a constant narration.  <br>\r\n<br>\r\n<b>\"Our story begins with a simple-minded traveller, looking for adventure and fortune, whatever form it may take.  His travels have been easygoing until one fateful day, when he finds himself caught in the midst of a terrible storm!\"</b><br>\r\n<br>\r\nYou realize that her telling of the story is going to shape the world around you, and you brace for impact as you find yourself on the deck of a ship, wind whipping past you at breakneck speed, and a harsh salty rain cascading around you.  The ship is thrown to and fro by the ragin storm around you, the likes of which you've never seen!  Men attempting to secure the sails and ropes together are thrown overboard by the jostling and rumbling of the sea.  Cargo comes flying out from secured rooms, scattering all over the deck.  And the skies thunder with a sense that this storm will never stop, and will just keep coming.  You manage to grab onto a rope connected to the main mast, and brace for impact as a massive wave approaches.  Unable to do anything but watch, you close your eyes and feel the water rush over you as the ship is torn apart by the force.  You black out for what seems like ages, until you are jostled back into reality by the sound of a familiar voice...<br>\r\n<br>\r\n<b>\"Our hero awakens much later, the feeling of sea water still rattling around in his lungs.  Little does he know, he's in a much different land than he originally expected he'd be...\"</b><br>\r\n<br>\r\nYou manage to cough the water out of your body and can barely sit up from the aches and pains you've gathered on your journey.  Tilting your head slightly, you can see that you've landed on a beach of some sort that stretches on for miles at a time.  There is no sign of the boat or any of the men on board for that matter, and you consider yourself totally stranded on this alien shore.  Then again, maybe you're not as alone as you thought, as you can clearly sense a commotion happening around you...</span></div></div>",
            "created":1523336400,
            "id":2477627,
            "title":"Beginning of Your Travels"
        },
        "155333133":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Peter Pan",
                "Thumbelina",
                "Another?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other stories she may choose to read to you are...</span></div></span></div>",
            "created":1524286800,
            "id":2482667,
            "title":"Soemthing else?"
        },
        "1553331333":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Food of the Gods",
                "Attack of the 50 Foot Woman",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps you'd prefer the story to be something a little more adult?  Something like:</span></div></span></div>",
            "created":1525064400,
            "id":2486368,
            "title":"Even more stories"
        },
        "15533313333":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "The Borrowers",
                "Incredible Shrinking Man",
                "Even more stories?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of these instead?</span></div></span></div>",
            "created":1525064400,
            "id":2486377,
            "title":"Yes, even more stories"
        },
        "155333133333":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Harry Potter",
                "Honey, I Shrunk the Kids",
                "MORE?!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If none of those stories do it for you, how about maybe exploring these universes?</span></div></span></div>",
            "created":1531112400,
            "id":2516997,
            "title":"Even more stories?"
        },
        "1553332":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "\"A miniature room, suited best for a harem.\"",
                "\"A special gas, one that hasn't hit the market yet.\"",
                "\"My home, I'm a genie after all!\"",
                "\"An unexplored parallel universe.\"",
                "\"Well, we're too scared to find that out.\" (Reader's Choice)"
            ],
            "content":"<div class=\"\"><div> <span>As you sat there, awaiting the person who was going to conduct the experiment, many thoughts ran through your head. What if this was some untested clinical trial, and you were going to get rashes on your face? What if it was a psychological experiment that would scar your memories for the rest of your life? There was no way that they'd be offering this kind of money if there wasn't a substantial need for participants, and you wondered if you were one of the few dumb enough to sign up.<br>\r\n<br>\r\nAll that faded away when you saw who was entering through the cracked door however, the beauty taking over whatever sense of dread that might be deep within. The olive haired, nearly supermodel of a woman had a light smile as she twirled her jet black hair in one hand, the other carefully holding a lamp which looked as though it belonged straight out of some old Arabian nights book. Her stroll was elegant, as though she knew that she was higher up in the world, but not as though she thought she were better than you.<br>\r\n<br>\r\n\"Hello there, they always told us that guinea pigs were cute, but you're even more than I was expecting.\" She laughed as she approached the chair next to you, creasing her jeans as she sat down and crossed her legs. She set the lamp down on the table gently, before turning her attention back to you.<br>\r\n<br>\r\n\"Hi there, nice to meet you...\" You nervously spat out, hoping that it'd be enough to retain this stranger's trust.<br>\r\n<br>\r\n\"Well let's cut out the formalities then, I'm Amira, and I'll be your guide through the trials today.\" She said, you not being able to concentrate past the tone of her voice. A faint British and Arabic accent could be heard in her voice, something that you chalked up to her probably having learned English in the UK. Her age of around thirty however left you assuming that must have been when she was young when this happened however, as only the faint traces of the accents could be heard.<br>\r\n<br>\r\n\"So I'm sure that you're wondering what we called you in for the experiment for today, and I'm here to tell you not to worry. We have this all under control, and I assure you will be in safe hands.\" For some reason you trusted her, and it went beyond the lust that you had for her attractive looks. There was something about this woman that just made you want to listen, and that you continued to do.<br>\r\n<br>\r\n\"Ok, so the basis of the experiment: This lamp.\" She held it up, waving it a little bit in front of your face. \"Inside here is </span></div></div>",
            "created":1596343740,
            "id":2879489,
            "title":"The Mysterious Lamp"
        },
        "1553333":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "A fatter woman, holding a model spaceship?",
                "an Amazonian black woman, holding a whip?",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1516770000,
            "id":2444542,
            "title":"Even more choices"
        },
        "15533331":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "She's going to put you into her body!",
                "She's going to make you even smaller!",
                "She's going to join you?!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello, thank you for volunteering!\"  You are greeted at the door by the woman running the experiment:  A larger woman with short hair and glasses.  She's got a cute smile and bright ruby lipstick, accompanying her cheery disposition as she walks to the other side of the room.  \"My name is Kourtney and i'll be running the test today.  Before we start, do you get seasick easily?\"  You respond no, and she immediately follows \"How about claustrophobic?  Sensitive to changing pressures?  Do you get easily disoriented?\"  You say you don't think so and she sighs a breathe of relief saying \"Oh thank god.  The last four volunteers weren't up to the task, and let's just say things got a little messy.\"  She reaches into her pocket and pulls out something that she lays on her palm in front of you.  It appears to be a toy spaceship, somewhere close to six inches long.  If you had to describe the shape, it was very similar to the Planet Express from Futurama, with a bright bluish-green paint job to match.  It's incredibly detailed, and you can even see a small cockpit that you could swear was just as intriquite and put together as the rest of the ship.  Kourtney seems to beam with pride as she regards you marveling at the toy in her hand.  \"Impressive, isn't it?  It's the first of it's kind.  And best of all, it's fully operational.\"  You are a bit distracted by her statements and say \"I'm sorry, what do you mean 'Operational'?\"  Kourtney cocks her head and says \"Well of course it works.  How else are you going to get around if the ship doesn't work?\"  You take a step back and are about to ask what she means by that when she points a remote-control looking device at you and flips a switch, immediately bathing you in bright green light.<br>\r\n<br>\r\nWhen you feel the light fade, you're no longer staring at the top part of Kourtney's head.  Instead you're looking at the rubber sole of her work boot, magnified hundreds of times over.  A distant giggle from above causes you to crane your head upwards, and you see that the light she shot you with was some sort of laser, and it has shrunk you down to a minuscule size.  The giant woman before you crouches down to get a better look at you, and you fall backwards in surprise, amazed that someone so big has the capabilities of moving so fast.   Her flesh jiggles as she laughs at your predicament and says \"AWW, DON'T BE SCARED OF ME, I WON'T HURT YOU.  JUST HOLD STILL, OKAY?\"  Against your basic instinct to jump away from her imposing form, you stand perfectly still and watch as the woman's chubby fingers reach down for you.  With unbelievable grace and care, you are lifted off the ground by the giantess's thumb and forefinger.  The world whips around you swiftly as you are carried into the air, deposited safely on the soft, bouncy skin of her waiting palm.  The giant lets off yet another amused giggle to herself which shakes you slightly in her hand, and she points at another area of her hand where the ship she showed off earlier is waiting for you.  It doesn't look so miniature anymore.  In fact, compared to your (estimated to be at) half-inch stature, you think you're the perfect size to fit inside.  \"GO AHEAD AND HOP IN, YOU SHOULD FIND EVERYTHING PERFECTLY PROPORTIONAL TO YOU.  AS SOON AS YOU'RE BUCKLED IN, WE CAN MOVE ON TO THE NEXT STEP\".  You manage to climb into the massive cockpit of the now normal-sized ship, and wait to see what happens.  You don't have to wait long to find out what that next step is...</span></div></div>",
            "created":1516856400,
            "id":2444827,
            "title":"A Less Than Fantastic Voyage"
        },
        "155333312":{
            "author_id":"endo12",
            "author_name":"Endo",
            "choices":[
                "\"...a little risky, I'll explore the lab for now.\"",
                "\"...perfect.\""
            ],
            "content":"<div class=\"\"><div> <span>\"PERFECT! NOW HOLD ON TIGHT.\" you hear her say. There's a weird sense of movement and you soon realise she's placing the ship on a nearby desk. You watch her step back from the ship, the shrinking device in her hand. She seems giddy with excitement. Then she points the device in your direction and another burst of green light fills your vision. When it clears, you are looking out across a strange and barren land. It doesn't take long to realise that you've been shrunk again, possibly even to a microscopic size. You get the strange and uneasy feeling you know where this is all going... That's when the gigantic face of Kourtney appears in the near distance. She seems to have her head level with the surface of the desk and you surmise she's looking for you.<br>\r\n<br>\r\n\"WONDERFUL! WITH THAT, YOU'RE FREE TO EXPLORE THE WONDERS OF THE MICROSCOPIC WORLD! BEFORE YOU BEGIN, COULD YOU PLEASE MAKE SURE TO WEAR THE PILOT'S HEADSET? IT WILL ENABLE US TO KEEP IN TOUCH AS YOU TRAVERSE THE MICROVERSE. WOULDN'T WANT TO LOSE YOU SOMEWHERE!\" she said.<br>\r\n<br>\r\nYou did as instructed and tried the headset. \"Umm... Hello? So what am I supposed to do exactly?\"<br>\r\n<br>\r\n\"AH, THAT IS ENTIRELY UP TO YOU. YOU ARE SIMPLY TO EXPLORE. EVERYTHING WITHIN THIS LABORATORY IS FAIR GAME. PERHAPS YOU'D LIKE TO SEE THE INNER WIRING OF SOME OF THE COMPLEX MACHINERY OR TAKE A SCENIC TRIP THROUGH MY DIGESTIVE SYSTEM? THE WORLD IS YOURS TO EXPLORE!\"<br>\r\n<br>\r\n\"Wait... what did you just say? Your... digestive system?\"<br>\r\n<br>\r\n\"YES. I MEAN, IT WAS JUST AN EXAMPLE BUT YOU'RE MORE THAN WELCOME TO SEE WHAT HAPPENS INSIDE MY BODY. YOU'D BE JUST ABOUT IN TIME FOR LUNCH.\" she said. On cue, her belly gurgled loudly. It was certainly loud enough for you to hear, the prolonged groaning echoing through the metallic hull of your vessel.<br>\r\n<br>\r\n\"I'm sorry... are you suggesting I go inside you?\"<br>\r\n<br>\r\n\"IT'S ONE OPTION. YOU'D BE PERFECTLY SAFE.\" she backed away from the desk, her massive belly now in view. She cradled her gargantuan gut. \"YOU'LL BE THE FIRST PERSON TO HAVE EVER GONE INSIDE THE HUMAN BODY! YOU COULD VENTURE INTO MY STOMACH RIGHT NOW AND BEAR WITNESS AS I EAT MY LUNCH! WHAT DO YOU THINK?\"<br>\r\n<br>\r\nYou took off, piloting the ship towards her massive body. You flew up near her face and remained stationary. \"I think that sounds...\"</span></div></div>",
            "created":1525150800,
            "id":2486733,
            "title":"Microscopic Mission"
        },
        "1553333122":{
            "author_id":"endo12",
            "author_name":"Endo",
            "choices":[
                "Kourtney has a big lunch",
                "Kourtney has a light lunch"
            ],
            "content":"<div class=\"\"><div> <span>\"OH, WONDERFUL! AN EXCELLENT CHOICE! WELL, IN YOU GO!\" she said, opening her mouth for you. Wasting no time, you flew inside.<br>\r\n<br>\r\n\"Okay Kourtney, I'm in your mouth...\" you said, disbelieving the situation yourself. She had closed her mouth and you found yourself floating in the vast cavern. Lights flared from your ship, enabling you to see in the moist darkness. You guessed they were automatic. Her teeth were great enamel mountains. \"This is incredible... one of your teeth is like a mountain to me...\" <br>\r\n<br>\r\nHer mouth became a sudden hive of activity as she spoke, her voice echoing all around you.<br>\r\n<br>\r\n\"WELL I DID MAKE YOU REALLY SMALL. SO HOW IS IT BEING INSIDE MY MOUTH?\"<br>\r\n<br>\r\n\"Incredible. But I think I'm ready to go deep down into your belly...\" You ventured deeper, approaching her abyssal throat. Then you flew down her gullet, whizzing down into her esophagus. \"I've just entered your esophagus.\"<br>\r\n<br>\r\n\"YOU'LL SOON BE IN MY STOMACH! I CAN'T BELIEVE IT! I ONLY HOPE MY TUMMY BEHAVES ITSELF...\"<br>\r\n<br>\r\n\"I can hear your heart beating pretty fast.\"<br>\r\n<br>\r\n\"I'M EXCITED. YOU'RE ALREADY IN MY CHEST CAVITY!\"<br>\r\n<br>\r\n\"What's more, I think I'm nearing the end...\" you say, flying through the last stretch of her esophagus and into her gigantic stomach. It was an enormous fleshy chamber that pulsed and churned. There was no food inside as Kourtney was running on empty. \"I made it... I'm in your stomach.\"<br>\r\n<br>\r\n\"GREAT! I HOPE YOU'RE COMFORTABLE, BECAUSE YOU'RE GOING TO BE IN THERE FOR A WHILE. I WONDER IF YOU'LL FOLLOW MY DIGESTIVE TRACT TO THE EXIT AND COME OUT TOMORROW DURING A BOWEL MOVEMENT? ANYWAY, I'M JUST ABOUT TO EAT LUNCH. ENJOY THE SHOW!\"<br>\r\n<br>\r\nYou did start to wonder. Given her size, was Kourtney a big eater? You began to fear that her idea of lunch might be more than that of the average woman...</span></div></div>",
            "created":1525323600,
            "id":2487805,
            "title":"\"...perfect.\""
        },
        "15533331221":{
            "author_id":"endo12",
            "author_name":"Endo",
            "choices":[
                "Give it a try",
                "Pass"
            ],
            "content":"<div class=\"\"><div> <span>You waited nervously in Kourtney's stomach. Hovering through the moist caven, you were in awe. Your silent appreciation of the strange scenery was brought to an abrupt halt when a guttural roar resounded through the Kourtney's belly. \"You... really sound hungry... mind telling me what's for lunch?\" you tried over the comms.<br>\r\n<br>\r\n\"WELL TO CELEBRATE THE OCCASSION OF A SUCCESSFUL EXPERIMENT, I DECIDED TO ORDER SOME TAKEOUT. A BURGER, LARGE FRIES, LARGE SODA AND A BUCKET OF CHICKEN. AND BOY DOES IT SMELL GOOD, I JUST HAVE TO DIG IN!\"<br>\r\n<br>\r\nBefore you could protest, Kourtney had begun to eat. You could hear the ominous sound of swallowed food approaching. Huge globs of masticated burger were deposited into the stomach as gastric juices started to meet the incoming meal. Some mashed up fries were next and then a huge deluge of coke, which caught your ship and plunged you under the surface of the growing gastric lake. Your ship bobbed to the surface of the gaseous lake and you watched in awe as Kourtney's stomach got to work.<br>\r\n<br>\r\n\"MMM! THIS IS GOOD! I CAN ALREADY FEEL IT BUBBLING INSIDE ME AND I'VE BARELY EVEN STARTED! I TOLD YOU IT'D BE AN INTERESTING SHOW! LUCKY YOU, YOU HAVE A VIP PASS! AND TO THINK, YOU'RE ONLY IN MY STOMACH! THE RIDE THROUGH MY LOWER INTESTINE IS GOING TO BE AMAZING!\"<br>\r\n<br>\r\nYou began to worry about what her idea of amazement was. A large gas bubble popped nearby and Kourtney burped.<br>\r\n<br>\r\n\"EXCUSE ME! YOU'LL BE HEARING A LOT OF THAT OVER THE COURSE OF THE TRIP, FROM BOTH ENDS AT THAT. IT'S ALL PERFECTLY NATURAL THOUGH, NOTHING TO BE EMBARASSED ABOUT!\"<br>\r\n<br>\r\nShe stopped talking to stuff herself with more food. It took about 15 minutes for her to pack away her lunch, signalling her satisfaction with a very loud belch.<br>\r\n<br>\r\n\"AAAH, DELICIOUS! THAT REALLY HIT THE SPOT! I'M RUBBING MY TUMMY BECAUSE I'M SO BLOATED! HOW'S EVERYTHING GOING IN THERE?\"<br>\r\n<br>\r\nHer stomach was completely different now. Everything had slowed to a crawl because she had eaten so much. An ocean of stomach acid was now struggling to digest mountains of fast food remains, whilst it seemed thousands of gas bubbles had formed throughout Kourtney's cavernous stomach. Occasionally they would pop and Kourtney would burp, which you found to be a fascinating process from the inside.<br>\r\n<br>\r\n\"It's all good down here. You must be full, everything is going really slowly. There's a lot of gas in here.\" you respond.<br>\r\n<br>\r\n\"THE GAS WILL CLEAR THE MORE I KEEP BURPING AND WHEN IT GOES OUT THROUGH THE OTHER END. I CAN'T WAIT TO DIGEST ALL THAT FOOD, IT'S GOING TO BE SUCH A GREAT EXPERIENCE FOR YOU! YOU KNOW... SINCE MY STOMACH IS SO BACKED UP, IT MIGHT EVEN BE SAFE FOR YOU TO LEAVE THE SHIP AND EXPLORE ON FOOT FOR A BIT... IT'S JUST A SUGGESTION, YOU DON'T HAVE TO. JUST THINK OF WHAT A ONCE IN A LIFETIME OPPORTUNITY IT WOULD BE, TO VENTURE OUT INTO THE VAST WORLD OF MY STOMACH AT MICROSCOPIC SIZE, COMPLETELY UNPROTECTED! WOULDN'T THAT BE INCREDIBLE?\"<br>\r\n<br>\r\nYou paused at her idea.</span></div></div>",
            "created":1526619600,
            "id":2494905,
            "title":"Kourtney's Big Lunch"
        },
        "155333312211":{
            "author_id":"endo12",
            "author_name":"Endo",
            "choices":[
                "You make it to the ship",
                "You get separated from the ship"
            ],
            "content":"<div class=\"\"><div> <span>You gave Kourtney's suggestion some thought and soon realised you kind of liked the idea. Landing on the mushy food surface, you agreed to try it out. \"That does sound kinda cool, I guess. I wouldn't want to miss any opportunities whilst I'm part of this experiment.\" you told her.<br>\r\n<br>\r\n\"THAT'S GREAT TO HEAR! BE SURE TO TAKE THE HEADSET WITH YOU AND MAKE SURE TO RETURN TO THE SHIP BEFORE THINGS GET STICKY. I'LL TRY NOT TO MOVE AROUND TOO MUCH.\"<br>\r\n<br>\r\n\"Okay, I'm heading out.\" You left the safety of the ship behind for the first time since becoming microscopic and ventured into the alien world of Kourtney's stomach. As soon as you opened the door, the smell hit you hard. The digesting food in Kourtney's belly stank something fierce. The noises of digestion and other bodily functions were much louder and there was an almost oppressive warmth in the air. You stepped out onto the squishy surface of the burger and chicken remnants, the topic  squelching beneath your feet. You gazed around the absolutely gigantic stomach and began to walk around.<br>\r\n<br>\r\n\"Wow... this is just incredible... I'm actually in your stomach!\"<br>\r\n<br>\r\n\"YOU'VE BEEN IN MY STOMACH FOR NEARLY AN HOUR NOW, SILLY GOOSE! BUT YES, I IMAGINE IT'S A LOT MORE VISCERAL NOW! OOH, I CAN FEEL A BURP COMING!\"<br>\r\n<br>\r\nThere was a thunderous roar as Kourtney burped.<br>\r\n<br>\r\n\"SORRY, I COULDN'T HOLD IT IN!\"<br>\r\n<br>\r\n\"That's okay, it wasn't that bad. It's kinda cool seeing you burp from the inside.\"<br>\r\n<br>\r\n\"OH, YOU LIKE THAT DO YOU? WELL, I'M HAPPY TO OBLIGE IN THAT CASE! YOU KNOW, I'M FEELING VERY BLOATED AND HAVE SO MUCH GAS IN THIS BIG TUMMY OF MINE! I'D BEEN HOLDING BACK THIS WHOLE TIME BUT IF YOU LIKE IT, I'M GONNA KEEP BURPING! I'M KIND OF GLAD YOU'RE INTO VORE AS WELL! I WAS TRYING TO GET YOU INTO MY BELLY FROM THE START, SO I'M GLAD YOU CAUGHT ON! I WAS ORIGINALLY GOING TO PUT YOU IN MY FOOD AND EAT YOU THAT WAY BUT YOU WERE WILLING TO EXPLORE MY STOMACH ANYWAY! I EVEN THOUGHT ABOUT SWALLOWING YOU WITHOUT THE SHIP! YOU NOTICED MY BELLY RIGHT AWAY THOUGH, IT IS PRETTY BIG AND ROUND! I BET YOU'RE SO GLAD TO BE IN THERE! MMM IT FEELS SO GOOD KNOWING I HAVE A MICROSCOPIC PERSON INSIDE OF MY BELLY!\"<br>\r\n<br>\r\nYou were caught off guard by her sudden remarks. Vore? What the hell was she talking about?<br>\r\n<br>\r\n\"You okay Kourtney?\"<br>\r\n<br>\r\n\"I'M FANTASTIC! OH WE'RE GOING TO HAVE SO MUCH FUN! I SHOULD LET YOU WALK AROUND ON MY BELLY WHEN YOU GET OUT! GOOD GOD, JUST THE THOUGHT OF IT IS MAKING ME EXCITED! OOH, I'M GONNA BURP AGAIN!\"<br>\r\n<br>\r\nThe stromach trembled as she burped again. <br>\r\n<br>\r\n\"OH YEAH! THAT FEELS GOOD! YOU ENJOYING YOURSELF IN THERE? I'M LOVING THIS! I CAN'T WAIT TO POOP YOU OUT TOMORROW! OH, I CAN'T TAKE THIS ANY MORE!\"<br>\r\n<br>\r\n\"Whoa, go easy Kourtney! Wh t the hell is going on out there?\"<br>\r\n<br>\r\nThe stomach suddenly shifts all around you and you get the feeling something bad is about to happen. Kourtney has stood up and is on the move! You struggle in the shifting environment to get back to your ship, all the while Kourtney's burps continue to explode around you...</span></div></div>",
            "created":1526878800,
            "id":2496708,
            "title":"Expedition in the Stomach"
        },
        "1553333122112":{
            "author_id":"endo12",
            "author_name":"Endo",
            "choices":[
                "She goes straight to bed",
                "She decides to have some fun"
            ],
            "content":"<div class=\"\"><div> <span>You saw the ship a few metres away and watched in horror as it sank into the mush that once supported it. With a weird gastric blorp, the ship disappeared into Kourtney's stomach juices. \"Crap! The ship! Kourtney, the ship is gone!\"<br>\r\n<br>\r\nKourtney rubbed her gut as she walked. \"IT'S FINE, THE SHIP IS STILL INSIDE ME. IT WON'T BE DIGESTED, SO IT'LL JUST COME OUT IN MY POOP. I'M HEADING HOME FOR A LITTLE MORE PRIVACY SO DON'T BE AFRAID TO EXPLORE MY BELLY. DON'T GO SWIMMING IN ANY OF MY GASTRIC JUICES THOUGH!\"<br>\r\n<br>\r\n\"Kourtney please! This is serious!\" you tried, the rumbling chaos persisting in her stomach.<br>\r\n<br>\r\n\"YOU'LL BE FINE! &gt;URP&lt; THERE'S NOTHING TO WORRY ABOUT, I'M SURE THE SHIP WILL RESURFACE BEFORE IT GETS INTO MY INTESTINES! &gt;URP&lt; OOOH THAT FEELS SO GOOD! HECK I MIGHT EVEN &gt;URP&lt; END UP BURPING YOU OUT AT THIS &gt;URP&lt; RATE!\"<br>\r\n<br>\r\nThe burps continued to explode around you, shaking everything in the woman's stuffed belly. You decided you had little control of the situation and decided to go along for now. You started to wander in her vast belly.<br>\r\n<br>\r\n\"WHEN I GET HOME, THE REAL FUN CAN BEGIN! OF COURSE I'LL NEED TO PASS YOU FIRST, WHICH MIGHT NOT HAPPEN UNTIL MORNING. YOU COULD BE IN THERE FOR SEVERAL DAYS! DON'T WORRY THOUGH, YOU WILL GET OUT EVENTUALLY! ONCE I POOP YOU OUT, I'LL RETRIEVE YOU FROM MY STOOL AND WE CAN GET RIGHT INTO SOME OTHER FUN THINGS, LIKE LETTING YOU RUN AROUND ON MY BARE BELLY OR SWIM IN MY BATHTUB! HECK, I'LL LET YOU SWIM IN A GLASS OF WATER AS I DRINK IT!\"<br>\r\n<br>\r\nYou partly dreaded her activity choices but were also slightly intrigued. She eventually got home and from there, things got even more interesting as...</span></div></div>",
            "created":1528261200,
            "id":2503742,
            "title":"Lost Innerspace"
        },
        "15533333":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Military Woman",
                "The Director",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A woman in a military uniform, she appears to be in her early thirties with a neat black, almost science fiction black bob hairstyle.<br>\r\n<br>\r\nA woman with a number of cameras, and some actresses?<br>\r\n<br>\r\nOther.</span></div></span></div>",
            "created":1526360400,
            "id":2493688,
            "title":"Someone else?"
        },
        "155333331":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "A vehicle of some sort.",
                "An IV drip.",
                "Weapons."
            ],
            "content":"<div class=\"\"><div> <span>You enter to find an impatient looking woman in a military uniform. From said uniform you gathered she was a captain, and that she was in the Army. The woman instantly takes note of you. \"Your the test subject, I asked for military credentials for the participants... Fine, fine...\"<br>\r\n<br>\r\n     \"I am Captain Hellen Dare, you will address me as Ma'am, or Captain.\" She informs you as she steps over to a large curtain, pulling it back to reveal<br>\r\n</span></div></div>",
            "created":1526360400,
            "id":2493693,
            "title":"Military Woman"
        },
        "1553333311":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Helicopter.",
                "Tank.",
                "Hovercraft."
            ],
            "content":"<div class=\"\"><div> <span>The Captain pulls the curtain back to reveal not just one object, but a room the size of a small warehouse. \"I suppose this is all the same, I need to know if it is simple enough for even the uninitiated to understand.\" In the center of this room was a </span></div></div>",
            "created":1526360400,
            "id":2493696,
            "title":"A vehicle of some sort."
        },
        "1553333312":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "shrinking!",
                "you pass out",
                "other effects"
            ],
            "content":"<div class=\"\"><div> <span>Dare pulls the curtain back to show a bare bones medical setup. There is an IV drip, an EKG, and that was it. Dare has you sit down in the chair and has clamps your left arm to the chair. \"Relax, I just don't want you to jolt and hurt yourself.\" She informs you, wiping your arm with alcohol.<br>\r\n<br>\r\n        You feel the icy sting of the needle punching right into your arm, soon that feeling begins to travel along your body.... Your body goes from cold, to hot however as something seems to be taking hold. Your heart beats like a drum as you begin to feel, and notice a major change happening to your body.... You are</span></div></div>",
            "created":1526446800,
            "id":2494003,
            "title":"The Super Soldier Serum"
        },
        "155333333":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Let's go with the freak!",
                "Let's not and say we did."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a girl brought in by a nurse who seems a bit... off?</span></div></span></div>",
            "created":1534270320,
            "id":2533619,
            "title":"Something wrong with her?"
        },
        "1553333331":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "\"People around me get hurt...\"",
                "\"My whole body starts to change...\""
            ],
            "content":"<div class=\"\"><div> <span>The door opens and a few figures stand just out of view.  The first one to come into the room with you is a blonde nurse, dressed in dark blue scrubs with her hair tied back in a bun.  She’s wearing glasses and gripping a chart, holding it up to her face.  She asks you your name and you announce it, letting her cross it off her checklist.  She looks up at you and smiles saying “Very well.  We can begin now.”  You tell her you’re nervous because you’ve never been an experiment of any kind before and she just laughs and says “Oh no, you’re mistaken.  You’re not the experiment here.  She is.”  You look back at the door and see a girl being wheeled in by two orderlies.  She is a young black girl, somewhere around 20 or 21, and she’s got long frizzy hair that looks unwashed for many days.  She’s wearing worn out gray scrubs and her hands are being held together by zip ties.  She appears to be asleep, and you can tell by the iv marks in her hand that she must be put under a lot.  The nurse checks with the orderlies for a second and asks when her last medication was taken.  They tell her sometime around midnight the previous night.  With a satisfied smirk, the nurse says “Excellent.  She should be coming out of it soon.  Then this should work right on time.”  She sets up a camera in the corner and points at you saying “Stay right there.  The experiment will begin very shortly and you are a very important part of it.”  You ask her what exactly you’ll be doing and she just shrugs and says “We’re not sure.  That’s what you’re going to find out for us.”  Just then, the girl in the chair starts to wake up from her medically induced sleep. The nurse sees this and immediately snaps for the orderly’s attention.  She points to the girl’s hands and makes a snipping motion with her fingers.  The orderly nods and goes to the girl’s chair, and using a surgical knife cuts away at the zip tie, freeing her hands.  The orderlies and the nurse immediately rush towards the door.  Before it shuts, the nurse looks at you and shoots you a thumbs up, mouthing the words  “Good luck.”  You begin to think this wasn’t worth the day’s pay.<br>\r\n<br>\r\nThe girl opens her eyes and squints in the bright lights of the office.  She looks at you and has an inquisitive look on her face.  “Who… Who are you?”  You introduce yourself and ask her name.  She responds that her name is Grace.  She looks down at the ties on her hands and says “I’m still here… i’m… still in the hospital aren’t I?”  You say that you’re in a laboratory and that they said she was part of an experiment.  The girl looks at you and says “Do… Do you work here?”  You say you guess so, you’re just here for the day.  She looks around the room and says “This room… I’ve been here before.  My nurse… she takes me here sometimes… but i don’t remember why.”  She looks down at her hands again and grunts from a headache as she notices the zip tie marks around her arms.  She looks up at you and says “Was I tied up or something?  What are these from?”  You tell her she had ties on her hands when she came in and she readjusts herself in the wheelchair.  She begins to move her legs and plants her uncovered feet firmly on the ground.  Using her hands she slowly lifts herself off of the seated position, and stands on wobbly legs.  She looks like she’s about to fall and you rush in and grab her, stopping her from slipping forward.  She smiles up at you as you reposition her into a standing form.  She regains her balance and says “Thanks for that… I almost… uh….”  A strange look crosses her face as if a million thoughts are firing at once.  She looks around quickly and starts to breathe heavier.  You get scared for her and go to comfort her in some way but she just holds a hand out towards you and her face drops as she makes eye contact with you.  “Oh god… I remember now… i remember why i’m here… you need to get out of here.”  With a worried tone you start looking at the door and ask her why.  She holds her head, trying to fight off another headache as she says “It’s hard to explain… but it’s almost like there’s another side of me… and when it comes out… <br>\r\n</span></div></div>",
            "created":1534368060,
            "id":2534147,
            "title":"Grace is the experiment.... not you!"
        },
        "1553333332":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "School's in!  ",
                "School's Out!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Gillian, an older blonde haired school teacher who's looking for a new way to keep undisciplined students in line?</span></div></span></div>",
            "created":1536612300,
            "id":2545915,
            "title":"Keep it in the Classroom"
        },
        "15533333322":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "No business like show business!",
                "Any business BUT show business!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a pair of young film interns looking for a way to test out a new special effect for an upcoming movie?</span></div></span></div>",
            "created":1536612420,
            "id":2545917,
            "title":"Making it in the movies?"
        },
        "155333333222":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Shrink in the name of the law!",
                "No way, i know my rights!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a young busty cop, trying out a new form of police weaponry?</span></div></span></div>",
            "created":1537593900,
            "id":2551243,
            "title":"Crime Deterrent"
        },
        "1553333332222":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "For Science!  ",
                "No thanks!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a scientist working on an incredibly lifelike female robot?</span></div></span></div>",
            "created":1567241220,
            "id":2710977,
            "title":"A robot?"
        }
    },
    "info":{
        "author_id":"patnewworld",
        "author_name":"ReducedExpectations",
        "brief_description":"Every genre of F/m shrinking fantasy will be represented.  Go ahead.  Take the experiment.",
        "created":1516588800,
        "description":"<td align=\"left\" class=\"norm\">You are down on your luck, out of work, and looking for money.  An ad in the paper says that they are willing to pay top dollar to anyone willing to take part in a week long study.  You figure you have nothing to lose and take part in the experiment.  But even on the first day, you notice the program includes a test that changes your perspective on a much... LARGER scale.<br>\r\n<br>\r\n- This is a fully fledged shrinking fantasy based around giant women and small men.  SW and male growth can happen in accordance with the story, but shouldn't be the focus of the story.  Lesbians are okay, but please no Male on Male action.<br>\r\n<br>\r\n- The temperament of the giantess can be gentle and caring or rough and abusive depending on their personality.  This is the only story I've written where i will allow for character death and story ends rather than continuous storytelling, but don't just end things suddenly and abruptly.  And also let the story progress a few chapters before the story ends.  Give more opportunity for different branches for each character.<br>\r\n<br>\r\n- Size range can go anywhere from a few inches shorter to microscopic sized.  The main idea behind the story is to have every way a person can be fictionally shrunk represented in a thread.  And although it starts off clearly science-centric, there are mystical elements that can be included as well.  While one scientist may base the experiment around a shrink ray or a special potion, another may have a strange artifact that introduces an other worldly being or some sort of dark magic.  It doesn't have to make total sense.  It's fantasy.<br>\r\n<br>\r\n- NO ONE SENTENCE CHAPTERS.  I appreciate detailed writing, and any contributions on my end will be at least a paragraph per chapter.  <br>\r\n   Additions should follow the same, or they will be edited.<br>\r\n<br>\r\n- Sexual content is perfectly fine, but as a personal preference please NO SCAT OR WATERWORKS. There's tons of stories that focus on that specifically, and they'll do it better.  <br>\r\n<br>\r\n<br>\r\nCHARACTERS - to be added later:<br>\r\n<br>\r\n</td>",
        "id":2146685,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1596343740,
        "modified":1596343740,
        "pretty_title":"Shrinking Experiment:  Phase 1"
    }
}