{
    "chapters":{
        "1":{
            "author_id":"tornadopelt",
            "author_name":"Tornadopelt",
            "choices":[
                "A few furries",
                "A couple busloads of anthros",
                "A truckstop-size amount of furries"
            ],
            "content":"<div class=\"\"><div> <span>You have posted flyers on windows, telephone poles, and any other flat surface you could find. Little dd you know that you (and flyers) had attracted A LOT of attention. On July Fourth, you wake up to see blurry shapes outside, as you still needed time to be rendered fully awake. Someone sends one of your flyers through the open window, folded up as a paper airplane, and it hits you square on the back of the head! the odd person shouts that she brought some friends. Upon closer inspection, you see that she looks like an anthropomorphic timberwolf. You look outside to see...</span></div></div>",
            "created":1307899800,
            "id":1124267,
            "title":"Not the best morning..."
        },
        "13":{
            "author_id":"tornadopelt",
            "author_name":"Tornadopelt",
            "choices":[
                "A small show (full of whistling rockets)",
                "Enough to make a noteworthy show",
                "A show that's in between good and bad",
                "Something to be remembered!",
                "Enough fireworks to make a show bordering on illegal!"
            ],
            "content":"<div class=\"\"><div> <span>(I take no credit of the characters of the story. All characters bleong to their creators, existing or OCs.) You try and count the furries outside. 10. A reaonable number... until a bus full of anthros piles out after that, then another, and another. After a few buses, there are enough anthros to fill up a truckstop parking lot! And with this amount of anthros, you luckily set up for it. Your home has no trailers, whih means a good shooting site from the center, with bleachers to boot! Among the crowd are Danny and Sawyer, the two Hollywood cat stars, Fox from Skunk Fu, and Carmelita from the Sly Cooper games, just to name a few. A few minutes later, everyone piled in to give me their money to go firework shopping. Everyone's combined money managed to get...</span></div></div>",
            "created":1313484600,
            "id":1169223,
            "title":"Crowd Control is futile."
        },
        "135":{
            "author_id":"tornadopelt",
            "author_name":"Tornadopelt",
            "choices":[
                "At home...",
                "Bazinga!"
            ],
            "content":"<div class=\"\"><div> <span>After buying enough fireworks to fill 3 normal sized trunks of CARS, you set off, going to the arcade. After getting there, you take roll call, checking off the names. When you got to the last name, which was Danny, you realised HE WASN'T ON THE BUS! <br>\r\n<br>\r\nLater, at the ball pit...<br>\r\n<br>\r\n\"Hey Danny.\" Danny looks at you, not gaining any response. \"What are ya doing?\" \"Size ratio's all wrong! Couldn't visualize it. They need bigger carbon atoms.\" \"Uh-huh...\" you reply. \"Tell you what. You can start sorting protons and neutrons while I build carbon atoms!\" \"Danny pipes up. \"No, we have to go home now.\" \"But I'm not done working...\"<br>\r\n\"If you don't come out of there, I'mma have to drag you out!\" \"You can try... but you'll never catch me.\" Danny dives into the ball pit. \"Oh, for God's sakes!\" You rummage around the ball pit, lookingfor Danny. \"DANNY, COME HERE!\" \"Bazinga!' \"What?\" \"Bazinga!\" \"Bazinga!\"<br>\r\n<br>\r\nA few minutes later...<br>\r\n<br>\r\nYou finally catch up to Danny, who lets out one final \"BAZINGA!\"</span></div></div>",
            "created":1313525640,
            "id":1169470,
            "title":"BAZINGA! in the ball pit"
        }
    },
    "info":{
        "author_id":"tornadopelt",
        "author_name":"Tornadopelt",
        "brief_description":"Furries, friends, backyard BBQ, and PYROTECHNICS!",
        "created":1307898360,
        "description":"<td align=\"left\" class=\"norm\">This story involves the things most people think of when they hear the phrase Independence Day: friends, backyard BBQ, and most importantly, FIRWORKS! Here are the rules:<br>\r\n<br>\r\n1. Absolutely Positively NO XXX WHATSOEVER! This includes furries that do not use Wookie Rule, sexual acts, or suggestive comments refering to sexual acts between furries.<br>\r\n<br>\r\n2. No randomness.<br>\r\n<br>\r\n3. Wars with fireworks are allowed, but no killing/brutal wounding of ANYONE in said wars involving said pyrotechnic devices.<br>\r\n<br>\r\n4. Please, no cuss words, especially those that refer to said acts in #1.<br>\r\n<br>\r\n5. Above all, KEEP THIS KID FRIENDLY!<br>\r\n<br>\r\nViolations of any rulesin anyone's chapter in this story will result in deletion of said chapter.</td>",
        "id":1784553,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1313525640,
        "modified":1313525640,
        "pretty_title":"A Furry Independence Day!"
    }
}