{
    "chapters":{
        "1":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Big Bill's Bar (wild and rough)",
                "Cocktails & Cream (after work lounge)",
                "Flamingo (small, neighborhood bar)",
                "747 Lounge (Bar located in an airport hotel)",
                "Pumpsie's Bar (seedy, after hours place)"
            ],
            "content":"<div class=\"\"><div> <span>  With their husbands out of town for the weekend on a hunting trip, Sarah, Vivian, and Wanda are sitting around the table at Sarah's house, drinking and having a few laughs. Although they are not drunk, all three of them are feeling pretty good.<br>\r\n<br>\r\n  Then, seeing that the bottle is empty, Wanda says, \"Hey, why don't we go out and have some fun?\"<br>\r\n<br>\r\n  \"Yeah,\" chimes in Sarah. \"Why should our hubbies have all the fun?\"<br>\r\n<br>\r\n  \"I'm game,\" says Vivian. \"Let's all get dressed up in something really hot and meet back here in an hour?\"<br>\r\n<br>\r\n  Excitedly, they all agreed. An hour later, all three of them were back at Sarah's house, ready to go. All three of them are wearing rather sexy, cocktail dresses.<br>\r\n<br>\r\n  \"Wow!\" exclaimed Wanda. \"Dont we all look hot. Now, let's get out of here and go out and have some real fun.\"<br>\r\n<br>\r\n  \"Yeah, I'm ready to party,\" agreed Sarah. \"Where can we go and really let our hair down?\"<br>\r\n</span></div></div>",
            "created":976597200,
            "id":258694,
            "title":"Deciding To Have Some Fun"
        },
        "11":{
            "author_name":"SnowWhite",
            "choices":[
                "Go to the guy's apartment",
                "Drinking & dancing first"
            ],
            "content":"<div class=\"\"><div> <span>  Arriving at Big Bill's Bar, the three women had no sooner sat down at a table and ordered drinks when Sarah spotted a guy she knew sitting with two other guys at a table across from them. Pointing them out to her two girlfriends, she says, \"Hey, I know one of those guys. Do you think I should go over and talk to him?\"\r<br>\n  Trying not to be too obvious, both Vivian and Wanda look over at the three men.\r<br>\n  \"All three of them are kinda cute.\" says Wanda as she takes a sip from her drink.\r<br>\n  Without waiting for them to answer further, Sarah gets up, walks over to the table where the three men are sitting and starts talking to the guy she knows. Vivian and Wanda watch as she laughs at something he said to her. Then, as she bends over to say something in his ear, Vivian and Wanda see that Sarah is treating all three of them to a nice view of her full, lush breasts, which are barely concealed by her rather low-cut cocktail dress.\r<br>\n  Returning to the table, Sarah sits down and gives her two friends a smile.\r<br>\n  \"Well...what do you think, girls?\" she asks, a devilish twinkle in her eyes. \"They want to know if they can join us. I think it would be fun.\"\r<br>\n  \"It's okay with me,\" says Vivian. \"We came here to have a good time, didn't we?\"\r<br>\n  \"You didn't let me finish, Vivian.\" interrupts Sarah. \"The guy I know suggested that we all go to his place and have a party. He's got a real nice house.\"\r<br>\n  \"How do you know what his house looks like, Sarah?\" asks Wanda, a somewhat knowing look in her eyes.\r<br>\n  \"I'll never tell.\" giggles Sarah with a false look of innocence on her face.\r<br>\n  \"Why dont we have a few drinks with them first, and then go to his apartment?\" suggests Vivian.</span></div></div>",
            "created":976683600,
            "id":17199,
            "title":"Big Bill's Bar"
        },
        "111":{
            "author_name":"SnowWhite",
            "choices":[
                "A Dip in the Hot tub.",
                "An orgy on the beds."
            ],
            "content":"<div class=\"\"><div> <span>  Deciding to be daring, the three of them agree to go to the man's house. Leaving the bar, the six of them squeeze into one car and moments later are on their way. \r<br>\n  Sarah and Vivian are sitting in the back seat with two guys and Wanda is up front with the driver. Hearing Sarah let out a giggle of delight, Wanda turns and looks into the back seat. She sees that Sarah is sitting on the lap of one of the men and he is whispering into her ear. Then, as her eyes move downward, she sees that Sarah's dress has ridden up to the top of her thighs and the guy has his hand between her legs, his fingers slowly moving up her inner thigh.\r<br>\n  \"Damn it,\" thinks Wanda. \"How come Sarah always get the cutest ones?\"\r<br>\n  Turning forward in the seat, a smile forms on Wanda's lips as she thinks about her husband, out in the woods somewhere, probably cold, while she's about to have a good time. Then, as the car pulls into the driveway of a large white house on 45th Street, she erases the thought of her husband from her mind and gets out of the car with everyone else.\r<br>\n  Entering the house, their host leads them down a long, wide hallway. As they are walking, Wanda feels a hand on her tight, curvaceous ass, touching her lightly at first, then squeezing a little. Turning her head, she looks at the man beside her and gives him a knowing smile.\r<br>\n  Reaching the end of the hallway, they enter a large room. It's a huge, well decorated bedroom, with a gigantic bed setting by the far wall. A white shag rug covers the floor and as Wanda walks across it, she notices how soft it feels under her feet. Stopping in the middle of the room, she looks around. Candles have been placed all around the room, their flickering light providing a nice, romantic atmosphere.\r<br>\n  Looking to her left, she sees a large alcove, with a huge hot tub placed in the middle of it. Off to her right, she sees a large bar, containing numerous bottles of liquor and glasses. A nude painting of a beautiful, blonde woman is centered on the wall behind the bar, flanked by huge mirrors which reflect the entire room. There are two large and extremely comfortable looking couches setting near the bar.\r<br>\n  The host goes over to the bar, flicks a few switches and the room is instantly filled with soft, romantic music. Then, after he serves everyone a drink, they pair off and sit down on one of the huge sofas. They talk for a bit, laughing and joking.\r<br>\n  Obviously feeling her drinks by now, Sarah starts kissing one of the guys. Moments later, both Wanda and Vivian are embracing the other two men, kissing them as their hands wander over their supple bodies.\r<br>\n  Suddenly, their host stands up and says, \"OK ladies, which do you prefer? The hot tub or the bed?\"\r<br>\n </span></div></div>",
            "created":976683600,
            "id":17208,
            "title":"Taking chances"
        },
        "1111":{
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Sarah, Vivian, and Wanda look at each other.  Wanda eyes the hottub with a slow smile and all 3 silently come to the same conclusion.  Let's do the hot tub.  (After all, if they decide they like the guys they can hit the bed afterwards anyway).<br>\r\n<br>\r\nThe quickly slip off their dresses and strip down naked and climb into the hot tub, sitting at 3 points of a triangle from each other.<br>\r\n<br>\r\nVivian looks at the guys and crooks her little finger.  The guys get a slow smile and start undoing their clothing, and slide in the hot tub.</span></div></div>",
            "created":1052456400,
            "id":157019,
            "title":"hottubbing."
        },
        "11111":{
            "author_name":"Akasha",
            "choices":[
                "Go on w/each other...",
                "Go to the girls!"
            ],
            "content":"<div class=\"\"><div> <span>The guys wander into the hot tub, and begin to fondle each other. The girls looked at them oddly for a minuite, and then began to whisper to each other.<br>\r\n\"I think they are gay!\" Sara exclaims.<br>\r\n\"Do you think so?\" Wanda asks.<br>\r\n\"Well, look at them. IF they wern't gay, don't you think they'd be fondling us instead?\" Sarah added.<br>\r\n\"Well, I guess so. What do we do now?\" Wanda asked. Her heart was sinking, she really wanted to get some. Her husband was being an ass at home, and not giving her any satisfaction.<br>\r\n\"Hey boys!? Gunna leave each other alone long eneough to give us a go?\" Sarah asked. She was slightly drunk, and horny. Not a good combo for her.<br>\r\n<br>\r\nWhat do the guys do?</span></div></div>",
            "created":1054357200,
            "id":160001,
            "title":"Surprise!"
        },
        "112":{
            "choices":[
                "Anal",
                "Blow job."
            ],
            "content":"<div class=\"\"><div> <span>Sarah, Vivian, and Wanda get up and start dancing. Suddenly, the best looking of all the guys comes up behind Vivian and sticks a gun to her back. The other two guys do the same.<br>\r\n<br>\r\n\"We're gonna go party and you three are gonna come too,\" they whisper into the girls' ears.<br>\r\n<br>\r\nThey walk out of the bar and are taken to the parking lot. It turns out that they drove to the bar in a huge camper. The girls get pushed into it and................<br>\r\n</span></div></div>",
            "created":1064120400,
            "id":173719,
            "title":"Uh-oh!"
        },
        "1122":{
            "author_id":"p.h.platte1",
            "author_name":"Ram Effect",
            "choices":[
                "Vivian gives Ralph's friend a blow job",
                "Wanda gives the 3rd man a blow job",
                "Sarah gives Ralph another"
            ],
            "content":"<div class=\"\"><div> <span>Sarah gave the handsomest guy a blow job.<br>\r\nThey were all in the camper together, and she was surprised at the size of the camper. She made note if these details for later use. If she was going to be raped, she was going to give as many details to police as she could. While she did him, 1 of his friends held his gun to her head. Her tongue licked his testes, and he tasted as bitter as baker's chocolate. Sarah spat like a backyard grill when he came. The guy groaned when it happened.<br>\r\n\"Thanks that was wonderful!\" he said. Then he whispered something Sarah couldn't hear.<br>\r\n\"What was that?\" she asked and leaned closer. The other guy, with the gun to her head, looked at his friend with a warning in his eyes. clearly the second guy was smarter than his companion.<br>\r\n\"What did you say again?\" she asked again, leaning closer, and trying to ignore the guns.<br>\r\nSarah was just courageous enough to look up into his handsome face as he said too much.<br>\r\n<br>\r\n\"My name is Ralph,\" he whispered glancing at his friend cautiously. Ralph's friend rolled his eyes silently, but said nothing. Sarah gloated to herself silently. She had just uncovered an important clue, and she would not forget it. It made this almost worth it. But the night was just starting to get interesting. It looked like the others were getting ready for there turn.<br>\r\n<br>\r\n\"Let's do that some more!\" Ralph said.<br>\r\n</span></div></div>",
            "created":1298846460,
            "id":1061748,
            "title":"Blow job!"
        },
        "11221":{
            "author_id":"p.h.platte1",
            "author_name":"Ram Effect",
            "choices":[
                "Wanda decides to give the 3rd man a blow job.",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Vivian hadn't heard what Ralph said to Sarah, but she sensed it was important, and tried to be equally observant.<br>\r\n<br>\r\nVivian gave Ralph's friend a blow job just like Sarah. The guy gave his gun to the third man, and lay back on the same bed as Vivian sniffed then sucked the second man's dick. He groaned and quavered, but clearly enjoyed what Vivian did to him. Vivian grew bolder. She sucked him harder, then licked his balls with her tongue. He tasted sour, like a lemon. Then she sucked him again and got a mouth full of his come! She spat as Sarah had, but some stayed in her mouth. She swallowed, and it tasted salty, like fish eggs.<br>\r\nShe felt sick, yet thrilled at the same time. She had been neglected by her no-good husband too long. But Vivian didn't think that she was ready to find someone else. <br>\r\n\"That's good!\" said the 1st man breaking in to Vivian's thoughts. \"Do that again, Lew! She's hot for you!\"<br>\r\n\"Don't use our names 'til we know these ladies better!\" Lew rebuked his friend \"Don't you have any brains at all, Ralph?\"<br>\r\n\"Sorry, Lew, but I didn't think it could do any harm.\"<br>\r\n\"I'll say you didn't think!\" returned Lew with a sneer. Vivian had never seen a man sneer before in real life, but she new from reading just what it had to look like.<br>\r\n<br>\r\n\"Well, I don't think I can do that again so soon anyway. No woman's done me so fast in my life!'<br>\r\n\"So let's just see how the other bitch does with our other friend!\"<br>\r\n<br>\r\nWanda gulped as she heard Lew's words. She'd heard everything they said in the silence of the camper. Now she would have to do the third guy. She felt like an actress who's been just shoved onto a stage without even being shown a script, let alone given a chance to rehearse.<br>\r\n\"Don't worry, Wanda\" Sarah said from behind her.<br>\r\n\"Just go for it, and we'll get out of this!<br>\r\nWanda trusted her friend Sarah.<br>\r\n\"Let's get going, guys \" Ralph said impatiently.<br>\r\n<br>\r\n</span></div></div>",
            "created":1299375240,
            "id":1065404,
            "title":"Vivian gives Ralph's friend a blow job"
        },
        "112211":{
            "author_id":"p.h.platte1",
            "author_name":"Ram Effect",
            "choices":[
                "Continue Foreplay.",
                "Stop and follow Sarah's lead"
            ],
            "content":"<div class=\"\"><div> <span>Wanda was slower at her lovemaking than her girlfriends.<br>\r\nUnlike her 'sisters' as she called them, she was genuinely attracted to the 3rd man, whom she didn't even know. He was a better lover than Wanda's husband, and like him was passive-aggressive by nature. Wanda guessed that was the nature of the attraction. In short, she was making the same mistake as when she married her no-good husband in the 1st place. 'like lover, like husband' Wanda thought with guilt written all over her pretty face.<br>\r\n\"What's your name?\" she asked as she French-kissed him in the mouth. <br>\r\n\"Sammy\" he said, with a nervous glance at Lew, who rolled his eyes, but said nothing.<br>\r\n\"I'll give you the blow job of your life, Sammy,\" Wanda whispered. \"Just be patient!\"<br>\r\n\"I'll wait the rest of my life!\" Sammy promised.<br>\r\n\"Could you guys put your guns away?\" Wanda asked boldly, glancing back at Lew &amp; Ralph. They hesitated, then lowered their handguns.<br>\r\n\"The safetys are in place,\" Lew told Wanda.<br>\r\n\"Wouldn't wanna stand in the way of 'true love'\" Ralph added darkly.<br>\r\n<br>\r\nShe started by kissing and licking his forehead. Then Wanda worked her way downward from there. Nose, thick lips, chin, Adam's apple, neck, chest, belly, crotch, bulb of dick, everything got kissed hard! Sammy went \"oooo oooo\" and clearly enjoyed what was happening even more than Wanda. She did her best. She liked lots of foreplay, and tried to teach Sammy what she couldn't teach her out-of-town husband.<br>\r\nJust when things started getting interesting, Sarah coughed to get Wanda's attention. Wanda glanced up to see everyone leaning forward. She started to lose her bravado. Sarah seemed to see a way out of this. Wanda hesitated, then turned back to Sammy. She wanted to continue, but instinct told her to follow Sarah's lead, though she couldn't see the reason. What should she do?<br>\r\n</span></div></div>",
            "created":1300482540,
            "id":1072209,
            "title":"Wanda decides to give the 3rd man a blow job."
        },
        "1122111":{
            "author_id":"p.h.platte1",
            "author_name":"Ram Effect",
            "choices":[
                "The newcomer speeks 1st",
                "Ralph speeks 1st"
            ],
            "content":"<div class=\"\"><div> <span>Wanda decided to go against her instincts and continue the foreplay. Here instincts, after all, were what caused her to marry the husband she did. So she continued the same as before, only more slowly this time.<br>\r\nThen suddenly without warning, a stranger entered the camper. He was another guy, one that none of them had ever seen before. Even Wanda turned to look at the newcomer. He was a short man, not much more than 5' 6\" , with dark straight short hair, a thin mustache, and a tuft of hair under his lower lip that just made him look dumb rather than handsome.<br>\r\nEven dumber is what he did and said next.<br>\r\nHe said: \"Freeze, turkeys!\" just like an actor from a very bad movie or something.<br>\r\nEverybody in the camper was motionless for a few minutes.<br>\r\nThen somebody started to talk.<br>\r\n</span></div></div>",
            "created":1313544480,
            "id":1169674,
            "title":"Continue Foreplay."
        },
        "11221111":{
            "author_id":"p.h.platte1",
            "author_name":"Ram Effect",
            "choices":[
                "None of them resist",
                "At least 1 of them resists"
            ],
            "content":"<div class=\"\"><div> <span> The newcomer pulled out a 9-mm Beretta and pointed it at Ralph.<br>\r\n\"Get your hands up, Owens!\" He said to Ralph, who dropped his handgun in panic.<br>\r\n“I’m Shawn S. Clarke, FBI” he continued, flashing a badge, which could have come from a Cracker Jack box or something. <br>\r\n“You're all under arrest! You too, ladies,“ he added to Sarah, Vivian, and Wanda. They stood frozen where they were, unable to talk, let alone move if they could. That was a great way to get women to shut up for once, Ralph thought. Just point a gun at them. Too bad he hadn't thought of that himself.<br>\r\nLew dropped his gun in panic. Sammy didn't even bother to reach for his, which was leaning against the wall. The only one in the room who was holding a gun now was Clarke. <br>\r\n\"What's the charge?\" Lew asked. <br>\r\n\"You're the Owens Boys, that's what!\" said Clarke with a small smile. \"You're already wanted by the FBI.\"<br>\r\n\"So you can all stand with your hands against the wall. I shall enjoy searching you immensely,\" Clarke added. <br>\r\n\"Benjamin Ralph Owens! Lewis N. Owens! Samuel Oscar Owens! I knew I'd catch you sooner or later! I don't care who your companions are at the moment. We'll sort this out eventually. And you no doubt know, the Feds take their own sweet time in these matters.\"<br>\r\n\"You must have a lot of patience, Clarke,\" Lew Owens couldn't resist adding.<br>\r\n\"Shut up, Owens!\" Clarke snapped back. \"You have the right to remain silent, Boys! And if you give it up, I don't care if it's used against you in a court of law or not! You have a right to have an attorney present during questioning, whether you can afford one or not. If you can't, one will still be provided for you anyway, whether you deserve one or not. Do you understand these rights?\"<br>\r\nI don't think so, Clarke,\" said Sammy Owens glancing at his cousin, Ralph. \"Do you understand that?\"<br>\r\n\"Shut up, Sam,\" Ralph told him, who did.<br>\r\n\"All of you just shut up!\" shouted Clarke, who made the walls rattle. \"Let's get this show on the road.\"<br>\r\n<br>\r\nNone of them resist.<br>\r\nAt least one of them resists.</span></div></div>",
            "created":1335562020,
            "id":1323796,
            "title":"The Owens Boys Get Busted"
        },
        "112211111":{
            "author_id":"p.h.platte1",
            "author_name":"Ram Effect",
            "choices":[
                "continue",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>None of the Owens Boys resisted, not even Louis. He was still trying to figure out how they could have got caught so neatly.<br>\r\n Lew was sometimes called Lefty because he was left handed. His head was still spinning at the speed at which the situation had changed. OK now Lefty was going to have to think his way out of this.<br>\r\n He knew he couldn't figure out why this Clarke was holding a gun on the girls, too.<br>\r\nWhat had <u>they</u> done? <br>\r\n</span></div></div>",
            "created":1453498440,
            "id":2092745,
            "title":"None of them resist"
        },
        "1122111111":{
            "author_id":"p.h.platte1",
            "author_name":"Ram Effect",
            "choices":[
                "they do not continue",
                "they continue with what they did before",
                "or"
            ],
            "content":"<div class=\"\"><div> <span>          Shawn S. Clarke was not an FBI agent.<br>\r\n           Clarke suddenly smiled and said \"Relax Boys and girls. I'm not a real FBI agent. I just want to see you fuck each other!!\" They all started to smile as they realized what was happening.<br>\r\nSarah laughed the loudest as they all smiled and laughed at the ridiculous role play she’d arranged for all of them.<br>\r\n\"You see I arranged for Shawn to do this, \" Sarah said to everyone in the room. The others slowly recovered from their surprise and stated to laugh, too.<br>\r\n\"OK, \" said Ralph Owens, trying without success to regain his composure. \"Now let's try to figure out where we left off.\"<br>\r\n\"Let's continue, shall we?\"<br>\r\n</span></div></div>",
            "created":1484346960,
            "id":2263114,
            "title":"Shawn S. Clarke is not FBI"
        },
        "12":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Accept A Ride Home?",
                "Call a Taxi?"
            ],
            "content":"<div class=\"\"><div> <span>  Deciding that none of them were sober enough to drive, they called a taxi and went downtown to a place called \"Cocktails &amp; Cream\". Arriving, they paid the driver, went inside and found a table.<br>\r\n<br>\r\n  The bar was packed with the after work crowd; secretaries, stenos, businessmen and the like. As Sarah, Vivian, and Wanda sat at the table drinking, various men came over and asked them to dance, which each of them readily accepted. As the night wore on, it became quite obvious that most of the men who asked them to dance were trying to pick them up.<br>\r\n<br>\r\n  As closing time approached, the three women found themselves sitting together at a table with three men. They were all laughing and joking, having a great time together when the bartender told them that he was closed. After vocally expressing her disappointment to the bartender, Sarah stood up. As the man sitting beside her stood up, she fell against him, nearly knocking him off balance.<br>\r\n<br>\r\n  \"Whew! I think I might of had a little too much to drink.\" she giggled.<br>\r\n<br>\r\n  \"Yeah! Me too!\" said Vivian as she got up out of her chair, swaying unsteadily from side to side.<br>\r\n<br>\r\n  \"Well, I guess the fun has to end sometime.\" exclaimed Wanda as she rose from her chair. \"I'll go and call a taxi.\"<br>\r\n<br>\r\n  \"Hey..no need to do that.\" said Tom, as he wrapped his arm around Sarah's waist. \"I can drive! I'll give you a ride home. Hell, I'll give everyone a ride home. What do you say?\"<br>\r\n<br>\r\n<br>\r\n  </span></div></div>",
            "created":977202000,
            "id":258695,
            "title":"Cocktails & Cream"
        },
        "13":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Goes In For A Nightcap",
                "Tells her no thanks and leaves"
            ],
            "content":"<div class=\"\"><div> <span>  \"I don't think any of us are in any shape do drive,\" said Vivian. \"Why don't we just take a taxi to the Flamingo?\"<br>\r\n<br>\r\n  When Sarah and Wanda agreed, Vivian called a taxi and 20 minutes later, they walked into the Flamingo Lounge.<br>\r\n<br>\r\n  Sitting down in a booth, they ordered drinks from the waitress. Besides the three of them, the waitress and the bartender, there were only a few people in the bar. A couple was sitting in another booth and two men sat at the bar.<br>\r\n<br>\r\n  \"Damn, it's dead in here.\" said Sarah as their drinks arrived. \"I thought this place would be more lively on a Friday night.\"<br>\r\n<br>\r\n  \"It usually is,\" replied the waitress. \"There were more people in here earlier.\"<br>\r\n<br>\r\n  Looking at her watch, Sarah saw that it was already after ten.<br>\r\n<br>\r\n  Finishing their drinks, they ordered another round. Vivian went over to the jukebox and a few minutes later, music wafted through the room.<br>\r\n<br>\r\n  Just then, the front door opened and a tall, blonde-haired man who appeared to be in his early thirties entered. Glancing over at them as he walked up to the bar, he nodded his head, apparently recognizing one of them.<br>\r\n<br>\r\n  \"Wow!\" said Wanda. \"Now that's a hunk! And good lookin' too!\"<br>\r\n<br>\r\n  \"That's Jim Rogers.\" said Vivian. \"He's my next door neighbor.\"<br>\r\n<br>\r\n  \"Oh! He's married?\" asked Sarah, her eyes following him as he sat down at the bar.<br>\r\n<br>\r\n  \"No, not anymore.\" replied Vivian. \"His wife was killed in an auto accident three months ago.\"<br>\r\n<br>\r\n  \"Oh! Too bad!\" said Sarah. \"Any Kids?\"<br>\r\n<br>\r\n  \"Uh Uh!\" replied Vivian. \"After the accident, Bill and I invited him over for supper a few times. He's really a nice guy and he really has a great sense of humor.\"<br>\r\n<br>\r\n  \"Why don't we ask him if he'd like to join us?\" asked Wanda. \"I mean, he's all by himself and it couldn't hurt, right?\"<br>\r\n<br>\r\n  Glancing over at Sarah and seeing her nod in approval, Vivian got up and walked over to the bar where Jim was sitting. Sarah and Wanda watched as she talked to him, giving him a friendly wave when they saw him look over in their direction.<br>\r\n<br>\r\n  A few minutes later, Vivian came back to the booth, with the tall, good looking man following her. After the introductions were finished, Vivian sat down beside Wanda and Jim sat down beside Sarah. The four of them sat there, talking as they drank, unaware of the time until the waitress told them that the bar was closing.<br>\r\n<br>\r\n  \"Geez, I better call a taxi or we'll end up walking back to your house, Sarah.\" said Wanda. \"Anybody got a quarter?\"<br>\r\n<br>\r\n  \"Hey, save your money.\" said Jim. \"I'll give you all a ride. I don't mind and besides, it's not like I got anything else to do.\"<br>\r\n<br>\r\n  Leaving the bar, they all got into Jim's car; Sarah and Wanda in the back and Vivian in the front. Twenty minutes later, with Vivian giving him directions, Jim pulled into Sarah's driveway.<br>\r\n<br>\r\n  As Vivian and Wanda got out on the passenger side, Jim got out and pushed the driver's seat forward, allowing Sarah to get out on that side. Thanking him as she got out of the car, Sarah looked over at Wanda and Vivian. Turning back to Jim, she smiled sweetly.<br>\r\n<br>\r\n  \"Uh...why don't you come in for a nightcap, Jim?\" she asked. \"I mean...you did give us a ride and all. It's the least we can do to show our appreciation.\"<br>\r\n<br>\r\n  Seeing the hesitation on his face, she quickly added, \"C'mon....just one drink.\"<br>\r\n<br>\r\n     <br>\r\n  </span></div></div>",
            "created":977202000,
            "id":258696,
            "title":"Running Into An Acquaintance"
        },
        "131":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Accepting The Challenge"
            ],
            "content":"<div class=\"\"><div> <span>  Agreeing to join them for a nightcap, Jim locked his car and followed the three women in the house. As soon as they were inside, Vivian walked over to the couch in the living room and sat down. Patting the spot beside her with her hand, she told Jim to have a seat. Sarah and Wanda said something about fixing drinks and disappeared into the kitchen.<br>\r\n<br>\r\n  Sitting down on the couch, Jim and Vivian began talking. A few minutes later, Sarah and Wanda re-appeared, with everyone's drinks.<br>\r\n<br>\r\n  Handing Jim a tall glass, Sarah smiled and said, \"I hope you like it. I forgot to ask what you wanted so I just took a chance.\"<br>\r\n<br>\r\n  Taking a drink from the glass she had offered him, Jim smiled, saying that it was perfect.<br>\r\n<br>\r\n  Smiling, Sarah walked over to the stereo and turned it on. A few moments later, the room was filled with soft, romantic music. Turning, she walked back across the room and sat down on one of the two easy chairs across from Jim. Wanda had already seated herself in the other. Soon, all four of them were engaged in pleasant conversation and the one drink previously agreed upon soon led to another, and then, another.<br>\r\n<br>\r\n  Suddenly, hearing a slow, romantic song she liked playing on the stereo, Sarah stood up and asked Jim to dance with her. Getting up from the couch, Jim moved to the center of the room and began dancing with her. As he slipped his arm around her waist, she moved forward, pressing her body tightly against him. Slowly, they began to sway to the soft music. The scent of her perfume filled his nostrils and as her body rubbed sensuously against his, Jim felt a slight stirring in his loins.<br>\r\n<br>\r\n  As the song ended, Jim felt a tap on his shoulder. Turning, he saw Wanda standing there, smiling.<br>\r\n<br>\r\n  \"My turn,\" she said, placing a hand on his shoulder.<br>\r\n<br>\r\n  As Jim slipped his arm around her waist, she moved forward, pressing her body tightly against his. As they slowly began to sway to the music, her body rubbing against his, Jim's face flushed as he felt himself getting an erection. Realizing she would feel it pressing against her tummy, he pulled back slightly but, Wanda just moved closer, pressing her body even tighter against him, seemingly oblivious of the fact that his hard cock was pushing against her belly.<br>\r\n<br>\r\n  As the song ended, Jim backed away from Wanda, beads of sweat on his forehead. Turning, he saw Vivian standing there, waiting, a smile on her lips. Once again, as he took her in his arms, he felt her move forward, molding her body tightly against him.<br>\r\n<br>\r\n  When the song ended, Vivian took his hand and led him back to the couch. Sitting down, he quickly finished his drink and placed the empty glass on the coffee table in front of him. He thought about leaving but, before he could say anything, Sarah had already taken his glass to the kitchen and returned it to him, completely full. As she handed it to him, she sat down on the other side of him, placing him between her and Vivian.<br>\r\n<br>\r\n  As the four of them sat there, talking and drinking, Jim realized that all three women were quite inebriated. All of them were telling rather risque jokes now and sex seemed to becoming more and more the topic of discussion.<br>\r\n<br>\r\n  Wanda, who was sitting in the easy chair directly across from him, gave him a smile as she leaned back in the chair, crossing her legs. Jim took a long drink from his glass as he saw her skirt ride up, revealing her lovely bare thighs. He felt his cock stir as he realized he could see all the way up her dress. He stared, wondering if it was true what they said about redheads being really hot in bed. His mind wandered as he thought about what it would be like to have sex with the gorgeous redhead sitting across from him.<br>\r\n<br>\r\n  Suddenly, he was jolted back to reality as he heard Sarah and Vivian laughing. Turning his head, first in Vivian's direction and then at Sarah, he looked at them inquisitively, wondering what had been said that they found so funny.<br>\r\n<br>\r\n  \"What? What did you say?\" he asked. \"I guess my mind was somewhere else.\"<br>\r\n<br>\r\n  \"Yes, I would say it was.\" laughed Sarah. \"and so were your eyes.\"<br>\r\n<br>\r\n  Jim's face grew red with embarrassment as he realized they had seen him staring at Wanda's legs.<br>\r\n<br>\r\n  \"I just asked Vivian if she thought you could handle all three of us,\" Sarah continued. \"And she said why don't we find out.\"<br>\r\n<br>\r\n  Jim looked at Sarah in disbelief, not sure he had heard her right. Turning to Vivian, he saw the huge smile on her face. Then, looking over at Wanda, he saw her smile back at him, not saying a word, waiting for him to say something in response. He could feel his cheeks flushing, turning even a brighter shade of red.<br>\r\n<br>\r\n  \"Well, Jim?\" giggled Sarah, her eyes flashing wickedly. \"What do you think? Think you could handle the three of us?\"<br>\r\n<br>\r\n  WELL.....CAN HE?   ARE THEY SERIOUS?<br>\r\n   </span></div></div>",
            "created":987915600,
            "id":258697,
            "title":"Having A Nightcap"
        },
        "1311":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "The Ladies Continue"
            ],
            "content":"<div class=\"\"><div> <span> Turning his head, Jim looked straight at Sarah, his eyes meeting hers. She was looking at him, her eyes sparkling as she awaited his answer.<br>\r\n<br>\r\n \"Christ, are they serious or are they just having a little fun at my expense?\" he wondered as he looked over at Vivian and Wanda, then looked back at Sarah. \"They must be joking.\"<br>\r\n<br>\r\n \"Well, Jim?\" said Sarah, looking at him in an inquisitive manner. \"Are you going to answer or has the cat got your tongue?\"<br>\r\n<br>\r\n \"Maybe he needs a little coaxing,\" giggled Vivian as she slide over beside him, her thigh pressing against his. Then, turning slightly, she leaned over and kissed him, her soft lips pressing against his.<br>\r\n<br>\r\n Jim slipped his arm around Vivian, gently pulling her to him as he responded to her kiss. He still wasn't sure if they were teasing him or if they were serious.<br>\r\n<br>\r\n His question was answered a moment later when he felt a hand slowly sliding up his inner thigh. He groaned into Vivian's mouth as he felt fingers lightly tracing the outline of his hard cock through his trousers.<br>\r\n<br>\r\n As Vivian pulled her lips from his, Sarah quickly took her place, kissing him passionately, her tongue darting into his mouth. Slipping his other arm around Sarah, he pulled her to him, responding to her kiss by slipping his tongue into her open mouth.<br>\r\n<br>\r\n Twisting, Sarah pushed him back into the couch, her lips pressing against his hungrily. As she kissed him, she unbuttoned his shirt and slipped her hand inside, slowly running her hand over his bare chest. At the same time, Jim could feel another hand between his legs, slowly sliding back and forth over his hard cock, the fingertips squeezing lightly.<br>\r\n<br>\r\n Pulling back from him, Sarah gave him a sexy smile, her eyes sparkling with anticipation as she got to her feet. Vivian had also risen from the couch and stood there, looking down at him. Each of them took one of his hands and pulled him up from the couch. Jim stood between them, looking from one to the other, wondering what would come next.<br>\r\n<br>\r\n Both women giggled as Sarah reached down and began undoing his belt and unbuttoning his trousers. She looked up at him, a slight smile on her face as she slowly pulled his zipper down.<br>\r\n<br>\r\n At the same time, Vivian had finished unbuttoning his shirt and pushed it from his shoulders, sliding it down his arms and letting it drop to the floor. Then, moving forward, she bent her head and began kissing his chest, her lips brushing softly over his naked skin.<br>\r\n<br>\r\n Jim looked over at Wanda, who was still sitting in the chair in front of him. She was looking up at him, her eyes sparkling with desire as she slowly ran the tip of her tongue over her lush red lips.<br>\r\n<br>\r\n He couldn't believe it. Here he was, nearly naked, standing in a room with three married women, and they were undressing him. He wondered if they would go through with it or if, at a certain point, they would stop, telling him they were just kidding. Actually, Jim wasn't all that sure that he wanted to go through with it. After all, all three of them were married women and he knew Vivian's husband. He had actually been a guest at their house a few times.<br>\r\n<br>\r\n For the moment tho, he was willing to go along with everything and just see how far the three women would go before they called a halt to their fun.<br>\r\n<br>\r\n And if they continued, would he have sex with all three of them? At this point, Jim wasn't even thinking about that. All he knew right now was the fact that they had him aroused and in a few moments, it would be truth or dare time.<br>\r\n  </span></div></div>",
            "created":988779600,
            "id":258698,
            "title":"The Teasing Begins"
        },
        "13111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Watching The Show"
            ],
            "content":"<div class=\"\"><div> <span>  Jim stood between Sarah and Vivian, curious as to what would happen next. Vivian slowly ran her hand over his naked chest, her fingertips caressing him softly. Tilting her head upward, she leaned forward, her lips touching his. The scent of her perfume filled his nostrils, arousing him even more.<br>\r\n<br>\r\n  Wrapping one arm around Vivian, he pulled her closer, responding to her kiss. His fingers came into contact with the zipper on the back of her dress and slowly he began to move it downward. Vivian moaned softly, her lips parting and her tongue sliding into his mouth.<br>\r\n<br>\r\n  He heard Wanda speaking, her voice a rather husky whisper, obviously filled with lust.<br>\r\n <br>\r\n  \"Get his pants off, Sarah.\" she urged. \"Let's have a look at what he's got.\"<br>\r\n<br>\r\n  He felt Sarah tug at his trousers, pulling them from his hips and pushing them down to his ankles. He seldom wore underwear and tonight was no exception. Free from his confining trousers, his hard, throbbing cock sprang out in front of him, pointing upward at a slight angle.<br>\r\n<br>\r\n  \"OH!!\" gasped Sarah as her eyes widened in amazement at the size of the huge, rock-hard cock only inches from her face. \"OH MY! It's...it's so big!!!\"<br>\r\n<br>\r\n  \"Geezus!!\" gasped Wanda at the same time, her eyes growing wide as she stared at the long, thick, throbbing cock in front of her. \"Now that's what I call a cock!!\"<br>\r\n<br>\r\n  Hearing Sarah and Wanda, Vivian pulled away from Jim and quickly looked down. An audible gasp came from her lips as she stared at Jim's huge throbbing cock.<br>\r\n<br>\r\n  \"My God, it's big!!\" she gasped, her eyes fixed on his penis. \"Hell...Bill's cock isn't even half that size.\"<br>\r\n<br>\r\n  Reaching out, Sarah wrapped her fingers around the huge, thick shaft, squeezing it softly. Her eyes sparkled with lust as she felt it jerk in her hand.<br>\r\n <br>\r\n  \"Damn! I..I've never seen a cock this big, except in porno movies.\" she gasped, her voice dripping with lust. \"Damn! It's at least a foot long....maybe more even!!\"<br>\r\n<br>\r\n  \"Yeah...at least.\" chimed in Wanda, her eyes still riveted to Jim's cock. \"And look at how thick it is....my God!!!\"<br>\r\n<br>\r\n  \"Well ladies....??\" Jim said proudly as his eyes went from one woman to another. \"Are you just going to just look at it....or would one of you like to try it out?\"<br>\r\n<br>\r\n  Instantly, all three women became a flurry of action, any inhibitions they might have had disappearing as they stripped off their clothing.<br>\r\n<br>\r\n  Moments later, Jim found himself down on the floor, lying on his back, with three naked women kneeling beside him, their hands wandering over his naked flesh.<br>\r\n<br>\r\n  Leaning over him, Vivian brought her lips down on his, kissing him passionately as her hands roamed over his naked chest. Reaching under her, Jim slipped his hand between her legs and ran his fingers over her pussy. As his fingers slid over her slit, he felt the wetness oozing from her opening, coating his fingertips.<br>\r\n<br>\r\n  He groaned as he felt a woman's lips brush against his rock-hard shaft, kissing it lightly. Hands wandered over his body, touching him lightly, caressing his skin as they explored his nakedness.<br>\r\n<br>\r\n  Pulling her lips from his, Vivian moved upward, until her swaying breasts were directly over his face. Knowing what she wanted, Jim lifted his head slightly, and took her breast into his mouth, sucking lightly on her nipple. A soft, low moan came from Vivian's lips.<br>\r\n<br>\r\n  With his face buried between Vivian's breasts, Jim could only sense what the other two women were doing. He had no idea which woman was doing what but, neither of them was idle. He could feel their hands on his body, probing and searching, caressing every part of his exposed flesh.<br>\r\n<br>\r\n  A hand was wrapped around his penis, slowly moving up and down in a rhythmical manner. Another hand was between his legs, gently caressing his balls. Jim groaned as he felt a warm, wet mouth cover the swollen knob at the end of his cock, sucking on it. At the same time, he could feel a tongue slowly sliding down the side of his shaft, leaving a trail of saliva as it moved down to the base and then began moving back upward.<br>\r\n<br>\r\n  Soft moans and groans of desire filled the air as all three women cast any inhibitions they might have had to the side, their only thoughts now were of satisfying their lustful desires.<br>\r\n<br>\r\n  The four of them had become a ball of twisting, writhing, naked flesh in the center of the room. All of them were caught up in a whirling mass of lust, kissing, touching, and caressing each other's bodies. Soft moans and sighs were mixed with lustful whispers of desire as everyone's hands wandered over naked flesh. No one cared who was doing what to whom, only that their lustful desires be fulfilled.<br>\r\n<br>\r\n  Jim was lying flat on his back, enjoying the attentions of all three women. Vivian was straddling him, her knees on each side of his head, her pussy directly over his face. She gasped as he pulled her down to him, his tongue plunging into her hot, wet slit.<br>\r\n<br>\r\n  \"Oh God! Yes...yes....yessssss!\" she moaned, her hips jerking as she felt his tongue inside her. \"Lick it! Lick my hot pussy, honey. Ooooh fuck.....that feels good!!!\"<br>\r\n<br>\r\n  As his tongue swirled and plunged inside Vivian's hot cunt, Jim felt another body straddling his, their knees on either side of his hips, sitting on his thighs. Then, as the weight lifted, he felt a hand on his hard throbbing cock. He groaned into Vivian's pussy as he felt the head of his cock sliding up into a burning-hot, wet, slippery pussy.<br>\r\n<br>\r\n  He couldn't tell whether it was Sarah or Wanda on top of him until he heard Sarah's voice cry out.<br>\r\n<br>\r\n  \"Oh God! It's really big!!!\" she gasped, as she felt the head of his thick cock slowly enter her vagina. \"I'm not sure I can take all of it!!\"<br>\r\n<br>\r\n  Slowly, she lowered her hips, taking about three inches of his thick cock into her hot, slippery hole. Then, satisfied that it was safely lodged inside of her, she began moving her hips up and down rhythmically, taking him a little deeper with each downward plunge of her hips.<br>\r\n<br>\r\n  \"Ooooh.....Ummmmmmmm....God... that feels.... sooooo....good!!!\" she groaned, her hips moving up and down a little faster now. \"God!!! I....ughhhh...want...ughhhh.. it all....ugghhh....I want....ughhh... every inch....ughhhh....inside me!!!!\"<br>\r\n<br>\r\n  \"Ride him, Sarah!!\" cried out Wanda lustfully. \"Ride that big fuckin' cock!! Get it all inside you!!!\"<br>\r\n<br>\r\n  A muffled groan came from Jim's lips as he felt his cock going deeper and deeper into Sarah's cunt. The inner walls of her vagina clung tightly to his cock and with each upward movement, it felt almost as if her cunt was sucking on his huge prick.<br>\r\n<br>\r\n  Blindly, he reached out with one hand, touching Wanda's thigh. Slipping his hand between her legs, he slid his hand up her inner thigh, feeling a sticky wetness. His fingertips brushed over her pussy. Then, finding her slit, he pushed two fingers inside her. He heard a soft moan come from her lips as he started moving his fingers in and out of her hot, slippery cunt. She gasped as he pressed his thumb against the upper part of her slit.<br>\r\n<br>\r\n  \"Oh God.....yes.....do it!!!\" she gasped, reaching down and grabbing his wrist. \"Rub it!! Rub my clit!! That's it!! Oooooh, God!!\"<br>\r\n<br>\r\n  As his fingers plunged in and out of Wanda's hot pussy, his thumb rubbed back and forth over her clitoris. Almost instantly, a torrent of juices poured from her cunt, covering his hand with a sticky wet film.<br>\r\n<br>\r\n  Sarah was gasping now, her hips moving up and down wildly as she rode his hard cock, trying to take it all inside her.<br>\r\n<br>\r\n  \"Ohhhh....God!!! It's....ughhh...so good!\" she cried, her breath coming in ragged gasps as she bounced up and down. \"Sooooo..ugh.. fuckin'.... ughhhhh....good!!!!\"<br>\r\n<br>\r\n  At the same time, Vivian was literally riding his face, rubbing the hot juices that poured from her cunt all over his face. She had tangled her fingers into his hair, holding him tightly as she furiously rubbed her hot cunt over his mouth and nose.<br>\r\n<br>\r\n  \"God!! Yes!!! Yesssss!\" she groaned, thrusting forward, driving her pussy hard against his mouth. \"There! Right there!! Oooooh God!!! Yesssss! Yesssssss! Suck it! Suck on my clit!!! I'm....I'm gonna....Oh fuck....I'm cummming.....I'm cummmiiiing now!!!\"<br>\r\n<br>\r\n  Jim licked and swallowed as a river of hot, sticky juices gushed from Vivian's cunt, flowing into his mouth and covering his face. Her hips bucked wildly and her pussy slammed down hard against his mouth. Her body quivered uncontrollably as orgasm after orgasm shot through her body like jolts of electricity.<br>\r\n<br>\r\n  Gasping for breath, she fell to one side, collapsing on the floor beside him, her breath coming in ragged gasps.<br>\r\n<br>\r\n  At nearly the same moment, Sarah cried out loudly, her lustful gasps of pleasure ringing out.<br>\r\n<br>\r\n  \"I...I....I'm cummmmiiiinnnngggg!!\" she screamed, her hips bucking up and down wildly. Then, thrusting down hard, she cried out in a combination of pain and pleasure as she took the entire length of Jim's cock inside her spasming vagina. \"Ooooh God!! I'm cuuummmmiiinnnnggg!!!\"<br>\r\n<br>\r\n  Hot juices gushed from her spasming pussy, covering Jim's cock with a sticky wetness. Looking up at her, Jim saw her eyes roll back in her head. Her body shook uncontrollably for a moment, and then she collapsed, rolling off to one side of him, dislodging his still hard cock from her gaping opening. Sarah laid there, her breath coming in ragged, uneven gasps. He could see her body quivering uncontrollably as orgasm after orgasm shot through her body like lightening bolts.<br>\r\n<br>\r\n  Quickly rolling over, he grabbed Wanda and pushed her down on her back. Looking up at him in lustful anticipation, she spread her legs wide.<br>\r\n<br>\r\n  Kneeling between her open thighs, Jim positioned the thick, bulbous head of his cock between the swollen lips of her pussy. Then, reaching down under her legs, he lifted them, bending them up to her full lush breasts. He hesitated for a moment, looking down at her, staring into her smoldering green eyes.<br>\r\n<br>\r\n  Thrusting his hips forward, he rammed his huge cock into her, driving it deep into her pussy. Wanda gasped loudly, crying out as she felt the huge thick cock plunging deep inside her. Later, jokingly, she would say that it felt like someone was shoving a baseball bat up her pussy.<br>\r\n<br>\r\n  \"OH!! OH GOD!!! OOH MY GOD!!!\" she gasped as she felt his huge cock plunging deeper and deeper into her slippery, wet, lust channel. Wanda had fucked other men besides her husband but, she had never had one with a cock this big. \"Geezus! Take it easy, Honey!! You're...you're splitting me in two!! Oooooooooh God!!!\"<br>\r\n<br>\r\n  But there was no stopping him now. Jim had wanted to fuck Wanda from the moment he had laid eyes on the gorgeous redhead. And now, he was doing just that. Deeper and deeper, his cock plunged into her receptive pussy. Wanda gasped, partially in pain and partially in ecstasy as she felt his huge thick cock penetrate to the very depths of her hot, well-lubricated cunt.<br>\r\n<br>\r\n  Jim groaned as his sperm-filled balls slapped up against her up-turned ass. He was all the way inside her now. Blinded by his lust, he ignored her pleas as he began thrusting in and out of her furiously. Pushing her legs even higher, he cupped his hands around her breasts, squeezing them hard as he relentlessly hammered his hard cock in and out of her hole. With each thrust, he could feel the head of his cock bang up against what he suspected to be her womb, which only caused him to plunge into her even harder.<br>\r\n<br>\r\n  \"I'm gonna fuck your brains out, baby!\" he gasped lewdly. \"You're gonna get a fuckin' you'll never forget!\"<br>\r\n<br>\r\n  Groaning with each thrust of his cock into her hot cunt, Wanda reached up, wrapping her arms around his shoulders. Clinging to him, she cried out passionately, her words interuppted by her gasps.<br>\r\n<br>\r\n  \"Fuck me!! Ughhhhhh! Oh God!!! Ughhhh! Fuck me....ooooh....fuck me hard!!!\" she groaned. \"Ram it...ugghhh....in!!! Ooooh God!!! Harder!!! Ugh! Harder!!!! Ughhhhh! Give it....unnnhhh....to me!!! Gimme..ughhh...every fuckin'..ughh...inch!\"<br>\r\n<br>\r\n  Jim drove his cock into Wanda's pussy like a jack-hammer, faster and faster, his strokes longer and longer. He could feel the semen boiling up in his balls. It would only be a moment now and he would cum, filling the lusty redhead's hot cunt with his sperm.<br>\r\n<br>\r\n  Wanda could sense that Jim was on the verge of cumming. She could feel his thick cock throbbing and pulsating inside her boiling-hot pussy. Somewhere in the back of her mind, she heard her own voice, calling out to her with a frantic warning....<br>\r\n<br>\r\n  \"Geezus! Don't let him cum inside you!!\" the voice inside her head screamed. \"You aren't using any protection!!! He could get you pregnant!!!\"<br>\r\n<br>\r\n  But the voice crying out in her mind was being ignored by the rest of her body. Wanda felt the hot glow of an orgasm growing deep inside her body. It felt as if her body was ready to explode. She wanted him to stop and pull out but, she also wanted to feel his cock inside her.<br>\r\n<br>\r\n  \"OH GOD!!! OH GOD!\" she cried out loudly, her fingernails digging into Jim's back. \"I'm...I'm gonna....Oh God, I'm gonna cum!!! Yes!  Oh,God, yessss!! I'm cummmmmmmmmiiiiinnnngg...yes! Yes!! Ooooh, fuck....I'm cummmmmmiiiinnnngggg!!!\"<br>\r\n<br>\r\n  Pulling back until just the head of his cock was inside her, Jim looked down at the gorgeous redhead lying under him. Then, with a lustfilled, audible gasp, he thrust his hips forward, ramming his huge thick cock all the way into her spasming pussy. A loud gasp came from his lips as his cock exploded inside of her, spewing hot thick streams of sticky semen deep inside her cunt. He groaned as he felt stream after stream erupt from his cock, spurting forcefully into her pussy.<br>\r\n<br>\r\n  Wanda gasped, crying out lewdly as she actually felt his semen erupting inside her, filling her cunt with his sticky cock-cum.<br>\r\n<br>\r\n  \"Yes.....Yesssssssssssssss!!!\" she cried out in ecstacy. \"Give it to me!!! Ram it in!! Gimme every fuckin' inch!! Ooooh, fuck! That feels soooooo fuckin' good!!!\"<br>\r\n<br>\r\n  Spent, Jim lowered Wanda's legs back to the floor, at the same time, slowly pulling his cock out of her. Looking down at her, he could see his semen, mixed with her juices, oozing slowly from her now gaping cunt. He watched as the juices slowly slide down her ass and pooled between her legs in a tiny wet puddle. Wanda was just lying there, her legs splayed apart, gasping to regain her breath.<br>\r\n<br>\r\n  Rising to his feet, Jim looked around, his knees shaking weakly. Behind him, he saw Vivian and Sarah, lying side by side, their arms around one another, their hands softly caressing each other's body as they kissed one another softly. His cock gave a jerk as he looked down at them. He had seen movies of two women together before but, he had never actually seen it for real.<br>\r\n<br>\r\n  Slowly, he walked over to the couch and sat down. Picking up a half-filled glass, he took a long drink, enjoying the cool liquor as it ran down his throat. Then, placing the glass back on the end table beside the couch, he leaned back, anticipating the show that was about to begin.<br>\r\n<br>\r\n    <br>\r\n    </span></div></div>",
            "created":989038800,
            "id":258712,
            "title":"The Surprise"
        },
        "131111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Vivian's Lust"
            ],
            "content":"<div class=\"\"><div> <span>  Lying on her side on the floor, Sarah moaned softly, her sweaty, naked flesh quivering uncontrollably as her orgasms slowly subsided. She could feel the hot, sticky juices slowly oozing from her gaping slit, covering her inner thighs with their wetness. Slowly, she rolled over unto her back, her breasts rising and falling with each breath she took. She laid there for a moment, her eyes closed, enjoying the euphoric warm glow coursing through-out her entire body.<br>\r\n<br>\r\n  Turning her head to one side, she saw Wanda and Jim on the floor only a few feet away from her. Wanda was lying on her back, her legs and feet waving in the air. Jim was kneeling over her, his arms hooked under her legs, holding her legs up as he drove his cock into her pussy. Sarah could actually see his huge, thick cock plunging into Wanda's pussy, disappearing completely, only to reappear a moment later, covered with her wet, sticky juices.<br>\r\n<br>\r\n  Wanda was gasping and groaning in sheer ecstasy, her voice calling out loudly, urging him on.<br>\r\n<br>\r\n  \"Fuck me!!! Fuck me, Jim!!!\" she gasped. \"Give it to me!! Gimme every fuckin' inch!! Ooooh, Gawd....yes....yesssss....ram it in!!! Ram that big cock up my hot pussy!!! Ooooooooh, God..... that feels soooo good!!! Harder.....harder!!!\"<br>\r\n<br>\r\n  Sarah watched as Jim's cock plunged in and out like a jack-hammer, faster and faster. She could see the juices pouring from Wanda's slit, sliding down into the crack of her upturned ass. The sound of their naked, sweaty flesh slapping together filled the room.<br>\r\n<br>\r\n  Suddenly, Wanda cried out loudly, her hips jerking up to meet Jim's thrusting cock.<br>\r\n<br>\r\n  \"Now!!! Ram it in!!!\" she gasped. \"Harder!!! Ohhhh God!!! I..I....I'm...ohh, yes...yessssss... give it to me, honey...harder!!! I'm gonna...ohh, God!!! Yes!!! Yesssssssss!!! That's it...harder!!Ohhhhhhhh....fuck.........I'm cuuummmiiingg!!!\"<br>\r\n<br>\r\n  Sarah's eyes widened as she saw Jim's huge, thick cock disappear completely into Wanda's slippery hole, his balls slapping up against her up-turned ass. She watched as Jim jerked his hips forward, once, twice, three times, almost as if he were trying to get his balls inside her also. Hearing Jim groan loudly, Sarah knew that he was cumming also, spewing his hot, sticky semen into Wanda's vagina.<br>\r\n<br>\r\n  Then, his breath coming in ragged gasps, Jim slowly withdrew from Wanda's gaping slit. Wrapping his hand around his glistening cock, he wiped it across the dark-red hairs of her pussy. As he stood up and moved away, Sarah could see his milky-white semen, oozing from Wanda's gaping, well-fucked cunt, slowly sliding down into the crack of he ass.<br>\r\n <br>\r\n  Aroused by the scene she had just witnessed, Sarah slipped her hand down between her thighs and started rubbing her pussy, moaning softly as her fingers moved back and forth, and all around her swollen, ultra-sensitive clitoris. Hot juices oozed from her slit, coating her fingertips with a sticky, wetness. Faster and faster, she moved her hand, groaning as she felt the impending orgasm growing deep inside her.<br>\r\n<br>\r\n   <br>\r\n  </span></div></div>",
            "created":990075600,
            "id":258714,
            "title":"Sarah Gets An Eyeful"
        },
        "1311111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Wait and see what happens next"
            ],
            "content":"<div class=\"\"><div> <span>  Vivian was lying on the floor, enjoying the warm glow that coursed through her body. The intense orgasms she had experienced when Jim Brewer had eaten her pussy were slowly subsiding.<br>\r\n<br>\r\nTurning on her side, she saw Sarah lying a few feet away, masturbating, her hand moving back and forth over her dark-brown mound. Just beyond Sarah, she saw Jim and Wanda, coupled together, fucking wildly. Jim had his arms under Wanda's legs, holding them in the air as he thrust his huge thick cock back and forth inside the willing redhead's pussy. Vivian could hear them both, gasping and groaning as Jim hammered his cock in and out of her.<br>\r\n<br>\r\n  \"Fuck me, fuck me harder.\" gasped Wanda. \"Ram it all in....gimme every inch.\"<br>\r\n<br>\r\n  Vivian heard Jim grunt as he thrust into her harder, driving his thick cock all the way into her well lubricated slit. His balls slapped lewdly against the naked flesh of Wanda's upturned ass. She could see his cock, covered with her hot juices, pumping wildly back and forth. He was giving her every inch and she was obviously enjoying every bit of it.<br>\r\n<br>\r\n  \"Yes....yes....that's it,\" Wanda cried out loudly. \"Harder! Harder!!! God!! I'm gonna... Oh God!! I'm cummmmiiinnnng!!! Fuck me.....fuck me, honey!!! Ram that big cock up my hot pussy!!!\"<br>\r\n<br>\r\n  Vivian watched as she saw Jim ram his cock deep into Wanda's love canal. She saw the cheeks of his ass tighten and she knew he was cumming also, squirting his sperm into Wanda's receptive pussy. The gasps and groans coming from the sated couple filled Vivian's ears.<br>\r\n<br>\r\n  Continuing to watch, Vivian saw Jim slowly pull his thick cock out of Wanda's pussy. She could see his grayish-white semen, oozing from Wanda's gaping slit, slowly sliding down into the crack of her ass. There was no doubt in Vivian's mind that what she was seeing was just a small amount of semen that he had pumped into Wanda's receptive pussy.<br>\r\n<br>\r\n  Her eyes fixed on the lustful scene in front of her, Vivian continued to watch as Jim wiped his cock on the dark red hairs of Wanda's pussy, then got to his feet and walked over to the couch, where he sat down and took a drink from one of the partially filled glasses on the end table nearby. She could see his wilting cock, lying between his thighs, glistening in the soft light that came from the lamp on the end table. It still looked huge, even though it was only half the size it had been when it was hard.<br>\r\n<br>\r\n  It was at that moment when Vivian realized that she wanted him to fuck her too. He had already fucked Sarah and Wanda and she wondered if he would be able to satisfy her burning desire. Deciding there was only one way to find out, she slowly got to her feet and walked over to the couch where Jim was sitting.<br>\r\n<br>\r\n  Kneeling down on the floor in front of the couch, she looked up at Jim, her eyes meeting his. Placing her hands on the inside of his knees, she pushed his legs apart and without taking her eyes from his, she wrapped her fingers around his thick cock, squeezing it softly. Then, taking her eyes from his, she leaned forward and guided his cum-covered cock into her mouth. Slowly, she began bobbing her head back and forth, sucking on his cock, her tongue swirling around the bulbous head. She moaned as she felt his cock, twitch, then jerk as it started to grow, coming to life inside her hot mouth. Faster and faster she moved her head, taking him deeper and deeper into her mouth. His cock grew hard, filling her mouth to capacity. Hungrily, she sucked on his cock, her tongue flicking back and forth over the dark-red knob, swirling around it wildly. He was fully erect now, ready for another round with the wanton, lust-crazed housewife kneeling in front of him.<br>\r\n<br>\r\n  Reaching down, Jim pulled Vivian up to him, their lips meeting in a long passionate kiss. His hands wandered over her naked flesh, caressing and squeezing her full, lush breasts. He toyed with her nipples, which were rock hard, rolling them between his thumb and forefinger. Hearing her soft moans of desire, he slipped one hand between her thighs, running his fingers over her soft mound. Hot juices oozed from her pussy, coating his fingertips with a sticky wetness.<br>\r\n<br>\r\n  Quickly getting up from the couch, he turned and pushed Vivian down into a kneeling position on the floor, her ass sticking up invitingly. Kneeling down behind her, he guided his rigid shaft to her waiting pussy. Pushing slightly, he eased the dark-red head of his cock into her slit. Then, placing his hands on her hips, he thrust his hips forward, driving his cock deep into her hot, slippery love channel in one quick thrust.<br>\r\n<br>\r\n  \"Oh! Ooooooooh God!\" gasped Vivian as she felt his cock plunging deep inside her. \"Wait!! God!! It's...It's....Ohhh, God!! It's big!!! Jesus!!! It...it...it feels like you're ripping me in two!! Ohhhhhhhhhhh, God, it hurts....but...it feels soooooooo good!!\"<br>\r\n<br>\r\n  Ignoring her cries, Jim rammed his cock deeper and deeper into her juicy, wet slit, stopping only when his belly slapped up against her naked buttocks. Gripping her hips tightly, he began pumping back and forth, ramming his huge cock deep into her burning-hot, juicy pussy. He felt the head of his cock bumping up against her womb, which only drove him to thrust into her even harder.<br>\r\n<br>\r\n  Vivian tried to move away from him, but his fingers dug into her flesh, holding her even tighter as he hammered his rampaging cock into her slippery pussy. Faster and faster he moved, his huge, thick cock plunging back and forth with wild abandon, penetrating deeper than she had ever been penetrated before.<br>\r\n<br>\r\n  She gasped as she felt the head of his cock battering against her womb. It hurt, yet, at the same time, it felt so good. Turning her head to one side, she groaned in pain and pleasure as he hammered his huge cock into her in a wild frenzy of lust.<br>\r\n<br>\r\n  \"It's....ughhhhh....so.....ughhh...big!\" she gasped, as the pain turned to sheer pleasure. \"God!!! Yes!! Fuck me!!! Fuck me, Jim!! Harder! Harder!!! Ram it up my hot pussy!!! Yes! Yes!!! That's it!!! Give it to me...gimme every fuckin' inch!! God!!It feels soooooooo good!!!\"<br>\r\n<br>\r\n  His fingers digging into her soft, naked flesh, Jim held her tight, rivulets of sweat running down his face as he hammered his cock into her hot, juicy hole. He gasped for breath as he rushed to consume his lust. Taking one hand from her hip, he grabbed her shoulder, pulling her back to him as he thrust hard into her.<br>\r\n<br>\r\n  Vivian was caught up in her own lust now, pushing back against him, wanting to feel his cock even deeper inside of her. The inside of her pussy felt like it was on fire. She felt a tingling inside of her unlike anything she had ever felt before and a hot glow coursed through her body.<br>\r\n<br>\r\n  Gasping loudly, she cried out, \"Oh, God!!! I'm....I'm gonna...Yes! Yes!! I'm cumming! Oh God! I'm cuuuummmmmmiiiiiinnnnnggggg!\"<br>\r\n<br>\r\n  Hearing her cry out, Jim pounded his cock into her faster and harder, rushing to his own orgasm. He felt the slippery walls of her vagina spasm around his thrusting shaft, gripping it tightly, seemingly trying to milk the sticky, hot semen from his wildly swinging balls.<br>\r\n<br>\r\n  Pulling back until only the thick bulbous head of his cock was inside her, he dug his fingers deep into her naked, sweaty flesh. Driving his hips forward, he rammed his long, thick cock into Vivian's spasming pussy and exploded, spewing his hot, milky-white semen deep inside of her. He gasped loudly as stream after stream of hot, sticky cock-cum shot from his wildly jerking cock into her spasming love canal. Both of them were shaking uncontrollably, feeling weak and drained by the intenseness of their orgasms.<br>\r\n<br>\r\n  As Jim slowly pulled his cock from Vivian's cunt, she collapsed to the floor, soft murmurs of fulfillment coming from her lips. Looking around, Jim saw a pair of black nylon panties lying nearby. Picking them up, he wiped the sticky wet juices from his cock and dropped the soiled panties to the floor.<br>\r\n<br>\r\n  Standing up on quivering legs, he looked around the room, surveying the lustful scene in front of him. Wanda was lying on the floor, a glazed look of total satisfaction in her eyes. Looking down at her still splayed legs, he could see small globs of his semen oozing from her gaping cunt and slowly sliding down to the crack of her ass.<br>\r\n<br>\r\n  Vivian was lying on her side, breathing softly, her body trembling occasionally as her orgasms slowly began to subside.<br>\r\n<br>\r\n  Sarah was lying on the floor beside Wanda, one hand between her thighs, her fingers slowly rubbing back and forth over her pussy. She looked up at him, her eyes inviting. She smiled, then slowly ran the tip of her tongue over her lips.<br>\r\n<br>\r\n  \"You're not going to leave, are you?\" she asked, her voice a soft, husky whisper, as she continued to move her fingers back and forth over the top of her slit.<br>\r\n<br>\r\n  Ignoring her query, Jim moved to the couch and sat down. His legs felt weak and unsteady and he was still trying to get his breath.<br>\r\n<br>\r\n  \"Damn, this is crazy!\" he thought as he looked at the three women lying on the floor in front of him. \"I'm getting more pussy in one night than most guys get in a month.\" <br>\r\n<br>\r\n       <br>\r\n  <br>\r\n    <br>\r\n    <br>\r\n   </span></div></div>",
            "created":1004418000,
            "id":549615,
            "title":"Vivian Takes Him On"
        },
        "13111111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Wanda gets her wish"
            ],
            "content":"<div class=\"\"><div> <span>  Picking up a half-filled glass from the table beside the couch, Jim took a drink, then placed the glass back on the table. Taking a deep breath, he sat back on the couch, trying to decide if he should get dressed and leave or wait and see what happened next.<br>\r\n<br>\r\n  He watched as Sarah rolled over and slowly got to her feet. Slowly, she walked over to where he was sitting, her breasts swaying slightly with her movements. Stopping in front of him. she stood there, letting his eyes wander over her naked body. Then, slowly sinking to her knees, she pushed his legs apart and wrapped her hand around his flaccid penis.<br>\r\n<br>\r\n  \"Oh my!\" she said as she slowly began to move her hand back and forth on his cock. \"I'm gonna have to do something about this.\"<br>\r\n<br>\r\n  Leaning forward, she slowly began to kiss and caress his cock, her tongue flicking out, swirling around the dark-purple knob. A low, soft groan came from Jim's lips as he felt his cock growing hard once again. Looking down at her, he saw her looking up at him, a devilish twinkle in her eyes as she took his cock into her warm, wet mouth.<br>\r\n<br>\r\n  Closing her lips around his growing cock, she began moving her head back and forth, sucking on his cock as her tongue swirled around the head. Her eyes were still locked on his, watching for his reaction to her teasing caress.<br>\r\n<br>\r\n  Jim looked down at the sultry blonde, watching as she took him deeper and deeper into her mouth. His cock had quickly grown to a full state of arousal. her hand was pumping up and down on his cock, faster and faster. Her head bobbed up and down rhythmically, twisting occasionally from side to side. Opening her mouth, she gasped for breath, then pushed her head forward, trying to take him even deeper into her mouth. her body jerked as she gagged, choking as the head of his cock slammed into the back of her mouth.<br>\r\n<br>\r\n  Placing his hands of her shoulders, Jim gently pushed her back until his cock slid out of her sucking mouth. She looked up at him, coughing as she got to her feet and knelt down on the couch, her legs straddling him. Jim pulled her to him, taking the nipple of her breast into his mouth, sucking on it. His teeth bit down lightly on her taunt, erect nipple, causing her to moan softly.<br>\r\n<br>\r\n  Slipping one hand down between her thighs, he ran his fingers over the swollen lips of her pussy, feeling the burning heat that came from inside her. the sticky, wet juices that oozed from her slit coated his fingers as he stroked her.<br>\r\n<br>\r\n  \"Stick it in!!\" she gasped as she raised up, wrapping her arms around his neck. \"Stick it in and fuck me.......fuck me now!!!\"<br>\r\n<br>\r\n  Wrapping his hand around his hard cock, he guided the bulbous head to her opening, rubbing it back and forth over her slit, coating it with her juices. Then, as the head of his cock parted the lips surrounding her opening, she slowly lowered herself down on him, groaning lustfully as she felt his hard shaft sliding up into her welcoming vagina.<br>\r\n<br>\r\n  Deeper and deeper he slid into her, stretching the walls of her cunt with his thick, hard shaft. Placing her hands on his shoulders, Sarah began moving her body up and down, riding his hard cock. With each downward motion, she took him a little deeper, gasping as she felt his prick sliding into her depths.<br>\r\n<br>\r\n  \"Oh God!!\" she gasped as she bucked up and down wildly, riding his cock like a woman possessed. \"That feels good.....ughhh.....give it to me.......unghhh.....gimme every inch, honey.....unghhhh.......Oh, fuck........unghhh.......it's good!!!\"<br>\r\n<br>\r\n  Leaning back on the couch, Jim brought his hands up to her breasts and began fondling and squeezing them. Taking her nipples between his thumbs and forefingers, he rolled and pinched them. Looking up at her, he saw that she had her head back, turning it from side to side as she bounced up and down on his hard cock.<br>\r\n<br>\r\n  \"Oh fuck, that feels good!!!\" she groaned as she pushed downward, taking his cock even deeper inside her. \"Give it to me, honey.....ram that big cock up my hot pussy.....Oh, fuck.....that feels sooooooooooooo good!!!\"<br>\r\n<br>\r\n  Another gasp came from her lips as she felt the head of his cock bang against her cervix. Consumed with wanton lust, she raised up, then slammed back down again, seeming trying to ram his cock into her womb. Faster and faster she moved, up and down, up and down, bucking wildly on top of him, her slippery juices coating his shaft.<br>\r\n<br>\r\n  Just then, he felt a weight beside him and turning his head, he saw Wanda kneeling on the couch beside him. Leaning forward, she brought her lips to his, kissing him, her tongue plunging into his mouth, swirling, battling with his tongue. Her hand ran over his chest, caressing his flesh.<br>\r\n<br>\r\n  Sarah was bouncing up and down wildly now, riding his thick, hard shaft like a woman possessed. Her breasts bounced up and down, jiggling and shaking with her gyrations of lust. She turned her head from side to side, gasping and moaning, crying out her throes of passion.<br>\r\n<br>\r\n  \"Oh, fuck!!! she gasped, ramming her body downwards, taking his cock as deep as she could. \"Give it to me, honey......give it to me now.....shoot that hot cock juice up my pussy.....fill my hot cunt with your love juice......\"<br>\r\n<br>\r\n  Her fingers gripped on his shoulders, her fingernails digging into his flesh.<br>\r\n<br>\r\n  \"Now!! Now! Give it to me, Honey!!!\" she cried out loudly. \"I'm gonna....ughhh....Oh, God! I'm gonna.....Oh, Yes.....yes.....I'm cumming......Oh God!! I'm cumminnnnggggggg!!!\"<br>\r\n<br>\r\n  Jim groaned into Wanda's mouth as Sarah rammed her body down hard on his cock. He could feel her body stiffen for a moment, then shake and tremble violently as she reached a huge, earth-shattering orgasm. Hot, sticky juices gushed from her cunt, coating his cock and balls.<br>\r\n<br>\r\n  Pushing Wanda back, Jim looked up at Sarah. She was gasping for breath, her mouth hanging open, her eyes had a glazed over look. Trembling and shaking, she rolled to one side, flopping on to the couch, dislodging his still hard cock from her slippery sheath with a plopping noise. She just laid there, gasping for breath, her breasts heaving with each intake of air.<br>\r\n<br>\r\n  Turning to look at Wanda, he saw that she had laid back on the couch, her legs spread completely apart, one leg on the floor, the other up on the top of the couch. <br>\r\n<br>\r\n  \"My turn, honey,\" she said in a hushed, sultry voice. \"I've got a hot pussy that really needs a good hard fucking......that is.....if you're up to it.\"<br>\r\n<br>\r\n  <br>\r\n <br>\r\n<br>\r\n    </span></div></div>",
            "created":1214715600,
            "id":549660,
            "title":"Wait and see what happens next"
        },
        "131111111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "A knock at the door",
                "Jim dresses and leaves"
            ],
            "content":"<div class=\"\"><div> <span>  Pushing himself up from the couch, Jim turned towards Wanda, his eyes sweeping over her naked, curvaceous body. Wanda looked up at him, the tip of her tongue moving slowly over her red lips. His eyes moved downward, taking in her full, lush breasts, rising and falling with each breath. He saw her nipples were erect, jutting out enticingly, begging to be fondled, teased, and sucked. Lowering his gaze, he took in the dark red hairs which topped her pubic mound. He could see that she kept it trimmed, probably for when she wore a bikini to the beach or the pool.<br>\r\n<br>\r\n  Reaching down, he grabbed her legs behind the knees and pulled her towards him, positioning her so that she was lying on the couch, with her buttocks hanging over the edge and her feet on the floor. Dropping to his knees between her legs, he ran his hand over her pussy, gently caressing and teasing her slit with the tips of his fingers. Parting the swollen lips which surrounded her opening, he lightly began to move his thumb in tiny circular motions, teasing her swollen, erect clitoris.<br>\r\n<br>\r\n  \"Oh God, don't tease me.\" she moaned in a soft, husky voice. \"I'm ready, honey.....my pussy feels like it's on fire.\"<br>\r\n<br>\r\n  A slight smile came to Jim's lips as he slid two fingers inside her and began to slowly moved them back and forth, finger-fucking her while he teased her clit.<br>\r\n<br>\r\n  \"Ohhhh......ohhhhh, God!\" she gasped, her hips bucking up to meet his hand. \"Fuck me, damn you.....Please........I want you to fuck me!\"<br>\r\n<br>\r\n  Just then, having got up from the floor, Vivian walked over and sat down on the couch next to Wanda. Turning slightly, Vivian cupped her hand under Wanda's breast and squeezed it tenderly. Then, bending her head, she leaned over and took Wanda's nipple into her mouth, sucking on it. Jim could see that she was using her tongue, flicking it back and forth over the redhead's taunt, succulent nipple. Pulling his fingers from Wanda's slippery, well-lubricated slit, he placed his hands on the insides of her knees and spread her legs wide apart. Lowering his head, he put his mouth on her mound, nibbling and kissing the swollen lips which surrounded her love tunnel. His tongue shot out, finding the erect nub of her clitoris and began flicking back and forth, teasing her.<br>\r\n<br>\r\n  \"Oh! Oh...ohhhhh, my god!\" Wanda hissed thru her clenched teeth. \"Oh yes....yes....eat me.....suck my tits......eat my pussy......ohhhh, fuck!!  Lick it, honey.....lick my clit...suck it....Ohhhh, fuck!! Lick it!!! Yes!! Yes!!! That's it! Right there...oooooh, fuck....that feels so fucking good.....ohhhhhh,,,,,so fucking good!!!\"<br>\r\n<br>\r\n  Wanda started bucking her hips up and down, slamming her pubic mound against his teeth, pressing her gyrating pussy into his face. Jim wrapped his arms around her thighs, placing his hands on her abdomen, pushing downward, trying to keep her from slamming into his mouth so violently. He could feel her thighs quivering and shaking, her body trembling uncontrollably as her unbridled passion mounted, begging for release. Hot, sticky juices flowed from her slit, coating Jim's tongue, lips, and face with her sweet nectar of desire.<br>\r\n<br>\r\n  \"Ooooooooh, God!\" gasped Wanda, her voice quivering with lust. \"Fuck me!! Fuck me now.....please......please fuck me....I'm....I'm so.....I'm so fucking hot.....please....please fuck me.....fuck me.....fuck me now, dammit!!!\"<br>\r\n<br>\r\n  Lifting his head, Jim looked up at Wanda. Her eyes has a glazed over look as she tossed her head from side to side. Her hands were on her breasts, squeezing and fondling them, occasionally pinching her nipples between her thumb and forefinger.<br>\r\n<br>\r\n  \"Fuck her!!! Fuck her now, Jim!!\" hissed Vivian in a throaty, lust filled voice. \"Stick that big cock up her hot pussy and fuck her!!! Fuck her brains out!!!<br>\r\n<br>\r\n  Wrapping his hand around his thick, hard shaft, Jim guided the dark-purplish knob to Wanda's opening and slowly began to move forward, pushing his throbbing cock into Wanda's wet, slippery love channel.<br>\r\n<br>\r\n  \"Give it to her, Jim!\" voiced Vivian as she watched his cock sliding deeper and deeper in Wanda's cunt. \"Shove that big cock up her hot pussy! She wants it....give it all to her, Jim! Fuck her!!! Fuck her good!! Ram it up her pussy....Fuck her!! Fuck her hard!!!!\"<br>\r\n<br>\r\n  Placing his hands on the outside of Wanda's hips, Jim thrust into her, driving his cock into her very depths. Pulling back slightly, he thrust forward again, pushing forward until the entire length of his mammoth cock was buried in the redhead's hot pussy. Then, gripping her hips even tighter, he started moving his hips slowly back and forth, withdrawing his cock until only a couple of inches remained inside of her, then pushing back into her until his cock was completely buried in her wet, slippery sheath.<br>\r\n<br>\r\n  \"Ohhhhh!  Ohhh, God!!!\" gasped Wanda, moaning softly with each thrust as she felt his huge cock plunging deep into her burning cunt. \"It's......unghhh.....so big.....ughhhh.....give it.....ughhhhh.....to me.......unnnnhh......gimme every....ughhh,,,,inch.\"<br>\r\n<br>\r\n  Jim continued his rhythmic motions, ramming his cock deep inside her, then, pulling it back until only a couple of inches were still inside her. He focused her eyes on her large breasts, watching as they jiggled, bounced and swayed in rhythm with his thrusting motions. He saw that her nipples were fully erect, jutting out from her lush breasts like slightly rounded daggers.<br>\r\n<br>\r\n  \"Yes!! Yes! That's it, Honey!\" she gasped as she dug her fingers into the seat cushion of the couch. \"Give it to me.....ughh.......harder.....unghh......harder.......ughhhh...fuck me harder......ram it in.......uuughh.....all the way in.....ughhh.....oh, fuck...harder...... unghhhh.....yes......that's it.....unghhhh.......tear my hot pussy up!!!<br>\r\n<br>\r\n  Jim had increased the tempo now, incited by Wanda's lust-filled cries, his hips moving back and forth faster now, his hard cock hammering into her slippery sheath, penetrating her to the very depths of her vagina. Gasping for breath, he tightened his grip on her hips, digging his fingers into her soft flesh, holding her so tight that the mark of his fingers would bruise her flesh for days to come. Overwhelmed with lust and desire, Jim and Wanda gasped and groaned as they raced to satisfy the burning passion that threatened to consume them both.<br>\r\n<br>\r\n  Aroused by the erotic scene in front of them, Vivian and Sarah had turned to each other for satisfaction. Sarah was lying on the couch, one foot up on the back, the other on the floor, her legs completely spread apart, and Vivian was on top of her, facing in the opposite direction. Both of them had their heads between each other's legs and it was quite obvious from the muffled moans and gasps that came from them that they were eating one another.<br>\r\n<br>\r\n  \"Mmmmmm......lick it, Sarah,\" gasped Vivian as she lifted her lips from Sarah's pussy. \"Lick it good.....yes.....yes......that's it......put your tongue inside me.....oh, God, yes......yes.......that's it!!!!\"<br>\r\n<br>\r\n  Glancing over, Jim saw Vivian bracing herself on one arm as she slid her fingers in to Sarah's slippery cunt. He watched as she started pumping her fingers in and out of Sarah's juicy slit. The muffled moans that came from between Vivian's thighs told him that Sarah was obviously enjoying what Vivian was doing to her. Pulling her fingers out of Sarah's pussy, she began rubbing her fingertips over Sarah's clit in tiny circular motions, faster and faster. <br>\r\n<br>\r\n  Oblivious to what was going on beside her, Wanda was crying out loudly as she felt her body surging towards a mind-blowing orgasm. Writhing and twisting on the couch, she bucked her hips up and down wildly, trying to get Jim's cock even deeper into her hot, burning cunt.<br>\r\n<br>\r\n  \"Fuck me.....fuck me harder!\" she gasped, grabbing her tits in her own hands and squeezing them hard. \"Ram it in.....ram it all the way in.......Oh, yes....harder....harder.... give it to me......give it all to me......harder.......harder!!!\"<br>\r\n<br>\r\n  Jim was pumping into her furiously now, his hips moving back and forth like a jack-hammer, his cock plunging in and out of her hot, slippery sheath. A groan came from his lips as he felt the semen boiling up in his swaying balls, and he knew he was only moments away from filling the redhead's cunt with his hot, sticky semen.<br>\r\n<br>\r\n  Sarah and Vivian were wiggling and jerking beside them, both women with their heads between the other's legs now, their tongues flicking back and forth wildly, teasing and taunting the other's clitoris to a high state of arousal. Having completely lost any inhibitions they may have had, the only thought either of them had was to satisfy the raging lust that was burning deep inside their burning-hot, juicy cunts.<br>\r\n<br>\r\n  Muffled moans of desire and lust came from both of them as they buried their heads between each other's legs. Occasionally, one or the other would pull her mouth away from the other's pussy, gasping for air as she cried out lewdly, urging each other to continue what they were doing. <br>\r\n<br>\r\n  \"Yes! Right There!\" cried out Sarah, her hips bucking up and down wildly. \"Lick it!! Lick it, Viv......mmmm.....faster......faster.......mmmmm.......Jesus!!! I'm......I'm gonna.....oohhh, yes.....yes....I'm gonna cum......Oh God! Yes!!! I'm cummmmmiiiiinnnngggggggg......Oh God!! YES!!! YES!! I'm cuuummmmmmiiinnnnnnngggggggggggg!!!!!!!!!!\"<br>\r\n<br>\r\n  \"Faster, Sarah!\" Vivian gasped at nearly the same time, raising her head from Sarah's pussy lips to breath. \"Lick it!!! Lick my clit......harder.......faster.......oooohhh.....that<br>\r\ns it.....right there......lick it.....lick my clit.....oh, God!!! I'm.....mmmmm......almost..... mmmmm....there...faster.....faster......ooooooh......yes!! Yes! You're making me cum....Oh, god!!!! Yes!!! Yes!!!! I'm cumming.......I'm cumming now.......Oh fuck, I'm cummmmmiiiinnnngggggg!!!!!\"<br>\r\n<br>\r\n  Placing her head back between Sarah's quivering thighs, she licked and sucked on the other woman's pussy as her body jerked and spasmed with her own orgasm. Sarah's buttocks lifted from the couch, her legs quivering and trembling as she felt what could only be described as lightning bolts of sheer pleasure seemingly exploding deep inside her vagina, enveloping her entire body with wave after wave of pleasure. Her thighs clamped tightly around Vivian's head as she bucked her hips up and down wildly, moaning as she plunged her tongue as far as she could in Vivian's slippery hole, lapping up the warm, sticky juices that gushed and flowed into her mouth in a torrent of lust.<br>\r\n<br>\r\n  Incited by the vision of the two women beside him on the couch, Jim furiously rammed his throbbing, pulsating cock deep into Wanda's hot pussy, seeking the explosive climax which was only seconds away. His fingers dug into the soft flesh of her hips as he tried to drive his cock even deeper into the wanton redhead's slippery love tunnel. Their sweaty flesh slapped together lewdly, filling the room with the sounds of their lust.<br>\r\n<br>\r\n  \"NOW!!! Now!!!\" hissed Wanda through clenched teeth. \"Give it to me!!! Gimme that hot juice.....I'm ready......cum......cum, honey......shoot that hot cock juice up my pussy....give it to me.......now.....Now!!!! Ooooooooh, fuck........yes....YES!!!! I'm......I'm cummmmmiiiiingggg.......Oh God......I'm cuuuummiiiiinnnnnnggggggg!!!!!!!!!!!!\"<br>\r\n<br>\r\n  Pulling his hips back until just the head of his cock was inside her, Jim tightened his hold on her hips, then slammed his hips forward, driving his thick, rock-hard shaft deep into her spasming vagina. A deep, gutteral gasp of lust came from his lips as he felt his cock erupting inside her, spewing stream after stream of sticky, molten-hot semen into Wanda's hot cunt. His body trembled and his legs grew weak as he emptied his hot seed into the redhead's burning-hot cunt.<br>\r\n<br>\r\n  \"Yes!!! Oh, yes! \"shouted Wanda, her hips bucking up to meet Jim's violent thrust. She could actually feel his semen spurting into her, filling her with his hot seed. The inner walls of her vagina spasmed around his throbbing, pulsating cock, seeming as if it were trying to milk every drop of semen from his balls. Her eyes rolled back in her head and her mouth fell open as a huge orgasm exploded deep inside her. \"Ohhhhhhh........ohhhhhh, god! Yes!! Yesssssssssssssssssssssss!!!!!!!<br>\r\n<br>\r\n  Completely spent for the moment, Jim fell forward, collapsing on top of Wanda, his head resting on her soft, supple breasts. A soft hush fell over the room, interrupted only by the soft music which still came from the stereo speakers across the room and the gasping, labored breathing of the four naked people on the couch, their bodies quivering, shaking and trembling as they slowly began to recover from their lewd, adulterous actions. An occasional murmur of sexual satisfaction came from the lips of first one, then another, as all of them were too spent to even speak at the moment.<br>\r\n<br>\r\n</span></div></div>",
            "created":1214888400,
            "id":554361,
            "title":"Wanda gets her wish"
        },
        "1311111111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Sarah's Friend, Diane Coltrane"
            ],
            "content":"<div class=\"\"><div> <span>  Taking a deep breath, Jim slowly pushed himself up from the couch, his semi-hard cock slipping out of Wanda's slippery, semen-filled vagina.  Getting to his feet, he stepped back from the couch, his legs trembling unsteadily as he looked at the three women lying on the couch in front of him.<br>\r\n<br>\r\n  Wanda was sprawled partially on the couch, her feet on the floor and her legs spread completely apart. Her large, supple breasts, the nipples jutting out invitingly, rose and fell slowly as she labored to get her breath. Glancing down between her thighs, he could see his semen, mixed with her juices, slowly oozing from her gaping slit.<br>\r\n<br>\r\n  Looking over at Sarah and Vivian, he saw them lying side by side now, their hands and fingers slowly wandering over each other's naked flesh, touching and caressing one another as they slowly recovered from their passionate, lustful tryst. Sarah's cheeks and chin glistened in the light with the sticky juices that had gushed from Vivian's cunt when she had reached an orgasm. Her blond hair was mussed, giving her the appearance of a woman who had just got out of bed. <br>\r\n<br>\r\n  Bending at the waist, Jim picked his trousers up from the floor and put them on, his knees shaking unsteadily as he did so. He looked around for his shirt but, couldn't see it. Clothing was scattered all over the room, a dress here, a pair of women's panties there, a bra hanging over the arm of the lounge chair, another dress lying on the floor in the middle of the room. It was quite obvious that all of them had been caught up in their lustful desires and had removed their clothing without any regard as to the well-being of their clothing.<br>\r\n<br>\r\n  Feeling an urge to urinate, Jim walked across the room, gingerly stepping over the clothing that was scattered all about, heading for the bathroom which he figured would be somewhere down the hallway which led to the back bedrooms.<br>\r\n<br>\r\n  As she saw Jim leaving the room, Sarah slowly rolled to one side and pushed herself up to a sitting position on the couch. Bringing her hand up to her face, she wiped at the sticky juices on her chin. Looking around the room, she saw the same thing that Jim had seen, clothing scattered everywhere, partially filled glasses on the tables, ashtrays filled with cigarette butts. A slight smile came to her lips as she recalled some of the drunken, lust-filled events that had taken place in the room during the course of the evening. Wanda, Vivian, and herself had completely lost any inhibitions that they might have had and had acted like sex-crazed sluts in their desire to sate their sexual lust. <br>\r\n<br>\r\n  Getting to her feet, Sarah just stood there for a moment, swaying unsteadily as she tried to clear the alcohol induced fog from her head. She thought about what had occurred during the evening and as she did so, she felt a soft glow of warmth course through her body. Although she had been thoroughly fucked by Jim and had experienced another orgasm with Vivian, she wanted more. Slipping one hand down between her thighs, she slid her fingers over the puffy, swollen lips of her pussy, feeling the burning heat of her desire on her fingertips. <br>\r\n<br>\r\n  Turning, she slowly walked around the room, picking up a few of the half-filled glasses and taking them into the kitchen. Her nipples jutted from her breasts, growing hard once more as she thought about the pleasure she had felt when Jim had fucked her. Placing the glasses in the sink, she turned and walked back to her bedroom, where she retrieved a sexy silk robe from her closet and put it on. Securing the belt snugly around her waist, she walked back down the hall to the front room, hoping that the wild night of lust was not over. Sarah wanted more.<br>\r\n<br>\r\n  Just as she got to the doorway leading into the front room, she heard a knock at the door. Stopping abruptly, she stood there, unmoving, staring at the door in sudden shock and disbelief. Glancing quickly at the clock on the wall, she saw that it was nearly three o'clock in the morning.<br>\r\n<br>\r\n  \"Who in the hell could that be?\" she gasped in a hushed whisper, standing frozen in the doorway. \"It's three o'clock in the morning.\"<br>\r\n<br>\r\n  \"Oh my God!!!....\" gasped Vivian, jumping to her feet in a panic and hurriedly looking around the room for her clothes. \"What if it's our husbands?\"<br>\r\n<br>\r\n  \"It can't be them,\" whispered Wanda as she slowly pushed herself up to a sitting position on the couch, leaving traces of semen on the couch between her thighs. \"Bill would have used his key and just walked in.\"<br>\r\n<br>\r\n  Quickly walking over to the window, Sarah cautiously moved the curtain a little so she could look outside. Turning back to Wanda and Vivian, she said in a hushed voice, \"There's a car in the driveway.....right behind Jim's......\"<br>\r\n<br>\r\n  Then, gingerly stepping over all the various articles of clothing that were scattered all over the floor, she walked to the door and cautiously peered out the tiny peephole in the door. Stepping back from the door, Sarah turned and silently motioned for everyone to follow her to her bedroom.<br>\r\n<br>\r\n  Quickly following her into the bedroom, the three of them watched as Sarah adjusted her robe and retied the belt around her waist.  Brushing a strand of hair from her eyes, she looked at Jim, Vivian, and Wanda. Jim was wearing trousers but, both Vivian and Wanda were completely naked. <br>\r\n<br>\r\n  \"It's Diane Coltrane!\" hissed Sarah as she faced Vivian and Wanda. \"I'm gonna have to answer the door before she wakes up the whole damn neighborhood. You guys wait here and I'll see what the hell she wants.\"<br>\r\n<br>\r\n  Then, turning quickly, she walked out of the room, calling out as she walked, \"Hold on, dammit! I'm coming.\"<br>\r\n<br>\r\n<br>\r\n        </span></div></div>",
            "created":1215707160,
            "id":722198,
            "title":"Uninvited Guest"
        },
        "13111111111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "An Orgy Of Lust"
            ],
            "content":"<div class=\"\"><div> <span>  Walking to the front door, Sarah unlocked the door and opened it, stepping to one side as she did so.<br>\r\n<br>\r\n  \"It's about time.\" said Diane as she brushed by Sarah and entered the room. Turning, she looked at Sarah as she spoke to the young man who was still standing outside the door. \"Well...come on in, honey.\"<br>\r\n<br>\r\n  The young man nodded at Sarah as he entered, then stood silently as Sarah closed the door behind him.<br>\r\n<br>\r\n  '''We were in the neighborhood and thought we would see if you were still up.\" said Diane as she looked around the room, taking in the various articles of clothing scattered about the room. \"I thought you might like some company seeing as your ol' man's gone for the weekend but, from the looks of things, we might have missed the party.\"<br>\r\n<br>\r\n  Sarah saw Diane looking around the room and realized there was nothing she could say to hide the fact that something had been going on in the room prior to Diane's arrival.<br>\r\n<br>\r\n  \"Yeah, well....I do have some company,\" stammered Sarah as she saw Diane walk across the room and pick up a pair of women's panties from the floor. \"We were....ah...just having a few drinks and...ah...you know...just talking and things.\"<br>\r\n<br>\r\n  \"Looks to me like a hell of a lot more than just talking was going on.\" said Diane as she spun the filmy panties around her index finger, a knowing smile on her lips. \"By the looks of things, I would say there was definitely a hell of lot more going on in here than just talking.\"<br>\r\n<br>\r\n  \"Well, hell....okay...if you must know, Diane....yes...we were having a lil' party.\" said Sarah as she snatched the panties from Diane's finger and stuffed them into the pocket of her robe. \"As a matter of fact, I was having a hell of a time until you and....and....what's his name here knocked on the door and interrupted us.\"<br>\r\n<br>\r\n  \"Oh! I'm sorry.\" said Diane as she walked over and stood beside the young man who had been accompanying her. \"This is Ray....he's a friend of mine....a really close friend if you know what I mean. Ray...this is my friend, Sarah, who's husband just happens to be gone for the weekend.\"<br>\r\n<br>\r\n  Sarah and Ray looked at one another, nodding in recognition as Diane introduced them. Sarah couldn't help letting her eyes wander over the handsome young man who appeared to be in early twenties. Judging by his appearance and bearing, Sarah immediately guess that he was in the military.<br>\r\n<br>\r\n  \"Sarah, the real reason I came over is, Ray and I need a place to spend the night.\" said Diane as stepped away from Ray and grabbed Sarah's arm by the elbow. Gently pushing her into the kitchen, Diane continued. \"Stan thinks I'm out of town visiting my sister and Ray....well....Ray is in Stan's platoon and lives in the barracks so we sure as hell can't go there. Neither one of us has enough money for a motel room....and then....well....I thought of you so....here we are. Guess I should have called first, huh?\"<br>\r\n<br>\r\n  Leaving Ray standing alone in the living room, the two women entered the kitchen where they stopped and began talking in hushed whispers. Both women confided in one another often and both of them were fully aware that both of them cheated on their husbands on a regular basis.  As she listened to Diane, it became quite apparent to Sarah that Ray was Diane's current lover and that she was being asked to provide them a place to spend the night.<br>\r\n<br>\r\n  When Diane stopped talking, Sarah stood silent for a few moments, trying to figure out in her mind what she should do. The biggest problem was that she now had two different groups of people in her house and she wasn't sure how each would react to the presence of the other group. The only thing she could think of was to get them together and hope for the best.<br>\r\n<br>\r\n  \"Look Diane....I've got a bit of a dilemma here.\" she said, looking Diane straight in the eye. \"There are three people in my bedroom right now....and you know them all....and well....we were all really gettin' it on, you know...and well....the only thing I can think of is....you and uh...Ray...yeah...Ray....the two of you are going to have to be willing to join right in. Do you understand what I'm trying to say here?\"<br>\r\n<br>\r\n  \"Uh...I think so.\" replied Diane. \"It sounds like you all were having some kind of sex party and you're asking if we would be willing to participate....is that it?\"<br>\r\n<br>\r\n  \"Well, I guess you could call it a sex party.\" said Sarah, a slight smile forming on her lips as she thought about some of the things that had taken place earlier in the living room. \"Actually, it was more like an orgy.\"<br>\r\n<br>\r\n  \"Ohhh my God!!!\" gasped Diane, bringing one hand up to her mouth. \"You...you were having an orgy??? You were having a fuckin' orgy....right here....in your living room? With who?? No....don't tell me....I don't care who it is...hell...you know me....I'm game for anything....hell yeah....let's have an orgy!!!\"<br>\r\n<br>\r\n  \"What about your boyfriend...???\" asked Sarah, nodding her head towards the living room.  \"I mean...he's young and he would most likely love it but....can he be trusted to keep his mouth shut?? I dont want this getting all over the fuckin' post...you know.\"<br>\r\n<br>\r\n  \"Ray?? Hell yeah...I trust him.\" said Diane as she looked past Sarah into the living room. \"He won't say anything...and just to be sure...I'll tell him if he says anything I'll never see him again.\"<br>\r\n<br>\r\n  \"Okay...you tell him that....and make sure he understands.\" said Sarah.<br>\r\n<br>\r\n  Diane walked into the living room, spoke to Ray for a few moments and then turned back to face Sarah, a big grin on her face. Seeing that, Sarah entered the living room. Walking right up to Diane, she looked her in the eye, a devilish smile forming on her lips. Having decided she needed to see just how willing Diane was going to be, Sarah boldly slipped her arms around Diane's neck and kissed her on the lips, her tongue plunging into her mouth.  Seemingly unfazed, Diane responded, pressing her body up against Sarah, returning her kiss. Soft murmurs of passion came from both of them as they continued to kiss one another.<br>\r\n<br>\r\n  After a few moments, they stopped, stepping back, gazing into one another's eyes. Reaching out, Sarah pushed Diane's coat from her shoulders, letting it fall to the floor in a heap. Diane stood there, staring into Sarah's eyes as she waited for her next move. Reaching around behind her, Sarah unzipped Diane's dress and slowly pulled in from her shoulders, letting the top portion slip down to her hips. Wiggling slightly as she did so, Diane pushed the dress down over her hips, letting it fall to her feet. Although she wasn't cold, Diane's flesh shivered as she stood there, motionless, wearing nothing but a sexy black lace bra, a matching pair of filmy black panties, and her hi-heels. Looking over Sarah's shoulder, Diane saw that Ray was intently watching them, his mouth hanging slightly open in disbelief.<br>\r\n<br>\r\n  Quickly moving around behind her, Sarah unhooked Diane's bra, slid the straps from her shoulders and let it fall to the floor at Diane's feet. Slipping her hands under Diane's arms and around her body, Sarah cupped Diane's breasts, squeezing them tenderly. Diane's nipples stiffened, jutting out eagerly from her dark brown aureolas. A soft moan came from Diane's lips as she felt Sarah's fingers lightly brush over her nipples.<br>\r\n<br>\r\n  Looking over at Ray, Sarah could see the tell-tale bulge in his trousers. He was quite obviously enjoying what he was seeing but, due to his youthful inexperience or maybe a lack of confidence, he apparently wasn't sure if the two women wanted him to join them or if he should just continue watching them. <br>\r\n<br>\r\n  \"Well....don't just stand there, honey,\" said Sarah as she began lightly kissing Diane's neck and shoulders wile she fondled her breasts. \"Get your clothes off and join us!!!\"<br>\r\n<br>\r\n  Swallowing hard, Ray hurriedly began pulling his clothes off, not wanting to take his eyes from the two women in front of him.  Moments later, completely naked, Ray walked towards the two women, his hard cock sticking straight out in front of him. Stepping up to Diane, he lowered his head to breasts and took one of her nipples into his mouth, sucking on it hungrily.<br>\r\n<br>\r\n  Stepping back for a moment, Sarah quickly took off her robe and let it drop to the floor. Then, pressing her naked body up against Diane's back, she placed one hand on the back of Ray's head, pressing him tighter against Diane's breast. Moving her other hand around Diane's hip, she slowly slid it downward over her nylon panties until her fingertips felt the sticky wetness that was seeping through the thin material. Slowly, she ran her fingers back and forth over Diane's mound, tracing the slit between the swollen lips of her pussy. Moaning softly, Diane shifted her weight from one leg to the other, then back again, obviously enjoying what both Sarah and Ray were doing to her.<br>\r\n<br>\r\n  \"Take her panties off!\" hissed Sarah as she kissed Diane's neck. \"Get her panties off and let's move over to the couch.\"<br>\r\n<br>\r\n  Without taking his mouth from her breast, Ray reached down and grabbed the waistband of Diane's panties. Quickly pulling them down from her hips, he slid them down her to her ankles. Then, as Diane lifted first one leg, then the other, he slid them over her hi-heels and tossed them to one side. <br>\r\n<br>\r\n  Caught up in their lust, none of them were aware, nor did they probably even care, that they were now being watched by three sets of eyes from the nearby doorway which led to the hallway and the bedrooms in the rear of the house. Wanda, Vivian, and Jim, curious as to what was going on, had silently slipped from the bedroom and were now standing in the doorway, taking in the lewd actions of the three people in the living room. As they watched, none of them had any doubt as to what was about to take place and everyone of them was more than willing to join in and take part in what would undoubtedly be a wild night of uninhibited sexual lust.<br>\r\n<br>\r\n  </span></div></div>",
            "created":1267820580,
            "id":846333,
            "title":"Diane Coltrane and Her Friend"
        },
        "132":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "content":"<div class=\"\"><div> <span>  Waiting until all three women were safely inside Vivian's house, Jim backed his car out of the driveway and drove home. Walking into his own home, he thought about the three women and their invitation. If he had been anyone else, he probably would have taken them up on the offer of a nightcap. But, he wasn't.\r<br>\n  Walking into the bedroom, he undressed and got into bed. Moments later, he was asleep.</span></div></div>",
            "created":987829200,
            "id":43957,
            "title":"Jim Goes Home"
        },
        "14":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "See what  Wanda is doing?",
                "See what happens with Vivian & Sarah?"
            ],
            "content":"<div class=\"\"><div> <span>  Deciding that it would be best if they went someplace where they wouldn't be seen by anyone they knew, they decided to go to a place called the \"747 LOUNGE\", a small but quaint bar in a hotel out by the airport. They also decided it would be better to take a taxi, as none of them planned on being in any condition to drive later that night.<br>\r\n<br>\r\n  Arriving at the bar, they had a few drinks as they sat at a table, talking and having a few laughs. There were a few men in the bar but, either they weren't interested or they weren't confident enough to approach the three women sitting together at the table.<br>\r\n<br>\r\n  Just as they were considering leaving and going someplace else, a slightly balding man who appeared to be about fourty or so, came over to the table and asked Vivian if she'd like to dance.<br>\r\n <br>\r\n  Looking over at her friends and seeing them each give a slight nod of approval, Vivian accepted his invitation and started dancing with the man who had introduced himself as Ray.<br>\r\n<br>\r\n  As they danced, Ray complimented Vivian, telling her that she was a very good dancer. When the dance ended, he escorted her back to the table. Once she was seated, Ray asked Vivian if he could join her and her friends. When she agreed, he sat down and ordered a round of drinks for the table.<br>\r\n<br>\r\n As the four of them talked, the man told them that he was in town for a business convention, which had ended that day. When asked why he was still here, he explained that he and three associates had planned to leave that evening but, they had missed their flight and had had to re-schedule. When asked where his friends were, Ray pointed out a slightly portly man who appeared to be between fourty and fifty years of age, standing at the bar, adding that he thought the other two had gone to another bar nearby. Then, as an afterthought, he asked if it would be o'kay if his friend, George, joined them at the table?<br>\r\n<br>\r\n  When Wanda and Sarah said it was o'kay, he waved to the man he had called George, motioning for him to come over to the table. George came over and joined them, taking the chair between Vivian and Sarah. Ray and George each bought a round of drinks and soon, all five of them seemed to be having a real good time together. When Ray and Vivian got up to dance, George asked Sarah if she would like to dance and she accepted, leaving Wanda sitting at the table alone.<br>\r\n<br>\r\n  As she sat at the table watching her two friends dancing, she started feeling left out. Glancing around the room, she saw three men sitting at a nearby table. When she saw one of the men look over at her, she gave him a smile and returned to watching her friends out on the dance floor.<br>\r\n<br>\r\n  A few moments later, she looked up and saw the man she had smiled at, standing beside her, smiling as he asked her if she would like to dance. Quickly replying that she would love to, she let him lead her out onto the dance floor. When the music ended, instead of returning to her table, Wanda and the man who had introduced himself as Carl talked until the next song began playing, and then  they started dancing again.<br>\r\n<br>\r\n  As the night wore on, Sarah and Vivian continued dancing and drinking with Ray and George, obviously enjoying the attention they were getting from the two men. Wanda on the other hand, found herself to be the object of attention from Carl and his two friends. After dancing with each of them a couple of times, she found herself sitting at their table, laughing at their jokes and openly flirting with them as they continued to buy her drinks.<br>\r\n<br>\r\n  Shortly before midnight, the waitress came over and said the bar would be closing in ten minutes. Leaning over close to Wanda, Carl asked her if she'd like to go upstairs to his room and continue the party, adding he had a couple of bottles of liquor there.<br>\r\n<br>\r\n  \"Sure, why not? Let's have a party.\" replied Wanda, her words slurred by the amount of alcohol she had consumed throughout the evening.<br>\r\n<br>\r\n  Out on the dance floor, Vivian and Sarah were dancing with Ray and George, oblivious of the fact that Wanda had just left the bar with three men.<br>\r\n<br>\r\n  As the music ended and upon learning that the bar was closed, Ray asked Vivian if she would like another drink, saying that he had an unopened bottle of Gin in his room.<br>\r\n<br>\r\n  Vivian replied that she would love another drink, as long as the invitation included Sarah and George.<br>\r\n <br>\r\n  \"Of course,\" Ray replied, then, turning to Sarah and George he added, \"C'mon you two, let's go up to the room and have a few more drinks.\"<br>\r\n<br>\r\n  Without even a thought as to Wanda's whereabouts, Vivian and Sarah left the bar, taking the elevator up to the 7th floor, laughing and giggling as the two men led them to Ray's hotel room.<br>\r\n<br>\r\n      </span></div></div>",
            "created":976856400,
            "id":258554,
            "title":"747 LOUNGE"
        },
        "141":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Wanda Plays Along",
                "Wanda passes out"
            ],
            "content":"<div class=\"\"><div> <span>  As soon as they arrived in his room, Carl opened a bottle of Vodka and handed everyone a full glass. They stood around for a few minutes, talking as they drank, Wanda openly flirting with all three of them. Draining her glass, Wanda giggled drunkenly, saying she had to go potty and went into the bathroom and closed the door.<br>\r\n<br>\r\n  A few minutes later, as she came out of the bathroom, she saw that all three men had removed their jackets, shirts and neckties. Fred and Charlie were sitting in the only two chairs in the room and Carl was sitting on the edge of one of the two double beds. The only light in the room was a small lamp which was on the table between the two chairs. Soft music was coming from the small radio which was on the bedside stand between the two beds.<br>\r\n<br>\r\n  Seeing her come out of the bathroom, Carl stood up, refilled her glass and handed it to her. Wanda tipped it up, draining it completely, and placed the empty glass the table. Carl quickly refilled it.<br>\r\n<br>\r\n  \"I wanna dance. Somebody dance with me,\" she demanded, her words slurring.<br>\r\n<br>\r\n  Standing up, Fred wrapped his arms around her waist, and started dancing with her. Neither of them moved from where they were standing, just slowly swaying back and forth. As the song ended, Fred pulled her tightly against him and kissed her. When he felt her respond to his kiss, he slowly moved one hand down her back, sliding it over her well curved buttocks. A soft moan came from Wanda as she wrapped her arms around Fred's neck, clinging to him.<br>\r\n<br>\r\n  Deciding her response was a green light for him to continue, Fred slowly began to unzip her dress, stopping when the zipper reached her waistline. Then, reaching up, he removed her arms from around his neck, bringing them down to her sides. Slowly, his lips still on hers, he slipped the dress from her shoulders and pushed it down to her waist. Seeing this, Carl stood up, walked over behind her and began sliding her dress over her hips until it dropped to the floor around her feet. Then, taking a step back, Carl looked over at Charlie, both men leering as they gazed with lust at Wanda's partially clad body. All she had on now was a black bra, a filmy pair of black nylon panties, and her hi-heels. Hurriedly, both men began removing the rest of their clothes, stripping down until all they had on were their shorts.<br>\r\n<br>\r\n  Either not caring or so drunk that she didn't even realize she was no longer wearing her dress, Wanda continued kissing Fred as their bodies  swayed back and forth to the music. Slowly, Fred moved her over to the edge of one of the two beds in the room. At the same time, he reached behind her and unhooked her bra. Then, as the back of her legs came into contact with the edge of the bed, Fred stepped back, quickly slid the straps from her shoulders and removed her bra, tossing it to the floor. Then, quickly bending his head, he started kissing her full, lush breasts.<br>\r\n  <br>\r\n  All three men now had the same thought. They were going to have a party with this woman; a wild, no-holds barred gangbang. Everyone of them had had fantasies about something like this but, none of them had ever dreamed that if would ever really happen.<br>\r\n <br>\r\n  As she felt Fred slowly lowering her to the bed, an inner voice cried out inside her alcohol-clouded mind, telling her that she needed to stop what was happening and get out of there before it was too late. A soft murmur of protest came from her lips as she felt a mouth on her breast, sucking on the taut, hard nipple. Lying on her back, Wanda looked up at the ceiling. Slowly, it began turning in circles, creating a slightly nauseating feeling in the pit of her stomach. She shook her head from side to side, trying to clear the cobwebs from her mind. Was this really happening? Is this what she had wanted to happen?<br>\r\n<br>\r\n             </span></div></div>",
            "created":976942800,
            "id":258555,
            "title":"Prelude To A Gangbang"
        },
        "1411":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Wanda gets gangbanged",
                "Wanda gets raped"
            ],
            "content":"<div class=\"\"><div> <span>  Sprawled across the bed, her feet still on the floor, Wanda moaned as she felt a mouth on her naked breasts, kissing them, sucking on the nipples. She brought one hand up and pressed down on the back of the man's head, pushing him tighter against her breast. A warm glow began to surge through her body, threatening to become a raging fire.<br>\r\n<br>\r\n  Someone was kissing her now; not the man who had been sucking on her breasts, he was still doing that, sucking on one breast, then switching over to the other. No, it was one of the others, his lips pressing down on hers, his tongue sliding into her mouth.<br>\r\n<br>\r\n  She felt a hand between her legs, touching her, slowly moving back and forth over her thin, nylon panties, tracing the outline of the slit that lay between the swollen lips of her pussy.<br>\r\n<br>\r\n  Vaguely, she became aware of the men's voices as they talked, urging one another on. It almost seemed as if she wasn't even there but, in another room, listening to them.<br>\r\n<br>\r\n  \"Yeah...we got a hot one here! She wants it too...her panties are soakin' wet!! Always heard that redheads were hot! Get her panties off, man! Yeah...let's see that pussy!!\"<br>\r\n<br>\r\n  Someone was tugging at her panties, pulling them from her hips and sliding them down her legs. As she felt a hand on the inside of each knee, forcing her legs farther apart, she heard a voice exclaim, \"Oh yeah...she's a real redhead alright!! Look at this! Man, that looks good.\"<br>\r\n<br>\r\n  \"Go ahead, Charlie!\" said one of the men. \"Eat her....eat that hot pussy!!\"<br>\r\n<br>\r\n  A moan came from Wanda's lips as she felt the man's mouth on her pussy, kissing her there, his tongue flicking back and forth over her slit. At the same time, he was pushing a thick finger up inside her, moving it back and forth, finger-fucking her as he continued to bathe her pussy in saliva.<br>\r\n<br>\r\n  The man who had been kissing her had stopped but she could sense that he was still there. Opening her eyes, she looked up and saw him, leaning over her, his thick cock only inches from her face.<br>\r\n<br>\r\n  \"C'mon baby,\" he growled. \"Open up! Open that pretty mouth. I got something I know you want.\"<br>\r\n<br>\r\n  She tried to turn away but the man quickly knelt down on the bed, his knee preventing her from turning away from him. She pressed her lips together tightly as he slid the tip of his prick back and forth, his sticky pre-cum smearing over her lips.<br>\r\n<br>\r\n  Realizing that all three men were planning on having their way with her at the same time, Wanda thought about screaming. But would it do any good? Would anyone hear her?<br>\r\n<br>\r\n  And then another thought flashed through her alcohol impaired mind.<br>\r\n<br>\r\n  \"Hell, isn't this what I wanted?\" she thought. \"I knew when I came up here that I was going to have sex with at least one of them. Hell, why not all of them? Why not give them what they want and enjoy it at the same time? The real question is....all three of them at the same time or should she try to convince them to take turns?\"<br>\r\n<br>\r\n   <br>\r\n   </span></div></div>",
            "created":977029200,
            "id":258553,
            "title":"Drunk and Vulnerable"
        },
        "14111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Try To Wake Her Up",
                "Just Let Her Sleep"
            ],
            "content":"<div class=\"\"><div> <span>  Although Wanda had cheated on her husband before, it had always been a guy here, a guy there, nothing like the situation she found herself in now. Here she was, lying naked on a bed with three strange men, one of them kissing and sucking on her breasts, one of them licking her pussy, and the third one rubbing the swollen knob of his cock over her lips.<br>\r\n<br>\r\n  A soft moan came from her lips as she felt Fred sucking on her breast, his teeth raking lightly over her hard, fully erect nipple. At the same time, she could feel Charlie's tongue entering her pussy, flicking rapidly back and forth over her swollen clit.<br>\r\n<br>\r\n  As if they had a mind of their own, her hips jerked upward, her ass lifting off the bed, trying to get his tongue deeper inside her. His tongue was driving her crazy with desire. Warm, sticky juices were oozing from her pussy, flowing into Charlie's mouth as he sucked and licked wildly.<br>\r\n<br>\r\n  Gasping, she cried out, \"Ooooh, God!! Yes....yessss....eat me....eat my pussy!!\"<br>\r\n<br>\r\n  She wanted to cry out more, encouraging him, telling him to do it faster, telling him to stick his tongue inside her but, she was unable to do so. The moment she had cried out, Carl had pushed his thick, hard cock into her mouth, rendering her unable to speak.<br>\r\n<br>\r\n  Quickly, she reached up with one hand, wrapping her fingers around his cock before he could push it deeper into her mouth. Then, resigning herself to what he wanted her to do, she closed her lips around his thick shaft, sucking lightly as her hand moved back and forth on his hard, throbbing cock.<br>\r\n<br>\r\n  Completely aroused now, Wanda had become a willing participant in this wild orgy of lust. Her muffled moans only seemed to drive the men to greater heights of desire. Their hands were all over her now, exploring every inch of her body, squeezing her breasts, pinching her nipples, pushing up into her wet, slippery pussy. All of them were caught up in a frenzy of lust.<br>\r\n<br>\r\n  \"Oh yeah, baby...suck it...suck it good!! That's it....use your tongue on the tip! Oh fuck yeah....that's it!!\"<br>\r\n<br>\r\n  \"Mmmmm...give it to me, baby!! Gimme all that hot pussy juice...yeah, that's it! Move those hips...rub that hot pussy juice all over my face!!!\"<br>\r\n<br>\r\n  \"Oh man...luv these titties....Damn!! Your nipples are rock-hard, baby!!\"<br>\r\n<br>\r\n  Wanda was moaning louder now, out of control as wanton desire and lust consumed her mind and body. The inside of her body felt as if it was on fire, a raging volcano begging for release.<br>\r\n<br>\r\n  Suddenly, pushing Carl's cock from her mouth, she gasped, \"Jesus!!! I'm on fire!!! Somebody fuck me...please...fuck me now!!!\"<br>\r\n<br>\r\n  Instantly, she felt them pulling on her arms and legs, twisting and turning her on the bed as if she were nothing but a rag doll. She felt herself being pulled on top of someone. Looking down, she saw that she was lying on top of Fred, her breasts pressing into his hairy chest, her legs straddling his. Bringing her knees up under her body, she reached down with one hand and guided the bulbous head of his cock to her burning-hot pussy. A gasp came from her lips as she felt him lift his hips upward, impaling her on his thick shaft. Feeling his prick inside of her, she began moving her hips and ass up and down, taking him deeper and deeper with each downward movement of her hips.<br>\r\n<br>\r\n  A moment later, she cried out in surprise as she felt her long red hair being pulled, forcing her head up and back. Looking, she saw Carl standing on the bed in front of her, his throbbing, rock-hard cock only inches from her face. Wanda immediately knew what he wanted.<br>\r\n<br>\r\n  As she opened her mouth, Carl moved forward slightly, pushing his thick cock into her mouth. As her lips closed around him, he tangled his fingers in her hair, holding her tightly. Then, his knees bent slightly, he began moving his hips back and forth, pumping his cock back and forth inside of her mouth.<br>\r\n<br>\r\n  Unable to speak, Wanda could only moan as his cock rhythmically plunged back and forth inside her mouth, going a little deeper each time he pushed into her. She gagged slightly as she felt his cock hit the back of her mouth. She tried to pull back but, he was holding her too tight. She opened her mouth to breath, and at that instant, he pushed forward, forcing his stiff cock down her throat. Instantly, tears filled her eyes as his cock plunged deeper into her throat. Then, as his belly pressed against her face, she suddenly realized that she was able to breath through her nose, even though his thick cock was buried in her throat.<br>\r\n<br>\r\n  Relaxing slightly, she brought her hands up to his hips, bracing herself as the two men used her body. She had forgotten all about the third man, Charlie, until she felt a sudden pressure against her anus.<br>\r\n<br>\r\n  \"Oh God! No!!\" she screamed in her mind, unable to speak because of the cock buried in her mouth and throat. \"Not in my ass! Please!! Nooooooo!!\"<br>\r\n<br>\r\n  But it was too late. Her mind cried out in a silent scream as she felt his hard cock slowly penetrate her tight, puckered asshole. A groan came from deep inside her as his cock slowly slid deeper and deeper into her ass, stopping only when his belly slapped up against the cheeks of her ass. For a moment, he didn't move, his fingers digging into the soft flesh of her hips. Then, pulling back slightly, he began moving back and forth, fucking her up the ass.<br>\r\n<br>\r\n  There was nothing Wanda could do. Her body was being buffeted back and forth as the three men used her like a whore. All she could do was hang on, moaning softly as she felt their hard cocks plunging into every orifice. And to make matters worse, she was on the verge of having a mind-shattering orgasm. She groaned as something that felt like an electrical shock shot through her body. The slippery walls of her pussy tightened around the cock inside her, spasming wildly. Hot juices gushed from her cunt like volcanic lava, engulfing Fred's cock as he thrust up into her. Wanda felt faint as orgasm after orgasm rocketed through her body.<br>\r\n<br>\r\n  Oblivious of what was happening to her, the three men continued to hammer their cocks into her body, caring only about satisfying their own lusts.<br>\r\n<br>\r\n  Suddenly, she heard Carl's voice, crying out loudly.<br>\r\n<br>\r\n  \"Fuck...I'm gonna...Oh, yeah...here it comes baby!!! I'm cumming!!! Ooooooh, fuck...yeah!!!\"<br>\r\n<br>\r\n  Jerking his cock from her mouth, he erupted, a thick stream of grayish-white semen spewing into her mouth. Closing her mouth to swallow his sticky semen, Wanda jerked her head back in surprise as another stream of semen struck her in the face, and another, and another.<br>\r\n <br>\r\n  At the same time, Fred and Charlie were both gasping, crying out loudly as they rammed their erupting cocks as deep as they could into her cunt and ass.<br>\r\n<br>\r\n  \"Oh, fuck....yeah!\" gasped Fred. Here it comes baby.....here it comes!!!\"<br>\r\n<br>\r\n  \"Yeah...yeah, baby!\" groaned Charlie. \"Take it...take it up that hot ass, baby!! Oh fuck....Take it all!!!\"<br>\r\n<br>\r\n  The inside of Wanda's body seemed to explode in a series of multiple orgasms. She cried out loudly as what seemed like bolts of electricity coursed through her body. Hot, sticky juices gushed from her spasming cunt, sliding down her inner thighs, searing Charlie's cock with the burning heat. Her eyes rolled up into her head and she collapsed on top of Fred, out cold.<br>\r\n<br>\r\n  Extracting themselves from the unconscious woman sprawled face down on the bed, all three men just stood there for a moment, staring down at her naked body as they tried to regain their breath.<br>\r\n<br>\r\n  \"Jesus Christ!\" exclaimed Charlie. \"Is she...is she o'kay?\"<br>\r\n<br>\r\n  Leaning over her, Fred put his head down by her face, then looked up and replied, \"I.I think so....she's breathing anyhow.\"<br>\r\n<br>\r\n  \"Fuck!\" said Carl. \"I thought she had a fuckin' heart attack or something.\"<br>\r\n<br>\r\n  \"Well, what do we do now?\" asked Charlie. \"I mean...should we try to wake her up or something?\"<br>\r\n<br>\r\n  \"Hell, I'm gonna get dressed and go to my room.\" said Fred. \"I've had all the pussy I can handle for one night!\"<br>\r\n<br>\r\n  \"Yeah, me too,\" said Charlie as he started getting dressed. Then, laughing, he added, \"Hell Carl, who knows? When she wakes up, she might want some more.\"<br>\r\n<br>\r\n  \"Screw you guys!\" said Carl, walking over to the other bed and sitting down.<br>\r\n<br>\r\n  Dressed, Fred and Charlie left the room, laughing as they closed the door behind them.<br>\r\n<br>\r\n  Looking over at the lovely, naked redhead lying on the bed, Carl wondered if he should try to wake her up or just let her sleep it off?<br>\r\n<br>\r\n   <br>\r\n <br>\r\n         </span></div></div>",
            "created":977288400,
            "id":258551,
            "title":"Gangbanging Wanda"
        },
        "141111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Wanda Awakens"
            ],
            "content":"<div class=\"\"><div> <span>  Standing up, Carl walked over and stood by the other bed, looking down at the gorgeous redhead lying there. She was lying on her back now and his eyes slowly wandered down her body, taking in her full, lush breasts, rising with each breath she took. Shifting his sight lower, he gazed at the triangular patch of dark, red hair which started just above her mound and disappeared between her thighs. He felt his cock slowly begin to grow hard once again.<br>\r\n<br>\r\n  \"Damn,\" he muttered under his breath. \"She sure looks good. I wonder.....\"<br>\r\n<br>\r\n  Then, having made up his mind, he spread her legs apart and got on top of her, supporting his weight on his knees and elbows. Reaching down between their bodies, he guided his hard, throbbing cock to her opening. Slowly, he rubbed the tip of his cock up and down over her slit, coating the bulbous head with the wet juices that were oozing from her recently fucked pussy. A moment later, he slowly began pushing his cock into her wet, slippery tunnel, stopping only when his cock was completely inside her.<br>\r\n<br>\r\n  Wanda moaned softly as she felt Carl's cock entering her. She wasn't totally awake, but her body was responding as if it had a mind of it's own. Her hips moved slightly, rising up to meet him as he slowly pushed into her.<br>\r\n<br>\r\n  Placing a hand on each of her breasts, Carl squeezed and massaged them, tweaking her nipples between his thumb and forefinger. A smile formed on his lips as he felt her nipples harden to his touch. Slowly, he began moving his hips, pumping his hard cock in and out of her wet, slippery pussy.<br>\r\n<br>\r\n  Wanda lay motionless on the bed, her hands at her sides as Carl began moving faster and faster, ramming his cock deeper and deeper into her slippery pussy. He didn't care whether she was awake or not, he just wanted to fuck her.<br>\r\n<br>\r\n  Reaching down, he slide his hands under her thighs and brought her legs up, pushing them back until they were nearly touching her shoulders. Holding her in that position, he jerked his hips forward, ramming his hard cock all the way into her. A soft moan came from Wanda's lips as the head of his cock banged up against her uterus and his balls slapped noisily against her upturned ass. Lustfully, Carl began jerking his hips back and forth wildly, his cock pounding into her pussy like a jackhammer. He could feel the sperm building up in his balls as he hammered away at her pussy in a wild frenzy of lust.<br>\r\n<br>\r\n  Then, gasping loudly, he slammed into her, driving his cock as far as he could into her slippery sheath. His cock felt like it was exploding as stream after stream of hot, thick semen spewed into her pussy. He collapsed on top of her, gasping to get his breath.<br>\r\n<br>\r\n  A few moments later, his breath coming in ragged gasps, he withdrew from her and stood up beside the bed. Looking down at the naked woman sprawled across the bed, he smiled as he saw some of his semen, slowly oozing out of her gaping, well-fucked pussy.<br>\r\n<br>\r\n  Turning away, he walked over and turned off the small lamp sitting on the table. Then, walking over to the other bed, he crawled under the sheets.<br>\r\n<br>\r\n  Moments later, his lust completely sated, he was fast asleep, snoring loudly.<br>\r\n<br>\r\n      </span></div></div>",
            "created":977374800,
            "id":258552,
            "title":"One More Time"
        },
        "1411111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Catching a Taxi"
            ],
            "content":"<div class=\"\"><div> <span>  Awakening from her sleep, Wanda sat up on the bed and looked around the room. The curtains were partially open and she could see someone was sleeping on the other bed in the room, snoring peacefully. Glancing over at the small illuminated clock-radio setting on the stand between the two beds, she saw that it was nearly 3 in the morning.<br>\r\n  <br>\r\n  \"My God!\" she thought as she looked around the dimly lit room for her dress. \"I have to get out of here and go home.\"<br>\r\n<br>\r\n  Rising from the bed, she walked over and picked her dress up, which was lying on the floor in a crumpled heap. Holding it in her hand, she slipped into the bathroom and quietly closed the door. Turning on the light, she looked at her reflection in the large mirror.<br>\r\n<br>\r\n  \"Oh, my God!!\" she gasped as she stared at her reflection in the huge mirror above the sink. Her long red hair was a mess and her lipstick was smeared around her mouth. Dried semen was in her hair and all over her face. Her breasts were covered with bruises and her neck had numerous bite marks. Glancing down at her thighs, she saw even more bruise marks, where the men had gripped her flesh in their frenzy of lust. She could see globs of grayish-white semen matted in the dark-red hairs of her pussy.<br>\r\n<br>\r\n  Turning on the warm water faucet, she picked up a washcloth, wet it and began washing the dried semen and smeared lipstick from her face. Then, wetting the washcloth again, she washed the dried semen from her pubic hairs. A soft groan of discomfort came from her lips as she spread her legs apart to clean herself. Her inner thighs were stiff and sore and her anus ached from the abuse that had taken place earlier.<br>\r\n<br>\r\n  Finished, she turned off the water and slipped her dress on over her head. Quietly, she opened the door and peered out into the bedroom. Whoever it was sleeping on the other bed was still snoring peacefully. Tip-toeing across the room, she picked up her purse and high-heels. Spotting her panties lying on the floor beside the bed, she picked them up and dropped them into her purse. Then, as quietly as she could, she walked to the door, opened it and slipped out into the hallway, closing the door behind her. Leaning up against the wall, she put her hi-heels on and then walked to the elevator. Pushing the call button, she waited for the elevator to arrive.<br>\r\n<br>\r\n  \"I wonder where Vivian and Sarah are at?\" she thought as she waited impatiently for the elevator to arrive. \"Both of them are probably at home in bed by now. I'm sure as hell not going to worry about it. I need to get home and I can't waste time looking for them. I'll just get a taxi and I'll call them later.\"<br>\r\n<br>\r\n  Suddenly, a chime sounded and the doors to the elevator opened. Stepping inside the deserted elevator, Wanda pressed the button for the lobby, then leaned against the wall, closing her eyes as she waited to be delivered to the ground floor. She had been through an extremely wild and exhausting experience and now, her lustful desires more than satisfied, she felt very tired.<br>\r\n<br>\r\n<br>\r\n  </span></div></div>",
            "created":1074402000,
            "id":185299,
            "title":"Wanda Awakens"
        },
        "14111111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "The Driver Takes An Unexpected Turn",
                "The Driver Takes Wanda Home"
            ],
            "content":"<div class=\"\"><div> <span>  Another chime sounded as the elevator came to a halt and the doors slowly slid open. Pushing away from the wall, Wanda exited the elevator and walked across the lobby, staggering occasionally as she made her way to the exit. Nearing the door, she looked out the window, hoping that she would see Sara and Vivian waiting for her but, she saw neither of them and the driveway leading up to the front of the hotel was completely empty of vehicles. Turning away from the window, she walked back across the lobby to the check-in desk. As she stepped up to the counter, a slightly balding man got up from the desk and walked over to where she was standing.<br>\r\n<br>\r\n  \"Can I help you, Miss?\" he asked as his eyes swept over her, taking in the deep cleavage between her large, ample breasts. He couldn't help noticing the bruises on her breasts and the bite marks on her neck.<br>\r\n<br>\r\n  \"Yes, could you tell me how I can get a taxi at this time of the night?\" Wanda queried, her words slurring slightly. \"My friends seem to have left me stranded here.\"<br>\r\n<br>\r\n  \"Of course,\" replied the desk clerk as he picked up the telephone. \"Why dont you have a seat and I'll call a taxi for you.\"<br>\r\n<br>\r\n  Thanking him, Wanda turned and walked over to one of the plush, padded couches facing the check-in desk and sat down, her dress riding up high on her thighs as she did so. Feeling a little dizzy, she leaned back into the soft padding, grateful for the opportunity to get off her feet for a minute or two. The room started to spin wildly. She closed her eyes tightly, trying to block out the effects of all the alcohol she had drank the night before but, it was to no avail. As she sank into the deep, dark, spinning pit, everything went black and she fell over on her side, passed out.<br>\r\n<br>\r\n  Hanging up the receiver to the phone, the desk clerk looked at the redhead, who was now lying on her side on the couch directly in front of the reception desk. Her legs were askew and the short cocktail dress she was wearing had slid up to the top of her thighs. He wasn't sure but, from where he was standing, it looked like she didn't have any panties on.<br>\r\n<br>\r\n  Quickly walking around the counter, he hurried over to the couch where the gorgeous redhead was lying, obviously passed out.  Looking down at her, he saw the wedding ring on her ring finger of her left hand. Glancing out the window, making sure that he would be able to see when the taxi pulled into the driveway, he reached out and placed his trembling hand on one of her soft, supple breasts, squeezing it lightly. A soft moan came from the woman's lips but, nothing more.  Emboldened by her lack of response, he moved his hand down to the hem of her dress and slowly lifted it upward until he could clearly see the dark-red triangluar patch of pubic hair nestled between her milky white thighs. Taking in a deep breath, he slipped his hand between her thighs and ran the tips of his fingers over the puffy outer lips of her pussy.<br>\r\n<br>\r\n  \"Man, I'd love to get my dick into this!\" he thought as he slid first one, then two fingers into her slippery opening. \"I'll bet she is one hot piece of ass.\"<br>\r\n<br>\r\n  Just then, a car turned into the driveway, it's headlights beaming on the window. Quickly pulling his hand away from her pussy and tugging the hem of her dress down, the desk clerk walked over to the window and motioned for the driver to come inside. When he saw the driver getting out of the car, he turned and walked back over to the couch where Wanda was lying, completely oblivious as to what was going on in the world around her.<br>\r\n<br>\r\n  When the driver entered the hotel lobby, the two men spoke in hush whispers for a few moments, then the desk clerk walked over to her and, touching her on the shoulder, shook her gently, trying to awaken her. Wanda stirred, and when told that her taxi was there, she mumbled something that sounded like an address, then fell back into an alcoholic stupor.<br>\r\n<br>\r\n The desk clerk and the driver looked at one another, exchanging knowing looks. Taking her by the arms, they pulled her up from the couch. Supporting her between them, they carried her out to the waiting car and laid her in the back seat. Closing the back door to the car, the desk clerk hurried back inside as the driver got into the car and drove off.<br>\r\n<br>\r\n   </span></div></div>",
            "created":1075043880,
            "id":705631,
            "title":"Waiting for a Taxi"
        },
        "141111111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Wanda Resists"
            ],
            "content":"<div class=\"\"><div> <span>  Pulling away from the hotel, Hakeem glanced into his rear view mirror. The gorgeous redhead was lying on the back seat, obviously passed out from too much alcohol. Turning south onto the freeway, Hakeem found himself thinking about what it would be like to have a woman like the one lying in the back seat of his taxi. He hadn't been with a woman since he had left Saudi Arabia and that had been two months ago. Since arriving in America, he had tried to meet American women but, none of them had seemed interested in his advances. He often thought about what it would be like to have sex with one of the women in his taxi but, he had never had the nerve to go any further with his lustful desire.<br>\r\n<br>\r\nHearing a soft moan from the back seat, Hakeem took his foot off the accelerator and pulled off on the side of the freeway.<br>\r\n<br>\r\n\"I hope she's not going to be sick,\" he thought as he turned on the interior light and turned to look into the back seat. \"I don't want to have to clean up a mess back there.\"<br>\r\n<br>\r\nHakeem saw that the woman was sprawled out on her back, one leg on the seat and one on the floor. Her dress was hiked up on her hips and, with her legs spread as they were, Hakeem could see she wasn't wearing any underwear. Instantly, he felt his cock growing hard. Reaching back, he placed one hand on her thigh and gently shook her. Getting no response other than a soft, slurred groan, he turned back to the front, turned off the interior light and drove off.<br>\r\n<br>\r\n\"That's it! My mind is made up!\" he thought as he drove down the freeway. \"I'm going to fuck this woman.....whether she likes it or not.\"<br>\r\n<br>\r\nSeeing an exit ahead, Hakeem slowed and turned off the freeway. Turning at the bottom of the exit ramp, he drove for about fifteen minutes until he saw a secluded wooded area ahead. Pulling onto a dirt trail which led through the woods, he drove another hundred yards or so and then stopped. Turning off the lights and the motor, he sat there for a moment, thinking about what he was going to do.<br>\r\n<br>\r\nHakeem knew this area and he knew that the closest house was about a half mile away. It was also just outside the city limits so, there was very little chance of the police or anyone else coming by at that time of the night. And the woods was thick enough and he was far enough off the road that, there was no possibility of any passing cars seeing his taxi parked in the woods.<br>\r\n<br>\r\nGetting out of his cab, he opened the back door and peered inside. The woman was still lying on her back, legs spread apart, her dress hiked up to her hips. He slowly ran his tongue over his lips as he looked at the sleeping woman. Unzipping his pants, he pulled out his hard, throbbing cock and slowly stroked it.<br>\r\n<br>\r\nThen, kneeling on the seat between her parted legs, he leaned over her and guided the tip of his cock to her opening. Feeling the head of his hard cock come into contact with the soft, pouty lips of her pussy, he pushed forward and felt his cock easily sliding into her vagina. Placing his hands on her shoulders, he thrust his hips forward, driving his turgid cock deep into her warm, slippery vagina.<br>\r\n<br>\r\nWanda groaned as she felt the weight of another person on top of her. She could feel a man's cock penetrating her and, due to her intoxicated state and the fact that she had no idea as to where she was, she thought that it must be her husband, Steve. Without opening her eyes, she brought both her arms up around him and placed her hands on his back. Bending one leg at the knee, she positioned her body so he could more easily thrust his hard shaft deep inside of her.<br>\r\n<br>\r\n\"Ooooh, Steve,\" she moaned drunkenly. \"Give it to me, honey! Ram it in! Mmmmm.... yes, that's it....harder!!! Gimme every inch!! Oooh, yesss!! That's it, honey!! Fuck my hot pussy good!!!\"<br>\r\n<br>\r\nHakeem couldn't believe what he was hearing. This gorgeous woman was actually encouraging him to shove his cock deeper into her slippery pussy and give her a good fucking. Without another thought, he drove his hips forward, thrusting the full length of his hard shaft into the wet warmth of her vagina.<br>\r\n<br>\r\nGrabbing the straps of her dress, he pulled them down, exposing her full lush breasts. Lowering his head, he took one nipple into his mouth, sucking it, flicking his tongue back and forth over it. Then, switching to her other breast, he did the same thing, noticing that her nipples stiffened with desire.<br>\r\n<br>\r\nConsumed with lust, Hakeem thrust his cock into her cunt as he sucked and kissed her full breasts. He felt the inner walls of her vagina tighten around his thrusting prick, nearly causing him to cum right away.<br>\r\n<br>\r\n\"This American woman is really hot!\" he thought as he moved his cock back and forth inside her hot pussy. \"She likes to fuck. She wants me to shove my cock into her hot pussy.\"<br>\r\n<br>\r\nWanda, still under the drunken impression that she was with her husband, moaned softly as she felt his cock plunging in and out of her pussy. Placing her hand on the back of his head, she pulled him down, wanting to feel his lips on her breasts.<br>\r\n<br>\r\n\"Suck on my titties, honey!!\" moaned Wanda. \"Oh, Steve....yes...that's it...bite my nipples!! Oh, God!! That feels good!!\"<br>\r\n<br>\r\n\"That's strange,\" she thought as she ran her hand over his head. Expecting to run her fingers thru his hair, she suddenly realized that her fingers were sliding over bare, hairless skin. \"Oh my God, he's...he's bald!!! It's not Steve!! Who in the hell...??\"<br>\r\n<br>\r\nQuickly opening her eyes, she looked around, trying to figure out where she was and who was the man that was fucking her.<br>\r\n  </span></div></div>",
            "created":1120107600,
            "id":259627,
            "title":"Wanda Has To Pay"
        },
        "1411111111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Wanda Finds A Phone",
                "Someone Finds Wanda"
            ],
            "content":"<div class=\"\"><div> <span>Looking around, Wanda quickly came to the realization that she was in the back seat of a car and the man on top of her, with his hard cock inside her cunt, was not her husband, Steve.<br>\r\n<br>\r\nPulling her arms down, she placed her hands on the man's chest and pushed, trying to get him off of her. At the same time, she tried to wiggle out from underneath him.<br>\r\n<br>\r\n\"What the fuck do you think you are doing?\" she cried out as she wiggled and squirmed, trying to get out from under him. \"Who...who the fuck are you, you....you mother-fucker??\"<br>\r\n<br>\r\nTaken aback by her sudden resistance, Hakeem stopped, stunned by her violent reaction. Just a few moments ago, she had been so receptive, seemingly enjoying what he was doing and actually encouraging him to fuck her. Now, she was trying to push him away as she struggled to get out from under him. Hakeem considered getting off of her.<br>\r\n<br>\r\nHer squirming and wiggling under him however, was having a very different effect on Hakeem. Each wiggle and twist of her body only heightened the sensation her warm vagina was having on his hard cock. She lifted her hips, trying to buck him off of her but, only succeeded in driving his cock deeper into her cunt.<br>\r\n<br>\r\nSummoning up all the strength she could gather, Wanda pushed on his chest, forcing the man back, while at the same time, she twisted her hips to one side, dislodging his cock from her vagina.<br>\r\n<br>\r\n\"Stop it, you son-of-a-bitch!\" snarled Wanda, slapping his face first with one hand, then with the other. \"Get the fuck off of me!\"<br>\r\n<br>\r\nShocked by her violent reaction, Hakeem backed up, starring at the half dressed woman in the back seat of his taxi. Then, consumed with his lust, he reached inside the cab and grabbed one of her legs. Before she could react, he jerked hard on her leg, dragging her out of the cab. Throwing her face down on the ground, Hakeem straddled her, pinning her to the ground.<br>\r\n<br>\r\n\"Fucking whore! Fucking American whore!!\" he growled as he grabbed her wrist and twisted her arm behind her back. \"I'm gonna fuck you, you fuckin' whore....I'm gonna fuck you good!!!\"<br>\r\n<br>\r\nGrabbing her shoulder, he rolled her over on her back and pounced on top of her. Grabbing the shoulder strap of her dress, he jerked upward, ripping it loose from her dress. Then, placing his hand on her exposed breast, he squeezed, hard.<br>\r\n<br>\r\n\"You're hurting me!\" cried out Wanda as she felt his fingers bite into the soft flesh of her breast. \"Please....please stop!!\"<br>\r\n<br>\r\nConsumed with lust, Hakeem was only concerned with satisfying his sexual needs and her cries had little effect upon him. Reaching down into his boot, he pulled out a long, razor sharp knife and laid the blade of it across the woman's throat. Feeling the cold steel on her throat, Wanda immediately froze, afraid to move.<br>\r\n<br>\r\n\"Ooooh! Oh God! No! Don't hurt me!\" she cried out, tears coming to her eyes as she realized that this man might even kill her if she didn't do as he wanted. \"I'll....I'll do whatever you want...just don't hurt me.\"<br>\r\n<br>\r\nHakeem looked down at her. Even in the darkness, he could see the terror in her eyes. He knew that, at this point, he held the power to do whatever he wanted with this woman.<br>\r\n<br>\r\nGetting off of her, he stood up. Then, grabbing her by the hair, he quickly pulled her up to to a kneeling position. Placing the sharp blade of the knife along the side of her neck, he pushed her head towards him.<br>\r\n<br>\r\n\"Suck my cock....American whore!!\" he ordered as he tangled his fingers in her long red hair. \"Suck my cock and make me cum!!\"<br>\r\n<br>\r\nFearful for her life, Wanda nodded, tears running down her cheeks. Shuffling forward on her knees, she reached out with one hand, wrapping her fingers around the semi-rigid cock in front of her. Instantly, the man's cock stiffened, growing hard in her hand. Leaning forward slightly, she opened her mouth and took the head of his cock into her mouth. Closing her lips around it, she started to slowly move her head back and forth.<br>\r\n<br>\r\n\"You can do better than that, bitch!\" growled Hakeem. \"Use your tongue!! Lick it!! Kiss it! Rub it over your face!! Make love to my cock, you fuckin' whore!!!\"<br>\r\n<br>\r\nDutifully, Wanda complied, kissing the head of his cock, licking her way down one side of his cock then, back up the other side. She rubbed the head of his cock over her cheeks, feeling the stickiness of his pre-cum as it covered her cheeks. Then, guiding him back to her lips, she took him into her mouth, sucking him as her tongue swirled around the head. Her head bobbed back and forth, her lips sliding over the flesh of his hard shaft.<br>\r\n<br>\r\n\"Faster!\" ordered Hakeem, twisting his fingers in her hair, tightening his hold on her. \"Faster! Make me cum....make me cum in your mouth!!\"<br>\r\n<br>\r\nWanda gagged, coughing as the bulbous head of his cock struck the back of her mouth. She gasped for air as she felt him pushing her head forward, trying to force his cock even deeper into her mouth.<br>\r\n<br>\r\n\"Suck it, whore!!\" said Hakeem in a deep, lustful voice. \"I'm gonna....fuck! I'm cumming....here it cums, bitch! Suck!! Suck it good!! Drink my cum, you slut!!\"<br>\r\n<br>\r\nWanda tried to pull back as she felt his semen spurting into her mouth but, he was holding her to tight. She gagged as stream after stream of sticky semen spewed into her mouth and started to slide down her throat. She opened her mouth, trying to breath. Slowly, semen oozed from the corners of her mouth and slid down her chin. Wanda sat back on her heels, completely subdued and humiliated.<br>\r\n<br>\r\nUntangling his fingers from her hair, Hakeem grabbed his cock and milked it, squeezing out the last drops of semen. He rubbed the blood engorged tip of his cock over Wanda's face, smearing the remaining drops of semen on her cheeks.<br>\r\n<br>\r\nPlacing his knife back in his boot, he grabbed a handful of her long, beautiful red hair and wiped it over his cock. Then, stuffing his cock back in his pants, he zipped his pants up and stepped back. He looked down at the tearful woman but, he felt no remorse.<br>\r\n<br>\r\n\"If there was more time, I would also give you a good fuck!\" said Hakeem as he looked down on her. \"I know you American whores like to fuck. Maybe another time....we meet again...and I fuck you up the ass!! You would like that very much, wouldn't you? I know all you American whores like getting a cock rammed up your ass! But, there is no time! It will be daylight soon and I must go!\"<br>\r\n<br>\r\nTurning, he got into his taxi, and quickly drove away, leaving Wanda lying on the ground, sobbing uncontrollably.<br>\r\n  <br>\r\n</span></div></div>",
            "created":1120539600,
            "id":499559,
            "title":"Wanda Humiliated"
        },
        "14111111111":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Call Sarah's house",
                "Call Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>As Hakeem drove away, Wanda slowly rose up into a sitting position and looked around, trying to figure out where she was at. The first light of day was filtering through the trees but, all she could see was a lot of trees, brush, and the grass covered trail which led in two directions.<br>\r\n<br>\r\nGathering her legs under her, she stood up, swaying slightly, her mind still clouded by all the alcohol she had drank the previous evening. One of the thin, spaghetti straps to her dress had broken, which allowed the top of her dress to hang loosely, exposing her breast. Holding the top of her dress up to her breast with one hand, she looked around on the ground. Seeing her purse lying on the ground, she picked it up with her free hand, clutching it to her midriff. She turned, looking for her hi-heels but, they were no where in sight.<br>\r\n<br>\r\n\"Damn!\" she exclaimed under her breath. \"My shoes are probably still in that bastard's fuckin' taxi!\"<br>\r\n<br>\r\nRealizing that just standing there was not going to solve her problem, she slowly started walking down the grass covered trail, in the opposite direction that the taxi had taken. Carefully picking her way around the few muddy spots on the trail, she continued until she came to a paved road. Unsure of which way she should go, she finally decided to go in the direction which she thought would lead her to the freeway.<br>\r\n<br>\r\n\"Maybe I can find a gas station or something.\" she thought as she walked down the side of the road. \"I need to find a telephone.\"<br>\r\n<br>\r\nA few minutes later, she rounded a curve in the road and saw a gas station ahead. Walking a little faster now, she approached the gas station and walked up to the door. Hanging in the door was a sign which read, \"SORRY! CLOSED!\"<br>\r\n<br>\r\n\"Damn! Just my luck!\" muttered Wanda to herself as she looked around. Then, spotting a pay telephone booth, she walked over to it, praying that it wasn't out of order.<br>\r\n<br>\r\nOpening her purse, she found the quarter she would need to make a call. Picking up the receiver, she suddenly realized that she still had no idea as to where she was. Looking around, she spotted a street sign on the corner. Then, a second thought hit her, who was she going to call? Her husband wouldn't be home, and she wouldn't want to call him anyhow. How would she explain to him where she had been all night? She could call the police and tell them she had been raped but, did she really want to go through all that. If she told them she had been raped, they would want her to submit to a vaginal exam and the taxi driver hadn't fucked her, he had just made her suck his cock.<br>\r\n<br>\r\n\"Damn! Damn! Damn!\" she muttered softly to no one but herself. \"How in the hell did I get myself into this mess? Worse, how the hell do I get out of it?\"<br>\r\n<br>\r\nPicking up the receiver, she dropped the quarter into the slot and dialed a number, then waited for someone to answer.   </span></div></div>",
            "created":1121144400,
            "id":499561,
            "title":"Wanda Finds A Phone"
        },
        "14111111112":{
            "author_id":"tomato",
            "author_name":"nimbu",
            "choices":[
                "Sarah and/or vivian",
                "Someone who rapes her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1467031260,
            "id":2171599,
            "title":"Someone Finds Wanda"
        },
        "141111112":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Fatima Takes Her Pleasure"
            ],
            "content":"<div class=\"\"><div> <span>  Quickly pulling away from the hotel, Akmed sped down the main thoroughfare and in less than three minutes, was approaching the freeway. Turning on the interior lights, he glanced into the back seat. Wanda was sprawled out on the seat, her legs askew and her dress hiked up to her upper thighs. It was obvious that she was passed out and completely unaware of her surroundings.<br>\r\n<br>\r\n  \"Lady, what is your address?\" he asked as he eyed her lovely legs. \"Where do you want to go?\"<br>\r\n<br>\r\n  Receiving no response, he turned off the interior lights and turned on to the freeway. Moments later, he was speeding down the interstate, leaving the city far behind him.<br>\r\n<br>\r\n  Twenty minutes later, he exited the freeway and a short time after that, he turned off the paved highway on to a dirt road which led into the hills and forests north of the city. A couple of minutes later, he slowed and turned into a dirt drive which led to a old rundown farm house. Pulling up as close to the front door as he could, he stopped, turned off the headlights and shut off the motor.<br>\r\n<br>\r\n  He sat there for a few moments, letting his eyes adjust to the darkness as he listened to the quietness of the woodland surrounding the farm house. He saw the door to the farmhouse open and as two shadowy figures approached the car, he opened the door of the car and got out, closing the car door behind him.<br>\r\n<br>\r\n  \"Saleem called and said you were bringing us something very special,\" said the smaller of the two figures. \"I hope for your sake that she is better than the last one you brought.\"<br>\r\n<br>\r\n  \"I'm sure you will find this one quite satisfactory, Fatima.\" replied Akmed as he opened the rear door of the car and then stepped back. \"She's young, looks very pretty, and has a nice figure.\"<br>\r\n<br>\r\n   Peering into the car, Fatima looked at the lovely redheaded woman sprawled out across the back seat, her legs askew and her dress hiked up to her hips.<br>\r\n<br>\r\n  \"Yes, this one is very nice. Very nice indeed.\" said Fatima as she stepped back from the car. \"I'm sure all of us can enjoy ourselves with this one. Bring her inside and be quick about it.\"<br>\r\n<br>\r\n  Akmed and the other man pulled Wanda from the back seat, struggling slightly with the dead weight of her limp body. Following Fatima into the house, they carried her to one of the back rooms and laid her on the doctor's examination table which had been placed in the middle of the room.<br>\r\n<br>\r\n  \"Take her dress off,\" commanded Fatima as she walked over to the small nearby cabinet and began going through the drawers, taking out the items she wanted and placing them on the counter top.<br>\r\n<br>\r\n  Taking Wanda by the arms, Akmed pulled her up into a sitting position and the other man quickly unzipped her dress. Laying her back down on the table, they pulled her dress down over her hips and legs, stripping her completely. Glancing around the room, Akmed tossed Wanda's cocktail dress over the back of a small chair which sat in the corner of the room.<br>\r\n<br>\r\n  Having found the items she needed, Fatima walked over to the exam table, carrying some straps which appeared to be made out of a soft velvet material. Pulling out an extension on each side of the table, Fatima quickly strapped Wanda's arms to each one. After checking to make sure they were secure, she walked to the foot of the exam table and pulled out two more extensions. Akmed lifted one of Wanda's legs and placed it on one of the extensions while the other man did the same with her other leg. Quickly, Fatima fastened the straps around Wanda's legs and ankles, securing her to the table. Then, making a quick check to insure that none of the straps impaired Wanda's circulation, she motioned for both men to leave the room.<br>\r\n <br>\r\n  As the two men left the room, Fatima let her eyes wander over Wanda's naked body, bound securely to the exam table. Stepping up to the table, she pressed a button. The soft hum of a small electric motor began and Fatima watched as the two extensions which held Wanda's legs moved slowly upward and outward, spreading the captive woman's legs and lifting them slightly. When she was satisfied with the positioning of Wanda's legs, she pressed the button, turning off the motor. Stepping between her legs, Fatima slowly ran her fingers over Wanda's dark red pubic hair and then let her fingers trail down over the puffy lips which surrounded her vaginal opening.<br>\r\n<br>\r\n  \"Ah, yes, my American sweet,\" said Fatima as she slid first one, then two fingers into Wanda's vaginal opening. \"You are going to please many people over the next day or so.\"<br>\r\n<br>\r\n  A soft moan came from Wanda's lips as Fatima rubbed her thumb softly over Wanda's clitoris and her hips moved slightly, responding involuntarily to Fatima's expert manipulations.<br>\r\n<br>\r\n  \"Hmmmmm,\" mused Fatima as she realized that, even in a drunken stupor, Wanda's was responding to what she was doing. \"Yes, you are more than perfect my dear. You will please many.<br>\r\n<br>\r\n  Stepping back from the table, Fatima walked over to the door. Turning the latch to the deadbolt, she secured the door. Reaching over to the light switch, she turned off the overhead light and turned on another switch, which cast a reddish glow over the room. Walking back over to the table on which Wanda was securely fastened, Fatima gazed at the lovely redhead, her eyes wandering slowly over the captive woman's firm, succulent breasts. Reaching out with one hand, she squeezed one of Wanda's breasts, then moved to the other. She smiled as she saw the nipples grow hard to her gentle touch.<br>\r\n<br>\r\n  \"Yes, my lovely....you are going to give us much pleasure.\" thought Fatima as she gently toyed with Wanda's breasts. \"And before those animals in the other room use you, I'm going to sample your lovely wares.\"<br>\r\n<br>\r\n  Withdrawing her hand, Fatima walked over to the counter and opened one of the drawers. Reaching inside, she pulled out a black harness and a large rubber dildo. Quickly removing her clothing, Fatima strapped on the harness. Then, turning away from the counter, she walked over to the exam table and positioned herself between Wanda's widely spread thighs.<br>\r\n<br>\r\n  </span></div></div>",
            "created":1152680400,
            "id":343989,
            "title":"Wanda is kidnapped"
        },
        "142":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Party For Four"
            ],
            "content":"<div class=\"\"><div> <span>  Inside his room, Ray turned on a small table lamp which sat on the table, opened a bottle of Gin and poured each of them a drink. They talked for a bit and Ray, seeing that their glasses were empty, poured Vivian and Sarah another drink. Both women were openly flirting, laughing and giggling as the men kissed them and occasionally touched their breasts and buttocks.<br>\r\n<br>\r\n  Vivian and Ray sat on one bed, kissing and whispering into each others ear. Feeling a warm glow growing between her thighs, Vivian was about to tell Ray that they needed to stop when she heard Sarah let out a soft, audible gasp. Turning to see what was going on, she saw Sarah sprawled sideways across the bed, the top of her dress down around her waist. George was leaning over her, kissing and sucking on her exposed breasts. Sarah had one hand on the back of George's head, pressing his face against her breasts. Vivian watched as Sarah brought one foot up on the bed, bending her leg at the knee. As she did so, the hem of her dress slid up to the top of her thighs. Her eyes growing wide, Vivian quickly glanced over at Ray and saw him staring intently at the couple on the other bed. It was obvious that Sarah hadn't been kidding earlier about not having any panties on under her dress.<br>\r\n<br>\r\n  Standing up, Vivian turned and faced Ray. Giving him a little smile, she slowly began unzipping her dress. Then, slipping the thin spaghetti straps from her shoulders, she let her dress fall to her feet. Ray's eyes widened visibly, his attention shifting to the blonde woman standing in front of him, wearing nothing but a filmy pair of red nylon panties and her hi-heeled pumps.<br>\r\n<br>\r\n  \"Well?\" she said in a soft voice as she laid down on the bed beside him. \"Are you going to just look, or did you have something else in mind?\"<br>\r\n<br>\r\n  Quickly, Ray stripped down to his boxers and laid down beside Vivian, taking her into his arms. They began kissing one another, their hands roaming over each other's partially-clad bodies.<br>\r\n<br>\r\n  At the same moment, over on the other bed, Sarah was wiggling out of her dress as George frantically stripped off his clothes. Slipping her dress over her feet, Sarah dropped it to the floor beside the bed. Completely naked now, she lay back on the bed, parting her legs slightly as she did so. Looking up at George, her eyes grew wide with excitement as she saw him standing beside the bed, his erection sticking straight out in front of him.<br>\r\n<br>\r\n  \"Oh My!!\" she exclaimed as she looked at his throbbing, fully erect cock. \"You're ready, aren't you, sugar?\"<br>\r\n<br>\r\n  Then, spreading her legs wide, she looked up at him and said, \"C'mon, honey! Get on top of me and let's have some fun!!!\"<br>\r\n</span></div></div>",
            "created":976942800,
            "id":258556,
            "title":"Vivian and Sarah"
        },
        "1421":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Bill Joins In"
            ],
            "content":"<div class=\"\"><div> <span>  Kneeling between Sarah's widely spread legs, George wrapped one hand around his throbbing cock and began rubbing the tip up and down over her slit. The outer lips parted slightly and hot, sticky juices oozed from her opening, coating the head of his cock with her wetness.<br>\r\n<br>\r\n  \"Jeezus, she's hotter than hell.\" he thought as he felt the burning heat coming from the opening between her legs. \"Man, she's ready for it....and she's gonna get it...damn, is she gonna get it!\"<br>\r\n<br>\r\n  Slowly, he pushed the bulbous head of his cock between the puffy outer lips of her pussy, forcing them to slide over the dark-red head of his cock. Then, leaning over her and resting his weight on his elbows, he pushed his hips forward, driving his hard cock deep into her hot, slippery pussy.<br>\r\n<br>\r\n  \"Oh!! Oh yes!!\" she gasped as she felt his cock plunging into her opening. \"Oh God!! Yes!! Yes!! Give it to me, honey!! Ram that hard cock into my hot pussy!! Oh.....yesssssssssssss!!!\"<br>\r\n<br>\r\n  George just grunted as his cock plunged into her wet, slippery sheath. He could feel the velvety walls of her vagina sliding over his cock as if they were a second skin.<br>\r\n<br>\r\n  \"Yes....yessssss...that's it!!\" Sarah cried out as she felt his cock plunging into her hot, slippery cunt. \"Give it to me, honey!!! Give it all to me!!! Ram it in!!! Fuck me!!! Fuck me really good!! Ooooooh, God!!! That feels good!!!\"<br>\r\n<br>\r\n  Bringing her arms up, Sarah wrapped her arms around George's neck, clinging to him tightly as he hammered away, his cock plunging in and out of her slick, burning hot pussy.<br>\r\n<br>\r\n  Over on the other bed, Ray and Vivian were totally oblivious of George and Sarah, caught up in their own frenzy of lust and wanton desire. Frantically, Ray pulled Vivian's panties from her hips, nearly ripping them in the process. Tossing them to the floor, he placed his hands on her inner thighs and spread her legs wide apart. For a moment, he paused, his eyes feasting on the small patch of light blonde hair just above the puffy lips surrounding her slit. Then, kneeling between her legs, he lowered his head, burying his face in her sweet smelling pussy. His tongue plunged into her opening, swirling wildly, flicking up and down as he lapped up the sticky juices that were flowing from her slit. Finding her swollen, erect clitoris, he sucked it into his mouth, flicking his tongue back and forth over the nub.<br>\r\n<br>\r\n  \"Oh...oh....Ohhhhh, honey.....yessssss!\" Vivian cried as she felt him nibbling on her clit. \"God, yes!! Lick it....ooooh, yesss! That's it!! There....right there....oh, that feels soooooooo good!!! Jeezus....lick it...lick it, honey!! Yesssss.....oh God, yessssssssss!!!\"<br>\r\n<br>\r\n  Slipping his arms under her thighs, Ray pushed her legs upward, forcing them up to her chest. Then, his tongue still lapping at her hot, juicy pussy, he wrapped his fingers around her full, lush breasts and began squeezing them.<br>\r\n<br>\r\n  Hot, sticky juices poured from Vivian's cunt, covering Ray's lips, nose and chin with their sweetness. Her thighs clamped around his head, holding him tightly as her hips began bucking up and down wildly.<br>\r\n<br>\r\n  \"Oh, God!!! Yes...yesssssssssss!!\" she gasped, her hands on the back of his head, pressing his face into her crotch as her hips bucked up wildly to meet his tormenting tongue. \"Fuck me!! Please...please fuck me!! I can't take it anymore...Oh, God! Get up here!! Get up here and fuck me!!\"<br>\r\n<br>\r\n  Gasping for breath, Ray pulled back, his face covered with her juices. Placing his hands at the bend of her knees, he pushed her legs up and back until her knees were nearly touching her shoulders. Quickly getting on top of her, he drove his hard cock deep into her wet, juicy opening. Consumed with lust, George started fucking her, his hard cock pumping in and out of her hot, slippery love tunnel, his balls slapping noisily against the cheeks of her up-turned ass.<br>\r\n<br>\r\n  The sounds of their lust filled the room. Both men were grunting and groaning as they fucked the two women under them. Both women were moaning, occasionally crying out in ecstasy as they urged their lovers on. Their naked, sweat-covered bodies were slapping together lewdly as they danced the dance of the two-headed beast.<br>\r\n<br>\r\n  None of them heard the key turning in the door, nor did they notice the door to the room opening. If they had, they would have seen the fat, bald man, his large belly hanging over his belt, staring at the scene in front of him.<br>\r\n <br>\r\n  Ray's roommate, Bill, stood in the open doorway, his mouth hanging open in shock. His eyes darted from one bed to the other, taking in everything. At first, he had thought that he had somehow entered the wrong room. But then, he saw Ray, his old friend and business partner, on top of a naked blonde woman, his hard cock pumpin' in and out of her pussy.<br>\r\n<br>\r\n  \"Jesus H. Christ!!\" he thought as he looked from one bed to the other. \"He's bangin' the shit outa her!!!\"<br>\r\n<br>\r\n  Looking over at the other bed, he saw George on top of another blonde woman, her legs up on his shoulders. Looking down, he could see George's cock, pumping in and out of the woman's pussy. A silent groan came from Bill's mouth as he felt his cock jerk, growing hard inside his trousers.<br>\r\n <br>\r\n  Suddenly realizing that, at any moment, any one of the four people in the room might look over and see him standing there, he started to back out of the room and close the door. But, as he did so, he suddenly had another thought. Why leave? Why not just go in and join the party?<br>\r\n<br>\r\n  \"Hell, I'll never get another chance like this!!\" he reasoned silently, stepping inside the room and quietly closing the door. \"No sense in letting George and Ray have all the fun.\"<br>\r\n</span></div></div>",
            "created":977461200,
            "id":258557,
            "title":"Hotel Room Party"
        },
        "14211":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Sarah & Vivian Search for Wanda"
            ],
            "content":"<div class=\"\"><div> <span>  Quickly stepping into the room and silently closing the door behind him, Bill slipped into the bathroom. Taking off his jacket, he saw his reflection in the mirror. In his mid-fifties, Bill definitely did not have the body of a man you would find in a muscle-beach magazine. Bald, with only a ring of graying hair on each side of his head, he stood 5'9 and weighed over 250. His large, fat, protruding belly hung over his belt. He was definitely not the type of man women would find attractive, and definitely not the type they would consider having sex with. But, Bill did have one thing that, when women found out about it, stirred their curiosity. Bill had a big penis. No, not big, but huge. It measured 12 inches from base to tip and was as big around as most women's wrists. No, Bill's cock was enormous!!!<br>\r\n <br>\r\n  The sounds coming from the next room brought Bill back to the present. Hurriedly, he resumed stripping off his clothes, dropping them in a heap on the bathroom floor. Then, completely naked, he walked out into the next room, his massive cock sticking straight out in front of him, swaying obscenely from side to side as he walked.<br>\r\n<br>\r\n  Ray was on the bed farthest away from Bill, lying on top of one of the women, his ass moving up and down as he hammered his cock into her pussy. She had her arms around his neck, clinging to him tightly, moaning in obvious ecstasy.<br>\r\n<br>\r\n  \"Give it to me!! Uunnnhhh...harder!! Ohhh! That's it!! Harder!! Unnnhhh... Ram it in...uugghhhhh....ram it all the way in!!! Ooooooooooh, God....yesssssssssssss!!\"<br>\r\n<br>\r\n  Looking over at the bed closest to him, Bill saw that things had changed since he had first entered the room. George was lying on his back now and Sarah was kneeling between his legs, her well-shaped, nicely rounded ass sticking up in the air. She had one hand wrapped around George's cock, jerking him off as she licked and sucked on the knob.<br>\r\n<br>\r\n  Moving to the foot of the bed, Bill knelt down on the floor and slipped his hand between Sarah's thighs. Surprised by the hand touching her pussy, Sarah pulled her head up and looked back over her shoulder. Seeing another strange man there, leering as he ran his hand over the swollen lips of her pussy, she started to turn around.<br>\r\n<br>\r\n  Quickly grabbing her arms and holding them tightly, George prevented her from moving.<br>\r\n<br>\r\n  \"C'mon, Baby, it's just Bill.\" he said in a soft, hoarse whisper. \"He's my roommate. Why not let him join us? The more the merrier, right?\"<br>\r\n<br>\r\n  Giving Bill another look, she smiled and said, \"Sure! Why not? Hell, I don't mind.\"<br>\r\n<br>\r\n  Then, turning back to George, she lowered her head, taking his cock into her mouth, her tongue swirling around the dark-red knob at the tip as she felt the man named Bill continue to play with her pussy. His hand and fingers were quickly covered with the wet, sticky juices that poured from her hot, juicy opening.<br>\r\n<br>\r\n  Taking his hand from her pussy, Bill rubbed her juices over the tip of his huge, throbbing cock. Then, kneeling on the bed between her thighs, he slowly began pushing the bulbous head of his cock into her hot, slippery slit. He continued to push his cock deeper and deeper into her receptive pussy, his massive cock stretching the inner walls of her vagina. Placing his hands on her waist just above her hips, he jerked his hips forward, thrusting his huge, thick cock all the way inside her, stopping when he felt the tip of his cock come into contact with her uterus.<br>\r\n<br>\r\n  Sarah groaned as she felt the huge cock pushing deeper and deeper into her. A muffled gasp came from her throat as she felt the head of his cock bang up against her uterus.<br>\r\n<br>\r\n  \"Ohhh! Ohhh, my God!!!\" she groaned, taking her lips from George's cock. \"Jeezus!! It feels like I'm getting a pole rammed up my cunt!!!\"<br>\r\n<br>\r\n  Smiling, Bill tighten his grip on her waist, and began moving his hips back and forth, his belly slapping against her ass as he pumped his cock in and out of her tight, slippery cunt.<br>\r\n<br>\r\n  \"Ohhhhh! Yes! Yesssssss!\" she gasped loudly. \"Ram it in!! Harder!!! Fuck me!!! Really fuck me!!! Gimme every inch!! Yes!! Yesssssss!!! Ooooooooh, Yessssssssssss!!\"<br>\r\n<br>\r\n  Reaching up and tangling his fingers in her hair, George coaxed her into taking his cock back inside her mouth. Then, holding her tightly, he began moving his hips up and down, fucking her mouth. Sarah could only moan, her body buffeted back and forth by the rocking motions of the two men using her like a whore.<br>\r\n<br>\r\n  Hearing Sarah's muffled groans, Ray looked over at the other bed. His eyes widened with surprise as he gazed at the trio on the next bed. George was jerking her head up and down wildly, fucking her mouth, literally driving his cock down her throat. At the same time, Bill was fucking her doggie-style, his huge, thick cock hammering into her pussy.<br>\r\n<br>\r\n  Turning his attention back to Vivian, he began to move faster and faster, his cock plunging in and out of her pussy wildly.<br>\r\n<br>\r\n  \"Yeah!!\" he gasped, his fingers digging into her soft shoulders. \"Here it comes, baby! I'm...I'm gonna...oh, fuck! Yeah!! I'm cumming, baby...I'm cummmmmminnnnng!!!!\"<br>\r\n<br>\r\n  His cock exploded, his hot semen spewing into Vivian's waiting cunt. A deep groan came from his lips as stream after stream of hot, sticky sperm shot into her. It felt as if a volcano was erupting inside of him, spewing hot, molten lava into her hot pussy!<br>\r\n<br>\r\n  \"Ohhhhhhh, noooooooooo!!!!\" a voice inside Vivian's mind screamed out. \"No! Not inside me!! Oh, God! No! What if he gets me pregnant???\"<br>\r\n<br>\r\n  But her body wasn't paying any attention to the voice in her mind. What felt like a jolt of electricity shot through her pussy and her hips jerked upward, her ass lifting completely off the bed.<br>\r\n<br>\r\n  \"Jeeezzzuusssss!!!\" she gasped, her voice nearly a scream. \"I..I..I'm gonna....God! Yes! Yessssss!!! I'm cumming! Ooooooooh God!!! I'm... I'm cuuummmmmiiiiiinnngggg!!\"<br>\r\n<br>\r\n  The inner walls of her vagina convulsed, tightening around Ray's erupting cock, as if they were trying to drain every bit of semen from his balls. Gasping, she raked her fingernails over his shoulders as she felt a second orgasm surging through her body.<br>\r\n<br>\r\n  Ray collapsed, his weight resting on top of her. Both of them just lay there, unable to move as they gasped to regain their breath, their bodies shaking and quivering in total ecstasy.<br>\r\n<br>\r\n  A similar scene was occurring over on the other bed. George was groaning loudly, calling out to Sarah.<br>\r\n<br>\r\n  \"Fuck!! I'm almost there, baby!!\" he cried, arching his back, forcing his cock down Sarah's throat. \"Yeah.....Oh, fuck, yeah! Take it baby!! Take it all!!!!\"<br>\r\n<br>\r\n  Sarah felt a thick stream of semen shoot down her throat. Summoning up all the strength she could, she jerked her head back, dislodging his erupting cock from her mouth. A thick, milky-white stream of cum shot from his cock, hitting her in the face. And another, and another, as if it would never stop. She could feel the semen as it slowly began sliding down her face. She gagged, coughing as she tasted the semen in her mouth. She wanted to get up and rush to the bathroom but, it wasn't over yet.<br>\r\n<br>\r\n  Bill's fingers were digging into her waist, holding her tightly as he rammed his huge thick cock deep inside her pussy. She winced each time she felt his prick bang up against her uterus. Faster and faster he moved, his fat belly slapping obscenely against her buttocks.<br>\r\n<br>\r\n  \"Yeah!! Ohhhh, Yeah!\" Bill gasped, his voice a deep, guttural groan. \"Get ready, baby!! Here it comes!!! Ooooh, fuck!!!!!\"<br>\r\n<br>\r\n  He slammed into her so hard that she lost her balance and fell forward, her face pressing into George's hairy belly. Sarah groaned as she actually felt what seemed like a river of semen spewing from Bill's erupting cock, flooding her spasming pussy with his hot, sticky cum. His cock felt like it was going to rip right through her uterus.<br>\r\n <br>\r\n  Bill gasped as his cock erupted into the blonde's pussy in a seemingly endless torrent of cock cum. Grabbing the cheeks of her ass, he dug his fingers into the soft flesh, as stream after stream of sticky semen shot from his jerking cock, spewing into her burning hot pussy, filling her completely.<br>\r\n<br>\r\n  Gasping in a effort to catch his breath, Bill pushed back, pulling his spent cock from her cunt. A leering smile came to his lips as he looked down and saw his grayish-white semen oozing slowly out of her now gaping cunt. Giving her a light slap on the ass, he stood up and walked over to the table, and poured  himself a drink.<br>\r\n<br>\r\n  Ray and George joined him, drinking, smiling at one another as they watched Vivian and Sarah move about the room locating their hastily discarded clothing, then going into the bathroom to get cleaned up and dressed. When the two women came out of the bathroom, Ray offered them a drink but, both of them refused, saying something about needing to find their friend, Wanda, and then go home. Then, without saying anymore, both women turned and went out into the hallway, closing the door behind them.<br>\r\n<br>\r\n  \"Man, was that great or what?\" quipped Bill as he poured himself another drink. \"I wouldn't mind meeting those two again sometime.\"<br>\r\n<br>\r\n  Walking over to the nearest bed, George bent down and picked something up from the floor.<br>\r\n<br>\r\n  \"Hey, look at this,\" he grinned, holding up a pair of filmy nylon panties. \"One of them left us a souvenir. Hell, maybe she'll come back for them next time we're in town.\"<br>\r\n<br>\r\n  With that, all three men laughed. The clock-radio resting on the bedside stand between the two beds read 3:30 A.M.<br>\r\n</span></div></div>",
            "created":977613300,
            "id":728399,
            "title":"Party in Room 703"
        },
        "142111":{
            "author_id":"tomato",
            "author_name":"nimbu",
            "choices":[
                "Option 1"
            ],
            "content":"<div class=\"\"><div> <span>\"Damn,Vivian,where will Wanda be at this time?\"said sarah.<br>\r\n\"I just hope that her night went better than ours.\"said Vivian,equally worried.<br>\r\nThe 2 ladies move from room to room,trying to find Wanda.<br>\r\nFinally,at the 4th room they try,they hit gold.Or manure would be a better expression.<br>\r\nOption 1:They find Wanda gagged and bound by 3 very horny guys,who demand to have forced sex with all 3 ladies in return of freeing Wanda.</span></div></div>",
            "created":1469875380,
            "id":2188400,
            "title":"Sarah & Vivian Search for Wanda"
        },
        "15":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Dance with the men?",
                "Try to Leave?"
            ],
            "content":"<div class=\"\"><div> <span>  Deciding that none of them were actually sober enough to drive, they decided to take a cab. Besides, Wanda had heard that cab drivers knew all the hot places in town so, why not.<br>\r\n<br>\r\n  When the cab arrived, the three of them jumped into the back seat, giggling, laughing, joking about the good time they were going to have tonight.<br>\r\n<br>\r\n  \"Where to, ladies?\" asked the cab driver, noting that all three of them were definitely somewhat intoxicated.<br>\r\n<br>\r\n  \"Take us someplace where we can have a really good time,\" said Wanda, laughing.<br>\r\n<br>\r\n  \"Yeah,\" quipped Sarah. \"How about some place where there are lots of hot, good looking men and plenty of alcohol.\"<br>\r\n<br>\r\n  \"Jesus, Sarah!\" said Vivian. \"You make it sound like all of us have got hot pants!\"<br>\r\n<br>\r\n  \"Shit! Who's wearing pants? I'm not!\" replied Sarah, and all three women burst into laughter.<br>\r\n<br>\r\n  \"OK ladies. One wild party coming up.\" said the cab driver as he put the cab into gear and roared away into the night.<br>\r\n<br>\r\n  Twenty minutes later, the taxi skidded to a halt outside what appeared to be a bar. The sign hanging above the door read, \"PUMPSIE'S\". Paying the driver, the three women got out of the cab and went inside.<br>\r\n<br>\r\n  Laughing wildly, they walked over to a table and sat down. A rather buxom black woman came over and took their order and returned moments later with their drinks.<br>\r\n<br>\r\n  It was then that Wanda looked over at the bar and saw two huge black men leering at them. Quickly looking around the room, she saw 4 more men playing pool, all black. Two more black men were standing by a pinball machine, looking over at her.<br>\r\n<br>\r\n  Turning back to her girlfriends, she whispered, \"My God! This is a black bar!\"<br>\r\n<br>\r\n  Sarah and Vivian quickly looked around the room then turned back to face Wanda.<br>\r\n<br>\r\n  \"I'm not so sure we should be here.\" said Sarah.<br>\r\n<br>\r\n  \"Yeah, I agree.\" said Vivian. \"Let's just leave our drinks and go.\"<br>\r\n<br>\r\n  Just then, two men walked up to the table. One of them was tall, probably about six foot or so, and the other was a rather short, somewhat paunchy man.<br>\r\n<br>\r\n  \"Does you think one of these ladies would like to dance?\" asked the taller of the two men.<br>\r\n<br>\r\n  \"Nah, dey probably is like most of the other honkie chicks that come in here,\" replied the short guy. \"thinking dey is too good to dance with niggers like us.\"<br>\r\n<br>\r\n  \"Oh, you think so?\" responded the tall man, as he placed his hands on the table and leaned forward, adding, \"Is dat true ladies? You'se think you'se is too good to dance with a black man?\"<br>\r\n<br>\r\n  Just then, a seedy looking man with a long scar on his left cheek, walked up to the table and said, \"You know what I think? I think we should just lock the door and show these honkie bitches what they been missing.\"<br>\r\n<br>\r\n  Well ladies, what's it gonna be?\" asked the tall black man. \"Is you'se gonna dance with us or what?\"<br>\r\n<br>\r\n  Nervously, Sarah, Vivian, and Wanda looked at each other, fear showing in their eyes. They were completely surrounded by a group of leering black men and there didn't appear to be any way they were going to get out of a very bad situation.<br>\r\n</span></div></div>",
            "created":976683600,
            "id":265409,
            "title":"Pumpsie's Bar"
        },
        "151":{
            "author_id":"geminikc",
            "author_name":"GeminiKC",
            "choices":[
                "Use the Exit",
                "Use the Ladies Room"
            ],
            "content":"<div class=\"\"><div> <span>   Edited and re-written by GeminiKC<br>\r\n<br>\r\nDeciding that there was no way they were going to get out of there without at least appearing somewhat cordial, Wanda looked at the tall black man and forced herself to smile.<br>\r\n<br>\r\n\"Okay! I'll dance with you.\" she said as she pushed her chair back, stood up and walked over to the small open area.<br>\r\n<br>\r\nSomewhat surprised by Wanda's response, the tall black man just stood there for a moment, looking at the curvaceous redhead. Slowly, a big smile came to his lips as he walked over to her.<br>\r\n<br>\r\n\"Get some music playing on the juke box, Carl.\" he commanded to one of the other black men. \"And make sure it's something nice and slow.\"<br>\r\n<br>\r\nTaking her cue from Wanda, Sara stood up and smiled at one of the men standing near the table. As he took her elbow and led her out to the tiny dancing area, she felt weak and slightly faint but, she knew she was going to have to at least go through the appearances of being friendly.<br>\r\n<br>\r\nRealizing she needed to do something, Vivian looked up at the men standing around her. Picking the least threatening looking man, she stood up, indicated to him that she would dance with him and let him lead her out to the dance floor.<br>\r\n<br>\r\nAs a slow melody began coming from the juke box, each of the women found themselves in the firm grasp of a man, being guided slowly around the dance floor.<br>\r\n<br>\r\nWhen the first song ended, each of the women found themselves being passed to another man, as it now seemed that every guy in the place was going to take a turn dancing with them.     <br>\r\n<br>\r\nThree songs later, all three women were still trying to figure out how they could gracefully get themselves out of a very threatening situation. When Sara had said she wanted a drink, one of the men brought her a drink out on the dance floor, insuring that she would not be able to get back to the table nor, would she be able to stop dancing.<br>\r\n<br>\r\nVivian had also tried to use the same ploy, but she ended up with the same results. There just didn't seem to be any way they were going to be able to out of predicament unless the police came in the door.<br>\r\n<br>\r\nAs they found themselves being guided around the dance floor by man after man, all three women also found that they were also going to have to put up with something else. As they danced, they quickly became aware of the hands moving over their bodies, touching their buttocks, squeezing, caressing, and fondling. Although all three of them were somewhat intoxicated, each of them tried their best to fend off the groping hands that seemed to be everywhere.<br>\r\n<br>\r\n\"I need to use the restroom...\" said Wanda to her newest dance partner as the music stopped for a moment. Releasing her, he stepped back, nodded and pointed to a door at the end of the hall in the back.<br>\r\n<br>\r\nWanda forced herself to give him a smile as she said, \"I'll be right back.\"<br>\r\n<br>\r\nDizzy from all the drinks she and the other two women were being encouraged to drink, she staggered down the dimly lit hallway, nearly losing her balance twice. As she approached the end of the hallway, she saw three doors, each with a small sign on it. The sign to the left read \"Men's\" and the one to the right read \"Women's\". But the sign that caught her eye was on the door directly in front of her. That sign read, \"EXIT\".</span></div></div>",
            "created":1018760400,
            "id":265414,
            "title":"A Bad Situation"
        },
        "1511":{
            "author_name":"teddybear",
            "choices":[
                "someone is in the car",
                "one of the guys in the bar has followed her"
            ],
            "content":"<div class=\"\"><div> <span>Dizzy drunk and looking for a way out of this mess, Wanda makes in out the back door and into  the alley at the rear of the bar. Stumbling and feeling her way through the dimly lit alley, Wanda stops and leans up against one of the cars parked there. </span></div></div>",
            "created":1019278800,
            "id":100125,
            "title":"Not the way out"
        },
        "15112":{
            "author_name":"stang",
            "choices":[
                "Run as fast as she can",
                "Surrender and go back inside"
            ],
            "content":"<div class=\"\"><div> <span>Wanda stood there leaning on the car for minute.  She was trying to decide whether to go back inside for her friends or just run away.  She heard someone coming and thought maybe it was one of her friends who had found the same way out she did, but as a shadow filled the doorway she began to shake as one of the huge men from inside stepped through and asked her where she thought she was going.  She tried to run but he grabbed for her catching part of her dress and as she tried to run the material tore leaving her in her bra, panties, and high heels as the man was holding her dress.  She stopped for a second trying to decide whether to keep running or surrender to the man holding her now torn dress.</span></div></div>",
            "created":1121490000,
            "id":261797,
            "title":"Decisions for Wanda"
        },
        "151121":{
            "author_name":"stang",
            "choices":[
                "The man contiues with Wanda",
                "He tells the others they all will pay for Wanda's Mistake"
            ],
            "content":"<div class=\"\"><div> <span>It only took Wanda a few seconds to realize that nothing good would come of her going back inside and she would suffer the embarrassment of being found in her bra, panties, and high heels for a chance to get away.  She took off running toward the front of building.  As she got near the front thinking she had got away she ran right into another of the men from inside.  He just laughed as he grabbed her in his arms and headed back inside with Wanda wiggling and screaming.  The scuffle had caused her bra to rise up revealing her heaving tits as the brought her through the door and threw her on the pool table.  He took both of her hands in one hand and pulled them over her head pinning her to the table.  Another man took off his belt and looped it around her wrist pulling it tight before tying it to the leg of the table.  The man who carried her in just laughed as he took his big hand and grab one of Wanda's exposed tits squeezing it hard and proclaiming that now was pay back time.</span></div></div>",
            "created":1121490000,
            "id":261800,
            "title":"Wanda's Caught"
        },
        "1511211":{
            "author_name":"Kip",
            "choices":[
                "The man returns, a bag in his hands.",
                "Sarah and Vivian try to help free Wanda."
            ],
            "content":"<div class=\"\"><div> <span>He pulled out his pocketknife and cut Wanda's bra and panties off. He climbed onto the pool table. \"Are you thirsty?\" he asked.<br>\r\n\"No,\" Wanda said.<br>\r\nThe man laughed. \"Well, too bad.\" He pulled down his pants and peed all over her. Wanda stiffened in horror. He stepped onto her breast. She gasped in pain. He grinned as he started jumping up and down. <br>\r\n\"Stop!\" she screamed in pain.<br>\r\n\"Alright. I need to sit down anyways.\" He turned and sat down on Wanda, his butt on top of her face. He wiggled around, getting comfortable. He started slapping her butt and pulling on her private hairs. After a few minutes of that he stood back up. \"Stay right here like a good little girl. I just have to go get something from my car.\" He jumped down off of the table and headed out of the bar.</span></div></div>",
            "created":1154149200,
            "id":335650,
            "title":"From Bad, to Worse"
        },
        "15112111":{
            "choices":[
                "condom",
                "large metal stick"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He comes back a bag in his hand and says<br>\r\n \"This is where the fun begins.\" Inside the bag is a...</span></div></span></div>",
            "created":1213160400,
            "id":542934,
            "title":"The man returns, a bag in his hands."
        },
        "1512":{
            "choices":[
                "Wanda talks the others into having sex with the guys.",
                "The men have already started raping Vivian and Sarah.",
                "Four men are waiting to take Wanda as she steps out of the stall."
            ],
            "content":"<div class=\"\"><div> <span>Wanda thought about it for all of a second. Despite the temptation to run, she knew she was far too drunk to escape, even if she did make it out of the door. She pushed open the door to the restroom and went inside. She was pleasantly surprised to find it was actually clean, despite the squaller of the rest of the building. She hiked her dress and pulled down her panties before squatting over the toilet.<br>\r\n<br>\r\n\"Ah!\" she sighed in relief as her overly full bladder emptied itself. She thought furiously as she finished and wiped herself. Including the bartender, there were around a dozen men in the bar. She knew from what she had had to drink there was no way she could really escape. And, if she couldn't, neither of the others could, either. While the last thing she really wanted was to have what was sure to be unprotected sex with any black man, she knew deep down it was going to happen. Finally, she decided the best thing to do was talk to the other girls. Then, they would just do it and have it over with and done.<br>\r\n<br>\r\nShe didn't bother to put her panties back on since they would be coming off shortly. As she reached for the door, a nasty little voice in her head whispered, \"Weren't you girls looking for some action? And now that you've found it, you're going to whine and say you changed your mind. So what if they're black. Aren't black cocks supposed to be bigger than white ones. Here's your chance to find out first hand. Go get'em girl!\" </span></div></div>",
            "created":1214888400,
            "id":550770,
            "title":"Use the Ladies Room"
        },
        "15121":{
            "choices":[
                "Sarah strips.",
                "Go straight to the sex. Sarah goes first"
            ],
            "content":"<div class=\"\"><div> <span>Wanda stepped out of the restroom to find two of the men waiting on her. \"Gentlemen,\" she said as she slipped her arms around them, \"So nice of you to give me an escort back to the dance floor.\"<br>\r\n<br>\r\nThe shorter guy, about 5'10\" with thick, muscular arms slipped his arm around Wanda, his hand moving down to slide over her firm ass. He gave her a cheek a hard squeeze while his companion deftly untied one strap of her cocktail dress, exposing her breast. He squeezed it, rubbing the nipple with his thumb.<br>\r\n<br>\r\n\"Hey!\" Wanda snapped. \"That hurts! If you bastards want us to cooperate so this doesn't turn into a gang rape, you can't be rough. You can't leave bruises on any of us for our husbands to find!\"<br>\r\n<br>\r\nSaying that, Wanda slipped out of their grasp and stormed down the hall to the dance floor. Vivian was struggling against the biggest man Wanda had ever seen as he tried to force his tongue into her mouth. Sarah was backed up against the bar. Two men held her; each one pinning one of her arms against the bar with one of theirs while the other squeezed her breasts through her dress. <br>\r\n<br>\r\nWanda placed two fingers to her mouth and gave a piercing whistle. Everyone froze. \"Back off, assholes! You're acting like pigs instead of men. Think about what you're doing!\" she snapped. \"If you rape us, we may not be able to identify you, but your friend behind the bar won't have such an easy time getting off the hook. Same thing if you take us somewhere else. Even if you killed us afterward, the cab company will have a record of bringing us here. And don't you think it'll make the news if three white women from the same town, all friends, disappeared suddenly. So stop thinking with your dicks for a change. Now, let them go so I can talk to them. Bartender, we've all had more than enough to drink. Please make a pot of fresh coffee and bring us each a cup. And bring some sugar and cream, too. Thank you.\"<br>\r\n<br>\r\nWanda collected the two women and led them to a nearby table. Vivian was furious. Sarah looked ready to cry. She sat them down and said in a low voice. \"Girls, we're in trouble. I don't see any way,\" she paused as the bartender appeared with three cups of steaming coffee, packets of sugar and a small container of cream.\"<br>\r\n<br>\r\n\"Sorry ladies. You really should never a come here. Only white girls we see in this place are hookers or tramps who just a soon blow a brotha on the floor as dance with one. Some time, we get five, six a them from the college wanna know what it like to fuck a black. One stays to keep a eye on while them others pick a buck and do it on a table. The one, she take pics a the girl getting filled with dark meat. Never aims the camera at a brotha's face, jus the cock pumping the chick and her face. I guess so's she knows it her when they sober the nex day. The brotha almost always gets to pump his load into her. Ever so often, the sober one will hold up a rubber before anything starts. That case, he'll stand there and she'll put it on afore him. These good guys mostly. Little rough sometimes, but all have jobs. You wan out, I get you out, this time. But, you not come back again. You unnerstan?\"<br>\r\n<br>\r\n\"Please give us a few minutes to talk and collect our wits before you say anything. We're going to discuss what we want to do while we drink this wonderful coffee. I'll come over to the bar and tell you our decision in a few minutes. Thank you,\" she smiled up at him. As he walked away, Wanda turned back to the others. \"I was looking for some action when we came in here. If you're being honest with yourselves, then you know you were, too. I'll admit, there is a little more action here than I'd planned on, but...\" <br>\r\n<br>\r\nShe grinned, \"I have to admit to being curious. And a couple of these guys are packing serious wood. Now, I'd really hate to have to take on all these guys myself. I'd hate to think my friends would leave me high and dry like that, but I'm not going to force either of you to stay and fuck a bunch of guys we don't know. And, I don't know about you, but I never thought to bring any rubbers with me, so I'm pretty sure it's going to be a night of bareback riding for me. How about it girls, are you with me?\"<br>\r\n<br>\r\nSarah rubbed her breasts. \"I don't know. Those two hurt me. I hope they didn't leave any bruises for Jim to find. I know he's cheated on me before, but I never really expected to find myself...\" her voice trailed off.<br>\r\n<br>\r\n\"I agree,\" said Vivian. \"Nothing rough and no Frenching unless we start it. I'm not crazy about letting some guy, uh, guys, I don't know shoot their loads into me, but I certainly didn't expect to find myself in this situation. You know, if I wasn't still about half drunk, I'd never agree to this. Shall we strip now?\"<br>\r\n<br>\r\nSarah said, \"I'm pretty smashed right now, too. In fat, I wanna feel a bunch of these guys shooting their spunk into me! Right after I go potty...\" she giggled.<br>\r\n<br>\r\nWanda said, \"Sarah, I think you meant fact, not fat. Anyhow, I'll tell the bartender we've decided not to leave the guys high and dry, as it were. As long as they meet our requests, we'll willingly give them what they want. How about this, we'll have them pick a pool ball out of a sack to see who goes in what order. It's first come, first served and vaginal sex only. If we want to suck someone's cock, the next guy in line is the lucky guy. He's also the next one to mount us. It doesn't matter if he cums in our mouth first or not, he's still the next one to fuck us. Right?\" The other two women nodded in agreement.<br>\r\n<br>\r\nVivian stood, \"I have to go to the restroom, also. Think we should just strip in there?\"<br>\r\n<br>\r\n\"No,\" Sarah said. \"We'll do it out here. I don't mean make a show out of it, but we'll draw a ball, too. From one to three. That can also be the deciding fuc, fa, facor, factor as who goes first with who. Or is it whom? Oh, fuck it! Com'n Viv. I really gotta pee.\" The two women staggered down the hall to the bathroom while Wanda went to inform the bartender of their decision. <br>\r\n<br>\r\nBy the time the girls returned from the restroom, every man in the bar was sitting in a chair, naked, along the dance area. Two small tables here placed end to end to make a place for the women. Wanda held up a sack and said, \"Vivian, you draw first. Then you, Sarah. I'll take whatever's left.\"<br>\r\n<br>\r\nVivian reached into the sack and pulled out the three ball. She walked over to the pool table and set the ball down on it, then walked back to the dance floor, sizing up the man in the third chair. He was very dark and Vivian shuddered at the thought of how erotic it would look as his dark meat drove in between her pale thighs.<br>\r\n<br>\r\nSarah had reached in and pulled out the one ball. She swallowed hard at the sight of the thick erection jutting from between the legs of the medium skinned man in the first chair. She hoped she could take him without being ruined forever. Wanda took her ball from her and said, \"Since I'm number two, why don't you go ahead and start stripping while I put these back. Gentlemen, I remind you, we don't start until all three of us are naked.\"</span></div></div>",
            "created":1215061200,
            "id":551313,
            "title":"Wanda talks the others into having sex with the..."
        },
        "151211":{
            "choices":[
                "Wanda strips."
            ],
            "content":"<div class=\"\"><div> <span>Sarah toed off her shoes and walked onto the dance floor. She slipped off the light sweater she wore to reveal her halter style cocktail dress. She reached up behind her neck to untie the straps. Holding the dress to her breasts, she strode to the edge of dance area and reached out to the man sitting in the first chair. \"I'm going to need just a little help. Will you help me since you're going to be the first to enjoy me tonight?\"<br>\r\n<br>\r\n\"Sure lady,\" he said quietly, \"I help you. Then you help me, yes?\" he replied, his thick cock swaying as he stood.<br>\r\n<br>\r\nDespite her fears of being ruined by the massive cock before her, Sarah could feel herself getting wet at the thought of taking him. She let go of the halter and it fell to waist. In the subdued lighting of the bar, the pale skin of her 36C breasts set against the deep sun-tanned brown of her chest appeared like ghostly patches floating in the air. Tiny bright pink nipples set in the middle of light brown aureole topped each breast. She held out her hand and led the man back to the middle of the floor.<br>\r\n<br>\r\n\"Lady,\" her first partner said, \"I hopes you don mind me playin wit them teats when we is to go at it. Them is the finest lookin teats I sees on a white girl in a long time.\"<br>\r\n<br>\r\nSarah reached back to untie the bow which had gathered her dress about her waist. As it came free, she reached out to take hold of the man's arm. Using it to steady herself, she slipped the dress down and stepped out of it. She released his arm momentarily to roll her pantie hose down to her knees. Taking the arm once again, Sarah removed the hose from one leg, then the other. She slipped her panties down and off before straightening to reveal her bare mound. The sitting men applauded and whistled approval as she picked her clothes up. Before walking back to the table where her friends sat, she said, \"As long as you're careful not to leave any marks or bruises my husband might find, I'm certainly hoping you'll play with them.\"</span></div></div>",
            "created":1216443600,
            "id":557517,
            "title":"Sarah strips."
        },
        "1512111":{
            "choices":[
                "The first man comes up and leads Sarah to the tables.",
                "The men pull more tables together so they can do all three women at once."
            ],
            "content":"<div class=\"\"><div> <span>Wanda grinned up at her dark haired friend as the 5'6\" Sarah came over to sit down beside her. At 110 pounds, Sarah was the most petite of the three. And, with her tan lines glowing ghostly white in the pale light, she looked far too young to be here. Only Wanda knew she had just turned 25.<br>\r\n<br>\r\nWanda stood now. She moved to the center of the dance floor. She knew her freckles stood out in the dim lighting as did her red hair. Standing 5'8\", she weighed in at 125 pounds and had some well placed padding. Her hands moved to the straps of her dress and within seconds, her 40DD breasts were out where the seated men whistled their approval. She slowly slid the dress off her hips and to the floor to absolute silence as the stunned onlookers took in thick mound of red hair covering her sex. She smiled and blew a kiss to her audience, leaving on her garter belt and stockings as she took her seat.<br>\r\n<br>\r\nVivian stood and moved to the dance floor. At 28 like Wanda, she was still well built. Her fingers unbuttoned her dress and it slid to the floor to reveal her tanned 38C breasts. Unlike her friends, Vivian tanned at the local spa and opted for the full body tan. When she peeled off her panties, her shaved mound was as tan as the rest of her. She gathered her things and sat down to wait her turn. Despite being nervous, she was also getting wet at the thought of all these men driving their thick cocks into her; filling her with their hot seed.</span></div></div>",
            "created":1219381200,
            "id":572991,
            "title":"Wanda strips."
        },
        "15121111":{
            "choices":[
                "Wanda takes her turn.",
                "Vivian goes over and starts giving her first man head."
            ],
            "content":"<div class=\"\"><div> <span>The first man sauntered over to where the women sat and extended his hand to Sarah. As she took it, she could feel herself getting very wet. Her nipples were rock hard and not just from the temperature in the bar. As they reached the table, the man grasped her by hips and lifted her easily, placing her bottom close enough to the edge so he could enter her easily, but far enough back so she could place her feet on the table, also. Sarah did just that, letting her knees fall to the sides so her vagina was open for all to see.<br>\r\n<br>\r\nThe man came around the side of the table, his penis only half erect. Sarah gasped as she saw it! It had to be all of 9 inches long and thick as her wrist already. He smiled down at her, his teeth shining in the dim lighting. Sarah found herself moaning with pleasure as his thick lips closed over her nipple. His hands cupped both breasts and the fingers of the hand fondling her free breast tweaked and teased her nipple. Sarah moaned louder as sharp teeth nipped lightly at her nipple followed by a tongue which flickered ever so lightly over the sensitive skin of her breast.<br>\r\n<br>\r\n\"Don't stop!\" she moaned as the hand caressing her off breast moved slowly down to her bare mound. It rubbed gently over and around her clit and she arched her back in response to the climax which raced through her! She knew it was partially the excitement of cheating on Jim, but part of it was the thrill of being handled by some black man she'd never seen before and would never see again after tonight. \"Plus,\" she thought to herself, \"this guy really knows what to do with a pair of breasts!\" She moaned again as the man suckled her other breast, the wiry hair of his chest rubbing over her saliva-dampened nipple. <br>\r\n<br>\r\nSarah could feel the two fat fingers sliding easily into her while an equally fat thumb continued to circle her fully engorged clitoris! \"Uh! Uh! Uh!\" Sarah panted as another climax began to wash over her. \"Nooo!\" she hissed as his mouth left her breast. Suddenly, he was in her and her climax rocketed over the top and Sarah couldn't see anything but stars before her eyes as he drove his thick organ fully into her! She felt his balls slap against her anus as he pumped into her hard and fast on minute, then slow and gently the next. It was maddening the way his penis rubbed against her clit with each stroke. Sarah was soon panting again as another climax built within her! <br>\r\n<br>\r\n\"This time, I cum in you, yes?\" whispered a voice in her ear.<br>\r\n<br>\r\n\"Yesss!\" she hissed. \"I want to feel you shoot your spunk into my white pussy! Fill me with it! DO IT!\" she screamed as she clawed at his back as she arched her back, raising both of them off the table. He held onto her hips as he drove wildly into her. He stiffened, then drove forward, smashing her to the table as he gave a half pump as his balls emptied a massive load of sperm straight into her womb! Sarah had her legs wrapped around him, pulling him into her as tightly as she could as her vaginal muscles worked at his prick, straining to milk every drop of his semen it could! Finally, sweat-covered, both of them lay on the table, gasping for breath.<br>\r\n<br>\r\nAfter a short while, Sarah looked up into the dark eyes of the man who had just given her the best fuck of her life. \"Thank you! You were great!\" She called out into the air, \"Whoever is my next man, you've got quite a job to do to beat this guy!\" There was a wave of laughter and scattered applause as the man who, having already climaxed, was still partially erect, started to move. \"Wait a moment, please. Bartender, bring me one of those empty champagne glasses please.\" <br>\r\n<br>\r\nSarah had meant one of the wide-brimmed glasses, but the bartender brought her a tall, narrow-lipped glass. He winked and said, \"I think you'll find this works better than what you asked for, lady.\"<br>\r\n<br>\r\n\"Would you hold it in place until I can?\" she asked, blushing. He nodded and moved to one side of the table, holding the glass pressed into her bottom, just below her vagina. \"Now, slowly, pull out of me.\" Her lover nodded and slowly withdrew his penis. Semen gushed from her gaping hole into the glass the bartender held. More semen gushed from within her as she sat upright. \"Wait!\" she commanded the man who had just fucked her so well. Sarah took the glass from the bartender with a whispered, \"Thanks,\" and held it firmly against her vagina as she knelt before her lover. She sucked his semen covered cock into her mouth and held it there until she had completely cleaned it of both semen and her own juices. <br>\r\n<br>\r\nShe stood, licked her lips and kissed him gently. \"You were great. If I ever decide to come adventuring again, I hope you're here.\" By this time, the glass had filled to almost two-thirds of its capacity. Sarah raised it to her lips and drained it, drinking it straight down without stopping to breathe. \"Mmm! Good!\" She smiled to the stunned men sitting there and walked back to the table where her equally stunned friends sat. She still held the glass between her legs as more semen dripped out of her. \"Next!\" she said with a smile.</span></div></div>",
            "created":1223442000,
            "id":592487,
            "title":"The first man comes up and leads Sarah to the t..."
        },
        "151211111":{
            "choices":[
                "Vivian takes her turn.",
                "Tired of waiting, the men pull out more tables and ..."
            ],
            "content":"<div class=\"\"><div> <span>Wanda stood upas her first man came over to collect her. She followed him over to the table and crawled up onto the table herself. Before she could turn and lay dwn, she felt his tongue drive into her wet gash. \"Oh yeah,\" she purred as he reached around her to start pulling on her tits. \"Thatsit, baby,\" she called, \"Milk me! Just keep it on the not too rough side.Can't leave any bruises for hubby to find.\"<br>\r\n<br>\r\nHis hands tightened around her breasts. \"Why do I care about what your man finds?\"<br>\r\n<br>\r\nWanda straightened, jerking her breasts. \"You should care because while we agreed to fuck every man here tonight, we agreed only as long as no one left marks our husbands would find. Now, if you can't abide with our agreement, maybe we should just all go home. I don't think your waiting friends will be too happy with you, though.\"<br>\r\n<br>\r\n\"Hey Josef, just fuck her and let the rest of us get our turn!\" yelled the next man in line as Vivian lazily laped at his thick shaft.<br>\r\n<br>\r\n\"Yeah man!\" several of the others choroused. <br>\r\n<br>\r\n\"You fuck it up for us, we fuck you up, man!\" a couple more yelled.<br>\r\n<br>\r\n\"Fine!\" he snarled. \"On your back, bitch! I'll fuck you like you ain't never been fucked afore!\"<br>\r\n<br>\r\nWanda had barely spread her legs before the fat, ten inch cock was thrust brutally into her. \"I'd like to see what it looks like,\" she thought as her sopping pussy made sucking sounds with each backstroke. Wanda tightened her vaginal muscles around the cock on each backstroke to make this man reach his climax quicker. But, for all hat, he knew what he was doing as he grinned evilly down at her.<br>\r\n<br>\r\n\"You fuck prettygood for a white bitch,\" he gasped as he thrust harder into her, making her breasts bounce up and down her body from stomach to chin. \"We get together again sometime and I make you want to leave you man for me.\"<br>\r\n<br>\r\nWanda said nothing as she wrapped her legs around his waist. Secretly, she'd wished he could have mauled her tits. Her husband barely played with them enough as it was, let alone played with them the way Wanda wanted him to do. She had often wished he would have pulled on them; sucked on her fat nipples until they were bruised from his lips. She yearned for his hands to squeeze her soft melons until his fingerprints marked them as his to do with as he pleased. Wanda wished one day, Bill might even accidently bite down on her tits so she could get at least some real pleasure out of his fumbling attempts at love-making. Being honest, she knew he wasn't bad in the sack; just getting to that point though.<br>\r\n<br>\r\nAs the dark man between her legs thrust deeply into her, his head back as he roared his climax, Wanda captured one breast in her hands. She drew it to her mouth. When her teeth touched her nipple, it was enough to send her to her own climax!  As waves of pleasure rolled over her, she was vaguely aware of something hot and wet striking her breasts, her belly nad her mound. She looked to see the thick black penis, slimey with semen and her own juices, spurting more globules of hot jizz lazily into her thick pubic hair. <br>\r\n<br>\r\nAs the last glob more fell than anything, the black man between her legs moved up to her head. He took a thick hand of her hair and wiped himself clean. Wanda, to her surprise, found herself totally aroused by this. She sat up and using her fingers, scooped up the globs of semen coating her body. As she sucked her fingers clean, she realized she was about to climax again. She drove her hand through her pubic hair and climaxed hard as her cum slick fingers rubbed her engorged clit. When she was finally able to see again, she said to Vivian, \"Next!\"</span></div></div>",
            "created":1238562000,
            "id":669649,
            "title":"Wanda takes her turn."
        },
        "1512111111":{
            "choices":[
                "said, just one at a time. If you have to leave, sorry.",
                "said, let's make it a free for all so everyone can have a turn."
            ],
            "content":"<div class=\"\"><div> <span>Vivian stood, her hand still clamped around the penis she had so recently been sucking. Asthey reached the table, she purred, \"How you want me, baby? You want me flat on my back or on hands and knees?\"<br>\r\n<br>\r\n\"You jus' plant them feet flat on de floor. Bend over an hol' on for de ride a your life.\"<br>\r\n<br>\r\nVivian had barely started bending over when she felt the thick prick enter her wet gash. \"Oh hell yes!\" she screamed as the cock entered her fully. With her thighs pressed firmly against one side of the table and her hands holding the other side tightly, the man held her hips for leverage as she drove himself into her dripping vagina. Vivian could only gasp with pleasure as her breasts, mashed flat against the cool laminate of the table, had just enough play in them for her hard nipples to react as if two hands were rolling and mashing them around as the man behind her drove his full length past the soft, squishy flesh of her cervix and fired his sperm straight into her willing womb. <br>\r\n<br>\r\nShe was on the pill, so she knew pregnancy was out. But, Vivian could wish that just this once, with a lover this good, her birthcontrol would fail. She and her husband, Tom, had talked about having children. Tom had just turned thirty and was beginning to shy away from the idea. He kept talking about how old he'd be by the time their child would be in high school. Right then, as she was screaming out her climax, being fucked by a man she doubted she would ever know in front of more unknown men, some still waiting their turn with her, Vivian made her decision. After this night, she was stopping her birth control. She would tell Tom that she was going to have children. They could be his or she would find someone interested in getting her pregnant!<br>\r\n<br>\r\nBy the time the man had finished his climax within her, the table under her was slick with her sweat. As her man pulled out of her well-fucked pussy with the expected wet plop, the bartender slipped a glass under her to catch the copious load of semen dripping from her sex. She thanked him as she knelt to clean the prick of her lover. After his cock was glistening with her saliva, she stood and kissed him soundly on his lips, driving her 38C breasts into his chest. \"Thank You,\" she whispered into his ear, \"That was the best fuck I think I've ever had! Do you come out here often? I'm certain I'd love to make it with you again.\"<br>\r\n<br>\r\nHe laughed lightly, \"I be married. Sometime, I get here onct a montd. Sometime ever uder. If'n I sees you, I gives you good fuckin, yes?\"<br>\r\n<br>\r\n\"Oh yes!\" Vivian purred. She pulled the glass up from her pussy. It was only half full of his thick cream. She drank it straight down anyhow. She knew she'd be leaking semen most of the night. She took his arm and he led her back to her seat. <br>\r\n<br>\r\nSarah had stood, drinking down about a third of a glass of semen which had dripped from her own pussy. \"I guess it's my turn again,\" she said as she moved toward the table.<br>\r\n<br>\r\n\"Hey,\" one of the men called. \"It's getting late and most of us have to go to work soon. Hows about we move out some more tables and double or triple up on yous girls?\"<br>\r\n<br>\r\nThe girls looked at each other and...</span></div></div>",
            "created":1240549200,
            "id":680811,
            "title":"Vivian takes her turn."
        },
        "15121111112":{
            "choices":[
                "The three women leave alone.",
                "The three leave with Jimmy in tow."
            ],
            "content":"<div class=\"\"><div> <span>The girls looked at each other and shrugged. \"It's alright with me,\" Sarah giggled.<br>\r\n<br>\r\nWanda and Vivian broke into giggles and nodded their agreement. Four of the men had tables gathered within seconds. Three men surrounded each of the women. Wanda pointed at one of her three and said, \"You lay down on the table. You two pick me up and after I get him into my ass, you,\" she said, pointing at another, \"shove that cock into my cunt and you,\" she said with a grin at the last man, \"I hope you taste as good as you look!\"<br>\r\n<br>\r\nVivian looked at two of the men and said, \"You get on the table and I want you in my pussy. I want you,\" she said, pointing at the other man, \"to shove your cock into my pussy, too. And you, my fine bucko, fuck my face until you cum,\"<br>\r\n<br>\r\nSarah just laughed. \"You guys decide who gets me where. But, if any of you fuck my ass, you have to cum in there. For the one of you who fucks my pussy, you can cum in there, but I'd prefer to eat it if I can.\"<br>\r\n<br>\r\nThe men wasted no time getting into position and began fucking the women in ernest. In no time at all, all of the women were moaning out their orgasms as the men pounded them. Vivian was writhing under the pounding of the two men driving their cocks into her pussy, her moans muffled by the man thrusting deep into her throat. <br>\r\n<br>\r\nWanda started swallowing quickly as the man in her mouth screamed out his climax. <br>\r\n<br>\r\nSarah gasped as her mouth suddenly filled with semen. She gagged slightly, but went back to swallowing as more semen pumped into her willing mouth. As soon as th man in her mouth pulled out, the guy who had been humping her pussy pulled out and ran to her head. She opened her mouth as he began spraying his load, pumping his cock wildly. Semen sprayed all over her face and into her hair as she reached out to pull him into her mouth.<br>\r\n<br>\r\nVivian was thrashing about as the men fucking her climaxed also. Their hot cum gysered into her body, filling all three of her holes to overflowing. <br>\r\n<br>\r\nFinally, it was over. All three women lay on the tables, sweating and dripping semen from various places. All of them looked quite pleased. The man who had been the first to fuck Sarah said to her, \"I come in on Friday nights. You come back any time, you ask the barman for Jimmy. He know where I be.\"<br>\r\n<br>\r\n\"You doing anything now? You could come back with me...\"<br>\r\n<br>\r\nJimmy laughed, \"No lady. I make your neighbors think bad things. Maybe tell husband.\"<br>\r\n<br>\r\n\"They won't know if you spent all day with me and leave tonight. Of course, there are three of us...\" Jimmy laughed as he shook his head.</span></div></div>",
            "created":1241648040,
            "id":687354,
            "title":"said, let's make it a free for all so every..."
        },
        "151211111121":{
            "choices":[
                "The next night, after Sarah called Jimmy.",
                "Follow the girls after they leave."
            ],
            "content":"<div class=\"\"><div> <span>Sarah got up on shaky legs. She grabbed hold of Jimmy's arm to steady herself. She leaned over and whispered into his ear, \"How about I come home with you and we spend the day in bed?\"<br>\r\n<br>\r\nJimmy laughed, \"Lady, I gots a job I needs to be at inna morning.\"<br>\r\n<br>\r\n\"Are you married? Or have a girl? Can I at least get your number?\" <br>\r\n<br>\r\nJimmy shook his head, but scribbled a number on a napkin and handed it to her, \"You call me when you want, but I don' use no rubbers. You know that.\"<br>\r\n<br>\r\n\"Oh yeah,\" Sarah moaned, \"I know. And, I'll be calling you very, very soon, like tonight!\"<br>\r\n<br>\r\nJimmy laughed as she blushed. The other women laughed, too.<br>\r\n<br>\r\nWanda said, \"Our husbands are going to be out of town for the weekend again in exactly five weeks. We could get together somewhere else and get started earlier and stay later. Who knows, we might even be up for a few more of your friends, if you wanted...\" her voice fell off as she blushed as what she'd just said sunk in. But, that hadn't made what she'd said any the less true. <br>\r\n<br>\r\nVivian nodded. \"I'm in, if you guys are interested. That would include you,\" she said, looking over her shoulder at the bartender. \"Just remember about leaving noticeable marks.\"</span></div></div>",
            "created":1264882560,
            "id":827979,
            "title":"The three women leave alone."
        }
    },
    "info":{
        "author_id":"geminikc",
        "author_name":"GeminiKC",
        "brief_description":"What will happen to 3 housewives out on the town, looking for a good time?",
        "created":976663020,
        "description":"<td align=\"left\" class=\"norm\">When their husbands go on a hunting trip for the weekend, Sarah, Vivian, and Wanda have a few drinks and then decide to go out on the town and have some real fun. What kind of fun? Let's find out!!  </td>",
        "id":107828,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1484346960,
        "modified":1484346960,
        "pretty_title":"Ladies Night Out"
    }
}