{
    "chapters":{
        "1":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Amanda",
                "Jessica",
                "Mary ",
                "Anthro maid",
                "More maids"
            ],
            "content":"<div class=\"\"><div> <span>You're a 16 year old boy. Your name is nick, <br>\r\nAnd you are 5'7\" have brown hair, You have <br>\r\n6\" penis, and you're Pretty much a typical <br>\r\n16 year old boy. Some of your hobbies include, <br>\r\nSwimming, Horseback riding, and gaming.<br>\r\nYes you have a pool, horse's, and a few <br>\r\nGaming systems<br>\r\n<br>\r\nWho will be your maid<br>\r\n<br>\r\nAmanda 26<br>\r\n5'10\", brown hair, E cup breasts, and a huge ass<br>\r\n<br>\r\nAmanda is a vary hot busty maid that took the maid<br>\r\nJob when she was on hard times, now she stays <br>\r\nBecause your family pays her better than any other<br>\r\nJob would, and now in your teen years, your glad she <br>\r\nStayed.<br>\r\n<br>\r\nJessica 19<br>\r\n5'6\", blond hair, C cup breasts, and a regular size but<br>\r\n<br>\r\nAn attractive high school graduate who took the maid <br>\r\nJob to help pay for collage<br>\r\n<br>\r\nMary 45<br>\r\n5'9\", brown hair, D cup breasts, and a big ass<br>\r\n<br>\r\nFor her age, Mary is a vary attractive woman,<br>\r\nYour mom met her in a book club and offered<br>\r\nHer a job, and she has done a great job over <br>\r\nThe years<br>\r\n<br>\r\nOr, how about a anthro maid?<br>\r\n<br>\r\nMaybe you could get some tail this summer.</span></div></div>",
            "created":1468990800,
            "id":2183387,
            "title":"Who's your maid"
        },
        "11":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Go back to sleep",
                "Go down stares for breakfast",
                "Amanda is standing at the door",
                "Take a shower",
                "Call Amanda to your room"
            ],
            "content":"<div class=\"\"><div> <span>Your mom and Sister have left on their mother daughter<br>\r\nBonding trip last night. Your mother decided to pay Amanda<br>\r\nA little extra to live at your house over the summer. Her job <br>\r\nWas to help take care of you by cooking ,cleaning and<br>\r\nKeeping you out of trouble, not that you ever got into any,  <br>\r\nBut your mom was kinda concerned about you throwing<br>\r\nA party and messing up the place.<br>\r\n<br>\r\nAny way. You wake up on Saturday morning at 8:00am, <br>\r\nWhat do you do now?</span></div></div>",
            "created":1469077200,
            "id":2183848,
            "title":"Amanda"
        },
        "111":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "Diaper",
                "Under wear",
                "nothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up and open your eyes Amanda is standing over you, \"Hi Sweetie it is 12:00 time for lunch.\" you throw back your covers and you notice you are wearing a</span></div></span></div>",
            "created":1503118800,
            "id":2371615,
            "title":"Go back to sleep"
        },
        "1111":{
            "choices":[
                "Dry",
                "Wet",
                "Messy",
                "Wet and messy"
            ],
            "content":"<div class=\"\"><div> <span>A very thick white diaper tight around your waist is revealed as you remove your covers. It crinkles loudly as you climb out of bed. You slightly adjust the diaper around your waist to make it more comfortable. As you stretch your arms in the air Amanda reaches down for your crotch and grabs the front of the diaper, while feeling it she notices it is</span></div></div>",
            "created":1503723600,
            "id":2375178,
            "title":"Diaper"
        },
        "112":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "We could go horse back riding or swimming",
                "We could go to the mall",
                "I have another idea"
            ],
            "content":"<div class=\"\"><div> <span>You feel like you can't go back to sleep so you decide<br>\r\nTo head down for breakfast.<br>\r\n<br>\r\nWhen you get to the kitchen you see Amanda cooking<br>\r\nUp some breakfast, and she turns around and sees you<br>\r\nStanding in the door way, and she kinda laughs and said <br>\r\nTo you. \"It must be a very special day for you to be up<br>\r\nThis early\". You just rub your eyes and sit down at the <br>\r\nTable and say. \"Ya, it's the first day in months I can <br>\r\nPlay my games on the big tv in the living room without <br>\r\nSome one telling me to turn it to a chick flick.\" Amanda<br>\r\nThen looks at you and says. \"Come on, it's a beautiful day <br>\r\nOut side. You could go swimming in the pool, we could go<br>\r\nHorse back riding, we could even go the the mall and <br>\r\nTake a look around.\" You think those over and say.<br>\r\n\"Those do sound kinda fun. So what's cooking this <br>\r\nMorning.\" You say feeling a little hungry. \"I'm making <br>\r\nPancakes, bacon, and hash browns. If you want I'll make <br>\r\nYou a plate.\" You say yes pleas, because it look so good.<br>\r\n<br>\r\nYou and Amanda then sit down and eat breakfast <br>\r\nTogether, then Amanda says. \"So what should we do<br>\r\nToday?\"</span></div></div>",
            "created":1477630800,
            "id":2229481,
            "title":"Go down stares for breakfast"
        },
        "1121":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "Sure",
                "No",
                "Let's skip the mall",
                "Free chapter",
                "Free chapter"
            ],
            "content":"<div class=\"\"><div> <span>\"mmm,\" Amanda says wiping her mouth, \"lets go horseback riding have lunch and then go swimming.\" you nod in agreement, \"one thing though before we can do that I need to go to the mall to get some things, do you want to come?\" Amanda asks.</span></div></div>",
            "created":1503118800,
            "id":2371616,
            "title":"We could go horse back riding or swimming"
        },
        "1122":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Cloth shopping",
                "Pick up your game",
                "Good court first",
                "Something else to go shopping for",
                "Free chapter"
            ],
            "content":"<div class=\"\"><div> <span>You look to Amanda and say. \"I guess we could go to the<br>\r\nMall, and I could pick up that new ww1 game that came<br>\r\nOut last week.\" Amanda kinda laughs and said. \"If that's<br>\r\nWhat it takes to get you out of the house. Any way, you <br>\r\nShould go and Chang out of your pajamas, and I'll clean<br>\r\nUp from breakfast. Just tell me wen you're ready to go.\"<br>\r\n<br>\r\nYou eat your last bit of hash browns and head up stairs, <br>\r\nAnd get a set of clothes, and get dressed. You decided <br>\r\nJust to wear a t shirt and shorts because you knew today<br>\r\nWould be a hot one. After you finish, you head down and <br>\r\nSee Amanda putting the last dish in the dishwasher. She <br>\r\nThen turns to you and says. \"If you ready go out to the <br>\r\nCar, and I'll be a minute. Just need to go pee.\" You nod <br>\r\nYour head and go out to the car. About a minute after <br>\r\nYou get in, Amanda gets in and pulls out of the driveway<br>\r\nAnd heads to the mall. You two just listen to the radio for <br>\r\nAbout 15 minutes. Then Amanda specks up and says.<br>\r\n\"So, how'd your school year go\" you reply with.\"it was <br>\r\nGood. Look forward to next year.\" Amanda then said.<br>\r\n\"Ya, grade 11 is a fun year. So, do you have a girlfriend.\"<br>\r\nYou then blush a little and say. \"For a bit, but we both<br>\r\nAgreed we had nothing in common, so we broke it <br>\r\nOf before anything got to serious. How about you.\"<br>\r\nAmanda than said. \"No, I broke up with my ex a year <br>\r\nAgo. We just had nothing in common. So pretty much<br>\r\nThe same reason you broke up with your girlfriend.\"<br>\r\n<br>\r\nYou two keep talking about stuff and such for about 30<br>\r\nMinutes until you both arrive at the mall. You then get <br>\r\nOut and Amanda said to you. \"What should we do first.<br>\r\nWe could go cloth shopping first and you could help me<br>\r\nPick something out. or we could pick up your game. <br>\r\nWhat should we do?\"<br>\r\n<br>\r\nWhat do you decide to do first</span></div></div>",
            "created":1478494800,
            "id":2233898,
            "title":"We could go to the mall"
        },
        "11221":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "The Skimpy one",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Amanda leads you into a very girly store and has you help her pick out bunch of outfits, she then checks out at the cash register, walking down the hall she suddenly pulls you into a girls bathroom and locks you into a stall with her, \"now I don't want you to fight me, your mom said that I was completely in charge of you and could change up your wardrobe if I wanted so which of these new outfits do you want to wear?\" only then did you relies that the outfits seemed a bit small for Amanda.</span></div></div>",
            "created":1503118800,
            "id":2371619,
            "title":"Cloth shopping"
        },
        "112212":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "The dress",
                "The body suit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So... which one</span></div></span></div>",
            "created":1503118800,
            "id":2371621,
            "title":"More choices"
        },
        "1123":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Start the movie maithon.",
                "Go out for a jog.",
                "Suggest something else."
            ],
            "content":"<div class=\"\"><div> <span>\"I have another idea. What would you think about<br>\r\nA movie night. We could make some popcorn, we<br>\r\nCould get some ice-cream and candy, and just <br>\r\nRelax for today.\" Amanda looks a little interested <br>\r\nBy your proposal. \"That doesn't would like a bad <br>\r\nIdea, I haven't done a movie binge in a long time.<br>\r\nNow should we start watching now or should we <br>\r\nDo something else first.\" You then ask her. <br>\r\n\"What did you have in mind.\" Amanda looks to <br>\r\nYou and says. \"I don't know. We could go for a<br>\r\nJog around the neighborhood. You know, get nice<br>\r\nHot and sweaty. I know how much you love seeing<br>\r\nThese all sweaty.\" She said grabbing her breasts <br>\r\nIn font of you. \"Or if you can think of anything better <br>\r\nthen we could do that.\" Your interests in her idea. <br>\r\n<br>\r\nWhat do you want to do?</span></div></div>",
            "created":1483246800,
            "id":2257396,
            "title":"I have another idea"
        },
        "11231":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "nothing",
                "a pair of boxers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Good I have the movie room already set up go to your room and change out of your clothes I have the most comfy outfit for you to wear, once your undressed meat me in the movie room!\" you show up wearing</span></div></span></div>",
            "created":1503118800,
            "id":2371625,
            "title":"Start the movie maithon."
        },
        "11232":{
            "choices":[
                "A small figurine of a man with a large penis ",
                "A small figurine of a woman that is hugely fat",
                "You find both the figurines"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go for a jog.\" you say, getting up. Amanda's eyes dart to your crotch for a moment.<br>\r\n<br>\r\n\"Alright, I'll meet you out front. I'm going to change into something better to jog in.\" Amanda said<br>\r\n<br>\r\nAfter a few minutes, the two of you rendezvous at the front door of the mansion. You're wearing a tank top, gym shorts and some tennis shoes. Amanda is wearing a sports bra, booty shorts, and  some tennis shoes as well. <br>\r\n<br>\r\n\"You ready?\" She asks<br>\r\n<br>\r\n\"Yea, let's go.\" you reply. The two of you set off, it's quite a jog just getting to the front gate. You really enjoy letting her get infront and watching her jog ahead. A few minutes after getting to the street and starting down it, you notice something in the brush by the road. You stop to pick it up, what is it?</span></div></div>",
            "created":1521435600,
            "id":2466264,
            "title":"Go out for a jog."
        },
        "112323":{
            "choices":[
                "Keep the male figure with you",
                "Keep the female figure with you",
                "Carry both of them",
                "Tell Amanda about the figures"
            ],
            "content":"<div class=\"\"><div> <span>You stop and breath heavily as the slight glint of the figures catch your eye. You shift through a bush and pick up the two figures, they're made of some precious stone and are simple in make, but completely smooth. The male is normal shaped, but looks like he has a third leg. The female is also normal shaped, but with huge breasts displaced by a huge belly, which is complimented by a huge ass. Holding them made you feel funny, but you shook it off and started jogging again to catch up with Amanda. It didn't take long to catch up with her, she had stopped to let you catch up, but now seemed very out of breath and was fanning herself.<br>\r\n<br>\r\n\"You ready to head back?\" she asked, her breasts jiggling in sync with her arm flapping.<br>\r\n<br>\r\n\"You alright?\" you ask<br>\r\n<br>\r\n\"Yea, it's just really hot out right now.\"<br>\r\n<br>\r\n\"What? No it's not?\"<br>\r\n<br>\r\n\"Yea, it is. We're going back now. Besides, we've jogged far enough.\" she said as she started jogging back to the house. This didn't last long, and you were both soon walking, you having the figures in your pocket, the funny feeling still lingering. You noticed something different about her, but couldn't place it. Back at the house, you both walked into the foyer and enjoyed as the cool air washed over you. Then you noticed what was up with her. She was plumper than before you left. Her shorts, tight to begin with, were now skin tight; a slight bulge formed over the waist band and her breasts were also bulging out of her sports bra slightly.<br>\r\n<br>\r\n\"I'm going to go change. Lunch will be ready at 12.\" she said shuffling off. When she got out of view you went up to your room and started changing to take a shower. When you took the figures out of your pocket and placed them on your bathroom vanity, you noticed the feeling was gone. Then, as you took for briefs off, you noticed a change in yourself: your dick was an inch longer and your balls were slightly bigger. You step into the shower and ponder what to do as you shower.<br>\r\n<br>\r\n(Nick making contact with the male figure causes his dick and balls to grow, making contact with the female figure makes Amanda fatter)<br>\r\n</span></div></div>",
            "created":1521435600,
            "id":2466267,
            "title":"Strange Figures"
        },
        "1123233":{
            "author_id":"diblyribly",
            "author_name":"Gabidy-Gook",
            "choices":[
                "Amanda notices your expanded package",
                "A button pops off of Amanda’s clothing"
            ],
            "content":"<div class=\"\"><div> <span>As you exit the shower, feeling refreshed, you decide to carry both of the small statuettes in your pocket. You put on some boxers and gray sweatpants along with a blue sleeveless shirt and slide the figures into your pocket, again the strange feeling washed over you. You left your room and head down to the entertainment center, as you boot up your gaming PC and settle into the couch, you notice the time says 11:50. “Awesome, lunch will be ready soon and I can see if these things have any effects on her appetite.” You think as you pull up steam and continue on a game. Several minutes later, Amanda enters with lunch, which you could smell before she entered.<br>\r\n<br>\r\n“Lunch is ready, Will you be dining in here?” Amanda asked<br>\r\n<br>\r\n“Yea, care to join me?” You ask as you switch your computer over to Netflix<br>\r\n<br>\r\n“Sure, I will.” She replied as she wheeled a cart around to the front of the couch, “Today you are having: Marinated Chicken, seared in olive oil, with seasoned and baked asparagus.” she continued as she handed you your plate and some utensils.<br>\r\n<br>\r\n“And you?” You asked looking her up and down, her maid outfit was definitely more snug, with buttons straining all down the front.<br>\r\n<br>\r\n“I already ate but I found myself ravenously hungry so I brought the rest of the chicken and a box of zebra cakes.” she responded plopping down on the couch next to you, the buttons across her stomach stretched far enough for spaces to become visible between them. You also found her choice in food different, as she usually chose meals that were very lean, granted chicken is a lean meat but the zebra cakes were very out of the ordinary. <br>\r\n<br>\r\n“Oh! Can I have one?”<br>\r\n<br>\r\n“Yea sure, here” she says handing you a zebra cake. You both dig in to your meals as an episode of an old sitcom plays on the screen. You noticed Amanda are rather quickly and seemed to enjoy the cakes more than you thought she would. After the two of you finished, she placed the used plates on the cart and got up to take it back to the kitchen, you noticed her butt was very well pronounced in her skirt as well as her hips. She carted it away and returned shortly after to find you back on the game from earlier, you shifted in your seat as you felt you needed more room. She sat down next to you and silently watched for a bit.<br>\r\n<br>\r\n“Don’t have anything better to do?” You ask her<br>\r\n<br>\r\n“I don’t know, I just feel really sluggish, and this game in particular has always interested me, so I thought I’d sit and watch for a bit. Is that okay?”<br>\r\n<br>\r\n“Yea, yea. Watch a bit. It’s really interesting.” You started to chat with Amanda about the game and she scooted closer to you, her arms inadvertently pressing her expanded bust together. You adjusted in your seat again, feeling your member swell slightly.<br>\r\n<br>\r\nSuddenly...</span></div></div>",
            "created":1524286800,
            "id":2482380,
            "title":"Amanda’s Gain, Nick’s Expansion"
        },
        "11232332":{
            "author_id":"diblyribly",
            "author_name":"Gabidy-Gook",
            "choices":[
                "Amanda returns with more food ... and less clothing",
                "Amanda's taking a while to return so you go check on her"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, a button popper off of Amanda's shirt, between her enlarging breasts. It pinged on the floor a few feet away. You froze on the spot in arousal at the action. After a brief moment, Amanda spoke up<br>\r\n<br>\r\n\"Why'd you stop?\" she asked<br>\r\n<br>\r\n\"Oh, I was just thinking about what to do next.\" you lied<br>\r\n<br>\r\n\"Alright, don't you just need to hit that switch over there?\" <br>\r\n<br>\r\n\"Yea! Thanks for pointing that out.\" you replied, glancing at her bust, flesh oozing out of the hole and all the buttons had spaces around them. Her shirt had actually ridden up, allowing her belly more room to expand onto her fat thighs. Your lengthening rod stiffened in your pants, you could feel the head brush past the hem of the boxers. You hit the switch and a gate opened and you finished the level which rolled into a cut scene.<br>\r\n<br>\r\n\"Yay! It worked!\" Amanda said excitedly, lifting her arms slightly in victory. More buttons popped off. Your erection painfully stiffened at the sound of the buttons flying. You plainly looked at her breasts to see flesh spilling over every side of her too-small bra. Her belly popped off another button as you looked back up to her face. Your eyes met and she gave you a sly grin and pressed her elbows together slightly. You looked back to the screen, flustered, and continue playing. Amanda leaned on you slightly, putting her plump arms around one of yours. the feeling of all her fat pressing into you, her warm skin slowly sliding as she grew fatter, it was almost too much for you! A little while after the cut scene, her Amanda's stomach growled.<br>\r\n<br>\r\n\"Hungry again?\" you ask.<br>\r\n<br>\r\n\"I guess so. Can you pause it while I go get something?\" she responded, getting up, you saw that the clasp on her skirt was broken as well. You were awe stuck by the shape of her, just like the small statuette.<br>\r\n<br>\r\n\"Yea, sure.\" you saw as she waddles away, her hips swaying hypnotically. After she closed the door behind her, you put the keyboard to the side and rub your cock, trying to relieve some of the tension. It was a foot long now, and you could see the outline of the your balls through your sweatpants.<br>\r\n<br>\r\nAfter a while...</span></div></div>",
            "created":1524373200,
            "id":2483055,
            "title":"Amanda's Expanse"
        },
        "112323321":{
            "author_id":"diblyribly",
            "author_name":"Gabidy-Gook",
            "choices":[
                "She gets up to go get more food to eat.",
                "She gets up, but stumbles back and lands on you.",
                "She yawns and lays her head on your lap."
            ],
            "content":"<div class=\"\"><div> <span>After a while, Amanda waddles back in wearing an ill-fitting tank top and underwear. She holds a package of Oreos in her hand as she sits back down on the couch, her fat thighs and hips spreading wide as she eases her weight down. Her belly rests on her lap and her boobs take up most of the space in the top, spilling over the sides and front. You can see them ever so slowly grow. You looked back up at her eyes, the beautiful gems. She simply smirked and giggled.<br>\r\n<br>\r\n\"Focus on the game, silly.\" she says, pointing a the screen, her upper arm jiggles slightly<br>\r\n<br>\r\n\"Yea, yea.\" you say with a blush. You had moved the keyboard down on your lap to hide your growing member, but you could feel the head sliding along the underside of the keyboard, not to mention it being pushed up as your balls swelled under it. You glance down, it doesn't seem too noticeable yet. You resume the game and keep playing, Amanda growing and munching on Oreos in your peripheral vision.<br>\r\n<br>\r\n***<br>\r\n<br>\r\n\"Mph,\" she said with a mouthful of oreos, her fingers pinching air in the package, \"All out, damn. Just in time for you to finish the level, too.\" You looked over at her, and stared, her breasts were almost tearing their way out of the top, her underwear was completely obstructed by her fat, so whether they were still there or not was a mystery. You swallowed dryly as you felt your member start to harden, the head quickly going past the keyboard. There was no way she'd miss it!</span></div></div>",
            "created":1546664400,
            "id":2598987,
            "title":"Comfort Food and Comfort Clothing"
        },
        "113":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Im going to the store Do you need any thing?",
                "I've been waiting for us to be alone",
                "Just letting you know breakfast is ready",
                "I need you for your services ",
                "Free chapter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You rub your eyes and you see Amanda standing<br>\r\nIn the door way. She then says to you...</span></div></span></div>",
            "created":1501218000,
            "id":2360689,
            "title":"Amanda is standing at the door"
        },
        "1131":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Yes I do need something ",
                "I don't need anything",
                "Can I come with?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'm going to the store. Do you need anything?\"<br>\r\nAmanda said with her keys in hand.<br>\r\n<br>\r\nYou think about it and...</span></div></span></div>",
            "created":1501390800,
            "id":2361718,
            "title":"Im going to the store Do you need any thing?"
        },
        "11311":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Some food",
                "A diaper",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Yes i do need something.\" You reply<br>\r\n<br>\r\n\"Oh? And what would that be?\" Amanda said to you<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1577854800,
            "id":2767760,
            "title":"Yes I do need something "
        },
        "11313":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "a diaper",
                "a dress"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Fine but you are going to have to wear a special outfit!\" she comes at you with</span></div></span></div>",
            "created":1503118800,
            "id":2371632,
            "title":"Can I come with?"
        },
        "113131":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Disposable",
                "Cloth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are surprised when she pulls out a large diaper in your size. What type is it?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1503118800,
            "id":2371692,
            "title":"a diaper"
        },
        "1131311":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She dresses you before leaving the house",
                "She takes you to the store in just a diaper"
            ],
            "content":"<div class=\"\"><div> <span>Before you know what is happening, Amanda strips you out of your clothes and tapes you into the thick disposable diaper. When she is done, she pats your crotch and says \"There you go, sweetie.\"<br>\r\n<br>\r\nShe then pulls you to your feet, and you gaze down at yourself. The diaper is the only thing you are wearing.<br>\r\n<br>\r\n</span></div></div>",
            "created":1503118800,
            "id":2371693,
            "title":"Disposable"
        },
        "11313112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"No need to put on anything else,\" Amanda declares cheerfully, \"It's a warm, sunny day. You'll only get hot with more clothes on!\"<br>\r\n<br>\r\nShe then takes your hand and leads you out to her car. You try to pull away, but she has a strong grip on your hand. You waddle your way to her car, and she puts you in the back seat.<br>\r\n<br>\r\nIs there a car seat?</span></div></div>",
            "created":1503118800,
            "id":2371695,
            "title":"She takes you to the store in just a diaper"
        },
        "113131121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "The grocery store",
                "The mall"
            ],
            "content":"<div class=\"\"><div> <span>You barely offer any resistance as Amanda securely buckles you into the teen-sized car seat. When you try to protest, she gets out a pacifier and sticks it in your mouth. You just suckle on it, resigned.<br>\r\n<br>\r\nAmanda climbs into the driver's seat of her car, and you set off.<br>\r\n<br>\r\nWhere are you headed?</span></div></div>",
            "created":1503118800,
            "id":2371697,
            "title":"Yes"
        },
        "1131311211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Grocery store",
                "AB supply store"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Actually, do you go to the grocery store or an adult baby supply store?</span></div></span></div>",
            "created":1503291600,
            "id":2372396,
            "title":"The grocery store"
        },
        "11313112111":{
            "choices":[
                "Makes you hold on to the cart",
                "Puts you in the shopping cart"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The store is already filled with people and cars in the parking lot. Amanda climbed out to grab a shopping cart before she'd come back and unbuckle you. She then</span></div></span></div>",
            "created":1512795600,
            "id":2425924,
            "title":"Grocery store"
        },
        "11313112112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "The store is just opening now",
                "The store is already packed"
            ],
            "content":"<div class=\"\"><div> <span>After about ten minutes of driving, you and Amanda finally arrive at your destination. You were afraid that she was taking you to the supermarket, or - worse yet - the mall.<br>\r\n<br>\r\nHowever, she instead brings you to a large building on its own block. You do not recognize it. You do not think you have ever even seen it before. Then again, you have never been in this part of town up until now.<br>\r\n<br>\r\nAs Amanda pulls into the parking lot, you get a glimpse of the sign at the top of the building. It reads \"Paradise of the Young.\" Below that, is a tagline: \"For babies of all sizes and ages.\"<br>\r\n<br>\r\nAmanda switches off the ignition and gets out of the driver's seat. She comes around to your side and opens your door. As she unstraps you from the car seat and helps you out of the vehicle, you pull out your pacifier and say \"I thought we were going to the store.\"<br>\r\n<br>\r\n\"I never said <b>which</b> store,\" she points out, smirking. That is true; she never provided that clarity. That means you would've been diapered sooner or later anyway.<br>\r\n<br>\r\n\"Now, come on,\" Amanda beckons you, taking your hand in hers again. She leads you over to the front door. You go along quietly, waddling in your bulky diapers, which are still all you are wearing.</span></div></div>",
            "created":1503291600,
            "id":2372425,
            "title":"AB supply store"
        },
        "113131121122":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Cribs",
                "Toys"
            ],
            "content":"<div class=\"\"><div> <span>Although you noticed how many other cars were parked in the lot outside the store, you were surprised to see how many people were inside Paradise of the Young.<br>\r\n<br>\r\nAmanda tells you \"Wait right here, sweetie. I'll be right back.\"<br>\r\n<br>\r\nShe then heads off to the front desk. You impatiently stay near the front entrance and wait for her to return.<br>\r\n<br>\r\nNearly all the customers were there with at least one other person. You see parents of actual babies shopping for their children, other adult baby boys with their parents or caretakers, adult baby girls with their parents or caretakers, adult baby couples shopping for themselves (and their children, in some cases), and even whole adult baby families.<br>\r\n<br>\r\nOne thing you quickly notice is that you are far from the only person in nappies. Some of the other boys wore loose shorts or pants, which made the bulk beneath obvious. Some did not wear bottoms at all, leaving their diapers fully exposed. Likewise, many of the girls were diapered, and they had to wear sweatpants or skirts. A lot of the skirts were too short to entirely conceal their diapers. Some barely covered any at all. It seemed at least three of every four people in that store were padded.<br>\r\n<br>\r\nInterestingly, you were not the only person who was clad in nothing but a diaper. A number of boys, girls, men, and woman had nothing more than that on, as well. Even stranger than that was how very few - if any - of the female patrons seemed embarrassed about going around topless.<br>\r\n<br>\r\nYou spend about five minutes observing the other customers in relative silence. After that, Amanda comes back with one of the store's employees. By her name tag, her name is Carrie. She is a little younger than Amanda; about 23. She has short black hair, a size C bust, an average-sized ass, and is around 5'7\". She is clad in a somewhat childish looking yet expertly-made dress. You assume that's the store's uniform for woman.<br>\r\n<br>\r\nYou notice a bit of a bulk beneath the skirt of Carrie's ensemble. A moment later, you spot a bit of white padding at the bottom of it. Employees are diapered, too?!<br>\r\n<br>\r\nCarrie notices you gazing at her lower body, and she smiles and asks \"Like what you see?\"<br>\r\n<br>\r\nYou quickly look up at her eyes, blush, and mutter \"Uh, I... um...\"<br>\r\n<br>\r\n\"You're right,\" Carrie tells Amanda, \"He IS a cutie.\"<br>\r\n<br>\r\n\"I know he is,\" Amanda remarks, patting your cheek and your diapered bottom at the same time.<br>\r\n<br>\r\n\"Now, let me give you the tour,\" Carrie offers.<br>\r\n<br>\r\nBefore you can reply, Amanda takes your hand in hers again, and you and she follow Carrie.<br>\r\n<br>\r\nWhich section do you visit first?</span></div></div>",
            "created":1503291600,
            "id":2372437,
            "title":"The store is already packed"
        },
        "1131311211221":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Take a nap in the crib",
                "Keep shopping with Amanda"
            ],
            "content":"<div class=\"\"><div> <span>Carrie takes you and Amanda over to the crib section. Models of all sizes are amassed there. There are plenty which are normal-sized ones, meant for regular babies. But those only constitute about a quarter of all models.<br>\r\n<br>\r\nMost of the cribs are clearly meant for someone larger, around your height. Some of them also come with a number of strange features, such as restraints, and locking tops. There are some that are even big enough to accommodate two grown people.<br>\r\n<br>\r\nAfter browsing through the crib section for about fifteen minutes, Amanda selects out one particular crib. This one has optional restraints, it is portable and movable, and it can be locked securely from both the outside and the inside. You also notice how large it is. It could fit two of you. Or you and another person...<br>\r\n<br>\r\nYou turn to Amanda and ask her \"Why are we getting one so big?\"<br>\r\n<br>\r\nShe smiles at you, pats your padded bottom, and says \"Because Baby might want me to sleep with him a couple nights, and he'd be safer in the crib than in my bed.\"<br>\r\n<br>\r\nYou feel a slight twitch in the front of your diapers. But it is only momentary.<br>\r\n<br>\r\nIn any case, Carrie remarks \"You'll both enjoy this crib, I promise you.\"<br>\r\n<br>\r\nYou wonder HOW you'll enjoy it. That, of course, would depend on Amanda's true eventual intentions.<br>\r\n<br>\r\n\"Would you like to test it out while I shop, sweetie?\" Amanda proposes \"Or do you want to keep shopping with me?\"</span></div></div>",
            "created":1503723600,
            "id":2375175,
            "title":"Cribs"
        },
        "11313112112212":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Try to get Amanda in diapers, too",
                "Say nothing (yet)"
            ],
            "content":"<div class=\"\"><div> <span>You just woke up about an hour ago. In fact, you were hardly out of bed when Amanda grabbed you, diapered you, and forced you out to her car. So you are wide awake at present.<br>\r\n<br>\r\n\"I'll stay with you,\" you decide.<br>\r\n<br>\r\nShe seems pleased. \"Alright, we can wait until later to have a nap. Let's get moving!\"<br>\r\n<br>\r\nCarrie next takes you to the section with the changing tables. After browsing for a while, Amanda selects a large one with a padded surface, a huge storage capacity, and - again - optional restraints. You start to wonder if Amanda has some type of fascination in bondage.<br>\r\n<br>\r\nYou next get a bunch of other baby paraphernalia. This includes, but is not limited to, pacifiers, bottles, changing supplies, diaper bags, diaper genies, and more.<br>\r\n<br>\r\nFinally, you get to the section with the diapers. This is by far the largest part of the store. There are at least three full aisles devoted exclusively to nappies. Every brand in every size imaginable is here. There are baby diapers, big kid diapers, teen diapers, adult diapers, adult-sized baby diapers, pull-ups, cloth diapers, disposable diapers, plastic pants, rubber pants... it is actually somewhat extraordinary.<br>\r\n<br>\r\nAs you browse, you are constantly reminded of the padding that is already between your legs. The crinkling is loud and noticeable. So is the diaper Carrie is wearing under her skirt.<br>\r\n<br>\r\nAmanda is the only one of the three who is not padded. But you begin to wonder... with all these options available, perhaps that should change...<br>\r\n</span></div></div>",
            "created":1503723600,
            "id":2375180,
            "title":"Keep shopping with Amanda"
        },
        "113131121122121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Amanda agrees to try diapers",
                "Amanda resists the idea"
            ],
            "content":"<div class=\"\"><div> <span>While you and your caretaker follow Carrie down one of the diaper aisles, you casually remark \"Amanda... have I ever told you that you have such a lovely ass?\"<br>\r\n<br>\r\nFor the first time that day, it is SHE who is blushing instead of you. You chuckle at her reaction, and Carrie joins in.<br>\r\n<br>\r\n\"You might have mentioned it,\" Amanda replies, trying to remain composed.<br>\r\n<br>\r\nYou smirk and state \"Well, I was thinking... that beautiful ass might look even better if it was wrapped up in something soft and bulky. You know, something like...\"<br>\r\n<br>\r\nYou nonchalantly brush your hand against the front of your own diaper. If Amanda had not already caught on to what you were implying, she certainly has now.<br>\r\n<br>\r\n\"Well, uh...\" she stutters anxiously<br>\r\n<br>\r\n\"What do you think, Carrie?\" you ask the Paradise of the Young employee<br>\r\n<br>\r\nCarrie shrugs and says \"I think he's right, Amanda. After all, diapers are comfortable, convenient, and a lot of fun. Take it from me; I've been wearing them since before I started working here. Perhaps you SHOULD give them a try?\"<br>\r\n<br>\r\nDoes Amanda give in?</span></div></div>",
            "created":1503723600,
            "id":2375184,
            "title":"Try to get Amanda in diapers, too"
        },
        "1131311211221211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Disposable",
                "Cloth"
            ],
            "content":"<div class=\"\"><div> <span>Amanda looks very hesitant about the idea. But ultimately she sighs and reluctantly says \"Very well. If you really think I should.\"<br>\r\n<br>\r\n\"You should,\" you tell her, smirking. This is quite a triumph for you.<br>\r\n<br>\r\n\"Which would you like to try first?\" Carrie inquires \"Cloth or disposable?\"<br>\r\n<br>\r\nAmanda picks...</span></div></div>",
            "created":1503723600,
            "id":2375186,
            "title":"Amanda agrees to try diapers"
        },
        "11313112112212112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Let Carrie diaper Amanda",
                "You diaper Amanda"
            ],
            "content":"<div class=\"\"><div> <span>\"Cloth, I guess,\" Amanda replies, \"Maybe I'll give disposables a try later on.\"<br>\r\n<br>\r\nCarrie nods her head. She helps Amanda browse through part of an aisle that is packed with all types of cloth diapers. You go with them, eagerly awaiting your maid's decision.<br>\r\n<br>\r\nIn the end, Amanda picks a package of hot pink cloth diapers. You think she would look cute in pink, so you are delighted by her choice.<br>\r\n<br>\r\nAfter paying for them, Carrie leads you and Amanda over to a changing room. You just then realized that there are no bathrooms in this place; only changing rooms. Each one with a changing table, naturally.<br>\r\n<br>\r\n\"Alright, so would you like me to do it?\" Carrie offers. She then turns to you and comments \"Maybe YOU could do it, dear.\"</span></div></div>",
            "created":1503723600,
            "id":2375190,
            "title":"Cloth"
        },
        "113131121122121122":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Force her to wet her diapers",
                "Make her wear only her diapers"
            ],
            "content":"<div class=\"\"><div> <span>\"I'd be happy to,\" you declare, smiling.<br>\r\n<br>\r\nYou have Amanda lie down in front of her. Carrie supplies you with the package of diapers, and you get the changing supplies from Amanda's purse.<br>\r\n<br>\r\nYou flip up your maid's skirt, revealing her fine satin panties. You pull those down, revealing her shaven pubic region.<br>\r\n<br>\r\nYou savor the moment as you apply baby oil and baby powder to Amanda's lower regions. After that, you tear open the package, remove a thick, fluffy pink cloth diaper, and slide it under Amanda's bottom. You pull the front of the padding up between her lovely legs, and you pin it shut with some safety pins which Carrie supplied you.<br>\r\n<br>\r\nWhen you are finished, you pat Amanda's diapered crotch and help her to her feet. She is blushing furiously by this point. Her diaper is more than partly visible under her skirt. She looks adorable in them.<br>\r\n<br>\r\n\"How do they feel?\" you ask.<br>\r\n<br>\r\n\"Not bad,\" she admits, still somewhat embarrassed.<br>\r\n<br>\r\nYou get a wicked idea</span></div></div>",
            "created":1503723600,
            "id":2375194,
            "title":"You diaper Amanda"
        },
        "1131311211221211222":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Go back out to the store and continue shopping",
                "Spend some time \"alone\" with Amanda in the changing room"
            ],
            "content":"<div class=\"\"><div> <span>\"Turn around,\" you instruct Amanda.<br>\r\n<br>\r\nShe does so, and you spot the zipper to her uniform. You approach her and begin to pull her zipper down. When it is halfway down, she mutters nervously \"What are you doing?\"<br>\r\n<br>\r\n\"Like you said before, it's a hot day,\" you wittily respond, \"So let me help you cool down.\"<br>\r\n<br>\r\nAmanda starts to fidget, but Carrie seems to be on your side, as she holds onto Amanda's sides and calms her.<br>\r\n<br>\r\nWhen the zipper is all the way undone, you allow it to slide off Amanda's arms and drop to the ground. To your delight, Amanda is not wearing a bra beneath her uniform. In other words, all she is wearing nothing but her shoes, socks, and the pretty pink cloth diapers you just put her in.<br>\r\n<br>\r\nInstinctively, Amanda attempts to cover her breasts with her arms, but you stop her and say in a soothing voice \"No, no, don't do that. It's okay, Amanda. Just try me.\"<br>\r\n<br>\r\nYou then lean forward and kiss her gently on the lips. While she is surprised at first, she leans into the kiss and returns it.<br>\r\n<br>\r\nYou really feel good now. Although you too are wearing nothing but a thick layer of padding around your waist, at least you have successfully reasserted your position as the master of the house.</span></div></div>",
            "created":1503723600,
            "id":2375196,
            "title":"Make her wear only her diapers"
        },
        "11313112112212112221":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Toy section",
                "Clothing section"
            ],
            "content":"<div class=\"\"><div> <span>As much as you would like to have your way with Amanda at this time, you realize this may not be the best time or place. Besides, you will have to her all to yourself for the next three months. You can afford to wait for another hour or two.<br>\r\n<br>\r\nAfter pulling your lips away from hers, you smile at her and propose \"Shall we continue shopping?\"<br>\r\n<br>\r\nShe just smiles back and nods, saying \"Definitely. There's lots more we've yet to see.\"<br>\r\n<br>\r\nHer maid uniform is still on the ground. She leans down to pick it up, letting her breasts dangle and giving you a nice look at her huge, padded ass. You smirk and pat her bottom a few times. She giggles at that.<br>\r\n<br>\r\nAfter picking up her uniform, Amanda slips out of her shoes and socks. She stuffs all her clothes and the rest of her new pink cloth diapers into her (rather large) purse, she turns to Carrie and tells her \"We're ready to go back out whenever you are.\"<br>\r\n<br>\r\nCarrie nods and says \"You got it.\"<br>\r\n<br>\r\nShe opens the door to the changing room and waddles out into the hallway. Amanda takes your hand in hers and the two of you waddle after her.<br>\r\n<br>\r\nYou feel a bit of a rush; wearing just diapers with your cute, beautiful, busty maid. Amanda is a little self-conscious about having her breasts on display, but you keep hold her hand to reassure her.<br>\r\n<br>\r\nWhere next?</span></div></div>",
            "created":1503982800,
            "id":2376859,
            "title":"Go back out to the store and continue shopping"
        },
        "113131121122121122212":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Take a break and have breakfast",
                "Decide to wait on breakfast"
            ],
            "content":"<div class=\"\"><div> <span>After selecting plenty of diapers (cloth and disposable alike) for both you and Amanda, Carrie leads you and her over to the part of the store that focuses on all other infantile apparel.<br>\r\n<br>\r\n\"We won't spend too much time here,\" Amanda tells you and Carrie, but more to you, \"Like I said before, it's summer, and I don't expect we'll be needing that many clothes, as most of these are thick and full-body.\"<br>\r\n<br>\r\n\"True,\" you remark. You then smirk and mutter deviously \"Besides, why would we want too much on? Bodies like ours shouldn't be hidden away. At least from each other.\"<br>\r\n<br>\r\nAmanda blushes, but then she scoffs and says \"You have a point there. As long as it's just you and I, I am totally alright with wearing just diapers around the house.\"<br>\r\n<br>\r\n\"Actually, so am I,\" you admit. And to think that a few hours ago, you were opposed to being padded in general.<br>\r\n<br>\r\nAlthough you and Amanda have more or less agreed to be mostly naked for much of the summer, you stock up on attire nonetheless. You get some onesies, some rompers, some nighties, some frilly dresses, some coveralls, and some very babyish shirts. You also get plenty of bibs, bonnets, mittens, and booties. Even when clad in just those items and a diaper, you would still be mostly naked.<br>\r\n<br>\r\nWhen you leave the clothing section, your stomach rumbles. You do not have to use your diaper or anything. Instead, you feel hungry.<br>\r\n<br>\r\nThat is when you remember that you skipped breakfast. After all, mere minutes after you woke up, Amanda pulled you right out of bed, diapered you, and brought you straight to the store. That was when? Seven o'clock this morning?<br>\r\n<br>\r\nYou look at a clock and notice it is about a quarter past nine. Still not too late for breakfast.<br>\r\n<br>\r\nAmanda must have heard your stomach. She offers \"You want to have something to eat before we go on?\"<br>\r\n<br>\r\n\"There is a cafe near the front of the store,\" Carrie reveals, \"They serve breakfast, lunch, and dinner. And all manner of snacks throughout the day.\"<br>\r\n<br>\r\nYou think about that.</span></div></div>",
            "created":1503982800,
            "id":2376866,
            "title":"Clothing section"
        },
        "1131311211221211222121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Breakfast for babies (not necessarily baby food)",
                "Regular adult breakfast"
            ],
            "content":"<div class=\"\"><div> <span>\"How about we eat?\" you suggest<br>\r\n<br>\r\n\"Of course, honey,\" Amanda agrees, smiling softly, \"Wouldn't want you to get hungry.\"<br>\r\n<br>\r\nCarrie then shows you two where the cafe is. There are several people there. Most of them are in pairs or larger groups, but there are a few individuals who are there on their own.<br>\r\n<br>\r\nYou notice a family of five seated at one table. The children are a boy of ten or nine years and twin seven year-old girls. The mother and father look to be in their early thirties, if not younger. The boy is in his father's lap and being bottlefed by him. The girls are being simultaneously breastfed by their mother. Most interesting of all... all five of them are diapered. Just like you and your sexy maid, they are wearing diapers only.<br>\r\n<br>\r\nA whole family in nappies... this Paradise of the Young shop is full of surprises.<br>\r\n<br>\r\nYou and Amanda spot a vacant table near the diapered family of five. There you sit. Carrie sits with you. She tells you \"I haven't had breakfast yet, either, and it's about time for my first break, anyway. Mind if I join you?\"<br>\r\n<br>\r\n\"Not at all,\" Amanda answers. You just nod.<br>\r\n<br>\r\nYou look over the cafe's menu, and they have dishes prepared for the whole baby, including actual babies.<br>\r\n<br>\r\nWhat type of meal do you get?</span></div></div>",
            "created":1503982800,
            "id":2376871,
            "title":"Take a break and have breakfast"
        },
        "11313112112212112221211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Ask to feed each other",
                "Just eat regularly"
            ],
            "content":"<div class=\"\"><div> <span>All three of you order a typical breakfast meant for adults. That comes with everything: eggs, bacon, sausage, hash browns, and either French toast or pancakes.<br>\r\n<br>\r\nThe waitress - who is on roller skates and clearly diapered beneath her own uniform - takes your orders and promises to be back with them soon.<br>\r\n<br>\r\nSure enough, not ten minutes later, she returns with three hot plates, which she sets before you and bids you to enjoy.<br>\r\n<br>\r\nBefore you start to eat, you wonder... perhaps you could ask Amanda to feed you, and you could feed her in return?</span></div></div>",
            "created":1507179600,
            "id":2396931,
            "title":"Breakfast for babies (not necessarily baby food)"
        },
        "113131121122121122212112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Keep shopping",
                "Skip to when you go home"
            ],
            "content":"<div class=\"\"><div> <span>Since you are pretty hungry and you figure it would take too long to be fed by another person, you decided just to feed yourself.<br>\r\n<br>\r\nYou, Amanda, and Carrie spend the next twenty or so minutes having the first and most important meal of the day.<br>\r\n<br>\r\nAs you eat, you think about what else you're going to encounter at the store. You also find yourself wondering what will happen once you return home.<br>\r\n<br>\r\nSoon enough, your plates are cleaned, and you are ready to continue shopping</span></div></div>",
            "created":1507179600,
            "id":2396933,
            "title":"Just eat regularly"
        },
        "1131311211221211222121122":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Make one more stop",
                "Go straight home."
            ],
            "content":"<div class=\"\"><div> <span>A couple hours later, shortly before noon, in fact, Carrie has shown you and Amanda the whole of the store, and you have already bought everything you are likely to want or need to indulge in this adult baby fantasy over the summer.<br>\r\n<br>\r\nOf course, some of the stuff is too large to fit in Amanda's car, such as the changing table and the crib. Fortunately, Paradise of the Young has a delivery service. They can have all the huge paraphernalia brought to your house by the end of the day.<br>\r\n<br>\r\nJust before you and Amanda leave, Carrie gives you both her contact information. One may think that is just a formality in case a customer of Paradise of the Young needs someone to refer to or something of the sort. While that is partly the case, Carrie has a bigger, more personal reason, for providing this information. She tells you and Amanda that if you two are feeling lonely over the summer, she would be happy to swing by and provide some company outside of her work hours. You and your sexy maid graciously accept the offer.<br>\r\n<br>\r\nFinally, you and Amanda leave the story with most of your ABDL merchandise. She is still wearing only her cloth diapers, just as you are wearing only your disposable diapers. She does not seem as bothered as she would have been earlier. Interestingly, you are not so worried about being seen like this, either.<br>\r\n<br>\r\nAfter loading up the car, you both get into the car. Amanda fastens you into the car seat once more, and then she gets into the driver's seat, starts the ignition, and drives away.</span></div></div>",
            "created":1507179600,
            "id":2396936,
            "title":"Skip to when you go home"
        },
        "1133":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "normal food",
                "baby food and a highchair",
                "Amanda with her bra and top off you also notice a tiny drop of milk"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>alright, when you get downstairs still naked you find</span></div></span></div>",
            "created":1503118800,
            "id":2371635,
            "title":"Just letting you know breakfast is ready"
        },
        "11332":{
            "choices":[
                "She forces you to eat the baby food",
                "She puts a diaper on you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She forces you into a pink high chair and straps your arms down and takes a picture of you and says “ if you follow my rules I won’t post this online”</span></div></span></div>",
            "created":1586365320,
            "id":2815502,
            "title":"baby food and a highchair"
        },
        "11333":{
            "choices":[
                "Do as you normally do and com3 closer to nurse",
                "Freak out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Upon seeing this sight you</span></div></span></div>",
            "created":1511067600,
            "id":2417194,
            "title":"Amanda with her bra and top off you also notice..."
        },
        "114":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Amanda finishes cleaning and leves.",
                "Amanda knocks on your bathroom door.",
                "Amanda comes in without knocking."
            ],
            "content":"<div class=\"\"><div> <span>You decide it's best to start the day out fresh, so you<br>\r\nHead for the bathroom and walk over to the sink.<br>\r\nYou then grab your toothbrush and brush your teeth.<br>\r\nAfter you finish, you turn on the water and step in the <br>\r\nShower, and you just let the warm water wake you up<br>\r\nA little bit. You then hear Amanda come into your <br>\r\nBedroom and start cleaning. You just ignore this and<br>\r\nContinue showering for a bit until...</span></div></div>",
            "created":1478322000,
            "id":2233118,
            "title":"Take a shower"
        },
        "1143":{
            "choices":[
                "Attempt to cover youraelf what is she doing ",
                "Nothing unusual "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your in the shower and amanda opens the door walks in. <br>\r\nGood morning she says. She grabs all the dirty clothes and sees that the curtain wasnt closed. She sees a bra in the shower so she opens it and grabs it quick. </span></div></span></div>",
            "created":1515992400,
            "id":2441350,
            "title":"Amanda comes in without knocking."
        },
        "115":{
            "choices":[
                "going to the mall",
                "hanging out by the pool, naked",
                "a more adult exercise, but where?",
                "A hike in the woods",
                "Free chapter"
            ],
            "content":"<div class=\"\"><div> <span>There was one problem, Amanda was the trouble your mom worried about. Being the same age the two of you grew close now that your alone you both finally get a three month binge of uninhibited sex, partying and other debauchery. What was great was you told this to your mom and she realized she fucked up, \"Damn it I should have sprung for an older maid.\" You said, \"Well since your day-to-day is tightly planned there's no chance of coming back without wasting thousands of dollars, and I know have frugal you are. See you in a few months.\" By this time Mandi was at your door, you invited her to the bed and took the next two hours snuggling, chatting, and generally just being romantic.<br>\r\n<br>\r\nThen, at noon, you both got up out of bed. You suggested you both sleep in the guest suite with the king bed and she agreed, your full size wasn't enough room for two people laying close, it would have been nearly impossible when doing more active pursuits on it. You both ate lunch, at which you said, \"You'd make a good housewife one day.\" At which she responded, \"With your money neither of us would have to work.\" After lunch you both decided on-</span></div></div>",
            "created":1501563600,
            "id":2362851,
            "title":"Call Amanda to your room"
        },
        "12":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "\"I'm just cleaning. You can go back to sleep\"",
                "\"You're gong to sleep the whole day if you don't get up\"",
                "\"Looks like I've got you all to my self this summer\"",
                "\"I'm going out to the store. Do you need anything\"",
                "\"I need some help with something\""
            ],
            "content":"<div class=\"\"><div> <span>Your mom and Sister have left on their mother daughter<br>\r\nBonding trip last night. Your mother decided to pay Jessica<br>\r\nA little extra to live at your house over the summer. Her job <br>\r\nWas to help take care of you by cooking ,cleaning and<br>\r\nKeeping you out of trouble, not that you ever got into any, <br>\r\nBut your mom was kinda concerned about you throwing<br>\r\nA party and messing up the place.<br>\r\n<br>\r\nYou wake up on Saturday at 9:00am. As Jessica comes<br>\r\nInto your room and says.</span></div></div>",
            "created":1478322000,
            "id":2233136,
            "title":"Jessica"
        },
        "122":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "your normal clothes",
                "baby clothes",
                "A condom",
                "A used diaper",
                "A girls dress"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ugg.. you groan as you get up \"I've layed out a change of clothes for you just go to your moms bathroom\" inside you find</span></div></span></div>",
            "created":1503118800,
            "id":2371647,
            "title":"\"You're gong to sleep the whole day if ..."
        },
        "123":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "you two take it to the bed",
                "she shoves off from you calling you a pervert",
                "she punishes you for your actions",
                "You punish her",
                "You submit to her needs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"And I also got you to myself \" you whisper in her ear kissing and goosing her.</span></div></span></div>",
            "created":1503118800,
            "id":2371650,
            "title":"\"Looks like I've got you all to my self..."
        },
        "1233":{
            "choices":[
                "You wake up on your own",
                "Jessica wakes you up",
                "Jessica calls a friend over",
                "Free chapter",
                "Free chapter"
            ],
            "content":"<div class=\"\"><div> <span>“Lay down on the bed.\" <br>\r\n<br>\r\nYou do as your told.<br>\r\n<br>\r\nJessica walks over to the bed.<br>\r\n<br>\r\nShe stands in front of the bed. <br>\r\n<br>\r\nShe starts to slide down her shorts.<br>\r\n<br>\r\n Revealing her lacy panties, not giving her much coverage as they are completely see through.<br>\r\n<br>\r\n“What are you doing Jess?\"<br>\r\n<br>\r\n \"Honey, do you remember the potato salad and tacos we had for lunch?\" She asks you. <br>\r\n<br>\r\n\"Yes you ate a lot. Even though it always makes you very gassy.\" You answer. <br>\r\n<br>\r\nShe walks over to the side of the bed, and climbs on top. <br>\r\n<br>\r\nCrawling over to you, she faces her butt toward you. \"I don’t to embarrass anyone later. So you Im going to empty out before hand.\"<br>\r\n<br>\r\n \"What do you mean Jess?\"<br>\r\n<br>\r\n You are still utterly confused. <br>\r\n<br>\r\nShe grabs the back of your head with her hand, and slowly lowers her ass on to your face. <br>\r\n<br>\r\nOnce sitting on your face she squirms around a little bit, pushing you deeper into her crack until you feel her hole touch your nose.<br>\r\n<br>\r\n \"Jessica, what if you have to fart? It stinks down here already!\" You say. <br>\r\n<br>\r\n\"Sorry little boy”, I haven't been washing down there, as for your question if I have to fart, you are going to smell it, very deeply.<br>\r\n<br>\r\n “I should hear you sniffing! Next time don’t be such a dirty pervert!” She explains. <br>\r\n<br>\r\nPPPPBBBLLLTTT<br>\r\n<br>\r\nJessica’s face is pure euphoria. <br>\r\n<br>\r\nThe smell of her fart forces is way down your nose. It smells of rotten meat, eggs, and vegetables.<br>\r\n<br>\r\n \"I don't hear you sniffing!\" As she says this, you are forced to take a deep breath or you will suffocate. <br>\r\n<br>\r\nYour eyes start to water and you cough violently. \"That one was hot coming out so it must smell. I have to take a dump soon, it always makes my farts smell extra bad. That was a small one too.\" She says obviously taking pleasure in your suffering. <br>\r\n<br>\r\n\"Jessica why are you doing this!? It stinks! Please let me go!\" You beg. \"Your not going anywhere!\" She yells at you. <br>\r\n<br>\r\nBBBBBBBBBBBLLLLLLLLLLLTTTTTTTTFFFFFFFSSSSSHHHHHHPPPPPPFFFFFFFTTTTT<br>\r\n<br>\r\n\"O MY GOD! Fuck, that feels good. Probably doesn't feel good for you though.\" You are in pain. You are also starting to go unconscious. She feels your struggling weaken. She does one last fart to finish you off, for now. She had more plans of pleasure for herself, but she decided to do them later. <br>\r\n<br>\r\nPPFFFFFFFFFFFTTTTTTTBBBBBLLLLTTTSSHH<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1562562000,
            "id":2684023,
            "title":"she punishes you for your actions"
        },
        "124":{
            "author_id":"dragon15",
            "author_name":"Dragon",
            "choices":[
                "Yes, in fact I do need somethings.",
                "No, I'm good.",
                "Can I come with?",
                "Can you please stay home with me?",
                "Free chapter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now what will you say.</span></div></span></div>",
            "created":1479013200,
            "id":2236352,
            "title":"\"I'm going out to the store. Do you nee..."
        },
        "1241":{
            "author_id":"dragon15",
            "author_name":"Dragon",
            "choices":[
                "I need some more diapers.",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now what is it that you need from the store.</span></div></span></div>",
            "created":1479013200,
            "id":2236353,
            "title":"Yes, in fact I do need somethings."
        },
        "12411":{
            "author_id":"dragon15",
            "author_name":"Dragon",
            "choices":[
                "You just like to use diapers.",
                "Some other reason."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now why exactly do you need diapers.</span></div></span></div>",
            "created":1479013200,
            "id":2236355,
            "title":"I need some more diapers."
        },
        "124111":{
            "author_id":"dragon15",
            "author_name":"Dragon",
            "choices":[
                "No reaction at all.",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Jessica react to your item request.</span></div></span></div>",
            "created":1479013200,
            "id":2236356,
            "title":"You just like to use diapers."
        },
        "1241111":{
            "author_id":"diaperss",
            "author_name":"diaperss",
            "choices":[
                "Baby diapers",
                "Adult diapers",
                "Some in your size"
            ],
            "content":"<div class=\"\"><div> <span>She was a bit surprised about your request but didn't comment about it and headed off to buy them. Soon you got a message from Jessica: ''I'm here at the store now, I forgot to ask what kind of diapers do you want me to get?'' You reply to her...</span></div></div>",
            "created":1489467600,
            "id":2289857,
            "title":"No reaction at all."
        },
        "12411111":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "put on the baby clothes but don't eat the laxatives",
                "put on the baby clothes and eat the laxatives",
                "Sneak a laxative in her food"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"all right\" when she comes home not only does she have baby diapers but also a whole set of baby clothes and some laxatives, you</span></div></span></div>",
            "created":1503118800,
            "id":2371652,
            "title":"Baby diapers"
        },
        "12411112":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "yes but no breast feeding",
                "yes and I'll even breast feed you since I'm lactating. ",
                "No. I think you need a punishment"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"all right\" when she comes home you put on the adult diapers \"Jessica could you baby me?\" you ask her.</span></div></span></div>",
            "created":1503118800,
            "id":2371653,
            "title":"Adult diapers"
        },
        "1241112":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "she seems happy you asked for them",
                "she says she will also pick you up some other things"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She smiles</span></div></span></div>",
            "created":1503118800,
            "id":2371654,
            "title":"Other."
        },
        "12411121":{
            "author_id":"butt311",
            "author_name":"john doe",
            "choices":[
                "because I like adult baby",
                "because I haven't seen a boy in diapers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she has a smile on her face you ask why she is smiling she says</span></div></span></div>",
            "created":1528434000,
            "id":2504484,
            "title":"she seems happy you asked for them"
        },
        "124112":{
            "author_id":"jonikari",
            "author_name":"jonikari",
            "choices":[
                "Of course! She is working for you, after all.",
                "Of course not! This is a free country!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I want diapers so that YOU could wear them and use them for as long as you're in my house instead of using our toilets.\" you say.<br>\r\n<br>\r\nIs Jessica obliged to abide by your request?</span></div></span></div>",
            "created":1482382800,
            "id":2253238,
            "title":"Some other reason."
        },
        "1241121":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Skip to when she gets home",
                "Text her to get some more things",
                "Do something else"
            ],
            "content":"<div class=\"\"><div> <span>Jessica looks at you and blushes a little. \" do I <br>\r\n Have to wear the diapers.\" You look at her and<br>\r\nSay. \"Of course you don't, but I think it will make <br>\r\nThis summer a lot funner if you did.\"  You could <br>\r\nSee her face blush even more. You could tell that<br>\r\nShe was turned on by the thought of being <br>\r\nDiapered. She then says to you. \"Will I have to<br>\r\nUse my diaper.\" You smile and say to her.  \"Yes.<br>\r\nThat is one part of wearing a diaper.  Also if <br>\r\nYou're going to be using your diaper, I'd prefer it <br>\r\nIf I changed you.\" You could see Jessica breathing <br>\r\nHeaver now, and she says to you. \"Ok I'm going of <br>\r\nTo the store now. If there's anything else please text <br>\r\nMe.\" You see Jessica walk out of your room, and <br>\r\nYou look out your window and see Jessica getting <br>\r\nIn her car, then she heads off.<br>\r\n<br>\r\nYou then lay back Down on your bed exited about<br>\r\nWhat's going to happen when she gets back. What <br>\r\nAre you going to do while she's at the store?</span></div></div>",
            "created":1486702800,
            "id":2275904,
            "title":"Of course! She is working for you, after all."
        },
        "12411212":{
            "author_id":"diaperss",
            "author_name":"diaperss",
            "choices":[
                "Baby diapers",
                "Adult diapers with babyish prints"
            ],
            "content":"<div class=\"\"><div> <span>You send her a text saying ''I forgot to tell you, while you're there grab more baby wipes, powder, a few bottles, pacifiers and some baby food'' Soon she texts back ''I got everything now except the diapers, which ones should I buy?'' and sends you a picture of the diaper aisle she's in. It's full of different packages, different brands of actual baby diapers and also adult-sized ones but with babyish prints. You reply and tell her to buy the...</span></div></div>",
            "created":1489467600,
            "id":2289862,
            "title":"Text her to get some more things"
        },
        "124112122":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Put Jessica into a diaper now",
                "Have some fun with Jessica ",
                "Another idea"
            ],
            "content":"<div class=\"\"><div> <span>You text Jessica back. \"Get the adult ones with the babyish<br>\r\nPrints. The baby ones might not fit. Also pick up a pack<br>\r\nIn my size, because I might get curious.\" You smile<br>\r\nAnd you know that this will be a fun summer. Jessica then<br>\r\nTexts back. \"I got the stuff, and will be home in 15 minutes.\"<br>\r\n<br>\r\n<br>\r\nAround 15 minute later Jessica comes back home, and<br>\r\nYou hear a knocking on your bedroom door.<br>\r\n<br>\r\n\"Nick I got the stuff you wanted.\"<br>\r\n\"Come in Jess and let's see what you got\"<br>\r\nShe came in and placed all the bags beside you bed. <br>\r\n\"Ok I got the wipes, baby powder, some pacifiers, a few <br>\r\nBottles, some baby food and a jug of milk, and most <br>\r\nImportantly. The diapers.\"<br>\r\n\"Great job on getting all the stuff Jess\"<br>\r\n\"Thank you. Now what should we do?\"<br>\r\n<br>\r\nThat was a good question. What should you do?</span></div></div>",
            "created":1496379600,
            "id":2329578,
            "title":"Adult diapers with babyish prints"
        },
        "1241121221":{
            "choices":[
                "Messes her diaper",
                "Wets her diaper"
            ],
            "content":"<div class=\"\"><div> <span>\" I'm going to diaper you now\" you say, and you also see her blush nervously as she walks closer to you. \"Now lay down on the bed\" you instruct her you then begin to remove her pants and panties and diaper her she then looks at herself in a mirror and blushes but then she turns and looks at you as she</span></div></div>",
            "created":1500699600,
            "id":2357564,
            "title":"Put Jessica into a diaper now"
        },
        "12411212212":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Strip her down to her diaper",
                "Ask her to diaper you."
            ],
            "content":"<div class=\"\"><div> <span>You hear a slight hissing sound coming from Jessica's diaper. You watch as the front of her padding turns a little yellow and starts to sag a bit. She seems embarrassed.<br>\r\n<br>\r\nYou just smile, pat her diapered bottom, and remark gently \"That's a good girl.\"<br>\r\n<br>\r\nShe blushes again, but she seems a little reassured by how you are not disgusted.<br>\r\n<br>\r\n\"Would you like me to change you?\" you offer.<br>\r\n<br>\r\nShe shakes her head and murmurs \"Since you just diapered me, I can wait a bit.\"<br>\r\n<br>\r\n\"Okay,\" you remark, hugging her.<br>\r\n<br>\r\nYou take a moment to look Jessica over. She looks sexy and cute in equal amounts. She is already plenty beautiful and adorable; the nappies only make her look more appealing. Furthermore, those diapers look pretty comfortable. You wonder...</span></div></div>",
            "created":1500958800,
            "id":2359348,
            "title":"Wets her diaper"
        },
        "124112122121":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Have sex",
                "Just cuddle",
                "Make her mess her diaper"
            ],
            "content":"<div class=\"\"><div> <span>You decide that you wanted to see Jessica in only<br>\r\nA diaper.<br>\r\n<br>\r\n\"Take off your shirt and bra\" you command her,  and <br>\r\nShe takes off her shirt like you told her to. She then <br>\r\nTurns to you and says. \"Can you help me with my<br>\r\nBra?\" You didn't need to be asked twice. You <br>\r\nUnhooked her bra and it feel to the floor. Jessica then<br>\r\nTurns around and you got a good full view of her boobs.<br>\r\n<br>\r\nJessica is blushing a lot. \"Do you like what you see?\"<br>\r\nAnd all you could say was. \"God yes. Just look at how <br>\r\nHard you made me.\" You said pointing at your dick<br>\r\n<br>\r\nJessica blushes and says. \"I'm glad you like it. Now <br>\r\nWhat do you want to do?\"</span></div></div>",
            "created":1501218000,
            "id":2360671,
            "title":"Strip her down to her diaper"
        },
        "1241121221211":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "no",
                "yes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"okay do I take off my diaper?\"</span></div></span></div>",
            "created":1503118800,
            "id":2371665,
            "title":"Have sex"
        },
        "12411212212111":{
            "author_id":"zecatty",
            "author_name":"Zecatty",
            "choices":[
                "Put your diaper over her already wet&creamy diaper",
                "Change her into your diaper."
            ],
            "content":"<div class=\"\"><div> <span>\"Of course not sweetie, diapers are for absorbing liquids which means even your squirties!\"<br>\r\nYou stick your tongue out and squish her diaper.<br>\r\nHer face is beet-red and she lets out a mewl.<br>\r\n\"First I'll share your embarrassment so  you feel better.\"<br>\r\nYou say, grabbing a diaper and fitting yourself into it.<br>\r\n\"Now, is baby-Jessie ready for her creamy diaper?\"<br>\r\nShe nods.<br>\r\nYou thrust her squishing her diaper and making her moan.<br>\r\nWith one of her hands on your butt and the other rubbing her breasts you ride.<br>\r\nAfter only a few seconds she squirts which leads to your teasing.<br>\r\n\"Uh-oh! Baby made a spit-up. You sure loved it to orgasm that fast.\"<br>\r\nYou keep thrusting until you are near orgasm, pull your cock out and stroke until cum all over her breasts.<br>\r\n\"As punishment for finishing first you will wear my diaper.\"<br>\r\nJess smiles as your diaper is bone dry.<br>\r\nThe smile fades as you dismount, bend over and fill your diaper.<br>\r\n\"I've been saving that for two days now!\"<br>\r\nJess tries to look dis-interested, but you can tell she is into this.<br>\r\n<br>\r\nDo you :<br>\r\n</span></div></div>",
            "created":1505624400,
            "id":2387354,
            "title":"no"
        },
        "124112122122":{
            "choices":[
                "She diapers you",
                "She doesnt diaper you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"OK i want to try i want you to diaper me\" she looks at you witch a shocked expression and...</span></div></span></div>",
            "created":1501045200,
            "id":2359501,
            "title":"Ask her to diaper you."
        },
        "1241121221221":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Wet and/or mess your self",
                "Keep your diaper clean for now"
            ],
            "content":"<div class=\"\"><div> <span>Jessica grabs a diaper for you. \"Ok nick. <br>\r\nTake off your cloths for me, please.\" You<br>\r\nTake off all your cloths, and stand naked <br>\r\nIn front of Jessica, with your huge boner.<br>\r\n<br>\r\nJessica then says to you. \"Can you please<br>\r\nLay down on your bed for me, so I can put<br>\r\nThis diaper on you.\" She said holding your<br>\r\nDiaper for you. <br>\r\n<br>\r\nYou then lay down on the bed for her. <br>\r\nJessica then slides your diaper under your<br>\r\nBut, and tapes it up doing a pretty good job<br>\r\n<br>\r\nYou stand up feel your newly diapered self.<br>\r\nJess then asks you. \"How do you like it?\"<br>\r\nYou grab your diapered bottom and say to <br>\r\nJessica. \"I love it! I've watched a lot of diaper<br>\r\nPorn, and I can see why a lot of people have<br>\r\nA diaper fetish. Plus Jessica, you look so hot<br>\r\nIn a wet diaper.\" Jessica's face tuns almost<br>\r\nTomato red as you say that.<br>\r\n<br>\r\nYou then turn your mind back to your own <br>\r\nDiaper, and you decide to...</span></div></div>",
            "created":1502168400,
            "id":2366521,
            "title":"She diapers you"
        },
        "12411212212211":{
            "choices":[
                "Wetting your diaper",
                "Messing your diaper "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You then decide to join Jessica in a used diaper by...</span></div></span></div>",
            "created":1502514000,
            "id":2368227,
            "title":"Wet and/or mess your self"
        },
        "12411212212212":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Just kiss for now",
                "Start rubbing each other through your diapers",
                "You have a idea"
            ],
            "content":"<div class=\"\"><div> <span>While the idea of using your diaper is tempting, for now, you just want to get accustomed to the feeling of wearing them. As well as enjoy that feeling.<br>\r\n<br>\r\nYou stand where you are and run your hands along the front of your padding. It is so bulky and soft; the sensation is amazing. You can hardly feel your manhood through your diaper. But when you press against the front of your nappies, your cock quivers slightly.<br>\r\n<br>\r\nFinally, you turn back to Jessica. She is still in her wet diaper and her top. Whereas all you have on is your own diaper.<br>\r\n<br>\r\nYou smirk and say \"I think you're a tad overdressed, Jessie.\"<br>\r\n<br>\r\nShe flushes and mutters \"Really, Nick?\"<br>\r\n<br>\r\nYou nod and waddle over to her. Then you instruct her \"Lift up your arms.\"<br>\r\n<br>\r\nShe does this, and you swiftly pull her shirt off her, leaving her in just her bra and diaper. As she lowers her arms, you reach behind her and unfasten her bra, which she allows to fall to the floor.<br>\r\n<br>\r\nFor a moment, Jessica instinctively tries to cover her breasts, but you gently take her arms and tell her softly \"No need for that. It's just the two of us here.\"<br>\r\n<br>\r\nShe quickly eases down and moves her arms away from her chest. Now she is standing before you in nothing but her damp padding. A tent starts to appear in the front of your diapers.<br>\r\n<br>\r\nYou step forward, delicately take Jessica's cheeks in your hands, pull her closer, and kiss her on the lips.<br>\r\n<br>\r\nShe is initially shocked. However, she soon closes her eyes and kisses you back. The two of you stand there in nothing but your diapers, making out.</span></div></div>",
            "created":1502341200,
            "id":2367473,
            "title":"Keep your diaper clean for now"
        },
        "1241121222":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "you should watch a movie",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Now baby I want you to swallow this.\" she closes her eyes and you have her swallow some slow acting laxatives then you suggest that</span></div></span></div>",
            "created":1503118800,
            "id":2371677,
            "title":"Have some fun with Jessica "
        },
        "12411212221":{
            "choices":[
                "She messes herself",
                "She wets herself "
            ],
            "content":"<div class=\"\"><div> <span>You diaper Jessica and say “From now on you’ll only call me daddy or master is that clear?” <br>\r\n“Yes daddy” Jessica replied.<br>\r\nYou both sit down and watch the movie and halfway through you see her squirming and her face getting red. “Daddy”<br>\r\n“Yes baby Jess?” You reply<br>\r\n“I gotta use the bathroom”<br>\r\n“Well then go right now” you tell her<br>\r\n</span></div></div>",
            "created":1532235600,
            "id":2523165,
            "title":"you should watch a movie"
        },
        "124112122211":{
            "choices":[
                "Change her and take her back to your room",
                "Go out in public",
                "Unzip your pants and let your dick out"
            ],
            "content":"<div class=\"\"><div> <span>She smiles at you and squats right in front of you as she unleashes her big fat mess into her diaper. She can’t control herself as mush keeps flooding in and she’s groaning louder and louder until finally<br>\r\n“Blaaaaarrrttttt” her diaper is now twice as big than before and now she sits right next to you with her smelly mess. <br>\r\n“Why don’t you and I have a little more fun” you say<br>\r\n“What type of fun daddy?” Jessica reply’s with her face still red from all that excitement.</span></div></div>",
            "created":1532235600,
            "id":2523170,
            "title":"She messes herself"
        },
        "12411213":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "diaper her",
                "play try not to laugh"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you get a bunch of sheets and blankets ready, once she's back you</span></div></span></div>",
            "created":1503118800,
            "id":2371680,
            "title":"Do something else"
        },
        "12412":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "a bra and pair of panties",
                "a girls swimsuit your choice",
                "Sex toy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I need a...</span></div></span></div>",
            "created":1503118800,
            "id":2371682,
            "title":"Other"
        },
        "124121":{
            "author_id":"digijurer",
            "author_name":"Digijurer",
            "choices":[
                "Jessica comes back with the girliest set she can find",
                "Jessica tries to convince you to ask for something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><span style=\"line-height:2.0;\">\"a bra and pair of panties.\" you joke.<br>\r\n\"Of course. \"Jessica responded.</span></span></div></span></div>",
            "created":1528434000,
            "id":2504288,
            "title":"a bra and pair of panties"
        },
        "1241211":{
            "author_id":"s.redwill11z",
            "author_name":"Tarces",
            "choices":[
                "empty",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Im back!\" you could hear her shouting from the front door. You still are lying in bed. As she approaches the open door she says \"Since you want to be such a lovely girl, i bought you the prettiest pair of all.\", handing you lacy bright pink panties with alot of frills and with a small white bow near the waist and a matching AA32 cup bra. \"Please put them on for your maid.\" While blushing, you strip of your boxers and put them on the bed. You hear her fumbling in your closet. Once your tight panties are on, you turn arround to see what she is doing. You were immediately greeted by a flash. You realise, that she has taken a photo of you and left the room. Not wanting to let her see you like that, you decide to inspect your closet finding it to be...</span></div></div>",
            "created":1585201200,
            "id":2807295,
            "title":"Your new underwear"
        },
        "1242":{
            "choices":[
                "led you to the basement",
                "led you to the separate in-law suite across the pool deck",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>\"Well I was tasked on keeping you out of trouble, and I'll hold myself to that even if I have to take drastic measures.\" Since her hire the two of you have played secret games especially in the last two years since she became an adult and you were still a child. With the two annoyances out of the house your two could play more in open. She, like any good hormonal babysitter, loved T.U.G.s or tie up games. Well so did you. Mostly you tied her up but she's done the same to you. You tried to play it cool but something betrayed you. She saw this and said, \"Alright then, I'll make sure you stay out of trouble whilst I'm out and I will pick up whatever you need, K.\" At this lightly slapping your ass. You weren't sure how she'd 'make sure your stay out of trouble' but you didn't care. She...</span></div></div>",
            "created":1501650000,
            "id":2363434,
            "title":"No, I'm good."
        },
        "12423":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "To the pool deck",
                "To the horse stables",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else could she have lead you too?</span></div></span></div>",
            "created":1578114000,
            "id":2769078,
            "title":"led outside to the pool deck"
        },
        "1243":{
            "author_id":"butt311",
            "author_name":"john doe",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what dose she say</span></div></span></div>",
            "created":1529730000,
            "id":2511186,
            "title":"Can I come with?"
        },
        "125":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Jessica, Lance and Nick have a threesome",
                "Lance let Jessica see his webbed toes in exchange for some toe sucking",
                "Nick lets Lance suck his toes"
            ],
            "content":"<div class=\"\"><div> <span>You moan and roll over onto your back saying \"What is it Jessica?\" <br>\r\n\"I want to suck on your big toes Nick, they really turn me on. When I saw you barefoot last week during the interview, your beautiful tan feet called out to me\" replied Jessica. <br>\r\nShe untucks the blanket at the foot of Nick's bed and uncovers Nick's stocking feet. Jessica immediately peels off both of his socks revealing two smooth, hairless and tan bare feet with slender, pedicured toes. <br>\r\n\"Now that I can see them up close, your bare feet and toes look even more beautiful and splendid\". Jessica picks up both of his bare feet into her hands and engulfs both of Nick's big toes into her mouth. Nick moans and splays his other toes.<br>\r\n<br>\r\nJessica stops and begins to pull Nick's t shirt and sweat shorts off him. \"What a nice looking body!\" she says. Jessica then pulls off Nick's underwear and plays with his penis. \"I really want to have sex with you, you young stud with awesome bare feet\" Jessica says to Nick. She strips off her top, shorts and panties and mounts Nick. Nick intertwines his toes with Jessica's toes and inserts his penis into her vagina, then begins to thrust it upwards. She begins to moan and groan in bliss. They reverse positions and go at it.<br>\r\n<br>\r\n\"Oh Nick, that was great! I wish we could stay like this for the rest of the summer. Let's at least stay naked, so I can always see those bare beauties and thick manhood of yours...okay?\" Jessica says to him. \"Promise me?\". <br>\r\nNick smiles at her saying \"What about if I have friends over or other company?\".<br>\r\nJessica replies \"Then you can wear a towel then, but that's it!\".<br>\r\n<br>\r\nJust then there is a knock at the front door. Nick gets out of bed naked and runs to the door. Hiding behind it, he opens the door to see his friend Lance. \"Hey Lance!\" Nick says loudly. Lance says \"Nick, are you naked or something? What's with hiding behind the door? I've seen you naked before at school\". Nick turns a little red as he walks in full view of his friend. His semi-erect penis bobbles a bit. Lance says \"I heard it's just you and your maid for the whole summer. Did you already bang her?\". Nick embarrassingly nods.<br>\r\nLance gives him a high five. <br>\r\n<br>\r\nJessica walks up behind Nick and rubs his sides and chest. \"Whose this stud Nick?\" she says. <br>\r\nNick replies \"This is my friend Lance. He just came over for a short visit\". <br>\r\nJessica says \"Aren't you going to invite Lance in? Make sure to take your shoes off before coming in\". <br>\r\nLance is wearing a polo shirt, khaki shorts with black sport shoes and white socks. He stoops down and unties his shoes and pulls them off his stocking feet and places them at the front door outside.<br>\r\n\"You can take your socks off too if you wish. Nick and I are barefoot\" Jessica exclaims. <br>\r\nLance hesitates and says \"I'll just keep my socks on, my feet uh, get cold\" and walks inside. <br>\r\nNick whispers to Jessica \"He has webbed toes on his right foot. Lance doesn't bare his feet at all in public\".<br>\r\n<br>\r\nJessica says \"Anyone for some breakfast? Nick nods as does Lance. Jessica begins fixing breakfast as Lance and Nick play video games on the big screen in the family room. <br>\r\nLance says to Nick \"If you don't mind me asking, why are you still naked?\" as he looks at Nick's bare feet and body.<br>\r\nNick replies \"Jessica asked me to stay this way for the summer, the only thing I can wear if we have guests is a towel\" winking at Lance. \"At least, I don't have to worry about picking out clothes or the right shoes\".<br>\r\nLance laughs and says \"You're right...by the way, did you tell Jessica about my webbed toes?\". Nick nods and replies \"She would have found out sooner or later. She came into my room this morning and sucked my toes. She must have a foot fetish. If I were you, I'd try and keep your socked feet from her\". <br>\r\nLance exclaims \"No way...she really sucked on your bare toes? Lucky dude. All my girlfriend does is massage by stocking feet. She still freaks out when she sees my webbed toes, so she tells me to keep my socks on\". <br>\r\nNick replies \"Yep, no kidding. Jessica came in, pulled back my bed covers, pulled off my socks and sucked my big toes. She then stripped me naked and asked to have sex with her. What could I say after she stroked my penis?\". <br>\r\n<br>\r\nLance says \"Wow, you barely know her and I've been going out with my girl for almost a year!\" as he takes his shirt off. \"It's hot in here. Is the AC on?\". Nick nods and says \"No, but it's getting fixed this week. Strip down to your boxers if you wish or go a la natural like me. Jessica won't care. You can even go barefoot, but keep your bare feet hidden form Jessica's view\". <br>\r\nLance pauses the game and stands up and pulls off his shorts and boxers and stands in front of Nick naked. He then bends down and peels off his socks revealing his semi tan, slender bare feet with hairless, tan and pedicured toes. On his right foot, his three middle toes are webbed together. Nick looks down at Lance's foot saying \"Still can't believe you're shyness over your webbed foot. <br>\r\nI'd show it off if I had webbed feet\". <br>\r\nLance replies \"Not if you got teased unmercifully, like I did in grade school and middle school. Other kids can be so mean calling me duck boy and aqua boy. If people can't see them, then I feel safe\". <br>\r\n<br>\r\nJessica yells \"Breakfast is ready!\". Nick and Lance pause their game and walk naked into the breakfast table. Jessica sees Lance has stripped naked. \"Nice package there Lance\" she says smiling. They sit down and are served. Lance hides his webbed foot under his other barefoot. Jessica drops a fork under the table and retrieves it. She steals a looks at Lance's bare feet and toes, but doesn't notice his webbed toes.<br>\r\n<br>\r\n.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1512795600,
            "id":2425913,
            "title":"\"I need some help with something\""
        },
        "1252":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "returns the favor and sucks on Nick's bare toes and soles",
                "takes a shower, dresses and leaves barefoot",
                "Jessica lets Lance stay the weekend, but he has to stay naked"
            ],
            "content":"<div class=\"\"><div> <span>Jessica comes up from underneath the table and says to Lance \"Oh Lance, your bare feet are just as beautiful as Nick's bare feet and toes. I know why you didn't bare them sooner, but I think they look great!\".<br>\r\nLance replies \"If I let you see my webbed toes, will you uh...suck on them?\". Jessica smiles and agrees. <br>\r\nLance lifts up his right bare foot up on the table for Jessica to study and see his webbed toes up front. \"Oh my...they are webbed all together, but I think they are kinda cute and all your toes are well taken care of. Do you pedicures?\" says Jessica. <br>\r\nLance nods and replies \"About every month or so\" and splays his toes. <br>\r\nJessica begins to lick Lance's big toe and engulfs it into her mouth and swirls her tongue around it. Lance can't believe she is sucking on his big toe. He begins to get excited in the penis department. <br>\r\n<br>\r\nNick watches as Jessica tantalizes Lance's barefoot and seeing Lance's penis become erect saying \"Wow Lance, you sure are well endowed. Mine only gets about 8 inches when fully erect. That must be at least 10!\". Lance gives Jessica his other bare foot to feast on. Jessica says \"Boys, how about I give you both some satisfaction in the bedroom? Lance here is already excited. Nick, I'll suck on your big toes again to get you excited, then give you both some real satisfaction\". Lance and Nick smile at her, then follow her to Nick's bedroom. Jessica has her way with both of them and lets Lance have sex with her as Nick watches. <br>\r\n<br>\r\nJessica says \"Boys, that was great! Would you do me a big favor? Nick, I want you to have anal sex with your friend Lance with his legs in the air, then suck on his big toes\". Nick and Lance look at each other. Lance replies \"I'm not gay and neither is my friend Nick here. Why do you want us to have anal sex? Didn't you like having sex with us?.<br>\r\nJessica replies \"I just want to see two guys drilling each other plus seeing their toes being sucked...please?\".<br>\r\n<br>\r\nLance shrugs his shoulders and lays down on his back while Nick lifts his legs and begins to kiss, lick and suck on his toes. He then inserts his penis into Lance and pumps away. Lance's toes splay as Nick pulls out as he explodes all over Lance's chest. <br>\r\nLance nearly passes out and Nick apologizes to him for playing with his toes and doing him. Lance...</span></div></div>",
            "created":1512795600,
            "id":2426089,
            "title":"Lance let Jessica see his webbed toes in exchan..."
        },
        "13":{
            "author_id":"doveofficer",
            "author_name":"DoveOfficer",
            "choices":[
                "Browse through your wardrobe for what to wear. ",
                "Jump into the shower first",
                "Slip back into bed for a few more minutes ",
                "Head straight downstairs to eat ",
                "Make a break for it! Run! Hide!"
            ],
            "content":"<div class=\"\"><div> <span>\"Get up! It's time to get up!\"<br>\r\n<br>\r\nThe sound of the unwelcome voice had you pulling your sheets further up over your head.<br>\r\n<br>\r\n\"It's well past seven o' clock, it may be summer break, but that's no excuse to let good habits slip,\"<br>\r\n<br>\r\nYou could hear a window shutter being opened. Now you felt the need to drag your pillow over your head. Try as you might, there was no denying the inevitable. Your bed sheets were pulled straight out of your grasp and cast aside. Flipping onto our back, you drearily rubbed the sleep form your eye so you could focus more clearly.<br>\r\n<br>\r\nUpon opening your eyes further, you couldn't help but gulp slightly at the bewitching sight. Towering above you at the foot of the bed, silhouetted by the early morning sunlight pouring from the window behind her, was your family's maid. Mary. An old book club friend of your mother's, she had been the family maid for several years now.<br>\r\n<br>\r\nTall, chocolate brown hair, piercing green eyes,and a body the internet would easily describe as \"extra thicc\". She may have been in her mid forties, but Father time seemed to have a made an exception with her. For her face and skin was as smooth and wrinkle free as a woman half her age;her plump, D cup breasts nearly threatened to spill out of her bra and uniform, while her lower half was even more impressive. Sharp, wide, thick hips gave way to thick thighs in one direction, while giving way to one wide massive ass in another. And to top it off, there was a thick padding of flab over stomach to give her some girth in the middle.<br>\r\n<br>\r\nIt were to say you had never had any \"thoughts\" or certain \"feelings\" toward to your family's maid.........well, does it need to be said?<br>\r\n<br>\r\n\"Morning, Miss Mary,\" you mumbled distractedly. <br>\r\n<br>\r\n\"It's just Mary,\" she said automatically. \"It's nearly a quarter to eight, and you're not even dressed,\"<br>\r\n<br>\r\n\"It's summer break, aren't entitled to a little bit of slacking off?\" <br>\r\n<br>\r\n\"Not when I'm paid to watch over you, come on, there is breakfast downstairs waiting,\"<br>\r\n<br>\r\nYour legs may not have been willing to move just yet, but your eyes certainly were. As indicated by how transfixed you were by Mary's rather large ass jiggling about in her snug uniform as she walked out of your bedroom and into the hallway. Wiping away the drool forming in your mouth, you decided to play things safe and hop out of bed.<br>\r\n<br>\r\n\"Too early...\" you moaned.<br>\r\n<br>\r\nYou then decided to....<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1499749200,
            "id":2351224,
            "title":"Mary "
        },
        "133":{
            "author_id":"kendra123",
            "author_name":"Kendra",
            "choices":[
                "a diaper",
                "Normal clothing",
                "lingerie "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you wake up with Mary looming over you, you then notice that you are wearing</span></div></span></div>",
            "created":1503118800,
            "id":2371700,
            "title":"Slip back into bed for a few more minutes "
        },
        "1333":{
            "author_id":"lb20622",
            "author_name":"LorenzoTheGuy",
            "choices":[
                "Her uncovered pussy",
                "A 12\" penis",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size35\" style=\"\">You look down and see that you're dressed in a woman's lingerie outfit. While looking at yourself, you also notice that you've been bound to your mom's bed in her room! As you try to say something....you also notice the ball gag in your mouth.<br>\r\n\"You're a naughty boy~, you know that?\" Mary said lustfully. \"If you wanted to be in bed <i>that</i> badly, then I'm more than willing to oblige.\" She giggles with a bit of malice. You continue to look at your surroundings and notice that though the room is only lit with candles and the blinds shut completely, the room seems to have a red aura about it. \"Now then;\" says Mary, grabbing your attention, \"I think it's time for some...<i><b>quality time.</b></i>\" As she approaches, you notice.....</font></span></div></div>",
            "created":1575349200,
            "id":2755157,
            "title":"lingerie "
        },
        "13332":{
            "choices":[
                "You lick your smeared lips",
                "You open wide allowing her cock in",
                "You keep your lips shut defying her",
                "More Choices",
                "More Choices"
            ],
            "content":"<div class=\"\"><div> <span>You are watching Mary walk towards you and then you happen to see out of Mary's Lingerie … a 12' Penis poking through, and as Mary gets closer to you, the 12\" Penis get bigger and bigger, until the large penis is pressing against your closed lips. Mary stands there smiling and laughing saying \" Come on baby, Open up for your sitter, You KNOW that you want it in your mouth and you KNOW that I want it in your mouth .. and we BOTH KNOW that it's going to happen, so just have fun with it \"  as Mary pushed even harder against your lips smearing some pre-cum across your lips.<br>\r\n<br>\r\n</span></div></div>",
            "created":1576472400,
            "id":2760242,
            "title":"A 12\" penis"
        },
        "133322":{
            "author_id":"s.redwill11z",
            "author_name":"Iliketrains1",
            "choices":[
                "She keeps it up",
                "She wants to do something else"
            ],
            "content":"<div class=\"\"><div> <span>While letting her dick go inside your mouth you feel a strange sensation. Her dick feels kinda nice, so much so you suck on her dick like you never had ever before. After a few seconds sucking her dick you feel something odd in your mouth. Its sticky and somewhat salty all the while kinda warm. It seems like she cummed inside your mouth. Upon realising this you slowly swallow her cum awaiting more to come, while getting hornier. <br>\r\n<br>\r\nDoes she proceed with the act?</span></div></div>",
            "created":1584421200,
            "id":2802610,
            "title":"You open wide allowing her cock in"
        },
        "133323":{
            "author_id":"s.redwill11z",
            "author_name":"Iliketrains1",
            "choices":[
                "Your chest has two small mounds",
                "Your chest hasnt altered"
            ],
            "content":"<div class=\"\"><div> <span>Allthought her dick came closer by the second, increasing the pressure on your lips, you kept your lips shut. \"Why wont you open your mouth? I thought we will enjoy this time together. But since you arent complying, i will skip the teasing and go to the main part of our time.\" she said. <br>\r\n<br>\r\nAfter saying this she moved the dick away from your body only to rearrange the bondings holding your legs and arms in place to undo \"your\" hot pink bra. Upon removing \"your\" bra you saw that...</span></div></div>",
            "created":1584433620,
            "id":2802612,
            "title":"You keep your lips shut defying her"
        },
        "1333231":{
            "author_id":"s.redwill11z",
            "author_name":"Iliketrains1",
            "choices":[
                "...did make a sound. Enjoying this to the full potential.",
                "...didnt make a sound. Wanting to be free from the bondage."
            ],
            "content":"<div class=\"\"><div> <span>You saw that two small mounds are on your chest. Terrified you try to say something but the ballgag didnt let words come out of your mouth. Noticing this, Mary said: \"Do you like your small breasts, my little sissy? Your small A cup breasts are still very sensitive. I have an idea, i will touch your small breasts and if you dont squirm, then i will let you free of the bondings.\" <br>\r\n<br>\r\nUpon saying that, she continued to squeeze your small breasts gently giving you a strange sensation all over your body. Your dick hardens but you feel that its restricted by your tight hot pink thong. Every squeeze from her makes you even hornier. Deep inside you know this is wrong but you cant help but kinda like it. After she realised this, she went on and squeezed your small breasts even more frequent but still gentle. \"You like me squeezing your little breasts? I thought you were a man but i only see a little girly sissy now.\" said Mary. But you didnt care what she said and soon you tried to moan. In the same moment as the urge to moan came, you realise that you would be set free from this, if you didnt make a sound. Therefore you...</span></div></div>",
            "created":1584487200,
            "id":2802999,
            "title":"Your chest has two small mounds"
        },
        "13332312":{
            "author_id":"s.redwill11z",
            "author_name":"Iliketrains1",
            "choices":[
                "read the choreslist",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>After a few more squeezes she stops it and leaves the room only to come back with two full plastic bags. Only now you see that you were sweating and even cummed inside your thong. She placed down the bags on the ground and began searching for something. After a few seconds she presumably found what she searched for and came slowly to your bed only to put a blindfold on you. After that she fastened something arround your neck. It felt soft like \"your\" lingerie except one spot that felt like metal on your neck. After that you felt her removing your thong. \"Looks like someone enjoyed themself. Didnt you my little girly sissy?\" she said while giggling a little. You didnt even try to say something out of humiliation. After getting the thong off you she left the room for a couple minutes. Comming in the room you heard the sound of keys clinging. \"Since you enjoyed our time here so much, i made sure that you wont be wearing any of those icky boy clothes.\" she said giggling once more. You heard her searching for something in the bags and soon enough she came closer to you and you felt that she put another thong on you along with stockings and a gartherbelt. \"Since i saw that you like pink so much that you presented yourself for me in an only pink outfit, therefore i did the only logical in picking your favorite pink thong that exposes your ass and gartherbelt. And not only that, ive picked your favorite pink stockings alongside with your favorite pink 5 inch heels. And i have a small surprise for you.\" she said almost laughing. <br>\r\n<br>\r\nAfter she put it all on you, she took off your blindfold and released you from the bonding. You were angry at her but at the same time too tired from the session and you fainted in your moms bed. <br>\r\n<br>\r\nThe next morning you awoke in an unfamiliar bed. And in an unfamiliar room. It looked like a room a little girl would like, Everything is pink or white, a teddy is in an corner after standing up you notice that you are still in the clothes from the day before. You try to take the clothes off but you cant because they are locked in your back with a padlock. You feel embarrassed in your current outfit because it exposes your still small A cups. You head towards the white closet and almost stumble because of your heels. You try to swear but you notice that the pink ballgag was still in your mouth, preventing you from speaking. Trying to find something to cover your embarrassing outfit up, you open the closet only to find a very revealing french maid outfit that has an opening in the skirt to clearly expose your ass alongside with your hot pink thong. Other than that the maid outfit has openings on the chest which show your small a cups clearly. <br>\r\n<br>\r\nNot wanting to wear that outfit you open the drawer below only to find more thongs, gatherbelts, and stockings neatly folded. You open the second drawer only to find gags, blindfolds and leather bondage material. Disgusted by your findings you attempt to open the last drawer but it was locked. Looking at the maid outfit again you see a little note.<br>\r\n<br>\r\n You take the note and it reads: \"Since you are reading this you have awoken from your slumber my little sissy maid. Im sure you would love to try the maid outfit out and serve me, your mistress Mary. If you wont do that, i will publish a photo that ive made of you in your sleep. On the topshelf you will find some cute bracelets that are made for you. Theres also a key there to lock your cute little pink bracelets to your hands after you have tightened them. They are connected with a small little chain which pulls your hands together automaticly when i press a button or when your hands are too far apart from each other, so you can move your little girly sissy maid hands arround dusting and serving me without being a threat. Allthough you wouldnt be ever a threat since you are only a little sissy maid. You might wonder what happened to your room or those icky boys clothes. Well lets say i fullfilled the wish of my little sissy maid by getting rid of them. If you dont believe me then just look at the box in the topshelf. Oh and when youre done putting your little maid outfit on, you should then pass the key for the bracelets under the door\" <br>\r\n<br>\r\nAfter reading the note you were feeling defeated and out of curiosity you took the transparent box only to see your former clothes locked inside with a padlock. Completly defeated you took the maid outfit and put it on, it felt soft but also wrong. You can feel the air on your ass and on your breasts. Now theres only one thing left to do, the bracelets. You took them from the topshelf and put them on. After tightening them you passed the key under the door and after a few minutes the door opened to reveal Mary. <br>\r\n<br>\r\n\"Hello my little sissy, how was your slumber? Good i presume. Anyways heres your duster and your chores\" said Mary handing you both things. Mary then left. What will you do now?</span></div></div>",
            "created":1584495720,
            "id":2803058,
            "title":"released"
        },
        "133323121":{
            "author_id":"s.redwill11z",
            "author_name":"Iliketrains1",
            "choices":[
                "She uses her dick or squeezes your breasts",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The note that she handed you said:<br>\r\n<br>\r\n\"In the mornings you will stand up and make yourself pretty after that prepare breakfast for me, you must be finished at 6 am, if you arent finished at exactly 6 am, you will get punished. After serving me my breakfast you will have 15 minutes to make yourself your own meal. If i catch you eating after 6.15 am, you will get punished. You then have a 5 minute break for the toilet if you need to go. If i catch you on the toilet after 6.20 am you will get punished. Then clean the following rooms from 6.20 am to 11.00 am:<br>\r\n- The living room<br>\r\n- My room<br>\r\n- Your room<br>\r\n- The bathroom<br>\r\n- The garage<br>\r\n- All the corridors<br>\r\n<br>\r\nIf i see dust anywhere in these rooms you will get punished. If i catch you cleaning after 11.00 am you will get punished. After that you will prepare dinner for me. You must be finished at 12.00 pm. If you arent finished at 12 pm you will get punished. After serving me and doing the dishes until 1 pm, you will make yourself a meal until 1.15 pm. If i catch you after these times eating or doing the dishes, you will be punished. Then you have a 5 minute toilet break until 1.20 pm. After that you will come to me until 3pm. If i catch you on the toilet after 1.20 pm you will be punished. If you are late you will be punished. After that you will clean the rest of the rooms until 6pm. If theres dust anywhere or the rooms are unorganised you will be punished. After that you will make dinner for me until 7pm. If you arent finished at 7pm you will be punished. After serving me until 7.30pm you will make yourself a meal and eat it until 7.45pm. If i catch you eating after 7.45pm you will be punished. Then you will do the dishes until 8pm. If you are late you will be punished. Then you come to me until 9pm. After that you will go into your room and use the bottle on your nightstand on your chest.<br>\r\n<br>\r\nThose chores must be done every day until i say otherwise. If you arent having your outfit on you will be punished. If you want to do anything different you must have my permission. If you dont fullfill a single chore as described above you will be punished. If you get any item of your outfit dirty you will be punished and you will be doing the chores for the next day without the item. If you do anything against me you will get severely punished.\" <br>\r\n<br>\r\n\"That bit**\" you tried to say but only muffled sounds came out of your mouth. It was 6.17 am already and you needed to go on the toilet badly. So you rushed to the toilet and when you were on the seat it was 6.18 am. After doing your business on the toilet it was 6.21 am and after opening the door you saw Mary standing there with an disappointed expression saying: \"You arent on time sissy. Because of that you wont be getting on the toilet for lunch.\" You are going past her to do your cleaning of the rooms. After you were done with cleaning you made lasagna for your new misstress and servered it her. Then you washed the dishes. Then she removed the gag for you to eat. After that you made yourself a sandwich but it was 1.14 after you had finished making the sandwich because you didnt know where the items were you needed for the sandwich. After taking a single small bite you needed to go to your mistress so you ditched the sandwich and walked to the toilet only to find it locked. \"Why the hell is the bathroom locked?\" you said. \"Because you sissy were too late last time so you wont be getting access to the bathroom until your next break\" she replied behind you. \"Give me the keys you bitch!\" you screamed because of this, in that moment your bracelets pulled the chain together. \"Calling me a bitch, huh? I think you are the bitch here my sissy maid. And now go on your knees and open your mouth.\" she responded. In fear of a worser punishment you did what your Mary said and now you were looking up to her. She then took your head by the chin and said: \"Now my sissy bitch, you will enjoy this. You will lift my skirt and then pull down my panties and suck me off.\" Allthough you were disgusted you lifted her skirt and pulled down her panties to reveal the 12\" inch dick from yesterday, only now you could see it was a mechanical strap on. You began sucking her off very slow. \"Sissy you need to do it faster and with more love for it. If not you will be punished\" she said. Immediately you began sucking harder and faster, you could feel that something sticky and salty was entering your mouth and after your mouth was half full she said: \"That was enough sissy bitch. Now tell me that you love this and you would suck me anytime because you love that i dominate you.\" you said exactly that and then you continued your chores until you needed to go to her. <br>\r\n<br>\r\nAfter you entered her room you noticed that the shutters were closed. She said that you should lay on the bed after you removed the dress and you began laying on the bed. Then she came and said: \"You were a naughty sissy today, i need to punish you for that. Turn arround.\" as she said that you did it. You could feel your feet and hands being tied to the bed posts. <br>\r\n<br>\r\nWhat happends then?</span></div></div>",
            "created":1584501720,
            "id":2803075,
            "title":"read the choreslist"
        },
        "1333231211":{
            "author_id":"s.redwill11z",
            "author_name":"Iliketrains1",
            "choices":[
                "The next morning",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>She came on the bed and started squeezing your breasts like last time. After a minute of squeezing you start to moan and saying that you want more. While getting hornier by the second she asks: \"I will continue now.\" While wondering what that meant you could feel her going away from the room for a moment to get something. When she came back you were ready for more and she delivered more. She further squeezed your breasts but now her strap on came arround your face but inverted so that the dick would go into your mouth. \"Now suck it until you cant no more my sissy little maid bitch.\" And thats what you did for the next 20 minutes while your breasts were being squeezed. \"Okay little sissy, its time for preparations for tomorrow.\" she said while stopping the squeezing and removing the dick, leaving you midair bound to the posts. She then removed your thong and replaced it with one that would allow access to the butthole while having a pearlchain infront where a pussy normally would be. You felt that the new thong was way too small for you so much so that your dick was hurting by being constrained from the pearlchain. \"Okay sissy you will now smear your breasts and dick with the contents of the bottle on your nightstand. After that you will wear the pink babydoll nightie and then you come to me. If that thong comes off, you will be punished\" she said. While your dick hurts with every move you make you take the bottle and smear it all over your breasts and your dick while the thong is still on. Unbeknown to you the bottle contained female hormones.<br>\r\n<br>\r\nAfter you put on the nightie you walked back to her room and then laid on her bed once more. \"Im here mistress\" you shouted not noticing your pitch already was higher than before. You heard her steps and you felt something like the bracelets was being put on your legs. \"What the hell are you doing you stupid bitch?\" you shouted. Her response were only two words: \"punishing you.\" you wanted to stand up but immediately the bracelets forced your legs and hand together leaving you very constrained. You then felt something going into your ass. It vibrated continuously. Then you felt her adjusting your thong so the vibrator stayed in place while still constraining your dick. \"Why did you do that?\" you said. Her reply was: \"I found dust so you werent cleaning properly. If you are a maid you need to clean perfectly, especially when you are a littly girly sissy bitch like you. Now go into your room or you will get another punishment.\" she commanded. Not wanting to be punished you hurried to your room trying to sleep. </span></div></div>",
            "created":1584503400,
            "id":2803080,
            "title":"She uses her dick or squeezes your breasts"
        },
        "13332312111":{
            "author_id":"teros",
            "author_name":"teros",
            "choices":[
                "Option one",
                "Option two"
            ],
            "content":"<div class=\"\"><div> <span>The next morning she came into the room to find you sweating all over your body. The vibrator was still doing its job and kept you awake all night. You were very tired but your new mistress wont allow you to sleep. She removed the vibrator and stripped you naked, saying \"Now Maid, i will give you some options, its part of your punishment. The first one would be that you wear your ordinary clothing but with the vibrator while you do your work. The second one would be that you would wear a special outfit and you will work normally besides having no free time. So what will you choose?\"</span></div></div>",
            "created":1587871620,
            "id":2824736,
            "title":"The next morning and a choice"
        },
        "13332312112":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "You refuse begging.",
                "You beg her to put you in diapers for good.",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>After you lay on your bed for ten Mary enters your room and declares.<br>\r\n<br>\r\n“Well sissy you did so poorly today, that I have to revoke your potty privileges. Otherwise you would never learn your lesson From tomorrow morning on, you will be properly diapered by me once every 24 hours. <br>\r\n<br>\r\nYou will use your diapers for their indented purpose, but you have to ask me for permission every time before you use them. <br>\r\n<br>\r\nIf you have 30 perfect days in a row, you can try pull-ups but if I find the tiniest skidmark you go back to diapers.<br>\r\n<br>\r\nWell that is the normal option, but if you beg me nicely to put you into diapers for good, right now. I will free from your cleaning duties permanently, little sissy.”</span></div></div>",
            "created":1584508200,
            "id":2803107,
            "title":"Something else"
        },
        "14":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Horse",
                "Fox",
                "Another anthro option",
                "Deer",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you would like a anthro to be your maid?<br>\r\nThen how about one of these fine anthro spices.</span></div></span></div>",
            "created":1500958800,
            "id":2359092,
            "title":"Anthro maid"
        },
        "142":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Vicki",
                "Rachael",
                "Some other fox"
            ],
            "content":"<div class=\"\"><div> <span>Who do you want?<br>\r\n<br>\r\nVicki 23, red fox<br>\r\n<br>\r\n5'10\" Fur, typical red fox fur, DD cup breasts, and a<br>\r\nLarge but<br>\r\n<br>\r\nVicki is a nice red fox, and would always help you out<br>\r\nWhen you had stuff to do, like homework or yard work.<br>\r\nShe has worked with your family for 3 years now.<br>\r\n<br>\r\nRachael 26, Arctic fox<br>\r\n<br>\r\n5'11\" Fur, white, D cup breasts, and a large but<br>\r\n<br>\r\nRachael is a nice Arctic fox, and she had beautiful white<br>\r\nFur. Just make sure not to get her fur dirty or she will <br>\r\nPunish you.</span></div></div>",
            "created":1500958800,
            "id":2359110,
            "title":"Fox"
        },
        "1421":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "\"Sure lets have some fun!\"",
                "\"Actually, I wanted to talk with you\"",
                "\"Let's go hang out some where\""
            ],
            "content":"<div class=\"\"><div> <span>Finally summer was here, and you could do<br>\r\nAnything you wanted. You could say up late,<br>\r\nYou could sleep all day. And your mother <br>\r\nCouldn't say anything about it!  Maybe your<br>\r\nMaid could, but to be honest, you'd do pretty<br>\r\nMuch anything she asked you to do. She is<br>\r\nJust so hot, with DD breasts, and a nice big<br>\r\nAss on a hour glass figure! And to top it off<br>\r\nShe is also a anthro fox!<br>\r\n<br>\r\nYou try not to think about Vicky as a sex <br>\r\nObject, because to tell the truth, she was also<br>\r\nKinda like a friend to you. She was a nice<br>\r\nListener, would offer you support, and would <br>\r\nOffer help if you needed it. You also told her<br>\r\nSecrets that you would tell no one else, and<br>\r\nShe always respected what you would say. <br>\r\n<br>\r\nIt wasn't just deep conversations, and telling<br>\r\nEach other stuff, you two also had a lot of fun!<br>\r\nLike you two would play games together, play<br>\r\nPractical jokes on each other, go ride your <br>\r\nHoses, and even go to places to hang out.<br>\r\n<br>\r\nToday Vicky came into you room to wake you<br>\r\nUp. \"Hey nick, wake up it's almost 10.\" You <br>\r\nSlowly get up rubbing your eyes. \"Come on<br>\r\nVicky, I was have a great dream.\" You say <br>\r\nSleepily. \"Sorry nick, I just wanted to do <br>\r\nSomething today. Was there any thing you<br>\r\nWanted to do?\" </span></div></div>",
            "created":1511672400,
            "id":2420660,
            "title":"Vicki"
        },
        "14211":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "\"I have a idea for a game\"",
                "\"You wanna make a bet?\"",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Sure, let's have some fun!\" You say to<br>\r\nVicky. \"Ok. What do you want to do?\"</span></div></span></div>",
            "created":1512709200,
            "id":2425393,
            "title":"\"Sure lets have some fun!\""
        },
        "142111":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Truth or dare",
                "Hide and seek",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I have a idea for a game we could play.\" You say to her.<br>\r\n<br>\r\nVicky smiles and says to you. \"What game did you want to play?\"<br>\r\n<br>\r\nYou think for a second and decide on...</span></div></span></div>",
            "created":1523077200,
            "id":2476254,
            "title":"\"I have a idea for a game\""
        },
        "1421111":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Truth",
                "Dare",
                "She takes to long"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's play truth or dare!\" You say to Vicky.<br>\r\n<br>\r\n\"Alright, but we should have some rules. One, if you don't do a dare or tell the truth, then you must be punished with a punishment of the other persons choice. For the second rule. If you take longer than 30 seconds to decide truth or dare. Then the other player gets to decide for you. If those sound good, then let's play!\" Vicky says sounding exited to play<br>\r\n<br>\r\nYou say. \"Ya those sound good Vicky. Now, truth or dare?\"<br>\r\n<br>\r\nWhat does Vicky choose?</span></div></div>",
            "created":1523077200,
            "id":2476282,
            "title":"Truth or dare"
        },
        "14211112":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Truth ",
                "Dare",
                "You took too long and Vicky decided for you"
            ],
            "content":"<div class=\"\"><div> <span>\"Dare\" said Vicky.<br>\r\n<br>\r\nYou give a mischievous smile. \"I dare you to chug that jug of milk in the fridge\"<br>\r\n<br>\r\nVicky just smiles and says. \"Too easy\" as she walk to the kitchen. A moment later she returns with the 4L jug, and opens the top. \"I was feeling a little thirsty anyways.\" She says as she starts chugging. <br>\r\n<br>\r\nYou watch Vicky chug it down, a little impressed at how well she can handle it. Near the end you can see her belly extend a little, and then she finished with a loud belch \"BUUUuurrrrp ahhhh. Too easy. Alright, now it's your turn.\" Vicky says unphased by all that milk<br>\r\n<br>\r\nWhat do you chose?</span></div></div>",
            "created":1542862800,
            "id":2580456,
            "title":"Dare"
        },
        "142111121":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Truth",
                "Dare",
                "She leans in and gives you a kiss"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll take truth\" you say with confidence.<br>\r\n<br>\r\nVicky looks at you and smiles. \"Have you ever kissed a girl?\"<br>\r\n<br>\r\n\"No I haven't.\" You say blushing. Vicky starts to giggle when she here's this.<br>\r\n<br>\r\n\"Ok Vicky. Truth or dare?\" You say trying to get her attention.</span></div></div>",
            "created":1546491600,
            "id":2597988,
            "title":"Truth "
        },
        "1421111212":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "She wants to win. *takes off all her clothes*",
                "She doesn't do it. You get to punish her",
                "She doesn't do it. She punishes you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'll take a dare!\" Vicky said ready to go.<br>\r\n<br>\r\n\"Alright, i dare you to take off all your clothes.\" You say laughing.<br>\r\n<br>\r\nDoes Vicky actually do it?</span></div></span></div>",
            "created":1577768400,
            "id":2767520,
            "title":"Dare"
        },
        "1421113":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Leap frog",
                "A game of tag",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1523077200,
            "id":2476260,
            "title":"Something else."
        },
        "14212":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Tell her you love her",
                "Tell here a secret of yours",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"What did you want to talk about?\" Vicky<br>\r\nSaid to you. \"Well...\"</span></div></span></div>",
            "created":1513141200,
            "id":2427437,
            "title":"\"Actually, I wanted to talk with you\""
        },
        "142123":{
            "author_id":"diblyribly",
            "author_name":"Gabidy-Gook",
            "choices":[
                "Tell about the size fantasy",
                "Tell about the whole dream",
                "Something Else",
                "Vicky notices your morning wood"
            ],
            "content":"<div class=\"\"><div> <span>You had had a dream about you having a huge cock with Vicky sucking you off, cum going everywhere. You know Vicky knows some interesting things, and that maybe she could help. But, you don't want to tell her the whole thing, you want to avoid objectifying her, of course. Maybe just about the huge cock thing...</span></div></div>",
            "created":1528779600,
            "id":2506261,
            "title":"Something else to tell."
        },
        "1421231":{
            "author_id":"diblyribly",
            "author_name":"Gabidy-Gook",
            "choices":[
                "She goes along with it",
                "She punished you for your perversion",
                "She asks more questions about the dream",
                "“I know you’re staring at my tits”"
            ],
            "content":"<div class=\"\"><div> <span>“Well Vicky,” you start, your morning wood pulsing under your covers, “I  had this real vivid dream where my penis is huge. I know it sounds weird but something I want and I think you could help me?” Vicky passed through a few expressions, crossing her arms in front of her, squishing her boobs. <br>\r\n<br>\r\n“Let me think about it,” she says, rubbing a hand across your shoulders.</span></div></div>",
            "created":1529038800,
            "id":2507345,
            "title":"Size Fantasy"
        },
        "143":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Wolf",
                "Bear",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1501736400,
            "id":2364134,
            "title":"Another mammal option"
        },
        "1432":{
            "choices":[
                "Kim",
                "Another maid",
                "Another maid"
            ],
            "content":"<div class=\"\"><div> <span><b>Kim</b> <i>[40, Grizzly Bear]</i><br>\r\n<font class=\"size25\" style=\"\">Kim’s been taking care of you for as long as you can remember! Anthros were very rare, so she was the only one you’ve really known for most of your life. She was truly an intimidating sight compared to most human women. Not only was she a stunning 6’11”, but she was also quite a bit on the ‘heavy’ side. And by heavy, I mean she has a waist thicker than your entire body, pillowy breasts, and of course, a big, round potbelly. Bears were often big eaters, but Kim took it above and beyond, gulping down truly incredible amounts of food whenever she gets hungry. You’ve noticed that all your bullies over the years have mysteriously disappeared, which may or may not be somehow related to Kim’s insatiable appetite.<br>\r\n<br>\r\nOverall, though, she’s a very motherly, hard-working, and dependable woman, which has led you to rather admire her over the years. You also find her strangely attractive, too, despite being an anthro; and a huge, pudgy one, at that. And it seems Kim reciprocates your feelings. Indeed, the two of you have been growing more and more… ‘intimate’ as you get older. It started with her catching you peeking on her in the shower while she was taking care of you one day. To your surprise, instead of being upset, she emerged from the shower later still completely in the buff, and she sat down with you and had a heart-to-heart discussion during which she showed you her body. From then on, you quickly became comfortable being naked around eachother… you became more sexually intimate. Apparently, your ol' mama bear just thinks it’s her responsibility to take care of your <i>every</i> need...</font></span></div></div>",
            "created":1520226000,
            "id":2460966,
            "title":"Bear"
        },
        "14321":{
            "choices":[
                "Invite some friends over",
                "Go somewhere downtown",
                "Just chill out around the house"
            ],
            "content":"<div class=\"\"><div> <span>In the night, your slumber is filled with delightful dreams that you’re being bathed by a giant, disembodied tongue. As it turns out, truth can be stranger than fiction.<br>\r\n<br>\r\nWhen you finally wake up, already engrossed in ecstasy, you look down to see a massive, shifting bear-shaped bulge in the blankets below you, and you can hear what sounds like a tongue lapping. You pull up the covers to see Kim’s face, her long, incredibly soft tongue wrapped around the length of your cock. Her tongue retracts into her mouth when she notices you’re awake, simply so she can smile up at you. <br>\r\n<br>\r\n<b>“Ssshhh… ssshhh…”</b> She says, seeing the surprised look on your face. <b>“Just lie back and let yer mama bear take care of ya…”</b> You were a little startled, for sure. Sure, Kim’s sucked you off before… but she’s never woken you up like this! Once you realized her intentions, though, you lower the blankets, close your eyes, take a deep breath, and simply relax while she pleasures you beneath your covers. <br>\r\n<br>\r\nAs she licked and kissed all over your balls and shaft, her pace was leisurely and very slow, befitting such a quiet, restful morning. It was actually rather relaxing. Still, despite how slow she was going, her tongue bath felt incredible to your hormone-driven mind, and your manhood was quickly, painfully hard.<br>\r\n<br>\r\nYou could hear her cooing and giggling at how excited you were, already wrapped around her finger. Whenever she ‘took care of’ you like this, she was always incredibly generous and almost motherly, not caring so much about her own pleasure as me as she cared about making you happy. Still, that’s not to say you didn’t ‘return the favor’ every now and then.  <br>\r\n<br>\r\nEventually, while diligently licking along the tip of your cock, she gently guides it between her big, slobbery lips, and you shivered and let out a little gasp as the length of your cock was surrounded by the incredible warmth and wetness of her maw.<br>\r\n<br>\r\nAll you can do is lie there as she painfully slowly suckles on your cock, toying with it in her mouth with her tongue. Her teeth were razor sharp, of course, but she was gentle as can be, and you trusted her with your life. You know that, given the age difference between you, this was all pretty morally wrong. But… it wasn’t like Kim was a pervert or anything. In fact, the way she slowly pleasured you, it was almost… nurturing. It hardly felt like a simple sex act, and more like a deep, intimate expression of how much she cares. Of course, the fact that it felt absolutely amazing didn’t hurt.<br>\r\n<br>\r\nAfter a few minutes, you finally reached your climax, biting your lip so you don’t let out too loud a moan as you pump your load between the bear’s lips. Of course, Kim diligently gulps down every last drop… and when she finally pulls away, your manhood is covered with nothing but saliva. <br>\r\n<br>\r\nOnce you were satisfied, she throws the blankets off, revealing her big, fluffy, nude form, giving you a toothy smile as she giggles at the expression on your face. Without a word, she leans down and giving you a big, sloppy kiss on the cheek. It was a little gross, but you figured that if she was willing to suck you off, you should be willing to let her kiss you afterwards.<br>\r\n<br>\r\nWith that, she stands up and walks confidently out of the room, letting you ogle her big, jiggly rear as she leaves. You’re still a little bit dazed. This was your first day alone together for the summer, and this is how she decides to start things? You can only wonder at what else she was going to get up to over the course of the summer. <br>\r\n<br>\r\nOf course, it wasn’t like you minded or anything. Heck, usually when you woke up this early in the morning, you were miserable and exhausted, barely able to drag yourself out of bed. But after the ministrations of your loving maid, you felt refreshed and full of energy! Once you’d recovered from your post-orgasm afterglow, you hopped out of bed and eagerly prepared for a long day.<br>\r\n<br>\r\nWhen you eventually walked downstairs, you saw her cooking breakfast in the kitchen, now dressed in her usual outfit. <b>“Well, good morning, sleepy-head!”</b> She greeted you as you walked in, as if nothing had ever happened.<br>\r\n<br>\r\n<i>“Good morning,”</i> you nodded to her, yawning as you took a seat at the table. Eventually, she sets breakfast on the table before you… and it looked and smelled absolutely delicious as always! She’s been your family’s maid for your entire life, and over the years, she has mastered making the perfect dishes to satisfy your taste buds.<br>\r\n<br>\r\nWhile you start happily chowing down, she sits down across from you with a considerably larger meal. You can’t help but glance up at her every now and then, watching her swallow her food whole with incredible ease. When you were younger, her pudge and appetite were distasteful to you… but now, they’ve started to grow on you, and you even found them quite attractive qualities.<br>\r\n<br>\r\nOnce breakfast was over, it was time to decide how you’d spend one of the first days of summer...</span></div></div>",
            "created":1520226000,
            "id":2461073,
            "title":"Mama Bear Kim"
        },
        "1433":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Zebra",
                "Elephant",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe something from Africa?</span></div></span></div>",
            "created":1501736400,
            "id":2364135,
            "title":"Other"
        },
        "14333":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "A cat",
                "A Rabbit",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some more classic options:<br>\r\n<br>\r\nCats or Rabbits?</span></div></span></div>",
            "created":1505106000,
            "id":2383980,
            "title":"Something else"
        },
        "143332":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Candice",
                "Tessa"
            ],
            "content":"<div class=\"\"><div> <span>A rabbit maid can be a lot of fun:<br>\r\n<br>\r\nCandice, white rabbit<br>\r\n<br>\r\nAge: 22<br>\r\n<br>\r\nFur: White<br>\r\n<br>\r\nHair: Blond, long, curly<br>\r\n<br>\r\nEyes: Cobalt blue<br>\r\n<br>\r\nHeight: 5' 3\"<br>\r\n<br>\r\nFigure: G-cup, big ass, thick thighs<br>\r\n<br>\r\nCandice have been with you for 5 years. You took her in as a high school drop out. While she might not be very bright, she is honest and works well. She is very friendly, particularly towards men and boys. She's been especially nice to you since you started hitting puberty and you could swear her skirts got shorter and her cleavage got more and more exposed. As you soon come to realize she has a more than healthy libido.<br>\r\n<br>\r\n<br>\r\n<br>\r\nTessa, brown rabbit<br>\r\n<br>\r\nAge: 26<br>\r\n<br>\r\nFur: Light brown, almost white muzzle, chest and belly<br>\r\n<br>\r\nHair: dark brown, shoulder length, straight<br>\r\n<br>\r\nEyes: dark green<br>\r\n<br>\r\nHeight: 5' 1\"<br>\r\n<br>\r\nFigure: BB-cup, round modest bottom, thick thighs<br>\r\n<br>\r\nTessa has been with you for 6 years. She's hard working, but timid. She enjoys working hard and caring for the family. She tries to be not to intimidated by guests and newcomers, but it usually end up making her look quite adorable. She cares much about you but doesn't know how to present it outside of her professional actions.<br>\r\n</span></div></div>",
            "created":1505106000,
            "id":2383993,
            "title":"A Rabbit"
        },
        "143333":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Coyote",
                "Skunk",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a coyote? Or maybe a skunk?</span></div></span></div>",
            "created":1521435600,
            "id":2466475,
            "title":"Something else"
        },
        "1433333":{
            "author_id":"gor-loc",
            "author_name":"Berehoth",
            "choices":[
                "Sure a kangaroo.",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a kangaroo?</span></div></span></div>",
            "created":1531198800,
            "id":2517863,
            "title":"Something else"
        },
        "14333332":{
            "author_id":"jcmsrules",
            "author_name":"Gentle Giantess's Rule",
            "choices":[
                "yes (reader's choice what breed)",
                "another animal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's go into the Northern Hemisphere. How about a dog?</span></div></span></div>",
            "created":1566968400,
            "id":2709302,
            "title":"Something else?"
        },
        "144":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Dawn",
                "Hanna",
                "Another deer"
            ],
            "content":"<div class=\"\"><div> <span>Witch deer do you want to be your maid?<br>\r\n<br>\r\nDawn 28, white tail<br>\r\n<br>\r\n5'5\" Fur, brown with white underside, C cup breasts,<br>\r\nAnd a regular size but<br>\r\n<br>\r\nDawn is a cute white tail deer, and is a little shy. She<br>\r\nStarted working for your family 8 years ago, so she's <br>\r\nBeen around for around half your life.<br>\r\n<br>\r\nHanna 31, caribou(reindeer)<br>\r\n<br>\r\n6'1\" Fur, light brown, E cup breasts, and a huge ass.<br>\r\n<br>\r\nHanna has been working with your family for around <br>\r\n5 years now. She has been somewhat of a practical <br>\r\nJoker, and most of the time you fall for them. Hanna<br>\r\nIs also a pretty good cook, and makes great food<br>\r\nEvery day.</span></div></div>",
            "created":1500958800,
            "id":2359145,
            "title":"Deer"
        },
        "1442":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Get breakfast ",
                "Go out and do something ",
                "Go back to sleep"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You woke up at 9:30 on a Sunday morning. You could see the sun coming through your window, and you could tell it was going to be a nice day today.<br>\r\n<br>\r\nYou decide that you are going to...</span></div></span></div>",
            "created":1502168400,
            "id":2366511,
            "title":"Hanna"
        },
        "14423":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "You got a text",
                "Hanna is standing at the door",
                "You need to go to the bathroom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decided that 9:30am was way too early, so<br>\r\nYou decided to go back to sleep, and hopefully<br>\r\nHave a good dream.<br>\r\n<br>\r\nYou woke up a hour later when...</span></div></span></div>",
            "created":1503032400,
            "id":2370828,
            "title":"Go back to sleep"
        },
        "144232":{
            "author_id":"zebra56",
            "author_name":"Lonelyboi",
            "choices":[
                "You ask her what she wants",
                "You ask her to come in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She gives you a smirk one that Clearly meant she wanted something but you couldn't tell what it was</span></div></span></div>",
            "created":1597836540,
            "id":2887901,
            "title":"Hanna is standing at the door"
        },
        "1442322":{
            "author_id":"zebra56",
            "author_name":"Lonelyboi",
            "choices":[
                "Your nervous and scared",
                "Your ready"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She comes in and sits on your bed saying she's been fond of one thing and it's been you she slowly pulls the sheets off and then her dress revealing her large E cups and then undoing your little boxers which have gained an errection.</span></div></span></div>",
            "created":1597836720,
            "id":2887905,
            "title":"You ask her to come in"
        },
        "145":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Dog",
                "Cow",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of these animals?</span></div></span></div>",
            "created":1500958800,
            "id":2359149,
            "title":"Other"
        },
        "1452":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Summer",
                "Marie",
                "Your maid is a different cow"
            ],
            "content":"<div class=\"\"><div> <span>Which one is your bovine maid?<br>\r\n<br>\r\nSummer Thompson is a twenty five year old black and white furred cow. She is tall and has a killer hourglass figure and often finds any excuse she can to bend over so her ass is exposed towards you or you can see right down into the canyon of her cleavage.<br>\r\n<br>\r\nMarie-Louise Fouché is a nineteen year old cow with tan colored fur. She emigrated from France about two years ago and has worked for your family for much of that time. Her body is extremely fat due to her nature as a gourmand, but despite her size she is still quite agile. You often find yourself recruited to help feed her ravenous appetite.</span></div></div>",
            "created":1521435600,
            "id":2466603,
            "title":"Your cow of a maid"
        },
        "14523":{
            "choices":[
                "Annabelle ",
                "Something else. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Annabelle is an older cow, sure. But still has plenty of milk for you her \"baby\". When she's around she insists on doing almost every thing for you. This includes giving you milk.</span></div></span></div>",
            "created":1521435600,
            "id":2466605,
            "title":"Your maid is a different cow"
        },
        "1453":{
            "choices":[
                "Reptile",
                "Bird",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about something not mammalian. She was </span></div></span></div>",
            "created":1501736400,
            "id":2364084,
            "title":"Other"
        },
        "14531":{
            "author_id":"ashcrimson",
            "author_name":"AshCrimson",
            "choices":[
                "Snake",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of reptile</span></div></span></div>",
            "created":1509080400,
            "id":2407216,
            "title":"Reptile"
        },
        "145312":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Dragon",
                "Lizard"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a dragon or a lizard</span></div></span></div>",
            "created":1512795600,
            "id":2425920,
            "title":"more maid"
        },
        "15":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Rachel",
                "Ashley",
                "Hana",
                "Lilly",
                "More maid options"
            ],
            "content":"<div class=\"\"><div> <span>How about one of these maids.<br>\r\n<br>\r\nRachel 21<br>\r\n5'8\" , dirty blond hair, D cup breasts, and a large size but<br>\r\n<br>\r\nRachel took this job, because she found your add in the <br>\r\nPaper, and in 2 yeas she has been working with you <br>\r\nFamily, you've learned that she is easy going and nice, <br>\r\nAnd has a lot of kinks and fetishes. You know because <br>\r\nShe will ask you to do them with her.<br>\r\n<br>\r\nAshley 35<br>\r\n5'8\", black hair, C cup breasts, and a normal size but<br>\r\n<br>\r\nAshley took the maid job to help fund her hobbies<br>\r\nLike hiking, camping, and other outdoor stuff.<br>\r\n<br>\r\nHana 31<br>\r\n<br>\r\n5'11\" , dark brown hair, D cup breasts, and large but<br>\r\n<br>\r\nHana is a nice maid who's bean working with your family for<br>\r\nAbout 10 years now. You do get tired of her calling you her <br>\r\nBaby and treating you more like a child rather than a teen,<br>\r\nBut you get over that quickly because she is always nice to <br>\r\nYou.<br>\r\n<br>\r\nLilly 24<br>\r\n<br>\r\n5'5\" , blond hair, C cup breasts, regular sized but<br>\r\n<br>\r\nYou don't know much about her because she was <br>\r\nHired on only a month ago</span></div></div>",
            "created":1478408400,
            "id":2233648,
            "title":"More maids"
        },
        "151":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Trying A new fetish",
                "Trying A new fetish",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You wake up on Sunday morning. It a beautiful<br>\r\nDay outside for the first week of summer vacation.<br>\r\nYour mom and sister had left on their trip last night,<br>\r\nAnd now it was just you, and the maid.<br>\r\n<br>\r\n*knock knock knock* \"come in\" you say while yawning<br>\r\nA bit. Your maid Rachel comes in. \"Good morning nick.<br>\r\nIt's a nice day today isn't it.\" She said walking over <br>\r\nAnd grabbing your laundry off the floor, giving you a <br>\r\nAmazing view of her nice big ass. \"It sure is a nice day\"<br>\r\nYou say fully awake now. <br>\r\n<br>\r\nRachel stands back up turns to you. \"So nick. I was <br>\r\nThinking about doing something today.\" \"And what <br>\r\nWould that be?\" You ask knowing what it might be <br>\r\n\"Well. I was thinking of...\"</span></div></div>",
            "created":1505883600,
            "id":2388429,
            "title":"Rachel"
        },
        "1511":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Role play ",
                "Scat/water sports ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I was thinking about trying a new fetish, and I <br>\r\nThought you might want to try it with me.\" She<br>\r\nSays giving you a little smile. \"What were you<br>\r\nThinking about trying Rachel?\" You asked <br>\r\nStaring a her big sexy boobs. Rachel then said.<br>\r\n\"How about...\"</span></div></div>",
            "created":1505970000,
            "id":2388815,
            "title":"Trying A new fetish"
        },
        "15112":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Eat her scat in bed",
                "Have it at the dining table"
            ],
            "content":"<div class=\"\"><div> <span>\"How about scat and water sports? I know you've <br>\r\nSaid it kinda freaked you out to play with, and eat<br>\r\nMy poop, but I thought you might want to give it <br>\r\nA try now.\" <br>\r\n<br>\r\nYou're still not to sure about it, but for some reason,<br>\r\nToday you decide to say yes. \"Ok Rachel. I'll try it.\"<br>\r\nRachel then drops the laundry in her arms, and <br>\r\nComes over to give you a big hug. \"Thank you <br>\r\nNick for trying this! You just made me the happiest <br>\r\nWoman in the country!! *pffffttt* sorry nick. That <br>\r\nWas the loaf in the oven. I think it's almost ready to<br>\r\nCome out, I've been baking it for 4 days just for <br>\r\nYou.\" Wait. Did she just say 4 days worth of shit?<br>\r\nCould you really handle that much? You were <br>\r\nAbout to say something, but when you looked in<br>\r\nHer eyes, she just seemed so happy, and you <br>\r\nDidn't want to break her heart after getting her hopes<br>\r\nUp.<br>\r\n<br>\r\n\"Ok. How do you want to do this?\" You say, accepting<br>\r\nThat you were now going to eat her shit. \"Well, I was <br>\r\nThinking to serve you breakfast in bed. Or if you want,<br>\r\nI could poop on a plate and serve it to you at the <br>\r\nDining table. You can pick witch ever one you want.\"</span></div></div>",
            "created":1505970000,
            "id":2388831,
            "title":"Scat/water sports "
        },
        "151122":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                " \"I'm feeling good. Let's try something else.\"",
                "\"I'm not feeling to good.\""
            ],
            "content":"<div class=\"\"><div> <span>\"I guess I'll eat it at the table. I probably don't <br>\r\nWant to spill any on my bed.\" Rachel then <br>\r\nGave you a kiss on the lips, taking you by <br>\r\nSurprise. \"Trust me, you're going to love this.\"<br>\r\n<br>\r\nLater that morning you were sitting at the <br>\r\nDining table, while Rachel makes her self a <br>\r\nBreakfast of eggs, sausages, and toast. She<br>\r\nThen sets her plate on the table at her spot. <br>\r\nThen she grabs another plate from the <br>\r\nCounter, and places it on the ground. Rachel<br>\r\nThen takes off her panties and throws them <br>\r\nInto the other room. Then she squats over <br>\r\nThe plate and says. \"You're so lucky Nick. Not<br>\r\nEvery one gets to eat fudge for breakfast.\" You <br>\r\nThen look over at Rachel's bottom the head of<br>\r\nA turd coming out, and finally making contact <br>\r\nWith the plate. Rachel moves her big beautiful<br>\r\nAss around to coil the shit around on the plate.<br>\r\nThat shit must have been at least 2 feet long.<br>\r\nIt looked solid, and it was thick.<br>\r\n<br>\r\nBy the Time the last of her shit left her ass. <br>\r\nAll that was left was a big pile of shit on a <br>\r\nPlate. Rachel the picks the plate off of the floor, <br>\r\nAnd places the plate in front of you. It smelled<br>\r\nBad, but not all that unpleasant. <br>\r\n<br>\r\nRachel then hands you a spoon. \"You have a <br>\r\nLot to eat nick. I'd recommend eating it while<br>\r\nIt's still hot. Also, this is in case you get thirsty.\"<br>\r\nShe then grabs a glass off the counter and <br>\r\nBrings it to her pussy, then a stream of golden <br>\r\nPiss starts to fill the glass, and takes about 15 <br>\r\nSeconds to fill it up. \"Her you go. I hope you <br>\r\nEnjoy your breakfast. I made it all for you nick.\"<br>\r\nRachel said in a sexy tone. \"Thanks, I guess.\"<br>\r\nWas all you could say.  You then stick your<br>\r\nSpoon into the pile of scat on your plate, and <br>\r\nBring it to your mouth, and without hesitation.<br>\r\nYou plop it in your mouth, and as you expected.<br>\r\nIt tasted like shit, but for some reason. You weren't <br>\r\nGagging that much. You gave it a couple of chews, <br>\r\nAnd it was pretty gross. You then swallowed bit of<br>\r\nShit in your mouth. It went down easier than you <br>\r\nThought it would. You grab another spoon full and<br>\r\nRepeat the proses over and over again. Occasional <br>\r\nTaking a sip of piss to wash every thing down.<br>\r\n<br>\r\nIt took you about 10 minutes, but you finally finished<br>\r\nThe plate of shit I front of you, and you felt pretty full.<br>\r\n\"How was you breakfast nick?\" Rachel asked you.<br>\r\n\"It tasted like shit, and I felt like throwing up a few <br>\r\nTimes, but by the end I was able to eat it pretty easily.\"<br>\r\nYou say trying to lick the shit out of your mouth. <br>\r\n\"So nick. What are you feeling like now?\" You think <br>\r\nAbout it and say...</span></div></div>",
            "created":1506488400,
            "id":2392500,
            "title":"Have it at the dining table"
        },
        "1511221":{
            "author_id":"hitman1996",
            "author_name":"Entei211",
            "choices":[
                "Kiss her butt",
                "Smell her farts"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm feeling good. Let's try something else\" you said and then she smiled in joy and then asked you what you would like to do next that related to fetishes but what do you choose</span></div></span></div>",
            "created":1527051600,
            "id":2497793,
            "title":" \"I'm feeling good. Let's try somet..."
        },
        "15113":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Let's go with animal sex",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"You do own a horse. How about we try<br>\r\nAnimal sex today.\"<br>\r\n<br>\r\nStick with this? or try something else. </span></div></span></div>",
            "created":1508821200,
            "id":2405734,
            "title":"Something else"
        },
        "1512":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Whatever you want",
                "How about a 3 way",
                "Another option"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I want to try a new fetish.\" Said Rachel.<br>\r\nYou then say to her. \"What do you want<br>\r\nTo do?\" Rachel walks over to you and <br>\r\nSaid.</span></div></span></div>",
            "created":1508821200,
            "id":2405727,
            "title":"Trying A new fetish"
        },
        "15123":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Vore",
                "Eproctophilia (fart fetish)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her stomach rumbles loudly and she looks with sultry eyes.<br>\r\n\"Found this new fetish called...\"</span></div></span></div>",
            "created":1512363600,
            "id":2424024,
            "title":"The guts for a new fetish"
        },
        "151231":{
            "author_id":"dunamis",
            "author_name":"Jameskii",
            "choices":[
                "\"How about you carry me to the table, sit me on a pot, and prep me for dining?\"",
                "\"How about I give your buns some loving?\""
            ],
            "content":"<div class=\"\"><div> <span>\"I can't believe I'm about to say this.  I was thinking of trying out some vore fetiches. I'd like to know what it's like to have a young man side down my gullet, and give me a big belly. Maybe I can let you ride inside my belly as I do some chores! Yeah, that sounds nice!\"<br>\r\n<br>\r\nAfter she said that those words, it gave you a small tingle of goosebumps all up and down your spine. She was wanting to Swallow you alive, and let you spend all day in her slimy, drippy, mushy stomach. Who knows if she'd digest you or not! Maybe she has a way to keep you safe. That's when an spark of inspiration came. Maybe you could see what it's like to be a living buttplug. With your face as the part near her cheeks! There was only one way to know what she'd say.</span></div></div>",
            "created":1586811540,
            "id":2818323,
            "title":"A different slide"
        },
        "153":{
            "choices":[
                "\"Is baby hungry?\"",
                "\"Dose baby need to go potty?\"",
                "\"Dose Baby need a new diapee?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Baby!\" A sing-song voice called from the doorway that you tried to hide under the sheets from, and groan a bit. <br>\r\n\"Now now, c'mon be a good boy and get up.\" Slowly you sign up and face your bright room with messy hair as Ms.Hannah smiles at you from the doorway, slowly you climb out of bed, having been made to wear a set of red footie pajamas that Mary got you so you didn't hurt her feelings. She smiled and asked </span></div></div>",
            "created":1500354000,
            "id":2355531,
            "title":"Hana"
        },
        "1532":{
            "author_id":"juniorm",
            "author_name":"juniorm",
            "choices":[
                "pee",
                "poop",
                "diarrhea "
            ],
            "content":"<div class=\"\"><div> <span>To your embarrassment, you did need to relieve yourself. But, ever since your wealthy parents left you in the care of Hana for the summer, you;ve had to do what she instructed, which included her close supervision in the commode. She never gives you any privacy, making every trip to the can a demeaning, awkward experience.<br>\r\n<br>\r\nShe takes your hand and leads you down the hall of the mansion to the closest marble tiled bathroom. She unzips the back on the red footed jammies and pulls them down leaving you in nothing but a pair of white Hanes briefs. You blush a bit. You've been wearing boxer shorts since 7th grade, but Hana insisted on throwing out every pair you owned, insisting they were all too stained for the young master of the house. She replaced them all with these embarrassing tighty whities, and would regularly make you submit to inspections to ensure you weren't making any skid marks for her to have to bleach out later.<br>\r\n<br>\r\n\"Okay little man, what do you have to do?\"</span></div></div>",
            "created":1500440400,
            "id":2355935,
            "title":"\"Dose baby need to go potty?\""
        },
        "15321":{
            "choices":[
                "You accidently reply in the baby-talk she uses so often",
                "\"Actaully- I had plans today...\""
            ],
            "content":"<div class=\"\"><div> <span>\"Just number 2...\" you mutter, but Hana sits you on the toilet as if you had said 'one'. She even straps you in using a lap-buckle, something you hadn't used since you were potty training.<br>\r\n\"Now baby can go peepee nice and safely.\" She cooed and started to run you a bath nearby. \"And then after the tubby we can have some numnums for breakfast, dose baby like that?\"</span></div></div>",
            "created":1500872400,
            "id":2358537,
            "title":"pee"
        },
        "153211":{
            "choices":[
                "Was wiping your butt for you",
                "Was undressing you for the tub."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Yeah I want some numnums-\" you reply and quickly cover your mouth in embarrassment.<br>\r\nThe maid just giggled and pinched your cheeks \"good boy.\" And before you knew it she..</span></div></span></div>",
            "created":1501563600,
            "id":2363018,
            "title":"You accidently reply in the baby-talk she uses ..."
        },
        "1532111":{
            "author_id":"dududududuidid",
            "author_name":"Someguy",
            "choices":[
                "Pull ups/toddler clothes  ",
                "Underwear/teenager clothes "
            ],
            "content":"<div class=\"\"><div> <span>after your done with you bussiness, Hana unbuckled you and says \"oooh, looks like baby needed to go poopy after all\" she then pulls out some baby wipes and wipes you down.<br>\r\n<br>\r\nAfter the wiping is done, Hana undressed you for your bath, you've gotten use to being naked in front of her, this had all become routine. During your bath she makes you play with a rubber duck and some other baby bath toys for 20 minutes before she finally washes you, afterwards she picks you up and dries you off with an Elmo towel, you had been forced to watch a lot of Sesame Street this summer.<br>\r\n<br>\r\n\"now that baby is all dry let's get you into your clothes for the day\" she coes<br>\r\n<br>\r\nWhat do you wear?<br>\r\n<br>\r\n</span></div></div>",
            "created":1503205200,
            "id":2372235,
            "title":"Was wiping your butt for you"
        },
        "15321111":{
            "choices":[
                "Give you something to play with as she insists on dressing you ",
                "Tells you the plans for today"
            ],
            "content":"<div class=\"\"><div> <span>She already had the outfit laid out on your bed: the pull up is blue with a stripped red t-shirt, and a pair of overalls with big pockets you can only guess already hold a few \"treats\" for you. You go to start putting on the pull-up, only for Hanna to</span></div></div>",
            "created":1503205200,
            "id":2372238,
            "title":"Pull ups/toddler clothes  "
        },
        "153211111":{
            "author_id":"dududududuidid",
            "author_name":"Someguy",
            "choices":[
                "In a high chair",
                "Bottlefed on a rocking chair"
            ],
            "content":"<div class=\"\"><div> <span>\"Silly baby, you don't dress yourself, you are far to little\" Hannah said, handing you a rattle, play wth this.\" You shake the rattle in order to get her to move on. She has you step in the pull up, then remarks how cute you look.<br>\r\n<br>\r\n\"Why do I have to wear a pull up\" you ask<br>\r\n<br>\r\n\"Well, baby thought he had to go pee pee but also had to poo poo this morning and with a mistake like that I don't think we can trust you\" she responded. She moves on to the shirt and overalls and finally your dressed.<br>\r\n<br>\r\n\"Aw you are adorable baby, let's get you breakfast\"<br>\r\n<br>\r\nHow does feed you?</span></div></div>",
            "created":1504846800,
            "id":2382577,
            "title":"Give you something to play with as she insists ..."
        },
        "1532111111":{
            "choices":[
                "Watch the Mr. Neighbor show with your complete attention. So you're spoonfed",
                "You half-Watch the show as you feed yourself."
            ],
            "content":"<div class=\"\"><div> <span>Its not exactly a high chair, as you're too tall for it. But you are seated in a dining room chair with a seat belt. You have a bin tied around and just sigh as a bowl of mush is placed before you. <br>\r\nYou know better than to ask for a solid good that would invole chewing unless its naturally soft she always says. \"Now, now, you might choke.\" And proceeds to below on the food for you. Sometimes you can get away with spooning it in yourself. Th maid put some children's show on a t.v. where a man in a sweater talks calmly and caring. <br>\r\nYou...</span></div></div>",
            "created":1504846800,
            "id":2382584,
            "title":"In a high chair"
        },
        "15321111111":{
            "choices":[
                "Starting to suck your thumb and play with the toys",
                "Very bored "
            ],
            "content":"<div class=\"\"><div> <span>\"Hello boys and girls,\"says the man on t.v.. His calm voice is relaxing. You cant help but give him your full attention <br>\r\n\"Today we are going to learn about-\"you miss the topic as Hannah out a spoonful of food in your mouth. You chew and swallow, going back to the t.v. \"-That means we have to be nice to people.\" Says the tv, \"especially those who take care of us, they help us with anything and everything. Like your parents or a nanny. It's not nice to be mean to them. So you be good boys and girls and if you listen to them they'll listen back.\"The tv man said before going on to teach something about colors. You hardly notice you're nearly slack-jaw as your drawn into the show. The bib was a good thing to have then.<br>\r\n\"All done!\" Hanna says. Before you know it, she takes a wet cloth to your face and you find yourself seated on the floor,this time in the living room where safe toys around you and a stop motion animated show on the big tv. You find yourself </span></div></div>",
            "created":1504933200,
            "id":2383276,
            "title":"Watch the Mr. Neighbor show with your complete ..."
        },
        "153211111111":{
            "author_id":"juniorm",
            "author_name":"juniorm",
            "choices":[
                "a boy from your class",
                "a girl from your class"
            ],
            "content":"<div class=\"\"><div> <span>This isnt so bad. You can play with action figures all day while this hot woman caters to your every whim. Sure the toddler clothes were embarrassing, but you were safe in your home and no one would see you.<br>\r\n<br>\r\nAs you suck your thumb, you are startled by the sound of the door bell.<br>\r\n<br>\r\n\"Come in!\" Hannah cries from the kitchen.<br>\r\n<br>\r\nBefore you can react, the door swings open and in walks-</span></div></div>",
            "created":1505106000,
            "id":2384039,
            "title":"Starting to suck your thumb and play with the toys"
        },
        "1532111111111":{
            "choices":[
                "Someone whose accepted being treated like a baby",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"One of your little friends came to play, isn't that nice baby?\" Hanna asked as you continue to play, almost not noticing. You busy yourself with toys until they sit down and its </span></div></span></div>",
            "created":1505106000,
            "id":2384122,
            "title":"a boy from your class"
        },
        "15321111111111":{
            "author_id":"diaperss",
            "author_name":"diaperss",
            "choices":[
                "Pee your Pull Up as well",
                "Go tell Hana what happened",
                "Just keep playing"
            ],
            "content":"<div class=\"\"><div> <span>Your friend Josh sits down next to you, wearing a similar toddler outfit and a Pull Up Hana gave him when he arrived. The two of you start playing with the toys until you notice Josh squirming uncomfortably. Before you can ask what's wrong he adjusts his position and begins to pee. You see the Pull Up beginning to get swollen and create an obvious bulge under Josh's overalls.<br>\r\n<br>\r\n''That's better'' he says and lets out a sigh of relief, continuing to play with the toys. Do you...</span></div></div>",
            "created":1543122000,
            "id":2581744,
            "title":"Someone whose accepted being treated like a baby"
        },
        "153211111111113":{
            "choices":[
                "Diapees ",
                "Something else/worse"
            ],
            "content":"<div class=\"\"><div> <span>You're unsure what to do. You find it a little weird Josh is so calm about it. But at the same time you're more embarrassed for him. You try to ignore it and keep playing. If Hannah found either of you had used your pull ups that much shed change both of you into </span></div></div>",
            "created":1543122000,
            "id":2581760,
            "title":"Just keep playing"
        },
        "1532111111111131":{
            "author_id":"diaperss",
            "author_name":"diaperss",
            "choices":[
                "You pee in the Pull Up (on purpose)",
                "You have an accident",
                "You keep holding it "
            ],
            "content":"<div class=\"\"><div> <span>You and Josh keep playing, he still doesn't seem to mind the wet Pull Up. You play for a while longer until you also need to pee, Josh notices you squirming and pressing your crotch. ''You're wearing a Pull Up, just go in it'' he chuckles. You blush, even the thought of wetting the Pull Up is embarrassing and you know Hannah will most likely have you wear an actual diaper instead of a Pull Up if you do.<br>\r\n<br>\r\nBut soon the need to pee grows even stronger and your desperation multiplies. What happens then?</span></div></div>",
            "created":1543122000,
            "id":2581816,
            "title":"Diapees "
        },
        "15321111111111313":{
            "choices":[
                "Standing up opens your flood gates",
                "You start finding the bathroom."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're still trying to hold it as you stand up from the toys. Maybe you could make it to the bathroom you think,</span></div></span></div>",
            "created":1543122000,
            "id":2581817,
            "title":"You keep holding it "
        },
        "153211111111113131":{
            "author_id":"diaperss",
            "author_name":"diaperss",
            "choices":[
                "She checks if either of you needs a change",
                "She tells it's time for your feeding",
                "Josh tells her both of you peed "
            ],
            "content":"<div class=\"\"><div> <span>You decide now is the time to go to the bathroom. But unfortunately standing up causes your floodgates to open and you're no longer able to hold it. You feel the warmth spreading across your crotch as the pee flows into the Pull Up, which now sags heavily under your overalls. Your face gets even more red as you realize what's happening. Josh also realizes what's going on and chuckles a bit ''Well it wasn't that bad, was it?''<br>\r\n<br>\r\nRight after you've stopped peeing Hannah enters the room. ''Just checking on my two baby boys'' she coos. What happens next?</span></div></div>",
            "created":1543122000,
            "id":2581822,
            "title":"Standing up opens your flood gates"
        },
        "1532111111111131311":{
            "choices":[
                "She grabs supplies to change you right in front of your friend ",
                "She takes your friend or a diaper change first "
            ],
            "content":"<div class=\"\"><div> <span>You've almost gotten used to her hourly checks and almost hourly trips to the bathroom. Maybe that's why you had to go so badly.<br>\r\n She checks you first, \"uh-oh,\" she said, \"Nanny didn't make sure baby had a diapee on and he went peepee, didn't he?\" <br>\r\nA little red you nod sadly. She was never upset with you. <br>\r\n\"You stay right here then.\"</span></div></div>",
            "created":1543122000,
            "id":2581823,
            "title":"She checks if either of you needs a change"
        },
        "15321111111111313111":{
            "author_id":"diaperss",
            "author_name":"diaperss",
            "choices":[
                "Baby diaper",
                "Adult diaper",
                "Adult diaper with babyish prints "
            ],
            "content":"<div class=\"\"><div> <span>She puts a changing mat on the living room floor and takes out a pack of baby wipes, some baby powder and a toy to distract you with during the change. ''What? Y-you can't change me in front of Josh??!!'' you protest. But Hannah just holds you down on the changing mat and begins to undo your overalls, exposing your soaked Pull Up. ''Uh oh, baby did a big wee wee!'' she coos and tears the sides of the Pull Up so she can take it off you. <br>\r\n<br>\r\nYou see Josh sitting and watching with a smile on his face, much to your embarrassment. Hannah wipes you and sprinkles baby powder on your parts, she then takes out a _____ and starts putting it on you.</span></div></div>",
            "created":1543122000,
            "id":2581824,
            "title":"She grabs supplies to change you right in front..."
        },
        "153211111111113131113":{
            "choices":[
                "A new outfit for you",
                "A very large bottle "
            ],
            "content":"<div class=\"\"><div> <span>You were just a bit too big for real baby diapers, but that doesn't mean you weren't still her baby. She even pulls out some rubber underwear in case you might leak out from the diaper which adds to the thickness. You start to sit up when you thinks she's done only see she has pulled out </span></div></div>",
            "created":1543122000,
            "id":2581827,
            "title":"Adult diaper with babyish prints "
        },
        "1532111111111131311131":{
            "author_id":"diaperss",
            "author_name":"diaperss",
            "choices":[
                "Feed you two",
                "Put you two for a nap ",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>She pulls out a onesie that babies wear, this one is just in bigger size. She puts it on you and buttons it up before she moves over to Josh and checks him. ''Uh oh, looks like the other baby made a wee as well'' she coos. Josh gets on the changing mat and Hannah begins to change him into a similar diaper that you're wearing. He doesn't seem to be embarrassed at all, he even smiles happily and giggles a bit when Hannah wipes him and puts the diaper on. <br>\r\n<br>\r\nShe also has a new outfit for Josh, replacing his overalls with a pair of shorts and a baby blue shirt. The shorts don't do a good job hiding the diaper, there's an obvious bulge under them and the waistband can be seen sticking out of the shorts.<br>\r\n<br>\r\nNow that you both have been changed into new, dry diapers Hannah says it's time to...</span></div></div>",
            "created":1543122000,
            "id":2581830,
            "title":"A new outfit for you"
        },
        "15321111111111313111311":{
            "choices":[
                "Mush baby food",
                "Formula "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She walks you back to your special dining chair and straps you in at the table before getting a simlair chair ready for Josh. Today's lunch is </span></div></span></div>",
            "created":1543122000,
            "id":2581839,
            "title":"Feed you two"
        },
        "153211111111113131113111":{
            "author_id":"diaperss",
            "author_name":"diaperss",
            "choices":[
                "Hannah plays with you",
                "It's nap time",
                "You or Josh need to poop "
            ],
            "content":"<div class=\"\"><div> <span>Hannah gives you both a bib and begins to feed you mushed baby food. You're not exactly happy about the meal, you'd prefer some real food but since you're hungry you eat it anyway. Afterwards Hannah gives both you and Josh a bottle and puts you back to play while she does the dishes.<br>\r\n<br>\r\n''You seem to be enjoying this'' you say to Josh as you play. ''Yeah I sure do, I mean what's not to like? I can just be carefree and not worry about anything'' he says. You admit he has a point but you still can't help feeling embarrassed, especially about the diapers. Next...</span></div></div>",
            "created":1543122000,
            "id":2581844,
            "title":"Mush baby food"
        },
        "1532111112":{
            "choices":[
                "Have come to like the taste ",
                "Try to leave the room "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She takes your free hand and walks you carefully to a corner of the room where an old, passed rocking chair sat. She sit down in and sets you on her lap as she pulls out a bottle of thick formula, you're ashamed to say you</span></div></span></div>",
            "created":1505278800,
            "id":2385134,
            "title":"Bottlefed on a rocking chair"
        },
        "1533":{
            "author_id":"dramaticadagi",
            "author_name":"DramaticAdagio",
            "choices":[
                "Were still dry",
                "Had soaked your diaper",
                "Messed your diaper"
            ],
            "content":"<div class=\"\"><div> <span>Hearing what she said, you immediately felt a blush dust over your face. You see, ever since your mother left she had been forcing you to wear diapers. For what reason, you weren't sure. It did make you increadibly embarrassed, but there wasn't much you could do about it. You sighed before getting out of bed and taking off your footie pajamas, leaving you in nothing but the increadibly thick night time diapers you were required to wear to bed. She walked over and checked the diaper and found that you...</span></div></div>",
            "created":1556600400,
            "id":2652831,
            "title":"\"Dose Baby need a new diapee?\""
        },
        "15332":{
            "author_id":"crowen",
            "author_name":"Crowen",
            "choices":[
                "She puts you in a highchair",
                "She put you in a playpen "
            ],
            "content":"<div class=\"\"><div> <span>You blush as red as a tomato when you realize you're soaked. \"Aww, baby wet his dapie! Well, lay down now.\" She said, gently nudging you onto the bed. You lay down as she reaches for another diaper. \"Butt up baby!\" She called in a sing song voice. Blushing you obliged as she placed the diaper underneath you. After taping it, she picked you up and carried you downstairs </span></div></div>",
            "created":1603993260,
            "id":2931295,
            "title":"Had soaked your diaper"
        },
        "154":{
            "choices":[
                "Walking around in very loose shorts and nothing else.",
                "Talk to her about something sexual.",
                "More I deas on how to seduce her....."
            ],
            "content":"<div class=\"\"><div> <span>Lilly was a real short girl, she only stood about 4 foot.<br>\r\n<br>\r\nShe reminded you of a midget but well built for such a small woman, Lilly had only been hired a month ago and so I really don't know a whole lot about her, not to mention that she really doesn't talk about herself to terribly much.<br>\r\n<br>\r\nOne day after my mother and sister went away on their vacation, I snooped on Lilly as she was taking her shower in the morning.<br>\r\nI thought I could see something that I could jerk off to in my months spent with her but I was surprised and shocked and I have to admit... really turned on by seeing Lilly step out of the shower reaching for the towel to dry off with and my eyes locked onto a penis, LILLY HAS A PENIS ...I thought to myself, my own penis burst to life and was crammed into a very tight confined pair of briefs.<br>\r\n<br>\r\nI don't know why I was turned on by Lillys small penis, I guess it was so attractive on such a short woman but I knew that I wanted to see it up close real soon.<br>\r\n<br>\r\nI had to try and seduce this short woman somehow and see if she would take a chance with me, so I decided to try and seduce her by ..........</span></div></div>",
            "created":1503118800,
            "id":2371675,
            "title":"Lilly"
        },
        "1541":{
            "choices":[
                "Lilly helps you by ....",
                "Lilly sits back up and spreads out on the couch.",
                "You do something real fast"
            ],
            "content":"<div class=\"\"><div> <span>I decided to start walking around the house in very loose shorts, they were actually a size to big for me and I had cut them from knee length to mid thigh length.<br>\r\n<br>\r\nI would walk around the house and :drop: something when I was in front of her or lay down on the floor acting like I was watching tv swinging my legs back and forth showing off my balls to her, the first time I looked around my shoulder I caught her staring at my shorts and looked to see that her shorts were actually a little more bulged ....<br>\r\n<br>\r\nI then decided to sit on the couch with her, I scooted to the other end of the couch and drew my legs up to my chest letting my smooth balls drop out of the side of the shorts.<br>\r\n<br>\r\nI had an idea ... \"Lilly, I think I caught a splinter in my foot this morning, could you have a llok at it and help me out please ? \"<br>\r\n<br>\r\nLilly had agreed and lay down across the couch and was eye level with me foot, she was looking directly at my balls and I heard her sniffing a lot, Lilly then brushed my balls with her hand accidently as she was picking up my foot to inspect it...<br>\r\n<br>\r\nI looked right into Lillys eyes when I said \" Lilly if you could help me feel better, I would do anything for you \"  Lilly looked up into my eyes and again I said \" ANYTHING LILLY...ANYTHING \"</span></div></div>",
            "created":1506834000,
            "id":2394980,
            "title":"Walking around in very loose shorts and nothing..."
        },
        "155":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "jean",
                "susan",
                "other maids"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>jean a black hair emo type I with double d and nice butt and just does not care what happens <br>\r\n<br>\r\nsusan a blonde hair with lots of energy and willing to try anything with double d chest and plump ass</span></div></span></div>",
            "created":1483074000,
            "id":2256757,
            "title":"More maid options"
        },
        "1553":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Angela ",
                "Other maids",
                "Other maids"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Angela<br>\r\n5'9,  brown hair,  DD breast,  big ass with plump thighs <br>\r\n<br>\r\nTook the job since she needed the money to pay off her dept and has been working for your family for 5 years now</span></div></span></div>",
            "created":1486875600,
            "id":2276532,
            "title":"other maids"
        },
        "15531":{
            "choices":[
                "Breakfast is ready ",
                "Shower "
            ],
            "content":"<div class=\"\"><div> <span>Angela is actually familar with your family. She has been family friends for years and she is 28. She was even at one point your babysitter when you were really little. Like a baby. She went off to colledge for a few years and now is workinh for the family again to help with student loans. You have feelings for her but occasionally she still calls you baby. you wake up. </span></div></div>",
            "created":1516856400,
            "id":2444833,
            "title":"Angela "
        },
        "155312":{
            "choices":[
                "Breakfast is ready ",
                "Arguw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You go in to take a shower and angela walks in to pick up everything. She looks and you and says good morning. You scream and say what the hell. Angela chuckles. Its ok baby its not like i havent seen it before. I thought you wouldnt mind. </span></div></span></div>",
            "created":1516856400,
            "id":2444835,
            "title":"Shower "
        },
        "1553122":{
            "choices":[
                "You finish and get dressed",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>What do you mean i wouldnt mind. Of course i mind. Im older now and its embarssing. U<br>\r\n<br>\r\nAngela- awww its ok baby ive practically taken care of you forever. Im also studying psy so i know at your age your easily embarrassed. <br>\r\n <br>\r\nYou say- im older now so why are you still calling me that? And you wouldnt be embarrassed if i walked in on you naked?<br>\r\n<br>\r\nAngela- she giggles. I understand baby how you feel. But you will always be my baby. No matter how old u get. Besides you are still very cute. Now finish your shower and come downstairs.</span></div></div>",
            "created":1517029200,
            "id":2445571,
            "title":"Disagree"
        },
        "15531222":{
            "choices":[
                "Deal",
                "Need more detail"
            ],
            "content":"<div class=\"\"><div> <span>After the shower you dry off and go to your room. You wrap yourself in a towel and as you walk in you see angela. Long dark hair with curvey C breast and just a gorgeous body. She looks at you and smiles. Oh and shes in a robe.<br>\r\n<br>\r\nAngela- listen i know you really didnt mind.<br>\r\n<br>\r\nHow?<br>\r\n<br>\r\nAngela- you didnt cover to well and you are not right now.<br>\r\n<br>\r\nYou look down and go completely red. As you try to cover up.<br>\r\nShe giggles. Its ok baby. You dont have to. When you were a baby you got hard for me to back then. <br>\r\nYou blush even brighter. <br>\r\nAngela- look i dont want any more incidents or arguments with you. I haven't babysat in a while either. I know you like me. So how about i take care of you again like i use to. In exchange you will never have to be embarrased with me ever again and u will like it.</span></div></div>",
            "created":1517029200,
            "id":2445580,
            "title":"Other "
        },
        "155312222":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Yes, you can touch me and even have sex if you want",
                "Yes, but no sex ",
                "Readers choice "
            ],
            "content":"<div class=\"\"><div> <span>I’m going to need more details on this<br>\r\n<br>\r\nAngela- I see how you look at me and don’t think I haven’t notice my missing bra. If you let me take care of you how I use to I’ll let you explore my body <br>\r\n<br>\r\nAngle unties her robe, she’s wearing a black DD bra with pink lacing and matching panties that hug her thighs<br>\r\n<br>\r\nSo if I let you take care of me, I get to basically do what I want with you afterwards?</span></div></div>",
            "created":1553835600,
            "id":2636987,
            "title":"Need more detail"
        },
        "15532":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Ann",
                "Kelly"
            ],
            "content":"<div class=\"\"><div> <span>Ann: Fat woman with double L boobs, an ass double the size of her tits, and her belly bigger than both combined. A jolly woman that your mom found and helped her with the bills for the past four years.<br>\r\n<br>\r\nKelly: Muscular woman with unknown history over the past two years she had worked for your family. An eyepatch over her left eye, with black hair in a ponytail, and her pecs covering her modest D cup, she's quite the beauty. Due to certain details between her and your mother, she swore to protect you in any matter possible, even if it's inhumane.</span></div></div>",
            "created":1512363600,
            "id":2424038,
            "title":"Other maids"
        },
        "155321":{
            "author_id":"grumbleman",
            "author_name":"Grumbleman",
            "choices":[
                "Your room when Ann comes in to clean.",
                "Out at the pool while swimming."
            ],
            "content":"<div class=\"\"><div> <span>Your mother hired Ann when you were about twelve.  You're not really sure on the circumstances, something about being in financial trouble and jobless.  Your mother took Ann on as maid where she seemed to thrive.  Even at that young age, this enormous, jiggling and jolly woman had an effect on you (and apparently you on her).  The two of you get along quite well...more than well in fact given that over the years she's become somewhat...affectionate with you.<br>\r\n<br>\r\nIn private moments, often behind your mother's back, Ann will often hug you against her massive belly and gargantuan tits, playfully squeezing you against her and murmuring words about what a handsome young man you are becoming.  The Christmas after your sixteenth birthday, she caught you under the mistletoe and surprised you by being your first kiss.  Often times she will corner you in tight spaces to press her titanic wobbling body against you, practically burying you in it.  At first, you'd thought your mom would be upset if she ever caught Ann doing this sort of stuff, but on the contrary your mother found it hugely amusing and even encouraged things when she saw them.  You also are beginning to wonder if there's an ulterior motive at work here.  More than once, Ann has whispered in your ear about you marrying her \"when you grow up\".  Although her affection for you does seem genuine, this would also take care of her financial worries.<br>\r\n<br>\r\nSure, you're attracted to Ann as well, having always had a bit of a thing for larger women, although her affection can be a little overwhelming from time to time.  Also, while Ann can be rather bold with her advances, they've never gone too far given the presence of your family in the house.  With them gone, you begin to wonder just how far Ann might go...and how far you might go in response.<br>\r\n<br>\r\nStill, it's mere hours after your family has left that you have your first truly private encounter with Ann, but where does that happen?</span></div></div>",
            "created":1512709200,
            "id":2425447,
            "title":"Ann"
        },
        "15533":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Nikki",
                "More Other Maids"
            ],
            "content":"<div class=\"\"><div> <span>How about this Maid?<br>\r\n<br>\r\nNikki<br>\r\n28 years old, Asian, slightly taller than you and surprisingly strong, large breasts, short hair in a bun in the back. She's got a gentle personality, treats you like a little kids but teases sometimes. Her maid service specializes in keeping people in diapers. Hiring her was actually your sister's idea because you wet the bed a week before the left for Europe, but you don't mind because Nikki is pretty and you're not one to pass on being snuggled and cared for by a pretty girl.</span></div></div>",
            "created":1543208400,
            "id":2582182,
            "title":"Other maids"
        },
        "155331":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Put you in a bath tub",
                "Fresh diaper"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, Baby, it's time to wake up. Do you need a change?\" Nikki said.<br>\r\nYou sat up in bed, and saw your maid standing at your side. You were wearing only a thick white diaper. Nikki slid a finger down the front and saw that you were wet.<br>\r\n\"Hm, I suppose you do.\" Nikki said.<br>\r\nShe had laid down the rules for you yesterday, so you already knew to comply. Obediently, you laid down so Nikki could remove your soaked diaper, leaving you naked.<br>\r\n\"Any longer and it might have leaked...\" Nikki said.<br>\r\n<br>\r\nWhat does she do with you next?</span></div></div>",
            "created":1543208400,
            "id":2582185,
            "title":"Nikki"
        },
        "1553312":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Tasty baby food",
                "Breast Milk"
            ],
            "content":"<div class=\"\"><div> <span>Nikki slid a fresh diaper under your butt and wiped your damp crotch down with a wet wipe. Then she sprinkled you with some powder and expertly taped you up.<br>\r\n\"There you go! All done!\" Nikki said, proudly as she patted the front on your diaper.<br>\r\nYou sat up and readjusted your padded butt for comfort.<br>\r\n\"What do you say?\" Nikki said, smiling.<br>\r\n\"Thank you, Maid Nikki.\" You said.<br>\r\nShe giggled. It made her so happy to see you like this.<br>\r\n\"My, what a polite baby! I think you earned one Good Boy Point!\" Nikki said.<br>\r\nShe went over to a whiteboard on your wall and added a tally. You had four now. Good behavior earned you Good Boy Points that could be spent on... You weren't very sure what they were for, actually, but you were eager to find out.<br>\r\n\"Ooh, just one more to go before you earn a special surprise, Baby!\" Nikki said.<br>\r\nYou smiled. You liked to imagine it was something fun, maybe even a little bit sexy.<br>\r\n<br>\r\nNikki helped you to your feet and took you downstairs. It was time for breakfast now. She had been instructed to keep you eating nothing but baby food and breast milk. You didn't really mind the baby food, it was like regular food but mushier, and you'd eaten that last night, but you weren't sure you were ready for breast milk yet. It just seemed too weird and a little gross to you when she told you about it.<br>\r\n\"Now, Baby, I'm giving you a choice. You can either have some baby food in the highchair in the kitchen, or you can earn a Good Boy Point and suckle my breasts. What will it be?\" Nikki said.</span></div></div>",
            "created":1543208400,
            "id":2582342,
            "title":"Fresh diaper"
        },
        "15533122":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "You get Homemade Chicken Tenders for lunch later today",
                "Spend time with a diapered playmate"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I suppose I could give the breast milk a chance.\" You said.<br>\r\nNikki grew excited, practically jumping up and down with happiness.<br>\r\n\"Oh, yes! Good boy!\" She said.<br>\r\nThe maid sat down on your sofa and removed the straps on her maid gown, revealing a nursing bra beneath. She undid the flaps, revealing her large, luscious breasts. Your cock hardened at the sight, producing a visible bulge. Nikki took notice and giggled.<br>\r\n\"Now come on, baby, sit down on Maid Nikki's lap and drink up.\" She said.<br>\r\nObediently, you sat down and put your mouth to her nipple. Nikki wrapped her arms around you to hold you closer. Your cock grew harder, ready to burst at her slightest touch.<br>\r\n\"Aw, little baby likes my boobies, doesn't he?\" She giggled.<br>\r\nThey were indeed beautiful.<br>\r\n<br>\r\nYou suckled softly, letting her warm milk into your mouth. It was strange at first, but tasted surprisingly good. Nikki giggled as you did this. Nursing was incredibly pleasurable for her, and her breasts were feeling quite full since she hadn't pumped herself the previous night. It was a little bit relieving for her, in fact.<br>\r\n\"Good boy, drink it all up. There's plenty to be had.\" Nikki said smiling.<br>\r\nShe softly stroked your hair as she said this. After a few moments she motioned you to drink from her other breast. As you began suckling, she moved one of her hands to touch the front of your diaper, right on the bulge of your cock. At her slightest touch, you began ejaculating. It was so intense you had to stop suckling for a bit just to breathe. Nikki giggled.<br>\r\n\"Aw, made stickies in your diapee?\" She said.<br>\r\nYou nodded shamefully. This was the first time you'd done something like this for Nikki and you weren't sure how to feel about it, but you knew \"making stickies\" in a diaper probably wasn't something to be proud of. Nikki was smiling, though. She seemed pretty happy to have done this to you.<br>\r\n\"Aw, that's okay, Baby. Happens to almost every baby I care for. You can keep suckling if you want.\" She said.<br>\r\nYou did drink a little bit more of her warm breast milk, but only a little. You were feeling full. After a while you moved your head away from her breasts.<br>\r\n\"All done?\" Nikki asked.<br>\r\n\"Yeah...\" You said, still feeling ashamed of losing control of your cock.<br>\r\n\"All right!\" Nikki said, excitedly.<br>\r\nShe moved you off to the side, stood up, fixed her nursing bra and put the straps back on her maid's gown. She did notice you staring at your cum-filled diaper.<br>\r\n\"Aw, what's wrong, Baby?\" Nikki asked.<br>\r\n\"I don't know... well...\" You stammered.<br>\r\n\"Hey, hey, it's okay, Baby. Little boys can make all the stickies they want, it's not against the rules. It won't count against you for Good Boy Points.\" Nikki said.<br>\r\n\"It just feels... so...\" You said.<br>\r\n\"Humiliating?\" Nikki suggested.<br>\r\n\"I guess.\" You replied.<br>\r\n\"Baby, there's nothing to be ashamed of. That's just what boys do. Like I said, everyone I care for does it sooner or later.\" Nikki said.<br>\r\nYou felt a little bit better knowing you weren't the first one to do this in front of her. Nikki reassuringly patted your shoulder.<br>\r\n\"Now I can tell you what treat you earned with all your Good Boy Points!\" Nikki said.<br>\r\n<br>\r\nWhat did Nikki reward you with?</span></div></div>",
            "created":1543208400,
            "id":2582358,
            "title":"Breast Milk"
        },
        "155331222":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "You pooped your diaper",
                "Saya pooped her diaper"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, what did I earn?\" You asked, curiously.<br>\r\nNikki giggled.<br>\r\n\"Well, I invited my niece Saya over to play with you! She should be over shortly.\" Nikki said.<br>\r\nYour head swam for a moment. You weren't sure you were ready to meet a girl and have her find out about your diapers.<br>\r\n\"Does... does she know about...?\" You asked.<br>\r\nNikki giggled again and put her hand on your chest. She loved seeing you flustered.<br>\r\n\"Of course I told her! She's a diaper girl! My big sister homeschools her and she's been kept in diapers all her life. Never been potty trained, pretty much never allowed out of her house. This is the first time she's ever been allowed to play with a boy, you lucky baby, you!\" Nikki said.<br>\r\nYour anxiety was eased slightly, but you still felt uneasy about all this.<br>\r\n\"Well, can I put on some clothes at least? I'm practically naked and... and...\" You stammered.<br>\r\nYour diaper was still full of cum, after all, and you felt rather unclean.<br>\r\n\"Nope! You're staying in your diaper, little guy!\" Nikki said.<br>\r\nJust as she said this you heard a knock at the door.<br>\r\n\"Oh, that must be her right now! Come in, big sis! The door's unlocked!\" Nikki called out.<br>\r\nYou whimpered and tried to hide behind Nikki's gown.<br>\r\n<br>\r\nIn walked Nikki's big sister, a tall slightly chubby Asian woman wearing shorts, flip-flops, and a cute floral top. She looked to be a couple years older than Nikki. Behind her was a short teenage Asian girl, looking about your age, maybe a year younger. It was Saya. Saya had short hair, very small, almost flat breasts, and her skin seemed a shade darker than Nikki's. She was quite skinny and almost sickly looking. Like you, she was wearing nothing but a thick white diaper, although she did make a small effort to cover her chest with her arms. Saya looked quite nervous, like she might faint any minute. Her bare breasts, despite their small size, were making your insides tingle.<br>\r\n<br>\r\n\"Hey! Nikki! Take good care of Saya for me, okay? She earned a lot of Princess Points, so I told her she could play with your boy today. I'm off!\" Nikki's big sister said.<br>\r\nYou guessed Princess Points were just the girly equivalent of Good Boy Points. Nikki gave the older woman a sort of salute. Before anyone noticed, Saya was left alone with you. She was twiddling nervously.<br>\r\n\"So, little Saya, how about I introduce you to the diaper boy, Nick. Come out and say hi, little guy!\" Nikki said.<br>\r\nShe nudged you forward to get closer to Saya.<br>\r\n\"Um... hello. I'm Nick. Nice to... um... met you?\" You said.<br>\r\n\"Hi... well, I'm Saya and as you can see... I'm a diaper girl.\" She said.<br>\r\nNikki smiled and nodded.<br>\r\n\"Good, good! Glad you two know each other now! <br>\r\n<br>\r\nThat was when things became too much. One of you pooped yourselves. Who pooped?</span></div></div>",
            "created":1543208400,
            "id":2582406,
            "title":"Spend time with a diapered playmate"
        },
        "1553312222":{
            "author_id":"digitalstream",
            "author_name":"Dj's",
            "choices":[
                "Goes to get her diaper changed",
                "She sits on your face in her messy diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sara’s stomach started to rumble, as you were playing you saw she sort of grunted and started to push. Expanding her rear end, filling her diaper to the brink of leaking.  It stunk up the room but for some reason you were slightly aroused by it.  </span></div></span></div>",
            "created":1546664400,
            "id":2599227,
            "title":"Saya pooped her diaper"
        },
        "15533122221":{
            "author_id":"diaperss",
            "author_name":"diaperss",
            "choices":[
                "Go watch Saya's diaper change",
                "Just listen what happens",
                "Use your diaper too"
            ],
            "content":"<div class=\"\"><div> <span>''I...gotta get changed....'' she says, stuttering a bit as she waddles out of the room to get Nikki. You hear their conversation from the next room: ''Whoa Saya, you're stinking up the place!'' Nikki coos. You hear Saya sobbing slightly and then Nikki comforting her in a reassuring voice. ''Don't worry, I'll get you changed to a new, clean diaper in just a sec''<br>\r\n<br>\r\nYou then hear the rustling of a diaper package being opened and assume Nikki is taking out a new diaper and other needed supplies. Do you...</span></div></div>",
            "created":1554267600,
            "id":2639222,
            "title":"Goes to get her diaper changed"
        },
        "155331222211":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Play a game",
                "Play a sexy game",
                "Ask Saya about how and why she's in a diaper"
            ],
            "content":"<div class=\"\"><div> <span>You went over to watch as Nikki removed Saya's diaper, leaving the young girl naked. You looked at the poop in the dirty diaper, then to Saya's face, and then into her eyes, which nervously darted back and forth.<br>\r\n\"You doing okay?\" You asked.<br>\r\nYou extended your hand so Say could hold it.<br>\r\n\"Um... yeah... it's just... I'm not allowed out of the house much and... um...\" She quivered.<br>\r\nThen, Saya tried to smile.<br>\r\n\"You hands feel really nice.\" She said.<br>\r\nYou comforted her a little bit as Nikki cleaned her up and wrapped a new diaper around her bottom. In no time Saya was standing back up. She seemed much more at ease around you now.<br>\r\n\"So... um... What do you want to do? Saya asked.</span></div></div>",
            "created":1580965200,
            "id":2783502,
            "title":"Go watch Saya's diaper change"
        },
        "155331222213":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Saya thanks you for the gesture.",
                "Nikki changes you into a much thicker diaper.",
                "Saya is grossed out, because your messed your diaper on purpose."
            ],
            "content":"<div class=\"\"><div> <span>You really hate messing your diapers, so much so that Nikki has to give you enemas quite regularly. but you really want Saya to feel less Embarrassed about messing her diaper infront of you.<br>\r\n<br>\r\nSo you waddle over to Saya and Nikki and loudly fill your diaper.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1584248400,
            "id":2801775,
            "title":"Use your diaper too"
        },
        "1553312222132":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "She jerks oyu off in front of Saya",
                "She leaves you on the edge"
            ],
            "content":"<div class=\"\"><div> <span>Saya smiled. It did make her feel a lot better to know she wasn't the only one pooping herself.<br>\r\n\"Oh, does my baby boy need a new diaper already too? Ha ha, just wait a moment for me to be done with little Saya first, okay?\" Nikki said.<br>\r\nShe finished cleaning up Saya's butt and rubbed funny pink cream all over her diaper area... especially on her crotch. Saya let out a happy moan when this happened, evidently quite aroused by it. You couldn't help but stare at her, since you'd only rarely seen other girls' genitals before, and Saya was quite cute. You imagined how much you wanted to touch it, but held off for now. Nikki took notice how much Saya was enjoying this and pinched Saya's inner thigh.<br>\r\n\"Hey! What was that for?\" The naked girl squeaked.<br>\r\n\"Now, now. That's enough rubbing for you, little girl. You don't get to go over the edge just yet. Ha ha!\" Nikki laughed.<br>\r\nQuickly, she powdered Saya up and then taped a fresh diaper on her, a very thick one, so thick she could barely walk.<br>\r\n<br>\r\nNikki turned to you.<br>\r\n\"All right, let's get you now.\" Nikki said, smiling.<br>\r\nShe untaped your diaper and immediately began cleaning you up. Saya watched, mesmerized by the sight of your penis. She wasn't used to seeing penises and had never touched one before, but was eager to check them out. yours was a little on the small side, but that only made it cuter.<br>\r\n\"Auntie Nikki...\" Saya said.<br>\r\nNikki laughed.<br>\r\n\"Yeah, he's got a cute one, doesn't he?\" Nikki said.<br>\r\nYou blushed a little.<br>\r\n<br>\r\nSoon, Nikki took out the funny pink cream she had rubbed all over Saya's diaper area and began rubbing it on your butt... and on your penis and balls. It stained them a slightly humiliating shade of pink, but it felt really, really good. Your little cock stiffened. You closed your eyes.<br>\r\n\"Oh, I think he likes it.\" Saya said.<br>\r\nNikki giggled.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1602117540,
            "id":2917124,
            "title":"Nikki changes you into a much thicker diaper."
        },
        "15533122222":{
            "author_id":"sablonanime",
            "author_name":"Sablonanime",
            "choices":[
                "She unzips your pants and starts to jerk you off with her diaper in your face.",
                "She starts to fart more",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>She turns back towards you, you realize you were basically just ogling her ass. She smiles “what? Do you like what you see?” She wiggles her butt a bit and farts again, the room filling with her gas. At this point the smell is so arousing that you have a huge hard-on. Saya sees this and gives a seductive smirk. “Well damn, I didn’t know my stench was that sexy to you. Maybe this will turn you on even more, lie down for me will you? You comply and she stands over you, her diaper visibly sagging from the mess. “Bombs away!” She drops her diaper directly on your nose and makes herself comfortable. The warmth pressing against your face as well as the raw diaperstink felt heavenly. </span></div></div>",
            "created":1553835600,
            "id":2637070,
            "title":"She sits on your face in her messy diaper"
        },
        "155332":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "Donna",
                "Jasmine",
                "Someone else   "
            ],
            "content":"<div class=\"\"><div> <span>Donna, a 19 year old busty African-American who was a cheerleader and homecoming queen in high school, She has long dark hair that reaches past her shoulders, soulful brown eyes and a cheerful, optimistic personality. She is taking a year off before going to college. She has a full scholarship, but wants a little extra money before going to college.<br>\r\n<br>\r\nJasmine, an 18 year old bust Pakistani girl whose family immigrated to the west only a few years ago. Jasmine speaks broken english and sends all her money home to support her family. She has long dark hair that reaches to the small of her back and startling grey eyes. She is very shy around men and goes into hiding anytime one comes to Nick's house. She has only recently gotten used to be around Nick, and is still skittish around him.</span></div></div>",
            "created":1594091580,
            "id":2863093,
            "title":"More Other Maids"
        }
    },
    "info":{
        "author_id":"ezone_69",
        "author_name":"Ezone",
        "brief_description":"Your family goes out on vacation leving you and your maid home together",
        "created":1468950360,
        "description":"<td align=\"left\" class=\"norm\">You're home alone for the summer, because your single mother and your sister have gone on a mother daughter bonding trip in Europe for the summer, leaving you and the maid home alone together for 3 straight months! And you can probably guess that if they can afford to have a maid and take long vacation in Europe, than they will have a bit of money.<br>\r\n<br>\r\nI will alow pretty much anything as long as its realistic and good.<br>\r\n<br>\r\n*edit* I'll allow vore as long as it's good</td>",
        "id":2090693,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603993260,
        "modified":1603993260,
        "pretty_title":"A summer alone with the maid"
    }
}