{
    "chapters":{
        "1":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Natsuru Seno (Male)",
                "Natsuru Seno (Female)",
                "Akane Mishima",
                "Mikoto Kondo",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your favorite characters from Kampfer anime/manga to gain weight.</span></div></span></div>",
            "created":1259643600,
            "id":799990,
            "title":"Kampfer wg begin."
        },
        "11":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Force Feed",
                "Blueberry",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is going to happened to Natsuru Seno (Male)?</span></div></span></div>",
            "created":1259643600,
            "id":799994,
            "title":"Natsuru Seno (Male)"
        },
        "113":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "take some for later",
                "I'll eat some right now",
                "I'll leave them here for now"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Natsuru Seno (male) was walking around in a forst when he found some tasty looking berries. \"Mmmh these look good.\" I'll...</span></div></span></div>",
            "created":1259816400,
            "id":800834,
            "title":"Blueberry"
        },
        "1132":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Akane",
                "Mikoto",
                "Rika"
            ],
            "content":"<div class=\"\"><div> <span>I'll eat some right now.\" Natsuru said. As he began eating the blueberry his body began to change, he got bluer in color and he gotter bigger and rounder. \"Wha?! Hey what happening to me?! I nee to get help!\"<br>\r\n<br>\r\nNatsuru then goes to find...</span></div></div>",
            "created":1259989200,
            "id":801586,
            "title":"I'll eat some right now"
        },
        "11323":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "a book of medicines",
                "a staff"
            ],
            "content":"<div class=\"\"><div> <span>\"I need to find Rika!\" Natsuru said to himself. After searching for a while he found Rika. \"Hey Rika!\" Natsuru shouted. \"Hmm?\" She said in response to the voice she heard. \"What do ya need Natsuru?\" Rika said without looking actually looking at him. \"I need your help with something.\" He said \"Like wha-... Rika then stopped in mid sentence as she took in just what she was seeing. \"WHAT THE HELL!?\" Na-Natsuru what happened to you!?\" she screamed \"I don't know!\" Natsuru said his arms and legs were beginning to be engulfed by his body.<br>\r\n<br>\r\n\"I was eating some blueberries i found and then I turned into this!\" he cried. \"Look at me! I'm a blue, round, freak!\"<br>\r\n<br>\r\n\"So what do you want me to do about it?!\" Rika screamed. \"I want you to help me! Isn't there something you know of that could cure this?!\" Natsuru exclaimed to Rika. \"Umm.... I know earlier i found something that can cure stuff like this! Come on!\"<br>\r\n<br>\r\nNatsurur followed Rika to whatever she found. What did she find?</span></div></div>",
            "created":1259989200,
            "id":801766,
            "title":"Rika"
        },
        "12":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry",
                "Eating",
                "Magic",
                "Pregnant",
                "Breast Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happening to Natsuru Seno (Female)?</span></div></span></div>",
            "created":1259643600,
            "id":800018,
            "title":"Natsuru Seno (Female)"
        },
        "121":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "locked off room",
                "a room with a conveyor belt in it",
                "an empty space"
            ],
            "content":"<div class=\"\"><div> <span>One day while taking a tour of a candy factory Natsuru found a blueberry gum packet. She asked the tour guide if she could have it and the tour guide said sure. Then while Natsuru was chewing the gum she got sidetracked by its deliciousness and didn't notice the tour walking away. Then she noticed a White Kamfer coming near her as she also noticed her body getting bluer and rounder. The white kampfer then took her to a...</span></div></div>",
            "created":1259989200,
            "id":801590,
            "title":"Blueberry"
        },
        "1213":{
            "choices":[
                "its sakura",
                "its mikoto,shizuku and akane",
                "the other three white kampfers"
            ],
            "content":"<div class=\"\"><div> <span>natsuru:where are you taking me<br>\r\n<br>\r\nnatsuru asked the white zauber kampfer hitomi minagawa still expanding from the juice her belly the size of a beach ball pushing her shirt up and skirt down her hips and ass twice the size they were before straining her skirt her breasts formally DD now H cups showing alot of cleavage down her shirt and straining her bra<br>\r\n<br>\r\nhitomi:you'll see<br>\r\n<br>\r\nhitomi said pushing natsuru into a big empty room its then natsuru tries to fight back but cant due to her increased size as hitomi grabs her arms and ties them behind her back walking in front of natsuru<br>\r\n<br>\r\nhitomi:you think you can take me on like that<br>\r\n<br>\r\nhitomi says poking natsuru's belly giving an evil grin its then that they both hear the door opening</span></div></div>",
            "created":1288414800,
            "id":983665,
            "title":"an empty space"
        },
        "12132":{
            "choices":[
                "speeds up",
                "slows down"
            ],
            "content":"<div class=\"\"><div> <span>shizuku:what have you done to natsuru<br>\r\n<br>\r\nhitomi:seems i wont get to have my fun bye<br>\r\n<br>\r\nhitomi says running out the other door<br>\r\n<br>\r\nmikoto:wait<br>\r\n<br>\r\nmikoto says running after her only to have her lock the door as the other door closes and locks behind them<br>\r\n<br>\r\nmikoto/akane:damnit!<br>\r\n<br>\r\nmikoto:how do we get out now<br>\r\n<br>\r\nmikoto says as they all walk up surounding natsuru<br>\r\n<br>\r\nshizuku:i think we have a more pressing matter here<br>\r\n<br>\r\nshizuku says with her hand on her chin look at natsuru's expanding body as she then walks up and puts on ear to her belly<br>\r\n<br>\r\n*gurgle*<br>\r\n<br>\r\n*slosh*<br>\r\n<br>\r\n*groan*<br>\r\n<br>\r\nshizuku:natsuru seems to be expanding all over<br>\r\n<br>\r\nakane:what do we do then<br>\r\n<br>\r\nmikoto:i think a better question is how much more can she expand<br>\r\n<br>\r\nshizuku then taps natsuru's belly noticing alot of give<br>\r\n<br>\r\nshizuku:id say we got awhile before she cant expand anymore<br>\r\n<br>\r\nnatsuru:hello guys can you untie my arms<br>\r\n<br>\r\nshizuku:oh right<br>\r\n<br>\r\nshizuku then backs away from her belly and goes around to untie her<br>\r\n<br>\r\nnatsuru:thank you<br>\r\n<br>\r\n*snap*<br>\r\n<br>\r\nits then that natsuru's skirt snaps off flying off revealing her white panties going into a thongas everyone stares she then tries to cover herself to no avail everyone walks up and starts poking her belly<br>\r\n<br>\r\nnatsuru:stop that and help me<br>\r\n<br>\r\nnatsuru's expansion then...</span></div></div>",
            "created":1288414800,
            "id":983674,
            "title":"its mikoto,shizuku and akane"
        },
        "121321":{
            "choices":[
                "they drink the juice",
                "they squeeze the juice out"
            ],
            "content":"<div class=\"\"><div> <span>its then they all hear a loud gurgling sound as they do everyone puts an ear to natsuru's belly while shes hold it with both hands then all of a sudden natsuru's expansion increases speed causing everyone to get knocked back on there ass imediately covering themselves as there skirts flew up<br>\r\n<br>\r\nnatsuru:WHATS HAPPENING<br>\r\n<br>\r\nmikoto:natsuru calm down its gonna be ok<br>\r\n<br>\r\n*rip*<br>\r\n<br>\r\nnatsuru's shirt starts ripping as her legs are forced apart by her expansion and her arms are forced straight out her leg and arms start being absorbed by her body as her shirt falls to the ground<br>\r\n<br>\r\n*snap*<br>\r\n*snap*<br>\r\n<br>\r\nnatsuru's bra and panties burst off leaving her completely naked and her arms and legs are completely absorbed all she is is a giant blueberry with hands,feet,giant breasts and a head her cheeks and lips puff making her unable to speak<br>\r\n<br>\r\nmikoto:look at her breasts<br>\r\n<br>\r\nmikoto says as everyone looks up and notices them leaking juice from her nipples<br>\r\n<br>\r\nshizuku:down here to<br>\r\n<br>\r\nshizuku says kneeling down at her vagina causing mikoto and akane to blush<br>\r\n<br>\r\nmikoto:so how are we going to do this<br>\r\n<br>\r\nshizuku:one of us will get each of her breast and someone will get her pussy<br>\r\n<br>\r\nmikoto/akane:not it<br>\r\n<br>\r\nshizuku:hmm fine i guess ill have to do it help me roll her on her back<br>\r\n<br>\r\nmikoto:why<br>\r\n<br>\r\nshizuku:so you two can reach her breasts<br>\r\n<br>\r\nmikoto:oh yeah<br>\r\n<br>\r\nshe says as they realise how high up they are they roll her on her back as everyone gets in position</span></div></div>",
            "created":1288414800,
            "id":983683,
            "title":"speeds up"
        },
        "1213211":{
            "choices":[
                "natsuru is still growing",
                "shizuku is turning blue now"
            ],
            "content":"<div class=\"\"><div> <span>shizuku:the best way to get the juice is probably to drink it<br>\r\n<br>\r\nmikoto:what do you mean drink it?<br>\r\n<br>\r\nshizuku:well basically we dont wanna make a mess or else people might come in here<br>\r\n<br>\r\nakane:umm dont we want them to come in her and unlock the door<br>\r\n<br>\r\nshizuku:yeah but not till we have natsuru deflated plus it'll be faster to suck the juice right out of her breasts then squeezing it and who knows what might happen if we dont deflate her fast enough<br>\r\n<br>\r\nmikoto:good point but still thats embaressing<br>\r\n<br>\r\nshizuku:i dont wanna hear anything about embaressing im the one handling her pussy<br>\r\n<br>\r\nakane:how will drink that much juice though look at the size of her<br>\r\n<br>\r\nshizuku:we'll just have to risk it now if your done complaining time is of the essence<br>\r\n<br>\r\nmikoto/akane:alright<br>\r\n<br>\r\nthey all get to the positions as akane and mikoto put there mouths over her nipples shizuku starts licking her puss causing natsuru to moan and go red in the face<br>\r\n<br>\r\nnatsuru:*oh god im about to come i cant hold it in*<br>\r\n<br>\r\njust then shes sprays juice forcing shizuku to swallow a large quantity and to get her clothes wet making her stomach noticably bigger as well as shrink natsuru they continue drinking as all of there stomach grow shizukus being the biggest looking 8 months pregnant as the other two look 5 months<br>\r\n<br>\r\nshizuku:oh god i need a break i feel like im gonna pop<br>\r\n<br>\r\nshizuku says kneeling back on one arm rubbing her exposed stomach with the other<br>\r\n<br>\r\nthey continue drinking as natsuru comes again making shizuku's belly the size of a woman 9 months with twins making her skirt burst off revealing her purple thong panties<br>\r\n<br>\r\nmikoto:a thong really<br>\r\n<br>\r\nshizuku:yes why<br>\r\n<br>\r\nmikoto:no reason<br>\r\n<br>\r\nby this time shizuku look overdue with triplets mikoto and akane both look ready to give birth to twins and natsuru has her legs back and she can talk again but her body is back to normal aside from some juice staying in her ass hips and breast making them all twice the size they were before<br>\r\n<br>\r\nnatsuru:thanx<br>\r\n<br>\r\nakane:are you ok natsuru<br>\r\n<br>\r\nnatsuru:yeah im fine as there walking to the door they notice</span></div></div>",
            "created":1288414800,
            "id":983693,
            "title":"they drink the juice"
        },
        "12132112":{
            "choices":[
                "mikoto and akane turn blue also",
                "shizuku starts expanding"
            ],
            "content":"<div class=\"\"><div> <span>natsuru:ok so we have to problems i see the doors locked and i need clothes plus shizuku needs to cover her lower half<br>\r\n<br>\r\nmikoto:yeah but where would we find any here<br>\r\n<br>\r\nnatsuru:well lets figure the door problem out first<br>\r\n<br>\r\nakane:um guys<br>\r\n<br>\r\nmikoto:what is it akane<br>\r\n<br>\r\nmikoto says not even looking back<br>\r\n<br>\r\nakane:we have a new problem<br>\r\n<br>\r\nmikoto:what is it<br>\r\n<br>\r\nakane:shizuku's turning blue blue<br>\r\n<br>\r\nnatsuru and mikoto turn around to see shizuku finish turning blue<br>\r\n<br>\r\nshizuku:well i dont see how things can get worse<br>\r\n<br>\r\nnatsuru:um you guys i think it is getting worse</span></div></div>",
            "created":1289106000,
            "id":988687,
            "title":"shizuku is turning blue now"
        },
        "122":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "barbequed pork",
                "a steak",
                "one of everything"
            ],
            "content":"<div class=\"\"><div> <span>As Natsuru had become hungry he went around town to look for a place to eat. \"Theres gotta be someplace i can go to thats cheap\" he muttered to himself. Then Natsuru stumbled upon a Barbeque grill restaruant. Next to it was a sign that read: Special today only offer all females get all meals for free! \"Wow!\" females get all free thats perfect for me!\" Natsuru then changed into his Kampfer form making sure beforehand no one saw him, then walked into the restaruant. \"Hello miss what would you like to order today?\" the waitress cherrfully asked. <br>\r\n<br>\r\n\"Hmm I'll have...</span></div></div>",
            "created":1259989200,
            "id":801770,
            "title":"Eating"
        },
        "1221":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Natsuru gained 50lbs",
                "Natsuru gained 120lbs",
                "Natsuru gained 300lbs"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll have some barbequed pork sir.\" Natsuru said \"Thank you miss, your order will be her shortly.\" the waitress said in a cheerful reply. As Natsuru waited for her order she noticed that all the women in the restaruant were of a rather large status, not one women in ther looked like anything under 300lbs. \"Hmm thats strange.\" Natsuru said to herself. \"Come to think of it that waitress was also pretty heavy set as well.\" As Natsuru continued thinking about this odd situaiton her waitress came back with her meal. \"Here is your meal miss,\" the waitress said. \"Enjoy!\" \"Wow this looks really good! It smell amazing!\" I can't believe this is being givenaway for free! Though why only to women?\"  As Natsuru put his thought out of her head to begin eating she immediatly was set back tby the pork's incredible taste. Woah! This is good!\" Natsuru replied in response to the amazing taste she had just felt. <br>\r\n<br>\r\nNatsuru then began eating visicously into her pork, not really caring about her etiquette at the moment. As she ate, Natsuru suddenly felt a strange sensation. \"Huh? Whats this feeling I'm getting?\" she questioned to herself. As she wondered about this she suddenly went up some several pounds.   </span></div></div>",
            "created":1260334800,
            "id":803505,
            "title":"barbequed pork"
        },
        "12211":{
            "choices":[
                "akane,shizuka, and mikoto",
                "kaede"
            ],
            "content":"<div class=\"\"><div> <span>natsuru notices her breasts and butt are quite a bit bigger but her stomach is just a little bulge compared to her breast and butt which caused her school uniform to stretch out and rip a bit showing quite a lot of her new cleavage and her blue bra her skirt has also moved up thanks to her now bigger ass revealing her matching panties stretched into a thong its then that someone shows up in there school uniform<br>\r\n<br>\r\n<br>\r\nwho is it...</span></div></div>",
            "created":1276923600,
            "id":902346,
            "title":"Natsuru gained 50lbs"
        },
        "122112":{
            "choices":[
                "kaede pushs natsuru into the restroom",
                "kaede orders natsuru more food and make her bigger"
            ],
            "content":"<div class=\"\"><div> <span>kaede:natsuru hi how ar- natsuru!<br>\r\n<br>\r\nnatsuru:what oof<br>\r\n<br>\r\nnatsuru says as kaede runs up and jumps and her breasts fondling them and putting her head in them<br>\r\n<br>\r\nkaede:i thought you were beautiful before but now your breasts and butt are so much bigger now and ooh cute underwear same color as your hair i love it<br>\r\n<br>\r\nkaede says as she continues to grope natsuru's breast and ass<br>\r\n<br>\r\nnatsuru:sakura wh-what are you doing stop that<br>\r\n<br>\r\nkaede:oh do i have to<br>\r\n<br>\r\nnatsuru:geez sakura yes<br>\r\n<br>\r\nkaede:aaaah<br>\r\n<br>\r\nkaede whines as she stops groping and fondling natsuru but then starts looking at natsuru's new assets looking nervous and giving in to her desire<br>\r\n<br>\r\nkaede:oh just a bit more<br>\r\n<br>\r\nnatsuru:no kaede stop stop that fine you can continue<br>\r\n<br>\r\nnatsuru says as kaede uses her breasts like a pillow natsuru then continues to eat the rest of her food forgetting what happened causing her now E cup to go to and H ripping her uniform the rest of the way straining her bra and showing a huge amount of cleavage her stomach goes to looking five months pregnant and ass gets so big her skirt doesnt cover nearly enough of it causing natsuru to trying to cover what she can but kaede has a different idea</span></div></div>",
            "created":1276923600,
            "id":902359,
            "title":"kaede sakura shows up"
        },
        "1221122":{
            "choices":[
                "let go of her",
                "continue to force feed her till her bra bursts"
            ],
            "content":"<div class=\"\"><div> <span>natsuru:i should go<br>\r\n<br>\r\nnatsuru says as she gets up to leave but then kaede stops her sitting on her lap and putting her knees on natsuru's hand keeping her from leaving<br>\r\n<br>\r\nkaede:oh no you dont ooh your boobs belly and ass are so big and smooth i can barely fit on your lap excuse me miss<br>\r\n<br>\r\nwaitress:yes mam<br>\r\n<br>\r\nkaede:can you get me one of everything<br>\r\n<br>\r\nnatsuru:kaede what are you doing<br>\r\n<br>\r\nkaede:i want you bigger<br>\r\n<br>\r\nwaitress:ok miss itll be here soon<br>\r\n<br>\r\nnatsuru:kaede im already big enough im not hungry<br>\r\n<br>\r\nkaede:but your so sexy now<br>\r\n<br>\r\nkaede says fondling natsuru's body she then notices natsuru's skirt is struggling to stay on more then her bra is its then that the waitress gets back with a cart full of food barbequed pork,steak,chicken strips,chicken nuggets,popcorn chicken,fries,mash potatoes,hash browns and much much more<br>\r\n<br>\r\nkaede:excuse me miss but what makes the people here grow so fast and much<br>\r\n<br>\r\nwaitress:its a special ingredient that causes woman to expand the cook puts it in all the food here<br>\r\n<br>\r\nkaede:good say ahh natsuru<br>\r\n<br>\r\nkaede says holding up a chicken strip but natsuru holds her mouth closed<br>\r\n<br>\r\nkaede:natsuru you should know that wont work<br>\r\n<br>\r\nkaede then grabs her noise forcing her to open her mouth she then forces her to eat the chicken strip kaede continues to feed her causing her belly and butt to grow even more her belly now looks nine months pregnant and her ass grows another six inches pushing kaede a bit, bursting her skirt and making her panties turn into a thong surprisingly her breasts barely grow staying at an H cup allowing the rest of her to catch up natsuru starts blushing the food is only one fourth of the way gone<br>\r\n<br>\r\nnatsuru:kaede please just let me go look at me im huge all ive got left is my underwear<br>\r\n<br>\r\nkaede does what...</span></div></div>",
            "created":1277096400,
            "id":903883,
            "title":"here have some more food natsuru"
        },
        "12211222":{
            "author_id":"spoofinator",
            "author_name":"joey",
            "choices":[
                "Kaede's secretly obese.",
                "Kaede has fat fetish."
            ],
            "content":"<div class=\"\"><div> <span>Say ahh Natsuru-san. Kaede said in a happy tone. Ahh. Natsuru said without even putting up a fight. With that Kaede put the last slice of pizza in Natsuru's mouth and finished the entire tray of food. Yay we're done and it only took a half an hour. Kaede said happily. She then looked at her work. Natsuru's belly got so big that it was pushing against the table and looked like she swallowed a full grown women. Her boobs were now an J cup and her bra was ruined when she was half way done. Her butt grew another seven inches and looked like a small bean bag chair. Her cheeks looked tennisballs and a second chin appeared.<br>\r\n<br>\r\nFinally, anymore food and I would've exploded. Natsuru panted, whipped out from eating too much. You don't look so good Natsuru-san. Kaede said while exploring Natsuru's new body. Let me take you to my place where you can relax. She then helped Natsuru up and out of her chair(with some difficulties due to her gut) and helped her waddle to the car. Luckily it was a slow day at the restaurant and some how her panties were still in tact, but just bearly. Sakura-san there no way I can fit through the door. Natsuru said while Kaede was shoving her in. Just try. She said pushing with all her might. Three minutes later Kaede manged to get Natsuru in the car and they drove off to her house.<br>\r\n<br>\r\nAfter a short drive the car pulled up at Kaede's house and they both got out and went inside. Before we do anything lets see how much you weigh now. Kaede said. She then went to her bathroom and brought out the scale and natsuru got on. After a few seconds scale showed Natsuru's new weight which was 410 lbs. I..I  can't believe I'm huge. Natsuru gasped in surprise to her new weight. Its because of that food you ate, I should take you back to that again sometime. Kaede said while foddling natsuru's boobs. After than Natsuru layed on the couch and Kaede brought her some new clothes.<br>\r\n<br>\r\nThanks for your hospitality Sakura-san but I need to go home now. Natsuru said trying to get up from the couch. Home? You are home silly. Kaede said happily. What you talking about I can't stay here. She said in shock. Natsuru-san look at yourself you can barely get up on your own, you think can live by yourself. She said with a serious look on her face. Besides there's something you have to know about me (besides her obsessive love for Natsuru).</span></div></div>",
            "created":1295326800,
            "id":1037785,
            "title":"The meal is finished."
        },
        "122112221":{
            "author_id":"yodadude",
            "author_name":"Yoda1174",
            "choices":[
                "\"Yes, I will be your girlfriend.\"",
                "\"Um, let me think about it.\""
            ],
            "content":"<div class=\"\"><div> <span>\"What?!\" gasped Natsuru, looking at Kaede in shock. \"It's true,\" she said. \"I am secretly obese, and I am hiding my real weight through this bracelet. She then revealed her right arm, a purple bracelet on her wrist. \"Since I revealed this to you, I will now show you my true weight,\" Kaede declared, her bracelet shining.<br>\r\nNatsuru watched in stunned silence as Kaede swelled up in front of her, her clothes ripping. Her breasts bursts through shirt and bra, now H-cups. Her butt grew and bursted through her pants, making her panties look like things. Her cheeks swelled out, becoming chipmunk like and making her face look cute. When the change was done, a 500 pound Kaede Sakura stood in front of Natsuru. This is what I really weigh,\" said Kaede with a smile. \"I have been waiting for an opportunity to not only show you this, but make you fat as well. Now, would you please be my girlfriend?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1411793520,
            "id":1862615,
            "title":"Kaede's secretly obese."
        },
        "122112222":{
            "author_id":"spoofinator",
            "author_name":"joey",
            "choices":[
                "The president,vice president and treasurer (revenge!!!)",
                "Akane,Shizuku and Mikoto (who are in their kampfer forms)"
            ],
            "content":"<div class=\"\"><div> <span>\"I prefer girls with more meat on their bones.\" Kaede said lustfully.<br>\r\n<br>\r\n\"W-what are you talking about Sakura-san?\" Natsuru stuttered.<br>\r\n<br>\r\n\"What I mean is that fat helps improves a women's assets and gives them a whole new perspective on life.\" Kaede stated. \"Best of all now your permanently stuck in your female form and can't change back to your worthless male form.\"<br>\r\n<br>\r\nShocked at what she heard Natsuru tried to change back to a boy but to no avail and Kaede started coming closer and closer to her. All the while Natsuru was frightened about what would happen to her.<br>\r\n<br>\r\n\"Don't worry Natsuru-san I won't harm in anyway possible.\" Kaede whispered in Natsuru's ear.<br>\r\n<br>\r\nThen Kaede brought something out of her purse and showed to the rotund girl. It was a tube of what looked like icing called roly-poly dreams and Natsuru had a bad feeling about this.<br>\r\n<br>\r\n\"What are you planning on doing with that.\" Natsuru asked hesitantly. \"Are you going to fatten me up more?\"<br>\r\n<br>\r\n\"No.\" Kaede replied. \"Your going to feed it to someone else.\" \"You see Natsuru-san this icing is super fattening and turns anyone who eats it into couch potatoes that that can become obedient servants, if feed this to you you'll lose that certain charm I like about you.\" \"That and I rather fatten you up the old-fashioned way.\"<br>\r\n<br>\r\nThen Kaede clapped her hand and three of her white kampfer minions dragged in three girls that you know all to well. Who was it.<br>\r\n<br>\r\n</span></div></div>",
            "created":1333765740,
            "id":1310501,
            "title":"Desires revealed"
        },
        "12213":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "more barbequed pork please!",
                "dessert, and lots of it!"
            ],
            "content":"<div class=\"\"><div> <span>\"Wha?!\" As Natsuru suddenly shot up to about 420lbs in weight, her shirt now quite ripped from its sudden streching same for her pants and panties. \"How did that food do this?!\" Natsuru screamed. \"I can't go to school like this! What'll everyone think if they see me like this?!\" Natsuru sobbed. \"Uhh!\" She suddenly gasped as a strange sensation came over. \"Whats ths sensation I feel?\" She then was overcome by a powerful urge to rsume eating her meal, and lots of it. I...I want more! Natsuru said she viciously gobbled down the remainder of her meal. Natsurru then called her waitress for more.<br>\r\n<br>\r\n\"Waitress! BURP!\" She burped in bliss.<br>\r\n<br>\r\n\"Yes! miss?\" the large, cute waitress responded. \"I'd like some...\" </span></div></div>",
            "created":1260680400,
            "id":804931,
            "title":"Natsuru gained 300lbs"
        },
        "122132":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "560lbs",
                "780lbs"
            ],
            "content":"<div class=\"\"><div> <span>\"I'd like the entire dessert menu please!\" Natsuru said in a state of thoughtless bliss. \"Your meal will be right with you soon miss!\" the plump waitress said in equal bliss. A few minutes later Natsuru had started to play aronud with her bigger gut, she watched as it shook and bounced around with each of her pokes and prods on to her massive belly. *gurgle gurgle* Natsuru then patted her belly as she heard its calls for food. \"Don't worry, you'll be filled soon enough *giggle*\" Not longafter that the waitress came back with a few other waitress to help her bring back the large amount of food. \"Here is your order miss!\" the waitresses said together. \"Enjoy!\" <br>\r\n<br>\r\nAs Natsuru marveled at the tremendous amount of desserts, she then began to think of fat she would get from all this food. \"Ohh I can't wait!\" Natsuru said as she began gobbling down on some several cups of ice cream. \"Gahh! this feels great! I don't think I can stop eating!\" she cheerfully said in excitement. After about 30 minutes of eating the 3 gallons of many different flavors ice cream she moved on to her next part of the meal which was about 4 buckets of choclate pudding, she had already gained...</span></div></div>",
            "created":1262408400,
            "id":814549,
            "title":"dessert, and lots of it!"
        },
        "1222":{
            "choices":[
                "Natsuru gained 5lbs",
                "Natsuru gained 15lbs",
                "Natsuru gained 25lbs"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm I'll have a steak. Natsuru said \"Thank you miss, your order will be her shortly.\" the waitress said in a cheerful reply. As Natsuru waited for her order she noticed that all the women in the restaruant were of a rather large status, not one women in ther looked like anything under 300lbs. \"Hmm thats strange.\" Natsuru said to herself. \"Come to think of it that waitress was also pretty heavy set as well.\" As Natsuru continued thinking about this odd situaiton her waitress came back with her meal. \"Here is your meal miss,\" the waitress said. \"Enjoy!\" \"Wow this looks really good! It smell amazing!\" I can't believe this is being givenaway for free! Though why only to women?\"<br>\r\n<br>\r\nShe ate the steak until she was done. <br>\r\n<br>\r\n As she ate, Natsuru suddenly felt a strange sensation. \"Huh? Whats this feeling I'm getting?\" she questioned to herself. As she wondered about this she suddenly went up some several pounds. </span></div></div>",
            "created":1312520400,
            "id":1162141,
            "title":"a steak"
        },
        "1223":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "pie",
                "cake",
                "all your desserts"
            ],
            "content":"<div class=\"\"><div> <span>\" Wow! I don't know what to try first! The steak or the ham or the ribs.\"<br>\r\n<br>\r\nShe just decided to start with the ribs and so on.<br>\r\n<br>\r\n1 hour later<br>\r\n<br>\r\n\"Boy that was good. I seem to have gained some weight. Oh well.\"<br>\r\n<br>\r\nThen the waitress came back to Natsuru.<br>\r\n<br>\r\n\"Can I interest you in a dessert this evening?\"<br>\r\n<br>\r\n\"Of course.\"<br>\r\n<br>\r\n\"What will you have?\"<br>\r\n<br>\r\n\"I'll take</span></div></div>",
            "created":1315890000,
            "id":1186831,
            "title":"one of everything"
        },
        "123":{
            "author_id":"oddpersona",
            "author_name":"OddPersona",
            "choices":[
                "Situation A",
                "Situation B",
                "Try something else."
            ],
            "content":"<div class=\"\"><div> <span>Okay, how should magic play a role in this?<br>\r\n<br>\r\nSituation A.<br>\r\nAn enemy kampfer's magic will cause Natsuru to spontaneously gain weight.<br>\r\n<br>\r\nSituation B.<br>\r\nAn enemy kampfer having a control over water expands Natsuru with water weight gain (liquid expansion).<br>\r\n<br>\r\nI'll leave the third choice to you.</span></div></div>",
            "created":1264654800,
            "id":827107,
            "title":"Magic"
        },
        "1232":{
            "choices":[
                "kaede sakura shows up",
                "hitomi moves the water to her arms and legs as well full body inflation",
                "mikoto and shizuku show up to help natsuru"
            ],
            "content":"<div class=\"\"><div> <span>natsuru seno was walking by a bridge and river in her kampfer form wearing some tight jeans that hug every part of her pretty big ass and legs a white button up shirt with long sleeves doing the same as the jeans but to her arms, DD cup breasts and slim belly going down to where it just barely covers all of her belly and you see her bra straps through it and some sneakers she just pass the bridge when she was suddenly attacked by an energy bolt thrown by Hitomi Minagawa the white kampfer zauber user she narrowly dodges it in time<br>\r\n<br>\r\nnatsuru:if you think you can beat me that easily your sadly mistaken i wont go down so easily<br>\r\n<br>\r\nhitomi:hmpf<br>\r\n<br>\r\nhitomi grinned as a schwerts came out of nowwhere and rapped around natsurus arms and legs and pulled them to her sides rika ueda walks out of the shadows holding the chains<br>\r\n<br>\r\nnatsuru:what you coward you had back up<br>\r\n<br>\r\nrika:of course she did<br>\r\n<br>\r\nhitomi:you didnt think id come without any did you<br>\r\n<br>\r\nnatsuru:if you want to fight me try and beat me yourself<br>\r\n<br>\r\nhitomi:beat you no the white kampfers share kaedes interest in you <br>\r\n<br>\r\nstange girl:were all here<br>\r\n<br>\r\njust then the other two white kampfers jumped down from the bridge there next to sayaka nakao and ryoko yamakawa ryoko being the one who just spoke<br>\r\n<br>\r\nnatsuru:what are you planning?<br>\r\n<br>\r\nnatsuru asked trying to get loose<br>\r\n<br>\r\nhitomi:well we want to have some fun with you rika,ryoko,sayaka lets go under that bridge like we planned<br>\r\n<br>\r\nthey walk to the bridge and go under it hooking the chains attached to natsuru's wrists to the bottom of the bridge and the ones attached to her legs to some metal bars in cement natsuru can move her arms a bit but her legs are stuck in place just then some water from the river turns into a snake like figure and enters natsuru's mouth forcing water down her throat making her go wide eyed<br>\r\n<br>\r\nnatsuru:mmgfskldg<br>\r\n<br>\r\nnatsuru tries to say something but can its then she notice hitomi's kampfer bracelet glowing<br>\r\n<br>\r\nhitomi:you didnt know did you zauber users can control certain things i can control energy and anything that makes it like say water<br>\r\n<br>\r\nnatsuru starts to feel an uncomfortable pressure in her stomach and notices its bulging out more and more lifting her tight shirt and straining the buttons of it and the jeans her belly is the size of a woman of a woman five months pregnant already giving some pain she winces<br>\r\n<br>\r\nryoko:oh she looks to be in pain why dont we give her some help sayaka,rika<br>\r\n<br>\r\nryoko says as they walk up to natsuru and starts massaging natsuru's growing belly through her shirt her belly now looks nine months pregnant and passing that size<br>\r\n<br>\r\nPOP<br>\r\n<br>\r\nthe button on her jeans pop off her belly forces the zipper down showing her red panties<br>\r\n<br>\r\nsayaka:ooh nice color but lets just remove these jeans and your shoes<br>\r\n<br>\r\nrika:let me help you sayaka and hitomi her stomachs pretty big send some to her lovely assets up here there pretty big now but they can stand more<br>\r\n<br>\r\nhitomi:alright<br>\r\n<br>\r\nhitomi makes it so the water is going to natsuru's boobs making them quickly strain the top buttons of her shirt and revealing more cleavage while rika and sayaka get on natsuru's left and right they each grab the jeans over her butt and vagina and begin to remove her jeans slowly while natsuru now looks seven months pregnant with twins and ryoko is still massaging her belly<br>\r\n<br>\r\nryoko:nice tits you have there mind if i feel for myself<br>\r\n<br>\r\nryoko says as she gropes natsuru's now E cup breasts causing the top button to pop off revealing even more cleavage and part of her red bra<br>\r\n<br>\r\nryoko:oops i guess i was to rough<br>\r\n<br>\r\nsayaka:jeez natsuru i didnt know your ass was the same size as your breasts are oh wait im sorry were<br>\r\n<br>\r\nsayaka smacks natsuru's ass making it jiggle and bounce<br>\r\n<br>\r\nnatsuru:fgsmskl<br>\r\n<br>\r\nsayaka:look at that her as bounces like her breasts<br>\r\n<br>\r\nrika:let me see<br>\r\n<br>\r\nsayaka smacks natsuru's ass again<br>\r\n<br>\r\nsayaka:see<br>\r\n<br>\r\nrika:thats pretty hot<br>\r\n<br>\r\nsayaka:yeah<br>\r\n<br>\r\npop pop<br>\r\n<br>\r\nthe buttons on the top and the bottom of her shirt come off leaving two buttons left her belly is the size of a woman eight months pregnant with triplets and her breasts are G cups<br>\r\n<br>\r\nhitomi:hey one of you take those panties off her<br>\r\n<br>\r\nsayaka:ok <br>\r\n<br>\r\nnatsuru:gsdkjghsl<br>\r\n<br>\r\nnatsuru tries to talk shaking her head no <br>\r\n<br>\r\nryoko:yes and theres nothing you can do so might as well give up<br>\r\n<br>\r\nnatsuru gets a horrified look on her face<br>\r\n<br>\r\nsayaka:hey rika wanna do the panties together to<br>\r\n<br>\r\nrika:dont mind if i do<br>\r\n<br>\r\nthey start to pull down her panties<br>\r\n<br>\r\nsayaka:ok there off<br>\r\n<br>\r\ntwo more water things shaped like snakes come up out of the water and goes to infront of natsuru's vagina and ass<br>\r\n<br>\r\nryoko:you should feel happy natsuru you about to go through something amazing its even better if your into anal<br>\r\n<br>\r\nnatsuru:MMMMMMMMMMFFFFFF<br>\r\n<br>\r\nnatsuru tries to screams and raises her head to look up as the water snakes go in giving her intense pleasure she start breathing heavy and blushing still looking up as her breasts and belly fill with water faster and her ass joins in the final buttons on her shirt pop off causing her shirt to fall still around her shoulders her stomachs the size of a beachball and her breast the size of soccerballs straining her bra causing her pain but she doesnt really notice it with the immense pleasure<br>\r\n<br>\r\nryoko:i told you it was gonna feel amazing it looks like that bra is getting tight though<br>\r\n<br>\r\nrika:looks like she cant hear you<br>\r\n<br>\r\njust then natsuru's bra snaps off letting her breasts bounce out onto her belly leaking a small trickle of water<br>\r\n<br>\r\nryoko:look at this<br>\r\n<br>\r\nryoko squeezes natsurus breast making the stream of water faster she then drinks some sucking on one of her breasts and squeezes the other causing natsuru even more pleasure if thats even possible<br>\r\n<br>\r\nthen something happens...</span></div></div>",
            "created":1276923600,
            "id":902439,
            "title":"water inflation"
        },
        "12323":{
            "choices":[
                "white kampfers",
                "red kampfers"
            ],
            "content":"<div class=\"\"><div> <span>another shwerts comes out from around the corner aimed at the chains but sayaka uses her sabre to stop it<br>\r\n<br>\r\nsayaka:looks like we got some company<br>\r\n<br>\r\nshizuku:let her g-oh my god what are you doing to her<br>\r\n<br>\r\nmikoto:natsuru!<br>\r\n<br>\r\nthey say as they notice natsuru's being filled with water from three places her breasts are watermelon size her belly is twice the size of a beachball and her butt is a foot and a half out <br>\r\n<br>\r\nryoko:she cant hear you shes in to much pleasure but we could take her out of it for a minute if you agree to join her<br>\r\n<br>\r\nmikoto:NO WAY we'll beat you guys and save her<br>\r\n<br>\r\nryoko:its four on two ladies you couldnt beat us when you had that other blue kampfer with you what makes you think you can win now<br>\r\n<br>\r\nshizuku:oh we will if its for natsuru<br>\r\n<br>\r\nryoko:you can try<br>\r\n<br>\r\nits then they hear rikas shwerts that are holding natsuru up clang and look back to see natsuru on her side on the ground and the shwerts on the ground next to her<br>\r\n<br>\r\nrika:it doesnt look like she can go anywhere on her own keep filling her with water though us and kaede can have some fun without resistance later now lets get back to these two<br>\r\n<br>\r\nthey each get in a fighting pose and start fight while natsuru is inflating and the winner is...</span></div></div>",
            "created":1276923600,
            "id":902447,
            "title":"mikoto and shizuku to the rescue"
        },
        "123232":{
            "choices":[
                "is still filling them up hitomi did something to it",
                "stops shizuku and mikoto help natsuru out"
            ],
            "content":"<div class=\"\"><div> <span>\"note from digits i apologize i forgot to paint a mental picture for shizuku and mikoto by describing what there wearing shizuku is wearing a green sundress with a white mini jacket thing and a matching sunhat with black highheels mikoto is wearing a blue mini skirt that goes just below her crotch a pink t-shirt and white tennis shoes\"<br>\r\n<br>\r\nthey all fight for about five minutes all while natsuru's still filling up with water<br>\r\n<br>\r\nryoko:just give up you cant win<br>\r\n<br>\r\nmikoto:we can and will<br>\r\n<br>\r\nrika:ok this is getting old hitomi do it<br>\r\n<br>\r\nshizuku:do what<br>\r\n<br>\r\nhitomi:this<br>\r\n<br>\r\nhitomi says as she makes four more water snakes that all launch at shizuku and mikoto going under mikoto's skirt and shizuku's dress through there underwear and into there ass's and vagina's they begin to moan from ectasy theres knees get weak causing them to fall to the ground they notice there breasts,ass and belly are filling with water<br>\r\n<br>\r\nshizuku:whats happening mmmmmm<br>\r\n<br>\r\nmikoto:how are you doing this<br>\r\n<br>\r\nhitomi:i have control over water and most of the body is water which means all i have to do is re-arrange it in a matter of speaking<br>\r\n<br>\r\nhitomi says as shizuku and mikoto moan,blush and fill with water mikoto's now a DD cup her belly looks five months pregnant and her ass is a foot out shizuku is the same but her breasts are E cup the water is causing mikoto's skirt to raise revealing her black panties making her blush more<br>\r\n<br>\r\nmikoto:do-dont look <br>\r\n<br>\r\nsayaka:i like natsuru's ass more<br>\r\n<br>\r\nmeanwhile natsuru is finally comming back to even with the immense pleasure shes feeling she attempts to move but is having a difficult time with her new size and the pleasure shes feeling she finally manages to roll over on to her back and notices whats happening to shizuku and mikoto<br>\r\n<br>\r\nnatsuru:*ive gotta help them wait that kampfer is doing all this maybe i can use my fire its worth a shot*<br>\r\n<br>\r\nnatsuru starts using her powers trying to ignore the water entering her<br>\r\n<br>\r\nhitomi:this is fu-OOOWW whats happening it hurts<br>\r\n<br>\r\nrika:whats wrong hitomi<br>\r\n<br>\r\nryoko:look at her stomach its blowing up<br>\r\n<br>\r\nhitomi:but how<br>\r\n<br>\r\nsayaka:look at natsuru her bracelets glowing<br>\r\n<br>\r\nhitomi:but how is she doing this<br>\r\n<br>\r\nshizuku:she has power over fire shes heating up the air in your lungs<br>\r\n<br>\r\njust then everyone of the white kampfers start to crouch over in pain there whole body inflating they run away<br>\r\n<br>\r\nhitomi:have fun deflating your friend<br>\r\n<br>\r\nthe water...</span></div></div>",
            "created":1276923600,
            "id":902515,
            "title":"natsuru learns a new move"
        },
        "1232322":{
            "choices":[
                "sucking on natsuru's nipples it faster and then leads to a threesome",
                "they squeeze natsuru's breasts"
            ],
            "content":"<div class=\"\"><div> <span>shizuku,mikoto and natsuru stop filling up and the water that hasnt entered there bodies goes into the ground<br>\r\n<br>\r\nshizuku:looks like it stopped<br>\r\n<br>\r\nmikoto:lets go help natsuru<br>\r\n<br>\r\nshizuku:kay lets get over to her<br>\r\n<br>\r\nthey stand up with some difficulty grabbing there back and bellies to help them when they finally get up they start walking towards natsuru<br>\r\n<br>\r\nmikoto&amp;shizuku:are you okay natsuru<br>\r\n<br>\r\nnatsuru:yeah i can finally speak again although im this big can you two help me get against the bridge wall right there<br>\r\n<br>\r\nshizuku:of course<br>\r\n<br>\r\nthey all start to move push and pull natsuru till they get her propped up<br>\r\n<br>\r\nnatsuru:thanks<br>\r\n<br>\r\nnatsuru starts blushing realising she can see mikoto's panties and down her shirt she can also see down shizuku's dress seeing alot of there cleavage<br>\r\n<br>\r\nnatsuru:*cough*<br>\r\n<br>\r\nshizuku:whats the matter natsuru<br>\r\n<br>\r\nnatsuru:i can see your guys breasts and mikoto's panties<br>\r\n<br>\r\nthey both try to cover up embaressed<br>\r\n<br>\r\nmikoto:lik-like your one to talk your huge and the only clothing you have on is a shirt with no buttons around your shoulders and these<br>\r\n<br>\r\nmikoto grabs natsuru's breasts causing her to moan and blush<br>\r\n<br>\r\nnatsuru:stop mikoto<br>\r\n<br>\r\nits then that shizuku notices a small trickle of water comming out of her breasts that increases when squeezed shizuku puts her hand in her dress and notices her bra is wet she then walks up to mikoto and natsuru whos still getting her breasts squeezed by mikoto<br>\r\n<br>\r\nmikoto:what was that natsuru huh uuuh shi-shisuku what are you doing<br>\r\n<br>\r\nshizuku puts her hand in mikotos shirt and squeezes her breasts causing the wet stain on mikoto's bra to grow<br>\r\n<br>\r\nshizuku:just like i thought<br>\r\n<br>\r\nmikoto:why did you just do that<br>\r\n<br>\r\nshizuku:oh well it seems our breasts are leaking water i think thats how we can get it all out of us<br>\r\n<br>\r\nmikoto:oh<br>\r\n<br>\r\nmikoto and shizuku say blushing<br>\r\n<br>\r\nshizuku:yeah so we should get started<br>\r\n<br>\r\nmikoto:wait what are you doing<br>\r\n<br>\r\nmikoto asks because shizuku is removing her hat jacket and dress<br>\r\n<br>\r\nshizuku:well if we try to leave the bridge people will probably see us and soon enough my dress and your shirt are gonna get wet its only a matter of time before the water soaks through our bras<br>\r\n<br>\r\nmikoto:yeah but oh your right<br>\r\n<br>\r\nmikoto starts doing the same and they strip to there underwear they then look and feel there breasts bellies and butts<br>\r\n<br>\r\nmikoto:i went up three bra sizes i think from a C to a E<br>\r\n<br>\r\nshizuku:well i went from a D to a F oh well mmm this bra is to tight uh there we go<br>\r\n<br>\r\nshizuku has a difficult time getting her bra off when she does it launches off and her breasts bounce out mikoto and natsuru look and start blushing<br>\r\n<br>\r\nmikoto:i guess its my turn<br>\r\n<br>\r\nmikoto does the same thing when her breasts bounce out she tries to cover them up then natsuru tries to reach her own nipples but realises she cant her breasts are to big shizuku and mikoto notice this<br>\r\n<br>\r\nmikoto:do-do you need help natsuru<br>\r\n<br>\r\nmikoto says blushing and covering herself with her face turned away<br>\r\n<br>\r\nnatsuru:yeah please<br>\r\n<br>\r\nshizuku:ok lets get started<br>\r\n<br>\r\nthey start getting the water out by...</span></div></div>",
            "created":1276923600,
            "id":902544,
            "title":"natsuru needs to be deflated"
        },
        "12323221":{
            "choices":[
                "before they can help natsuru the white kampfers come back they were watching",
                "they get natsuru dressed and carry her home"
            ],
            "content":"<div class=\"\"><div> <span>mikoto starts squeezing one of natsuru's breasts causing her to moan,blush and breath heavy causing mikoto to blush to<br>\r\n<br>\r\nmikoto:sorry natsuru just deal with it till we get all the water out<br>\r\n<br>\r\nnatsuru:ok MMMMMMMMMM shizuku what are you doing<br>\r\n<br>\r\nnatsuru asks as shizuku starts sucking on her other nipple<br>\r\n<br>\r\nmikoto:yeah shizuku why are you doing that<br>\r\n<br>\r\nshizuku:because itll be faster then squeezing her breasts<br>\r\n<br>\r\nshizuku says going back to sucking on her nipple mikoto looks at her and then does the same for the other one<br>\r\n<br>\r\nnatsuru:mmmmmmm fine but not so rough mmmmmmmm<br>\r\n<br>\r\nnatsuru says as the suck on her breasts there stomach growing noticably turning natsuru on even more<br>\r\n<br>\r\nnatsuru:mmmmmmmmmmm AAAAAH<br>\r\n<br>\r\nnatsuru screams as the pleasure becomes to much and she orgasms a massive amount of water out of her vagina and breasts making mikoto and shizuku swallow a large amount making there bellies half the size of a beachball meanwhile natsuru's breasts the size of watermelons her butt the same and her belly slightly smaller then a beachball mikoto and shizuku stop for a second coughing<br>\r\n<br>\r\nshizuku:that was alot are you ok natsuru<br>\r\n<br>\r\nnatsuru:yeah that just felt to good<br>\r\n<br>\r\nnatsuru says trying to catch her breath<br>\r\n<br>\r\nnatsuru:but im sorry about this in advance<br>\r\n<br>\r\nmikoto: sorry about- EEEEEEHMMMMMMMM<br>\r\n<br>\r\nmikoto and shizuku shreik in surprise as natsuru moves forward surprisingly fast and puts her hands in shizuku's purple panties and mikoto's panties and starts rubbing there pussies they try and pull her hand out but cant<br>\r\n<br>\r\nshizuku:no stop what are you doing?<br>\r\n<br>\r\nnatsuru:helping you now if you can continue helping me please do<br>\r\n<br>\r\nshizuku:ok<br>\r\n<br>\r\nmikoto continues sucking on natsuru's breasts and they both start rubbing her pussy making it feel even better natsuru in turn starts sucking shizuku breasts shizuku then starts fondling and squeezing natsuru's breast causing them to all go back on there hands as they orgasm there all back to normal except for there breasts and asses they're all one cup bigger bras and have five inches more to there asses except shizuku's and mikoto's bellies look five months pregnant because of the water they swallowed and natsuru's stomach has a pretty big bulge to from drinking from shizuku natsuru is turned on by there bodies and starts playing with them again causing them to move back and roll there eyes they start doing the same to natsuru they all do this till they orgasm again causing natsuru to falls back completely worn out from three orgasms<br>\r\n<br>\r\nmikoto:natsuru are you ok<br>\r\n<br>\r\nnatsuru:i-ill be fine just need to catch my breath<br>\r\n<br>\r\nshizuku:not before one more round you deserve a reward<br>\r\n<br>\r\nthen shizuku and mikoto crawl up to her and start playing with her nipples with one hand and her pussy with the other causing her to breath heavier<br>\r\n<br>\r\nnatsuru:st-stop pl-please<br>\r\n<br>\r\nthey continue sucking her breast and licking her pussy till she passes out<br>\r\n<br>\r\nmikoto:i guess we went to far<br>\r\n<br>\r\nshizuku:yeah but lets let her rest while her panties pants and shirt can still work lets get her underwear back on her ill give her my dress jacket and hat and ill wear her jeans and shirt there the only think that fit this belly there already missing there buttons so get dressed then help me get her dressed<br>\r\n<br>\r\nmikoto:ok<br>\r\n<br>\r\nthey get dressed themselves then...</span></div></div>",
            "created":1276923600,
            "id":902583,
            "title":"natsuru's nipples feel good"
        },
        "1233":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "situation c",
                "Situation D",
                "More Situation on Senou Natsuru"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Situation C.<br>\r\nNatsuru has enraged a witch so she casts a spell that makes Natsuru gain 10 lbs for every step.<br>\r\n<br>\r\nSituation D.<br>\r\nWhat if Senou Natsuru become a Sumo Kampfer in the began of the Kampfer Series?</span></div></span></div>",
            "created":1316062800,
            "id":1187783,
            "title":"Try something else."
        },
        "124":{
            "author_id":"lugieausa",
            "author_name":"Lugieausa",
            "choices":[
                "The beginning (1st week)",
                "Later in time ",
                "How she got pregnant"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Option1-So were will it start at the beginning  a day or two after she got pregnant. Option 2-A few months into the pregnancy.(1 or more) Option3-How she got pregnant.</span></div></span></div>",
            "created":1308891600,
            "id":1133665,
            "title":"Pregnant"
        },
        "125":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "chug the whole thing",
                "take one sip",
                "take a couple of gulps"
            ],
            "content":"<div class=\"\"><div> <span>Oneday Natsuru Seno (female was looking in her fridge for something to drink. \"Huh? what this?\" she said as she found an odd looking, yellow drink in a 2 liter bottle. 'I don't remember buying this.\" *snifff *sniff* \"Well it smells alright.\" Natsuru then decided to...  </span></div></div>",
            "created":1259816400,
            "id":800836,
            "title":"Breast Expansion"
        },
        "13":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Magic",
                "Force Feed",
                "Blueberry",
                "Eating",
                "Breast Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is going to happen's to Akane Mishima?</span></div></span></div>",
            "created":1259643600,
            "id":800032,
            "title":"Akane Mishima"
        },
        "131":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "Possessed by a hungry ghost",
                "cursed to gain",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some types of magical weight gain.</span></div></span></div>",
            "created":1315717200,
            "id":1185310,
            "title":"Magic"
        },
        "132":{
            "author_id":"oddpersona",
            "author_name":"OddPersona",
            "choices":[
                "A bunch of desserts",
                "A spread of various foods",
                "Salads (No seriously)"
            ],
            "content":"<div class=\"\"><div> <span>Somewhere within an abandoned warehouse, a young woman wearing a high school uniform and blazing red hair is found unconscious sitting in a chair wrapped in chains. A bright light is focus on her, where outside the light's diameter is pure darkness.<br>\r\n<br>\r\n\"Ugh.\" She slowly comes too, \"What the-?\"<br>\r\n<br>\r\nShe tries to get up but finds herself unable to move. Eyes widening she notices the chains binding her to the chair, turning her attention to the ends of the chain she sees knives on the chain's ends embedded deep within the ground.<br>\r\n<br>\r\nShe recognizes the chains, \"Shizuku you bitch! We had an alliance remember?\" She struggles to get out, but the chains held her down. She grits her teeth, 'When I get my hands on her.\"<br>\r\n<br>\r\nThe sound of a cart being pushed brought Akane back the situation at hand. Turning her head to the source her eyes widen to see Natsuru, only there was some key differences.<br>\r\n<br>\r\nOne, Natsuru was in his kampfer form, meaning he's practically a she right now. Second, she was wearing that revealing maid outfit she previously worn during the cultural festival. Three, she was fat.<br>\r\n<br>\r\nDespite being unable to move much Akane can't help but stare wide eyed at the chubby Natsuru as the latter pushes some sort of dining cart covered with a white sheet. She didn't expect Natsuru to let him, er, herself go like that and wear that outfit at the same time.<br>\r\n<br>\r\nNatsuru herself could be best described as \"pleasently plump\". Her once impressive bustline and hips were now nearly double in size, and Akane could see that a rather big belly pushing its way out from the confines from Natsuru's maid costume. Natsuru's face also look a little puffy but it wasn't so much, just making her cheeks a bit more pinchable.<br>\r\n<br>\r\nNatsuru's maid outfit didn't do much to conceal Natsuru's new girth. The blue hair woman's bust was close of spilling out of the thing, and the skirt was practically force up by the wide hips, exposing Natsuru's panties to the wandering eye.<br>\r\n<br>\r\n\"What in the world happen to you partner?\" Akane thought outloud before she heard the sound of another cart coming from another direction. Turning her head, Akane's eyes widen to see Shizuku also in revealing maid costume, also pushing a dining cart that's covered, and also fat as well.<br>\r\n<br>\r\nThough in comparison, Shizuku's weight gain was much larger in comparison to Natsuru's, and mostly settled in the woman's legs and thighs giving her pear shape body. While Natsuru was plump, Shizuku was borderlining obese. Shizuku's hips were near about three times their normal sizes, pushing the skirt of the maid outfit Shizuku is wearing out of the way revealing black panties being buried by the woman's thighs. Shizuku's stomach was also spilling out of the maid outfit, the chubby belly hanging, ending to just about the waist. The class president's breasts also poured out of the maid outfit due to stress, revealing a black bra on the verge of snapping in half due to Shizuku's massive chest. Lastly Shizuku's face was no longer thin as Akane remember, it was puffy now and a hint of a double chin was showing.<br>\r\n<br>\r\nDespite being bound up, Akane was laughing her head off, \"I must say class rep that's a good for ya! What are you planning with your new body, attract all the chubby chasers out there?\" She laughs again, but soon stops when she sees Shizuku not respond what so ever, she just keeps on pushing that dining cart.<br>\r\n<br>\r\n'The deuce?' Akane thinks to herself as she takes a hard look at two women. Both of their eyes gave off a hollow look, as if they were hypnotize or something.<br>\r\n<br>\r\n'Well that explains Natsuru as a plus size maid and Shizuku is a freakin' cow.' Akane narrow her eyes, 'Something ain't right here.'<br>\r\n<br>\r\nSoon both maids stop in front of the bound red head, let go of their respective carts, turn towards the center, and bow as if someone of great power/importance was coming.<br>\r\n<br>\r\n\"Akane-chan is ready for you Kaede-ojou-sama.\" Both maids say in a monotone voice.<br>\r\n<br>\r\nOut of the darkness came one of the school's top beauties and one of the few people on Akane's \"Shit List\". Kaede Sakura in the flesh, and unfortuanly the only normal weight one Akane mentally added.<br>\r\n<br>\r\nKaede waves the two maids off, \"Thank you. Please standby until I need you two okay?\" She finishes with a giggle, making Akane grind her teeth in fury.<br>\r\n<br>\r\nNatsuru and Shizuku gave a bow, \"Yes Ma'am.\" They soon stood up and went back to the darkness, their enlarged forms disappear with it's shroud.<br>\r\n<br>\r\nKaede sighs and places a hand on her cheek, \"They are a great help the two of them.\" She then turns towards Akane with a smile, \"Why hello Akane-chan.\"<br>\r\n<br>\r\n\"Don't Akane-chan me you damn bitch.\" Akane snarls through clech teeth.<br>\r\n<br>\r\nKaede's face turn hurt, \"Is that how you act towards your friends Akane-chan?\"<br>\r\n<br>\r\nAkane's mouth curls into a feral grin, \"How about telling Shizuku the whale to undo her damn chains on me and I'll give you twelve rounds, buddy.\"<br>\r\n<br>\r\nKaede's face went from hurt to neutral, she covers her mouth with her right hand, her eyes went from their usually yuppiness to downright predatory, \"My, my, my such threatening words coming from you. It's a wonder that the police hasn't arrested such a vulgar girl as you.\"<br>\r\n<br>\r\n\"Well it seems the school idol shows her true colors, Masumi will pay me a fortune for this scoop.\" Akane's grin never leaving her.<br>\r\n<br>\r\nKaede gives a sigh, \"And I prepare such a loving treat for you, it would feel like such a waste if you just snap and snarl when someone is trying to be friendly.\"<br>\r\n<br>\r\nAkane's face then went serious, \"Let's just say you ain't on my top ten. More imporantly, what did you do with that space case of a partner of mine and that manipulative witch Shizuku?\"<br>\r\n<br>\r\nKaede giggles, \"Oh you mean Natsuru-chan and Shizuku-chan? Well I guess you can blame that on me if you must.\"<br>\r\n<br>\r\nAkane's eyes widen, \"Say what?!\"<br>\r\n<br>\r\nKaede's predatory look return once again, \"You know it's quite easy with the right sources. I had one of my allies whip a little surprise that enable to put an enemy kampfer under my control, of course she could only food as a medium in order for it to work but I must say Natsuru-chan and Shizuku-chan still look so cute even despite their little weight problem. The first target was Shizuku-chan, I invited her over to my place as a friendly get together. I gave her one of her favorite treats laced with the control substance and well...you see what happened to her. I was quite surprise at her willpower, course I had to keep on feeding her until she finally fell into my control.\"<br>\r\n<br>\r\nAkane clenches her hands, \"I take it that dumbass Natsuru fell into your little plan hook, line, and sinker.\"<br>\r\n<br>\r\nKaede smiles, \"You are learning. Yes, I repeated the entire process for her, however it only took not as much for Shizuku. Hench why she isn't as big, still she still looks pretty cute wouldn't you say Akane-chan?\"<br>\r\n<br>\r\n\"Can the 'Akane-chan' crap.\" Akane says, \"What is it that you're going to do with me?\"<br>\r\n<br>\r\nKaede went over to Akane and tilts forward just so they're face to face, \"I'm well aware of you strong attraction to Natsuru, so I'm planning on having you join her as one of my servants.\"<br>\r\n<br>\r\nAkane's face went dangerous, \"I ain't planning on joining your little harem of brainless devotees, and when I get out of these damn chains you're going to have a nice look of how much of a good shot that I am, and I'm feeling trigger happy.\"<br>\r\n<br>\r\nKaede's mouth turn into a grin, \"You know, you better rethink that little proposition of yours. The one who made the control formula said that the more resiliant someone is, the more I have to fee them. But that's okay.\" Kaede grabs one of Akane's breasts and licks her lips, \"I actually want to see how far you can go to resist me as you gain pound by pound. I wonder if you're going to be bigger than Shizuku-chan when this is over.\"<br>\r\n<br>\r\nAkane grits her teeth, \"Do your worst bitch.\"<br>\r\n<br>\r\n\"I intend to.\" Kaede returns as she lets go of Akane and makes her way to one of the dining cart. \"I hope you hungry Akane-chan.\" She says as she pulls the cover off to reveal...</span></div></div>",
            "created":1280034000,
            "id":924085,
            "title":"Force Feed"
        },
        "1321":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "250",
                "300",
                "350"
            ],
            "content":"<div class=\"\"><div> <span>\"Lets see if you have free will after a barrage of desserts.\"<br>\r\n<br>\r\n\"Bring it on.\"<br>\r\n<br>\r\nKaede broght in a machine with 10 pairs of arms.<br>\r\n<br>\r\n\"This machine will do the stuffing. While I go and get my pedicure. Later.\"<br>\r\n<br>\r\nThe machine started up, grabbed a handful of cake and started stuffing her mouth.<br>\r\n<br>\r\nAs the machine stuffed her, she kept getting fatter.<br>\r\n<br>\r\nWhen it was halfway through, she was</span></div></div>",
            "created":1315976400,
            "id":1187296,
            "title":"A bunch of desserts"
        },
        "13213":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "\"Yes\"",
                "\"No\""
            ],
            "content":"<div class=\"\"><div> <span>Akade gain 350lbs that she ate.<br>\r\n<br>\r\nShe look down at her body, her breast, butt, and belly got bigger and fatter.<br>\r\n<br>\r\nThen the waiter appear again and said to Akade \"Anything else, Akade?\"<br>\r\n<br>\r\nThen Akade answer to the waiter \"Well....\"</span></div></div>",
            "created":1316322000,
            "id":1189795,
            "title":"350"
        },
        "132131":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "700",
                "850"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I want all your best meats.\"<br>\r\n<br>\r\nThe waiter then brought a huge pile of meat and started shoving it down her throat.<br>\r\n<br>\r\nAs she ate she kept getting fatter and fatter.<br>\r\n<br>\r\n5 hours later she was</span></div></span></div>",
            "created":1316322000,
            "id":1189796,
            "title":"\"Yes\""
        },
        "1321311":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Male Form",
                "Female Form"
            ],
            "content":"<div class=\"\"><div> <span>Akane gain a 700lbs.<br>\r\n<br>\r\n\"Keep the money, waiter. Bye.\" said Akane to the waiter.<br>\r\n<br>\r\nAs she exit the restaurants.<br>\r\n<br>\r\nBut just she go home, when someone voice said \"Akane? Is that you?\"<br>\r\n<br>\r\nThen Akane turn around and saw someone was Senou Natsuru in......</span></div></div>",
            "created":1316922180,
            "id":1194305,
            "title":"700"
        },
        "13213112":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "Bar-b-que hut",
                "Pizzaria"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Natsuru.\"<br>\r\n<br>\r\n\"You seem to be putting on a little weight.\"<br>\r\n<br>\r\n\"I may have put on a few, but I'm still the same Akane.\"<br>\r\n<br>\r\n\"Okay, so how did you gain so much?\"<br>\r\n<br>\r\n\"I had an all-you-can eat buffet at the resterant.\"<br>\r\n<br>\r\n\"Is it still open?\"<br>\r\n<br>\r\n\"Yeah.\"<br>\r\n<br>\r\nNatsuru then ran into the resterant.<br>\r\n<br>\r\n\"Now what to do? Guess I'll just eat some food at the<br>\r\n</span></div></div>",
            "created":1316922840,
            "id":1194310,
            "title":"Female Form"
        },
        "133":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "she was turning blue",
                "She started swelling",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Akane was at home reading a book when she started getting hungry.<br>\r\n<br>\r\nThen a knock on the door.<br>\r\n<br>\r\nShe opened it to only see a blueberry pie.<br>\r\n<br>\r\n\"Yum!\"<br>\r\n<br>\r\nShe brought it in and ate a slice.<br>\r\n<br>\r\nWhen she was finished the slice, she noticed that</span></div></div>",
            "created":1316149200,
            "id":1188297,
            "title":"Blueberry"
        },
        "1331":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "belly",
                "boobs",
                "butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her skin started changin from a white to a deep blue.<br>\r\n<br>\r\n\"Eek!! What's happening to me? This better not affect my social status.\"<br>\r\n<br>\r\nShe then took notice that she was starting to balloon with juice in her</span></div></span></div>",
            "created":1316235600,
            "id":1188890,
            "title":"she was turning blue"
        },
        "13311":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "cheeks",
                "butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her belly started swelling with the juice.<br>\r\n<br>\r\n\"It almost looks like I'm pregnant.\"<br>\r\n<br>\r\nIt kept swelling and swelling.<br>\r\n<br>\r\nThen her_started to join in.</span></div></span></div>",
            "created":1316408400,
            "id":1190474,
            "title":"belly"
        },
        "133111":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "boobs",
                "butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her cheeks also began expanding with juice.<br>\r\n<br>\r\nThey looked like chipmunk cheeks when they were done.<br>\r\n<br>\r\n\"My face. How can this get any worse?\"<br>\r\n<br>\r\nThen the next thing that expanded was her</span></div></span></div>",
            "created":1316494800,
            "id":1191314,
            "title":"cheeks"
        },
        "14":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry",
                "Force Feed",
                "Eating",
                "Magic",
                "Breast Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is happened to Mikoto Kondo?</span></div></span></div>",
            "created":1259643600,
            "id":800034,
            "title":"Mikoto Kondo"
        },
        "141":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "Natsuru(male)",
                "Natsuru(female)",
                "Akane"
            ],
            "content":"<div class=\"\"><div> <span>Mikoto was at home trying a new recipe for blueberry-flavored curry.<br>\r\n<br>\r\nWhen she was done she quickly ate it.<br>\r\n<br>\r\n\"Delicious! I'm so glad I found that recipe on my doorstep.\"<br>\r\n<br>\r\nWhen she finished the whole pot, she noticed something on the back of the recipe.<br>\r\n<br>\r\n\"Warning: Do not ingest whole pot.\"<br>\r\n<br>\r\nShe started feeling strange, she ad noticed that she was turning blue.<br>\r\n<br>\r\n\"I can't let anyone see me like this.\"<br>\r\n<br>\r\nThen the doorbell rang.<br>\r\n<br>\r\nThe person at the door was...</span></div></div>",
            "created":1315717200,
            "id":1185371,
            "title":"Blueberry"
        },
        "15":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Kaede Sakura",
                "Rika Ueda",
                "Sayaka Nakao",
                "Ryoka Yamakawa",
                "Hitomi Minakawa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose your white kampfer to gain weight.</span></div></span></div>",
            "created":1259643600,
            "id":799991,
            "title":"More"
        },
        "151":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Breast Expansion",
                "Eating",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is happen to Kaede Sakura?</span></div></span></div>",
            "created":1259643600,
            "id":800038,
            "title":"Kaede Sakura"
        },
        "1512":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Restaurants",
                "Eating Contest"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kaede Sakura was walking in downtown.<br>\r\n<br>\r\nThen she hear tummy growling and said \"I'm hungry. I need to go to the place to eat.\"<br>\r\n<br>\r\nKaede Sakura began to search for a place to eat, until she a place is....</span></div></span></div>",
            "created":1317003480,
            "id":1195008,
            "title":"Eating"
        },
        "15122":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "soup",
                "bread"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, if I'm gonna get some food, it may as well be free.\"<br>\r\n<br>\r\nShe then walked up to the table with two fat woman.<br>\r\n<br>\r\n\"Okay people. For this contest, we will have three courses. Well start with an appitizer.\"<br>\r\n<br>\r\nThe appitizer was</span></div></div>",
            "created":1317004620,
            "id":1195028,
            "title":"Eating Contest"
        },
        "152":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry",
                "Eating",
                "Force Feed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is going to happen's to Rika Ueda?</span></div></span></div>",
            "created":1259643600,
            "id":800039,
            "title":"Rika Ueda"
        },
        "153":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Magic",
                "Breast Expansion",
                "Eating"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is going to happening to Sayaka Nakao?</span></div></span></div>",
            "created":1259643600,
            "id":800040,
            "title":"Sayaka Nakao"
        },
        "154":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Force Feed",
                "Blueberry"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is happened to Ryoka Yamakawa?</span></div></span></div>",
            "created":1259643600,
            "id":800041,
            "title":"Ryoka Yamakawa"
        },
        "155":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Breast Expansion",
                "Eating",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is happen's to Hitomi Minakawa?</span></div></span></div>",
            "created":1259643600,
            "id":800043,
            "title":"Hitomi Minakawa"
        },
        "1553":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry",
                "Pregnant",
                "More again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More expansion for Hitomi Minakawa.</span></div></span></div>",
            "created":1277010000,
            "id":902924,
            "title":"More"
        },
        "15533":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Fat Magic",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Magic of Weight Gain on Hitomi Minakawa?<br>\r\n<br>\r\nThis one call Fat Magic.</span></div></span></div>",
            "created":1317499320,
            "id":1198704,
            "title":"More again"
        },
        "155331":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "body changes",
                "foods"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hitomi was walking home when she found a strange book.<br>\r\n<br>\r\n\"Hmmm? How to change your body with magic.\"<br>\r\n<br>\r\nShe took the book home with her.<br>\r\n<br>\r\n\"Which section should I use? Body changes or foods?\"</span></div></span></div>",
            "created":1317500880,
            "id":1198723,
            "title":"Fat Magic"
        },
        "1553312":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Cake",
                "Pizza"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"let me see which food should i use magic?\" said Hitomi as she look at the book.<br>\r\n<br>\r\nShe turn the page, and page, and page, util she stop turn page and saw a food that she looking for was.....</span></div></span></div>",
            "created":1317501300,
            "id":1198732,
            "title":"Foods"
        },
        "15533122":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "346",
                "478"
            ],
            "content":"<div class=\"\"><div> <span>\"That pizza looks good. I want that with everything on it.\"<br>\r\n<br>\r\nThen the book glowed and magically  created a giant pizza.<br>\r\n<br>\r\n\"That looks good. Time to eat.\"<br>\r\n<br>\r\nShe started eating piece after piece.<br>\r\n<br>\r\nIn 1 hour she was</span></div></div>",
            "created":1317502080,
            "id":1198746,
            "title":"Pizza"
        },
        "155331221":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "giant cake",
                "humongous pie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"That was good. I seem to have outgrown my shirt.\"<br>\r\n<br>\r\nShe then wiped the sauce off her lips.<br>\r\n<br>\r\n\"Now for dessert.\"<br>\r\n<br>\r\nShe opened the book again.<br>\r\n<br>\r\n\"Now to create some</span></div></span></div>",
            "created":1318822800,
            "id":1207879,
            "title":"346"
        },
        "155332":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "yes",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a curse where she gets fat with every step she takes?</span></div></span></div>",
            "created":1317499800,
            "id":1198708,
            "title":"Next"
        },
        "1553322":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Yeah",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Hitomi Minakawa become a Sumo Kampfer in what if version?</span></div></span></div>",
            "created":1317499980,
            "id":1198711,
            "title":"more"
        },
        "15533222":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "fruit transformation",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a regular fruit transformation?</span></div></span></div>",
            "created":1322021940,
            "id":1227464,
            "title":"Next"
        },
        "155332221":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Apple",
                "Next Fruits Transformation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Apple on Hitomi Minakawa?</span></div></span></div>",
            "created":1322073540,
            "id":1227669,
            "title":"Fruit Transformation"
        }
    },
    "info":{
        "author_id":"jonwii",
        "author_name":"speechjon",
        "brief_description":"One boy and all the girl from kampfer are getting fatter",
        "created":1259709300,
        "description":"<td align=\"left\" class=\"norm\">-One male weight gain is natsuru seno.<br>\r\n-Female weight gain<br>\r\n-Eating<br>\r\n-Force Feed<br>\r\n-Breast expansion<br>\r\n-Magic<br>\r\n-Obese<br>\r\n-Blueberry and fat<br>\r\n-Immobile<br>\r\n-Pregnant<br>\r\n<br>\r\nNot Allowed:<br>\r\n-Vore<br>\r\n-Death<br>\r\n-Mass Gain Weight<br>\r\n<br>\r\nIf you don't know what kampfer is.<br>\r\nGo at <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://en.wikipedia.org/wiki/Kampfer\" target=\"_blank\">http://en.wikipedia.org/wiki/Kampfer</a> to learn about it.</td>",
        "id":1623078,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1411793520,
        "modified":1411793520,
        "pretty_title":"Kampfer Weight gain"
    }
}