{
    "chapters":{
        "1":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Jedi Masters",
                "Jedi Padawans",
                "Royalty",
                "Bounty Hunters",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a Category</span></div></span></div>",
            "created":1530939600,
            "id":2516003,
            "title":"List"
        },
        "11":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Shaak Ti",
                "Aayla Secura",
                "Luminara",
                "Mara Jade",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>You have invaded the Jedi Temple in search of holocrons<br>\r\n<br>\r\nThey will not kill you, yet you've seen too much and they cannot let you go.<br>\r\nYou will be punished for your actions.<br>\r\n<br>\r\nWhich one of these stoic Jedi will kickstart your new life of smelling Jedi feet?</span></div></div>",
            "created":1530939600,
            "id":2516005,
            "title":"Jedi Masters"
        },
        "111":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Take a deep breath",
                "Shaak Ti uses force"
            ],
            "content":"<div class=\"\"><div> <span>Your eyes shot open in a dimly-lit, silver plated room inside of the Jedi Temple. There was one chair in the center of the room, a chair very similar to a seat of the council, only it had a small hold at the bottom, one the let your head stick out from below as the chair held you in place. Suddenly footsteps drew your attention as a tall Togruta Jedi in thick Jedi robes approached you.<br>\r\n<br>\r\n\"You're awake. Good\"<br>\r\n<br>\r\nShe said, sitting in the very chair that held you down.<br>\r\n<br>\r\n\"I am Master Shaak Ti, I've personally been watching over you for some amount of time now.\"<br>\r\n<br>\r\nSome time? You've only been here for five minutes, what did she mean?<br>\r\n<br>\r\n\"The Jedi have been wiping all of your memories of your stay here over the past few weeks\" <br>\r\n<br>\r\nSaid Shaak Ti, as if reading your mind.<br>\r\n<br>\r\n\"Weeks I've spent meditating on how to truly punish you, stewing in these.\"<br>\r\n<br>\r\nSaid the Jedi, raising up a thick leather boot and slamming it down beside your head. The Jedi Master twisted her boot around, letting you hear the squelching of sweat around her foot and sent a wave a fear through you.<br>\r\n<br>\r\n\"And it came to me. You see, I've spent many a years in these boots and once we captured you I went into deep meditation and thought of all the different ways to subject you to what rests inside\"<br>\r\n<br>\r\nThe Jedi Master looked you dead in the eyes as she started to raise her foot from her boot.<br>\r\n<br>\r\n\"You will pay for your crimes against the Jedi.\"<br>\r\n<br>\r\nShaak Ti's boot fell loudly to the floor as her bare foot, glistening with sweat, was now free. She leaned back in her chair as her foot descended down onto your face, her slender toes spread wide as she splayed them around your nose. <br>\r\n<br>\r\n\"You will smell my feet\"<br>\r\n<br>\r\nSaid the Jedi as she cupped her toes together around your nose, trapping you underneath a wall of the most rancid stink you've ever smelled.<br>\r\n<br>\r\n\"Or I will make this worse for you.\"</span></div></div>",
            "created":1530939600,
            "id":2516018,
            "title":"Shaak Ti"
        },
        "112":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "\"Finally? What are you talking about? who are you? Where am I? What's going on?\"",
                "Remain Silent"
            ],
            "content":"<div class=\"\"><div> <span>Your eyes fluttered open to unfamiliar surroundings, a small dark bedroom with one very thin window that let in a hint of moonlight through a set of slanted blinds. As the hum of speeders outside filled the air, your mind drifted to think about  how it was a slightly unusual bedroom, with only a small bed and a carpet at the center, but then again, what else do you need besides a bed to truly make a room a bedroom?<br>\r\n<br>\r\n\"I see you are finally awake\"<br>\r\n<br>\r\nYours eyes widened and you looked over to realize the Twi'lek floating above the carpet at the center of the room, her legs intertwined in a meditative manner and her hands rested on her knees.<br>\r\n<br>\r\n\"Welcome to my private quarters, I am glad to finally speak with you.\"<br>\r\n<br>\r\nShe said, a gitty grin wrapped around her face.</span></div></div>",
            "created":1530939600,
            "id":2516115,
            "title":"Aayla Secura"
        },
        "1121":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "\"ther-.. there's so much toejam.. please, let me.. Sniff all of your toejam..\"",
                "Living hell"
            ],
            "content":"<div class=\"\"><div> <span>\"shhhh shh shh shh shh...\"<br>\r\n<br>\r\nThe Twi'lek whispered in a soothing manner as she slowly floated back down to the ground.<br>\r\n<br>\r\n\"As I say, you are in my private quarters outside of the Jedi Temple, as for introductions... I am Master Aayla Secura.\"<br>\r\n<br>\r\nHer grin only grew from her as she carefully explained your situation.<br>\r\n<br>\r\n\"You see, once I heard of what you did, what you've seen, I knew that the council would not simply let you go, so I begged you to be transfered to me for questioning, I had so many fun ideas, but when they refused I got so upset.\"<br>\r\n<br>\r\nThe Jedi giggled with devious satisfaction<br>\r\n<br>\r\n\"So I did what I always do. I trained. For weeks I trained and trained, challenging myself with the most difficult lightsaber combat programs, after all anger has no place with the Jedi, so I had to get it out somehow. The council spent weeks on you, wiping your mind and breaking it down while I trained, it was to my surprise that once they were finished they left it to me to punish you for your crimes against the Jedi.\"<br>\r\n<br>\r\nBy now the Twi'lek had begun walking over to you and she slowly leaned onto the bed, climbing in with you to straddle your stomach and pin down your arms.<br>\r\n<br>\r\n\"I have the perfect idea on how to do it as well.\"<br>\r\n<br>\r\nAayla moved her legs forward, resting her thick leather boots on either side of your head, letting her bitty sink into you as she sat on your stomach.<br>\r\n<br>\r\n\"See, I trained for the entirety of you weeks here with the Jedi with no breaks apart from required sustenance, not even to clean myself\".<br>\r\n<br>\r\nAs her boots pressed against the sides of your head you could hear something. You thought about it for a second and.. you weren't certain, but it sounded like her toes, rubbing against the insides of her boots.<br>\r\n<br>\r\n\"And since you can never be permitted to leave..\"<br>\r\n<br>\r\nAayla's grin turned into a toothy half-smile.<br>\r\n<br>\r\n\"In the name of the Jedi, I sentence you to a lifetime of serving under me, truly smelling the fruits of my labor.\"<br>\r\n<br>\r\nWith that, she raised her feet up above your face, using the force to slide off her boots and let them rest on either side of your head once more. Her sweaty feet glistened in the moonlight as she wiggled her long, narrow toes, her dirty blue soles emitting a stench so foul it could send a Rancor running. Aayla giggled once again with delight as she lowered her blue peds, letting her gunked up, long, narrow toes rest elegantly around your nose.<br>\r\n<br>\r\nAayla's smile faded into a sadistic grin as her eyes narrowed towards you.<br>\r\n<br>\r\n\"Now take a deep breath of my enchanting aroma\"<br>\r\n<br>\r\nShe said as she slicked your nose with her footsweat.<br>\r\n<br>\r\n\"You'll learn quickly to love that smell, or at least to pretend to\"<br>\r\n<br>\r\nAayla continued, wiggling her rancid toes around your nose, stirring the stench of blue cheese from her toes directly into your nose.<br>\r\n<br>\r\n\"Soon you'll be sniffing my ripe toes like it's air, begging for a chance to snort my sweaty toejam\"<br>\r\n<br>\r\nShe said, pressing her soles harder against your face<br>\r\n<br>\r\n\"And don't you worry, I <i>will</i> keep these rancid things ripe and sweaty for you.\"<br>\r\n<br>\r\nAayla hoisted her feet slightly above your face, letting you see them one more time. The dirt that hugged her feet from being in her boots for so long, the sweat the covered her after letting those rancid soles sit in puddles of the stuff, all the mysterious black and brown gunk between her toes that frankly, you didn't want to know what it was.<br>\r\n<br>\r\n\"So let's hear it, we'll practice..\"<br>\r\n<br>\r\nShe said lowering her feet a little, as if to threaten you.<br>\r\n<br>\r\n\"After all, you are officially bound to my service for life, might as well get use to it. Beg me. Beg me for the pleasure of sniffing up all the gunk from between my sweaty toes.<br>\r\n<br>\r\nDo it, or I make your new life a living hell, my little footsniffer.\"</span></div></div>",
            "created":1530939600,
            "id":2516132,
            "title":"This is where the fun begins"
        },
        "113":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Surrender now and start sniffing Luminara's deadly toes",
                "Delay the inevitable"
            ],
            "content":"<div class=\"\"><div> <span>You struggled in your bindings, thick chains holding you down on your hands and knees as the Mirialan Jedi Master repeatedly kick her boot against a metal binding around your jar that held your mouth shut. <br>\r\n<br>\r\n\"Did your masters warn you of this outcome when you chose to infiltrate the Jedi Temple? Weeks of your life taken away as we ripped information from your weak mind, being bound a gagged in from of me?\"<br>\r\n<br>\r\nLuminara proceeded to kick off her boots, letting them clump to the ground as she wiggled her short, shapley toes dangerously close to your nose, wafting the stench of her sweat-soaked nasty green soles right into your nose.<br>\r\n<br>\r\n\"Spending the rest of your days sniffing the sweaty feet of the most powerful Jedi Masters?\"<br>\r\n<br>\r\nLuminara's feet closed in on you with incredible speed. You tried to pull your head away but the heavy chains only gave you so much room to flee before holding you at Luminara's mercy. Luminara's reeking soles mashed into your face, pressing hard against you as she slid her green peds up and down, drenching your face with her unbearably ripe footsweat. While keeping her left foot tracing her sweat around your face, she lowered her right foot, splaying her toes directly under your nose.<br>\r\n<br>\r\n\"If you couldn't tell from all of the sweat, my boots don't allow my feet to breath, you on the other hand, shall take sharp inhales from between my sweaty toes and prepare yourself for this duty indefinitely.\"<br>\r\n<br>\r\nYou held your breath, but Luminara simply squeezed her toes shut above your nose, stopping any air from flowing between them, leaving your nose pressed under her sharp, swiss-smelling toe trap.<br>\r\n<br>\r\n\"You may hold your breath all you like, I have all day, your outcome will not change. You shall run out of breath, you shall sniff my footsweat with long, deep breaths and you and I shall repeat this process until you willingly smell the foot of any Jedi before you\"</span></div></div>",
            "created":1530939600,
            "id":2516352,
            "title":"Luminara"
        },
        "114":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Submit to you new life of smelling Mara's swampy feet",
                "Struggle, I dare you."
            ],
            "content":"<div class=\"\"><div> <span>You awoke abruptly, sputtering into a gag under a beautiful red haired woman held her large black boot over your nose. You struggled under the woman as she straddled you, but your arms were binded behind your back. You took another sharp inhale, drawing the foul stench from the very toe end of the boot down into your nose as you started to feel the sweat from inside drip onto your face.<br>\r\n<br>\r\n\"Pretty rank, isn't it?\" Asked the girl.<br>\r\n<br>\r\n\"I sure hope so, I wouldn't want you getting off easy after you tried to steal on of our holocrons.\"<br>\r\n<br>\r\nThe redhead laughed, rotating her rancid boot around your nose to stir her bootstink around.<br>\r\n<br>\r\n\"Funny enough I had a look on the holocron and it was of old Jedi punishments used on those the Jedi deemed to dangerous for the galaxy, turns out that one of the oldest punishments was a lifetime of smelling the nastiest feet in the Jedi Order.\"<br>\r\n<br>\r\nThe girl lifted her boot, swinging her feet around. They were absolutely dripping with sweat, letting droplets fall down onto your face.<br>\r\n<br>\r\n\"Can you imagine\"<br>\r\n<br>\r\nShe asked, spreading her slim smelly toes right above your face, showing off all the lint left behind from her incredibly sweaty, thin black ankle socks you realized were stuck in your mouth.<br>\r\n<br>\r\n\"Spending your entire life sniffing the rank feet of the most powerful warriors in the galaxy?\"<br>\r\n<br>\r\nAs the woman wrapped her malodorous toes around your nose, her footsweat slid down your cheeks, your struggling in vein as your only option of breathing was drawing the unfathomable stench of her toes directly into your nose.<br>\r\n<br>\r\n\"The holocron even said that once such a prisoner was obtained, they stopped washing their feet to let their stench grow worse and worse\"<br>\r\n<br>\r\nMara sighed with glee as the cool feeling of your short repetitive breaths felt amazing between her swampy toes<br>\r\n<br>\r\n\"I wish <i>I</i> had my own footsniffer\"<br>\r\n<br>\r\nShe mocked, pressing your nose harder between her toes, causing your next sniff to suck up some of her sweaty Sock lint from in between her big and second toes.<br>\r\n<br>\r\n\"Oh such a good idea\"<br>\r\n<br>\r\nMara taunted once again<br>\r\n<br>\r\n\"We can use the little nose of yours to vacuum all this smelly gunk off my feet, here keep going\"<br>\r\n<br>\r\nMara insisted, pushing your nose even harder once more between her sweaty pink toes, forcing you to suck up more lint as you sniffed at her ripe feet.<br>\r\n<br>\r\n\"Hmm.. ya know.. I'm a Jedi Master.. you tried to steal from us and look at you, already sniffing away at my <i>sweaty feet</i>, why I'd say I have myself the perfect candidate for a lifetime of sniffing my sweaty rak-dogs right here.\"<br>\r\n<br>\r\nMara said with a smile.</span></div></div>",
            "created":1530939600,
            "id":2516355,
            "title":"Mara Jade"
        },
        "1142":{
            "author_id":"c17pilots",
            "author_name":"Weeert",
            "choices":[
                "You make a break for it outside Luke Skywalker's temporary Jedi Temple on Yavin."
            ],
            "content":"<div class=\"\"><div> <span><b>It's been three days since your first encounter with the beautiful redheaded Mara Jade.</b><br>\r\n<br>\r\n<i>Mara was tired after constantly training only stopping for a short few rest breaks.</i><br>\r\n<br>\r\nMara walks up to your cell, even though she's put you through hell you still find her looks to be extremely attractive.<br>\r\nMara: Well, Well, Well, I see that your adjusting to your new living conditions...<br>\r\nYou: Your a b*tch<br>\r\nMara: Well that's not very nice, I think that you need to be punished... Let me sit down here and get comfortable, I haven't washed my feet since the last time... Oh, and I haven't been wearing any socks.<br>\r\n<br>\r\n*Mara unlocks the cell door and walks into your cell, taking a seat on the cot provided to you.*<br>\r\n<br>\r\nMara: Come over here, lie down on the floor.<br>\r\n<br>\r\n*Mara uses the force to bring you to the floor and line you up right underneath her feet.*<br>\r\n<br>\r\nMara: There we go...<br>\r\n<br>\r\n*Mara takes off her long black boots, you can already smell a strong vinegary smell emanating from her soft well taken care of soles.  Her toenails are painted black.*<br>\r\n*She lowers her sweaty vinegary soles right onto your face.  She wraps her toes around your nose. You take a few deep breaths and smell a very strong vinegary smell with a hint of ripe cheese.  The smell causes you to feel light headed and you think that you might throw up all over her beautiful sweaty vinegary soles, however you hold your gut in knowing that if you threw up she would force you to lick it off of her feet.  She forces her soles down harder forcing you to get more of that cheesy vinegary smell in your nostrils.*<br>\r\n<br>\r\n*Mara lifts her feet off of your face to let you have a break, this is however short lived and she forces her sweaty cheesy vinegary soles back onto your face... You notice after a few minutes that Mara Jade has fallen asleep due to the fact that she was sleep deprived from all of that training.*<br>\r\n<br>\r\nWhile you think to yourself you realise that the cell door was left unlocked and that her purple lightsaber is still attached to her belt.  As the smell from her vinegary soles still goes through your nose you decide that you need to quickly make your decision,  You think giving her payback by grabbing her lightsaber and making good use of her beautiful body, but you decide that it's too risky to try to attempt.  You weigh in just staying put and being a good slave but you cannot handle the smell pungent vinegary toes.  You think that you can grab her lightsaber and make a break for it out the cell door...  It is an extremely risky plan but you decide to go for it.  You lift her stinky soles off of your face slowly hoping not too wake her and slowly roll out, you hold her soles in one hand as you reach for her hand to bring it underneath her feet to give her the familiar feeling of skin instead of the cold concrete floor and cold metal bedframe... Your successful in doing it and carefully grab her lightsaber from her belt and slowly sneak out of the cell door with one of her boots hoping to chuck it when you find a spot so that she takes longer to react to you missing.</span></div></div>",
            "created":1552021200,
            "id":2627874,
            "title":"Struggle, I dare you."
        },
        "115":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Satele Shan",
                "Bastila",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With even less time to stick to cleanliness there's so much stink for you to smell</span></div></span></div>",
            "created":1530939600,
            "id":2516357,
            "title":"The Old Republic"
        },
        "1151":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "\"I must prepare a council, in the meantime you will sniff my boots\"",
                "\"I suggest you take deep breaths, my toes are happier being properly sniffed\"",
                "\"deep breaths, let my stink put you under, give your mind to my sweaty feet\""
            ],
            "content":"<div class=\"\"><div> <span>\"In the name of the Jedi Order, I, Satele Shan strip you of the rank of Padawan\"<br>\r\n<br>\r\nThis was all happening so fast. You had been caught snooping around a forbidden section of the temple by none other than grandmaster Satele herself. Your heart sunk as her voice boomed down to you.<br>\r\n<br>\r\n\"You shall be put to service under me, and more specifically...\"<br>\r\n<br>\r\nSaid the Jedi Master, using the force to slide you closer to where she was seated in front of you, meditating.<br>\r\n<br>\r\n\"You shall personally service my feet. It will be a difficult task but you have a lifetime to adjust. Your duties will be simple ones of course, but you will find them difficult to fathom at first I'm sure. Firstly, these boots or any boots of mine for that matter don't breath, therefore whenever I am not beside you, you shall be breathing for them with you nose dug into the opening. There's years of usage in those thing that make them feel all the way to coruscant and you will not stop huffing my boots until you sniff up every trace off my footstench from each boot.\"<br>\r\n<br>\r\nTaking off her boots in front of you, you felt Satele force your head into the ground, dragging your head face up under her big, meaty feet. Her soles glistening with sweat and her small, pudgy toes held small specks of toejam captive between them, both feet assaulting your nose with the nasty stink of a fine cheddar left out under the suns of Tatooine for over a month. Before you knew it, both of her feet closed in on you, her toes spreading wide to capture your nose between them.<br>\r\n<br>\r\n\"Secondly, this is how you shall spend each day with me. you'll becoming very familiar with having your face trapped under my swamp-like feet. As I don't give myself time to wash often, you'll at first find it difficult to cope, but every day you will be in this position. You will be grateful that I slather your face with my sweaty feet and you will learn to properly breath while I smother your nose in my foul toes, learn to breath in the pure stink of ripe feet while I hold your nose between my toes.<br>\r\n<br>\r\nI can see my smelly feet are already numbing your mind, just keep taking nice and deep breaths and once you fall asleep, I can fill your mind with force visions of my foul feet. Once I imprint the though of you sniffing my feet into your unconscious mind, it won't take long until I have you sniffing at my heels no matter how horrid you find them.\"</span></div></div>",
            "created":1531544400,
            "id":2519767,
            "title":"Satele Shan"
        },
        "1152":{
            "author_id":"tallbigcal2",
            "author_name":"Tallbigcal2",
            "choices":[
                "Smell the boots",
                "Smell the feet"
            ],
            "content":"<div class=\"\"><div> <span>As you slowly make your way around the temple in search of holocrons you hear a Jedi coming down the hallway right in front of you. You press your back against the wall to try to hide from the unknown Jedi. As they walk past seemingly not noticing you you get a good look at them. It’s was the famed Jedi master Bastila Shan. She wore a pair of yellow robes with brown leather accents as well as a pair of brown leather boots. Suddenly she stops walking and turns around. She can’t see you but you get the feeling she can sense your presence. <br>\r\n<br>\r\n“Come out.” She says with authority “I know someone’s in here.”<br>\r\n<br>\r\nAt this point you knew there was no way to escape so you left cover and braced yourself to fight. In a desperate attempt to fight Bastila you run at her and try to punch her. She rolls her eyes and simply holds you down with the force. She then ties you up and brings you to the council. After a short trial the council decides that Bastila can choose your punishment. She takes you to her quarters and lays you down on the bed.<br>\r\n<br>\r\n“Comfy?” She asks sarcastically <br>\r\n<br>\r\n“What are we doing here?” You ask nervously <br>\r\n<br>\r\n“Oh you’ll soon see.” She says as she slides her feet from her boots. Instantly a scent of Swiss cheese fills your nostrils.<br>\r\n<br>\r\n“That’s disgusti-.” You can’t even finish your sentence because she has gagged you with her socks. You can taste the sweat as it drips into your mouth.<br>\r\n<br>\r\n“I’m going to have some fun with you. The only question is, how to start.”</span></div></div>",
            "created":1560092520,
            "id":2670765,
            "title":"Bastila"
        },
        "12":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Ahsoka Tano",
                "Barriss Offee",
                "I'm sure I missed some"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You've been on the run from the Republic for a while now, and when a young Padawan finally captured you.. well she's sure the Jedi council wouldn't mind if she had her way with you..</span></div></span></div>",
            "created":1530939600,
            "id":2516009,
            "title":"Jedi Padawans"
        },
        "121":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Sniff up Ahsoka's footstink and toejam",
                "Ahsoka has no patients for your resistance and mind tricks you to submission"
            ],
            "content":"<div class=\"\"><div> <span>\"Nowhere left to run\"<br>\r\n<br>\r\nSaid the young Togruta Jedi who cornered you in a cave after collapsing the entrance behind her. The Padawan was right, running was no longer an option. You turned and ran at the Padawan, fist raised high to swing a punch at her. The Padawan grabbed your hand and spun you around, sending her boot directly towards your head, however you caught the kick in your hand. The Padawan was prepared as her foot slid out of her boot and she switched legs. The foul stench of the young Jedi's boots caught you off guard, stunning you before the Padawans other boot kicked you right in the head, knocking you onto your back. The Padawan jumped onto you straddling you and pinning your arms down.<br>\r\n<br>\r\n\"Stay down!\" <br>\r\n<br>\r\nShe shouted as the opening over her fallen boot fell right beside your head, letting the stink deep out towards your face.<br>\r\nAs you choked on the stench of leather and cheesey Togruta footsweat, the Padawan cracked a sly smile.<br>\r\n<br>\r\n\"That bad, huh?\"<br>\r\n<br>\r\nShe asked, swinging her feet around, letting her other boot fly off. Showing off her thin orange feet covered in dirt and sweat that dripped down onto your face, her long, lanky toes trapping tons of gunk between them and a eye-watering stink emitting from the Padawans soles.<br>\r\n<br>\r\n\"My little feet too much for you?\"<br>\r\n<br>\r\nThe Padawan wiggled her does letting some of the gunk between the fall onto your face. You wave your head back and forth to try and get out from under the sweat and grime raining down on you.<br>\r\n<br>\r\n\"Get over it\"<br>\r\n<br>\r\nShe said, tucking her knees to her chest and raising a hand to your head. She pulled back her hand using the force to pull you up, face first into her rancid feet, wrapping her disgusting, malodorous toes around your nose. <br>\r\n<br>\r\n\"Why don't you do me a <i>favour</i> and start taking some big whiffs, I need to cool off my feet\"<br>\r\n<br>\r\nSaid the Padawan as she swiveled her foot grinding her grimey toes hard under your nose, imprinting her rancid stench of blue cheese from her smelly toes into your mind.<br>\r\n<br>\r\n\"I haven't had the chance to properly wash my feet or even get out of these shoes since Tatooine, I could really get use to having you sniff my soles\"<br>\r\n<br>\r\nShe said, laying down on her back, keeping her feet up and your nose pressed between her slimy toes. The Padawan scrunched her toes around your nose, shifting them and pressing your nose over some of the gunk between her toes.<br>\r\n<br>\r\n\"How's about while we wait for my reinforcements to find us, you start using that nose of yours to suck up all of my sweaty stink and toejam?\"</span></div></div>",
            "created":1531026000,
            "id":2516437,
            "title":"Ahsoka Tano"
        },
        "1211":{
            "author_id":"mattlang",
            "author_name":"Matt",
            "choices":[
                "Run Away and Hide",
                "Stay",
                "Fight Back"
            ],
            "content":"<div class=\"\"><div> <span>You see her face from between her legs with a devilish smile and two feet accompanying her. They slowly, but they surely enclose your entire face. You can't see anything. Total darkness.  You can't smell anything, but her rancid, sweaty, dirty soft toes. <br>\r\n<br>\r\n\"I needed this. I have been working so hard to earn my way as a jedi,\" she says in a patronizing way. <br>\r\n<br>\r\nAs she sits on your stomach, she can feel you struggling to breathe.<br>\r\n<br>\r\n\"Aww, is my little captive not getting any air.\"<br>\r\n<br>\r\nYou're too weak to move your head, but don't worry, she forces you to nod yes with her feet.<br>\r\n<br>\r\n\"I think with a little persuasion, I can ask the Republic to make a special sentence for you. My opinion personally would be that you sniff my feet everywhere I go until your untimely demise.\"<br>\r\n<br>\r\nShe releases her feet off your sweat soaked face. <br>\r\n<br>\r\n\"Stay there while I call my reinforcements to retreat, and don't you think about running away because the only place you can go to escape is out there.\"<br>\r\n<br>\r\nShe points at the window.<br>\r\n<br>\r\nSo, what will you do?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1578009180,
            "id":2768528,
            "title":"Sniff up Asoka's footstink and toejam"
        },
        "12111":{
            "author_id":"mattlang",
            "author_name":"Matt",
            "choices":[
                "Tied at the foot of her bed",
                "Tied under the cockpit"
            ],
            "content":"<div class=\"\"><div> <span>You quietly get up as she stares at the window talking through a radio. You don't run, but you move fast enough without alerting and getting out of her sights. You go into a room with a box, a box big enough to hide in if you put your knees to your chest. <br>\r\n<br>\r\nYou open the box, and climb in there, and quietly close the chest. <br>\r\n<br>\r\n\"Yay, I'm so happy, thank you Padme,\" Ahsoka said as she turns her head around.<br>\r\n<br>\r\n\"What the hell; where did he go?\"<br>\r\n<br>\r\n\"Padme, I'll call you back, my captive ran away somewhere.\"<br>\r\n<br>\r\nRight off the bat, she sees where he went because there was only one door opened, and she knew if he opened the other doors, it would've alerted her.<br>\r\nThe box was slightly ajar and due to her jedi skills she know he's in there. She quietly goes all the way back to the cockpit and took her boots. As she swiftly moved back to the room, she thought, \"damn, these really smell.\" <br>\r\nShe approaches the box, and quickly in a flash, lifts the chest open and puts her boots in there.<br>\r\nShe plops herself on the box, so he can't escape. <br>\r\n<br>\r\n\"Please, let me out,\" as he asks. banging the top of the chest. He coughs as the musky, rancid smell pushes out the fresh air, and leads him to breathe faster. <br>\r\nThat's it she says to herself as she can feel the beating of the chest slow to a stop. <br>\r\n\"That should calm you down for awhile,\" she says with a little laughter.<br>\r\n<br>\r\nYou smell in that musky blue cheese. You start getting dizzy, and light-headed.The last thing you see is how dirty the insoles of her boots are.<br>\r\n<br>\r\nYou pass out. Where do you end up?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1578011400,
            "id":2768535,
            "title":"Run Away and Hide"
        },
        "121112":{
            "author_id":"v0ltag157",
            "author_name":"Voltage11",
            "choices":[
                "Holding cell bound to a wall",
                "Ashoka personal room aboard the Resolute"
            ],
            "content":"<div class=\"\"><div> <span>As you slowly regain consciousness after inhaling an abundance of Ashoka's rancid boots, you begin to take in your surroundings and more importantly how different they were.<br>\r\nInstead of the building you were previously in you are shocked to see that directly above you was glass. Curved in such a way that it might be, and with a sudden horrifying realization the hatch opened.<br>\r\n<br>\r\n“Sorry about the boots back there,” Ashoka says with a smile as she climbs into the cockpit of her Eta-2 starfighter. “But you just had to go do the one thing I told you not to do.”<br>\r\nSlinking in further you were suddenly face to face with what we’re becoming some of your least favorite things in the whole galaxy, her boots. Being this close the smell was awful but contained, for now.<br>\r\n<br>\r\nYou thrashed violently as they got closer to you silently begging her to just stop, “please just let me go, please just let me go.” A silent mantra you kept repeating to yourself, praying to someone! Anyone! that maybe your prayers would be answered.<br>\r\nPreparing your already soiled nose for the worst you tightly shut your eyes and worked as hard as possible against your restraints to turn away. But they had seemingly stopped, just above your face.<br>\r\n<br>\r\n“This is just too good,” the togruta half snickered,”you really hate these that much,” she waved her boots in front of your face to emphasize her point.<br>\r\n<br>\r\nA weak rasp of a, ”please” just managed to escape your throat before you were interrupted by both boots slamming down right next to your head, just too close for comfort.<br>\r\n<br>\r\n“Cmon we both know that these boots aren’t what your so petrified of, it’s what makes them smell oh so awful. It’s what’s inside of them that you so desperately want me to keep inside.” she sweetly whispered down to you as she began to pull her bare feet out of the boots that lay next to your head. <br>\r\n“Ooooh yeah, that just feels so good to air them out again, you know you were out for a while there and it was quite a trek back here. So if you thought they were bad before well,” she hovers the sole of her right foot just above your face, “you’re in for a treat.”<br>\r\n<br>\r\nLuckily before she could firmly plant her pungent foot onto your helpless face a communicator buzzed and a hologram of what you could only guess was her master appeared. Seemingly ignoring you for the time being she opted to place her feet back down beside your head instead, but that did nothing to help with the vinegary smell that still emanated from them. And unfortunately she was right they were somehow sweatier, grimier, and stinkier than the last time you had seen them. <br>\r\n<br>\r\n“what have I gotten myself into this time,” you thought as you stared in disbelief at the pale orange foot that soon would be using you as a personal smell absorber. Sure you had committed some crimes against the republic in dealing arms to the droid army but... was this an acceptable punishment for that.<br>\r\n<br>\r\n“Well guess who’s the luckiest man in the whole galaxy,” she suddenly addressed you staring down  and shocking you out of your thoughts. “Are you gonna guess or not.”<br>\r\n<br>\r\nReluctantly you replied, “m-me.”<br>\r\n<br>\r\n“Ding ding ding, correct answer. I was just officially given the go ahead by my master to start your punishment, it’s crazy how fast he can get Padme to agree to something like this.” she gleefully said still staring into your eyes.<br>\r\n<br>\r\nConsidering begging again you tried yet again to bargain with her, “please I know some spice runners who can pay you...” But she swiftly cut you off.<br>\r\n<br>\r\nGripping your nose tight between her malodorous toes of her right foot she began to start up the starfighter.<br>\r\nAs you spasm violently beneath her foot fighting for a breath of fresh air, she speaks clear and confidently, “ By decree of the Galactic Republic for crimes against them by aiding the enemy in the war effort you have been sentenced to a punishment of my choosing.”<br>\r\nTears formed in you eyes from both the stench of the slowly tightening grip of the cheesy toes and the realization that you might never be free again.<br>\r\n“And I bet you already know, that you. belong. to. me.” she accented each word with a squeeze of her toes forcing the stench deep into your lungs.<br>\r\n<br>\r\nBlack slowly crept into your vision once more as you found that Ashoka’s rank feet where about to cause you to black out again. The tears held in your eyes spilled freely now as consciousness almost slipped away.<br>\r\n<br>\r\nBut then a breath, a holly wonderful breath of fresh air rushes into you seeing Ashoka retract her foot from your face and feeling the rumble of the engine. “Don’t get too comfortable, I just have to focus on getting out of the atmosphere then it’s all R-7. Plus why would I want you to pass out yet, we just got started.” <br>\r\n<br>\r\nWhile greedily gulping down air knowing the next might be your last for a while, Ashoka looks down at you a wide grin plastered on her face, “maybe being a padawan won’t be so bad now knowing I’ll always have you to come back too, now... get back to sniffing.”<br>\r\n<br>\r\nAnd with that her pale orange feet came into view again dripping sweat onto your face as they lowered slowly, clearly enjoying the fear you experienced. She planted both heels onto your nose and said simply and sternly, “deep breathes.”<br>\r\nHer heels were rougher and more calloused than you would have expected for some one her age, but still they stunk of moldy blue cheese and vinegar that had been left out in the heat to boil. You at first refused to breath through your nose opting to use your mouth instead, you could still smell it but it wouldn’t be as potent. But then she called you out on it.<br>\r\n“It would be a real shame if I used the force to start helping you breathe, but it can be arranged.” she said getting more aggravated with time. <br>\r\nDeciding that being able to breathe of your own volition would be better than not you steady yourself and take a big whiff of her sweaty heels. Immediately it is as if the foulest stench imaginable has entered your nose, enough to make you gag and eyes water “That feels so go keep it up,” she said while grinding her heels into your nose. Opting for quick rapid sniffs instead one large one you got to work rapidly taking in air from Ashoka’s heels.<br>\r\nShe looked down and moved her feet back some, “nice job on my heels, but now you should really get used to my soles.” She then  buried your face deep into the orange expanse of her sole with your nose getting slicked by sweat, and assaulted by a stronger smell than before. More rapid sniffing ensued and as she slowly wiggle and grinder her feet happily onto your face you enter a lose circle of hell.<br>\r\n<br>\r\nMoving her feet back again so now your nose was level with her toes she didn’t even speak, just shooting an authoritative look at you as she cured your nose between here toes. Yet here when you tried the quick sniff it didn’t work she would shut your nose with her toes first and soon you understood. She essentially wanted you to continually take the deepest longest breaths you could at the most foul smelling part of her foot.<br>\r\nSteadying yourself you prepared for possibly the worst experience of your life, so far, and slowly drew in air from your nose. The odor could only be described as week expired milk left inside of a gym sock in the hood that it might become a cheese. It was rank, nasty, revolting and outright disgusting. You wanted to do more than gag, you wanted out now. But Ashoka only gleefully wiggled her toes to show you just how happy you were making here as she blissfully remained mostly unaware of your plight.<br>\r\n<br>\r\n“Two more times...slave,” she said scrunching her nose onto your nose once more.<br>\r\nAlready being this far gone you drew in another wave of noxious fumes and saw your friend darkness creep into your vision again.<br>\r\n“Once more now, you can do it.” On the verge of throwing up and well past tears you gave in to your togruta owner and pulled the remains of your pride and shattered them just as her foot stink shattered your brain as you drew in the final breath. “Oh, such a good slave, and look at that you did such a good job I think i’ll let you have a little nap,” she cheerfully said as you felt your body go limp. <br>\r\n<br>\r\nThe last thing you felt was the starfighter land and Ashoka slip her boots back on before darkness encompassed your vision fully, and you blacked out.<br>\r\n<br>\r\nWhere do you wake up this time?<br>\r\n<br>\r\n</span></div></div>",
            "created":1587804780,
            "id":2824174,
            "title":"Tied under the cockpit"
        },
        "122":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "\"sniff my heels, they're very sweaty and could use some cool air\"",
                "\"Press your nose to the ball of my foot and choke on my stink\"",
                "\"let's see how much toejam we can fit in that nose of yours\""
            ],
            "content":"<div class=\"\"><div> <span>You slowly awoke to find yourself restrained and gagged under the pilots chair in the cockpit of your cruiser, a small 10 man ship with white rooms and corridors. As your eyes opened you noticed the unfamiliar face of a Mirialan girl in a black hood instead of your regular crewman, then you saw the lightsaber. You've finally been captured by the Republic.<br>\r\n<br>\r\n\"Hello there\"<br>\r\n<br>\r\nSaid the girl above you<br>\r\n<br>\r\n\"My name is Barriss Offee, I was sent by my master to bring your crew to face justice in the Senate, however, months of blending in to earn your trust went down the drain when I was caught talking to my friend on my holo. So once I fought through your crew to find you, I found you sleeping and thought; I'm still expected to be on mission for another few months, so here's what's going to happen\"<br>\r\n<br>\r\nSaid the girl, tapping your head repeatedly with her boot.<br>\r\n<br>\r\n\"You and I are going to have fun for the next few months before I turn you in to authorities and I tell my master everything went according to plan. But what could be so fun I hear you ask?\"<br>\r\n<br>\r\nYou didn't, but it wasn't like you could really interrupt.<br>\r\n<br>\r\n\"Well I thought the same so I called my friend Ahsoka who asked me when was the last time I washed my feet or changed my boots and honestly I don't know.\"<br>\r\n<br>\r\nWith that, Barriss slid her rancid feet from her boots and immediately plopped them down on your face, catching your nose directly between her foul toes. Sweat from her feet poured over your face as she wiped her left foot all over you, keeping your nose between the toes of her right. As you took your first breath from her feet, you immediately gagged, it was as though she constantly kept swiss cheese in her boots at all times and constantly rubbed her toes in it and now all of that stink was being pulled right into your nose. You were forced to breath again, sniffing up more of her ripe foot odor as well as sniffing up some of her rank toejam.<br>\r\n<br>\r\n\"That's right, get some good whiffs in. It's like I said, I must have been wearing these boots non-stop for months, but hey that's where you come in. For the next few months while I pretend to be on mission, that cute nose of yours shall pamper my feet. Every day you'll be inhaling the stink directly from my feet, you can dry away all of my footsweat by taking deep breaths up and down these swampy things and when I'm feeling especially nasty, I'm going to wrap my toes around your nose and make you snort my toejam so you can carry my footstink with you everywhere. Now, how shall we beging?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1531026000,
            "id":2516535,
            "title":"Barriss Offee"
        },
        "123":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Rey",
                "Add some more"
            ],
            "content":"<div class=\"\"><div> <span>Try is going to be considered padawan because up to this point at the beginning of 2019 she still hasn't really trained.<br>\r\n<br>\r\nHOWEVER<br>\r\n<br>\r\nthis chapter will take place on Jakku before Rey met Luke.<br>\r\n<br>\r\nI will add another slot under Jedi Masters where Rey can use the force.</span></div></div>",
            "created":1552194000,
            "id":2628422,
            "title":"Here for Rey?"
        },
        "1231":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Sniffle underneath the scavengers rotten toes",
                "Disobey the girl"
            ],
            "content":"<div class=\"\"><div> <span><b>*WHAM*</b> your ears ring as your head bounced off the end of the scavenger girl's metal staff. \"Try to steal from me, will you?\" You could faintly hear the girl yell as you slid backwards,  down an incline in the sand. More sand kicked onto your face as the girl jogged down the incline after you. When you tried to get up a heavy boot held your chest down as the girl's staff cracked against your skull once more, keeping you nice and dazed as the girl sat herself down on your stomach. \"You'll pay for your thievery,\" said the girl as she placed her thick boots on either side of your head, leaning back onto your raised knees, the sweat off her back alone soaking through her shirt and your pants, soaking your legs as well. \"The sun's hot on Jakku, and these boots don't breath much, but they're too comfy to throw away. You're going to cool me off.\" Said the scavenger girl as her dripping wet feet slid out of her rotten old boots, fur on the inside that kept her feet constantly sweltering. With her toes spread wide, she trapped your nose directly under her swampy feet, your nostrils crammed against the balls of her feet. \"Breathe deep!\" She commanded.</span></div></div>",
            "created":1552194000,
            "id":2628429,
            "title":"A short fight"
        },
        "12311":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Sniff her way through her footstink and earn a \"break\"",
                "Rey laughs and smothers you as her rancid foot odors give you smelly dreams",
                "I've got two more ideas"
            ],
            "content":"<div class=\"\"><div> <span>With your nose crammed up into the scavengers warm, soggy toes, you took a deep breath in, inviting excess sweat and bits of the overwhelming toejam taking shelter between her toes to get vacuumed into your nose. The worst part of it all was the paint-melting stench that you had no choice but to let cook your poor brain. The scavenger wiggled her toes while smiling with delight. \"I don't get many chances to wash these poor beauties.\" She practically giggled out in an attractive imperial accent as she pressed her rancid feet harder against your face. \"But do keep sniffing, it feels wonderful.\" Your eyes were already rolling to the back of your head, but in fear of more up close and personal meetings with the scavengers staff or an even worse torture, you tried to make the girl pleased, helping out her rank Aak-dogs get nice and comfy on your face with more cooling sniffs. Your eyes teared up more and more with every sniff of her toes, her sweaty feet coated in a rancid stench bad enough to kill a taun-taun.<br>\r\n<br>\r\nThe scavengers grin grew more wicked as the spread her toes as wife as she could, cramming your nose as hard as she could without damaging her new property between the big toe and second toe of her right foot. \"I know you saw all that nasty toe-jam\" she said, scrunching her tose. \"Now snort that all up and maybe you could have a break.\" You could see her surprisingly white teeth through her smile now as she took way to much delight in this. You wanted that break but you new that toe-jam would require a lot of deep, deep sniffing to get it unstuck from between her toes and you might just pass out from these reeking feet.<br>\r\n<br>\r\n</span></div></div>",
            "created":1552194000,
            "id":2628517,
            "title":"Frying brain cells"
        },
        "123113":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Struggle and be beaten into a good footsniffer",
                "Attack and spend your life smelling Rey's nasty feet."
            ],
            "content":"<div class=\"\"><div> <span>Struggle and Rey will beat you into submission until you'll follow her willingly and sniff her feet as much as she wants.<br>\r\n<br>\r\n<br>\r\nTry and beat Rey off of you and she'll use you as a test subject for some imperial tech she scavenged, shrinking you and throwing you in her boot to absorb her sweat and sniff her foot all day every day for the rest of her life. Careful though, if she can still smell her feet after a day with you sniffing the stink up she might just throw you away with all of her old boots or worse.</span></div></div>",
            "created":1552194000,
            "id":2628523,
            "title":"I've got two more ideas"
        },
        "1232":{
            "author_id":"dagbert411",
            "author_name":"InkyWriter",
            "choices":[
                "Jaina Solo Fel",
                "Add some more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This story with Jaina Solo would take place during her younger Padawan years, when she is still training to become a Jedi Knight</span></div></span></div>",
            "created":1572435600,
            "id":2740209,
            "title":"Add some more"
        },
        "12321":{
            "author_id":"dagbert411",
            "author_name":"InkyWriter",
            "choices":[
                "Jaina is influenced by the dark side, becoming more cruel, abusive and dominate",
                "Jaina keeps her focus and interrogates Sid for information with her feet"
            ],
            "content":"<div class=\"\"><div> <span>Jaina Solo was the daughter of Han and Princess Leia and a extraordinary Jedi from her first day of academy. She showed exceptional skills with a lightsaber and talent wielding the force. The only downside was the brash, reckless manner she handled situations which often got her into trouble. Even as she grew a bit older into her upper teens, she still showed the same flaws. <br>\r\n<br>\r\nDespite this, Luke had confidence that she could take care of herself and would send her off on rather dangerous, covert missions that often led to capturing or spying on other threats. It was one such mission that her talents were put to the test when she was sent to a swampy planet to track down a smuggler named Sid who was supplying weapons and trading illegal artifacts to the criminal underworld. Jaina's mission was to find out who these buyers were and bring Sid in. The young Jedi took the mission without hesitation, excited to prove her worth to Grandmaster Luke and her parents. Despite her best efforts to trail him, the smuggler found out and gave Jaina a difficult time tracking his movements. Her boots became sodden with mud and the revolting stench of the swamp but still retained her beautiful appearance. <br>\r\n<br>\r\nFinally after weeks of trailing him, Jaina had manage to locate him in a empty clearing where she sensed him resting inside a tent, unaware of her presence. This brought a devious smile to her lips, knowing she'd finally pay the scoundrel back for all those weeks of chasing him around. Her dirty boots squelched against the muddy ground as she confidently approached the tent, entering inside to find the smuggler, resting casually on a bed. Much to her surprise she found him rather young and handsome but that didn't sway her from the mission she was sent. Using the force, she flings him to the dirty floor, keeping him pinned there. His eyes shoot open, as he gasps, more startled then hurt. A confused expression came across his face as he gazed up at the young Jedi while she pulled up a seat and sat down across Sid.<br>\r\n<br>\r\n\"You really gave me a hard time chasing after you all these weeks. Now that I have you, i'm not letting you go anytime soon.\"<br>\r\n<br>\r\nReaching down, Jaina slowly removed her tight hard boots with a bit of difficulty, revealing her reeking beautiful feet that glisten with sweat and was partially caked with dirt from the swampy plant. Her toe nails had no polish to them but that only amplified their beauty, giving them a natural, warrior like appearance. The horrid smell of the bog only enhanced the stench of her feet as she wiggled her toes with anticipation, clearly excited to finally get to put her feet to use and have them aired out.<br>\r\n<br>\r\n\"W-what the hell are you doing?! You already have me captured!\" Sid cried out, clearly confused and feeling his uneasiness grow as he eyes Jaina's pretty bare feet, walking her way through the sodden ground, making small delicate foot prints in the process.<br>\r\n<br>\r\n\"Unfortunately for you, I need answers and also I really need a nice tongue bath to warm up my reeking soles. There isn't really anyone else here to do it but you.\"<br>\r\n<br>\r\nJaina's hold over him strengthened, keeping him immobilized but unharmed. Before he could say another word, she suddenly plants one moist sole firmly against his face with a light slicking noise, making his cheek squish beneath the pressure. She then gracefully stands up on his face, balancing on top of him perfectly with the ease of a ballerina, sighing contently as her reeking muddy soles wedged themselves firmly against his face, conforming to the shape of it. Her toes scrunch cutely, as she gently cups her toes around Sid's nose, forcing him to take in the brunt of the revolting odor, empowering the young Jedi further. Seeing his face pale as his cheeks flush with embarrassment only made her grin widen as she felt her weight sink into the smugglers face. <br>\r\n<br>\r\nJaina may have been light and small but Sid still felt pain at having her full weight pressing down on his face, making muffled painful groans of disgust vibrate against her soles. Not wanting to damage the goods, she sat down on Sid's stomach, letting her feet rest firmly against his face, nearly smothering him as she flexed her toes enticingly against his lips and nose, making dirty foot prints mark all over his face while she became more excited, having never quite had someone at her mercy beneath her feet in such a manner. She did have a bit of regret at his suffering and knew Luke would certainly not approve but the thrill felt so empowering and the warm feeling of his soft face cushioning her reeking feet as she aired them out was so relaxing. Feeling encouraged to press her advantage further, she ignored the regretful feelings and continued to smear her muddy soles all over his face, toying and pulling at his nose often, wedging it firmly between her toes so it was coated with the substance.<br>\r\n<br>\r\n\"I can see why Mara loves this so much. It truly is a wonderful sensation~ now that I have you all cooped up beneath my feet, there so many things I'd like to test out and try.\" Jaina says excitedly, clearly amused and enthralled by the power rush she felt at having the man at the mercy of her young teen feet. <br>\r\n<br>\r\n<br>\r\n<br>\r\n(Remember! This is a sniffing story, no feet in mouths)</span></div></div>",
            "created":1573705200,
            "id":2746522,
            "title":"Jaina Solo Fel"
        },
        "12322":{
            "author_id":"dagbert411",
            "author_name":"InkyWriter",
            "choices":[
                "Tahiri Veila",
                "Add some more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tahiri Veila does eventually become a Sith but she started off as a Jedi who loved to walk around barefooted everywhere she went, only adding to the smell and dirt built up on her feet.</span></div></span></div>",
            "created":1573351440,
            "id":2744586,
            "title":"Add some more"
        },
        "13":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Padmé Amidala",
                "Leia Organa",
                "Duchess Satine"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You've earned yourself a lifetime penalty of footsniffing under the royal throne, but who's throne dishes out such a horrid footstench.</span></div></span></div>",
            "created":1530939600,
            "id":2516008,
            "title":"Royalty"
        },
        "131":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "\"Put your nose between my toes and breath deep!\"",
                "\"Get a good whiff of my soles, I've been on my feet all day!\""
            ],
            "content":"<div class=\"\"><div> <span>You woke up having no idea where you were or how you got here all you knew was that here you were chained up in someone's chambers.<br>\r\n<br>\r\nThen the side door to the left opened and in walked a young woman clearly around 26 or 27 years of age very pretty looking with light brown eyes and brown hair:  <a rel=\"nofollow\" href=\"https://www.google.com/imgres?imgurl=https%3A%2F%2Fvignette.wikia.nocookie.net%2Fmemorydelta%2Fimages%2F7%2F7e%2FPadm%25C3%25A9_Amidala%252C_2390.jpg%2Frevision%2Flatest%3Fcb%3D20171217190253&amp;imgrefurl=http%3A%2F%2Fmemorydelta.wikia.com%2Fwiki%2FPadme_Amidala&amp;docid=e_fqOQjVfrjmoM&amp;tbnid=iZCyNz_lvd24nM%3A&amp;vet=10ahUKEwjZ65atsY_cAhWlpFkKHUl0CJoQMwj7ASgIMAg..i&amp;w=1140&amp;h=748&amp;hl=en-us&amp;client=safari&amp;bih=671&amp;biw=1024&amp;q=padme%20amidala&amp;ved=0ahUKEwjZ65atsY_cAhWlpFkKHUl0CJoQMwj7ASgIMAg&amp;iact=mrc&amp;uact=8\" target=\"_blank\">https://www.google.com/imgres?imgurl=htt...</a> There was something utterly familiar about her,the way she looked but you couldn't put your finger on it.<br>\r\n<br>\r\n\"Oh so you're finally awake aren't you? I was hoping you would finally wake up!\" She said as she crossed the threshold to where you were chained up <br>\r\n<br>\r\n\"What's going on? Where am I?\" You found yourself asking,your voice came out weak and frightful beyond belief <br>\r\n<br>\r\n\"You're in my apartment boy here in the capital city of the Galactic Republic called Coruscant.\" The young woman explained carefully as she studied you <br>\r\n<br>\r\n\"Wait? Coruscant-Wait you're that wanted senator?\" You cried out startled <br>\r\n<br>\r\n\"Wanted? By who?\" The woman asked arching a eyebrow bewildered <br>\r\n<br>\r\n\"The... the sepratists have your image all over bounty boards in galactic slums. But tell me Miss....Er whoever you are!\" You already knew who she was the moment you heard the word 'Coruscant' you knew this had to be the young Naboo senator Padme Amidala.<br>\r\n<br>\r\n\"Padme Amidala Senator of the planet Naboo.\" She said calmly walking around you studying you even more <br>\r\n<br>\r\n\"Er right Miss Amidala I'm a bit confused can you please tell me exactly why I'm tied up like this?\" You asked tugging at your chains which felt like a strong form of unbreakable titanium it had to be some type of lightweight metal alloy <br>\r\n<br>\r\n\"Well my chief security guard Captain Typho found you snooping around my apartment earlier and informed me so I'm here to personally integrate you to why you're here.\" She calmly explained as she spoke  you noticed she had her left hand to her hip to where her personal blaster was, you seriously hoped she wasn't about to blast you into a crispy critter or alien goo.<br>\r\n<br>\r\n\"I already told you I have no idea how I got here or why I'm here. I had no idea this was your apartment. I was only trying to find someone to help me out!\" You protested but she despite her normally kind and understanding demeanor looked highly suspicious <br>\r\n<br>\r\n\"And how I to know you're telling the truth? For all I know you might be a spy for the Separatist Movement!\" Padme said as she stood up <br>\r\n<br>\r\n\"BUT I'M TELLING THE TRUTH HONEST!\" You pleaded <br>\r\n<br>\r\n\"Hmmmm I think I believe you but just to be sure I may need to run a little test........\" She said ignoring your outburst <br>\r\n<br>\r\n\"W-what do you mean? What kind of test?\" You shivered she certainly was a lot nicer in the movies now she seemed rather frightening <br>\r\n<br>\r\n\"You'll see in just a moment.....\" The young  senator grinned mischievously as she kneeled and reached down and pulled off one of her white boots then the other one slowly letting you witness her soft beautiful feet in all their glory <br>\r\n<br>\r\n\"You....you mean.....\" Your eyes grew wide as you automatically knew what she was up to<br>\r\n<br>\r\n\"That's right you're going to smell my feet for up to a whole hour depending on how well you do if you don't pass out due to the smell I may just release you if not.....\" Padme teased as she went over and sat in one of the chairs nearby stretching out her left foot as far as it would go, showing off her slender toes and her narrow, sweaty, a rancid, cheddary stink wafting into your face as her foot closed in on you, stopping and inch from your nose. </span></div></div>",
            "created":1531026000,
            "id":2516480,
            "title":"Padmé Amidala"
        },
        "1312":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Toe-sniffing",
                "One Heel For Each Nostril"
            ],
            "content":"<div class=\"\"><div> <span>Determined to prove yourself to Padme as the ball of her right foot closed in on your nose, capturing your every breath underneath her sweaty sole, you took your first sniff of her acrid feet, struggling to keep the vomit in your mouth as Padme giggled. <br>\r\n<br>\r\n\"Nasty aren't they?\" She asked excitedly, wiggling her dripping toes above your eyes. \"Who needs a blaster when you've got these peacemakers?\"<br>\r\n<br>\r\nYou snorted another deep breath from between her tight, smothering soles, your nose unable to escape from under the senator's rancid feet.<br>\r\n<br>\r\n\"Why don't you smell this?\"<br>\r\nAsked Padme</span></div></div>",
            "created":1534222800,
            "id":2533398,
            "title":"The Smell of Hard Work"
        },
        "13121":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "New Life As Padme's Footsniffer",
                "New Life As Padme's Insole"
            ],
            "content":"<div class=\"\"><div> <span>You began to worry as Padmes feet slid down, her toes all forming and air-tight prison around your nose, coating your face in her sweat. Padme was on the edge of her seat, enjoying every second as your next breath put you through hell.<br>\r\n<br>\r\nThe reeking stench of aging, moldy Gouda cheese and vinegar filled your lungs as your next sniff sucked up as much air from Padme's toxic toes as you could.<br>\r\n<br>\r\nUnfortunately for you as you began to feel light headed, her toes didn't move an inch, holding your nose as their captive.<br>\r\n<br>\r\n\"I bet that reeks doesn't it? The stench of some real hard work while I was stuck on Tatooine for the last few days\"<br>\r\n<br>\r\nYou drew another breath, sniffing up Padme's toejam and trapping her footscent in your nose.<br>\r\n<br>\r\n\"It'd be so easy to just pass out right now under these cheese-bombs, huh?\"<br>\r\n<br>\r\nSaid Padme, wiggling her toes to the cool refreshing feeling of you inhaling her ripe footstench.<br>\r\n<br>\r\nYour eyes grew heavy as her feet really started to get to you. How this woman's feet stink so badly? <br>\r\n<br>\r\n\"Take your deepest breath now\" said Padme \"show me some resilience\"<br>\r\n<br>\r\nPadme pushed her clammy toes hard against your nose and bit her lip as she felt your nose sucking in air from between her sweaty toes.<br>\r\n<br>\r\n\"Again\"<br>\r\n<br>\r\nShe said as her feet held your nose down, forcing you to sniff directly from the base of her rancid toes.<br>\r\n<br>\r\n\"Once more\" <br>\r\n<br>\r\nAnd as your breaths became more shallow Padme only smothered your nose tighter in her toes, ensuring a maximum stink overload.<br>\r\n<br>\r\n\"How long has it been?\" You asked all groggy.<br>\r\n<br>\r\n\"Ten minutes\" replied Padme with a smile<br>\r\n\"Keep sniffing\"<br>\r\n<br>\r\nAs hard as you tried to stay conscious, it only took Padme's nasty feet ten minutes to knock you out.</span></div></div>",
            "created":1534222800,
            "id":2533408,
            "title":"Toe-sniffing"
        },
        "131211":{
            "author_id":"darklordreven",
            "author_name":"Darklord",
            "choices":[
                "In the throne room",
                "After"
            ],
            "content":"<div class=\"\"><div> <span>As you woke up you couldn’t move all you could see was a pair of feet with the reeking smell of feet. Padme lifts her feet up you see her looking down at her. Welcome to your new life as my personal foot sniffer right now your trapped in my throne. I’ll have a long day on here so keep sniffing foot boy.</span></div></div>",
            "created":1551589200,
            "id":2625689,
            "title":"New Life As Padme's Footsniffer"
        },
        "132":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Struggle",
                "Cooperate"
            ],
            "content":"<div class=\"\"><div> <span>(Chapter written by Yalldunno, check him out!<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://www.deviantart.com/yalldunno\" target=\"_blank\">https://www.deviantart.com/yalldunno</a>)<br>\r\n<br>\r\n<br>\r\nYou wake up in a daze, distantly aware of pains throughout your body, and that the room you're in is far too bright. It takes a few moments for you to realize that you aren't familiar with this room, and that for some reason you can't move, your body is awkwardly being held in a kneeling position. Panic quickly begins to set in as you try and fail to turn your head to see what is holding you. As though your panic triggered it, a female voice rings out from a part of the room that you can't see \"Finally, you're awake...\" slowly, she strode into view and sat in a chair opposite you, gazing down with a generally blank expression. \"Allow me to introduce myself\" she said in an official sort of tone \"I am Leia Organa. Princess, Senator, and General of the resistance you work so hard to quell\" a ringing silence followed her words... \"you work so hard to quell\"? what did she mean? In a sudden rush, the night before came back to you...<br>\r\n<br>\r\nYou and a few friends had managed to steal a supply cache from an empire shipment, turned out to contain armor and uniforms. You decided to dress as a general, and your friends as storm troopers, and use these clothes to maybe steal a few more things, and bully some free drinks at the tavern before getting off the planet. The plan was working great, but for some reason, you can't remember anything past trying to take a trip to the bathroom.<br>\r\n<br>\r\n\"I'm sure you're wondering how you got here, and what's going on...\" Leia said in a soft voice and she fidgeted with something in her hands \"So, let's clear things up, shall we?\" there was a small crack, and she held something smoking under your nose, and as you breathed it in, the hazy feeling in your brain cleared at once, and all of your senses felt heightened. \"So, General... as I'm sure you figured out, we drugged you and grabbed you from the tavern last night. This...\" she said as she sealed a container and cast it aside \"is a counter agent to it. It has a nasty side effect of sharply increasing the sense of smell for a few hours, but we'll make use of that.\"<br>\r\n<br>\r\nYou struggled against whatever was holding you and attempted to speak, but it held your jaw firmly in place, making your plea come out in a muffled series of grunts. \"BE SILENT OR ELSE!\" Leia yelled, anger clear behind her eyes \"Your people have great weapons... you destroyed my home planet and killed almost everyone I care about. Now, we intend to take these weapons for ourselves and use them against you. I'm sure you noticed, we have taken one of your experimental prisoner transfer droids and used it on you. Our intel says, these things were designed to be so effective that even a Jedi Master wouldn't be able to break free... but the fact that it seals your mouth makes it quite poor for questioning someone. We haven't quite worked out a way to release that, without fully freeing the person it holds... so here's how this is going to go...\" Leia leaned forward and squeezed your nose shut, your eyes widened with panic as you realized that you had no way to breath or free yourself. She continued, locking eyes with you and whispering slowly as you tried to free yourself, your joints screaming with every attempted movement \"I will give you some incentive to answer our questions... then we will take you to your cell... and you can choose if you want to give us the info we're looking for... and if you don't... we can find start over.\"<br>\r\n<br>\r\nShe suddenly released you and sat back, smiling as you desperately tried to compose yourself now that you could breathe again \"Scary not being able to breathe, isn't it?\" Leia said as she was reaching for something out of view. There was a dragging noise and, though it was under your chin and hard to see, you could just make out that she had moved a small table or something in between the two of you. \"Careful with those deep breaths though... don't forget that the drugs made your sense of smell much stronger... speaking of which... lets get started.\"<br>\r\n<br>\r\nLeia removed one of her boots, revealing her bare foot, she had apparently not been wearing socks with them, and she rested her leg on the table between you. The smell was unimaginable... you couldn't be sure if it was because of the drug in your system, or if the smell was just naturally that terrible, but the moment she slid her foot from the boot you had to squeeze your eyes shut to stop them from watering and tried desperately to hold your breath. Every inhale burned and seared with a smell your could only attribute to rotten food, so strong that, even though you couldn't open your mouth, you could actually taste the stink.<br>\r\n\"Look at me -general-\" Leia said sternly, putting a special emphasis on the last word. Painfully, you opened your eyes and met hers as she spoke again \"This is just the beginning, so I want you to breathe deeply while I still let you. If I'm not happy with your performance, I may just have to suffocate you.\" with that, you gazed at the foot, a few inches from your face. There was a coating of dirt on it that appeared slimy from the sweat in her boot, and there were sections of lint or fur or something stuck in random places around her toes. Whatever she says, you couldn't bring yourself to do anything but take short shallow breaths that burned with the hot stink emanating from the foot in front of you.<br>\r\n<br>\r\n\"I said or you to breath deeply! Enough of this, forward please.\" She yelled, you to your horror, you began to roll slowly forward until your nose was pressed against her toes and she called \"Enough\" You desperately tried to hold your breath, wanting nothing more than to put off the moment you had to inhale, trying more desperately than ever to turn your head. You could feel her wet, tacky skin against your face and could feel a hot, sick sensation in your stomach and throat. You couldn't wait any longer... you had to breathe in, and it was so much worse than you could have imagined. With the stink, came bit of debris that you had no choice but to inhale, and you could feel it stick in your nose. The horrible rotting smell was so much stronger now, that your eyes were watering freely, and you were starting to feel as though all your senses were being assaulted. You mouth was watering uncontrollably as your body tried to wretch and be sick, but you physically couldn't so it was constantly choked back... yet you could still somehow taste this retched smell as it flooded your lungs.<br>\r\nMinutes, hours, days, weeks.... a century may has passed as you were trapped against this foot. You had hoped you would adjust to the smell over time, but no such luck... somehow, you could only assume it was the drugs at this point, the stench only became more rancid. Leia didn't speak again, or even look at you from what you could tell... not that you were able to see well with how badly your eyes were watering... but over time, you started to notice that it was becoming harder to breathe. She was pressing her foot harder against you, forcing you to work more or each breath, and pull in more of the gunk between her toes. Time ticked away and she squeezed your nose with her toes, harder and harder until things were starting to get dark as oxygen was becoming more scarce. It was then that she finally spoke again, as you struggled on the brink of consciousness \"Pass out if you want... I'll be keeping you here or a while. I want to me sure that this smell doesn't leave your face while you're in your cell. I'll be leaving my other boot on so I expect it to get much worse in there... just in case we need to do this again.\" She laughed softly to herself \"I actually almost hope that you won't answer our questions... I think I might enjoy this.\" </span></div></div>",
            "created":1534222800,
            "id":2533390,
            "title":"Smelly Princess Feet"
        },
        "133":{
            "author_id":"kamiyl",
            "author_name":"Jyter the Good Socialist",
            "choices":[
                "Petty thievery (10 sniffs of her heels)",
                "Assault and battery (100 sniffs of her soles)",
                "Treason (1,000 sniffs of her toes?!)"
            ],
            "content":"<div class=\"\"><div> <span>\"This is the one, ma'am.\" <b>\"The Death Watch spy!\"</b><br>\r\n<br>\r\nThe guards pushed you face first into the floor of the throne room. Your arms and legs were all but useless in stun cuffs, but your mouth was working like a dream: <i>\"Let me go! I-I'm innocent... please, your majesty!\"</i> you whimpered pathetically in your bondage. Duchess Satine's bright blue eyes stared down at you. Her reply was short and precise. <b>\"But you were caught negotiating with a terrorist, correct?\"</b> And you had no good answer for it.<br>\r\n<br>\r\n<i>\"Well... I... you see...\"</i> your brain scrambled for an excuse, but as your ribs buckled painfully under the weight of the guards pressing down your back, you were forced to tell the truth. <i>\"... y-yes... your majesty!\"</i> With a subtle hand gesture, the Duchess ordered the two men to back away and you were finally able to breathe. <b>\"Then, it's settled. You will now be tried in a court of law. In face of your crimes against New Mandalore, and given your confession, you will be convicted of treason and sentenced to life in jail.\"</b> she said, calm and collected as usual. <b>\"Take this criminal away.\"</b><br>\r\n<br>\r\nAs the Duchess revealed your destiny, you were overcome with despair. Your whole life flashed by in a second, and the thought of spending the rest of it in prison filled your heart with dread. <i>\"No! Please... I beg you! I will do anything!\"</i> you sobbed loudly, clawing at the floor as the palace guards dragged you away to captivity. You held your eyes closed in shock, in complete denial of the situation. In an ultimate bout of strength, you managed to force them open. And to your surprise, you were still in the throne room. On the ground. Looking at Satine's heels.<br>\r\n<br>\r\n<b>\"I believe in redemption, I do.\"</b> the Duchess's voice echoed from above. <b>\"And I'm willing to pardon your sentence. <i>If</i> you are willing to partake in a little experiment of mine...</b>\" The answer flew off your lips as if by instinct. <i>\"Yes, of course, your majesty! I-I will do anything! Thank you, thank you, thank you!\"</i> you exclaimed, almost tearing up in joy.<br>\r\n<br>\r\n<b>\"Great...\"</b> From the floor beneath Satine's throne, you saw her delicate, pale hand play around with zipper on her shoes. <b>\"I am no fan of tradition. But I'm no fan of violence either. You see, back in <i>darker</i> times, Mandalorian women had a clever way to discipline their children...\"</b> Slowly, she began to unzip her grey heels. <i>\"H-how?\"</i> you questioned meekly, as a sharp, putrid scent crept its way into your nose... <b>\"Using their smelly feet, of course!\"</b><br>\r\n<br>\r\nAnd upon finishing her sentence, you saw the Duchess's lily-white feet slip out of her shoes, accompanied by a disgusting squelch... and gut-wrenching stench! Your lungs seared as the first wave of smell wafted into your nostrils: it was a rich, pungent blend of vinegar, a warm cloud of corrosive gas which emanated from Satine's sweaty, pink soles. You gagged over and over, struggling to breathe through the acid stink, while the Duchess resumed her monologue: <b>\"Imagine if we could do the same to our criminals... to traitors like you!\"</b> she exclaimed, brushing the tip of her long toes against your cheek.<br>\r\n<br>\r\nHer toes, her heels, her arches, they were all caked in toe jam... as her feet touched your face, you could literally feel the stench seep into your pores! That wasn't the smell of a queen, it was the smell of warrior (and a dead one at that!) <i>\"Y-you're sick!\"</i> you managed to yell out, a clear mistake, for when you opened you mouth, you immediately felt the sour foot odor adhering to your taste buds. Yuck! <b>\"Now, now... you promised to help me, didn't you?\"</b><br>\r\n<br>\r\nYou laid there in silence, just trying to hold your breath. So much for clemency! <b>\"Hm, where should we begin? Oh. I know - <i>let's work on the sentences!</i>\"</b> Satine's feet slowly advanced toward your face... <b>which sentence was she going to exact on you?</b></span></div></div>",
            "created":1534309200,
            "id":2534245,
            "title":"Duchess Satine"
        },
        "14":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Zam Wesell",
                "Aurra Sing",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one of these deadly killers will subject you to her stink?</span></div></span></div>",
            "created":1530939600,
            "id":2516006,
            "title":"Bounty Hunters"
        },
        "142":{
            "choices":[
                "..giving my soles a nose rub\"",
                "...getting your nose inbetween my toes\"",
                "...burying your face in my boots\""
            ],
            "content":"<div class=\"\"><div> <span>You knew you weren't going to be able to pay Jabba the Hutt back when you got that debt from him. You were afraid, and you tried to save enough credits to repay Jabba. But Aurra Sing didn't seem to care about your pathetic efforts when she barged in your hut and kicked you in the head, slamming you down on the ground.<br>\r\n<br>\r\nAs you raised your head, you got a better look at her. She was tall, wearing a brown vest and a blaster holster over her red outfit. Her skin was a pale white, and she had black makeup around her eyes.  Her long, red ponytail next to a grey antenna was the only hair on her head. She sat on your stomach, putting her feet beside your head, giving you a glimpse of the brown leather boots she wore.<br>\r\n<br>\r\nThen, you caught a faint, cheesy smell in the air. Your eyes grew in disgust. It wasn't coming from her feet, right? They were trapped in those boots, her feet must be biohazards if they were smelling even within boots!<br>\r\n<br>\r\n\"So, the little runner finally stops.\" Aurra said, grinning menacingly. \"You know, you made me go quite a distance, in these hot leather boots no less.\" Just as you were about to say something, Aurra put her hand on your mouth, effectively gagging you. \"Sshhhh. The show's about to start\" she said as she took out her blaster pistol. \"No talking, right?\" She asked as she aimed at your head.<br>\r\n<br>\r\nYou nodded in fear, which seemed to satisfy her. She let go of your mouth and began taking off her boots. \"My feet are so sore, and it's because I had to chase you all over Tatooine.\"<br>\r\n<br>\r\nHer boots came off with a wet \"Plop!\" noise, and the faint smell of molten cheese, boot leather and pure sweat before assaulted your nostrils with tenfold intensity as she crossed her feet inches before your face. Her long arched slender feet were a pinkish color, and they were glistening with sweat! You could feel the heat coming off her feet, and you couldn't dare to turn your head away because of the blaster she was pointing at you. \"Now, you will entertain me, you lousy scum. Start with...\"</span></div></div>",
            "created":1537333200,
            "id":2549974,
            "title":"Aurra Sing"
        },
        "143":{
            "author_id":"dagbert411",
            "author_name":"InkyWriter",
            "choices":[
                "Vestara Khai (Even though she was a Sith, she did work as a Bounty Hunter)",
                "Mirta Gev (Boba Fett's grand daughter)",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some other beautiful deadly dark Bounty Hunters that can capture and dominate someone beneath their smelly feet.</span></div></span></div>",
            "created":1573348200,
            "id":2744571,
            "title":"More"
        },
        "15":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Sith",
                "What did I miss?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Final Categories</span></div></span></div>",
            "created":1530939600,
            "id":2516010,
            "title":"More"
        },
        "151":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Asajj Ventress",
                "Darth Zash",
                "More Sith"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This sith is going to enjoy making you gag, choke and suffer while you sniff her feet. Be warned, she doesn't often change her boots.</span></div></span></div>",
            "created":1530939600,
            "id":2516011,
            "title":"Sith"
        },
        "1511":{
            "author_id":"kamiyl",
            "author_name":"Jyter the Good Socialist",
            "choices":[
                "Laugh in her face and be punished",
                "Take it seriously and ask her about her 'power'",
                "Immediately submit to Asajj's will"
            ],
            "content":"<div class=\"\"><div> <span><i>\"<b>Master Shaak Ti to CC-338/FS, stationed at the Esstran sector base:</b> Commander, I'm calling you on the behalf of the Jedi High Council. We've received word that a separatist research lab in the old Sith world of Moraband is on the verge of creating a biochemical superweapon, so toxic a few grams could wipe out the entire Republican population. We need positive confirmation that such a weapon exists, and if it does, how it can be destroyed. We request that you infiltrate the secret Confederate base located inside the Valley of the Dark Lords and bring back this information. Please, Commander... be careful. Moraband is a dangerous planet, and if our intel holds true, Asajj Ventress is sure to be watching over her master's bio-weapon. Best of luck, and may the Force be with you.\"</i><br>\r\n<br>\r\nMaster Ti's hologram faded from existence, leaving you alone in your fighter. This all sounded a bit too much for a clone to handle, but then again, you weren't bred for cowering. Your job was to defend the Republic, or die trying! You plotted a course for Moraband, jumpstarted the hyperdrive and laid back on your seat as the planets and stars around you warped into long streaks of light.<br>\r\n<br>\r\n<div align=\"center\">+++</div><br>\r\n<br>\r\nLanding on Moraband was easy enough. Surprisingly little defenses for a secret base world - you guessed they were trying to keep the planet as unremarkable as possible. Finding the research facility itself was more difficult. There were no detailed maps on the Sith homeworld, the shifting sands and maze-like valleys made it impossible to survey. But you managed to track a droid convoy back to the Confederate lab, hidden at the entrance to the Valley of the Dark Lords.<br>\r\n<br>\r\nThere were just two B1 droids standing guard outside the base. They would be easy enough to snipe before either of dumb boxes of circuits could notice. You reached for the blaster rifle on your back, but your arm got stuck halfway through... as though an invisible hand were holding it still! \"Try knocking next time.\" an icy-cold, female voice echoed behind you. Your loose hand instinctively finds its way to your side blaster, but before you can even unholster the gun, a piercing jolt of electricity arcs through your metal armor, causing excruciating pain before finally knocking you unconscious.<br>\r\n<br>\r\n\"You and me, we're going to have lots of fun...\" Asajj Ventress whispered to herself, smiling as she stood tall over your senseless body. <br>\r\n<br>\r\n<div align=\"center\">+++</div><br>\r\n<br>\r\nYour eyes flutter open. You've been stripped down to your white cotton clothes and chained tightly to what seemed like an operating table. The room felt hellishly hot, probably due to the floodlights on the ceiling. As you struggled in your bondage, a familiar voice was heard: \"Well, look who decided to wake up...\" Ventress circled a few times around you, before locking her pale blue eyes with yours. <i>\"Are you so bad at killing you couldn't even finish a passed-out clone?\"</i> you barked fearlessly at her.<br>\r\n<br>\r\nThe Dark Acolyte simply laughed as she played with her unlit light saber. \"I assure you, if I wanted you dead, we wouldn't be having this conversation.\" <i>\"Well, I'm not telling you anything either, if that's what you're hoping for!\"</i> you replied, steadfast in your loyalty to the Republic. Asajj giggled. \"What information could I possibly want from an idiot like you?\" her glowing saber suddenly spewed forth from its hilt and stopped just a few inches short of your face. \"The Jedi sent you, right? I knew they were too cowardly to come fight me themselves! I was actually starting to think they wouldn't even send anyone to check up on our 'superweapon'... but then, you arrived.\"<br>\r\n<br>\r\nShe turned off her light saber and circled around your table a few more times while talking. \"You see, clone... <i>I</i> am the superweapon. I have uncovered in the caves beneath this world a power of the Dark Side no one has ever seen before! A power that, once mastered, will allow me to defeat entire armies, destroy entire worlds and dominate the entire galaxy! A power that will finally allow me claim my place among the Sith... the power of my disgusting, toxic feet!\" Ventress exclaimed, laying her heavy, leather-clad foot on the side of your head.<br>\r\n<br>\r\nYou can feel the warmth of Asajj's skin radiated through her boots, along with the sickening sound of sweat swishing around inside. <b>What do you do?</b></span></div></div>",
            "created":1531198800,
            "id":2517613,
            "title":"Asajj Ventress"
        },
        "1513":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Darth Cognus",
                "Darth Talon",
                "More Sith"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did I mention.. Sith don't often wash their feet?</span></div></span></div>",
            "created":1530939600,
            "id":2516012,
            "title":"More Sith"
        },
        "15133":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Lana Beniko",
                "Maris Brood",
                "Any others?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And this one will make you inhale her powerful stink until you're driven mad... Just for fun.</span></div></span></div>",
            "created":1530939600,
            "id":2516013,
            "title":"More Sith"
        },
        "151333":{
            "author_id":"dagbert411",
            "author_name":"InkyWriter",
            "choices":[
                "Darth Zannah",
                "Vaylin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Siths can be rather dominate and sadistic with how they torture their prisoners especially under their reeking feet.</span></div></span></div>",
            "created":1559717940,
            "id":2669205,
            "title":"Any others?"
        },
        "152":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Rebels",
                "Imperials and the likes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Neither of these groups are very kind to their enemies either</span></div></span></div>",
            "created":1552366800,
            "id":2629220,
            "title":"You're going to be smelling lots of feet, huh?"
        },
        "1521":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Sabine",
                "Hera",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Can you imagine how terrible these feet with smell? Always stuck in the trenches, constantly running? War will really make you sweat.</span></div></span></div>",
            "created":1552366800,
            "id":2629221,
            "title":"Rebels"
        },
        "15211":{
            "author_id":"endlesss",
            "author_name":"rec",
            "choices":[
                "Sabine returns tomorrow after a work-out",
                "Sabine returns in a few days after a mission "
            ],
            "content":"<div class=\"\"><div> <span>You have recently been promoted to a commander of the Imperial Army. However, you had no time to celebrate as you and your squad of 100 soldiers was cent to the planet Lothal as a garrison of an outpost  guarding one of numerous warehouses where the Empire kept the fuel for the space fleet. Unfortunately, you got unlucky to suffer an attack from the local rebel group, and they managed to catch you off-guard  in your study, while your guys were searching for them anywhere except there. So you found yourself stuck in a room with a Mandalorion girl at the door.<br>\r\nNo. You obviously can't pass by her to escape, so you have one option. Fight this rebel. Your gun is lying on a cupboard shelf where you have left it so for the moment you are  unarmed. You had your pride though, and you could never admit defeat to her like a spineless dog. Options exhausted, you set to action the attack, they say that a man shouldn't attack a woman but against a rebel-scum  woman it was surely justifiable. You rise to your feet quickly, and shoulder-tackle the young Mandalorian in the rib cage, with both of you landing on the floor. For a moment you have taken her by surprise and were on top, but she quickly recovers and pushes you off, sitting on top herself, but you manage to push her off as well. You both roll around for a bit, seeking to gain advantage, until the girl manages to sit on top once more and this time she holds firm. Uh-oh. With a hard kick on your head you pass out...<br>\r\n<br>\r\nYou woke up in a small room lying on a quite low table with you hands and feet caught in energy shackles. That very Mandalorian girl was sitting to the right side of your so-called bed with a sly grin on her face.<br>\r\n<br>\r\nMandalorian: Welcome to our ship, Mr Imperial officer! I was rather lucky to capture you as you are, obviously, in charge of that outpost and with the information you give us about its guarding systems getting fuel for the rebel fleet will be a cake walk!  <br>\r\n<br>\r\nYou: I'm not giving you any info! If I do so and the Empire finds out, I'm dead... So I prefer to die as a hero rather than a traitor.<br>\r\n<br>\r\nMandalorian: Don't worry, you are not going to die. At least, not so soon. Knowing what a stubborn donkey an imperial can be Hera left me here to interrogate you, and believe me, I'm a profy! By the way, you may know my name, since you are not getting out of here. I'm Sabine.<br>\r\n<br>\r\nYou: Pleased to meet you (sarcastically). But in any case I'm not telling you...<br>\r\n<br>\r\nSabine: Shh... You see, the Mandalorian females are known for their feet having a very strong pure vinegar smell. And yeah, I believe, my feet are a bit stinky since fighting the imperials all day inside these tight boots is never an easy task.<br>\r\n<br>\r\nYou notice that the Mandalorian girl starts taking off her boots to reveal a beautiful pair of bare feet. She exhales in pleasure as she frees her toes for wiggle and spread after a long day confined inside her boots. Despite the fact that Sabine's feet look soft and silky smooth with pinkish soles, slender toes, curvaceous arches, high insteps and tan round heels, they were very sweaty and exhale a nauseous combination of foot sweat and moist boot insides. The scent of her feet gradually fills the air around you, and your nose starts to get irritated by the smell. You start to understand the way interrogation will look like...  <br>\r\n<br>\r\nSabine: Yeah, sure! My feet are really stinking bad! I can even feel them from up here! – the girl's face brightened with a wide smile – Then, boy! What do you think about them? <br>\r\n<br>\r\nYou freak out…It’s exactly what you were afraid of. Sabine intends to make you spend the rest of your time as her footstool sniffing her sweaty feet. Knowing that her feet have been inside hot boots for at least several days, you don’t want see them close to you.<br>\r\n<br>\r\nSabine: Speechless, huh? Now, then shall we begin? Be sure to give my feet some hard sniffs, okay? – she slowly raised her feet above your head. You could see all the sweat, she had collected while out – Well, don't get just looking! Inhale my foot odor!<br>\r\n<br>\r\nSabine wastes no more time placing her right foot on your face, her heel resting on your chin as she forces you to smell the awful stench of her feet. Her right foot slides off of the nose, onto your face, covering a part of your mouth and one one of your eyes as the left foot joins it, as she then proceeds to rub both sweaty feet in your face. You gagged at the foul smell. A few whiffs garner the most intense womanly, stinky feet of your life – as well as a few coughs and a slight tear to your eye.<br>\r\n<br>\r\nSabine: Do you like my feet? – She asks with an arrogant smile on her face.<br>\r\n<br>\r\nYou: Hell no! – You reply out of anger, shaking your head, trying to get her feet off of your head. <br>\r\n<br>\r\nSabine: Stop complaining and just smell my feet. – She replies with a mock look of taking great offense.<br>\r\n<br>\r\nShe then presses her feet harder your face. You begin to cough as the smell of pungent vinegar fills your nostrils. She’s obviously been wearing her boots barefoot for quite a while. Taking deep breaths you begin sniffing Sabine's bare feet repeatedly as she rubs them around on your face getting you to smell every area. You sniff her heels, then up her soles sniffing her arches, insteps and the balls of her feet. She then starts to manipulate your face with her feet having you make funny faces and the such much to your humiliation. She laughs at your predicament obviously letting out some built up stress probably made from constant fighting the Empire. Sabine then starts rubbing her pinkish soles on your checks and wiggling her toes on your forehead. At times, she would use her feet to smother you, chuckle at your muffled protests. Sometimes she would even use one of her feet to run her toes through your hair. What if she keeps you for days forcing you to smell her feet? Can you really handle that? It's only been about five minutes of her rubbing her foot sweat into your face and laughing at you but it feels like it's been hours!<br>\r\n<br>\r\nSabine: Not very fun under my feet, is it?<br>\r\n<br>\r\nYou: Come on, that's disgusting and weird. Why couldn't you use electricity or other torturing devices?<br>\r\n<br>\r\nSabine: Well, may be because you are trained at the Academy to overcome them? I've been a part of that system myself and I know all those tricks perfectly.  <br>\r\n<br>\r\nEventually instead of rubbing her feet around she just sets her feet over your face so that it is fully covered by her soles. Every area of your face is covered by her sweaty feet. <br>\r\n<br>\r\nSabine: Aww look at that! Your face fits perfectly under my stinky feet! – She says once again taunting you.<br>\r\n<br>\r\nFor awhile you just lied there inhaling her vinegary scented soles. <br>\r\n<br>\r\nSabine: Now it's time for the best part! Let's see if this will break you.<br>\r\n<br>\r\nShe suddenly grabs your nose tightly between her sweaty slick toes forcing you to take deep whiffs in between each of the pads which are by far the worst smelling part of her feet  filled with her toe jam and sweat. Their soft texture mushed against your skin as Sabine sticks your nose deeper between her soft toes wedging it deeply, filling your lungs with the sweaty powerful scent.<br>\r\n<br>\r\nAfter several minutes she finally takes her feet from your face.<br>\r\n<br>\r\nSabine: Alright, I think that’s enough face sniffing for one day. You'll have the whole night to consider if you want to cooperate. <br>\r\n<br>\r\nShe then puts on her boots and leaves with unpleasant thoughts and horrible smell stuck in your nose.</span></div></div>",
            "created":1584200580,
            "id":2801374,
            "title":"Sabine"
        },
        "15212":{
            "author_id":"c17pilots",
            "author_name":"Weeert",
            "choices":[
                "Hera has a fun game for you and her feet",
                "Sabine comes to check on the prisoner"
            ],
            "content":"<div class=\"\"><div> <span>Hera's feet: <a rel=\"nofollow\" href=\"https://www.deviantart.com/atonyp/art/Blurry-work-in-progress-sneek-peek-of-next-pic-764397746\" target=\"_blank\">https://www.deviantart.com/atonyp/art/Bl...</a><br>\r\n<br>\r\n(I had to edit this piece because of its offensive content. This is a foot fetish story remember, lets focus on feet, not raping the characters - ESSFTON)<br>\r\n<br>\r\nYou wake up in an unfamiliar location, hoping that your safe within the confines of a ISD or any Imperial ship for that matter.<br>\r\nAs a Line Captain in the Imperial Navy's Seventh Fleet and a member of the bridge crew on a Arquitens-class light cruiser during the clone wars, you can tell when your in an Imperial ship and you're not in a friendly cruiser.  Just then a beautiful green coloured twi-lek woman comes through the door of the room your in.<br>\r\n<br>\r\nHera: Oh, you've woken up!  I didn't expect you to awake for a little while longer.<br>\r\nYou: Where am I?<br>\r\nHera: You're aboard the Ghost.  Welcome to rebel territory<br>\r\nYou: You rebel scum!  Any minute my battle group (2 ISD, 1 Victory II) will come and destroy your stupid ship.<br>\r\nHera: I don't think the will happen we are safe in wild space.  We should be more concerned about the Hutts.<br>\r\nYou: I am a member of the Imperial Navy and I demand to be let go.<br>\r\nHera: I don't think I'll do that...  But what I will do is put your nose through a little bit of excitement, well maybe if you were Ezra.  <br>\r\nYou: What do you mean?<br>\r\nHera: You'll see!<br>\r\nHera takes a seat and slowly starts taking off her brown boots with a little bit of struggle.<br>\r\nHera: It took me a long time to get you in these shoes,  my poor toes...<br>\r\nHera plops her toes on your nose, you can feel that her feet are moist but dry for the most part.  You breath in and smell a very strong cheesy smell that gets stronger the closer your nose is to her toenails.  You take a minute to look at her size 10 green feet while she continues to rub her cheesy toes around your nose.  You think to yourself that Twi-lek females are known for their strong pungent cheesy smell and unlike most species they aren't capable of having a vinegary smell or very sweaty feet.  Its a good thing, you wouldn't be able to handle the smell of vinegary toes.  Think to yourself that you should be glad that she isn't a human who could have cheesy vinegary smell or a mandalorian who could have a pure vinegar smell. <br>\r\n<br>\r\nHera pushes her toes harder into your nose... You take a deep breath and get that cheesy smell inside of your nostrils.<br>\r\n<br>\r\nHera: *fake moan* Don't you just love that smell?  Twi-lek women aren't just known for their beauty!  Unlike humans and mandalorian our feet don't get that vinegary smell that turns foot fetishes on so much... But our feet have the strongest ripe mature cheese smell in the galaxy!  Now, doesn't that smell good?</span></div></div>",
            "created":1553455740,
            "id":2634219,
            "title":"Hera's Cheesy Toes"
        },
        "152122":{
            "author_id":"darklordreven",
            "author_name":"Darklord",
            "choices":[
                "Lick our feet / smell Sabine",
                "Lock him in chastity "
            ],
            "content":"<div class=\"\"><div> <span>Sabine walks in and sees what’s happening I hope you weren’t gonna torture him with out me. <br>\r\n<br>\r\nSabine takes off her boots and you get a glimpse of her feet her toes are painted blue and she has a toe ring on each foot. She sits down and puts her feet on your face. <br>\r\n<br>\r\nYou try to struggle the smell was overwhelming you but it’s no use.<br>\r\n<br>\r\nWhat should we make him do now ask Hera </span></div></div>",
            "created":1554686940,
            "id":2641766,
            "title":"Sabine comes to check on the prisoner"
        },
        "15213":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Rebel grunt",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When you're a captured imperial spy, you know you'll get no mercy from a rebel</span></div></span></div>",
            "created":1552366800,
            "id":2629222,
            "title":"No mercy"
        },
        "152132":{
            "author_id":"dagbert411",
            "author_name":"InkyWriter",
            "choices":[
                "Jyn Erso",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jyn as captured a imperial spy and needs information you have. She's going to take her time and pleasure thoroughly torturing you beneath her reeking sweaty feet until you give everything she wants.</span></div></span></div>",
            "created":1553419200,
            "id":2634005,
            "title":"Jyn interrogates you for information"
        },
        "1521321":{
            "author_id":"c17pilots",
            "author_name":"Weeert",
            "choices":[
                "Resist Jyn and keep smelling her vinegary toes",
                "Tell Jyn that the Death Star plans are in Scariff "
            ],
            "content":"<div class=\"\"><div> <span>Jyn Erso feet: <a rel=\"nofollow\" href=\"https://www.deviantart.com/atonyp/art/Jyn-Erso-s-feet-bastinado-torture-668002343\" target=\"_blank\">https://www.deviantart.com/atonyp/art/Jy...</a><br>\r\n<br>\r\n<br>\r\nYou've been restrained in the secret base of the Alliance to Restore the Republic during the year 1BBY.  The previous interrogators have injected you with heavy doses of truth serum and relaxants made from Opium.  They've only gotten minimal information from you and the effects are starting to wear off.  The outcast and convicted felon Jyn Erso, daughter of the imperial scientist Galen Erso has been sent to use unorthodox torture methods.  <br>\r\n<br>\r\nYou wake up in your holding cell just in time to look up and see the door to your cell open. <br>\r\nJyn: well its good to see that your awake now... I hope the effects have worn off because I am going to enjoy this.<br>\r\nYou: What do people want from me!  I am not an imperial spy!<br>\r\nJyn: Our intel says that you know the location of the Death Star plans and Grand Moff Tarkin.<br>\r\nYou: I know nothing, I will never reveal the location.<br>\r\nJyn: I think you will after I've finished with you.<br>\r\n<br>\r\nJyn Erso walks over to a control panel and presses a button that reads Tilt restraining table by 90° in Aurebesh. <br>\r\nYour bed moves until your lying on your back.  When the table stops Jyn climbs ontop of you.  Jyn teases you by grabbing your cock from underneath your pants to get your hopes up thinking that she is about to procreate with you.  Jyn ripes off her boots and plops her soles on your face, this catches you off guard and you accidentally smell her fresh vinegary toes.  You notice that her feet have a red tint around her toes and heels which means that she was just training.  You try to move your face away because of the smell but your head is restrained.  Jyn continues to rub her strong vinegary toes on your nose.  The smell would be like heaven if you had a foot fetish but its like hell to you.<br>\r\nYou continue to jerk your head around because you know you won't last for long under the smell of Jyn's vinegary toes.<br>\r\nYou thrash your head around trying to break your neck...<br>\r\n<br>\r\nJyn: I have to say you are a feisty one, all of this can be avoided if you just tell me where the death star plans are.  But I am really enjoying making you suffer with my stinky feet.</span></div></div>",
            "created":1553430360,
            "id":2634063,
            "title":"Sweaty Vinegary Toes"
        },
        "15213212":{
            "author_id":"c17pilots",
            "author_name":"Weeert",
            "content":"<div class=\"\"><div> <span>You keep smelling her vinegary toes but you can't hold out any longer.<br>\r\n<br>\r\nYou: I will talk.<br>\r\nJyn keeps her toes on your nose: Okay, then tell me... Where are the Death Star plans?<br>\r\nYou: Take your stinky feet off me or I will not tell you!<br>\r\nJyn: Hmm..... No.....I think I will leave them on until you say what planet the plans are located on.<br>\r\nYou: They are on Scariff...!<br>\r\nJyn: Really...?<br>\r\nYou: Yes in the Abrion Sector.<br>\r\nJyn: Thank you for your service to my poor stinky toes...<br>\r\n<br>\r\nJyn grabs a blaster and shoots you in the heart after putting her boots on.  She then gets up and presses the button again to reverse the action, then exits the room. <br>\r\n<br>\r\nJyn: The plans are on Scarif in the Abrion sector.</span></div></div>",
            "created":1553430960,
            "id":2634071,
            "title":"Tell Jyn that the Death Star plans are in Scariff "
        },
        "1522":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Captain Phasma",
                "Iden Versio",
                "Stormtroopers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It doesn't matter if you talk or not, these girls enjoy your suffering</span></div></span></div>",
            "created":1552366800,
            "id":2629224,
            "title":"Submit yourself to foot sniffing duties"
        },
        "15223":{
            "author_id":"essfton",
            "author_name":"ESSFTON",
            "choices":[
                "Empire",
                "First Order",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>A) A slaughter, both the Rebels and Imperials wiped each other out with only two survivors left, you and the stormtrooper pinning you down. She'll make you suffer for what you and your rebel friends have done.<br>\r\n<br>\r\nB) Captured by the First Order in a prison in the heart of a star destroyer. In front of you, a stormtrooper, brainwashed at birth. There's no talking your way out of this one, and shell enjoy having you under her feet, after all, its where you belong.</span></div></div>",
            "created":1552366800,
            "id":2629226,
            "title":"Under the Empire's Boot"
        }
    },
    "info":{
        "author_id":"essfton",
        "author_name":"ESSFTON",
        "brief_description":"Can you endure the stink of all the feet in the galaxy?",
        "created":1530958860,
        "description":"<td align=\"left\" class=\"norm\">Rules:<br>\r\n<br>\r\n-This is a footsniffing story only, no licking or sucking or anything else. <br>\r\n<br>\r\n-You will never like feet, this is a torture story<br>\r\n<br>\r\n-Ive decided to add Disney stuff.<br>\r\n<br>\r\n-Only female feet please.<br>\r\n<br>\r\n-Please don't break the fourth wall<br>\r\n(Please add)</td>",
        "id":2162907,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1587804780,
        "modified":1587804780,
        "pretty_title":"Stinky Star Wars Feet (please add)"
    }
}