{
    "chapters":{
        "1":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Human",
                "Pokemon"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the World of Pokemon. Now let's get started by giving you some information. The Pokemon in this world all know human speech. So trainers and pokemon will understand each other. All humans are normal sized, while the pokemon can be either normal, giant, or tiny depending on where the story goes. Also, this world is all vore, so some pokemon will eat another pokemon or do something else to its victim depending on where the story goes. Okay, I guess that's it for now. So what are you?</span></div></div>",
            "created":1239426000,
            "id":674450,
            "title":"The Adventure Begins"
        },
        "11":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a boy or a girl?</span></div></span></div>",
            "created":1239426000,
            "id":674452,
            "title":"Human"
        },
        "111":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "A tree",
                "A pokemon",
                "A giant pokemon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, you're a male trainer. You're walking in the woods minding you own business. You see a lot of different Pokemon both big and small. You enjoy your walk until you bumped into something. What was it?</span></div></span></div>",
            "created":1239426000,
            "id":674472,
            "title":"Male"
        },
        "1112":{
            "choices":[
                "Arcanine.",
                "Charizard.",
                "Something else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While absentmindedly wandering around you bump into something large and warm. You look up in surprise and see that you've run into a wild pokemon. But which pokemon is it?</span></div></span></div>",
            "created":1300942800,
            "id":1075661,
            "title":"A pokemon."
        },
        "11121":{
            "choices":[
                "Bit you",
                "Leaned into your hand, letting you pet it."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look at the pokemon you just bumped into and realized that it was an Arcanine. Seeing as the Arcanine hadn't attacked you, you looked at it quizzically and then reached out to pet it. The Arcanine then...</span></div></span></div>",
            "created":1332651600,
            "id":1302650,
            "title":"Arcanine."
        },
        "111211":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "push it away",
                "out of curiosity you let it continue"
            ],
            "content":"<div class=\"\"><div> <span>You were startled by the sudden bite, but what surprised you more was the bite releasing a few seconds later as the large dog-like Pokemon moved its mouth farther up your arm; its tongue wrapping around your limb and pulling it farther in. You stare at the Arcanine...</span></div></div>",
            "created":1427950800,
            "id":1957630,
            "title":"Bit you"
        },
        "1112112":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "struggle",
                "let it keep going"
            ],
            "content":"<div class=\"\"><div> <span>You watched as your arm slowly disappeared into the Arcanine's mouth, your face blushing slightly at the feeling. Curiosity overtook you and you found yourself on your knees with both your arms in the dog's mouth, drool soaking your sleeves and warm breath in your face. It was the first hard swallow that snapped you out of your trace-like state, your arms suddenly pinned inside the Arcanine's tight throat and your face pressed against its muzzle.<br>\r\n<br>\r\nWhat do you do now?</span></div></div>",
            "created":1427950800,
            "id":1957632,
            "title":"out of curiosity you let it continue"
        },
        "11121122":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "realizing the danger, you start struggling",
                "your mind is too hazy and you let yourself slip farther"
            ],
            "content":"<div class=\"\"><div> <span>even as you watched your arms disappear into the throat, you didn't try to struggle, in fact this was oddly alluring. A slight whine came from the Pokemon as it pawed at your pants before using its claws to rid you of those articles of clothing, you shivered against the cold and cringed as the cold hit your aching arousal. The Arcanine panted lightly before swallowing again, bringing your head and shoulders into its mouth, its big tongue slathering you with drool as it tasted you, it let out a hum of satisfaction at your somewhat salty taste. The large dog lifted you up into a standing position as it gulped, pressing your face to the entrance of its throat.<br>\r\n<br>\r\nIts large tongue wrapped around your waist as your midsection was pulled into its warm maw, the dog swallowed again, its throat rippling around head. A loud moan tore from your throat as its pesky tongue found its way around your erection and gave a slight tug. You squirmed in its jaws as it continued to torture you into euphoria, another sudden swallow left you practically screaming as shoulders joined your head in its throat and the warmth of the tongue uncurled itself and left you yearning.<br>\r\n<br>\r\nThe Arcanine tilted its head back and swallowed again, the pulsing throat responding by pulling you deeper inside. Your arms slid into a more open space, the stomach.</span></div></div>",
            "created":1427950800,
            "id":1957636,
            "title":"let it keep going"
        },
        "111211222":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "you are slowly digested",
                "you wake up to find yourself relatively out of harm"
            ],
            "content":"<div class=\"\"><div> <span>Part of you is screaming to panic but truly, your mind is too hazy to realize the danger. Your hips involuntarily bucked against the tongue as the Arcanine began to slurp up your legs. A low, satisfied, almost purr-like growl came from the Arcanine as it swallowed once more, landing your arousal inside its pulsing throat and allowing the dog to shut its jaws gently around your squirming legs. Gravity took over the work as the warm, rippling throat slowly worked you deeper and deeper inside; a loud shuddering moan wracked your body as you finally gained release, your hips pressing against the walls that surrounded you.<br>\r\n<br>\r\nOutside, the visible bulge you made seemed to slide painfully slow down the Arcanine's neck as its stomach slowly expanded, its midsection becoming taunt as you slid inside. The Arcanine licked its lips as your legs finally joined the rest of you in its throat. It took only a few more minutes for you to slide into waiting belly, you were forced into curled up position as the stomach closed in around you in a tight hug. Letting out a satisfied burp, the Arcanine flopped onto its back, its hind legs spread as its belly rest over its lower half.<br>\r\n<br>\r\nYou pressed and pushed against the walls as they squeezed you again with a loud groan. </span></div></div>",
            "created":1427950800,
            "id":1957638,
            "title":"your mind is too hazy and you let yourself slip..."
        },
        "1112112221":{
            "author_id":"theanthro",
            "author_name":"Auron The Nomcario",
            "content":"<div class=\"\"><div> <span>Deep down in the back of your hazy, lust-filled mind you knew the Arcanine had you completely trapped inside its gut, and that loud groan signified without much doubt it's digestive system was starting to stir.. But you couldn't really struggle against it, lost in bliss as you were, you barely noticed the chamber getting warmer, the fleshy, slimy walls starting to churn and groan over you, pumping the fire dog's gastric juices into the chamber, tingling and itching at first, but soon graduating into a mild burning..<br>\r\n<br>\r\nThe Arcanine rurrs as it licks its lips, yawning and belching again as its belly became more active, fully intent on digesting its latest treat without delay, the big fire dog was a bit lusty as well as hungry it seemed, rumbling as it pawed over its gwuorrrgling gut, panting in an open-mouthed smile as you slowly melted away into the big canine's pudge and nutrients.<br>\r\n<br>\r\nYou barely felt yourself fading away as with that belch, you'd pass out from asphyxiation, the last feeling being bliss as you churned and glorped away into more of the Arcanine's warm, fluffy chub, giving one final sigh as you passed out, never to awaken again, but at the very least making one hungry fire dog happy with its meal.</span></div></div>",
            "created":1429938000,
            "id":1969131,
            "title":"Arcanine chow"
        },
        "11122":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "It's hungry for meat",
                "Some other pokemon \"saves\" you"
            ],
            "content":"<div class=\"\"><div> <span>\"Char...\" It growls at you, standing so close that you can feel his hot breath on your face. <br>\r\n\"Um... what do you want\" You manage to say, slowly trying to back away. <br>\r\n\"Char!\" It repeats, louder this time. grabbing your arms in a crushing grip.<br>\r\n<br>\r\nWhat does it do next?</span></div></div>",
            "created":1426222800,
            "id":1947788,
            "title":"Charizard."
        },
        "111221":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "content":"<div class=\"\"><div> <span>The Charizard opens his mouth wide, wide enough to fit a human in it. <br>\r\n\"No... please!\" You beg to charizard to no effect. Suddenly, Charizard lifts you off the ground almost effortlessly and shoves you face first into his mouth. The hot breath washes over you as the throat muscles begin shoving you down into the stomach. Your body flops into the stomach, acids washing over you in waves. You can feel yourself getting digested and you knew there was no hope for you anymore, letting yourself slip into unconsciousness as the charizard absorbs his meal.</span></div></div>",
            "created":1426222800,
            "id":1947791,
            "title":"It's hungry for meat"
        },
        "111222":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "The legendary Dialga!",
                "It's a... giant Lucario?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just as Charizard was about to swallow you whole, another larger Pokemon swoops in, knocking out the Charizard saving your life.<br>\r\n<br>\r\nWhich Pokemon was it?</span></div></span></div>",
            "created":1426222800,
            "id":1947793,
            "title":"Some other Pokemon \"saves\" you"
        },
        "1112221":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "content":"<div class=\"\"><div> <span>Just as you where about to be swallowed by Charizard, a portal opened up in the sky and out popped Dialga, squishing Charizard under his foot. <br>\r\n\"Oh wow, thanks Dialga!\" You say graciously at the legendary Pokemon of time towering over you.<br>\r\n\"Wait... who are you?\" Dialga asks using his (insert legendary ex-machina powers) <br>\r\n\"Wait a minute,\" You say \"You mean you didn't mean to save me?\"<br>\r\n\"Uh, no... I don't even know you. But you know what, all this time travel makes me awfully hungry and you wouldn't make that much of a meal... no offense\"<br>\r\n\"None taken... wait, then what do you going to do?\"<br>\r\n\"Well, being the legendary Pokemon of time does have it's advantages\" Dialga says as he begins to float up towards the time portal.<br>\r\n\"3 minutes into the past I go then!\"<br>\r\n<br>\r\n<b>3 Minutes Prior!</b><br>\r\n<br>\r\n\"Wait no stop!\" You yell, when out of the sky a gigantic mouth swoops out of a portal, Dialga's mouth to be precise, and swallows Charizard and you whole.<br>\r\nCharizard is pressed up against your body as the two of you are digested in Dialga's stomach.</span></div></div>",
            "created":1426222800,
            "id":1947798,
            "title":"The legendary Dialga!"
        },
        "1112222":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "content":"<div class=\"\"><div> <span>That's right, A gigantic Lucario just came in and saved you from certain death, towering over you at 40 feet tall! <br>\r\n\"Wait.. why did you save me?\" You ask it as it grabs you in its paw which was larger than your whole body.<br>\r\n\"Well\" It begins, speaking to you over some sort of telepathy, \"I felt it was unfair that Charizard gets the free meal today, he's always getting all the attention... freaking gen one'rs.\"<br>\r\nYou can't believe what you're hearing, your would be saver thought of you as nothing more than a snack!<br>\r\n\"Wait a minute!\" You start to say, but Lucario lifts you over his gaping mouth and drops you in. You fall down past 4 foot glistening white teeth, past a house sized tongue, down through a throat the size of a tunnel, and finally plummeting into the enormous stomach. You hit the ground, killing you on impact. Your dead body digesting deep in Lucario's body.</span></div></div>",
            "created":1426222800,
            "id":1947795,
            "title":"It's a... giant Lucario?"
        },
        "11123":{
            "author_id":"comp234",
            "author_name":"Harry",
            "choices":[
                "Typhlosion",
                "Rapidash"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it these?</span></div></span></div>",
            "created":1387861200,
            "id":1713145,
            "title":"Something else..."
        },
        "111232":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Rapidash",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To keep the options open, here’s another choice chapter.</span></div></span></div>",
            "created":1544245200,
            "id":2587330,
            "title":"Rapidash"
        },
        "1113":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "A giant Lucario",
                "A giant Lugia",
                "A different giant pokemon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What giant pokemon did you bump into?</span></div></span></div>",
            "created":1239426000,
            "id":674473,
            "title":"A giant pokemon"
        },
        "11131":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "It's Friendly",
                "It's not Friendly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You saw a giant Lucario and you bump into his feet. The Lucario saw you, but is it friendly?</span></div></span></div>",
            "created":1239426000,
            "id":674474,
            "title":"A giant Lucario"
        },
        "111311":{
            "choices":[
                "Get on its paw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Its friendly. The Lucario smiles and places his large paw before you, urging you to get on. You...</span></div></span></div>",
            "created":1284267600,
            "id":955813,
            "title":"It's Friendly"
        },
        "1113111":{
            "author_id":"nhewitt12",
            "author_name":"Wormtail",
            "choices":[
                "Yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>You climb on its paw, Lucario slowly lifts you till you are eye to eye and then it speaks to you telepathically. \"Fear not human, I am here to protect you.\" You say \"Thank you, I always wanted a pokemon.\" (long yawn) The Lucario looks at you concerned \"You look tired.\" You say, \"Yeah I couldn't in fear of weird pokemon and I have no pokemon minus you\" Lucario thinks of a place to sleep it knew something. \"Do you want to sleep inside me? I won't digest you. You will be safe while I'm around. Do you want to?   </span></div></div>",
            "created":1305262800,
            "id":1105242,
            "title":"Get on it's paw"
        },
        "11131111":{
            "author_id":"nhewitt12",
            "author_name":"Wormtail",
            "content":"<div class=\"\"><div> <span>\"I also wanted to be inside a giant pokemon,\" you said with great relief. \"If you don't mind,\" you said, \"Can I take my cloths off?\" The lucario nodded its head. There is nothing on you but your skin. Lucario opened its mouth and you slowly step on its tongue. The taste buds tickles your feet. Now you slowly lie on your back, then Lucario gulps you down. You go pass the esophagus and land in the stomach, and he was right the acids not burning you. It's like being in a hot tub without the fatigue feeling you get for sitting in for too long. In it, the walls slowly massage your back and the heart beating can lull you to sleep. This was the best place to sleep. \"How is it in there?\" You get drowsy, you can only say, \"It....is.....the......best.......\" You are now sleeping with the best pokemon, which is now your best friend what more can you get.         </span></div></div>",
            "created":1305262800,
            "id":1105246,
            "title":"Yes"
        },
        "111312":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Run",
                "Stay"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The giant Lucario is angry at you. It reach out for you. Will you run away?</span></div></span></div>",
            "created":1239426000,
            "id":674476,
            "title":"A mean Lucario"
        },
        "1113122":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Inside Lucario's mouth",
                "Within Lucario's feet"
            ],
            "content":"<div class=\"\"><div> <span>You were frozen with fear, allowing the Lucario to easily capture you. You are trap within its paws as it takes you to its cave. At Lucario's cave, Lucario is thinking about what he should do with his victim. On one hand he can eat    you, on the other hand he can have fun with you by putting you in his feet and then eat you. Where will you end up in?</span></div></div>",
            "created":1239426000,
            "id":674479,
            "title":"Captured"
        },
        "11131221":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "No, you'll be digested",
                "Yes, the stomach acids are not hurting you"
            ],
            "content":"<div class=\"\"><div> <span>Lucario toss you in his mouth. You try to escape, but his jaws close right in front of you. You were being pushed by Lucario's tongue toward the back of the throat. And before you know it, he swallows you. Down the throat you go until you land in his stomach. Will you survive?</span></div></div>",
            "created":1239426000,
            "id":674483,
            "title":"Trapped Inside Lucario"
        },
        "111312211":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "content":"<div class=\"\"><div> <span>As soon as you landed in his stomach, you began to feel a burning sensation where ever the acids touched you. soon your clothes dissolved off your body. In a matter of minutes, you lose consciousness as the rest of your body digests in the lucarios body. </span></div></div>",
            "created":1428123600,
            "id":1958808,
            "title":"No, you'll be digested"
        },
        "111312212":{
            "choices":[
                "Try to speak to Lucario.",
                "Wait for something to happen."
            ],
            "content":"<div class=\"\"><div> <span>With a slurping sound you are deposited into the stomach. There's not much there but a pool of acid and half digested food. You take a second to take in everything around you. Fleshy pink walls dripping with saliva surround you on all sides. You've never been swallowed, and you have to admit, this experience was a bit... arousing.<br>\r\n<br>\r\nBut suddenly, like a light going on in your brain, realization struck. You've been eaten, and if you touch that acid, you die, so you need to get out fast. Not much of an escape artist, you frantically punch and kick at the stomach walls, hopefully to make Lucario throw you up, but your attacks were absorbed by the squishy pink flesh. You are pushed backwards by the force of Lucario patting his stomach. Enjoying your struggles, he lets out a small murr, which you can hear all around you. You begin to panic more as the acids start to rise. You back up, not wanting to touch the acid. It rises up to your feet.<br>\r\n<br>\r\nIt hurts! It hurts.... It.... doesn't?<br>\r\n<br>\r\nYou open your eyes and look down. The acid is around your feet, and has dissolved your shoes but it hasn't affected you. It feels just like warm water. Are you immune or something? You relax a bit, now knowing that you aren't going to get hurt. Sitting down in the pool of acid, you lean against the pink muscle, and listen to everything around you. The churning and gurgling of the digesting food, the beating heart above you. You wonder whats going on outside.</span></div></div>",
            "created":1295672400,
            "id":1040278,
            "title":"Immune to acids."
        },
        "11132":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "...mean.",
                "...friendly."
            ],
            "content":"<div class=\"\"><div> <span>You lay flat on the ground to find that you've bump into a giant Lugia. When Lugia notice you, he bent down to get a good look at you. Now you wonder what's a Lugia doing in the middle of the woods. You looked around to find that there's a beach close by. You then return your attention to the Lugia and notice that it was...</span></div></div>",
            "created":1267074000,
            "id":842297,
            "title":"A giant Lugia"
        },
        "111322":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Continue your journey.",
                "Follow the Lugia."
            ],
            "content":"<div class=\"\"><div> <span>It gently nudges you with its beak. It kinda likes you. You were awestruck by the presence of a legendary pokemon. Suddenly the Lugia flew up out of the trees and land on the beach. You wonder wether to go about your business or join Lugia at the beach.</span></div></div>",
            "created":1267074000,
            "id":842299,
            "title":"...friendly."
        },
        "1113222":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "He kneeled down, so you can ride him.",
                "He tilt his head to you."
            ],
            "content":"<div class=\"\"><div> <span>You follow Lugia to the beach. When Lugia saw you, he smiled. He was actually kinda glad you came. You got a little closer, as Lugia began to lay on its side, revealing his giant blue belly. It was twice your size, and you were impressed. Lugia had let you come closer to his belly you then began to rub it and Lugia growled softly at the pleasure. You then rest your head on the belly, and you could here the noises coming from it. It was music to your ears, so you find it enjoyable. Suddenly Lugia got up, what's it doing?</span></div></div>",
            "created":1267074000,
            "id":842303,
            "title":"At the Beach."
        },
        "11132222":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "In a cave.",
                "To be inside Lugia's stomach"
            ],
            "content":"<div class=\"\"><div> <span>You stood still as Lugia got closer to you. You can feel the air coming from it's nostrils. It was warm, and smelled like fish. You touched its beak, which is very smooth. Being close to a legendary pokemon is every trainer's dream. Just then, Lugia opened his mouth. You gazed inside the darkness that is Lugia's mouth. You feel both lucky and nervous. Lugia kept its mouth open, which you suddenly realized he wants you inside. You didn't know what to do, except that you were taking off your clothes. Your shirt, your shoes, your socks, and your pants, till all that's left is your underwear and your backpack. You place your backpack on top of your clothes. You turn to find that Lugia is still there with it's mouth still open. You got closer to the great beast that is Lugia. You climb into mouth and rest on its tongue face down. Lugia then close his mouth, while you closed your eyes. The tongue was moist and slushy, but you didn't care. As you drift off into sleep. Few hours later, you woke up to found yourself...</span></div></div>",
            "created":1267074000,
            "id":842310,
            "title":"An Inside look."
        },
        "111322221":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Next Morning"
            ],
            "content":"<div class=\"\"><div> <span>It looks like this cave belong to Lugia. You look around to find that your stuff is here as well. You looked up to find that Lugia was watching you as well. You looked outside to find that it's night time. Lugia offered to let you sleep inside him. You gladly agreed to the idea. Lugia open his mouth so you can climb back inside, Lugia lift his head up and swallows you. As you reach the inside of the stomach, you laid yourself down, your head resting on the stomach walls, as you drift off to sleep. </span></div></div>",
            "created":1267074000,
            "id":842316,
            "title":"Spending the night"
        },
        "111322222":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "content":"<div class=\"\"><div> <span>You looked around and confirm that you're inside Lugia's stomach. He must have swallowed you while you're asleep. You look down and find that you're in a pool of stomach acids. But you're not in pain, as if the acids did not affect you. You suddenly got a vision of what appears to be the moonlit sky. Then the view shifts down to what looks likes the outside of Lugia's belly. You then realized that Lugia was sharing his views to you. You then saw one of Lugia's wing rubbing its belly. You decide to give Lugia a belly rub of your own. And Lugia likes it a lot. Just then a couple of berries arrive at the stomach some were swallow whole while others were chewed. You figured the chewed up ones were for lugia and the ones swallowed whole are yours. You were starving so you dig into the berries. Several minutes later, you find yourself tired. You then hear Lugia yawning as well, and it was loud due to you inside his belly. You figured why not stay in Lugia's tummy for the night. And that's exactly what you plan to do. Lugia later looked into your backpack to find one pokeball. He opened it to reveal a yellow Pikachu. You then hear Lugia speaking to Pikachu in the pokemon language. He must be explaining to Pikachu about where I am. Just then a loud gulping sound occured. You looked up the esophagus at the top of the stomach, to discovered that your Pikachu is there. As Pikachu landed, he happily rushed to you and gave you a big hug. You then yawned telling you you're tired. Pikachu yawned as well, and began to snuggle up to you. You smiled, and began to cuddle up and began to sleep inside Lugia's tummy. You think to yourself, I do not want to leave this place, ever. The night was calm and soothing. Lugia slept on the beach, with you and your Pikachu inside him.</span></div></div>",
            "created":1267074000,
            "id":842315,
            "title":"In the belly of the beast, literally."
        },
        "11133":{
            "choices":[
                "Zoroark?",
                "Charizard?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What pokemon is it?</span></div></span></div>",
            "created":1298005200,
            "id":1056468,
            "title":"A different giant pokemon."
        },
        "111331":{
            "choices":[
                "...friendly.",
                "... Non-friendly."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look up and see a Giant Zoroark. He looks down to you. You are terrified to see such a big Pokemon.<br>\r\nThen you realize that its...</span></div></span></div>",
            "created":1306386000,
            "id":1113270,
            "title":"Zoroark?"
        },
        "1113311":{
            "choices":[
                "...Cave?\"",
                "...Belly?\""
            ],
            "content":"<div class=\"\"><div> <span>You find out that its friendly. He gets on knees and wants you to climb on his hand. You accept and climb on his hand. Then the Zoroark asks you \"Why are you so little human?\" \"Actually, I don't know,\" you say still a little frighten. Then suddenly you feel very sleepy. The Zoroark looks at you and says. \"You look kinda sleepy.\" \"Yeah,\" you answered. \"Do you want to sleep in my...</span></div></div>",
            "created":1306386000,
            "id":1113275,
            "title":"...friendly"
        },
        "11133111":{
            "choices":[
                "...the cave.\"",
                "...the zoroark's belly.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Yeah, sure. Why not,\" you answered. \"Ok!\" And the Zoroark starts walking. But suddenly you fall asleep. When you wake up you are in...</span></div></span></div>",
            "created":1306386000,
            "id":1113278,
            "title":"Cave"
        },
        "111331112":{
            "choices":[
                "reader's choice",
                "reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You wake up in the Zoroark's belly. \"What happened? WHY AM I HERE?\" I started to yell.  Then the Zoroark tells you, \"It suddenly got cold and I couldn't find something to warm you up. So I put you there, where you won't be cold.\" \"Oh. Then, thanks, I guess.\"  </span></div></div>",
            "created":1306386000,
            "id":1113279,
            "title":"The Zoroark's belly"
        },
        "1113311121":{
            "choices":[
                "Wait for the giant Zoroark to return",
                "Leave the cave and try to follow him"
            ],
            "content":"<div class=\"\"><div> <span>The next morning, the chirping sound of a Chatot outside mimicks \"Good morning! Good morning!\", waking you up. Looking around, you suddenly notice you are not in the Zoroark's belly any more; you're on the cool surface of the cave floor. You weren't digested after all, which makes you feel really grateful.<br>\r\n<br>\r\nClimbing up to your feet, you start to walk outside of the cave...<br>\r\n<br>\r\n...and gasp! Right in front of you is a huge...YOU?<br>\r\n<br>\r\n\"Hey, who the heck are you?\" you ask. \"You can't possibly be me!\"<br>\r\n<br>\r\nYour supposed look-alike grins. \"No, silly,\" he speaks. \"It's me...\"<br>\r\n<br>\r\nThen suddenly, your <i>double</i> begins to distort in front of your eyes. There is a moment's pause, and then, you see what it really is. It's the giant Zoroark, having used its <b>Illusion</b> ability.<br>\r\n<br>\r\n\"Wow,\" you gawk. \"That was pretty cool!\"<br>\r\n<br>\r\n\"You like it?\" the Zoroark grinned. \"I usually like to fool people with that trick...it's hilarious to see their reaction.\"<br>\r\n<br>\r\n\"Well, you sure fooled me...\" you start to say, when suddenly, a deep growl in your stomach echoes out.<br>\r\n<br>\r\nThe Zoroark smiles at you. \"I guess you're hungry, huh? Don't worry; I'll get you something to eat.\"<br>\r\n<br>\r\nHe turns and walks into the distance. You watch him as he disappears into the distance.<br>\r\n<br>\r\nWhat should you do at this point?</span></div></div>",
            "created":1309842000,
            "id":1140692,
            "title":"The next morning"
        },
        "111332":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Charizard",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To allow people to have more options, here is another choice chapter.</span></div></span></div>",
            "created":1544245200,
            "id":2587328,
            "title":"Charizard?"
        },
        "1113322":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a pidgey?</span></div></span></div>",
            "created":1544245200,
            "id":2587329,
            "title":"Other "
        },
        "11133222":{
            "author_id":"samueliscool",
            "author_name":"Poi Yo",
            "choices":[
                "Sure",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Zorua, the Tricky Fox Pokemon?</span></div></span></div>",
            "created":1572152400,
            "id":2739162,
            "title":"No"
        },
        "111332221":{
            "author_id":"samueliscool",
            "author_name":"Poi Yo",
            "choices":[
                "Playfulness",
                "Mischievousness",
                "Hunger"
            ],
            "content":"<div class=\"\"><div> <span>You bump right into a giant paw of some kind. You look up to see a very big Zorua, how big exactly you have no idea, but big enough to where you have to step back a little to see its head. It also doesn't seem to notice you are near him, which is good, don't want some unneeded attention towards you, until you notice the Zorua's paw is coming right towards you.<br>\r\n<br>\r\nYou are unable to run, due to how scared you were, as the limb lands onto your legs and body, leaving your head exposed. Looking up, you notice that the Zorua is looking right at you. You see its head lower towards you, inspecting to what you might be, until a look of _______ spreads across its face. </span></div></div>",
            "created":1572152400,
            "id":2739173,
            "title":"Sure"
        },
        "1113322212":{
            "author_id":"huntzillar",
            "author_name":"Rawrk",
            "choices":[
                "The Zorua quickly swallows",
                "The Zorua plays with you for a while",
                "The Zorua carries you back to its home"
            ],
            "content":"<div class=\"\"><div> <span>The Zorua's face stretched into a massive grin that was laced with mischief, the giant Pokemon obviously very happy that a human accidentally bumped into them on this fine day. Its expression made you worry for your safety so you struggled a bit to communicate that you didn't like being forcefully pinned under its paw, hoping it would let you go. Unfortunately the huge fox was having none of that and pressed the paw down harder, snickering at your futile efforts.<br>\r\n<br>\r\nSuddenly, its head lowered even further until a black nose was sitting barely an inch away from your face. Hot air rushed over you as it sniffed your head and it released its foothold on you just a bit so it could smell your body. The Zorua gave a gentle hum of approval before it raised its head and continued staring at you with a devilish grin.<br>\r\n<br>\r\nWhile the Zorua was happy, you weren't all that optimistic about the possible outcomes of this interaction. With a Pokemon large enough to let them do whatever they wanted while also holding such a smug expression made you think you were already done for. <br>\r\n<br>\r\nIt only sealed the deal when the Zorua parted its jaws and pressed a hot slimy tongue against you. The giant paw that was pinning you down suddenly eased off and gave you a chance to escape, however, the tongue proved too powerful and kept you pinned down in the paw's stead. In one sudden motion it wrapped around you and lifted you up and brought you into the trickster fox's mouth. It was a snug fit and your feet barely reached the back of its throat while pearly fangs sat to both your sides. A deep rumble echoed around you as it snickered again.</span></div></div>",
            "created":1572238800,
            "id":2739419,
            "title":"Mischievousness Zorua"
        },
        "111332222":{
            "author_id":"xxx13000",
            "author_name":"Kilometrico",
            "choices":[
                "Skuntank",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about a Pokemon that hasn't been included anywhere, Skuntank?</span></div></span></div>",
            "created":1587522780,
            "id":2822430,
            "title":"Nah"
        },
        "1113322222":{
            "author_id":"xxx13000",
            "author_name":"Kilometrico",
            "choices":[
                "Gens 7 or 8",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe one from Gens 7 or 8?</span></div></span></div>",
            "created":1587522900,
            "id":2822433,
            "title":"Other"
        },
        "11133222221":{
            "author_id":"xxx13000",
            "author_name":"Kilometrico",
            "choices":[
                "Alola",
                "Galar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would you like to go to the Alola region or the Galar region?</span></div></span></div>",
            "created":1587523260,
            "id":2822439,
            "title":"Gens 7 or 8"
        },
        "111332222212":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Skwovet",
                "more"
            ],
            "content":"<div class=\"\"><div> <span>You groan and sit up, rubbing your head as you look about. From the looks of it, you were in the Wild Area of Galar. Feeling your belt, you became understandably nervous as you had no PokeBalls, meaning if a dangerous Pokemon came by, you were defenseless. A rusling sound behind you drew your attention to some bushes, where out emerged a...</span></div></div>",
            "created":1602528240,
            "id":2919877,
            "title":"Galar"
        },
        "11133222222":{
            "author_id":"xxx13000",
            "author_name":"Kilometrico",
            "choices":[
                "Sceptile",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Sceptile?</span></div></span></div>",
            "created":1587523080,
            "id":2822435,
            "title":"Other"
        },
        "111332222222":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Sure",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the Useless Rattata eating you up?</span></div></span></div>",
            "created":1602429600,
            "id":2919082,
            "title":"No"
        },
        "112":{
            "choices":[
                "A Forest",
                "A Beach",
                "More..."
            ],
            "content":"<div class=\"\"><div> <span>          You're a girl trainer. You have just recently left a Pokemon Center where you left all but one of your pokemon to recover from their last fight. The one pokemon you carry that did not suffer from your last fight is your Charizard; whom is your strongest pokemon. While your pokemon rest, you decided to take a stroll through the great outdoors. The enviorment surrounding you is a...</span></div></div>",
            "created":1314680400,
            "id":1178046,
            "title":"Girl Trainer"
        },
        "1121":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "A large Pokemon appears!",
                "A legendary Pokemon appears!",
                "A small Pokemon jumps you from behind!"
            ],
            "content":"<div class=\"\"><div> <span>You decide a stroll through a forest would be nice after all, you've got your Charizard to protect you. After a few minutes of heading into the forest you wonder why you haven't seen many Pokemon yet, besides a few Caterpie and Pidgey, When...</span></div></div>",
            "created":1420002000,
            "id":1910073,
            "title":"A Forest"
        },
        "11211":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Arcanine, and it looks hungry!",
                "Other equally voracious Pokemon!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Pokemon appears?</span></div></span></div>",
            "created":1420002000,
            "id":1910074,
            "title":"A large Pokemon appears!"
        },
        "112111":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Zoroark",
                "Rapidash"
            ],
            "content":"<div class=\"\"><div> <span>A female Arcanine jumped out of the bushes, knocking out your Charizard with a Fire Blast as she did so. You gasp and look at your  'Mon in disbelief when suddenly, a light Flamethrower washed over you, turning your garments to ash. You look at the Arcanine, who SPOKE. \"Now with him out of the way,\" she said, licking her lips. you figure out what she was going to do a moment too late.<br>\r\n<br>\r\nShe pounced, engulfing your upper body in her gob. Your kicking was ignored as her giant tongue curled around your body, taking in your taste. She hummed, sending quakes through your body. she gulped and took in your lower body, sucking on your like a lollipop. With another gulp, you were sent to her belly. You groan at the immense heat. But your troubles weren't over yet.<br>\r\n<br>\r\nA series of larger gulps sounded, and soon you were squished by your out cold Charizard. \"Now you both can gurgle,\" she said as she lay down. A few hours later she got up, licking her lips and trotting off, her rump noticeably bigger.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nnow who will eat you?</span></div></div>",
            "created":1584248400,
            "id":2801865,
            "title":"Arcanine, and it looks hungry!"
        },
        "112112":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "YOU BET!!!",
                "naw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the Swords of Justice?</span></div></span></div>",
            "created":1584075600,
            "id":2801048,
            "title":"Other equally voracious Pokemon!"
        },
        "1121121":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Cobalion",
                "the other two"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which ones?</span></div></span></div>",
            "created":1587566640,
            "id":2822668,
            "title":"YOU BET!!!"
        },
        "11211212":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Virizion",
                "Keldeo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>they are...</span></div></span></div>",
            "created":1587566880,
            "id":2822670,
            "title":"the other two"
        },
        "11212":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "It's Groudon!",
                "Other more suitable giants!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Pokemon of legends decides that you look like a tasty snack?</span></div></span></div>",
            "created":1420002000,
            "id":1910076,
            "title":"A legendary Pokemon appears!"
        },
        "11213":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Rattata",
                "Houndour"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Pokemon will it be?</span></div></span></div>",
            "created":1584248400,
            "id":2801809,
            "title":"A small Pokemon jumps you from behind!"
        },
        "1122":{
            "choices":[
                "A legendary pokemon.",
                "A normal sized aquatic pokemon.",
                "A giant aquatic pokemon."
            ],
            "content":"<div class=\"\"><div> <span>          You are walking along the beach. The sand is scalding, the sun is hot, and the day is hot; a great day for cooling off in the ocean, which is what you planned on doing. You find a good spot to lay down your towel as well as your bag, and then strip down into your bathing suit. You wade into the water and begin swimming around, letting the cool ocean current flow over your delicate body. Suddenly something catches your attention out of the corner of your eye, something is coming out of the water and onto the beach. It's...</span></div></div>",
            "created":1314680400,
            "id":1178047,
            "title":"The Beach"
        },
        "11221":{
            "choices":[
                "A Lugia",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which legendary pokemon is it?</span></div></span></div>",
            "created":1314680400,
            "id":1178049,
            "title":"Legendary!"
        },
        "112211":{
            "choices":[
                "Angry Lugia.",
                "Mellow Mannered Lugia."
            ],
            "content":"<div class=\"\"><div> <span>          You stare in awe as the legendary pokemon, Lugia, wades out of the water and onto the beach. You cannot believe that it has left its deep sea habitat and has decided to trek onto land. You think to yourself \"this is an opportunity of a lifetime! I can capture this Lugia and become one of the best pokemon trainers ever!\". You swim towards the beach, trying to evade being seen by the Lugia, who is inspecting the coastal plants and trees, looking for something. You wade onto the beach and head towards your bag to grab a pokeball, and then begin to sneak behind the still Oblivious Lugia. You ready the pokeball and throw it at the Lugia, who turns in surprise as the pokeball hits it and draws it inside. The pokeball shakes once...twice...then breaks open, revealing a...</span></div></div>",
            "created":1314680400,
            "id":1178061,
            "title":"An Opportunity of a Lifetime."
        },
        "1122111":{
            "choices":[
                "Attempt to reason with Lugia.",
                "Make a run for your bag."
            ],
            "content":"<div class=\"\"><div> <span>          The pokeball bursts open to reveal a very agitated Lugia. The Lugia stares at you in anger as it approaches you; you're defenseless without your charizard, you have to get to your bag somehow to defend yourself from this powerful pokemon. Or you could try to reason with the Lugia, seeing as it is an intelligent pokemon. You...</span></div></div>",
            "created":1314680400,
            "id":1178225,
            "title":"A Turn for the Worse."
        },
        "11221111":{
            "choices":[
                "Stand there and allow yourself to be eaten.",
                "Try to evade Lugia."
            ],
            "content":"<div class=\"\"><div> <span>          Lugia glares menacingly at you as it approaches, it must of really not have liked the idea of being put inside a pokeball. You stare back in fear, not knowing what it was going to do now, you decide to ask and hopefully receive a reply. \"Wh-what are you going to do to me?\" you ask stammeringly. The Lugia stops moving towards you, and surprisingly responds.<br>\r\n<br>\r\n\"Well if you must know, I was looking for food before you threw that contraption at me,\" Lugia said, then stared back at you deviously, \"I normally eat plants and seaweed. But today I feel like something, different...\" Lugia said as it took another step towards you. You didn't like where this was going...<br>\r\n<br>\r\n\"Wh-what do you mean, d-different?\" you replied, a hint of worry still in your voice. The Lugia took another step.<br>\r\n<br>\r\n\"Something more, filling. Something that isn't seaweed,\" Lugia responded as it licked its chops. Lugia was only a few feet from you now.<br>\r\n<br>\r\n\"You mean like-...\" you barely say.<br>\r\n<br>\r\n\"YOU!\" Lugia blurts aloud as it opens its mouth and lunges forward! Do you...<br>\r\n<br>\r\n</span></div></div>",
            "created":1314853200,
            "id":1179326,
            "title":"Determining Ones Fate"
        },
        "112211111":{
            "content":"<div class=\"\"><div> <span>          Lugia opens its maw and lunges towards you. You sit still, frozen, as Lugia's mouth engulfs your upper torso inside its mouth. Its tongue presses against your breasts, and then wraps around your arms to constrict their movement. Lugia is savoring your flavor as it lifts its head up and tilts back a little bit to allow you to slide further into its maw. Your stomach and waist are now inside, leaving your legs outside of the Lugia's mouth; you kick, attempting to gain some freedom from the great beasts mouth, but it's useless. Lugia tilts its head back a bit more, engulfing your bottom and thighs inside its mouth, then wrapping its tongue around your legs. \"This can't be happening...\" you think to yourself as it tilts its head back further, allowing your bare feet to slide into Lugia's maw. Then, with a single gulp, Lugia swallows you whole, and sends your form sliding down its throat into its stomach. You land in the stomach with a soft plop. You look around your dark surroundings as you hear a loud belch emanate from Lugia. You then hear a splash from the outside as Lugia begins to dive back into its natural habitat with a full stomach.</span></div></div>",
            "created":1314853200,
            "id":1179345,
            "title":"Resistance is Futile."
        },
        "112211112":{
            "choices":[
                "Try to go back and recover your bags.",
                "Keep venturing onward."
            ],
            "content":"<div class=\"\"><div> <span>          Lugia opens its mouth and lunges towards you. You are quick to react and dart to your left and out of the way of Lugia's gaping maw. Suddenly you fall down, something has a hold of your foot; you look back to see that Lugia has engulfed your foot inside its mouth and is now wrapping its tongue around your right leg, pulling you further towards Lugia. You shake your right leg as much as you can, as well as kicking at Lugia's head with your left foot. Lugia quickly becomes agitated from the kicking and times your next kick so that your other foot lands inside its mouth. Lugia then wraps its tongue around both your legs and pulls you inside its mouth. Your knees go in, and then your thighs, followed by your rear and waist. \"Stop eating me!\" you yell aloud as you smack Lugia right in the forehead, causing it to wince a little bit.<br>\r\n<br>\r\n\"Stop resisting and just accept your fate, human!\" Lugia yells aloud telepathically as it tilts its head upwards and causes your legs to slide deeper into its throat.<br>\r\n<br>\r\n\"I don't want...to be eaten...today!\" you manage to say as you use all your upper body strength to pry Lugia's mouth open and pull your legs out of its throat. Lugia attempts to counter your break for freedom my trying to buckle your elbows and make you fall into its throat by trying to close its mouth with even greater strength. You feel a sudden rush, your adrenaline is kicking in as you pry open Lugia's mouth and fall out onto the sand, Lugia looks on in surprise as you get up and run for the tree line.<br>\r\n<br>\r\nYou make it to the tree line and then look back to find amazingly, the Lugia hasn't moved from where it was. It's as if it was letting you go. You become curious and walk back onto the beach. \"Why are you just sitting there?\" you ask as you walk towards the Lugia.<br>\r\n<br>\r\n\"I've never been overpowered by...by a human before,\" Lugia stammers in reply, you take a step closer.<br>\r\n<br>\r\n\"You've tried eating a human before?\" you question. A look of trickery then quickly overcomes Lugia's face.<br>\r\n<br>\r\n\"No...but I won't fail a first time! You humans have one fatal weakness, curiosity!\" Lugia blurts aloud as it lunges at you once again. You still have a bit of adrenaline running through your veins and manage to dodge it again, as well as making it back into the treeline. Lugia tries to give quick pursuit, but the trees impede it from journeying any further due to its size. You keep running until you can no longer hear Lugia's angry thrashing, and then decide to...</span></div></div>",
            "created":1314853200,
            "id":1179360,
            "title":"Almost Dinner."
        },
        "1122111121":{
            "choices":[
                "...dinner time...",
                "...for your pokemon!"
            ],
            "content":"<div class=\"\"><div> <span>            As you sprint towards your bags, full of your faithful pokemon, resting in their pokeballs, the beast soars overhead, landing in front of you. You see the cold hunger in its eyes. A hunger that says, I HAVE YOU NOW. It licks its monstrous chops and hurtles at you. You try to dodge it, but the beast snatches you up in its vast maw and gulps you down. However, on the way down, you hag on to the walls of the throat, choking the beast. Hand over hand, inch by inch, you crawl up the windpipe. When you reach the mouth, you work your fingers in, and slowly pry it open. It shakes violently, trying you make you lose your grip. Using a well timed leap, you are launched into the air. You use your falling speed as a boost, planting a solid stomp onto its skull. Dazing it only momentarily. You smile, and realize that it's...</span></div></div>",
            "created":1382418000,
            "id":1682700,
            "title":"Bag Run!"
        },
        "11221112":{
            "content":"<div class=\"\"><div> <span>          As the Lugia approaches you, you look to your bag. It's not too far away, but far enough that you could be intercepted by the Lugia if you try to make a run for it. You decide to take your chances and quickly dart to your right towards the bag. You're quick, but the Lugia is quicker; it appears infront of you in a flash, knocking you down with its stomach. On your back, you look up at the Lugia who is now staring down at you, its form blocking out the bright sun. It lowers its head down towards you and begins sniffing you, trying to determine something. Then it brings its head only inches from your face, and licks your face. The Lugia appears to like your taste... It licks your stomach, and then your legs. It really likes your taste... The Lugia brings its head back up, licking its chops as it looks at you in hunger. You quickly get up and try to run away from it, but Lugia is too fast for you. Suddenly everything goes dark, the Lugia has engulfed the upper portion of your body inside its mouth. Lugia's tongue is pressing against your back and is savoring your flavor as it tilts its head upwards, causing you to slide back into its throat. Your legs pass into the Lugia's mouth, and then finally your feet. The Lugia gulps and sends your slender form down its narrow neck. Lugia yawns and decides to rest in the shade to digest you.</span></div></div>",
            "created":1314680400,
            "id":1178235,
            "title":"Eaten"
        },
        "112212":{
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it a Male Latios? Or a Female Latias?</span></div></span></div>",
            "created":1314680400,
            "id":1178054,
            "title":"Latios / Latias."
        },
        "1122121":{
            "author_id":"koopa",
            "author_name":"CanidSerpent",
            "choices":[
                "The Latios",
                "The Latias"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it the male Latios,<br>\r\n<br>\r\nor the female Latias?</span></div></span></div>",
            "created":1341118800,
            "id":1369987,
            "title":"Which?"
        },
        "11221211":{
            "choices":[
                "Uh...it looks rather hungry...",
                "Don't panic...it must be friendly!"
            ],
            "content":"<div class=\"\"><div> <span><i>Whoa!!!</i> You stare in awe as the figure bursts out of the water and hovers up in the air, letting out a high-pitched shrill. It seems to resemble a jet plane in shape while it has fox-like ears on the top of its head along with deep-piercing ruby-red eyes.<br>\r\n<br>\r\nYou recognize it now: it's a legendary Eon Pokemon! Its firm-blue color with a red triangle mark on its chest convinces you that it must be the male of the Eon gender; a Latios.<br>\r\n<br>\r\nThe Pokemon looks so stunning...but you are about ten seconds of marveling over this amazing creature before it suddenly starts to swoop closer to you! It's seen you as well, and as it approaches you notice something about the look on its face.<br>\r\n<br>\r\n<i>Uh-oh...</i></span></div></div>",
            "created":1341118800,
            "id":1369996,
            "title":"Yes...it's a Latios!"
        },
        "112212111":{
            "author_id":"koopa",
            "author_name":"CanidSerpent",
            "content":"<div class=\"\"><div> <span>Only after you have been drawn out of your reverie regarding the Eon Pokemon before you do you hear the faint grumble of its empty stomach urging it to consume something. And from the way the Eon Pokemon's eyes are directed towards you, wide an alight with a disturbing sort of excitement, it must have found you to be a suitable course.<br>\r\n<br>\r\nA blot of pink sweeps over its lips as it surveys you, wondering if your flesh will be delectable or not.<br>\r\n<br>\r\nYou remain paralyzed under the legendary's gaze, too absorbed by its magnificence to obey your survival instinct to run.<br>\r\n<br>\r\nAfter a brief moment, the Eon Pokemon makes its decision, clutching your body with its forearms and thrusting your head into its mouth, sweeping its tongue over your face as it begins to consume you. You remain still throughout the process, the Pokemon's forearms holding you tight despite their feeble appearance, allowing the Eon Pokemon to devour you at its leisure. <br>\r\n<br>\r\nAnd it takes its time, making sure it has indulged in your flavor before it pushes more of your body in. It leaves no place untouched by its greedy and gluttonous tongue. The organ sweeps over your skin in a delighted manner, pleasurable sounds echoing from the beast's throat at your unique taste as it pushed you down into its gullet. The contractions of smooth and wet muscle coaxing you along its esophagus.<br>\r\n<br>\r\nAfter what seems to be an eternity, your body slides into the Latios' stomach in its entirety, fitting snugly against the slick and mucus-lined walls as the floor of the muscular sac began to undulate beneath you, preparing the Pokemon's newly arrived meal for digestion. As you felt the Latios finally began to relax after taking on the great task of swallowing you, you began to feel light-headed, the organ's absence of air pushing you into a state of unconsciousness as it prepared to tear apart your being in order to fuel the one that has proved to be superior. <br>\r\n<br>\r\nThe Latios, belly full and tired from the ordeal of devouring you, returned to its abode beneath the waters. </span></div></div>",
            "created":1383454800,
            "id":1688203,
            "title":"Sustenance"
        },
        "11221212":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Her stomach grumbles, Guess who's gonna be pudge?",
                "she smiles kindly, she wants to help"
            ],
            "content":"<div class=\"\"><div> <span>A blue glow surrounded you, lifting your form. You jump when you find yourself with a Latias, who cooed and tilted her head at you. Apparently she had never seen a human, and so was trying to figure you out, sniffing at your form. Finally, she realized...</span></div></div>",
            "created":1600460580,
            "id":2905508,
            "title":"The Latias"
        },
        "1122122":{
            "author_id":"koopa",
            "author_name":"CanidSerpent",
            "choices":[
                "Yes",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it a Kyogre?</span></div></span></div>",
            "created":1341118800,
            "id":1369985,
            "title":"Kyogre"
        },
        "11222":{
            "choices":[
                "Feraligatr",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which normal aquatic pokemon was it?</span></div></span></div>",
            "created":1314853200,
            "id":1179274,
            "title":"A Regular Pokemon"
        },
        "112221":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "You have to wait for nature to take it's course",
                "The Feraligatr's trainer shows up!"
            ],
            "content":"<div class=\"\"><div> <span>You see a splash out of the corner of your eye and see a Feraligatr only feet away from you! You frantically start swimming towards the shore but don't get far as the Feraligatr leaps out of the water and grabs a hold of your legs. You can see the hunger in his eyes, and no matter how much you struggled to get away from him it was futile in the end as he lowers you into his mouth feet first. Your feet and legs slide down into his throat as your waist stretches his mouth almost to it's limit. Your feet feel the bottom of his stomach as your face looks out to see his teeth closing as you slide down into his throat. It's tight and moist and pushes you down with great force, until you reach his stomach which forces you to roll up into a ball expanding it so that to anyone looking on the outside, it looks as if the Pokemon is pregnant.<br>\r\nWhat happens now?</span></div></div>",
            "created":1420002000,
            "id":1910070,
            "title":"Feraligatr"
        },
        "112222":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Female Milotic!",
                "Other aquatic Pokemons (female pokemons, preferably)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is that Pokemon a...</span></div></span></div>",
            "created":1345698000,
            "id":1411304,
            "title":"Who's that Pokemon?"
        },
        "1122222":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Female Dragonair!",
                "Other aquatic Pokemons (female pokemons, preferably)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then,was it a...?</span></div></span></div>",
            "created":1363237200,
            "id":1550402,
            "title":"Other aquatic Pokemons (female pokemons, prefer..."
        },
        "11222222":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Yes ^^",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Lapras?</span></div></span></div>",
            "created":1445230800,
            "id":2049333,
            "title":"Other aquatic Pokemons (female pokemons, prefer..."
        },
        "11223":{
            "author_id":"koopa",
            "author_name":"CanidSerpent",
            "choices":[
                "Gyarados",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What large water Pokemon has arisen from the deep?</span></div></span></div>",
            "created":1383454800,
            "id":1688206,
            "title":"A Large Aquatic Pokemon"
        },
        "112231":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Wait it out.",
                "Send out one of your own Pokemon to get out."
            ],
            "content":"<div class=\"\"><div> <span>You look underneath you to see the giant pokemon Gyarados swimming upwards at you with it's mouth open looking hungry. You scream and try to swim away but are too slow as the Gyarados catches you inside it's warm wet mouth. You try to get free but can't when the Gyarados then wraps its tongue around you and swallows, forcing you into its throat as it's powerful inner muscles force you into it's spacious stomach. It's dark, slimy, and full of acid, the stomach that now holds you captive. What are you to do now?</span></div></div>",
            "created":1420002000,
            "id":1910059,
            "title":"Gyarados"
        },
        "1122311":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Try to squeeze deeper inside",
                "Digestion."
            ],
            "content":"<div class=\"\"><div> <span>You're squished about inside Gyrados' stomach. Your clothes are soaked with his stomach acids and you start to feel them dissolve. You realize that you've got to do something soon. What, you're not sure, but if you don't your pokemon journey is sure to end far before the champion. </span></div></div>",
            "created":1430110800,
            "id":1970585,
            "title":"Wait it out."
        },
        "11223112":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "content":"<div class=\"\"><div> <span>Before you're able to put to put a plan into motion, your clothes completely digest off, leaving you naked and scared deep inside gyrados. The acids tingle against your skin and you start to feel the digestion begin. The lack of air and the very hot air inside his stomach made it easy for you to pass out as your body digests inside him, leaving no trace that you where ever here.</span></div></div>",
            "created":1430110800,
            "id":1970588,
            "title":"Digestion."
        },
        "1122312":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "\"Make the Gyarados cough us up!\"",
                "You can't think of anything."
            ],
            "content":"<div class=\"\"><div> <span>\"Alright Charizard, help me out here!\" you say as you touch the button on the Pokeball to release the fire breathing dragon.<br>\r\n\"Char!\" It roars as it pops out of it's ball, but then is confused by it's location.<br>\r\n\"Ow..\" You say as Charizard has made the Gyarados' stomach to be stretched to it's max and it's squeezed you into a tight corner.<br>\r\n\"Ok, Charizard use a fire....wait!\" You begin to say as you realize that with the small space, it would only server to roast you into a nice dinner for the Gyarados.<br>\r\n\"Fine then, i'll come up with another solution.\" You say.</span></div></div>",
            "created":1420002000,
            "id":1910084,
            "title":"Send out one of your own pokemon to get out"
        },
        "112232":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Wailord",
                "Milotic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other Pokemon are coming for you?</span></div></span></div>",
            "created":1420002000,
            "id":1910060,
            "title":"Other"
        },
        "1122321":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Try to take shelter on one of several flabs of flesh.",
                "Swim down to the small intestine."
            ],
            "content":"<div class=\"\"><div> <span>You look and see a giant Wailord swimming after you, how you managed to miss it before is a mystery.<br>\r\nYou try to swim away from the behemoth but don't get far as the Pokemon swims up to you and traps you in it's giant mouth. You flop onto its pink squishy tongue as you smell the horrid sea breath it has from eating other Pokemon who's fate may foreshadow your own. You try to stand up to get out but the Wailord then swallows you with a gigantic gulp and you fly back into his throat which is a straight free fall to his cave like stomach filled with plants and stomach acid with the horrid stench of rotting animals. You have to do something quickly to avoid drowning in the belly of a Pokemon, so what'll you do?</span></div></div>",
            "created":1420002000,
            "id":1910063,
            "title":"Wailord"
        },
        "11223212":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "The Wailord craps you out.",
                "Ohhhh, crap (Literally)."
            ],
            "content":"<div class=\"\"><div> <span>Recalling days of science class from school where you learned about human anatomy, you figure that if you could just get into the rest of the digestive track, then the acids wouldn't get to you, so you take a deep breath and dive into the lake of acids and food churning inside of the aquatic Pokemon's stomach. You got very lucky, as you find the hole to the small intestine very soon and you manage to squeeze through to safety.<br>\r\nIt looks like a hallway but the walls are pink wet flesh that shifted with the bodies natural transfer of food from the stomach to the Pokemon's butt. You decide that continuing on is the best, and the only option available and you walk along the miles of miles of corridors until you reach the anus where you'll have to wait for nature to take it's course. <br>\r\nWhat happens next? </span></div></div>",
            "created":1420002000,
            "id":1910068,
            "title":"Swim down to the small intestine."
        },
        "1122322":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Dragonair",
                "Floatzel"
            ],
            "content":"<div class=\"\"><div> <span>A female Milotic burst from the waves headed right for you. Before you could do anything, your clothing was in shreds and she had coiled around you. \"Now with those annoying coverings off,\" she said, licking her lips. You could only gasp in fear before she stuffed your head in her maw. Her tongue curled around your face, taking in your taste. She hummed in content before she gulped your head, and took in your chest.<br>\r\n<br>\r\nYou can only groan in discomfort as her tongue curved around your breasts. Milotic giggled and took in your belly. Her sharp teeth poked your tummy, but she didn't bite down. Another gulp and she took in your ass. She purred as her tongue probed your rear. With another gulp, she took in your legs. She slurped them up, leaving just your feet hanging out. She slurped them up and took one last taste. Then she swallowed.<br>\r\n<br>\r\nMilotic sighed and lay down, letting her gut do the rest. A few hours later, she slid off into the sea, ready to snarf down another unfortunate human.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nwho will eat you next?</span></div></div>",
            "created":1584377700,
            "id":2802356,
            "title":"Milotic"
        },
        "1123":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "A large plain field.",
                "Mountains.",
                "Some Other scenery perhaps?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else could she go?</span></div></span></div>",
            "created":1420002000,
            "id":1910077,
            "title":"More..."
        },
        "11231":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "It's a Pidgeot staring down at you from high in the air.",
                "It's a Arbok sneaking through the grass about to pounce."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's just a field filled with grass.<br>\r\nAdventure Ho! <br>\r\nYou start to walk out into the field when you have a feeling that something is watching you....<br>\r\n<br>\r\nWhat is it?</span></div></span></div>",
            "created":1420002000,
            "id":1910079,
            "title":"A large plain field."
        },
        "112312":{
            "author_id":"skees",
            "author_name":"ItsMe",
            "choices":[
                "Run like you got a pair... of running shoes!",
                "Before you could run, the Arbok strikes."
            ],
            "content":"<div class=\"\"><div> <span>          You turned around at the sound of slithering.<br>\r\n          You reach in your bag and grab a Poké Ball. An Ultra Ball to be specific. It won't catch the creature, but it will buy time. You remember what you mentor said, something about eggs. You actually don't know what your mentor said. You were too concentrating on complaining about how he said there was only one-hundred-and-fifty of these things. Spent all his life studying Pokémon only to be wrong about most everything he learnt. He even gave you an empty Pokédex, thanks!<br>\r\n          As your thoughts wonder, a Wild Arbok appeared and used tackle. It was super effective at knocking you down. You got to your feet and three the ball at it. It bounced off it's head and plopped on the ground. That wasn't an Ultra Ball, it was a Net Ball! Why did you even have that in there?<br>\r\n          The Arbok wasn't happy about it either. And on closer inspection, it was the biggest Arbok you've ever seen. It wasn't giant, but it was big enough to swallow... You... Whole...<br>\r\n          You start running as fast as you could. The Arbok didn't waste time. It slithered in front of you, then behind you. Soon you tripped over the purple snake and landed hard on the ground. The Arbok wrapped it's body around you quickly. You felt the coils squeeze your body, \"Wait! Wait! I know you can understand me. Wait!\"<br>\r\n          The Arbok stopped tightening it's hold on you, \"What do you want, prey?\" It hissed.<br>\r\n          Your chest was in pain, blood rushed to your brain and your heart was beating in your chest, working over time to push blood through the tight veins and arteries of your body, \"I-I...\" You began, not knowing what you're about to say and in a panic, \"I won't struggle if you don't strangle me!\"<br>\r\n          The snake titled it's head in curiousity.<br>\r\n          <i>It's working!</i> You think to yourself. \"Just loosen up and I'll even remove my gear. I taste better without it, I promise.\" You felt the Arbok release it's grasps on you slightly. You weren't planning on letting this beast eat you, this is just some tomfoolery. You take off your backpack slowly, \"It'd be faster if you let go.\"<br>\r\n          He let you go entirely now, waiting for you to remove your belt, shoes and anything else that doesn't digest well. Now is your chance!</span></div></div>",
            "created":1425272400,
            "id":1942196,
            "title":"It's a Arbok sneaking through the grass abo..."
        },
        "1123122":{
            "author_id":"skees",
            "author_name":"ItsMe",
            "content":"<div class=\"\"><div> <span>          You removed your belt.<br>\r\n          The snake strafed around you patiently. If you can jump off the nearby small cliff behind you, then you might have a chance. Below the cliff was some water that looked deep enough to jump in feet first without too many consequences. You just need to buy time enough to get the snake away from it so you can have a direct line to run.<br>\r\n          You remove your cap from your head, the Arbok is directly in front of you now! Before you could turn away and run, something happened. The Arbok opened it's mouth and dived at you. You were caught unaware, it seems the snake either forgot about the shoes or merely didn't care.<br>\r\n          Your head was smothered against its squishy mouth. The Arbok wrapped around you again, but didn't squeeze the life out of you. Instead it held you still as it began to slurp and pull you into its body. Your screams and calls for help were muffled behind a wall of flesh. Every moment your body inch in deeper and deeper into your predator. <br>\r\n          Your head was no longer in the mouth, instead it's deep in the throat. The tiny teeth made to hold prey were poking into your back and stomach. Any attempt at struggling caused the Pokémon to bite into your back until you stopped. You were shoved and squeezed through the warm, gooey tube of a creature. Its body crushed you gently. Your clothes became sticky due to the salivation of the mouth and the wet throat. The deeper you were pulled in, the less it became warm and instead became hot.<br>\r\n          By the time your rump was inside the predator, the heat became almost unbearable. You wondered what a sight you'd make; just a pair of legs sticking and kicking in the air from the mouth of a snake swallowing and engulfing them down quickly. Soon, even they were gone, leaving you to slither faster down the gullet until you reached a point where it was less constrictive. Its stomach.<br>\r\n          It was still tight, but you were able to squirm about if you tried heard enough. It felt like someone zipped you up in a small sleepy bag, except this one is all wet and trying to digest you. The stomach was sticky and reeked of old meat. You tried pressing against the walls, for all your troubles worth it only contracted and nearly squeezed the air out of you. The Arbok slithered away content with its meal, and you were able to feel the large rocks and twists and turns it made.<br>\r\n          It was like this for some time; minutes maybe even an hour. Any pleas you made were ignored. You were hoping maybe you'd lose consciousness soon. Then at one moment, when you pushed hard against the end of the stomach to help you sit up, a hole opened and your hand went through. \"No! Please let me out!\"<br>\r\n          Still nothing. This is it. Your vision all but left you as you traveled deeper in the creature, well as your consciousness, and in just a few hours, your body will also be gone.</span></div></div>",
            "created":1425272400,
            "id":1942716,
            "title":"Arbok snack!"
        },
        "11232":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "A giant Pokemon!",
                "A slightly smaller, but still large Pokemon!"
            ],
            "content":"<div class=\"\"><div> <span>Great peeks of rocks tower above you and you, never one to turn down a challenge, decide to scale these cliffs. <br>\r\nYou get about halfway up the mountain when you decide to stop and rest a moment, glistening with sweat and out of breath, how could a Pokemon resist such a tasty morsel?<br>\r\nBut the real question, which Pokemon is it?</span></div></div>",
            "created":1420002000,
            "id":1910157,
            "title":"Mountains."
        },
        "112321":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "An Onix!",
                "The legendary bird Articuno!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But which Pokemon spots you?</span></div></span></div>",
            "created":1420002000,
            "id":1910158,
            "title":"A giant Pokemon!"
        },
        "1123211":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "You two escape through the intestines.",
                "That geodude needs some food."
            ],
            "content":"<div class=\"\"><div> <span>A gigantic Onix looms over you, slightly salivating. You stand frozen with fear when it suddenly strikes, snatching you up in its rock solid mouth.<br>\r\n\"What? No!\" You yell as it tosses its head back and forces you into its throat. Despite the fact that his outside it rock hard, it has a squishy throat that squeezes you down into its stomach. It smells of rock and gravel as you try to adjust your eyes to the dark. Suddenly from out of the other part of the stomach, you hear a noise.<br>\r\n\"Geo!\" It cries as it wanders close to you. It's a small Geodude, left to the same fate as you.<br>\r\n<br>\r\nWhat will happen next?</span></div></div>",
            "created":1420002000,
            "id":1910201,
            "title":"An Onix!"
        },
        "112322":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "It's a Golem.",
                "The fossil Pokemon, Rampardos."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of these Pokemon spot you as a potential meal?</span></div></span></div>",
            "created":1420002000,
            "id":1910159,
            "title":"A slightly smaller, but still large Pokemon!"
        },
        "1123221":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Eat you whole.",
                "A larger predator comes and grabs you."
            ],
            "content":"<div class=\"\"><div> <span>A Golem rolls up to you looking for a fight so you send out your only Pokemon you have on you, Charizard.<br>\r\n\"Golem!\" It yells as it picks up a rock and heaves it at Charizard who swiftly faints.<br>\r\nYou tried to run back to the Pokemon Center but the Pokemon grabs your leg, yanking you towards it.<br>\r\n\"What could it possibly want?\" You think to yourself when it suddenly starts licking your leg causing you to shriek in surprise.<br>\r\n<br>\r\nWhat will it do next?</span></div></div>",
            "created":1420002000,
            "id":1910176,
            "title":"It's a Golem"
        },
        "11232211":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "content":"<div class=\"\"><div> <span>The Golem puts your legs together into its mouth and starts to swallow. You start to panic as you try to crawl away but the Pokemon is stronger than you and gulps you up to your breasts. <br>\r\n\"Let me go!\" You yell at it, to no avail. Your head soon follows into the Pokemon's stomach, which is so tight you have to curl into a small ball to fit. You struggle as you try to find a way to get out, but you're stuck here. It smells of rocks and dirt as you slowly start to drift off as the minutes become hours and you fail to make any progress in leaving. </span></div></div>",
            "created":1420002000,
            "id":1910186,
            "title":"Eat you whole."
        },
        "11232212":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "It's a Mega Pidgeot!",
                "It's the legendary bird Ho-Oh!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just as the big rock is about to eat you, sharp claws grab you and suspend you in the air. You can't see what Pokemon your \"savior\" is.<br>\r\n<br>\r\nWhich bird Pokemon just caught you as a treat?</span></div></span></div>",
            "created":1420002000,
            "id":1910192,
            "title":"A larger predator comes and grabs you."
        },
        "112322121":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Nom!",
                "Feed her to the kids."
            ],
            "content":"<div class=\"\"><div> <span>As it lands in it's nest still holding you in it's clutches, you get a good look at the Mega Pidgeot that brought you here.<br>\r\n\"Why did you save me?\" You ask it, making it turn its head at you. It then opened it's beak wide open and let out a shriek.<br>\r\n\"Oh of course, you're hungry too...\" You say thinking quickly.<br>\r\n\"Umm, it's not much, but I've got some poffins in my pocket.\" You say to it, holding out the treat in your hand.<br>\r\n<br>\r\nHow will it react?</span></div></div>",
            "created":1420002000,
            "id":1910195,
            "title":"It's a Mega Pidgeot!"
        },
        "1123221211":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Try to make it out through the intestines.",
                "Try to get coughed out."
            ],
            "content":"<div class=\"\"><div> <span>The Mega Pidgeot opens it's beak wide open and with one fell movement, swallows both you and the poffins.<br>\r\n\"No! That's not what I meant!\" You yell from insides its crop feeling it churn as the bird takes flight again. You wonder if it would have been better if you'd just stayed with that stupid Golem. Suddenly you get sucked into a small hole beneath you and are squeezed into its gizzard.<br>\r\n\"Ew...\" You say to yourself as the gizzard is filled with little remains of Rattata's that the bird had eaten. You decide it's probably best if you try to get out so...<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1420002000,
            "id":1910199,
            "title":"Nom!"
        },
        "11233":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "cave?",
                "naw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>perhaps a...</span></div></span></div>",
            "created":1584248400,
            "id":2801807,
            "title":"Some Other scenery perhaps?"
        },
        "12":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Normal Sized",
                "Macro - Giant Sized",
                "Micro - Tiny Sized"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay you're a regular pokemon. What's your size?</span></div></span></div>",
            "created":1239426000,
            "id":674454,
            "title":"Pokemon"
        },
        "121":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Regular",
                "Legendary"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you regular or legendary?</span></div></span></div>",
            "created":1239426000,
            "id":674457,
            "title":"Normal Sized"
        },
        "1211":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Pikachu",
                "Eevee",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Pokemon are you? A Pikachu, an Eevee, or maybe one of the starter Pokemon?</span></div></span></div>",
            "created":1239426000,
            "id":674459,
            "title":"Regular"
        },
        "12112":{
            "choices":[
                "Male.",
                "Female."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a male or female Eevee?</span></div></span></div>",
            "created":1288933200,
            "id":987179,
            "title":"Are you a girl or a boy?"
        },
        "121122":{
            "choices":[
                "Forest.",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nice! And where do you live?</span></div></span></div>",
            "created":1288933200,
            "id":987181,
            "title":"Where do you live?"
        },
        "1211221":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "Prey",
                "Predator"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you prey or predator?</span></div></span></div>",
            "created":1427950800,
            "id":1957627,
            "title":"Forest."
        },
        "12112212":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "Pichu",
                "Pachirisu"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wandered your forest home, when you suddenly trip over another Pokemon. Looking back you find a small, weak-looking...</span></div></span></div>",
            "created":1427950800,
            "id":1957640,
            "title":"Predator"
        },
        "121122122":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "this is an easy looking meal...",
                "hm...maybe I can help..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>That Pachirisu certainly looks pretty beat-up. You walk over and sniff it...</span></div></span></div>",
            "created":1427950800,
            "id":1957641,
            "title":"pachirisu"
        },
        "1211221221":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "the pachirisu wakes up and panics",
                "the squirrel is too groggy to realize whats happening"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Despite the pachirisu being almost as big as you didn't seem to make it any less easy. You lick your lips eagerly and pull the squirrel's tail into your mouth, taking small gulps to get the fluffy appendage down your throat. </span></div></span></div>",
            "created":1439442000,
            "id":2020407,
            "title":"this is an easy looking meal..."
        },
        "12112212211":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "be a little mean and let the pachirisu slide down slowly",
                "you're too hungry and quickly gulp it the rest of the way down"
            ],
            "content":"<div class=\"\"><div> <span>The squirrel fidgeted as it began to wake up, a confused squeak escaping it as to why their lower body felt warm and wet. It looked over its shoulder and immediately started struggling when it saw its lower body disappearing down your throat. You merely chuckled as you took another long swallow, purring at the feeling of its small paws squirming in your throat. Your belly was already pushing out slightly as the pachirisu's tail curled inside it. </span></div></div>",
            "created":1439442000,
            "id":2020409,
            "title":"the pachirisu wakes up and panics"
        },
        "121122122111":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "choices":[
                "Lay back and let your belly enjoy",
                "you're still hungry"
            ],
            "content":"<div class=\"\"><div> <span>Confident that the pachirisu wasn't going to squirm away, you decide to make this last just a bit longer. You tilt your head back to let gravity do your work for you, allowing the squirrel slide down slower into your waiting belly. Your tongue was granted opportunity to taste your catch, a low purr of appreciation vibrated from you at the delightful flavor. The pachirisu continued its desperate struggle, even as you were able to start closing your jaws around its head.<br>\r\n<br>\r\nAs your mouth closes and traps your prey, you purr again and take a swallow to send the pachirisu into your warm belly. You let out a loud burp as your belly continues to squirm in protest.  </span></div></div>",
            "created":1439442000,
            "id":2020410,
            "title":"be a little mean and let the pachirisu slide do..."
        },
        "1211221221111":{
            "author_id":"kitsuneflame",
            "author_name":"Kyuubi",
            "content":"<div class=\"\"><div> <span>Despite your belly bulging out as much as it was, you manage to walk over to a tree to lay back against it. You rub the squirming bulge and purred, another burp escaping you and snickering at the struggling getting worse. The pachirisu was panicking excessively, as your belly groaned loudly and gurgled, the walls closing in around it. You squirmed a bit too as you felt the pachirisu's struggles rub between your hindlegs, a quiet yip escaping you as the rubbing brought you release.<br>\r\n<br>\r\nEverything relaxed as your orgasm passed, a loud gurgle signalling your stomach starting to work. Sensing the impending peril, the squirrel started thrashing again, the acids flooding in and coating it as they begin to burn. All you did was purr as your prey grew weaker, your stomach slowly shrinking as it squeezed in tighter to break the poor pachirisu down more. You started dozing off as the last of the struggles pass, your belly letting out another satisfied groan.</span></div></div>",
            "created":1439442000,
            "id":2020413,
            "title":"Lay back and let your belly enjoy"
        },
        "1211221221112":{
            "choices":[
                "Growlithe",
                "Vulpix"
            ],
            "content":"<div class=\"\"><div> <span> Even with your bulging, squirming belly, the weak Pachirisu could never satisfy your hunger. No, what you needed was something bigger, less weak. You trod along the forest floor, feeling your belly gurgle and groan. You lick your lips, remembering the small Pokèmon's taste. <br>\r\n  Scenting the forest floor, you start to smell something, your stomachs growling in reply. It is a...</span></div></div>",
            "created":1458450000,
            "id":2120015,
            "title":"you're still hungry"
        },
        "12113":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be a starter pokemon?</span></div></span></div>",
            "created":1276750800,
            "id":901088,
            "title":"Other"
        },
        "121131":{
            "author_id":"dragonmaker234",
            "author_name":"Hello man",
            "choices":[
                "Kanto",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Witch region starters?</span></div></span></div>",
            "created":1493701200,
            "id":2314002,
            "title":"Yes"
        },
        "1211311":{
            "author_id":"dragonmaker234",
            "author_name":"Hello man",
            "choices":[
                "Don't need to ask me twice!",
                "Too hot!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What you think about the fire lizard pokemon?</span></div></span></div>",
            "created":1493701200,
            "id":2314007,
            "title":"Charmander"
        },
        "1211312":{
            "author_id":"dragonmaker234",
            "author_name":"Hello man",
            "choices":[
                "Sure",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kalos maybe?</span></div></span></div>",
            "created":1493701200,
            "id":2314005,
            "title":"More"
        },
        "121132":{
            "author_id":"dragonopower",
            "author_name":"DragonRider",
            "choices":[
                "Yes",
                "Naaaaa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A lucario perhaps?</span></div></span></div>",
            "created":1276837200,
            "id":901456,
            "title":"No"
        },
        "1211322":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Yes, take the hungry pokemon",
                "Anything else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay then maybe a Snorlax?</span></div></span></div>",
            "created":1281416400,
            "id":933612,
            "title":"Naaaaa"
        },
        "12113221":{
            "choices":[
                "Male.",
                "Female."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a male or female?</span></div></span></div>",
            "created":1297227600,
            "id":1051052,
            "title":"Snorlax."
        },
        "121132211":{
            "choices":[
                "Go swallow a pokemon.",
                "Nah, just.. dream about it again."
            ],
            "content":"<div class=\"\"><div> <span>You awake with a start with the sun shining in your face. Yawning and rubbing your eyes, you slowly rise to your feet, thinking about the nice dream that you just had. You were swallowing a pikachu whole, and even though it seemed like a weird idea at first, you really enjoyed it. It tasted so good, and the way it kicked and struggled as it went down felt so wonderful. You groggily look around yourself and notice that you're in a clearing of a forest. You're not sure which one.. you don't know where you fall asleep these days. <br>\r\n<br>\r\nYour stomach grumbles, sending you out of your trance. You're hungry, and what should you eat? Berries? You could steal some pokemon food.. But then you have a new idea.<br>\r\n<br>\r\nThat dream <i>was</i> pretty nice, and you have a feeling that you want to experience that again, and in real life. To feel a helpless pokemon struggling around in your stomach... sloshing around and digesting... that would be wonderful. But still, it was just a dream, it may be different in the real world, maybe even uncomfortable. You you really want to feel pleasure like that again though, what should you do?</span></div></div>",
            "created":1297227600,
            "id":1051063,
            "title":"Male."
        },
        "1211322111":{
            "author_id":"papasnorlax",
            "author_name":"snorlaxlover",
            "choices":[
                "A trainer",
                "A L"
            ],
            "content":"<div class=\"\"><div> <span>You get up with some effort. Noticing a buneary walking past, you quickly scoop it up in your paw. It looks up at you in surprise.<br>\r\n <br>\r\n   \"h-hey, what are you doing\" <br>\r\n<br>\r\nQuickly you stuff it into your maw before it even realizes what is happening, then swallow. It feels amazing sliding down your throat and into your cavernous stomach.<br>\r\n<br>\r\n    <br>\r\n\"you`re my breakfast\" you announce patting your gut, enjoying the smaller pokemon`s struggling within. That`s  when you notice...</span></div></div>",
            "created":1560574800,
            "id":2673819,
            "title":"Go swallow a pokemon."
        },
        "12113222":{
            "choices":[
                "Yes!",
                "Noooo...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a Lickitung?</span></div></span></div>",
            "created":1288933200,
            "id":987177,
            "title":"Lickitung?"
        },
        "121132222":{
            "author_id":"wolvessoul",
            "author_name":"Wraiten",
            "choices":[
                "Alright.",
                "Nope, next."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Slaking maybe? Come on, admit it. He's strong AND lazy! That's cool no?</span></div></span></div>",
            "created":1290834000,
            "id":1002403,
            "title":"Noooo...."
        },
        "1211322221":{
            "author_id":"wolvessoul",
            "author_name":"Wraiten",
            "choices":[
                "Go to the Stunkys and eat them.",
                "Leave the Stunkys and search for another meal."
            ],
            "content":"<div class=\"\"><div> <span>You're again, taking an lazy nap in the soft grass. You wake up from an awful stench. You wake up to see what it was. You saw a bunch of Stunky's playing around there. As you feel that you're really hungry. You would love to have a good meal, but they really stench awful! You decide to...</span></div></div>",
            "created":1290834000,
            "id":1002405,
            "title":"Alright."
        },
        "12113222211":{
            "author_id":"wolvessoul",
            "author_name":"Wraiten",
            "choices":[
                "You wake up and search for more Pokemon to eat.",
                "Another Pred finds you."
            ],
            "content":"<div class=\"\"><div> <span>You don't like the stench. But it's like you're going to starve from hunger now. You decide to run up to them and jump, you then used a body slam to catch the 3 Stunkys under your fat belly. You reach under your belly to eat the first Stunky. The Stunky struggled to get free but you already dropped it in your jaw and closed it. Actually.. Now you're tasting the Stunky.. It's really delicious! You play around somewhat with the Stunky in your mouth and then decided to swallow it down. You then picked up the other 2 Stunkys out of your fat belly and stood up. They could see the bulge coming from your throat and then to your belly. Your belly grow even bigger that it was before. You put the other 2 Stunkys in your jaw and closed it again. But this time they used Poison Gas. But it didn't really affect you, you only liked it even more. You then again played with the Stunkys in your mouth. You then again decide to swallow 'em whole down, straight into your now even fatter belly! You then felt drowsy again after these actions and went on a nap again while the Stunkys in your belly are digesting.</span></div></div>",
            "created":1290834000,
            "id":1002408,
            "title":"Go to the Stunkys and eat them."
        },
        "1211322222":{
            "choices":[
                "Yes.",
                "Nope."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a Shinx?</span></div></span></div>",
            "created":1300942800,
            "id":1075650,
            "title":"Shinx."
        },
        "12113222222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pichu, perhaps?</span></div></span></div>",
            "created":1329541200,
            "id":1279787,
            "title":"Nope."
        },
        "121132222222":{
            "author_id":"thomsc",
            "author_name":"Thoms",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a Zangoose ?</span></div></span></div>",
            "created":1425358800,
            "id":1942959,
            "title":"Zangoose"
        },
        "1211322222221":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "Male",
                "Female "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wonderful choice! <br>\r\nNow the next question, are you a male or female Zangoose?</span></div></span></div>",
            "created":1430110800,
            "id":1970501,
            "title":"Yes"
        },
        "12113222222211":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "Predator",
                "Prey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now, the important question in any vore story: predator or prey? </span></div></span></div>",
            "created":1430110800,
            "id":1970546,
            "title":"Male"
        },
        "121132222222112":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "Start Story"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you'd like to end up in the paws of a bigger Pokemon? Excellent choice. I think we're ready to start this! </span></div></span></div>",
            "created":1430110800,
            "id":1970562,
            "title":"Prey"
        },
        "1211322222221121":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "Left",
                "Right"
            ],
            "content":"<div class=\"\"><div> <span>You are Razor, you are a Zangoose that has the desire to explore and adventure. You love the wonders of the unknown You are usually happy and friendly, and you don't even mind Sevipers that much. One day while you were exploring a new part of the forest, the trail you're on splits off in two directions. Which way do you go?</span></div></div>",
            "created":1430110800,
            "id":1970594,
            "title":"Start Story"
        },
        "12113222222211212":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "A Apple Tree",
                "A Berry Bush "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to go right, because right is always the right way, right? After a few minutes of walking down the dirt path, you can hear your stomach growl, so you decide to stop for a snack. Where do you go for your bite to eat? </span></div></span></div>",
            "created":1430110800,
            "id":1970612,
            "title":"Right"
        },
        "121132222222112122":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "Top of the bush",
                "Bottom of the bush"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to head to the berry bush that's only a few meters off the path. As you arrive to the bush, you see that it's an Oran berry bush. Your paw reaches out as you grab a berry on the...</span></div></span></div>",
            "created":1430197200,
            "id":1970892,
            "title":"A Berry Bush "
        },
        "1211322222221121222":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "Shrug it off and continue on your way",
                "Try to find out what it is"
            ],
            "content":"<div class=\"\"><div> <span>You kneel down and extend your paw out to grab a berry near the bottom of the bush. As you pluck the berry and retract your arm back to snack on your fresh fruit, you notice a small sparkle from under the bush. You thought of what could be hidden under the vegetation. What do you do? </span></div></div>",
            "created":1430197200,
            "id":1970995,
            "title":"Bottom of the bush"
        },
        "12113222222211212222":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "Try the necklace on",
                "Examine the necklace some more"
            ],
            "content":"<div class=\"\"><div> <span>You were pretty bored so almost anything would be exciting right now. Your curiosity shot up quickly as you sat down and grabbed the sparkly object that was hidden under the bush. As you pull your arm back you see that you had a necklace in your grasp. You pull the necklace to your eye level to examine it better. The necklace had a gold plated chain, and dangling from the chain was some sort of gem, but you didn't know what gem it was exactly. \"Wow! This is amazing!\" You said excitedly, as your eyes lit up with amazement while you gazed at the treasure you found. What do you next?</span></div></div>",
            "created":1430370000,
            "id":1971755,
            "title":"Try to find out what it is"
        },
        "121132222222112122222":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "Zangoose, just like you!",
                "Another Pokemon"
            ],
            "content":"<div class=\"\"><div> <span>Your curiosity was still at its peak as you continued to look at the necklace from countless directions and angles, taking every second in to admire its magnificent beauty, and fine craft work. Unfortunately, you had no bag to keep it safe. You didn't want to lose it, so you just kept a tight grip on the jewelry. As you turned around to walk back onto the dirt path to continue on your way, you came face to face with a...</span></div></div>",
            "created":1433998800,
            "id":1991217,
            "title":"The Examination Continues"
        },
        "1211322222221121222221":{
            "author_id":"theholycake",
            "author_name":"Cake",
            "choices":[
                "Decide to give the necklace back to her",
                "Keep the necklace for yourself"
            ],
            "content":"<div class=\"\"><div> <span>The Pokemon that you saw in your line of sight was another Zangoose, almost exactly like you in every way. Expect for the fact that the Zangoose you saw was both female and a shiny Zangoose. The female was looking like she was frantically looking for something, you could see her look in countless places: in trees,on the dirt path, around bushes. You wondered why she was doing that, so you decided to go up to the Zangoose. You hid the necklace as you stepped up behind the shiny Zangoose. <br>\r\n\"Uhm...Excuse me, but what are you doing?\" <br>\r\nYou ask the female as she was looking around an old tree stump. You weren't exactly the best conversation starter. The female Zangoose turned around and looked at you. <br>\r\n\"Oh! Sorry, I didn't see you there. I'm looking for this necklace that I lost. It's my prized treasure and I'm sure that I've left it around here somewhere. Please would you mind if you could lend me a paw for a few minutes to help me search for it?\" <br>\r\nShe asked you, looking quite worried. You could see her face of distress, so you make your decision easily.<br>\r\n\"Of course I'll help you. Now first, what does your necklace look like?\" <br>\r\nYou asked the female Zangoose. <br>\r\n\"It's a simple design. Has a gold chain and it has a light blue gem on it as well.\" <br>\r\nYou gulped silently. The Zangoose in front of you had just described the necklace that was in your possession, and hidden away. The necklace you were holding was most likely this Zangoose's treasure she had talked about. Given the current situation you...<br>\r\n</span></div></div>",
            "created":1434085200,
            "id":1991435,
            "title":"Looking into a mirror"
        },
        "1212":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Lugia",
                "Ho-Oh",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What legendary Pokemon are you? Perhaps a Lugia or Ho-Oh</span></div></span></div>",
            "created":1239426000,
            "id":674460,
            "title":"Legendary Pokemon"
        },
        "122":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Charizard",
                "Dragonite",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You prefer to be giant. Looks you're gonna have a whole lot of victims in your tummy. Anyway, what giant Pokemon are you?</span></div></span></div>",
            "created":1239426000,
            "id":674469,
            "title":"Macro Pokemon"
        },
        "1221":{
            "author_id":"sodamehpop",
            "author_name":"Soda",
            "choices":[
                "Guy",
                "Chick"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now that you've chosen your type are you a guy or a chick?</span></div></span></div>",
            "created":1264309200,
            "id":824888,
            "title":"Charizard"
        },
        "12211":{
            "choices":[
                "A trainer",
                "A pokemon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are a male, macro Charizard looking for something to eat. After walking for a while, you pick up a strange scent. You follow the scent until you come across...</span></div></span></div>",
            "created":1284267600,
            "id":955819,
            "title":"Guy"
        },
        "122111":{
            "choices":[
                "You find another trainer!",
                "You find a Pokémon!"
            ],
            "content":"<div class=\"\"><div> <span>You saw a tiny human standing there, looking up at you in amazement! You pick him up and lick him. This felt and tasted great! You swallow him. He is squirming around in your throat. This tickles. You kept swallowing hard. You felt the trainer land inside of your huge belly. You walked away searching for your next victim.</span></div></div>",
            "created":1456549200,
            "id":2110420,
            "title":"A trainer"
        },
        "122112":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Eat the Spiky eared pichu",
                "Continue hunting but take the Spiky eared Pichu with you"
            ],
            "content":"<div class=\"\"><div> <span>You stalk through the area, hunting for prey to fill your massive belly. At your size it takes vast quantities of food to fill you. As you hunt, your nostrils flare, the scent of a wounded Pokémon fills your nose. You begin your approach and do your best to remain silent. <br>\r\n<br>\r\nAs you come around a bend in the Forest game trail, you see a fairly large Seviper perparing to eat a smaller Pokémon. You smirk, the Seviper is no challenge to you, it’s small compared to your monolithic size. You rush forward and lash out with a flamethrower before snapping your jaws down on the snake. Before the Seviper can recover, it’s already a bluge in your belly. With one final gulp, the last of the snake Pokémon disappears into your massive form. You lick your lips before looking down and seeing a wounded spiky eared Pichu. She trembled under your gaze and cowered beneath you. <br>\r\n<br>\r\nYou scoop up the Spiky eared Pichu and bring her up to your face for a better look. She continues to tremble in fear and is too frightened to speak. She smells delicious but would hardly pass for a snack. Still food’s food, or is it?</span></div></div>",
            "created":1557378000,
            "id":2657702,
            "title":"A pokemon"
        },
        "1221122":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Keep Pichu inside and continue with your day",
                "Let Pichu out "
            ],
            "content":"<div class=\"\"><div> <span>“Little one,” you begin as you hold the Spiky eared Pichu. “I’m going to continue gathering food, but I’m bringing you with me.” You state as you lick the electric type. Gently, you put her in your mouth and slide your tongue over her, holding the small form in place.<br>\r\n<br>\r\nSometime later and after consuming amass amount of food, you return to your cave. As you sit back, you slide the small electric type onto your claw and look her over. She seems to have relaxed a bit and look up with curious eyes. You place her on your belly and smile down at her. “What’s a small little thing doing all by yourself?” You ask.<br>\r\n<br>\r\n“My family abandoned me cuz this.” She replies indicating her spiky ear. “They said it was a defect and I should be ashamed for looking this way.” <br>\r\n<br>\r\nYou wince slightly. “Sorry to hear that. So you’ve been surviving in a world with hungry predators alone? That’s impressive.” You add as you two stare at one another. <br>\r\n<br>\r\n“Mister Charizard...” Pichu begins. You arch an eyebrow. “I don’t mean to sound rude or anything, but it’s cold.” She says while shivering.<br>\r\n<br>\r\nYou mentally facepalm. It was getting cold as night came. You pick up the Pichu and bring her up to your snout. “Here, it’ll be much warmer inside of me.” You say as you put Pichu in your massive jaws. Once she’s tucked in and clear of your teeth, you close your mouth sealing her in darkness. <br>\r\n<br>\r\n“Thank you Mister Charizard.” She says before snuggling into your tongue. <br>\r\n<br>\r\nYou can feel your stomach has emptied and decide to get some rest. “Little one, would you like to sleep in my belly?” You ask, expecting to be Thundershocked instantly.<br>\r\n<br>\r\n“You won’t digest me?” Pichu asks as she snuggles your tongue.<br>\r\n<br>\r\n“Promise I won’t.” You reply softly. You feel the small electric type crawl along your tongue until she reaches your throat. “Ready? You ask.<br>\r\n<br>\r\n“Ready.” She replies.<br>\r\n<br>\r\nYou tilt your head back and witha single swallow send the small electric type into your massive stomach. You feel her land with a very soft plop before you yawn. She snuggles against the flesh of your belly. After a moment, you hear the faint snoring of the electric type tucked away inside of you. You yawn again before closing your eyes and falling asleep.<br>\r\n<br>\r\nThe next morning...</span></div></div>",
            "created":1557378000,
            "id":2657710,
            "title":"Continue hunting but take the Spiky eared Pichu..."
        },
        "12211221":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Pichu moans, just waking up",
                "Silence, accidentally digestion "
            ],
            "content":"<div class=\"\"><div> <span>You woke up to the slits of sunlight entering your cave. As you stand and stretch, you feel the small Pichu still sleeping in your stomach. You gently rub your belly as you yawn loudly. Your belly gives a soft moan, and you know it won't be long before you hunger gets the better of you. Still, its too dangerous to leave Pichu unprotected so you leave her in your stomach as you go about your day.<br>\r\n<br>\r\nIt wasn't long before you had successfully ambushed a few pokemon to devour. Keeping them pinned under your tail, you jostle your belly slightly. This more to check if Pichu had woken up yet.</span></div></div>",
            "created":1596769200,
            "id":2881653,
            "title":"Keep Pichu inside and continue with your day"
        },
        "12212":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Continue about your way",
                "Find who needs help"
            ],
            "content":"<div class=\"\"><div> <span>You are a none shiny macro female Charizard. Standing about 91'10\" in height, you were easily the size of what you had heard people call Gigantamax. But you looked like a normal Charizard in every way other than your size. <br>\r\n<br>\r\nYou were out for a morning flight enjoying the cool breeze on your scales when you heard someone crying out for help. Glancing down as you flew around you were uncertain if you should or shouldn't help.</span></div></div>",
            "created":1598282640,
            "id":2890658,
            "title":"Female Charizard"
        },
        "122122":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Step in and help",
                "Not your problem"
            ],
            "content":"<div class=\"\"><div> <span>You approach the source of the cries for help. As you get closer, you soon see that the source was a male human. He looked exhausted and was injuried. You soon see why. <br>\r\n<br>\r\nChasing after him was Gigantamax Toxtricity. You weren't keen on fighting the Electric type but if you didn't the human would certainly perish. </span></div></div>",
            "created":1598441580,
            "id":2891734,
            "title":"A friend in need?"
        },
        "1221221":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Continue (Charizard POV)",
                "Continue (human POV)"
            ],
            "content":"<div class=\"\"><div> <span>Without even thinking, you rush forward. Flames shot from your mouth as you stood over the human. <br>\r\n<br>\r\nThe Gmax Toxtricity snarled before unleashing its signature move. Gmax Stun Shock. <br>\r\n<br>\r\nYou felt the electricity sting and course through you but you weren't willing to back down. Despite the pain, you managed to unleash another Flamethrower, this one doing move damage than the previous one. The flames sent the opposing Pokemon, giving you an opening to retreat. <br>\r\n<br>\r\nYou reach down, grabbing the human in your claw before shooting into the sky. He struggles in fear for a bit, making it difficult to focus. Without another thought, you toss him into your jaws and swallow. You had no intention of digesting him. No. You just needed him somewhere out of sight and out of mind as they say. <br>\r\n<br>\r\nDue to the sheer size difference, you barely feel his small form as he lands in your stomach. After awhile of flying, you finally land at your cave. The fight earlier had taken a toll on you and you needed to rest. With a fatigued yawn, you decide to lay down and rest. As your eyes begin to drift close, you feel the occasional struggles of the human in your belly. \"I'll let him out after some rest.\" You think to yourself before nodding off.</span></div></div>",
            "created":1598442240,
            "id":2891746,
            "title":"Step in and help"
        },
        "12212212":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Wake up (still inside Charizard)",
                "Wake up (on Charizard's belly)"
            ],
            "content":"<div class=\"\"><div> <span>You cursed your luck. It was only the first day of your Pokemon journey. And in only a few hours, you regretted leaving Turfield. You had gotten your starter, had your first badge and made the mistake of exploring the Wild Area. Your starter had been eaten by that Gigantamax Toxtricity that you had unfortunately stumbled upon.<br>\r\n<br>\r\nAnd now, you were in the depths of a Charizard's furnace of a stomach. It was incredibly hot, humid and sticky. There was not point in fighting, you were done for. All that was left was to wait until you were slowly and likely painfully digested. <br>\r\n<br>\r\nIt seemed like hours had passed and you were still unscathed from the Charizard's innards. You could hear the powerful heartbeat somewhere above and the steady breathing. By this point, you assumed the massive Fire type was sleeping. <br>\r\n<br>\r\n\"Guess there's no harm in trying to rest.\" You said to yourself as you laid back. It did not take long for you to become comfortable in the soft folds of the stomach and before long you were slumbering.</span></div></div>",
            "created":1598442780,
            "id":2891750,
            "title":"Continue (human POV)"
        },
        "1223":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Yes Lucario",
                "Anything else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps a Lucario?</span></div></span></div>",
            "created":1239426000,
            "id":674465,
            "title":"Other"
        },
        "12232":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Go for the sleeping Pokemon",
                "What else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a Snorlax?</span></div></span></div>",
            "created":1271394000,
            "id":868857,
            "title":"A Snorlax, maybe?"
        },
        "122322":{
            "choices":[
                "Yes, let's do the big bug thang...",
                "Move on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a big, 400 pound Scolipede? The big bug is usually always hungry!</span></div></span></div>",
            "created":1309842000,
            "id":1140685,
            "title":"Scolipede?"
        },
        "1223221":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay now, what's your gender gonna be?<br>\r\n<br>\r\nAre you a masculine male? (That big belly is quite astounding!)<br>\r\nOr are you a seductive female? (Holy Arceus, check out that tailhole!)</span></div></span></div>",
            "created":1309842000,
            "id":1140686,
            "title":"Pick yer gender"
        },
        "1223222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Pichu?</span></div></span></div>",
            "created":1375333200,
            "id":1638532,
            "title":"Move on"
        },
        "12232222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You like Pikachu?</span></div></span></div>",
            "created":1375333200,
            "id":1638533,
            "title":"Other"
        },
        "122322222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Raichu?</span></div></span></div>",
            "created":1375333200,
            "id":1638536,
            "title":"Other"
        },
        "1223222222":{
            "author_id":"touhouforevah",
            "author_name":"NPKMNN",
            "choices":[
                "Yes!!!",
                "Another.."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Machamp???</span></div></span></div>",
            "created":1429246800,
            "id":1965645,
            "title":"Machamp???"
        },
        "12232222222":{
            "choices":[
                "Sure",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps the classic Eevee, or one of its evolutions?</span></div></span></div>",
            "created":1437973200,
            "id":2013266,
            "title":"Another.."
        },
        "122322222221":{
            "choices":[
                "Just go with Eevee",
                "Choose one of its evolutions"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now to be more specific-- would you like to be an Eevee in particular, or one of its many evolutions?</span></div></span></div>",
            "created":1437973200,
            "id":2013369,
            "title":"Eevee?"
        },
        "1223222222212":{
            "choices":[
                "Be an Espeon",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are very many Eeveelutions to choose from. Let's start with an Espeon, the Sun Pokémon. What do you think?</span></div></span></div>",
            "created":1437973200,
            "id":2013371,
            "title":"Yet more choices"
        },
        "12232222222121":{
            "choices":[
                "Eat a wild Pokemon",
                "Eat another trainer's Pokemon"
            ],
            "content":"<div class=\"\"><div> <span><b>“Alright! We keep moving at this rate, and we’re going to be in Eterna City by tonight!”</b><br>\r\n<br>\r\nYou walk leisurely down the long path through the forest, your trainer, Kyle, riding along on your back. You were a macro Espeon-- meaning you had a very rare condition that made you five times your normal size. You stood at over 15 feet, towering over humans and many other Pokémon. Despite your huge stature and relentless carnivorous appetite, you were very friendly and gentle with humans. Admittedly, you have accidentally stepped on or sat on them a few times, but never doing any serious damage. In fact, you have never eaten a single human in your life, preferring to devour other Pokémon.<br>\r\n<br>\r\nYour belly grumbles. It has been hours since you’d last eaten. Your stomach is huge, and digests your prey quickly, so your appetite is relentless. You stop in your tracks, giving your trainer a distressed look. You don’t have the vocal chords to talk to him, but you do have the power to communicate telepathically.<br>\r\n<br>\r\n<i>\"I’m starving. Can we stop for a moment so I can hunt?\"</i> you ask telepathically.<br>\r\n<br>\r\n<b>“Seriously? You just had lunch a few hours ago! Can’t you wait?”</b> he replied, exasperated.<br>\r\n<br>\r\n<i>\"Well, I guess it can wait… but I am getting really really hungry, and you’re starting to look pretty tasty right about now...\"</i> you smirk.<br>\r\n<br>\r\n<b>“Alright, alright! If you’re going to play dirty like that, I guess we can stop for a bite to eat,”</b> he relents, throwing up his hands. You giggle, padding gingerly into the bushes. Kyle pretends to be intimidated, but he knows you would never eat him. You were just messing with him.<br>\r\n<br>\r\nYou walk deeper into the forest, before finding a small clearing. You lay for a moment down so that Kyle could jump off your back. While your trainer sat on a tree stump to have his dinner, you run off into the woods, searching for a delicious little snack to eat.<br>\r\n<br>\r\nHow are you going to fill your empty stomach?</span></div></div>",
            "created":1437973200,
            "id":2013376,
            "title":"Siana, the very hungry espeon"
        },
        "122322222221212":{
            "choices":[
                "Go back to your trainer",
                "Find another meal"
            ],
            "content":"<div class=\"\"><div> <span>You trod towards one of the hiking trails through the forest, licking your lips at the thought of a meal. Hunting down and swallowing wild Pokémon was fun, but it could get a little dull eating the same kinds of Pokémon everyday. Thus, you preferred battling trainers and devouring their Pokémon, because you could never be sure what you were going to get! You hoped they had something tasty.<br>\r\n<br>\r\nYou reach one of the trails, and immediately see a scrawny-looking trainer walking the dirt road. He looks quite timid, and was apparently foolish enough to travel alone. Perfect!<br>\r\n<br>\r\nYou emerge from the forest onto the path in front of the trainer, flashing him the most menacing look you can muster. He immediately panicked, as you expected he would. He’d probably never seen a macro Pokémon before. He immediately grabs a Pokeball from his bag, and tosses it onto the ground in front of him, revealing in a flash of light… a Lucario! You almost jumped with glee. Lucarios are a delicacy.<br>\r\n<br>\r\n<b>“G-go! Lucario!”</b> the trainer shouted. The Lucario was stunned for a moment, before hesitantly assuming a battle stance. You smirked, deciding you were going to let the poor thing get at least one punch in.<br>\r\n<br>\r\n<b>“Lucario! U-use Aura Sphere!”</b> the trainer commanded, and the Lucario immediately rolled up a ball of energy, before sending it flying through the air, shattering into your side. You flinched a little bit, but ultimately its attack did almost no damage.<br>\r\n<br>\r\nBefore it had a chance to react, you immediately countered with Quick Attack. Due to your size, this single attack sent the much smaller Lucario flying into a nearby tree. The Lucario collapsed onto the ground, immediately defeated. The trainer looked terrified.<br>\r\n<br>\r\n<b>“Please don’t eat me!”</b> The human screamed, before running desperately away back down the trail. You giggle, watching him leave. You then trod over to the Lucario, still lying near the tree, the breath knocked out of him. You look playfully down at him, and he looks defiantly up at you. He was completely at your mercy.<br>\r\n<br>\r\nYou lean down and started licking his chest and face, savoring his flavor. He tries to push your face away, but he doesn’t have the strength. Eventually, you move your barrage of licks down to his paws. With each lick, you slowly nudge his legs further and further into your maw. He looks down, and you make sure to taunt him with a good view of your gaping maw and your dark, tight throat. He panics a bit, trying to get away, but you’re much too strong.<br>\r\n<br>\r\nHe’s quickly in your mouth up to his waist, his paws almost touching the back of your mouth. You raise him up in the air by his legs, before tipping your head back, letting gravity assist your soft swallowing. His paws slowly slide down into your throat as his belly enters your mouth. You hardly have to do anything at this point-- you just had to sit back and enjoy your delicious little treat.<br>\r\n<br>\r\nAfter a few more full minutes of this, he was laying on his back on your tongue, up to his waist in your throat. You give him a few moments to take one last look at the outside world before closing your mouth around him, sealing him in darkness. You sit there savouring his flavor for another solid minute before leaning your head back and swallowing relentlessly.<br>\r\n<br>\r\nHis entire body enters your throat, leaving a massive bulge. His arms are pinned to his sides as he slides slowly but surely down your tight throat. The bulge eventually disappears into your chest, and you purr a bit as you feel his body being deposited into your waiting stomach. Your stomach walls squeezed tightly against him as your belly kicked into action. He couldn’t move a muscle-- all he could do was sit inside of you and wait for your stomach to turn him into but more fat on your belly.<br>\r\n<br>\r\nYou laid down on your back, rubbing your gurgling belly as it gets to work on digesting its new occupant. <i>’He was even more delicious than I imagined!’</i> you thought to yourself. After a few minutes, the struggles slow to a stop, as the Lucario in your belly passes out out due to the lack of oxygen. You stand up, letting out a cute little burp.<br>\r\n<br>\r\n<i>’Well, that was filling,’</i> you thought, as you walked back into forest.</span></div></div>",
            "created":1438059600,
            "id":2013470,
            "title":"Having a Lucario for dinner"
        },
        "122322222222":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Yes",
                "What else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Kyurem and its forms?</span></div></span></div>",
            "created":1476162000,
            "id":2221883,
            "title":"Kyurem"
        },
        "1223222222221":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Human",
                "Pokemon"
            ],
            "content":"<div class=\"\"><div> <span>It's the start of new day and with that you have to hunt. As you peer over your frozen kingdom you let out a loud roar. <br>\r\nYour nostrils flare as you sniff the morning air and determine where to hunt. Leaving your cave, you shift to your Kyurem-White form as the humans called it. You walk for a bit before you pick up the scent of your prey. Licking your lips you pursue your prey, eager to devour it. <br>\r\n<br>\r\nYou spot your prey sitting in the small clearing within the frosty forest. <br>\r\nBut what is your prey?</span></div></div>",
            "created":1476162000,
            "id":2221884,
            "title":"Kyurem it is"
        },
        "12232222222211":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Continue to enjoy the human moving within your belly",
                "Release the human"
            ],
            "content":"<div class=\"\"><div> <span>Your prey is a human. From the scent you can tell they are from a nearby village. You can't tell the gender of your prey from where you are but you don't care. The human doesn't seem to hear or notice you. <i>Perfect.</i> You think as you begin to approach. They seem to be lost in thought or dazed as they still notice you. As you lumber forward you realize the human has suffered from frostbite. <br>\r\n<br>\r\n\"Well this is an interesting turn.\" You murmur as you sniff the human. Without another thought you open your jaws and devour the human-sicle. You feel the frozen human slide down your throat effortlessly before landing in your stomach. Licking your lips, you decide to hunt for more food. <br>\r\n<br>\r\nAs you're hunting you feel the human shift slightly within your stomach. Then sensation feels amazing and the idea of having live prey within you makes your mind rattle with fierce domination. After sometime you filled your belly with plenty of prey. As your making your way back to your cave you can feel the human now squirming in full. The warmth of your stomach has thawed them out completely. Before long you hear the human screaming and yelling in fear. You stretch before sitting back. A loud yawn escapes you as you continue to enjoy the human moving around. <br>\r\n<br>\r\nBased on how long they had been within your stomach, you realized your stomach acids aren't effecting them. Part of you considers spitting the human out but the feeling of them within the confides of your stomach was amazing. </span></div></div>",
            "created":1476162000,
            "id":2221889,
            "title":"Delicious human prey"
        },
        "123":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Pichu",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you prefer to be tiny. You are easily gonna be in someone's belly. Anyway, what tiny Pokemon are you?</span></div></span></div>",
            "created":1239426000,
            "id":674468,
            "title":"Micro Pokemon"
        },
        "1231":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you chose the tiny mouse pokemon, Pichu. Are you male of female?</span></div></span></div>",
            "created":1258434000,
            "id":792903,
            "title":"Pichu"
        },
        "12311":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "go inside",
                "get out of the forest"
            ],
            "content":"<div class=\"\"><div> <span>Alright, you're a male pichu. Let's get started shall we? You're walking in the forest, minding your own business, when you come across a mysterious cave. At first you don't trust it, because you see white spikes by the entrance from top and bottom. Also you see the floor being wet, even though it hadn't rain. You find it really odd, yet curiosity is telling you to go in. Will you do it, or will leave that mysterious cave and out of the forest?</span></div></div>",
            "created":1258434000,
            "id":792910,
            "title":"Male Pichu"
        },
        "123111":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "It's Luxray's mouth",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Curiosity has took control over you. You step inside this mysterious cave, get your feet wet. You take a look around, and you see more white spikes from top and bottom. Also you see something hanging from the roof of the cave over the dark hole. Suddenly, you realized something. It's not a cave it's a mouth. The floor is not a floor, but a tongue as well. Plus, the spikes are teeth as well. You're in someone's mouth, but whose mouth is it?</span></div></div>",
            "created":1258434000,
            "id":792914,
            "title":"It's a mouth"
        },
        "1231111":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Yes, and you saw Luxray face to face.",
                "No,  you about to become lunch to Luxray."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This mouth is Luxray's. You slap yourself in the face, finding yourself very stupid. You want to escape to avoid being eaten, but the mouth is beginning to close up. You ran towards the exit, trying not to slip on the tongue. Did you escape?</span></div></span></div>",
            "created":1258434000,
            "id":792917,
            "title":"It's Luxray's mouth"
        },
        "12311111":{
            "choices":[
                "You're too scared to move.",
                "Run!!!"
            ],
            "content":"<div class=\"\"><div> <span>You jump up towards the huge white teeth that could crush you instantaneously - a stupid move, but you manage to pass through before they clench together. You land face first in the dirt, and waste no time twisting yourself around to face the owner of the mouth. You were greeted by a huge lion-like face, jaws still clenched in a big grin, and a piercing gaze fixed on your small form.<br>\r\n<br>\r\nBeing a micro pokemon, even normally sized pokemon were a huge threat to you. They could crush you with a paw and not even notice! Macro pokemon didn't usually pay much attention to tiny pokemon, they would rather have a normally sized one as they made more filling meals than ones that were tiny compared to the ones that they usually ate. This macro, on the other hand, wanted a micro meal, and you were a fitting candidate. Even if you managed to avoid being swallowed the first time, there's a slim chance you can get away from a huge beast like this..<br>\r\n<br>\r\nThe luxray opened its mouth wide and its huge tongue came out to grab you and pull you back. You look at this titanic pink muscle that could easily crush you, and...</span></div></div>",
            "created":1298091600,
            "id":1057009,
            "title":"Face to face."
        },
        "12311112":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "You don't want to go through the other way",
                "Go through its the only way to survive"
            ],
            "content":"<div class=\"\"><div> <span>You were too late, the mouth close up and you slam into the teeth. You fell onto the tongue. Luxray doesn't know you're in his mouth, but he doesn't care. He lifted his head, and you began to slide down towards the dark hole you know as the throat. Luxray has successfully swallow you whole, and you went down his throat. You panic as you went down the esophagus, you couldn't move even if you wanted to. You suddenly made a splashy landing only to find out you're in the Luxray's tummy. You want to get out, but you can't escape through the way you came. There's only one option left, but you don't think its a good idea. What will you do?</span></div></div>",
            "created":1258434000,
            "id":792919,
            "title":"You got eaten."
        },
        "123111121":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "You're digested",
                "You didn't get digested! What gives?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You refuse to go through the intestines, so you decide to wait in Luxray's tummy to be digested. You find the stomach to be quite comfy. You decide to rest while you wait for the coming acids. What's next?</span></div></span></div>",
            "created":1258434000,
            "id":792921,
            "title":"You stayed in Luxray's tummy"
        },
        "1231111211":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "content":"<div class=\"\"><div> <span>You were very unfortunate. You're spending your last hours in Luxray's tummy, and you think you lived a very good life, despite curiosity got you into this mess in the first place. the acids have appeared and you sank into them til you're nothing but bones. At least you gave Luxray good nutrition.</span></div></div>",
            "created":1258434000,
            "id":792925,
            "title":"The end of Pichu"
        },
        "1231111212":{
            "author_id":"tyguy713",
            "author_name":"Tyson Ritchey",
            "choices":[
                "Your still in Luxray's tummy (Why can't I die!?)",
                "Digested/Deeper inside Luxray"
            ],
            "content":"<div class=\"\"><div> <span>You waited, and waited... Still waiting. \"Well I'm not digesting... yet,\" you say to yourself. You  wait a little longer before the sounds of Luxray's heart gently thumping and its breathing start to lull you to sleep. Well, nothing happened still and I'm getting tired, I'm gonna go to sleep and I'll se what happens later.<br>\r\n<br>\r\n<br>\r\nDoes something happen?</span></div></div>",
            "created":1406696400,
            "id":1835366,
            "title":"You didn't get digested! What gives?"
        },
        "12311112122":{
            "author_id":"theanthro",
            "author_name":"Auron The Nomcario",
            "choices":[
                "Go through with digesting you",
                "Usher you into the intestines"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you slept and snored softly, your ears would make out a faint, deep groan from the Luxray's fleshy gut, churning softly around you, it seems your predator's belly has decided to...</span></div></span></div>",
            "created":1429938000,
            "id":1969134,
            "title":"A tour, or a gurgle?"
        },
        "123111122":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Continue through the intestines.",
                "Take a nap, all this has tired you out."
            ],
            "content":"<div class=\"\"><div> <span>You don't like it but it's the only way you can think to survive. Taking a deep breath, you dive underneath the pool of stomach acids and desperately search around for the entrance to the intestines. You swim around for about 15 seconds, about to run out of there when suddenly, there! The entrance. You dive down and squeeze your little head into the hole, the rest of your body soon following suit. You flop into the slightly dryer area and plop goes your body, coming to rest on some soft, squishy flesh. Your soft fur was slightly soaked with stomach liquids and you take a look around you. In front of you is a tunnel about four times your size, the walls curving around and made of flesh churning around with the movements of Luxray. Behind you was the entrance to the stomach, a small opening tightly shut just barely dripping out some liquids.<br>\r\n<br>\r\n<br>\r\nSo, what should you do now?<br>\r\n<br>\r\n</span></div></div>",
            "created":1430110800,
            "id":1970581,
            "title":"Go through its the only way to survive"
        },
        "1231112":{
            "author_id":"dragonopower",
            "author_name":"DragonRider",
            "choices":[
                "Lucario",
                "Rayquaza"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lucario's or Rayquaza's</span></div></span></div>",
            "created":1267592400,
            "id":845636,
            "title":"other"
        },
        "12311121":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Keep going! ",
                "Screw this! Turn back before it's too late!"
            ],
            "content":"<div class=\"\"><div> <span>You step into the \"cave\", throwing caution to the wind to sate your curiosity about this strange cave.It was a tight fit, with the opening only slightly taller than you at a mere one foot tall, stepping your feet into the cave, the first thing you notice was that the floor squished underneath your weight and the walls soaked liquids making a large puddle across the whole floor of the cave. The cave continues onward down a dark corridor that could lead to more adventure...<br>\r\n<br>\r\nWhat are you going to do now?</span></div></div>",
            "created":1425704400,
            "id":1945415,
            "title":"Lucario"
        },
        "123111211":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "content":"<div class=\"\"><div> <span>\"There might be treasure or something down there!\" You say, the thought of untold riches captivating you, blinding your mind of any possible dangers. You start to crawl down the dark wet tunnel, thinking maybe there's a pool of water somewhere nearby creating the moisture. After a minute of crawling you get to a slightly larger room, though only slightly larger than you are. There appeared to be only one other way out besides the way you came, but it was far too small for you to fit in. Your hand brushes through a small pool of liquid singing your fur,<br>\r\n\"Ow!\" You proclaim, wondering what sort of cave you're in when suddenly the whole room shifts and moves like the landscape itself was moving.<br>\r\n\"Hahahaha!\" You hear a booming laugh from outside the cave<br>\r\n\"Wow, I've hunted a lot of prey in my life, but I've never had anyone volunteer to be my meal!\" <br>\r\nSuddenly, everything makes sense to you. \"Oh no...\" You think to yourself, realizing that you've just climbed straight into a predators stomach. You desperately try to get back up the throat, but to no avail. Slapping yourself for your greed getting the best of you, the digestion process gets underway before long and the lucario sleeps with a full stomach tonight.</span></div></div>",
            "created":1425704400,
            "id":1945421,
            "title":"Keep going! "
        },
        "123111212":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "content":"<div class=\"\"><div> <span>\"You know what... I think I've had enough.\" you mumble to yourself, getting cold shoulder at the last minute as you don't know what could be down there.<br>\r\nHowever, just as you turn to get out of here the opening to the cave slams shut revealing that the \"cave\" was actually a mouth! A mouth belonging to a male lucario!<br>\r\nThe roof of the mouth pushed down on you, forcing your body to conform to the tightness of the mouth. Your whole body was drenched in saliva, his warm breath washing over you in waves. You curse your bad luck when his tongue suddenly shoves you back into his throat, the powerful muscles forcing you down the damp squishy tunnel until it deposits you into the stomach, barely large enough for you if you curl into a ball.<br>\r\n\"Please... I don't want to be digested!\" You yell at the lucario keeping you captive. The only response was a satisfied purr from the lucario, glad to have such an easy meal.<br>\r\n</span></div></div>",
            "created":1425704400,
            "id":1945418,
            "title":"Screw this! Turn back before it's too late!"
        },
        "12312":{
            "author_id":"lugizard",
            "author_name":"Lulu",
            "choices":[
                "Another pokemon appears!",
                "The tree starts shaking!"
            ],
            "content":"<div class=\"\"><div> <span>Okay, you're a female pichu!<br>\r\n<br>\r\nOne warm spring afternoon, you find yourself high in a cheri tree, having spent all morning climbing just to reach the sweet berries on the topmost branches. The round fruits are as big as you are, and you find a ripe and juicy one to sit down and munch on. Once your little belly has had its fill, you lean back against the trunk and contemplate napping as your body begins to process your lunch.<br>\r\n<br>\r\nJust as you're starting to nod off, something unexpected happens!<br>\r\n</span></div></div>",
            "created":1307854800,
            "id":1124334,
            "title":"Female"
        },
        "123122":{
            "author_id":"lugizard",
            "author_name":"Lulu",
            "choices":[
                "You survive the fall.",
                "Something catches you."
            ],
            "content":"<div class=\"\"><div> <span>You're jerked awake as the branches around you begin to sway back and forth violently, as if something is shaking the tree! You cling to the trunk for dear life, but several berries come loose during the assault, and a particularly large one slams you in the back, sending you tumbling out-of-control towards the forest floor.<br>\r\n<br>\r\nAs you see the hard ground rush up to meet you, you hope for something--<i>anything</i>--to stop your fall!</span></div></div>",
            "created":1307854800,
            "id":1124343,
            "title":"The tree starts shaking!"
        },
        "1231222":{
            "author_id":"lugizard",
            "author_name":"Lulu",
            "choices":[
                "...in someone's hand.",
                "...on a soft tongue."
            ],
            "content":"<div class=\"\"><div> <span>You continue careening helplessly through the air, but just as you're bracing yourself for impact, you land on something surprisingly soft--not the cruel, unforgiving surface you were expecting. Eyes still shut tight, it takes you a few moments to look around, and you see that you have landed...</span></div></div>",
            "created":1307854800,
            "id":1124349,
            "title":"Something catches you."
        },
        "12312221":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Hand/Claw",
                "Not a Hand/It's a Vine/Wing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You land safely one someone's hand. But who's is it? Or is it a hand at all?</span></div></span></div>",
            "created":1437886800,
            "id":2012580,
            "title":"...in someone's hand."
        },
        "123122211":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Hand",
                "Claw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well which one? Hand or Claw?</span></div></span></div>",
            "created":1437886800,
            "id":2012581,
            "title":"Hand/Claw"
        },
        "1231222111":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Menacing way",
                "Friendly chuckle (it’s your Cyndaquil friend fully evolved)"
            ],
            "content":"<div class=\"\"><div> <span>You look up in fear as you see the biggest shiny Typhlosion you’ve ever seen. You swallow nervously as you sit on his palm, watching as dozens of berries fall into his ravenous maw. He munches down all the berries before turning his attention to you. You had been around large Pokémon before heck you used to have a best friend who was a Cyndaquil but that sometime ago. <br>\r\n<br>\r\n“What have we here?” The Typhlosion asks as he looks you over. His piercing red eyes looks your tiny form over before he brings you closer to his snout. You whimper as he sniffs you, nearly sucking you into his nostrils. “You’re rather tiny for a Pichu.” He notes.<br>\r\n<br>\r\nYou whimper as you stare at the giant fire type, afraid of what he might do to you. He opens his cavernous mouth, his tongue slipping out and giving you a long lick. Your fear only worsens from this action. You hear him laughing in a...</span></div></div>",
            "created":1550552400,
            "id":2620120,
            "title":"Hand"
        },
        "12312221112":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Spelunking (into Typhlosion’s mouth)",
                "Tickle Attack (between Typhlosion’s toes)"
            ],
            "content":"<div class=\"\"><div> <span>“You don’t remember me, do you?” He asks as he begins walking, carrying you on his palm. <br>\r\n<br>\r\nYou stare for a moment before a light bulb goes off. Your fear fades as you smile up to the big guy. “It’s been forever! You had me really scared there, Marc!” You exclaim before nuzzling his hand. <br>\r\n<br>\r\n“Ah, come on, lighten up.” Marc replies as he licks you again. <br>\r\n<br>\r\nYou catch up for a bit while Typhlosion walks, carrying you to his cave. You felt at ease knowing this Typhlosion was your old friend from sometime ago. Marc was always massive compared to you but now the size difference was even bigger. As you two reach his cave, Marc brings you back to eye level. “Wanna play like old times?” He asks. You nod excitedly. “Alright what game should we play?”</span></div></div>",
            "created":1550552400,
            "id":2620122,
            "title":"Been awhile"
        },
        "123122211121":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "During the night you are swallowed",
                "Next morning, still in the mouth"
            ],
            "content":"<div class=\"\"><div> <span>You cheerfully point at his mouth. “How about spelunking? The cavern has to be much larger with more to explore than before.” You say energetically.<br>\r\n<br>\r\nMarc laughs as he brings his hand to his massive mouth and opens wide. “Good luck little explorer.” He says as you leap onto his tongue. You giggle as you feel his tongue lick you slightly. You run along his mouth, exploring every area to your old friend’s jaws. All around you, you hear Typhlosion purr in delight as you move around his spaceous mouth. Soon you flop back onto his tongue and gaze out of his mouth, the view putting things into perspective as you realized just how big your friend was. “Hey, tired already?” He asks as you laying on the tongue. <br>\r\n<br>\r\n“It’s been a long day.” You yawn as you start to crawl to the front of his mouth. <br>\r\n<br>\r\n“Wanna sleep in there? You’ll be safe from other predators.” He suggests. <br>\r\n<br>\r\nYou paused and looked around. There was plenty of room, you could easily sleep on his big squishy tongue. Plus he was right, you would be safe inside his mouth. You yawned and curled up on Typhlosion’s tongue. “Night Marc.” You way before falling asleep.<br>\r\n<br>\r\n“Good night.” He replies before carefully closing his mouth.</span></div></div>",
            "created":1550552400,
            "id":2620124,
            "title":"Spelunking (into Typhlosion’s mouth)"
        },
        "1231222111211":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Next morning, still in the belly ",
                "Next morning, outside the belly"
            ],
            "content":"<div class=\"\"><div> <span>You roll over in your sleep, still laying on Marc’s tongue. Typhlosion purrs slightly as he feels you roll over. He looks out his cave for awhile, enjoying the feeling of you in his mouth. He smiles slightly, opening his mouth for a moment, wanting to make sure you’re asleep. You continue to sleep soundly on his tongue. Marc grins ever so slightly before closing his mouth carefully again. He sits back, slowly tilting his head back and letting you slide down his throat. You land with a wet plop in Typhlosion’s stomach, unconsciously nuzzling the fleshy wall. <br>\r\n<br>\r\nMarc yawns above you before falling asleep himself. <br>\r\nAfter a few hours you slowly open your eyes and look around frantically. It’s pitch black, your eyes taking a moment to adjust. Above you, you hear loud thumping. You whimper slightly before feeling something shift. “Hey, don’t worry. You’re safe, I won’t hurt you. Just get some sleep.” Marc reassures before gently rubbing his belly. You nod slightly and curl back up in his stomach. It’s warm and humid, but very comfortable. You nuzzle the flesh again enjoying the warmth and protection. </span></div></div>",
            "created":1553749200,
            "id":2636494,
            "title":"During the night you are swallowed"
        },
        "1231222112":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "He's not going to harm you",
                "He's intent on harming you"
            ],
            "content":"<div class=\"\"><div> <span>You land face down, eyes clenched on someone's claw.<br>\r\n<br>\r\n\"Are you alright?\" A deep dragon-like voice asks a hint of concern in it's voice.<br>\r\n<br>\r\nYou slowly open your eyes and push yourself up slightly. You look around and quickly realize you're on the claw of a Charizard. A squeak of fear escapes you as you look up at the Charizard's face. You can tell that this Charizard is male and he is clearly in complete control of the situation. \"Oh please Mister! Please don't eat me!\" you whimper as you try to beg for you life.<br>\r\n<br>\r\nThe Charizard cracks a grin. You're uncertain of his intentions as he looks at you. <br>\r\n<br>\r\nThe grin and look in his eyes suggest...</span></div></div>",
            "created":1437886800,
            "id":2012582,
            "title":"Safety in the Claw"
        },
        "12312221121":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Victrebel eats you",
                "Charizard returns and saves you"
            ],
            "content":"<div class=\"\"><div> <span>You whimper as he runs his tongue along your body. The Charizard then nuzzles you before setting you on his snout, his eyes checking you over. \"Don't worry tiny one, your safe.\" He says before going back to gathering food. <br>\r\n<br>\r\nA sigh in relief escapes you as you sit on the snout. You knew you were a tiny Pichu but you were barely size of two of his scales. \"Umm... Mister...?\" You begin.<br>\r\n<br>\r\n\"Yes tiny one?\" He responds.<br>\r\n<br>\r\n\"Can I go?\" You ask, your voice shaking. The Charizard comes to a stop, his claws gently picking you up. You begin trembling under his gaze. <br>\r\n<br>\r\n\"Where is home for you?\" He asks, his voice is gentle. <br>\r\n<br>\r\nYou point to a small patch of leaves under the tree. He nods and gently lowers you to where you pointed. \"Be careful tiny one.\" He says as you leap off his claw. The Charizard goes about his way, leaving you alone, or so you thought. <br>\r\n<br>\r\nNo sooner had the Charizard left were you attacked. You whimper as a vine ensares you. A Victrebel eyes you before dangling you above its waiting mouth. You scream as you struggle.</span></div></div>",
            "created":1522990800,
            "id":2475769,
            "title":"Gentle Charizard"
        },
        "123122211212":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "No interruptions on route to Charizard's cave",
                "One or both of you fall into Charizard's throat"
            ],
            "content":"<div class=\"\"><div> <span>\"Sis!\" your Riolu brother calls as he rushes from your home. He punches the Victrebel with Power Up Punch, but due to being micro like you, it does nothing. He's quickly ensnared and brought over the mouth. The vines holding both of you loosen as you fall towards the mouth.<br>\r\n<br>\r\nSuddenly the Victrebel screams in pain as a fireball engulfs it. You and Riolu are caught in a familiar orange claw. Both of you watch as the Charizard devours the grass type. Once he's done with Victrebel, his eyes look to you and Riolu.<br>\r\n<br>\r\n\"Thank you, Mister Charizard.\" You whimper.<br>\r\n<br>\r\n\"Wait, you know him?\" Riolu asks as he looks from you to the Fire type.<br>\r\n<br>\r\n\"Are you both alright?\" Charizard asks with genuine concern. You nod. He sighs in relief. <br>\r\n<br>\r\n\"Mister Charizard, can we live with you?\" You ask.<br>\r\n<br>\r\n\"What?!\" Riolu responds.<br>\r\n<br>\r\nCharizard looks you both over. He nods slowly. \"You may, if you so desire.\" He says. His wings uncurl as he gets ready to fly. \"I'm heading back to my... our cave. For the time being, you'll ride inside my mouth. I'll let both of you out when we arrive.\" He says before putting you and your brother in his mouth. He makes certain both of you are clear of his teeth before closing his jaws. You feel things shift as he takes flight.</span></div></div>",
            "created":1522990800,
            "id":2475771,
            "title":"Saved"
        },
        "12312221122":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Eats you anyway",
                "Makes you his slave"
            ],
            "content":"<div class=\"\"><div> <span>“I wasn’t planning on eating you but you do look rather tasty.” Charizard’s deep voice rumbles. He brings you closer to his jaws and give you a long lick causing you to shudder. “M’hmm... just like the sweetness of berries.” He adds.<br>\r\n<br>\r\n“Please Mister Charizard! Don’t eat me, I’ll do anything you want!” You beg as his rough tongue runs across your body again.<br>\r\n<br>\r\n“Anything?” He questions as he gazed down at you.<br>\r\n<br>\r\n“Yes anything!” You cry as he looks you over.<br>\r\n<br>\r\nCharizard thinks for a moment.</span></div></div>",
            "created":1542517200,
            "id":2579311,
            "title":"Mean Charizard"
        },
        "12312222":{
            "author_id":"lugizard",
            "author_name":"Lulu",
            "choices":[
                "...you slip!",
                "...you grab on!"
            ],
            "content":"<div class=\"\"><div> <span>Sitting up slightly, you blink down curiously at the soft ground beneath you, running a paw over it and taking note of the slick, wet surface and the unusual pink color. Still a bit confused, you finally look up, noticing that the ground seems to stretch on forever, like an endless road of pink. But as your eyes follow the road even farther, you see that the road is actually pinched off by a mouth; a mouth belonging to the chubby, pink face of a lickitung.<br>\r\n<br>\r\nWhich means that you were saved by its abnormally long tongue.<br>\r\n<br>\r\nThe pink and yellow pokemon blinks down at you with its beady, black eyes. At first, you're unsure of what it's thinking, but when you look around, you see that you're surrounded by cheri berries--and judging from the drool dribbling out of the corners of its mouth, to the hungry giant, you looked like nothing more than an extra furry fruit.<br>\r\n<br>\r\nSeeing the greedy gleam in its eye, your next move was obvious: you had to get off! But just as you're about to make a mad scramble for the edge, the ground unexpectedly surges beneath you as the massive pokemon lifts its tongue upwards, tilting it sharply. Despite this, you still try to jump off, except that the lickitung decides to curl its tongue inwards like a bowl, forcing the berries (and you) to line up in a straight, single-file line. And as you begin to slip downwards, you realize exactly what the lickitung's doing: its creating a slide so that it can gulp down the berries one-by-one--and sure enough, you look down just in time to see the pokemon's mouth open wide, the black throat flexing open just as the first berry tumbles out of sight. The giant didn't even swallow. It just allowed the treats to fall straight down into its stomach, one after another.<br>\r\n<br>\r\nIn spite of all your efforts to escape, you soon realize that you're helpless to flee. The throat seems to rush closer--and that's when you see it! The uvula! Just dangling there high above the death pit that was the giant's esophogus. If you could just grab hold of it and hang on, maybe you could completely avoid your dark fate inside the pokemon's massive belly.<br>\r\n<br>\r\nThere were only a handful of cheris in front of you now, so you'd have to time it just right. You're inside the luckitung's beak now, and you countdown as you witness the last of the berries disappear over the edge of the tongue.<br>\r\n<br>\r\nIt was now or never!<br>\r\n<br>\r\nYou spring off of spongy surface, the glistening uvula in your sights. You reach out, and...</span></div></div>",
            "created":1307854800,
            "id":1124398,
            "title":"...on a soft tongue."
        },
        "123122221":{
            "author_id":"lugizard",
            "author_name":"Lulu",
            "content":"<div class=\"\"><div> <span>Your paws slip right off!<br>\r\n<br>\r\nYou let out a terrified squeak as you proceed to tumble down into darkness--<i>exactly what you were trying to avoid.</i> There are berries above and below you, and you occasionally bump the wet walls of the esophagus on your way down. After what feels like an eternity of terrified falling, you feel yourself enter a cavernous space and you land heavily on the mound of berries. Quickly scrambling to your feet, you try your best to hide as more of the treat drop down to join you. Once the last berry is deposited, the stomach entrance flexes shut, sealing you to your fate.<br>\r\n<br>\r\nThe muscled walls of the stomach immediately get to work, writhing and contracting as they begin grinding the berries against each other. And as if things couldn't get any worse, the same walls begin to exude a pungent liquid, thick strings of it dribbling from the ceiling onto the churning pile of food. One especially thick, green glob lands on the berry right next to you, and you witness in horror as the fruit melts right before your eyes, instantly reduced to a pulpy mush--similar to what you'll look like soon if you never get out of this death pit.<br>\r\n<br>\r\nThe fleshy sac you're trapped in continues to churn its contents. The air is thick with the smell of fruits and gastric juices as the acids continue to rise to overtake the mound. Despite your best efforts to stay far away from the digestive juices, you feel the ground beneath gradually become soft and squishy as the food you're standing on begins to settle. Soon, however, there's nothing left you can do, and your small body joins the digestive soup, the last thing you remember hearing being the intense gurgling of the intestines just beyond the stomach walls.<br>\r\n<br>\r\nThe lickitung leans back against the cheri tree, rubbing its full, round tummy in an effort to sooth its stomach as it broke down its lunch. Because lickitung lacked teeth for chewing, they made up for it with their extremely potent stomach acids. Thinking of the cheri berries, it began drooling again. That batch of berries had been especially filling--and its belly seemed happy too, finally shrinking down as the solid fruits were liquefied. Quite content, the pokemon shuts its eyes, listening to the quiet gurgles coming from its tummy.<br>\r\n<br>\r\nIt also thought it may have heard a tiny squeak, but by that time, the massive pokemon was already asleep.<br>\r\n</span></div></div>",
            "created":1307854800,
            "id":1124427,
            "title":"...you slip!"
        },
        "1232":{
            "author_id":"sodamehpop",
            "author_name":"Soda",
            "choices":[
                "Mudkip",
                "Skitty",
                "Eevee"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So picky what'll it be?...</span></div></span></div>",
            "created":1264309200,
            "id":824891,
            "title":"Other"
        },
        "12321":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "How about the river?",
                "The forest looks lovely, does it not?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you're a Mudkip. One of the gen three starter Pokemon standing at a measly 1 foot, 4 inches.<br>\r\nWhere would you like to go first?</span></div></span></div>",
            "created":1426222800,
            "id":1947803,
            "title":"Mudkip"
        },
        "123211":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Somewhere up the river.",
                "Let's go into the forest!"
            ],
            "content":"<div class=\"\"><div> <span>Ah, one of the many rivers of the Hoenn region. This seems like a good place to start your story. Logically it makes sense, A water type in a river filled with tons of other water pokemon and teeming with life. However, nature is harsh to the small and weak, such as yourself, you're going to have to find some food and that could lead to some troubles. You decide to go find something to eat, as you can feel your stomach growling with hunger.<br>\r\n<br>\r\nWhere will you find a meal... or become one yourself?</span></div></div>",
            "created":1426222800,
            "id":1947810,
            "title":"How about the river?"
        },
        "1232111":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "A large predator ready to eat.",
                "Just a fish... eating time!"
            ],
            "content":"<div class=\"\"><div> <span>The river is filled with bountiful amounts of Magikarp and other water Pokemon, ripe for the picking and eating! You can see several fish swimming about, making your stomach growl. Suddenly the water ripples behind you and a Pokemon leaps out of the water... which one is it?</span></div></div>",
            "created":1426222800,
            "id":1947818,
            "title":"Somewhere up the river."
        },
        "12321111":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "content":"<div class=\"\"><div> <span>You turn around and watch in horror as a 21' Gyarados soared through the air aimed directly at you. You try your hardest to swim away but you're just to slow. Gyarados' mouth closed around your body. There seemed to be no escape as you get sucked into his throat and into the stomach. It was cramped, wet, and warm your body squirming uncomfortably, beginning to digest in his stomach. Your journey is over.</span></div></div>",
            "created":1426222800,
            "id":1947820,
            "title":"A large predator ready to eat."
        },
        "12321112":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Evolve into Marshtomp!",
                "Press B!"
            ],
            "content":"<div class=\"\"><div> <span>It's just a Magikarp, one that you gracefully catch in your mouth.<br>\r\n\"Karp!\" It pleads, but you know it's either eat or be eaten so you swallow the Magikarp whole, just barely fitting into your tiny stomach. <br>\r\n<br>\r\nsuddenly you start to glow, you're evolving!</span></div></div>",
            "created":1426222800,
            "id":1947821,
            "title":"Just a fish... eating time!"
        },
        "123211122":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Gyarados",
                "It's a Wailord!?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're not ready for evolution just yet, canceling your evolution with a press of the \"b\" button.<br>\r\nSuddenly, a wild Pokemon attacks!<br>\r\n<br>\r\nWhich one is it?</span></div></span></div>",
            "created":1426222800,
            "id":1947822,
            "title":"Press B!"
        },
        "123212":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "Oh look, a Wurmple!",
                "The 'predator' becomes the prey!"
            ],
            "content":"<div class=\"\"><div> <span>The forest, flooding with life, mostly bug and grass types (Excellent choice wise guy...) Anyway, we start our story here, you're going to have to find something to eat soon, however this also means other Pokemon will be on the prowl for a tiny little Mudkip like yourself to eat.<br>\r\n<br>\r\nSo what happens? </span></div></div>",
            "created":1426222800,
            "id":1947811,
            "title":"The forest looks lovely, does it not?"
        },
        "1232122":{
            "author_id":"kindafishy",
            "author_name":"Fisher",
            "choices":[
                "You go straight to the stomach.",
                "Maybe there's something he'd like in exchange for your life?"
            ],
            "content":"<div class=\"\"><div> <span>You go around the forest in search of a meal when you hear a growl coming from a bush. Suddenly, a Torterra jumps out at you, trapping you under his feet. <br>\r\n\"Wait stop!\" You shout, hoping he could show you mercy<br>\r\n\"Please, Do you think I'd let such a delicious Mudkip go for nothing? He says, opening his mouth and creating roots out of the ground to hold you.<br>\r\n<br>\r\n<br>\r\nWhat happens next?!</span></div></div>",
            "created":1426222800,
            "id":1947813,
            "title":"The 'predator' becomes the prey!"
        },
        "12323":{
            "author_id":"nintendo89",
            "author_name":"Char89",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Male or Female?</span></div></span></div>",
            "created":1274072400,
            "id":884558,
            "title":"Eevee"
        },
        "123231":{
            "author_id":"minron",
            "author_name":"Bob",
            "choices":[
                "You Father, the Leafeon.",
                "Your Mother, the Vaporeon."
            ],
            "content":"<div class=\"\"><div> <span>You are a male Eevee, born small within a family of other larger Eevees. You family was known to breed the largest Eevees in the forest and ruled this forest. Much to disappointment of your mother –a Vaporeon- and your father –a Leafeon-, when the litter was born, you were the smallest, beyond even the runt of the litter. Your mother and father were surprised you even survived the journey out of your mother’s womb without being squashed during her pregnancy by one of your brothers or sisters. Despite their disappointment in your size and your inability to speak or even communicate with you, being barely an inch at birth, both of your parents did their best to provide you special care. You mother allowed you have your own private feeding times, to avoid the hassle of fighting with your larger siblings over a teat to suck. Your father spent much time with you when he wasn’t hunting, even more so then your more independent siblings. The day finally came when your brothers and sisters were old enough to live on their own and leave the family cave, while you on the other hand had to stay with your mother and father, seemingly not ever having the advantages that ran in your family in the category of size.<br>\r\n<br>\r\nMany months later, considering it would be good for you to see some of the outside world, your mother and father decided it would be best for you to spend some quality time with one of your siblings and would set off in the afternoon to find a brother or sister that would be obliged to taking you in for a time. While you wait for the sun to rise to its highest point, you think about your brothers and sisters, as well as your mother and father in a perspective as your three inch form lays upon your mother’s smooth and slick back as she floats in the pond near your home cave.<br>\r\n<br>\r\nYou mother is six feet in length from nose to tail, twice as tall as the average height of a Vaporeon. She is loving and caring like any mother would be, even towards something she originally thought as a disappointment when you were first conceived. She has grown attached to you, in the way the yearning to look after one’s child besets a mother whose other children have left the home. For this reason, your mother is ever protective of you and was almost against letting you go to live with one of your possibly mean brothers or sisters, but your father insisted. You spend half of the nights sleeping in the embrace of your mothers paws, while the other half is cuddling with your father.<br>\r\n<br>\r\nYou father is six foot three in length from nose to tail, slightly more than twice as tall as the average Leafeon. Though not as willing to admit it, your father is just as loving and caring as your mother, but tends to keep more of a distance from you I fear of hurting your accidentally. Though in a way, your father slightly despises you for your size, he loves you for the way you keep a constant bond between him and your mother. If it wasn’t for having to look after you, when your siblings left, they probably would have gone their separate ways. Occasionally, your father takes you on food gatherings with him, since he believes one day you will be able to fend for yourself, though this is but a dream of your fathers. Despite not being able to understand him or any other of your own kind, you have a feeling your father loves you very much.<br>\r\n<br>\r\nYour first brother is an Eevee, who never came in contact with any stones in this unknown region. He is two foot two, above twice the size of a regular Eevee. Due to your brother being the second smallest in the litter when you’re other siblings evolved, you two were very close. Honestly, he liked being close to you because then he didn’t feel as small compared to the others. Often you would spend time crawling around on his belly when you two were alone and at one time you even helped him clean up his mouth, though this almost resulted in you becoming his next meal, but he was able to regurgitate you.<br>\r\n<br>\r\nYour first sister is a Flareon that in five foot from nose to tail. Like your Eevee brother, she too cared for you deeply, but in a more sensual way. Often she’d try to take you someplace within her mouth and tried to swallow you whole. You weren’t able to talk to her because of your birth defect, unable to understand she just wanted you closer to her, to protect you. Since you didn’t understand too well why she did this, you were on a constant balance between loving her and fearing her, unable to choose between the two.<br>\r\n<br>\r\nYour next brother is a Jolteon who is four foot six from nose to tail. By far the most rough out of your siblings, he was often the one playing fetch with you, literally; he tossed you up in the air and tried to grab you with his maw. This made some pretty close calls, but he was always smart enough to know the right position while catching you to not hurt you. Your brother was always energetic and excited towards you, something that scared you until you got use to it.<br>\r\n<br>\r\nYour next sister, Espeon being four foot eleven from nose to tail, was the sister who cared very little for you. Often when tasked with looking after you during family outings, she would simply sit on you to make sure you didn’t go anywhere while she groomed herself. Despite your sister’s failings during most of the time in her presence, she would often use her psychic abilities to entertain you when she felt like it and when you were in danger; she would even shield you from being squashed or hurt. If you had to guess, she was just rough in a different sense from your Jolteon brother and that the way she treated you was just a way she showed affection. Perhaps with all the others coddling you, she decided to give you a break by treating you differently.<br>\r\n<br>\r\nYour brother, Umbreon was five foot from nose to tail and often took you along on his night time excursions. You would often spend hours a night staring at the stars with him, nestled comfortably on his belly, listening to the noises it made and the heart beat not far above. One time or another, you imagined what it would be like to hear it on the inside, not knowing this was the same feeling your sister, Flareon wanted for you, but instead you felt for your brother Umbreon.<br>\r\n<br>\r\nYour last sister and sibling, a Glaceon was four foot five from nose to tail and was very cold towards you. She would often attempt to bat you away if you got in her path and even stepped on you a few times, though never put on her full weight. A few times when you were eating your food, she would come and take it from you, even when you were still on top of it. This led to many encounters with her teeth and even a journey to her belly, only to be regurgitated as she left you lying in her vomit with disgust.<br>\r\n<br>\r\nThe afternoon finally arrived and you stood up on your mother’s back, she too getting the signal that you were ready to go, even though you two couldn’t communicate. Dreary eyed from relaxing so long, your mother carefully made her way out of the pond, making sure not to move too suddenly or you’d fall off. The sun reflecting off of your mother’s skin caused you to recoil and close your eyes from the intensive glare, your mother noticing this and quickly going into the shade. You father soon arrived with a Magikarp for tonight’s feast dangling from his mouth, held by its tail. Your father would often feed your mother before himself, so the Magikarp was for her. Dropping the fish Pokémon to aimlessly flop on the ground, your father prepared for your mother’s decision; who was going to take you to one of your siblings?</span></div></div>",
            "created":1297314000,
            "id":1051520,
            "title":"Male"
        },
        "1232311":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "Eevee",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of your siblings</span></div></span></div>",
            "created":1314680400,
            "id":1178069,
            "title":"You Father, the Leafeon."
        },
        "12323112":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "Jolteon",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jolteon?  </span></div></span></div>",
            "created":1314680400,
            "id":1178070,
            "title":"more"
        },
        "123231122":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "Espeon",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how bout Espeon</span></div></span></div>",
            "created":1314680400,
            "id":1178071,
            "title":"Espeon?"
        },
        "1232311222":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "Flareon",
                "more please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Flareon perhaps</span></div></span></div>",
            "created":1314680400,
            "id":1178072,
            "title":"Flareon"
        },
        "12323112221":{
            "choices":[
                "Yes it did (Flareon eats you in happiness)",
                "Nope (Flareon eats Alakazam in rage)"
            ],
            "content":"<div class=\"\"><div> <span>Your father lead you to where your sister lived and when both of you got their your sister came out. \"Hello dad, I think I have an idea of how to make it so Eevee can talk and hear. \" \"really how so?\" \"Well I have this friend who is an Alakazam who is sort of is like a doctor and he knows how to fix these things up.\" Flareon had said, while you weren't able to hear you did develop the extraordinary ability to read lips. You nodded excited to be cured.<br>\r\n<br>\r\nLater when you and your family were at the Alakazam's home he inspected you. \"Hmm, this unique but I believe that I can fix this.\" His eyes flashed signifying he was now using his psychic abilities after a bit he stopped. <br>\r\n<br>\r\nDid it work?</span></div></div>",
            "created":1481864400,
            "id":2250857,
            "title":" Flareon has an idea"
        },
        "12323112222":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "Umbreon",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about your kind brother Umbreon?</span></div></span></div>",
            "created":1314680400,
            "id":1178073,
            "title":"more please"
        },
        "123231122221":{
            "author_id":"mewlvr",
            "author_name":"The whiz",
            "choices":[
                "Nod",
                "Speak!?!"
            ],
            "content":"<div class=\"\"><div> <span>Your father stops at your brother's cave and calls out \"Umbreon! You home?\" \"yea Dad I'm in,\" came the reply as a tall black figure steps out the cave. \"Hey little bro!\" He says smiling at you. You smile back in response. You dad says \"I need you to watch him for a bit.\" \"Sure, no problem,\" he replies. Your father says good and turns to walk away and your brother turns back to you who is now sitting on a rock next to him. \"You hungry?\" he asks. You...</span></div></div>",
            "created":1371963600,
            "id":1615991,
            "title":"Umbreon"
        },
        "1232311222212":{
            "author_id":"mewlvr",
            "author_name":"The whiz",
            "choices":[
                "Your mother speaks up",
                "Your father speaks up"
            ],
            "content":"<div class=\"\"><div> <span>\"Y-Y-Yes\" you said and both your father and brother stop in their tracks. \"Did you just...\" your brother trails off. \"Yes\" you say again then your eyes shoot open \"Dad, Umbreon, I'm talking!\" \"Quick! Go get Mom!\" Umbreon says as your father bolts off to your house. He returns three minutes later with your mother and all your siblings. \"Well?\" your sister, Glaceon says. \"Well what?\" you reply and she passes out from pure shock. Then you audibly laugh. And your brother,even says \"What's so funny?\" \"Your faces look hilarious!\" you say and your siblings keep staring. Then</span></div></div>",
            "created":1371963600,
            "id":1616004,
            "title":"The mute talks"
        },
        "123231122222":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "Glaceon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is the last sibling.</span></div></span></div>",
            "created":1314680400,
            "id":1178075,
            "title":"more"
        },
        "1232311222221":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Vaporeon.",
                "Leafeon."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>These are the truly the last ones.</span></div></span></div>",
            "created":1345698000,
            "id":1411306,
            "title":"Ops. Okay, last siblings (for real this time)."
        }
    },
    "info":{
        "author_id":"nintendo89",
        "author_name":"Char89",
        "brief_description":"A Story on Pokemon Vore and more.",
        "created":1239502740,
        "description":"<td align=\"left\" class=\"norm\">This is about Pokemon in vore. I only allow soft vore in this story, so try to keep it clean. Digestion is allowed in some areas. If I find something disturbing, I'll delete it. Giant and tiny Pokemon is allowed. I will allow paw fetish as an addition, but try not to lead off the topic. I will try to add a couple of chapters of my own to help expand the story. Enjoy!<br>\r\n<br>\r\nAnd Remember, when doing a chapter that's vore related, make it soft vore.<br>\r\nThat means no Hard Vore, Unbirth, Soul Vore or anything like that. NO EXCEPTIONS!<br>\r\n<br>\r\nAlso, try to spell it correctly. If I find words that are misspelled, I'll fix it.<br>\r\n<br>\r\nHave Fun.</td>",
        "id":1549093,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602528240,
        "modified":1602528240,
        "pretty_title":"Vore for Pokemon"
    }
}