{
    "chapters":{
        "1":{
            "author_id":"khlover369",
            "author_name":"KHL",
            "choices":[
                "try to run"
            ],
            "content":"<div class=\"\"><div> <span> You are walking with your parents in the forest beyond the town. You say to your mother, \"how much longer i'm tired and i want to go home\" \"Just a little bit further dear\" said your mother. \"Yes just a bit further\" said your father. <br>\r\nYou sigh and keep walking. finally you stop walking and your mother say, \"look a golden necklace would you go get it for me dear\" your mother says, \"i knew you left something behind on our last trip here\" she smiled. <br>\r\nYou sigh and think parents a so weird and walk over to the spot you mother pointed out and looked around seeing nothing on the ground “where is it?” then suddenly.....<br>\r\nYou are in a net in the air. you yell “what happened, what’s going on” you look down and realize you really high from the ground and is scared stiff and then you see your parents looking sad “i’m sorry honey, but you know the town rule at least one sacrifice has to be made” said your mother “and we choose you i’m sorry” said your father. <br>\r\nBut before they could leave you hear loud thumping on the ground and gently shakes the net you look up and there you see a male giant taller than forty men put together and you finally realize that you are no more than five inches compared to him the giant. <br>\r\nThe giant sits down Indian style and looks at you and you can see his huge, round belly hanging over his tight pants and shirt was too small for him to wear over his belly. “What is this?” he boomed grabbing the net to look at you closer. The giants eyes was as tall as you as the giant looks at you from head to toe. You gulp.  <br>\r\nThen he lets go of the net looks at your parent frozen at the spot, “this is not a meal of my liking it is too scrawny to full my belly,” he said. Suddenly you hear a loud rubble coming from the giant. The giant looks down at his huge belly and pats it gently. “Well sounds like my stomach agrees” said the giant. He looks at you and then your parents. Licking his lips he says, ”well I guess I’m going to have to you eat you too” your parents…</span></div></div>",
            "created":1282089540,
            "id":938154,
            "title":"you are trapped in a net "
        },
        "11":{
            "author_id":"khlover369",
            "author_name":"KHL",
            "choices":[
                "you refuse to be eaten",
                "you accept your fate"
            ],
            "content":"<div class=\"\"><div> <span>Try to run, but the giant was too fast for them. You sit in your little net terrified for your parents are caught in the giant’s hand. <br>\r\nYou watch them trying to struggle free, but to no success the giant slowly moves his hand towards his mouth with your parents in it. <br>\r\nYou scream, “no don’t please,” but you were too late and the giant has both your parents in his mouth. You watch as the giant tastes them very carefully so to savor the flavor. He lifts his head and then swallows. You see the a huge lump in the giant’s throat knowing your parents are slowly going to their deaths. <br>\r\nThe giant uses his finger to trace where your parents are. The lump disappears, but the giant traces your parents pass his chest and into his stomach once there he pats his belly and rubs it gently. You look at the giants belly knowing that your parents are now the sacrifices. <br>\r\nThe giant lets out a satisfied belch. \"buuurp!\" “Ahh, they really hit the spot” said the giant patting his now bigger belly and then looks at you with hunger in his eyes. <br>\r\n“Please,” you plead, “please let me go, you had two sacrifices from this town that’s one to many, please let me go.” Giant thinks for a moment then says, “no, I don’t think so, after having your parent as a meal,\" he said licking his lips, \"you shall be my desert”  he pulls out a pocket knife from his back pocket and cuts the net at the top, puts a hand under you, he then grabs the other side of the net letting you roll out of the opening and on to his hand trembling. <br>\r\nYou stare at the giant and you say once again to that hungry look in his eyes pleading you say, “please I beg of you let me go, please don’t do this, please don’t eat me.” The giant smiles and says, “but you'll be with your parents again and till the very end of your life and theirs,” <br>\r\nYou look at the giant’s belly and you can see signs of a struggle in from within the giant’s belly “Oh” you say “I…”</span></div></div>",
            "created":1282092420,
            "id":938187,
            "title":"try to run"
        },
        "111":{
            "author_id":"khlover369",
            "author_name":"KHL",
            "content":"<div class=\"\"><div> <span>“refuse to be eaten please put me down” you say angrily, but the giant had other plans “sorry, but you gave my the wrong answer my tasty, little morsel” suddenly the giant’s hand jerks forward and you fly into his mouth you scream “no don’t do this, please don’t eat me” but the giant ignores you and you are being tasted as the giant’s tongue presses you to the roof of his mouth and rolls you over and over. Finally you stop rolling and everything is still then the giant lifts his head and swallows you. You head for the back of the throat you try to struggle free, but to no avail you are pushed down the throat and finally land in the stomach it’s wet and very humid you turn around to see your parents passed out on the stomach walls you run to the walls and beat the stomach walls as hard as you can. The giant rubs his belly and belches loudly “buuuuuurp!!! Mmmmm you taste better than your parents did” the giant said and patted his belly and the giant laid down on his back with one hand gently rubbing his belly as he fell asleep. You later pass out from lack of oxygen lie next to your parents as the three of you get digested together<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1282092480,
            "id":938189,
            "title":"you refuse to be eaten"
        },
        "112":{
            "author_id":"giantstorylove",
            "author_name":"Hannah Michelson",
            "choices":[
                "He keeps you as a pet",
                "he adopts you ",
                "he dates you. but you live with him"
            ],
            "content":"<div class=\"\"><div> <span>\"...I g-give up!\" You cry. The giant looks at you. \"Seriously? You're just giving up? You're not even going to try and fight?\" You nod your head, with tears falling freely. \"Well..., I think I'll take you home with me.\" \"W-what?\" \"The giant takes you home with him. \"I wanna get some things straight. I've kinda been watching you and your parents. They tricked you. So, I decided to eat them.\" \"A-are y-you s-st-still gonna eat me?\" \"I don't know. Probably not. Besides, you're pretty cute. I don't know whether I want to adopt you, keep you as a pet, or date you.\" You blush. \"What do you think?\" \"... W-what e-ever you d-decide t-to do.\" \"I have decided not to eat you. So, you can choose.\" \"Thank you. I choose...</span></div></div>",
            "created":1331497080,
            "id":1292787,
            "title":"you accept your fate but..."
        },
        "1121":{
            "author_id":"giantstorylove",
            "author_name":"Hannah Michelson",
            "choices":[
                "the next day"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok. In order to be my pet, you have to follow rules. You are to stay quiet when I have company over. I really don't want you to get stepped on, stolen, eaten, or anything. You are to eat the same food I eat. Until I find a bed good enough for you, you'll have to sleep in my bed. I'll try not to invite the evil giants over. I do have some gentle friends.\" \"S-so what about the sacrifices?\" \"*sighs* ...I'll still have to do that. But, I'll have you stay here.\" You nodded. \"You like the rules?\" \"Yea. I'm ok with them.\" \"I promise you I will NEVER hurt you, eat you, let you starve, etc. I will keep you fed, safe, happy, etc.\" \"I like the sound of this.\" The giant gives you a hug.</span></div></div>",
            "created":1331694300,
            "id":1294404,
            "title":"He keeps you as a pet"
        },
        "1122":{
            "author_id":"giantstorylove",
            "author_name":"Hannah Michelson",
            "choices":[
                "the next day",
                "later"
            ],
            "content":"<div class=\"\"><div> <span>\"I've always wanted a daughter. But I didn't want to get married. Are you ok with having a single, (and giant) father?\" \"I-I guess. I'm still gonna have to get used to this.\" \"I know. School... what am I gonna do about your education?\" \"Everyone knows I was sacrificed. And, I-I don't want to go to a school with giants.\" \"Well, we'll worry about that later. Tomorrow, we'll go get you clothes, a bed, and a few 'other' things. If you know what I mean.\" \"...Yea. Heh.\" You say embarrassed. You're beginning to like this idea.</span></div></div>",
            "created":1331693100,
            "id":1294397,
            "title":"he adopts you "
        },
        "1123":{
            "author_id":"giantstorylove",
            "author_name":"Hannah Michelson",
            "choices":[
                "the next day",
                "later"
            ],
            "content":"<div class=\"\"><div> <span>You look into the giant's eyes. \"You're eyes.. are so...\" \"Dreamy? Beautiful?...\" \"All of the above.\" \"You're not so bad yourself. You're pretty cute.\" Your cheeks turn scarlet. \"You will live with me, you and I will share a plate of food, you and I will share the bed, and so on and so forth.\" \"Yes sir.\" \"Sweetie, you don't need to call me sir.\" \"S-sorry.\" \"Shh. It's ok. I'm not mad. I love you.\" \"I love you too.\" </span></div></div>",
            "created":1331695440,
            "id":1294417,
            "title":"he dates you. but you live with him"
        }
    },
    "info":{
        "author_id":"khlover369",
        "author_name":"KHL",
        "brief_description":"You are living with your parents in a town that makes sacrifices so they choose you!",
        "created":1282079100,
        "description":"<td align=\"left\" class=\"norm\">You are about to be sacrificed to a giant, but you don't know it yet!</td>",
        "id":1700063,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1331695440,
        "modified":1331695440,
        "pretty_title":"The Giant Sacrifices  "
    }
}