{
    "chapters":{
        "1":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "Red (6 inches)",
                "Blue (3 inches)",
                "Green (1 inch)",
                "Black (1/8 inch)",
                "Clear (readers choice) "
            ],
            "content":"<div class=\"\"><div> <span>Driving down the ocean side highway, trying to go just fast enough so the police wont pull you over, you look at the clock and see it's already 8:13 in the evening. Alex and Kate wanted to throw one last summer party before the school year started. It would be the last time they could all get together, seeing as Amber and Dave would have to get back into their dorms for orientation, Jennifer would be going back and teaching the ungrateful high school students for another year and even Kevin might be starting a teaching job he was offered by the local college after his and Jessica's newest breakthrough on a chemical that would grow hair 30% thicker <br>\r\n<br>\r\nDamn! You yell to yourself.<br>\r\n<br>\r\nI can't believe i'm late, again. <br>\r\n<br>\r\nThere was nothing you could do about it, you had a deadline to meet and you were the only employee who actually cared to get it done. You always seemed to be the one pulling all the weight or helping others out. It was just in your nature, which led to a life of stress and having hardly any time for being social. Which is why you were annoyed that you were late to the party. It was the one time you could cut loose, and just enjoy yourself. <br>\r\n<br>\r\nThe possibility of watching your friends go wild was just an added bonus. Kate getting drunk and hitting on every guy their, much to the dismay of Alex. One time she even started giving you a lap dance in a bar. <br>\r\n<br>\r\nRecalling the stool you were sitting on your elbows laying across the bar, smirking as Alex and Kate were getting into one of their classic arguments, Alex saying something about being far to \"friendly\" brushing her body against other men and women on the dance floor. I mean she was wearing a pretty tight red dress, where the neckline went all the way down to the underside of her ample bust and the thigh high slit showing off her well toned legs. <br>\r\n<br>\r\nShe got so mad  at Alex she simply walked over to me, kissed me on the neck,her silky brown hair caressing my face and started grinding her breasts up and down my torso. This of course led to a variety of responses. Alex dragged her off as Amber and Dave laughed hysterically. Amber more so noticing my bodies involuntary response to having a pair of double D's pressed against me. <br>\r\n<br>\r\nAmber quickly coming over and offering to \"help\" me with my situation, winking rather playfully as she tried to contain her laughter. Amber was quite open with her flirting and open to swinging with several guys, even while Dave was around so I had no idea at the time what she meant, as she turned around and said \"want me to sit on it\" she said with a smirk, now not that I was opposed to it, because even though she was quite thin she still have a very well rounded backside...I had half a mind to grab her small shoulders and go with what she seemed to be offering, which is when we were both snapped out of our fun by Jessica.<br>\r\n<br>\r\nShe was always the serious one, even in that bar while everyone else was dancing,in skimpy or barely dressed outfits, she clad herself in a loose sweater and jeans. She was a bit irked at the whole display between me and Amber and before Kate. Half wanting to maybe to join and half out of hearing her husband brag about *his* new breakthrough in plant growth stimulation. After breaking me and amber apart she went back to sit with her husband Jennifer and Craig. I could not help but watch her walk away and enjoy the view, I mean sure she always covered herself rather well, but you could tell even with her, as she described it, average build, she was quite good looking. <br>\r\n<br>\r\nYou simply kept watching that night Alex and kate getting into another argument, Amber and Dave practically having sex in the booth Jessica having to restrain herself as Kevin droned on and on about his accomplishment. While Craig was trying to finish up paperwork, and Jennifer was trying to coax him into dancing all night, unsuccessfully.   <br>\r\n<br>\r\nI decided to be a little help towards Jennifer and offered to go out on the dance floor. A bit annoyed with Craig she sighed and walked out with me and we started to dance, rather embarrassingly on my part, which made Jennifer giggle as she too just bopped around, her body jiggling to the beat.Only once looking back over at Craig who still had his head buried in legal documents. I think he's no longer interested in me she said with a slight frown....I think it's because I put on weight since we got married, what do you think? <br>\r\n<br>\r\nNow as any well mannered male with an ounce of common sense would know, you never bring up a woman's weight or even comment on it, I mean granted Jennifer was not as slim as Amber, or hourglass shaped like Kate, but she was by no means obese, but she did have a few extra pounds...I simply answered the only way I could...Nah that's not it at all.<br>\r\n<br>\r\nMy pleasant stroll down memory lane was quickly halted as I made the turn down the road which Alex's manor was on. I kept thinking about all the fun I had already missed being more than 2 hours late. <br>\r\n<br>\r\nKate probably was already drunk and laying into anyone she could<br>\r\nJessica already annoyed with Kevin's stories about how brilliant *his* breakthroughs were<br>\r\nAmber and Dave...doing each other<br>\r\nand Jennifer sitting alone while he workaholic husband had his nose in paperwork<br>\r\n<br>\r\nI pulled up to the daunting house, just looking at a place that big was overwhelming, decorative balconies adorned each of the three main floors with the roof slanted in for the attic and at the top a widows walk which looked out over the ocean and I noticed a something strange...it was quiet. Usually there would be music blaring at one of our events. I shrugged my shoulders and rang the doorbell. Musical chimes sang out to announce my presence, followed by a clambering of feet down a staircase and across the floor, female voices chattering to each other incoherently.<br>\r\n<br>\r\nFinally Kate's voice rang out \"come in\"<br>\r\n<br>\r\nI opened the door and was surprised to see only the girls standing in the large marble floored foyer, two rounded staircases leading to the second floor with a living parlor room with a solid oak bar behind the women, It was always a sight seeing this place, but what caught my eye next was just odd. <br>\r\n<br>\r\nKate Jessica Jennifer and Amber all dressed in rather varied attire. Kate wearing the very red dress she had on in the bar that night...I felt my blood rushing to my head at the mere recall, so I quickly averted my head to Jessica who was wearing a thick cotton robe with the sash undone, her hair dripping wet. Amber was wearing what looked like a child's get up a tight tie dye shirt and cut off jeans, which barely held in her ass, and even though her breasts were smaller, you could tell with the tight shirt she was not currently wearing a bra, and for some reason she was squirming around and giggling as though she was being tickled. You let out a cough which was just to clear your throat and you look at  Jennifer who was wearing a skimpy maid outfit. <br>\r\n<br>\r\nUm...so was this a costume party? was the first thing you let out seeing everyone's get up, followed by<br>\r\n<br>\r\nwhere are the guys?<br>\r\n<br>\r\nYou looked to the women all smirking at each other giggling almost maniacally under their breath. and Kate abruptly answered.<br>\r\n<br>\r\nWell, we are in the middle of the game, each of us are dressed as our character.<br>\r\n<br>\r\nand the guys? I quickly interrupted.<br>\r\n<br>\r\nKate, motioning to Jennifer, as she went back to the bar retrieving a tray with different colored drinks in shot glasses on it.<br>\r\n<br>\r\nLet's just say, some of them already lost, Kate said gloatingly <br>\r\n<br>\r\nand some of them are still in the game, Amber exclaimed in between a giggle and her squirming <br>\r\n<br>\r\nRather unsatisfied with that answer I simply ignored the absence of the other's for now, after all I was already late so I had no idea what could have happened in those two hours, for all I knew the guys were out back sulking that they lost. So how does the game work?I asked<br>\r\n<br>\r\nAs Jenifer came over with the tray, standing right next to me I saw four different colored drinks a red, blue, green, black and clear one, as Kate explained the rules. Basically as your character you have path to either win the game....or lose, along the way you will be given multiple choices to which you have to decide between, most of which will end badly for you.<br>\r\n<br>\r\nSeems rather vague, I interrupted<br>\r\n<br>\r\nKate, with a seductive glance and a hint of sexual desire in her voice simply stated. Don't worry, there will be plenty of hints along the way, and opportunities to make up for any mistakes.<br>\r\n<br>\r\nI look back at the drinks and Jennifer holding them as though offering me one I pick up the ________ one and quickly drink it, looking back at Kate and saying <br>\r\n<br>\r\nSo where is my costume and when do we begin.<br>\r\n<br>\r\nall the women in unison, smiled and everyone but Kate started walking away, who was walking toward me, as I started feeling a bit dizzy.<br>\r\n<br>\r\nWell, the game has already started, and....you don't need a costume, is all I heard Kate say before I lost my balance and fell to the floor.<br>\r\n<br>\r\nwhat was in that.....was all I could get out before I blacked out. needless to say I had no idea that I had already made my first choice.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1573586220,
            "id":2745792,
            "title":"Running late, the party begins. "
        },
        "11":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "you went strait, to Kate at the Bar.",
                "first left, Jessica in the bathtub ",
                "second left, Amber in the Play room",
                "Right, Jennifer cleaning the kitchen  "
            ],
            "content":"<div class=\"\"><div> <span>You slowly come to, feeling like you just woke up from an extended night of heavy drinking. The first thing you notice is the lack of light, you can barely see anything as your eyes start to adjust to the darkness. You soon make out what seems to be a metal ceiling, and then the walls and then the metal floor.Still coming to, you feel a slight chill in the air and stand up noticing that you are completely naked.<br>\r\n<br>\r\nWhat the hell!!! <br>\r\n<br>\r\nYou knew that being stripped naked was not the oddest thing in the world for your friends to do, but  this was the first time you had not woken up with at least one of them around when it happened. Slowly you get to your feet as your eyes begin to adjust a bit more, you can make out the ground which is covered in thick dust. You've been to this house plenty of times and have never seen this room, or any room like it. It was perfectly square and long, and you could not see the end of it. <br>\r\n<br>\r\nLooking around you see a large square yellow paper laying in the middle of the room and you can't believe the amount of dust gathered on the ground, like no one has been in this room in years, looking closer, you see prints in the dust, footprints. one that is the same size as you but others that are several times smaller.<br>\r\n<br>\r\nThe other guys?<br>\r\n<br>\r\nYou question yourself, thinking that there is no way anyone has feet that much smaller than you.<br>\r\n<br>\r\nprobably an animal or something, you reason.<br>\r\n<br>\r\nYou turn your attention back to the large paper, the writing is quite large, each letter almost the size of your hand, but in Kate's handwriting. It reads.<br>\r\n<br>\r\nYou have a choice of four paths ahead, better hurry before it's decided for you.<br>\r\n<br>\r\nDecided for me? What does that mean?<br>\r\n<br>\r\nWell I guess I better go along with the game.<br>\r\n<br>\r\nYou start down the large square hall, keeping your eye's on the footprints already made in the thick dust, the fact that their is only one that seems to be actual foot prints unsettles you, I mean those others can't possibly be from anyone here. You continue you walk and you see another large note in the distance, you quickly jog to it and see that it's just four arrows two pointing left, one pointing right  and on ahead, looking around you can see corridors to where each of the arrows are pointing. two of the smaller prints went to the right, one went to the first left and the last one the same size prints went to the 2nd left with no prints going toward the one strait ahead<br>\r\n<br>\r\nWell I guess I'll choose the  ______________<br>\r\n<br>\r\nAs you make your way down the path, you feel a slight chill in the air again, as a slight breeze starts to waft over you <br>\r\n<br>\r\nThat's weird, where would a breeze be coming from?<br>\r\n<br>\r\nThe breeze starts to grow stronger<br>\r\n<br>\r\nWhat in the world!!!!<br>\r\n<br>\r\nthe blast of air picks you up and tumbles you down the hall, unable to regain control you spiral forward like a leaf in the wind, seeing daylight ahead and a large slatted grate coming into view, you nervously flail as you see the grate coming closer and try to avoid hitting it.<br>\r\n<br>\r\nMercifully, the gust of wind stops and you somewhat harmlessly land back on the metal ground, near the opening. Quickly dusting yourself off and slipping through the slats to get out of this death trap, you are temporarily blinded by the bright light, as your eyes adjust...and you wish that they had not as you look around and see a normal room, but much much larger than normal....you come to understand the metal hallway you just exited was the heat vent, and that burst of air was filtration system turning on. <br>\r\n<br>\r\nThis can't be, this has to be some sort of trick <br>\r\n<br>\r\nA familiar voice from above chimes \"it's no trick' <br>\r\n<br>\r\nyou cover your ears at the booming noise, sounding like it's blasting on a surround sound speaker system, you look up an a sudden terror come over you, as you are standing near a giant.....</span></div></div>",
            "created":1573589520,
            "id":2745808,
            "title":"Red (6 inches)"
        },
        "12":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "Strait to Kate at the bar ",
                "2nd left, amber in the playroom ",
                "1st left Jessica in the bathroom ",
                "right, Jennifer cleaning the kitchen "
            ],
            "content":"<div class=\"\"><div> <span>You slowly come to, feeling like you just woke up from an extended night of heavy drinking. The first thing you notice is the lack of light, you can barely see anything as your eyes start to adjust to the darkness. You soon make out what seems to be a metal ceiling, and then the walls and then the metal floor.Still coming to, you feel a slight chill in the air and stand up noticing that you are completely naked.<br>\r\n<br>\r\nWhat the hell!!! <br>\r\n<br>\r\nYou knew that being stripped naked was not the oddest thing in the world for your friends to do, but  this was the first time you had not woken up with at least one of them around when it happened. Slowly you get to your feet as your eyes begin to adjust a bit more, you can make out the ground which is covered in thick dust. You've been to this house plenty of times and have never seen this room, or any room like it. It was perfectly square and long, and you could not see the end of it. <br>\r\n<br>\r\nLooking around you see a large square yellow paper laying in the middle of the room and you can't believe the amount of dust gathered on the ground, like no one has been in this room in years, looking closer, you see prints in the dust, footprints. One that is twice the size of your own feet, two that are the same size and one that looks half the size of your own <br>\r\n<br>\r\nThe other guys?<br>\r\n<br>\r\nYou question yourself, thinking that there is no way anyone has feet that much bigger or smaller than you <br>\r\n<br>\r\nprobably an animal or something, you reason.<br>\r\n<br>\r\nYou turn your attention back to the large paper, the writing is quite large, each letter almost the size of your head, but in Kate's handwriting. It reads.<br>\r\n<br>\r\nYou have a choice of four paths ahead, better hurry before it's decided for you.<br>\r\n<br>\r\nDecided for me? What does that mean?<br>\r\n<br>\r\nWell I guess I better go along with the game.<br>\r\n<br>\r\nYou start down the large square hall, keeping your eye's on the footprints already made in the thick dust, the fact that their is only one that seems to be actual foot prints unsettles you, I mean those others can't possibly be from anyone here. You continue you walk and you see another large note in the distance, you quickly jog to it and see that it's just four arrows two pointing left, one pointing right  and on ahead, looking around you can see corridors to where each of the arrows are pointing. two of the same size prints went to the right, one went to the first left and the last one the larger size prints went to the 2nd left with no prints going toward the one strait ahead<br>\r\n<br>\r\nWell I guess I'll choose the  ______________<br>\r\n<br>\r\nAs you make your way down the path, you feel a slight chill in the air again, as a slight breeze starts to waft over you <br>\r\n<br>\r\nThat's weird, where would a breeze be coming from?<br>\r\n<br>\r\nThe breeze starts to grow stronger<br>\r\n<br>\r\nWhat in the world!!!!<br>\r\n<br>\r\nthe blast of air picks you up and tumbles you down the hall, unable to regain control you spiral forward like a leaf in the wind, seeing daylight ahead and a large slatted grate coming into view, you nervously flail as you see the grate coming closer and try to avoid hitting it.<br>\r\n<br>\r\nMercifully, the gust of wind stops and you somewhat harmlessly land back on the metal ground, near the opening. Quickly dusting yourself off and slipping through the slats to get out of this death trap, you are temporarily blinded by the bright light, as your eyes adjust...and you wish that they had not as you look around and see a normal room, but much much larger than normal....you come to understand the metal hallway you just exited was the heat vent, and that burst of air was filtration system turning on. <br>\r\n<br>\r\nThis can't be, this has to be some sort of trick <br>\r\n<br>\r\nA familiar voice from above chimes \"it's no trick' <br>\r\n<br>\r\nyou cover your ears at the booming noise, sounding like it's blasting on a surround sound speaker system, you look up an a sudden terror come over you, as you are standing near a giant.....</span></div></div>",
            "created":1573589820,
            "id":2745810,
            "title":"Blue (3 inches)"
        },
        "121":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "Go along and play the game.",
                "Refuse. "
            ],
            "content":"<div class=\"\"><div> <span>Looking up, taking in the vast wall of red covering sensual curves.<br>\r\n<br>\r\n Stopping for a moment, to catch a glimpse of the largest pair of breasts that you not only have ever seen, but ever even imagined. barely enclosed by the very low neckline, both heaving up and down with each breath that woman they were attached to took. Feeling the blood rushing to your head and are immediately taken out of your trance by the booming voice from above.<br>\r\n<br>\r\nHey!! My eyes are up here little man.<br>\r\n<br>\r\nJerking your head up, somewhat embarrassed at your prolonged staring at the large amounts of exposed female flesh. Seeing Kate's looming face staring down at your nude body. A smirk goes across her face as jingles a small glass of ice and the remnants of a drink. <br>\r\n<br>\r\nQuickly regaining some composure, covering yourself, and stand to your feet, not knowing what to say. Looking around you,  seeing that you are standing on a long wooden mass, with a drop off on either side, the strong smell of alcohol surround you, looking past Kate, to see a billiards table, coming quickly to the understanding that you are standing on top of the bar. Your observations being interrupted momentarily by Kate moving her massive arm, looking more like a crane, setting the glass she was holding down on the bar next to you.You instinctively jumping out of the way and a bit frustrated at Kate's lack of care. While picking yourself up, you hear her voice from above one more. <br>\r\n<br>\r\nI was wondering If I would ever get to participate in the game.<br>\r\n<br>\r\nGame!!!! you shout back.<br>\r\nWhat the hell is going on here!!! Where is everyone else!!!and why are you so damn huge!!!<br>\r\n<br>\r\nHer eyes narrow, and a smile once more comes back to her face, she slowly leans in, causing you to take a few steps back, as her face quickly comes closer, her breasts pressing against the wooden surface just feet from you, feeling the heat radiating from her body, the subtle smell of alcohol on her breath, it wafts over you like a warm breeze. You had not really realized till now the immense size difference between you, maybe out of shock or maybe simply out of being overwhelmed that you have one of having hot air balloon size breasts looming nearby. Swallowing hard rethinking for a moment yelling like that, as you see Kate's hand soaring over to you, a single finger nearly the same size as your whole body, juts out toward you and gently pokes you in the stomach, as Kate slowly runs her massive digit up and down your torso.<br>\r\n<br>\r\nSoftly Kate starts speaking<br>\r\n<br>\r\nThis is the game sweety, as I told you before you will be given multiple choices to move through the game, your first choice was which drink you took, to determine what size you shrank down to.<br>\r\n<br>\r\nhearing those words you now understood that those other footprints in the heat vent were indeed those of the other guys and that it was you that got smaller. <br>\r\n<br>\r\nKate continued. <br>\r\nThe way the game works, is that you will have to decide between multiple choices that are given to you along the way.Your choices will determine your fellow characters responses. If you manage to choose correctly,and pass each stage, you'll win and reach the antidote in the attic, and don't worry, even though there are many ways to lose in this game for you, you can always get out of a jam with a hint<br>\r\n<br>\r\npressing her opposite hand against her face to try and cover up a small laugh <br>\r\n<br>\r\nBut those hints will cost you. <br>\r\n<br>\r\nSlightly worried about what losing this game would mean.<br>\r\n<br>\r\nWhere are the other guys?<br>\r\n<br>\r\nKate's smile turned into a bit of a scoff as she took her finger away from your chest and leaned back up, hearing the clicking of her shoes over the edge of the bar as she stood up, the wall of red dress rising into the air and her face partially becoming obstructed by her chest. she stepped back and motioned down to where she was sitting. Taking another large gulp, fearing what I would see, I slowly step to the edge, the rim of the stool she was sitting in coming into view, a few more steps closer and I saw it, the unmistakable red smear of a body that had been crushed. <br>\r\n<br>\r\nMy eyes widened, the horror and shock shooting through my body as a hundred thoughts went blazing through my head.<br>\r\n<br>\r\nThat, was Alex.....he chose incorrectly. she said rather coldly.<br>\r\n<br>\r\nFalling backward onto the bar, not only had you just learned that one of your best friends had died, but that your own life was in extreme peril. Overwhelmed with anger grief and terror, the only thing  you could muster to ask was. Why? <br>\r\n<br>\r\nBecause we were sick of our husbands, kate interjected.<br>\r\n<br>\r\nAlex, always trying to cage me in, Kevin always taking credit for Jessica's work, Jennifer wanting some excitement and to not constantly be ignored...and well, Amber just thought it would be kinky. We could no longer take the rut we all were in, we wanted out and...we figured why not have a little fun while doing it. So when Jessica came to me and said she had developed a serum that could reduce the mass of living tissue...well, that's when we came up with the plan to have this game night. Make our men feel what it's like to be trapped belittled and hopeless!!!<br>\r\n<br>\r\nKate, took a deep breath and regained her composure<br>\r\n<br>\r\nAt least we gave them a chance to win-she said walking around the bar. Simply watching in amazement as her colossal figure moved so gracefully, trying not to stare as her breasts jiggled about in the revealing dress. Blushing once again along with other involuntary bodily actions. Kate taking notice as she bends over to grab a bottle of alcohol, making sure she stays at the right angle so you can get a full glimpse of her canyon of cleavage. She had always been a tease, but being a tease and being 100 times her normal size was quite overwhelming. Kate taking notice of this <br>\r\n<br>\r\nI would not be too worried though,she stated as she was refilling her glass, the liquid pouring out more like a waterfall to you.<br>\r\n<br>\r\nAll the girls have had a thing for you,so we might be a bit more lenient with the rules. <br>\r\n<br>\r\nSetting the bottle down, she grabs her glass and once more walks toward you, leaning her body over you, the shadow of her bust engulfing your entire form. <br>\r\n<br>\r\nStepping back a few feet just to be able to see Kate's face. as she purses her lips and takes a sip of her drink <br>\r\n<br>\r\nI'm sure it comes as no surprise to you, that I've always found you quite attractive.<br>\r\n<br>\r\nHer glaring eyes run up and down your body as her hand slips across the bar, inching it's way to you, lifting her index finger up to playfully flick your manhood <br>\r\n<br>\r\nAnd I can see the feeling is mutual. <br>\r\nFeeling the lust in her words, and in your current predicament you could do nothing to stop or initiate any sort of response, you were helpless and still trying to put the last few minutes into context. You are barely 3 inches tall, in a life or death game with at least one colossal woman who could end your life in an instant. A woman who had just murdered one of your closest friends but who seems to what to play with you, in more ways than one. You could simply refuse to play along and demand the antidote right now, or you could simply see where this goes, who knows, maybe it could be fun. <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1573769880,
            "id":2746812,
            "title":"Strait to Kate at the bar "
        },
        "1211":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "A game of billiards (pool) ",
                "Out on the dance floor ",
                "A drink "
            ],
            "content":"<div class=\"\"><div> <span>Stepping back from Kate's teasing finger, deciding to start getting through this game.<br>\r\n<br>\r\nAlright Kate, what are my first options?Trying to not have your voice crack.<br>\r\n<br>\r\nWith a slight frown, Kate pulls her hand away. and sets her glass down next to you. Like before with her body heat  cold coming off the glass,is easily noticed and with not wearing anything, the chill is magnified.  <br>\r\n<br>\r\nAlright little man, your first three options with me are. A game of billiards, a dance, or a drink.<br>\r\n<br>\r\nPausing for a moment, thinking about each of theses options, a game of pool at this size would be next to impossible, the balls are as big as you are, dancing does not seem like a very hard option, I mean it's just dancing, although you could use that drink, calm your nerves a little bit, after everything you have just had to deal with. </span></div></div>",
            "created":1573770540,
            "id":2746816,
            "title":"Go along and play the game."
        },
        "12111":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "Go to the next stage with out the hint",
                "Take the hint, you can dodge a few more of these balls. "
            ],
            "content":"<div class=\"\"><div> <span> Shrugging, not really knowing what to think about these options and just blurt out the first one. <br>\r\n<br>\r\nI guess i'll go with the game of pool.<br>\r\n<br>\r\nI mean you figure you'd just be rolling the balls around or something into the holes for Kate's amusement, which would be a workout but nothing you could not handle, you estimated the balls would be around 200 lbs each at your current size, but being round they would be easy to move, maybe a little difficult to maneuver, but you would eventually get them in the holes.<br>\r\n<br>\r\nKate raised an eyebrow, and let out a slightly intrigued Hmm. <br>\r\nGuessing she thought you would have chosen differently <br>\r\n<br>\r\nAlright then, pool it is little guy. She said with a half smile. <br>\r\n<br>\r\nStaring up at her, hoping you chose correctly, in the back of your head understanding that the wrong choice could mean certain death, but that half smile did give you some measure of comfort, out of the corner of your eye you saw Kate's hand, reaching over to you, rather quickly. The best way to describe what it felt like was if a giant squid was swimming at you,at immense speed  tentacle ready to wrap you up. You froze still as her fingers enclosed around your body, feeling the warmth of her flesh against your own,it was both comforting and terrifying being secured, tightly in her grasp and if she were picking up a small pet. <br>\r\n<br>\r\nthe next sensation was not nearly as pleasant, as she lifted you into the air, you felt your feet leave the security of the ground and just dangle underneath you, as you shot up with the same feeling as an amusement park ride, trying not to get sick as you rose past her stomach and stopped eye level with her chest. She drew you close to her breasts, almost as if she was going to drop you between them, but just stopping your body a few inches short.<br>\r\n<br>\r\n Hearing her let out a soft giggle as she started walking toward the pool table, her breasts reverberating with each step,  mesmerized by the soft orbs bouncing around in her dress, and she knew it. She was always a tease, and knew how to use her best assets, and she was taking full advantage of your current position.<br>\r\n<br>\r\nRegaining your composure, once again after being hypnotized you jolt your head up, seeing Kate staring down at you biting her lip.You once more felt a rush inside your body which was furthers by her next words.<br>\r\n<br>\r\nTell you what, if you make it past this round, i'll give you a little treat.<br>\r\n<br>\r\nYour heart fluttered,feeling your face grow red, your mind racing with sensual thoughts, about what she could mean by that, mind was racing so fast you barely realized that Kate was moving her hand down and away from her body, setting your feet down on the felt surface of the pool table, her fingers releasing you from their clutch. Nearly falling over from all the vertigo, going up and down so quickly, not to mention the blood which was not flowing to your brain at the moment.Watching Kate turn away and walk to the wall where the pool cues were hanging. <br>\r\n<br>\r\n It took a moment to realize that she had placed you on the pool table, the numbered balls at your back were already set up, and to your front, the cue ball, your body placed in a position that seemed to be half way in between both. Turning over to Kate to watch as she grabbed the first pool cue and start walking back to the table. smirking down at you she nonchalantly gave you a rather stark warning.<br>\r\n<br>\r\nThat's if you make it past the first round. <br>\r\n<br>\r\nShe, took the cue in hand and bent over the table, her breasts pressing together as she leaned over examining the table and lining up her breaking shot. Your eyes widened, coming to the realization that you were not going to be playing pool, so much as trying to survive it.<br>\r\n<br>\r\nWait a second!! <br>\r\n<br>\r\nKate stopped mid motion, and gave an exclamation as to say she remembered something,<br>\r\n<br>\r\nMy bad, she started<br>\r\nI didn't explain the rules.<br>\r\nWell, all you have to do is dodge. If you are still alive by the end of three shots, you win. Simple.<br>\r\n<br>\r\nTaken aback by the casual nature of that statement but you did not have time to dwell upon it, as Kate got back into position, taking a few practice shots and then striking the cue ball, the sphere quickly baring down on you. Jumping out of the way, feeling the reverberation of the ball passing you, the sound much like that of a car passing by, landing on your stomach, Feeling as though you may have dodged a bullet. <br>\r\n<br>\r\nYour momentary relief turning to panic, as a thunderous clack of the balls rang through your ears, the giant spheres being set in motion and scattering around the table, two were headed in your direction, you jump to your feet and roll out of the way of the solid yellow ball and avoid the green striped by rolling left. Your heart pounding as everything on the table stops.<br>\r\n<br>\r\nSo far so good, you managed to live past the break. <br>\r\n<br>\r\nKate, sounded rather impressed with that as she started walking around the table, keeping an eye down on you getting to your feet. <br>\r\n<br>\r\nI have to say I'm happy that you decided to go along with the game, Alex refused to go along with it.<br>\r\n<br>\r\nKate hunched over the table once more, you could see the cue ball ball on the far side of the table from you, with several balls in between.As Kate continued to talk.<br>\r\n<br>\r\nI mean, he even lucked out, landing with Jennifer to start the game. But he just refused to go along with it.<br>\r\n<br>\r\nI tried to listen to Kate's words, but I was again preoccupied with trying not to die as she took her second shot, luckily the only ball that came my way fell into the side pocket with a large thud, as I breathed a sigh of relief. <br>\r\n<br>\r\nWhich is why I had to punish him. She paused a moment as she walked over lining up the next shot, the cue and eight ball, lined up directly aimed at where I was.<br>\r\n<br>\r\nI mean don't get me wrong, I gave him plenty of opportunities to either play the game or face the penalty, but you know how me and Alex never can settle an argument until one of us walk away.<br>\r\n<br>\r\nHalf paying attention to Kate's words and her movements it made perfect sense that Alex would refuse to go along with this whole thing, after all her was use to being in control, or at least use to trying to control everything, including Kate, the thought of having to take orders and listen to anyone tell him what to do, must have been an annoyance to him, and in the position he was in at that moment, it's no wonder that he ended up a smear on a bar stool. <br>\r\n<br>\r\nWhich is exactly what you were trying to avoid becoming as kate took her last shot, the eight ball darting to the left of you, thinking you were safe, until you heard the unmistakable clack of two balls colliding, sending one barreling toward your direction. Panicking, you simply try and out run the ball, getting flashback of Indiana Jones trying to outrun a boulder, looking dead ahead at the corner pocket getting closer as you sprint away, dodging at the last second to avoid being crushed, watching the ball vanish into the hole.<br>\r\n<br>\r\n Laying on the felt surface and breath a sigh of relief, knowing the task was done.Hearing a rather joyful giggle from Kate.<br>\r\n<br>\r\nCongratulations, you made it through the first round.<br>\r\n<br>\r\nA bit out of breath you simply look up toward Kate and give her a thumbs up, as you watch her lean over the pool table with the cue stick once more, as though she was going to take another shot.<br>\r\n<br>\r\nNow then, she said with an almost sadistic tone. You have another choice to make.<br>\r\n<br>\r\nRealizing you were safe...somewhat, for the moment, you stand to your feet as Kate continued.<br>\r\n<br>\r\nYou can either choose to move onto the next round, not knowing what you might get into, or I can give you a hint and make the next round a bit easier for you to pass, but you will have to survive more of this game. <br>\r\n   </span></div></div>",
            "created":1573957380,
            "id":2747681,
            "title":"A game of billiards (pool) "
        },
        "121111":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "onto the next challenge. "
            ],
            "content":"<div class=\"\"><div> <span>Deciding not to try your luck any more on the pool table and avoid having to dodge any more of the boulder sized balls. You get to your feet and yell up to Kate .<br>\r\n<br>\r\nI think I'll just move on to the next round, if that's ok.<br>\r\n<br>\r\nYou start to walk to the middle of the table closer to Kate, anticipating her picking you up again. she gives a slight sign of joy and happily states.<br>\r\n<br>\r\nGood choice....but.<br>\r\n<br>\r\nYou freeze, but, is not the word you wanted to hear right now, not in a game where the wrong choice could end up getting you killed. You look up at Kate still with a smile on her face, as she set the pool cue down, which somewhat calmed your nerves for the time being. You watch as she once again, gracefully moved her tree limb of an arm, with the grace of a ballet dancer, her hand closed say for her outstretched index finger which, lightly jabbed you in the chest, Kate playfully running the tip of her finger up to your chin and forcing your head upward to look at her.<br>\r\n<br>\r\nShe leaned over, making sure the line of sight between where she was aiming your head was directly toward her massive cleavage As she said in a soft sensual tone.<br>\r\n<br>\r\nI did promise you a little treat. Didn't I. <br>\r\n<br>\r\nThe one thing I had always known about Kate is, she may be a tease but eventually she will try to pay off her tantalizing torture, and now without anyone to hold her back she was not going to renege on all her seductive play. Lowering her finger down to your chest she gently pushes you onto your back pinning you for a moment against the table. as she let out a moaning <br>\r\n<br>\r\nMmmmmm, such a good easy going man, she mused.<br>\r\n<br>\r\nYou wont question the desires of a woman, you simply go along for the ride, and enjoy it.<br>\r\n<br>\r\nHer finger began to run down your chest and stomach, stopping for a moment above your manhood, which was already at attention.<br>\r\n<br>\r\nMmmmmm, and so attentive too.<br>\r\n<br>\r\nShe giggled, lifting her hand away, she glanced down at you, seduction in her eyes, placing her hands on the pool table, she leaner over the table, her face coming within  inches of your body, watching as her breasts pressed into the felt causing a small tremor as her weight knelt onto the surface, her warm breath wafting over you once more.<br>\r\n<br>\r\nYou know, I told you before all us girls have had a thing for you...and now that Alex is gone...maybe after this..we could have a lot...more..fun.<br>\r\n<br>\r\nYou could feel the passion in her words, as each puff of air literally washed over your body, before you could form a response, Kate knelt in her lips pursing, and the soft flesh pressed in against you, your face fully encompassed in the warm embrace of Kate's lips, as all you could do was enjoy the pillowy envelopment , you tried to kiss back, unsure if she could even feel your minuscule gesture. You just lay there for a moment, enjoying the warmth, until she pulled her face back up. And just was still, both of you staring at each other. <br>\r\n<br>\r\nKate's eyes narrowed, enjoying the sight of my arousal, feeling proud that even with the daunting difference between us, she could so easily turn me on. She lifter her body up and I watched as her face moved past me, I saw her body float by like a parade balloon, her chin passing over my body and then her neck. I leaned my head upward, looking forward to see her breasts, just barely above the surface of the pool table inching their way closer to me, her dress glistening about like a cloud of scarlet holding in the ample bosom. Kate looking back down at me, to ensure her breasts topped just above my body. <br>\r\n<br>\r\nOnce again mesmerized by her sensual curves, her breasts loomed over me, just hovering above, within my reach, as though to tease me with their soft vastness of silky smooth flesh. <br>\r\n<br>\r\nKate cooed from above me<br>\r\n<br>\r\nReady or not<br>\r\n<br>\r\nShe slowly lowered her breasts down onto me, my body easily covered by from head to toe,as everything went dark I felt the softness of her breasts press against me, the warmth of her bosom engulfing me as my entire body was compressed into her skin, the pillowy flesh conforming around my body. I began to squirm a little, wanting to take full advantage of this opportunity, grabbing handfuls of tit, gently squeezing mounds of supple skin as I felt the walls squeeze around me and my body quickly become vertical again.<br>\r\n<br>\r\nI could feel something push against my back, gliding me along Kate's breasts, my face body nearly being smeared against the smooth surface, everything become visible once more as my head poked out from Kate's cleavage, and saw her hand, pushing me deeper and more securely between her massive boobs.<br>\r\n <br>\r\nI looked up blushing, seeing her with a full open mouth smile, rather enjoying toying with me in her cleavage. <br>\r\n<br>\r\nEnjoying yourself? she asked rhetorically <br>\r\n<br>\r\nshe glided her hands to either side of her breasts and gave a slow gentle squeeze, compressing her tits together and engulfing me, rolling her breasts and my entire body between them around for a few moments until she let her breasts settle, my body still firmly pressed between them. <br>\r\n<br>\r\nshe kept on smiling as she started walking out of the game room, each step jostling her breasts in her dress, jiggling my body back and fourth in an almost rhythmic swaying, my face, slamming into walls of tit. All she said  to me as she walked down the hall <br>\r\n<br>\r\nOn to your next challenge. </span></div></div>",
            "created":1573963680,
            "id":2747700,
            "title":"Go to the next stage with out the hint"
        },
        "121112":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "content":"<div class=\"\"><div> <span>Having just survived several rounds of the game already, and thinking that you could use all the help you could get in surviving what may come next, you figured it would be best to get a leg up in the game. So with a little bit of cockiness<br>\r\n<br>\r\nI think I can handle a few more round of dodging your shots Kate.<br>\r\n<br>\r\nKate simply nodded and bent over the table once more, saying in a somber tone<br>\r\n<br>\r\nVery well.<br>\r\n<br>\r\nShe took her next shot, aiming the cue ball right at you. Your eyes widening at the direct shot, but you roll out of the way as the cue ball bounces off the wall and clacks into a a pair of balls sending them rolling, You look back up and stand watching as Kate was already on the move and quickly in position to take another shot, the two balls the cue ball hit still in motion.<br>\r\n<br>\r\nOh shit!!<br>\r\n<br>\r\nis all you could get out as Kate took another shot, sending the cue into several balls at once, flying all around the table, you roll out of the way of one and nearly get grazed by another, you have no time to think as you once more hear Kate shoot the cue ball knocking around, you look up just in time to see a ball, heading strait for you leg, unable to move out of the way it hits you, causing your leg to bounce backward with a shooting pain <br>\r\n<br>\r\nGHAAAA!!!!<br>\r\n<br>\r\nYou fall on your face, and you can;t get up, the pain reverberating through out your body, and terror sets in as you hear one final smack of the pool cue, you hear the rumbling of the cue ball getting closer and closer to you, turning just in time to see the shadow of the white ball engulfing your head , as it crushed you.<br>\r\n<br>\r\n(GAME OVER). </span></div></div>",
            "created":1573958580,
            "id":2747684,
            "title":"Take the hint, you can dodge a few more of thes..."
        },
        "12112":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "content":"<div class=\"\"><div> <span>Not really understanding how you would play a game of pool at your size and currently a bit to nervous to possibly get drunk while the possibility of taking a wrong step of a bar meat dying. You decided to go with the dance option. <br>\r\n<br>\r\nKate, gave a small frown at this and let out an almost disappointed. Very well<br>\r\n<br>\r\nKate turned, and started walking away from the bar, affording you the opportunity to try and calm yourself down from the last few moments. Watching as Kate left the room momentarily, leaving you to wonder, how the hell this was all happening, was this a dream maybe? I mean it's not possible that people can be shrunk...then again, Jessica was brilliant, and all of this, from the solidness of the wooden bar beneath you to the heat radiating of Kate...it all felt too real to just be a dream. <br>\r\n<br>\r\nYour thoughts were interrupted, as you heard music start to play from the other room, Some rather familiar dance club music, that you all accustom to hearing when going out. Almost getting the sense that this was going to be like any other night, that illusion was quickly broken as a giant Kate started coming back into the room, already with her hands in the air, jirating her body to the music.<br>\r\n<br>\r\nHer breasts bouncing around with fervor, looking as though they might pop out of her dress. As she got closer with her rhythmic motions, the tremors from her dancing could be felt all the way up the bar. Just watching in a state of awe as this massive form of a woman moved with such ease, it would be picturesque, if not for the fact that she could accidentally kill you if her hand went the wrong way. <br>\r\n<br>\r\nKate, stopped for a moment, fixing her eyes upon you.<br>\r\n<br>\r\nAlright little man, here is your first task.<br>\r\n<br>\r\nWithout warning, Kate dropped her arm and rushed her massive hand over to you, with no time to react, you felt her fingers clasp around you from chest to feet and scoop you of the bar, which felt like the faster roller coaster ride you'd ever been on. Just as fast as you had been scooped up, you found yourself being lowered to the ground. Kate bending over, affording you a prolonged look down her top, which of course was her goal. Staring back, watching as the ledge of the bar you were just on grows further and further away as you are lowered below Kate's knees and are able to see under the bar stools. <br>\r\n<br>\r\nKate lowers her hand away from her body, opening her fingers letting you fall to the floor. Stepping around on the much cooler surface, once again you come to realize how small you really are, staring up at the underside of bar stools that look like towers, the bar looking a mile long and 40 stories high, all of which does not compare to Kate, who leaned back up, leaving you on the floor, staring up at her shapely pillars for legs, attached to her red high heals which were easily the size of a car to you, able to see her white lace underwear from below.<br>\r\n<br>\r\nNoticing you once again staring, kate clears her throat to get your attention.<br>\r\n<br>\r\nHere's how the game works, I'm going to dance, and all you have to do is get to the other side of the room, alive. <br>\r\n<br>\r\nThat last bit was rather worrying, but you had no time to think about it as Kate started walking to the middle of the dance floor, her first step nearly knocking you over as the vibration from her foot hitting the ground felt like an earthquake. Bracing yourself with each footfall. <br>\r\n<br>\r\nKate turned back, looking down at you.<br>\r\n<br>\r\nReady, or not. She mused<br>\r\n<br>\r\nWith that, Kate resumed with her solo dancing. Her arms flailing in the air a mile above you as her heals flew up and back down through the air and hitting the floor with a ferocity of a car crash. You had no idea how you were going to get passed that. Even trying to yell up to Kate to try and get her attention, but it was no use, she could not hear you over her dancing and the music. <br>\r\n<br>\r\nYou better hurry up and get out here, otherwise I'm going to have to come over there <br>\r\n<br>\r\nHearing Kate's warning, you were left with no choice, you would have to risk getting crushed by her heals either out in the open or trapped against the bar. With a deep breath you ran for it. With each second you watch as Kate's feet got closer, the vibrations of her feet smacking the floor growing louder and more powerful, you soon found yourself running past her, her Red heal slamming mere inches from your body and then being lifted up once more, a second later feeling the air brush by as her foot glided overhead, you kept running, the music blaring in your mind, but you were almost half way to the other side of the room. <br>\r\n<br>\r\nYou smiled feeling a slight sense of victory, until the shadow of Kate's foot, quickly descended upon you. Her gigantic shoe clipping you as it flew by. taking out your leg and sending you flying into the air, landing on your back. <br>\r\n<br>\r\nYou had a moment to come to, looking strait up, you caught a glimpse of Kate's panties, as her legs flew about on either side of you, the tip of her foot, raising above you, and then crashing down, smearing you into the floor. </span></div></div>",
            "created":1574476260,
            "id":2750387,
            "title":"Out on the dance floor "
        },
        "12113":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Rationally thinking about this, playing a game of pool at your size would be next to impossible, and you were never exactly the best dancer, and why not have a drink, at this size you could get wasted off a thimble of vodka.<br>\r\n<br>\r\nI'll guess i'll go with the drink, Kate<br>\r\n<br>\r\nI wild smile ran across Kate's face.<br>\r\n<br>\r\nA great choice, she chimed.<br>\r\n<br>\r\nKate started to walk over to the rack of drinks, it was still mind boggling how something so big could move with such ease. Running her fingers over several bottles, she selected a favorite of her's, a bottle of white wine, lifting it up and placing it on the bar next to you. Once more taken aback at the massive size difference between you and everyday objects, the bottle was more of a water tower that you could dive into and get as drunk as you wanted. Looking at your own reflection in the bottle, tossing out a rather jovial question.<br>\r\n<br>\r\nThis drink isn't going to make me shrink like the last one is, is it? <br>\r\n<br>\r\nKate, grabbing a tall, wine glass from behind the bar turned with a sarcastic look on her face <br>\r\n<br>\r\nWho said anything about you having a drink?<br>\r\n<br>\r\nShe set the glass down and move her hand over to you, unable to dodge her missive fingers, you found yourself pinched between her thumb and forefinger being lifter off the ground, still a bit perplexed by her answer <br>\r\n<br>\r\nWait, didn't you say I was going to have a drink? <br>\r\n<br>\r\nKate responding rather cheekily. I said the option was a drink, I never said you were going to have one.<br>\r\n<br>\r\nAs Kate was talking you noticed her moving your body over the top of the glass, without notice, she loosened her fingers, your body sliding into the glass, and falling into the clear wall <br>\r\n<br>\r\nAfter clearing your head of being dropped inside, you watched as Kate started opening the bottle <br>\r\n<br>\r\nWait, you're not going to...Kate, wait a second.!!!! Understanding what was going on, you tried to plead with Kate, and Kate simply ignored you. Banging on the sides of the glass, you watched and listened to Kate playfully humming as she picked up the open bottle, tipping it into the glass over you.<br>\r\n<br>\r\nKate!!!! Wait. KATE!!!!!<br>\r\n<br>\r\nA shower of white wine drowned out your protesting as you felt as though you were put under a waterfall, a torrent of liquid sending you tumbling around inside the glass, accidentally swallowing a mouthful as you felt your body start to float, you tried swimming through it to no avail, until the rush of wine stopped. For a moment you simply floated around in the wine, looking at Kate through the glass and yellow tinge of alcohol. You quickly regained your equilibrium and swam to the top, gasping for air as you started to tread wine.<br>\r\n<br>\r\nWhat the hell Kate!!!<br>\r\n<br>\r\nWas all you could get out, not noticing that Kate was moving her hand toward the glass, wrapping her finger around it. You felt the glass move, and lift into the air. a bolt of panic shooting through you, looking up quickly to see Kate's face incoming quickly, Kate licking her lips in anticipation of one of her favorite beverages, with you in it. <br>\r\n<br>\r\nYou felt the glass start to tip, and instinctively started to swim in the opposite direction, looking behind to see Kate's lips pressed against the glass, opening her mouth open, you saw directly down her awaiting maw, her teeth, nearly the size of your head, her tongue, dripping with saliva and her throat, the darkness of her throat that awaited you, should you be unable to fight the current.<br>\r\n<br>\r\nKate tipped the glass and took in her first mouthful, the current pulling you  with it, it was too strong to fight, you had only shear glass to try and grab onto as Kate drank, and then the most terrifying thing you had ever heard, she swallowed the wine, the echo of her simple bodily function reverberating through the glass. Kate tipped the glass more, you could feel yourself being pulled in, as you turned around and braced yourself against the glass, her plush lips which you would have loved at one point to be this close to, now the gateway to your demise. as your hand and footholds fail you, sending you  sliding towards her awaiting mouth, at the last second, kate's lips shutting, slamming your face against the soft flesh<br>\r\n<br>\r\nFor the moment, your face was completely enveloped in kate's lips. you could feel your body still awash in the wine glass, but the warmth from Kates flesh was almost comforting. <br>\r\n<br>\r\nKate let out a small chuckle which was more like a surround sound speaker system on full blast, she parted her lips, your view coming back, looking right into her mouth as she quickly sucked your entire body inside her. No time to react, all you knew was you could not see a thing, you could feels her teeth close around you, the narrow space compressing you against the roof of her mouth and the spongy bed of her tongue underneath you.<br>\r\n<br>\r\nShe gave out a low moan, which again was like being surrounded by speakers going off at full volume, and her tongue, started rolling your body around inside her mouth, flipping you over onto your stomach, you found yourself pinned to the roof of this cave you were trapped in. Slowly her tongue started rolling under you, caressing your body in warm liquid, as it glided against your crotch and torso. Actually feeling quite pleasant, almost forgetting that you were an inch away from being digested.<br>\r\n<br>\r\nKate kept you inside her mouth for a few moments, just seeming to suckle on you as though you were candy, thinking that this would be rather enjoyable, under less life threatening circumstances.<br>\r\n<br>\r\nAfter a moment you greeted with daylight and a pair of giant fingers grabbing your leg. Pulling your body out, just far enough so that the tip of Kate's tongue was pressing against your dick. you let out a pleasant moan as Kate began to flick your dick with her massive tongue, sliding you body in and out of her mouth, rubbing  your loins against her.<br>\r\n<br>\r\nKate giggled, hearing your approval of these actions, reaching in and grabbing you around your torso and pulling you out in front of her face.<br>\r\n<br>\r\nEnjoying yourself? <br>\r\n<br>\r\nShe knew damn well I was, but this again was Kate, always teasing.<br>\r\n<br>\r\nSee that game was not so hard now was it.....which I can;t say the same for you <br>\r\n <br>\r\nKate gave a smirk, pointing out your obvious erection.<br>\r\n<br>\r\nHere let me help you with that, she cooed,  pressing her lips around your dick, the soft plushy masses enveloping your member fully, as Kate slowly began to gently suck on you. never in your life had you imagined getting a blow job from a pair of lips that were the same size as your entire body, but it was happening now. Kate slid her lips back and fourth over your member, flicking the head with the tip of her tongue, getting plenty of saliva over it in place of lube, she contused rolling her luscious lips around you, you panting in approval at the ecstasy...heaving your body back as you felt yourself cum into Kate's mouth.<br>\r\n<br>\r\nYou fell back into kate fingers, panting in exhaustion at the best blowjob of your life, kate simply smiling and swallowing the miniature load.<br>\r\n<br>\r\nBring you in close she places her lips from you face down to your stomach, giving you a kiss <br>\r\n<br>\r\nKate pulling her face away, and lowering you toward her chest<br>\r\n<br>\r\nWell, I guess it's time for your next challenge, I hope we get to have more fun later.<br>\r\n<br>\r\nSo do I Kate.<br>\r\n<br>\r\nKate smiled, and wrapped her hand around you, turning and started walking away from the bar and down to the next room.</span></div></div>",
            "created":1574480460,
            "id":2750400,
            "title":"A drink "
        },
        "122":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "Play dress up.",
                "Chutes and ladders ",
                "Hide and seek "
            ],
            "content":"<div class=\"\"><div> <span>Looking back, toward the  voice, you found yourself staring up at an IMAX screen sized face, massive eyes the size of beach balls, open wide looking down at you, an open mouthed grin showing off two rows of ridiculously sized teeth. <br>\r\n<br>\r\nFalling backward from fright and trying to crawl away, it takes a moment to realize it's Amber's face you were looking at, but far bigger, her chin resting atop her crossed arms, each the length of a semi truck, as she leaned on top of whatever this flat wooden landscape you were on was. <br>\r\n<br>\r\nAmber let out a childish giggle, mocking the terrorized face and actions. As still a bit confused as to what exactly was going on, blurting out the only thing that seemed reasonable in the moment. <br>\r\n<br>\r\nWhat the hell is going on!?<br>\r\n<br>\r\nAmber, still with her piercing eyes staring you down, taking her time to  enjoy the sight of the nude man below her, she parted her teeth slightly, her tongue  pressing out between them, running it along the width of her ,mouth. Gleefully she answered you <br>\r\n<br>\r\nThis is the game silly. And lucky little you, you picked my room <br>\r\n<br>\r\nAmber's delight rang through your ears like church bells, and her statement was a bit confusing, Her room? <br>\r\nRolling over to you side, and peering over the edge which you were laying upon, you looked at the world below. a massive expanse covered in carpet, blanketed with children's toys, A dollhouse, stuffed animals building blocks. Looking to the other side of the room, you saw a bed which looked about the size of a football stadium and a closet with shirts the size of circus tents hanging in them and a toy box that could double as an apartment complex. You look down over the edge and see a large wooden wall with giant knobs sticking out every twenty feet or so.<br>\r\n<br>\r\nI'm on a dresser? <br>\r\n<br>\r\nOut of the corner of your eye, you see amber nod her head enthusiastically, giving you a cheery, Mmmmhhhmmm<br>\r\n<br>\r\nLooking back up at Amber, she leaned her head and torso up from her arms, now looming over your position. Her nipples clearly visible, poking through the tight tie dye shirt. Not her most prominent feature to be sure, even though her small B sized breasts were perky enough, but right now, you caught yourself staring at a pair of small hills that you would have to climb over. <br>\r\n<br>\r\nNot so small now, are they? Amber closing her eyes and giggling, as her hands, went up to cup her chest and jostling her breasts around. and for some reason her body twitched in what seemed to be pleasure...Biggest tits you've ever seen right, she said with a wink.<br>\r\n<br>\r\nSnapping back to reality, starting to come to grips with the situation.<br>\r\n<br>\r\nHow is this even possible? <br>\r\n<br>\r\nHmmm!? Amber stopped playing with herself, and gave a slight moaning gasp as her body twitched once more, looking back down at you, setting her hands to either side of the dresser and rocking her massive form back and forth as she spoke.<br>\r\n<br>\r\nWell, it was something Jessica and Kate cooked up...something about teaching the guys a lesson, Ghaa..<br>\r\n<br>\r\nAmber's body jostled a little, as she bit her lip and let out a little rumbling moan....<br>\r\n<br>\r\nSorry....where was I, she continued<br>\r\n<br>\r\nSo, Kate and Jessica caaAAMMee, up with a plan to teach the guu..uuuu...guys a lesson <br>\r\n<br>\r\nYou could not understand what was going on with Amber, what in the world was making her stutter and twitch like she was playing with herself. She gripped the dresser hard, making the wood creek. panting a little as she gestured to you with her index finger and gave you a rather abrupt.<br>\r\n<br>\r\nOne sec.<br>\r\n<br>\r\nAmber leaned off and let go of the dresser, leaving you along on the vast wooden surface, walking to the middle of the room, you could not help but watch as her ass, barely contained in her cut of blue jeans wiggle with each step, each check, rhythmicly  bouncing with her foot falls, interrupted only by her stopping in front of the toy box, her hands coming together and meeting at the fastening button, as she stopped once more with her body jolting up with a pleasurable gasp. Quickly undoing the shorts, as letting them fall down around her ankles.<br>\r\n<br>\r\nEyes widening as you take into view the perfectly rounded ass, laid bare before you. You had on occasion the opportunity to cop a feel of Amber's backside, with her encouragement, but this was the first time you were seeing the full moon as it were, as the blue lace pair of panties were practically non-existent, being engulfed in between her thick behind, <br>\r\n<br>\r\nTurning to her side, she reach her fingers into either side of her panties, slowly sliding them down her shapely thighs, and likewise letting them drop to her ankles. Her pussy glistening with juices as it was made clear that something was stimulating her insides.<br>\r\n<br>\r\nWith a few piecing yelps and moans, you watch as Amber, reaches down separating her lips and reaching inside her womanhood and grabbing the object of her arousal. Shockingly seeing what looked like a pair of doll feet emerge from her insides, an entire body emerging as she slowly twisted the form around in her hand, moaning as she made sure to get the full enjoyment of her dildo.<br>\r\n<br>\r\nOOOOOOHHHHH!!!<br>\r\n<br>\r\nAmber cumming, as juices dripped from her fingers as she momentarily shoved this human form dlido back inside her, then quickly pulling it out as she panted.<br>\r\n<br>\r\nAs she held held her \"toy\" it takes a moment to realize who this toy was.<br>\r\n<br>\r\nDave!?<br>\r\n<br>\r\nWatching as a miniature Dave dressed in doll clothing,dripping in Amber's juices, trying to regain his breath. Comparing him to Amber he looked to be about twice your size. It was no wonder Amber was squirming around so much, she literally had a human being, rolling around inside her vagina for this entire time. Amber brought, Dave to her face, and gave him a kiss, enveloping his face for a moment.<br>\r\n<br>\r\nYou were freaking awesome honey. Amber said with a smile.<br>\r\n<br>\r\nDave just raising his arm and giving Amber a thumbs up<br>\r\nSure thing fire thighs....but why did you take me out?<br>\r\n<br>\r\nAmber motioned her head, pointing out that they were not alone <br>\r\n<br>\r\nOh hey man!! You finally in the game.<br>\r\n<br>\r\nYeah and he's actually going to play it with me, Amber interrupted. Unlike someone who just wanted to stay with me this entire time, she said with a giggle <br>\r\n<br>\r\nDave waves at you as he was just about revived from his spelunking inside his girlfriend.<br>\r\n<br>\r\nHope you get lucky dude, and enjoy this girls pussay!!!!...because it is tiiiiiight! <br>\r\n<br>\r\nAmber giggled at Dave's enthusiastic review of her insides as she reached down opening the toy box.<br>\r\n<br>\r\nAlright hun, you're going to have to stay in here a while while I play around with my new toy, ok.<br>\r\n<br>\r\nsure babe.<br>\r\n<br>\r\nStruck by how nonchalant they were being, sure they would practically have sex in public, and engage in all sorts of kinky sex practices like gimp suits and gagging each other, but being a living dildo was on an absolutely insane level of unusual. The fact that Amber used the word toy was a little nerve racking, I mean given the situation you were smaller than the doll sized Dave, and not really able to escape being trapped on top of a 60 story dresser. Simply watching as Amber lowered Dave into the toy box and closing it, leaving him to his solidarity.<br>\r\n<br>\r\nWhew....that's much easier. Amber stood back up and turned her attention back to you. Still naked from the waist down, her slit still wet and glistening in the light, as she made her way back to the dresser. Humming happily.<br>\r\n<br>\r\nSo then where was I...oh yeah. The game <br>\r\n<br>\r\nWith everything that just happened, the game was the last thing to think about, but figuring being shrunk was specifically for playing this game, it would help to pay attention to the rules.<br>\r\n<br>\r\nSo then, Amber interjected as she quickly turned around, her ass mere feet from your face as she hopped up onto the dressing, causing a miniature earthquake as her ass slams next to you.<br>\r\n<br>\r\nCareful!! <br>\r\n<br>\r\nDon't worry cutie, i'm not going to hurt you. Amber teased. So...ummmm...Amber a bit absentminded tried to remember once more where she left off. <br>\r\n<br>\r\nOh yeah, so basically, Jessica and Kate come up with this game, and were supposed to let you guys choose from some things and play little games which you have to complete before you can move on to the next round with another one of us girls.<br>\r\n<br>\r\nBeing light on the specifics but getting the gist of it, just shrugging your shoulders to get on with it <br>\r\n<br>\r\nAlright, so what are my options with you Amber.<br>\r\n<br>\r\nAmber gave a wide smile and jumped back off the dresser, causing the whole structure to shake and nearly knock you over.<br>\r\n<br>\r\nAlright, you have three choices.she continued giddily <br>\r\nOne is that we get to play dress up, two,we play chutes and ladders three is we get to play hide and seek <br>\r\n<br>\r\nwith a rather childish  closed eye smirk directed your way she gave you a rather comforting reassurance<br>\r\n<br>\r\nAnd don't worry, all of these options are going to be fun, for both of us. So whats it going to be my tiny little man?</span></div></div>",
            "created":1574554440,
            "id":2750806,
            "title":"2nd left, amber in the playroom "
        },
        "1223":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "Living sex toy part two, the quest for the hint.",
                "Just move on, Dave can deal with this. "
            ],
            "content":"<div class=\"\"><div> <span>The thought of being dressed up like a doll was not exactly appealing, and all the more demeaning when thinking that any doll clothes would be over sized for your three inch frame. <br>\r\nChutes and ladders sounded simple enough, but playing a game that required rolling dice might not exactly being easy in your current state.<br>\r\nFiguring that given your current size, hiding spots would be plentiful and sneaking around the most ditsy member of your friends would be simple. <br>\r\n<br>\r\nAlright, lets play Hide and seek then.<br>\r\n<br>\r\nAmber's eyes glistened at hearing the words, trying to contain a smile. She began to bounce up and down with spurts of \"yay\" in between each bounce, causing the whole earth to shake, nearly making you to lose your balance.<br>\r\n <br>\r\nAMBER!!!!<br>\r\n<br>\r\nShe froze, hearing your yell and she shrugged embarrassed. Chuckling it off <br>\r\n<br>\r\nSorry, I keep forgetting.<br>\r\n<br>\r\nSighing relief at the temporary calm.<br>\r\n<br>\r\nIt's fine, lets just start the game, ok.<br>\r\n<br>\r\nAmber gave a few quick nods. Still with a gleam in her eyes. You had no idea why she would be so excited to play a simple game of hide and seek. Granted she was the most childish in your group of friends and tended to be a bit of an air head, but a children's game was a bit, over the top.<br>\r\n<br>\r\nAlright, I'm going to pick you up now, ok?<br>\r\n<br>\r\nPick me up!?<br>\r\n<br>\r\nThinking about this for a moment, you were on top of a dresser, with no real way to get down. and not exactly a lot of hiding places to be had on the flat surface. The thought of being picked up though. It seemed odd, but figuring that you would have to be getting around the house while going through this game you would need to have the girls transport you somehow. <br>\r\n<br>\r\nAlright i'm ready.<br>\r\n<br>\r\nRather nervous, literally having your life in someone else's hands, but resigning yourself to the inevitability, you watched Amber slowly raise her hand over the edge of the dresser, each of her fingers nearly as big as you were, feeling the heat from her palm as her fingers closed in around your body, tightly securing you in her grasp.<br>\r\n<br>\r\nAwwww, you look adorable, in my hand...little cutie <br>\r\n<br>\r\nRather embarrassed, being talked about like you were a hamster, you felt your feet leave the ground as Amber lifted you into the air, looking around feeling like you were flying in an airplane, looking at the ground which felt a mile away. SO awestruck by the view you did not even notice Amber face barring down on you, her lips taking up your entire vision as she planted a massive kiss right on and around your face. <br>\r\n<br>\r\nCaught off guard, but rather enjoying the feeling of plush flesh engulfing your head, you tried to kiss her back, which was meet with a thundering giggle of approval. You felt the world around you shift as Amber turned and started walking toward the bed, pulling you slightly away from her face, with her eyes fixed on you. <br>\r\n<br>\r\nSo, how long are you going to give me to hide.<br>\r\n<br>\r\nAmber let out an aroused sigh, as she turned back around once more, and the feeling of riding on a roller coaster overtook you as she plopped her self on the bed. Feeling like you were going to be sick form the impact.<br>\r\n<br>\r\nOh...you wont have to worry about things like that.<br>\r\n<br>\r\nStill with a firm grip, she began to lean back onto the bed, holding you above her as she lay down, her head perched up on a pillow, her eyes fixed on you with a near sadistic smile, and you could hear a faint difference in her breathing, almost as though she wan panting under her breath. once again getting that sinking feeling, her arm starting to go down.<br>\r\n<br>\r\nThis isn't a normal game of hide and seek, nope.<br>\r\n<br>\r\nSquirming a bit, Amber start turning her hand, with you still in it, your world going vertical as she continued to lower you.<br>\r\n<br>\r\nIn this game, i'm going to hide you...and you get to seek.<br>\r\n<br>\r\nYou were now, nearly upside down, blood rushing to your head, noticing Amber's other arm was going down and across her stomach, following it down to her head as you were now fully upside down, you saw Amber was playing with herself.<br>\r\n<br>\r\nOh shit!<br>\r\n<br>\r\nStill wet from it's previous occupant, the slightly musty smell already overwhelming you, as Amber was rubbing her fingers up and down her slit.Hearing her low moaning from above, she slid her fingers inside her pussy, slowly pulling them out, watching in slight terror at the glistening pillars, as the dove back inside Amber's womanhood once more, this time, spreading her lips open and giving the few view of her vagina. It was both awe striking and horrifying to be this close to her, this, most sacred of womanly flesh. Knowing that it would soon encompass the whole of your body. Hearing Amber from above in an aroused taunting tone,'<br>\r\n<br>\r\nReady or not...here I cum!!!<br>\r\n<br>\r\nRocketing forward, face slamming into the pink wall of flesh, the fingers that were gripping you, letting go and pressing against your back, forcing the rest of your body inside, sliding you along the fluid covered skin. Hearing Amber moan and cry out in sensual pleasure as she forced the rest of you body deep within the chasm, lifting her fingers out and letting her folds close in around you. <br>\r\n<br>\r\nDazed and trying to gain some semblance of equilibrium in the damp darkness, being bombarded by vagina juices, you try to grip onto the folds of skin, the world shaking around you as Amber bucked her hips, squeezing the walls of the \"cave\" around you. All you can do is squirm around, unable to see where you were going or even if you were moving, everything shaking and the thunderous moans from outside continued to erupt, causing this confined space to further fill with bodily fluids.<br>\r\n<br>\r\nThere was no way you were getting out of here, you could barely get a grip on the slick skin around you. The only way to get out, was to be forced out. and there was just one way to do that. Violently kicking and pressing your hands into Amber, swirling around inside her, you could hear her moans grow louder, as your assault continued, the juiced filling the canal, giving the hint that your jostling was working. Twisting an shaking, rattling around a final explosive moan shook the world around you, you felt the hot liquid pummel your face and body and the world shift once more as the stream of cum and gravity shot you out of Amber. Falling onto the bed, drenched in a pool of her cum.<br>\r\n<br>\r\nQuickly trying to shake free from the mess, you looked up seeing Amber's ass, hanging above you, in her ecstasy she had lifted her whole upper body with her legs into the air, and was still in mid orgasm, her shallow panting and moans nearly deafening...until she went silent. In an instant without time to react, her body gave way, the shadow of her ass encompassing you, mere milliseconds before the massive wall of ass, was on top of you, pinning you to the bed....thankfully not killing you. <br>\r\n<br>\r\nOhhhhhhhh...that was.....mmmmmmmmmm<br>\r\n<br>\r\nYou could feel the reverberations of amber's voice all around you, pressed into her backside, still with a pool of cum underneath, you could not breath, and slowly felt like you were blacking out. <br>\r\n<br>\r\nThe pressure suddenly relieved as Amber rolled over, you sticking to her ass, pasted there by the slowly drying cum.<br>\r\n<br>\r\nhow did you end up down there cutie <br>\r\n<br>\r\nToo exhausted to answer, and barely move. Amber simply accepted the silence.<br>\r\n<br>\r\nLet me get you off of there.<br>\r\n<br>\r\nAmber gently wrapped her finger under your legs ans waist and peeled you off her ass, bringing you to her face, as she sat back down.<br>\r\n<br>\r\nYou were pretty good short stuff.....here, let me clean you off. <br>\r\n<br>\r\nYou could barely see past the drops of cum, but amber's mouth opened up, inserting you inside, your entire body feeling like it was getting pulled into a vacuum as she sucked her cum off of your upper body and pulled you back out of her mouth.<br>\r\n<br>\r\nBetter?<br>\r\n<br>\r\nShe asked, to which all you could reply was a simple nod. She smiled once more and began to talk again.<br>\r\n<br>\r\nSeems you made it past the first round...and now, you have another option.<br>\r\n<br>\r\nStarting to regain some strength, you jolted your head up, knowing that you had to endure much more of this, before the game was over.<br>\r\n<br>\r\nYou can go to the next round, if you want.....or, I can give you a hint on your next round...but it's going to cost you *wink* <br>\r\n<br>\r\nHaving a pretty good idea of what it would cost to get that hint, you think about getting that advantage, or simply moving on. <br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1574804400,
            "id":2752125,
            "title":"Hide and seek "
        },
        "13":{
            "author_id":"elemental78",
            "author_name":"jonrai",
            "choices":[
                "strait to Kate at the bar ",
                "2nd left to amber in the playroom ",
                "1st left Jessica in the bathroom ",
                "right to Jennifer cleaning in the kitchen. "
            ],
            "content":"<div class=\"\"><div> <span>You slowly come to, feeling like you just woke up from an extended night of heavy drinking. The first thing you notice is the lack of light, you can barely see anything as your eyes start to adjust to the darkness. You soon make out what seems to be a metal ceiling, and then the walls and then the metal floor.Still coming to, you feel a slight chill in the air and stand up noticing that you are completely naked.<br>\r\n<br>\r\nWhat the hell!!! <br>\r\n<br>\r\nYou knew that being stripped naked was not the oddest thing in the world for your friends to do, but  this was the first time you had not woken up with at least one of them around when it happened. Slowly you get to your feet as your eyes begin to adjust a bit more, you can make out the ground which is covered in thick dust. You've been to this house plenty of times and have never seen this room, or any room like it. It was perfectly square and long, and you could not see the end of it. <br>\r\n<br>\r\nLooking around you see a large square yellow paper laying, almost the size of a billboard. in the middle of the room and you can't believe the amount of dust gathered on the ground, like no one has been in this room in years, looking closer, you see prints in the dust, footprints. one that is huge, nearly as big as your whole body another not quite as big but two  that are several times smaller that are the same size<br>\r\n<br>\r\nThe other guys?<br>\r\n<br>\r\nYou question yourself, thinking that there is no way anyone has feet that much bigger than you, I mean they were practically your body length <br>\r\n<br>\r\nprobably an animal or something, you reason.<br>\r\n<br>\r\nYou turn your attention back to the large paper, the writing is quite large, each letter almost half you size but in Kate's handwriting. It reads.<br>\r\n<br>\r\nYou have a choice of four paths ahead, better hurry before it's decided for you.<br>\r\n<br>\r\nDecided for me? What does that mean?<br>\r\n<br>\r\nWell I guess I better go along with the game.<br>\r\n<br>\r\nYou start down the large square hall, keeping your eye's on the footprints already made in the thick dust, the fact that their only only two that seem to be actual foot prints unsettles you, I mean those others can't possibly be from anyone here. You continue you walk and you see another large note in the distance, you quickly jog to it and see that it's just four arrows two pointing left, one pointing right  and on ahead, looking around you can see corridors to where each of the arrows are pointing. two of the actual foot prints went to the right, one went to the first left and the last one the much bigger prints went to the 2nd left, with no prints going toward the one strait ahead<br>\r\n<br>\r\nWell I guess I'll choose the  ______________<br>\r\n<br>\r\nAs you make your way down the path, you feel a slight chill in the air again, as a slight breeze starts to waft over you <br>\r\n<br>\r\nThat's weird, where would a breeze be coming from?<br>\r\n<br>\r\nThe breeze starts to grow stronger<br>\r\n<br>\r\nWhat in the world!!!!<br>\r\n<br>\r\nthe blast of air picks you up and tumbles you down the hall, unable to regain control you spiral forward like a leaf in the wind, seeing daylight ahead and a large slatted grate coming into view, you nervously flail as you see the grate coming closer and try to avoid hitting it.<br>\r\n<br>\r\nMercifully, the gust of wind stops and you somewhat harmlessly land back on the metal ground, near the opening. Quickly dusting yourself off and slipping through the slats to get out of this death trap, you are temporarily blinded by the bright light, as your eyes adjust...and you wish that they had not as you look around and see a normal room, but much much larger than normal....you come to understand the metal hallway you just exited was the heat vent, and that burst of air was filtration system turning on. <br>\r\n<br>\r\nThis can't be, this has to be some sort of trick <br>\r\n<br>\r\nA familiar voice from above chimes \"it's no trick' <br>\r\n<br>\r\nyou cover your ears at the booming noise, sounding like it's blasting on a surround sound speaker system, you look up an a sudden terror come over you, as you are standing near a giant.....</span></div></div>",
            "created":1573590180,
            "id":2745815,
            "title":"Green (1 inch)"
        }
    },
    "info":{
        "author_id":"elemental78",
        "author_name":"jonrai",
        "brief_description":"Invited to a dinner party, where everyone has a role to play, including your small part.",
        "created":1573578780,
        "description":"<td align=\"left\" class=\"norm\">A dinner party!? That's rather a tame get together for you and your friends. Usually you'd just go out drinking and watch as the nights drama lent itself to entertaining you. I mean being the only single guy in your group led to a few...lets say awkward situations. Being the go to guy that your drunken female friends would fawn over should they want to make their partner jealous in some way. You always knew it was in good fun, but you could not help but notice a slight seriousness in the tension, you just shrugged it off as normal couple stuff. <br>\r\nBut a dinner party, you'd think that particular setting would be more \"normal\" of an occasion where you would not have to deal with any sexual tension, and everyone else had already said they were going, much to the glee of the ladies. (speaking of which, lets introduce the lovely couples) <br>\r\n<br>\r\nKate and Alex<br>\r\n<br>\r\nAlex-Classic rich playboy who was nearly disowned by his parents when he was just 18 after one two many run in's with the law. You helped him make up with his family shortly before he met Kate. A year later Kate and Alex were married after a incident involving you Kate and too much alcohol. Which is right around the same time Alex's parents met with a fatal car accident, leaving Alex the sole heir to his family's 37 room mansion and South American \"sugar cane\" fortune. <br>\r\n<br>\r\nKate-Raised to be a \"proper\" lady, down to the hourglass figure, but with a raging party girl underneath. Once when she had one to many drinks she started grinding against you and making out which infuriated Alex, so much so that he announced their engagement just a week later on the promise that she remain loyal to him. Kate accepted this proposal and has been the \"good wife\" with an urge to break free ever since. <br>\r\n<br>\r\n<br>\r\nJessica and Kevin<br>\r\n <br>\r\nFrom a young age both have been brilliant chemists. But Kevin always seems to outshine Jessica, from him graduating a year earlier than Jessica (even though they were both in their late teens) to always seeming to get the credit on their joint chemistry efforts. Kevin, although brilliant seems to be oblivious to Jessica's growing resentment towards her never getting the credit due her in their joint efforts. Maybe their latest project which they have been working on the last few months will be the one where both are given equal credit.<br>\r\n<br>\r\n<br>\r\nAmber and Dave- Both on their last year of school, Amber is a bit of a ditz but her bubbly personality makes her impossible not to like. She in many ways is still a child who just wants to have fun, and her boyfriend Dave, although making his way through all his courses (barely) seems to have little to no ambition <br>\r\n<br>\r\nJennifer and Craig-A full time teacher and a small town lawyer, Jennifer wants more excitement in her life and the only time she gets anything close to that is when these get togethers happen. Craig is very buttoned up and closed off, the very definition of legalistic, in terms of everything, I mean what other person would have a life insurance policy done at the age of 19 and have a will at the age of 22.<br>\r\n<br>\r\n</td>",
        "id":2205342,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1574804400,
        "modified":1574804400,
        "pretty_title":"A tiny dinner party "
    }
}