{
    "chapters":{
        "1":{
            "author_id":"efilsgod",
            "author_name":"Pedro",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span>You're laying somewhere... your head hurts...<br>\r\nYou get up and notice that you are in a city. But it's a very strange city: buildings and vehicles look like big toys or something similar and there's just a few people. These people look scared, like there was something dangerous coming on.<br>\r\nYou seem to suffer from a partial amnesia because you can't remember what happened before your awakening in this strange place. The last thing you remember is that a girl approached you and asked if you were afraid of Godzilla. Then she took a weird little gun from her pocket.<br>\r\nYou call at the nearest passer-by and ask: \"Excuse me, what the hell is this place?\" His answer is: \"You'll think I'm gone mad: this is a toy city and we're all shrunk at the size of a bug! Take a look at the sky...\" You look up above and see... a ceiling! The man says: \"We are the victims of five crazy girls' sadistic games! They often come into this room and torture us in every way they can! Sometimes only one of them comes in and sometimes more than one. We were more numerous once, lots of people are dead. If you feel like seeing something very terrible, come with me\" He walks away and you go after him.<br>\r\n</span></div></div>",
            "created":1235624400,
            "id":652790,
            "title":"Awakening"
        },
        "11":{
            "author_id":"efilsgod",
            "author_name":"Pedro",
            "choices":[
                "Lilian",
                "Lucy",
                "Lisa",
                "Julie",
                "Naoko"
            ],
            "content":"<div class=\"\"><div> <span>The man takes you to a park made of green polystyrene and little plastic trees. In this small park there are two enormous footprints left by bare feet. In one of the prints there is a destroyed plastic tree and in the other one there is a... corpse! Yeah, a flattened man covered in blood! You have always been strong and brave, but this vision is quite terrifying.<br>\r\nYour guide says: \"When they come here, they're usually barefoot. One of them stepped on that poor man and just giggled. It was horrible! And that's not all: take a look around!\" Around you there's even more destruction: destroyed cardboard buildings, crushed toy vehicles and dead people! <br>\r\n\"But the worst thing of all\" the man continues \"is that we're all imprisoned because this city is delimited by a corral so...\" He interrupts himself because suddenly huge foot stomps can be heard... a shrunken woman cries: \"Beware! One of them is coming!\"<br>\r\nPeople start running to the left and to the right and you're very confused, you don't know what to do...<br>\r\nA shadow covers you and you see a gigantic but gorgeous bare foot stomping a paper car, turning it into a disc. The other foot of the giantess lands in front of you, making you fall on your butt. Your curiosity is stronger than your fear, so you look up above your head and see...<br>\r\n</span></div></div>",
            "created":1235624400,
            "id":652796,
            "title":"Cruelty"
        },
        "111":{
            "author_id":"efilsgod",
            "author_name":"Pedro",
            "choices":[
                "She playfully stomps you ",
                "She puts you in her mouth",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, there you are!\" Lilian says \"I was looking for you, our new guest!\" You run away instinctively, but the giantess blocks your way with a foot. You slam on that big fleshy wall and tumble again. An enormous hand comes down and grabs you. Lilian lifts you up until you're in front of her lovely face and you can see your reflection in her eyes.<br>\r\n\"Hello cutie!\" She says with a sweet voice \"I guess the others already told you the truth. Well, this is your new life now, adapt yourself to it. You must not try to rebel, or I'll crush you under my beautiful feet or eat you for dinner\" She giggles \"Now... what can I do with you this first time we meet?\" While she's thinking, she drums her nails on a plastic skyscraper.</span></div></div>",
            "created":1235710800,
            "id":653174,
            "title":"Meeting"
        },
        "1111":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "more crushing"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm... I think you need to spend the next 69 years or so stuck to my sole, sucking on my foot! Oh, you'll get so dirty! Ready? I don't care!\" She lifts up a barefoot, and wiggles her toes. Bringing down her barefoot, you're mashed into place right below her big toe and second toe. Since you were facing the foot, every time she stepped down on that foot you acted as a sponge, forced to take her 12 year old sweat into your mouth.<br>\r\n<br>\r\nOh what a life. </span></div></div>",
            "created":1260162000,
            "id":802655,
            "title":"She playfully stomps you "
        },
        "1112":{
            "author_id":"casey128",
            "author_name":"C. R. Powers",
            "choices":[
                "Tickle her",
                "Try to get out"
            ],
            "content":"<div class=\"\"><div> <span>I know I'll swallow you, you scream but she puts you in her mouth, you feel her giant tongue all over you covering you in slime, you also feel it on other regions and it feels good but if you don't get out you will die you kicker her youvula and she opens her mouth you escape only to tumble down into her shirt between her breasts.</span></div></div>",
            "created":1235797200,
            "id":653812,
            "title":"She puts you in her mouth"
        },
        "11122":{
            "author_id":"therandom",
            "author_name":"The Random",
            "content":"<div class=\"\"><div> <span>You try to climb out, but you just can't get the right grip. She giggles with amusement as she reaches down her cleavage for you. Soon enough, her massive hand grabs you again. \"You not getting away like that, my yummy little snack.\" She says as she pulls you out and puts you in her mouth a second time. Only this time she doesn't give you time to try and escape again. The moment you're in her mouth, she tilts her head back and swallows. Seconds later you land with a splat in her stomach. You hear her giggling and saying \"Scream loudly when the my acids start on you.\"</span></div></div>",
            "created":1237525200,
            "id":663688,
            "title":"Try to get out"
        },
        "1113":{
            "author_id":"shrinkfeet",
            "author_name":"iamtheman",
            "choices":[
                "Stomp on the kids with her bare feet and make their mom watch!",
                "Eat them for lunch!",
                "Take their mom and put her in between her toes while the kids watch"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I want you to serve me,\" Lilian says with a smile.<br>\r\n\"What do you want me to do?\" you studder as you look up at the beautiful blonde giantess above you.<br>\r\n\"You're going to massage my feet, and they smell terrible right now so you're going to have a lot of fun!\" she said with a laugh as she sat on the ground extending her legs so her feet were towering above you. You look up at her bare soles and she wiggles her massive toes. <br>\r\n\"You better get started before I decide to be mean,\" she said demandingly.<br>\r\nYou walk up to her right foot and place your hands on the bottom of her sole near the heel. The smell of her titanic foot fills your nose and burns the hair inside your nostrils. You have never smelled anything more powerful or disgusting! Lilian finds nothing wrong with making you do this. She looks at you and laughs while the other citizens of the city hide. <br>\r\n\"That's enough! I need more slaves, but I think I need to go on a rampage first!\" her voice boomed as she stood up. She walks over to a paper building and lifts her foot above it.<br>\r\n\"Hello! Anyone in there? I hope so because you're going to witness the power of my giant foot!\" she laughed as she crushed the builiding. Suddenly a woman comes out of her house with her two kids.<br>\r\n\"Kids! Run! Run! Save yourself!\" she screams as they try to escape from the giantess. Lilian looks around and sees the woman's son and daughter running and an evil smile spreads across her face. She has an idea!</span></div></div>",
            "created":1235710800,
            "id":653481,
            "title":"Something else"
        },
        "11131":{
            "author_id":"casey128",
            "author_name":"C. R. Powers",
            "choices":[
                "Fun",
                "Torture"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She stomps on the kids letting the mom watch. The mother's sobs irritate her and she stomps on her to. <br>\r\n\"I'm beginning to like you.\" she says.<br>\r\n\"so lets have fun.\"</span></div></span></div>",
            "created":1235797200,
            "id":654196,
            "title":"Stomp on the kids with her bare feet and make t..."
        },
        "111311":{
            "author_id":"fry3",
            "author_name":"12344",
            "choices":[
                "Congratulated you and allowed you two to flee while ravaging others",
                "Screw the promises"
            ],
            "content":"<div class=\"\"><div> <span>Lillian calmly ground the small children to pulps beneath her feet and plucks you off the ground.<br>\r\n\"Tell you what, I'll make you a deal. I am feeling horny enough to pop baloons twenty feet away. I want you to satisfy my needs. I you can get me to cum in two minutes then you and your friend go free for today,\" she lifted the man you met earlier \"if not, then I keep you and he gets to ride in my ass all day!\" she explained eagerly. Lillian put you on her stomach and yelled \"Go!\"<br>\r\n     You sprinted for the lips of her gaping labia. Jumping inside, you eagerly rubbed the walls of her vagina. After all, there are worse things Lillian could have done to you. But as you move deeper, you notice a long smear of brown. Farther along, you see a partially mummified body stuck to the side of her vagina. This strikes fear in your heart, despite the fact you're still vigorously scrubbing the walls that are rapidly getting soaked. Over Lillian's moans you hear her gasp \"One minute!\"<br>\r\n     Now simply thrashing around, trying not to get stuck like the dead man on the wall, or get washed out. Eventually, a massive wave of pleasure grips her and sends violent tremors through her body. This is followed by a blast of liquid that sends you squirting out from between the drenched lips of the labia. Looking around, you see Lillian was thrashing around a lot. She had smashed several buildings, and there were smears of people where she had rolled on top of the city's fleeing denziens. The streets were flooded with her juices.<br>\r\n     A hand gripped you, and raised you to Lillian's flushed face. She...  </span></div></div>",
            "created":1289106000,
            "id":989533,
            "title":"Fun (for her)"
        },
        "11132":{
            "choices":[
                "Better obey her",
                "Run away"
            ],
            "content":"<div class=\"\"><div> <span>By \"eat them for lunch,\" Lilian means all 3 of them.<br>\r\n<br>\r\nSo she gets down on her knees to get a closer look at the family of three. <br>\r\n\"You'd better enjoy these last moments of yours, you tiny pests!\" Lilian says smirking. Then she picks all of them up in one hand, and drops them one by one into her waiting maw. She savors every member, though she is content to suck on them rather than chew. After she has swallowed all of them, she rubs her belly. \"mmm good.\"<br>\r\n<br>\r\nThen she looks down at you, who are spellbound. <br>\r\n\"What are you waiting for schmuck? Keep rubbing!\"</span></div></div>",
            "created":1277528400,
            "id":907176,
            "title":"Eat them for lunch!"
        },
        "111322":{
            "choices":[
                "Naoko",
                "Julie"
            ],
            "content":"<div class=\"\"><div> <span>Just as Lilian had ordered you to keep rubbing her toes, you found the perfect escape. You knew you couldn't hide in any of the buildings, but right there in the middle of the street was an open pothole. You wondered if they had noticed it when they bought the toy city. As soon as she finished her sentence, you bolted away and ran for the hole.<br>\r\n<br>\r\n\"Oh no you don't!\" Lilian yelled, and tried to crush you underfoot. But you were too fast for her, and soon you slipped down the hole and fell down a long way. You wondered if you would die when you hit the ground, but you were satisfied you had outsmarted Lilian.<br>\r\n\"Where are you? Rrr, goddamn it! I'll find you...eventually!\"<br>\r\n<br>\r\nYou did not perish upon landing; instead, you landed on some kind of pillow. You looked around and found it to be the basement of the house.<br>\r\n<br>\r\nBut someone was coming down the stairs!<br>\r\n<br>\r\nIt was..</span></div></div>",
            "created":1277701200,
            "id":908017,
            "title":"Run away"
        },
        "1113221":{
            "author_id":"fry3",
            "author_name":"12344",
            "choices":[
                "Naoko notices you",
                "She goes back to catching would-be escapees"
            ],
            "content":"<div class=\"\"><div> <span>Naoko comes in, but doesn't notice you. You think it strange that she's heading straight for you despite not seeing you. Then you realize, you're on a couch. Naoko pulls down her tight shorts, revealing a hot pink lacy thong beneath them. You are hypnotized by her amazing body, and before you know it, her colossal ass was coming down on top of you. She lands on top of you with one cheek, crushing you into the couch. Naoko felt you as a small irritation, so rubbed her butt back and forth, and wegied you and her thong into her crack. Then, she pulled her underwear completely off and sensing an opportunity, you desperately clung on. Naoko tossed the undergarment over the back of the couch. You climbed back over so you could see this new giantess.<br>\r\n     Naoko had been a friend of yours for a few years, and you had some feelings for her. She seemed nice enough, but did have a small sadist streak, which you found, in fact, to be a really big one. Naoko was stretched out on the couch, rubbing her crotch softly. You saw that she had positioned herself so that it was directly beneath the manhole you had fallen through. It hadn't been an overlook on the girl's part, but a cleverly disguised trap. Looking at the thong that had an entrancing smell about it, you were startled to see smears of dried blood all over the inside it. You were pondering this when a scream penetrated your thoughts. Another small man had fallen for this trick, and landed on Naoko's vagina. She quickly clenched her legs together, and the tightened walls crushed the man with a squelch. She fished out the body, and lazily chewed it. Naoko swallowed, and glanced in your direction.  </span></div></div>",
            "created":1289106000,
            "id":989544,
            "title":"Welcome to Hell"
        },
        "1113222":{
            "author_id":"zoneraider",
            "author_name":"GrimReaper",
            "choices":[
                "she needs to talk to Lillian",
                "she came to find out whats going on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>it was Julie coming down the stairs, she...</span></div></span></div>",
            "created":1278219600,
            "id":911392,
            "title":"Julie"
        },
        "11133":{
            "author_id":"shrinkfeet",
            "author_name":"iamtheman",
            "choices":[
                "They run away",
                "They watch their mother get tortured"
            ],
            "content":"<div class=\"\"><div> <span>She picks up the tiny mom and sits down.<br>\r\n\"Time to get introduced to my toes!\" she says with a smile as she rubs her in between her sweaty toes.<br>\r\nThe kids watch as their mother is used a a foot toy. <br>\r\n\"you kids better stay here and watch this or you'll be next,\" the giantess laughed.</span></div></div>",
            "created":1236402000,
            "id":657521,
            "title":"Take their mom and put her in between her toes ..."
        },
        "111332":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Now the kids"
            ],
            "content":"<div class=\"\"><div> <span>\"You better stay here and watch, little kids!\" Lillian said.<br>\r\n<br>\r\n\"Don't worry!! In fact, I'm glad you came, because I've been having a fight with ol' mom here\", he jerked his thumb toward the mother in Lillian's clenched fist. \"Do you mind if I say goodbye to her?\"<br>\r\n<br>\r\n\"sure... but make it quick\".<br>\r\n<br>\r\nThe son strode up to her with a contemptuous look on his face. \"Well mom, looks like the superior mom is going to be tortured by the giantess's stinky foot! I'll watch, to make sure you get the punishment you deserve!!\" He backed away fast, and made a little wave.\"<br>\r\n<br>\r\nThe giantess took the mother and pushed her face into the foot. \"SMELL IT!! TASTE IT!! She then took the mother and put her head in between her sweaty toes, and squeezed both disgusting toes together.<br>\r\n<br>\r\nThe mother's head exploded, her body fell limply to the floor.</span></div></div>",
            "created":1260334800,
            "id":803569,
            "title":"They watch their mother get tortured"
        },
        "112":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "Stay ",
                "Forget that! RUN! ",
                "Another girl enters "
            ],
            "content":"<div class=\"\"><div> <span>Your eyes strained upwards, catching a spark of evil beyond belief that tryed to hide behind shining hazel eyes. A grin crossed the girl's face as she looked at you, her head tilted only slightly.<br>\r\n\"Ah... it's the new guy. Welcome to our town, I hope its a living hell.\" Her raven black hair moved un-naturally slow in the wind, it softly stroked her legs like a caring mother. \"I'm Lucy, and you're a toy so get used to it!\" <br>\r\n<br>\r\nYour eyes barely kept up with her hand as she back-handed a sky scraper. Masses of people fell from the windows in a hopeless effort to escape. Only two people survived, you watched them scream as Lucy finished them off.<br>\r\n<br>\r\n\"Run and you'll die, stay and i'll give you a tour.\" Lucy boomed, flexing her toes as she looked at you from over her shoulder. Her ravin black hair settled back in place.</span></div></div>",
            "created":1236488400,
            "id":658129,
            "title":"Run and die or ride the tour "
        },
        "1121":{
            "author_id":"efilsgod",
            "author_name":"Pedro",
            "choices":[
                "The tour goes on...",
                " Lucy lets you go and does something else",
                "Another girl arrives"
            ],
            "content":"<div class=\"\"><div> <span>\"Turn around\" Lucy order. You obey. The giantess lifts a bare foot up and lets it hang over your head. \"Don't worry, my little toy\" she says tenderly \"I'm not going to squish you. I'll step on you, but you won't be crushed. But if you make an only move, I'll kill you in the blink of an eye.\"<br>\r\nYou close your eyes and pray not to be tricked... then you feel something soft and smooth encircling you and there's a strong foot smell in your nostrils. You open your eyes and realize that you're stuck between Lucy's toes. The enormous black-haired girl flexes her toes a little and whispers: \"Oh, there you are. Now you'll see the city and my giantess action from my foot's perspective! Remember: if you make any effort to release yourself, you're dead!\"<br>\r\nLucy starts walking. The movements you're forced to make give you dizziness, but you're able to see what's happening around you. <br>\r\nIn front of you there's a little paper car. \"Oh, what a pretty and lovely car\" the giantess says. Then she stomps the toy vehicle with the foot that is holding you and you hear a crunchy noise very close to your small body. Lucy giggles and goes on.<br>\r\nYou see a trembling scared man. Lucy says to him: \"Hello cutie! Wanna be squished?\" The man yells: \"NO! PLEASE DON'T!\" \"Guess what: I don't care!\" Lucy answers. Then she stomps the poor man (always using the foot with you between the big and second toe) giggling. The sound of squishing flesh and cracking bones behind you almost makes you cry...<br>\r\nAnother man yells: \"DAMN YOU!\" Without stopping her giggles, the evil giantess crushes him too using only her big toe and rubs it on the ground (This time using the other foot).</span></div></div>",
            "created":1236574800,
            "id":660162,
            "title":"Bloody tour "
        },
        "11211":{
            "author_id":"shrinkfeet",
            "author_name":"iamtheman",
            "choices":[
                "Another giantess",
                "Your own dad! He's shrunken too!"
            ],
            "content":"<div class=\"\"><div> <span>\"I hope you're having fun little man, because I sure am!\" Lucy laughed as she crushed a building.<br>\r\nShe walks over to a group of homeless people and they look up and scream.<br>\r\n\"Please do not step on us. We don't have much to live for anyway. We just want shelter and food!\" one begged.<br>\r\n\"Awww... that's so sweet! It's too bad I don't give a crap!\" she laughed as she crushed each one of the homeless people one by one with her big toe leaving puddles of blood all over the street. You close your eyes so you don't witness anymore of this horror, but you open them back up when you hear...</span></div></div>",
            "created":1237266000,
            "id":662504,
            "title":"The tour goes on..."
        },
        "11212":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "Run back to Lucy and see if you can become her friend.",
                "Try to find the guide who was helping you before your tour began."
            ],
            "content":"<div class=\"\"><div> <span>As Lucy twists her big toe on top of the shrunken guy she just squished, her toes around you release. Fearing running away you slowly look up at her not knowing what to expect. The raven haired beauty nods towards the rest of the city, \"Get going, it's your first day here after all and you are following orders at least.\"<br>\r\n<br>\r\nYou run across a small park over to a bunch of cardboard skyscrapers and pause. Looking back Lucy is still stomping away in the distance, chasing around a small group of people she's located.<br>\r\n<br>\r\n\"I'm going to squish you!\" Lucy announces as she lifts one massive bare foot up high and brings it down hard on the tiny group as they try to flee. Everyone falls to the ground as the ball of her foot lands hard on one of the tiny guys.<br>\r\n<br>\r\nThe rest try to scramble to get away but Lucy pivots her foot on it's heel, moving her huge toes over top of them and pounding them down on the tiny people. Some of them still struggle to crawl away and she pulls them underfoot with her toes and slowly squishes them down.<br>\r\n<br>\r\nThere's no question about it, Lucy is pretty mean it seems. However she did just let you go so you can't help but feel a little lucky. You wonder if you can find that guy who was guiding you when you first woke up. Then you begin to wonder if he even got away in the first place. He seemed to know what he was doing, so you assume he must have.<br>\r\n<br>\r\nYou nervously look over at Lucy though. She seemed to reconize you before, so if you ran up to her again she'd probably know who you were. Maybe it would be a good idea to try to make friends with this giant girl. Then again, maybe there was another who wasn't so violent that you could befriend instead. Either way you had to figure out something to do. The experienced guy would at least know safe places to hide. Meanwhile Lucy at least seemed to show mercy to you. She's used to everyone running away from her, maybe a tiny friend would be someone she'd keep as a pet.</span></div></div>",
            "created":1318662720,
            "id":1206765,
            "title":" Lucy lets you go and goes after some other people"
        },
        "112122":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "Try to get some sleep and hope that things will make sense later.",
                "Press on and try to find the guide or someone else to help you."
            ],
            "content":"<div class=\"\"><div> <span>Wandering off through the alleys as screams echo behind you followed by the thunderous stomps of Lucy, you begin trying to find your way back to your guide. It was very distracting though, wondering if Lucy would again come upon you at any moment.<br>\r\n<br>\r\nAs you make your way through the streets you begin to realize you have no idea what direction Lucy actually carried you in. The jarring motion of her foot walking along with you wedged between her toes and the world blurring by each time her foot raised into the air made it impossible to tell which way she had walked.<br>\r\n<br>\r\nEverything looked similar to you, not being familiar with this location at all. Or anything else really. You wander over and sit down against one of the cardboard buildings. It's painfully frusterating not knowing how you even got here, or not knowing what else there was to life. Maybe you'd always lived here and Lucy had hurt you badly, causing you to forget your past.<br>\r\n<br>\r\nHugging your knees tightly to your chest you listen to the distant sounds of chaos. You wern't sure where to go next. Was there even a way out of this city? You tried to remember anything the guide had taught you but even that seemed fuzzy.<br>\r\n<br>\r\nYou realize with growing concern that you're incredibly tired. Eventually you'll want to find a place to sleep for the night. You begin wondering what is inside these buildings. That's when it dawns on you. These buildings seem to be constructs, fake reproductions of something else you're used to. So you must come from a place where buildings are more real and not here.<br>\r\n<br>\r\nMaybe a good nights sleep is just what you need. Lucy's tour between her toes definitely exhausted you. However she was still busy tearing the town apart. Was there anywhere safe to hide around this place?<br>\r\n<br>\r\nThere are scraps of cloth in some of the alley ways. It makes you wonder if those places are safe enough to rest in. If you can rest with the stomping girl chasing down people to squish under her bare feet. But your eyes feel so heavy and you reach for one of the cloths nearby and pull it over you. The tight alley would hopefully not be interesting to her.<br>\r\n<br>\r\nYou look up and wonder if you shouldn't just press on trying to find that guide again. Even if you found someone else, they may know what's been going on in this town. Laying there for a few moments you decide if you should just drift off or force yourself to take action now.</span></div></div>",
            "created":1319181540,
            "id":1210456,
            "title":"Feeling tired as you wind through the alley."
        },
        "11213":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Lilith",
                "Lisa",
                "Naoko"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1540588620,
            "id":2569002,
            "title":"Another girl arrives"
        },
        "1122":{
            "content":"<div class=\"\"><div> <span>You quickly turn around and sprit in the other direction. Lucy just shakes her head and slams her barefoot in front of you. She then moves her gigantic hand toward you. You try to run away, but you are grapped by the vixen.<br>\r\n<br>\r\n\"I told you I will kill you if you tried to run. Good bye, bug.\"<br>\r\n<br>\r\nLucy drops you on the ground and slams her foot ontop of you.  She then moves her foot, grinding you into nothing. Laughing as she does. She then walks away from the bloody mess on the floor.</span></div></div>",
            "created":1236488400,
            "id":658133,
            "title":"Forget that! RUN! "
        },
        "1123":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "Run away! ",
                "Beg! ",
                "She torments you. "
            ],
            "content":"<div class=\"\"><div> <span>A torrent of destruction flew overhead. Houses, trees and cars were destroyed without care. Lucy's eyes darted towards the crater.<br>\r\n\"Hey! You almost hit me! Careful!\" Lucy yelled, smashing away an incoming building. <br>\r\n<br>\r\nYou look around helplessly as the world was thrown into chaos, even Lucy looked scared.<br>\r\n\"Hate, hate, HATE!\" A voice boomed out. A chill ran through your bones.<br>\r\n<br>\r\nLisa jumped in the air, cracking the floor as she landed. A gust of wind flung people into the air from the force of her stomp. The town cried as her rage grew, piercing shards of glass gazed from her eyes, ready to strike. Her hair fluttered and swung as she searched. A hand gripped her shoulder.<br>\r\n\"What's wrong?\" Lucy asked, her eyes glinted in worry. Lisa turned, the anger flowed out of her.<br>\r\n\"My boyfriend dumped me...\" Lisa muttered behind tear stained eye's. Lucy smiled.<br>\r\n\"He's over there\"<br>\r\n<br>\r\nYou ran as fast as you could, shouting out as many swear words as you knew. You glanced back, Lucy held a finger out, it was aimed at you. <br>\r\n\"Crap!\" You increase your speed until you his a fleshy wall. <br>\r\n<br>\r\n\"Hello again...\" Lisa spoke darkly. Her feet blocked your escape.</span></div></div>",
            "created":1236574800,
            "id":658750,
            "title":"Rage "
        },
        "11231":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "Lucy laughs and tells Lisa she was just joking to calm her down.",
                "Lisa continues to stomp after you with cruel focus."
            ],
            "content":"<div class=\"\"><div> <span>You turn and run instantly as Lucy continues to point at you and laugh. The worst part of it all is you don't even know if what she said is true! You can't remember anything! Lisa looks vaguely familiar but all you can think is how lucky you'd be to be with her, why would you dump her?<br>\r\n<br>\r\nWith a huge roar of exasperation, Lisa swings her arm back and slams her fist into a nearby building. The walls buckled inward and crumbled away as she pulled her arm free. Quite possibly you may have dumped her because she has some anger issues it occurs to you.<br>\r\n<br>\r\nLisa was also barefoot and you look over your shoulder to see one of her feet slam down on a group of paper cars that people are cowering behind. Needless to say there isn't much left after her foot lands. The few unhurt ones scramble to get away but Lisa's other foot comes forward and starts smushing them out under the ball of her foot viciously. She barely just glanced down at them, her attention was locked on you.<br>\r\n<br>\r\nYou consider your options. Running down a side street would probably just anger her further and she'd plow through anything in her way to get to you. On the other side, she was a giant monster that wanted to destroy you for dumping her and the safety of the city wasn't exactly your concern.<br>\r\n<br>\r\nLucy was also watching you eagerly and would probably help Lisa track you down. What could you do though? The situation seemed helpless and you hoped the people around you hadn't noticed that you were Lisa's target. You continued to run across an open area in hopes of drawing the girls away from the people. That wasn't exactly working though as Lisa intentionally made it her goal to send her giant feet down upon anyone she saw.<br>\r\n<br>\r\nShe was amazing, wearing a dark green tank top and cut off blue hotpants with her brunette hair flowing in the wind behind her, \"I'm going to make you pay for what dumping me!\"<br>\r\n<br>\r\nYou actually pause and wonder if there's a chance the two of you can get back together. That's just before you see another guy your size running towards you and her merciless foot land hard upon him. Her toes clench and you hear him scream as she twists her foot down. No, maybe it's best you two don't get back together.</span></div></div>",
            "created":1318799940,
            "id":1207645,
            "title":"Run away! "
        },
        "112311":{
            "choices":[
                "..fished you out of her top.",
                "..laid with her back on the bed."
            ],
            "content":"<div class=\"\"><div> <span>You keep running in despair hoping that your giant ex-girlfriend will somehow lose sight of you when you see a shadow loom just above you and you freeze. You look up and see the ball of her foot. Behind you there's a wall now, you're trapped. Her toes lower onto you and press you down, pinning you to the floor. If you didn't think you were about to die you'd find this sexier.<br>\r\n<br>\r\n\"Farewell, you bastard.. you weren't enough of a man for me.\" she tells you, and she begins pressing your body with her full weight shifting her pose above you. That's when you both hear Lucy crack up laughing. She stops for a moment still holding you under her toes and looks at her friend \"What's gotten into you all of a sudden?\"<br>\r\n<br>\r\n\"Ahahah, sorry! Just.. that's not your ex-boyfriend ahahah! I just wanted to see how you reacted to that thought!\" she replied.<br>\r\n<br>\r\n\"What..? You tricked me?? Damn you Lucy! I thought I had him, you big liar!!\"<br>\r\n<br>\r\n\"Awww, come on girl! It was just a little prank!!\"<br>\r\n<br>\r\nYeah, you thought, a prank that was about to end your life in a pathetic miserable way. You make a mind note not to ever trust Lucy after this.<br>\r\n<br>\r\n\"Prank my ass! I don't care about this bug more than I care about ever other one in this city but tricking me into killing someone just because I think he's someone else.. that's low, even for you!\" Lisa was really mad at her it seemed, even if she didn't seem to care about you at all. Maybe you could use this in your favor if you managed to live until tomorrow.<br>\r\n<br>\r\n\"Oh, come ooon.. tell you what.. I'll let you finish playing here while I go hunting for your boyf.. sorry, EX boyfriend and I'll bring him to you, tied up in the city's square as soon as I can, deal?\" Lucy proposed, hoping to calm her friend down.<br>\r\n<br>\r\nLisa then removed her foot, getting tired of keeping it raised from the floor not to squish you, and crouched. In a moment you felt your body being completely tangled in her hand and she raised bringing you to eye level, only then you could see just how full and round her breasts were, semi exposed to you from your point of view. \"Mmmm.. I still want to play, that's true.. but I'm also used to have my \"special treat\" before bed, and since I put you through all this already..\" she looked directly in your eyes \"..I'm gonna make it up to you, little man.\"<br>\r\n<br>\r\nYou didn't really understand what she meant by that but before you replied in any way you felt a huge change in gravity as she lowered to her cleavage and set you between her tight boobs. You squirmed out of panic, at first.. but then found it incredibly comfortable and found yourself wishing you could stay like that forever, tiny and held between the breasts of the hottest girl you've ever seen. She brought you down until you were no longer visible and you heard Lucy comment. \"Wait! You can't do that! You know it's against the rules to bring one home! Lilian won't allow you to..\" but Lisa silenced her with the finger she pressed you down with brought upon her lips.<br>\r\n<br>\r\n\"Lilian doesn't need to know, and it's not a big deal if I kill him later tonight of here now, right?\"<br>\r\n<br>\r\n\"Yeah, but what about the remains?\" Lucy remainded her.<br>\r\n<br>\r\n\"I'll just eat him whole, that's what I'll do. No remains, no body left, no need to worry about our little secret city ever be revealed. You owe me after that prank. If you like you can have my ex boyfriend.. just promise me one thing.\"<br>\r\n<br>\r\nLucy's eye widened as she'd won the first prize and smiling asked \"What is it? Just say the word!\"<br>\r\n<br>\r\n\"...Make him suffer. Lots.\" you captress ordered her friend. \"Do this and we'll be cool about today.\"<br>\r\n<br>\r\nLucy always seemed to live in Lisa's shadow and agreed nodding happily. \"I'll make him regret leaving you, babe.\" The two giantesses (to you) then hugged tightly and you were pressed between Lisa's boobs as she held Lucy closer. They then said goodnight and Lucy stayed in the city to hunt some more shrunken people while Lisa walked home.<br>\r\n<br>\r\nA good half an hour passed and you had found your perfect position while completely engulfed by the girl's enormous tits, then you heard a bell ring and a door slam. She was home. You felt yourself bouncing while the girl carrying you proceeded up the stairs to her room, a light was turned on and another door was shut. And locked.<br>\r\n<br>\r\nLisa then approached her bed and..</span></div></div>",
            "created":1426502460,
            "id":1948922,
            "title":"Saved by the bell"
        },
        "1123111":{
            "choices":[
                "..my pussy licked before bedtime.\"",
                "..my nipples stimulated before bedtime.\""
            ],
            "content":"<div class=\"\"><div> <span>You feel her breast's weight being lifted off of you and the next moment her tree sized fingers fish you out of her top and drop you on something fluffy, pink and kind of flurry. You get to your feet again and realize that she dropped, considerably lightly, on what must be her bed as you can only see her from her knees up. And she's staring at you serious. You start wondering whether you should run or not when she begins explaining your situation.<br>\r\n<br>\r\n\"Welcome to my room, little bug. Consider yourself lucky, you're the first to ever see this place, let alone be alive after I had you pinned under my foot.\" she smiles somewhat wickedly. \"The reason you're still alive and ticking is simple: I was dumped today as you probably learned by now and I'm used to have some ..special treatment every night before sleeping. Now, since my good for nothing ex boyfriend who's soon gonna be a stain under Lucy's foot isn't here to satisfy my needs anymore and you're the only thing I thought for a moment could help me with it, you're going to fall in and give me that treatment, understand?\" she finishes crouching and getting closer with her head to the bed to see your reaction.<br>\r\n<br>\r\nYou fall on your butt again as you see her approach you with her face so fast and she puts up an expression that suggest she's not expecting much from you. \"Coming to think about it again, maybe you're just too weak for this task.. maybe I should just masturbate while I eat you and forget about it..\" she starts thinking out loud.<br>\r\n<br>\r\nYou understand precisely what she means and you need to prove to her you're more than you appear, not a weakling but someone who can get \"the job done\", even if tiny. So you raise again and yell her \"My wonderful goddess, if you need a treatment before sleep then a treatment is what you'll get.\" and try to look big and extraordinay with your most confidence pose to this titan in front of you.<br>\r\n<br>\r\nHer lips turn to a curious grin and she chuckles. \"You a confident, I'll give you that. But we'll see if you're really up to the task little guy.\"<br>\r\n<br>\r\nThat said she raises in all her glory and begins taking off her top revealing the most perfect and surely biggest pair of tits you've ever seen, even online (and you did spend a lot of your time there looking for what you're seeing right now). She then drops her clothing over you and you fall flat under its weight. By the time you manage to crawl out and find an exit she's already taken off the rest of her clothes and is completely nude in front of you. Her trimmed pussy hair forming a landing strip, you make a mental note of that for future reference. Just in case you get stuck in her panties and need to find the way out.<br>\r\n<br>\r\n\"So little guy..\" she puts her hands on the sides of her breasts caressing them. This whole thing is getting you very horny by now, you realize. \"..I'm used to have..</span></div></div>",
            "created":1426598160,
            "id":1949371,
            "title":"Pet for a night"
        },
        "11232":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "choices":[
                "She stomps you",
                "She steps on you slowly"
            ],
            "content":"<div class=\"\"><div> <span>You stumbled back and shook your head from the impact. As your vision cleared you could see a mighty bare foot, just a couple of feet in front of you. Immediatly you realise what happened and the only thing left for you to fall onto your knees and beg for your dare life. You started crying and crawled over to her foot to hug and kiss it. <br>\r\n<br>\r\nIn your dispair you even rub your whole body against the soft flesh, wettening the youthful skin with your tears. Crying something under tears, that not even you would have understood. <br>\r\n<br>\r\nA quick movement let you fly through the air. \"Pathetic\", you hear from high above you. As you look up you see her standing there, her arms folded in front of her breasts. Lucy was standing next to her, hands on her hips. \"what happened to your big mouth you had just a few hours ago\" - \"No, please\", was the only thing you could stutter. <br>\r\n<br>\r\nThe sky above you darkened as her face dissapeared and you had a clear view to the sole of her beautiful foot. it was a gruesome view. Pieces of paper, soaked in blood where sticking flat beneath it. Shredded pieces of clothing where hanging mostly next to pieces of meat and smashed guts which where still dripping with blood. <br>\r\n<br>\r\nYou stared at this view with terror in your eyes and your mouth wide open. You couldn't believe that this all was happening to you. It seemed you have dumped the wrong girl. </span></div></div>",
            "created":1245042000,
            "id":708851,
            "title":"Beg! "
        },
        "112321":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "content":"<div class=\"\"><div> <span>You didn't really saw how her foot smashed down ontop of you. Instinctivly you tried to Throw your hands up, but before they could even Twitch, all your bones where smashed to bits and you died just before your body split open and your guts burst out with incredible speed. Even your arm was snapped off your body by the incredible force of her ragingstomp. <br>\r\n<br>\r\nAs she lifted her foot, your body was completly torn appart. Some parts of your Flattened corpse where stuck to her foot while some where still on the ground. Not even an split second later her foot landed again on the same spot, flattening you even more. She did this for about two more times, stomping you into oblivion before she twisted her foot on your remains and dragged it back. <br>\r\n<br>\r\nLisa was a little bit exhausted from her stomping spree and a little bit dissapointed that she couldn't make out anything of you. Neither on the bloody ground, nor under her dirty feet. <br>\r\n<br>\r\n\"Thats what I call to settle foot in a relation\", Lucy laughed. <br>\r\n<br>\r\n\"Ohhh that felt soooo good.\", Lisa moaned and tapped her foot a couple of times in the bloody spot. \"I think we should gather more Ex-Boybugs\", she said. </span></div></div>",
            "created":1245387600,
            "id":710449,
            "title":"She stomps you"
        },
        "112322":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "content":"<div class=\"\"><div> <span>You just stare up at her foot like deer into the headlights of a car. She lowered her foot slowly onto the ground. Blood was dripping down around you and other stuff fell off her sole. <br>\r\n<br>\r\nHer heel landed somewhere behind your feet with a loud noise. Her sole lowered towards you. Ever so slowly. <br>\r\n<br>\r\nYou awake from your terror as the fleshy ceiling was just 6 feet above you You tried to stand up, turn and run but a sharp pain lets you fall flat on your face again. Your leg had been smashed as she kicked you off her foot. You look behind you. Her foot was just inches away from you, so you trie to crawl away as fast as you could with your arms only. You didn't came far as you felt the warmth of her foot just inches above you. Then you felt the sticky, bloody filth of her sole. <br>\r\n<br>\r\nYou scream of terror as the flesh touches you and suddenly you are unable to move from the pressure. as her weight settled on you more with every split second. Your legs flatten away. That is the moment you stop trying to scream from terror, but from sheer unberable pain. Your body gives away inch by inch by her slow, casual movement. You just give a slight resistance to that divine womens weight. <br>\r\n<br>\r\nAs your spine snap appart from the tension on your hips you are relieved from the pain. Your complete body is numb. Then you have to puke up something. Your throat is thickening and your jaws break appart as blood and organs are forced out of your mouth. This sight was held away from you by death. <br>\r\n<br>\r\nThe girls just giggled as the screams under Lisas foot where replaced by gurgling noises as the you started to throw up. <br>\r\n<br>\r\nHer foot touched the ground as your skull gave a way with a slight crack. Your body started to squirt out between her toes as she raised her heel and gave full pressure on the ball of her foot. She wiggled her toes a bit and twisted hard on your remains. <br>\r\n<br>\r\n\"Don't think he is going to fool around with no girls anymore\", Lucy said. <br>\r\n<br>\r\n\"I think I have done the world a great favor. The world would be a far more better place if every girl could treat her boyfriends like that\". The two burst out in laughter. <br>\r\n<br>\r\n</span></div></div>",
            "created":1245387600,
            "id":710459,
            "title":"She steps on you slowly"
        },
        "113":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "choices":[
                "You run away while she is distracted",
                "She keeps on looking down at you",
                "She plays with you while she is on the phone"
            ],
            "content":"<div class=\"\"><div> <span>...A Girl you seem to know from your dreams. Way above you, after her seemingly endless legs have ended in a cut off blue hotpants and the enourmous plane of her flat stomach and even above her perfekt tits, which seemed to make the tight fitting, darkgreen tanktop burst, you see her face. She looks down at you and smirks. You know this girl... She was in your dreams often, but in real life she is in the same school with you. Two grades above you. She loved to tease with her goddesslike body and her flirting attitude, making almost every man pass out from the sudden bloodloss in their brains. She knew how to enslave men. She had made even older guys eat their lunch from the floor under the table... with one of her feet ontop of it, because she felt like it and gave them the slight chance of a date with her. <br>\r\n<br>\r\nNow you where at her feet... And could barely climb the nail of her big toe. She was a true goddess now and after what the guy told you not a very kind one. <br>\r\n<br>\r\nSuddenly you heard a strange buzzing sound. Lisa put one hand in her giant cleavage and fished a celly out of between her breasts.<br>\r\n<br>\r\n\"Hello?...\" she answered into the device.</span></div></div>",
            "created":1235883600,
            "id":654422,
            "title":"Lisa"
        },
        "1131":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "To the door",
                "A few steps"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While she's distracted talking on the phone, you take the opportunity to escape.<br>\r\n<br>\r\nHow far do you get before she notices?</span></div></span></div>",
            "created":1400860980,
            "id":1800885,
            "title":"You run away while she is distracted"
        },
        "1132":{
            "author_id":"etcetera",
            "author_name":"Neon",
            "choices":[
                "Lisa finishes her call, her and Lucy storm the city.",
                "Lisa leaves, and Lucy takes over. She doesn't know about you.",
                "The other four girls come into the room, and they all decide to attack the city."
            ],
            "content":"<div class=\"\"><div> <span>Wow, it actually worked, I thought. I hadn't believed it when one of the men a the town hall, a scientist, said he'd hotwired a shrunken cell phone to actually work in calling a normal sized phone, but he'd done it all the same. A woman a few days before  had overheard the giantess Lisa's cell number and the scientist had actually succeeded in calling her. It was just a distraction though, but I'm not going to pass it up. I start to run for it, and out of the corner of my eye I see Lisa is still eying me, with a mischevous glint in her eyes. She starts to flex her tanned toes, just a few regular feet from myself! <br>\r\n<br>\r\n\"Oh shit,\" I yell, knowing now the distraction had failed. \"Keep going!\" someone yelled from the city, and I regretted even coming this close to my crush. I see Lisa's foot hovering over me as you run with all my might. It slams down right behind me, sending me somersaulting forward. I'm about a yard of regular distance from the city border. If only I can outrun the feet attached to colossal, possibly insane woman! I can hear Lisa hang up and start stepping again. I know she is playing with me, or else she'd have easily squashed me by now. It's frightening all the same.<br>\r\n\"Oh (insert name here), come back. I just wanna, um, play with you.\" Another stomp lands nerve-wrackingly close to your body, and you are once again sent flying through the air. <br>\r\n<br>\r\nJust when I'm at the border, Lisa recieves another call. She pauses for a moment, her sole hovering over my frail form, and then answer the cell phone. \"Hello?! Is this another prank call?\" An unknown voice is heard through the line, and I'm sure it''s not the scientist.<br>\r\n\"Oh, hey Lucy. Yeah, you can come in. I'm not really doing anthing big. Just playing.\"<br>\r\nI started getting angry. She calls almost killing em several times for the fun of it PLAYING? i run ever harder and make it inside the first building you see. \"Lucky me,\" I say sarcastically. \"She's just gonna come right back.\"</span></div></div>",
            "created":1239253200,
            "id":672982,
            "title":"She keeps on looking down at you"
        },
        "11321":{
            "author_id":"efilsgod",
            "author_name":"Pedro",
            "choices":[
                "Lucy finds you",
                "Lisa finds you again "
            ],
            "content":"<div class=\"\"><div> <span>Lucy comes in. She's wearing a white tank top and beige panties. Just like her friends, she enjoys walking (and stomping) barefoot, so she takes off her sneakers and her socks. <br>\r\n\"Hello Lisa! Nice day to rampage\" She says. Lisa answers: \"Hello Lucy! Come on, our city is quite fun today, they're all pretty terrorized. Let's show them our beautiful little feet.\"<br>\r\nLucy takes her first step into the city, crushing a small house underfoot. Her second step squishes a bunch of people. She rubs her foot on the ground with a blissful expression on her face.<br>\r\nMeanwhile, Lisa forgets about you and walks almost casually around that big toy city, stepping on people, cars and buildings and enjoying that a lot. Every time she stomped on something or somebody she made a cute smile.<br>\r\nOn the top of a plastic skyscraper, a men is going to jump to end his pointless life as a useless toy. Lisa pushes him with his long fingernail, bringing him to the centre of the building's top. Smiling sweetly, she lays her bare foot on the skyscraper, in front of the man's face. \"I know what you were going to do\" she says gently stroking her foot \"Well, my feet don't agree. They're the ones who want to decide about your life. No, I'll correct myself: even my MOUTH wants!\" The giantess picks up the screaming suicide attempter, slowly puts him in her mouth and chews him with a delighted face. Then she swallows him and slowly licks her lips.<br>\r\nMeanwhile, you're very confused and you're running around without any clue.</span></div></div>",
            "created":1244523600,
            "id":705187,
            "title":"Double trouble "
        },
        "113212":{
            "choices":[
                "Picked up by giant pussy",
                "Crushed beneath Lucy's love monster"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, there you are little Johnny!\" booms the beautiful brunette. Her sparkling blue eyes are magnificent. How could this bombshell be so evil you thought to yourself. Before you could make it into the closest building, Lisa lightly knocks you down with her long foot and drags you out into the middle of the street. <br>\r\n<br>\r\n\"Hey Lucy, here's that kid that is always drooling over you in school.\" You are pinned with your legs under her massive toes. Banging on the flesh in front of you, you beg to be let go. Lisa rolls you around what might seem playful to her, but frightening and painful to you. <br>\r\n<br>\r\nLucy walks over and flips her long black hair seductively. \"I bet you always wanted to see my pussy little guy. Well, I am feeling generous today.\" Oh no, although she is correct that you always wanted to fuck her, this would not be good at her current size. <br>\r\n<br>\r\nLucy slides down her beige panties and kicks them over on top of a building, trapping at least 2 people underneath the silk fabric. Lisa is still holding you trapped under her toes. Lucy turns around and you see the largest vagina ever. It starts descending toward you. Holding up your hands to ward it off just makes the girls laugh, \"What, don't you want a little pussy?\" They mock you.<br>\r\n<br>\r\nThe fuzzy, nicely trimmed fur parts, revealing monster-like pink lips. All of this domination must be getting her aroused, because it is glistening. As she gets closer, her love juice starts dripping onto your miniscule body.</span></div></div>",
            "created":1319211300,
            "id":1210564,
            "title":"Lisa finds you again "
        },
        "11323":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "a srange noise like fighting and gunfire"
            ],
            "content":"<div class=\"\"><div> <span>when the four other girls came in the 1st girl said that she found someone to play with and asked them for your help. they said ok where is he at. she said somewhere in the that building. they said ok. when you heard her talk about you  the roof comes off the building come off and you faint the last thing you here is...</span></div></div>",
            "created":1287118800,
            "id":975762,
            "title":"one is enough but four others."
        },
        "113231":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "yes i want to get back at them",
                "that depends, what kind of missions do you do"
            ],
            "content":"<div class=\"\"><div> <span>You here yelling and gunfire going off and like someone running away when you wake up you see people armed with guns. they are wereing night colors. when you get up they greet you. welcome we are know as the resistence. we fight of those giant girls. you say some kind of welcome i was about to be a toy. well that happens they shrink you and you are either a victim,a toy, or a pet if your lucky. you ask what kind of gun is that? one man said it is a very painful laser gun. it can burn through anything and hurt anything. so down to brass tack we are short on soldiers and were wondering if you like to join us?</span></div></div>",
            "created":1287118800,
            "id":975768,
            "title":"the resistence"
        },
        "1132311":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "your team welcomed you to the resistence",
                "another scream is heared"
            ],
            "content":"<div class=\"\"><div> <span>yeah, i will join. time for some payback for what they done to the people here. one solider said thats the spirit. now lets get back to base and get you properly dress for a fight. they took you to a building, but it was destroyed. one of the solider said dont be fooled. thats how we dont raise any suspicion on where we come from. so they took you in the building and got suited up for the resistence. you got friendly with everybody there. now we recieve word that they will be looking for some revenge for what we did to them when we rescued you. so whats the plan? like always defence. protect anybody you see that is in danger. we roll in teams,but to see if you mean your ready to fight. you have to go alone. ok where do i... before you finish you hear a scraming noise. that our cue go go go. you rush out on the field and see the girls again tearing up the place looking for the people responsible for hurting them. you see the others get in hiding spots to attack and wait for them to come to you. so you hide to. when they come your way you guys open fire on them. they tried thier best to protect themselves,but the laser hurt anything. you see one guy get too excited and go in the open. one of the girls throw a car at him. he barly dodges it,but is hurt that he cant get up. they see this as an chance to kill him. thinking brothers before mission. you asked the others to cover you. they do and you bolt for your teammate and carried him to safty. the girls had no choice but to retreat. you and your teammates stopped firing and you check on your teammate. he said you risked getting killed to protect me? yeah. i dont know about you guys,but i belive in no man left behind. the captain came and said son that was damn brave of you. so i am making you an offical resistance member. thank you sir.</span></div></div>",
            "created":1287378000,
            "id":977473,
            "title":"yes i want to get back at them"
        },
        "11323111":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "none of the girls come your way",
                "one girl comes your way"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the fight rook. so you ready to kick some girl butt? ohh yeah. i want to do this when i saw what they did to that man in the park. yeah he ready for a fight. one of the members say. ok lets get back to base and get on our next mission. when you got to base you when to the breifing room. ok we need to now when they are coming back at us. so i need two people to go out of the city and do a little lisening in on them. rook you and eric go and see when they are coming at us. yes sir. you and eric go out of the city and find the girls in the living room you peek around the coner and listen in on them. damn since when did those guys get help? i know. we use to rule,but know we are fighting those guys off. said lilian. mabey if we catch one and interigate him. he will give up where they are hiding at.said lisa. good God. you patch to command. sir sir are you there? loud and clear rook. whats going on? we heard that they are planning to catch and interigate one of us and make us spill where we are at. we cant let that happen. come back and help us protect the city. yes sir out. well what did he say? asked eric. he said come back and help protect the town. ok lets go. you and eric get back to the city and help prepare for an attack. rook take downtown. yes sir.</span></div></div>",
            "created":1287464400,
            "id":978008,
            "title":"your team welcomed you to the resistence"
        },
        "113231111":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "a noise was heard",
                "the guys wake up in the morning"
            ],
            "content":"<div class=\"\"><div> <span>you walk to downtown and none of the girls come your way. you get bored and sit on the bench. you decied to see if your teammates need any help eric eric you there? no awnser. you tried the others and still no awnser. sir sir are you there? you do here something. like someone yelling at someone. you here the girls asking where is your hideout? then sarge said rook we have been capture. dont come we cant affored you getting captured. good thing the girls didnt hear him talking to you. do you guys have your guns with you? you asked. no we dropped them. they had surround us and threaten to kill everybody if we didnt. i am coming to get you. kid no its to dangerous. its 5 on 1. you cant win. but what about you guys? we will be fine. just dont come kid. for the resistence. then all you hear is static. this made you mad. they threaten to kill everybody,took my teammates,and the one that really made you made that sarge voice sounded like he had no hope. you when back to baseand waited for night. when night came you when out of the city and looked for the guys. you found them on the counter. you climb up there and look at them. they were hurt and there clothes were teared. you take them back(good thing their training made you strong enough to carry them back anything) to base and put them on their beds. the sarge came back and expected to be in the cage,but found himself in bed. he said kid you did this. like i said before. brothers over mission. kid yiu make a fine solider. then he fell out. when morning came...</span></div></div>",
            "created":1287464400,
            "id":978028,
            "title":"none of the girls come your way"
        },
        "1132311111":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "later that night",
                "during the day"
            ],
            "content":"<div class=\"\"><div> <span>The guys were still asleep. man must have done alot to you guys. when you go to eat breakfast. a noise was heared like screaming. you grab your gun and when outside. the girls are tearing down the place. one of the girls see you and contact the others. are you the one who took the guys in the cage back? asked lilian. why should i respond to you? this one has guts.said lucy. yeah. well are we going to kill him or not?asked naoko. yeah lets get him. the fight started. within 5 minutes your wondering why am i fighting them? when there is a pause in the combat you put your gun up and walked away from them. hey where are you going? yeah we are not done yet, said julie. you want to know why i am leaving? because your not worth it. everbody in that area heared your comment. are you insulting us?asked lucy yeah, we could kill you.said lisa. you guys go around killing everybody here and when  somepeople start satnding up. you guys get mad and kill everything that moves. hell i dont know why you guys are afraid of them. look at them and tell me what you see. the people look and agree. yeah why are we afraid of them? asked one person. another said yeah. the guy is right they arent so scared. come on lets go they arent even worth our screaming and suffering. the people start walking away from them. well seems like the people have spoken up to their old destroyers. you walk away laughing at them. lucy said. why that little. she raised her hand to smash you. you pull out your gun and fire. oww. lucy said. like i said not worth it. when you get to base your guys are awake. you told them the story. you said they arent worth it? yeah. sarge came and said. son you got a name? drew. drew i am making you my top solider. which means you can give out orders to you team. thank you sir.</span></div></div>",
            "created":1287550800,
            "id":978463,
            "title":"not so scary now are ya"
        },
        "1133":{
            "author_id":"efilsgod",
            "author_name":"Pedro",
            "choices":[
                "Naoko",
                "Lucy",
                "Julie"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, hello my dear!\" Lisa says. Meanwhile, she slowly puts a huge bare foot on you to prevent your escape. You're now under her sole, feeling smooth skin on you. You're not hurt, just held there.<br>\r\nLisa proceeds her conversation: \"I'm just stomping a little in our small city. Right now I'm keeping underfoot a new inhabitant I shrunk today.\"<br>\r\nIn the meantime, you try to do your best to crawl away from that titanic foot. Using all your force, you manage to go under Lisa's toes. The giantess giggles and says: \"Aww, he's moving under my foot, that's ticklish!\"<br>\r\nLisa playfully flexes her toes, making them tickle you. You're able to run away, but Lisa gently kicks you, making you fall. While she's playing with you with her toes, she says: \"OK, come here as soon as you can. We're gonna have a little fun together. Bye!\" She turns her phone off \"Now cutie, you're going to meet...\"</span></div></div>",
            "created":1235970000,
            "id":654843,
            "title":"Telephone conversation"
        },
        "11332":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Run away screaming",
                "Nothing. Your fate would be worse, if possible, if you ran away",
                "Suck up to Lisa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Now cutie, you're going to meet Lucy! She's not as nice as me!\"<br>\r\n<br>\r\nWhat do you do?</span></div></span></div>",
            "created":1400860740,
            "id":1800882,
            "title":"Lucy"
        },
        "114":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "choices":[
                "Kiss the heel",
                "Don't move in terror",
                "Try to run away screaming"
            ],
            "content":"<div class=\"\"><div> <span>Julie looked down at you with her innocent smile and put a strain of her long, raven black hair behind her ear.  You knew her from distance. She was the new girl in the neighborhood, born and raised in Venezuela she came here last year and made a dash in popularity. She was really beatiful although she was just 5 ft tall, she was 5 foot of sex. Her innocent face, her nasty looks and her cold attitude together with a short temper was a mixture which almost no male could resist. She was the type of girl that men do everything she wants just to get her slightest attention. <br>\r\n<br>\r\nShe always had men at her feet, but standing next to one of those gigantic peds was just scary. Her Legs, gigantic collums, high like buildings seemed even longer in her hotpants. The tight fitting tanktop seemed to try to keep her large bosom in rein. Her cold eyes looked at you for quite some times. Then she looked away for an instant and the mighty foot in front of you lifted away. It flew a few feet before her heel buried the man who introduced you underneath it. Crushing him instantly with an wet crunch. Trails of blood splattered in every direction and covered parts of her Skin. She lifted the ball of her foot and twisted her heel a little. An arm stuck out from underneath and you could see it moving unnaturaly with every motion her foot did. The sound almost drove you insane as the bones burst underneath her weight and wet squishing of the internals mixed with blood. You still sat there paralysed. \"I wont repeat myself again!\" you heard a commanding voice from above you. \"Kiss my heel! NOW!\", Julia said. You looked to the bloodcovered foot and up to her unforgiving face. You where still dizzy from shock.<br>\r\n<br>\r\n</span></div></div>",
            "created":1260421200,
            "id":804076,
            "title":"Julie"
        },
        "1143":{
            "author_id":"username3141",
            "author_name":"ΩGIANTESSWRITER",
            "choices":[
                "Give yourself up",
                "Run further",
                "Stay put"
            ],
            "content":"<div class=\"\"><div> <span>Gathering some of your wits, you looked up and down the Monster that stood in front of you. Her smooth, cleanly shaven ankles were above your height. Looking higher, you saw two towers of black - each one of her legs in her tight sweatpants. Your vision was still too blurred to see her face, already barely visible from her mountainous breasts, but you could gather enough sense that you had to run. Run fast and run far. You ran as fast as your legs could take you across Julie's wooden floors. But unfortunately, she had caught you in the act. <br>\r\n<br>\r\n\"HEY! What do you think you're doing!\" Julie yelled down at the city. Her Hispanic accent sounded lovely and created some sexual tension, but the sheer volume of her voice sent everyone else into hiding. You ran down the 'street' and thankfully managed to run behind a building. Clearly frustrated, Julie screamed \"HOW DARE YOU RUN FROM ME! I'LL HUNT YOU DOWN!\" As she swatted down a cardboard building, watching it leak red as it hit the ground. In an angry rage, Julie began to smash down buildings with her smooth, massive feet. \"Where are you? I promise I won't hurt you if you come out!\" She grinned as she picked up a building and looked inside. \"Are you in there?\" She cooed. \"No? You're useless to me then!\" She crushed the building in her grasp. <br>\r\n<br>\r\nHer cold, black eyes glared down at the city, almost as if lasers would emerge and burn it all down. Quickly, she scooped up a random citizen and asked \"Where is he?\" The man was petrified. \"WHERE IS HE?\" She quickly raised her voice. The man between her fingers fearfully shook their head and Julie tightened her grip. Not enough to kill they guy, just to pressure him. \"Fine. Maybe you can be some use to me as a snack.\" Julie brushed her long black hair away from her face with her free hand and dropped the man inside, swallowing him whole. <br>\r\n<br>\r\nLooking out from your hiding spot at the angry goddess' rampage, you realized that she'd destroy the place before she found you. After some thought. you decided to...</span></div></div>",
            "created":1557426540,
            "id":2657538,
            "title":"Flee    ?"
        },
        "115":{
            "choices":[
                "the girl see's you and picks you up",
                "you go into a bulding",
                "she steps on you"
            ],
            "content":"<div class=\"\"><div> <span>You look up at the giantess in front of you, to see a beautiful, asian girl standing there. You didn't know how to react, she was so cute, you almost wanted to be with, but you knew that was basically mean you'll get crushed, so you got up and starting running away when...</span></div></div>",
            "created":1279688400,
            "id":921701,
            "title":"Naoko"
        },
        "1151":{
            "author_id":"etcetera",
            "author_name":"Neon",
            "choices":[
                "Naoko plays with you, poking at you with her finger.",
                "She tucks you away for safekeeping in her bra.",
                "The Asian giantess dangles you in front of her face for examination."
            ],
            "content":"<div class=\"\"><div> <span>You are torn between fleeing the scene while you have the chance and catching the eye of the oriental colossus. The decision is made for you, though, as you wisely run before you can become a victim of the vexing beauty. In your peripheral vision, you notice Naoko's head turning around to survey your side of the city. The man who had been with you had since disappeared from sight, probably slipped into one of the buildings nearby. You shake your head at your bad luck, but it was about to get worse. You haven't gone under her radar in the slightest, because a running person is much easier to spot as a hidden or motionless one. In effect, you had brought this on yourself by not slowly hiding behind a bush or something, but now you might as well run with all your might.<br>\r\n<br>\r\nAs much as you were confident about that, the odds were not even close in your favor. With a graceful yet destructive bound, Naoko is now standing just inches behind your fleeing self inside a newly-formed crater that she had made. The aftershock actually sends you rolling head over heels in front of her, bringing an amused smile to her lips. With the posture of a ballet dancer, the predator scoops you up in a swift stopping motion, leaving you helpless in her hand before you had even known what had happened. A soft laugh emits from her lips as you display your confusion, but you didn't think anything was funny. Eyes wide with fear, you roll over on your back to see Naoko gazing at your trembling form, something that is both enticing and frightful at the same time. </span></div></div>",
            "created":1279947600,
            "id":923806,
            "title":"Good Effort"
        },
        "11511":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "\"Keep you as my own personal plaything.\"",
                "\"Torture you a bit, and then I'll crush you!\""
            ],
            "content":"<div class=\"\"><div> <span>You were trembling in the hand of this oriental goddess, not knowing what to expect. Suddenly, you see her free hand approaching you. You curl into a ball in anticipation of what's next. You expected pain, but what you felt was something else; She had extended her index finger toward you and was now tickling your tiny form! As she continued to tickle you, you couldn't hold back your laughter any longer. As you burst with laughter, you began begging her to stop.<br>\r\n<br>\r\n\"Haha... Please... Hahaha... Stop! Hahahaha... I can't... Hahahahaha... Take it!\"<br>\r\n<br>\r\nTo your surprise, she actually stopped. She was now simply staring at you with a broad smile on her face. You caught your breath, and then addressed her again.<br>\r\n<br>\r\n\"Excuse me, who are you? Why am I so small? And most importantly, what do you plan on doing with me?\"<br>\r\n<br>\r\nShe simply giggled.<br>\r\n<br>\r\n\"My, my... For someone so small, you certainly ask a lot of questions... Well, to answer your questions in order: I'm Naoko, one of my friends shrunk you for us to play with, and I plan on having some fun with you of course!\"<br>\r\n<br>\r\nThat last answer worried you.<br>\r\n<br>\r\n\"*gulp* What do you mean by 'have fun with me', Miss Naoko?\"<br>\r\n<br>\r\n\"That should be obvious by your size; I'm going to ________.\"</span></div></div>",
            "created":1298005200,
            "id":1056404,
            "title":"Is she a friend, or a fiend?"
        },
        "115111":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "\"Take you home with me and introduce you to the rest of my little toy friends.\"",
                "\"Go and catch a few more toys in this little city to bring home along with you.\""
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to keep you as my personal toy!\"<br>\r\n<br>\r\n\"*gulp* What does that mean? Please don't hurt me! I'll do anything!\"<br>\r\n<br>\r\n\"Calm down, little guy... Don't worry, I'm always pretty gentle with my toys. A lot of the men that I've already captured have actually started to like their new lives. I don't ever hurt them on purpose, and I make sure that they're always well fed. You should be glad that you got caught by me, and not one of my friends. They have a tendency to break their toys...\"<br>\r\n<br>\r\nYou feel slightly comforted by the fact that she appeared to be gentle, but you weren't so sure you liked the idea of being her toy.<br>\r\n<br>\r\n\"Ummm, Miss Naoko? Why did your friends pick me to shrink?\"<br>\r\n<br>\r\n\"Well, first of all, there's no need to be so formal. I like to think of my toys as my friends, so you can just call me Naoko. As for why they shrunk you, I guess you were just in the wrong place at the wrong time. It's nothing personal, I promise you that. But like I said before, you might learn to enjoy your new life with me.\"<br>\r\n<br>\r\n\"Okay then, Naoko... So what are you going to do now that you have me?\"<br>\r\n<br>\r\n\"That's an easy one! I'm going to ___________.\"</span></div></div>",
            "created":1298005200,
            "id":1056413,
            "title":"Toy to a goddess? Not as bad as you might think..."
        },
        "1151111":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Yes. You are greeted by several little people, all looking happy to see Naoko!",
                "No. As you enter, you see several little people run into hiding!"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm gonna take you back home to introduce you to the rest of my toys!\"<br>\r\n<br>\r\n\"Okay then...\"<br>\r\n<br>\r\nYou realized that you didn't have much of a choice in the matter, but you were starting to get a bit comfortable with Naoko. Maybe this wouldn't be that bad after all.<br>\r\n<br>\r\n\"So little guy, I'm going to have to put you into my pocket so that nobody sees you on the way home. You can look around while you're in there, but just try not to fall out, okay?\"<br>\r\n<br>\r\nShe then placed you into her pocket so that your head was just barely sticking out. It was a little tight, but not completely uncomfortable... She then began to walk home. After about half an hour, she arrived at the door to a nice looking house.<br>\r\n<br>\r\n\"Well, here we are little guy! Your new home!\"<br>\r\n<br>\r\nYou are starting to have doubts by now. What if all the stuff she said earlier was just some ploy to get you into a false sense of security? As she opened the door, you were worried that there would be an evil lair or something behind it. She simply smiled.<br>\r\n<br>\r\nWas your new life really going to be as enjoyable as she claimed?</span></div></div>",
            "created":1298091600,
            "id":1056828,
            "title":"Meeting the toy troops"
        },
        "11511111":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "\"We're going to play a game now!\"",
                "\"It's time for the toys to have their lunch!\""
            ],
            "content":"<div class=\"\"><div> <span>As she opens the door, you are surprised by what you see: several tiny people no bigger than you immediately dropped what they were doing and ran to greet there owner!<br>\r\n<br>\r\n\"Welcome back, Miss Naoko! How was your day today?\" they all said in unison.<br>\r\n<br>\r\nNaoko simply giggled.<br>\r\n<br>\r\n\"How many times have I told you, you can just call me Naoko... Anyway, I had a great day, thank you... And I also brought home a new friend for you all!\"<br>\r\n<br>\r\nNaoko then reached into her pocket and pulled you back out. She then set you on the floor near the rest of the group. You looked up at her, and she simply smiled. She then gave you a gentle nudge with her hand to urge you to walk toward the group.<br>\r\n<br>\r\n\"Well, what are you waiting for? Go ahead and introduce yourself... Geez, now that I think about it, I completely forgot to ask your name earlier...\"<br>\r\n<br>\r\nYou proceed to introduce yourself.<br>\r\n<br>\r\n\"Ummm... Hello everyone... I'm Steve... Nice to meet you all...\"<br>\r\n<br>\r\nThey again responded in unison.<br>\r\n<br>\r\n\"Hello Steve!\"<br>\r\n<br>\r\nNaoko then knelt down and said:<br>\r\n<br>\r\n\"Well Steve, I think that I'll give you some time to get acquainted with the rest of the family... Hehe, see you later!\"<br>\r\n<br>\r\nShe then walked upstairs to her room. <br>\r\n<br>\r\n\"So, I guess that I'm the new guy here... Is Naoko really nice to all of you?\"<br>\r\n<br>\r\nOne of the shrunken women answered you.<br>\r\n<br>\r\n\"Oh, yes! She's quite caring, actually. She lets us run free in the house while she's gone, and she almost never hurts any of us. As far as I know, she's never caused any permanent damage or death to any of her toys. Not even on accident! Most of her games are also quite enjoyable. My personal favorite is hide-and-seek...\"<br>\r\n<br>\r\nAnother shrunken man then began speaking.<br>\r\n<br>\r\n\"We were all quite scared about the idea of becoming Miss Naoko's toys at first, but most of us have come to enjoy it! She always keeps us well fed, and she even brought home one of the massive hotels from that toy city for us to sleep in! It's actually very detailed in there, and the beds are unbelievably comfy.\"<br>\r\n<br>\r\nNow you were starting to feel at ease. Naoko had seemed to be nice, but you just couldn't be completely sure. Hearing it from these people assured you that she meant you no harm. Maybe this new life would be enjoyable after all.<br>\r\n<br>\r\n\"I just have one more question. Why do you keep calling her Miss Naoko? She seems to want you to just call her Naoko...\"<br>\r\n<br>\r\nThis time a young boy answered you.<br>\r\n<br>\r\n\"Because she's just so nice! We all really respect her! I doubt many other people would care about us the way she does...\"<br>\r\n<br>\r\n\"So you all really enjoy being her toys?\"<br>\r\n<br>\r\nA young girl answers you this time.<br>\r\n<br>\r\n\"Yeah! It's really fun to play with Miss Naoko! She's a really fun person!\"<br>\r\n<br>\r\nHearing all of this had finally put your mind at ease. Based on what these people said, Naoko was a good person who wouldn't try to hurt you in any way. You felt lucky that if this had to happen to you, that it was at least with someone that would be enjoyable to live with. Just then, Naoko re-entered the room.<br>\r\n<br>\r\n\"Okay Steve, have you gotten to know the rest of the toys?\"<br>\r\n<br>\r\n\"Yes Naoko. I hope that we can get along together.\"<br>\r\n<br>\r\n\"Well that's good. Now follow me...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1298091600,
            "id":1056851,
            "title":"The enjoyable life of a toy..."
        },
        "115111111":{
            "choices":[
                "On with the game!",
                "You bow thanking Naoko again and she blushs."
            ],
            "content":"<div class=\"\"><div> <span>\"We're gonna play a game now!\" Naoko said. The little girl who answered you earlier came back up to you, \"What she mean by game?\" You ask. \"You a game like 'hide and seek' or 'tag' but we toys only play that one because Miss Naoko would be really hard to catch.\" The Little girl said. \"Oh.\" You say with a sheepish laugh. Naoko then picked up everyone and set them on the desk in her room, she then brought over the little toy hotel that all the toys sleep in. \"Today, you guys are gonna play 'haunted!'\" Naoko said. \"Uh Miss Naoko, we haven't played that game before, can you establish the rules?\" A Boy your age asked. \"Okay, how this game works is that all of you except 2 get covered up completely with small sheets with holes for the eyes, and then 2 of you won't get covered but get small vacuum cleaners. The objective is for all the 'ghosts to run around the hotel and the people who don't get covered have to come and find you like ghost hunters. If one of they 2 suck your sheet into their small vacuum, you're out and you have to come out and wait with me.\" Naoko said. \"Sounds like a cool, well thought out game\" You say thinking out loud. \"Aw, thanks Steve!\" Naoko said with a small blush. \"Anyway who want to be ghosts?\" Naoko said, everyone except you and the Boy from earlier raised their hand. \"You guys don't wanna be ghosts? Then how about you 2 be the hunters?\" Naoko asked with a smile on her face. You and the Boy walked over to each other and shook hands. \"Hey I'm Steve.\" You say with a smile. \"I'm Ricky!\" The Boy said. \"R..R..Ricky?\" You stuttered. \"Wait, Steve!\" Ricky said. Years ago, when you and Ricky were in middle school you were the best of friends. But one day he dissapeared. Most People told you he moved away but now you know the truth. \"So Naoko's friends shrunk you and then Naoko saved you from their wrath of trying to destroy you. She brought you here?\" You asked your good buddy. \"Yeah.\" Ricky said. You then walked over to Naoko and thanked her. \"For What?\" Naoko asked. \"Saving my Best Friend from being killed years ago.\" You said. \"Ricky is you friend?\" Naoko asked. \"Yeah, and then one day in middle school he dissapeared\" You said. What happens next?</span></div></div>",
            "created":1313902800,
            "id":1172420,
            "title":"\"We're going to play a game now!\""
        },
        "1151112":{
            "author_id":"fry3",
            "author_name":"12344",
            "choices":[
                "Julie",
                "Lisa"
            ],
            "content":"<div class=\"\"><div> <span>          \"I'm just gonna catch a few more tiny people so you won't be lonely!\" she said cheerfully. Then she spent a few more hours searching through the city for some more victims. You, she held in her hand as a place of honor apparently. The rest of her captives she barely spoke to and just dropped them down the back of her pants. You got a little uneasy just noting how careless she was.  Naoko crushed at least five people fleeing without even noticing, and called suspicion upon on whether those in her possession really lived as long as she said the did. Your thoughts were broken up when Naoko stopped looking for more tinies and said \"Okay! All done here!\"<br>\r\n          Naoko walked towards the door when a voice called from behind her \"Hey Naoko! You wanna plaay a little?\" called_______.</span></div></div>",
            "created":1298091600,
            "id":1056580,
            "title":"\"Go and catch a few more toys in this littl..."
        },
        "115112":{
            "choices":[
                "Crush him in her bare hands",
                "Dump the toy in her chest with you"
            ],
            "content":"<div class=\"\"><div> <span>It was like a strange Twighlight Zone episode. This beautiful girl is grinning and giggling, but you are dumbfounded when she bluntly says, \"I'm going to torture you a bit, and then I'll crush you like a bug under my perfectly formed feet.\" It was hard to believe that such an angelic looking person could be so cruel and evil.<br>\r\n<br>\r\nYou hope that she is kidding, but soon find out differently. She drops you down her blouse and you get trapped in between her perky boobs. Her smiling face looms overhead as the pressure from your surrounding flesh prison increases. \"The more I move my arms in front of me,\" she tells you as she gives you a sample, \"the more my awesome boobs mash together. I could easily crush you right now. Lucky for you, I want to play with you for a while and then hunt you down and crush you under my foot. Ha-ha.\"<br>\r\n<br>\r\nDear lord, what is going on? This simply can't be happening. Maybe it's all just a nightmare. Her tits are now constricting the air to your lungs and you can't even scream for help. She must have noticed how red your face was, because she let up a bit. <br>\r\n<br>\r\nYour whole world got shaken up as she took a step and bent down, \"Gotcha!\" She stood back up and held out another small man above where you are trapped.<br>\r\n<br>\r\n\"I think I'll take this toy and...\"</span></div></div>",
            "created":1318957860,
            "id":1208871,
            "title":"\"Torture you a bit, and then I'll crush..."
        },
        "1151121":{
            "choices":[
                "Death by Titty",
                "Toy-sized snack"
            ],
            "content":"<div class=\"\"><div> <span>Naoko is obviously trying to scare the shit out of you before she kills you. With a gleam in her eye, she takes her sleek fingers and toyingly pinches at the poor guy's exposed manhood. He yells out in pain and pleads for her to let him go or kill him quickly. \"Now how much fun would that be?\" she says chuckling.<br>\r\n<br>\r\n\"Little Boob guy, it's time to say bye bye to little junior here.\" You yell out, \"No, please let him go.\" Naoko winks at you and scrunches up her face as she squashes her toys dick and balls into a fine paste. He nearly blacks out from the pain. Then, while he is still conscious, she crushes the man's lower body between her palms. Bones can be heard snapping. The sound makes you green and sick to your stomach. Some blood drips down into her cleavage and flows toward you.<br>\r\n<br>\r\nAlthough she is torturing a guy to death, the evil giant just smiles seductively at you the entire time. She takes the guy and puts him in the top of her cleavage. His mangled legs up toward her face and his head nearly touching your head.<br>\r\n<br>\r\nYou would never have guessed what she was going to do next...<br>\r\nShe either presses the top of her boobs together killing the man above you or...<br>\r\nShe decides to eat him and focus on you...</span></div></div>",
            "created":1318964940,
            "id":1208926,
            "title":"Crush him in her bare hands"
        },
        "11511212":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "She chews you up",
                "She punctures a hole in you, and then swallows whole"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Mmm, look at you! Your so delicious looking! I think you will join the guy in my stomach!\"</span></div></span></div>",
            "created":1380068220,
            "id":1669118,
            "title":"Toy-sized snack"
        },
        "1152":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "choices":[
                "Naoko see's you!",
                "You try and find a better place to hide!",
                "You find other people with you in the building"
            ],
            "content":"<div class=\"\"><div> <span>You quickly ran into a building that was made entirely out of paper. Even if this were a real building with a solid structure and all the reinforcement, it still wouldnt be enough to withstand the awesome strength of Naoko's foot crushing down on it!  But for now this will do as a hiding spot.<br>\r\n<br>\r\nYou carefully peaked out from one of the window cut outs as several other terrified people run down the street. They all split up as the giantess stomps torwards them but some are not so lucky! Naoko bends down then picks up a fleeing man and lifts him to her face. You hear screams of terror before Naoko releases him inside her mouth and chews him to bits. <br>\r\n<br>\r\n\"Yum.\" She says and prepares to go after two more people in her path. They tried to run but there was nowhere to go. Naoko raises her giant bare foot and brings it down, crushing them like puny bugs!<br>\r\n<br>\r\n\"Hehe eeeww!\" Naoko laughs as she wipes their remains off against the ground.<br>\r\n<br>\r\n\"Oh no! This is awful! I have to escape this place before she finds me.\" You said to yourself. As the giantess stomps around, looking for more people,</span></div></div>",
            "created":1287378000,
            "id":977497,
            "title":"Hiding from the goddess"
        },
        "11521":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "She rakes her teeth over your body",
                "she kills you in some other interesting "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Naoko's beautiful emerald eye sees you through a window. Her hand breaks through the wall to grab you.<br>\r\n<br>\r\nYou're screaming as she brings you up to her face. She licks her lips.</span></div></span></div>",
            "created":1389043800,
            "id":1722921,
            "title":"Naoko see's you!"
        },
        "1153":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "content":"<div class=\"\"><div> <span>Running straight as fast as you could seemed to be the best thing to do as the giant threat came nearer. She was cute but at your size she could mean dead. You heard the footsteps pounding the fake streets you where running on but didn't dare too look back. It didn't even came to your mind that you could run into one of the buildings on the left and the right of you - the only thing you thought was running without wasting time. Getting away from thouse giant feet.<br>\r\n<br>\r\nThe steps behind you became slowlier. \"Oh, a newbie\", you heard the giant voice above you say. It seemed like her voice was everywhere around you. \"You really are boring\", was the sentence you heard shortly before a shadow was cast above you. You knew your life would end soon and thought about the smashed corpse you had seen minutes ago. As you look up you see the bare sole of the young women simply droping down on you.<br>\r\n<br>\r\nNaoko didn't stopped her stride as the ball of her foot landed on the newcomer. She felt the body pop beneath her sole and the sticky liquids as she took her next step just like she had felt many times before. He didn't seem to had enough time to learn how to survive a little longer in his new home - well better luck next life she thought as she scanned the floor for new victims she could play with</span></div></div>",
            "created":1314412320,
            "id":1175851,
            "title":"she steps on you"
        }
    },
    "info":{
        "author_id":"efilsgod",
        "author_name":"Pedro",
        "brief_description":"Five beautiful girls who like behaving like giant monsters shrink you and kidnap you.",
        "created":1235573460,
        "description":"<td align=\"left\" class=\"norm\">Five hot girls enjoy shrinking people and putting them in a toy city they built with paper and cardboard. Then they like walking through the city, rampaging it like they were giant monsters. They often feel like stomping or eating people without any mercy.<br>\r\nWell, one of these heartless but beautiful girls kidnaps you and shrinks you. You're her next victim and you gotta do your best to survive!<br>\r\n<br>\r\nHere are the five girls:<br>\r\n<br>\r\nLilian: caucasian, 20 years old, shoulder lenght blonde hair, brown eyes. She's the owner of the flat with the toy city in.<br>\r\nLucy: caucasian, 18 years old, long black hair, hazel eyes, tan skin.<br>\r\nLisa: caucasian, 18 years old, shoulder lenght brown hair, blue eyes, perfect body and perfect ass.<br>\r\nJulie: hispanic, 19 years old, long black hair, brown eyes, she's short but she has a perfect body.<br>\r\nNaoko: asian, 20 years old, shoulder lenght black hair, hazel eyes, cute face.<br>\r\n<br>\r\nYou also can involve more than a girl, they often like meeting each other and rampage a city in two or more.<br>\r\n<br>\r\nI DON'T ALLOW:<br>\r\nGay scenes and shit-related scenes. That's all. Anything else is allowed.<br>\r\n<br>\r\nHave fun!</td>",
        "id":1532755,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1557426540,
        "modified":1557426540,
        "pretty_title":"Shrunk in a toy city "
    }
}