{
    "chapters":{
        "1":{
            "author_id":"daftfacetoface",
            "author_name":"daftpunkhbfs",
            "choices":[
                "Merging with Susan",
                "Absorbing Susan",
                "Merging with Angela",
                "Absorbing Angela"
            ],
            "content":"<div class=\"\"><div> <span>You are Mike a very dull 16 year old who just wants some enjoyment in his life. One day after school you head home to get some rest and relaxation. Yet you see someone slowly following you and he looks determined to make you stop and speak with him. The Stranger then says your name which suprises you since youve never met this odd man before in which you confront him.<br>\r\n\"Who are you and what do you want?\" you ask in a somewhat harsh manner.<br>\r\n\"Im here to give you a power that will allow you to be free of your ever agonizing boredom\" the stranger says. The man tells you that the power will let you merge or absorb anyone you like. You think to yourself that this isnt another trick if the man already knew your name so you accept the generous offer. With the agreement made the man throws a glob of goo at you and it sink into your body and before you can even yell at the stranger he disappears.<br>\r\nYou soon reach your house when you get the idea of seeing if this power is true. Susan is in her room getting dressed and your girlfriend is sleeping on the couch. You think of...<br>\r\n</span></div></div>",
            "created":1204952400,
            "id":506574,
            "title":"The Power is Gained."
        },
        "11":{
            "choices":[
                "go out",
                "play with your self",
                "absorb more people"
            ],
            "content":"<div class=\"\"><div> <span>You walk to your sisters room. You silently open the door and you see her reaching for clothes. You smile and think how this works. Your body becomes a blob and you crawl over to her. As she turns to dress, the blob jumps and compleletly engufls her. She screams but its too late.YOur body becomes solid again and you noticed your hair is long and brown. YOu have two giant boobs and you are susan. YOu foucs on being you and you return to normal.THinking about boobs, two boobs appeared on your chest.Smling,you undress and put on some of her clothes.Changing back to your sister,you do......</span></div></div>",
            "created":1212901200,
            "id":541610,
            "title":"Merging with Susan"
        },
        "111":{
            "choices":[
                "hit up the mall",
                "keep strolling"
            ],
            "content":"<div class=\"\"><div> <span>You walk out the door without the intent to really go anywhere at all. Youre mostly just caught up in the new sensations that go along with this new body, and the fact that until a few moments ago it belonged to someone else. All of your senses seem new like a breath of fresh air, you feel the smoothness of your legs as they brush past each other, you think to yourself maybe a skirt was to much to soon. The long hair blows in the wind as you stroll down the sidewalk, something you'll have to get used too you think, but the hardest part is how even walking is troublesome due your new center of gravity caused by the ample bust hanging off your chest and the large bum thats trailing behind you. you feel it could be worse though cause with susans physique the weight seems to be easily handled you just need to get used to it. As you think of all this you wander to an area of town thats near by the mall. you think to youself how much fun you could have with these powers in the mall and you</span></div></div>",
            "created":1321246800,
            "id":1223094,
            "title":"go out"
        },
        "1111":{
            "choices":[
                "womans clothing",
                "mens "
            ],
            "content":"<div class=\"\"><div> <span>as you enter the mall you notice all the heads turn, something you wish you didnt have to deal with right now, you smile and politely deal with all the attempts at flirting. you knew you werent very good at the game from this end of the court but you figured it would be best to keep up appearances. plus you didnt wanna make your sister out to be rude. you really wished now you came here as yourself or at least someone who wasnt a perfect copy of susan, you think to yourself without realizing susan was a part of you now. not looking like susan gave you an idea though, you think to yourself if you could hold two people within yourself and resolve that the only way to find out is to try. you see a womans clothing store right next a mens apparel store and you go to the</span></div></div>",
            "created":1321246800,
            "id":1223097,
            "title":"hit up the mall"
        },
        "11111":{
            "choices":[
                "busty white",
                "athletic black"
            ],
            "content":"<div class=\"\"><div> <span>you enter the store which on further inspection sold lingerie and quickly scout out the area for potential targets an incredibly busty white woman, and an ebony woman.<br>\r\n<br>\r\n<br>\r\nthe white womans bust puts susans (your) bust to shame which is saying something and has a pretty face<br>\r\nthe ebony girl is slender with an athletes body she has curves but they are toned and sexy<br>\r\n<br>\r\nwho do you take?</span></div></div>",
            "created":1321246800,
            "id":1223098,
            "title":"womans clothing"
        },
        "112":{
            "author_id":"unknownman12",
            "author_name":"Alex Martinez",
            "choices":[
                "Learn how to undo it all",
                "Play with yourself",
                "absorb other people"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You either play with yourself or find a way to undo it</span></div></span></div>",
            "created":1597720380,
            "id":2887214,
            "title":"play with your self"
        },
        "113":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "choices":[
                "Kaylee (Susan's best friend)",
                "Emma Watson",
                "Miley Cyrus"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to absorb more people, but you think this time you'll try by drawing them into your body, like a magnet. You get up, looking like Susan, and you go to.......</span></div></span></div>",
            "created":1223182800,
            "id":591284,
            "title":"absorb more people"
        },
        "1131":{
            "choices":[
                "Absorb more people",
                "Play with your new body"
            ],
            "content":"<div class=\"\"><div> <span>You go to Kaylee house, your sister best friend in purpose to do a homework together. You've made a promise and lucky she's alone, making a chance that nobody will found him absorbing her.<br>\r\n<br>\r\nKaylee is a smart yet also attractive if it's not because of her F-cup breasts. She has been your sister best friend since the first day of high school. You knocked her door and she opened it. You wait for the chance to let her come like a magnet. As both of you started to do homework, she went closer to you and teach you the difficult part. You took this chance to absorb her slowly and merging into one. After finished absorbing, you look at the mirror and see your sister Susan and Kaylee mix. Your hair went longer and has two colors, brownish and blonde. Your eyes is a bit bigger from Kaylee's but it fits with bright eyes from your sister. Your lips is red by naturally without any lipsticks. Your body is went 6'11 and your breasts grew to K-cups. Your waist got trimmer and slimmer. Thanks to your sister and Kaylee also, you gain a great atheletic skill and a genius brain.</span></div></div>",
            "created":1432229040,
            "id":1980999,
            "title":"Kaylee (Susan's best friend)"
        },
        "11311":{
            "author_id":"rpgsea",
            "author_name":"StormSea",
            "choices":[
                "You wanted to stop. "
            ],
            "content":"<div class=\"\"><div> <span>          Absorbing and merging with Susan and Kaylee has caused a great change to you. Both physically and mentally. However, you didn't care as your once dull nature was full on confidence and wisdom.<br>\r\n<br>\r\n          You walked around in Kaylee's house. You smirked, feeling alive as your bust bounced from the vibrations of every step you make. You decided to shrink them to Susan's size, just to make sure you don't trip on anything. You looked in a mirror and smiled. The fragrance of Kaylee's shampoo put you at ease. You placed one of your hands on top of your sizable bust. You frowned, as you took it off.<br>\r\n<br>\r\n          \"Gross, I'm not a perv. Why on earth did I wanted to partake in that? It's so primal.\" Questions arise, as the thought of doing that to Angela as well felt like a crime.<br>\r\n<br>\r\n          \"Angela.\" You thought about her. Deep down, you still loved her despite being merged with two girls who were clearly straight. \"She's next.\" Rubbing your hands together like an evil genius, you set your sights on absorbing and merging with Angela.<br>\r\n<br>\r\n          \"With these powers, I can become a celebrity. Just imagine the consequences.\" Excited, you hastened your steps. \"I need to plan this out. Also, I need to make sure that the proportions of my body isn't exaggerated. I don't need an ass the size of a truck. And why would I need a bust that looks like two planets close together? What the hell am I?\" You complained. \"Whatever, once I absorb and merge with Angela, I'm going to be beautiful.\"<br>\r\n<br>\r\n          You reached Angela's house. No one seemed to be home. However, you noticed activity within. With no one to witness this event, you turned into a blob. You slithered underneath the front door. The hard yet smooth wood flattened you, making it easy for you to get in. You see your girlfriend watching television. She dozed off, leaving it on.<br>\r\n<br>\r\n          Turning back into your solid form, you felt mesmerized at the sight of her. Conflicting feelings of love and jealousy caused a storm within your head. You wanted her badly. You turned back into a blob and jumped on top of her. Her mouth was covered by your embrace. Engulfing her entire being, you absorbed and merged into one with her.<br>\r\n<br>\r\n          Several seconds passed. You stretched and yawn. You stood up and went straight to the bathroom. You gazed in the mirror. Your hair and skin tone became darker. Your breasts swelled and shrunk to a sizable bust. You lips turned pink as your eyes became dark brown.<br>\r\n<br>\r\n          With Angela merged with you, your buttocks was toned like never before. The rest of your body was unchanged. Except for your breasts. They shrunk in size but, we're still quite large. Impressed and satisfied, you walked into Angela's backyard. In front of you was her pool. Stripping into nothing, you kept her shirt on and leaned your phone on chair's leg. Switching it to video recording, you dove right in. You rose up from the pool, showing off your body like a model.</span></div></div>",
            "created":1458952200,
            "id":2122734,
            "title":"Absorb more people"
        },
        "113111":{
            "author_id":"rpgsea",
            "author_name":"StormSea",
            "choices":[
                "You wanted to stop",
                "You wanted to keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Didn't like what I did, so I'm going to put two choices here.</span></div></span></div>",
            "created":1469286120,
            "id":2184985,
            "title":"Two Choices Actually"
        },
        "11312":{
            "author_id":"phantomie",
            "author_name":"Ghostly Guy",
            "choices":[
                "Go out into town!",
                "Continue having fun here!"
            ],
            "content":"<div class=\"\"><div> <span>Not able to resist your primal urges, you immediately grab hold of your new tits. “Heh, well I AM Susan and Kaylee now, so I call the shots now~” You say holding your generous bust in your hands, groping the soft and warm flesh like dough while teasing your new nipples with your fingers. Causing you to shudder in pure bliss. Taking one hand off your chest, you reach out and squeeze your newly acquired ass. Looking at it through the mirror as you smacked it loudly, seeing it jiggle all throughout your new body.<br>\r\n<br>\r\nYou then decide to claim your final prize...your merged pussy. First sticking two fingers in there, the sensation was electric. Soon sticking four fingers in, you soon got your entire fist within your soaking snatch, you then fist yourself HARD. Causing your tits to fly and bounce all over the place. Soon, you came to a rewarding climax, one FAR better than anything you experienced before. <br>\r\n<br>\r\nAfter lying down for a couple minutes, you get up and look yourself in the mirror. Your brownish blonde hair messy and covered with cum, and your jiggly parts drenched as well. You soon take a shower. A long...warm...gropey shower.<br>\r\n<br>\r\nWhat do we do now?</span></div></div>",
            "created":1541948340,
            "id":2576153,
            "title":"Play with your new body"
        },
        "1132":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "choices":[
                "Dress her up fancy and go",
                "Go, but only go to merge/absorb",
                "Drop by her friend Chelsea, add her to the fun too!"
            ],
            "content":"<div class=\"\"><div> <span>As Susan, you have a ticket for a pre-screening of Harry Potter: The Deathly Hallows pt. 1, at which Emma Watson and Evanna Lynch (the actress playing Luna Lovegood) will be present for autographs and photos. Not one to pass up an opportunity, you happily walk over to your newly acquired table and pick up the tickets. As a result of your merging with her, it just occurs to you she was getting dressed for the event. Currently, she/you is/are wearing sweatpants, a T-shirt reading \"Too good to be true\", some Ugg booties for warm feet and that's just about it. Will you dress her up fancy and go see the movie (merging/absorption of the two lovely actresses to follow afterwards) or just go there (you're not a HP fan and only care for the bodies of the lovely actresses)?</span></div></div>",
            "created":1296277200,
            "id":1044442,
            "title":"Emma Watson"
        },
        "1133":{
            "author_id":"pen1612",
            "author_name":"dog",
            "choices":[
                "Merge with her",
                "Absorb her "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you go to hollywood to find miley and you do you watch her house to see if she will come out 45 mins later she comes out then you make a move. what do u do</span></div></span></div>",
            "created":1279429200,
            "id":919901,
            "title":"Miley Cyrus"
        },
        "11332":{
            "author_id":"pen1612",
            "author_name":"dog",
            "choices":[
                "go buy a female ceb map ",
                "go home "
            ],
            "content":"<div class=\"\"><div> <span>You walk to over to her house . You silently open the door and you see her walking to her room. You smile Your body becomes a blob and you crawl over to her room. As she turns to the door , u the blob jumps and completely engulfs her. She screams but its too late.your body becomes solid again and you noticed your hair is long and brown. You have two bigger  boobs and you are a mix of Susan and miley You foucs on being just miley and you turn in to her .Thinking about susans boobs, mileys go from B to C to D then stop at DD on your chest. Smiling,you undress and put on some of her hotter clothes. by the end u are bored so u go and in blob mode u see some of her hot friends at the door u jump on to one shes 5'9 c cups long legs and blond u engulf her and the other girl just faints so this will be easy u engulf her too shes 5'3 a cups nice eyes and by the end u mix them all together u have a 5'7 long leg nice hips with a big ass E size breasts hair that goes down to your ass and blond with brown hair and a sexy face with killer eyes u then thought about what to do next </span></div></div>",
            "created":1296190800,
            "id":1043673,
            "title":"Absorb her "
        },
        "12":{
            "author_id":"bones1",
            "author_name":"bones",
            "choices":[
                "Absorb Susan in front of Angela",
                "Absorb Angela in front of Susan ",
                "Fuse them Together!",
                "Fuse with both!",
                "Lure one away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mike thinks about fusing with Susan but in walks Angela and they soon start talking girl talk with each other...<br>\r\n<br>\r\nHe decides to...</span></div></span></div>",
            "created":1273467600,
            "id":881115,
            "title":"Wait... this is tough"
        },
        "121":{
            "choices":[
                "It took strength (muscle growth)",
                "It took her looks (body change)"
            ],
            "content":"<div class=\"\"><div> <span>You slowly walk behind Susan. Your taller height helps with your plan. You caress her in between your chest and reach for her breast. \"Mike! What the fuck are you doing.\" Susan tries to pull away yet your stronger than her. Angela watches in awe. And then it starts.<br>\r\n<br>\r\nYou push Susan closer to your body and she starts sinking into yours. \"Oh Sis. This feels so great.\" You feel pleasure as your sister is being pulled into your body in front of your girlfriend. Susan's mouth is then cqught shut as your skin overlaps her. <br>\r\nShe is finally pulled inside and your chest and abs are visable again. Angela is in shock as your body grows alittle. Your torso took the most from your sister.</span></div></div>",
            "created":1336885200,
            "id":1336095,
            "title":"Absorb Susan in front of Angela"
        },
        "1211":{
            "choices":[
                "She fainted",
                "She ran away "
            ],
            "content":"<div class=\"\"><div> <span>Mike could feel Susan inside of him. He felt how Susan shifted inside of him and how his body slowly absorbed her. Mike was always envious of Susan's abs. He then focused a bit and his hardly visible abs began to change into his sisters. He gave his new Rock hard abs a quick feel. He completely forgot about Angela standing there. He looked up and saw her staring at him. </span></div></div>",
            "created":1496700720,
            "id":2331659,
            "title":"It took strength (muscle growth)"
        },
        "1212":{
            "choices":[
                "Full morph",
                "Semi morph",
                "No changes (Yet)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you compltely morph into her or only sertain parts or none at all?</span></div></span></div>",
            "created":1428797400,
            "id":1962685,
            "title":"It took her looks (body change)"
        },
        "125":{
            "choices":[
                "Angela",
                "Susan",
                "Walk away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who Susan or Angela</span></div></span></div>",
            "created":1428797160,
            "id":1962684,
            "title":"Lure one away"
        },
        "13":{
            "author_id":"kow8oy",
            "author_name":"beast",
            "choices":[
                "mouth",
                "vagina",
                "ass",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you decide to merging with anglea would be the best way to try you new abilities. you walk over to her till you are stannding over her. Then you begin thinking merg!!!!! then sudenly start feeling your body meltingevrythong getting then next thing you now your this you decide to enter your girl friend threw her.</span></div></div>",
            "created":1265778000,
            "id":833621,
            "title":"Merging with Angela"
        },
        "132":{
            "author_id":"kow8oy",
            "author_name":"beast",
            "choices":[
                "asorb it",
                "sell it to a randow chinese restrant",
                "spank it you have been a bad kitty meow"
            ],
            "content":"<div class=\"\"><div> <span>you climb the couch and slide between her panties and slowy inching in. You notice as soon as you touch her you start to touch her you slowly begin to be asorbed by her pores. At first she begins to jerk and start moans and out of the blue the house cat jumps onto the coach scaring you causing you force a large part of your self in quikly in in response she emidtly wakes up and reaches for you. but by then it to late and her hips thrust off the coach as she moans until you are completely in and in conntol. At first all she knew rushes threw your head and then as if you always knew it.  It all comes to you as her life was your as if yourareAngela.bThen you sit upsit up looking at the cat deciding on how you where going to punish it for it earlier intruption.</span></div></div>",
            "created":1265778000,
            "id":833631,
            "title":"vagina"
        },
        "1321":{
            "author_id":"kow8oy",
            "author_name":"beast",
            "choices":[
                "have your way with your new body",
                "asorb or merg with her to",
                "and begin tobreak dance on her stomach or any other other"
            ],
            "content":"<div class=\"\"><div> <span>you focus on your new hand and it begins to melt over the cat unit the defenless animal was trapped in this bubble attached too your new arm. Then you slowly begin to asorb it and feel minor changes all over you: until you are longer just Angela let alone Mike you are this hybrid  of two pussy together. You look in the hallway mirror with your new hybrid cat and you human eyes and notice right away the only two big changes. One you have new cat ears and second your long new tail. Finally admiring after your new body, before you could enjoy it you hear a noise up stairs. Then you get an idea and walk up stairs to you sister room to find he laying on her bed spread out listening to her ipod. You then jump on her and</span></div></div>",
            "created":1265778000,
            "id":833645,
            "title":"asorb it"
        },
        "13211":{
            "author_id":"kow8oy",
            "author_name":"beast",
            "choices":[
                "turn he over and do it doggy style",
                "pussy out and do something else"
            ],
            "content":"<div class=\"\"><div> <span>you give her a deep kiss letting justy enof of your touge to melt in her mouth to paralyz her. Next i begin to pull down he pants down and her panties as i her hear sceaming on the top lungs on the inside. I then pull my new tail begin to penatrat her vagina slowly at fist then faster as time went by. While at the same time i stoking her breasts two huge monds so big i am almost jealous. I then thrust my tail as deep as possiple seeing tears drip down her face and in response</span></div></div>",
            "created":1265778000,
            "id":833652,
            "title":"have your way with your new body"
        },
        "133":{
            "author_id":"janspaderx",
            "author_name":"JanSpaderX",
            "choices":[
                "...thought that you could look better.",
                " ...thought that you looked like a freak.",
                " ...thought that you looked amazingly sexy."
            ],
            "content":"<div class=\"\"><div> <span>You focus on changing to slime. It took about ten seconds before you're just a blob of slime on the floor. You seep through her pants and then spots your target : her asshole. You force her hole open gently, not wanting to wake her up. Then, you force the rest of your slime body in slowly, inching bit by bit. She begins to jerk and moan. Soon, half of your slime body is in her. Your front seeps into her large intestine and begins to be absorbed by it, you seep into her blood stream, it doesn't take long before your whole body is in her. At that point you start feeling like you are becoming one with Angela. For a brief moment you feel intensive pleasure but it was over soon. Then all she knew rushes threw your head and then as if you always knew it. It all comes to you as her life was your as if you were Angela.You opened your eyes and you were staring at the ceiling. Then you jumped from the couch and ran before to the full body mirror. You looked into the mirror and...</span></div></div>",
            "created":1410174960,
            "id":1854116,
            "title":"ass"
        },
        "134":{
            "author_id":"jjdrakon",
            "author_name":"JJD",
            "choices":[
                "You go inside her body through her pores",
                "You engulf her body and merge with her",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You thought little more and came up with more options.</span></div></span></div>",
            "created":1279602000,
            "id":921479,
            "title":"Other"
        },
        "1341":{
            "author_id":"jjdrakon",
            "author_name":"JJD",
            "choices":[
                "...thought that you looked amazingly sexy.",
                "...thought that you could look better.",
                "...thought that you looked like a freak."
            ],
            "content":"<div class=\"\"><div> <span>You decide to go inside her body through her pores.<br>\r\n<br>\r\nYou begin focus on changing into slime.<br>\r\n<br>\r\nYou start feeling tingling sensation all over your body and then you look at your arm and it look like melted wax statues arm.<br>\r\n<br>\r\nThen you focus on some more changing into slime and soon you are just blob of slime on the floor.<br>\r\n<br>\r\n\" This feels really weird. \" You thought to yourself.<br>\r\n<br>\r\nAfter couple minutes of examining your slimy blob body you began to crawl towards to couch where Angela is sleeping.<br>\r\n<br>\r\nYou climb on the couch from the floor and when you are on the edge of couch you proceed to climb on the Angela.<br>\r\n<br>\r\nAfter that you began flow through her pores into her body.<br>\r\n<br>\r\nInside her body you feel that Angela is still asleep and that is good because it is probably easier merge with her that way.<br>\r\n<br>\r\nNow you begin focus on merging with her.<br>\r\n<br>\r\nAnd not long after that you start feeling like you are becoming one with Angela.<br>\r\n<br>\r\nBrief moment you feel intensive pleasure but it was over soon.<br>\r\n<br>\r\nYou opened your eyes and you were staring at the ceiling.<br>\r\n<br>\r\nThen you jumped from the couch and ran before to the full body mirror.<br>\r\n<br>\r\nYou looked into the mirror and...</span></div></div>",
            "created":1282366800,
            "id":940971,
            "title":"You go inside her body through her pores"
        },
        "13412":{
            "author_id":"jjdrakon",
            "author_name":"JJD",
            "choices":[
                "Merge with Susan",
                "Absorb Susan / Other"
            ],
            "content":"<div class=\"\"><div> <span>\" Hmm...not bad...but I could look better. \" You thought to yourself and stroked your brownish blond hair.<br>\r\n<br>\r\nWhile examining your new body front of the mirror you begin to take off Angela's clothes that you were wearing.(Remains from merge with Angelina.)<br>\r\nAfter you had taken off all clothes except underwear you noticed that Angela's old bra was little too big.<br>\r\nYou then realized that your boobs are small B cups when Angela's boobs were C cups. You start examining your butt which actually is little bit more toned than Angela's.<br>\r\n<br>\r\n\" Well...I think my butt cost to me my boobs. \" You thought to yourself.<br>\r\n<br>\r\nSuddenly you feel Angela's white panties getting tighter and when you looked down you saw bulge in your panties. You instantly knew what it was.<br>\r\nYou looked in anyway and you confirmed that you still have penis.<br>\r\n<br>\r\n\" Great. \" You said with sarcastic tone. <br>\r\n<br>\r\n\" I was hoping that I could feel how it's feel like to have a pussy. \" You thought to yourself.<br>\r\n<br>\r\n\" Wait a second... \" You said when you got an idea.<br>\r\n<br>\r\nYou start running toward upstairs and when you got the upstairs you sneaked behind door that leads to your sisters room.<br>\r\nThe door was a bit ajar and you carefully looked in and saw your sister reading a book in front of her desk.<br>\r\n<br>\r\n\" Hmmm...What should I do now. \" You thought to yourself.<br>\r\n<br>\r\n(Options time.)</span></div></div>",
            "created":1282626000,
            "id":943310,
            "title":"...thought that you could look better."
        },
        "134122":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "choices":[
                "Absorb Susan",
                "\"Get intimate\" with somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Absorb Susan, or decide against it and go seek someone else you can \"get intimate with\"? *wink wink, nudge nudge*</span></div></span></div>",
            "created":1296363600,
            "id":1044804,
            "title":"Absorb Susan / Other"
        },
        "1341221":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "choices":[
                "Pestered you (slightly sorry)",
                "Pestered your boyfriend (Angela's mind fused to yours, memories+traits of both)"
            ],
            "content":"<div class=\"\"><div> <span>Absorb Susan? Hell yes! That's going to show her for all the times she [1 or 2]! Wait, what was that? Is Angela's mind fused into yours or are you just feeling a slight bit of regret for being about to (essentially) take the life of your sister?</span></div></div>",
            "created":1296363600,
            "id":1044808,
            "title":"Absorb Susan"
        },
        "13412211":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "choices":[
                "You have no brothers/sisters on your I.D. card",
                "You have no name but a blank field for your first name and a keyboard nearby"
            ],
            "content":"<div class=\"\"><div> <span>Nah, it's not Angela. You've got her body, but her soul is dormant. It's just the regret, and since you really want to be a full girl (and can't seem to find a redeeming feature in your sister that would persuade you not to do it) you decide to step in and sneak over. Since she's fully immersed in the book she's reading, she doesn't notice you until you're too close to escape. She manages to yell \"Angela, what the hell? Why aren't you dressed? Oh my god, is that a peni-\" before you grin and cause her to melt down. <br>\r\n<br>\r\nYou feel her fear as you touch the pool of liquid, absorbing it into the palm of your/Angela's hybrid body, and then nothing. Susan is part of you now. Within moments you notice the changes are starting: since Susan was tall (we're talking 1,90 meters here, with tall, incredibly shapely legs) you grow about 15 centimeters, since Angela was a little on the short side with 1,75 meters. You also gain legs that would make many a model kill to have, and your butt increases in size and also becomes more toned, as Susan was the fittest of her school's track team. Your breasts now grow to a D cup, and they stand higher on your chest due to the better upper body muscles of your original body and Susan being dominant over Angela's less muscular physique. Your dirty blond shoulder length hair becomes light blond, due to Susan being blond as well. Your brown eyes and Angela's blue ones are turned green by Susan's, and your face gains her freckles. Your skin is slightly tanned, as Angela and you would rather sit inside and play video games than go outside, while Susan was the polar opposite: she could be found outside nearly half the day. You finally find your iPod touch, Angela's Blackberry and Susan's iPhone 4 have become an iPhone 4, which is apparently the best of the two phones. When you go check your wallet, you find a picture of your new face, looking incredibly attractive. However, there is one odd thing. What is it?</span></div></div>",
            "created":1296363600,
            "id":1044822,
            "title":"Pestered you (slightly sorry)"
        },
        "134122111":{
            "author_id":"drayelliott",
            "author_name":"DRayElliott",
            "choices":[
                "Angela",
                "Susan accidentally"
            ],
            "content":"<div class=\"\"><div> <span>It says you don't have, and never did apparently have, a brother. \"What the hell?\" you think. \"Why isn't there any mention of me?\" You decide to go examine your room, only to walk into what is apparently your mother's office. \"What? Where's my bed? Where's my stuff?!\" you yell, thinking about your various video game systems and all the hours and money you put into it. \"It's like I never existed at all!\" \"What are you yelling about, Suzie?\" your mother says, startling you. \"Oh, uh, nothing, mom. I'm fine!\" you blurt nervously. \"I'm...just not feeling very well right now. I think I'll go lie down.\" \"Are you sure you're okay?\" she asks, a concerned look on her face. \"Yeah, I just need to lie down for awhile.\" \"Okay sweety. If you're feeling ill, please tell me right away. I couldn't stand it if I lost my one precious little baby. You know, the one regret I have is not having more children. I always wanted a little boy too, but it never seemed to happen. I haven't thought about that in years, I wonder what brought it up like this?\" <br>\r\n<br>\r\n\"I could hazard a guess,\" you think crossly. As you're walking back to your/Susan's room, another thought strikes you: if you've dissapeared from existence, what happened to Angela? Instead of going to lie down, you leave the house and walk to Angela's. You see Josh, Angela five-year-old brother. \"Hey, Josh. Is Angela home?\" you say. \"Who's Angela?\" he asks in confusion, confirming your suspicions. It appears that anyone you merge with or absorb disappear from reality, as though they never were. \"Well, that takes care of the missing person angle,\" you mutter. \"But I'm starting to miss talking to Angela already. I wonder if I can wake her up from wherever she is within me.\" Who do you wake up?</span></div></div>",
            "created":1377584220,
            "id":1652275,
            "title":"Only child"
        },
        "13412212":{
            "author_id":"drayelliott",
            "author_name":"DRayElliott",
            "choices":[
                "agree and absorb Susan entirely",
                "agree and play with Susan"
            ],
            "content":"<div class=\"\"><div> <span>\"Susan was always such a bitch, pestering poor Mike all the time. Wait, I'M Mike! No, I'm Angela...what the hell!?\" you say confusedly. You realize that you're Angela AND Mike, with two sets of memories and personality quirks. The Mike half realizes with a shock that the Angela half had a fantasy of merging with the Mike half of you. \"Well, her/my wish has come true,\" you/she mutters. The Angela half is overjoyed that this happened, while the Mike half is still adjusting to the fact that his other half had fantasies about this. It's a little confusing to be two people who are still separate enough that you keep reffering to them as your other half. You wonder if it's possible to separate yourself mentally even more, to alleviate your confusion.<br>\r\n<br>\r\nYou focus on mental separation, and lo and behold, you 'hear' Angela's 'voice' inside your/her head. \"Mike! How did...oh, yeah, that strange guy did this with that goo. This is awesome! I've always wanted to do this. Now we'll be together forever!\" \"So you really like this?\" \"Yes! But what...ohhhh, right, you/we were gonna absorb Susan, weren't we? Well I think she deserves it for the way she's treated everyone. You probably don't know this, but she's the biggest bitch in the entire school.\" \"What?\" you say, slightly stunned. \"I thought everyone liked her but me!\" \"Everyone SAID they liked her, but if she heard that they ever said anything mean or nasty about her, she'd make their lives absolute hell, and they knew it.\" \"I never realized she was behaving like that. I thought she treated me like crap because she's my sister.\" \"Nope. So, are we gonna teach her a lesson she'll never forget?\"</span></div></div>",
            "created":1377582420,
            "id":1652268,
            "title":"Angela's revenge"
        },
        "1343":{
            "author_id":"mysteryman1626",
            "author_name":"mystery",
            "choices":[
                "through her breasts",
                "through a scrach leading to her blood"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You finally decide on two places but you pick...</span></div></span></div>",
            "created":1316322000,
            "id":1189643,
            "title":"where to go"
        },
        "13431":{
            "author_id":"janspaderx",
            "author_name":"JanSpaderX",
            "choices":[
                "Could look better",
                "Is perfect so far..."
            ],
            "content":"<div class=\"\"><div> <span>Your body starts to dissolve. It only stops after your nothing but a blob of slime. As you climb into the couch,you see Angela's C cups through her shirt hole and go for it,the slime parts of you split in two and each of them goes for one of her breasts they each open a tiny hole where the lobules are, right at the nipples and slowly seep inside. At that point of time, Angela starts moaning and jerking as you force yourself into her. It comes to a point whered your completely in her boobs an start merging with her. It all happens at once as you become her. All her memories talents and practically her entire personality is yours now. You jump off the couch. Walked over to the mirror and decided that you...</span></div></div>",
            "created":1410194700,
            "id":1854217,
            "title":"through her breasts"
        },
        "13432":{
            "choices":[
                "Merge with her now",
                "Wait a while"
            ],
            "content":"<div class=\"\"><div> <span>Angela is sleeping on a couch. In your slimy form your slither on top of her wondering how to enter her body. The first thing that caught your attention is a cut that is on her left shoulder. The cut is still fresh and moist. You immediately knew that is your way inside. You slithered on top of the cut and began forcing your way in. The cut slowly became bigger as you squeezed yourself in. The pieces that entered her body spread out inside her. Her veins and arteries scattered you through out her body. Your entire slime body finally managed to enter her body. You were now flowing freely inside her body . You wondered if you should start merging with her or wait a while. </span></div></div>",
            "created":1496699880,
            "id":2331653,
            "title":"through a scrach leading to her blood"
        },
        "14":{
            "choices":[
                "Take more of Angela's attributes",
                "Decide to swap with Angela completely"
            ],
            "content":"<div class=\"\"><div> <span>You decide to try absorbing some of Angela's characteristics, you close your eyes and focus on Angela's perfect ass, you feel a odd pressure on your ass and know that it worked, you open your eyes and feel your normally baggy jeans, now filled with a nice ass pushing out of them. You grope up your new backside and hear your girlfriend move, you glance at her, scared that she woke up, but she just rolled onto her stomach, you notice her skirt now is hanging limply instead of hugging her like it used to. You decide to keep playing with your power, you...</span></div></div>",
            "created":1209790800,
            "id":527504,
            "title":"Absorbing Angela"
        },
        "141":{
            "author_id":"honix",
            "author_name":"Honix",
            "choices":[
                "Find a mâle to absorb",
                "Absorb your sister s’attributes "
            ],
            "content":"<div class=\"\"><div> <span>You think that you could use some more heigth and muscle while looking art Angela s’toned body and absorbed à large portion of her muscle and heigth. While you saw her shrink and deflate as she lost all her strength you grew and felt so strong and tall your clothes could barly contain your new and improved body every inch of you was bigger and you wanted more sadly Angela didnt have mutch left so you desided to find another victim</span></div></div>",
            "created":1537708440,
            "id":2552108,
            "title":"Take more of Angela's attributes"
        },
        "142":{
            "author_id":"skiegh",
            "author_name":"Trigger",
            "choices":[
                "Continue your self investigation.",
                "See what happened to the real Angela."
            ],
            "content":"<div class=\"\"><div> <span>You find yourself desiring more of Angela's features and decide to swap with her completely. You close your eyes and reach out and touch Angela. You focus on the rest of her body and the same pressure returns to you, only this time it seems to encompass your whole body; inside and out. It feels like your body is pushing outward other parts are pushing inward, spiraling, changing, twisting. You slowly open your eyes actually finding the feeling too much to bear. You can feel your hands and body shaking. Your entire body feels completely different and the weird sensations continually being processed to your mind almost become too much and you feel your legs collapse and you fall onto your back.<br>\r\n<br>\r\nYou can feel the heavy breasts on your chest bounce on impact which makes your whole body only shake more from the bizarre sensation. You lay on your back for a minute, trying to slow your breathing. Sure enough the shaking begins to subside and you start to feel somewhat normal again. You push yourself up with both arms and look at yourself, your legs being the first thing you see. Your jeans look like they are clinging to your legs, it's so tight it's hard to move. You decide to take off the belt and begin to reach out to undo it only to see small delicate looking hands. Polished nails with almost no veins or rough areas, 'clearly Angela does not partake in much physical labor' you think to yourself. You continue what you planned on doing before and untie your belt. The terrible pain around your hips subsides which just adds relief to the whole situation.<br>\r\n<br>\r\nYour whole body is smaller with the exception of your hips, chest and backside which seem to add that curve factor to women, 'clearly Angela has that.' With your hands still at your waist you decide to investigate the former area of your manhood. A sharp almost electrical pain spirals through your whole body as your hand touches Angela's vagina. You let out a loud yelp out of sheer fright.</span></div></div>",
            "created":1215493200,
            "id":553627,
            "title":"Decide to swap with Angela completely"
        },
        "1422":{
            "author_id":"drayelliott",
            "author_name":"DRayElliott",
            "choices":[
                "steal Susan's best features for Angela",
                "Merge with Angela",
                "go to the mall"
            ],
            "content":"<div class=\"\"><div> <span>When you look over at Angela, what you see slightly stuns you. It's you laying there! As you continue to stare, Angela suddenly wakes up with a yawn which is abruptly cut off. \"What, why do I feel weird? Holy crap! Why do I sound like a boy?!\" She sees you sitting on the rug out of the corner of her eye. When she turns to you fully, her jaw nearly hits the floor. \"WHAT!? WHAT'S GOING ON HERE?!\" she screams with your voice. \"Shhhh! I'll tel you, just calm down!\" you urge her. You don't want to alert anyone who's home that something strange is going on. \"Mike, is that you?!\" \"Yes, but please be quiet and I'll explain, okay?\" She nods, so you tell her about the strange man and the goop he threw on you. When you get to the part about taking her features, she asks, \"Can you reverse it?\" \"I think so.\" \"You THINK so? You did it without knowing if it could be reversed!?\" When she put it like that, you realize it was a perhaps reckless action on your part.<br>\r\n<br>\r\n\"You're right, I'm sorry, Angela. I'll reverse it now, if I can,\" you reply. As you focus on changing back, you feel the familiar twisting, pushing, pulling and tingling. When it stops, Angela looks like herself again. So do you, of course, but you realize you liked being her. She's a lot sexier than you. \"That felt so weird,\" Angela says. \"And intense. I wonder what else you can do?\" 'I don't know. I only just got these powers.\" \"Well, why don't we experiment?\" Angela says with a coy smile on her face. How do you play with your newfound abilities? Do you...</span></div></div>",
            "created":1377585840,
            "id":1652281,
            "title":"Playing around"
        }
    },
    "info":{
        "author_id":"daftfacetoface",
        "author_name":"daftpunkhbfs",
        "brief_description":"You have the power to merge or absorb someone elses characteristics to add to yourself.",
        "created":1204966680,
        "description":"<td align=\"left\" class=\"norm\">This Story is about being able to Merge or Absorb anyone else to amplify yourself or others.<br>\r\n<br>\r\nPlease keep it to merging and absorbing. I dont care how the person is merged or absorbed as long as it doesnt involve gay sex (Male to Male) im not into that kind of thing but Lesbian is allowed. The character can absorb a person with any part of his body as long as the other person isnt a male. I also dont like the character dying or becoming fat in some odd way (no offense to anyone). The character merging or absorbing an animal is also allowed.<br>\r\n<br>\r\nYour character is Mike Age:16<br>\r\nHe is a somewhat dull boy but has the power to merge or absorb anyone else around him by contact with their body.<br>\r\nHe may also merge/absorb someone fully and take their whole appearance(gender,body,characteristics) or Mike may merge/absorb them fully but only keep the parts of the character he wants such as merging/absorbing with a female and becoming her fully or keeping her breasts,genetalia,face,hair,etc. Mike can also use his power when hes female aswell allowing him to amplify his bodies characteristics such as increasing breast size, beauty, muscle, texture, strength, and so on.<br>\r\n<br>\r\nSusan Age:19<br>\r\nSusan is a very attractive young woman who has DD breasts and sports a very incredible physic. She is Mikes older sister and thinks shes superior to him.<br>\r\n<br>\r\nAngela Age:17<br>\r\nAngela is Mikes girlfriend and is an annoyance to Mike at times. She does have a great body with C cup breasts and a very toned ass.<br>\r\n<br>\r\nOther characters are welcome to be added but dont keep them out of the story for along time after introducing them. A character must be as active as the story.<br>\r\n<br>\r\nGood luck and have fun with the story and plz dont be to harsh with ratings this is my first story.</td>",
        "id":1398051,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1597720380,
        "modified":1597720380,
        "pretty_title":"Merging and Absorbtion"
    }
}