{
    "chapters":{
        "1":{
            "author_id":"noxvzhuusox",
            "author_name":"Zhuusox",
            "choices":[
                "Jake and Lao Shi were given a mission to infiltrate someone called the Baker.",
                "Jake's entire family leaves for sometime leaving him with his granfather.",
                "Captured by the Dark Dragon.",
                "Jake going to summer camp for dragons with his little sister and grandpa.",
                "Free Choice."
            ],
            "content":"<div class=\"\"><div> <span>Our story here begins with a boy called Jake Long. He was sorta your typical average teenager that lives in the U.S., New York with his mom, dad, and little sister. He attends high school with his best friends: Trixie and Spud. <br>\r\n<br>\r\nOh, did I forget to mention that he is actually a dragon in disguise and is the magical protector of magical creatures around American with his grandfather, Lao Shi, guiding him?<br>\r\n<br>\r\nNo? Well, I just did.<br>\r\n<br>\r\nSo anyway...<br>\r\n<br>\r\nHow will you begin this young American Dragon's journey to fatness and gluttony?</span></div></div>",
            "created":1350363600,
            "id":1447924,
            "title":"Jake's path to obesity..."
        },
        "11":{
            "choices":[
                "Jake bursts in at night in his dragon form.",
                "Jake sneaks in at night as a human.",
                "Jake plans to attack the next time the gingerbread men go out on a robbery.",
                "Jake tries to apply to a position in the bakery.",
                "Suddenly, they find themselves surrounded by Gingerbread men."
            ],
            "content":"<div class=\"\"><div> <span>There had been a lot of gingerbread sighting through the magical side of New York.  It was usually not that big a deal around Christmas Time, but for the middle of Summer and the fact they were tied to a lot of recent burglaries of mystical gems and other items it became a serious issue that was brought to the attention of the American Dragon and his grandfather.  They spent a few days following leads on where the gingerbread men were coming from and they traced them to a new bakery that went up shortly before the robberies started.<br>\r\n<br>\r\n\"You'd think we would have realized the connection,\" commented Jack as they spied on it from a nearby rooftop.<br>\r\n<br>\r\n\"Indeed,\" Lao Shi agreed.  \"However, this makes things more complicated.  They have grown popular since arriving making it impossible to do anything the human world won't take notice of.  To the villain behind all this, it is more powerful than any barrier spell.  We will have to handle thing with the utmost care.\"<br>\r\n<br>\r\n\"Relax, G,\" Jake said with confidence.  \"I know exactly how to put the stop to this.\"<br>\r\n<br>\r\n\"But perhaps you should tell me your plan before you do anything rash,\" his grandfather cautioned him.<br>\r\n<br>\r\n\"It is just a bunch of cookies,\" bragged Jake.  \"This should be a piece of cake.\"</span></div></div>",
            "created":1350536400,
            "id":1449372,
            "title":"Jake and Lao Shi were given a mission to infilt..."
        },
        "111":{
            "author_id":"noxvzhuusox",
            "author_name":"Zhuusox",
            "choices":[
                "He got discovered and captured.",
                "He discovered a secret door that leads to underground. ",
                "He discovered a book of strange spells and magic."
            ],
            "content":"<div class=\"\"><div> <span>Wanting to play it safe, Jake transform into his dragon form.<br>\r\n<br>\r\nJake had slipped in through an unlocked window in the back of the bakery, descending down with a light tap on the floor. \"Hah, piece of cake.\" He said to himself as he peered around the dark room. With the help of his dragon vision, he knew he was definitely in the kitchen of the bakery; ovens and mixers lined the walls with stacks of flour and baking materials in the corners. \"Now lets see where this gingerbread men are keeping their goods...\"<br>\r\n<br>\r\nMoving forward in the dark Jake...</span></div></div>",
            "created":1392786000,
            "id":1748427,
            "title":"Jake bursts in at night in his dragon form."
        },
        "1113":{
            "author_id":"johnman",
            "author_name":"Writerstrike",
            "choices":[
                "Takes the whole dang book and makes a quick getaway.",
                "Rips out a few pages and slips back to Lao Shi.",
                "Takes too long and gets captured."
            ],
            "content":"<div class=\"\"><div> <span>\"Yo. What's this?\"<br>\r\n<br>\r\nJake's clawed hand procures the book resting on the stand, \"The Baker's Guide to Fattening the Galaxy'? Is this their plan?\" Jake flips through the book at a high speed. It's filled, cover to cover, with spells, magic, and recipes. All dealing with weight gain and how to make someone gain weight in specific areas. <br>\r\n<br>\r\n\"Whatever they're planning, seems like they can't do it without this. Better find G and get the heck out of here, before anybody-\"<br>\r\n<br>\r\nUpon turning around, Jake's long dragon tail swipes against a row of pots and pans causing a loud clinking and clanking to ring throughout the kitchen. He holds his breath for a moment. The stillness in the air allows for the sound to stop carrying. The pots and pans cease their swaying and go back into their motionless state.<br>\r\n<br>\r\n\"Phew!\"<br>\r\n<br>\r\n\"Hey! Who goes there?\"<br>\r\n<br>\r\n\"Aw, man! Was I that loud?!?\" Jake panics, someone is approaching the bakery doors awfully fast. With the book in hand he could easily escape. Yet, if he takes it then that'll dfintely tip them off that someone was here. However, he could rip out a few pages for evidence and leave the book here. <br>\r\n<br>\r\n\"Oh...what do I do?\"<br>\r\n<br>\r\nJake...</span></div></div>",
            "created":1447563600,
            "id":2062700,
            "title":"He discovered a book of strange spells and magic."
        },
        "11131":{
            "author_id":"johnman",
            "author_name":"Writerstrike",
            "choices":[
                "The bake sale at your school today!",
                "A party I'm hosting later today. Bring your friends!"
            ],
            "content":"<div class=\"\"><div> <span>The silhouette behind the door drew closer. Jake had to think fast or the mission would’ve been jeopardized. As quick as speeding bullet, Jake snatched the cook book into his possession and jetted through the open window, “Wew. That was a close one!”<br>\r\n<br>\r\nBack in the kitchen, the guard pushes through the door and shines the flashlight around the room. To him nothing seemed out of the ordinary. He snarled and went back to his nap.<br>\r\n<br>\r\n“Yo! You see that, G?”, Jake started on one of his gloating sprees, “I was all like ‘woosh’ and-.”<br>\r\n<br>\r\n“Yes. Yes. Jake. I saw your ‘daring escape’.” Lao Shi rolled his eyes, “Can you please brag when we’re at least out of the perimeter?”<br>\r\n<br>\r\nIt was past midnight. Personally Jake found nothing wrong with being out late. Heck, it even made him feel kinda cool. But, the fact that it was a school night meant that there wasn’t much time for sleep. Jake quietly entered his home and tip toed into the kitchen.<br>\r\n<br>\r\n“Huh. Let’s see, leftovers. Ew. Broccoli. Naw. Eh. I’ll just eat an apple.” Jake set the cookbook down and took the apple upstairs where he slept. Lao Shi wanted Jake to keep possession of the cook book as the current whereabouts are much less suspicious than an Electronics Store that’s also known to sell magical items to magical creatures.<br>\r\n<br>\r\nJake crawled into bed, which looked most comfortable after a mission with a quick escape like that. The trip to slumber land didn’t take long.<br>\r\n<br>\r\n-<br>\r\n<br>\r\n“Man,” Jake sniffed the air, “What smells so good?” He practically lumbered down the stairs. Even after last nights attempt of getting good sleep, the hours didn’t make the basic requirement.<br>\r\n<br>\r\nHe sniffed the air again. The source of the smell came from the kitchen. “That’s strange. Usually there’s eggs and slightly burnt toast. What’s going on today?”<br>\r\n<br>\r\nPast the door frame, Jake spots his mother, Susan Long, humming a happy tune, “Yo, mom. Did you make all this!”<br>\r\n<br>\r\n“Sure did!”, she chirped in-between bites of a cookie, “Your father must’ve brought home this cookbook as a present. The recipes from this are absolutely delightful!” Susan finished the cookie and downed four more before returning to her work.<br>\r\n<br>\r\n\"Oh, crud! She shouldn't be using that! I should...well...\" Jake tried a cookie and doughnut she made. It. Tasted. Wonderful. He had failed to see the reason to warn her about it. It didn't look like it was harming her or anybody. Her cooking could use a little more flavor anyhow. Susan seems to be enjoying herself too.<br>\r\n<br>\r\nFrom this, Jake noticed two things. One was that Susan had made a lot of treats and pastries, like an absurd amount. Everything was packaged and stacked high to the ceiling. And in wide assortments too. From doughnuts to bagels to chocolates and to ice cream. <br>\r\n<br>\r\nTwo was that Susan had appeared a touch chubby as a consequence of being surrounded by calorie heavy food. The outline of her potbelly can be seen pressing against the apron with her green shirt close to second skin status, her ass had appeared a little wider than normal including her thighs that made her blue pants skin tight, and not to mention the extra jiggle from her body with every step. <br>\r\n<br>\r\nJake had raised a finger, but decided it was best to not say anything, “So what is this all for anyway?”<br>\r\n<br>\r\n“Tch,” scowled Susan with her chubby face didn’t I tell you yesterday? This is all for…”<br>\r\n</span></div></div>",
            "created":1448686800,
            "id":2067800,
            "title":"Cook book in use"
        },
        "111311":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Skip to Lunch, Dragon appetites are a strong thing and the treats plentiful.",
                "Skip to Bake sale. New Dragons are about to be born with cookies and doughnuts.",
                "Some unexpected magical effect takes place."
            ],
            "content":"<div class=\"\"><div> <span>          \"Bake sale?\" Jake muttered he vaguely recalled her mentioning something about that. One of those things where the school board raised funds for things they should have received anyway, parents were roped into long hours of baking with no profit, and kids spent money (usually their parents) on buying the overpriced underwhelming treats.<br>\r\n          On the one hand the food Jake's mom was making with the recipes was incredible. On the other however something was almost certainly off for them to be quite <i>that</i> good.<br>\r\n          \"Mom can I take a look at that cook book real quick?\" Jake asked pointing to the pilfered one in question.<br>\r\n          \"Alright but bring it back,\" Susan nodded nibbling on another cookie, \"I still need to double check a couple things.<br>\r\n          Taking the book out of the room Jake quickly found the recipes his mom had been using. Nothing about them seemed too special. The ingredients were fairly normal with a couple exotic additions. And yet something still felt off. Focusing on his powers Jake muttered \"Eyes of the Dragon\" and a moment later his eyes lit with his super dragon sight.<br>\r\n          Now able to see through the magical barriers he'd not noticed before, Jake could see lots of text that had been scrawled in the margins between lines and sides of pages. The first one he examined was the doughnuts his mom had made.<br>\r\n<br>\r\n<div align=\"center\"><u><b>Circular Reasoning Doughnuts</b></u><br>\r\n\"If it's normal it's fine, if it's fine it's normal\"</div><br>\r\n          \" 'Anyone who eats one is mostly unaffected themselves',\" Jake read the notes, \"However, everyone <i>else</i> around them believes the individual is normal whatever they do, say, or look like. Magical beings may have an idea something is off, but few if any can see through the effects.' \"<br>\r\n          Jake mused at this and changed into his full dragon form before swallowing another doughnut he'd snatched from the kitchen. Poking his head back inside he could see his mom still cooking away, \"Mom is it okay if I go to school looking like this?\"<br>\r\n          Looking up from her baking Susan eyed Jake for a moment before shrugging, \"I don't see why not. Just watch where you're flying, alright?\"<br>\r\n          <i>This is great,</i> Jake thought to himself, <i>I don't have to hide my dragon form anymore. I can just be my dragon self all the time.</i><br>\r\n          Flipping through the book to check the other recipes Jake spotted the one for the cookies and felt a smile curl his face. \"Oh that would be so cool if it works,\" he muttered to himself before leaving the book for his Mom to continue working with, \"Okay mom, I'm going to head to school.\"<br>\r\n          \"Take a few cases of treats with you,\" Susan smiled at him, \"Feel free to give a few to your friends, just don't hand them all out too soon. And don't eat them all yourself either.\"<br>\r\n          \"Don't worry Mom, I won't,\" Jake chuckled, but on the flight to school that seemed all the harder to do. Only the fact he'd crash if he tried to eat and fly kept him from nibbling on the treats in the boxes under his arm. Instead he focused on the fact the doughnuts really seemed to have worked. Plenty of people saw him  pass overhead, but not one of them seemed at all surprised to see a big read dragon flying downtown.<br>\r\n          Finally arriving at the school Jake couldn't resist and pulled open one of the boxes to sample it. He''d just bit into another delicious cookie when a pair of familiar voices interrupted him.<br>\r\n           \"Hey Jakey!\" \"Yo, dude, what's up?\"<br>\r\n          \"Trixie! Spud!\" Jake swallowed and turned to greed his friends giving them both a (gentile) high five. He had to be cautious with his dragon strength after all.<br>\r\n          \"What brings you here so early?\" Spud asked, \"Another 'mission'?\"<br>\r\n          \"Nah, nothing like that,\" Jake smiled, glad to see the 'normalizing' effect still working as both didn't question why he was in dragon form now, \"Just helping mom get set up for the bake sale. Brought some of her cooking early. You guys want to try some?\"<br>\r\n          \"Heck yeah,\" Spud smiled but Trixie was more cautious. \"I don't know Jake, you sure it's alright?\"<br>\r\n          \"Totally,\" Jake nodded, \"Mom even said I could give a little to my friends. I just need to be quiet about it. Can't go giving it all away for free.\"<br>\r\n          Pointing to a nearby alleyway the trio walked out of sight to where Jake could hand over the good. Grinning he gave them each one of the cookies first. If the effects worked as he hoped...<br>\r\n          Indeed they seemed to be doing just that as Jake watched a pair of pearly horns sprout from Spuds head, and a set of chocolate brown 'sail' plates emerged down Trixie's back. According to the recipe the 'Creature Cookies' could turn any non-magical being into the same magical one as the individual who baked it. Jake's mom Susan might have been the 'skipped' generation in terms of gaining full dragon powers, but she still carried the magical potential inside. And now that possibility was baked into each of her cookies.<br>\r\n          As soon as both had finished changing, Jake handed each of them a doughnut as well, to insure no one saw anything different, even each other. As they ate Jake gave them a look over. Both were dragons of similar shape to him,though Trixie was half a head shorter and had slightly more curved as evidenced by her faintly hourglass shaped form showing off her tan-cream colored belly scales that were a nice contrast against the chocolate brown of the rest of her. Spud meanwhile had become the same dark blue as his shirt and likely it was only his lanky and somewhat under-muscled figure that had kept his clothes from tearing as he grew to just under Jake's height, his hat perched precariously among a crown of brown spikes that imitated his hair. <br>\r\n          \"Jake? Everything alright?\" Trixie asked, \"You've been staring at us for the last minute without a word.\"<br>\r\n          \"Oh! Uh, sorry,\" Jake muttered in embarrassment, \"I was just curious what you thought of the treats.\"<br>\r\n          \"They're just amazing Jake,\" Spud chuckled licking the glaze off his claws with the long forked dragon tongue he now possessed and seemed completely used to, \"Your Mom should be a world-class cook.\"<br>\r\n          \"I'll say,\" Trixie nodded stretching her wings, \"Come on, we should get to class. We don't want to be late or they might give us detention, and then they'd keep us from tasting some more of those goodies later.\"<br>\r\n          Both were a little awkward flying back across the way to the school, but for a short flight Jake was glad to see they did so well for a first time. Spud landed in the trashcan which he walked off with a shrug. Inside everyone seemed to treat them as casually as they did Jake and already the young American Dragon was seeing the possibilities. When the Bake Sale happened dozens, or perhaps a couple hundred students would become brand new dragons. Completely free to be just that without hiding. It would be quite the wonderful thing. Of course as Jake nibbled on another sweet treat, he had forgotten just how fattening these treats were as well.</span></div></div>",
            "created":1448859600,
            "id":2068520,
            "title":"New Plans, New Food, New Dragons"
        },
        "1113112":{
            "author_id":"zaklionsaurus2",
            "author_name":"Zakthelion",
            "choices":[
                "Dragon up!",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what now half of New York high school or the entire city will be filled fat dragons! I can just imagine Jake saying oh man. Heck rose even might become a pink dragon of herself. I guess they can call the city new dragon city.</span></div></span></div>",
            "created":1584677100,
            "id":2803942,
            "title":"Skip to Bake sale. New Dragons are about to be ..."
        },
        "111312":{
            "author_id":"johnman",
            "author_name":"Writerstrike",
            "choices":[
                "That cake does look really good",
                "Lao Shi comes to the party."
            ],
            "content":"<div class=\"\"><div> <span>“So you’re saying that you just woke up and your mom had made a ton of treats? “ Spud asked speaking slowly as usual, “Well, I guess that’s something mom’s do.”<br>\r\n<br>\r\n“Yeah, but the fact that she made so many! I’m talking pastries wall to wall Spud. It think it has to do something with that spell book I got the other day.”<br>\r\n<br>\r\nTrixie rolled her eyes, “Maybe your looking too far into it. It’s a magical spell book, yeah-yeah, but it also makes super delicious food. You said that donut you had this morning was perfect.”<br>\r\n<br>\r\n“Aw, man.” Jake drearily smiled, “It was to die for.” His mouth salivated at the thought of gulping down dozen after dozen.<br>\r\n<br>\r\n“See. Nothing to worry about. Your mom just wants to show off some of her cooking skills is all.”<br>\r\n<br>\r\nJake opened the front door to his home and saw the party was already bustling with people. Many whom were friends with Jake’s mom and dad with a few relatives too. <br>\r\n<br>\r\nSusan had popped into view, looking much wider than before. Her under shirt and jacket had become like a second skin along with her apron that outlined the rotundness of her belly. “Oh, Jake! Good thing you’re here. I need you to serve these donuts to the guests. Spud I want you to taste test a few things since you like my cooking.”<br>\r\n<br>\r\n“Wait. I do?”<br>\r\n<br>\r\nSusan fat hand took spud by the arm. He negated to resist as he couldn’t peel his eyes away from the swishing of Susan’s big, soft butt, “Yes, ma’am…”.<br>\r\n<br>\r\nTrixie snatched a few donuts from the tray and began to eat them, “Oh! You were right, Jakie! These are the bomb!”<br>\r\n<br>\r\n“I know right!”, Jake had abandoned his mother’s orders and proceeded to chow down on the frosted pastries. With each one finished he felt a weird kind of clenching sensation from his clothing. Like he’s getting…fatter?<br>\r\n<br>\r\nYet, for some reason, Jake’s mind had disregarded this notation and continued eating.<br>\r\n<br>\r\n“Say, uh, did you notice something strange about your mom?” Trixie questioned with a mouthful of cake pops. <br>\r\n<br>\r\n“Like what?”<br>\r\n<br>\r\n“Like…and I ain’t tryin’ to be mean or nothin’, but she looked a little big.”<br>\r\n<br>\r\nJake waved his hand and stuffed three cookies in his mouth, “Nah, she’s probably just bloated from all that snacking she’s been doing all day. You know how…women…are…”<br>\r\n<br>\r\nTrixie raised an eyebrow, “All I’m saying is something looked a little off, but if you thinks it’s fine.” Trixie turned her head to the large pink frosted cake in the middle, “I’m gonna grab myself a slice of cake.”<br>\r\n<br>\r\nJake looked about the room and noticed something odd about the people. He spotted a lot more eating that talking, his relatives seemed to have collectively gained a good amount of weight since he last saw them, and a number if buttons were scattered across the floor.His mind began to pick up on what was happening, “Hmm, now that you mention it…”, he mumbles as he unconsciously rubs his belly.</span></div></div>",
            "created":1450466460,
            "id":2076182,
            "title":"A nice little get-together"
        },
        "11132":{
            "author_id":"gecko88",
            "author_name":"Gecko",
            "choices":[
                "indeed magic spells.\"",
                "just ordinary recipes, they're not even magical.\" "
            ],
            "content":"<div class=\"\"><div> <span>Using a claw he rips out a few pages and places the book back on the stand, closing it so it's not immediate that anyone can find out some pages are missing. With a handful of paper he hastily leaps upon a kitchen counter, opens a window and flies out. <br>\r\n<br>\r\n\"The Amdrag is back!\" Jake said triumphantly as he landed back on the rooftops. <br>\r\n<br>\r\n\"Back so soon? Did everything go well?\" Asked Lao Shi.<br>\r\n<br>\r\n\"Well you know, I'm such a good detective I didn't need all that long at all! Like a ninja I snuck in and silently right under the nose of a guard I got some evidence!\" Jake said boastfully as he handed over the torn pages. <br>\r\n<br>\r\n\"Let me see, young one. Pages? Were these from some magic tome?\" <br>\r\n<br>\r\n\"I'm not sure about that, but it was some big creepy book. It was called 'The Baker's Guide to...something something', it's gotta be something evil.\"<br>\r\n<br>\r\nSquinting his eyes, the elderly man stated. \"Jake these are...  </span></div></div>",
            "created":1580558460,
            "id":2781114,
            "title":"Rips out a few pages and slips back to Lao Shi."
        },
        "111322":{
            "author_id":"gecko88",
            "author_name":"Gecko",
            "choices":[
                "sneak back into the bakery this time to take the whole book.",
                "cook the recipes, maybe once baked they'll reveal something about them."
            ],
            "content":"<div class=\"\"><div> <span>\"Not magical, What? That book had a ton of weird looking spells and Magical things. Let me see that!\"<br>\r\n<br>\r\nSnatching the pages back Jake inspects them. When he previously looked at the book he could have sworn they had odd ingredients and incantations. Now he was just looking at a page that had a basic chocolate chip cookie recipe. The others were the same, only containing basic recipes for some cakes, cookies and a handful of other treats.<br>\r\n<br>\r\n\"These weren't like this before they...\"<br>\r\n<br>\r\n\"Jake.\" His grampa interrupted, letting out a small sigh. \"Your brashness and over excitement has clouded your judgement. You went in with no plan and came out thinking just a few pages from some cookbook would do. I know you're still new to this young one, but you must try harder rather then just trying to be impressive.\"<br>\r\n<br>\r\nLao Shi didn't even sound angry, just disappointed which made his words hit harder than usual. Jake knew he screwed up at times but he was so sure that the pages would help against The Baker.<br>\r\n<br>\r\n\"We shall meet here again another night and try again, this time I will go in. It is late I suggest you head home and rest.\"<br>\r\n<br>\r\nFeeling dejected Jake being his flight home.<br>\r\n<br>\r\n<br>\r\nWaking up the next day Jake still felt depressed from last night and had stayed in bed through most of the day. It was Saturday so he had time to mope not having to worry about school. He just kept running what Gramps had said to him over and over. A soft knock on his bedroom door barely interrupted his thoughts, from behind it he heard his mother call.<br>\r\n<br>\r\n\"Jake, we're going to Haley's music recital. I know you had a late mission last night with your grandpa so I figured you wouldn't want to come. We'll be back late, see you later honey.\"<br>\r\n<br>\r\nHearing her footstep leave his door Jake looked over to the scraps of paper he had torn from the book. He felt them glare back at him from his side table and grew frustrated at them just knowing something wasn't right about them and the book. Grabbing them and looking them over trying to find something new about them, though again nothing about the pages seemed off. His frustration grew more until he decided to...</span></div></div>",
            "created":1580562660,
            "id":2781122,
            "title":"just ordinary recipes, they're not even mag..."
        },
        "1113222":{
            "author_id":"gecko88",
            "author_name":"Gecko",
            "choices":[
                "sees the purple glow and new words on the page.",
                "is put into a trance!"
            ],
            "content":"<div class=\"\"><div> <span>Still dressed in his red button up PJs and with new determination he kept a hold of the pages and left his room. As he entered the kitchen he immediately collected all the pots, pans, flour and other assortments of ingredients he could find. Placing them all on the kitchen table he then looked at the pages he had, having not done much baking apart from helping his mother some very few times when he was younger he decided on which one would be easiest to create.<br>\r\n<br>\r\n\"Oh sweet, cookies! I've baked cookies before with mom, I know these are easy enough.\" He said in excitement. <br>\r\n<br>\r\nAs he was mixing and preparing the cookie dough something odd began to happen, the page he had propped up on a book stack began to glow an eerie purple. New words forming on the page as it sensed it's new kitchen environment, the ingredients and the utilities nearby. Unknown to most the book had a cloaking spell upon it and it's pages that when the book is being used in a kitchen area the book would reveal it's dark secrets. <br>\r\n<br>\r\nJake had not notice it's glow, too focused on mixing the cookie dough but as Jake looks upon the page for the next step he...</span></div></div>",
            "created":1580580480,
            "id":2781210,
            "title":"cook the recipes, maybe once baked they'll ..."
        },
        "11132222":{
            "author_id":"gecko88",
            "author_name":"Gecko",
            "choices":[
                "eat one, what could possibly happen? ",
                "Resists realising something strange has been going on."
            ],
            "content":"<div class=\"\"><div> <span>A purple haze fills Jake's vision and his mind goes numb. With his eyes glowing the same sinister purple as the page he continues to make the cookies, his body moving on it's own seemingly as if possessed by a master chef. All his measurements and mixing of the bowl were done perfectly as he then places the dollops of dough over two baking trays ready for the oven, his possessed state making him make more than he intended. Carrying the trays over to the oven his mouth opens up and he mumbles a strange incantation the words leaving his mouth began to hex the dough filling them with a dark intent. With his wild whisperings over he places them into the oven his as whole body moves again to make another batch and repeat over.<br>\r\n<br>\r\nJake blinks the purple glow leaving his eyes and the world suddenly comes back to him. Looking around he notices on the table the flour container empty as was the container for the butter, all the eggs were gone too.<br>\r\n<br>\r\n\"What the...I was only making one tray, how did I-WHAT?!\" Turning around he saw on the kitchen counter he somehow had made at least over a hundred cookies. <br>\r\n<br>\r\nAll neatly in any sized tupperware boxes were the cookies still radiating some warmth. In his baking haze he somehow not only cooked them but used all the tubberware in the house to fit them into seven containers. <br>\r\n<br>\r\n\"Ok ok, so...what just happened, did I zone out? Did I make all this? I'm never this tidy!\" Jake said to himself as if someone would answer.<br>\r\n<br>\r\nOpening up one of the warm boxes he was instantly hit with a cozy chocolatey smell, he decides to...</span></div></div>",
            "created":1580585640,
            "id":2781236,
            "title":"is put into a trance!"
        },
        "111322221":{
            "author_id":"gecko88",
            "author_name":"Gecko",
            "choices":[
                "a page from the book!",
                "one of the containers of cookies!"
            ],
            "content":"<div class=\"\"><div> <span>\"I might not know what happened but these cookies can't be evil, evil doesn't smell this good after all!\" And with that odd logic he bites into one of the cookies.<br>\r\n<br>\r\nInstantly an explosion of chocolate flavour hits his taste buds.<br>\r\n<br>\r\n\"These are so good!\" Jake exclaims biting again and again into the cookie till it's gone.  <br>\r\n<br>\r\nPicking up another he hesitates, thinking how he really shouldn't eat too many but the aftertaste and crumbs he's now licking off his lips beg him to try more.<br>\r\nAs if possessed again he began wolfing down more and more of the cookies from the container he opened. Though throughout this binge he doesn't notice that his once small stomach is starting to push outwards, domeing as it presses up against his button up pajama shirt. A thin layer of fat has nestled itself all over his body, his stomach grew outwards not by much but certainly enough to be called puppy weight. His chest become slightly fuller as each pec became padded. The waist of his PJ trousers dug in a little extra as his love handles developed and his waist adding another couple of inches to it self. His hips, buttocks and thighs all fought for room in his tightening trousers.<br>\r\n<br>\r\nAfter he finished is second container he was reaching for a third when a 'pop' sound stopped him. Looking down he now saw the damage he had caused to his own body.<br>\r\n<br>\r\n\"Ahh! WHAT HAPPENED?!\" He shouted out. Realizing the noise he heard was a button from his PJs snapping off.<br>\r\n<br>\r\nA chubby belly had now processed it's way out from his shirt as it rested itself over the cord of his pajama pants, the rest of the buttons on his top strained trying to contain the rest of his pudge. His chest had now become small handfulls as is boy boobs had now developed a slight crease as they rested on his chest. Taking a step he could feel his thighs jiggle and noticed the side seam of his pajama pants was allowing some of his skin to show at his now protruding hip. <br>\r\n<br>\r\n\"I've...I've got to get to Gramps, he better know how to reverse this. At least I know now that book was the real deal.\" He said at least trying to gain a small recovery rather then only gain weight. <br>\r\n<br>\r\nHe picked up the pages and the rest of the tupperware housing the cookies and headed up stair to his room. His new bouncing buttcheeks tore the seat of his pants after reaching the last step. <br>\r\n<br>\r\nEntering his room he threw open his window as he went into his dragon form.<br>\r\n<br>\r\n\"Awww man, as if it couldn't have gotten worse!\" He said once the magic flames from his changing cleared and he was introduced to his new dragon form.<br>\r\n<br>\r\nAll the fat he gained whilst human carried over, his yellow scaled belly protruded outwards into a round basketball that bounced as he inspected the damage. His chest now having become cuppable as his pecs now rested somewhat on his belly. His red scaled legs had meaty thighs as they had grown to be wider than what his waist was in his chubby human form. His rump made contact with his plumped up tail as it looked like it was wedged between his butt cheeks. Climbing out the window his hips rubbed against the frame making him struggle as he was getting out. Once freed he flew wobbly towards Grampa's store. <br>\r\n<br>\r\nUnknowing to Jake though in his haste to leave he had left in the kitchen...</span></div></div>",
            "created":1580593320,
            "id":2781285,
            "title":"eat one, what could possibly happen? "
        },
        "112":{
            "choices":[
                "Is suddenly ambushed!",
                "Finds some sweets left on a table.",
                "Discovers a hidden passage."
            ],
            "content":"<div class=\"\"><div> <span>Jake had slipped in through an unlocked window in the back of the bakery, dropping down with a light tap on the floor. \"Hah, piece of cake.\" He said to himself as he peered around the dark room. He was definitely in the kitchen of the bakery; ovens and mixers lined the walls with stacks of flour and baking materials in the corners. \"Now lets see where this gingerbread men are keeping their goods...\"<br>\r\n<br>\r\nMoving forward in the dark Jake...</span></div></div>",
            "created":1377752400,
            "id":1653447,
            "title":"Jake sneaks in at night as a human."
        },
        "1122":{
            "choices":[
                "Grabbed another... and another!",
                "Felt suddenly sleepy...",
                "Felt his jacket get a little tighter!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jake crept along the counters when he noticed a platter of donuts next to him. \"Hmmm free sample huh?\" Jake picked one up and took a bite, \"Mmm, not bad.\" Gulping down the rest of the donut Jake then...</span></div></span></div>",
            "created":1385010000,
            "id":1697529,
            "title":"Finds some sweets left on a table."
        },
        "11222":{
            "author_id":"theyoungwolf17",
            "author_name":"Theyoungwolf17",
            "choices":[
                "The Dark Dragon",
                "Ron Stoppable? "
            ],
            "content":"<div class=\"\"><div> <span>He yawned, and then collapsed on the ground. When he awoke, it was dark. He tried to move, but his arms and legs were tied down to a table. \"What the heck?\" he exclaimed. He tried struggling with the chains, until he realized that he could break them in dragon form. \"Dragon up\" he said, waiting to change. Nothing happened. \"Dragon UP\" he said again, with much more vigor. But still, it wouldn't work. He couldn't change into his dragon form. \"Well well well\" echoed an ominous voice. The lights flicked on and there was....</span></div></div>",
            "created":1385874000,
            "id":1701756,
            "title":"Felt suddenly sleepy..."
        },
        "115":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Jake waits patiently, planning a means of escape.",
                "Jake attempts to bust out now.",
                "Lao Shi attempts a rescue with reinforcements."
            ],
            "content":"<div class=\"\"><div> <span>Before Jake could talk about his plan, the two dragons heard footsteps behind them. They turn around, faced with a mob of gingerbread men, glaring angrily at them.<br>\r\n<br>\r\n\"Uh oh, we've got company. Dragon up!\" Jake said.<br>\r\n<br>\r\nThe two changed themselves into their dragon forms, ready to battle the living cookies. However, the gingerbread men greatly outnumbered them, swarming the two dragons. Jake punched and pushed them back, as his grandfather blew flames at them. But the gingerbread men were relentless. They jumped onto Jake, pinning him down. His grandfather, however, managed to escape their grasp and flew up into the sky.<br>\r\n<br>\r\n\"Gramps! Help! These cookies are tough!\" Jake said.<br>\r\n<br>\r\n\"Jake! Don't worry Jake, I'll come back for you!\" Lao Shi said.<br>\r\n<br>\r\nWith that, his grandfather flew as fast as he could to his shop. Meanwhile, the gingerbread men held onto Jake tightly. Jake fought and struggled with all his might, but was eventually worn out. The gingerbread men then lifted him and carried him into the bakery. Inside, he was carried into a backroom, through a door and a flight of stairs, and into a large basement or cellar. It was dark, the only illumination being the few lamps hanging on the ceiling. There was a large empty cage tucked in the corner, which Jake was thrown into.<br>\r\n<br>\r\n\"Lemme out, you baking rejects!\" he shouted.<br>\r\n<br>\r\n\"Now now, that's no way to treat my delicious creations.\"<br>\r\n<br>\r\nJake looked to the side, seeing a figure step out of the shadows, revealing a young man in what appears to be a chef's white outfit, an apron, and a tall chef's hat. He had a menacing glint in his yellow eyes as he looked at Jake.<br>\r\n<br>\r\n\"And who are you supposed to be?\" Jake asked.<br>\r\n<br>\r\n\"Now now, I'm no one important. But if you have to know who I am, you can call me...The Baker.\"<br>\r\n<br>\r\n\"The Baker? So you're the one who's been behind all those robberies!\"<br>\r\n<br>\r\n\"That's right. I need all those objects to bring life to my creations, and to make some money on the side. But you, a dragon! I'm very glad that you're here.\"<br>\r\n<br>\r\n\"Oh? And why's that?\"<br>\r\n<br>\r\n\"Because, dragon meat is such a rare delicacy.\"<br>\r\n<br>\r\nThe Baker approached Jake's cage, leaning closer to take a look at him. Jake inhaled and blew fire at him, but one of the gingerbread men stepped in between, blocking the fire from harming him.<br>\r\n<br>\r\n\"My my, feisty, aren't you? Well, you're not nearly enough to make an appetizer. I'm going to have to plump you up to get more dragon meat to work with.\"<br>\r\n<br>\r\n\"Ha! If you think I'm just gonna sit here and eat your cooking, you've got another thing coming!\" Jake shouted.<br>\r\n<br>\r\n\"Oh? You'll find that my cooking will be a bit...difficult to refuse.\"<br>\r\n<br>\r\nJake's cage opened as a gingerbread man stepped inside. It forced his mouth open as it broke a piece of itself off and shoved it into Jake's gaping mouth. The force-feeding went on, the gingerbread man growing smaller and smaller, until it collapsed into a lifeless pile of cookie chunks.<br>\r\n<br>\r\n\"Bleugh! I'd rate your cooking zero stars!\" Jake said, a defiant tone in his voice.<br>\r\n<br>\r\n\"Heheheheheh, I don't care for your opinion, dragon. I'll have you fattened up soon enough, and once you're sufficiently plump...It's time for dragon meat pies.\"<br>\r\n<br>\r\nThe Baker laughed as he made his way out of the basement. The few gingerbread men that remained stood on guard, watching him.<br>\r\n<br>\r\n\"Great, what do I do now?\" Jake said to himself.</span></div></div>",
            "created":1424322000,
            "id":1936766,
            "title":"The Baker"
        },
        "1153":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Lao Shi and the others arrive at The Baker's hideout.",
                "Something goes wrong during the rescue mission.",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>Soon Lao Shi eventually reached his shop and immediately looked up at an already humongous  Fu dog standing there with two of his humongous friends consisting of Hercules formerly one half of a team by the name of Spiff and Hercules, and Digger the gopher who had a series of shorts entitled the adventures of Digger and friends who for awhile had been training at a special Sumo stable in downtown New York along with Fu dog and Hercules the cat as they were known as the super duper Sumos.<br>\r\n<br>\r\n\"Fu dog what happened to you and who are these two other creatures?\"  Lao Shi asked.<br>\r\n<br>\r\n\"I've been gaining lots of weight at this special Sumo stable along with these two as well. You see we're referred to as the super duper Sumos. Also we kinda Sumo sized ourselves which explains how all three of us appear to be humongous and fat.\" Fu dog said.<br>\r\n<br>\r\n\"Super duper Sumos? Oh never mind that, listen Jake's in trouble and I need reinforcements to back me up since I'm going to attempt a rescue mission.\" Lao Shi explained.<br>\r\n<br>\r\n\"Jake's in trouble? What happened?\" Fu dog asked.<br>\r\n<br>\r\n\"I almost was ambushed, but Jake's being held captive by a villain known as The Baker. Now before we go we have to come up with a plan of some sort.\"<br>\r\n<br>\r\nEventually Lao Shi explained his plan to Fu and the others as they were on their way to rescue Jake at any costs.<br>\r\n<br>\r\nWill Lao Shi and the others be able to rescue Jake or will they be doomed and end up like Jake himself?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1424581200,
            "id":1938459,
            "title":"Lao Shi attempts a rescue with reinforcements."
        },
        "13":{
            "author_id":"asdf246",
            "author_name":"McNicky",
            "choices":[
                "Put on weight at a slow but constant pace",
                "Increase his appetite and and turn all food he eats into fat",
                "Want to become fat"
            ],
            "content":"<div class=\"\"><div> <span>It was just another normal day in New York for Jake Long he went to school, hung out with his friends and then he went to his grandpa's shop were Fu dog told him to get down to Central Park because there was trouble, again a normal day for the American Dragon. Jake went down to Central Park and saw what was causing the trouble, there were trolls who were terrorizing the other magical creatures who lived there, then he dragon'd up preparing to fight the trolls and one by one he took them down and before he knocked out the last one he blew some magical dust in his face which made him lose consciousness. <br>\r\n<br>\r\nWhen Jake woke up he was still in dragon form but was locked up in a magically reinforced cage and seemed to be somewhere underground from what he could tell, he was trying to think of who could do this when a dark figure stepped out from the shadows and said \"We meet again American Dragon\", Jake turned to where the voice came from and saw who had captured him, it was none other than the Dark Dragon. \"How is this possible we destroyed you and you couldn't be revived without my chi which I know you don't have\" said Jake. \"Never mind how I'm here, just know that its time I get you out of my way once and for all\". The Dark Dragon then took a spell book from a nearby table and began to recite a spell on Jake, soon a mystical energy surrounded Jake and he felt that the spell was doing something to him, then the Dark Dragon finished the spell and the energy dispersed. \"Ha\" said Jake \"your spell didn't work on me after all\". Little did Jake know that the spell did work and it will cause Jake to...</span></div></div>",
            "created":1458975900,
            "id":2122905,
            "title":"Captured by the Dark Dragon."
        },
        "14":{
            "author_id":"noxvzhuusox",
            "author_name":"Zhuusox",
            "choices":[
                "His exam's results ended him up in the Dragon Sumo Leagues.",
                "His exam's results ended him up in food tester.",
                "His exam's results ended him up in the culinary arts.",
                "His exam's results ended him up in... science as a test subject(lab rat)?",
                "His exam's results ended him up in...(Free Choice)"
            ],
            "content":"<div class=\"\"><div> <span>\"Aww, come on gramps.\", whined Jake to his grandfather as they fly in the evening sky in their dragon forms. \"Do we really have to go to this...dragon camp or whatever ya call it? Don't we have better things to do like my duty for one?\" <br>\r\n<br>\r\nLao Shi rolled his eyes in annoyance at his grandson and pupil's whinning and immaturity as they flew to said camp. His dragon form was that of a chinese dragon, his azure blue scales glimmering in the dying sunlight along with his pale yellow underbelly. Trailing from the top of his head, to his back, to the tip of his tail, spike of gray protrude. \"Yes, Jake. As I said before; we have to because one, I requested this from the Dragon Council for us to have a vacation for us to spend together with activities and to relax from our duties as magical protectors.\"<br>\r\n<br>\r\n\"Okay okay, I can be cool with that.\", grumbled Jake, his anthromorphic dragon form based like the dragons of modern time, flap his crimson wings as he flew after his grandfather. His crimson scales shine in the colors of fire from the light of the setting sun, along with his golden yellow underbelly glowing in a ethereal way. Just like the older azure dragon. his spikes were colored that of forest green with black highlights. \"What I don't get is why is <i>she</i> coming along?\", Jake grumbled again while jerking a thumb towards the other being accompanying them.<br>\r\n<br>\r\n\"Do we have to explain it to you again, Jake?\", tutted the smaller being innocently much against Jake's liking, her voice was that of a young girl. \"My mentor was given a mission by the council that she couldn't take me on with and decide to leave me with you and grandpa instead for a while.\", the young girl that Jake acknowledge as his little sister, Haley, finished cheerfully, shooting her brother a innocent smile that he found himself suspicious at. Her dragon form was of course smaller than the other two older dragons. Her entire form was that of purple hues.   <br>\r\n<br>\r\n\"Enough you two!\", Lao Shi shouted at the two, startling them. \"We are nearing the camp's location so you two better be on best behavior when we are there while going through their examinations.\", Lao Shi said with a hard edge in his voice that the other two pick up, quietening down instantly. But that was quickly came to an end by Jake.<br>\r\n<br>\r\n\"Examinations? What examinations?\", Jake ask, a bit confused. \"I thought we are going there to just train on my drag skills and to relax and stuff, G.\" <br>\r\n<br>\r\nLao Shi sighed while they all began to descend to the ground. \"Yes Jake, we are and will hopefully. As your question for the examinations. You see, this camp is for, as you can see obviously, for dragons. Its purpose and goal is to help and decide where are we best suited at in the society of the magical world.\", Lao Shi explained as they appear before a giant wooden gate, carvings of dragons of all kinds were etched into it. \"The examinations will helped decide what area of expertise we belong to most, by going through numerous and different trials. From magic and knowledge to skills and strengths of any kind and more. This will be done by judges of those many areas of said areas of expertise.\"<br>\r\n<br>\r\nLao Shi finished explaining to Jake as they walked into the massive building that was in the middle of the city wide magical camp.<br>\r\n<br>\r\n\"Whoa.\", Jake said, feeling nervous now. What was going to happen to him in this examination? How will his future and fate be decide in it? <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1350882000,
            "id":1451560,
            "title":"Jake going to summer camp for dragons with his ..."
        },
        "141":{
            "author_id":"asdf246",
            "author_name":"McNicky",
            "choices":[
                "A waiting room filled with other people",
                "A weight room filled with fat dragons"
            ],
            "content":"<div class=\"\"><div> <span> It was the day after the examination and Jake was sitting in his room waiting for the letter that would tell him where he would be placed in society of the magical world. He was sitting on his bed listening to music when he heard a knock at the door, he went and opened the door to find a envelope on the ground, no doubt his examination results. He closes the door and opens the envelope to find an letter with his name on it. He opens the letter and reads, Congratulations Jake Long, you have been selected to be placed in the Dragon Sumo League, please go to training facility B at 12:00.<br>\r\n<br>\r\n\"Wait what ! Dragon Sumo League, I've never ever even heard of that. This has to be a mistake\", Said Jake, confused.<br>\r\n<br>\r\nThen Jake's grandfather and Fu enter the room<br>\r\n<br>\r\n\"Ah Jake I see you have gotten your results\", Said Lao Shi. \"Yeah I did gramps, but there has to be a mistake because I've apparently been placed in this Dragon Sumo League\", Said Jake<br>\r\n<br>\r\n\" That's no mistake kid\", Said Fu. \" The Dragon Sumo League is a real placement, and a rare one too. Only a couple dozen are chosen for it every couple years, your lucky kid thats one of the best placements you could get. Every dragon that does it is set for life, and are paid some serious cash. It's also one of the biggest sports in the magical world.\"<br>\r\n<br>\r\n\"Then why haven't I heard about it?\" Said Jake<br>\r\n<br>\r\nIt's an adult sport you don't know about it till your older\", Said Fu<br>\r\n<br>\r\n\"So I'm just suppose to go and become a sumo wrestler? Im not sure about this.\" Said Jake<br>\r\n<br>\r\n\"Jake the examinations are never wrong, this is what you are best suited for. And I'm sure if you go along with it you will like your decision\", Said Lao Shi<br>\r\n<br>\r\n\"Well if your sure gramps\", Said Jake<br>\r\n<br>\r\n\"Hey kid you better get going it's 11:45\", Said Fu. \"Ok then well see you later gramps\", Said Jake<br>\r\n<br>\r\nThen Jake left the room and started heading for training facility B, when he got there he was surprised at how big it was. It was a 3-story building that was about the length of a football field. He stood at the door and took a deep breath and pushed open the doors and entered finding...<br>\r\n<br>\r\n</span></div></div>",
            "created":1432357200,
            "id":1981659,
            "title":"Welcome to the Dragon Sumo League"
        },
        "1411":{
            "author_id":"asdf246",
            "author_name":"McNicky",
            "choices":[
                "check out our rooms",
                "see the buffet",
                "look at the training equipment"
            ],
            "content":"<div class=\"\"><div> <span>Jake enters to find a waiting room filled with other people who were probably also placed in the Dragon Sumo League. He also noticed how all of them were teenagers like Jake, but a lot of them were fat too. But it makes sense, Jake then starts wandering the room, it was like what you would find in a hotel lobby. The walls and ceiling were red and there was a big chandelier hanging on the ceiling. While wandering he bumps into someone accidentally.<br>\r\n<br>\r\n\"Oops sorry about that\", Said Jake. Then the person he bumped into turned around, \"It's alright, hi there my name is Zack\", Said Jacob. Jake then got a good look at Zack, he was a bit taller than him, had curly light brown hair and hazel eyes. His face was a little chubby with the beginnings of a second chin, he was wearing jeans and a blue shirt and had a small pot belly pushing out his shirt a bit.<br>\r\n<br>\r\n\"Hi, my name is Jake, so you also got placed in the Dragon Sumo League?\", Said Jake. \"Yeah I did, I was surprised at first, never even heard of it but i guess it's what ill be best at\", Said Zack<br>\r\n<br>\r\nThen everyone heard a big BEEP and a voice spoke over the intercom. \"Will everyone please enter through the door at the center of the room, thank you\". Everyone including Jake and Zack headed for the door and on the other side was what looked like a gym, it had all kinds of training equipment that you would normally see in a gym but with a couple exceptions such as the rings over head that are meant to be a flying obstacle course and there was equipment to straighten a dragons wings or a practice dummy for fire ball shooting practice and so on, there was also and area to the left that looked like it was for sumo training it was an area covered almost entirely with sumo rings. Then a very large man walks in, he looks like he weighs over 300lbs, he was wearing a grey track suit which clung to his body showing of his fat. This man stopped in front of everyone and said \" Welcome new  trainees to the Dragon Sumo League's training camp for newbies, I'm your instructor you will call me sensei and nothing else. For the remainder of the camp you will all be staying here, the 3rd story will be your sleeping quarters, the 2nd floor is a 24 hour all you can eat buffet, and the 1st floor is where you will train\", Said sensei.<br>\r\n<br>\r\n\"But we didn't bring any thing here and you expect us to stay here?\" Said a random guy<br>\r\n<br>\r\n\"Yes I do, and you won't need anything of yours here all you need is upstairs in your quarters, and you can not leave the building under any circumstance, now you will have the remainder of the day to explore the building, but you all have to be in your rooms by 9:00 sharp. And tomorrow we will begin instruction\", Said sensei<br>\r\n<br>\r\nHe then left the room leaving them alone. \"So Jake where do you want to go first?\", Asked Zack<br>\r\n<br>\r\n\"I think ill go to... <br>\r\n</span></div></div>",
            "created":1432357200,
            "id":1981855,
            "title":"A waiting room filled with other people"
        },
        "14111":{
            "author_id":"asdf246",
            "author_name":"McNicky",
            "choices":[
                "Putting on pounds to meet the weight requirement ",
                "Strenghening your muscles to support your future weight"
            ],
            "content":"<div class=\"\"><div> <span>\"I think i'll go to check out our rooms\" said Jake, \"suit yourself, I'm going to see the buffet\" said Zack as he left. Jake then went over to an elevator and pressed the button to take him to the 3rd floor and when one opened he stepped in side and waited but nothing happened so he pressed the 3rd floor button again trying to get it going but still nothing happened and unknown to Jake a scentless and invisible gas began to fill the elevator and Jake fell to the ground unconscious. When Jake woke up he was lying in a large bed that looked like it could be used by 4 people at once, he got up and saw he was in a spacious room that was rather plain as it's walls were all white with no windows or decoration, there were two doors in the room the first Jake saw lead to a bathroom with a large shower and bathtub and a toilet and sink, Jake went to the second door and saw it lead to another area. It was a wide open space with different areas, one area was filled with training equipment like the first floor had, another area was a kitchen with a unusually big fridge and a table, the next area looked like it was made for sumo training in mind, and the fourth area looked like a living room with a couch, a lounge chair, a coffee table, and a huge flatscreen tv.<br>\r\n<br>\r\n\"Where am I?\" said Jake aloud, he then heard a ding and saw there was also an elevator that he didn't notice before and as it's doors opened he saw the man from before the large one who was suppose to be his instructor, he walked over to Jake and said \"You must be wondering whats going on, well allow me to explain, you Jake Long the American Dragon have been specially selected based on your skills and aptitude score\". \"What do you mean?\" said Jake, the man continued \"as I said you have been selected to undergo special training, you are our candidate for becoming the Sumo Dragon League Champion and the leader of the Sumo Dragons Organization\"<br>\r\n<br>\r\n\"Wait, wait, hold on you want me to become the head of what? And why me? And what makes you think I'm going to go along with this plan?\" asked Jake<br>\r\n<br>\r\n\"First you were chosen because of your aptitude and potential for it, and Second this is an honor, if you succeeded you would be one of the most respected Dragons in the world with lots of authority on the Dragon Council\" said the man. \"That does sound nice\" said Jake, \"Also you don't have a choice\" said the man, that elevator won't open for you until you put in the code only I know\"<br>\r\n<br>\r\n\"Fine\" said Jake, \"I'll go along with this, it sounds like a good deal\"<br>\r\n<br>\r\n\"Im glad you see that, now the Sumo Dragon Tournament is a year from now and in that time we need to get you ready because to win you need to be one of the Biggest and Strongest and Fattest Dragons there so you will get special training from me until your ready. You will do everything I say and refer to me as sensei, got that?\", \"Yeah I got it\" said Jake, then got a menacing glare from the man causing Jake to say \"I mean yes sensei\"<br>\r\n<br>\r\n\"Good said the man, now hold still\", he then stuck a needle in Jake injecting some liquid into him. Jake then felt the familiar sensation that came when he shifted into dragon form, \"For your training you will need to remain in dragon form and that solution you received will keep you in dragon form, now that you know whats going on its time to begin the first leg of your training which is...<br>\r\n<br>\r\n</span></div></div>",
            "created":1458978420,
            "id":2122920,
            "title":"check out our rooms"
        },
        "1412":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "Everyone in the room is called back to learn about their new career.",
                "Two fat dragons sit beside them.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Author's Note: There may or may not be sex scenes down the line from here. Just a heads-up.<br>\r\n<br>\r\n<div align=\"center\">~~~</div><br>\r\n<br>\r\n          As Jake was walking toward the building, he thought about being a sumo dragon and how he was going to keep that a secret from his dad. Lao Shi would be able to explain things to Jake's mom, but his dad couldn't know about the magical world. He had managed to keep the magical world a secret to him thus far, but he wasn't sure how he could keep something like this a secret.<br>\r\n          Jake's mother's side of the family (which he obviously took after, what with his dragon powers and all) was of Chinese descent, and he had something of an understanding of Chinese culture. However, sumo wrestling was a Japanese sport, and Jake knew next to nothing about Japanese culture. As such he didn't know anything about sumo wrestling. He had heard that there was more to it than just two fat people pushing each other around until one fell out of the ring, but he wasn't sure what that meant.<br>\r\n          For all he knew, being a sumo was a permanent career. He didn't think that was the case, but he didn't know for sure. If that was the case, however, he wasn't sure how he'd keep it a secret from his dad for very long. Maybe he'd have to send his dad an e-mail and say that he was accepted into a very prestigious college in England or something. Maybe he'd have to say that he got a job overseas, which, in a manner of speaking, would be pretty accurate.<br>\r\n          Before he could think about it any longer, he found himself walking face-first into a pair of pull-open double doors. He had been so wrapped up in his thoughts that he had forgotten to watch where he was going. He looked up to find that he was at Training Facility B. 'At least I made it here,' Jake thought, 'I just hope no one saw me blindly crash into the door; that would be pretty embarrassing.'<br>\r\n          Jake opened the door to find a waiting room full of dragons; some fat, some skinny. This was definitely where he needed to be. As he walked in, he was surprised to see that his own sister was there; and in her dragon form, no less.<br>\r\n          \"Haley? You got this, too?\" Jake asked in surprise.<br>\r\n          \"Sure did,\" Haley replied with a smile. \"I'm actually kind of glad that I did. I've never told anyone this before, but...\" She trailed off, rubbing her clawed hand behind her head. \"I actually have a bit of a fat fetish.\" She blushed bright red.<br>\r\n          \"That's ok, sis,\" Jake said smiling, \"I sorta had one myself.\"<br>\r\n          Jake and Haley sat down on some chairs side by side. Jake looked around to get a look at some of the dragons who were there. Some of the fatter ones gave him a bit of a stirring in his pants. Haley felt the same way. They both looked at each other awkwardly.</span></div></div>",
            "created":1461099480,
            "id":2135923,
            "title":"One Surprise After Another"
        },
        "14121":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "He was sharing a dorm with Haley (awkward)",
                "He was not sharing dorm with Haley (less awkward)"
            ],
            "content":"<div class=\"\"><div> <span>          The doors in the back of the room opened up to reveal a very fat (fatter than any dragon in the room) Western dragon.<br>\r\n<br>\r\n          \"Attention, everyone,\" he shouted, getting the attention every of every dragon in the room. \"If you would be so kind as follow me to the auditorium, we can begin the entrance ceremony.\"<br>\r\n<br>\r\n          Everyone got up from their seats and followed the large dragon to the auditorium. There they found that the seats were absolutely MASSIVE; even the fattest dragons in the room were dwarfed by them. Jake and Haley sat next to each other as they had done in the waiting room.<br>\r\n<br>\r\n          \"What do you think they're gonna tell us,\" Haley asked nervously?<br>\r\n<br>\r\n          \"I'm not sure,\" Jake replied.  \"Maybe they're gonna tell us about what this new job entails.\"<br>\r\n<br>\r\n          Before they could talk any further, an incredibly corpulent Eastern dragon walked onstage (surprisingly not hindered by his bulk). His belly sagged down in front of his knees and stuck out at least 3 feet in front of him (if he were sitting down, it would probably stick out a foot further), he had a pair of moobs that would snugly fit a Double D-Cup bra, his hips were 3 feet wide, and his ass cheeks were the size of pillows. He also had bright orange scales and a light yellow underbelly.<br>\r\n<br>\r\n          \"Good afternoon, dragons and dragonesses,\" he spoke. \"I am Ryoma Yasuhiro, the Yokozuna of this fine training facility, and I would like to congratulate you on your admittance into the Dragon Sumo League. I can assure you that being a part of the league is one of highest honors in the magical world, rivaled only by being a member of the Dragon Council. Additionally, those admitted are basically set for life, so all of you are incredibly lucky. Before we begin, are there any questions you'd like me to answer?\"<br>\r\n<br>\r\n          \"I have a question,\" one dragoness said. \"How exactly did we get placed here? Don't get me wrong, I'm honored to be part of this, but how?\"<br>\r\n<br>\r\n          \"That's a very good question,\" Ryoma said, smiling. \"Sometimes you can get placed here by the Dragon Council in recognition of past accomplishments, but most are admitted because their exam results determine that this is a fitting place for them.\"<br>\r\n<br>\r\n          <i>Maybe the Dragon Council placed me here as a reward for taking down the Huntsclan</i>, Jake thought.<br>\r\n<br>\r\n          \"Are there any other questions,\" Ryoma asked? No one spoke up. \"In that case, allow me to give you all a basic explanation of your new career. As the name implies, the Dragon Sumo League is primarily about sumo wrestling, which is a sport in which two people attempt to push each other outside of a ring drawn on the ground. The Dragon Sumo League in particular is one of the biggest sumo wrestling leagues in the world, magical or otherwise. Also, once you're admitted to the league, you're officially a member for life, even after retirement. Those are the basics. Any questions?\"<br>\r\n<br>\r\n          \"I have a question,\" Jake said. \"The first I heard about the league was when I got my exam results back... less than 30 minutes ago. I was told that the reason I hadn't heard about it before was because it's an 'adult sport', but what does 'adult sport' mean?\"<br>\r\n<br>\r\n          \"Ah yes, I was hoping someone would ask that,\" Ryoma said. \"To put it bluntly,\" a smirk crossed his face, \"there's sex involved. After a match, both wrestlers have sex to reward each other for their respective efforts.\" Everyone's eyes went wide and their cheeks turned bright red. Ryoma laughed at this, causing his belly to shake. \"You should see the looks on your faces; they're priceless.\" He laughed some more as everyone else awkwardly looked at each other. \"Come on, why's everyone so flustered,\" Ryoma asked? \"I know you're all at least 18 years old, because you have to be that old to even take those exams, and, by extension, get into this league in the first place. So what's the problem?\"<br>\r\n<br>\r\n          Everyone was too flustered to answer. \"Are you all virgins or something,\" Ryoma asked? \"Is that why you're all flustered?\" Once again, no one responded. \"Well, whatever the reason,\" Ryoma began, \"I can't say I blame you; I was this flustered when I first joined the league way back when. But enough about that for now. Let's get you guys sorted into groups.\" As if on cue, the doors to the auditorium opened revealing two dragons carrying lanyards with numbered keys on them. They each stood on opposite sides of the door.<br>\r\n<br>\r\n          \"Alright everyone,\" one of them said, \"you guys are gonna be sorted into groups of four, with two guys and two girls per group. All four members will share the same dorm room. So here's how this is gonna work; all the guys will form a single file line in front of me, and all the girls will form a single file line in front of my friend here.\" He gestured to the other dragon.<br>\r\n<br>\r\n          \"You'll each take a lanyard from us,\" the other dragon began, \"and whatever number is on the key will be your dorm number. There are four keys per dorm room and we have both two of those keys, so, when all is said and done, there will be two guys and two girls assigned to each dorm.\"<br>\r\n<br>\r\n          Everyone lined up in front of the two dragons and got their room keys. When Jake eventually got to his dorm room, he found that...</span></div></div>",
            "created":1561432620,
            "id":2678182,
            "title":"Learning about your new career."
        },
        "14122":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "\"Do you have any idea why Haley & I have been sent here?\"",
                "\"How long have you been at this place?\"",
                "Actually, his question was entirely different..."
            ],
            "content":"<div class=\"\"><div> <span>Jake and Haley sat down on some chairs side by side. Jake looked around to get a look at some of the dragons who were there. Some of the fatter ones gave him a bit of a stirring in his pants. Haley felt the same way. They both looked at each other awkwardly.<br>\r\n<br>\r\nHowever, before the two siblings could respond to one another, they felt this audible shaking of the ground under them, where they looked up and saw two obese Dragons. Standing before Jake, was a rather obese Eastern Dragon, who was in a similar height to Jake's own Dragon Form. <br>\r\n<br>\r\nIn appearance, Jake could easily tell that the Dragon that stood before him was female, due to the fact that she beared a generous pair of scaly Double E-Cup breasts, which laid leisurely upon a rather large apron of a belly covered in golden yellow underbelly scales. Like the Eastern Dragons, she sported a pair of deer-like antlers, which jutted out from underneath the Dragoness's thick locks of jet black hair with a few streaks of ruby red hair dangling in front of the Dragoness's head.<br>\r\n<br>\r\nMeanwhile, there was another Dragon that stood beside the rotund Dragoness, who was equally as obese. However, he was in similar in height as Haley when she is in her Dragon Form, complete with bronze yellow underbelly scales. Of course, the younger Dragon seemed to have similar features to the larger Dragoness, including shorter deer-like antlers.<br>\r\n<br>\r\nOverall, Jake and Haley had difficulties keeping their eyes off of the pair before them, where the rotund Dragoness soon gasped, pressing her plump draconic hands against her somewhat chubby Dragon snout and exclaimed, \"I know you! You're that American Dragon, Jake Long!\"<br>\r\n<br>\r\n\"Yeah, um... I-I get that a lot. So, um...Who are you?\" Jake hesitantly retorted, being a little confused due to the fact that he was not familiar with who he was speaking to. Of course, the rotund Dragoness soon noticed his demeanor and quickly answered, \"Oh, I'm sorry! My sincerest apologies.\" From there, she then formally bowed before Jake, then stood back up and explained, \"...My name is Kurako Shizume, the Tokyo Dragon, and the daughter of the previous Tokyo Dragon, Kurako Okuma. This is my brother, Kurako Koichi.\"<br>\r\n<br>\r\nIn response, the younger Dragon beside Shizume formally bowed before Jake and Haley. And from there, Shizume then continued speaking and said, \"Let's just say that I, um... am a big fan of yours.\" \"Wow. Really? I, uh... didn't know I had a fan or two.\" Jake retorted, obviously taken aback a little by what he just heard, as well as feeling internally boastful about having a fan outside of New York City. <br>\r\n<br>\r\n\"So...What brings the mighty American Dragon and his younger sister to our humble abode?\" Shizume asked, as she sat down beside Jake, obviously trying to contain her excitement at being next to the famed American Dragon, whilst her younger brother did the same alongside Haley Long.<br>\r\n<br>\r\nScratching the back of his mane with his claws, Jake hesitantly answered, \"Um...H-Haley and I were sent here due to our Exam scores.\" \"Oooh! Is that all? I honestly thought they would have sent you here out of the Dragon Council's gratitude for ending the Huntsclan threat once and for all.\" Shizume replied, chuckling a bit that the Dragon Council didn't send him here as a reward for his services.<br>\r\n<br>\r\nHowever, something stirred in the back of Jake's mind that seemed to be bothering him at the moment, as he looked back at the corpulent Shizume and asked, \"Say, um...Shizume, was it?\" \"Yes, Jake?\" Shizume gleefully quipped, her jade colored eyes fluttering in an adorable manner, as Jake then took a deep breath, exhaled, then asked...</span></div></div>",
            "created":1550762160,
            "id":2620850,
            "title":"The Kurako Siblings"
        },
        "141222":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "A massively obese Eastern Dragon sat before them.",
                "A massively obese Eastern Dragoness sat before them.",
                "Actually, something else happened instead..."
            ],
            "content":"<div class=\"\"><div> <span>However, something stirred in the back of Jake's mind that seemed to be bothering him at the moment, as he looked back at the corpulent Shizume and asked, \"Say, um...Shizume, was it?\" \"Yes, Jake?\" Shizume gleefully quipped, her jade colored eyes fluttering in an adorable manner, as Jake then took a deep breath, exhaled, then asked, \"So, um...How long have you been at this place now?\"<br>\r\n<br>\r\nIn response to such a question, Shizume giddily retorted, \"Oh, that's quite easy! I have been a member of the Dragon Sumo League for a good 3 and a half years now. After all, it is an important tradition in the Kurako Clan for the eldest to be an active member of the Dragon Sumo League. Why?\" From there, Shizume, started to become a bit more physically intimate with the American Dragon, as she (despite her rotundity and girth) was able to lift Jake up out of his seat with little difficulty, where she then flirted, \"Thinking about being my sparring partner, American Dragon?\"<br>\r\n<br>\r\n\"I-I, uh...\" Was all that Jake could stammer, as he felt rather flustered towards the rotund Japanese Dragoness. But in a good way, of course. But as Shizume casually put him back down onto the chair he sat in, Jake could feel his lithe tail being coiled around by Shizume's substantially thicker Dragon tail, almost as if it was Mating Season for Dragons. Yet, Mating Season was a good ways off from now.<br>\r\n<br>\r\n\"...Fret not, American Dragon. I'm sure you and your sister will fit just fine. *giggle*\" She quipped, as she and her younger brother went on their way, blowing a kiss at the American Dragon before waddling on her merry way. Of course, Haley could easily see a deep blush upon his draconic snout, where she crossed her arms in an almost smug fashion and chirped, \"...Don't tell me: You like her, don't you?\"<br>\r\n<br>\r\n\"Well, um...She can certainly hit me in all the right places, that's for sure.\" Jake answered, rubbing the back of his head in embarrassment and bashfulness. \"Don't worry. I'm sure you'll get to see her again soon enough.\" Haley remarked, reassuring Jake that he'll run into Shizume sooner or later.<br>\r\n<br>\r\nBut then, one of the staff at the Dragon Sumo League came out into the lobby and proclaimed, \"Jake Long and Haley Long, you have been summoned by the Dragon Yokozuna. Jake Long and Haley Long, you have been summoned by the Dragon Yokozuna.\"<br>\r\n<br>\r\n\"Well, that's us, sis. Come on.\" Jake remarked, as he and Haley dismounted from their seats and approach the staff member, as she said, \"The Dragon Yokozuna would like to see you two now. Please proceed into the dojo behind me.\" Eventually, the two draconic siblings arrived at an expansive dojo, where...</span></div></div>",
            "created":1550769180,
            "id":2620892,
            "title":"The Princess of Dragon Sumo"
        },
        "1412222":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "He was sent here as a reward for his efforts as the American Dragon.",
                "He was sent here as part of a secret arranged marriage between him & Shizume.",
                "Actually, her response was entirely different..."
            ],
            "content":"<div class=\"\"><div> <span>But then, one of the staff at the Sumo Dragon League came out into the lobby and proclaimed, Jake Long and Haley Long, you have been summoned by the Dragon Yokozuna. Jake Long and Haley Long, you have been summoned by the Dragon Yokozuna.\"<br>\r\n<br>\r\n\"Well, that's us, sis. Come on.\" Jake remarked, as he and Haley dismounted from their seats and approach the staff member as she said, \"The Dragon Yokozuna would like to see you now. Please proceed into the dojo behind me.\" Eventually, the two draconic siblings arrived at an expansive dojo, where, shockingly to the two siblings, a massively obese Eastern Dragoness sat before them.<br>\r\n<br>\r\nIn appearance, she shared similar physical traits of both Shizume and her younger brother, deer-like antlers, shimmering dragon scales, etc. However, the dragoness that stood before them was undoubtedly MUCH larger than Shizume, bearing a massive apron of a belly big enough to fit a small smart car inside it. But it wasn't just her weight that made her large, but also her height, as she appeared to tower over Jake by a few feet. <br>\r\n<br>\r\nAt the very least, she seemed to have the decency to wear substantially large clothing to cover her immense form, as she seemed to be wearing an open flower-patterned Kimono.<br>\r\n<br>\r\nUpon entering the massive dojo area, it was as if the rotund Eastern Dragoness was already aware of their presence, as the large Dragoness then calmly stated, \"...Welcome to our beloved Sumo Dragon League, American Dragon.\" From there, she casually turned around to face Jake and Haley, which revealed that she was wearing a purple Mawashi, a traditional undergarment Sumo Wrestlers wore, which seemed to cling snugly to her abundantly large physique, as the Eastern Dragoness, where she then formally bowed before the two siblings in respect then said,\"...My name is Okuma Kurako, and I am the Headmistress of the Sumo Dragon League.\"<br>\r\n<br>\r\nOf course, the name certainly struck out in Jake's mind, remembering what Shizume had mentioned earlier, as he stated, \"Wait a minute! You were the Tokyo Dragon that Shizume was talking about?\"<br>\r\n<br>\r\nIn response, Okuma couldn't help but let out a light chuckle upon Jake realizing who she was, as she then retorted, \"*Giggle* So...I see that my little Shizume has been conversing with you then, hmm? That is surprisingly good to hear, I suppose.\"<br>\r\n<br>\r\n\"You know her?\" Jake asked, raising an eyebrow in response, as Okuma poured out some tea for both her and Jake and Haley whilst she answered, \"Of course. After all, Shizume is my eldest child and the heir to our family's lineage as the Tokyo Dragon.\"<br>\r\n<br>\r\nFrom there, she politely gestured the two draconic siblings to sit down and accompany her over some tea, which they did so out of respect. Suffice to say, Jake somehow had this aching feeling in the back of his brain that somehow he might have been deceived into coming here. But as the obese Eastern Dragoness began to sip some tea, Okuma then began to explain to Jake that...</span></div></div>",
            "created":1551018360,
            "id":2622359,
            "title":"The Dragoness Yokozuna"
        },
        "15":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Lao Shi and Fu Dog teaches Jake magic",
                "Jake get cursed by one of his enemies ",
                "Rose likes large men so Jake tries to gain weight",
                "Jake goes through dragon puberty ",
                "Free choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these story lines ?</span></div></span></div>",
            "created":1511332620,
            "id":2418544,
            "title":"Free Choice."
        }
    },
    "info":{
        "author_id":"noxvzhuusox",
        "author_name":"Zhuusox",
        "brief_description":"Here is an adventure of dragons, fat, and gluttony in the American Dragon Jake Long world.",
        "created":1350400260,
        "description":"<td align=\"left\" class=\"norm\">Alright everyone! This here is ADJL WG story. <br>\r\n<br>\r\nHere are the guidelines, the rules, and restrictions of this story:<br>\r\n<br>\r\n1. The main character that will face being fatten in this story is well obviously Jake Long.<br>\r\n<br>\r\n2. Other characters of the series or your own creation can be fatten as well as long as Jake is.<br>\r\n<br>\r\n3. When writing a chapter, please make Jake fatten up in his dragon form as much as you could. <br>\r\n<br>\r\n4. Please no one sentences chapters. Put at least a paragraph or two.<br>\r\n<br>\r\n5. Please be as detailed as you could when writing how fat the character(s) are becoming or already are.<br>\r\n<br>\r\n6. No deaths, vore(of any kind), bad spelling grammars, gore, horrific violence, and NO endings please.<br>\r\n<br>\r\n7. Sexualities of any kind are allowed.<br>\r\n<br>\r\n8. Sex scenes are okay.  Update-4/2/18:  As long as all characters in question are of age of consent. Like age 16 and over.<br>\r\n<br>\r\n<br>\r\n<br>\r\n...and that pretty much it. I add any more rules I can think of.<br>\r\n</td>",
        "id":1898205,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584677100,
        "modified":1584677100,
        "pretty_title":"ADJL: Rise of the Fat Dragons"
    }
}