{
    "chapters":{
        "1":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Foreign ENM",
                "Practical ENM",
                "Transforming ENM",
                "Non ENM",
                "Other ENM"
            ],
            "content":"<div class=\"\"><div> <span>There are several stories to choose from:<br>\r\n<br>\r\n1. The boys travel to a foreign land with strange laws or have other encounters with differing cultural standards that leads to ENM<br>\r\n2. The boys experience ENM because of work or accident<br>\r\n3. The boys experience a transformation caused ENM<br>\r\n4. The boys experience ENM that isn't supposed to be ENM<br>\r\n5. The boys experience ENM that doesn't fit any of the other categories</span></div></div>",
            "created":1455685200,
            "id":2105492,
            "title":"Choices"
        },
        "11":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "All Male ENM",
                "Space ENM",
                "ENM moments",
                "Competition ENM",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>There are still choices to make<br>\r\n<br>\r\n1. The boys travel to a land that rquires all males be ENM<br>\r\n2. The boys experience ENM on an alien planet<br>\r\n3. The boys experience ENM moments due to foreign practices (e.g. strip searches, foreign rituals, staying at a hostel, lack of facilities)<br>\r\n4. ENM during international athletic competition<br>\r\n5. Something else</span></div></div>",
            "created":1455685200,
            "id":2105494,
            "title":"Foreign ENM"
        },
        "111":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Among Primitives",
                "Option one",
                "Option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106933,
            "title":"All Male ENM"
        },
        "1111":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "They refuse to submit to local culture",
                "When in Rome",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Vanunome is a primitive island southwest of Papua. Although technically under the government of Papua New Guinea, the island remains too primitive for the Papua government to do anything beyond patrolling the surrounding ocean. Like many of the primitive populations around the world, they live without census, medical care, education, or roads.<br>\r\n<br>\r\nVanunome does have a primitive port through which they trade for goods from the outside world. They even have three television sets shared by the hundreds of islanders. They are not starving. They do practice primitive agriculture which provides them with beans, fruits, tubers and rice, all of which are native variants only found on Vanunome. It is their agriculture that they use to trade for modern conveniences.<br>\r\n<br>\r\nBen and Jason go to Vanunome for three lucrative reasons. One is to see if the market for the rice or fruit can be improved to increase the wealth of the islanders. Two is to make a documentary about the culture. Three is that they've been promised land of their own on the island and jobs as government representatives if they are successful at setting up the fruit or rice markets.<br>\r\n<br>\r\nAt the port, everything is friendly. They meet a Vanunome native named Ralu who speaks English and agrees to be their guide. However, before they can venture into the island past the port, they must submit to Vanunome customs.<br>\r\n<br>\r\nRalu explains, \"We are a male dominated culture. Status and rank are determined by the size of our genitals. We have ways of increasing the size of those who are small. In our culture, covering the genitals is shameful, only done by women and those with child-sized genitals. If you want to be respected in our culture, you must allow us to measure your genitals and paint them according to size: blue for the largest followed by green, white, red, and yellow for the smallest unless they are too small to paint.\"</span></div></div>",
            "created":1455944400,
            "id":2106980,
            "title":"Among Primitives"
        },
        "11112":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "A new meaning to blue balls",
                "Option one",
                "Option A"
            ],
            "content":"<div class=\"\"><div> <span>Ben doesn't like it. He was raised to think it shameful to expose his genitals but here it's shameful to cover one's genitals. He swallows his shame and lets them measure his genitals even though he keeps habitually trying to cover them. </span></div></div>",
            "created":1458882000,
            "id":2122444,
            "title":"When in Rome"
        },
        "111121":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Meeting the chief",
                "Going to the fields",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>They paint Ben's balls blue but his penis white. \"What does the different colors mean?\"<br>\r\n<br>\r\nRalu explains, \"Your penis size is your rank in government. Your balls are your rank in domestic matters.\"<br>\r\n<br>\r\nRalu has a green dick and blue balls. Jason winds up with a blue dick and white balls.<br>\r\n<br>\r\nRalu says, \"When we greet one another, we hold the lower ranking member. So when you two greet each other, Ben would hold Jason's balls and Jason would hold Ben's dick. I would hold Jason's balls and he would hold my dick. I would hold Ben's dick but Ben would not hold me since we are the same rank domestically.\"<br>\r\n<br>\r\nJason laughs.<br>\r\n<br>\r\nRalu continues seriously, \"There is only one man that outranks blue. He would hold both your dick and balls at the same time.\"</span></div></div>",
            "created":1458884580,
            "id":2122456,
            "title":"A new meaning to blue balls"
        },
        "112":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "What's the need?",
                "Option one",
                "Option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106935,
            "title":"Space ENM"
        },
        "1121":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jason of Aquadelph",
                "Option one",
                "Option A"
            ],
            "content":"<div class=\"\"><div> <span>A little history: Humans have been travelling to other stars for centuries. They have not found any sentient natives yet but they have found suitable planets for colonization. Some do have indigenous life forms but the alien life is small like plants and insects. No alien vertebrates have been discovered yet.<br>\r\n<br>\r\nHumans have colonized these planets and the colonists adapted to the planets they colonized. That is, if the planet had low gravity, the colonists became taller and lankier. They developed their own cultures and became like natives. Then came the revolts as each colony declared its independence from whatever Earth government had planted it. It became expected that all new colonies would declare independence but different governments had different strategies for handling that. Some cracked down harder refusing to let go of their colonies while others made arrangements from the get go to allow the colonies independence.<br>\r\n<br>\r\nEarth never did develop a single world government although they did manage to unite into twelve governments as opposed to nearly two hundred. But factions didn't want to give up power. Instead, they each wanted their own one world government until their were twelve competing \"United Nations\" like governments. There was the European Union, the North American Hegemony (Canada won the war and then went power crazy), the Latin American Union, the North African Union, the South African Union, the Muslim Brotherhood, the Pacific Union (with a capital in New Zealand which had become a world power), the Oriental Union, the Indostanic Union, the Russian Hegemony, the Anti-union rebellion, and Australia.<br>\r\n<br>\r\nWith each colony on a planet other than Earth declaring indepence, the number of governments rose back to nearly two hundred again but space prevented interstellar war. The people of each new planet claimed their planet as their national identity regardless of their DNA. That is, if a group of Caucasians, Africans and Asians settled on the planet Eridani, they abandoned the words Caucasian,  African and Asian.  Instead, they identified themselves as Eridanians.<br>\r\n<br>\r\nWhat culture developed on each planet depended primarily on two main factors: the parental government from which the colony broke free from and the conditions of the planet itself. For example: A colony set out from the North American Hegemony to colonise the planet Scauda which is a cold planet. Both the North American, Mormon/Victorian hypermorality and the freezing cold temperatures of Scauda cause the culture to never expose the slightest bit of skin.<br>\r\n<br>\r\n</span></div></div>",
            "created":1455944400,
            "id":2106979,
            "title":"What'the need?"
        },
        "113":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Arrival at the Facility",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106936,
            "title":"ENM moments"
        },
        "1131":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Ben resists",
                "Ben submits",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ben Stone is a brilliant, young computer programmer. He spends his days with his computers. One day, the United States military contacts him. They wish to hire him as a civilian consultant in a top secret facility.<br>\r\n<br>\r\nBen flies out to Palatonga, an island in the Pacific Ocean. Palatonga is surrounded by several smaller islands, most of which are uninhabited. Palatonga itself is populated by a mixture of natives, Japanese, Australian, Peruvian, Chilean, and other nationalities but the few other inhabited islands are pure Palatongan, some of whom preserve their ancient culture and superstitions.<br>\r\n<br>\r\nPalatonga is technically an independent country but only because it's too far from any other land for any country to claim. The Palatonga government doesn't have a miltary and their police force is too small to patrol more than a few strategically chosen checkpoints. Corruption is well known in the Palatonga government. It doesn't make any sense that the U.S. government put a top secret facility here but here it is.<br>\r\n<br>\r\nBen goes through customs. He hears all kinds of languages around him. Then a Palatonga official comes up to him and says, \"I know this is racial profiling but our policy requires that all American civilians be strip searched to ensure your not smuggling drugs.\"</span></div></div>",
            "created":1455944400,
            "id":2106978,
            "title":"Arrival at the Facility"
        },
        "114":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Bad News Bares",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106939,
            "title":"Competition ENM"
        },
        "1141":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Make up a sport",
                "Wrestlers",
                "More sports"
            ],
            "content":"<div class=\"\"><div> <span>Paul Ralston, the assistant coach walks in. \"I've got bad news boys. The International Olympic Committee has made a decision regarding the uniform controversy. You know how some countries have the technology to create competition uniforms that give their athletes an unfair advantage over poorer countries. Then there are those countries that insist on wearing uniforms that are offensive to other countries. Well the IOC has finally gotten fed up with the controversy and, harkening back to the way the ancient olympics were held, they have decided to ban all uniforms and clothing that is not absolutely necessary for safety reasons. Even protective gear will be kept minimal and standardized globally. As an example, I have here the jockstrap that very few athletes will be allowed to wear. Most athletes won't even be allowed to wear this.\"<br>\r\n<br>\r\nPaul holds up a hard shell that would barely fit around a man's balls but would let the cock hang free. There are no straps or anything for the back as the shell would be held in place by a cock ring. The boys gasp.<br>\r\n<br>\r\nPaul is the assistant coach but he is also the doctor for these boys. These boys are not a single team but a collection of athletes headed for the olympics. This collection includes some teams but mostly individual competitors. There are even a few women in this collection.<br>\r\n<br>\r\nWhich athletes shall we follow?</span></div></div>",
            "created":1455944400,
            "id":2106977,
            "title":"Bad News Bares"
        },
        "11411":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Chikun Pentathlon",
                "Option one",
                "Option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Make up a sport</span></div></span></div>",
            "created":1456894800,
            "id":2112120,
            "title":"Make up a sport"
        },
        "114111":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jockey Jason tries to figure out where to put his junk",
                "Pony Ben wants a uniforrm",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Chikun Pentathlon is a sport in which teams of two compete in five different events. In all five events, one member of the team has to ride on the shoulders of the other team member.<br>\r\n<br>\r\nThe first of the five events is a race. The rider is referred to as a jockey and the carrier is referred to as a pony. The second event is similar to a ball game like basketball or rugby however the points are not earned by defeating an opponent but by which baskets the jockey succeeds in getting the ball into. The pony has to run through a field of obstacles to get to the different baskets and there is a time limit. Several teams are on the field at the same time but no team is rewarded for blocking another team. The third event is archery where both the jockey and pony aim for bullseyes. The fourth event is a tug of war and is the first event where points are awarded for defeating an opponent. The fifth event is called jousting but wrestling like moves are allowed. The jousting field is a padded platform surrounded by padded balance beams. Each team starts on the end of a balance beam and runs to the central platform. As many as four teams are allowed to joust on the same platform in rotation and points are awarded for each jockey dismounted. That is if a jockey stays on the platform dismounting twenty other jockeys, he gets twenty points. However, if a jockey is dismounted, he has to wait until other teams have had a fair chance on the field before he can mount his pony and get back on the field. The first teams on the field are given fewer opportunities to re-enter the field to make it fair to the last teams on the field but each team has a minimum of five opportunities to get joust.<br>\r\n<br>\r\nTeams are supposed to begin each event riding on shoulders but they are allowed to change riding methods as soon as the event begins as long as no part of the jockey touches the ground and as long as the jockey rides his own pony (doesn't climb onto someone elses pony).</span></div></div>",
            "created":1456894800,
            "id":2112133,
            "title":"Chikun Pentathlon"
        },
        "11413":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Rugby",
                "Figure skating",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More sport options</span></div></span></div>",
            "created":1456894800,
            "id":2112136,
            "title":"More sports"
        },
        "115":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "More branches by bejjinks",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106940,
            "title":"Something else"
        },
        "1151":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "POW ENM"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Reserved for bejjinks. Don't write here or it will be deleted</span></div></span></div>",
            "created":1455944400,
            "id":2106976,
            "title":"More branches by bejjinks"
        },
        "11511":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jason gets drafted",
                "Jason on patrol",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>World War III happened. Humanity survived but technology had a set back.<br>\r\n<br>\r\nThe main weapon used was biological warfare but both sides used it so both sides suffered. Other weapons were also used so that all major cities were in ruins but less significant cities such as Topeka, Kansas; Boise, Idaho and Fargo, North Dakota still stood. However, still standing did not mean undamaged. The decrease in population was worldwide and many of the still standing buildings were abandoned. It became common for everyone to move to the suburbs and rural areas. There was no inner city anymore because there were so many nice houses available in the suburbs for free.<br>\r\n<br>\r\nElectricity and running water was still available. Even the internet still worked although there was less entertainment because there were fewer people who could create entertainment. The world population only dropped to about 1.5 billion so plenty of people survived but globalization ended. Everyone retreated to their own region. Large nations broke up into smaller nations no bigger than Great Britain.<br>\r\n<br>\r\nBut the war continued. Even after the great super powers of the world broke apart, civil wars replaced the big war as regions fought to establish new borders. Even after the weapons of mass destruction were forgotten, people resorted to old fashioned rifles and helicopters. Even after the last people exposed to biological warfare had been cured, people resorted to old fashioned tortures such as the rack, stockade and cage.</span></div></div>",
            "created":1459952760,
            "id":2128535,
            "title":"POW ENM"
        },
        "12":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "The show must go on",
                "The Spirit of Houdini",
                "Blinded me with science",
                "Losing my civies",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are still choices to make:<br>\r\n<br>\r\n1. The boys work in the theatre<br>\r\n2. The boys work as escape artists<br>\r\n3. The boys are in college<br>\r\n4. The boys join the military<br>\r\n5. Something else</span></div></span></div>",
            "created":1455858000,
            "id":2106674,
            "title":"Practical ENM"
        },
        "121":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Adventures in Ad Lib",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106941,
            "title":"The show must go on"
        },
        "1211":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "He says, \"Oh dear, my clothes are at home, three days journey from here.\"",
                "He says, \"Men shouldn't have to wear clothes. That will improve the economy.\"",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The play is set in Victorian England. It is a drama similar to Howard's End and Jason's character is supposed to be the wealthy heir, George. Therefore, everyone is in business suits or fancy dresses.<br>\r\n<br>\r\nBut within the very first minutes of the performance, Jason's costume rips just as he steps into center stage. He is supposed to say the line, \"The price of tea should be raised. That will improve the economy.\" This is supposed to be followed by Helen, played by Rachel, saying, \"For whom. Will all of England benefit from a raise in the price of tea.\"<br>\r\n<br>\r\nHowever, being a live performance, Jason cannot ignore the wardrobe malfunction. His genitals are exposed through the hole in his costume. He's supposed to ad lib if anything goes wrong to try to work the problem into the play. There is no other costume for him to change into so how is he supposed to work this out?</span></div></div>",
            "created":1455944400,
            "id":2106975,
            "title":"Adventures in Ad Lib"
        },
        "122":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Maximum Security",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106942,
            "title":"The Spirit of Houdini"
        },
        "1221":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "He smuggles something in",
                "He knows the blueprints of the prison",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"You're serious.\" Rachel says, \"You've challenged the highest security prison in the world to lock you up and you would escape.\"<br>\r\n<br>\r\n\"I have to make a name for myself. No one wants to see the great Jason repeat tricks that are as old as Houdini. I need bigger challenges.\"<br>\r\n<br>\r\n\"But maximum security might be too big of a challenge. Their reputation is on the line. They can't let you escape.\"<br>\r\n<br>\r\n\"Maybe not but a failure at that level will be easily forgotten while a success will be remembered since no one has done it before.\"<br>\r\n<br>\r\nThe day comes and the guard says, \"I must conduct a thorough strip search like I do with all inmates. It's part of what makes this place such high security. Absolutely nothing get's in without approval.\"<br>\r\n<br>\r\nThe strip search is extremely thorough. The guard even sticks a probe up Jason's urethra to make sure nothing is hidden there. Then Jason is issued a uniform. He brings nothing of his own with him.<br>\r\n<br>\r\nBut he's still confident of escape. Why?</span></div></div>",
            "created":1455944400,
            "id":2106974,
            "title":"Maximum Security"
        },
        "123":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Class Action",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106943,
            "title":"Blinded me with science"
        },
        "1231":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Medical Anatomy",
                "Artistic Anatomy",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"My name is Professor Ralston. Welcome to _______.\"</span></div></span></div>",
            "created":1455944400,
            "id":2106973,
            "title":"Class Action"
        },
        "12311":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Paul convinces Jason to comply",
                "Jason negotiates a different deal",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jason wonders why he has to take this course since he's not majoring in any medical field. He's just here to play football and hasn't even decided on his major but his academic advisor had strongly encouraged him to at least take this introductory course.<br>\r\n<br>\r\nThe teacher had announced that he still had an opening for a teacher's assistant. This might help Jason get a better grade and stay eligible for college football and Jason needs all the help he can get.<br>\r\n<br>\r\n\"Professor Ralston, I'm here about the T.A. opening.\"<br>\r\n<br>\r\n\"Come in and shut the door. Have a seat. I have to give you fair warning that the school has authorized me to have a patient model for the class and whoever takes this opening will be that patient model. You'll have to strip for class and let the students practice various things on your body.\"<br>\r\n<br>\r\n\"But Professor, it's just an introductory class. Patients don't become involved until advanced courses.\"<br>\r\n<br>\r\n\"I know. It was a surprise to me too. But I think it will be good. You all are adults now. You should leave your juvenile attitudes about the body in the past and what better way to do that then to put your hands on an actual body.\"<br>\r\n<br>\r\nThoughts swirled through Jason's head: thoughts of putting his hands on a female body. \"But Professor, you're suggesting I let my body be the one others put their hands on.\"<br>\r\n<br>\r\n\"You won't be the only one. When we cover female anatomy, you'll get a day as just another student but most of the time, it wil be you and I'm glad you're male. Males don't have as much to cover up, not as much in the way for studies of the heart and lungs. The majority of the course will focus on your upper body. You'll be paid more than a typical teacher's assistant too. Plus, you'll be given access to teacher's priviledges not available to typical teacher's assistants. For example, we have a fully decked out teacher's lounge.\"<br>\r\n<br>\r\nJason had heard of this infamous techer's lounge. All the coaches visited it regularly but no athletes were allowed. Jason figures that most of the time, he'd only be shirtless. He could endure that to get into the teacher's lounge and then quit before the day of being pantsless. \"Alright, I'll be your patient model.\"<br>\r\n<br>\r\n\"Okay, strip and fill out this medical questionaire.\"<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"I need to know your medical condition so there are no surprises. For example, I need to know if you have any surgical scars that I would need to explain.\"<br>\r\n<br>\r\nJason pulls his shirt off and is handed a questionaire on a clip board. He is told to stand up. Then the professor yanks his pants and underwear down. He yells, \"Hey!\" but the professor isn't deterred. Paul grabs Jason turning him this way and that.<br>\r\n<br>\r\nPaul spends most of his time looking at Jason's upper body including using a blood pressure cuff, stethoscope and tongue depressor. It's hard for Jason to fill out the questionaire with all this probing but Jason rationalizes it as just a medical examination from a doctor with no bedside manner.<br>\r\n<br>\r\nPaul though makes no distinction about private parts. He grabs Jason's cock. \"You have a foreskin. That will be nice to show the class.\"<br>\r\n<br>\r\nJason finishes the questionaire and exam as quickly as possible and leaves. Later he gets a chance to talk with the Professor.<br>\r\n<br>\r\n\"Was that really necessary?\"<br>\r\n<br>\r\n\"Yes, I needed to know your medical condition.\"<br>\r\n<br>\r\n\"You could have been gentler.\"<br>\r\n<br>\r\n\"You're right and I'm sorry. I'll be gentler in the future.\"<br>\r\n<br>\r\nThen it was class time. \"Class, this is Jason. He will be our patient model. You may disrobe now.\"<br>\r\n<br>\r\n\"Why should I disrobe? All you have scheduled for today is lecture.\"<br>\r\n<br>\r\n\"But I want to deal with any bad attitudes now before we have to interupt any lab time to deal with it. Now go around the room and let everyone get a feel.\"</span></div></div>",
            "created":1456894800,
            "id":2112169,
            "title":"Medical Anatomy"
        },
        "124":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "World War II",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106944,
            "title":"Losing my civies"
        },
        "1241":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Follow Ben",
                "Follow Jason",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>(Unlike the time travel branches, all characters are from the World War II time and therefore have the same culture and thought patterns that were typical of that time.)<br>\r\n<br>\r\nBen is an upper class young man. He doesn't like what's happening in Europe but he doesn't see any reason to get involved. He's comfortable with his life as is.<br>\r\n<br>\r\nJason is a farm boy in the Dust Bowl. His father keeps stubbornly holding onto the farm but Jason wants to escape and see the world.<br>\r\n<br>\r\nPearl Harbor has just happened and the U.S. has just declared war.<br>\r\n<br>\r\n<span class=\"clred\">Additional rule for the chapters following this branch</span><br>\r\n<br>\r\n1. <span class=\"clred\">Don't rush the characters through basic training.</span> The focus of the story should be the slow changes the boys go through on the way to becoming soldiers, NOT on their heroics.</span></div></div>",
            "created":1455944400,
            "id":2106972,
            "title":"World War II"
        },
        "125":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "More branches by bejjinks",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter. </span></div></span></div>",
            "created":1455944400,
            "id":2106945,
            "title":"Something else"
        },
        "1251":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Hazmat Trainer"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Reserved for bejjinks</span></div></span></div>",
            "created":1459025220,
            "id":2123215,
            "title":"More branches by bejjinks"
        },
        "12511":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Reserved for bejjinks</span></div></span></div>",
            "created":1459953480,
            "id":2128539,
            "title":"Hazmat Trainer"
        },
        "13":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Shrink",
                "Flat and stretchy",
                "Detachables",
                "Inanimate",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are still choices to make:<br>\r\n<br>\r\n1. ENM adventures in shrinking<br>\r\n2. ENM adventures in elasticity<br>\r\n3. ENM adventures in falling to pieces<br>\r\n4. ENM adventures in the inanimate<br>\r\n5. Something else</span></div></span></div>",
            "created":1455858000,
            "id":2106664,
            "title":"Transforming ENM"
        },
        "131":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Lab Assistant",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106946,
            "title":"Shrink"
        },
        "1311":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jason resists",
                "Someone else arrives",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The Inventor, Paul Ralston, is eccentric. He insists that people call him \"The Inventor\" or \"Mister Inventor\". If he wasn't such a genius, he would have been put in a mental hospital. Instead, he is a professor of physics but the university hires several T.A.s to look after him.<br>\r\n<br>\r\nThe Inventor lives in an old, Mock Tudor style home by himself. It is a large house with many rooms including a basement, second floor and attic but most of the rooms are filled with The Inventors various collections. These collections are strange but useful. He has collected several microscopes, bunsen burners, molecular model sets and other pieces of scientific equipment.<br>\r\n<br>\r\nThe Inventor himself has thin but blindingly white hair. He either wears a tweed jacket with patches on his elbows or a blue sweater with patches on his elbows. He often has a pipe in his mouth but no one has ever seen him smoke with it.<br>\r\n<br>\r\nJason knocks on the door. He has been hired by the university but this is his first time meeting the strange professor. Jason has heard rumors and seeing the messy condition of the home only confirms that those rumors might be true.<br>\r\n<br>\r\nThe Inventor hollers, \"Come in.\" Jason opens the front door, walks through the vestibule and foyer before finding the professor sitting at a large desk covered in papers on one end of a library. Piles of books are everywhere: too many to fit on the shelves.<br>\r\n<br>\r\n\"Hello, I'm Jason Fletcher. The university sent me to be your new assistant.\"<br>\r\n<br>\r\n\"I don't care if the university sent you. I decide if you stay or not. Now take that pile of books there and box them up. I'm done with them.\"<br>\r\n<br>\r\nJason begins packing up the books. He's recieved some instruction on how best to care for The Inventor. \"As much as possible, let him think he's in control. As long as he thinks he's making the decisions, he will be open to your suggestions. He is far too focused on his own inventions to resist you.\" So even though packing boxes is not part of Jason's job description, Jason packs the boxes thinking this is a good way to keep the professor agreeable.<br>\r\n<br>\r\nAfter the books are boxed, Jason stands up, \"Okay, that's done. Professor Ralston, have you taken your meds today?\"<br>\r\n<br>\r\nThe Inventor pulls out a ray gun and shoots Jason. \"You're hired.\" Before Jason can react, he shrinks out of his clothes, The Inventor fishes him out and lifts his naked body up to the professor's face. Jason screams but The Inventor patiently waits for Jason to calm down.<br>\r\n<br>\r\n\"What did you do to me?\"<br>\r\n<br>\r\n\"Isn't it obvious? I shrank you.\"<br>\r\n<br>\r\n\"Why?\"<br>\r\n<br>\r\n\"Because you packed up those books like I asked you to. All the others the university sent over refused saying it wasn't part of their job description. I've had to tolerate those selfish assistants cause I needed them but I think I'm going to enjoy having you for an assistant.\"<br>\r\n<br>\r\n\"You shrank me because I packed books? Am I the only person you shrank?\"<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\n\"Because I packed books?\"<br>\r\n<br>\r\n\"You act like its the end of the world. Did you really think I would shrink you without returning you to normal?\"<br>\r\n<br>\r\n\"I didn't think you would shrink me, period.\"<br>\r\n<br>\r\n\"Yes, well I can see how you might have been surprised by that. Now let me tell you how I expect you to do your job. I will remind you as often as needed until you get it right. You will call me Mister Inventor. You will not call me professor. I may let you call me Paul or Mister Ralston on occasion but most of the time, you will call me Mister Inventor, is that clear?\"<br>\r\n<br>\r\n\"Yes, Mister Inventor.\"<br>\r\n<br>\r\n\"Good, I'm about to return you to normal height but before I do that, you need to know that I can control your size at any time. What I shot you with embedded a tag in you so that anytime I send a super low frequency radio signal out, that tag will respond by changing your size. So don't even think about running away or telling anyone. You wouldn't want to find yourself shrunk somewhere out there in this great big world. Super low frequency radio signals can travel much further than normal radio signals. And don't think about attacking me either. I have programmed for you to shrink at the same time each day so you want me around to return you to normal. Do you understand?\"<br>\r\n<br>\r\nJason nods. The Inventor sets him on the floor and flips a switch. Jason grows back to normal size but sits there quietly putting his clothes on.<br>\r\n<br>\r\n\"I wouldn't be so quick to get dressed if I were you. I want to shrink you again.\"<br>\r\n<br>\r\nJason stops, \"You're asking me to volunteer to be shrunk?\"<br>\r\n<br>\r\n\"No, I'm going to shrink you and use you as a guinea pig whenever I want. I just want you to know that I'm not completely heartless. I have a heart that I misplaced somewhere in all this clutter. Now, if you try to leave, I will shrink you. If you tell me you are ready to be shrunk, than I will shrink you and go take my medicines like you want me too. I'll be a good patient. But if you aren't ready to be shrunk than just hang out here in the library with me. You could read or put your headphones on and take some time to think about it. I won't shrink you. I'll go back to grading these papers as long as you stay here.\"</span></div></div>",
            "created":1455944400,
            "id":2106969,
            "title":"Lab Assistant"
        },
        "13111":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Fulfillng his duties",
                "Option one",
                "Option A"
            ],
            "content":"<div class=\"\"><div> <span>Jason finishes dressing. Then he gets up and heads for the door. He shrinks out of his clothes a second time. The Inventor fishes him out of his clothes, puts him next to the desk and returns him to normal size. Then The Inventor grades papers. Jason slowly reaches for his clothes again, dresses again and heads for the door. He shrinks out of his clothes a third time. The Inventor patiently retrieves him, puts him next to the desk and returns him to normal a third time.<br>\r\n<br>\r\nJason decides to skip the clothing because he is tired of redressing. He races outside as fast as he can. The Inventor's front yard is enclosed by a hedge that blocks the view. Jason manages to close the door behind him and almost makes it past the hedge. He runs so fast that when he shrinks, his momentum fling his tiny body into the hedge. He is sore but he doesn't detect any injuries.<br>\r\n<br>\r\nThe Inventor takes his time retrieving Jason. Jason has enough time to recognize that there is no way the professor could have shot him with the ray gun this last time. It must be the tag the professor spoke about, the tag caused the shrinking. But whatever the tag is, it must be microscopic because even at Jason's mere inches in height, he can't detect any tag.<br>\r\n<br>\r\nThe Inventor finally opens the door. Using a walker, he slowly makes his way across the yard. He groans as he bends down to look at Jason who realizes that, no matter how much he's faster than the professor, escape is hopeless. The Inventor crouches down on the ground and just looks at Jason for a while. The Inventor has all the time in the world. Jason, on the other hand, is not going anywhere and will never go anywhere again without a need to be rescued by the professor..<br>\r\n<br>\r\nJason realizes that it's kind of nice being out in the garden with the professor. He's so patient and the weather is so peaceful. Jason leans back and relaxes. The professor relaxes too.<br>\r\n<br>\r\nAfter maybe about ten minutes, The Inventor slowly stands up, plucks Jason from the hedge, takes him back to the desk and returns him to normal. The Inventor grades papers ignoring Jason.<br>\r\n<br>\r\nJason dresses but doesn't try to escape. He thinks about hurting the professor but decides against it since he needs the professor so much. Jason sits on a couch in the library and observes the professor. The Inventor grades papers and ignores Jason.<br>\r\n<br>\r\n\"It's not part of my job description to be your guinea pig.\"<br>\r\n<br>\r\n\"It is now.\"<br>\r\n<br>\r\n\"I only came here to remind you to take your medicine and to make sure you are taking care of yourself.\"<br>\r\n<br>\r\n\"Then you better get to it. As soon as you are ready, I'll shrink you down and carry you to my medicine cabinet. Until you are ready, I'll continue to forget my meds.\"<br>\r\n<br>\r\nThere is a long pause in the conversation.<br>\r\n<br>\r\n\"Don't you have any empathy? Can't you see this from my perspective? You kidnapped me.\"<br>\r\n<br>\r\n\"I guess I did didn't I. I'm sorry. I am being unfair. I'll make you a deal. After today, you can submit a schedule to me of when you want days off. Almost any time you want time off, you can have it. I'll sometimes even let you decide how small you want to be.\"<br>\r\n<br>\r\nJason knows that he can't escape but the patience of The Inventer is amazing. They wait for hours while The Inventor ignores Jason. A few people visit briefly but Jason knows not to risk being shrunk and The Inventer is absolutely calm at all times.<br>\r\n<br>\r\n\"What if you fall asleep and I escape?\"<br>\r\n<br>\r\n\"By tomorrow, you will shrink.\"<br>\r\n<br>\r\n\"But I can ask for days off?\"<br>\r\n<br>\r\n\"Yes. You can even have weeks off if you want to travel but you have to tell me first how long you will be gone. The day you are supposed to be back here you will shrink.\"<br>\r\n<br>\r\n\"You're not going to use me for sex, are you?\"<br>\r\n<br>\r\n\"My interests are purely scientific.\"<br>\r\n<br>\r\n\"So you're going to dissect me instead.\"<br>\r\n<br>\r\n\"As tempting as that sounds, I'd be out one guinea pig that way. No, I give you my word of honor that I will not harm you and I will try to avoid causing pain.\"<br>\r\n<br>\r\nJason waited a few more hours for good measure but it was clear The Inventor would not give up. \"Fine. I'm your guinea pig.\"<br>\r\n<br>\r\n\"Take off you clothes, fold them neatly and bring them to me.\"<br>\r\n<br>\r\nJason did so and then covered himself. The Inventor put Jason's clothes in a drawer of his desk.<br>\r\n<br>\r\n\"Don't cover yourself. I need to see what I'm working with.\" The Inventor then measured every part of Jason's body.</span></div></div>",
            "created":1456894800,
            "id":2111960,
            "title":"Jason resists"
        },
        "131111":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jason tries to report The Inventor",
                "Jason gets together with friends",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>The Inventor shrunk Jason and held him. He walked to the medicine cabinet and set Jason on a shelf inside.<br>\r\n<br>\r\n\"So these are the medicines you want me to take, right?\"<br>\r\n<br>\r\nJason said, \"Yes.\" The pill bottles were taller than Jason.<br>\r\n<br>\r\nThe Inventor took Jason back to his desk. Jason could just sit there naked and tiny waiting as the Inventor finished grading papers.<br>\r\n<br>\r\nFinally, the professor said, \"You're supposed to make sure I eat healthy too, right? And you are supposed to clean my house.\"<br>\r\n<br>\r\n\"Yes, Mr. Inventor.\"<br>\r\n<br>\r\n\"You learn quickly. Alright, I'll grow you back to normal but don't get dressed. Just go and do your job.\"<br>\r\n<br>\r\nJason grew back to normal and did the cooking and cleaning. He prepared several meals so The Inventor could just warm up meals for breakfast, lunch and dinner.<br>\r\n<br>\r\nWhen Jason was done, he went to The Inventor and asked, \"Will that be all? Am I free to go?\"<br>\r\n<br>\r\nThe Inventor said, \"Yes, you may dress and leave. However, to help you remember to not betray me, I'm have set your height at 5'8\". Here is an advance on your paycheck. I would recommend you buy clothes of different sizes so you have something to wear no matter what size I make you.\"<br>\r\n<br>\r\nJason put on his clothes but the clothes that fit him this morning were baggy now. He had to hold his jeans up to keep them from falling off.</span></div></div>",
            "created":1504668120,
            "id":2380911,
            "title":"Fulfillng his duties"
        },
        "1311112":{
            "author_id":"coribrown2004",
            "author_name":"Brown",
            "choices":[
                "Jason tries to escape the bathroom",
                "Jason waits for someone to help",
                "Found by Tyler",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Jason shuffled home in his baggy clothes. The hems of his jeans dragged along the sidewalk with every step. He spent the walk home lost in his own thoughts. How could something like this be real?  Jason didn’t like the control the Professor had over him. Something had to be done. The mad scientist needed to be stopped. It was at this exact moment in thought that Jason’s phone began to buzz. He fished the phone out of is now larger than normal pocket. It was his friend Ben.<br>\r\n<br>\r\n“Dude where have you been!?” Ben blurted out before greetings could be exchanged. “You were supposed to meet us here at the bar 15 minutes ago!”<br>\r\n<br>\r\n“I completely forgot Sorry. Crazy day at work.” Jason sighed. “I’m actually not too far. I’ll see you in five.” Jason regretted saying that as soon as the words left his lips. He was tired and socializing with friends was the last thing he wanted to do in this condition.<br>\r\n“Well hurry up!” Ben said curtly. “Rache and Sarah are waiting.”<br>\r\n<br>\r\nBefore Jason could respond, Ben hung up the phone. Jason released a loud sigh, tightened the belt on his pants a notch the turned on his heal towards the direction of the bar. <br>\r\n<br>\r\nAs he made his way to the large, green door marking the entrance to the bar a strange tingling sensation hit him from head to toes. No sooner had it began did it end. Jason quickly shook his extremities. His shoes and pants felt once again looser. He couldn’t dwell on the sensation long. As soon as the door was opened, he was greeted with unison cacophony of friends cheering “Jason!” as he crossed the threshold. <br>\r\n<br>\r\n“How have you been Buddy?” Ben asked as he roughly patted him on the back.<br>\r\n<br>\r\n“To be honest I have had a really crazy day.” <br>\r\n<br>\r\n“I'll say!” Sarah retorted, “It looks like you’ve been loosing weight.” Sarah was never someone who would shy away from making an underhanded insult. Jason shot her a quick half-hearted smile.<br>\r\n<br>\r\n“Well what happened?” Ben pressed the topic further.<br>\r\n<br>\r\n“I’d rather not talk about it.” Jason responded. To be honest, he did want to confide his recent shrinkage dilemma with Ben, but felt uncomfortable discussing it with the girls. (especially Rachel)<br>\r\n<br>\r\nAfter drinks were ordered, the four friends conversed and time seemed to fly by. Jason desperately needed the mental break and found the evening to be quite therapeutic.  After about an hour he quickly glanced down at his phone. 6 NEW MESSAGES and 13 MISSED CALLS! All of them were from Paul the professor.<br>\r\n<br>\r\n“Can you guys excuse me for a moment?” Jason quickly left the table and headed to the bathroom.  After entering he did a quick glance to make sure no one else was in there. He picked the closest stall, closed the door and began checking his voice mail.<br>\r\n<br>\r\n“Jason! Call me immediately! The remote device I created is malfunctioning!” Jason gulped. “Come back to my house right now so I can fix this!”<br>\r\nAs soon as the automated female voice on the answering machine began listing save options, the same tingling sensation as earlier spread across Jason’s body.<br>\r\n<br>\r\nIn a single instant Jason began falling. Soon within the toilet stall, all that was left was a set of slumped clothes crumpled on the dirty floor.<br>\r\nFrom Jason’s perspective everything went dark and became warm. From the smell that engulfed him, he quickly concluded he was shrunk in his own underwear. The tiny naked man scrambled to find an exit from his cloth prison. After several minutes of crawling the little man unceremoniously plopped out of the base of an oversized pant leg on to the cold tiled floor. He couldn’t have picked a worse spot to land as he splashed head first into the only puddle in the bathroom. Nearly soaked head from toe, Jason quickly brushed the liquid off hi body as best he could. He convinced himself that the puddle was only water, but deep down knew that probably wasn’t true. <br>\r\n<br>\r\nTaking a few steps forward, he surveyed the new giant landscape. From his new angle he could see out from under the bottom of the stall fairly well. Comparing himself to the giant objects of his new world, Jason concluded he couldn’t be more than a couple inches tall. <br>\r\nHe shuddered at the thought of his situation.  His bare feet sucked in the cold from the expansive tiled floor. A breeze from the overhead fan wafted over every inch of his wet body. He suppressed an urge to sob. What was he to do? Butt naked, three inches tall, and trapped in a men’s bathroom.<br>\r\n</span></div></div>",
            "created":1550291340,
            "id":2618325,
            "title":"Jason gets together with friends"
        },
        "13111123":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Tyler goes straight to his grandpa",
                "Tyler goes home to sleep off his stupor",
                "Tyler continues partying and getting drunk",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Feeling cold, Jason bundles up back inside his underwear while he thinks. He doesn't get much time to think as a man walks in. The man looks familiar but Jason doesn't recognize him. The man is drunk.<br>\r\n<br>\r\nThe man goes straight to the same toilet stall that Jason had used. Ignoring the clothes, the man unzips his pants and starts peeing. Jason can't help but look up at the stream of urine pouring like the largest waterfall Jason has ever seen.<br>\r\n<br>\r\nThe man finishes up and then notices the clothes. There's no toilet paper so the man picks up Jason's underwear to wipe himself with. Jason rides the underwear.<br>\r\n<br>\r\nThe man then notices Jason and brings Jason up to his face. He belches right on Jason who feels the hot breath that smells like beer.<br>\r\n<br>\r\n\"Well, what have we here. Has my grandpa built the shrink ray he was talking about?\"<br>\r\n<br>\r\nJason says, \"Paul Ralston shrank me. Please take me back to him.\"<br>\r\n<br>\r\n\"Sure little man. I'm his grandson Tyler. I'll take you back to him.\"<br>\r\n<br>\r\nTyler shoves Jason in his pocket and stumbles out of the bathroom leaving Jason's clothes behind.</span></div></div>",
            "created":1552298400,
            "id":2628776,
            "title":"Found by Tyler"
        },
        "131111233":{
            "author_id":"coribrown2004",
            "author_name":"Brown",
            "choices":[
                "Tyler sees Jason and stuffs him back in his pocket",
                "Jason is dislodged and falls onto his friend's giant hamburger"
            ],
            "content":"<div class=\"\"><div> <span>        Jason’s stomach lurched as he was catapulted through the air and thrust into Tyler’s pocket. It wasn’t until Tyler’s gigantic hand released his grip from his shrunken body, that Jason realized how violated he felt. The now over magnified folds and creases of his giant had seemed to linger on every inch of Jason’s naked form. \t<br>\r\n<br>\r\n\tTaking in a reflective breath, Jason surveyed is new surroundings.  His new cloth prison was warm and dark. Only a slight amount of light entered through the pocket opening like a skylight.    The material of the pocket tapered down to a point at the bottom. Jason’s body slid down uncomfortably downward. He adjusted himself to a slight more vertical position to avoid any extremities going numb. At the very bottom of the pocket he felt a hole in the material slight large enough to allow one of his legs to slip though.  Other than himself and bunches of lint the size of his forearm, the pocket seemed empty. He griped the warm fabric to prevent himself from sliding further. <br>\r\n<br>\r\n        The muffled noises of voices and music from the bar could be heard. It didn’t seem that Tyler was taking him to his grandfather the professor immediately. This made Jason feel incredibly nervous and vulnerable. Two inches tall, naked and trapped in complete strangers pocket. Could Tyler have any other nefarious motives? <br>\r\n<br>\r\n        The feeling of anxiety continued to build.  So he decided to shimmy up his pocket towards the opening. It wasn’t easy. The fabric kept shifting as Tyler moved about. After some time and a considerable amount of effort, Jason made his way to the top of his climb.  Cooler air and the sounds of a bustling bar immediately wafted over his face.  Jason rested his arms on stitching of the giant man’s pocket hoisting his head chest into the open as his feet fangled free in the pocket below. Surveying the room, he realized that he was still in the same bar he entered as a full sized man earlier. Tyler stood obviously drunk at the bar flirting with someone Jason couldn’t see from his perched angle.  Only a few actual feet away, was a table of his now giant friends conversing.<br>\r\n<br>\r\n“So where did he go?” Rachel asked annoyed. <br>\r\n<br>\r\n“I have no idea” Ben responded “The bathroom his empty and he won’t answer his phone.”<br>\r\n<br>\r\n         Jason yelled at the top of his now tiny lungs and waved his minuscule hands. “I’m right here! HELP ME!!”  As he screamed, Tyler began to move about the bar. As he moved jostling through the crowd, Jason got closer to his friends. Tyler stopped a mere foot away from Ben’s face. Because Ben was seated and Tyler remained standing, the tiny flailing man was only inches from his giant friend. Every bit of his friends face seemed magnified from his dark bearded stubble to the deepness of his eyes. It was like staring at a face on Mount Rushmore. <br>\r\n<br>\r\n         “Look over here! I’ve been shrunk! Help me!” Ben continued to eat his hamburger completely unaware of his two-inch tall friend’s pleas. Jason lifted his body further out of the pocket exposing his bare torso. Holding his position with one hand and waving the other. “Help Me!”  He cried desperately.  His best friend was so close but yet felt like miles away. <br>\r\n<br>\r\n          It was at this point Tyler moved causing a catastrophic chain of events for one two inch shrunken naked man.<br>\r\n</span></div></div>",
            "created":1552868520,
            "id":2631549,
            "title":"Tyler continues partying and getting drunk"
        },
        "1311112331":{
            "author_id":"coribrown2004",
            "author_name":"Brown",
            "choices":[
                "Jason get's up close and personal with Tyler",
                "option 2"
            ],
            "content":"<div class=\"\"><div> <span>      “WHERE DO YOU THINK YOU’RE GOING PUNY DUDE!” The loud boom of Tyler’s voice shook the Jason’s tiny body to the core. Jason looked up to see the giant glaring down at him disapprovingly. Even in this short interaction Jason could tell the giant was hammered. Tyler dramatically used his index finger to shove the little guy back in his pocket where he belonged.  As the massive finger approached his tiny form, Jason let out one last cry for help.  Before darkness enveloped the tiny naked man again, Jason thought he caught the corner of Ben’s gaze as he plummeted back into the giant’s pocket. <br>\r\n<br>\r\n      Jason’s trip to the bottom of his cloth prison was much rougher than his first. So much so that when he reached the tapered end of the pocket he kept falling. Panic enveloped him as he realized that he was falling though the small hole at the bottom.  It must have torn bigger since he was last down there. The tiny man’s nude form slipped right through the cloth hole. At the last possible instant Jason grabbed a free hanging thread to avoid plummeting down the giant’s pants to his death. <br>\r\n<br>\r\n      Dangling like Tarzan in near complete darkness two things became clear. First Jason was in a precariously deadly situation. Second, It was becoming increasingly clearer that his giant captor wasn’t wearing any underwear!<br>\r\n</span></div></div>",
            "created":1552960440,
            "id":2632028,
            "title":"Tyler sees Jason and stuffs him back in his pocket"
        },
        "132":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "A Dark and Stormy Night",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The story begins</span></div></span></div>",
            "created":1455944400,
            "id":2106947,
            "title":"Flat and stretchy"
        },
        "1321":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "They stick together as Paul suggested",
                "Ben and Jason go looking for help",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>It is a dark and stormy night. Five people share a ride from the science fair. Jason drives.<br>\r\n<br>\r\nBen leans over and whispers, \"I can't believe you invited Sarah to ride with us.\"<br>\r\n<br>\r\nJason whispers back, \"I didn't. I invited Professor Ralston. He invited Sarah since she is his assistant.\"<br>\r\n<br>\r\nRachel leans forward and whispers, \"You know it's pointless to whisper. She can hear every word you say.\"<br>\r\n<br>\r\nSarah sits in the back, half pouting and half glaring at Ben. Professor Paul Ralston also sits in the back, too busy calculating formulas to even notice all the whispering.<br>\r\n<br>\r\n A flash of lightning strikes a tree just as their car passes. Sarah whispers loudly, \"This looks a lot like a scene from a horror movie where the car breaks down and the happy couple has to seek shelter in an abandoned, haunted house where they wind up stalked by a psycho who was a jilted lover in the past.\" Everyone looked at Sarah. Then the car sputters and dies.<br>\r\n<br>\r\nPaul says, \"I watch horror movies too. I don't always have my nose stuck in a book. I've been known to let my hair down and have fun. If we're playing out a horror scene, all we have to do is follow a few rules and we'll be alright. One, stick together. The psycho always picks off people when they are alone. . .\"<br>\r\n<br>\r\nJason groans and gets out of the car followed by Ben and Rachel. They pop the hood and look at the engine.<br>\r\n<br>\r\nBen asks, \"Can you tell what's wrong?\"<br>\r\n<br>\r\nJason answers, \"No, it's too dark.\"<br>\r\n<br>\r\nSarah calls from the comfortable back seat, \"Did you run out of gas?\"<br>\r\n<br>\r\nJason answers, \"No, I did not run out of gas. I filled up just before offering you a ride.\"<br>\r\n<br>\r\nSarah says, \"Just asking. It's not my fault that your car is so pathetic.\"<br>\r\n<br>\r\nJason says, \"If my car is so pathetic, you should have taken your own car. Oh wait, the transmission went out on your car which is why the two of you needed a ride in the first place. I forgot. It's easy to forget that even the great Sarah as car trouble sometimes.\"<br>\r\n<br>\r\nRachel intercedes, \"Enough of this. It's getting us nowhere. Can we fix the car.\"<br>\r\n<br>\r\nJason answers, \"Maybe, if we had more light. This flashlight isn't strong enough. As far as I can tell, there's nothing wrong withbthe engine so the problem must be deeper inside where I can't see.\"<br>\r\n<br>\r\nRachel says, \"The engine sounded like a piston came lose.\"<br>\r\n<br>\r\nJason says, \"I agree but I hope not. If it's a piston then we'll need to call a tow truck.\"<br>\r\n<br>\r\nBen says, \"I'm already ahead of you but my phone doesn't have any service way out here. Can any of you make a phone call?\"<br>\r\n<br>\r\nThey all check their phones but no one has any phone connection. \"Someone is going to have to walk.\"</span></div></div>",
            "created":1455944400,
            "id":2106968,
            "title":"A Dark and Stormy night"
        },
        "13211":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Paul explains the quantum mechanics of flattening",
                "Sarah gets a hold of flattened Jason and wants to flatten Ben as well",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Paul steps out of the car. \"I saw a town a few miles back.\"<br>\r\n<br>\r\nBen says, \"A town? That was barely even a store and the lights were off. Maybe it used to be a town but it looked like it was abandoned years ago.\"<br>\r\n<br>\r\nPaul says, \"Still, it might have better service than we have here. I say we go that direction to find out.\"<br>\r\n<br>\r\nRachel says, \"I'll go too. We shouldn't have any of us go off alone. Besides, I'm hungry and all I found in the car was a breath mint.\"<br>\r\n<br>\r\nSarah still sits in the car. \"Someone should stay here to protect the car from thieves.\"<br>\r\n<br>\r\nBen says, \"Good idea. Sarah, you can stay here with the car.\"<br>\r\n<br>\r\nSarah asks, \"Aren't you worried about your car?\"<br>\r\n<br>\r\nJason says, \"My so pathetic car? Not really. There's no traffic on this road. I doubt anyone will even be by to notice my car but one thing I would like us to do before we leave is push the car behind those bushes there so it's hidden. We won't be gone long, just long enough to make a phone call and we'll come right back.\"<br>\r\n<br>\r\nSarah gets out of the car, \"Fine, if you're not worried about your car, neither am I.\"<br>\r\n<br>\r\nEveryone except Sarah helps push the car behind some bushes. Then they walk back to the abandoned town. There is more than one building in that town but only one building is still standing. The other buildings are either piles of rubble or missing at least one wall. The one building looks like an abandoned antique store. They knock on the door and it falls off its hinges.<br>\r\n<br>\r\n\"Is anyone home?\"<br>\r\n<br>\r\nNo answer. They test their phones and still can't make any phone calls. They go inside. Only the front of the building looks like an antique store. The back of the building looks like an old fashioned home. It even has an old fashioned pump and basin instead of a faucet and sink. Rachel doesn't find any food in the old fashioned ice-box but she finds some expired food in the cabinets.<br>\r\n<br>\r\nThe place is dusty but relatively clean as if someone had cleaned it a few months ago. Rachel says, \"This is spooky. Why would someone come out here to clean but then leave all these valuable antiques in an unlocked building?\"<br>\r\n<br>\r\nAlthough they all wear coats but the rain had been so heavy that they feel a little wet, especially Paul and Sarah. Paul says, \"I'm going to look for some clothes to borrow. Maybe they have a dryer we can borrow as well.\"<br>\r\n<br>\r\nBen and Jason wander to the basement where they find an old fashioned clothes wringer. Jason puts his hand on the rollers for no reason but his hand easily slips through. On the other side of the rollers, his hand is flat but he can still wiggle it. Ben sees and they both stare in shock. Jason pulls his hand back and his hand is normal again. He gets curious and tries again. He experiments with it and each time his hand goes in, it flattens but each time he pulls it out, it retuns to normal.<br>\r\n<br>\r\nJason tries putting his arm further in, all the way to his shoulders. His sleeve doesn't change at all even though his arm flattens within his sleeve. His sleeve just hangs loosely on his arm. Jason gets daring and sticks his head through. Then he keeps going slipping his entire body through clothes and all. His shoes won't go through so Jason bends to untie his shoes and discovers that being flattened makes him extremely flexible. Without his shoes, Jason comes out completely flat and stands up by bending his flat feet. His clothes hang very loose and he grabs his belt before his pants fall down.</span></div></div>",
            "created":1456549200,
            "id":2110432,
            "title":"They stick together as Paul suggested"
        },
        "133":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Hell Hath No Fury",
                "Option one",
                "Option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106948,
            "title":"Detachables"
        },
        "1331":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Follow Ben",
                "Follow Jason",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>There is a witch named Sarah Golden. She inherited her powers from her dad, a wizard, but he was a criminal that ended up living life on the run. Sarah doesn't want to end up like him so she keeps her powers secret. She doesn't hesitate to use her power to get what she wants, as long as she can use her power covertly.<br>\r\n<br>\r\nThere are few witches. Magic has limits and witches live in danger of inspiring witch hunts, so all witches and wizards keep their powers a secret. They even work together to restrain any witch that is overly flamboyant.<br>\r\n<br>\r\nSarah laughs at movies like Harry Potter.  If only life could be that much of a fairy tale but there are no magic schools, no Diagon Alleys, no house elves, no hippogryphs, or any other fantasies. There's just a few witches that survived the witch hunts of the past and live in hiding. Although society has gotten friendlier toward witches in general, there is still too much potential hysteria for witches to risk being discovered by the general public.<br>\r\n<br>\r\nBen dated Sarah for a while but Jason told Ben to dump her. Jason called Sarah \"poison\". Sarah casts a spell of revenge on both of them.<br>\r\n<br>\r\n<span class=\"clred\">Additional rules for the chapters (plural) of this branch:</span><br>\r\n<br>\r\n1. <span class=\"clred\">No global spells, grandiose spells or overly convenient spells.</span> Remember, they are witches, not gods. Spells take time to prepare and the bigger the spell, the more prep time required. To create a safe space for witches to hide in requires more time than a witch on the run has. In other words, muggles can be a serious threat even to a witch. Think more Willow, less Potter.<br>\r\n<br>\r\n2. You may introduce new characters including other witches but <span class=\"clred\">keep Sarah as the main witch in this story and Ben and Jason as her primary targets.</span> Don't let the story grow too complicated. </span></div></div>",
            "created":1455944400,
            "id":2106967,
            "title":"Hell Hath No Fury"
        },
        "13312":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Rick helps Jason further",
                "Jason is on his own chasing his jewels",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jason is at the gym taking a shower. He soaps himself up but fumbles, dropping the soap. With soap in his eyes,  he tries rinsing before looking for the soap.<br>\r\n<br>\r\nRick asks, \"Jason, what weird stunt have you done this time?\"<br>\r\n<br>\r\nJason ignores Rick. When his eyes are clear enough, he sees his soap next to what looks like a dildo. \"Alright, which one of you yahoos bought a dildo in here?\"<br>\r\n<br>\r\nRick said, \"You did but it's not a dildo. Don't you recognize it?\"<br>\r\n<br>\r\nIt did look incredibly realistic for a dildo. Jason did not bend over cause boys don't bend over in the shower. He squatted down to pick up the soap and dildo but the dildo was slippery and shot out of his hands to land at Rick's feet.<br>\r\n<br>\r\n\"Eww. Why'd you throw it over to me you freak.\" Rick kicked it and Jason felt a pain. He looked down to see his own genitals missing but that's impossible.<br>\r\n<br>\r\nJason finally comes to the inescapable conclusion. He tries to get his genitals again but they shoot out of his hand again. Jason tries a few more times but every time, they shoot out of his hand. \"Please help me. They're too slippery.\"<br>\r\n<br>\r\nRick says, \"Alright but you owe me.\" Rick squats down and easily picks up Jason's genitals. He rinses them and dries them so they won't be so slippery. He hands them back to Jason but they shoot straight out of his hands again.<br>\r\n<br>\r\n\"One more time.\" This time, Rick keeps a firm grip while Jason gets a firm grip. Rick can feel the genitals trying to get away as if magnetically repulsed by Jason. Despite Jason's firm grip, as soon as Rick let's go, Jason's genitals shoot out of his hand, this time flying much further before landing all the way in the locker room.<br>\r\n<br>\r\n\"What did you do, Jason, have an accident at an electric magnet factory?\"</span></div></div>",
            "created":1458018000,
            "id":2118146,
            "title":"Follow Jason"
        },
        "134":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "More options by bejjinks",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106951,
            "title":"Inanimate"
        },
        "1341":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Teleporting Through a Digital World"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options by bejjinks</span></div></span></div>",
            "created":1455944400,
            "id":2106966,
            "title":"More options by bejjinks"
        },
        "13411":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jason goes through",
                "Ben goes through",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"So how does this work?\" Jason asks.<br>\r\n<br>\r\nIt is a big lab with lots of people and machinery. It is a real lab and not one of those mad scientist labs you read about in fiction. Most of the machines are computers calculating out different formulas. There is a small table with a bowl of fruit on it. Next to it is a booth seven feet tall and three feet by three feet. The interior of the booth is covered by sensors and special lasers called digitizers. A few feet away is an identical booth. Between the booths is a computer station where Paul, Ben and Jason are talking.<br>\r\n<br>\r\nPaul says, \"You put something like an apple in one of these booths. It doesn't matter which booth. The booth digitizes it. Then the computer sends the apple to whichever booth you tell it too and recreates the apple.\"<br>\r\n<br>\r\nBen says, \"There are so many ways that could go wrong. Has it been tested thoroughly?\"<br>\r\n<br>\r\nPaul says, \"Thoroughly, we've followed standard scientific procedures and then we sat around brainstorming to think of anything outside of standard procedures we should test for.\"<br>\r\n<br>\r\nBen asks, \"So how do you know it's the same apple?\"<br>\r\n<br>\r\nPaul says, \"We trained some monkeys to do random tricks that no other monkey was ever trained to do. We sent them through the digitizer and they came out still knowing their uniquely taught trick but not knowing tricks they hadn't been taught. Even the monkeys memories made it through the digitizer. Their personality, their habits, every detail made it through the digitizer intact without alteration.\"<br>\r\n<br>\r\nJason asks, \"So we can create identical copies of those monkeys?\"<br>\r\n<br>\r\nPaul says, \"Unfortunately, no. We've tried but the copies came out dead.  We've tested that over and over again. Some things we can make copies of such as apples, flies, and snails. We've already got a team looking into using this technology to mass produce food and that's going well. There does seem to be limits on how many copies can be made and the more complicated the item, the fewer copies can be made successfully, but we haven't figured out the nature of the limit. So far, every mammal makes it through the digitizer but cannot be copied.\"<br>\r\n<br>\r\nJason says, \"So we can only go through the digitizer once. That would not make a good system for teleportation.\"<br>\r\n<br>\r\nPaul says, \"You can go through as often as you like. We sent one monkey through twenty times each day and so far, there's been no limit. The monkey comes out exactly as it went in with no ill health effects. We just can't make living copies and we are baffled as to why. Only the first copy sent to the digitizer lives. All other copies are perfect copies with no reason for death but they're dead anyway.\"<br>\r\n<br>\r\nThey set up a demonstration. They put the bowl of fruit in the digitizer and digitize it.<br>\r\n<br>\r\nPaul says, \"Now here's the fun part. While the fruit is digitized, we can play with it. We can make the apple bigger than all the other fruit.\"<br>\r\n<br>\r\nJason asks, \"Will it come out the same apple?\"<br>\r\n<br>\r\nPaul explains, \"There are limits. We can play with it all we want digitally but most changes will automatically revert to normal before coming back out into the real world. We can make the digitized apple humongous but when it comes back to the real world, it will still be within the size limits of real world apples. That seems to be the primary limit on what kind of alterations we can do. We took a monkey and switched it's arms and legs but it came out normal with arms and legs where they are supposed to be. So other than minor modifications, this cannot be used as a transformation device in the real world. However, while digitized, there are no limits. We can even pixelate.\"<br>\r\n<br>\r\nPaul types and the apple turns into a two dimensional apple made of twenty pixels.<br>\r\n<br>\r\nBen asks, \"And that will still come out as an edible apple?\"<br>\r\n<br>\r\n\"Absolutely.\"<br>\r\n<br>\r\nJason asks, \"And you're ready for human testing.\"<br>\r\n<br>\r\n\"We are. We're going to start out slow.  The first test will be simply to send one of you straight through. We don't want to leave you digitized for any length of time until we know the preliminary tests are successful.\"</span></div></div>",
            "created":1458018000,
            "id":2117962,
            "title":"Teleporting Through a Digital World"
        },
        "134111":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Teleporter Malfunction",
                "On to long distance testing",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are the prelimary tests of teleporting Jason successful?</span></div></span></div>",
            "created":1458018000,
            "id":2117965,
            "title":"Jason goes through"
        },
        "1341112":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Where is Jason?",
                "On to spending time digitized",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With the booth several miles apart, do they continue to have success?</span></div></span></div>",
            "created":1458018000,
            "id":2117967,
            "title":"On to long distance testing"
        },
        "13411122":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Stuck in a Digital World",
                "On to try minor body modifications",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now it's time to leave Jason digitized for a while.  Do they continue to have success?</span></div></span></div>",
            "created":1458018000,
            "id":2117970,
            "title":"On to spending time digitized"
        },
        "134111221":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Making a world",
                "Digital Jason",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jason strips naked. Although he gets to wear clothes for most tests, he has gotten used to the notion that they only want to test him, not his clothes. Clothes could potentially cause a problem. He snickers at the idea of his clothes becoming permanently attached to him.<br>\r\n<br>\r\nEverything goes like usual. He steps into the booth and closes the door. It is a little claustrophobic but the booth is roomier than a tanning bed. Then like a tanning bed, the lights come on except these lights are mostly red, not blue. The lights are also brighter, almost blinding but it's okay for Jason to close his eyes. Each of the thousands of little lights moves along its track, scanning Jason. He doesn't feel anything. Instead, his awareness of the world gradually fades away like a black-out but without the accompanying dizzyness. It's like falling asleep except staying mentally alert. <br>\r\n<br>\r\nWhen he opens his eyes, everything is black except a giant screen. On the screen are Paul and Ben looking at him. Otherwise, there is nothing in the digital world. He doesn't even feel air but he already knows he doesn't need to breathe.<br>\r\n<br>\r\n\"So, what's it like?\" Ben asks.<br>\r\n<br>\r\nSuddenly, an alert sounds. Paul says, \"There seems to be a problem with bringing you back to the real world. Jason, you are safe in the digital world but you might be stuck there a while.\"<br>\r\n<br>\r\nOption 1. While we wait, let's try adding things to the digital world. <br>\r\n<br>\r\nOption 2. While we wait, let's try changing Jason. </span></div></div>",
            "created":1458018000,
            "id":2117986,
            "title":"Stuck in a Digital World"
        },
        "135":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "more branches by bejjinks",
                "option 1",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106952,
            "title":"Something else"
        },
        "1351":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "All Of Me",
                "Big Dick",
                "Still more branches by bejjinks"
            ],
            "content":"<div class=\"\"><div> <span>1. Jason is split up into three pieces but each piece is than attached a cyborg body. The three Jason's maintain a telepathic link and awareness of each other but start to develop separate identities.<br>\r\n<br>\r\n2. In order to loosen Ben up, Jason slips him a formula that makes his penis grow.</span></div></div>",
            "created":1455944400,
            "id":2106965,
            "title":"More branches by bejjinks"
        },
        "13511":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "They track down Jason's body: reserved for bejjinks",
                "Someone is after them",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jason's head is engaged in a discussion about quantum physics. He was intelligent to begin with but now he is attached to one of the largest computers in the world. Now he practically knows all the knowledge that has been discovered by humanity. People come from all over the world to marvel at his intelligence.<br>\r\n<br>\r\nAn old friend of his, Ben comes to visit.  He watches and listens.<br>\r\n<br>\r\nJason talks like an encyclopedia. He expresses no emotion. The people around him treat him like a machine. All they care about is facts and theories. Ben sighs and frowns.<br>\r\n<br>\r\nThe crowd thins and Ben has a chance to talk to Jason. \"Jason, how you doing.\"<br>\r\n<br>\r\n\"I am functioning at a standard level. My cooling fan was replaced yesterday.\"<br>\r\n<br>\r\nBen puts a hand to his head, \"Jason, do you remember me?\"<br>\r\n<br>\r\n\"You are Benjamin James Greer. You attended the same grade school, high school, and college as me. You lived in 2647 North Rosewood, apartment 37, Jefferson, Ohio, United States at the same time I did.\"<br>\r\n<br>\r\n\"Are we friends?\"<br>\r\n<br>\r\n\"We called each other friends.\"<br>\r\n<br>\r\n\"What happened to you? Tell me the story of how you changed from Jason the human into this.\"<br>\r\n<br>\r\n\"That is classified. I cannot tell you.\"<br>\r\n<br>\r\n\"What can you tell me?\"<br>\r\n<br>\r\n\"They wanted me because I was intelligent. The experiment was to divide a person. They sucked my soul out and put it in a container that they gave away. They attached an Artificial Intelligence to my body and gave it away. They attached my head to this computer and gave it away.\"<br>\r\n<br>\r\n\"Who are they?\"<br>\r\n<br>\r\n\"That is classified.\"<br>\r\n<br>\r\n\"Where are your body and soul now?\"<br>\r\n<br>\r\n\"I do not know.\"<br>\r\n<br>\r\n\"Who did they give your body and soul to?\"<br>\r\n<br>\r\n\"That is classified.\"<br>\r\n<br>\r\n\"Did you volunteer for this?\"<br>\r\n<br>\r\n\"That is classified.\"<br>\r\n<br>\r\nLater, Ben met up with Rachel and Paul to discuss what he found</span></div></div>",
            "created":1455944400,
            "id":2107141,
            "title":"All Of Me"
        },
        "13512":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Someone calls an ambulance",
                "Fire drill, everyone outside",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Will there be girls there?\" Ben asks<br>\r\n<br>\r\nJason answers, \"No, it's just some of the guys.\"<br>\r\n<br>\r\n\"But you're going camping near some hot springs and you're not bringing any swimsuits.\"<br>\r\n<br>\r\n\"It's called roughing it. Getting into nature with as little man-made gear as possible.\"<br>\r\n<br>\r\n\"Listen, if there are no girls involved leave me out.\"<br>\r\n<br>\r\n\"I'm getting sick of your attitude. Do you realize the reason you don't have a girlfriend is because you're obsessed with them? If we weren't on the same team, I would have quit trying to be friends with you long ago.\"<br>\r\n<br>\r\nJason storms out.<br>\r\n<br>\r\nA few days later, Jason visits a flea market where he finds an interesting liquid for sale. On Thursday, Jason slips this liquid into Ben's drink.<br>\r\n<br>\r\nFriday, after Ben and Jason work out together, they shower. Jason showers openly even though his penis is average but Ben does the towel dance of modesty keeping himself covered at all times.<br>\r\n<br>\r\nBen goes to put his underwear on when he discovers his now eighteen inch monster that won't go down. Despite the full erection, Ben does not feel aroused. In fact, it feels like his penis has been replaced by rubber even though it looks exactly like Ben's penis only bigger. How is he supposed to hide that in his clothes?</span></div></div>",
            "created":1456808400,
            "id":2111751,
            "title":"Big Dick"
        },
        "13513":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "My Own Best Friend",
                "Odd Dream"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still more branches by bejjinks</span></div></span></div>",
            "created":1458709200,
            "id":2121671,
            "title":"Still more branches by bejjinks"
        },
        "135131":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Ben lets Jason go",
                "Jason holds Ben",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>(I confess, this branch is the most like my own true story and the reason I got into this fetish in the first place.)<br>\r\n<br>\r\nBen is lonely. His parents are not the most loving parents on Earth.<br>\r\n<br>\r\nBen's dad is religiously strict. When Ben was six, he had come home from school to proudly announce that he had learned that boys have a penis. His dad had scolded him for using that dirty word and if it hadn't been for his mom, little Ben would have gotten a spanking. To this day, Ben's dad wears long sleeved shirts and long pants no matter the circumstances.<br>\r\n<br>\r\nHis mom is unpredictable. She is probably manic-depressive but refuses to allow a doctor to diagnose her. She treats Ben like her own private porcelain baby doll. She takes him out to show off to her friends so they can tell her what a good mother she is but then she puts her porcelain doll into storage for safe keeping. OR she'll pull him out and pretend that he is very sick so she can take him to the doctor and hear the doctor tell her what a good mother she is. She has to be the center of attention.<br>\r\n<br>\r\nBen doesn't have friends. Most people don't understand why he's sick all the time or why he has to stay home so much. They think he's faking it, that he's a momma's boy who refuses to venture out from his momma's protection. Doesn't the Mafia also offer \"protection\"? Ben is shunned. Other boys refuse to hang out with Ben. They treat Ben like he's got a contagious disease. He's a popular target for bullies.<br>\r\n<br>\r\nTo add to the problem, Ben wasn't allowed to join the boy scouts, he wasn't allowed to try out for sports, he wasn't allowed to be involved in any activities that normal boys do. Such activities are sinful, according to Ben's dad.<br>\r\n<br>\r\nBen is protected from life. With all this protection, you would think nothing ever happened to harm Ben. You would think that he hadn't been sexually molested when he was five because his parents wouldn't have allowed it. They didn't know it happened. His parents were too busy with their own lives to notice.<br>\r\n<br>\r\nBen is now seventeen although he might as well be eight since his parents won't let him grow up. He wants a job but his mom calls his potential employers and tells them not to hire him. He has sexual urges like any young man but he has no idea what to do with these urges. The only sex he knows about is the abuse he experienced when he was five. He really isn't interested in girls because he hasn't been allowed to know about them. He is interested in boys but doesn't want to have sex, at least not like the sex he had. What Ben wishes for most is a friend.<br>\r\n<br>\r\nOne day, a box appears in his room. It's a metal box with a hinged lid. Ben opens the box and there is a seventeen year old boy inside the box.<br>\r\n<br>\r\n\"Jason, you're here. My wish came true.\"<br>\r\n<br>\r\nJason wakes up, \"Ben, what? Where am I? I shrank? What happened?\"<br>\r\n<br>\r\n\"I'm sorry. I didn't think my wish would come true.\"<br>\r\n<br>\r\n\"You wished me this way? Well unwish this.\"<br>\r\n<br>\r\n\"I don't think I can. I don't know how wishes work. I'll try.\"<br>\r\n<br>\r\nJason is still there. He looks up at Ben. \"Why am I naked?\"<br>\r\n<br>\r\n\"Weren't you a boy scout?\"<br>\r\n<br>\r\n\"Yes, I was in scouts.\"<br>\r\n<br>\r\n\"Didn't you go skinny dipping with the other boys.\"<br>\r\n<br>\r\n\"Yes, but this isn't the lake.\"<br>\r\n<br>\r\n\"You're brave like the Ancient Olympians. You're not afraid to be naked. It's not a sin to you.\"<br>\r\n<br>\r\n\"You're a freak. I'm no Olympian. You're projecting your own wishful thinking onto me. Now find me some clothes.\"<br>\r\n<br>\r\n\"I don't have any dolls. I'm too old for toys.\"<br>\r\n<br>\r\n\"Did you ever have toys?\"<br>\r\n<br>\r\n\"Wait, I do have a hand-me-down Barbie. I wish I had a Ken or a GI Joe but I don't have any brothers. Maybe I can find something in Barbie's clothes that are neutral enough that you could wear.\"<br>\r\n<br>\r\nBen finds a halter top and a pair of capri pants for Jason. Jason says, \"I'll skip the halter top.\" He puts the capri pants on.<br>\r\n<br>\r\n\"Hold me.\"<br>\r\n<br>\r\n\"What? Are you a faggot?\"<br>\r\n<br>\r\n\"No, just hold me. No one holds me.\"<br>\r\n<br>\r\n\"How can I hold you. I'm only what, six inches tall.\" Just then, Jason and his pants grow.<br>\r\n<br>\r\n\"Apparently my wishes control your size.\"<br>\r\n<br>\r\n\"Apparently.\" Jason says, \"My only hope of escaping is to make you happy. This is kidnapping.\"<br>\r\n<br>\r\nBen says, \"Oh no. I want you to want to be with me. What can I do to make you like me.\"<br>\r\n<br>\r\nJason says, \"You can let me go.\"<br>\r\n<br>\r\nBen says, \"But then you won't come back. Unless my wishes bring you back but that won't make you happy.\"<br>\r\n<br>\r\nJason says, \"Then we're at a stalemate. Your move.\"</span></div></div>",
            "created":1458709200,
            "id":2121676,
            "title":"My Own Best Friend"
        },
        "135132":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Or was it",
                "A prophetic dream",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jason wakes up with the usual morning wood. He gets the idea to suck himself but he can only just get the tip in his mouth. Then he tries pulling on his cock with his mouth and it stretches but like a rubber band, when he stops pulling on it, it immediately shrinks back to normal. Then he uses his arms and legs. With the tip in his mouth, one leg pushes,  one hand pulls, another leg pushes and the other hand pulls until his cock looks like it's in a taffy puller but it stretches that far. Then he thinks about using a door knob and . . .<br>\r\n<br>\r\nThe alarm goes off and Jason wakes up for real. It was only a dream.</span></div></div>",
            "created":1460726820,
            "id":2133378,
            "title":"Odd Dream"
        },
        "14":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Nudism",
                "Athletics",
                "History",
                "Art",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>There are still choices to make:<br>\r\n<br>\r\n1. The boys join a nudist colony<br>\r\n2. The boys join a sports team that has few inhibitions<br>\r\n3. The boys travel through time to the past (Ancient Olympics, Roman Baths, or other)<br>\r\n4. The boys get involved in helping an artist achieve his vision.<br>\r\n5. Something else</span></div></div>",
            "created":1455771600,
            "id":2105896,
            "title":"Non ENM"
        },
        "141":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "I've got a secret",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106953,
            "title":"Nudism"
        },
        "1411":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jason meets some nudists",
                "What does Jason do when he's alone",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ben and Rachel are girlfriend/boyfriend but they are cool and light about it, far from hot and heavy. Rachel is interested in Jason but that hasn't seemed to work out.<br>\r\n<br>\r\nBen knows that Rachel prefers Jason and he's okay with that. Ben feels like his relationship with Rachel is more like best friends or brother/sister.  They enjoy hanging out together and going on \"dates\" but neither wants to go farther. Ben will even help Rachel bridge the gap with Jason if that is possible.<br>\r\n<br>\r\nThe problem is, Jason has a secret. He's a closet nudist. He loves to get out to places where he can strip off and run around. But he's afraid to share that with anyone. He hasn't even told Ben even though Ben has seen his all over tan. Ben won't mention it. He's closed off to the conversation.<br>\r\n<br>\r\nJason wants to tell Rachel, but he's afraid she'll reject him but his fear creates a distance that Rachel can't cross.<br>\r\n<br>\r\nWon't you give Jason some advice on how to tell Rachel.</span></div></div>",
            "created":1455944400,
            "id":2106963,
            "title":"I've got a secret"
        },
        "142":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "The Cause",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106954,
            "title":"Athletics"
        },
        "1421":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Option a",
                "Option one"
            ],
            "content":"<div class=\"\"><div> <span>The University of Warrick had been founded by a coalition of Franciscans and Moravians in the 1800s. Although the university has opened up to accept people from all religions, the Franciscan/Moravian culture continues to dominate the campus. The cathedral and the meeting house are the two main buildings on the quad.<br>\r\n<br>\r\nBen Stone has worked really hard to get accepted into Warrick. Although Warrick is not an Ivy League, Warrick isn't a community college either. The prestige of a Warrick graduate is fairly well known.<br>\r\n<br>\r\nBy chance, Ben has met the Dean of Warrick, a Mr. Paul Ralston. Mr. Ralston happens to go to the same non-denominational church Ben decides to attend. So Ben often sits near Mr. Ralston in church.<br>\r\n<br>\r\nWarrick encourages its students to try out for sports teams. Since it doesn't have a football team, ben decides to try out for rugby and he makes it.<br>\r\n<br>\r\nBut then Ben gets the shock of his life when he meets the captain of the rugby team. Ben thinks Jason Fletcher is gay. But before he can address that shock, Ben gets another shock from Coach Johnson.<br>\r\n<br>\r\n\"Sales from last years nude calendar were very good. We have contributed more than $10,000 dollars to Sports Allies so far. I'm hoping this year to do even better.\"<br>\r\n<br>\r\nBen raises his hand, \"Do I have to appear in the calendar?\"<br>\r\n<br>\r\nCoach Johnson answers, \"It's not an absolute requirement but I would strongly encourage you to do so as a form of solidarity with the team. If you're the only one not in the calendar, you'll disrupt the teamwork and I may have to cut you from the team.\"<br>\r\n<br>\r\nWhen Ben gets a chance, he asks Mr. Ralston why he let's a gay man and a nude calendar on the college campus.</span></div></div>",
            "created":1455944400,
            "id":2106962,
            "title":"The Cause"
        },
        "143":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Visit from the Future",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106955,
            "title":"History"
        },
        "1431":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Recent past",
                "Far past",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ben and Jason hike through a forest. The day is peaceful and they are far away from any cities or noisy machines. Suddenly, a nearby tree explodes. It's far enough away that the boys aren't injured but close enough that the boys jump from fear and duck behind some rocks for cover. They look at what exploded.<br>\r\n<br>\r\nThey see a weird machine. It looks like it's made out of styrofoam but it is covered in weird lights. Several of the lights appear to hover above the machine. A man steps out of the machine wearing the weirdest clothes. His clothes keep changing colors. There are more lights hovering above the man and they move when he does. The man speaks but it isn't in any language the boys recognize. All they can tell is that, from his tone, the man is cursing as if his machine is broken. The man bangs on the machine, throws a few tools, and reaches inside the machine.<br>\r\n<br>\r\nThen all Hell breaks loose. Almost everything disappears: the rock they hid behind, the trees, the hiking trail, the Earth. The boys float in nothingness while swirls of every color in the rainbow explode around them. The man and his machine are still there along with all the tools the man had scattered everywhere. The hovering lights are also still above everything.<br>\r\n<br>\r\nThe boys scream. The man pulls his head out of the machine, looks at them, and puts his face in his hands. \"Grukti nger kuktinuo?\"<br>\r\n<br>\r\nJason asks, \"What have you done? Are we dead?\"<br>\r\n<br>\r\nThe man turns a dial, \"There, my computer has identified your language as English and implanted translaters in your ears. Sorry. I did not mean to catch you in the warp field and drag you with me.\"<br>\r\n<br>\r\nBen asks, \"Warp field?\"<br>\r\n<br>\r\n\"Let me introduce myself. My name is Paul Ralston, historian. I travel through time studying history. I was heading back to look for the first person in North America to find out where he came from but I hit a zbeing which caused me to crash. I didn't know there was anyone near where I crashed or I would have been more careful with the warp field. These hovering lights can usually tell what ought to be in the warp field and what ought to be left out but they can sometimes mistakenly assume that all humans within twenty farths are passengers.\"<br>\r\n<br>\r\nBen asks, \"So you are a time traveller and you can return us to where we came from?\"<br>\r\n<br>\r\n\"Unfortunately, it's not that easy. I will return you eventually but I can't stop mid stream and turn around. If I even try, she'll dump us at whatever place and time we happen to be at that moment. It would be like hitting another zbeing but worse.\"<br>\r\n<br>\r\nJason asks, \"Aren't you afraid of altering history?\"<br>\r\n<br>\r\n\"Not really. There are forces that protect history. The zbeings for example. Certain critical moments in history are surrounded by zbeings that prevent us from getting near those times and places. We've mapped the coordinates of several zbeings. For example, there are forty zbeings surrounding Adolph Hitler. We've tried several times to assassinate Hitler but the zbeings keep deflecting us.\"<br>\r\n<br>\r\nBen asks, \"So Jason and I aren't protected by zbeings. Does that mean we are historically insignificant?\"<br>\r\n<br>\r\n\"Let me find out.\" The man consults his computer. \"No, one of your descendants annhilates all people who speak English. We've mapped some zbeings guarding him. But there are other ways that history is protected. Sometimes, history opens up an alternate timeline so that even if you die outside your own timeline, there will still be a you in your timeline to continue living.\"<br>\r\n<br>\r\nBen asks, \"One of my descendants annhilates people? Now I feel like I have to kill myself to stop him.\"<br>\r\n<br>\r\n\"Didn't you hear me? It wouldn't do any good to kill yourself because even if you return to your own timeline, the moment you kill yourself, history would move that into an alternate timeline and you would still live in your timeline.\"<br>\r\n<br>\r\nJason asks, \"Does that mean that everything is predestined? We can do whatever we want without consequences because history repairs itself?\"<br>\r\n<br>\r\n\"No, you still have choices and free will about how you live your life and God will judge you based on your decisions. The only thing you don't have a choice about is how your life influences the future. If you kill someone that history protects, history will keep that person alive but you would still be guilty of murder.\"<br>\r\n<br>\r\nBen says, \"All this timey wimey stuff gives me a headache.\"<br>\r\n<br>\r\n\"Don't worry about it. Just enjoy the ride.\"<br>\r\n<br>\r\nJust then they heard a squeal like a thousand fingernails on a chalkboard. The man frantically checks his machine. \"We just lost steering. I don't know where we're going. You better change into clothes like mine. They can change to look like the clothes others wear so that you can blend in.\"<br>\r\n<br>\r\n<div align=\"center\"><img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/vignette5.png\" alt=\"*Vignette5*\" title=\"Vignette5\" border=\"0\" width=\"15\" height=\"15\"></div><br>\r\n<br>\r\nThe following is a guide to the options of time and place where this story can go:<br>\r\n<br>\r\nRecent past<br>\r\n               Woodstock 1969 AD<br>\r\n               Vietnam 1965 AD<br>\r\n               More options<br>\r\n                              Brisbane, Australia 1915 AD<br>\r\n                              Philadelphia 1884 AD<br>\r\n                              San Antonio, Texas 1868 AD<br>\r\nFar past<br>\r\n               Hannibal, Missouri 1840 AD<br>\r\n               France 1540 AD<br>\r\n               More options<br>\r\n                              Papua New Guinea 1540 AD<br>\r\n                              Rome 120 AD<br>\r\n                              Olympia 500 BC</span></div></div>",
            "created":1455944400,
            "id":2106961,
            "title":"Visit from the Future"
        },
        "14311":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Woodstock 1969 AD",
                "Vietnam 1965 AD",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose a time and place after 1850 AD</span></div></span></div>",
            "created":1456722000,
            "id":2111352,
            "title":"Recent past"
        },
        "143111":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Ben and Jason attend the Woodstock concert",
                "Ben and Jason wander through the Woodstock camp",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ben and Jason finish putting on the morph suits when abruptly, the morph suits retreat. The clothes literally shrink into nothing more than a few pieces of string. Then they are surrounded by a lake and the time machine sinks leaving the three men skinny dipping. They are surrounded on all sides by other skinny dippers.<br>\r\n<br>\r\nPaul looks around, \"When are we?\"<br>\r\n<br>\r\nJason says, \"Do you really expect us to know the answer to that.\"</span></div></div>",
            "created":1457499600,
            "id":2115217,
            "title":"Woodstock 1969 AD"
        },
        "143112":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Ben and Jason become seperated from Paul and the time machine",
                "Ben, Jason and Paul meet some soldiers",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As Ben and Jason change, they hear voices over the radio. In a monotone voice expressing absolutely no emotion, one voice says, \"Ralston is crashing a time machine again.\"<br>\r\n<br>\r\nAnother monotone voice expressing no emotions says, \"Shouting is not necessary. You overreact.\"<br>\r\n<br>\r\nPaul says, \"Don't mind those two. They come from a time in history when humans were so adapted to computers that they started acting like computers. They are like the Borg.\"<br>\r\n<br>\r\nIn a monotone voice expressing no emotion, \"We are nothing like the Borg. Six of Eleven told a joke three months ago. Tell them.\"<br>\r\n<br>\r\nIn a monotone voice expressing no emotion, Six says, \"Yes Four, I asked what do you get when you cross hydrogen and oxygen?\"<br>\r\n<br>\r\nIn a monotone voice expressing no emotion, Four says, \"Hydrogen Per Oxide. Ha. Ha. Ha.\"<br>\r\n<br>\r\nPaul says, \"I take it back. They're more like the Coneheads from Saturday Night Live. Anyway, where are we headed.\"<br>\r\n<br>\r\nFour says, \"Trajectory indicates Vietnam 1965. Rescue units are on the way but a temporal storm has come up which will delay arrival. You may have to wait a few months.\"<br>\r\n<br>\r\nSure enough, as soon as Ben and Jason have their morphing suits on, the suits change to look like army fatigues with a rank of private. Then they find themselves surrounded by jungle. Paul activates a cloaking device to disguise the time machine.<br>\r\n<br>\r\nPaul says, \"Well we're stuck here for a month at least. What should we do?\"</span></div></div>",
            "created":1457499600,
            "id":2115158,
            "title":"Vietnam 1965 AD"
        },
        "143113":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Brisbane, Australia 1915 AD",
                "Philadelphia 1884 AD",
                "San Antonio, Texas 1868 AD"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last of the recent past options</span></div></span></div>",
            "created":1456722000,
            "id":2111354,
            "title":"More options"
        },
        "1431132":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "They enroll at the Pennsylvania Academy of Fine Arts",
                "They head to the city looking fot work",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As soon as Ben and Jason put on their morph suits, the suits turn into old fashioned suits complete with vest and jacket. Ben gets a derby hat. Jason gets a straw hat like college students wore. Paul gets a full blown top hat and cane. All three of them are dressed in dark grey like charcoal.<br>\r\n<br>\r\nPaul consults his gauges. \"Well, we didn't travel far, just a little more than one century. On top of that, we're still in the U.S., Philadelphia to be exact.\"<br>\r\n<br>\r\nJason complains, \"So formal. I'm sure this jacket is wool. It's itchy.\"<br>\r\n<br>\r\nPaul says, \"It's autumn in Philadelphia. You'll appreciate the warmth when we get exposed to the weather.\"<br>\r\n<br>\r\nJust then, they are surrounded by a small river and the time machine sinks. Their heavy wool clothing immediately soaks up the cold water and they start to drown. The river is shallow so they hit bottom quickly but they struggle getting their heads above water. Paul immediately removes his shoes, vest, jacket, shirt and trousers which allows him to swim to help the boys remove theirs. It's still a struggle as the boys are nearly in a panic.  They thrash but Paul manages to get their heavy clothes off so the boys can tread water.<br>\r\n<br>\r\nBen says, \"I'm not sure I appreciate the formal clothing.\"<br>\r\n<br>\r\nThey see several men on the shore. It looks like a collection of college students with a few professors. Some of them strip off and dive in but while Paul, Ben and Jason kept their longjohns on, these swimmers stripped down to nothing. They come out to help the time travellers to shore.<br>\r\n<br>\r\nOn the shore, they immediately start a campfire and finish stripping the time travellers. Ben resists being stripped but one of them says, \"Are you kidding me? You'll catch your death of cold sitting around in wet clothes.\" They don't give Ben a choice and he sits there by the campfire curled up and covering his genitals.<br>\r\n<br>\r\nJason soon realizes that it is warmer without his clothes. In fact, it's down right hot with the sun beating down on them. He still wonders why they are dressed so formally on such a hot day but as if on cue, most of them remove their jackets and dress down.<br>\r\n<br>\r\n\"So what kind of boat was that. I barely saw it before it sank but it sure didn't look like no boat.\"<br>\r\n<br>\r\nPaul says, \"Uh, it wasn't a boat. I was inventing something and it got away from me. We chased it to keep it out of the river but we weren't fast enough.\"<br>\r\n<br>\r\n\"Was it for those new horseless carriages? Those things are death traps.\"<br>\r\n<br>\r\n\"Uh, yea. It was a part for an automobile.\"<br>\r\n<br>\r\n\"Well my name is J Wallace and this is Thomas Eakins. We're from the Pennsylvania Academy of Fine Arts. You're lucky we happened to be out looking for things to draw.\"<br>\r\n<br>\r\n\"My name is Paul Ralston.\"<br>\r\n<br>\r\n\"Jason Fletcher.\"<br>\r\n<br>\r\n\"Ben Stone.\"<br>\r\n<br>\r\nOne of the students teases, \"Ben, are you sure you're a man? You're acting like a shy violet. Sit up.\"<br>\r\n<br>\r\nMr. Eakins says, \"That's enough. Maybe he's embarrassed by a deformity. We've drawn people with deformities before. You don't have to be embarrassed.\"<br>\r\n<br>\r\nThe group moves on but not too far. Several of them strip off for a dunk in the cooling river. Some of them start posing so the others can draw.<br>\r\n<br>\r\nPaul leans over to his companions and whispers, \"We may be here a while. You boys might want to think about enrolling in school. This is a great opportunity to expand your education.\"<br>\r\n<br>\r\n\"Hey, I found something.\" One of the skinny dippers finds Paul's clothes. He brings them to shore.<br>\r\n<br>\r\nThe one that teased Ben previously says, \"A top hat and a cane. I take it back. You're not a shy violet. You're one of those rich old money people. You live in one of those large houses that is just a facade. Everything you do is a facade because you can't handle the fact that underneath it all, your a human being like all the rest of us.\"</span></div></div>",
            "created":1457672400,
            "id":2116006,
            "title":"Philadelphia 1884 AD"
        },
        "14312":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Hannibal, Missouri 1840 AD",
                "France 1540 AD",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose a time and place before 1850 AD</span></div></span></div>",
            "created":1456722000,
            "id":2111356,
            "title":"Far past"
        },
        "143122":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "They meet a lady fair",
                "They are mistaken for noblemen",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As Ben and Jason change into morph suits, Paul says, \"Jamn, the radio is out. I can't call for help.\"<br>\r\n<br>\r\nThen the suits start to change. It feels weird as the cloth shifts about. It also tightens. The shirt part shrinks exposing more and more of the boy's bellies. The waistline of the pants rises to keep up with the shirt but it stretches thinner and tighter until it is even more skin-tight than spandex. They feel cloth slip in between their butt cheeks and their genitals are wrapped in a seperate pouch. The cloth becomes very colorful. Jason's tights are green and orange stripes. Ben's tights are red and baby-blue stripes.<br>\r\n<br>\r\nThey look over at Paul. His tights are bright yellow and black like a bumblebee.  He is bent over which spreads his ass cheeks wide and if it isn't for an extremely thin covering of cloth, the boys would be able to see Paul's anus. \"Eww.\" The boys look away.<br>\r\n<br>\r\nPaul stands up. \"What?\" The boys look back but they can see the shape of Paul's genitals so they look away again. Paul looks down at where the boys were looking. \"What? What's wrong? Oh, you're from the ultra-modest era that started in the nineteen-eighties. You' re not used to seeing naked men. I'd guess from the clothing that we've landed in Medieval Europe, perhaps France of the mid fifteen hundreds. They had trouble with veneral diseases such as syphilis which is why they wore such tight clothing.\"<br>\r\n<br>\r\nJason asks, \"You guess? How do the clothes know?\"<br>\r\n<br>\r\n\"The clothes or the ships computer scans the area ahead and mimics the appearance of whoever is nearest the place we will land.\"<br>\r\n<br>\r\nBen asks, \"Syphilis? Is the suit going to mimic syphilis?\"<br>\r\n<br>\r\n\"No for two reasons, first, the suits make slight adjustments so that you don't look identical to anyone there and second, the suits only mimic clothing and accesories. They can't alter your bodies or mimic anything that isn't clothing.\"<br>\r\n<br>\r\nThen they are surrounded by a forest.</span></div></div>",
            "created":1457499600,
            "id":2115206,
            "title":"France 1540 AD"
        },
        "143123":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Papua New Guinea 1540 AD",
                "Rome 120 AD",
                "Olympia 500 BC"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The last of the far past options</span></div></span></div>",
            "created":1456722000,
            "id":2111362,
            "title":"More options"
        },
        "144":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Artist Make Over",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106956,
            "title":"Art"
        },
        "1441":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jason talks to the audience",
                "Someone wants to purchase a menu item",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jason, Sarah, Rachel and Ben discuss the art project. Professor Ralston had assigned that at least one of them had to do a performance installation and the other three had to help. Jason volunteers. Sarah suggests a theme of gender inequality. She shows a video of \"Performance Artist For Sale\".<br>\r\n<br>\r\nSarah says, \"We could do something similar to this video but make the theme about what women are expected to put out.\"<br>\r\n<br>\r\nJason protests, \"No way. Some of that video borders on sadism.\"<br>\r\n<br>\r\nRachel speaks up, \"We don't have to do everything on that video. However, I see the potential in Sarah's idea. If we modify it to be a list of what women are expected to put out but our performance is about a man expected to put out instead, that would definitely make our project stand out and we can still set limits to keep it from going to far.\"<br>\r\n<br>\r\nJason says, \"We better set limits ahead of time and nothing better happen that I'm not okay with.\"<br>\r\n<br>\r\nSo they negotiate. The day of the performance, Jason takes his place in the corner of the museum where he had been assigned. Next to him is a rack of clothes and a table with various grooming products. Also nearby is a bed and a fridge full of beer. Jason wears a basic t-shirt and jeans outfit. Sarah is in charge of keeping the props orderly. Rachel is in charge of security making sure nothing gets out of hand. Ben is in charge of gathering the audience.<br>\r\n<br>\r\nBen has a podium with a menu for the audience. Members of the audience may pay for one of the items on the menu. The menu reads as follows:<br>\r\n<br>\r\nDirect artist to pose for a photo $1.00<br>\r\nKiss artist $1.00<br>\r\nRemove an article of clothing or jewelry from artist $1.00<br>\r\nDress artist in an article of clothing or jewelry of your choice $1.00<br>\r\nMake out with artist (non-sexual) $5.00<br>\r\nReceive back rub from artist $5.00<br>\r\nExpect artist to listen to your problems $5.00<br>\r\nTell artist to shut up $5.00<br>\r\nShave a region of the artist (such as a leg or an arm) $5.00<br>\r\nFondle artist $10.00<br>\r\nApply one kind of make up to artist $10.00<br>\r\nDemand a beer $10.00<br>\r\nAsk artist to tuck you in $10.00<br>\r\nSlow dance with artist $10.00<br>\r\nAsk artist to dance sexy or to do a striptease $20.00<br>\r\nAsk artist for a lap dance $50.00<br>\r\n<br>\r\n<span class=\"clred\">Additional rules for all chapters following this branch</span><br>\r\n<br>\r\n1. <span class=\"clred\">No individual spends more than $50.00.</span> That is, no one should change Jason's appearance AND get a lap dance. Whoever asks for a lap dance should be satisfied with however Jason happens to be dressed at the time.<br>\r\n<br>\r\n2. <span class=\"clred\">Do not alter or add to the menu listed here.</span> If you have a change you'd like to suggest, you can message me and I will consider it.</span></div></div>",
            "created":1455944400,
            "id":2106960,
            "title":"Artist Make Over"
        },
        "145":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "More branches by bejjinks",
                "option one",
                "option A"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455944400,
            "id":2106958,
            "title":"Something else"
        },
        "1451":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Musical Suits"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More branches by bejjinks</span></div></span></div>",
            "created":1455944400,
            "id":2106959,
            "title":"More branches by bejjinks"
        },
        "14511":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Mark wins the next suit",
                "Rick wins the next suit",
                "One of the neighbors wins the next suit"
            ],
            "content":"<div class=\"\"><div> <span>Eight friends (Ben, Jason, Mark, Rick, Rachel, Scotty, Catherine and Hilary) go on a spring break vacation but they don't go to any of the typical touristy places. Mark finds a place by a lake away from the crowds. There is a town on the other end of the lake they can drive to for supplies. The vacation house does have electricity and running water. It even has a heated pool so they don't have to swim in the chilly lake.<br>\r\n<br>\r\nFor entertainment, they can go water skiing or driving through the nearby dunes. Also, even though the crowds are small, there are enough other spring breakers around the lake for some night life.<br>\r\n<br>\r\nThe first night, Mark suggests a game of musical suits. They invite some of the neighbors as well. \"There are twelve guys here. We have eleven swim suits. We put the suits up as prizes in a series of eleven contests. The winner in each contest gets a swim suit. After the eleventh contest, whoever hasn't gotten a swim suit has to be naked and stay in the party until two a.m..\"<br>\r\n<br>\r\nRick protests, \"Not fair. Jason would probably strip naked anyway.\"<br>\r\n<br>\r\nMark says, \"I know. He's the one who didn't bring a suit to begin with. We'll have to come up with a different penalty for him to encourage him to win a suit.\"<br>\r\n<br>\r\nThe rules are decided and the first contest is a simple foot race. One of the neighbors wins the first swimsuit. But he wants to compete in the second contest despite his victory. Mark allows it.<br>\r\n<br>\r\nBen protests, \"If he wins two suits, more than one person will end up naked.\"<br>\r\n<br>\r\nMark says, \"The rules stand. Eleven contests and one suit awarded each contest. I leave the option up to you whether to compete or not but at the end of the eleven contests, whichever guys haven't won suits have to be naked.\"</span></div></div>",
            "created":1461894780,
            "id":2140591,
            "title":"Musical Suits"
        },
        "15":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "More branches by bejjinks",
                "Option one",
                "Option A",
                "Option",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will change the options below after someone writes a chapter</span></div></span></div>",
            "created":1455858000,
            "id":2106678,
            "title":"Other ENM"
        },
        "151":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Strip Game",
                "Magician needs a volunteer from the audience",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More branches by bejjinks</span></div></span></div>",
            "created":1455858000,
            "id":2106679,
            "title":"More branches by bejjinks"
        },
        "1511":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Strip Chess",
                "Strip Rugby",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>These games may be strip games but don't have to be strip games as long as they end with a naked guy. Also, when it comes time for forfeits, most forfeits should involve transformation such as shrinking or losing body parts. All forfeits should involve ENM however I do not want to see any forfeits involving diapers, bodily fluids, sex, bondage or torture. I don't mind if a little bodily fluid escapes during a forfeit but don't make a forfeit about bodily fluids.  <br>\r\n<br>\r\nIf someone decides to write a strip poker branch, that would be fine. I'd write it myself except that I don't feel confident in my knowledge of poker. I know the basic rules but don't know all the lingo or culture around the game. What I would like to see in a strip poker game is: Everyone starts with a few chips but can buy more chips with clothes or forfeits. There are no buy backs. Each deal requires an ante so that cowards who fold every hand slowly lose. The game should take time. I don't mind if you summarize the first few hands but especially when the underwear starts to come off, slow down and let the story build up some suspense. <span class=\"clred\">Chapters that race too quickly through the game will be deleted.</span><br>\r\n<br>\r\nWith all games, don't end the game simply at nudity. Leave the option open for at least a few forfeits or transformations.<br>\r\n<br>\r\nOn the other hand, don't make anything permanent. You can drag out forfeits and transformations indefinitely but don't <b>END</b> a character: no death, no brain wipe, no permanent immobility. Each character must be able to continue playing the game. <span class=\"clred\">I will delete any chapter that ends a character's ability to play.</span></span></div></div>",
            "created":1456981200,
            "id":2112632,
            "title":"Strip Game"
        },
        "15111":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Ben takes Jason's king",
                "Ben continues to lose pieces",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Ben, want to play some chess?\" Jason says.<br>\r\n<br>\r\n\"I thought you didn't want to play because you always lose.\"<br>\r\n<br>\r\n\"I know, I know. You've told me that I'm too protective of my pieces. While I pick off your pawns and bishops, you sneak up and put me in check-mate. Well not this time. This game is going to be different.\"<br>\r\n<br>\r\nJason pulls out a black and grey chessboard.  It and the pieces are very fancy like they are carved out of marble. The trim on the board shimmers like jade.<br>\r\n<br>\r\n\"I don't see how playing with a fancier game board will improve your game.\"<br>\r\n<br>\r\n\"Just watch.\"<br>\r\n<br>\r\nThey set up and start. Within the first three moves, Jason takes a pawn. Ben feels chills but ignores the feeling. Ben says, \"You're so predictable. You're doing the exact same thing you usually do.\"<br>\r\n<br>\r\n\"Just keep watching.\"<br>\r\n<br>\r\nJason took two more pawns. Ben says, \"I feel weird. My clothes seem too big suddenly.\"<br>\r\n<br>\r\nJason asks, \"Would you mind getting me a glass of water.\"<br>\r\n<br>\r\nBen stands up, \"Okay, I am definitely shorter. What's going on my friend.\"<br>\r\n<br>\r\n\"Everytime I take a piece, you lose height.\"<br>\r\n<br>\r\n\"Seriously? That's a good prank my friend but what if I quit playing right now?\"<br>\r\n<br>\r\n\"The only way you can get height back is to take pieces from me.\"<br>\r\n<br>\r\n\"Oh, I see your strategy now. Get me distracted going after your pieces so I can't focus on sneaking up on your king. So how much have I lost so far?\"<br>\r\n<br>\r\n\"Eighteen inches.\"<br>\r\n<br>\r\nBen makes his move taking a pawn from Jason. \"Ha, I can still beat you and gain my height back. How much have I gained?\"<br>\r\n<br>\r\n\"One inch. You gain height at one sixth the rate that you lose height.\"<br>\r\n<br>\r\nJason makes a move taking a bishop. Ben shrinks a lot. His pants fall off and his shirt touches the floor\"How much did I just lose?\"<br>\r\n<br>\r\n\"The peices are not equal. A bishop takes four times as much height as a pawn. You've now lost a total of forty-one inches.\"<br>\r\n<br>\r\n\"At this rate, I'll shrink out of existence.\"<br>\r\n<br>\r\n\"When you are the size of a chess piece, the game will do something other than take height.\"<br>\r\n<br>\r\nBen stands on his chair to make a move and takes a bishop gainig a whopping four inches but Jason takes a bishop leaving Ben at a mere eleven inches tall. Jason lifts Ben out of his clothes and sets him on the chessboard.  \"You look cute next to the queen without any clothes on.\"</span></div></div>",
            "created":1456981200,
            "id":2112748,
            "title":"Strip Chess"
        },
        "151111":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "The tournament",
                "Persuade Jason to change his mind",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ben lifts the queen that is almost as tall as him and moves it across the board. The queen is heavy, made out of solid marble. To Ben, it feels like he's lifting a recliner. He doesn't take any pieces.<br>\r\n<br>\r\nJason takes a pawn. Ben is down to five inches. Ben tries to move his rook but it's too heavy for him.<br>\r\n<br>\r\n\"Could you give me some help?\"<br>\r\n<br>\r\nJason lifts the rook. \"Where do you want it?\"<br>\r\n<br>\r\nBen moves to the square. \"Right here.\"<br>\r\n<br>\r\n\"You're going to checkmate me and end the game.\"<br>\r\n<br>\r\n\"And get all my height back.\"<br>\r\n<br>\r\nJason hesitates then places the rook, ending the game. \"You win again.\"<br>\r\n<br>\r\nBen gets six inches back ending the game at eleven inches tall. \"Hey, I won. Why am I still small?\"<br>\r\n<br>\r\n\"I told you, you only get height back if you take pieces from me. The king is only worth six inches.\"<br>\r\n<br>\r\n\"You've stacked the game against me. There's no way to win my height back.\"<br>\r\n<br>\r\n\"There is a way, if you go after my pieces without letting me take any of yours. Are you smart enough for the challenge?\"<br>\r\n<br>\r\n\"That is one hefty challenge. Even geniuses have to sacrifice pieces to win. You plan on keeping me tiny. Why?\"<br>\r\n<br>\r\n\"I don't plan on keeping you tiny but I did learn of a chess tournament coming up where my playing style is encouraged. They are the ones who gave me this chess set. They have different kinds of games all of which penalize one or both players that lose a piece. In their games, geniuses lose to keep from sacrificing pieces. I needed one more piece to complete my own chess set to be allowed in the tournament. So would you be my king?\"</span></div></div>",
            "created":1462721880,
            "id":2144826,
            "title":"Ben takes Jason's king"
        },
        "1512":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Further tricks on Jason",
                "Ben is brought into the act",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>It seems strange that the magician would charge so much since he is such an unknown but Ben and Jason have free tickets and the Great Ralstino advertises that his tricks are not the same old tricks everyone knows. Then, for his first trick, the Great Ralstino asks Jason to volunteer. Jason is skeptical but agrees.<br>\r\n<br>\r\nJason steps into a cabinet and the doors are shut. Jason looks for a trap door and wonders what kind of trick saws a real audience member in half. In the dim light, he sees the blade come through the cabinet. He raises his arms out of the way instinctively. He doesn't feel the blade cut him but it looks like the blade surrounds his middle keeping him from moving. Then he feels himself spin slowly. Then the doors open as the music plays tada.<br>\r\n<br>\r\nJason looks below the blade and sees what looks like his butt. It looks like his lower body has been turned backwards to his upper body but that's impossible. Jason moves his feet to test and the legs beneath the blade move. He wonders how his legs can be hidden and the magician's assistant's legs visible.<br>\r\n<br>\r\nThen the Great Ralstino announces that, in order to prove the genuineness of the magic, he will remove Jason's pants. Jason protests but then changes his mind. If the assistant is willing to lose his pants in front of an audience, why interfere?<br>\r\n<br>\r\nBut Jason feels his own pants removed and his underwear too. He looks down to see a bare backside but it can't be his, can it? The Great Ralstino asks him to lift his legs so the pants can be removed completely. Jason refuses and keeps both feet planted on the floor. The Great Ralstino unties his shoes and then forcibly lifts each foot in turn to strip him. Despite overwhelming proof, Jason cannot believe that's his butt. He offers no resistance as the Great Ralstino removes his shirt and finishes stripping him completely.<br>\r\n<br>\r\nThen the great Ralstino removes the blade and frees Jason to walk around. Jason walks awkwardly as he forward is now backward. He winds up walking in circles. He starts to realize it is his ass so he covers it unaware that his genitals are visible on the other side. Then he manages to turn around and face away from the audience.</span></div></div>",
            "created":1459952820,
            "id":2128537,
            "title":"Magician needs a volunteer from the audience"
        },
        "15122":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "The show continues",
                "Ben and Jason leave the stage",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The Great Ralstino asks Ben to volunteer and he comes up on stage. Jason wonders because Ben would never come on stage if there was a chance he'd wind up naked. Then again, Jason wonders why he hasn't run from the stage yet. Jason tells himself that he is waiting for the magician to restore him and that his desire to not be naked on a stage is merely a preference, not an aversion. This causes him to forget his wonderings.<br>\r\n<br>\r\nJason watches as Ben is stripped and placed into a weird guillotine only instead of his head, his arms and legs are placed to be cut off. Then the Great Ralstino reattaches Ben's arms and legs but to the wrong places. When Ben stands up, his head is between his legs and his arms hang from his hips.<br>\r\n<br>\r\nBen believes that this is some elaborate illusion and that he's still sitting in the audience, dreaming.<br>\r\n<br>\r\nThe Great Ralstino has Jason turn around so he and Ben can take a bow. Ben bows by lowering his ass to the audience while Jason bows by moving his head away from the audience but both boys wind up mooning the audience with their bows.</span></div></div>",
            "created":1462250700,
            "id":2142518,
            "title":"Ben is brought into the act"
        },
        "151222":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Option 1",
                "Option one",
                "Option A"
            ],
            "content":"<div class=\"\"><div> <span>They go back to their seats to sit, still naked. Ben sits with his legs up in the air. Jason is able to turn his chair bacwards so he can still watch the show. At the end of the show, all the volunteers return to the stage for another bow to receive whistles and applause. Then the volunteers go back stage so the Great Ralstino can return them to normal. He does so with much less showmanship this time, just touching each volunteer and instantly they are back to normal. They get dressed and leave.<br>\r\n<br>\r\nBen and Jason don't talk to each on their way home. They don't live together but they do live in the same apartment building. Then they receive messages from the Great Ralstino. Ben receives a message telling him that whenever he wants, he can turn Jason's legs around. Jason receives a message telling him that whenever he wants, he can turn Ben upside down. Both messages include that the Great Ralstino thinks they are lovers and would appreciate this addition to their love life.<br>\r\n<br>\r\nBen comes over immediately and both guys explain endlessly that neither one is gay.<br>\r\n<br>\r\nThen after the talking fades into an awkward silence, Ben asks, \"So do you want to test and see if I can spin your legs around?\"<br>\r\n<br>\r\nJason doesn't want to but the message said whenever Ben wanted to. So Jason strips and Ben turns his legs backwards. Ben just stands there amazed at what he sees. He does feel it to make sure it's real.<br>\r\n<br>\r\n(Remember the rules and don't take this to one of the forbidden fetishes.)</span></div></div>",
            "created":1462252320,
            "id":2142527,
            "title":"Ben and Jason leave the stage"
        },
        "1513":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Bet you can't hypnotize me"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More branches by bejjinks</span></div></span></div>",
            "created":1456981200,
            "id":2112517,
            "title":"More branches by bejjinks"
        },
        "15131":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Mark learns hypnosis",
                "Mark and Jason learn hypnosis",
                "They go to one of Ralstino's shows"
            ],
            "content":"<div class=\"\"><div> <span>They see a poster for a stage hypnotist advertising a more risque show.<br>\r\n<br>\r\nJason says, \"What a joke. Hypnotists always say that they can't make people do what they absolutely refuse to do. So basically hypnotists look for people of loose morals to hypnotize as in, they aren't actually hypnotizing anyone. They're just giving exhibitionists an excuse to expose themselves. Those people would gladly expose themselves anyway. All they need is a socially aproved opportunity.\"<br>\r\n<br>\r\nRick says, \"Just like you? Whenever we go to the lake, you go skinny dipping whether girls are present or not.\"<br>\r\n<br>\r\nJason says, \"Unless the law is there to prevent me. Alright, I confess I'm a little bit of an exhibitionist but I'm not a pervert about it. I just like to be naked.\"<br>\r\n<br>\r\nBen says, \"I was raised to believe that hypnotism is the same as demon possession.\"<br>\r\n<br>\r\nMark asks, \"Do you believe that?\"<br>\r\n<br>\r\n\"I don't know.\"<br>\r\n<br>\r\nMark says, \"Tell you what. Let's see if we can talk to this hypnotist and ask him some questions.\"<br>\r\n<br>\r\nBen asks, \"Are you sure that's such a good idea.\"<br>\r\n<br>\r\nJason says, \"I doubt they'll let us backstage.\"<br>\r\n<br>\r\nMark says, \"It never hurts to ask. Come on.\"<br>\r\n<br>\r\nThey follow Mark but Ben hangs back. There's surprisingly few people around. There isn't even a security guard. Mark knocks on the door.<br>\r\n<br>\r\nSomeone in the crowd says, \"Won't do you no good. The show was canceled. The Amazing Ralstino had an accident. He's in the hospital.\"<br>\r\n<br>\r\n\"Is he alright? \"<br>\r\n<br>\r\n\"Just a few broken bones and bruising but he hasn't been released from the hospital.\"<br>\r\n<br>\r\nMark asks, \"We'd like to visit with him. Do you know which hospital?\"<br>\r\n<br>\r\n\"I think it was Mercy but I don't know if they'll allow visitors.\"<br>\r\n<br>\r\nMark says, \"It never hurts to ask. Come on.\"<br>\r\n<br>\r\nThey make their way to the hospital and find it very easy to visit the Amazing Ralstino. He has his entire left leg plus his right ankle in a cast. His left arm is wrapped but not in a cast. His right arm is riddled with IVs and monitors. He wears a neck brace. He even has a canula in his nose but he's awake and peaceful.<br>\r\n<br>\r\n\"Mister Ralstino?\"<br>\r\n<br>\r\n\"Come in, come in. My family is far away and my tour staff is busy making financial arrangements. I'd be happy to have some visitors but don't call me Ralstino. My real name is Ralston but you can call me Paul.\"<br>\r\n<br>\r\n\"Are you okay?\"<br>\r\n<br>\r\n\"Well I've been better. The doctors are waiting for some tests to come back but if the tests turn out clear, I might be released tomorrow but they advised me to stay off my feet for a few weeks.\"<br>\r\n<br>\r\n\"What happened?\"<br>\r\n<br>\r\n\"Car accident. I think it was a drunk driver but I was too busy being put in an ambulance to know for sure. All I know is a redneck truck slammed into the driver's side where I was sitting. I was pinned in the wreckage and I'm sure the car is totalled. But you didn't come here to hear me complain. You have questions about hypnosis.\"<br>\r\n<br>\r\nBen asks, \"How did you know?\"<br>\r\n<br>\r\n\"I'm psychic.\"<br>\r\n<br>\r\nBen gives Paul a strange look.<br>\r\n<br>\r\n\"Naw, I'm kidding. I'm just very familiar with human nature. I have to be in this business.\"<br>\r\n<br>\r\nJason asks, \"So you can identify the exhibitionists who are eager to expose themselves to an audience.\"<br>\r\n<br>\r\n\"Just like you?\" Everyone laughs. \"You are partly right. Hypnosis is real but not as powerful as most people think it is. If you have a strong will, you can resist hypnosis. So I do have to look for volunteers that are less resistant. Plus my own sense of ethics holds me back like a power dampener preventing me from pushing the volunteers too hard.\"<br>\r\n<br>\r\nMark asks, \"So you wouldn't be able to hypnotize Ben here?\"<br>\r\n<br>\r\nPaul looks Ben up and down. \"Don't be so sure about that. I sense he might be more open than he seems.\"<br>\r\n<br>\r\n\"What? Oh no. You're not going to hypnotize me. I refuse.\"<br>\r\n<br>\r\n\"Alright. I won't hypnotize you but I probably could.\"<br>\r\n<br>\r\nMark asks, \"How about hypnotizing Jason here?\"<br>\r\n<br>\r\n\"He's too easy. No challenge. But, I do sense some limits, some things it would be hard to get him to do.\"<br>\r\n<br>\r\n\"That's right. I'd be afraid to volunteer for your show because of how risque it gets sometimes. I'd want to know where the boundaries are before I volunteer.\"<br>\r\n<br>\r\nBen asks, \"Isn't hypnosis the same as demon possession?\"<br>\r\n<br>\r\nPaul answers, \"Not at all. I have seen cases of demon possession so that is real as well. But demon possession is connected to sin. Only people who are drenched in sin become demon possessed and even then, it's not by means of hypnosis.\"<br>\r\n<br>\r\nThey continue to have a nice visit with the Amazing Ralstino.</span></div></div>",
            "created":1457672400,
            "id":2115968,
            "title":"Bet you can't hypnotize me"
        }
    },
    "info":{
        "author_id":"bejjinks",
        "author_name":"bejjinks",
        "brief_description":"So I can write what I want to write",
        "created":1455696120,
        "description":"<td align=\"left\" class=\"norm\">This interactive is primarily so that I can write the stories I want to write without having to adapt to someone elses fetishes. In particular, I find that too many interactives treat women like they are nothing but bodies for a man's pleasure. OR too many interactives spend way too much time talking about gross things such as farting.<br>\r\n<br>\r\nI don't want to limit myself or impose rules on myself but I can confidenty say that a common theme in my writing is ENM (Embarrassed Naked Males). I like it when men realize why it's so wrong to treat women so disrespectfully. Now I'm not into abuse so I don't go to the extremes of femdom or any other kind of dom, but I do like to see it when proud, arrogant men have a humbling experience.<br>\r\n<br>\r\nBen and Jason are two characters I have written about for years. They are my go-to characters for stories of this type. Their specific details may change from story to story but certain aspects remain the same. <span style=\"background-color:#88FF88;\">Jason</span> is always the more laid back, the more willing to try new things, and the more experienced of the two. <span style=\"background-color:#66EEFF;\">Ben</span> is always the more rules conscious, the least willing to try new things and the most naive of the two. There are a few other characters that may appear in these stories. Most frequently are <span style=\"background-color:#FF99FF;\">Rachel</span> (my ideal woman), <span style=\"background-color:#FFFF00;\">Sarah</span> (beautiful body but ugly soul), and <span style=\"background-color:#FFC43A;\">Paul</span> (the doctor/professor/expert).<br>\r\n<br>\r\nIf a chapter is marked reserved, it means that I intend to write that chapter. Otherwise, the chapter is open to first come, first serve. <span class=\"clred\">I do reserve the right to edit or delete at my discretion so try to write in a similar theme as I do.</span> If you are uncertain whether I will allow your idea, email or IM me about it first. I will give GP for chapters I like.<br>\r\n<br>\r\nAs far as other rules, I'm still figuring out which rules I want and which I don't care for. Here's the rules so far:<br>\r\n<br>\r\n1. <span class=\"clred\">Preserve consistency.</span> I don't want to see chapters that invalidate previous chapters. (Example: After a chapter in which Ben shrinks, I don't want to see a chapter in which he's back to normal with the introduction of a female character who grows followed by a chapter in which the female disappears and Ben turns into a dog.) Any chapters with abrupt or illogical changes will be deleted.<br>\r\n<br>\r\n2. There are many fetishes that appear along with ENM. I enjoy some of these related fetishes more than I enjoy others. The following lists these related fetishes on a scale from 0 to -10. 0 means that you should feel free to include them as long as they don't cause any story inconsistencies. -10 means please don't include them unless avoiding them would cause story inconsistencies. I may delete chapters if they have too much of the the fetishes I don't care for.<br>\r\n<br>\r\n<font class=\"size5\" style=\"\">0</font> shrink, detach, flat, hypno, tickle, inanimate (but only if it is partial or temporary), boy next door, athlete, military, twink, business suit, college, female-to-male<br>\r\n<br>\r\n<span class=\"cppink\"><font class=\"size5\" style=\"\">-5</font></span> male-to-female, anthro/furry, growth, bulging muscles, medical, domination, bondage, slave, <br>\r\n<br>\r\n<span class=\"clred\"><font class=\"size5\" style=\"\">-10</font></span> destruction, death, vore (I'll make an exception for non-destructive cock or mouth vore), mind erasing, torture, pain, spanking, diapers, anything to do with the anus, scat, farts, slob, weight gain, fanfiction, underage, <br>\r\n<br>\r\n3. <span class=\"clred\">If adding a choice chapter, make sure the choices are significant.</span> One thing I hate in interactives is trivial choices such as \"right or left\", \"blue or red\", or \"one minute or two minutes\". If there is no significant difference between the options, I will replace them. (I will add options anyway, if you cannot provide any. I will also rename options after chapters are written so the options will fit their chapters better.)<br>\r\n<br>\r\n4. <span class=\"clred\">Use good grammar.</span> I don't mind minor errors but when the writing is so bad that it is confusing, I may have to delete it. Please don't have more than one character speaking in the same paragraph. Each paragraph should focus on one character's actions. Avoid run on sentences. Most sentences should have a subject-verb structure.<br>\r\n<br>\r\n5. <span class=\"clred\">third person, present tense, limited omniscience.</span> Except for dialogue, avoid using past tense verbs, \"I\" and \"you\". Also avoid writing about what a character thinks or feels. A little is okay but don't overdo it.<br>\r\n<br>\r\n6. <span class=\"clred\">Regarding sexual orientation:</span> The characters may have different orientations depending on which branch you start with. Try to avoid declaring an orientation but once an orientation is declared, stick with it. That is, you should only declare a character's orientation when it matters.<br>\r\n<br>\r\n<span class=\"clred\">Avoid stereotypical thinking.</span> Just because someone acts like a hetero, doesn't mean he is one so leave such matters ambiguous until it actually makes a difference to the story. Likewise, allow characters to act gay without declaring that they are gay until it actually makes a difference to the story.<br>\r\n<br>\r\nI firmly believe that sexual orientation is far more dynamic than most people recognize. Not only does it fall on a continuum with no one being 100% hetero or 100% homo, but it's a multi dimensional continuum where people can be attracted to one, fall in love with another and lust after a third.<br>\r\n<br>\r\n7. <span class=\"clred\">A few branches have additional rules that only apply to the chapters of that branch.</span>  These rules are few but they will be enforced for those branches. You may set your own rules for branches you start but don't go overboard or make rules against the overall theme of this interactive. (Example: Don't make a rule limiting gender options to female only.)<br>\r\n<br>\r\n\"<a href=\"https://www.Writing.Com/main/view_item/item_id/2077669-Guide-to-Ben-and-Jason-interactive\" title='A guide for the interactive \"Ben and Jason: ENM Adventures\"' target=\"_top\">Guide to Ben and Jason interactive</a>\" <a title='A guide for the interactive \"Ben and Jason: ENM Adventures\"' href=\"https://www.Writing.Com/main/view_item/item_id/2077669-Guide-to-Ben-and-Jason-interactive\" target=\"_blank\"><img loading=\"lazy\" style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a>is a guide to inspire you to add chapters.<br>\r\n<br>\r\n<sub><font class=\"size1\" style=\"\">Ignore this reminder to myself: slaves in Egypt</font></sub></td>",
        "id":2075433,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/101713.jpg",
        "last_full_update":1552960440,
        "modified":1552960440,
        "pretty_title":"Ben and Jason: ENM Adventures"
    }
}