{
    "chapters":{
        "1":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "at school during a class",
                "at school in detention",
                "at a party",
                "in a cage",
                "in the girl's washroom at school"
            ],
            "content":"<div class=\"\"><div> <span>You wake up from what felt like the longest sleep of your life. You soon realize you're only one inch in size, \"how is this even possible?\" you say to yourself. However, you soon realize you have much bigger problems as looking around at your surroundings, you realize you are.....</span></div></div>",
            "created":1360818000,
            "id":1532301,
            "title":"Choose a situation"
        },
        "11":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Wait here",
                "Climb down to the floor",
                "Climb to the top"
            ],
            "content":"<div class=\"\"><div> <span>          You remember you were in the middle of a test in your 11th grade class.You're still in your chair so it seems you have two options: you can climb down off the chair and try getting help or you could climb to the top of the desk via the side and attempt to jump on the girl in front of you, both are pretty risky but sadly you don't have any other options decides waiting here?</span></div></div>",
            "created":1361077200,
            "id":1534128,
            "title":"Class is in Session"
        },
        "111":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Monica leaves you there for the rest of the day",
                "Monica wants to show her friends",
                "You try to get her attention"
            ],
            "content":"<div class=\"\"><div> <span>You decide to wait here until help arrives, but it seems it's quicker than you expected. A giant hand quickly scoops you up, you can just barley see through the small openings of the hand to see that it is Monica. This was bad news for you however, Monica was a very mean person, but before you could think she squished you right in her cleavage. You were unable to even move due to her large breasts and now tightened bra. Well it seemed you were trapped for now, absolutely no escape, with luck you will become Monica's pet.    </span></div></div>",
            "created":1369112400,
            "id":1594646,
            "title":"Wait here"
        },
        "1113":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You begin squirming around in hopes of getting her attention. But Monica just ignores you but not before pushing your tiny body even deeper into her lovely bosem. Now all you can see is Monica's skin and a tiny sliver of light.</span></div></span></div>",
            "created":1390453200,
            "id":1731750,
            "title":"Trying and Failing"
        },
        "112":{
            "author_id":"carlosthebat36",
            "author_name":"CarlostheBat",
            "choices":[
                "Pound her legs",
                "Climb higher",
                "Climb into her panties"
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to wait forever or risk missing the next desk, you slowly climb down your chair, and run to the desk to your right. You reach a pair of legs that are crossed. You figure that she might be good, and start climbing up her leg. You eventually reach the seat, and look at who you just climbed. It's Alison. She was one of your friends. She was quite a site, since she had D-sized breasts. She was wearing a white tank top, and a blue plaid button shirt, which was open halfway down, exposing her beautiful cleavage. You focused back on your mission. You could either get her attention at her lap, or you can climb higher, and get her attention then. Or you could have some fun here.</span></div></div>",
            "created":1365483600,
            "id":1568499,
            "title":"Alison"
        },
        "1122":{
            "author_id":"carlosthebat36",
            "author_name":"CarlostheBat",
            "choices":[
                "Climb in",
                "Continue scaling her"
            ],
            "content":"<div class=\"\"><div> <span>Wanting to get extra assurance, you chose to climb higher. Being spotted from on her lap wasn't the best choice, because she wouldn't see you as well, and would think you're a bug. You grabbed onto the fabric of her tank top, and started climbing. It took about 2 minutes to reach her breasts. This was really a sight, as her breasts were the size of mountains! But you had to get her attention so she could help you.</span></div></div>",
            "created":1365483600,
            "id":1568506,
            "title":"Mount Alison"
        },
        "11221":{
            "author_id":"carlosthebat36",
            "author_name":"CarlostheBat",
            "choices":[
                "She notices you",
                "She doesn't notice you"
            ],
            "content":"<div class=\"\"><div> <span>Hell, this is a once-in-a-lifetime opportunity. You'll never get a chance like this again! You pulled yourself over the top of her shirt, and fell into her cleavage. You kept falling until it got narrow. Alison's large tits were hugging you from both sides, like a warm blanket of flesh. You start fidgeting to get comfortable.</span></div></div>",
            "created":1365483600,
            "id":1568509,
            "title":"Heaven"
        },
        "112212":{
            "author_id":"carlosthebat36",
            "author_name":"CarlostheBat",
            "choices":[
                "She feels an itch in her cleavage",
                "She leaves the class after finishing her test"
            ],
            "content":"<div class=\"\"><div> <span>Alison's breasts were so big that she didn't even feel you squirming around in her cleavage. You finally found your comfort spot, and just sat there. Sitting in her chest, you could faintly hear and feel her heartbeat. You look up to see your unaware hostess. She was still working. You realize that your climb had exhausted you, and you were feeling extremely tired. So, you let the sound of Alison's heartbeat and breathing sooth and lull you, and you fell asleep.<br>\r\nMeanwhile, Alison was still doing her test when she noticed something odd. \"Huh? Where's he go?\" She wondered, noticing that you weren't in your seat. She looked around the classroom, but didn't see you. \"Hm, he must've went to use the bathroom.\" She thought. She continued working on her test, not noticing something sleeping in her cleavage.</span></div></div>",
            "created":1365483600,
            "id":1568512,
            "title":"She doesn't notice you"
        },
        "1122122":{
            "author_id":"thi5u5ernam3",
            "author_name":"Senculous",
            "choices":[
                "You could explore",
                "You should stay were you are"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly your ride began to shift. Alison, having finished her test, stood and walked to the front of the classroom. As she walked her breasts gently swayed, a rhythmic squeezing of her plush flesh around you. Outside of your cocoon you hear the teacher thank Alison and the definitive sound of the door close echo through the hall. As Alison walked through the empty hall you began to sink down into her warm softness. The subtle scent of her perfume floated around you, pressing against your skin with her breasts, the warmth pulling you further towards sleep. As exhaustion from the climb gained victory over your eyes, they closed and you began to sleep embraced by your best friend's cleavage. <br>\r\n-<br>\r\nEventually you awoke, the hot skin surrounding you still. Something in you said Alison had been sitting for a long time. With some moderate shifting you were able to peer out from her tank top. In front of you was the back of a bus seat in it's badly maintained, public school glory. Alison was riding the bus home today. Luckily she was seated near the back, away from the other students. Shifting again and sliding across her vast cleavage you look up and see her eyes were closed. With earbuds secured, it seemed she had fallen asleep on the bus while listening to music. Chances of her noticing you were low. Taking the opportunity, you stare up at Alison's titanic face; her porcelain skin, plush, pink glossed lips glimmering in the late day sunlight. You hadn't really noticed the small nose ring she'd recently gotten, but it complimented her features well. Equally so, was her straight auburn hair. <br>\r\nLooking at your friend an unbridled lust began to fill your body. You wanted to get closer to her, to be closer to her<br>\r\nMaybe... </span></div></div>",
            "created":1469682000,
            "id":2187324,
            "title":"She leaves the class after finishing her test"
        },
        "1123":{
            "author_id":"thi5u5ernam3",
            "author_name":"Senculous",
            "choices":[
                "Enjoy the outside and wait to see what happens",
                "Love her NOW and love her deeply"
            ],
            "content":"<div class=\"\"><div> <span>Deciding to have a little fun while you can, you gently slide past the edge of her short shorts and into her panties. Despite having been good friends for several years, you did hold some attraction for her. As you gingerly slipped into her blue and unusually tight panties, you can't help but remember the first time you noticed how undeniably attractive your friend was. <br>\r\nYou were sitting alone on the hill behind your school following a particularly difficult day. Watching as the sun set into bursts of fiery orange and rages of red, you had chosen to simmer in your irritation at the school system and lose your thoughts to a cycle of ventilation and negativity when without warning you felt two soft orbs press against either side of your face. Looking up you saw the knowing smile of Alison and suddenly the sky didn't reverberate with such anger. Instead the reverberation was replaced with the beating of her heart against the base of your head, felt through her, even then, large breasts. She gave you a gentle squeeze and then sat down next to you. Together, you sat and calmly watched the sky. The circulation of negativity in your head having been replaced with a gentle stream of pointless, but happy thoughts. From that evening on, you'd looked upon your friend with an unrelenting attraction; her thin but comforting waist, large, round, and perky breasts, thick thighs leading to wide hips and round butt, soft and straight auburn hair catching the light. <br>\r\nNow here you stand, beholding your beautiful friends vagina before you. Its warmth radiating around you as if to invite you closer, to take you within. You gladly accept the invitation and allow the tightness of Alison's pastel blue panties to push you against her. The smell was sweet and natural, mingling with a cherry lotion she must have applied that morning. You attempt to slide deeper within her, but a sudden shift of her titanic thighs stop you. She may notice if continue to push forward. Should you yield and stay on the outside, against her lips? Or throw caution to the wind and dive within your friend? </span></div></div>",
            "created":1469509200,
            "id":2186174,
            "title":"Climb into her panties"
        },
        "113":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Stacy asks to go to the washroom",
                "You stay there for the rest of the day"
            ],
            "content":"<div class=\"\"><div> <span>          You decided to climb to the top. Upon reaching the top you see the girl in front of you is Stacy and her pants are open at the top revealing half of her butt. You then make a jump for Stacy's chair but after landing on the edge of her chair you accidentally slip and fall right into her butt crack. After sinking down into her butt you feel her pulling up her pants, so it seems you're trapped for the time being.</span></div></div>",
            "created":1361077200,
            "id":1534134,
            "title":"Trapped between the Cheeks"
        },
        "1131":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Stacy needs to crap",
                "Stacy just pees"
            ],
            "content":"<div class=\"\"><div> <span>Shortly after your imprisonment, Stacy asks and goes to the washroom. When she arrived at the toilet stall, she pulled down her pants and panties and stat on the toilet. You being so far deep into her ass, were stuck. You stay as compact as you can in order to stay in her butt and hopes she doesn't need to crap. </span></div></div>",
            "created":1369112400,
            "id":1594501,
            "title":"Off to the Washroom"
        },
        "11312":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Phys Ed",
                "Yoga"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You hear the sound of pee falling into the toilet and are relieved. Soon after Stacy returns to class, the bell rings. Stacy packs up her things and heads to.... </span></div></span></div>",
            "created":1369112400,
            "id":1594505,
            "title":"Where to Now?"
        },
        "113121":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Stacy enters the gymnasium, and heads the locker room to change. She striped off her pants and panties and you got a view of more than a couple naked girls. Stacy soon covered you back up when she put on her short shorts though, she also took of her shirt leaving her tank top. During class, Stacy did laps and you were bounced around as a result. After phys ed you were still in Stacy's now sweaty butt, and it seemed she was returning to the locker room for a quick shower.</span></div></div>",
            "created":1369285200,
            "id":1595923,
            "title":"Time for Some Laps"
        },
        "1131211":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Leave the shower room",
                "Get on a bar of soap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After Stacy undresses and goes into the shower, you slowly slide out of her butt. You then see about fifteen other naked girls in the shower, they all seem to be oblivious to you, so what do you do?</span></div></span></div>",
            "created":1369544400,
            "id":1597350,
            "title":"Shower Time"
        },
        "11312112":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "shows everyone",
                "keeps you a secret"
            ],
            "content":"<div class=\"\"><div> <span>You see a bar of soap nearby and decide to grab onto it. After you get a good grip on it, Felecia picks it up and begins rubbing her butt with it. You are rubbed against her in a variety of ways until she notices you. Felecia picks you of the bar of soap and....  </span></div></div>",
            "created":1369544400,
            "id":1597354,
            "title":"Get on a bar of soap"
        },
        "113122":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Get in Stacy's yoga pants",
                "Escape"
            ],
            "content":"<div class=\"\"><div> <span>After a very long walk, Stacy arrives at the school's workout room. Stacy proceeded to the locker room to change, after she pulled off her pants and panties, you saw about twenty naked girls getting changed. You also saw Stacy's yoga pants on floor, you could quickly climb down and jump in the yoga pants and stay with Stacy, or you could use this opportunity to escape.</span></div></div>",
            "created":1369198800,
            "id":1595277,
            "title":"A Chance to Leave the Cheeks?"
        },
        "1131221":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "went home",
                "went to a friend's house"
            ],
            "content":"<div class=\"\"><div> <span>          You quickly climbed down from Stacy's leg and hopped in Stacy's yoga pants just as she was about to grab the, luckily she didn't see you. Upon grabbing onto these pants, you were once again pushed up into Stacy's butt. After the class had began, you felt the pants slowly pushing you into Stacy's butt even more. You couldn't see anything due to the darkness, and all you could smell was the snatch of Stacy's butt. Soon you were pushed up so far, you couldn't even hear the girls on the outside talking. At this point you couldn't even breath due to the stench of crap, then the class was finally over, but that didn't mean you were free. The last few classes went on and still Stacy was totally oblivious to your presence, but when the day was over, she.... </span></div></div>",
            "created":1369198800,
            "id":1595281,
            "title":"Time for Some Stretches"
        },
        "11312212":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Violet",
                "Nicole"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What friend?</span></div></span></div>",
            "created":1369198800,
            "id":1595283,
            "title":"With Who?"
        },
        "113122121":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Yell to Stacy",
                "Attempt to climb out"
            ],
            "content":"<div class=\"\"><div> <span>After a long walk to Violet's house from Stacy's butt, Stacy asks Violet if she can go to the bathroom. Upon entering the bathroom, the stench of crap gets more and more smellier. You try all you can to get out, but you still won't budge, and soon you did come out but, with a ton of crap. Floating in the toilet water, you look up and see Stacy's butt looming over you on the toilet seat. But you still need to get out, what do you do? </span></div></div>",
            "created":1369198800,
            "id":1595382,
            "title":"Freedom"
        },
        "1131221212":{
            "choices":[
                "Stacy is looking in at you",
                "Stacy is still sitting on the toilet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As a swimmer your first instinct is to swim as fast as you can to the side of the toilet bowl. Once you reach it you start to climb out, lucky for you the toilet bowl is dry and you can climb. You look up to see that...</span></div></span></div>",
            "created":1375160400,
            "id":1637015,
            "title":"Attempt to climb out"
        },
        "11312212122":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Climb back in Stacy's butt.",
                "Stay here until Stacy moves."
            ],
            "content":"<div class=\"\"><div> <span>You climb and grab onto the toilet seat. But Stacy is still sitting down, and there doesn't seem to be any other way out. You could climb back into Stacy's butt crack and stay there for who knows how long, or you could just stay where you are until she moves, but of course that would mean you'd be on your own from then on.</span></div></div>",
            "created":1375160400,
            "id":1637265,
            "title":"All Butt One Problem"
        },
        "113122121222":{
            "choices":[
                "Stacy has left",
                "Stacy is looking right at you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide that the best option is to wait for Stacy to move her butt so you can escape. After waiting on the edge Stacy moves her butt and you quickly struggle up to the top and see that...</span></div></span></div>",
            "created":1375246800,
            "id":1637843,
            "title":"Stay here until Stacy moves."
        },
        "1131221212222":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "escape",
                "stay"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Stacy's in shock seeing how you're so tiny. After quickly pulls up her panties then pants, she runs out of the bathroom (assuming to tell Violet). However you are free for the moment. Do you try to escape now, or stay and wait for the girls?</span></div></span></div>",
            "created":1377666000,
            "id":1653213,
            "title":"First Impressions"
        },
        "11312212122222":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "She brings Violet",
                "She comes alone"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide that, upon examining the toilet bowl, it seems unlikely that you'd be able to just climb out. So you just wait for Stacy to return, and then maybe you'll make a run for it. When she does come back . . .</span></div></span></div>",
            "created":1389502800,
            "id":1726068,
            "title":"stay"
        },
        "113122121222221":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "Let's talk this over some snacks",
                "You're pretty cute at this size . . ."
            ],
            "content":"<div class=\"\"><div> <span>Stacy enters the bathroom with her good friend Violet, just as expected. When Stacy shows you to Violet, she shrieks with joy, hurting your sensitive ears. Stacy then picks you up and brings you into the living room. On the way there, you could have sworn you saw Violet lick her lips, but it doesn't concern you too much. When they finally sit down, they start to talk with you.<br>\r\n\"Wow, how the heck did this happen?\" Stacy asks in a booming voice.<br>\r\n\"I honestly have no idea,\" you respond. \"One second I was in class, the next . . .\"<br>\r\n\"How did you even get to my toilet?\"<br>\r\n\"Eh . . . Long story.\"<br>\r\n\"Alright, but now what do we do?\" Violet asks.<br>\r\n</span></div></div>",
            "created":1389502800,
            "id":1726072,
            "title":"She brings Violet"
        },
        "1131221212222211":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "You know where this is going . . .",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>You suddenly hear a growling sound. You look to see that it was just Violet's stomach, which she clenches and rubs.<br>\r\n\"You hear that? I dunno about you guys, but I haven't eaten since school ended.\"<br>\r\n\"Here, you keep an eye on him. I'll go fetch us some snacks.\"<br>\r\nStacy then drops you into Violet's hand. Her hand seems to be trembling quite a bit, making you lose your balance often. She then raises you up to her face.<br>\r\n\"I'm sorry! I don't know what's been up with me lately!\"<br>\r\n\"Oh, it's alright. Not that I'm used to it or anything.\" You laugh nervously as Violet opens her mouth and releases a large yawn. You can see all of her shiny white teeth, to her slimy tongue, all the way back to her uvula and throat. Her breath is actually very fresh, and is like a light breeze. The experience is strangely comforting.<br>\r\n\"Hey guys, I brought the snacks!\" Stacy walks in with a bag of chips and places it right underneath you.<br>\r\n\"Yummy!\" Violet exclaims as she grabs a chip and devours it.<br>\r\n\"Oops, I forgot the drinks!\" Stacy says before leaving to the kitchen.</span></div></div>",
            "created":1389502800,
            "id":1726078,
            "title":"Let's talk this over some snacks"
        },
        "11312212122222111":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You watch Violet eating the chips in a sort of trance. There's just something so peaceful about it. She picks up a chip and raises it to her face, sort of inspecting it. She then licks her lips and tosses it into her mouth. You watch her cheeks flex as she chews up the snack. When she is finally finished, she tilts her head back and swallows. She has a surprisingly large Adam's Apple, which bulges out and disappears in between her breasted, creating a wonderful gulping sound as it travels. But while you were transfixed upon the display, you suddenly realize that you are falling from Violet's hand and into the bag of chips! </span></div></div>",
            "created":1389502800,
            "id":1726082,
            "title":"The great fall"
        },
        "113122121222221111":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "Your prayers shall go unanswered",
                "Someone is listening!"
            ],
            "content":"<div class=\"\"><div> <span>You look around, horrified by your surroundings.You then hear Violet's stomach growl yet again, but this time, it sounds far more menacing and it actually shakes the bag. You call out at the top of your lungs, but it proves futile. The best you can do is pray that Violet noticed that you fell.</span></div></div>",
            "created":1389502800,
            "id":1726087,
            "title":"An Out of Hand Experience"
        },
        "1131221212222211111":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You look up desperately, but luck is not on your side as a hand reaches into the bag and grabs the chip you are standing on. You are raised up to Violet's face. Again, you try to catch her attention, but you fail. She then opens up her mouth and allows you to see the gateway to her throat yet again. As you peer into Violet's gaping maw, you actually feel fine, like you can do something for the greater good, in this case, providing extra nutrients to a beautiful girl. And finally, she drops you and the chip into her mouth.</span></div></div>",
            "created":1389502800,
            "id":1726090,
            "title":"Taken with a Bag of Chips"
        },
        "11312212122222111111":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "Grab Onto the Uvula and Hope for the Best"
            ],
            "content":"<div class=\"\"><div> <span>You land on Violet's tongue and topple off the chip, almost falling into her abysmal throat. You climb up and see her jaws close, turning the foreign land dark. Strangely, you can still see, which might be key to escaping the slimy prison. Violet then begins to chew her food, unwittingly tossing you around in her cavernous mouth. You narrowly dodge getting chomped several times, but you manage to get soaked in Violet's saliva. Then you feel her tilting her head back, preparing to swallow. You grasp onto her tongue and look back to se the chip's remains disappear with a loud gulp. But then, you begin to slip in the wet mouth. Your only choice is to grab onto the uvula and hope for the best.</span></div></div>",
            "created":1389502800,
            "id":1726095,
            "title":"The Mouth"
        },
        "113122121222221111111":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You sigh with relief. Maybe now Violet will notice that you're about to be eaten. But, of course, you see the light of the living room shine into Violet's desolate mouth, revealing a cup filled with coffee. The brown fluid swirls around her mouth as she swishes it, shaking you free of the uvula and into the warm liquid. The coffee feels more like a hot tub than lava, thankfully, but that doesn't save you from Violet's hunger. She tilts her head back again, allowing you to see into her stomach, and swallows you and the coffee in one mighty gulp. You try to choke her by grabbing her throat, but she just coughs a little and swallows you again. Finally, you reach your ultimate destination: Violet's stomach.<br>\r\n<br>\r\nMeanwhile . . .<br>\r\n<br>\r\n\"BURP! Wow, Stacy, you really do make the best coffee!\"<br>\r\n\"Thanks! But what happened to that little man?\"<br>\r\n\". . . Uh-oh . . .\"</span></div></div>",
            "created":1389502800,
            "id":1726097,
            "title":"Grab Onto the Uvula and Hope for the Best"
        },
        "1131221212222211111111":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "Try to catch Violet's attention",
                "Explore Violet's stomach"
            ],
            "content":"<div class=\"\"><div> <span>In mere seconds, you are squeezed through Violet's throat and into her massive stomach. The strange land is filled with a disgusting combination of coffee, half-digested chips, and stomach acids. Fortunately, the digestive fluids are not strong enough to break you down. But if you wait for too long, they probably will, and now that you think of it, you'd rather not like to die such an insignificant death. So, you start to climb Violet's stomach walls, when suddenly they start to vibrate and create a gurgling sound. Then you hear Violet generate a mighty belch that knocks you back into the liquid of her stomach. You panic a bit, when you hear Violet's voice booming up above you.<br>\r\n\"Wow, Stacy, you really do make the best coffee!\"<br>\r\nYou then hear the voice of Stacy responding.<br>\r\n\"Thanks! But what happened to that little man?\"<br>\r\n\". . . Uh-oh . . .\"<br>\r\nYou are relieved! They've finally noticed that you are gone! But just then, Violet's stomach shakes violently, alerting you that she has gotten up to start looking for you. So, apparently, they didn't notice that you were eaten by a teenage girl. What do you do now?</span></div></div>",
            "created":1389502800,
            "id":1726350,
            "title":"Belly of the Beast"
        },
        "11312212122222111111111":{
            "author_id":"rickybj",
            "author_name":"WhoKnows",
            "choices":[
                "Let's Keep it Rolling"
            ],
            "content":"<div class=\"\"><div> <span>You begin pounding on the slimy walls of Violet's stomach, hoping that she would feel you struggling.<br>\r\n<br>\r\nMeanwhile . . .<br>\r\n<br>\r\n\"Come on, Violet! You had one job!\"<br>\r\n\"I'm sorry, you know how my hands tremble!\"<br>\r\n\"Well, now he's missing, and we've got to find him.\"<br>\r\nViolet and Stacy got down on their knee to start looking for their tiny guest. Suddenly, Violet starts giggling.<br>\r\n\"What's so funny?\"<br>\r\n\"Hehehehe! What did you put in that coffee?!\"<br>\r\n\"Just the normal stuff, but what's going on in that belly of yours?\"<br>\r\n\"I don't know, it's like little fists are pounding on my stomach walls!\" Violet says while she rubs her belly with satisfaction.<br>\r\n\"Wait a second, tiny fists? What if the little man is in there!?\" <br>\r\nStacy then puts her ear up to Violet's belly, and sure enough, she feels slight tremors with a rhythm like someone punching a wall.<br>\r\n\"Oh my God! Violet, you ate him!\"<br>\r\n<br>\r\nEarlier inside Violet's stomach . . .<br>\r\n<br>\r\nYou continue hitting the lining, when you are jolted back by a sudden movement, followed by laughter. It's working! You think to yourself as you return to return to the position. The movement begins to die down when you feel Violet rubbing her stomach. But you don't stop, when you feel Stacy press her head against Violet's belly. Then you remember that you still have your phone, and you even have Violet's number! With much care, you take out the device to call the giantess who has you captive.</span></div></div>",
            "created":1389502800,
            "id":1726720,
            "title":"Try to catch Violet's attention"
        },
        "113122121222221111111111":{
            "author_id":"thi5u5ernam3",
            "author_name":"Senculous",
            "choices":[
                "Wait to come out the bacl",
                "Throw me up!"
            ],
            "content":"<div class=\"\"><div> <span>You take out your cellphone and quickky find Violet's number in your contact list. You press call and wait...<br>\r\nViolet-<br>\r\n\"Hang on, I'm getting a call. Hello?\"<br>\r\n\"Violet!\"<br>\r\n\"You're ok! Where are you?\"<br>\r\n\"In you!\"<br>\r\n\"Whoa, phrasing.\"<br>\r\n\" Violet, you ate me.\" You pound on her stomach again.<br>\r\n\"Oh my god. Ok. We'll figure this out. Stacy, what should I do?\"<br>\r\nStacy thinks a moment, \"you could always wait for him to come out the other side. Or throw him up.\"<br>\r\n\"What do you want? Do you want to wait? Oh god, I swear I will make this up to you when you get out of me!\"</span></div></div>",
            "created":1509365400,
            "id":2408861,
            "title":"Let's Keep it Rolling"
        },
        "11312212122222112":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Stacy keeps you",
                "Violet keeps you"
            ],
            "content":"<div class=\"\"><div> <span>After Stacy left the room, Violet put down the bag of chips, and placed you in between her titanic breasts. \"Ah, you look so adorable there\" Violet said looking down at her tiny captive \"Stacy, come here, look at our little friend\", Stacy walked in and smiled \"okay, now you're just showing off\" \"hey, it's better than between your butt cheeks\". The two girls laughed at the thought of you being between Stacy's butt cheeks \"okay, we have to decided what to do with him\" Stacy insisted \"you're right, we can't have you farting on him , he's delicate\" \"I wouldn't do that\" Stacy said, blushing. \"Shouldn't I have a say in this\" you asked, but the girls didn't hear you and kept talking. \"I was thinking, maybe we could keep him as a pet, get a cute little cage for him, and bath him-\" \"wait, what the hell do we feed him\" Stacy interrupted, the two girls bursted out in laughter \"oh my gosh, I never even thought of that.\" Violet said \"I guess we could feed him leftover scraps\" \"sounds good, better than your crap\" \"would you stop with that joke\" Stacy said angerly. After minutes of arguing and debating, the two girls decided....</span></div></div>",
            "created":1394600400,
            "id":1759550,
            "title":"Something else?"
        },
        "113122121222221121":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Escape",
                "Stay put"
            ],
            "content":"<div class=\"\"><div> <span>The two decided that Stacy would 'take care' of you. \"Okay, give him here\" Stacy said as Violet removed you from her cleavage. You were put in Stacy's hand \"now don't go putting him in you butt now\" Violet said jokingly \"would you quit it\" Stacy said \"okay okay, just trying to have some fun\". Stacy looked at the clock \"oh damn, look at the time, I've got to be back before supper\", Stacy quickly shoved you down her cleavage and got her stuff together \"bye, Violet\" \"seeya tomorrow, Stace\" and Stacy went out the front door.<br>\r\n<br>\r\nYou could tell Stacy was in a hurry because her breasts were bouncing very frequently causing you to bounce with them. When Stacy arrived home, she went straight to her room to change. Stacy picked you out of her cleavage and laid you on her bed, and began to undress \"don't you care that I can see you\" you said, Stacy laughed \"hardly, not like you will be able to tell anyone\". Stacy changed into short shorts and a tank top. She then got a piece of tap from her desk and stuck you beneith her bed \"hey, what gives\" you protest \"mommy needs you to be a good boy, while she goes downstairs to eat, so don't go trying to escape now\". And with that Stacy closed the door behind her and went downstairs.</span></div></div>",
            "created":1394686800,
            "id":1759625,
            "title":"Stacy keeps you"
        },
        "1131221212222211211":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "escape... again",
                "yell to Stacy"
            ],
            "content":"<div class=\"\"><div> <span>You decided you have had enough of this whole 'being a pet' thing. You unstick yourself from the bed and walk towards the door. Thankfully the gap underneath the door was large enough for you to crawl under so you did just that. However your luck ended right there when you saw Stacy right in front of you \"and where do you think you're going, little man?\" Stacy said kneeling down to pick you up \"you can't do this, I'm a human be-\" and Stacy cut you off by enclosing you in her hands \"you're gonna wish you haven't done this\". Stacy carried you back to her room and placed you in her cleavage, and picked up her phone. \"Hey, Violet. It's me, Stacy...... Yeah, he tried to run away or something, I don't know what he was trying to accomplish....... No I have him in my bra right now........ I don't know, he needs to be punished somehow\" as Stacy phone conversation went on, you found yourself sinking into Stacy's cleavage faster and faster until you fell through and feel onto her lap. Stacy was oblivious to whole thing so you may still be able to escape, or you could use this to get in Stacy's good side.</span></div></div>",
            "created":1394686800,
            "id":1759859,
            "title":"Bad Idea"
        },
        "11312212122222112112":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "punish you",
                "care for you"
            ],
            "content":"<div class=\"\"><div> <span>You decided that it's probably best to get on Stacy's good side so you scream at the top of your lungs in hopes of getting her attention. <br>\r\n<br>\r\n\"Stacy, down here\" you yell. <br>\r\n<br>\r\nAt she didn't notice you but that didn't stop you. Eventually Stacy hung up the phone and noticed an ich in her thigh area. She looked down and saw you yelling to her. <br>\r\n<br>\r\n\"ah, aren't you sweet\" she said while picking you out from her thighs. <br>\r\n<br>\r\nStacy the dropped you back in her cleavage and went back to her room to.... </span></div></div>",
            "created":1398315600,
            "id":1785803,
            "title":"yell to Stacy"
        },
        "113122121222221121122":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Hours later... "
            ],
            "content":"<div class=\"\"><div> <span>Stacy picked you out of her cleavage like an object and placed you on her lap while stretched out on her bed. <br>\r\n<br>\r\n\"Why did you yell to me just then, you could have escaped\" Stacy said looking down at you. <br>\r\n<br>\r\n\"Well, the truth is... I love you\" you admitted \"I never want to leave your side\" <br>\r\n<br>\r\nStacy blushed \"oh, don't worry, little guy. I love you too\" <br>\r\n<br>\r\nStacy then lowered you into her panties, the front side this time. <br>\r\n<br>\r\n\"There if you must stay with me forever, then you can stay here\" Stacy said while get up. <br>\r\n<br>\r\nIt felt weird. It was dark, smelt like pee, and was very tight. But for some reason you enjoyed it. When Stacy started walking, you pushed around in a different place of her panties, but unharmed.</span></div></div>",
            "created":1398574800,
            "id":1787742,
            "title":"care for you"
        },
        "1131221212222211211221":{
            "choices":[
                "Escape ",
                "Stay as Stacy's lover boy"
            ],
            "content":"<div class=\"\"><div> <span>The next time Stacy opened panties was when she was getting into bed. <br>\r\n<br>\r\n\"Hello my little darling\" she said with her panties opened just barely enough to see the bottom of Stacy's lips. <br>\r\n<br>\r\n\"Hi, beautiful\" you replied <br>\r\n<br>\r\nStacy then plucked you out of her smelly panties and onto her chest, just bellow her chin. <br>\r\n<br>\r\n\"I was thinking of letting you sleep with me tonight\" Stacy said <br>\r\n<br>\r\n\"That would be great\"<br>\r\n<br>\r\n\"But I don't want you escaping or anything\"<br>\r\n<br>\r\n\"I'd never even think of that\" you said<br>\r\n<br>\r\nAnd so Stacy allowed you to sleep with her that night.  You slept next to her face , on what was to you a giant pillow. Now would be an ideal time to escape, or you could remain as Stacy's lover. </span></div></div>",
            "created":1398574800,
            "id":1787860,
            "title":"Hours later... "
        },
        "11312212122222112112212":{
            "content":"<div class=\"\"><div> <span>And so you never left the side of your giantess mistress again. Stacy never told anyone about you ever. She told Violet she accidentally stepped on you. You never stopped loving Stacy no matter how she treated you. <br>\r\n<br>\r\nBecause Stacy never talked to anyone after you admitted your love to her, she developed an anti-social disorder. Stacy never let go of you and this resulted in countless nights of her just tormenting you in ways you didn't even know was possible. But no matter what, you always loved her. </span></div></div>",
            "created":1398574800,
            "id":1787867,
            "title":"Stay as Stacy's lover boy"
        },
        "1131222":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Beth",
                "Sabrina"
            ],
            "content":"<div class=\"\"><div> <span>You quickly crawl out of Stacy's panties and run under a near by door. After taking a moment to catch a breath, you soon find your self in the shower room along with about a half a dozen naked girls in the middle of cleaning themselves. Upon looking in front of you, you see that someone is neiling down to pick you up. But who is it?</span></div></div>",
            "created":1390453200,
            "id":1731752,
            "title":"Escaping from Paradise"
        },
        "11312221":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "appease to her",
                "defy her"
            ],
            "content":"<div class=\"\"><div> <span>Beth pick you up and holds you close to her chest \"why, aren't you just a cutie\" she says under her breath. Judging by her smell, Beth just took a shower and is now getting ready to dry off. Beth then puts you in her purse and continues to get changed. You're surrounded by beauty products, a cell phone, package of mints, typical things you'd expect to find in a teenage girl's purse. After what seems like a ten minutes, Beth finishes getting ready and talking to her friends, and picks up her purse. You feel every motion she makes with it as she leaves the locker rooms.<br>\r\n<br>\r\nBeth makes her way to the washroom and takes you out of her purse. \"Oh, you are just so cute, how would you like to come home with me\" Beth teases \"actually I-\" you say \"you can be my little itty bitty pet\" Beth interrupted \"well, I was hoping-\" \" you just wait until we get home, I'm gonna have so much fun with you and-\" \"No, you listen to me, bitch\" you yell. Beth's smile turns to a frown \"suddenly you aren't so cute anymore, in fact I think you would make a great slave\" Beth holds you above her colossal cleavage and says \"any last words?\"</span></div></div>",
            "created":1394600400,
            "id":1759482,
            "title":"Beth"
        },
        "113122211":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Fast forward to Beth's house"
            ],
            "content":"<div class=\"\"><div> <span>\"Please don't hurt me, I'll do anything you want\" you plead \"now that's the kind of attitude I like to see, and I can't wait to see more of it later\" Beth said before dropping you into her cleavage. It was very squishy and surprisenly secure. The strong smell of perfume was hard on the nose but it was better than Stacy's butt. As Beth began to mover you felt her breasts move as well in a bouncing pattern. <br>\r\n<br>\r\nBeth was on her way home, but she met up with a frienf , it was Paige. \"You going home?\" Paige asked \"yep, but not empty handed\" Beth said confidently \"what do you mean?\" \"What would you do if I told you I had a one inch man with me right now?\" \"I'd probably ask to see him\". Beth removed you from her cleavage and showed you to Paige \"oh my gosh, he is just the cutest thing, is her yours\" \"he is now\" \"you mean you stole him, isn't that kidnapping?\" \"Well yes, but what is he gonna do?\" Beth said and the two girls started laughing \"you're right, I guess he is yours now\" Paige said \"we'll talk about him more at my house\" Beth said. Beth used one hand to open her cleavage and the other to squish you in between them and let go, squishing you even more, letting no chance of escape.</span></div></div>",
            "created":1394686800,
            "id":1759629,
            "title":"appease to her"
        },
        "1131222111":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "keep you as a slave",
                "keep you as a boyfriend"
            ],
            "content":"<div class=\"\"><div> <span>The two girls walked into Beth's house and went upstairs to Beth's room. You could tell by the girls attitude that their parents weren't home. \"So what should we do with him?\" Beth asks \"where did you find him\" \"in the shower room while I was getting changed\" Beth said while she took you out and placed you on her bed, in her lap. \"I was thinking of keeping him as a pet or maybe even a slave\" Beth's words made you feel uneasy. But in the end Beth decided to...</span></div></div>",
            "created":1394686800,
            "id":1759866,
            "title":"Fast forward to Beth's house"
        },
        "11312221112":{
            "author_id":"thi5u5ernam3",
            "author_name":"Senculous",
            "choices":[
                "Yes",
                "I dunno..."
            ],
            "content":"<div class=\"\"><div> <span>\"Y'know...I think I know just what I'll keep him as.\" Beth said, more to you than to Paige.<br>\r\n\"What?\" Paige asked. <br>\r\n\"Oh, nothing. Hey, How about we hang out later? I want to spend sometime with my little cutie.\"<br>\r\n\"But,\"<br>\r\n\"We'll hang out later.\" the statement resonated as a command.  <br>\r\n\"Ok, fine. See ya later.\" With that the second giant left, leaving you with your first captor.<br>\r\n\"So, did you want to know what I decided to keep you as?\" Beth asked mischievously.<br>\r\n\"What?\" <br>\r\n\"You're going to be my boyfriend.\"<br>\r\n\"Wait, I'm what?\"<br>\r\n\"Relationships nowadays are so complicated. I think one with you will be simpler. I wont be a mean girlfriend, I swear. Here,\" Without another word Beth spread her massive breasts apart and placed you between them. She then began to massage you with her mammaries, the soft flesh both holding you safely and sensually. <br>\r\n\"So, How about it? Wanna be my tiny boyfriend?\"</span></div></div>",
            "created":1492232400,
            "id":2305402,
            "title":"keep you as a boyfriend"
        },
        "1132":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "staying for detention",
                "going home",
                "going to a lingerie store"
            ],
            "content":"<div class=\"\"><div> <span>          You end up staying there for the rest of the day, although it is great to be in the butt of a girl such as Stacy, the smell is almost unbearable. And with every step Stacy took, you were pushed into a different position. This went on for about the whole school day, but you could then hear Stacy talking to her friends and you soon learn she is....</span></div></div>",
            "created":1363064400,
            "id":1548931,
            "title":"Your Temporary Home"
        },
        "11321":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "still in her butt",
                "somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          Well seems you'll be staying between those cheeks for a while longer yet. So you decide to go to sleep as Stacy sits down, but when you wake up after about three hours, you are.....</span></div></span></div>",
            "created":1363237200,
            "id":1550220,
            "title":"Best Nap of Your Life"
        },
        "11323":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Yes, you are complety visable",
                "No, you are well hidden"
            ],
            "content":"<div class=\"\"><div> <span>          After Stacy enters her car and sits down, you feel a breeze coming from her butt and you then realize she just farted right on top of you. You could not bear the stench and try to climb out of her panties but it's no use, you're trapped and you will have to put up with these things for the time being. Stacy soon arrives at the lingerie store and meets up with some friends, after about a half hour, Stacy finds some new bras and panties to try on. But as she enters the changing rooms, she feels a slight itch on her butt, so she begins to scratch it and the more she did so, the farther you were pushed into her butt. It did not take long before you were squished in so much Stacy had no idea you were there, this may seem unfortunate but when she went to try on panties, you did not fall out, but does she see you?</span></div></div>",
            "created":1363237200,
            "id":1549774,
            "title":"The Depper You Go"
        },
        "12":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Attempt to climb Erica's thigh",
                "Wait",
                "Climb inside Erica's shorts",
                "Pound on Erica's thighs to get her attention"
            ],
            "content":"<div class=\"\"><div> <span>          You are in detention and it seems you're the only one here yet. It would be unwise to just jump down from this giant chair so you decide to wait for help and fortunately for you three girls soon walk in Paige, Monica, Violet, and Erica. They don't realize your presence so they all sit around you, as Erica begins to sit down on your seat, you quickly sprint out of the way. You are now right between Erica's thighs, what will you do?</span></div></div>",
            "created":1362978000,
            "id":1548383,
            "title":"Detention"
        },
        "121":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Keep Climbing",
                "Get her Attention"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you climb Erica's thigh, the other girls don't seem to notice you. It takes you about two minutes until you reach her lap, you could stay here and get their attention or you could keep climbing to get to her shoulder.</span></div></span></div>",
            "created":1369112400,
            "id":1594486,
            "title":"Time to Climb"
        },
        "1211":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Stay",
                "Escape",
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><div> <span>You finally reach Erica's shoulder, but your victory is soon interrupted with a sudden shake. It seems the girls are getting out of their seats, you lose balance and fall of Erica's should and directly into her cleavage. She doesn't seem to notice you but as you regain consciousness you realize that you're stuck. You weren't really aquanted with Erica so it was hard to say how'd she react to you being in her bosom so you decided to make yourself comfortable and slide a bit deeper down into her cleavage, you're probably going to be here for a while. Erica left the room with her friends and headed to her car to presumably head home. As Erica was walking to her car, you realized that sooner or later you will have to reveal yourself to Erica unless you manage to escape now, this will most likely be you only chance. </span></div></div>",
            "created":1369112400,
            "id":1594495,
            "title":"One Hell of a View"
        },
        "12111":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Continue to Erica's home"
            ],
            "content":"<div class=\"\"><div> <span>You decided to stay with your unaware captor. With every step that Erica takes, your whole world is bounced up and down. Erica certainly had a large bust for her age. Now that you think about it, what is her age? You knew she failed one year but you weren't quite sure of her exact age, as you were thinking, your back hit something solid. It definitely wasn't Erica's skin, you turned over with all your might to see what hit. It was a ring of keys that Erica must have already had in her bra. You were slowly sinking into her cleavage like quicksand which caused you to hit them. Thankfully the bouncing eventually stopped when you heard a car door close. Erica stuck her hand into her cleavage to get her keys but instead fished you out. She was going to put her hand to the keyhole on her car but noticed something strange about what she was holding. She bran you closer to her face and looked right at you<br>\r\n\"What... are you?\" Erica gasped<br>\r\n\"Ugh...\" you couldn't think of anything to say as the giantess held you in her palm<br>\r\n\"(your name)! Is that you?\"<br>\r\n\"yes, it's me, Erica! I need your help to get me back to-\" you began to explain your problem was cut off<br>\r\n\"I think Christmas came early for me\" Erica coed<br>\r\n\"come again?\"<br>\r\nErica deposited you back into her cleavage and this time tightened her bra to squeeze you between her luscious books as she started the car. <br>\r\n\"Just wait until we get home, the two of us are going to have so much fun, I hope you know how to please a woman\" Erica giggled as she drove home.<br>\r\n\"This has got to be the worst mistake I've ever made\" you thought to yourself as you were being taken to your new home. </span></div></div>",
            "created":1507533780,
            "id":2398506,
            "title":"Stay"
        },
        "121111":{
            "author_id":"dank_chickens",
            "author_name":"Dank chickens",
            "choices":[
                "Sticks you in the front of her panties",
                "Cares foryou"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Once you get to Erica's house what does she do </span></div></span></div>",
            "created":1509773760,
            "id":2410809,
            "title":"Continue to Erica's home"
        },
        "122":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "One of the girls see you",
                "You get their attention"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to wait it out, and soon the girls do leave except for Paige. She must have extra time you think to yourself. But, not long after that Chloe and Stacy join her. Chloe sitting on the seat you're on.</span></div></span></div>",
            "created":1379912400,
            "id":1668394,
            "title":"The Next Bunch"
        },
        "1221":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Stacy",
                "Chloe",
                "Paige"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one sees you?</span></div></span></div>",
            "created":1493430840,
            "id":2312188,
            "title":"One of the girls see you"
        },
        "1222":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Chloe gives you to one of the girls",
                "Chloe drops you into her cleavage",
                "Chloe decides to leave you some place more secure"
            ],
            "content":"<div class=\"\"><div> <span>You start yelling Chloe's name in a hope of getting her attention, but after a while it pays off. Chloe notices you, at first she seemed shocked, but soon enough she picks you up and says \"oh my gosh, aren't you the most adorable thing\" in a baby voice. The other girls look over to you and start to crowd around you. Then...</span></div></div>",
            "created":1379912400,
            "id":1668398,
            "title":"You get their attention"
        },
        "12222":{
            "author_id":"tactix",
            "author_name":"WednesdayWriter",
            "choices":[
                "To the school roof.",
                "The school Library"
            ],
            "content":"<div class=\"\"><div> <span>Chloe drops you, trapping your entire body between her large breasts and starts to walk out of the room, which makes her boobs bounce around slightly massaging you from all sides.<br>\r\n<br>\r\n\"Let's go somewhere interesting.\" she smiles playfully as she jiggles her boobs.<br>\r\n<br>\r\nwhere does she take you?</span></div></div>",
            "created":1383886800,
            "id":1691680,
            "title":"Bounce house"
        },
        "12223":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "You stay there for the rest of the day",
                "You improvise"
            ],
            "content":"<div class=\"\"><div> <span>Chloe then dawns a devilish grin and says \"I think I'll decide what to do with you later, cutie\". And she opens her pants then panties and drops you in, you try to climb out, but Chloe lets go of her panty elastic too quick and you become trapped.</span></div></div>",
            "created":1379912400,
            "id":1668590,
            "title":"Down You Go"
        },
        "123":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "climb out and explore",
                "stay here"
            ],
            "content":"<div class=\"\"><div> <span>          You silently slip into Erica's shorts and then her panties. After that, you decide to fall asleep, hoping good things will come. By the time you wake up Erica seems to be getting in her car, so it must be after school. Upon waking up, you decide to listen to Erica's conversation on her cell. Erica seems to be going to a lingerie shop, where she works. After arriving, Erica goes in front of the counter as cashier as for you......  </span></div></div>",
            "created":1363064400,
            "id":1548941,
            "title":"Hitching a Ride"
        },
        "124":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "the mall",
                "one of the girl's house",
                "a spa"
            ],
            "content":"<div class=\"\"><div> <span>          You pound as hard as you can on Erica's thighs, at first she doesn't notice, but after about thirty seconds of pounding her thighs, she sees you. \"What the hell is that?\" she gasped, all the girls look over and see you, Erica picks you up and brings you to her beaming face \"oh my god, it's a tiny man\" she placed you on her desk while still keeping you enclosed in her hands \"hey girls, I think we found a new 'friend'\" \"well detention is almost over\" Monica said. \"Awwww, he's so cute\" Violet said \"can we keep him?\" \"well, I'll hold onto him until we decide what to do with him\" Erica said while moving you to her pocket \"don't do that, you'll hurt him\" Violet protested \"well where an I put him?\" Erica said. While the girls were arguing, you began to regret your recent decision to get Erica's attention, you quickly slipped yourself out of Erica's grasp and fell onto a soft fleshing surface... it was Erica's boob, the girls looked down and saw your escape attempt and started giggling \"I like your thinking, little guy\" Erica said while sliding you between her boobs. You entire body was being pressed between Erica's cleavage with only your head sticking out, normally you'd be embarrassed if you weren't aroused at the situation \"aww he looks so adorable with his little head sticking out\" Violet coed. \"yeah, but everyone will see him like that\" Erica said while pushing you deeper in with her finger, soon the only thing you could see was the bottom of Erica's chin. You could barely make out what the girls were saying at this point due to the pressure of Erica's boobs on either side of ears. Erica began moving causing her boobs to bounce up and down and a mini earthquake on your end.  After the girls left detention, they headed to....</span></div></div>",
            "created":1369198800,
            "id":1595392,
            "title":"Don't Know What to Do With"
        },
        "1241":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Yes",
                "No",
                "You yell to Erica"
            ],
            "content":"<div class=\"\"><div> <span>You were still in shock that you were shrunk and now you are in a teenage girl's cleavage. Erica would occasionally look down to make sure you haven't escaped, but you had no intention to do so. You then realize these girls probably don't have your best interest in mind, but what choice do you have now. After arriving at the mall, the girls went to the hair salon. You soon start to slide out of Erica's cleavage, do you fall out?</span></div></div>",
            "created":1370235600,
            "id":1603418,
            "title":"Not the Best Situation to be in"
        },
        "12411":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Paige sees you",
                "you climb down safely"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Upon sliding out of Erica's cleavage, you fall onto her lap, she doesn't notice so you slowly go toward her knee, but....  </span></div></span></div>",
            "created":1370235600,
            "id":1603422,
            "title":"A Chance to Get Away?"
        },
        "124111":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "still with the girls",
                "at Paige's house"
            ],
            "content":"<div class=\"\"><div> <span>Paige quickly grabs you, \"hey Erica, you're little prisoner thinks he can leave\". All the girls start laughing at you and Paige puts you in her cleavage and all the girls get up and leave. Upon being wedged between Paige's giant breasts, you smell a strong scent of perfume, it's so strong you pass out. After you wake up you are....</span></div></div>",
            "created":1370235600,
            "id":1603443,
            "title":"A New Captor"
        },
        "1241112":{
            "choices":[
                "Yell now",
                "Wait till later"
            ],
            "content":"<div class=\"\"><div> <span>You look up and see Paige is doing her makeup in front of a mirror in what looks to be her bedroom. Paige is painting her eyelashes and looks concentrated. But you need to know what's going to happen to you. You could yell to her now, but risk her getting angry, or you could wait until later and let Paige finish her makeup.</span></div></div>",
            "created":1375246800,
            "id":1637915,
            "title":"Paige's House"
        },
        "12411121":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "complimented her",
                "confessed your love for her"
            ],
            "content":"<div class=\"\"><div> <span>You need to get Paige's attention now so with all you strength you yelled to her. <br>\r\n<br>\r\n\"Paige, over her\" you yelled. <br>\r\n<br>\r\nYou must have startled because she dropped her eye shadow when she heard you. <br>\r\n<br>\r\n\"This better be good, little man or I'm having dinner early\" Paige said angrily.<br>\r\n<br>\r\nYou needed to think of something fast so you.... </span></div></div>",
            "created":1398315600,
            "id":1785815,
            "title":"Yell now"
        },
        "13":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Run to a nearby table",
                "Try to climb a guest",
                "Climb onto the couch",
                "Get someone's attention"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You remember you were attending a party with some girls. Looking around you see you are right in the middle of the floor, this could be very dangerous considering you are the size of a bug. What do you do?</span></div></span></div>",
            "created":1369544400,
            "id":1597152,
            "title":"Party Time"
        },
        "131":{
            "author_id":"thi5u5ernam3",
            "author_name":"Senculous",
            "choices":[
                "Yell to her from the edge",
                "Leap to the couch ",
                "Climb back down"
            ],
            "content":"<div class=\"\"><div> <span>With most of the party having moved downstairs, there was a clear path to coffee table in the center of the room. Sprinting to the closest leg, you quickly look around you, surveying your surroundings. You don't see any feet coming from the couch and everyone else in the room appears preoccupied. Deciding your best bet is to climb, you wrap you arms and legs around the furniture and begin to shimmy up the table leg. After a few minuets of exhausting climbing, you reach the top of the table. In front of you lied an extensive stretch of dark wood, a pleasant gloss suggesting a recent polish. Having gained a higher vantage point, you once again survey the room. A few guests were just walking out as you reached the top and your friend Christina sat in a large armchair across the room reading something she presumably found in the adjacent magazine rack. Suddenly you hear the rough rubbing of fabric against denim behind you and turn around. Sitting on the couch directly behind you was Amanda, the cute redhead you'd seen in school. Sharing mutual friends, you'd seen her a few times prior to the party, but never spoke much. She always had a bright smile on her face, however. It spread through her entire body, gaining a lightness and joy. You had noticed her soft pink lips every time you saw her, drawn to them by her constant smiles. Her bright blue eyes and long lashes weren't ignored either. You took the time to fully look her over as you stood on the table; tonight she wore a red flannel unbuttoned over a tight black tank top. The fabric stretched over large chest. Stopping a moment you stare, appreciating the truly massive size of her breasts, easily larger than most of the girls in your school. You followed the straining black tank as it crested mid-cleavage and descended, tucking below and in onto itself as her breasts relaxed from her half lying position. Lower, you noticed her wearing dark skinny jeans, tight against her sizable thighs, wide hips, and into her thin calves. You hadn't really taken the time to see how attractive Amanda was before tonight. <br>\r\nShe was currently doing something on her phone, absorbing her complete attention, attention you needed. <br>\r\nYour plan:</span></div></div>",
            "created":1469682000,
            "id":2187387,
            "title":"Run to a nearby table"
        },
        "132":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Catlin",
                "Kelly",
                "Valeria"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see three nearby guests you could climb, which one?</span></div></span></div>",
            "created":1369544400,
            "id":1597156,
            "title":"Try to climb a guest"
        },
        "1321":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Keep climbing",
                "Stay here",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>You walk over to Catlin, she's wearing a very small black dress that almost looks like a nighty, which reviles her giant cleavage. You then proceed to climb into her foot, she seems to be talking to someone, so she shouldn't see you. After climbing onto her foot, you have two choices: keep climbing, or tuck yourself in her dress shoe.  </span></div></div>",
            "created":1369544400,
            "id":1597174,
            "title":"Mingling With a Guest"
        },
        "1323":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Cut to the morning "
            ],
            "content":"<div class=\"\"><div> <span>You run over to the beautiful Valeria , she was having a drink of red wine with two of her friends. You started climbing her foot when she began to walk over to the washroom. Fortunately you managed to survive the trip there on her slipper. She started touching up on in makeup in the mirror.  You used this opportunity to continue your climb. Valeria was so concentrated on her makeup she didn't even notice you climb all the way up her leg and onto the washroom counter. However when you secured yourself on the cold stone-like counter, you heard a gasp. It was Valeria, she had noticed you! <br>\r\n<br>\r\n\"Oh my god, you're a.... Little man\" Valeria said. <br>\r\n\"Are you gonna hurt me\" you asked merciful. <br>\r\n\"Aren't you just so adorable\"<br>\r\n<br>\r\nValeria ignored your question and picked you up and raised you to her face. <br>\r\n\"You're coming home with me\" she said<br>\r\n<br>\r\nAnd before you could reply, she dropped you straight into her huge cleavage. It wasn't very roomy that's for sure. When Valeria started walking her breasts bounced in a distinct pattern. <br>\r\n<br>\r\nValeria returned to her friends and proceeded to get drunk with her friends. </span></div></div>",
            "created":1398488400,
            "id":1786970,
            "title":"Valeria"
        },
        "13231":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Cut to Valeria's bedroom"
            ],
            "content":"<div class=\"\"><div> <span>Valeria passed out that night so you had to remain put. You could tell morning had arrived by the sliver of sunlight through the curtains. You could smell the strong scent of alcohol off of Valeria through her  cleavage. You began to think maybe Valeria wasn't the best choice to climb last night, but it's too late to change your mind now. However your doubtful thoughts were cut short when Valeria woke up. She didn't echnowledge your presence so she may have forgotten about you. <br>\r\n<br>\r\nValeria pick up her cell phone from a nearby table and called her friend (Monica). She was calling for a drive home. After she arranged for her friend to come and get her she sat on a nearby couch. Now you were sure she forgot about you. You decided to play it safe and remain incognito. <br>\r\n<br>\r\nIt didn't take long got the drive to get here, but it took Valeria long to get into the car. Valeria must have a big hangover to be acting this inactive, now that you think about it, she may not of even known that she took you last night. <br>\r\n<br>\r\nWhen you and the girls reached Valeria's apartment, Monica decided to stay with Valeria after she got ready for a nap. </span></div></div>",
            "created":1398488400,
            "id":1787337,
            "title":"Cut to the morning "
        },
        "132311":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "siding with your perverted idea",
                "getting yourself to safety"
            ],
            "content":"<div class=\"\"><div> <span>Valeria made sure to close the door on her way into her bedroom. She then stripped down to just her underwear and got into bed. Because Valeria was no longer wearing that tight dress, you were now able to move around a bit and even able to set yourself free. And you did just that.<br>\r\n<br>\r\nYour ears filled with the sound of Valeria breathing in her sleep. After fully climbing out of Valeria's clutches you noticed Valeria was not in her underwear at all, no, she was nude. This sparked a rather perverted idea to you. But you really did need to get yourself to safety, what if she were to roll over on you?<br>\r\n<br>\r\nAfter minutes of decided you ended up.... </span></div></div>",
            "created":1398574800,
            "id":1787489,
            "title":"Cut to Valeria's bedroom"
        },
        "1323111":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "came back with Monica",
                "came back a couple hours later"
            ],
            "content":"<div class=\"\"><div> <span>You know you'd regret this, you thought. But this could be the last chance you get with being with a woman so you ran under the blanket and down towards Valeria's vagina. It was the biggest vagina you've ever seen, it was the size of cave. However before you could pleasure yourself, Valeria turned over onto her stomach, thankfully you were not harmed in the process. But this did put you in a different location, you now stood on Valeria's thigh right by one of her butt cheeks.<br>\r\n<br>\r\nValeria's shift in position also caused the blanket to slide of of the bed completely revealing her gigantic butt. You walked over to her butt cheeks and soon noticed they literally had some bounce to them. To you they felt like a trampoline. So you began to jump up and down, each time getting closer and closer to the centre. You didn't notice until it was too late, you became trapped in Valeria's butt cheeks, and by the sounds of things she was waking up.<br>\r\n<br>\r\n\"Monica, is that you?\" Valeria said, still half asleep.<br>\r\n<br>\r\nValeria went to feel her butt and noticed Monica was nowhere to be found. Valeria immediately got up to see what was touching butt. She picked you out and was once again in shock due to your size.<br>\r\n<br>\r\n\"You... you're so tiny, who are?\" Valeria asked.<br>\r\n<br>\r\n\"I'm the tiny man you took last night\" you replied.<br>\r\n<br>\r\n\"Oh my god, you're real\"<br>\r\n<br>\r\n\"Are you gonna hurt me?\"<br>\r\n<br>\r\nAnd once again she ignored your question and dropped you in a jar.<br>\r\n<br>\r\n\"Stay put, little guy, I need to get ready\" Valeria said<br>\r\n<br>\r\nYou could see Valeria fully nude now and she was damn sexy too. But now you were stuck in this jar. Valeria left the room and....</span></div></div>",
            "created":1398574800,
            "id":1787502,
            "title":"siding with your perverted idea"
        },
        "133":{
            "author_id":"easytoknow",
            "author_name":"dials_my_soap",
            "choices":[
                "Allison ",
                "Kelly",
                "Erica"
            ],
            "content":"<div class=\"\"><div> <span>You realize you need to get off the floor and fast! You run to the couch and start to climb up, which is easy considering how small you are. Your plan is to climb to the very top and wait for someone to sit down, jump and grab their hair, climb to their ear, and get their attention. You make it to the top and wait. Who finally sits down?</span></div></div>",
            "created":1395982800,
            "id":1769044,
            "title":"Climb onto the couch"
        },
        "1333":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Get her attention",
                "Climb inside her shorts"
            ],
            "content":"<div class=\"\"><div> <span>You see Erica walking over to the couch to have a seat but before you could finish your plan, you slip and fall all the way to the bottom of the couch. Upon looking up, you see Erica's butt looming over you getting readying to sit down. Fortunately you managed to just barley get out of the way but now you stand between two ginormous thighs. Getting Erica's attention seems like a good choice but you begin to notice by her behavior and smell, she's probably drunk so getting her attention may be not such a good idea. But then a perverted idea came to mind, what if you climbed inside her shorts? Dangerous? yes. But it could prove to be the safest thing right now.  </span></div></div>",
            "created":1395982800,
            "id":1769766,
            "title":"Not According to Plan"
        },
        "134":{
            "author_id":"thi5u5ernam3",
            "author_name":"Senculous",
            "choices":[
                "Climb her leg",
                "Climb the chair"
            ],
            "content":"<div class=\"\"><div> <span>Luckily for you, the majority of the party had already migrated to the basement leaving only you and a few others. One of the few, sitting in an armchair in the corner of the room, was Christina. Her black hair fell along her slender neck and across her shoulders in graceful waves, a beautiful contrast to her porcelain cheeks. A similar intense black, her lashes were think and rich, framing her pale sea-green eyes. Christina happened to be one of the girls born gifted with a surplus of natural assets; a chest that, despite the outfit, inevitably lets itself be known in the most eye-catching manner, perky and voluminous. Her waist was unusually thin for possessing such attributes, succeeding in highlighting her wide hips generously. There was always a mature grace about her; a self-reliant way of carrying herself. <br>\r\nYou had tried to get her attention for about three years now and was finally succeeding, engaging in several hour long conversations from time to time. It seemed that she was beginning to warm up to you. You had been elated to find out she was going to this party, one you had first intended to miss until knowledge of her presence reached you. Hoping that tonight was the night you finally get close to her, you came.<br>\r\nRunning across the light hardwood, you stop by her feet and peer up. Her legs were crossed, one heel adorned foot hovered over you, the other gently placed on the ground. </span></div></div>",
            "created":1469595600,
            "id":2186667,
            "title":"Get someone's attention"
        },
        "1341":{
            "author_id":"thi5u5ernam3",
            "author_name":"Senculous",
            "choices":[
                "Stay",
                "Sit in the cup holder"
            ],
            "content":"<div class=\"\"><div> <span>You jump on top of the tip of her shoe, elevated by a light platform coming from the bottom. Before you lied Christina's foot, smooth and white, leading up to her silky legs. A dark line breaking the white skin drew you attention to the side of her foot. Thin, running just above her shoe line, was a tattoo; \"In heaven, all the interesting people are missing.\" <br>\r\n'Edgy' you thought as you began to climb the smooth skin. <br>\r\nChristina had been reading something as you ran to her and it evidently did well to hold her attention. She had yet to feel your small body on her. Shimmying up her thin ankles, you slowed as the difficulty increased along her recently shaven shins. The surface proved impossible to scale with speed. After a few minuets you'd reached just below he kneecap. Apparently this spot was especially sensitive, earning a giggle born of an unexpected and unintentional tickling. <br>\r\nA large shift nearly threw you from Christina. Looking up, you see several cherry painted fingers descending upon you. Secured between her thumb and forefinger, you were lifted up to Christina's face, the book no longer holding her attention. She stared at you for a moment, surprise and humor mingling within her eyes. <br>\r\n\"What were you doing on my leg?\" She playfully inquired. <br>\r\nYou were unsure how to respond. Before you was the girl you'd held a torch for for three years, titanic, gorgeous, and undeniably attractive. Her warm breath enveloped you with every exhale, sweet and intoxicating. You pulled yourself together just enough to respond; \"Hey, Christina. I was trying to get your attention.\"<br>\r\nShe giggled again, a charming, light, yet mature ring that echoed in your ears. Her plush glossed lips opened as she spoke, \"I figured that much, but how did you get so...small?\" <br>\r\n\"I really don't know.\" You reply in earnest. <br>\r\n\"Well, me neither.\" She dismissed. \"Has anyone seen you yet? <br>\r\n\"No. Just you.\"<br>\r\n\"Ah well, that's sweet. But, I wonder what you're going to do all small in a big world.\" <br>\r\nIn all honesty you wanted to remain with her. Perhaps you have a chance to?<br>\r\n\"Would mind if...I stayed with you? I don't really trust anyone else.\" You ask hesitantly.<br>\r\n\"And you trust me?\" She covered her genuine curiosity with continued humor. It appeared to be her defense mechanism. <br>\r\n\"After all of our talks...yeah I do.\"<br>\r\nA subtle red flush grew across her cheeks, responding to you sudden candor. <br>\r\n\"Um, yeah...I've started to trust you too. So I guess I can look out for you.\"<br>\r\n\"Thank you, Christina! I really appreciate it.\" It was difficult to hide your elation.<br>\r\n\"You're welcome. I guess we should get out of here. It could be dangerous with so many people. ...Where should I keep you?\"<br>\r\nDespite yourself, your eyes immediately travel to the wide expanse of white skin within the collar of her sweater. It was technically a dress although it held the appearance of an elongated sweater with an unusual and typically inappropriately deep neckline. <br>\r\nIt seemed she didn't notice although the same though happened to occur to her as well. <br>\r\n\"Hey, um...\"<br>\r\n\"Yeah?\" You once again find yourself basking in her sweet breath, the moist warmness extremely comforting. <br>\r\n\"How comfortable are you with my body?\"Her face faintly flushed once again.<br>\r\n\"Why?\"<br>\r\n\"Because I think the safest place for you is, um, here.\" She gently pulled out her neckline. <br>\r\n\"I'm comfortable if you are.\" You say confidently, subduing your hopes for that outcome. <br>\r\n\"I'm glad.\" A sweet smile revealed her beautifully white teeth. Her features had gained a level of confirmation. \"Alright, let's get out of here quick.\"<br>\r\nWith that, she used her free hand to spread her massive breasts apart and lowered you between. Embraced by Christina's soft, plush breasts, you noticed her skin was as hot as it was tender. Her perfume floated strongly about, gliding into your nostrils and feeding your lust for her. The steady rhythm, of her heartbeat reverberated around you, through her perfectly round breasts. The hot cradling of her body lulled you into an orgasmic comfort, a complete sense of safety. <br>\r\nChristina rose from the loose armchair and exited the room. Avoiding the other party goers, she stealthy left through the front door and out to her car at the end of the drive. Entering the vehicle, she closed the door and took a breath of relief. <br>\r\nLooking down at her chest she says, \"Alright, we've made it! Do you want to come out or wait until I get home?\"</span></div></div>",
            "created":1469595600,
            "id":2186682,
            "title":"Climb her leg"
        },
        "13411":{
            "author_id":"thi5u5ernam3",
            "author_name":"Senculous",
            "choices":[
                "I actually came to the party because I head you were going.",
                "I'm glad you were there to help me tonight."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm fine staying here...\" you say with slight embarrassment. <br>\r\n\"Ok. I was kind of hoping you would be...\" judging by the return of a flush to her cheeks, Christina felt the same. She started the car, the movement of her arms shifting your plush throne, the soft flesh pressing against you gently. You settled back into her, allowing the perfume to overtake your senses and her heartbeat upon your back to quiet the fears in your mind about your sudden change in stature. \"So you really have no idea how you got so small?\" Christina asked, her eyes falling to you frequently as she drove. <br>\r\nYou took a moment to think before replying, \"No. I was just hanging around the party when I just noticed, y'know, my entire world get a bit bigger. I mean, life happens.\" Your sarcasm helped to withhold any actual terror about your circumstance as well as to repel a more grim mood. You didn't want Christina to get too worried. That would no fun. You also felt that as long as she remained calm you could. Everything would be fine. You hoped. <br>\r\n\"You really have no clue? Anything could help. I guess. I've never heard of anything like this actually happening so it's hard to find a point of reference.\"<br>\r\n\"Nope. No idea.\"<br>\r\n\"Well, I suppose the best we can do is just focus on tonight.\" She paused, a question hesitating on her tongue. \"Are you- are you comfy. Or you know, comfortable?\"<br>\r\nYou took a beat to appreciate her nervousness and chose to consider it a sign of affection for you, hoping not to be a response to your size. That, in addition to the monumental mammaries on either side of your body. <br>\r\n\"Yeah,\" You respond. \"I'm very comfortable.\" <br>\r\n\"Good!\" She said. \"Cool. Super cool.\" <br>\r\nThe sound of the road running beneath the tires and the muted wind filled the silence between the two of you as you both attempted to find a topic to bring up. Finally you make the first advance and ask the question that had been pricking your thoughts since you first heard she was coming.<br>\r\n\"Why did you come tonight? To the party?\"<br>\r\n\"Oh! They party? I dunno. I just thought it would be fun to go to. I mean, I heard you were going so it couldn't be too awful, right? Just ended up reading magazines, though.\" What she didn't tell you then was that she had actually decided to go, like you, after hearing that you were going and that you were on her mind as she got ready to leave. Her breasts may always make themselves known regardless of what she wears, but not everything she wears is generally so low cut. \"Most of the other girls were drunk downstairs. I think I saw, what was her name? Amanda! Yeah, she was just checking her phone on the couch most of the night. Where were you? Before you shrunk, I mean.\"<br>\r\n\"I migrated a lot.\" You avoided mentioning that you were looking for her more than once. \"Not the type to get drunk?\" <br>\r\n\"Not at a party like this. If it was just friends hanging out, then maybe, but a high school party like this? No way. Besides, I drove myself.\"<br>\r\n\"That's true. Well, I'm glad you didn't tonight. Who knows what what would have happened to me if you were?\" <br>\r\n\"Yeah. I'm glad too.\" <br>\r\nYou felt a slight squeeze as she said this. <br>\r\nYou began to think of the rest of the night and what was in store for your small self, \"Is it really ok for me to stay with you tonight?\"<br>\r\n\"Of course!\" She said in a convincing certainty. \"It isn't as if my parents will see me brining a boy home. Especially at, what?\" She glanced at the clock on her dashboard. \"Three am? Yeah, they're both asleep.\"<br>\r\n\"Did they know you were going out tonight?\"<br>\r\n\"They knew.\"<br>\r\n\"Seems like they have a lot of trust in you.\"<br>\r\n\"Well, like I said, I don't really drink at these kind of parties and I'm not dumb enough to drive even if I did, so they don't really worry about it.\"<br>\r\n\"That's convenient for tonight.\" <br>\r\n\"It certainly is.\" She laughed, bouncing you mildly. <br>\r\nYou filled the rest of your car trip with the familiar conversations you were glad to have been able to become used to. There were butterflies in your stomach and they weren't from the height you were sitting. <br>\r\n\"Hey, Christina, can I tell you something?\"<br>\r\n\"Yeah? What is it?\"</span></div></div>",
            "created":1492232400,
            "id":2305381,
            "title":"Stay Close"
        },
        "134111":{
            "author_id":"lgiese",
            "author_name":"Lane",
            "choices":[
                "What a slut.\"",
                "That was great.\""
            ],
            "content":"<div class=\"\"><div> <span>\"I could tell.\" she said.<br>\r\n\"Oh, sorry if it was so obvious. My point was that, I-I-I think you're hot, and I was wondering if you wanted to go out sometime, you know, after we find out what's going on.\"<br>\r\n\"I was actually trying to ask you out, and don't worry about the size thing. I'll find a way to fix it. My dad is a Chemist. He can fix this whole thing.\"<br>\r\n\"Thanks. Wow, your boobs are so huge and soft and warm. I wish I could stay here forever. I never got to see your ass before. I was wondering if you could show me it.\"<br>\r\n\"Thanks, and I would love to if you promise not to tell anyone. If you tell anyone, I swear I will beat the living shit out of you.\"<br>\r\n\"No one will ever know.\"<br>\r\n\"Well then. Enjoy the show.\"<br>\r\nShe proceeds to pull you out of her cleavage, and lifts up her skirt, and shake her ass for you. It is so big, you wonder how you never noticed it. She the starts to rub her massive ass on your face. It is just as warm and soft as her tits. After about 5 minutes. she stops, picks you up and puts you back in between her breasts. She asks \"So, how did you like it\"<br>\r\nYou respond, \"Wow...</span></div></div>",
            "created":1508799660,
            "id":2405524,
            "title":"I actually came to the party because I head you..."
        },
        "1341111":{
            "author_id":"lgiese",
            "author_name":"Lane",
            "choices":[
                "Squeezes her boobs together, slowly crushing you.",
                "Grabs you, and throws you out of the car, breaking your legs."
            ],
            "content":"<div class=\"\"><div> <span>\"What??? I thought that was what you wanted.\"<br>\r\n\"About that, it was a joke. But I did get it on video, and it is now on YouTube, Facebook, Twitter, Instagram, and Snapchat.\"<br>\r\n\"You ass hole. I trusted you.\"<br>\r\n\"That was your first mistake\"<br>\r\nShe gets so angry, she then...</span></div></div>",
            "created":1508800320,
            "id":2405530,
            "title":"What a slut.\""
        },
        "13411111":{
            "author_id":"lgiese",
            "author_name":"Lane",
            "content":"<div class=\"\"><div> <span>\"That's what you get you little piece of shit.\"<br>\r\n\"Wait. Stop. Please. It hurts.\"<br>\r\n\"Quit whining.\"<br>\r\nAfter only seconds, you are reduced to a bloody stain in her cleavage. She wipes your pasty corpse away with a tissue, and disposes of you.<br>\r\n\"Serves him right.\"</span></div></div>",
            "created":1508800800,
            "id":2405532,
            "title":"Squeezes her boobs together, slowly crushing you."
        },
        "13411112":{
            "author_id":"lgiese",
            "author_name":"Lane",
            "choices":[
                "Lifts her foot up as if to crush you.",
                "Picks you up in her hand."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Ow, what the hell. My leg is broken.\" You say.<br>\r\n\"I could do worse. Serves you right.\" She gets out of the car, and stands over you imposingly.<br>\r\nShe then...</span></div></span></div>",
            "created":1508883420,
            "id":2405989,
            "title":"Grabs you, and throws you out of the car, break..."
        },
        "134111121":{
            "author_id":"lgiese",
            "author_name":"Lane",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Good bye ass hole\" She says.<br>\r\nYou bargain with her, but she in not in the mood to negotiate. She slowly lowers her foot and slowly crushes your tiny body into paste.</span></div></span></div>",
            "created":1508883720,
            "id":2405994,
            "title":"Lifts her foot up as if to crush you."
        },
        "134111122":{
            "author_id":"lgiese",
            "author_name":"Lane",
            "choices":[
                "Starts to crush you in her massive hand.",
                "Walks over to a manhole and drops you into the sewer."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Give me one reason I shouldn't kill you right now.\" She says.<br>\r\n\"Because you don't have the guts to kill me.\"<br>\r\n\"Oh yea?\"<br>\r\nShe then...</span></div></span></div>",
            "created":1508883960,
            "id":2405996,
            "title":"Picks you up in her hand."
        },
        "1341111221":{
            "author_id":"lgiese",
            "author_name":"Lane",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Ow, that hurts. Stop!\" You say.<br>\r\n\"Should have thought about that earlier.\"<br>\r\nShe laughs as she feels your bones snap under the force of her massive hand. You squirm in her hand, which only makes her enjoy it more.</span></div></span></div>",
            "created":1509821280,
            "id":2411007,
            "title":"Starts to crush you in her massive hand."
        },
        "1341111222":{
            "author_id":"lgiese",
            "author_name":"Lane",
            "content":"<div class=\"\"><div> <span>\"Goodbye shithead.\" She says smuggly as she drops you down the sewer grate. The last thing you see as you tumble down into the darkness is her face, and the last thing you hear is her giggles as she walks away. You hit the floor of the sewer and die on impact. </span></div></div>",
            "created":1546623900,
            "id":2598677,
            "title":"Walks over to a manhole and drops you into the ..."
        },
        "1341112":{
            "author_id":"lgiese",
            "author_name":"Lane",
            "choices":[
                "Is that a real question? Obviously yes!!",
                "I'm not sure that's a good idea? Maybe later."
            ],
            "content":"<div class=\"\"><div> <span>\"Really? You liked it?\" She asked. \"Well, yeah. You're beautiful. Absolutely gorgeous.\" You respond. <br>\r\n\"Well thank you. No one has really ever said that to me before.\"<br>\r\n\"I don't believe that for a second. You're the prettiest, most down to earth girl I know. So, about the size thing?\"<br>\r\n\"Oh, sorry. Yeah, I'll get to that, but first, I thought we should have a bit of fun first.\" <br>\r\n\"What do you mean?\"<br>\r\nShe pulls off her panties, showing her massive vagina. Her clit is bigger than your head.<br>\r\n\"I thought you could do a little something for me first.\" She says, seductively biting her lip. \"I want you to crawl into my pussy and make me scream with pleasure. I want you to make me cum.\"<br>\r\nYou say...</span></div></div>",
            "created":1546625160,
            "id":2598683,
            "title":"That was great.\""
        },
        "14":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Paige",
                "Monica",
                "Sophia",
                "Nina",
                "Felecia"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          You look around even more to see furniture(matching your size) in your small pet like cage. The furniture was made of plastic, most likely from a doll house, but suddenly someone walks in, it's.....</span></div></span></div>",
            "created":1361250000,
            "id":1535650,
            "title":"Captured......by who?"
        },
        "142":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "bra cup",
                "panties",
                "cleavage"
            ],
            "content":"<div class=\"\"><div> <span>          Monica walks over and opens the cage door and picks you up, \"seems you have awoken\" she said \"wait, what are you going to do to me?\" you ask \"really just make you my slave, but before I can do anything with you, I need to get you some new clothes\" she replied. She then decided to carry you in her....</span></div></div>",
            "created":1363410000,
            "id":1551233,
            "title":"Your New Life"
        },
        "1422":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Front end",
                "Back end"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which end will it be?</span></div></span></div>",
            "created":1480568400,
            "id":2244523,
            "title":"panties"
        },
        "143":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>It was Sophia (you knew her from school), only wearing a thin pink t-shirt and panties. She unlocked the cage door and sat on the floor with her legs crisscrossed and you right between them, \"you're probably wondering what's going on, aren't you?\" she said, you nodded your head in response. \"Well, I felt like I needed a new toy, and you looked so cute at school, so I shrunk you\" she explained \"oh, I almost forgot- I have a something for you\" and she pulled out a dress about your size. But do you accept it?</span></div></div>",
            "created":1377320400,
            "id":1651104,
            "title":"Her New Toy"
        },
        "15":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Yes, you walk over to the stall.",
                "No, you need to get reliable help."
            ],
            "content":"<div class=\"\"><div> <span>          You can't remember why you're in the girl's washroom but it was probably perverted, that aside you look over to the stalls and see a girl is using one of them. This is a once in a lifetime chance for you, so do you take the chance or not?  </span></div></div>",
            "created":1361250000,
            "id":1535639,
            "title":"A Giant opportunity"
        },
        "151":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Chloe",
                "Sabrina",
                "Diana"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you walk under the stall you see it's.....</span></div></span></div>",
            "created":1361250000,
            "id":1535642,
            "title":"Who is it?"
        },
        "1511":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Climb in her panties",
                "Get her attention",
                "Climb her leg"
            ],
            "content":"<div class=\"\"><div> <span>It was Chloe, she was a bit older than everyone else, she failed 11th grade twice making her nineteen. Chloe was also a bit of a cougar, how she always dated younger guys. Anyway, you could either get in her panties now, shout and get her attention and hope she will help you, or if you're feeling daring, you could attempt to climb her legs all the way to her thighs.      </span></div></div>",
            "created":1369198800,
            "id":1595181,
            "title":"The Cougar"
        },
        "15111":{
            "author_id":"tinygirls2020",
            "author_name":"Tinygirl2020",
            "choices":[
                "Have fun",
                "get out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You couldn't help but be in a trance like state as you climb in to her ladies wear . The smell overpower as you made your way into her ladies hood </span></div></span></div>",
            "created":1506054000,
            "id":2389330,
            "title":"Climb in her panties"
        },
        "15113":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "No",
                "Yes"
            ],
            "content":"<div class=\"\"><div> <span>You decide to climb her leg, upon getting to her knee, you see she is looking ahead of her and therefor cannot see you. When you finally reach the top of her thighs and on her lap, you notice she has her thighs slightly opened, relieving her pee going into the toilet. You then jump down from her thigh and onto the part of the toilet seat between her thighs. But does she notice you? </span></div></div>",
            "created":1369198800,
            "id":1595204,
            "title":"The Golden Fall"
        },
        "151131":{
            "choices":[
                "class",
                "the hall to waunder a bit more"
            ],
            "content":"<div class=\"\"><div> <span>Chloe doesn't seem to notice you. So you keep climbing, but by the time you get to her stomach, you stop hearing Chloe's pee. She pulls up her panties and pants, and you hang onto her belly button. As she makes her way over to the sink, you fall and grab onto her pocket and climb inside. Chloe then heads to....</span></div></div>",
            "created":1375246800,
            "id":1637913,
            "title":"Safe"
        },
        "151132":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "to lunch",
                "home"
            ],
            "content":"<div class=\"\"><div> <span>          Chloe notices you as soon as she reaches to pull up her panties, she looks at you with a slightly surprised look and says \"well, what do we have here?\". She  immediately picks you up and says \"I think I'll decide what to do with you later\" and with that she shoves you right between her breasts so far you can not be seen from the outside. You could then hear Chloe pull up her pants and leave the bathroom, you fall asleep, and she heads....</span></div></div>",
            "created":1369198800,
            "id":1595272,
            "title":"Your Fleshy Prison"
        },
        "1511322":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Stay here",
                "Crawl out"
            ],
            "content":"<div class=\"\"><div> <span>          After you wake up, you realize you are still in Chloe's cleavage, and she seems to be sleeping. She may have forgotten about you, or she knows you wouldn't try to escape your fleshy prison. So you can stay here with Chloe and try to get on her good side, or you can take your chances and crawl out of her cleavage.</span></div></div>",
            "created":1369544400,
            "id":1596918,
            "title":"Awoken From the Nap of Your Life"
        },
        "15113221":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Accept your fate",
                "Rebel"
            ],
            "content":"<div class=\"\"><div> <span>You decided to stay with Chloe and wait for her to wake up. After about twenty minutes, she woke up, and looked down to make sure you were still there. Chloe picked you out of her cleavage and held you up to her face, \"I didn't think you would stay there, but you did. Good\" she said \"what are you going to do with me she said?\" you asked, she just laughed and said \"you get to be my personal slave, how do you like that?\".</span></div></div>",
            "created":1369544400,
            "id":1596920,
            "title":"Chloe's New Slave"
        },
        "151132211":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>          Three years have passed since you agreed to be Chloe's slave, she now treats you like an object for her desire. Chloe usually just keeps you in her bra and often forgets that you're even there, and the only food you get is the leftover crumbs from her food. Using the bathroom has become rather inconvenient due to the fact you can only go when she needs to. On the bright side you finally lost your virginity, even if it was to a giant woman. Overall you regret you decision of becoming her slave, but is it too late?</span></div></div>",
            "created":1369544400,
            "id":1596925,
            "title":"Your New Life"
        },
        "1511322111":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see no chance of escape, your parents have given up on your search and have declared you dead. The only person who knows of your existence is Chloe and she doesn't seem to have any plans of giving you up soon.</span></div></span></div>",
            "created":1370235600,
            "id":1603463,
            "title":"Yes"
        },
        "1511322112":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "to work at the lingerie store",
                "shopping"
            ],
            "content":"<div class=\"\"><div> <span>          It was morning and you woke up in Chloe's cleavage, there was a get together with some of Chloe's friends last night. Chloe got up and headed down stairs of her apartment, once there she made herself three slices of toast. She took you out of her cleavage and placed you on the table, you stood next to the plate like always and wait for crumbs to fall. There wasn't many crumbs so you begged Chloe for more, but she just looked down at you and said \"keep talking like that and I just might make spend the day in my butt cheeks\". At first you knew you didn't want that, but after thinking it over you realized you could eat her feces, disgusting but if it will keep you alive why not. After bothering Chloe more she placed in between her butt cheeks and you immediately began eating the tiny bit of feces on the walls of her butt. Chloe doesn't notice you as she goes....  </span></div></div>",
            "created":1370235600,
            "id":1603486,
            "title":"Hope?"
        },
        "151132212":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Skip to digestion"
            ],
            "content":"<div class=\"\"><div> <span>\"I ain't doing anything for you, bitch\" you scream to Chloe. She then raises you above her mouth and says \"if you won't serve me, I have no use for you, and I'm kinda hungry too\", and she drops you into her open mouth. You fall down her throat until you reach her stomach, in there you have nothing to do but wait and regret all of your decisions you have made leading to this. The stomach acids don't seem to effect you so it seems you might survive digestion after all, but then again Chloe might also be waiting for you.</span></div></div>",
            "created":1370235600,
            "id":1603476,
            "title":"Rebel"
        },
        "15113222":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Hide in panties",
                "Continue climbing"
            ],
            "content":"<div class=\"\"><div> <span>You crawl out of Chloe's cleavage undetected and walk right up to Chloe's neck. She doesn't seem to notice you, but she could wake up at any moment, so you decide to move quickly. You turned around and began running across Chloe's thighs to the far end of the couch she's sleeping on. But your plan is complicated when Chloe rolls over on her stomach and you land right between her thighs and next to her panties. You could hide in Chloe's panties or continue climbing.</span></div></div>",
            "created":1371790800,
            "id":1615369,
            "title":"The Sleeping Giantess"
        },
        "151132222":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "hide in a neaby slipper",
                "stand still in shock"
            ],
            "content":"<div class=\"\"><div> <span>You decide to stick with your original plan and climb onto Chloe's thigh again. You finally get to Chloe's feet and use them to jump onto the couch arm and then to the table next to the couch. After that you climb down from a wire from the phone on the table, and reach the floor. You then see that Chloe is waking up, you....</span></div></div>",
            "created":1371877200,
            "id":1615387,
            "title":"Continue climbing"
        },
        "1511322221":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>          You run directly to a nearby slipper and quickly snug yourself in. Upon looking out of the slipper, you see Chloe reaching down into her cleavage and noticing you are missing. She briefly looks around and walks over to the slippers, you see one foot go into the slipper beside you and then another one coming into yours. You hide back into the slipper and are nearly crush by Chloe's foot. Luckily she doesn't seem to notice you, but you are still being crammed between the front of the slipper and Chloe's big toe. </span></div></div>",
            "created":1371877200,
            "id":1615440,
            "title":"Not the Best Hiding Place"
        },
        "15113222211":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "wait for her order",
                "quickly jump in her panties"
            ],
            "content":"<div class=\"\"><div> <span>          After the little ride, you climb out of the slipper and are soon confronted by Chloe just in her bra and panties. She immediately notices you and kneels down to pick you up. She looks at you and says \"thought you could escape did you? well not from me\" as she lays on her bed. You decide to....</span></div></div>",
            "created":1371877200,
            "id":1615444,
            "title":"Caught in the Open"
        },
        "151132222111":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "content":"<div class=\"\"><div> <span>Chloe puts you by her feet and says \"here, you can paint my toe nails, while I decide to keep you or not\" and she puts a bottle of nail polish and brush by you. And so you spent the rest of your life as Chloe's slave and was only released from her cleavage when she has need of you.</span></div></div>",
            "created":1371877200,
            "id":1615884,
            "title":"Enslaved"
        },
        "1512":{
            "author_id":"thi5u5ernam3",
            "author_name":"Senculous",
            "choices":[
                "Just jump",
                "Yell to Sabrina"
            ],
            "content":"<div class=\"\"><div> <span>Peering up into the stall, you see Sabrina. You recognize her from a few of your classes. Her blonde hair tumbled down across her chest which strained to be contained by her shirt. She seemed to be finishing up and you quickly look and see her shorts by her ankles. Sprinting, you dive into the fabric and soon have an express ride between Sabrina's plush thighs. Suddenly she sat back down, her eyes locked on the screen of her phone. Taking the opportunity of her distraction, you climb her shirt fairly easily until you reach the impassable ridge of her under boob. Glancing over to your right, her white cardigan becomes your only means of ascension. After a quick shimmy to your side, your hangs grip the soft fabric of her sweater. Soon you are peering down at the deep line of her cleavage. You almost feel it drawing you. </span></div></div>",
            "created":1509399720,
            "id":2408983,
            "title":"Sabrina"
        }
    },
    "info":{
        "author_id":"justchillen122",
        "author_name":"Brad",
        "brief_description":"An interactive story that involves getting shrunk, also includes pictures **ADD CHAPTERS**",
        "created":1360892100,
        "description":"<td align=\"left\" class=\"norm\"><div align=\"center\">✐<u><b>***PLEASE ADD CHAPTERS***</b></u>✐</div><br>\r\n<br>\r\nStoryline:<br>\r\nIn this story, you take on the role as a shrunken man in various scenarios as you try not to get crushed, eaten, or killed by a giantess.<br>\r\n<br>\r\n**Rules:**<br>\r\n1. Feet are okay, but keep it at a minimum. There are other stories focused solely on that. <br>\r\n2. You can add characters if you want but try to only use the characters provided if possible. <br>\r\n3. Please, only soft vore.<br>\r\n4. The protagonist is to remain nameless to ensure his identity is you.<br>\r\n5. Lastly, I'm not big when it comes to grammar but at least make it readable.<br>\r\n <br>\r\nCharacter List:<br>\r\nStacy - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/S3C8aQa.jpg\" target=\"_blank\">http://i.imgur.com/S3C8aQa.jpg</a><br>\r\nPaige - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/n9AWXJd.jpg\" target=\"_blank\">http://i.imgur.com/n9AWXJd.jpg</a><br>\r\nAlison - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/STq8z9G.jpg\" target=\"_blank\">http://i.imgur.com/STq8z9G.jpg</a><br>\r\nAmy - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/gqgz8eS.jpg\" target=\"_blank\">http://i.imgur.com/gqgz8eS.jpg</a><br>\r\nDiana - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/jym4voE.jpg\" target=\"_blank\">http://i.imgur.com/jym4voE.jpg</a><br>\r\nErica - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/aocE79G.jpg\" target=\"_blank\">http://i.imgur.com/aocE79G.jpg</a><br>\r\nNicole - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/bHKO013.jpg\" target=\"_blank\">http://i.imgur.com/bHKO013.jpg</a><br>\r\nSabrina - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/7MWfAOB.jpg\" target=\"_blank\">http://i.imgur.com/7MWfAOB.jpg</a><br>\r\nFelecia - <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.imgur.com/8c68nS9\" target=\"_blank\">https://i.imgur.com/8c68nS9</a><br>\r\nMonica - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/0NG45u8.jpg\" target=\"_blank\">http://i.imgur.com/0NG45u8.jpg</a><br>\r\nSamantha - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/aAJJaM8.jpg\" target=\"_blank\">http://i.imgur.com/aAJJaM8.jpg</a><br>\r\nSophia - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/eqle0UL.jpg\" target=\"_blank\">http://i.imgur.com/eqle0UL.jpg</a><br>\r\nHaley - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/IXH5OXS.jpg\" target=\"_blank\">http://i.imgur.com/IXH5OXS.jpg</a><br>\r\nViolet - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/TEE3Vnd.jpg\" target=\"_blank\">http://i.imgur.com/TEE3Vnd.jpg</a><br>\r\nChloe - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/BSTPBqf.jpg\" target=\"_blank\">http://i.imgur.com/BSTPBqf.jpg</a><br>\r\nCaitlin - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/N0yyZ9g.jpg\" target=\"_blank\">http://i.imgur.com/N0yyZ9g.jpg</a><br>\r\nAmelia - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://farm4.static.flickr.com/3329/3550796370_628b33cab6.jpg\" target=\"_blank\">http://farm4.static.flickr.com/3329/3550796370_628b33cab6.jpg</a><br>\r\nKelley - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://cdn.brosome.com/wp-content/uploads/2010/05/Kelley-Hazell-Hot-16.jpg\" target=\"_blank\">http://cdn.brosome.com/wp-content/uploads/2010/05/Kelley-Hazell-Hot-16.jpg</a> <br>\r\nAlina - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/IowoskK.jpg\" target=\"_blank\">http://i.imgur.com/IowoskK.jpg</a><br>\r\nMarie - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://thechive.files.wordpress.com/2014/03/maria-florida-1.jpg?w=500&amp;h=633\" target=\"_blank\">http://thechive.files.wordpress.com/2014/03/maria-florida-1.jpg?w=500&amp;h=633</a><br>\r\nValeria - <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-ash4/p480x480/997998_489224014491450_762953617_n.png\" target=\"_blank\">https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-ash4/p480x480/997998_489224014...</a><br>\r\nNina - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://1.bp.blogspot.com/-HdXSJlU6KPI/TbA0plq5IuI/AAAAAAAAMgU/wdmtzZGVsXs/s1600/3399786_f496.jpg\" target=\"_blank\">http://1.bp.blogspot.com/-HdXSJlU6KPI/TbA0plq5IuI/AAAAAAAAMgU/wdmtzZGVsXs/s1600/...</a><br>\r\nGaby - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://laforthefansfest.com/wp-content/uploads/2012/04/Gaby-Ramirez-Thumb.jpg\" target=\"_blank\">http://laforthefansfest.com/wp-content/uploads/2012/04/Gaby-Ramirez-Thumb.jpg</a><br>\r\nBeth - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://thechive.files.wordpress.com/2013/12/sexy-chivers-221.jpg?w=500&amp;h=666\" target=\"_blank\">http://thechive.files.wordpress.com/2013/12/sexy-chivers-221.jpg?w=500&amp;h=666</a><br>\r\nClaire - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://2.bp.blogspot.com/-BwmWKxB6b-Y/Uqtf6HqEfLI/AAAAAAAAFm4/xetlRpdizC8/s1600/...\" target=\"_blank\">http://2.bp.blogspot.com/-BwmWKxB6b-Y/Uqtf6HqEfLI/AAAAAAAAFm4/xetlRpdizC8/s1600/...</a><br>\r\nBridgette - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://s3.amazonaws.com/rapgenius/1354518175_1122975837_1352066026.jpg\" target=\"_blank\">http://s3.amazonaws.com/rapgenius/1354518175_1122975837_1352066026.jpg</a><br>\r\nSummer - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/R0k4S4t.jpg\" target=\"_blank\">http://i.imgur.com/R0k4S4t.jpg</a><br>\r\nChristine - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/wPh9Lxr.jpg\" target=\"_blank\">http://i.imgur.com/wPh9Lxr.jpg</a><br>\r\nVicki - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://cdn.sneakhype.com/wp-content/uploads/2013/08/vicki-li-vickibaybeee-pics-1-620x861.jpg\" target=\"_blank\">http://cdn.sneakhype.com/wp-content/uploads/2013/08/vicki-li-vickibaybeee-pics-1...</a><br>\r\nAmanda - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/1WypUDR.jpg\" target=\"_blank\">http://i.imgur.com/1WypUDR.jpg</a><br>\r\nChristina - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/7sG347e.jpg\" target=\"_blank\">http://i.imgur.com/7sG347e.jpg</a></td>",
        "id":1919479,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1546625160,
        "modified":1546625160,
        "pretty_title":"In the Hands of a Giantess"
    }
}