{
    "chapters":{
        "1":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">One day in a small town...a tiny boy walked down the street. <br>\r\nArthur had dissheveled black hair, <span class=\"cbrown\">brown eyes</span> and a warm smile, but his main feature was quite odd, as he only measured a few inches. He was perfectly normal apart from being as big as a doll. <br>\r\n<br>\r\nThat day he wasn't smiling as he walked thinking about his situation.<br>\r\nLately everything he tried went wrong, he though. Because of his size he had a lot of trouble to get along with other people, even though he tried his best to help.<br>\r\nHe had trouble making friends as everyone was too worried about hurting him and his knowledge about girls was very poor as he was only squished by them when trying to aproach them...<br>\r\n<br>\r\nThinking about all of this he saw a granny about to cross the street and offered to help her. The old lady thanked him and tell him that he seemed like a quite special boy.<br>\r\nThe word \"special\" echoed in Arthur's head... That was true, he was special...he could do things no one else could, his greatest weakness could be his power....<br>\r\n<br>\r\nHe could be a....a <span style=\"font-family:comic sans ms, cursive\">superhero</span>! He was so inmersed in his new thoughts that he didnt even notice the old lady being ran over....<br>\r\nBuuuuuuut.....he had decided to be a hero so he began to wonder if he should get some kind of cool costume or where should he begin his career as a defender of the justice.<br>\r\n<br>\r\nSuddenly, he heard someone's cries coming from the end of the street and he saw two figures in front of an ice cream shop..... </font><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/art/Prologue-1-Arthur-281140133\" target=\"_blank\">http://iarturoi.deviantart.com/art/Prolo...</a></span></div></div>",
            "created":1322456400,
            "id":1231308,
            "title":"Prologue 1: Arthur"
        },
        "11":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "What happens next? o.o"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">That day, in the same city....a beautiful girl waked up that same street...<br>\r\n<br>\r\nSarah was as cute as evil.<br>\r\nShe had dark brown hair (almost black) that fitted her, a pretty face and a very nice body that attracted most boys....<br>\r\nShe didn't care about them of course but she liked the thought of being able to manipulate them whenever she wanted to...<br>\r\nSarah was very clever and what we would call in any movie a \"mad scientist\" she could invent anything and she loved her machines. <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/gears.png\" alt=\"*Gears*\" title=\"Gears\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\nHer inmediate  goal to \"kill time\" was enslaving the whole world.<br>\r\nJust for fun, you know...<br>\r\n<br>\r\nThat morning she was particulary happy as it seemed like a fantastic day to make evil plans and she was planning to use her dear <span class=\"clred\">red button</span> to blow up the whole humanity...or something like that... she would think about it later.<br>\r\nThen she saw a boy eating an ice cream near an ice cream shop, and smiling she took the ice cream from him and began to lick it in front of the child. <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/cry.png\" alt=\"*Cry*\" title=\"Cry\" border=\"0\" width=\"15\" height=\"15\"><br>\r\nThe child started crying to Sarah's amusement but suddenly she heard a scream:<br>\r\n<br>\r\n\"Stop it!!\"<br>\r\nShe looked around, surprised by the sudden scream but there was no one around.<br>\r\n<br>\r\n\"Down here!\"  <br>\r\nA small boy the size of the ice cream she was holding right now was jumping in the ground.<br>\r\n<br>\r\n\"What do you think you are doing? Give back that ice cream right now.\" <br>\r\nSara was amused, the boy had guts to confront her.<br>\r\n<br>\r\n\"What are you going to do if I don't?\"<br>\r\n<br>\r\n\"As a hero, I'll have to punish you!\"<br>\r\n<br>\r\nSara raised his eyebrows, and ignored him as he began to punch her shoe,  she didn't have lots of patience so after a few punches she just kicked him.<br>\r\n</font><br>\r\n<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4pca5q\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4pca5q...</a></span></div></div>",
            "created":1322629200,
            "id":1232184,
            "title":"Prologue 2: Sarah"
        },
        "111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "In the laboratory...."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur was small but he was not  ready to give up on his new superhero fantasy.<br>\r\nAnd anyway he was decided to help that little boy so he grabbed the shoe as hard as he could.<br>\r\n<br>\r\nSarah, used to getting what she wanted when she wanted, shook her feet getting more and more angry with the little passenger and accidently dropped the ice cream.<br>\r\nTurning red with anger, she decided to calm herself counting to 10 and then she went back to her laboratory to show the little brat what she was able to, carrying him grabbed to her shoe. <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/home.png\" alt=\"*Home*\" title=\"Home\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\n</font> </span></div></div>",
            "created":1322629200,
            "id":1232194,
            "title":"Let's start the action"
        },
        "1111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Start transforming!!",
                "Start transforming!! Huh? It doesn't work!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Once in the laboratory Sarah puts the tiny boy under a glass mini dome and, like every supervillian that is really proud of himself, she exposes her evil plan (she makes it up mostly) to blow up all humanity while Arthur watches helpless. <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/earth.png\" alt=\"*Earth*\" title=\"Earth\" border=\"0\" width=\"15\" height=\"15\"><br>\r\nThen,and just as she is about to press the <span class=\"clred\">red button</span>, labeled with the word: <b>Boom!</b>......<br>\r\n<br>\r\n<font class=\"size1\" style=\"\">\"Listen, I really...\"</font>\".......Love you!!\"<br>\r\n<br>\r\n\"What?\"- Sarah stops, blushing shocked right before pressing the button.<br>\r\n<br>\r\n\"I said.....\"-Arturo says- \"....A hole behind you!!\"*<br>\r\nAs if summoned by Arthur, a wild <span class=\"cplum\">black hole </span>appeared, absorbing the button.  :D<br>\r\nThen it dissapeared as it came, leaving Sarah with her mouth open wide, <br>\r\n<br>\r\nMeanwhile, Arthur had raised the dome and was trying to escape jumping from the table and falling...<br>\r\nIn the hands of the angry scientist....    ¬¬<br>\r\nShe had lost what little patience she had.<br>\r\nShe was decided to humilliate and crush the boy who kept defying her.<br>\r\n<br>\r\nJust then she had a brilliant idea as the boy slowly took the form of a guinea pig in her head.<br>\r\nAnd she was just dying to try her new transforming ray in humans!!   *^*<br>\r\nShe put back the boy under the dome and put on her scientist glasses as she took out her ray and pointed it to Arthur.<br>\r\n<br>\r\n\"Black hole?...please...come back... \" T.T</font><br>\r\n<br>\r\n<font class=\"size2\" style=\"\">*This joke was kinda funnier in spanish as \"Te quiero\" sounds very similar to \"Agujero\"</font><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4rpwi2\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4rpwi2...</a><br>\r\n<a rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4t8uxq\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4t8uxq...</a></span></div></div>",
            "created":1324443600,
            "id":1243694,
            "title":"Trapped!! ó.ò"
        },
        "11111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Sarah keeps investigating.",
                "Sarah uses Arthur as a sponge."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah pressed the button while smiling and a ray struck our hero.<br>\r\n<br>\r\n\"Let's investigate\" ^^<br>\r\n<br>\r\nA small cloud rised and when it vanished there was.... a cap,... a cap with eyes...<br>\r\n<br>\r\n\"Mmmmm interesting... I wonder what will happen if...\"    <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/gears.png\" alt=\"*Gears*\" title=\"Gears\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\n<br>\r\nSarah began to press again and again the button and Arthur was transformed into a clock, a toaster, a sponge....<br>\r\n<br>\r\nThen Sarah had an idea...</font></span></div></div>",
            "created":1332306000,
            "id":1299218,
            "title":"Cool, transforming ray!"
        },
        "111111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Arthur has dissapeared!",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">She decided not to stop and she wanted to have fun with the transformations.<br>\r\n<br>\r\nAs Arthur transformed into a scarf she put it on and went for a walk.<br>\r\nShe used that time to think about what else she was going to do. Arthur tried to move without succes, wondering what was going to happen to him.<br>\r\nWhen he was taken again to the laboratory, Sarah transformed him into a rubber ring, she grab him and took him to the swimming pool where<br>\r\nshe threw him into the water. <br>\r\n\"Don't you think you shold be more supportive with me?\" -she asked, grinning-<br>\r\nHe could only watch as her butt descended upon him. She relaxed staying on top of him and sqishing him while he was unable to move...<br>\r\n<br>\r\nNext transformation wasn't nice for him either, when he realized that he had become spheric he tried to beg but it was in vain. <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/baseball.png\" alt=\"*Baseball*\" title=\"Baseball\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\n<br>\r\nSarah put on a nice white miniskirt and took him to the court where she played tennis with him a few hours against some girls.<br>\r\nArthur was hit once again this time against the rackets of various girls as they giggled knowing his predicament.<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bigsmile.png\" alt=\"*BigSmile*\" title=\"BigSmile\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\n<br>\r\n\"Well, I'm having a ball\"- said Sarah<br>\r\n\"Oh c'mon on top of it, bad jokes?\" -thought Arthur<br>\r\n<br>\r\nArthur felt so humilliated and angry.<br>\r\n\"I am not some girl's toy, I am a hero!!\"<br>\r\n<br>\r\nSarah payed him no attention as he brought him back to the laboratory bouncing him all the way...<br>\r\n<br>\r\nThat's when his chance arrived. The ray had put his body in an unbalanced state, when Sarah was planning how should she use him again, he started transforming without even being hit by the ray.<br>\r\n<br>\r\nHe got transformed then into a little octopus and he jumped to Sarah's face while she tried to escape his embrace and get free from his grip.<br>\r\nThen Arthur changed again, when the poof cloud vanished, Arthur appeared as...a normal boy!! He was average sized!<br>\r\nBut as he looked in front of him he realizes that he was locking lips with Sarah.<br>\r\n<br>\r\n(Kiss!?!?!?) <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\n<br>\r\nHe was grabbing her face as an octopus so when he changed he was in more or less the same position..<br>\r\nAnd both of them stayed with their lips together for a few seconds without knowing exactly what was happening.<br>\r\nThen, suddenly another poof! stoped them right there.</font><br>\r\n<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4tnx7e\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4tnx7e...</a></span></div></div>",
            "created":1332306000,
            "id":1299222,
            "title":"More investigation"
        },
        "1111111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Chapter 2",
                "He decides to get revenge right then!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah looked around without knowing exactly what to do, she had just kissed with that boy!<br>\r\nShe didn't know if she had to be angry or happy or what. She looked around... he had just vanished!<br>\r\n<br>\r\nThen she looked down to see the boy, tiny again and bleeding while looking up. <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/up.png\" alt=\"*Up*\" title=\"Up\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\nShe was wearing the laboratory robe...<br>\r\nThe boy wseemed shocked for some reason...<br>\r\n<br>\r\n\"They are black....\"- he mumbled<br>\r\n<br>\r\nSarah understood then the reason of his nosebleed and clenched her fist trying to hold her anger... <br>\r\n<br>\r\n\"You little... \"         <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/angry.png\" alt=\"*Angry*\" title=\"Angry\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\n<br>\r\n\"Oh, oh...\" -he knew she was angry but couldn't stop looking at her underwear, it was too sexy even though he didn't consider himself a pervert <br>\r\n<br>\r\nShe raised her foot and the boy looked up in shock as her sole descended on him smushing him completely to a shapeless mush...<br>\r\n<br>\r\nBut he didn't die, apparently the repetitive exposure to the ray had turned him into a sort of rubber human, Sarah picked him up and peeled him off her shoe, he could be stretched and squished as she veriefied.<br>\r\nShe stretched his face and his body while he tried to escape from her hands.<br>\r\nShe kept squashing him amazed without saying a word while the boy was played with.  <br>\r\nFinally, she spoke.<br>\r\n<br>\r\n\"So just like gum huh?\" -she grinned<br>\r\nWith that she trew him into her mouth and began chewing him. He tried to scream but was soon too squashed to talk, smushed again between her teeth, grinded and crushed like a gum.<br>\r\n<br>\r\n-Mmmm.... you taste like strawberry boy- she said giggling.<br>\r\n<br>\r\nShe started having fun and even blew bubbles with him.<br>\r\nAfter a while she got tired of it and spit him in her hand, then she molded him into a little ball and opening the door she threw him out of her lab.<br>\r\nIf you ever come back I will keep having fun with you tiny! -She laughed and got back in-.<br>\r\n<br>\r\nArthur slowly reformed from the beating and when he finally could move and looked like a human again he cried a bit.<br>\r\nHe was wet and humilliated and he felt defeated as a hero...<br>\r\n<br>\r\nNo! -he thought- I must stay strong I won't surrender and I will definitely defeat her.<br>\r\n....But first I need a bath- and he went  walking back home.<br>\r\n <br>\r\nEnd of Chapter 1</font><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4v8j6w\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4v8j6w...</a></span></div></div>",
            "created":1333602000,
            "id":1310009,
            "title":"Black?!"
        },
        "11111111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "The door opened and four Sarahs walked out of the booth",
                "The door opened and something else happened to Sarah"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">It was Sunday, the sun shined down on the kids who were playing in the street, everyone seemed happy. Sarah was happy too, she was in the refreshing environment of her laboratory with air conditioning. She was working on her latest invention, a machine developed to separate molecules depending on their affinities. It had been a complete success and she was trying to simplify so i could recognize now the bigger parts of different objects and basically dismount them. Inmersed on her work, brazing a capacitor she didn't notice the shadow that passed next the machine.<br>\r\nShe got up and stood up proud, in front of the open booth that was her new invention.<br>\r\n<br>\r\n\"Whew! Finally finished, hehe, now it's the time to test it out.\"<br>\r\n<br>\r\n\"I couldn't agree more\" <br>\r\n<br>\r\n\"Whaat? Aaaah!!\"<br>\r\n<br>\r\nSurprised by the voice, she tripped on a tiny feet and fell on the inside of the booth. She got up furious just to see the transparent door closed and cursed not having put a doorknob inside. Arthur had walked smiling to the control panel and had a grin on his face while looking at the trapped girl who kept calling silently from the sound proofed booth.<br>\r\n<br>\r\n\"Sorry, but I can't seem to hear you.... Are you telling me to push this button?\" He said while looking at the button that would turn on the machine, he didn't know what the heck it could do but probably it wouldn't kill her and she probably would deserve it.<br>\r\n<br>\r\nShe shouted while shaking her head telling him not to push it.<br>\r\n<br>\r\n\"........:!!!!!\"<br>\r\n<br>\r\n\"Well, okay then, I'll press it\" And so he did it.<br>\r\n<br>\r\nSmoke rised up like it always happened when using her inventions to give it a little dramatism.<br>\r\n<br>\r\nThen....</font><br>\r\n<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d58sk4g\" target=\"_blank\">http://iarturoi.deviantart.com/#/d58sk4g...</a></span></div></div>",
            "created":1342933200,
            "id":1385656,
            "title":"Fixing issues"
        },
        "111111111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "One of the girls looking down on him, smiling cheerfully"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">As the door opens Arthur gets ready to run but before he has time to think a naked Sarah gets out and passes by him without even looking to him. The little boy was completely shocked not only she seemed cheerful instead of angry with him but there was also the fact of her being completely naked.\"Huuh?!\" <br>\r\nThe boy was still recovering from the shock when another girl who looked pretty much like Sarah too got out of the booth and walked away in the same way the other girl had. She was also naked but she seemed angry and her hair looked different... The boy was flipping out with too much things to process when another girl got out and another one! The two girls looked alike but  they also seemed different... He fell to the ground butt first bleeding from his nose. Too much nakedness for him, he was completely stunned, so he stood there for a minute looking the machine.... it seemed like it was over, nothing else was in it so after some deliberation, he got up again and prepared to leave, considering it the wiser option given the fact that now four girls were now on the loose, they haden't paid him attention the first time when they didn't have clothes but that might change so he turned to find. </font><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/art/Arturo-y-Sara-capitulo-2-2-327561902\" target=\"_blank\">http://coconocotoco.deviantart.com/art/A...</a></span></div></div>",
            "created":1347771600,
            "id":1429293,
            "title":"Four times crazy"
        },
        "1111111111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "She is not planning on letting him go"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">As he turned around he found himself being lifted up in the air by a cheerful looking girl, the first who had come out of the machine, in fact, she was now fully dressed, which was strange because just a minute before, he was sure to have seen her naked. Anyways, the girl smiled at him and while a bit scared at first he relaxed a bit when he heard her \"How cuuute!\" After that she started playing with him, she introduced herself as Sarah and before giving him time to ask her anything else, she began throwing him up and down gently, and then started spinning while holding his hands. Arthur couldn't help but laugh with the girl while spinning, that was until he found himself free falling.<br>\r\nThe girl who was holding him seconds before looked at her hands with surprise wondering what had just happened with her new friend while the little boy screamed flying in the air... <br>\r\n<br>\r\nHe slammed against something soft with a loud BOING and then bounced back falling in a table, stunned. Then he looked up to see a humongous pair of boobs in which he had just bounced \"Whoa! They are hu...! I mean...\" he stopped as he saw the face of the girll who looked down on him... she seemed angry and her clothes made her look kinda badass. She was beautiful but didn't seem very happy with him crushing in her breasts. He tried to retreat looking natural \"Well...I was just... you know... passing by... so I'll be leaving...sorry by the way... byee...\"</font><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/#/d5fd2rq\" target=\"_blank\">http://coconocotoco.deviantart.com/#/d5f...</a><br>\r\n<a rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/#/d5fiwuw\" target=\"_blank\">http://coconocotoco.deviantart.com/#/d5f...</a><br>\r\n<a rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/#/d5fixzq\" target=\"_blank\">http://coconocotoco.deviantart.com/#/d5f...</a></span></div></div>",
            "created":1348549200,
            "id":1435007,
            "title":"Happy or not?"
        },
        "11111111111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "He bumps against.... (don't use)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">She grabbed him by his shirt and raised him until he was looking right at her face \"Well, well, well, what do we have here?\" She frowned \"So you like this pair huh? Maybe you'd like to try getting up close and personal?\" She started lowering him a bit and opened her mesh shirt, letting exposed her breasts. \"No, thanks, I'm okay, I'll just go now\". She grinned, still frowning and let go of him \"I must insist\". He fell screaming while she let go of her shirt sending him crushing against her right boob, mushing his face right against her nipple and effectively silencing him. She laughed a bit \"What do you think about my ample bossom?\" She squeezed a bit her arm against her breast crushing him again. \"Mmmmphphhh\" She just looked down and sighed feeling the power.<br>\r\n<br>\r\nThe tiny boy wasn't going to give up this easily, not then, not ever. So he struggled getting his face more smushed against her nipple but finally letting him out from his prision escaping from one of the holes and falling with a cool pose in the table.<br>\r\n\"Why you little...!\" He didn't wait for her to finish and jumped down the table, running to get somewhere safe where he could plan something. The grumpy Sarah, not amused with the little pest escaping, chased after him. \"You are gonna get it!!\" He ignored her and kept running. But when he passed a table where another Sarah played around wiht some books and some kind of chemistry. Unfortunately for him, he caught her attention, making her suddenly worry about the way he would respond to some of her experiments.<br>\r\n<br>\r\nThe boy now run down the hallway chased by two Sarahs trying to find some entertaining at his expense...</font><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/#/d5p42hv\" target=\"_blank\">http://coconocotoco.deviantart.com/#/d5p...</a></span></div></div>",
            "created":1356389340,
            "id":1494207,
            "title":"Boobsmushed!"
        },
        "11111112":{
            "author_id":"kentwolf",
            "author_name":"Kentwolf",
            "choices":[
                "She decides to mold him into a piece of underwear or swimwear.",
                "She decides to use her transforming ray to turn him into something else fun."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">He pauses, wanting to get revenge on her for what she did but decides he needed time to plan, he runs. not paying attention to where he was, he runs away as fast as his little legs can carry him in case she decides to toy with him more. <br>\r\n<br>\r\nIt had been a couple of weeks since Arthur's mis-adventure with Sarah. In that time he had tested out his new powers of survivability, sometimes intentional sometimes by accident. Walking down the street had become slightly more dangerous, as he now knew he couldnt die, his brain didnt seem as sharp to danger for jumping out the way instinctivly. <br>\r\nHe had spent hours stuck under the soles of various shoes, sat on various benchs by many women and was amazed by his ability to reform, he noticed the longer he was crushed the longer it took to reform. he had ended up mistaken for a lump of fleshy clay in a pottery shop a week ago and had been sculpted into a beautiful glazed pot. he wasnt sure if the glaze was what had held him in the shape or if it was the heat of the kiln but even after he had been accidently knocked off the shelf by a customer, it had taken him a good 36 hours to reform once free from the glazing. he hoped no one would mold him into something like that, he didn't like the idea of being stuck in a shape that was used.<br>\r\n<br>\r\nHe had run out of Sarah's lab so fast that he hadnt noted its location but he needed to get revenge on her. he kept his eyes peeled even on the shelf of the pottery store. Finally, dressed in his stretchy little green superhero costume, Arthur spotted her walking down the street. She had used a freeze ray on someone and taken their coffee from their grasping hand. the look of shock frozen on their face. <br>\r\n<br>\r\nIt was time for Tiny man to leap to action. He ran across the street towards her, jumping and dodging feet as he kept his sight on her. He couldnt catch up to her with her large confident strides. He was sweating heavily by the time she got back to her lair. he ran the last bit of distance as her door shut behind her. Leaping, he tried to get through, feeling the door pinch tight on his legs as they closed on him. <br>\r\nHe landed on his hands, his legs stuck, he glanced back at them as he heard a chuckle above him. Glancing up he saw Sarah sipping the coffee looking down at him. <br>\r\n<br>\r\n\"You really thought you could sneak up on me in that bright outfit? You're not too smart are you tiny\" -she chuckled \"- or maybe you came back for more fun testing.\"<br>\r\n<br>\r\nShe crouched down to avoid showing him her panties and pinched his head tightly between her finger and thumb, pulling hard, stretching out his malliable little body before his legs finally slipped from the doorframes grip, twanging back like a rubber band. she began rolling him into a little ball in her hand as she strolled into her lab more. <br>\r\n<br>\r\n\"Hmm now...i could try out my transformation ray on you again...then again i could always mold you into whatever shape i wanted...hmm i planned to go to the pool and your suit is a nice colour...maybe i could stretch and mold you into a nice onepiece swimsuit. Hmm or a nice seat cushion...so many possibilities...\" <br>\r\n<br>\r\nShe had finished her coffee and had begun tossing his balled up shape from hand to hand casually while she decided what to do to him...</font></span></div></div>",
            "created":1334120400,
            "id":1313299,
            "title":"In need of a rest..."
        },
        "111111121":{
            "author_id":"kentwolf",
            "author_name":"Kentwolf",
            "choices":[
                "His body slowly reforms before the wash load.",
                "The heat has baked him into this shape, he is stuck for the moment..."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Her chair creaked lightly as she sat down throwing him from hand to hand \"hmmm yeah i think i will save the transformation ray for when i run out of fun ideas to try on you my little arch-nemesis toy boy!\" she said mockingly before glancing at the ball of fleshy putty in her hands. her eyes widened in shock. <br>\r\nSomehow, defying all laws of physics, his green suit being squished and grinded to much with him seemed to have merged, at least for now, leaving her with a complete green slightly shimmering blob in her hand. <br>\r\n<br>\r\nHer shock quickly got replaced with her usual confident grin \"oh this is too good. i guess i dont have to dye you\" she smirked and threw him down hard on the desk surface, watching as he flattened out from impact into a disk. he felt dizzy and stunned from the impact as he watched her hands race towards him. <br>\r\nShe smoothed him down, stretching him out more and more, pinching and pulling in places humming \"happy working song\" from disneys enchanted as she did her evil deed. she pinched at the edges, peeling him from the work surface with a sound like a band-aid being ripped off before grabbing him in the middle with both hands, a few quick twists and he had a twisting knot in the centre of his flat body, long dangling stringy parts stretched out dangled limply behind him, his punished body in no hurry to recover from the ordeal, possibly slowed down by the merging of the fabric of his suit. <br>\r\n<br>\r\nShe chuckled -\"ooh, how cute\" she said mainly to herself before carrying him off to her room, throwing him down on the bed. he stared up at the ceiling feeling every tiny inch of his aching abused body, stretched and molded in ways far beyond what a human brain was designed to handle, it felt like the pottery store all over again. <br>\r\nAll he could do was look upwards at the light glaring down at him. He could hear her opening and closing drawers, he could hear the russle of fabrics as she got changed before he saw her hand reach down and grab him. holding him tightly as she picked him up.<br>\r\nThe view he now got was surprising and alot better than his previous view. She was topless, smirking at him. He was confused before finally his brain caught up. <br>\r\nHe had stringy straps, he was twisted into two semi-circles. She had shaped him into a bra or bikini top of some kind. <br>\r\nHe could see the strings of a green bikini bottom sticking out from her jeans and realised he was going to be worn and going to be wet. <br>\r\n<br>\r\nShe turned him around, away from her breasts and he felt her grab at the \"strings\" tying them into a firm and tight knot, pulling him tight against her chest. He could feel her nipples sticking into his back as her hands covered him up, shifting him about to make sure he was positioned correctly. he struggled, only managing the slightest movement. no luck in loosening the knots holding him to her, but he rubbed against her nipples, causing her to let out a gasp and a coo \"oooh someone likes his new position i take it!!\" She laughed and her hands stopped covering him, but soon his vision was covered by a loose white top, the white fabric filling his view. he could only listen to the world as she strolled towards the nearby water park, feeling her breasts jiggle in his tight confinment. She had clearly done a good job on the sculpting, he held them perfectly and his struggles just made her nipples stiffen and poke him more. <br>\r\n<br>\r\nFinally he got to see the world again inside the locker room, watching her stuff the clothing into a locker and stroll out into the park.<br>\r\n-\"Hehe ive never let a boy get this close to my heart before\" she joked down at you, smirking at your silent imprisonment, displayed across her chest with the world completly unaware she held a human life in her grasp. She certainly felt very powerful right now. He could do nothing to stop her. He was her toy, her plaything. <br>\r\nAnything she wanted. <br>\r\nRight now, he made a very cute bikini top. she wondered how long she could get him to keep his shape. She could wear him for jogging, swimming and just everyday wear as a bra. It would be interesting to see what happened to him if she ran him through the wash, and he was certainly comfortable enough to wear. Far softer with much better support than a real bra. She chuckled to herself. <br>\r\n<br>\r\nIt was a hot day, as she cooled herself in the pools, he got soaked through, and as she laid about tanning and drying in the sun, she could hear a faint sizzle as his body heated up. unlike her, he had no lotion on him to protect from the sun. She was curious if the intense heat of the day would have any fun effects on him but she saw nothing. Eventually she head home, untying the knot and peeling him from her body, she dangled him by a string admiring her handiwork, his body had been molded into perfect cups to hold her breasts from the long day of being worn so tightly, no longer just flat semi-circles. <br>\r\nShe dropped him ontop of a pile of dirty washing and walked off to get changed. <br>\r\nHis body felt weird to him, he could feel the curves in his body even when she took him off, he was staring at differant angles now. the smell of stale sweat from the clothes under him made him want to gag, but he had no visible mouth right now to do so. he waited and waited for his body to reform, hoping to escape like last time and plan his revenge...</font></span></div></div>",
            "created":1334120400,
            "id":1313549,
            "title":"Close to her heart"
        },
        "1111111211":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "He manages to get out.  It's already night",
                "Everthing is automated. He get's thrown in the washing machine."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">While a lot of time went by he could feel his body reforming bit by bit, he was given a new chance, the cup that were holding before Sarah's breasts sttreched and went back to their original form as part of Arthur's body, after a long time he finally was back to being a tiny boy. Now the problem was the fact that he was buried by a huge amount of clothes: T-shirts, bras, jeans, panties... he tried to get out but he kept getting dangled in underwear, socks, and being slowed down.<br>\r\n</font></span></div></div>",
            "created":1335675600,
            "id":1325145,
            "title":"Back to being a boy"
        },
        "11111112111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "To go and mess with her while she is sleeping",
                "To find a good place to hide."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">After lot of struggles, Arthur manages to get out with a pair of panties in his head. He throws them aside and looks around him. Everything is silent and dark. He starts exploring the house a bit and sees what is a normal house mixed with strange passages. He tries looking at the normal rooms first and he blushes when he finds Sarah. With a top and a pair of panties she is sleeping in a big bed on top of the covers and drolling a bit.<br>\r\nShe is stunningly beautiful and the boy can't help but look in awe at her. He recovers a minute later. I can't afford to stay here, I have to get out. <br>\r\nHe keeps exploring the house till he gets to the door and while he manages to stretch a bit while jumping and get to the knob it is locked so he is trapped for now.<br>\r\n\"Okay, -he thinks aloud- I have to get rid of the ray, if she crushes me while I'm like this, I can reform with time but the transformations are more dangerous\"<br>\r\nKnowing now the structure of the house, he finds quickly the part of the lab where she has the big ray and starts messing with the cables and damaging it as much as he can.<br>\r\nWhen he is sattisfied with his work he thinks: \"That will keep her from using it for some time\"<br>\r\nThen he has to think of something else, he has now the advantage. He decides that the best option is:</font></span></div></div>",
            "created":1335675600,
            "id":1325157,
            "title":"Night attack"
        },
        "11111112112":{
            "author_id":"kentwolf",
            "author_name":"Kentwolf",
            "choices":[
                "Machine mistook him for a broken thong using his limbs to make a thong with him.",
                "Machine mistook him for a broken thong and moulded him into one."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur finally managed to poke his head out with a sock over his head. pulling it off with a grunt he looked around. for the past couple of minutes he had heard a mechanical whirring noise, now he was ontop of the pile he saw what it was. Mechanical arms with a deep scooping shovel came down at the pile and before he could even yell in shock he was scooped up with the clothes, the shifting motion of the mass of fabric sending him tumbling down as they poured over him from the shifting gravity, trapping him at the bottom of the pile once more. <br>\r\n<br>\r\nHe franticly grabbed at the metal below him, trying to hold on as it shifted and tipped the clothing pile into the automated washing system. the heavy mound of clothes hammered into him as he clung on to a screw head, his poor little arms stretching out painfully from the extra weight pressing down on him before he finally lost his grip, his spagetti string arms dangling limply as he slid down into the dark machine, landing softly ontop of the clothes before more fell ontop of him pressing down on him. <br>\r\n<br>\r\nHis struggles to get free were cut short as he heard the gurgle of water pouring into the machine and the soggy clothing sucking up the moisture added to their weight, pinning him in their mass like thick clay, then, the spinning began. round and round he spun, dizzy beyond belief as the pile deteriorated, slapping wetly against the metal walls over and over, poor Arthur was no differant, his body slammed hard against the unyealding chrome over and over, flattening him out again, twisting him over and over, his arms having no breathing space to reform. His body was flat but stretched out by the g-force he was being put through, he foolishly tried to hook his feet in one of the drainage holes of the machine but the speed he was going he just ended up with legs to match his spagetti arms. <br>\r\n<br>\r\nAfter what felt like an eternity of being hit in the face by wet clothes and painfully spun around in a metal container the washing cycle came to a stop. Light filtered in as the ceiling opened up, the mechanical arms reaching in and scooping the wet clump from the machine, Arthur sighed, glad it was over...then he was dropped, the wet clothes slapping wetly around him as he fell into the dryer. he whimpered quietly as it began to spin, instead of water this time, he had to deal with intense heat. His body went red from the heat it was like being trapped in a oven. He blacked out from it. the machine carrying on its duty. after an hour the contents of the machine were poured out onto a short conveyor, arms scanning the shape of each item, ironing them smooth of creases and folding them to be stored away. Skirts, dresses, tops, the machine knew all the shapes. finally it came to the unconcious Arthur, his flat body twisted and misshapen, his arms and legs stretched out long like strings. it paused unsure of this irregular shape before deciding it must be damaged clothing in need of repair. he was lifted up by his \"strings\" and carryed to a repair station of the machine. It fixed him before ironing him smooth of creases, before he was folded up and put away in a drawer.<br>\r\n<br>\r\nHe slowly regained conciousness in the dark of the drawer. he could smell the scent of freshly cleaned clothes all around him. he tried to move but couldnt, his body hadnt reformed at all, the machines repairs was holding him quite firmly in his newly given shape. he tried to call out but his voice was quieter than usual, it was hard to speak. finally the drawer was opened and he saw a naked Sarah peering down at him. Her casual expression turned into a huge grin at the sight of him \"oh i had forgotten about you...hehe. looking good little toy\" she said picking him up to put on. he caught a glimpse of himself in the mirror as she walked past it...</font></span></div></div>",
            "created":1335762000,
            "id":1326206,
            "title":"Automated"
        },
        "111111121121":{
            "author_id":"kentwolf",
            "author_name":"Kentwolf",
            "choices":[
                "life as a thong",
                "life as an insole. "
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">His torso was still kind of flattened out from the long session of impacting the metal walls of the washing machine drum, his long spagetti arms and legs however, were far worse off. mistaking him for a damaged thong the machine had used his arms and legs as the straps as it tried to repair him. his hands and feet were tied together in a very tight knot barely noticable and impossibly tight for him to pull free from, infact the more he tried, the tighter it felt. he paniced. if she put him on, stretching out might tighten the knot even more. <br>\r\n<br>\r\nhe was suddenly tossed onto the bed as she gathered the rest of her outfit and laid it out beside him, he was still slowly reforming \"...let....me...go\" he said quietly, his flattened body barely able to make a sound. Sarah turned at the sound of his words, glancing over her shoulder at him and a smirk appeared on her beautiful but evil face \"my my, quite demanding for a thong. hmm i dont think i will, you didnt say please\" she slipped into a lacey black bra strolling over to him. \"please, please!!\" he cried out desperatly. she just chuckled \"too late, you didnt ask nice until told. you have to learn some manners\" she smiled picking him up between her fingers, pinching tightly at the knots causing him to cry out, her nails digging in. she lifted one leg into the gap between his bound limbs and his torso, then the other. Arthur cringed seeing his position \"at least turn me around to face the other way!!\" he pleaded but she just chuckled, her face hidden by her breasts from this angle. she pulled him up her legs, snapping the straps into place as his face pressed into her sex.<br>\r\n<br>\r\nhe felt her pause \"hmm actually i will do what you asked\" he found himself pulled down her legs again and turned around. he whimpered knowing pleading again would be useless. he had meant for her to turn him around so he faced outwards, she in her wicked mind had decided to turn him so his face, rapidly shooting up her legs, went straight into her ass crack. he grunted as the cheeks tensed and crushed his head on either side as he slid between them as all thongs do. he tried to speak but he had no space and his face was crushed flat. all Sarah heard when she really tried to listen for it was the faintest grunt coming from her ass. she grinned, no one would hear his crys for help when she went out. <br>\r\n<br>\r\nshe slipped into a nice dress and practically skipped out the door, happy in her torture of her new fun little toyboy. for Arthur however it was hell, each step crushed his head and upper body from one side, then the other. it felt hot in her ass and he was sweating like mad, which only made his flat little abused body stick to her slick skin more leaving no hope of wriggling loose. as the day went on he tried crying for help but no one heard him trapped deep between her plump ass cheeks. he listened to their muffled voices as she went about her day being evil, stealing candy from children, covering up stop signs on the road, pouring a cup of coffee onto a rack full of white wedding dresses. she was having a great day and all he could do was listen. some hero he was, trapped in her ass and acompanying her as she did her evil deeds. <br>\r\n<br>\r\nfinally she head home, he could feel the sudden air conditioning even through the flesh pressing in on him. he was as flat as he could be, wedgied up her butt but she didnt seem to mind, probably because she knew it was far worse for him. he felt her grab his \"straps\" and pull him down. he stretched a bit as she kept her butt cheeks clenched, before he slowly slid out and snapped down like an elastic band. she stepped out of him and looked at him with glee, his face was smooshed into a little string, his body out of shape and thin too. she laughed \"well you certainly are more thong shaped now little toy boy\" she teased \"but what to do with you...i could keep you as a living thong forever, knowing that im really keeping my enemies close. hehe...or i could just crush you into the shape of an insole...i do have some very sweaty gym shoes that need some cushioning for my run tonight...\" she said, more to herself as she tried to decide...</font></span></div></div>",
            "created":1336712400,
            "id":1334433,
            "title":"Her new thong"
        },
        "1111111211211":{
            "author_id":"orez",
            "author_name":"face-seat",
            "choices":[
                "To the gym",
                "To the store to try pants on that would be more comfy for her than him"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Once un-scrunched in her hands, the boy's fearful face made her decide exactly how she wanted him to be \"A thong for life it is then! \" she winked down at him before putting her legs back through the holes. \"Come on!\" he replied fearful of what his life would be like now \" At least change where my face is! I don't wanmrrpphh\" His pleads were stopped short as she yanked him all the way back up.making sure to wedge him with a smirk on her face before she started to pull the panties back, giving him space but still rubbing against her cheeks \"What was that little boy?\" He tried again \"I said I-mrpphh!\" She couldn't help but to play this game with him wondering when he would learn to wise up. After more then a dozen (could it have been even 50?) times he was silent when she asked that question, \"Whats that?\" she asked \"You want to know how to serve me?\" reluctantly he sighed and answered \"Yes Sarah\" she jumped up and down at his first sign of submission to her, her panties bouncing against her. After she stopped jumping, she sighed and grinned \"Well now boy, now that that's settled, we're going to...\" she stopped in mid thought. Where should she go to?</font></span></div></div>",
            "created":1352425200,
            "id":1464054,
            "title":"Life as a thong"
        },
        "11111112112111":{
            "author_id":"orez",
            "author_name":"face-seat",
            "choices":[
                "Yoga!!",
                "The sauna!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"To the gym!\" Sarah grinned, as she bounced a bit to feel Arthur to bounce against her cheeks. She then put on some jeans that were a bit baggy but still squished the poor boy against her ass cheeks again \"Now then shall we go?\" Sarah asked Arthur, which he was trying the silent treatment. Of course that was a terrible idea because after a good 30 seconds of it, Sarah wiggled in her pants grinding and inflicting all sorts of pain his poor little body. \"Owww!!\" Which of course only came out as \"MRPPH\" Sarah grinned and sighed \"Ahh, much better!\" and so she walked to the gym<br>\r\n<br>\r\nTo any person who was watching Sarah, she seemed odd as she skipped, hopped, jogged, and dance down the street, To Arthur he was in one painful posistion after another, with each squeeze, jump, and move he was contorted, twisted, and sliding between her cheeks of pain. He tried not to scream into her butt, A hero doesn't give in to the villain! But unfortunately, every time he braced for one type of pain, she would change the way she was moving, from dancing to skipping, to even bunny hopping. About half way there Arthur couldn't take it anymore and started screaming, over and over. Sarah was startled at the muffling she felt from behind her, but then smiled brightly and whispered behind her \" If you keep that up, I might walk more easily\" before turning back around and walking calmly, only getting a occasional odd look.  Of course Arthur struggled to keep quiet again, struggling against her again, which made Sarah even more happy to jump, skip and hop the rest of the way. \"Such a great day!\" she said to her self.<br>\r\n<br>\r\nBy the time they got there, Sarah was energetic, ready to start her workout, however Arthur was ready to quit. He wasn't sure how much he could resist her anymore, especially with things looking like they were going to get worse and never get better. once Sarah was in the changing room, and by her self she decided to make Arthur a humiliating deal \"Ah! Wasn't that a refreshing walk? Hmm you seem to be a little worn out, and were only just starting! Tell you what shrimp, if you show me that you can be a good little thong, I'll give you a break! Allll you have to dooo is kiss! just give a couple of kisses to show you love your new place\" Arthur was beaten down, but he was not broken! \"No a hero would never kiss a villain, not on the face and especially on the butt!\" Of course it just came out as the usual \"Mrpph!\" and wiggling in her ass which was no skin off Sarah back. \"Ok then! off to the stair master!\" as she started to hop over to the machine she felt it. Subtle at first but his frantic kisses was getting easier and easier to feel \"There that wasn't so hard now was it?\" She grinned<br>\r\n<br>\r\nShe then took a seat and enjoyed the feeling of him back there for a bit \"Enjoying your break?\" she asked knowing he couldn't answer back \"You know, I think I like talking to you, your always so... agreeable!\" she chuckled. After half a hour of resting on a bench she then changed into her yoga pants shoving poor Arthur deep between her cheeks \"Now then all tight and snuggly? Just like you like it?\" she wiggles a bit while getting her sweat shirt on \"Now... what should I do?</font></span></div></div>",
            "created":1352708340,
            "id":1466174,
            "title":"To the gym!!"
        },
        "111111121121112":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "They start using him",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">When Sara finished her exhausting exercises she prepared to leave when some girls who went the same days as her approached her inviting her to the sauna with them: \"Hiiii! I’ve seen you before! Wanna try the sauna with us? It’s rumored to be tough but I’m sure we can handle it! The girls laughed.<br>\r\n “That’s okay, I didn’t have plans right now sooo…. Okay! I’ll even bring a surprise....” The girls didn’t really understand what she meant so they just smiled and waited for Sarah to get ready. She run to the locker room and changed cloth to towel, grabbing the little one and going back to join her new friends in the sauna chamber...<br>\r\nThey entered the chamber... it was incredibly hot in there! \"Oh my... it’s so hot in here... and why are you standing?\" she asked... \"Oh, c’moon, it’s too hot to sit anywhere. Even towels are not enough… I think this challenge is a bit over our possibilities\"... <br>\r\nOn Sarah's face an evil smile appeared…  \"You know... we HAVE something that could help\" She showed them Arthur...The girls looked at Sarah, confused, he is alive and he is mine, but most important…. He is like rubber, insulating… and he can be stretched so… the girls started to understand and giggled \"Are you saying what I think you are saying? but how do we use him? He is so small\" ... Evil Sarah knew what to do… “Aaaw dummy! I’ll show you! You see... to stretch him you just need too\"....Poor Arthur was going through hell... \"Grab his legs and arms\" Sarah said… \"I will grab his tongue\" she continues... The girls did as Sara ordered with a big smile on their faces... \"Now pull as hard as you can!”<br>\r\n“But wouldn’t that be painful for him right?” one of girls asked... Arthur tried to meddle “Yeah, think about that!!” “Of course! And that's what makes it so funny” Sarah said with a huge smile, showing everybody her amusement.... The girls then stretched the poor little one in every direction. “So what now Sarah?” She thought for a second and answered “Now we simply put him on the floor” But won’t it burn him? I mean the heat?” Sara laughed “YEP! And our cute butts will have a comfy seat!” <br>\r\nSo the girls put Arthur on the floor, and then without Sarah saying a word they started stepping and jumping on him to flatten him completely facing up. Dianna, the brunette girl with the wide hips smiled devilishly while stepping on him again and again while Jeanne, the blond one blushed as she stepped on his face... “Oh boy, he screams so much...When he was perfectly stuck to hot floor, The girls looked at him and Rose pouted at his cries “poor thing...” Sarah answered \"Hahahaha, he’s like that all the time\" <br>\r\n</font></span></div></div>",
            "created":1361273580,
            "id":1535208,
            "title":"Get in the sauna!"
        },
        "1111111211211121":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Finally Sarah leaves with Arthur",
                "She leaves him there "
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">When she was ready Sara threw her towel, and grabbed his stretched tongue, looking at it playfully and putting it between her legs to the horror of the squashed boy, unable to move.<br>\r\nThe girls looked at her with their mouths open wide... she had started massaging her butt cheeks with his tongue! Smiling and laughing around \"C’mon girls! Don’t be shy! Sit and relaaax!” said while grinding on his tongue... \"He's even doing me the favour of cleaning the sweat for me!\" <br>\r\nFinally the girls smiled and jumped on him making themselves comfortable by grinding and bouncing on his stretched body... <br>\r\nArthur started screaming but he wASS soon silenced when Dianna sat right on his face making him unable to speak at all... <br>\r\nAfter some time Sara got enthusiastic and yelled: \"Watch this! A perfect massage machine!” And she did something terrible! She stretched his tongue even more and tied it around her butt checks... each one of them. Then she started to squash and mush his little tongue with them... \"And the best part is that... he is trying to free his tongue... but as he can’t ot shakes! See? So it massages my butt!\"... <br>\r\nThe other girls just watched and then Rose said: “Sara... You're a genius!” And with that the girls joined the new invention. Rose tied his hands around her ass, Jeanne his legs, and Dianna was left without anything and looking at the stretched boy who begged: “Pwease wet me gooo! She then smiled at him and grabbed his face, pressing it and stretching it even more and covered her ass with it... <br>\r\nArthur tried to free even one of his body parts but he was completely mangled and at the mercy of the playful babes... His whole body was shaking... he just felt pain and saw butts, tasted butts and was squashed by butt trying to shout to move, anything...  while the four girls just sat in the sauna... having their little pleasure and without burning her behinds... talking about their business... smiling, joking, and laughing all the time... <br>\r\nSara drank some cold water to fight the heat and said to herself: “Aah, another perfect day\" and grinned evilly....<br>\r\n</font></span></div></div>",
            "created":1361277540,
            "id":1535246,
            "title":"Butt squashed in the sauna"
        },
        "11111112112111212":{
            "author_id":"realgirl",
            "author_name":"WritingGirl",
            "choices":[
                "Tush (cheeks or crack)/ Lips",
                "Managed to escape being sat on"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur almost felt near death by the time that he felt weight being lifted off him. However, the majority of his body was squished into the bench as the soaking ladies left to get their showers. All he could hear was giggling before a door slammed shut, finally leaving the young boy to get a breather. It was hard, and the heat didn't help, but he could slowly feel himself shrinking to his original form. He couldn't believe his luck, but laid in the heat panting from exertion. He had a bad taste in his mouth and his entire body was sore. Before he could even think how he would escape this heated room, he heard the door open again. His eyes widened and he immediately whipped his head around to look at who he was expecting. A curvy woman stepped in. He felt in awe to see her long straight red hair fall down her back to her shoulder blades. Her eyes were a beautiful blue and he could tell even in the steam this woman wasn't wearing anything but a white towel. He swallowed heavily, shaking his head free of daydreams. He needed help and now, he wasn't about to stay in here where those awful girls would come back.<br>\r\n<br>\r\nThe red headed woman stepped right up to the beach, Arthur screaming his lungs out until he saw the one thing that made his throat croak. She turned, her legs bending and her cream colored bottom was headed right for him. He froze, even though he knew if he didn't move, he'd be stuck with another unwilling lady.<br>\r\n</font><br>\r\n(Let's keep this one unaware ladies and gentlemen) <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/wink.png\" alt=\"*Wink*\" title=\"Wink\" border=\"0\" width=\"15\" height=\"15\"></span></div></div>",
            "created":1361680260,
            "id":1538456,
            "title":"She leaves him there "
        },
        "111111121121112121":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Kept going on ",
                "Decided to leave (with him stuck or not)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">The boy saw the shadow hovering over him as the shadow of the woman blocked the light. He tried to move only to notice that his limbs wouldn't hold his weight, the previous beating had left him completely numb and unable to escape the wide rear that was about to crush him. His only hope of avoiding being crushed was to let the woman know that he was there, so she wouldn't completely crush him into oblivion. He opened his mouth and breathed in: Heeeee...\" *SQUAAASH* Meanwhile the woman had been preparing to relax in the sauna, a bit scared of burning her behind. She had decided to just do it quickly and stop thinking it, so with a little jump she had let her body fall... on top of the little boy.<br>\r\nHe saw his crotch coming down at around 300 miles per hour while his scream died. He was instantly moulded almost flat. She squashed his feet and part of his legs with her buttcheeks but all of his upper body had been squashed by her lips to a pancake. <br>\r\nArthur's face had been flattened between her lips effectively shutting him up and squashing him.<br>\r\nShe got a bit aroused but couldn't imagine what was happening, and imagined it was because of the heat in the room. But being the only one there she looked at the door, and started wiggling a bit in the bench. She bit her lower lip while she rubbed her rear, pleasuring herself. The little boy only guessed what was happening when things started to get a bit wet... after a second his whole body was steamrolled again and again while his face was crushed and all of him was almost being shaped around her figure.<br>\r\nHe tried to move but he could not even move a finger as she kept crushing his every existence against the bench of the sauna. Drenching him in sweat and...<br>\r\nWhile little Arthur was once again experiencing hell, the woman, ignoring his existance...</font></span></div></div>",
            "created":1362015360,
            "id":1540789,
            "title":"Lip syncing"
        },
        "1111111211211121211":{
            "author_id":"realgirl",
            "author_name":"WritingGirl",
            "choices":[
                "Round 2 ^^",
                "She decides to leave [with him or not]"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Kim had come to the sauna to have at least one relaxing day in her normal busy life. Perhaps she was too tense, but whatever it was she was enjoying it to the fullest. She'd scoot and grind while Arthur was being sculpted right into her curves. Finally it came to a point that she released, sitting there, her toes curled and her privates pulsating. She finally sighed, leaning back again and letting herself lean against the wall. Arthur, however, was having less fun. He couldn't even move let alone voice his pain and irritation. He tried to imagine as the woman became more aroused, he would become looser, but unfortunately it was the opposite affect. It almost seemed that he was being glued right onto her perfect skin and he could feel his legs almost completely between her cheeks. It didn't help the woman was putting all her weight on top of him, leaving those wet lips to keep him completely silent in his misery. </font></span></div></div>",
            "created":1362020640,
            "id":1540840,
            "title":"Under pleasure"
        },
        "111111121122":{
            "author_id":"cobraman",
            "author_name":"Jusenkyo",
            "choices":[
                "tossed Arthur in the wash with the bra.",
                "tried to reform the bra."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">He saw a bright green thong in the mirror, unlucky for him his super suit seemed to do more harm than good.Sarah pulled him up her thighs and snapped him into place. Thankfully for him his face stayed on the outside when the machine 'fixed' him he could see sarah looking in the mirror with a bright green bra up to her chest one that matched his color perfectly. <br>\r\n<br>\r\n\"Well my little toy it looks like you couldn't reform before my clothes washer got ahold of you so you get to spend the rest of the day just like this again!\" she said happily \" and maybe if your good all day i might just untangle you... maybe.\" he was confused what did she mean stayed in shape he wasn't even the same as when she left him in the washer.... as a bra..... that was bright green.... oh crap. Sarah must have mistaken that bra for him and him for her green thong! Sarah finished getting ready as Arthur cursed his fate, even if she was evil if she didn't know he was here he might be stuck forever! throughout the day Arthur didn't feel much, it was just a normal day for sarah until they got back to her house. sarah undressed and....</font></span></div></div>",
            "created":1336626000,
            "id":1333846,
            "title":"Unrecognisable."
        },
        "1111111211221":{
            "author_id":"maner",
            "author_name":"Lolol man",
            "choices":[
                "Put the bra back on and did the same thing",
                "She realizes something might be wrong"
            ],
            "content":"<div class=\"\"><div> <span>Sarah threw what she thought was Arthur and the \"thong\" in the wash.<br>\r\n\"Have fun in the wash\" Sarah said as she left.<br>\r\nThe laundry automatically washed and dried itself and the got ironed. When it was Arthur's turn to get ironed he started to reform but was stopped and ironed back into a thing, the heat making it harder for him to reform. A week of this process later Sarah took the bra off and said \" you make such a nice bra that I'm going to give you some time to try and reform before I get back if you do I'll mould you into something else but if you don't your my bra for another week!\" Arthur felt depressed when he heard this because he was her thong and realized he could of had a chance to escape and began to weep. Later when Sarah got back and saw the bra without any change she said \"well I guess you like being my thong and holding my boobs up\" Sarah then</span></div></div>",
            "created":1394075580,
            "id":1756149,
            "title":"tossed Arthur in the wash with the bra."
        },
        "111111122":{
            "author_id":"captainshaman",
            "author_name":"captainshaman",
            "choices":[
                "She transforms him into her breasts",
                "She crushes him paper thin"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">“Hmmm,” Sarah murmured, as she tossed Arthur’s crushed form into the air. “I don’t see why I should reschedule my entire day just because you decided to show up. But I suppose I can let you tag along. Does that seem fair?”<br>\r\n<br>\r\nArthur couldn’t have answered, even if he had wanted to. His face was mashed up against his thigh, and all the air in his lungs had been squeezed out. Adding insult to injury, he was getting sick from being constantly tossed and spun in the air. It was all he could do to keep from throwing up.<br>\r\n<br>\r\nSarah feigned an interested expression as she placed one hand behind her ear, as if trying to hear him better. “Excellent!” she cried, clapping her hands together and crushing Arthur between them. “I’m glad you have no objections. Actually, you can even help me! Wait right here while I get ready.” <br>\r\n<br>\r\nWithout pausing, she licked Arthur’s flattened body and slammed it on a nearby table. Giving him a sly wink, she scampered off, giggling. Arthur immediately began reforming himself, but it was extremely tough work. Not only was he flattened, but he was contorted as well, with all his limbs tied into knots. <br>\r\n<br>\r\nYet, despite the difficulty, Arthur had managed to both re-inflate himself and untie himself after only ten minutes. But no matter how hard he tried, he couldn’t separate himself from the table. As he heard nearing footsteps, he re-doubled his efforts, but it was to no avail.<br>\r\n<br>\r\nSarah entered the room, but to Arthur’s shock, she was only wearing sneakers and a sexy pair of work out shorts. Her substantial breasts bounced as she walked towards him, and the swaying of her curvy hips was perfectly outlined by her tight shorts. Blushing, Arthur was so flustered that he didn’t notice that Sarah was pointing the transformation gun at him. <br>\r\n<br>\r\nArthur was enveloped in a bright light and immediately began to feel himself change. Unlike when he was crushed into a shape, it wasn’t painful: just strange. He became thinner and stretched out. His legs lengthened and joined, creating a circle, while his arms stretched up and over, eventually joining to his feet. His body and face merged and widened, while his skin turned from flesh to grey fabric. <br>\r\n<br>\r\nWhen he was finished transforming, Sarah picked him up and cooed, “Ooh! How kind of you? How did you know I needed a new sports bra?” She lifted him over her head and slid her arms through the straps. As she adjusted herself, Arthur saw her breasts get closer and closer, until they blocked his view and he was hugging them. <br>\r\n<br>\r\nLooking in the mirror, Sarah admired her handiwork. “Perfect!” she said. “Now it’s time to go for a run!” With that, she grabbed an mp3 player and headed out the door. <br>\r\n<br>\r\nWhile Sarah ran, Arthur was in torment. Every step she took left him in pain, as he strained to keep her heavy breasts in place. Up, down, up, down, they went, and every movement felt like it was going to break his straps. Meanwhile, not only could he not see anything, he felt smothered against her. She was incredibly warm, and after a few minutes of running, her sweat had completely drenched Arthur. He felt as if he were in the most uncomfortable sauna of his life. <br>\r\n<br>\r\nSarah, on the other hand, was having the run of her life. Arthur was a great bra! He supported her so perfectly, that she felt like she could really go all out. She was practically running on air. The only downside was that as her bra got sweaty, it was beginning to irritate her nipples. But she laughed as she felt them get hard, as she knew it would be even more uncomfortable for Arthur. <br>\r\n<br>\r\nAfter forty minutes, Sarah eventually returned home. Tossing her pants and Arthur on the floor of her room, she quickly took a shower and changed. Refreshed, she came out of the bathroom and picked Arthur off the floor. “Eww, you stink!” she teased, giggling and holding her nose. Pointing the transformation gun at him, she changed him back to his normal state. <br>\r\n<br>\r\n“So?” she asked innocently. “Did you enjoy helping me? Or were my breasts too much for you?” <br>\r\n<br>\r\nArthur stood on the counter, still bathed in her sweat, battered and bruised. But he wasn’t going to let her win. He was a hero, dammit! So, mustering all of his courage and gumption, he said, “Actually, it wasn’t so bad, considering you’re so flat-chested!”<br>\r\n<br>\r\nSarah froze, the blood rising to her face. After a few seconds she spoke, “What did you say?”<br>\r\n<br>\r\n“I said you’re flat as a board!” Arthur shouted triumphantly.<br>\r\n<br>\r\nSarah’s knuckles turned white as she ferociously gripped the gun. “Flat,” she muttered to herself. Then she roared, “I’ll show you flat!” <br>\r\n</font></span></div></div>",
            "created":1344142800,
            "id":1398311,
            "title":"Let's go running!"
        },
        "1111111221":{
            "author_id":"captainshaman",
            "author_name":"captainshaman",
            "choices":[
                "I think I'll return you to normal",
                "I'm going to keep you like this forever!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah pointed the transformation ray at Arthur and fired. Once again, a bright light surrounded Arthur as he began to feel himself changing. This time, however, an extreme sense of dizziness came upon him, and he quickly blacked out. <br>\r\n<br>\r\nWhen he came to, he could immediately tell that he was in a new shape. He felt swollen and heavy, as if he was a water balloon pinned to a wall. Wait, scratch that: two water balloons. His left arm and leg had become one balloon, and his right arm and leg were the other. His face felt stretched out all over his body, completely covering the two dangling orbs. His vision was filled with a fluffy whiteness, and he was practically deafened by the sounds of a beating heart. Every few seconds, he would hear the sound of someone breathing in, during which he would rise. When the person exhaled, he would fall again. “Where am I?” Arthur thought, since he didn’t have a mouth to speak the words.<br>\r\n<br>\r\n“Ah! You’re finally awake!” The voice was incredibly loud, reverberating through his new body. “I was worried something had gone wrong, since I’ve never done this before.” Arthur recognized the voice to be Sarah’s<br>\r\n<br>\r\n“What have you done to me?” He thought as loud as he could. Suddenly, his whole body began jiggling uncontrollably, as he heard Sarah giggle. <br>\r\n<br>\r\n“Ha ha, let me show you!” With that, Arthur felt himself being propelled forward. He could hear someone walking, and with every footstep he heard, he bounced a little. It was a bit disconcerting, and more than a little annoying. <br>\r\n<br>\r\nFinally, the footsteps stopped. Without warning, the white wall was removed from his face, and he found himself staring at Sarah, who had lifted up her shirt to reveal her bare breasts. <br>\r\n<br>\r\n“Who are you calling flat chested?” Sarah teased. Staring, Arthur was astounded to see that Sarah’s breasts had grown at least two cup sizes. How could that be possible? And something else was wrong too. He realized that he wasn’t looking at Sarah: he was looking at a mirror. Then where was he?<br>\r\n<br>\r\nIt finally dawned on him when he saw Sarah poke her breast, and, at the same time, he felt her finger touch his face. “No,” he thought.<br>\r\n<br>\r\n“That’s right!” Sarah shouted gleefully. “You know, I thought about what you had said, and you were right. My boobs were a bit on the small side. Fortunately, you were kind enough to provide the material to make them bigger!” Arthur’s vision was blocked again as Sarah let down her shirt.<br>\r\n<br>\r\n“Now, even though I just showered, I think I’ll continue my workout with some jumping jacks! Normally I wouldn’t think of doing those without a sports bra, but I’ve made it that you’ll take all of the pain from my boobs. You’re such a swell guy!”<br>\r\n<br>\r\nArthur tried to protest, but he was cut off as he felt Sarah jump into the air. His body was dragged up, and as Sarah reached the top of her jump, Arthur floated into the air, weightless. But that feeling was dashed as she came back down hard on the floor. Arthur was rocketed down but then whipped back up as Sarah jumped again. The pain was intense as he lashed up and down helplessly, his whole world never staying still for an instant.<br>\r\n<br>\r\nAfter what seemed like an eternity, Sarah finally finished her jumping jacks. “That was great!” she cried. “I didn’t feel anything at all! This is so convenient.” Looking at herself in the mirror, she grabbed her newly enlarged breasts and admired them.<br>\r\n<br>\r\n“Hmmmm…”</font><br>\r\n</span></div></div>",
            "created":1344315600,
            "id":1400017,
            "title":"She transforms him into her breasts"
        },
        "1111112":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Tiny Arthur looks up with a defiant look on his face.",
                "A new frightened small boy looks up to her with fear in his eyes."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">She coughs waving away the smoke from the transformation. Looking around she doesn't see the full sized boy that was once in front of her. A wicked smile spreads to her face as she looks down to see a tiny figure being smothered by the smoke. She bites her lower lip as she slides her foot forward trapping the figure under her foot.<br>\r\n<br>\r\n\"Well... well... well someone will pay dearly for that little stunt they did.\"<br>\r\n<br>\r\nSeveral different ideas start to swarm in her head as she brushes her toes against his face giggling as he struggles against her.</font></span></div></div>",
            "created":1333947600,
            "id":1312383,
            "title":"Poof!..."
        },
        "11111121":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "He gains enough time to scamper away with Sarah right behind him.",
                "Sarah grabs him smushing his body into her grip like a hand full of clay."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">She looks down at hims with a smirk as if she has won.<br>\r\n<br>\r\nFor Arthur this is too much to take and he does the first thing he can think of to get away from under her foot. <br>\r\nAs she is busy laughing at his predicament he opens his mouth to bite into her big toe as hard as he can causing her to shriek in pain. <br>\r\nUnfortunately, Arthur's plan seems to back fire as instead of raising her foot she presses harder against his body causing pain to travel from his waist all the way up his body. <br>\r\n<br>\r\nThe oddest thing is that no bones can be heard breaking or blood gushing out of his body. Instead it just seems like Arthur's body almost compresses into a small imprint of her toe squishing flat as a sheet of paper against the floor before she raises her foot off him to lean down clutching her foot.<br>\r\n<br>\r\n\"You little bug! Oh I was going to let you off easy, but now you have done it.\"<br>\r\n<br>\r\nArthur's body has already started to reform from her step as she starts to reach for him. <br>\r\nArthur rolls over starting to crawl, forcing his body to bare the pain as it reforms.</font></span></div></div>",
            "created":1333947600,
            "id":1312404,
            "title":"I do bite!"
        },
        "111111211":{
            "author_id":"crazyethin",
            "author_name":"Ethin",
            "choices":[
                "See what else she can turn him into.",
                "Find some crazy punishment for his size."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">As Arthur crawled away his body was regaining it's shape starting from his head down. Sarah was right behind him as he quickly crawled across the floor \"You get back here you little bug!\" she yelled as she reached down for him but Arthur seemed to really want to get away because his crawling speed was darn fast.<br>\r\n<br>\r\nSarah was amazed at how he was going so fast and was shocked sorta \"Uah slow down! Pip squeek!\" she squinted her eyes. Arthur's body was half way back to normal as he crawled around the room trying to fake out Sarah. He looked like a half empty toothpast bottle scampering around \"Please Sarah just stop!\" he yelled but she just giggled as she chased him around the room with both arms out \"I'll stop when I catch you!\" she yelled.<br>\r\n<br>\r\nArthur soon had the ability to use his legs again and quickly stoped in his tracks. As he did this Sarah past right over him and Arthur was now behind her and booking it for some sort of safety \"Not so fast!\" she yelled and turned around and started to jump for him. Arthur thinking he was being tricky soon noticed a shadow growing around him. He turned his head to see Sarah flying right tworeds him \"Oh come on!\" he yelled as she got closer and closer.<br>\r\n<br>\r\n\"You shouldn't have bit me you punk! I'll get you!\" she yelled as she body slammed Arthur into the floor. His body was instantly smooshed under her stomach but lucky for him he wasnt a full pancake again he was just under her. \"Told you I'd get you.\" she giggled as she felt him tickle her stomach. Sarah stood up to find Arthur's body plastered to her tummy \"Hehe you really shouldn't have bit me.\" she winked and peeled him off.<br>\r\n<br>\r\nSarah brought Arthur up to her face with a wicked grin on her face \"Sarah why are you doing this?!\" Arthur yelled to her \"Because it's so much fun!\" she giggled \"Now what should we do with you punishment wise.\" she put her finger on her chin and started to think as Arthur hung by the coller of his shirt by her fingers.</font></span></div></div>",
            "created":1334293200,
            "id":1314318,
            "title":"Body Slam!"
        },
        "1111112111":{
            "author_id":"squishdown",
            "author_name":"Gavybear",
            "choices":[
                "Sarah gets bored and recycles Arthur.",
                "Sarah has another creative burst!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">“What to do, what to do” pondered Sarah. She looked around the lab, and resting her eyes on a specific drawer a grin slipped across her face. She walked over to the drawer, setting Arthur in a tall, empty glass to prevent him escaping. She rooted through the drawer, “Now, where did I put it…” she said, tossing everything in the drawer aside. <br>\r\nArthur saw his chance to try and escape while she was distracted. He slammed his body against the side of the glass, until finally it tipped over and threw him out onto the counter top. He ran and hid in a box before the glass rolled off the counter, smashing on the floor and alerting Sarah to his escape. Sarah whipped around to the sound of shattering glass, to see her subject missing, and her favourite glass lying in smithereens on the floor. She ran to the counter, and tore wildly through everything searching for Arthur. She flung Arthur’s box off the counter, and Arthur flew out when it landed. She sprinted over and pounced on him.<br>\r\n<br>\r\nShe stood up, Arthur gripped firmly by both her hands. “Why you little..!” she trailed off, shaking with rage.  She stood silently, the vein in her temple visibly throbbing. She paced back and forth to calm herself, and after sometime, she kept still and that evil grin crept across her face again. “Okay Arthur, we’re going to do something creative, because I’ve been told it would help regulate my anger…” she said, her grip tightening momentarily on Arthur. <br>\r\n<br>\r\nShe threw him onto a counter top. He lay there, and as he was about to protest Sarah’s fist came crashing down on him. Lifting her fist she revealed Arthur squashed and spread out into a sheet. She took the sheet and began to stretch him over a wooden frame. She hooked his right shoulder on one corner, and stretched his left foot to the opposite. She did the same with his other extremities, pulling him tight. Arthur felt his tiny body stretched in all directions, he felt as though he’d rip apart under the strain. After much heaving from Sarah, He finally covered a 60x80cm stretcher. <br>\r\n<br>\r\n“You see, I like to paint, but good canvases are expensive. However, I figured you’d be perfect, being so smooth, so stretchy” she said, gently rubbing her finger across his taught form. She then flicked his body, and it resonated like a drum skin. “Perfect”.<br>\r\n<br>\r\nArthur groaned, “Ow…owwww...it hurts….”, before Sarah slapped a generous helping of white paint onto her canvas. She spread the paint, coating Arthur from head to toe. He could see nothing now except white, he tasted only the paint. As it dried he found it increasingly difficult to move his lips, until finally they stiffened in place. All he knew after that were the brush strokes of Sarah: some light, some heavy and vigorous. Every one of them pushed him, stretched him further. Each one was almost like a punch.<br>\r\n<br>\r\nBy the end a painting stood before Sarah: Blob, a study of Arthur. Groans could be heard from the painting. “Oh quiet, you’re art now” Sarah said dismissively. She pulled up a chair and admired her handy-work.<br>\r\n</font></span></div></div>",
            "created":1348549200,
            "id":1434778,
            "title":"Sarah shows her creative side."
        },
        "11111121111":{
            "author_id":"squishdown",
            "author_name":"Gavybear",
            "choices":[
                "Arthur decides he should start recycling",
                "He is unable to get out by himself"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">By mid-afternoon, Sarah had grown bored of Arthur’s new form. “Stop being boring!” she demanded. But no matter how much she shouted at him, he just sat there, stretched and in pain. She brooded and brooded. She eventually leapt from her chair, “I’ve got it!” she yelled! Great, thought Arthur, I can’t wait to see what it is this time. “I going to…” she held for the drum-roll in her head, “a party!”<br>\r\n<br>\r\nArthur started scheming; Perfect! While she’s distracted with guests and fun, I can make my escape, or maybe even sabotage her evil lab! But Arthur’s soliloquy was to be short lived. The familiar feeling of dread first returned when he felt himself being removed from his stretcher and folded up. The next thing he noticed was that he felt pinches all along one side. The pinches started to run along his body. Arthur panicked: what’s happening?! They stopped suddenly, “Stupid shredder!” shouted Sara, “why do you keep jamming!” Shredder?! After some “tender-loving-care” involving a hammer, the shredder whirred back into life. “There now, you’re going to make some amazing confetti!”<br>\r\n<br>\r\nArthur could do nothing but groan. He was being cut into strips to be thrown around and stepped on by strangers; this was going to be a long night. He endured the unpleasant sensation of his dismembered form piling on itself, and the equally unpleasant sensation of being handled and scattered all over the place.<br>\r\n<br>\r\nThe party continued into the wee hours of the morning. After Sara collapsed from exhaustion, one of her friends decided, rather enthusiastically, to clean up for her. Unfortunately for Arthur, with his body scattered so far apart, he couldn’t reform himself. And thus Arthur’s exciting adventure into the trash began.<br>\r\n</font></span></div></div>",
            "created":1351904940,
            "id":1458899,
            "title":"It's party time!"
        },
        "111111211111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Go through the living room...",
                "Stay put and think of another plan"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Strangely enough he was still okay abut he was unable to start reforming until the pieces of his body fell together in the can full of papers. Little by little the pieces of his body stuck back together and a dazed boy grabbed the edges of the can and took a look at his surroundings and tried to evaluate his situation. \"So I'm pretty much immortal, which is pretty cool but I'm also malleable which makes me vulnerable against normal people with ill intentions...\" \"Okay then, objective number one is escaping and if possible making some problems for the supid girl who treated me like this.\" After deciding his next step and fully recycled....eeer... reformed... He got out of the can silently. The girls that had come to the party were nowhere to be seen. But then again he was in a separate room of what the living room would be....<br>\r\nAnd also, to get to the exit he had to go through that specific room, where judging by the sounds all the girls were before partying. \"Still? Why are they still there?\" They were all lying asleep scattered around in the room. Maybe that could ve a chance for him to get revenge or escape...<br>\r\nIn the end Arthur thinks it's best to.... </font></span></div></div>",
            "created":1351932840,
            "id":1459230,
            "title":"Recycled"
        },
        "1111112112":{
            "author_id":"crazyethin",
            "author_name":"Ethin",
            "choices":[
                "She continues her crazy punishment >:D! ",
                "She uses the machine on him again."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah continued to think of what to do with a wicked grin on her face as Arthur kicked his legs trying to break free from her grip. \"Hmm there's so many things we could do!\" Sarah giggled \"Sarah please I didn't meen to... Bite you.\" Arthur said giving her puppy eyes. She just looked at him and squinted \"Puppy eyes... Really? Your still being punished.\" she laughed.<br>\r\n<br>\r\nSarah sat down on the floor and moved him downward to her feet. Arthur watched as he was moved closer and closer to her little footsies. He could hear Sarah  giggling as she placed Arthur between both her feet. \"Hey Arthur do you like sandwiches?.\" Arthur soon noticed Sarah's feet closing in around him like those silly traps on the movies. Arthur started to panic and only had time to flinch as Sarah clamped her feet around the boy sealing him between her soft soles \"Hehehe Arthur stop tickling me.\" she laughed.<br>\r\n<br>\r\nArthur wiggled and squirmed trying to break free but her foot grasp was to tight. \"Your not going anywhere little guy.\" she winked and started wiggling her toes drumming them agenst Arthur's face. But low and behold Arthur had it and bit her toe again \"OW! Come on! Didn't you learn! GAH!\" Sarah clamped her feet together hard anuff to make him turn flat as a pancake. She could hear his tiny muffled yelp as she did this and smiled \"I can't believe you'd do that again!\" she grabbed the pancake boy from her feet and set him behind her.<br>\r\n<br>\r\nArthur could only watch as the now even more pissed Sarah lifted herself off the floor like she was crab walking and moved her rump over him \"I was going easy on you! Now you'll get it for biting me TWICE!\" she grind and planted her rump on Arthur. His tiny body was completely covered by her rump and she soon started to grind her butt on the floor smothering the tiny boy \"Bet you wish you didn't bite me now huh?\" she giggled as she could hear his muffled screams \"Sarah get off me!\" he yelled but she didn't get a word.<br>\r\n<br>\r\n\"I can't hear you Arthur. You need to speak up hahaha.\" Sarah continued to move her hips side to side making sure Arthur understood what he did wrong. <br>\r\n<br>\r\nSarah then stoped and sat there for a few seconds seeing if he was passed out. \"You done yet?\" she giggled and stood up. But when Sarah looked back at where Arthur would have been he was nowhere to be seen \"Arthur?\" Sarah said as she looked around everywhere for him but soon she heard a faint moan and she slowly looked over her shoulder and spotted a paper thin Arthur stuck to her rump \"Oh there you are. I didn't know you liked my cute butt that much silly.\" she shook her hips a little.<br>\r\n<br>\r\n</font></span></div></div>",
            "created":1334379600,
            "id":1315178,
            "title":"That's two strikes!"
        },
        "11111121121":{
            "author_id":"crazyethin",
            "author_name":"Ethin",
            "choices":[
                "Arthur makes a run for it!",
                "Sarah makes her way to the shelf (Oh boy!)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah giggled and peeled Arthur off her butt \"You must be crazy to bite me twice...\" she sighed as she raised him up to her face. Arthur was still flat as paper as she looked him over. But finally Sarah flicked him like a towl and he poped him back into shap \"There we go.\" she giggled. Arthur hung there from her hand completely out of it.<br>\r\n<br>\r\n\"Now there's got to be more fun ways to toy with you.\" she said as she started to think again. Arthur looked at her face in fear just thinking of what horrible punishment she'll give him. \"I can't take this anymore.\" Arthur said in his head when all the sudden the shirt he was in slipped off and he fell to the ground with a... soft thump.<br>\r\n<br>\r\nArthur stood up holding his head and looked up \"Dang that hurt...\" he sighed. He noticed that Sarah didn't notices his crazy drop and Arthur took this time to get the heck away from Sarah.<br>\r\n<br>\r\n-Seconds later-<br>\r\n<br>\r\n\"Ah I know just what to do with y-...\" she stoped midde sentence as she only saw a t-shirt hanging from her fingers \"ARTHUR! Why you little!\" she yelled as she looked around everywhere for him. Sarah stomped around trying to scare him out from where ever he was \"I'll find you where ever your tiny butt is!\" she started lifting things up and looking under things.<br>\r\n<br>\r\nArthur on the other hand was freaking out as Sarah stomped around the room. He found shelter behind a nearby shelf hidden behind it in the shadows. \"Man she sure is upset...\" Arthur gulped in fear. Sarah was getting further away from the shelf giving Arthur the choice of getting the heck out of there.<br>\r\n<br>\r\nWhat horrors await are tiny hero will he get away OR will the crazy girl find him DUH DUH DUUUH!</font></span></div></div>",
            "created":1334466000,
            "id":1315747,
            "title":"Strike three! He's out of here!"
        },
        "111111211211":{
            "author_id":"crazyethin",
            "author_name":"Ethin",
            "choices":[
                "He holds his ground!",
                "He panics and books it back into the kitchen..."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur watches Sarah as she gets further and further from the shelf \"Nows my chance.\" he widowed to himself and soon was in a full on sprint for the nearby door. Sarah who was completely oblivious didn't see the tiny boy running like a mad man and countinued her mad search. Arthur reached the door and sqweezed his way under it to safty.<br>\r\n<br>\r\nArthur soon noticed the the \"Evil scientist\" had her laboratory connected to her house \"Huh...\" Arthur grunted as he looked down the hallway he was in. Soon he started running down the hallway tworeds the room at the end. It took a little time for his tiny form to reach the end but when he did he noticed he was in a large kitchen \"Wow!...\" he said loudly as he looked around.<br>\r\n<br>\r\nArthur then started to climb up the counter and when he reached the top he soon noticed the normal things you'd find in a kitchen. Paper towels, boxes of cereal, tooth picks all sorts of things. <br>\r\n<br>\r\nJust then an idea poped into Arthur's head as he looked at all the stuff \"Time to be a hero.\" he said as he clenched his fist infront of him. It was like a montage as Arthur ripped a small peace of paper towel off and swing it around his shoulders like a cape. He was singing an epic tune in his head as he grabbed a tooth pick for a sword and cut out peaces of the cereal box for armor.<br>\r\n<br>\r\nArthur slowly sliped the cardboard helmet on and made a fancy pose like superman. The fan in the kitchen made his paper towel cape blow in the wind. Arthur how finished feeling cool started to crawl back down the counter and stood in the center of the hallway as Sarah steped thru the lab door and spotted the armored hero standing at the other end of the hallway \"So there you are!\" she yelled as she looked at him. Sarah giggled as she looked at him standing there holding his toothpick \"Are you challenging me?\" she said as she pointed to herself.<br>\r\n<br>\r\nArthur just stood standing up straight not saying a word. <br>\r\n<br>\r\nSarah started to slowly walk towards the hero as he held his ground.</font></span></div></div>",
            "created":1334466000,
            "id":1316409,
            "title":" Brave Knight Arthur!"
        },
        "1111112112111":{
            "author_id":"crazyethin",
            "author_name":"Ethin",
            "choices":[
                "Arthur keeps the upper hand!",
                "Sarah fights back big time! (was that a pun?...)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">The hallway seemed to be miles long as Arthur watched Sarah slowly walk in his direction \"Fe Fi Fo Fum!\" Sarah said mockingly with her hands above her head. But none of this scared Arthur as he stood there just watching. Pretty soon Sarah stoped half way down the hallway and the both like lightning coming out of there eyes they made eye contact.<br>\r\n<br>\r\nFor some reason a breeze hit making Arthur's cape Woosh. The second it settled tho the two of them started running at eathother screaming. The ground around Arthur shook as Sarah closed in but he kept running at her with no fear.<br>\r\n<br>\r\nThey were just a few feet apart and Sarah raised her foot getting ready to stomp the tiny boy \"Take this!\" she yelled as she stomped down. It was like time slowed down as Arthur raised his tooth pick sword and poked it into the bottom of her foot as it came down on him. Only the tip broke the skin a little but it hurt anuff for Sarah to move her foot back and let out a little yelp \"OW! Did you actualy stab me!\" Sarah cried.<br>\r\n<br>\r\nArthur looked shocked but he knew that if he didn't do that she would have ruined his fancy armor \"That's for stomping in me the first time!\" Arthur yelled as he poked the toothpick at her again making her back away \"Why all the sudden are you so crazy.\" Sarah said as she countinued to \"dodge\" his toothpick.<br>\r\n<br>\r\nArthur laughs as he freaks her out \"not so tuff now are you!\" he said valiantly. </font></span></div></div>",
            "created":1334638800,
            "id":1317352,
            "title":"He holds his ground!"
        },
        "11111121121111":{
            "choices":[
                "It's too late, Sarah's butt engulfs him!",
                "He reaches it, and saves himself!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur began to slash violently as he charged on forward. Sarah was backing away making sure not to get stabbed again. With each swing he put all his might. Sarah showed a face of shock and displeasure as she did not enjoy being the victim. Arthur however began to grow tired and needed to slow down his assault or he will be exhausted too fast. He faults and raises his tooth pick sword to cover his face. He used both hands to hold it in front of his determined face. \"What's gotten into you, freak!\" Sarah's fear turned to anger as she seemed ready to pounce on our hero. \"I'm no freak! But, your a monster!\" Arthur began to charge after Sarah, his sword held high like a samurai with their katana. As he charged forward he began to yell, \"Aaaaaaaaaahhhhhhhh!!\" with the adrenaline coursing through his veins. Sarah however retaliated and began to swing her bare foot. Arthur watched as foot got closer and closer. In a flash it seemed her kick reached Arthur but at the last momment he leaped to the side dodging her right foot. The wind flew dramatically lifting his cape and blowing the strands of hair showing from under his helmet. He continued forward as Sarah regained her footing, she then lifted up her left foot to stomp down on Arthur. The bottom of her foot became the image inside his eyes as he knew he had to move. He leaped backwards to dodge her stomp. The ground shook violently as If the world was facing an earthquake. Arthur ignored the vibrations and ran to her ankle. Two quick grunts he made as he slashed her ankle and stabbed it. She bent over from the sting and saw how Arthur was right under her. She decided to drop down right on him. She let her body fall full force as her rear came down upon Arthur. Arthur felt everything freeze and slow down. Only the sound of his breathing and heart beat he heard. The shadow around him grew darker and darker. He had to run full force or else be squashed under Sarah's big butt! He saw no time to make it and slid forward like a baseball player to home base. He slides fast and under but his legs get caught under her buttcheek! \"aah, that hurts!\" Arthur screeches as Sarah just giggles. \"Gotcha! Now it's my turn to take charge little man!\" Arthur was face first into the tiled floor. He couldn't pull his legs out from under Sarah's butt. Luckily he saw his tooth pick infront of him. He reaches for his weapon as its his last chance to free himself and finish this fight. However as he inches closer to it, Sarah begins to move her tushie ontop of him. \"You're trapped little man, and this time, I'm going to leave you there!\" Sarah mockingly laughs as she tortures Arthur by slowly engulfing him under her perfect rump. Arthur reaches for his sword and.....</font></span></div></div>",
            "created":1336712400,
            "id":1334654,
            "title":"Arthur Stands Tall! "
        },
        "111111211212":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Arthur starts to slowly make his way out.",
                "Arthur still can not move his legs."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah continues looking around the room after she makes sure that Arthur isn't close to the door allowing him to escape. She continues talking about how she is going to punish him for his poor obedience and how everything could be easier if he just played along. Arthur was almost tempted to come out before reminding himself of how much joy she took in  bringing him pain. <br>\r\n<br>\r\n\"There must be a way to make a run...\", his sentence gets stuck in his throat as the drums of her footsteps start to get louder as she comes to the corner of the room with the cabinet. His breathing becomes shallow as fear forces him to slowly back up as far as he can into the shadows. Unfortunately for him the small movements catches her eye as she crouches looking to were she saw something move. Her face is contorted into a scowl as he feels her eyes turn him into stone. He wants to move his body but the fear prevents him.<br>\r\n<br>\r\n\"Well well look what I found. A small pest that is trapped.\", she sounds like she is ready to kill as she reaches back behind the book case coming short of grabbing him.<br>\r\n<br>\r\n\"You have no right to treat anyone the way you have! I don't care how smart you are.\", the boy squeaks out in response as he shakes in fear as her fingers are only inches from his body.<br>\r\n<br>\r\n\"I just want to go home now and you wont let me, so you can't blame me for anything I have done to get away.\"<br>\r\n<br>\r\n\"Oh, is that so! Well I think that you need to understand that your home is here now, so you don't need to go anywhere.\", a smile spread across her face as she lays out across the floor. The stand off becoming more like a game of cat and mouse. <br>\r\n<br>\r\n\"My home is out of this house. It does not matter what you say!\"<br>\r\n<br>\r\n\"Well... my little toy I will give you two options for how this will end.\", she purrs.<br>\r\n<br>\r\n\"Option one you come out on your own and the punishment wont be near as bad, or option two I have to go through the trouble of moving the book case to get to you causing me to be even more mad at you.\"</font></span></div></div>",
            "created":1334638800,
            "id":1317413,
            "title":"Sarah finds the bug hiding"
        },
        "111111212":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Sarah gains a new skirt.",
                "Arthur is turned into a puppy."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Before Arthur has time to creep any farther a shadow blocked out the light above him as Sarah hand descended on the poor boy.<br>\r\n<br>\r\n\"You deserve even worst for what you....\", the boy's speech is cut off as his body is mushed in Sarah's hand. His body starts to become similar to dough as she squeezes his body even harder. She raises the small lump of a boy from the floor with a evil look spread across her face. Her eyes are half open fixated on boy and her lips are stretched into a thin line as her fun had ended once Arthur decided to disrespect her.<br>\r\n<br>\r\n\"I...\", she says putting a large emphasis on that one word, \"think that you should be great full that I haven't just gotten rid of you for not only hurting me once but twice. Before I make you something a little easier to handle and something that can't bite me! You owe me a little fun.\", she purrs out as her cheerful attitude returns kneading the boy in her grasp.<br>\r\n<br>\r\nSarah’s lips curl into a wicked smile as she takes the lump of a boy and toss him down onto the lab floor watching as his body splatter becoming more of a lumpy disc then a ball. She balances bringing one of her cute soles down on the boy giggling as his moans can be heard under her foot. She rubs him back and forth against the cold tile floor making his body stretch out to the sides as his face stays under her soles alternating between rubbings against her sole to rubbing against the hard surface of the tile. Sarah closes her eyes as her body tingles with excitement before leaning down to reach for the edge of the boy. She holds one end of him between her toes before stretching the other end of his body high over her head.<br>\r\n<br>\r\nThe boy's agonizing yelps fell on deaf ears as she spreads her toes out letting his body snap back on his body. He dangles helplessly from her grip his body malformed from her play. She starts to sing a upbeat tune flicking her wrist enough to cause the boy’s body to spin around in circles keeping him from reforming. She takes her time walking over to the ray while playing with Arthur fiddling with the controls before throwing Arthur through the air trying to hit the table on the other side of the room, but to Arthur's misfortune she was too overzealous and instead his body splats hard against the opposite wall. Sarah sighs closing her eyes and shaking her head tired of having to do everything herself.<br>\r\n<br>\r\n\"Again you are beyond lucky! If you weren't so fun to play with then I wouldn't put up with all the trouble you keep causing, but hopefully we will fix that this time.\"<br>\r\n<br>\r\nSarah walks over to the wall grabbing Arthur as he starts to peel of the wall. She takes both of her hands to roll Arthur up into a tight little ball before setting him back onto the table in line with the ray. She reaches over her head with one hand bringing it down hard to flatten Arthur's body into a thin disc. She hops across the lab looking as cute as she possibly can with the excitement that runs through her bones. She can't hit the button fast enough before turning away from the bright flash of the ray.</font></span></div></div>",
            "created":1334984400,
            "id":1320208,
            "title":"Not so fast."
        },
        "1111112121":{
            "author_id":"kentwolf",
            "author_name":"Kentwolf",
            "choices":[
                "The child trips and gets ice-cream all over her skirt. better put it in the wash",
                "She goes the whole day in a good mood, takes him home to play with."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah grins in anticipation as she stares at the patch of desk surface that was currently engulfed in a near blinding white light. as it faded Authur caught sight of her. her face was grinning and her eyes went wide as she grinned even more, showing off every tooth in her mouth \"Oh. my. god! you are so cute!\" he saw her rushing towards her and instictivly tried to back away, but he couldnt move. \"what happened? what am i?\" he said, then a real shock happened. he heard no sound. he couldnt speak. Sarah quickly grabbed him and lifted him up, pressing him against her waist \"hmm...yep definatly my kind of thing. wanna see yourself?\" she said giddy with joy. she skipped merrily over to a mirror and turned him to face it, holding him up infront of her \"tadah!\" She exclaimed. <br>\r\n<br>\r\nHe couldnt believe it. he was a skirt. He was pleated, black, sleek. He looked almost satiny with a mix of cotten. he noticed his eyes were on a attatched belt, his eyes making the frame of a jeweled belt buckle. Tthe eyes looked shocked but other than that he seemed to have no control over his new fabricy form. He was so in shock he didnt notice sarah was now only holding him one handed, slipping out of her clothes. He was snapped out of it as he suddenly plummeted, she lowered him down, slipping her feet in one at a time before sliding him up, his slightly stretchy waistline rubbing against her smooth legs. She wriggled him over her bubble bum and smoothed him out, tightening the belt buckle and giggled \"ooh i definatly like you like this toyboy. now lets find a cute top that makes you look even prettier!\" She skipped along, her legs kicking at him, causing his skirt body to go up and down from her movements. dispite having no stomach he felt a bit motion sick, though he had no mouth in which to express his discomfort, though she probably would have only been encouraged to skip more. <br>\r\n<br>\r\nHe had to put up with her trying on over a dozen tops before she finally picked a simple tight black t-shirt with a sequined heart. the colour of the sequins matching your jeweled eyes. Sarah hummed to herself as she fluffed out her hair and checked her makeup. she grabbed her purse and slipped into a pair of black heels, confidently strolling out the front door planning to show off her new girly skirt to the world. she was in such a good mood. She loved having her new little toy to play with and experiment on, besides he was so small no one would ever find him even if they came looking, especially not with his current shape. She strolled through the marketplace quite happily, she even went to dodge around a small child with an ice-cream rather than taking it...</font></span></div></div>",
            "created":1334984400,
            "id":1320340,
            "title":"Sarah gains a new skirt."
        },
        "11111122":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Sarah: \"Who the hell are you?\"",
                "Sarah: \"You aren't Arthur.... there must be a way to get him back.\""
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">It was just a normal sunny day for a boy by the name of Brandon Smith. He was spending the day at home playing games with his friends over the internet like he does most days, but today he had the whole day to himself from his school work. He was your typical 20 year old guy with blue eye and brown hair except that he tended to be much more timid then most other guys leading him to never have the courage to ask any girls out.<br>\r\n<br>\r\nHe was busying himself with playing his game with no cares in the world when suddenly a large whirl wind blew past him causing everything in his room to scatter haphazardly across the floor. Soon after the sudden gust he was pulled backwards in his chair not even having time to understand what caused the wind or what was going on before being yanked into a black hole that stretched from the floor to the roof dragging him through the event horizon to be flying through a black void. <br>\r\n<br>\r\nHe flew through space tumbling from head to toe being dragged along to some unknown place. After just a few minutes of his travels he catches a glimpse of another kid flying past him both of them traveling so fast to seem more like a blur then anything definable. <br>\r\n<br>\r\nSoon after meeting the only other object on his travels he sees a large hole in front of him coming up fast. He tries to keep up right as he passes through the hole landing on a hard tiled surface smoke surrounding his body as his head starts to slow down from his crazy travel through the black hole.<br>\r\n<br>\r\nSuddenly he hears a girls voice as she playfully talks about someone paying for something not knowing anything of what she is saying let alone why she sounds like her voice is coming out of a sounds system. He still tries to regain his bearing when before too long some large pinkish sponge like object shoves into his chest knocking him on his back pining him in place. He squirms under this object not being able to move looking up as the fog clears to look in fear as the object that is pining him  down is a foot and that foot is attached to a very large and cute girl with dark hair and wearing a lab coat.</font></span></div></div>",
            "created":1333947600,
            "id":1312432,
            "title":"We've got a guest?"
        },
        "111111221":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "She blocks off Arthur's escape traping him with her arms.",
                "She trips and falls landing on the floor with Arthur suddenly missing..."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Shortly after Sarah's question a large puff of smoke clouds the lab clouding her vision. She roars out in anger at how random the ray has been since starting this experiment. <br>\r\n<br>\r\n\"You have to be kidding me, again!? I just want a small shrimp that I can take my anger out on is that too hard to ask for?\"<br>\r\n<br>\r\nShe starts to look around the lab looking for any sign of movement her annoyance growing as the smoke blockers her vision. Sarah starts to wonder around the lab her feet making small slapping sounds as her skin hits the tile in her search. Soon enough a sinister smile spreads across her face spotting a small little mouse that seems to be scurrying next to the wall. It isn't just the mouse that has her in a better mood, but the fact that the mouse has a small tuff of hair on his head matching that of Arthur's hair, <br>\r\n<br>\r\n\"Yes! There is my little pet you should of known that I would be able to find you eventually; it was just a matter of time.\"<br>\r\n<br>\r\nSarah starts to run over to the small mouse scampering across the floor focused on her goal to catch poor mouse Arthur.</font></span></div></div>",
            "created":1333947600,
            "id":1312480,
            "title":"Who the hell are you?!"
        },
        "1111112212":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "He turns into....",
                "Arthur is back to his small self."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah slowly starts to raise herself from the floor after her fall scanning for the mouse Arthur loosing sight of him after the fall. She starts to get annoyed at the sudden disappearance of Arthur until she starts to feel a small scampering rodent wiggling around in her top trying to do his best to find his way out. <br>\r\n<br>\r\n\"I guess I just lost him again. This is so starting to get on my nerves; when I find that small mouse of a boy he will be in big trouble.\"<br>\r\n<br>\r\nSarah acts as if she doesn't know where Arthur has gone in his new form. She giggles feeling him start to wiggle in desperation to get out of her top before she squeezes her breast together squishing the small mouse in between her breast. Sarah holds her arm over her chest keeping Arthur snug and tight in her embrace taking joy in hearing him squeal. <br>\r\n<br>\r\nArthur is in a state of panic not knowing what is going on, disappearing in a flash to reappear in the lab in a new body. <br>\r\nHe couldn't believe it, not only was he back in his tormentors house, but as if things couldn't be any worst he was stuck as a mouse. <br>\r\nThe only thing he could do is keep his \"legs\" moving as the soft warm walls around him close in squishing the air out of his lungs making ever movement he has even harder. He tries to yell out in pain, but only squeaks leave his mouth in his futile attempt to yell for her to let him go. <br>\r\nThe pain stops as a light breaks the darkness and a hand descends from the source of the light.<br>\r\n<br>\r\nSarah has taken her time to make it back to the small glass jar enjoying ever little movement of Arthur's body. Almost sad that she has to take Arthur out from between her breast, but she perks up as she reaches in to clutch her hand around the shoulders of the mouse causing Arthur to squirm in her grip.<br>\r\nShe giggles in delight bringing him up to her face; a delightful smile is plastered on her face before shoving the mouse into the glass jar. She leans over placing a small kiss on the jar pulling away leaving a small mark from where her lips where. <br>\r\n<br>\r\nSarah turns around with a spring in her step as she jumps on the controls to the side of the ray playing with the controls.<br>\r\n<br>\r\n\"As much as I want to have a tiny pet mouse, I am not the kind of person that would babysit a whiny mouse all day. You would be much more useful after a few hits with the ray.\"<br>\r\n<br>\r\nSarah hits the button shielding her eyes as a bright light shoots through the lab.</font></span></div></div>",
            "created":1334034000,
            "id":1312961,
            "title":"Something tickles"
        },
        "111111222":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "A cute tank top is left in the jar with a sun flower pattern on the front."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah scrunches her face in thought as she kneads the small boy with her toes.<br>\r\n<br>\r\n\"Hmmm... maybe if I use that stupid ray I can figure a way to get Arthur back, but what should I do with you?\"<br>\r\n<br>\r\nShe looks down at the small boy with a disgusted look on her face not know where he is from. She leans down taking her foot off of the boy giving him the chance to jump up and make a run for the first direction that he is facing. Just as quick as he started to stumble his way to the wall Sarah's fingers wrap around him closing like a vise in her grip. <br>\r\n<br>\r\n\"Oh where do you think you are going little buggy. I may not know where Arthur went, but you can help me get him back.\"<br>\r\n<br>\r\nShe starts to walk over to the small glass jar that housed the little Arthur from earlier dropping the new boy under the glass.<br>\r\nSarah walks back to type in settings to her ray aiming it for the jar.<br>\r\n<br>\r\n\"Don't worry I am a scientist I know what I am doing.\"<br>\r\n<br>\r\nThe tips of her lips curl into a smile as the room is filled with a flash of light a ray shooting at the boy.</font></span></div></div>",
            "created":1333947600,
            "id":1312485,
            "title":"You can help me a bit"
        },
        "1111112221":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Arthur goes quietly to the shower.",
                "Arthur puts up a fight."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"Awww this would be perfect to run in on a hot day like today!\"<br>\r\n<br>\r\nThe small boy can't move or say anything as he sees Sarah walk over to the jar to lift it up talking about wearing him to go running. He can only feel a small amount of dread to think that he will be used to soak up her sweat as she runs. He feels a sudden tug as Sarah pulls him out of the jar to carry him over to a rack and drape him on it to change into shorts, running shoes, and a white undershirt before sliding her new top over her head stretching it as she pulls it down over her tummy. She smiles marveling how she looks in her new outfit as she passes by a mirror.<br>\r\n<br>\r\nSarah take off out of her house to go running down the street building up a sweat that starts to soak her new top. The boy is miserable from the heat of the day combined with the smell of the girl as she runs about the block to keep herself in shape. Not long after Sarah starting her run she makes it back around the house wiping the sweat from her brow as she enters the air conditioned house.<br>\r\n<br>\r\n\"Hmmm I guess you weren't too bad to run in, but I really wish Arthur was here then I would enjoy torturing him rather then just some random person...\"<br>\r\n<br>\r\nShe grabs the front of the shirt stretching the boy as she takes a few sniffs her face contorting into disgust. <br>\r\n<br>\r\n\"First, I will have to wash you before we do anything else...\"<br>\r\n<br>\r\n\"Maybe another blast from the ray will bring Arthur back?\", she mutters to herself walking through the house entering the laundry room. She pulls the boy off tossing him into the washer onto a stack of clothes waiting to be washed.<br>\r\n<br>\r\nShortly after turning around to leave for a shower she hears a small pop looking back she smiles as a small trail of smoke escapees the washer. Sarah rushes over to see a small Arthur coughing up smoke sitting comfortably on top of her dirty clothing. She smiles reaching down giving Arthur a firm squeeze as she picks him up.<br>\r\n<br>\r\n\"Well.... speak of the devil you are just in time to help me with my shower!\"</font></span></div></div>",
            "created":1333947600,
            "id":1312498,
            "title":"Running around"
        },
        "11111122211":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Insole for her sock.",
                "Somewhere darker."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">As Sarah picks up Arthur she gets no reaction out of him only holding his limp body firmly in her grip. <br>\r\n<br>\r\n\"Well someone needs to be taught manners. You know when someone is talking to you it is very rude to ignore them.\"<br>\r\n<br>\r\nSarah squeezes Arthur's body in her hand using him like a stress doll. His skin spills out of any small hole in her clutches as a low painful groan is all that can be heard from his lips. <br>\r\nThis annoys Sarah even more as the low painful moan fuels her appetite for pain. <br>\r\nShe slams her free hand against him molding him into a tight little ball as she giggles in deilight hearing his painful cries. <br>\r\nStill when she opens her palms he seems to be half passed out not even enjoying the torture that he was receiving. <br>\r\n<br>\r\nHer face scrunches up as she gives him a evil look. Sarah hold him by his arm shaking him about in the air trying to get more of a reaction then the few whimpers.<br>\r\n<br>\r\n\"This is soooo not going to work for me it is no fun play if all you do is groan... I might have an idea on how to wake you up\"</font></span></div></div>",
            "created":1333947600,
            "id":1312574,
            "title":"Too shocked to react?"
        },
        "111111222111":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Arthur wakes up on the way"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">She smiles letting go of his arm, causing his unconscious body to tumble in the air before hitting the hard wood flooring below causing a small smack as he hits the ground. Sarah lifts her leg up behind her to peel the sock off her right foot feeling as the sweat soaked material slowly pulls away causing a small chill to run over her skin once it is free of the wet material. <br>\r\n<br>\r\nShe sequels at the cold feel of the air as she hovers her foot above Arthur's small body laying limp against the floor before slamming down causing a huge boom to echo the hall when her foot contacts the floor. She starts to giggle even more as her foot slowly grinds the small boy's body flat against her sole. His body stretching out to fill every small crevice on the bottom of her foot before she raises back up to stomp down even harder on the already flattened boy. Once she believes that she has done a thorough job at what she wanted Sarah bent over to slide her sock back over her sweaty foot leaving both the smells of her foot and the small boy to be trapped within the damp confines of her sock.<br>\r\n<br>\r\nShe continues her journey to the bathroom now walking with more of a skip in her step every time she steps on poor Arthur she can feel the small squish as he is grounded further into her sole.<br>\r\n</font></span></div></div>",
            "created":1334034000,
            "id":1312704,
            "title":"Insole for her sock."
        },
        "1111112221111":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Thinking the better of a shower she decides to relax before bathing.",
                "Sarah makes it to the bathroom with a sigh"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur was the unlucky recipient of the worst torture thus far with Sarah taking not regard to his tiny body under her soles. Since earlier after she found out that Arthur was so stretchy and resilient to harm Sarah could do anything to him without actually killing him opening up a huge assortment of possibilities. <br>\r\n<br>\r\nWhether it was just the smell or the smell combine with the grinding of Sarah's foot over Arthur's body he woke up with a jolt of pain yelling as her foot was grounded into the floor. At the sound of the muffled cry of her prisoner Sarah giggle holding the front of her foot off the ground to flex her toes mashing his head in the small grip of her foot. <br>\r\n<br>\r\n\"You can't do this to people it is just wrong!\", Arthur coughs out just starting to gauge as his mind slowly catches up to his situation.  <br>\r\n<br>\r\n\"Oh! It is about time you are awake my little rubbery insole. I have no idea what you are talking about because to me it just seems normal to use you since you did cause me so many problems earlier today.\", she giggles feeling his squirming as he tries in vain to pull himself from her sole.<br>\r\n<br>\r\nBefore he even has time to open his mouth for a counter argument she slams her foot down sliding her foot across the hard wood floor taking delight from the muffled shouts of pain from the small squished Arthur in her sock.<br>\r\n</font></span></div></div>",
            "created":1334034000,
            "id":1312721,
            "title":"Arthur wakes up on the way"
        },
        "11111122211111":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "With a smile she slams her foot against the arm of the couch",
                "She smothers him between her two  feet grinding him into her soles."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah lets out a delighted sigh thinking of making Arthur's torment last just a little longer. She steps down on the ball of the foot with Arthur underneath to spin in place facing back down the hall she came down. She receives great delight to hear the muffled screams of the tiny boy as his body is twisted against her skin. Sarah starts to hop from one foot to the next shifting all her weight between each foot as she makes her way to the living room. Sarah jumps onto the couch lying out with the small boy still plastered to her sole. She giggles as he starts to tickle her foot with the moments of his body as it reforms. He begins to struggle trying to make his way out of the prison Sarah has put him in.<br>\r\n<br>\r\n\"When I make it out of here you are going to get what you deserve!” Arthur says as his hands and feet begin to work again. The outside of her sock can be seen stretching in all directions with the small imprints of his hands and feet against the elastic material of her sock.<br>\r\n<br>\r\nSarah raises her leg to sit on her knee smiling as she sees the small boy struggling in her sock. She takes her index finger and starts to pet against his body as she coos, \"Awww now that is no way to talk to a lady. You say that you are nice, but every time I try to do anything for you all you do is threaten me...\"<br>\r\n<br>\r\nArthur's movements start to slow as he takes in what she just said.<br>\r\n</font></span></div></div>",
            "created":1334034000,
            "id":1312743,
            "title":"Before going to the bathroom..."
        },
        "111111222111111":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Arthur passes out.",
                "Sarah can still fill his squirms as Arthur starts to reform."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur starts to relax thinking that maybe she will let him out if he starts to cooperate with her.<br>\r\n<br>\r\n\"I still don't agree with what you were doing to those kids earlier, but if you let me out of her sock then that will be a start to making up for what you have done.\", his heart starts to race as he feels her foot move thinking that she is about to take off the soak that has pasted him against her sole.<br>\r\n<br>\r\nSarah lifts her foot into the air feeling the small boy's body lay against her sole. She tilts her head smiling in amusement at Arthur's pleading. <br>\r\n<br>\r\n\"Hmmm I don't know Arthur you sound like you just want out of my sock. I think that you haven't learned your lesson...\"<br>\r\n<br>\r\nArthur is forced against her sole as she slams her foot down on the arm of the couch. The force from the sudden movement alone almost causes Arthur to pass out. The pain is beyond what the boy's small body can handle. He is squished against her skin as the full force behind her foot impacts his body. He closes his eyes trying his best to take the pain as everything he was thinking of is washed from his mind leaving only the hope that she will end this quick....<br>\r\n</font></span></div></div>",
            "created":1334034000,
            "id":1312749,
            "title":"Should I Iet you out?..."
        },
        "1111112221111111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Dare or Dare",
                "But just the two of us may be boring"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur can not take the pressure anymore and his body flattens, he looks like a sticker inside her sock. <br>\r\nThen he passes out. <br>\r\nFeeling him stop squirming Sarah takes him out of her sock and takes a look at his two-dimensional form and begining to laugh out loud.<br>\r\n-Hahahaha! Oh my god I can't believe this is so funny!  What should I do next...? <br>\r\nWell, I'll shower without you as you are not awake... it wouldn't be much fun without you trying to escape.<br>\r\nShe goes to her bedroom through one of the passages of the lab and throws the flattened boy in her bed while she goes to take a shower.<br>\r\n<br>\r\n<br>\r\nWhen Arthur awakes he looks around trying to know where is he exactly...<br>\r\nThe bed and some pictures in the walls tell him that he is in someone's bedroom.  He jumps on his feet just as Sarah enters the bedroom.<br>\r\nI hope you had a nice nap my little toy! I was waiting for you to wake up, I guess you know now which is your place or should I put you back in my socks?<br>\r\n...<br>\r\nArthur just looked at her with anger in his eyes.<br>\r\nShe laughed and sit on the bed, next to him.<br>\r\nOh c'mon don't be shy and don't worry, I'm not finished with you, I had so much fun with you that I have decided to keep you.<br>\r\nI have some games here to help us to know each other better....<br>\r\ne.e<br>\r\n</font></span></div></div>",
            "created":1334034000,
            "id":1312757,
            "title":"What to do next..."
        },
        "11111122211111111":{
            "author_id":"cobraman",
            "author_name":"Jusenkyo",
            "choices":[
                "Your gonna get it now",
                "Let's just keep going this game is fun :)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"Okay little guy i've got a list of dares in this hat mixed in with some truth questions so pick a card and do the dare without telling me what it is and if i can guess, you go again.\" <br>\r\nShe smiled brightly at him. Although the system she set up wasn't quite in his favor he was distracted by the beautiful smile so he pulled a card off the top and read it. <br>\r\nIt said 'try and lift sara' he looked at the card then back at the girl then the card then the girl. <br>\r\nHe gulped and set the card down he ran over to her and started pushing at her back side to try and lift her when suddenly she lifted up. <br>\r\nHe fell forward and had time only to look up in fear as she sat back down grinding her ass on him giggling as she felt him flattened and completely squashed.<br>\r\n\"Let me guess 'try and lift me', nice try little guy, A+ for effort\" she said, peeling him off of her.<br>\r\n<br>\r\nShe drew another card and handed it to him without looking. he looked at the top of the card 'Truth', it said, and he wiped his brow, then he read it out loud which was obviously a mistake.<br>\r\n<br>\r\n\"How far can Arthur stretch?\" he though about it for a second... He had acquired these powers recently and he didn't really know... so Sarah answered for him.<br>\r\n<br>\r\n\"Only one way to find out\" she shouted before gripping him with her toes and pinching his head with her hands.<br>\r\nThe boy panicked looking around completely unable to move before she began to stretch him across her body. <br>\r\nWhen he got to the tips of her outstretched arms he slipped and snapped back to her feet causing a painful rubber band like snap on Sarah who still held him by her feet. \"Ouch! <br>\r\n<br>\r\nHey, that hurt!\" she cried mashing him harder with her feet.<br>\r\nThen she said.</font></span></div></div>",
            "created":1334034000,
            "id":1312786,
            "title":"Dare or dare"
        },
        "111111222111111112":{
            "author_id":"cobraman",
            "author_name":"Jusenkyo",
            "choices":[
                "Dare: Chew Arthur like gum",
                "Truth: How good does it feel to have a tiny person insole."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"Well whatever... i'm not done with this game yet so draw another card\" She said dropping the mashed up little guy into the hat. <br>\r\nArthur got up woozy and with a card stuck to his back he pulled it off and read it in his head. <br>\r\nDare: steal Sarah's toe ring he gulped. He didn't want to go anywhere near her feet but if he didn't follow the card then Sarah would probably keep him smashed under her forever! He reluctantly jumpped off the bed to her feet sarah was a little confused at what he was doing so she kept her guess for later. As Arthur got to her feet he noticed that they were socked and he hated himself for what he was about to do, he ran up and crawled into her sock he shimmed his way down to the toes under the threaten of being somehow smushed. Arthur bravely continued on but found that sarah was not wearing a toe ring on this foot. He let out a moan of dismay but then repeated the prosses with the next foot. <br>\r\n<br>\r\nSarah couldn't stop giggling, the tiny boy on her foot ticled so much she smashed him when he got to her left foot which only made her laughf harder. She was certain that Arthur had found the 'Smell both of sarah's feet' card and peeled him off her foot. \"Well little guy looks like i win again you got the card that said to smell my feet right?\" she asked and arther shook his head. Sarah was suprised and grabbed the card she got a little ticked when she read it but then got a huge grin the future dose not look bright for Arthur. \" Well now it's my turn for truth or dare and you guess what i got out of this hat if you get it right i go again.\" She said pulling a second hat from seemingly nowhere.<br>\r\n<br>\r\nArthur wasn't sure that this would be any better but he had to play along to escape sarah closed her eyes and grabbed a card. She then turned around and jumpped up, Arthur watched and wonderd what she was doing until she came back down landing her giant moon right on the poor little guy. She sat and grindded for a minute and then let Arthur up to guess. He barly managed to groan out \" Squish Arthur with you butt.\" ding ding ding correct. sarah grabbed another card from the hat and it said...</font></span></div></div>",
            "created":1342501200,
            "id":1380543,
            "title":"Let's just keep going this game is fun :)"
        },
        "1111112221111111122":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Time for your punishment!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah read out loud: \"Truth: How good does it feel to have a tiny person as an insole?<br>\r\nSarah smiled and stood up \"The thing...is ... I don't really remember, maybe you could help me a bit remember\"<br>\r\nThe boy tried to find a way out \"But... the game... we shouldn't interrupt it...\" he started walking slowly backward \"Oh, don't worry, we can play more games later if we want, now I'm interested in finding out about something\" She had taken off her socks before so she just raised her foot giggling at the expression of fear in the tiny face.<br>\r\n\"There we go!!\" SLAM Her foot crushed the tiny boy completely flat under the foot girl, again, the boy groaned in pain and humilliation as his body lost one dimension under the laughing girl. Well now I better do some exercise so I can answer to the question! ^^<br>\r\nWith that she opend the door and jumped out skipping cheerfully with the tiny boy being crushed with every step. Suddenly she stopped.<br>\r\n\"By the way I want you to lick my sweat while I run, if I find my right feet sweaty when I get back you are going to be punished very severely...\" she said while raising a bit her foot<br>\r\n\"There's now way in hell I'm gonna\" SQUASH \"I didn't ask for your opinnion, I was just telling you, also you can be happy, although I will probably sweat a lot, I'm very clean so don't worry about it being dirty\" Sarah continued her run for ten minutes without stopping at all and enjoying the feeling of the boy being grounded in her sneakers with every step while trying to yell for mercy.<br>\r\n\"Pleaaase STOMP stop SQUASH for a momMMPHHH* finally she got home and threw herself to the sofa with a smile in her face.<br>\r\n\"Whew, that was hard... now let's see\"<br>\r\nAfter a few minutes of rest she took off her sneakers. \"I'm ready to answer, the truth is that having somewhere as your insole feels GREAT, as tired as you may be it feels great to know that there's someone who has it worst, and also it's comfy!\" <img style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" class=\"emoteZ\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\"><br>\r\nShe peeled the socks from her foot to fin a completely flattened Arthur, completely stuck face first to her, now sweaty sole.<br>\r\n\"C'mon I bet you didn't even tried\" The boy tried to speak \"Mmpgmpphhhh\" <br>\r\nShe let him fall to the floor so he could reform himself, which took him also a few minutes which Sarah used to recover from the exercise.<br>\r\n\"I wasn't going to lick your feet!! That's disgusting!!\" She frowned \"So you admit you didn't even tried??!\"<br>\r\nHe stared at her beautiful eyes, daring. \"That's something you are not going to force me to do!\"<br>\r\n\"You leave me no other choice, I'll have to show you how wrong you are...\"</font></span></div></div>",
            "created":1348549200,
            "id":1434978,
            "title":"Lick for life"
        },
        "11111122211111111221":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "That's enough!",
                "And nooow....."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah was a bit angry, the little boy openly defying her even after crushing him under her that much... it would be however an opportunity to show him that if she wanted something to happen it would happen one way or another...<br>\r\n\"So you think you can get away with disobeying me?\" she asked while raising her eyebrows. \"You can squash me but you can't force me to lick anything!\"<br>\r\nShe smiled \"So that's what you think? We'll see about that\" She picked up the boy in her fist and held him tight. After getting up she went to the kitchen and grabbed a chair. \"This will do\" the boy started to panic \"What are you planning!!\" The girl stayed calm this time \"You'll see...\"<br>\r\nThen she grabbed the boy and tied his extremities to each of the chair's legs so he would be left in the seat unable to move. <br>\r\n\"You know? I'm really tired after all that running\" and you are going to help me relax. \"By the way when I tell you to lick\" she said, while putting two fingers in the boy's mouth.<br>\r\n\"You will lick!\" She stretched his tongue out. He didn't seem to be in a lot of pain but he was certainly funny with his limbs stretched and his tongue out with a surprised expression in his face. The girl laughed at his expression \"You hadn't thought of this right?\" Then she turned around and held his tongue in her hand, between her legs.<br>\r\n\"Say hello to my butt bug\" and jumped on the chair. \"DO PLEADE DOD'T!!\" Her butt made contact with the boy crushing him mercilessly against the seat and leaving no space between butt and chair. \"And noooow, you are going to do what you should have done before.\" Sarah raised her feet and started rubbing them on the boy's tongue.<br>\r\n\"Aaaah, so relaxing, you see? It wasn't so bad\" The boy tried to move but was completely smushed and unable to move at all under her rump, forced to taste the girl's feet and feeling completely humilliated. \"Mmmpgphhhhh\" \"Yes, that's what I keep telling you\" she answered with a giggle\" This is just what I needed... so good... she started massaging her feet with his tongue and moaning a bit \"This is the best\" <br>\r\nThe body of the boy was completely under her rump, smushed and his tongue was in her hands, going out in between her legs and partly squashed under her too, she thought of something and held his tongue while she began moving her hips a bit smothering and grinding him under her crotch. She kept it like this playing with his tongue and rubbing it all over her feet while crushing the boy as a chair cushion.<br>\r\nAfter a while she got tired and let his tongue fall just resting her feet on it, while her butt kept the rest of the boy completely smushed under her.<br>\r\n</font></span></div></div>",
            "created":1348549200,
            "id":1434998,
            "title":"Someone got your tongue"
        },
        "111111222111111112211":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Hawaii!!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah was relaxing by sitting on him and playing when she heard the telephone ring... She ran to it without realizing (or maybe doing it) that the little one had his body tattooed her butt and his stretched tongue under her feet soo... *squish* *squish**squish* and little screams were heard from her butt... Sara giggled, took the phone and she stood on one feet while answering. Arthur was thinking of how to escape the sadistic girl when the pressure squashed his little spongy tongue. She smiled and said “Hello?” A woman with a stupidly high pitched voice answered “Congratulations! You have won a holiday for a week on Hawaii! “Sarah was so excited that she started screaming and jumping for the misfortune of the poor Arthur... she trampled his tongue without even wanting it.<br>\r\n“Thanks a lot!” she said, and run to starts packing... she grabbed everything she needed except for… “Oh my, I almost forgot” She peeled off little Arthur from her butt and feet saying “You heard that?! We're going on a trip! We will have so much fun right?!” ^^  <br>\r\nThe boy recovered a bit and answered \"pmfp, nooo...  c’mon, leave me alone, not beach! mfpfmp\"... “YEP! BEACH! HOT BEACH!  But how should I take you there… in my bags?...mmmm no that’s no good...” Sarah thought. “I KNOW!”... Then she took off of one of her flip flops... \"aaaw You will be perfect for this !” “No please!! I don’t want to be used as your flip flop!!” She grinned: “Good idea Arthur!! Thank you!” :D <br>\r\nHe whimpered as Sarah placed him on the ground face up and place her foot directly on his face, she then started to apply weight. The boy started to flatten under Sarah’s weight until only a little outline of his body was visible under Sarah's foot, the sole of the flip flop. She lifted her foot and peeled him off, he looked like an insole made by her very foot. Not done, she stretched his tongue under it and rolled it around each toe! When she was ready she slipped him on. “Ok, as you know it’s summer so I’ll probably sweat, you know your job. I don’t like sweat so you have until we get there to get rid of it”. With that, she took her first step *SQUISH* with a smile and giggling went to the bus stop to get to the airport….<br>\r\n</font></span></div></div>",
            "created":1361385360,
            "id":1536049,
            "title":"Hawaii and the missing flip flop"
        },
        "1111112221111111122111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "She believes Sarah",
                "She believes Arthur"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">The flight was luxury-style: cold drinks, fresh air... Sarah was in heaven... Arthur not so much... soaked in sweat, under her hot sole, crushed and feeling pain every second! When they finally arrived! Sarah took a taxi to the hotel where she was spending the holidays. Once there, she put down her bags, and jumped on the bed falling instantly asleep and giving the squashed flip flop some time to recover. Sarah woke up in the afternoon and decided to start her vacations heading to the spa. After changing her clothes to a towel she went to the spa center and asked for a massage. A big and curvy tanned woman led Sarah to a room with a bed and asked her to take her clothes off and get ready while she went for the oil. Before lying on it, Sarah took off her living flip flop, put him right in front of her face and said “Aaaw... how do you feel? Was it hard?” Muahahahahaa… She giggled while he tried to speak. \"You... heartless bii...” “Ooops, trust me, you don’t want to say that” <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/smirk.png\" alt=\"*Smirk*\" title=\"Smirk\" border=\"0\" width=\"15\" height=\"15\">  Sarah said and crushed him in her hand... \"NOW, I’ll be naked while massage so I have no place to hide you. Stay there and wait for me!! She ordered while leaving him on the floor” The masseuse arrived right then and Sarah just lay after glaring Arthur. <br>\r\nHe looked up to find himself free for the first time in a while and saw the masseuse spreading oil on Sarah’s back. He knew this was his opportunity so he didn’t doubt and started running for the door, but the masseuse saw him and yelled, thinking he was a mouse. He stopped and tried to explain before she crushed him some way. “Please wait!! I’m a normal person!!”<br>\r\nThe woman couldn’t believe it: “It’s… it’s true… What are you doing here??” <br>\r\n“That crazy woman held me captive and tortured me!!”<br>\r\nThe woman frowned when she heard him say that. “Is that true?”<br>\r\n</font></span></div></div>",
            "created":1361831460,
            "id":1539625,
            "title":"Found?"
        },
        "11111122211111111221111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Use him for the massage (don't use please)",
                "Use him for the massage 2"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah started to worry, this could be a problem, but the reaction of the woman gave her an idea: “It’s not true! We used to date and I supported him even with his size but he took advantage of my feelings and cheated on me!” she yelled while tears appeared in her eyes. Arthur couldn’t believe what he was hearing. And how the hell was he going to take advantage at his size?? He looked back at the woman, obviously no one would believe such an obvious lie. To his surprise the woman looked at him with disdain and anger.<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/confused.png\" alt=\"*Confused*\" title=\"Confused\" border=\"0\" width=\"15\" height=\"15\">  \"Yeah, I can imagine it, my boyfriend dumped me two days ago, when I started crying she called me crazy and said that I shouldn't take it so seriously...<br>\r\nWhile she spoke Arthur saw the closed door and starting climbing a table to get to the window. \"I have to get away, here is another psycho...\" While he climbed he saw Sarah smiling seconds before the other woman grabbed him tightly. \"Where do you think you are going??!! You little shit! I have work here and you interrupt me!\" Sarah spoke aloud: \"He should feel the humilliation of being used....\" The woman's face brightened up as she understood what Sarah meant. She looked at the tiny in the eyes and smiling started smiling. \"Well.... it's time to start the massage right?\". The boy gulped, unable to escape. <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/sad.png\" alt=\"*Sad*\" title=\"Sad\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\n </font></span></div></div>",
            "created":1361831640,
            "id":1539628,
            "title":"She believes Sarah"
        },
        "111111222111111112211111":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "I'm leaving now, you can keep him for a while to use him",
                "I'll just relax and keep him there..."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">The masseuse stretched the boy and moulded him a bit on her hands so he was prepared for what's coming. She started with Sarah's back.... \"Try to use his face as hard as you can if you are so kind\" said Sarah to the masseusse \"No problem\" She answered and started rubbing his whole body to Sarah's pleasure. She went up and down rubbing her like she usually did but with the additional help of the little boy with her strong beautifull hands, up and down up and down, left and right. \"Mmmm\" Sarah moaned \"I love it, I love these holidays and it's just the first day! Cool huh Arth?\" \"MPMPFMFPFMPFMFP\" was the only answer they could hear. The two girls started to laugh at the pathetic squashed figure, without stopping. When the massause finished with her back she smiled and started with Sarah's feet. Using him to rub against her sole, pressing his face hard against them while Sara giggled and then rubbing him between each and every toe. After that the massause doubted \"So… should I keep going?...\" \"Well, my butt is not going to massage itself\" answered Sarah laughing. <br>\r\n<br>\r\nThe masseuse smiled at the thought of the cheating man being crushed and squashed, completely humilliated in that girls huge ass. “Even in between?...”  she said. \"Of course! And be sure to use specially his face to wipe his cheating smile from it. The tiny tried to complain: \"What?? I didn’t do anything, and I don’t want to have your fat ass in my fmPPHHHUAAAAAAGGHH!!!\" <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/shock.png\" alt=\"*Shock*\" title=\"Shock\" border=\"0\" width=\"15\" height=\"15\">  The Masseuse had stretched his face like a towel and with that she started rubbing and wiping Sarah’s butt cheeks and the space in  between them with the tiny’s face... Funny sounds could be heard from between them, muffled words as his mouth was completely pressed against her butt. \"He doesn’t seem to like it\" \"Muahahaha i know! that's why i love it!\" <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/sleep.png\" alt=\"*Sleep*\" title=\"Sleep\" border=\"0\" width=\"15\" height=\"15\"> answered the hot liar while squishing him more and more by clenching and unclenching her ass. *Squish, squish squish*<br>\r\n<br>\r\nHis whole body was  drenched in her sweat and his face looked just like the string of her thong when the older woman raised him a bit. This only gave the two girls another thing to laugh at... To the young lady, that was the best start of her holidays... When the massage was done, Sara said… <br>\r\n</font></span></div></div>",
            "created":1374763920,
            "id":1634004,
            "title":"Use him for the massage "
        },
        "11111122211111112":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Milly is worse than Sarah.",
                "Milly IS worse than Sarah"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah stops right there, she is in a playful mood but she wants somone who can appreciate her work. She feels really creative and with no one there to see it except the subject of her tortures it feels lonely...<br>\r\n<br>\r\n\"Well shrimp, wait right there, I'm going to introduce you to someone I know, I'm not sure if you'll like her but I think she may make things waaaaay more interesting.\"<br>\r\nWith that she raises her butt and grinning at the look of the frightened boy, lets herself fall on top of him heavily while she starts phoning someone.<br>\r\nHe has time to mumble something similar to \"not again plmshpfg\" before he is pounded by her round butt again, she grinds a bit on him and chuckles while holding the phone.<br>\r\nSomeone answers and Arthur gets to hear some of the muffled conversation while crushed under her right cheek.<br>\r\n<br>\r\n-\"Hi!\"<br>\r\n-....<br>\r\n-\"Yep, I have something to show you, come right now, okay, byee!\"<br>\r\n<br>\r\nShe then hets up, peeling off slowly the boy off her cheek and begins molding him in her hands  like some sort of stress doll while waiting. The boy tries to speak but his mouth is smeared again and again as her fingers turn him into a little ball, thenn stretch him, then again roll him....<br>\r\n<br>\r\nSome minutes later a ring makes Sarah get up and she goes to the door, where she finds a really cute girl with a pair of glasses and peculiar clothes.<br>\r\n\"You always look like you just came out from an anime\"-says Sarah while inviting her to come in.<br>\r\n-\"I know\" - the girl blushed a little<br>\r\n-\"It suits you\"<br>\r\n-\"I also know that\" -the girl said, now smiling-<br>\r\n<br>\r\nAfter that they go into Sarahs bedroom. Sarah sits on the bed and starts talking:<br>\r\n\"Take a look, she is kinda my technician, when I want a piece of some machine or something like that she takes care of it, and she is the best at it.<br>\r\nShe is also crazy about cosplying as you can see and one of those people who..how should I describe it, experiment sudden changes in their behaviour.<br>\r\nBut as you can see she is really cute, oh, and by the way her name is Milly.\"\"And.... she is french, she added, smiling.\"<br>\r\n<br>\r\nThe girl who had just been described looks at Sarah first with curiosity and then thinking that she has gone mad. <br>\r\n-\".....Who are you talking to exactly?\"<br>\r\n-\"Oh, right I haven't introdeced him yet\"<br>\r\n-\"Him?\"<br>\r\n<br>\r\nSarah stops and raises her hands showing a beutiful purple pedicure, Milly looks at her hands and sees a small mush of dough...<br>\r\n\"Your imaginary frien...\"<br>\r\n<br>\r\nShe stops as she sees the form take slowly the form of a little cute boy.<br>\r\n\"What?\"<br>\r\n\"He has decided that he is now my archinemesis and I have decided that he is going to be my toy, so I don't know, I thought you would like to play a bit so I just invited you over.\"<br>\r\n<br>\r\nSomething sparkled in Milly's eyes as she began to smile slowly....<br>\r\n\"Oh, it's very kind of you...\"</font></span></div></div>",
            "created":1334120400,
            "id":1313445,
            "title":"Odd new girl?"
        },
        "111111222111111121":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Okay, I'll try something too!",
                "Milly wants to see more and asks Sarah to keep on with the show."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">The new girl stares at Arthur's squashed form. \"Can I pick him up?\" <br>\r\n\"Sure, go ahead\" Sara lets him fall on Milly's hand and she takes him to her face looking at him dazed and recovering from his useless state.<br>\r\n\"But, what if we kill him?\"<br>\r\n\"Kill him?, take a look!\"<br>\r\nSarah grabs him roughly again and starts strecthing him in her hands. Then she throws him to the ground and steps right on his face leaving the rest of him squirming trying to get free. Lily gasps but Sarah can see a smile slowly forming in her face.<br>\r\nThen Sarah bends over and grabs the tiny boy's flattened head and compresses him, then she stretches him and begins playing like if she was toweling with him after a shower.<br>\r\nRubbing him in her body, flossing between her legs with him. Everything while giggling in a playful tone.<br>\r\nThen she drops it again on Milly's hand.<br>\r\n\"See? he is perfectly all right\"<br>\r\nArthur was far from being all rigth but he certainly seemed alive despite his stretched form. <br>\r\nMilly begins to laugh and looks again at the tiny boy. Completely unable to escape.<br>\r\n\"Please...help me.... she is completely mad.\"<br>\r\n<br>\r\nLily looks at Sarah smiling.</font></span></div></div>",
            "created":1334552400,
            "id":1316928,
            "title":"Or is she...?"
        },
        "1111112221111111211":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Different clothes",
                "You can keep him on for now."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"Actually I could use some help, lttle boy and you seem like the man for the job.\"<br>\r\nArthur smiled brightly thinking of a little job that would allow him to get some freedom with his new pretty girl.<br>\r\n\"Of course, I will help you, lady, don't worry!\" -he says confident-<br>\r\nShe smiles widely and her beauty stuns a bit Arthur.<br>\r\n\"You are so kind\" -Arthur blushes a bit<br>\r\n\"And really cute!\" -More blush<br>\r\n\"Okay, leave it to me!! What do you need?\"<br>\r\nMilly looks down and takes off her boots... \"You see, I realized on my way here that one of my socks had a hole and it hurts a bit my feet.\"<br>\r\nSarah began to giggle...<br>\r\n\"And you want me to repair it, right?\"<br>\r\nMilly took off her sock and showed it to him, there was in fact a big hole on it.<br>\r\n\"Actually... I thought you could replace it\"<br>\r\n\"Replace it?\"<br>\r\nBefore he could understand what was happening, Milly, grinning grabs his face  as she kneals down... stretches the pathetic boy''s mouth and pushes him torward her right foot.... Stretching his lips as they go over the first few toes.... then all pale digits flex in his mouth as he got up to her arch..... he fits like a medical glove  around her dainty foot up to her ankle... his wittle arms and legs twitched in pain for Milly's amusement.<br>\r\nSarah couldn't hold it any longer and burst into laughter hard while Milly just smiled standing on the boy who really looked like a sock, mouth wrapped skin tight against a salty foot. <br>\r\n<br>\r\nArthur is confused and in pain, not a lot, but it is certainly not pleasant for him.<br>\r\nHe tries to say somthing but he only tickles Milly who stomps down effectively silencing him.<br>\r\n<br>\r\n\"Well, what do you think?\"<br>\r\n<br>\r\n\"I knew it was a good idea to call you. -Sarah smiled- I Hadn't thought of wearing him as clothes.\"</font><br>\r\n<br>\r\n</span></div></div>",
            "created":1334552400,
            "id":1316934,
            "title":"Always helpful"
        },
        "11111122211111112112":{
            "author_id":"kentwolf",
            "author_name":"Kentwolf",
            "choices":[
                "They decide to throw him in the wash with the other socks",
                "They decide to mould him into some other clothes or let him reform."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"You can keep him on for now. given your holey sock\" Sarah said dismissivly. Milly giggled and looked down at him one last time before slipping her foot back into her shoe, the tight confines of it pressing in on him from all sides. His vision went dark as her foot sealed off the hole. all he could taste was foot, all he could hear was her veins pulse as the leather pressing in on him blocked out sounds from the outside. he felt her wriggling her toes inside him. It couldnt get worse he thought to himself. then, she took a step. the world filled with pain, his stretched out littly body feeling the shuddering pressure of her shoe making contact with the hard floor, her foot pressing down on him from the inside against the shoe. it felt like it went on for eternity. it was such a releaf when she lifted her foot. Such a euphoric feeling of peace and no pain he almost forgot his situation. then she took another step and it all came shooting back.<br>\r\n<br>\r\nOver and over she walked, stepping on him and bringing him between pain and release. His poor little mind couldnt handle it and just shut down. He could taste her foot, feel her toes sweating inside him but he couldnt focus. His brain unable to hold off the pain and release. he had no idea of what was going on outside the shoe nor did he care. He wasnt aware they were casually walking about Sarah's lab drinking coffee catching up on current events as girls do. Their talking went on for hours. <br>\r\n<br>\r\nFinally she slipped her shoe off to look at him, his body had moulded around her foot comfortably, looking almost like a second skin. She chuckled and pinched at him, peeling him slowly off her foot, enjoying the sensation of his soft malliable skin peeling away from her own. She dangled the little sock boy infront of her face seeing the glazed look in his eyes \"awww the poor thing couldnt handle it\" she sniffed \"eeew he stinks\" Sarah chuckled \"what do you expect he was stuffed in your shoe all day. now what do we do with you?\" she asked finishing off her coffee and put it aside. Milly smiled and looked at him, holding her breath so she didnt smell your pungent scent...</font></span></div></div>",
            "created":1334811600,
            "id":1319157,
            "title":"What to do with a sock"
        },
        "1111112221111111212":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Sarah:\"K just makes sure that you don't hold anything back.\"",
                "Sarah:\"I have an idea so both of us can play with him.\""
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Milly puts her finger up to her lips in thought before looking back at Sarah.<br>\r\n<br>\r\n\"That does seem like fun, but is there anything else you have done with him?\", she raises her eye brow looking down at Arthur.<br>\r\n<br>\r\n\"Done!!...Done! She has done a....\", Arthur is cut off as Sarah squeezes her finger against his head using the faces of her fingers to roll his head like a rubber ball.<br>\r\n<br>\r\n\"He does make a good piece of gum... It is a really unique taste and hard to describe, but to hear the pain it puts him through is priceless.\"<br>\r\n<br>\r\nSuddenly Arthur's body begins to fail violently hearing her plans and the giggles from the two torturers he has found himself between. All Arthur knows is that his leg is soon held between two things that are large and plushiey similar to giant pillows. Unknown to him Sarah has start to slowly suck his leg through her lips taking his body into her awaiting mouth inch by inch. With one last slurp his head pops between her lips to disappear into her mouth. He starts fighting with her tongue to keep oriented until his face reforms. Sarah opens her mouth wiggling him around on her tongue showing off to a giggling Milly. <br>\r\n<br>\r\n\"Hehe I can't believe all that you do to him. You are so bad, but I so want to play around with your little boy.\", she purrs grabbing Sarah hand giving it a squeeze.<br>\r\n<br>\r\nSarah looks through the corner of her eyes while she throws Arthur between her molars listening to the muffled cries of help come from her mouth as his rubbery body is grounded between her teeth. She pushes poor Arthur as far as she can to the back of one of her cheeks leaving him to soak in a pool of her saliva. Once in awhile pushing him back between her teeth to keep him from reforming. She takes her tongue scooping Arthur up flattening him against the roof of her mouth before stretching him across the inside of her lips. She splits her lips wide enough to blow hot humid air into the boys face causing his body to flex trapping the air blowing into a large bubble before deflating and slurped back into her mouth.<br>\r\n<br>\r\n\"hmmm...\", Sarah looks over at Milly her head tilted and eyes half open.</font></span></div></div>",
            "created":1334638800,
            "id":1317361,
            "title":"Hubba Bubble Arthur gum"
        },
        "111111222111111122":{
            "author_id":"lilynelz",
            "author_name":"doormatlizardess",
            "choices":[
                "Milly - \"Lets stop this bug till he is mud next!\"",
                "Milly - \"Lets see how good of a toe ring he makes.... hehe.\""
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Milly looked at the little boy... so cute... so helpless.... Her big green eyes stared in awe for a moment and narrowed with a growing feral grin \"I'd... LOVE to.... hehe.... so this is what you called me over for, huh?\" She spoke as she snatched the boy greedily from Sarah's hand. Milly wrapped her fingers of her right hand around his legs and her left clenched his head into her fist. \"Ooooooo so soft.... hehe I can feel him moan now....\" she taunted as she stretched the boy several feet apart. Her face blushed as he deformed in her clutches.<br>\r\n<br>\r\nMilly licked her glossy lips and stuck out her tongue.... lean forward and touched the bottom of the outstretched \"bug's\" stomach and licked upward.... his torso was stretch out to over a foot long.... \"Hehe oh Sarah.... don't you find it cute when they shiver.....\" commented Milly as Sarah giggled into the back of her hand. Milly knelled down to Sarah's ankle, flicking the boy as if he were some stringed noodle with her tongue before she retracted the boy a little.... and curious lowered her hands to Sarah's ankle and began tying the bug boy's ankles around his wittle outstretched head... \"There.... I am sorry I forgot your birthday last week, Sarah... I hope this... fleshy anklet I got you makes you feel better... hehe...\" she looked up to her friend's eyes, smiling.<br>\r\n<br>\r\nHe looked so sad and helpless around the ankle of his mistress. But what could he do? Sarah idly kicked her legs and talked to Milly for a few minutes catching up.</font></span></div></div>",
            "created":1334638800,
            "id":1317429,
            "title":"Stretching, strethching...."
        },
        "1111112221111111221":{
            "author_id":"kentwolf",
            "author_name":"Kentwolf",
            "choices":[
                "Very slowly, he manages to reform and begin his escape of the lab.",
                "No use, he's stuck too firmly. He's a doormat until she peels him up herself."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Milly crouched down and untied him, not caring if she tugged him too hard, given his flexibility. she rolled him up into a tight ball and dropped him on the floor \"hehe lets see if we can get him to fuse to the floor\" she said pressing her shoe down slowly ontop of him, enjoying the slow compression of the little ball of manflesh slowly compacting under her relentless sole. Sarah raised an eyebrow and watched amused. the slither of light slowly shrank away like a setting sun before her shoe filled his vision and then, darkness. she didnt stop, she pressed down as hard as she could. Pain shot through him as she scraped her foot left, then right, then left again as if stubbing out a cigerette butt on the floor. She lifted her foot seeing his painfully mushed form compressed against the hard floor. He saw her amused grin and then, the shoe came shooting back down.<br>\r\n<br>\r\nSLAM, his mind filled with pain as it slammed hard down on him once more, slowly she lifted it off him, checking he wasn't stuck to her shoe sole before slamming it down again. she then stepped back and waved her hand to invite Sarah to take a turn. All he could do was stare up pitifully at the two uncaring women who held him completly in their power. Sarah's heel slammed painfully down on him and she kicked off with her other foot, spinning on the spot. Hhis body twisted with her as it was ground again around, mushing it more against the floor. a few more slams and then they walked off laughing, leaving him there to see if he was really stuck or if he was just in alot of pain. Either way Sarah was enjoying every second of it. <br>\r\n<br>\r\nAs his mind focused again he worked towards trying to peel his battered little putty body off the floor. He could feel it was sticking tightly to his malliable body, keeping it stuck like gum on the pavement. He kept up trying anyway...</font></span></div></div>",
            "created":1334811600,
            "id":1319162,
            "title":"Trampled"
        },
        "11111122211111112212":{
            "author_id":"lilynelz",
            "author_name":"doormatlizardess",
            "choices":[
                "She peels him up with her toe nail",
                "She lays on her stomach on the floor and licks his pathetic form to tease"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Milly walks up to the little smush on the floor. Her ears pricked up as she heard the sad defeated moans of the boy on the floor. She slid over a stool to sit on before him, planted her tush down and sat, crossing her legs, and folding her arms with a smirk looking down at him, giggling as he struggled. \"Well what do we have here.... hey you little foot-smush loser! How did it feel being walked on, huh?\" she mocked.<br>\r\n<br>\r\nShe hovered her socked foot over him. It was well worn. A thick smell came from it, washing over the already defeated boy. \"Like that, huh? Like being a pathetic bug? Something to roll between my fidgeting toes...  You don't mind if they stink, do you, hun?\" she said as she narrowed her eyes with a smirk. She pressed on him with her cheesy socked heel.... rubbed him... she could feel his pleas and moans and whimpering under her heel. \"Awww is my foot being mean to you? Too fucking bad! Hahahaha!\" She raises and slaps her sole on him a few times.</font></span></div></div>",
            "created":1340168400,
            "id":1363468,
            "title":"He's a doormat stuck to the floor"
        },
        "111111222111111122121":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Use him involving Sarah or one of her machines to humilliate him",
                "Use him herself to play a bit"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Milly soon decides that crushing him in his flattened form is not fun anymore, while rubbing her foot against his face as he tries to beg for mercy is indeed funny, he is already flat and she decides that she should do something else with him, maybe involving Sarah, maybe involving using one of her machines on him or maybe just stretching and crushing him in her clutches. Whatever it is, she needs him unstuck for it. She thinks of the best way to do it and finally plants her toe right on his face, hearing his whimpers, then she presses down on it while giggling a bit and after squashing his face she starts using his toe nail to slowly and painfully (for him) peel him off the floor.<br>\r\n<br>\r\n\"Aren't you happy?\" she asks \"You are about to stop being a doormat, mabe now you can be something better\" she says with a smile on her face.<br>\r\nThe boy is too tired to say anything and just lays down being scratched and peeled from the surface. When Milly is done she grabs him in her hands and decides to.</font></span></div></div>",
            "created":1340254800,
            "id":1363843,
            "title":"She peels him up with her toe nail"
        },
        "1111112221111112":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Sarah gains a comfy chair",
                "Arthur turns into something else."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Her foot hits the arm of the couch with the force of a mountain to poor Arthur as his body starts to slowly shut down from the pain. He becomes numb as his mind just wipes his body flattens and the small grooves from her sole can be seen through is stretched body. He desperately tries to move his muscles just working on trying to move. Sarah's tongue sticks out as she giggles feeling the little bug under her foot still alive and moving.<br>\r\n<br>\r\n\"Yay! I wish I would of found you sooner because you make the best toy ever. I could go all day just playing with you like silly puddy. The only difference is that you scream when squeezed which makes you the better choice hehe.\"<br>\r\n<br>\r\nSarah closes her eyes purring as she rubs her foot across the couch's arm feeling tiny Arthur wiggle only enough to let her know that he is still alive. Her eyes shoot open in a flash as a wicked smile spreads across her face.<br>\r\n<br>\r\n\"Oh!.... hmmm...\", she purrs.<br>\r\n<br>\r\n\"How about we give that ray another chance maybe this time I can make you into something like a personal massager.\"<br>\r\n<br>\r\nSarah swings her legs over the edge of the couch giving Arthur just a split second of rest before being her feet down against the floor. By this time Arthur was drenched in sweat out of his mind just focusing on this girl that holds him against his will. The few moments that he does get relief as she walks he protests what she is doing and that it is wrong. Arthur's complaints fall on death ears as Sarah not only does not care for the puddy against her feet, but she enjoys hearing him scream over him being happy. She slowly makes her way back into the lab slowly wandering through the house enjoying Arthur's pain.<br>\r\n<br>\r\nShe walks over to the table that the ray is pointing at to lean against as she raises her foot up. Sarah starts to pull off her sock smiling as she sees the form of her little friend stuck to her feet. Sarah picks at the edges of his body getting a hold to rip him off like a piece of tape. Arthur starts to reform long enough to get in a few words.<br>\r\n<br>\r\n\"You are the most evil girl I have ever meet! Why is it that you are doing this too me because I will promise never to bother you again if you just let me go!\"<br>\r\n<br>\r\nSarah smiles shaking her head as her mop like hair shakes from side to side with her movements.<br>\r\n<br>\r\n\"Nope!\", she is cheery as she rolls Arthur into a ball.<br>\r\n<br>\r\n\"As I said you just make the perfect little toy. You just happen to have faith working against you with this situation.\"<br>\r\n<br>\r\nShe tosses Arthur onto the floor strolling over to her ray to point at him and hit the button only giving his body time to half reform.</font></span></div></div>",
            "created":1334552400,
            "id":1316694,
            "title":"Sarah has an idea."
        },
        "11111122211111121":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "She sleeps on him.... when she awakes.....",
                "She decides to do something else to him or enjoy him more in his current form..."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"Don't you dare...!\"<br>\r\nThe ray hits him and Arthur closes his eyes, feeling his body expand and grow. He is actually growing! He grins thinking of how to escape now that he was about to be the size of a normal person.<br>\r\nHe opens his eyes confident only to see a Sarah's giggling face right above him. \"Why is she giggling, I'm sure I just grew\" - he thinks.<br>\r\nHe tries then to get up quickly but realizes that he cannot move. He is completely paralized. \" Hey what is happening!\" His vision was blaocked at his right and left side.<br>\r\nThen he realizes what had just happened: the colour, the feeling and his own shape.... He just became a chair! One of those big comfortable chairs with really soft cloth all over it, from the big back to the armrests.<br>\r\n<br>\r\nHe actually had made himself one -he remebered- with the spare cloth and foam that he had found in a shop. And now he was one of them, only a chair, helpless and completely at the mercy of the evil girl to treat him however she wanted.... then he realizes something he hadn't really think about, chairs are used on, but jugding by my point of view...<br>\r\n\"Oh c'mon!!\"<br>\r\n<br>\r\nSarah sees the chair talking to itself and finds it really funny. The boy had turned into a nice chair and the only part that resembled him was his face, flat on... the cushion...<br>\r\nWaiting fo her to plant her cute butt on it.<br>\r\nShe can't help but laugh in anticipation of the situation.<br>\r\n<br>\r\nSarah begins to walk toward the chair. All the instincts of the boy tell him to get away but he can only look at the beautiful lady getting closer.<br>\r\nThen she begins to touch the arms of the chair, \"Wow, you're so soft, boy. I'm so lucky to be wearing this blouse\"<br>\r\nThe boy-chair looks then at her outfit, which wasn't at all the robe she was wearing before. She must had changed at some point while he was crushed in her sock and she was wearing a blouse, which he hadn't been allowed to see because of his imprisonment in the evil girl's sock. A white blouse that let a bit of transparency and that did not cover her legs.<br>\r\nArthur, could see her panties, which where now white and certainly small.<br>\r\n\"Seriously, when did she have time to change her clothes?\" -he thought-<br>\r\nThen he realizes that he is actually seeing the girl in more or less her underwear, and turns red.<br>\r\n<br>\r\n\"Hahahaha, really?? blushing?? I didn't actually know that cushions could blush. Well, no need to blush, you will have to get used to it\"<br>\r\n<br>\r\nArthur sees her playing around a bit more sitting a bit on his arms with a wicked smile.<br>\r\n\"Well, I'm really tired, you see? I think I'll have a sear\"<br>\r\n<br>\r\nArthur begins mumbling: \"No, hey!...wait...listen...!<br>\r\nHis words don't make sense as he sees the round and perfect behind of the girl come down on him. He tries to move but he is completely unable to. As her ass comes down engulfing the cushion completely, he is only allowed to look at her crotch coming down right where his mouth is placed and the rest of her butt smothering his face completely.<br>\r\n<br>\r\nThe girl' pleasure is beyond words as she has absolute control over the living chair under her control. Humilliating him completely as she sits right on his face. Hearing the muffled attempts of the boy to say something that are squashed under her tush.<br>\r\n<br>\r\n\"Woah, your face is the most comfortable cushion ever. I really love it, I wonder if I'll ever get up...\"<br>\r\n\"You are just a...!!!\"<br>\r\nAs Arthur has barely managed to get a little space to let his rage out and insult her she slams again her butt on his face. <br>\r\nAnd his words are muffled this time more effectively as she starts grinding her crotch down on him.<br>\r\n<br>\r\n\"Tsk, tsk, ysk, didn't your mother told you that you shouldn't use swearwords?\"<br>\r\nShe laughs as he keeps trying to talk under her, it even ticckles her.<br>\r\n<br>\r\n\"Well, I guess I have to punish you then\"<br>\r\nAnd she keeps rubbing herself on the cushion while Arthur is completely humilliated at her mercy.<br>\r\n<br>\r\n\"I guess I'll relax now\" she says with her butt on his face</font><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/#/d4wfddb\" target=\"_blank\">http://coconocotoco.deviantart.com/#/d4w...</a> (Comic)</span></div></div>",
            "created":1334552400,
            "id":1316907,
            "title":"Give her a rest"
        },
        "111111222111111212":{
            "author_id":"kentwolf",
            "author_name":"Kentwolf",
            "choices":[
                "He was back to being a tiny defenseless boy with his red t-shirt",
                "He was a cute purple thong "
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">She shifted around on his face, grinding her cotton panties across him as she changed position. She wasnt uncomfortable but was relishing the knowledge that he was very uncomfortable with her weight ontop of him. She began playing in the seat rubbing her crotch again his face and receiving small amounts of pleasure from the friction. Her evil grin spread across her face as she started to get up a bit and wait for him to try to say something and then drop herself smothering him again. She started trying diffferent games as he felt her butt cheeks clench, smooshing his mouth between them like a slightly puckered up apperance. She leant back in the chair in fits of giggles knowing he had was unable to resist as she began clenching and unclenching her cheeks on his face. She chuckled bouncing up and down on his face, slamming her jiggling cheeks into his face over and over.  <br>\r\n<br>\r\nAfter a couple of minutes she sighed leaning on the arm rest, resting her chin on a fist \"oh im bored of this now. what else to do with my little toy boy\" she looked thoughtful, occasionaly grinding against him to keep him uncomfortably occupied. finally her eyes lit up, she clicked her fingers. \"aha ive got it\" she stood up and spun to face him with a content little smug grin on her face \"hehe your a boy...so im guessing you would hate something girly huh?\" he looked up at her with a confused expression, a little dent on the cushion that was his eyebrow was arched. \"what are you planning Sarah?\" he asked, glad of the fresh air at the very least. she just chuckled -\"or should I just turn you back into a boy so we can go somewhere out, I would like to go somewhere...\" \"hehe oh well. Just stay still!\" she chuckled at her comment and strolled back over, picking up the ray turning it on his cushioned form. <br>\r\n<br>\r\nshe was a bit reluctant to lose such a fun and comfortable chair, but she could always revert him to this later. after all, he belonged to her now. she fired the ray watching as he was engulfed once more by bright tingling white light. he felt his body arch and twist, expanding and contracting before hedropped down to the ground. As the light faded he saw her grinning down at him \"perfect. you turned out perfect!\" she said clapping her hands. She pinched her fingers on him and lifted him up showing him off in a mirror...</font></span></div></div>",
            "created":1334811600,
            "id":1319150,
            "title":"More fun while sitting"
        },
        "11111122211112":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Sarah thinks it would be fun to have the boy work as her wash cloth.",
                "Sarah decides to drop the boy off in the sink to wash up while she cleans."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah lets out a delightful sigh as she reaches the bathroom door. She wiggles her toes feeling the mushed mess that is left of Arthur under her foot. Sarah's tongue snakes out from between her lips into a adorable smile that only she could turn into a evil grin. She rolls her foot around on the floor holding onto the door knob to further play with Arthur.<br>\r\n<br>\r\n\"Oh, Arthur this turned out to be the perfect situation that you lead me too. If it wasn't for your little weakling knight act I would of never ended up with a small boy to experiment on. Even better now you are just perfect for playing with making you my little boy toy for my enjoyment.\", Sarah cackles at her own thoughts as she opens the door leading to a modest bathroom. She complains as she enters the room noticing how the sweat from her earlier jog is starting to dry leaving a layer of filth on her skin. The only thing keeping her from losing her happy mood is the feeling of clay under her foot as Arthur is squished with each step as the muffled sounds of her socked feet are heard through the bathroom. <br>\r\n<br>\r\nShe stops short of the mirror above the sink admiring herself posing as she shows off her curves. She smirks as the thought of Arthur being lucky enough that she lets him be squished under her cute soles let alone to take a bath with her. She would rather not bath with him, but she may have some fun out of using him to scrub every inch of her until she is spotless. She skips over to the side of the tub to fiddle with the water controls. As she is distracted she doesn't even notice the small tickle as the boy's body starts to inflate making an odd pancake shape with a large ball in the middle. Arthur starts to think out loud to himself in a whisper.<br>\r\n<br>\r\n\"This girl is insane before too long she is going to stretch me to a point where I won’t snap back. The problem is with her having so much fun I won’t have a moment to myself to find a way out, but if I take any longer....\", he is cut off as the girl's weight is pressed down on him. The ball of her foot twisting his back into knots as she twists her foot back and forth like one would put out a cigarette.<br>\r\n<br>\r\n\"It isn't nice to have a conversation and leave the other person out little boy.\"<br>\r\n<br>\r\n<br>\r\nShe lifts her foot off the cold tile floor to peel back the sock revealing a flatten Arthur groaning from the pain. Sarah smiles biting the edge of her lip to pick the boy off her foot to become frustrated as his body is so smashed onto her skin that she has to pick at the edges of the boy to get a good enough flap to peel him off causing his body to be stretched even more from her pulling. The boy yells begging the girl to give him a break only to be rolled up like a small carpet in the girl's hands as she plays with him. <br>\r\n<br>\r\n\"Wouldn't want you seeing anything until I am ready for you.\", she almost sings in her playful voice.</font></span></div></div>",
            "created":1334898000,
            "id":1319790,
            "title":"Sarah has some prep work in the bathroom."
        },
        "111111222111121":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Arthur can start at the feet since he likes them so much",
                "Sarah can't reach her back that well."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">She giggles dropping the boy on the floor with a thump. He starts to try and make for the door, but before he can even think Sarah's foot is upon him. This time is different though this time she just puts enough pressure to keep Arthur in place. She sighs and rolls her eyes at how the boy acted being in the bathroom of a cute girl and still trying to scamper away.<br>\r\n<br>\r\n\"You really should just start enjoying yourself you know? I am having a ball playing with you and all you keep doing is yell and try to get away at every chance you get.\"<br>\r\n<br>\r\nArthur is pinned to the floor on his stomach as he tries to push himself up not even budging her foot. He yells in frustration at how this girl just toys with him, and all he wants to do is leave.<br>\r\n<br>\r\n\"It's enjoyable to you because you aren't the one in pain all the time. In fact you seem to like it when I am in pain.\"<br>\r\n<br>\r\nArthur grinds his teeth the anger building in the pit of his stomach as this girl holds so much power over him without even trying. <br>\r\n<br>\r\n\"Oh don't be like that there was a few good times as well hehe. Some people even pay for girls to walk on their backs, and here I am doing it free of charge because I like to keep you around.\", Sarah pulls off her top hanging over her foot that traps Arthur.<br>\r\n<br>\r\n\"Now be a good boy and don't peak.\" <br>\r\n<br>\r\nShe winks down letting her foot off of the boy while letting her top drop down over top of him. Her giggling just gets louder hearing the muffled complaints of the boy as a little lump moves about her top. She hurries over to change into her swim suit that she has in the small bath room closet. For Arthur the only thing that he knew was going on is that he was now trapped with a heavy tarp like cloth material over top of him, and he doesn't think that he has enough strength from playing with Sarah to make his way out. He keeps his slow crawl in one direction just hoping that his luck will turn around as he hears the loud footsteps as Alice goes off somewhere else in the room. The sound of her feet slapping against the hard tile floor sending chills down his spine as he thinks back to the torture from earlier. His prison is pulled away quickly as Sarah happily greets him.<br>\r\n<br>\r\n\"Ready or not little guy here we go.\"<br>\r\n<br>\r\nArthur is about to let her know his complaints, but suddenly freezes with his jaw a gape as he looks up at Sarah. His heart begins to race and he can't find the words he was going to say as he sees the new two piece strawberry pattern swim suit Sarah is wearing. Arthur gulps as she reaches down giggling wrapping her fingers around his body without any fighting from Arthur.<br>\r\n<br>\r\n\"Now.... we just have to get you ready for a bath because I don't want to have to deal with cleaning your clothes if they get wet.\"<br>\r\n<br>\r\nThe still stunted Arthur watches as she opens her palm letting him lay out, and her thumb and forefinger starts to close in grabbing the bottom of his shirt. She pulls up almost ripping his arms off taking his shirt off before tugging on the bottom of his jeans.<br>\r\n<br>\r\n\"You might want to undo your jeans before I tear them off.\"<br>\r\n<br>\r\nShe smirks raising an eyebrow noticing how quiet the boy has gotten since she picked him back up.<br>\r\n<br>\r\n\"Also, it may be a good idea to close your mouth before I put my toe in it.\"<br>\r\n<br>\r\nSarah giggles as the boy shakes his head undoing the buttons on the top of his pants letting her pull them off leaving him in his boxers.<br>\r\n<br>\r\n\"Yea.... I guess uh..... I might as well go ..... along with this since I don't have a choice.\"<br>\r\n<br>\r\nArthur blushes looking down at the palm of her hand making her feat of laughter grow. She walks back over to the bath tub to sit Arthur on the edge as she climbs over him to lay out in the water. Arthur can't help but watch as her body passes over him causing a mixed group of feeling to bubble around in his chest. He looks off to the side away from Sarah as she sighs settling into the bath. Arthur is beyond confused at this point of what he should even do.<br>\r\n<br>\r\n\"So I had this idea that I could get you to help scrub me a little, but I am not really sure where to start...\"<br>\r\n<br>\r\nSarah ponders giving a cute little expression as she taps her chin looking up at the ceiling.</font></span></div></div>",
            "created":1335762000,
            "id":1326566,
            "title":"Arthur has mixed feelings..."
        },
        "1111112221111211":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Arthur makes it to Sarah's feet no problems.",
                "Arthur slips and falls into the water."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"I know how about you help me scrub my feet first since you like being around them so much.\"<br>\r\n<br>\r\nAn evil smirk spreads across her face as she looks down at Arthur expecting a reply. Arthur turns to look at Sarah only getting out a partial sentence.<br>\r\n<br>\r\n\"I don't....\"<br>\r\n<br>\r\nBefore he can finish Arthur's face goes red seeing Sarah and he quickly looks down at the edge of the bath rub where he is sitting. He whispers out.<br>\r\n<br>\r\n\"I don't like your feet...\" <br>\r\n<br>\r\n\"Oh is that so?!?\", Sarah gets a look on her face as if a cat as just caught her prey. She reaches over with her fingertip to lightly brush against his side causing him to jump in surprise and her to giggle in excitement. Arthur feels almost lost since this is the first time that she hasn't just smashed him since he came into her house. He heart starts to beat faster as he actually tosses the idea of doing what she says in his head debating with himself on if he should do what she asks or not. He looks up to Sarah seeing a sad pouting face of this girl that has tortured him all evening, but at that moment all he can think of is this indescribable feeling deep down to wanting to stay with his torturer. He can almost feel the heat come off his face as it turns red from embarrassed. <br>\r\n<br>\r\n\"I...I...suppose it wouldn't hurt just this once....\"<br>\r\n<br>\r\nSarah has to bite her bottom lip to keep from yelling in glee at the boy's obedience maybe she wont have to hurt him as much as she thought she would. Sarah turns around to scoop a small piece of shop in her finger nail bringing it over to lay beside Arthur. The small piece is like a entire bar of soap to him. She leans in close, her breasts resting on the edge of the tub in front of Arthur as she leans down to kiss the top of his head. <br>\r\n<br>\r\n\"See if you would just listen and relax instead of always trying to get away than we could have fun sometimes.\" <br>\r\n<br>\r\nSarah lays back content on seeing the blank expression on Arthur's face leaving him staring back at her. She lets her feet rest at the end of the tub hanging on the edge.<br>\r\n<br>\r\n\"Go ahead little boy get started...\"<br>\r\n<br>\r\nSarah purrs watching Arthur shake his head snapping out of his stupor. Arthur feels like he is about to go crazy everything he once knew change except for the fact that he is still going to end up under her feet. He reaches down grabbing the small wet lump of soap before looking down to Sarah's legs that are lifted out of the water. There has never been a site yet to compare to what is in front of him.</font></span></div></div>",
            "created":1335934800,
            "id":1327929,
            "title":"Arthur starts to change his mind."
        },
        "11111122211112111":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Sarah reaches down to pick him up."
            ],
            "content":"<div class=\"\"><div> <span>Arthur slowly makes his way across the slippery surface losing his footing only a few times causing feats of giggles to erupt behind him. He just couldn't place what it was he was feeling maybe it was just him trying to accept that he was stuck in this situation until Sarah decides to let him leave, but more over does he want to leave now? He almost seemed detached from the world around him while Sarah was also detached from her surroundings. Not by the thought of if she liked Arthur or not, but by the fun she was having with her little pet. She starts to wonder how willing she could make Arthur to his torture if she started flirting with him a little. She has already seen what changing into a bath suit could do to the little guy. He was practically like a little sheep following her every whim. As she watch the little guy come closer to her feet she almost wished that he would fall in the amount of fun she could have would be unbearable. Like having her own squeaking live bath toy. <br>\r\n<br>\r\nWithout a word Arthur looked up at the monstrous soles that stand before him now he really knew that he was crazy agreeing to this. He gulped and took the little piece of soap in his hand and started to scrubbing her hill. This task didn't seem all to unreasonable considering to Arthur every ridge in her sole is large enough for him to almost get a finger into scraping out the grim that as built up. As he worked Sarah was in a state of bliss not knowing if she should grab Arthur and play with him or force him to do this all night long. The thought of her skin wrinkling up did not sit well with her though. She slumped farther into the water causing her foot to press against Arthur catching him off guard as she barley pins him against the tiling on the wall of the tub. Small grunts escape from Arthur's mouth, but overall he did not say a word to her. Instead with the lump of soap still in hand he continued to scrub fixation on his task. He even tries to climb up her foot squirming as he tries to make his way from where he was trapped alerting Sarah that something wasn't right. She perks up looking down and noticing how he was wedge. She smirks at her pet readjusting herself to let him slide from under her sole, but not enough to make it easy on him. <br>\r\n<br>\r\nArthur finally pulls himself up with a final grunt hugging close to her sole scrubbing as he climbs. The little piece of soap dwindling as he goes across until finally he there is none left in his hands once he reaches the top. That doesn't seem to stop him as he starts to rub against each one of her toes just enjoying the feeling of hugging each one. That is until he notices Sarah staring straight ahead at him with a look in her eyes that froze him where he stood. </span></div></div>",
            "created":1335934800,
            "id":1328230,
            "title":"Arthur makes it to Sarah's feet no problems."
        },
        "111111222111122":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Arthur gets stretched into more clothing."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah dropped the small Arthur into the bathroom sink leaving him there to reform himself later, but for now Sarah ran some water filling the small bathroom sink turning it into a tub for small Arthur. Sarah just smiled watching the poor boy unfold returning to his original shape as she talked, \"Okay I want you to get all cleaned up for our big date tonight. I have a good idea of what I want to do, but I want to keep you guessing because that would make everything so much better!\" <br>\r\n<br>\r\nAt this point Sarah wasn't even hiding the joy that she was feeling from toying with the small boy. Arthur on his part just looked up in awe at the evil girl trying to read her face to guess if she was telling him the truth or if she was trying to trick him. It didn't take long for the water to fill up to Arthur's waist making a nice large pool for him to bath in as Sarah gave him wink moving off to clean up for herself. This gave Arthur time to think for himself as he started to splash water all over his body to try and clean off all the gunk that he picked up while being in Sarah's sock.<br>\r\n<br>\r\n\"There really isn't much getting away from the girl since I can't really climb up the slick surface of this bowl. Not like it would help anyway because she could easily catch me and then I would be in worst trouble....\"<br>\r\n<br>\r\nArthur was now starting to talk to himself trying to keep low enough so that Sarah couldn't hear him. A chill ran up his spine as he heard the girl start to sing while she bathed her voice causing all the torture from earlier to flood back into his thoughts almost as if he was reliving the torture all at once. All Arthur could do was splash the lukewarm water in his face to clear his thoughts followed by the sudden scare that Sarah gave him as he looked up. He was so distracted by his wondering thoughts he never even heard Sarah coming over to look down upon the little Arthur still trapped in the wash bowl.<br>\r\n<br>\r\n\"Well little guy, you seem to have had enough fun washing up for our date. I think it is time to dress you up for this restaurant I have been wanting to try forever. It is a little high class so we can't have you walking in looking like you have just been stepped on. Good news for you is I think I have the perfect idea on how I can bring you along with me.\"<br>\r\n<br>\r\nIf it wasn't for the sight before Arthur he may have been beyond petrified of Sarah's words. Looking down at Arthur was the same girl from before but this time she was cleaned up and wearing a towel around  body to keep decent. The towel covered anything from being seen but for poor Arthur it had the effect of hugging close to Sarah's body stunning Arthur with the sight of Sarah's body.</font></span></div></div>",
            "created":1343624400,
            "id":1393326,
            "title":"Getting ready for a date."
        },
        "111111222112":{
            "author_id":"bitclouds",
            "author_name":"Bitcloud",
            "choices":[
                "Arthur wakes in a dark place."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Sarah sat there smashing and squeezing the poor little hero trying her best to coax a reaction out of him but to no success. The only thing that her actions did was causes her anger to grow as she wasn't used to not getting what she wanted, and now more than anything she wanted Arthur to struggle and plead for her to let him go. A few times while pacing through the house she even passed by the kitchen thinking over the idea of using a few of the sharper instruments to see if she could get Arthur to wake up. The only idea that stopped her from torturing the poor little guy was than she wouldn't be able to play with him anymore if she got carried away with her fun. Her eyes light up with a devious fire behind them as she lowers her gaze to the small mass of skin and clothes balled up in her hand.<br>\r\n<br>\r\n\"I guess~.... If you aren't going to wake up and give me the common curiosity to pay attention when I am playing with you than I will just have to tuck you away somewhere until you wake up. Lucky for you I am nice enough to not mind carrying your little itty bitty body around with me until you do decide to snap out of your stupid groaning fit.\"<br>\r\n<br>\r\nSarah was already in nothing but a green tank top and a matching par of panties from having to take her clothes off to clean them after her run for the day. She wasn't dressed to impress Arthur in the slightest instead Sarah just did not see Arthur as a person. He was more like a toy or stress ball that belonged to her, so Sarah could do and say anything she wanted to say to Arthur without a second thought. She gave Arthur one last shake picking him up to in front of her face with that smile that would cause a man to freeze from the evil mischievousness behind that grin.<br>\r\n<br>\r\n\"One last chance to make me change my mind?\"<br>\r\n<br>\r\nArthur dangles between her fingertips not a word or sound coming out of his mouth. Sarah shrugs feeling that she gave him plenty of time to give Arthur a chance to change her mind. Even though she wouldn't even listen to his pleas anyway, she just wanted to hear some kind of reactions to judge how good of a job she was doing keeping him in pain. Sarah reaches around with her free hand to pull the waist band of her panties open leaving a gorgeous view of two round firm hills that had been covered by the thin material. She dangles Arthur over the opening letting go of the small guy letting him hit the fabric sliding down to wedge in between her cheeks causing a fit of giggles as she feels his body slump nicely into her panties. Sarah gives a little shake to her waist as the fabric pulls Arthur farther between her cheeks giving her a whole new sensation as she walks around keeping a small mental note of where he is, so Sarah can bring him back out for some more fun once he wakes up.</font></span></div></div>",
            "created":1340341200,
            "id":1364912,
            "title":"Still K.O, down with him..."
        },
        "1111112221121":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "choices":[
                "Start torturing him right then",
                "Pick him out to play with him"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur slowly wakes up, opening his eyes to find everything around him egullfed in darkness. Feeling his limbs sore but at least he is not streched out like before. He tries to move but finds himself completely inmobile, trying to look around he realizes that he is being pressed from all the sides at a time, but he doesn't know where the heck he is, he tries to remember what happened before but all that comes to his mind is sarah's feet coming down on him and the salty taste of Sarah's foot as she mushed his face.<br>\r\n<br>\r\nArthur starts panicking as he is completely unable to move and tries to squirm his way off wherever he is, feeling it closed and sweaty. He can't think at all and he tries to find out his location when a idea starts forming in his mind.<br>\r\n<br>\r\nSarah was laying in the bed reading a bit when she feels Arthur squirming and moving, trying to escape. An evil grin appears in her face as she realizes that the time for some entertainment has come. Giggling she decides to...</font></span></div></div>",
            "created":1340514000,
            "id":1366537,
            "title":"Where am I?"
        },
        "11111122212":{
            "choices":[
                "Locks the door and gets in the shower",
                "Gets out of the room "
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Arthur begins to squirm and scratches Sarah's fingers fighting ferociously.<br>\r\nFinally she lets him fall puting her scratched finger in her mouth as the boy falls on the floor and hides between the towels.<br>\r\nSarah begins to look around triying to find the tiny boy but she doesn't see him.<br>\r\n\"Where are you now?!\"<br>\r\nArthur stays quiet and doesn't move, as the girl begins to get more and more furious!<br>\r\n\"Ah!! That's it! You better hide well because if I ever find you you are gonna regret it deeply!\"<br>\r\n<br>\r\nAnd with that said she....</font></span></div></div>",
            "created":1334034000,
            "id":1312760,
            "title":"Escape"
        },
        "111112":{
            "author_id":"iarturoi",
            "author_name":"Artu",
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\"> Sarah grabed Arthur. he was a cute yellow sponge with two big eyes but no mouth, so he was unable to talk.<br>\r\n-You know? this is the punishment for those who get in my way. Being whatever I want them to be.   e.e<br>\r\n<br>\r\nShe let him fall in the tube and she began undressing. Arthur was shocked, completely in awe as he saw the beautiful body of the evil scientist get rid of all the clothes that were on her, after taking of her pants and shirt showing a perfect curvy body, she unhooked her bra, letting free her big breasts and took off her pink small panties showing her perfect butt.<br>\r\n\"Maybe you would have been better as a pair of panties... well now it's not the time..\"<br>\r\n<br>\r\nArthur was as scared as shocked, and that was a lot.<br>\r\nShe got in the tube and turn the water on, then grabbed Arthur squashing him and grinned.<br>\r\n<br>\r\n\"Well, its your time now big boy, I need your help.\"<br>\r\n<br>\r\nArthur screamed a silent: NOOOOOOO.... in his mind as he was brought under the water and coverd in soap.<br>\r\nAfter that Sarah began cleaning every corner in her body, she ground him in her boobs, rubbed her arms with him and after rubbing him all over her thighs, she took extra care with her lower body slaming him face first in her crotch and rubbing him hard all over her butt while asking the boy.<br>\r\n<br>\r\n\"How do you feel? lucky huh? Not may people can be as close as you are to my body.\"-she giggled while looking at the spongue, rubbing it all over her body-<br>\r\n<br>\r\nArthur felt the most humilliated man in the world as he had been turned into a sponge for that girl to enjoy him.<br>\r\nShe enjoyed the feeling of the tiny boy being rubbed and crushed by her body. Feeling his sponge body sliding over her smooth skin.<br>\r\nAfter finishing she gave him a small kiss.<br>\r\n<br>\r\n\"You know what? You did it so great that I'm going to keep you like this forever. What do you think?\"<br>\r\nArthur opened even more his eyes trying to scream -NO PLEASE, LET ME FREE-<br>\r\n\"Well if you don't say a thing I guess that means that you agree\"- she said while laughing.<br>\r\nIt was a bluff... she planned to free him in a few days but as she took some showers using him, she decided that she liked him like that, she enjoyed the power she had over the sponge-boy.<br>\r\nAs time passed by she discovered new ways of enjoying her shower with her toy, using him in very sensitive ways.<br>\r\nIn the end, he was used as a sponge for the evil and pretty girl forever, fearing everytime she would came and torture him while enjoying her shower....<br>\r\n<br>\r\n</font></span></div></div>",
            "created":1332306000,
            "id":1299251,
            "title":"A sponge for her."
        },
        "11112":{
            "author_id":"cobraman",
            "author_name":"Jusenkyo",
            "choices":[
                "She heads to the gym",
                "She goes to the mall"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"Huh, what the heck\" Sara said after the ray had fired and nothing seemed to happen. <br>\r\n\"Does this mean it dosn't work on humans?- lets try it again\". <br>\r\n\"Get ready to be a cute shirt.\" she shouted and fired it again, and again, nothing happend. <br>\r\nNow she was frustrated she walked over to the little glass she had the little boy. <br>\r\n\"Great it dosn't work on people now how do i punish you for making me drop my ice cream.\" she said as she looked at the small boy.<br>\r\n<br>\r\n\"That wasn't your ice cream you stole it\" he shouted and a frown crossed her beutiful features not so much because he said she stole it but because he was talking back! ò.ó<br>\r\n then she got an idea. she grabbed the tiny boy out from under the glass.<br>\r\n<br>\r\nPOV Arthur<br>\r\n<br>\r\nThat evil girl had now grabbed him and.... set him on the floor? was she letting him go? Then he saw her butt coming down on him, she sat down crushing him to a mush.<br>\r\nThe pressure was huge! not that she was that big but she was a lot bigger than him and he could feel something happening to him but he couldn't quite tell as her beautiful booty covered his entire field of vision. \"You're lucky you know? not many guys get to be this close to me\" -she said, and then she lifted up but unfortunately Arthur traveled with her butt. <br>\r\n<br>\r\n\"Huh? where did he go?\" she said looking around giving him time to peel off and fall to the ground still paper thin. then she noticed him on the ground. <br>\r\n\"Well well well, what do we have here.\" she said lifting her now bare foot <br>\r\n\"Looks like i have a new insole\" she said grinning and stomping on him as he stuck to her foot. She put her sock and shoe back on giggling and walked out of her lab thinking about all the evil things she could do to her new streatchy squishy toy.</font></span></div></div>",
            "created":1332997200,
            "id":1305527,
            "title":"Alternative punishments"
        },
        "111121":{
            "choices":[
                "Squats, with you in my buttcrack!",
                "Yoga! (writers choice of position)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">As Sarah pondered what she can do to this so called \"hero\",  poor Arthur was bring flattened by her bare foot. The intense weight of her entire body pressing down on him. Luckily, her socks provided cushion for our rookie hero Arthur. Sarah soon began to rub her foot into the ground and stand on one leg. She giggled so sweetly and innocently that you couldn't believe how mean she was, more accurately evil! Arthur was being grinded under her sole, experiencing excruciating pain. His body was being polverized for a couple minutes until Sarah finally came to a decision. \"Ooh I know! I can punish you and maintain my slender body.\" with that said she began to jogg out of her laboratory. Each step only seemed to hurt more and more. For Arthur it felt like a track dropped on him. <br>\r\n<br>\r\n-15 minutes later- <br>\r\n<br>\r\nSarah arrives at the gym with a gleaming smile of purely white teeth. She changed from casual cloths to her workout gear of black sweatpants and a black track jacket. On the back of her jacket read \"Princess\" while on the back of her firm behind read \"Evil\" she was dedicated to her intentions. Arthur however remained under the sole of her foot, his time under there should be enough punishment but it didn't seem Sarah was done with him. She entered the gym and quickly scoped out for an open treadmill. Three were open, as Sarah rushed to take her spot. She lands on the tread with a loud -Thump!- she sets the machine on for a 5k run (3.1 Miles) and starts her workout. She had a large purse with her and from it pulled out her iPod. As she sung to her tunes peacefully running Arthur had to use this time to create a plan to not only free himself but be sure Sarah stops her ways. Earlier he imagined a black hole that sucked up her doomsday remote.  Mabye he could do it again? He focused on a black hole sucking Sarah up and off the treadmill. No luck though. Mabye something else? Was it a fluke? He tried imagining her to stop running but she instead began to speed up! Kicking fast and puffing hard to maintain. As the pressure and pain took toll on Arthur he could no longer focus on freedom. Instead he tried to hold out and endure this abuse.<br>\r\n<br>\r\nTo Arthur's dismay Sarah ran for 23 minutes non stop. She walked off the treadmill tired and exhausted. She went to a fountain for water and remmembered her little toy. She took off her sneakers and pulled off her socks. They stuck well to her feet and were moist from sweat. Once off she couldn't help laugh and fall down on butt. She cringed from the little fall but was still smiling when she saw tiny Arthur's body stuck to her foot. The sweat super glued him on face first to her feet. She stood back up and scrapped her feet on the gyms carpet. After three scrapes Arthur peeled off. Flat like paper he remained on the ground. She picked him up and quickly moved him away. \"phew, so do you still feel like a hero?\" Arthur was unable to reply due to his flat and exhausted form. \"well I still feel the need to workout, so how about some...\"</font></span></div></div>",
            "created":1336539600,
            "id":1333559,
            "title":"Evil has to stay fit!"
        }
    },
    "info":{
        "author_id":"iarturoi",
        "author_name":"Artu",
        "brief_description":"A tiny boy, an evil sexy scientist girl... shrinking, transforming, squashing!",
        "created":1322003280,
        "description":"<td align=\"left\" class=\"norm\">This story is an interactive narration of the comic published in deviantart you can find the comics in the following links:<br>\r\n<br>\r\nPage 1 english: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4ndt45\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4ndt45</a><br>\r\nPage 2 english: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4pca5q\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4pca5q</a><br>\r\nPage 3 english: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4rpwi2\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4rpwi2</a><br>\r\nPage 4 english: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4t8uxq\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4t8uxq</a><br>\r\nPage 5 english: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4tnx7e\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4tnx7e</a><br>\r\nPage 6 english: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d4v8j6w\" target=\"_blank\">http://iarturoi.deviantart.com/#/d4v8j6w</a><br>\r\nPage 7 english: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/#/d58sk4g\" target=\"_blank\">http://iarturoi.deviantart.com/#/d58sk4g</a><br>\r\n<br>\r\nAuthor: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/\" target=\"_blank\">http://coconocotoco.deviantart.com/</a><br>\r\n<br>\r\nOther pictures:<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/#/d4tibsq\" target=\"_blank\">http://coconocotoco.deviantart.com/#/d4tibsq</a><br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/gallery/#/d4te9v6\" target=\"_blank\">http://iarturoi.deviantart.com/gallery/#/d4te9v6</a><br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://iarturoi.deviantart.com/gallery/#/d4pozh1\" target=\"_blank\">http://iarturoi.deviantart.com/gallery/#/d4pozh1</a><br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/#/d4vp9ao\" target=\"_blank\">http://coconocotoco.deviantart.com/#/d4vp9ao</a><br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/#/d4vej55\" target=\"_blank\">http://coconocotoco.deviantart.com/#/d4vej55</a><br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://coconocotoco.deviantart.com/gallery/#/d54ebi4\" target=\"_blank\">http://coconocotoco.deviantart.com/gallery/#/d54ebi4</a><br>\r\n<br>\r\n<br>\r\nAs the author, I'll add to the main storyline (always the first option) as new chapters of the comic are released, and after the prologue, I'll put new options for the chapters for anyone who wants to have fun imagining what could have happened if something different had happened making What if...? storylines.<br>\r\n<br>\r\nMain characters:<br>\r\nArthur: Tiny boy who wants to be a hero, ends up being...somethig like a gum human so he can be squished or streched and he will reform.<br>\r\nHe is a nice boy and tries to help whenever he can.<br>\r\n<br>\r\nSarah: She is...evil, smart, beautiful and evil, loves to do bad things to Arthur, I don't mean dirty things, well , maybe she also likes that but mainly to do bad things. She hates when people don't do things the way she wants.<br>\r\n<br>\r\nSome rules:<br>\r\n<br>\r\nYou can squish  and crush the characters but keep them alive, Arthur won't die from being streched, transformed, worn, etc... <br>\r\nYou should do some bad things to the girl sometimes. XD<br>\r\nNothing about farts, vore, nothing about swallowing the character.<br>\r\nAll kinds of crush are allowed.<br>\r\nBe creative ;)<br>\r\n<br>\r\n<u>Just to make it clear you are free to add in any chapter as long as it's not the main storyline, if you accidently write on it I will delete it and send you a message with your original text in case you want to add it in some other chapter.</u><br>\r\n<br>\r\nThe story tells the adventures of a tiny boy (really tiny) who wants to be a hero getting in the way of an evil scientist girl (Sarah) who is not pleased with it....<br>\r\nRead the comic or the story to know more about them...<br>\r\n<br>\r\nI'm not putting resttrictions in the chapters for now, but please nothing very harsh, and if you are writing a chapter please, dont make a chapter with four words....<br>\r\nThank you very much and enjoy! ^^</td>",
        "id":1827775,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1394075580,
        "modified":1394075580,
        "pretty_title":"Tiny Hero"
    }
}