{
    "chapters":{
        "1":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "The Novel Series",
                "The Comic Worlds",
                "The Movie Worlds",
                "The Animated Series",
                "A Self-Created Variant"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">Welcome to the Hyborian Age, the time of Conan, of Kull, of Red Sonya, and many others.  A Simpler Time where Strength of Steel, Body, and Mind decided who ruled, and who would be ruled.  A World of Fantasy where many miracles, and many ill deeds were wrought.  A world of many races who shared these lands, though rarely in peace.  <br>\r\n<br>\r\nOver the decades, many different outlooks and interpretations of this Time have been made, each belonging to its own Unique World.  Choose now, which will you follow?  </div></span></div></div>",
            "created":1402894800,
            "id":1813232,
            "title":"Choose your beginning"
        },
        "13":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Conan Movieverse 1 (Barbarian, Destroyer, & Legend Of)",
                "Conan Movieverse 2 (Barbarian 2011)",
                "Kull",
                "Red Sonya",
                "Other Options"
            ],
            "content":"<div class=\"\"><div> <span>Within the Movieverse of the Hyborian Ages, there are two for Conan, one for Kull, and one for Red Sonya.  These comprise of:  <br>\r\n<br>\r\nConan 1 - Schwarzenegger:  Two movies released with one more in the making. The first of the Movie outings and the one some know the best.  What new stories might await here?  What variations of what was shown might be made?  <br>\r\n<br>\r\nConan 2 - 2011:  The 2011 Reboot, just one movie.  What might you make here?  How many more stories are just begging to be told?  <br>\r\n<br>\r\nKull:  <br>\r\n<br>\r\nRed Sonya:  Technically not the same as the Conan 1 Movieverse, but maybe not?  What will you do here?  <br>\r\n<br>\r\nOther Options:  </span></div></div>",
            "created":1428779820,
            "id":1962521,
            "title":"The Movie Worlds"
        },
        "131":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Follow Conan",
                "Follow Thulsa Doom",
                "Select another character"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">Excellent!  Now to decide on where to begin, and who to begin with.  <br>\r\n<br>\r\nWill you select to go with Conan?  The Cimmerian Orphan himself?  What will he be doing?  And when?  And where?  <br>\r\n<br>\r\nOr would you prefer to follow Thulsa Doom?  The first of his Chief Antagonists, being the one who orphaned him in the first place?  <br>\r\n<br>\r\nAnd naturally, there are many others you may wish to decide on instead of just these two.  </div></span></div></div>",
            "created":1428780060,
            "id":1962525,
            "title":"Conan Movieverse 1 (Barbarian, Destroyer, & Leg..."
        },
        "1312":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Early Days, building up his Power",
                "Mountain of Power",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>So you have elected to follow the life and times of Thulsa Doom?  Then before you begin, some background information.  <br>\r\n<br>\r\nThough originally a Kull Antagonist, he was chosen over Thoth-Amon and proved to be a very capable counterpoint to Conan, with their wildly differing outlooks on life.  <br>\r\n<br>\r\nWhere Conan was one who believed in the Strength and Will of the Individual, Thulsa Doom saw people as  being weak-willed and easily shepherded for the most part, with not many truly strong, and himself as their shepherd.  His Strength derived from his legions of followers, all willing to serve him, and Die in his service.  All controlled by himself at his Stronghold, the Mountain of Power, a series of caverns and tunnels either formed naturally or dug out to serve as his Base of Operations.  <br>\r\n<br>\r\nA powerful Shamanic Sorcerer, with the ability to transform himself from Human to Snake at will was suggested in the movie, though its Novelisation indicated that he was a Serpent-Man (a human/snake hybrid) who could become a full snake if needed.  <br>\r\n<br>\r\nWith the deviation from the Source Material it is in fact, quite possible, that he is simply one who has taken the Name of Thulsa Doom, making it his own.  <br>\r\n<br>\r\nNow though, where this story might begin, and when, is to be decided.  </span></div></div>",
            "created":1428782820,
            "id":1962549,
            "title":"Follow Thulsa Doom"
        },
        "13122":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Orgy and/or Feast",
                "One of the others"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">So Thulsa Doom is residing in his Mountain of Power, then he has already established the Cult of Set, a Cult Movement that worships Snakes and answers to the Snake God Set.  So amongst the many things he might be doing here, they might be:  <br>\r\n<br>\r\n<b>Orgy and/or Feast</b> - Every now and again, one such event is held where the attendants are often drugged out of their minds while they feast and pleasure themselves plus each other.  Thulsa Doom is usually just observing these going-ons, but he might decide to join in for once.  <br>\r\n<br>\r\n<b>Research/Experimenting</b> - Either having others do it on his behalf, or do it himself, depending on what's being looked into.  Methods for securing more power for himself?  De-Cyphering old Scrolls?  New Mixtures of toxins/drug?  <br>\r\n<br>\r\n<b>Addressing his Followers</b> - He may be leading them out to battle, or it might be a Sermon he holds for his Followers.  <br>\r\n<br>\r\n<b>Preparing to leave</b> - After all, he would have need to exit to conduct business of his own, and certainly so if its importance were great enough to Warrant his being there.  </div></span></div></div>",
            "created":1428783420,
            "id":1962556,
            "title":"Mountain of Power"
        },
        "131221":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Thulsa Doom chooses to eat first",
                "Thulsa Doom decides to have some 'fun' before he eats"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">With the processions proceeding more than smoothly, the Serpent Lord of the Cult of Set could lean back in his seat, set in the Alcove, and relax.  Slitted eyes running past his elongated snout to look from one end of the carnivorous hall to the other, where dozens of his devoted were lost to the haze of their own base desires - aided by the pungent smoke of the incense that rose and twisted their way throughout.  <br>\r\n<br>\r\nAll the entrances and exits were sealed, save for his own behind him that only he could permit passage through, the steaming cauldrons full of food set and waiting to fill the stomachs of those in attendance, pitchers of the finest wines ready to be drained.  <br>\r\n<br>\r\nIt was a rare event, a very rare event, for Thulsa Doom to participate in this.  But with events firmly in his favour, he had allowed himself this night of indulgence, to allow himself some personal good time.  <br>\r\n<br>\r\nThe main reason perhaps, why the black boots that rose to just below his knees, with the Eye of the Serpent set securely around his neck, comprised the entirety of his choice of attire here, the robe, waistband, headdress, and forearm guards set to the side as one leg rose to rest over the armrest, his scaled penis full of blood and tapping his abdomen, his forked purple tongue flicking out to taste the air.  <br>\r\n<br>\r\nTo his right, next to his booted foot, lay the Princess Yasmina.  Trapped in her own induced stupor and blind to the going-ons right next to her, which was fine by the Snake Lord.  <br>\r\n<br>\r\nLazily turning his head to look at her, for a human, she was a fine specimen.  Firm full breasts with more than good teats, slim, healthy enough for his liking.  In fact, the only question that bothered him, and even then not by much, was would he have his ‘meal’ right now, and then worry about having some personal entertainment either here or in his quarters?  Or would he prefer to have the fun now, and then eat?  <br>\r\n<br>\r\nDecisions, decisions…</div></span></div></div>",
            "created":1428795420,
            "id":1962671,
            "title":"Party in the Mountain of Power"
        },
        "131222":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Research/Experimenting",
                "One of the remaining two"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><div align=\"justify\">Then of the remaining options:  <br>\r\n<br>\r\nResearch/Experimenting<br>\r\n<br>\r\nAddressing his Followers<br>\r\n<br>\r\nPreparing to leave<br>\r\n<br>\r\nWhich would it be?  </div></span></div></span></div>",
            "created":1428783540,
            "id":1962558,
            "title":"One of the others"
        },
        "1312222":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Addressing his Followers",
                "Preparing to leave"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then out of the two that remain:  \"Addressing his Followers\" and \"Preparing to leave\".  Which would be be doing?  </span></div></span></div>",
            "created":1428783600,
            "id":1962559,
            "title":"One of the remaining two"
        },
        "14":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Conan",
                "Wrath-Amon",
                "Greywolf",
                "Mesmira",
                "Another"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">The Animated Series that ran from 1992 to 1993.  A rather lighter and softer take on Conan given its Target Demographic being a Saturday Morning Cartoon Show, but not here, it does not need to be.  <br>\r\n<br>\r\nPerhaps good in its representation of the Conan World with its Ethnically Diverse Cast, heavy use of magic and other mystical events, along with a lot of non-human races.  In this world, who might you wish to follow.  </div></span></div></div>",
            "created":1428783780,
            "id":1962561,
            "title":"The Animated Series"
        },
        "142":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "The Beginning or Soon After",
                "During the Series",
                "Series End"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">Wrath-Amon.  The Primary Antagonist of the Animated Series on account of being the Primary Focus of Conan's Quest for Vengeance.  <br>\r\n<br>\r\nHis Origin was a fairly odd one, beginning his life as an Ordinary Gila Monster who was kept as a Sniffer by the Army of Set.  Later, his immediate predecessor, Ram-Amon ran out of patience with Dregs (a Naga) whose perpetual incompetence and failure led him to use the Black Ring to reform Wrath-Amon from a lizard to a humanoid lizardman to serve as a far more capable Right-Hand 'Man', sparing no attribute in his creation.  It worked.  Too well.  Less than an hour later and Wrath-Amon had deposed him, claiming the Black Ring as his own, becoming the Chief Servant and Cleric of Set, gaining his name and a new almost-human form with it.  <br>\r\n<br>\r\nSo where might you begin his story?  <br>\r\n<br>\r\n<b>At the Beginning</b> - Perhaps something else occurred to him after his creation?  And even if not then, he was busy during the 200+ years before the Series itself actually began.  <br>\r\n<br>\r\n<b>Sometime in the Series</b> - Something may have happened that altered his course, or perhaps something that wasn't looked at.  <br>\r\n<br>\r\n<b>Series End</b> - While he was reverted back into a humble lizard at the end, it might have only been temporary.  Or it could be that he was either able to escape, or turn things around in his favour and win.  </div></span></div></div>",
            "created":1428785160,
            "id":1962572,
            "title":"Wrath-Amon"
        },
        "1421":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Stole the Black Ring",
                "Did not get the Black Ring",
                "The Intervening Years"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">If you're going to choose this option, then which particular time-point and scenario do you desire?  Might it be:  <br>\r\n<br>\r\n<b>Stole the Black Ring</b>:  So like in the Series, he was successful in taking the Black Ring from Ram-Amon, and becoming the new Chief Servant of Set.  But would it be exactly like the Series, where he took it within an hour of being remade into a Lizardman?  Or did it take him a while longer?  That could have a serious effect on what follows.  <br>\r\n<br>\r\n<b>Did not get the Black Ring</b>:  This would mean that he did not claim the Black Ring of Set, thus Ram-Amon remains High Priest, and Wrath-Amon must answer to him.  How would be cope in such an outcome?  What tasks would be be given to him?  <br>\r\n<br>\r\n<b>The Intervening Years</b>:  While the Series focused on one portion of his time, he had lived for over 200 years (made possible by the Black Ring).  What would he have done in this time?  </div></span></div></div>",
            "created":1428791280,
            "id":1962634,
            "title":"The Beginning or Soon After"
        },
        "1423":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Revived, in a manner of speaking",
                "Escaped to start anew",
                "He emerged victorious"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">At the end of the Series, though Wrath-Amon had succeeded in freeing Set from the Abyss (a Dimension where he'd been rapped in for millennia) and had more power than ever, Conan faced him one last time, both determined to finally put an end to the other.  In this battle, the Black Ring was prised from him, and combined with the Amulet of Vathelos, he was first forced back into a Lizardman, and then finally back to the mere lizard that he'd began his life as.  <br>\r\n<br>\r\nSo what will you do here?  <br>\r\n<br>\r\nWill someone have seen reason to bring him back?  If so, for what purpose?  How would the Former Chief Servant take this, most likely being on the Bottom Rung of the Ladder with far less chance of making his way back up.  <br>\r\n<br>\r\nOr perhaps he was able to escape.  Flee the Pyramid and restart his life elsewhere.  But with being forced to remain in Lizardman form as the most probable scenario here, how would he get by in the World?  One where his (one of a) kind is despised and the knowledge of all he had done by a select few who may be inclined to spread the word?  <br>\r\n<br>\r\nThen again, he might not have failed at all, he could have reversed his collapsing fortunes for a massive turnaround victory, snatched from the very jaws of his defeat.  What would happen to him?  To all of Hyboria should this be the case?  </div></span></div></div>",
            "created":1428789180,
            "id":1962612,
            "title":"Series End Remake"
        },
        "145":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Follow Zula",
                "Follow Windfang",
                "Follow someone else"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">After all, there are a LOT of characters to be explored, and here's some more:  <br>\r\n<br>\r\n<b>Zula</b>:  Prince of the Wasai Tribe, and Blood Brother of Conan.  What might he have done, when not with Conan, or before or after their adventures together?  <br>\r\n<br>\r\n<b>Windfang</b>:  Winged Draconic Humanoid.  Once a Human General named General Venturas, he was forcibly mutated into a monstrous form by Wrath-Amon, shunned by all he loved, and eventually forced into Wrath-Amon's Servitude.  Anything to be done with him, I wonder?  </div></span></div></div>",
            "created":1428785400,
            "id":1962574,
            "title":"More Characters"
        },
        "1453":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Misha",
                "Sasha",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">Then what about these characters:  <br>\r\n<br>\r\nMisha:  Older Sister to Greywolf, made into a werewolf by Mesmira, Queen of Stygia.  She could have some tales to tell.  <br>\r\n<br>\r\nSasha:  Older Brother of Greywolf, also a werewolf thanks to Mesmira.  </div></span></div></div>",
            "created":1428785580,
            "id":1962576,
            "title":"Some more options"
        },
        "14533":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Follow Jezmine",
                "More choices please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><div align=\"justify\">Another option then, could be Jezmine.  A Circus Acrobat and Thief who joins Conan and aids him in his Quest, though she has a hidden past that will come to haunt her.  </div></span></div></span></div>",
            "created":1428788520,
            "id":1962602,
            "title":"More Options"
        },
        "145332":{
            "author_id":"bahamut626",
            "author_name":"Bahamut626",
            "choices":[
                "Follow Astivus",
                "Go with someone else"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">Then what of Astivus?  Jezmine's Father.  While a Serpent-Man, he fell for a human woman, marrying her (initially in secret), and bearing a daughter with her.  Though his desire to protect them, and his superiors extreme reluctance to honour that (to put it mildly) oft set him at odds with them.  </div></span></div></div>",
            "created":1428788640,
            "id":1962606,
            "title":"More choices please"
        }
    },
    "info":{
        "author_id":"bahamut626",
        "author_name":"Bahamut626",
        "brief_description":"From the Animated Series of 1992/3, see what could have been.  ",
        "created":1375832520,
        "description":"<td align=\"left\" class=\"norm\"><div align=\"justify\">From the Time after the Oceans drank Atlantis, before the rise of the Sons of Aryas, there resided an Age, undreamed of.  In this realm, Barbarians, Knights, Hunters, Sorcerers, Priests, Mages, Necromancers, Clerics, Gamesmen, Kings, Queens, Slaves.  All living in a World of wonder, enchantment, and danger.  Many Human, many not.  <br>\r\n<br>\r\nWith the rating set at the maximum, what occurs within here can go extremely far, you have been warned.  <br>\r\n<br>\r\nEnter now, and make the world they reside within.  </div></td>",
        "id":1946403,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1428795480,
        "modified":1428795480,
        "pretty_title":"Age of Hyboria"
    }
}