{
    "chapters":{
        "1":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "My Period",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Cast of Characters"
            ],
            "content":"<div class=\"\"><div> <span>I'm Marina Douglas.<br>\r\n<br>\r\nI was born and raised in a fishing village on the East Coast. My dad was Jonas Douglas, who was a commercial fisherman who helped keep the village fed. My stepmother was Cordelia, and Adrian was my half-brother. For my young life, Dad didn't say a lot about Mom, only that she left when I was a baby, and that he loved her and missed her every day. He had a few pictures of her, and she and I looked a lot alike. Hardly a day went by without Dad saying to me, \"Princess, you look more like your mother every day.\"<br>\r\n<br>\r\nDad only took me out on his boat, <i>Heart of Doria</i>, once a year, on my birthday. Adrian, on the other hand, got to go out anytime there wasn't school. \"Adrian will take the boat when I'm done,\" he'd say, \"but you, Princess, have another destiny.\"<br>\r\n<br>\r\n\"What destiny is that, Daddy?\" I'd ask.<br>\r\n<br>\r\n\"One day,\" he'd reply, \"you'll see your mother, and you'll know your destiny then.\"<br>\r\n<br>\r\nDad made it all sound so amazing that I really wanted to believe it sometimes. Other times, I wondered why he went to such effort. I mean, sure, I was blonde and pretty, but I was a fisherman's daughter. People like me didn't have grand destinies. We married local boys and started having children before we were out of high school, and that was the happy future.<br>\r\n<br>\r\nBut, as it turned out, I was more than just a fisherman's daughter. And I did have a grand destiny.<br>\r\n<br>\r\nAnd I learned about it in the week between my first period and my 14th birthday.</span></div></div>",
            "created":1585285200,
            "id":2808640,
            "title":"Marina"
        },
        "11":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Appetite",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>A week before I turned 14, I was going to the bathroom when I saw a red stain on my panties. If Dad and Adrian hadn't been out fishing, I would have said, \"Cordelia, I'm having female problems.\" But , since Cordelia and I were the only ones home, I called to her, \"Hey, Cordie, I'm on the rag!\"<br>\r\n<br>\r\nShe came running, and she was super thrilled that I had asked for her, \"instead of calling your friends.\" She sprayed the panties with something that she said was supposed to prevent staining, but never really did, \"so say hello to your period panties.\" I know she really wanted to bond with me, but she seemed to think that trying too hard wasn't trying hard enough.<br>\r\n<br>\r\nAnyway, she showed me how to put a pad into a clean pair of panties, and she helped me to my bed, since I really wanted to lie down. So she could be a great help, and I loved her. I just wished that she dialed it back sometimes.<br>\r\n<br>\r\nI texted my friends, Coral and Bermuda, and told them about my period. They brought me chocolates and celebrated my becoming a woman, something they'd already been through. \"It's weird,\" Coral said, \"you got the curse before you started shaving your legs.\"<br>\r\n<br>\r\n\"Leave her be,\" Bermuda retorted. \"It's bad enough men talk like there's only one way women should be. We shouldn't join them at it.\"<br>\r\n<br>\r\nCoral did have a point, though: of the three of us, I was the only one who hadn't yet needed to shave her legs, or her pits, either. All the hair I grew was on my head.<br>\r\n<br>\r\nWhen Dad and Adrian got home, Cordelia told them about my first period. Dad congratulated me, and Adrian said I was gross.<br>\r\n<br>\r\nLate that night, I got up to get a drink. I poured a glass of water, took a swig, then grabbed the jar of sea salt and poured some into the glass. Deciding that tasted better, I took the glass to my bedroom. I drank half the glass before I remembered that people weren't supposed to drink salt water.</span></div></div>",
            "created":1585285200,
            "id":2808658,
            "title":"My Period"
        },
        "111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "A Mermaid?",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>The last thing Dad always did before taking the boat out was feed his fish. He had an aquarium in the family room, and he fed the fish every day. No matter how crazy the outside world got, after a half hour of looking at the aquarium, Dad always felt better.<br>\r\n<br>\r\nHe shared his love of the fish with us, telling us about every kind of fish that he had. Even if you ignored everything he said about the fish, you came away knowing how important they were to him, and that was something.<br>\r\n<br>\r\nThe day after I discovered my thirst for salt water, Cordelia went into town. \"I thought I had more sea salt than that,\" she said as she headed out.<br>\r\n<br>\r\nWhich left me alone in the house. Cordelia figured I'd be okay, that the worst of my period was over. Which it probably was, but I soon found a different problem to occupy my mind.<br>\r\n<br>\r\nWhenever I passed the aquarium, my tummy would rumble and my mouth would water. I didn't know why, it just happened, like how I suddenly had to add salt to my water bottles.<br>\r\n<br>\r\nI ignored it for as long as I could.<br>\r\n<br>\r\nThen, I couldn't resist it any longer. I walked over to the tank and looked down at the fish. Selecting a clownfish, I reached into the tank, pulled out the fish, and put it in my mouth and ate it. It tasted good, like something some rich snoot would order at a restaurant. Since I liked that so much, I thought I'd try an angelfish next.<br>\r\n<br>\r\nI was putting it in my mouth as Dad walked in the door.<br>\r\n<br>\r\nHe looked at me. I looked at him.<br>\r\n<br>\r\nTears forming in my eyes, I ran to my room and cried into my pillow. Why had I done that? And why did I enjoy it so much?<br>\r\n<br>\r\nDad knocked on my door frame before coming in. I didn't dare to look at him. \"I'm sorry, Daddy,\" I sobbed. \"I don't even know why I did it. And I... I think I'll do it again, if I get a chance.\"<br>\r\n<br>\r\nDad patted me on the shoulder. \"I'm not mad, Princess,\" he said softly. \"I'm not even disappointed. If anything, it's a bittersweet feeling.\" He pulled me up into a sitting position. \"I knew this would come. I just... I thought there would be more time.\"<br>\r\n<br>\r\nI turned to face him. \"What is it?\"<br>\r\n<br>\r\n\"You really are becoming more like your mother, Princess. You're becoming a mermaid.\"</span></div></div>",
            "created":1585285200,
            "id":2808709,
            "title":"Appetite"
        },
        "1111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "The Next Morning",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"A... mermaid? But, Daddy,... there's no such thing as mermaids. Everybody knows that.\"<br>\r\n<br>\r\n\"But I know differently, young lady,\" Dad replied. \"When Cordelia gets back, we'll all discuss it. Have you started drinking salt water yet?\"<br>\r\n<br>\r\n\"How did you - \"<br>\r\n<br>\r\n\"Because you're Doria's daughter, and I've never forgotten the first woman I loved.\"<br>\r\n<br>\r\n<div align=\"center\">******************************</div><br>\r\n<br>\r\nCordelia got back half an hour later, and Dad sat us all down at the kitchen table. \"I met her the way you would expect a fisherman to find a mermaid,\" he said. \"She got caught in my net. I won't deny it, when I first saw her, I thought of how much money she could bring in for me. Once I looked into those seafoam green eyes, though, all I wanted to do was protect her. When she kissed me, that just sealed the deal.\" He chuckled. \"She told me later that she could absorb languages through physical contact. Which meant touching my hand would have done it well enough, but she felt compelled to kiss me.<br>\r\n<br>\r\n\"Once she could speak English, she told me her name was Doria. Once she got her legs, she needed a place to stay, and I took her in. The more we talked, the deeper in love we fell. Almost before we knew it, she was pregnant.\" Dad looked at me and smiled. \"The second time I fell in love. We were happy, the three of us.<br>\r\n<br>\r\n\"Just after you'd been weaned, Doria got word that things had changed where she had come from. They... they needed her back right away. Since you had legs and no gills yet, you had to stay with me. But she told me that you would one day have to join her, and it appears that day is coming. I'll start bringing a live box, so I can bring you something more filling than tropical fish. And we'll fill some bottles, so you can stop using all our salt.\"<br>\r\n<br>\r\n\"Daddy,\" I said, \"maybe you're mistaken. Maybe I'm not a mermaid. Maybe - \"<br>\r\n<br>\r\n\"Marina, if any of your friends drank as much salt water as you've been drinking, they would be sick as dogs. It's happening, and it's not going to stop. Soon enough, it will be undeniable.\"<br>\r\n<br>\r\nI went to bed that night with my head full of Dad's stories. My sleep was filled with dreams of the sea. And, sometimes, I thought I heard a woman's voice, calling to me.</span></div></div>",
            "created":1585371600,
            "id":2809282,
            "title":"A Mermaid?"
        },
        "11111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "The Next Day",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>When I woke up the next morning, my feet were out from under the bedsheets, and I was looking at them as I stretched. That was how I saw it.<br>\r\n<br>\r\nYou see, I was spreading my toes apart when I stretched, but some of my toes didn't spread. And those that did were now webbed.<br>\r\n<br>\r\nI sat up to get a closer look at my feet. The reason some of my toes wouldn't spread apart was because they were fused together.<br>\r\n<br>\r\nAs I was examining my toes, something else caught my eye. I moved the sheets away from me. There were patches of blue-green scales here and there on my lower body.<br>\r\n<br>\r\nI sighed, knowing that two things were undeniable: I was becoming a mermaid, and I would have to tell my friends.<br>\r\n<br>\r\n<div align=\"center\">******************************</div><br>\r\n<br>\r\n\"You have got to be joking, Marina,\" Bermuda said. \"Mermaids? There's no such thing as mermaids.\"<br>\r\n<br>\r\n\"I used to think so, too,\" I replied. \"But my mom's a mermaid, and now I'm becoming one, too.\"<br>\r\n<br>\r\nThe three of us were in my bedroom, much as we were the day before, when we celebrated my first period. Except, this time, I was dressed only in my bathrobe. Also, this time, Coral wouldn't stop looking at my feet. \"So what do you think did that to her feet?\" she asked.<br>\r\n<br>\r\n\"I don't know,\" she replied, \"I'm not a doctor. And what you need is a doctor, Marina, not fish stories from your father.\"<br>\r\n<br>\r\nI stood up. \"Do you think I'm going to let a doctor - <i>any</i> doctor - see <i>this?</i>\" I opened my bathrobe, revealing that, not to get too graphic or anything, I had scales where Coral and Bermuda had hair.<br>\r\n<br>\r\nThat shut Bermuda up. Fused toes were one thing, fish scales were something else.<br>\r\n<br>\r\n\"So,\" Coral asked, \"what do you do now?\"<br>\r\n<br>\r\n\"Dad says, once I change completely, I'll go to be with my mom for a while.\"<br>\r\n<br>\r\n\"How long is that?\"<br>\r\n<br>\r\n\"I don't know. Mom and I haven't seen each other since I was off the spout, so there's a lot of catching up to do. And I've got to find out what being a mermaid really means. And there may be rules for this that I don't even know. But, as soon as I can, I'm going to come back and see everyone.\"<br>\r\n<br>\r\n\"We'll be waiting,\" Bermuda said softly.<br>\r\n<br>\r\nCoral wrapped an arm around each of us. \"What she said.\"</span></div></div>",
            "created":1585458000,
            "id":2809449,
            "title":"The Next Morning"
        },
        "111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Days Go By",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Needless to say, I didn't leave the house after finding out I had scales. I didn't need Mrs. Aberdeen watching me turn into a mermaid. Dad got me fish to eat and salt water to drink, which satisfied my dietary needs. And it's not like mermaids are known for their suntans, so I really didn't need to go outside until it was time for me to go find Mom.<br>\r\n<br>\r\nI woke up the next morning to find that my scales now covered more of my lower body, and all my toes were now fused. Which would have been big enough headlines, except for when I walked into the bathroom and looked in the mirror.<br>\r\n<br>\r\nI had three slits on each side of my neck. Yep, I grew gills.<br>\r\n<br>\r\nCordelia tried to act normal, like what was happening to me was just a chapter that somehow got edited out of <i>What's Happening to My Body?</i>, but I could tell she was scared of the way my gills opened up with every breath. Join the club, Cordy. You don't mind that I'm the club president, do you? Didn't think so.<br>\r\n<br>\r\nCordelia was super glad when Coral and Bermuda showed up, since they remained unchanged, human. I was the only one preparing for a life underwater.<br>\r\n<br>\r\nUnlike my stepmom, Coral and Bermuda didn't try to dance around the fact that I was changing. They even told me something I hadn't noticed on my own: \"Your butt looks a little smaller in those shorts,\" Bermuda said.<br>\r\n<br>\r\nOf course, it wasn't the shorts. My butt was smaller, probably because my anatomy would be much different in the days ahead.<br>\r\n<br>\r\nI was getting used to things, anyhow. I even posed for the mirror like mermaids were supposed to, combing my hair, and dangling my legs off the side of the bed like it was the rock I was sunning myself on.<br>\r\n<br>\r\nWhen Dad got home, he confirmed our suspicions: When my birthday came around, I wouldn't have to worry about blowing out the candles, because I would be under the sea for most of that day.<br>\r\n<br>\r\nDad also brought me fish (now almost all I ate) and plenty of salt water, far more than I could drink. This was explained when he poured some into my bathtub.<br>\r\n<br>\r\nThat night, instead of putting on my nightshirt, I took off all my clothes in the bathroom. Then, shutting the bathroom door and turning off the light, I climbed into the tub and submerged my head. I was scared for a little while, but I soon realized that I could breathe just fine.</span></div></div>",
            "created":1585458000,
            "id":2809901,
            "title":"The Next Day"
        },
        "1111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "My Birthday, and the Final Change",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>There isn't much to say about the next two days, as all we did was plan my upcoming one-way trip: The family would carry me from the house to Dad's truck, then from the truck to the <i>Heart of Doria</i>. Then, Dad would pilot it out to sea, and I would throw myself overboard and swim down. The only difference was how much of my lower body didn't have scales.<br>\r\n<br>\r\nThe day before my birthday, I was covered in scales from the waist down. My toenails were gone, too. Which meant that I had just one day of walking left.<br>\r\n<br>\r\nI didn't think the day had any surprises for me, but it did. I left my room for lunch (one fish, whole and gasping for breath, which was why I ate in my room), when my family and friends yelled \"Surprise!\"<br>\r\n<br>\r\nThey'd decided, since I was going to be gone starting on my birthday, they would have the party today. I'll admit, I was touched.<br>\r\n<br>\r\nNaturally, the party was light on presents, since I wouldn't be needing blue jeans or cute shoes. But Coral and Bermuda did make a clamshell bra for me. Besides, nobody knew when I would have cake and ice cream again, so that was the big treat.<br>\r\n<br>\r\nI still ate my lunch and my dinner in my room, though. People still didn't want to watch my meals bleed.</span></div></div>",
            "created":1585544400,
            "id":2810165,
            "title":"Days Go By"
        },
        "11111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "My New Home",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>When I woke up the next morning, I could somehow tell that it was in the wee hours yet. I tried to get out of the tub, but I couldn't.<br>\r\n<br>\r\nMy eyes could see quite well in the darkness, and I saw why I was having trouble: The point where my legs separated was now just below where my knees had been. \"Cordy!\"<br>\r\n<br>\r\nAfter a few minutes, she opened the bathroom door and turned on the light. \"Did you say something, hon - Oh, dear Lord!\"<br>\r\n<br>\r\nAdrian called out, his voice getting closer. \"What's going on?\"<br>\r\n<br>\r\nCordelia intercepted him. \"Go get your father,\" she said. \"Tell him Marina needs help. I'll get her ready.\"<br>\r\n<br>\r\nAdrian went to get Dad, and Cordelia got me into my clamshell bra. \"How do you feel, honey? Does it hurt?\"<br>\r\n<br>\r\n\"No, it doesn't hurt,\" I said, \"it's just not something I'm used to.\"<br>\r\n<br>\r\nOnce Dad was in the bathroom, he and Cordelia carried me to the bed of his pickup truck. Then they threw a tarp over me, and the rest of the family got into the cab and drove out to the boat.<br>\r\n<br>\r\nWhen the tarp was taken off of me, we saw that my calves were fused together. It wouldn't be long now. I was hauled aboard the <i>Heart of Doria</i>, and we shoved off.<br>\r\n<br>\r\nDuring the voyage out to sea, my feet joined together, and my lower body grew into a tail. And I do mean grew: my tail was twice as long as my lower body had been with legs.<br>\r\n<br>\r\nFinally, Dad joined us. \"This is about where we first met,\" he said. \"Do you need any help?\"<br>\r\n<br>\r\n\"Just get me to the rail,\" I said.<br>\r\n<br>\r\nOnce at the rail, I tried climbing over, but my tail was awkward. I had to let Dad and Cordelia pick me up and throw me far enough away that I wouldn't hit my head on the hull.<br>\r\n<br>\r\nAs soon as I hit the water, I felt back in my element. I took a few practice laps around the boat, becoming accustomed to swimming with a tail, then I began swimming down.<br>\r\n<br>\r\nI was about 200 feet below the surface when I saw three figures approaching me from below. As they drew closer, I saw that they were two mermen and a merwoman. The merwoman was dressed in robes, and had a regal authority about her.<br>\r\n<br>\r\nFinally, they swam close enough for me to see their faces, particularly the merwoman's. She was older, but otherwise looked just like... me.<br>\r\n<br>\r\n\"Marina?\" she asked.<br>\r\n<br>\r\nI swallowed a lump in my throat. \"M... Mom... ?\"<br>\r\n<br>\r\nShe swam up and hugged me. I hugged her back, grateful that the ocean camouflaged how I was crying.</span></div></div>",
            "created":1585544400,
            "id":2810562,
            "title":"My Birthday, and the Final Change"
        },
        "1112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "I want to hear more.",
                "I don't answer.",
                "continue.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>\"A... mermaid...?\" Wide eyed, I asked.<br>\r\n<br>\r\nDad nodded. \"Those old sailor stories have more truth to them than you might think.\" Calmly, he said. \"There was a terrible storm a little over sixteen years ago. It was my first commanding role on an ocean research vessel called <i>The Searcher</i>.\"<br>\r\n<br>\r\n\"I remember you told me that story.\" Teary eyed, I said. \"You saved everyone on board, nearly drowning in the process...\"<br>\r\n<br>\r\n\"That was when I first met your mother.\" To my surprise, dad said. \"Her name was Doria, a direct descendant of the very first mermaid.\"<br>\r\n<br>\r\nIf they could, my eyes would have grown wider. \"What happened...\"<br>\r\n<br>\r\n\"When in a storm out at sea, waves are not measured in inches or feet, they are measured in increments of fear.\" Serious, dad said. \"I ordered the entire crew below deck, and took the controls alone...\"<br>\r\n<br>\r\nAs dad told his story, I could picture the scene... The waves were towering, and they crashed down with unforgiving force. Dad stood out in the elements, the pilot house all but destroyed by the storm. He struggled with the wheel, his body tied down to the deck with ropes, as he steered for the safety of a sheltered cove. He was using the occasional flashes of lightning to see his way. Dad screamed at the storm, shaking a single fist at the threatening clouds, as if to curse it for upsetting the calm sea.<br>\r\n<br>\r\nA terrifying wave crashed against the side of the vessel, nearly capsizing it, but Dad turned the vessel into the wave and used it to propel his ship closer to the cove. Lightning flashed across the sky, illuminating the jagged rocks, and Dad spun the wheel, just in time to avoid running aground in the powerful storm. Just as the ship kissed the opening of the cove, a massive wave struck the ship, breaking the ropes and hurling Dad into the sea...<br>\r\n<br>\r\n\"I thought, that was it... I was dead.\" softly, Dad said. \"Only a soft hand touched mine, and I turned to see the most beautiful woman I had even laid eyes upon.\"<br>\r\n<br>\r\n\"Doria...\" Whispering, I said. I was hanging on every word, picturing every detail of Dad's tale.<br>\r\n<br>\r\nDad nodded. \"She pulled me with such speed, it dislocated my shoulder.\" Quietly, he said. \"I screamed as I reached the surface, and she let me go, swimming off back into the sea as quickly as she had come.\"<br>\r\n<br>\r\n\"You met her again, though.\" Hopeful, I said. \"Come on, Dad... this is more than you had ever told me!\"<br>\r\n<br>\r\nDad chuckled. \"The question is, are you ready to hear it, or do you think I'm still telling tall tales of the sea?\"<br>\r\n<br>\r\nI sighed, frustrated.<br>\r\n </span></div></div>",
            "created":1585371600,
            "id":2809232,
            "title":"A sailor's tale."
        },
        "11121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Later that day.",
                "That night.",
                "continue.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>\"Dad, you're terrible.\" Pouting, I said. \"Don't tease me right now.\"<br>\r\n<br>\r\nDad smiled. \"I did meet her again a year after.\" Calmly, he said. \"Only I was the one to save her this time.\"<br>\r\n<br>\r\n\"What happened?\" Whispering, I asked.<br>\r\n<br>\r\n\"First, I was not exaggerating when I told you I was a champion brawler.\" With a hint of pride, Dad said. \"I can hold my own in any fight...\"<br>\r\n<br>\r\nAgain, as Dad told his story, I could see the events unfold.... Dad was heading back to his ship, <i>The Searcher</i>, when he heard a woman crying for help. It wasn't too far away, so he ran to investigate. He found the woman he had met in the ocean on the beach, cornered  by four muscular blurry men. Dad could not believe his eyes, it was a beached mermaid. They men surrounding her were grinning among themselves, talking about how much money a real mermaid would bring them. Dad had a strong sense of right and wrong, and what he was seeing was all wrong. He ran up to the scene and challenged the men, who turned their attention to him. The woman looked up at Dad with hope in her eyes, which was all he needed to commit.<br>\r\n<br>\r\nThe first man took a swing, but he was too slow for Dad's reflexes, and was rewarded with a high roundhouse kick to the jaw, sending him off his feet. The second and third man charged Dad, each with a hunting knife in hand. Dad caught the hand of one and kicked the other in the groin. This gave Dad all the time he needed to head butt the one he was holding, before sending him to the sand with a powerful uppercut. The fourth man produced a gun, but Dad had already taken the knife from the second man and threw it into the fourth man's hand, forcing him to drop it. At this point, it was now only two against one. Dad took down the one closest to him with a judo chop, then kicked up a rock from the sand and threw it into the head of the last man, just as he had picked up his gun...<br>\r\n<br>\r\n\"With all four men out cold, I took the woman into my arms, and carried her back into the water.\" Calmly, dad said. \"Only she surprised me.\"<br>\r\n<br>\r\nI was again hanging onto every word. \"What did she do?\"<br>\r\n<br>\r\n\"Her tail separated into two tails, then became a pair of silky legs.\" Smiling, dad said. \"She then rolled out of my arms and kissed me.\" He sighed, tears falling. \"That was when she told me her name...\"<br>\r\n<br>\r\nDad cursed under his breath, pulling a tissue from a box on my nightstand to dab at his eyes. I could not help tear up as well. \"You miss her, don't you?\"<br>\r\n<br>\r\n\"Every time I come back from the sea.\" Sadly, Dad replied. \"If it were not for you, life on land would be unbearable.\"<br>\r\n<br>\r\nWith that said, Dad walked out of my room, hiding the fact he was crying. I had a sad feeling he felt he was about to lose me...<br>\r\n</span></div></div>",
            "created":1585458000,
            "id":2809538,
            "title":"I want to hear more."
        },
        "111211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Cordelia gives me the Mermaid Talk.",
                "I go back home.",
                "continue.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>I had to get out of the house, to think, to give both Dad and me some space. His story about how he met my mom seemed to really tear at his heartstrings. I had never seen him cry in my life, it made me want to cry with him. I instead began to cry as I walked on my own on the streets, trying to digest it all.<br>\r\n<br>\r\n\"There is still more of the story to tell...\" Sadly, I muttered. \"How did he move from being an oceanographer to a fisherman? What happened to <i>The Searcher</i>, and why has he never mentioned it before today? I always knew him owning <i>Heart of Doria</i>.\"<br>\r\n<br>\r\nA ping of pain in my arm caused me to pause and look. Upon seeing what caused the pain, the tears came faster. It was a small patch of scales... just like I had seen on a goldfish. It shimmered in the light and sent shivers down my spine with the slightest touch... Dad's story was real. The tears came faster, I had never felt more lost, or confused, or frightened in my life. I was in a bit of a fog when I bumped into Cordelia and Adrian.<br>\r\n<br>\r\n\"Honey, what's wrong?\" Seeing my tears, Cordelia demanded. \"Why are you crying?\"<br>\r\n<br>\r\nAdrian frowned, his expression showing his protective side. \"What's his name?\" Gruffly, he demanded. \"We'll break his kneecaps...\"<br>\r\n<br>\r\nA hiccup-like laugh escaped my lips. Adrian could certainly be a brat at times, as most brothers were, but I never met anyone more caring or protective as he. \"I'm going through more changes than most girls deal with.\" Softly, I replied. \"Dad filled me in on some of it.\"<br>\r\n<br>\r\nAdrian winced. \"He gave you 'The Talk'?\"<br>\r\n<br>\r\nNow I really laughed. \"No,... he told me about how he met my mother.\"<br>\r\n<br>\r\nCordelia sighed, a sad look on her face. \"It's <i>that</i> time, isn't it?\" Softly, she asked.<br>\r\n<br>\r\n\"What time?\" Curious, Adrian asked.<br>\r\n<br>\r\nCordelia gave Adrian a sweet smile. \"Time for your nap...\"<br>\r\n<br>\r\nShe took a hold of Adrian's shoulder as he responded, \"My wha...\" He was out cold before he could finish.<br>\r\n<br>\r\nCordelia sighed, then turned to me. To say I was surprised would have been an understatement.<br>\r\n<br>\r\n\"What did you do to him?\"<br>\r\n<br>\r\n\"Relax, he's just asleep for a while.\" Calmly, Cordelia said. \"He's too young to know or even grasp what I am about to tell you.\"<br>\r\n<br>\r\n\"You know about this...?\" Taken aback, I asked.<br>\r\n<br>\r\nCordelia nodded. \"You see, Marina,... I'm a mermaid too.\" Softly, she replied. \"It was my job to protect you, and Jonas, your father, until you were ready to go to the sea.\"<br>\r\n<br>\r\n\"You can live on land and sea?\" Surprised, I asked. \"Then why...\"<br>\r\n<br>\r\nCoral gave a sad smile. \"Then why is your father so sad? It is because only adult mermaids can move from the sea to the land and back. He will not see you for a few years, once your transformation is complete.\"<br>\r\n<br>\r\nI rubbed my arm, uncomfortable. \"Is Adrian a merman?\"<br>\r\n<br>\r\nCordelia nodded. \"He still has a few years before he will be joining us.\" softly, she said. \"Still, this is why your father is so sad right now.\"<br>\r\n</span></div></div>",
            "created":1585458000,
            "id":2809603,
            "title":"Later that day."
        },
        "1112111":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Back at home.",
                "The changes continue.",
                "continue.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>\"First, mermaids and mermen alike can't have sex or reproduce in their oceanic forms, due to having no genitals.\" Serious, Cordelia explained. \"Only while in human form can they mate to carry on the supernatural species.\" She sighed. \"It is only during the night of a full moon that mermaids ovulate.\"<br>\r\n<br>\r\n\"Once a month...\" sighing, I said. \"I have a feeling this is The Talk for mermaids.\"<br>\r\n<br>\r\nCordelia nodded. \"In mermaids, reproduction is much like that of dolphins.\" Calmly, she said. \"Mermaid babies are born live in the ocean near the surface.\"<br>\r\n<br>\r\n\"So they are all raised on land?\" Curious, I asked.<br>\r\n<br>\r\n\"This is why you never hear sailors telling stories of child mermaids.\" Serious, Cordelia said. \"It is also why there is a high rate of missing teenagers in this part of the world.\"<br>\r\n<br>\r\n\"Because it's a mermaid community.\" surprised, I said.<br>\r\n<br>\r\nCordelia smiled. \"There are, of course, lots of normal humans here, too.\" Softly, she said. \"Just do not be too surprised if you meet an acquaintance or two when you go to live in the ocean with your mother.\"<br>\r\n<br>\r\nI sighed, hearing that. \"What can I expect down there?\" Worried, I asked.<br>\r\n<br>\r\n\"Well, you will be escorted to where we live, but I won't ruin it by describing it to you.\" Bemused, Cordelia replied. \"As for what to expect, you will find many mermen interested in getting to know you better.\"<br>\r\n<br>\r\n\"Why?\" Wincing, I asked. Then I saw Cordelia smile, and cringed. \"Ew...\"<br>\r\n<br>\r\nCordelia laughed. \"They are not all, as they say on the surface, wolves.\" Smiling, she said. \"Besides, it is the girls who pick the boys, not the other way around, like here.\"<br>\r\n<br>\r\n\"That's unusual.\" Curious, I said.<br>\r\n<br>\r\n\"Not if you take into account the fact that mermen are shorter and less muscular than the mermaids.\" Smiling, Cordelia said. \"Or have you not noticed that Adrian is shorter than most boys his age?\"<br>\r\n<br>\r\nI was about to ask more, but Adrian moaned and pulled himself off of the floor. \"What- what happened...?\" Groggy, he demanded.<br>\r\n<br>\r\n\"You tripped.\" Simply, Cordelia replied. \"I was about to worry, as you hit your head.\"<br>\r\n<br>\r\n\"You need to be more careful, bro.\" Catching on, I added.<br>\r\n<br>\r\nAdrian shrugged. \"What were we talking about?\"<br>\r\n<br>\r\nCordelia and I grinned.<br>\r\n</span></div></div>",
            "created":1585717200,
            "id":2811607,
            "title":"Cordelia gives me the Mermaid Talk."
        },
        "11121112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "I want to hear more about Mom.",
                "I want to hear about Cordelia.",
                "continue.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>The following day, I found more golden scales on my sides and parts of my chest, as well as on parts of my leg. After hearing Cordelia's story, I did not know how I felt. On one hand, I did want to meet my mother. But, on the other, I did not want to hurt Dad by leaving him behind. It brought me to tears all over again, and I began to cry out my frustrations in my room. Hearing me, Dad knocked on my door. \"Honey... are you okay...?\"<br>\r\n<br>\r\n\"I don't want to leave you, Daddy...\" Crying, I replied. \"Cordelia gave me The Talk for mermaids, and a little of what I can expect.\"<br>\r\n<br>\r\n\"You won't be leaving me forever, sweetheart.\" Hugging me, Dad said. \"Also, think of how long your mother had to wait after you were born to see you.\"<br>\r\n<br>\r\nI could not argue with that, but I was still worried. \"Can't you go with me...?\"<br>\r\n<br>\r\nDad shook his head. \"Not until Adrian has his changes.\" Softly, he said. \"What father would I be if I felt him an orphan, just to be with you and your mother a little early?\"<br>\r\n<br>\r\n\"So it won't really be goodbye.\" Smiling slightly, I said.<br>\r\n<br>\r\n\"Of course not.\" Cooing to me, Dad said. \"Only one of us had to remain on land to care for you, and then Adrian.\"<br>\r\n<br>\r\nI winced. \"Did you and Cordelia...\"<br>\r\n<br>\r\nDad chuckled. \"As far as the <i>landlubbers</i> are concerned, yes.\" Calmly, he replied. \"Only in mermaid society, I am considered a stepfather, due to agreeing to being a father figure for a mermaid's child.\"<br>\r\n<br>\r\n\"What...?\" confused, I asked.<br>\r\n<br>\r\n\"Cordelia's mate died, Marina.\" Sadly, Dad explained. \"I agreed to raise Adrian as my own, and she agreed to look after you, until it was time to return to the sea, and take Adrian and me with her when it becomes his turn.\"<br>\r\n<br>\r\n\"I didn't know that.\" Surprised, I said.<br>\r\n<br>\r\n\"There are a lot of things you do not know.\" smiling, Dad said. he chuckled. \"Mainly because you did not need to know, and you would not likely believe it.\"<br>\r\n<br>\r\n\"What happened to <i>The Searcher</i> you said you had captained?\" Curious, I asked.<br>\r\n<br>\r\n\"The funding dried up, and I had to find another way to make a living.\" Shrugging, dad replied. \"Knowing my way around the ocean and the habits of the local fish, I became a fisherman, recommissioning my ship to <i>The Heart of Doria</i>.\" He smiled. \"That was when I met Cordelia.\"<br>\r\n<br>\r\n\"Wait... what happened to Mom during that time?!\" Worried, I demanded.<br>\r\n<br>\r\nDad again smiled. \"Which do you want to hear first, what happened to your mom, or how I met Cordelia?\"<br>\r\n<br>\r\nI pouted. \"You're terrible, Dad...\"<br>\r\n</span></div></div>",
            "created":1586062800,
            "id":2813879,
            "title":"The changes continue."
        },
        "15":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "content":"<div class=\"\"><div> <span><b>Marina Douglas:</b>nicknamed \"Princess\"; turning 14; becoming a mermaid<br>\r\n<b>Jonas Douglas:</b> Marina's father; commercial fisherman; captain of the <i>Heart of Doria</i><br>\r\n<b>Queen Doria:</b> Marina's mother; queen of the undersea realm<br>\r\n<b>Cordelia Douglas:</b> Marina's stepmother; loving heart<br>\r\n<b>Adrian Douglas:</b> 11; Marina's half-brother; will become a fisherman like his father</span></div></div>",
            "created":1585285200,
            "id":2808667,
            "title":"Cast of Characters"
        }
    },
    "info":{
        "author_id":"bartfargo",
        "author_name":"BeeJay",
        "brief_description":"Marina is going through changes they didn't mention in Health class.",
        "created":1585358280,
        "description":"<td align=\"left\" class=\"norm\">This is the story of Marina Douglas, who finds herself changing into a mermaid as her 14th birthday nears.<br>\r\n<br>\r\nOf course, you've gotta have rules:<br>\r\n<br>\r\n1) No killing off the main character.<br>\r\n2) Try for proper grammar and punctuation.<br>\r\n3) Keep it PG-13. Nudity is allowed. Strong language is okay, but don't overdo it. Sex is okay, but don't go into detail.<br>\r\n4) If you hassle others who post adds here, you will be blocked.<br>\r\n5) I've got other interactives. Check them out for an idea of how I roll.<br>\r\n<br>\r\nOkay? Let's do this...</td>",
        "id":2217171,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1586129460,
        "modified":1586129460,
        "pretty_title":"Marina's Tail"
    }
}