{
    "chapters":{
        "1":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "An Archdemon!",
                "An Enormoose!",
                "A Gryphon!",
                "A Hellion!",
                "Another Monster..."
            ],
            "content":"<div class=\"\"><div> <span>You start things off by leaving the village after being given a quest by a king himself. Apparently, some evil warlord is trying to take over the land and make it a haven for monsters! Since someone in your family has just been killed by a monster, you set out to get revenge against the monstrosities and hopefully against the warlord himself.<br>\r\n<br>\r\nJust as you were going deep into the woods, you hear a loud grunt from what could possibly be a large monster!<br>\r\n<br>\r\nYou hide behind a big boulder and peak around to notice that the large monster is...</span></div></div>",
            "created":1493528400,
            "id":2313159,
            "title":"The start of a new adventure..."
        },
        "11":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "He sits over you, pinning you under his big, purple butt",
                "He notices you before sitting down",
                "You somehow cause him to stumble backwards",
                "You manage to elude him as he takes a drink from a big mug...",
                "Something else happens..."
            ],
            "content":"<div class=\"\"><div> <span>You stay hidden behind the big boulder as you hear some more grunts. You finally look around fully and notice a huge Archdemon, a huge purple demon with a giant pitchfork. You notice that he is a bit groggy and...wobbly. He seems to be in a bit of an intoxicated state as he keeps moving. As he lets out a hefty belch, you couldn't help but to look over his big, purple rear as he wobbles. \"Erf, stupid swordsmen think he is so tough defeating me...just wait till he comes back out!\" He then lets out another belch. You pick up some of the fumes, seeming to be a bit alcoholic. Just as you past him, he seems to be backing up, seeming to prepare to sit down over you! </span></div></div>",
            "created":1493528400,
            "id":2313171,
            "title":"An Archdemon!"
        },
        "111":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "He lets out more farts as you start to sink into his big rear.",
                "He felt you as he farts again, turning around to look at you",
                "He gets up for something..."
            ],
            "content":"<div class=\"\"><div> <span>Before you could move any further, you give his ass another glance. You couldn't help but stare at it as he keeps backing up into you! Just as you snapped back out of it, the purple butt of the demonic creature sits on you, pinning you into a stump. You try to wiggle as the giant creature starts to wiggle, working you a bit between his butt cheeks. He seems to have felt you as a soft moan is let out....For the next five minutes, you stayed where you were, stuck between some chubby butt cheeks while hearing an occasional belch. Before you could slip into another trance, you hear the chubby creature grunt...before a loud, vibrating fart is pushed out around you. You tried not to gag, fearing that you might alert the creature as the rank fumes seems to linger around you and sink into your clothes...</span></div></div>",
            "created":1493528400,
            "id":2313193,
            "title":"He sits over you, pinning you under his big butt!!"
        },
        "1111":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "He feels you again and farts you out",
                "He gets up with you inside his butt",
                "You feel something warm and slimy start pushing over you..."
            ],
            "content":"<div class=\"\"><div> <span>The huge Monster seems to have felt something under his ass, but instead of turning to look, he smirks to himself and started wiggling Again as more farts are pushed out. You Yelp and try to push away from the butt cheeks as you sink in further, groaning each time a fart slips out from under him. Eventually, you get pushed up against his grimy hole and blushed deeply from feeling it. The archdemon feels this and pushes back hard, forcing you fully up his ass. Letting out a deep fart after wards. You attempt to struggle at first, but for some reason, the smell inside the huge ass was trying to comfort you...</span></div></div>",
            "created":1493614800,
            "id":2313584,
            "title":"You start to sink into his butt!"
        },
        "11112":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Keep his new squirmy butt plug and head home.",
                "Shit him out, probably somewhere really dangerous..."
            ],
            "content":"<div class=\"\"><div> <span>Even though you were caught in the most foul and ridiculous of death grips, you find the greasy chamber somehow comfy. Like a big; fleshy sleeping bag. But that's not right! You're not meant to get shoved up giant, hunky monster butts; you're supposed to slay them! You return to struggling, but only manage to catch the gassy Archdemon's attention. He stands and reaches back, takes hold of one of his meaty buns and spreads it, showing off his twitching asshole. His finger dips in, the crude demon grunting as he pushes his digit inside and works you even deeper.<br>\r\n<br>\r\nYou panic as the slick walls part, as if welcoming you. The pudgy finger pushing at your boots only makes your descent into this hell hole worse, and the Archdemon can't hold in another cooking gas bomb. <b>*PFFT*</b> You're bathed in hot smelly air by the popcorn fart, and you feel your hue turn green from nausea.<br>\r\n<br>\r\nThe Archdemon lets out a belch and a satisfied chuckle. \"Weird, don't remember sucking one in. UURRP! Oh well...\" With a human firmly stuck at the edge of his smelly, tight rectum, the Archdemon decides to...</span></div></div>",
            "created":1512622800,
            "id":2425023,
            "title":"He gets up with you inside his butt"
        },
        "111121":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "You keep in his guts, and end up his plaything.",
                "The spell was botched, and you're displaced into another part of the Underworld."
            ],
            "content":"<div class=\"\"><div> <span>Head on home, with his new human stowed away deep in his bowels. Beating his wings, the chubby demon makes a bold attempt at flying, but with the added weight of far too much booze and an entire hero currently making his already portly belly sag past his knees. He strains hard; bat-esque wings kicking up a miniature storm before he gives up.<br>\r\n<br>\r\n\"Haah...Haaah.... Dammit, no good...\" He falls on his fat butt, causing your fleshy bed to spring about. You writhe about, trying to reach for your sword, which tauntingly sits in it's sheath. The tight confines of this Monster's rectum keep you from pulling it out however, so you sit helpless; trapped in this fat drunk's stinky innards. <br>\r\n<br>\r\nThe cogs turn in his head as he considers his options, and suddenly remembers something. \"Magic!\" He snaps his fingers as the light finally goes off in his head. You let out a dejected sigh, the fact you were captured by such a dolt... The 2 meter demon picks up his pitchfork and twirls it before shouting. \"ZOO-UURRP! Ahem... ZOOM!\" A pillar of light surrounds him, carrying him up into the sky in a flash of light. In an instant, you're carted along as the archdemon teleports to his home. Unfortunately, that just so happens to be the Underworld.<br>\r\n<br>\r\nBut what happens next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1515128400,
            "id":2437028,
            "title":"In an Archdemon's hellhole"
        },
        "1111211":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "As he relieves himself, you slip out and try to escape",
                "He relieves himself, but you remain stuck in his ass!",
                "He changes his mind and holds his load in a bit longer..."
            ],
            "content":"<div class=\"\"><div> <span>Despite what you were hoping for, the chubby demon manages to get to the underworld with you still tucked away in his ass. The demon let's out a sigh after he gets transported. As he starts to walk away towards his dwelling, you were stuck deep in his bowels. As the day goes on, you feel some filth start to form around you, giving the demon an arousing sensation. Just as you were getting fully encased in filth, the demon grunts and let's out a deep fart, causing the walls to tighten up around your stuck form. Hours later, the demon felt a familiar pressure and goes off to a vacant location to relieve himself.<br>\r\n<br>\r\nYou hope that this is when he pushes you back out along with his filth...though, you wouldn't mind staying in his chubby butt for a bit longer...</span></div></div>",
            "created":1518238800,
            "id":2451358,
            "title":"You keep in his guts, and end up his plaything...."
        },
        "11112111":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Porcelain. You're in a public toilet.",
                "Wood. You're in a tree trunk in the underworld's forest."
            ],
            "content":"<div class=\"\"><div> <span>These perverse thoughts are getting out of hand! How can you think like that?! Being stuffed into this portly, hunky demon's smelly asshole is the worst thing to happen today! Random hard-on's be damned. You struggle around, accelerating the need for your captor to find a private spot, pronto!<br>\r\n<br>\r\nThe chubby archdemon squirms, knees knocking together as his belly bubbles like a pot of stew. \"Gotta... Hnnk! Get outta here!\" The demon's packed bowels rumble again, and your shit capsule shivers and starts sliding down. You feel a tremor as the demon slams his fat ass onto something, and begins to push. He grunts and cries out as the torrent inside starts to make it's way down. Shit slides over you, carrying you along on the tide until his tailhole gapes to let the first log through. A constant stream of shit is let loose from his dirty pucker, the demon emitting a pleased sigh while his belly flattens out slightly. <br>\r\n<br>\r\nYou fall loose, slamming into the pile already below you. You look around, seeing...</span></div></div>",
            "created":1519102800,
            "id":2455277,
            "title":"Hell's Toilet"
        },
        "111121112":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "A Rottenweiler!",
                "A fat bat!",
                "A manticore!"
            ],
            "content":"<div class=\"\"><div> <span>You let out a big sigh as you were glad that you weren't pushed into some sort of toilet. You hear some shuffling and hide into some evil looking bushes and stay hidden as the chubby demon finishes his business before stumbling off...you give his chubby butt another glance before you start trying to clean yourself and your gear off...<br>\r\n<br>\r\nYou are now in an underworld region and that means that you are surrounded by demonic and undead enemies. The only bright side to all of this is that the evil warlord's castle could be down here and you could find him...though defeating him would be easier said than done since you don't have that much experience...dammit!<br>\r\n<br>\r\nHowever, before you could look around more and come up with a strategy, you hear another enemy coming in...</span></div></div>",
            "created":1519102800,
            "id":2455303,
            "title":"Wood. You're in a tree trunk in the underworld...."
        },
        "1112":{
            "author_id":"zgurosm",
            "author_name":"Farterguy",
            "choices":[
                "The Archdemon farts again",
                "The Archdemon wants to keep you in his butt",
                "The Archdemon wants to do something else"
            ],
            "content":"<div class=\"\"><div> <span>Apparently, your efforts to avoid being noticed by the giant creature were fruitless. The Archdemon slowly turns his head around just to see you pathetically pinned under his enormous rear. Now that the monster was fully aware of your presence, there was little point in trying to hide your gagging from him. You choked at the fumes coming from his back, but as you gagged, you heard the monster chuckling and then, releasing yet another blech. That probably meant bad news for you. And indeed they were, the monster farted again, coming from such a giant ass, you weren't surprised by the sound or the smell. However, that didn't stop you from gagging. There was simply no way out, the beast was too heavy to lift or slip out. The only thing to do was endure as much as possible the stench.</span></div></div>",
            "created":1493614800,
            "id":2313744,
            "title":"He felt you as he farts again, turning around..."
        },
        "112":{
            "author_id":"zgurosm",
            "author_name":"Farterguy",
            "choices":[
                "Charge!",
                "The Archdemon attacks first!",
                "You can't defeat him. Submit to the monster... He might spare you?"
            ],
            "content":"<div class=\"\"><div> <span>Just before his rear lands on top of you, he seems to notice you. While the monster is confused, you quickly back away from the giant monster. \"Well, well\" The monster says while assuming a fighting stance. He seems ready to attack you, if you want to confront the warlord, you will have to defeat this monster. You didn't expect your first encounter to be with such gigantic beast, but there was no way you could escape this fight. The monster seems to give you the advantage of the first strike, probably because you are less than half his size, and probably weight and strength. With that in mind, it'll be hard to defeat him, but if you make the right moves, you could probably win this fight.</span></div></div>",
            "created":1493614800,
            "id":2313748,
            "title":"He notices you before sitting down"
        },
        "12":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "You suck it up and run out of cover",
                "You try to sneak away from his sight",
                "The enormoose spots you while you're trying to decide",
                "The enormoose sat down suddenly",
                "Another monster shows up"
            ],
            "content":"<div class=\"\"><div> <span>From behind the boulder, you saw a terrifying monster. In front of you was a hoof that was almost as big as the boulder you were behind. Your sight traveled up the legs attached, taking note of the brown fur decorating it. Those legs were attached to a pair of hips as wide as your house. You noticed a cloth hung over the front of it, but left its backside exposed. Further up, you saw its muscular front, which, due to a lack of breasts, seemed to indicate that the monster was male. And right on top of its shoulders was a moose-like head, with antlers as large as boulders. You were terrified as you saw it scan the forest for any travelers.<br>\r\n<br>\r\nYou were already fearing that you might not be able to face this thing.</span></div></div>",
            "created":1500613200,
            "id":2357226,
            "title":"An Enormoose!"
        },
        "13":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "It lands on you, pushing you right up it's rear!",
                "It looks down and notices you!",
                "You manage to evade an attack",
                "You make the first attack",
                "You flee from it for now..."
            ],
            "content":"<div class=\"\"><div> <span>You noticed a huge bird like creature flying around above you. Upon taking a closer look, you notice it was a huge Gryphon and start to draw out your sword. But just as you do, you get mesmerized by the creature's big rear and fail to notice in time that it was getting much closer to you...</span></div></div>",
            "created":1493614800,
            "id":2313507,
            "title":"A Gryphon!"
        },
        "132":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Charge at the Gryphon and make him eat steel!",
                "Stand your ground and wait for him to move first.",
                "...Try to talk it down?"
            ],
            "content":"<div class=\"\"><div> <span>As you stare up gobsmacked at the surprisingly curvy rear of the flying beast it closes in fast, having taken notice of your idle body. Instincts from your (admittedly meager) training kick in and you leap back; sword held strong in both hands. You grip the leather hilt tight and clench your teeth, sure you can muster the power to carve this bird up!<br>\r\n<br>\r\nThe rust feathered avian effortlessly lands on it's hindpaws, switching to an upright stance with claws out and wings unfurling in a threatening display. It's gold beak wrenches open as it lets out a deafening call, challenging you! Your focus momentarily wanes and you gaze lower, noting this monster is most definitely male considering the healthy pair of balls with a fat sheath just above. They must be the size of melons at least.<br>\r\n<br>\r\nThe Gryphon takes a step towards you, knocking you once again out of your uncharacteristic daydreams. You're not sure what's gotten into you, fantasizing about these foul creatures, but you try to remain steadfast and look strong! Which is a hard task considering the sheer size difference between you and the wretched hybrid.<br>\r\n<br>\r\nThree hungry eyes stare at you, trying to drill holes into your resolve. You swallow your spit and decide on your next course of action.</span></div></div>",
            "created":1493614800,
            "id":2313771,
            "title":"It looks down and notices you!"
        },
        "1321":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Smother you with it's huge, musky balls",
                "Sit on you with it's fat feathered butt."
            ],
            "content":"<div class=\"\"><div> <span>With your mind made up you level your sword, the tempered metal glinting gorgeously in the sunlight. Your boots dig into the earth and you launch yourself at the monster, letting out a battlecry of your own as you charge in with nothing but guts and metal! Sadly that simply isn't enough to go toe to toe with a high level beastie such as this one.<br>\r\n<br>\r\nThe Gryphon scoffs and quickly swivels it's body to the left, striking you with it's tail which moves as fast as a whip with twice the force. All the bravado, confidence and most important of all: Air, is knocked out of you as it's thin but surprisingly strong appendage slams into your stomach. The strong attack lifts you up, giving the Gryphon another opening as it slaps you right to the ground, denting your cheap starting armor and making you faceplant into the dirt.<br>\r\n<br>\r\nA strong footpaw steps onto your back, making you groan in discomfort but glad it decided against hurting you more. With your pride (and body) bruised you crane your neck up to look at the strong monster. It's expression is of delight, that large beak somehow twisted into a cruel smile, a long purple tongue coated in slimy spit hanging out while it's trio of eyes look down at you with evil intent glowing within them.<br>\r\n<br>\r\n<br>\r\nFear crosses over your face with a slight unwelcome undercurrent of excitement. The monster surely plans to...</span></div></div>",
            "created":1493614800,
            "id":2313779,
            "title":"Charge at the Gryphon and make him eat steel!"
        },
        "13211":{
            "author_id":"writerofyouth",
            "author_name":"Youth",
            "choices":[
                "Lick his balls ",
                "Refuse to do anything."
            ],
            "content":"<div class=\"\"><div> <span>You cringe as the gryphon's furry grapefruit sized balls hit your face. You were helpless as the gryphon began to teabag you coating you in the musky scent of his balls. As the gryphon kept smothering you under his balls you began to fell light headed from the musk. You began to think this gryphon was sexy and that you should do anything he wants. That can't be right you thought but your throbbing member thought otherwise so you decided to...</span></div></div>",
            "created":1499317200,
            "id":2348266,
            "title":"Smother you with it's huge, musky balls"
        },
        "13212":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Lean up and start rimming the Gryphon",
                "You feel him push back against your head",
                "He eventually gets up after farting on you."
            ],
            "content":"<div class=\"\"><div> <span>You cringe as the gryphon lands on you, trapping your body under his butt. You then felt your face push up against the monster's grimy tail hole as the smell started to get to you. You hear the gryphon grunt before a rancid fart is pushed out over you, scenting your body and clothing. As the smell sinks into your nose, you started to get tempted to lean up and lick into his rear as he grinds his filthy butt over you.</span></div></div>",
            "created":1493787600,
            "id":2314547,
            "title":"Sit on you with it's fat, blubbery butt..."
        },
        "132121":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Clean it's hole out.",
                "Try to push your head inside."
            ],
            "content":"<div class=\"\"><div> <span>You can barely hear the devilish chuckle from the Gryphon who's currently grinding his soft, feathered butt onto you. No doubt he's enjoying subjecting you to this terrible humiliation, forcing you to sniff his farts. Even so you can't help but get aroused, you try to deny it in your head; that this monster doesn't turn you on! But another airy, wet fart that clogs up your nose and makes your member throb in your pants tells another story.<br>\r\n<br>\r\nIt keeps rolling it's hips, that bubble butt jiggling as you still try to wrench your face away. It's dirty hole rubs onto your face, the smell of it's waste still fresh on it. It holds itself still while it's belly gurgles and another one comes your way.<br>\r\n<br>\r\n<br>\r\n<b>*Fttt-PFRRRT!*</b><b> *frrrt*</b> <b>*PFRRRRRRRTPTPTH*</b><br>\r\n<br>\r\nThey just keep coming and coming, and that last wet one got into your mouth; cloying your tastebuds with the flavor of it's shit.<br>\r\nBut still your member is hard as stone, and you feel something soft and cushy in your hands. It takes a second to realize you've latched onto the Gryphon's hips. At this you give in and rise up slightly, digging your tongue into it's asshole.<br>\r\n<br>\r\nA surprised \"Squawk!\" comes from the monster bird, but it quickly settles down at the feel of your tongue licking at it's hole. You can very faintly hear the sound of it masturbating, it's clawed hand wrapped around it's no doubt huge cock.<br>\r\n<br>\r\nYou decide to...</span></div></div>",
            "created":1494046800,
            "id":2315739,
            "title":"Lean up and start rimming the Gryphon"
        },
        "1321212":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You push yourself further in as the monster jerks off harder",
                "You manage to snap out of it and push back out!",
                "Something else happens..."
            ],
            "content":"<div class=\"\"><div> <span>You blush a bit and as you hear the monster jerking off, you slowly start to push your head in, feeling bits of filth against your face as you lick in deeper. The fumes get more potent as you lick in further, squeezing the chubby butt cheeks as another fart slips out over your body. The monster pushes back a bit, enjoying the feel of another being going into his filthy rear...</span></div></div>",
            "created":1494046800,
            "id":2315755,
            "title":"Try to push your head inside."
        },
        "13212121":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Fly off to it's nest.",
                "Shit you out somewhere."
            ],
            "content":"<div class=\"\"><div> <span>The avian monstrosity growls with effort and a bit of pain as you stretch it open, trying to force your frame into it's foul depths. It rises up, squatting crudely and making you lean up with it. Your hands were still clutching the Gryphon's wide hips, trying to keep yourself steady to avoid being strangled by it's fleshy anus.<br>\r\n<br>\r\nTruly a ludicrous sight, a young hero with his head stuffed inside a masturbating monster's ass. You think back to your mission, and wonder briefly what your friends would think of this. But the hot wash of shame doesn't compare to the rush of arousal you feel doing this perverted thing with this monster. Somehow it just feels <i>right</i>, even as the nasty beast pumps it's boner, it's fat balls jiggling with the force of it's masturbation.<br>\r\n<br>\r\nNow with everything nice and steady you try to push deeper into your former adversary's asshole, but with the awkward position and your paltry strength you can't quite get inside. That is until the Gryphon starts to grind and roll it's hips. It's ass jiggles as your shoulders pop through it's now gaping hole, and the rest is slow but easy sailing. The smell inside is beyond terrible, and your face and hair is coated in old waste as you slide into the monster's rectum.<br>\r\n<br>\r\nThe minutes drag on as the Gryphon beats it's meat while you slowly disappear into it's spacious ass, a cute bulge forming on it's lower gut as most of your body is pushed inside. Your feet touch the ground, and you use this to boost yourself up; causing it to cry out in pleasure and bless the earth with several musky ropes of bird seed.<br>\r\n<br>\r\nIt's anus tightens up again as you're tucked away, coated in filth and bombarded by the odor and heat. Not the mention you can't move a muscle with the smothering walls. You start to reconsider your choices up to this point...<br>\r\n<br>\r\nBut your new landlord isn't keen on letting you out, and bends over while groping it's slightly swollen belly, expulsing the last vestiges of fresh air from it's bowels with a loud, elongated <b>*frrrrrrrrrpt*</b>. Now with a new toy, the beastie decides to...</span></div></div>",
            "created":1494997200,
            "id":2321144,
            "title":"You push yourself further in as the monster jer..."
        },
        "132121211":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Lucky! The gryphon rolls over in it's sleep, letting you escape.",
                "Unlucky. It doesn't, keeping you as it's toy for yet longer.",
                "Very very unlucky. It invites it's friends to have a go at you when it awakens."
            ],
            "content":"<div class=\"\"><div> <span> <br>\r\n<b>*FRRRRAAAAAAAAAAAAARRRRRRRRRRRRRPTPTPTPTPTPPTTTT!*</b><br>\r\n<br>\r\nYou were startled awake by the trembling of your fleshy tomb. You try to stand and only end up stretching the gryphon's anal walls, causing a pleased churr to roll from the beastly bird's throat. It takes a few moments to remember where you are, memories coming back in waves. That's right, you gave yourself to this perverse, smelly beast. But at this point you're no better.<br>\r\n<br>\r\nYou grope about the darkness helplessly, only feeling wet, soft flesh. Regrets flow up like well water seeping into a bucket. The disgust you feel for yourself doesn't match the disgust you feel for this gryphon though, as it's terrible gas fills every nook of it's guts. You're not even sure how long you've been out. The rough sloshing inside tells you though the monster has taken flight.<br>\r\n<br>\r\nMinutes tick, and you give a few token struggles; making the gryphon's belly roll and bounce. A raspy chuckle escapes the three eyed fiend as it finally lands onto a mountain cliff, facing a cave. It steps inside, nonplussed by the weight of it's gut. And with a heavy *THUMP* it falls belly first, causing you to get compressed even tighter. You well out a curse, which only gets a gentle snore as reply. It fell asleep! The nerve... This might be your chance however!<br>\r\n<br>\r\nYou start trying to shift your position, but the sheer tightness keeps you under the metaphorical lock and key. The gryphon was smart enough to devise a way to hold onto you even as it snores. This does not bode well. There are many ways your fate could worsen, but you could get lucky...</span></div></div>",
            "created":1509858000,
            "id":2411466,
            "title":"Fly off to it's nest."
        },
        "1321212111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Stay",
                "Go"
            ],
            "content":"<div class=\"\"><div> <span>You are just about to fall asleep as you submit to your smelly fate. You feel the large gryphon shift. This wakes you up a bit. The gryphon then rolls over onto to his back. You feel a huge weight lifted from you. You are pleasantly surprised by this as you are able to move a bit. You realize your chance at escape and start to squirm around and slowly move backwards, sliding out of the gryphon’s bowels. This takes quite some time but you manage to do it without waking the gryphon. You nearly cheer in delight at your success and rush over to the side of the nest. The nest is in a cave that is a bit above the ground. You leave the nest and rush out of the cave. You breathe in the clean air that you hadn’t realized that you had missed. You look around and see that right in front of you is a nice green plains with a large lake near the cave. But despite how peaceful this place is, you see several large animals and monsters, including a dragon in the distance. This reminds you of the danger of the world you’re in. You look back and realize that the gryphon is strong and hasn’t harmed you yet. You have no idea what will happen to you out there. The chance of your death is high out there but you might high a chance of escape. But if you stay, you might be subjected to all kinds of humiliating things but you through this you might be able to befriend the gryphon and gain it’s protection, but you also could die or become a toy for it forever. This is a tough choice. Do you want to stay or go? </span></div></div>",
            "created":1538974800,
            "id":2560840,
            "title":"Lucky! The gryphon rolls over in it's sleep..."
        },
        "13212121111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>You believe that it’s way too risky to leave the gryphon. You’re probably 5 times as likely (at least) to die outside. You strip off your armor and just wear the clothes you normally wear underneath your armor for situations in which you have to take your armor off and still be in public. You make your way down to the lake to get yourself cleaned off. You take off your clothes and enter the water. By the time you are finished you have gotten rid of the stench and have gotten clean. You get out the water and put your clothes back on before making your way back up to the gryphon. When you get back to him he is still asleep on his back. You carefully climb over his sheath and onto his belly and lie there. You close your eyes and try to fall asleep to catch at least some sleep before he wakes. You both sleep for a couple of hours before the gryphon wakes up and sees you on his belly. Is he...<br>\r\nOption 1: kind to you after seeing you still here on it’s belly and hadn’t run away.<br>\r\nOr<br>\r\nOption 2: mean to you because he’s furious that you had escaped his bowels.</span></div></div>",
            "created":1538974800,
            "id":2560845,
            "title":"Stay"
        },
        "132121211111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "He eats you.",
                "He does a more lewd act with you."
            ],
            "content":"<div class=\"\"><div> <span>You awake to the feeling of wings wrapped around your body and the gryphon with it’s three eyes staring at you. The gryphon has it’s head cocked and it looks like it’s kind of smiling at you. This is a major change from it’s previous torture of you. It almost seems like it’s friendly to you. It licks your face with a long black tongue and hugs you with it’s wings tighter. You smile. This is actually quite nice, you could get used to this, even if the gryphon forces you to do some more lewd acts, it doesn’t look like it would do it maliciously. You decide that maybe you should test your theory a bit. This might be dangerous but it would make you more comfortable if it works. You squirm around a bit to try and signal to the gryphon that you want to get up. Fortunately, it seems to understand and let’s you go. You slide off of the gryphon and it stands up, wondering what you are doing. You then submit yourself to the gryphon, knowing full well that this could end poorly but if it wanted to kill you, it’d had already done it. You slowly lie down on your belly as the gryphon watches you confused, you then roll over onto your back. At this point, the gryphon seems to get the message that you are submitting yourself to him. He sniffs you a bit before giving you a nice long lick. He then sits down to try and figure out what he wants to do with the prone human before him.</span></div></div>",
            "created":1538974800,
            "id":2560862,
            "title":"Change of heart"
        },
        "1321212111111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "You are not digested (full tour)",
                "You are digested."
            ],
            "content":"<div class=\"\"><div> <span>He seems to smirk as he lays down facing towards you. You start to have second thoughts about this but it’s way too late now. The gryphon opens it’s maw wide, letting you stare down into it’s black fleshy throat before gently clamping it over your head. He then proceeds to lick you for all of 2 minuets before gulping loudly, and sending your head down into his throat. His breath is rancid and the further he forces you inside of him, the worse it smells. It gets to the point where it smells so badly that you are beginning to think that the smell will linger on you for the rest of your life. Every minute the gryphon give another gulp, sending another half of a foot of your body down it’s throat. It’s slow going but soon only your feet are hanging outside of the gryphon’s mouth and he gives one final swallow to send you completely into his rather large (for his size) stomach. You are cramped in there, having to curl up into a tight little ball to fit. The gyphon starts to moan in pleasure at the feeling of a living thing inside of him. He stands up and gets out of his nest befor he starts to hump the ground, moaning. You are swung and sloshed around in his stomach as he tried to relieve himself of his pent up sexual frustration. After what felt like 5 minuets, you hear a long sigh as gryphon blew his load over the ground. Finished with his dead, he goes back to his nest and lies down in it, curling up and falling asleep. But what happens to you?</span></div></div>",
            "created":1538974800,
            "id":2560889,
            "title":"He eats you."
        },
        "13212121111111":{
            "author_id":"cymnio",
            "author_name":"Cymnio",
            "choices":[
                "pooped out successfully?",
                "stuck inside the anus"
            ],
            "content":"<div class=\"\"><div> <span>As you land in the stomach, you begin to panic, banging on the stomach walls, hoping for escape before the acids enter your fleshy tomb. The acids begin to flow, but don't actually hurt you. Eventually, you are passed along to the intestinal tract, where almost a full day goes by, until you arrive at the colon. The gryphon seems to have recently taken a dump, as the walls are slimy and sticky like fresh shit, but there isn't any inside at the moment. Unfortunately, you can't go any further until the gryphon decides to take a shit, so you have no choice but to wait. So, you wait for awhile, feeling the colon contract in the gryphon's sleep. You are very quickly coated in a thick layer of sticky, rancid slime that was formerly coating the walls of your new, temporary home. Gradually, the colon begins to fill up with more and more shit, when the gryphon decides to wake up, feeling the pressure familiarly associated with taking a shit. You are stuck behind all of the shit, so you begin to worry about your chances of escape. What happens?</span></div></div>",
            "created":1557810000,
            "id":2659725,
            "title":"undigestable"
        },
        "13212121111112":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Absorb options ",
                "Digestion of the soul."
            ],
            "content":"<div class=\"\"><div> <span>You feel a slight tingling feeling all around you as the walls start to kneed your body. You realize with a start that the gryphon us digesting you. You start to bang on the walls of gryphon’s stomach and shout, begging to be let out. But the gryphon won’t wake. You submit to your unfortunate fate, as you sit there, slowly digesting, you realize that it doesn’t hurt too much, you conclude that that is because the gryphon is making the acids that way. You also come to terms with your own demise. You know that you had freely given your life to the gryphon, infact you are kind of excited for your body and soul to serve a greater purpose in this mighty beast. You know from stories that gryphons digest their prey mind, body, and soul and you soon come to terms with that too. The excitement of your weak body serving such a mighty creature overrides all of your fear. Over the course of 12 hours, in which the gryphon doesn’t eat out of respect for your sacrifice, you are digested completely, not a single trace of your corporeal body is left, all of it turned into nutrients by the powerful beast’s digestive track. After the last molecule of your bodty has been digested, your soul appears. It starts to flicker in and out as the gryphon starts to digest it. But the gryphon has an option here. Absorb the soul to keep it, or fully digest it.</span></div></div>",
            "created":1538974800,
            "id":2560985,
            "title":"You are digested."
        },
        "132121211112":{
            "author_id":"samueliscool",
            "author_name":"Poi Yo",
            "choices":[
                "The gryphon's open maw",
                "The gryphon's dirty asshole"
            ],
            "content":"<div class=\"\"><div> <span>The gryphon wakes up and feels an external weight on his belly, which is very strange. He looks down towards his belly and sees you are out of his anal track and is now sleeping on top of him. Emanating an angry growl, he proceeds to stand up, dropping your asleep body onto the floor. <br>\r\n<br>\r\nYou awake with a bit of pain in your back, as you try and remember where you are at that time. Everything is quite blurry, and a bit... smelly? You then suddenly remember where you are at that moment, the gryphon's lair. You feel something warm touch the back of your head, making you shiver even more. You turn around and see....</span></div></div>",
            "created":1559365200,
            "id":2667838,
            "title":"Angry Gryphon"
        },
        "1321212111122":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "The gryphon starts to jerk himself off as you squirm...",
                "You try to push back out despite the gryphon's strength",
                "The gryphon goes back to sleep with you stuck in his bowels..."
            ],
            "content":"<div class=\"\"><div> <span>Your face presses up against a slimy surface. The stench was enough to let you know that you just bumped into the gryphon's tail hole. You groan as you look up at the gryphon's chubby butt. As you try to back away, the gryphon growls and shoves your head in. You are instantly hit with some slimy gunk and begin to squirm. You keep trying to back away, but the gryphon begins to work you back up his ass, moaning out as he slowly works his butt toy back in. When it's just your legs sticking out, it slams his butt down, shoving you back into your smelly home...<br>\r\n<br>\r\nInside of the gryphon's ass, you are surrounded by slimy gunk. If the insides didn't reek and the gunk wasn't everywhere, this gryphon's butt wouldn't be so bad to stay in...that was when the gryphon let's out a wet fart over you...</span></div></div>",
            "created":1559365200,
            "id":2667958,
            "title":"The gryphon's dirty asshole"
        },
        "13212121111222":{
            "author_id":"cymnio",
            "author_name":"Cymnio",
            "choices":[
                "Back in the ass.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You try to struggle back toward the anus of the gryphon, and you make it surprisingly far, with daylight pressed up against your face, you begin to push yourself out of the gryphon’s asshole. Your head emerges first, then your torso and arms, and finally your legs, but then you notice the gryphon watching you, and if a bird could smirk it was. You realize that you can’t move your feet, looking behind you reveals that they are stuck in the asshole, and the gryphon is slowly sucking you back in. You frantically rack your brain trying to think of what to do, when the gryphon gets up and raises its ass in the air, allowing gravity to start its work. Panicking, you move your hands so that you look like you are giving the butt of the gryphon some kind of weird hug. You are surprised when this actually works, you are only sucked in up to your waist, and the fluids produced by the gryphon’s ass are slowly allowing you to slide out, an inch at a time. The gryphon wonders why its toy has stopped struggling, and looks back to see you starting to emerge once more. Hatching a plan, the gryphon turns his head back and acts like he never saw you emerging. You continue to push, and finally make it out completely, even your feet this time. As you are trying to scramble away from this disgusting creature, you fail to notice its taloned paw reaching for you, and are shocked when you are lifted off the ground in the gryphon’s grasp. The gryphon begins to fly, meaning you shouldn’t struggle if survival is your goal. Up ahead is a cave, which the gryphon begins to descend into at a somewhat alarming speed. Fortunately for you, you aren’t hurt when he lands, so at least something is going right for a change. The gryphon brings you to eye level and you feel as though if he could smirk, he would. The gryphon heads to a large depression in the cave, with sides you know you won’t be able to climb just by looking at them. The gryphon lands again, and deposits you on the ground, staring at you intently. What does he do to you now?</span></div></div>",
            "created":1561438800,
            "id":2678212,
            "title":"The great asscape"
        },
        "132121211112221":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "He then kept you as his ass slave for eternity",
                "His ass digested you"
            ],
            "content":"<div class=\"\"><div> <span>He flaps his enourmous wings, and the wind created from the flap knocks you to the ground. You collect yourself and face up, but you now see the gryphon's big feathery booty. He didn't give you any time to process anything, and slammed his dirty ass right on your comfortable face. Your face was completely smushed between the beast's fat, feathery buttcheeks. He was slowly grinding his butt up and down your face. Despite the fact that you could only see grifgin asshole right now, you knew for a fact he was loving this.<br>\r\n<br>\r\nBeing forced to rim the stinky asshole of an angry griffin was somehow even worse than it sounded. Male griffins are extremely dominant, and this is multiplied one hundred fold when angered. So being the focus of that griffin's anger is one of the worst fates known to man. You were experiencing that fully, as the big male griffin above you was taking extreme pleasure in forcing you to sniff his booty. <br>\r\n<br>\r\nAs if your suffering under a griffin bum wasn't enough, you heard a familiar rumble in his gut. Before you could brace, a rumbly, wet fart was blasted right into your open mouth. The smell hit you instantly, and started a chain of events. First, you coughed in a desperate attempt to get the smell of musky male griffin farts out of your mouth. Second, you forgot that your entire face was between fat griffin cheeks, so you ended up opening your mouth and trapping it on the griffin's brown pucker. By the time you realised your terrible mistake, it was too late. The griffin released another wet fart into your mouth, and this one reeked of rotten dragon eggs, the worst smell in the world, and a favourite food of the griffin. <br>\r\n<br>\r\nYou desperately squirmed and screamed under the rump of the griffin above you. He was without a doubt loving the feeling of you wriggling under his ass. He kept releasing horrible farts into your mouth for 10 minutes. He then clenched his buttcheeks with your face still trapped between his feathery tush. This smushed you tightly in his asshole. He then began clenching his asshole more and more, sucking your pathetic body into his smelly asshole. In just 10 clenches, your entire body had vanished up his perfect ass.</span></div></div>",
            "created":1589808780,
            "id":2837567,
            "title":"Back in the ass."
        },
        "132121211112222":{
            "author_id":"cymnio",
            "author_name":"Cymnio",
            "choices":[
                "Yes",
                "You choose next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The gryphon ponders what to do with you now. He is tired of having you IN his ass, maybe something else ass-related?</span></div></span></div>",
            "created":1561438800,
            "id":2678217,
            "title":"Other"
        },
        "1321212113":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Several Hawk Men",
                "Another Gryphon",
                "Something else?  (Reader's Choice)"
            ],
            "content":"<div class=\"\"><div> <span>Time passes. And you wait. More time passes, you wait.  And wait and wait and <i>wait</i>. Keeping your eyelids open is like carrying shot put balls with only your pinkies. The way the gryphon's innards undulate is hypnotizing and you catch yourself nuzzling it's walls. You've gotten used to the smell of this monster's shit, that cannot be a good sign. At all. The heat is unbearable, you feel exhausted, and you haven't eaten anything in ages. The thought of perishing in a lowly monster's asshole is humiliating beyond belief, and at this point it's the only thing keeping you from laying down and giving into it. That's right, you just have to hold out, it'll give before you do. You only need to wait a little longer...<br>\r\n<br>\r\n---<br>\r\n<br>\r\nA powerful rumble shakes the giant avian's chambers, and you're once again awoken by the gryphon ripping a noxious fart past you, the fumes making you dizzy. It's flesh shifts and squeezes tight behind you, and you're sent on a slick slide past it's entrance. The cold air of the outside world chills your bones, but it's like the Goddess' kiss compared to the foul depths of the Gryphon. You extract your arms from it's anus and you reach for the ground desperately. The Gryphon's grunts of exertion echo off the cave walls, and you shiver as it's voice reaches your ears. You plop to the ground, sliding free from the perverted monster's body, covered in wet shit and smelling like a manure pit. But you're out! Your excitement is quickly stifled when you try to stand and end up floored by a thick gryphon pat. You turn and look as another load crowns, the sight is truly something to behold, it's hole gaping wide as a long; creamy loaf spills out. Your erection returns in full force, leaving you once again confused and distracted by the <i>assuredly</i> random boner. You remain laid out on the ground, the gryphon openly shitting all over you. After the last turd slips free you're given a smelly reward for your patience. It grabs it's round ass and bends over near you, ripping a fart onto you.<br>\r\n<br>\r\n<b>*PFRRRAAPT!*</b><br>\r\n<br>\r\nCompletely exhausted, lying back, covered in a monster's shit. Some part of you sees no problem with this, feeling it's right somehow. The other part of you reels in disgust, and you  retch and push it's turds off of your soiled; dented armor. Your cleaning session is interrupted by the Gryphon stepping around you, and you look up at it. It's trio of eyes stare down at you and it smiles. You wonder what it's so pleased about... And then you hear footfalls behind you. You turn to see-</span></div></div>",
            "created":1511067600,
            "id":2416992,
            "title":"Very very unlucky. It invites it's friends ..."
        },
        "1322":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Forces you to pleasure it.",
                "Forces you into it's cockhole."
            ],
            "content":"<div class=\"\"><div> <span>You take a step back, putting your right foot behind the left and raising your shield, peering over the barrier of wood at the monstrosity staring you down. Thoughts about this beast race through your head as you wait patiently for it's attack. Obviously it isn't just some wild animal, the trio of eyes it has holding a measure of intelligence. It's posture lowers, clawed hands waving in a circle, said eyes starting to glimmer.<br>\r\n<br>\r\nSuddenly you're overcome with vertigo, and the Gryphon's hands seem to multiply in your vision. M-Magic?!<br>\r\n<br>\r\nYour stance falters, your head swimming as dizziness takes you to the floor. You just barely keep yourself up on your hands and knees as your weapon and shield clatter to the ground. You make a note to try to work on your Wisdom stat if you make it out of this pickle alive.<br>\r\n<br>\r\nLooking up, you see a swirling, vague image of the Gryphon as it closes in. You grab for your sword and try to slash at it, but only feel air touch against your blade. The magic it used filled your head with illusions! You stand up and start swinging wildly as panic overtakes your combat instinct. An evil chuckle fills your ears before you're pushed over onto your keister rather effortlessly by the monster.<br>\r\n<br>\r\nJust as the dazzling spell passes you look up and see it's hand around a massive, erect canid dick, the musky scent tickling your nostrils.<br>\r\n<br>\r\nIt reaches towards you and...</span></div></div>",
            "created":1494046800,
            "id":2315692,
            "title":"Stand your ground and wait for him to move first."
        },
        "13222":{
            "author_id":"writerofyouth",
            "author_name":"Youth",
            "choices":[
                "He sucks you into his balls",
                "Sucks you into his bladder"
            ],
            "content":"<div class=\"\"><div> <span>He reaches towards you and wraps his paw around the back of your head and pulls it towards his erect canid dick. Your face is smothered against the tip of his penis causing him to let out a low moan as he continues to put pressure against your head until he hit his mark. Your head began to become enveloped in the cock of the gryphon,like a snake eating a very big mouse. You can only see darkness and smell his musky seed as you are constricted by his dick. Then ...</span></div></div>",
            "created":1499576400,
            "id":2350549,
            "title":"Forces you into it's cockhole."
        },
        "132221":{
            "author_id":"writerofyouth",
            "author_name":"Youth",
            "choices":[
                "Cum transformation",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>With your head confined in the musky tunnel, you instinctively start to grab something for leverage. Your arms flail for a bit rubbing over the griffons body until they latch onto his massive balls. This surprise reach around cause the griffon to squawk and his balls to lurch up, sucking you in up to your neck. The griffon readjusts itself so that now its standing, your head in its cock, hands grasping his orbs firmly. This beast starts to steadily hump the air, each time his balls raising into his body and sucking you in. You lose grasp of his balls when the head of his crotch envelops your upper arms and pins them to your sides. Furiously you kick your legs in a futile attempt to get free, but too little too late. He humping speeds up and your penis crosses it his. For some reason this is making you hard and you hate it. The slimy walls frantically swallow you as the beast nears its climax. Your head breaches on of the balls and sets it over the edge. A massive lurch of its walls causes monster spunk to cascade into your eyes, ears, nose, and mouth filling you with disgust and sum pleasure. You feel the warm, white wave soar over your body and jets out of the creatures erect cock in long strands of cum. After the cumming your legs entered and the dick sealed behind you. You start to feel the penis become soft as it sinks back into its sheath. Slowly as the dick retracts back more of your body is dropped into the sack, until finally the cock returned, the furry sheath sealed and you sunk into a pool of cum at the bottom of the griffons balls.</span></div></div>",
            "created":1518757200,
            "id":2453569,
            "title":"He sucks you into his balls"
        },
        "1323":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Friendly",
                "Aggressively ",
                "Indifferently "
            ],
            "content":"<div class=\"\"><div> <span>You drop your sword and it sticks into the ground. You put your hand up.<br>\r\n“Ok Ok, likes reconsider our course of action.” You try to talk to the gryphon, it cocks it’s head as if listening to you.<br>\r\n“If we fight, it’ll end poorly for both of us so let’s just not.” As you speak, you slowly approach the gryphon, it’s size dawning on you as you realize that it is 3 times as you. You then kneel down in front of the gryphon and it looks at you quizzically. How does it respond?</span></div></div>",
            "created":1542344400,
            "id":2578733,
            "title":"...Try to talk it down?"
        },
        "13233":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "His balls.",
                "His bladder."
            ],
            "content":"<div class=\"\"><div> <span>The gryphon doesn't seem to understand your, or simply doesn't care as to what you are saying. It walks towards you, knocking your sword out of the ground and far away from you. You gulp as you look up at the massive beast towering over you. He then suddenly grabs the back of your head, thrusting it against the head of his cock. He tosses his head back, chirping in pleasure as you squirm to get away from him. With one swift motion, he completely rids you of your armor and clothing, exposing your naked form to the cold air.  The gryphon loosens his grip on you a bit, allowing you to get your head away from his massive cock and take a couple of deep breaths. You try to plead with him to get him to stop doing this to you, but your words fall on deaf ears as he shoves your head against the tip of his cock once more. This time your head slips inside of his urethra, causing a whole new wave of panic to course through your body. You try to escape but the cock's suction proves too much for you to resist and the gryphon makes short work of sucking you into his cock. Where do you end up?</span></div></div>",
            "created":1557464400,
            "id":2658007,
            "title":"Indifferently "
        },
        "14":{
            "author_id":"zgurosm",
            "author_name":"Farterguy",
            "choices":[
                "He sits on you!",
                "He notices you before sitting!",
                "He had already noticed you! He warps his tail around your head!",
                "You run away before he sits on you!",
                "He is backing away from another monster!"
            ],
            "content":"<div class=\"\"><div> <span>With his unmistakable blue mane and two pairs of arms and legs, you quickly knew it was a Hellion. But not soon enough to realize he is jumping above the boulder you're hiding! You see the huge feline leaping above the boulder and landing right in front of you. He lands right in front of you. You stare at his rear, wandering what would be his next move, he doesn't seem to have noticed you, but that could change really soon. While you are not quite sure if he is aware of your presence, you can tell he is moving backward, putting his rear end closer and closer to you.</span></div></div>",
            "created":1493614800,
            "id":2313752,
            "title":"A Hellion!"
        },
        "141":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "He keeps moving as more farts slip out",
                "You feel something warm and slimy start to push over you...",
                "You fall asleep and wake back up after he farts you back out!"
            ],
            "content":"<div class=\"\"><div> <span>Before you could make a move, the feline's musky rear comes crashing down onto you, forcing your head into his musky tail hole. You cringe from the smell as you sink in further while hearing faint moans from outside. As you sink in deeper, you felt some grime get into your clothes as you sink further up the feline's butt. Just after you sink in fully, you feel the feline moan out as the pucker closes over you, farting out the fresh air that came in with you. You shiver and push at the grimy insides as the smell started to surround you.</span></div></div>",
            "created":1493787600,
            "id":2314544,
            "title":"He sits on you!"
        },
        "145":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Stay with the strange creature",
                "Leave ",
                "Crawl inside her."
            ],
            "content":"<div class=\"\"><div> <span>You are surprised to see that the hellion is backing away from you. You glance around the boulder to see a strange creature. It is 3 times the hellion’s size and looks like a cross between a dragon and a killer whale. When you glance between it’s legs, you see that the new monster is female. The new monster jumps over the bolder, landing on the hellion. She shoves the hellion’s head into her mouth and starts to eat him alive. She’s very good at that and soon she has completed devoured the large beast. You can see the struggles of her prey through her belly. She stretches her back like a cat, purring, before dropping down onto her side and curling up in a tight ball. You get up and are about to leave when you feel a strong gust of wind. You look up into the sky and it’s almost dark out. On top of that, it’s winter and snows about to fall. You need to find shelter and warmth. You look back at the strange beast. It is risky but if you crawl under it’s wing and into it’s curls, you’ll escape the snow and cold. But it’s dangerous. You could be killed when it wakes up and sees you. Or you could leave and find a different place to take shelter in. Or if you are daring enough, you could climb into the creature. This is extremely risky but also you will be the warmest. And maybe the creature will be friendly if you show that you trust her by doing that.</span></div></div>",
            "created":1538974800,
            "id":2561061,
            "title":"He is backing away from another monster!"
        },
        "1453":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Mouth",
                "Vagina",
                "Anus"
            ],
            "content":"<div class=\"\"><div> <span>You work up some courage and approach the beast. You are freezing out here and this might be your only chance to not freeze to death. You look over it’s mighty form. You are to it as a mouse is to a human, in other words, you are tiny. You climb on top of her, you feel how she has short fur covering her body. You then slide down into her ball under her wing. There is enough space to move around. You look at her belly and it’s already noticeably smaller and the bulge has stopped moving. You gulp, realizing that if you are devoured by the beast, you wouldn’t last a couple of minutes. This hellion that the beast swallowed is already a 1/4 smaller than it used to be after 10 minuets abs it was huge compared to you. You look around and see a couple of places you can crawl into to keep warm. Her mouth, her vagina, and her anus.</span></div></div>",
            "created":1538974800,
            "id":2561074,
            "title":"Crawl inside her."
        },
        "14531":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "She is kind and helps you.",
                "She is mean and uses you or eats you."
            ],
            "content":"<div class=\"\"><div> <span>You move over to her mouth and gently pry it open. You are immediately hit by the stench of her breath but it isn’t as bad as you thought it would be. You are struggling to keep her mouth open when she suddenly yawns, you see your chance and gently lay down on her tongue. Her yawn ends as soon as you enter her mouth, plunging you into complete darkness. You turn around so that your feet are towards her throat and you close your eyes, enjoying the warmth of her mouth. It doesn’t take long for you to fall asleep. A few hours later though, the creature wakes up only to find something in her mouth, she knows that she didn’t put anything in there before she fell asleep. She feels the creature with her tongue and concludes that it’s a sleeping human. She looks around and sees tons of snow so she assumes that’s why the human is inside her mouth. But what she do with you?</span></div></div>",
            "created":1538974800,
            "id":2561101,
            "title":"Mouth"
        },
        "15":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "A Missing Lynx!",
                "An Orc!",
                "A Drakulard!",
                "A Night Fox!",
                "Nope, another Monster..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You think it might be another monster...</span></div></span></div>",
            "created":1493528400,
            "id":2313160,
            "title":"Another Monster..."
        },
        "151":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Approach the big rear...",
                "It turns around and notices you as you get close",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>You manage to look around the big Boulder and notice that it was a huge Missing lynx, a dragon like creature with feline capabilities. You begin to draw your sword, but then noticed it's huge rear. You couldn't help but to stare at it as it wobbles with each step the creature takes. You then get tempted to go near the massive butt...</span></div></div>",
            "created":1493701200,
            "id":2313958,
            "title":"A Missing Lynx!"
        },
        "1511":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You push yourself into it's nasty hole.",
                "You snap out of it and pull away",
                "You take too long to decide and it looks back at you"
            ],
            "content":"<div class=\"\"><div> <span>Despite your best judgment, you decided to go over to the huge, dragon like creature to get a closer look at it's big rear. As you got closer to the big butt, you started to notice a strong... stench. At first, it made you feel a bit nauseous, but it eventually grew on you and seems to have lured you closer to the big butt. After getting right up close to it, you decided to reach under it's tail and rub at it's tail hole. You blush a bit as you felt some grime and bits over the pucker. You then hear a deep moan as the pucker seems to relax under you hand for further entry. It seems the Monster is inviting you to push into it's big butt.</span></div></div>",
            "created":1493701200,
            "id":2314006,
            "title":"Approach the big rear..."
        },
        "15111":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "It starts to move along, enjoying the full feeling",
                "You fall asleep for a bit and wake up as you're farted out",
                "You feel Another load push over you."
            ],
            "content":"<div class=\"\"><div> <span>You shrug a bit before you let your hand push more into the grimy hole. The Monster reacts to this by morning and leaning it's front end down, keeping the butt lifted. You take in one last breath before you start to push yourself into the hole, Making the Monster outside moan out happily. Just as your hip slips in, you feel the monster lift it's butt up more to help ease you more into it's massive rump. Just as you sink in deep, you feel some smelly gunk get on your clothes and feared that the Monster has recently took a dump. The Monster let's out another happy moan before it farts loudly, pushing out any fresh air that came in with you as you settle in his filth.</span></div></div>",
            "created":1493701200,
            "id":2314059,
            "title":"You push yourself into it's nasty hole"
        },
        "151111":{
            "author_id":"leytonio",
            "author_name":"leytonio",
            "choices":[
                "Absorb you and turn you into assfat",
                "Keep you as a prisoner inside his ass forever"
            ],
            "content":"<div class=\"\"><div> <span>The lynx- now aware that *something* had been shoved up it's rectum, began to purr sensually, walking around the area, getting horny from the feeling of your body moving in his bowels. It let out a deep purr as it paused to suck you all the way into his anus, your feet disappearing completely from view, so that no one could even tell that you were imprisoned in the monsters asshole. You had by now been shaken out of your trance by the tight walls of the lynx's behind, and the rancid smell of the monster's shit, reminding you all too well of where you were. You tried to escape, but for every inch you wriggled out, you were relentlessly yanked two more inside. It began to dawn on you that you were going to spend the rest of your pathetic life in this lynx's ass. You could no longer see the light of the monsters butthole, having been drawn so far into the abyss of his rump. The only question remained; now that you were entirely at his mercy, trapped in the flesh of his hindquarters, what would he do with you?</span></div></div>",
            "created":1500786000,
            "id":2358101,
            "title":"Prisoner in the Lynx's rump"
        },
        "1511111":{
            "author_id":"zeblamm",
            "author_name":"Lurker",
            "choices":[
                "Yes, padding out your captor's rear",
                "Not quite, you're going to bcome his new asshole"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you're just going to end up as fat or...?</span></div></span></div>",
            "created":1500786000,
            "id":2358277,
            "title":"A little self-absorbed"
        },
        "15111112":{
            "author_id":"writerofyouth",
            "author_name":"Youth",
            "choices":[
                "Readers choice",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Deep within the bowels of the lynx, you began to lose consciousness. The stench of shit and soothing pulse of your captors intestines was too much. In your slumber, the lynx's ass began to break down your body and absorb the nutrients from you. While absorbing the nutrients the intestines did something not many people know of, it absorbed your soul. Your soul was passed further towards the exit while your previous body broke down. Your consciousness was then reattached to the lynx's business end, his anus to be exact. That shit encrusted, puckered, excreting anus you had voluntarily gave yourself to. <br>\r\nFinally after a day you awoke. Their was a lack of sunlight from where you were and you could stretch your body outside of a small pulse. What happened while i slept, you thought. Slowly the lynx woke from its cat nap and stretched. In its stretch it raised its fat ass into the air, much like a feline, and gave you a better look at your surroundings. You could see a dragon like tail nd two fluffy cheeks. It then dawned on you... You were its anus.</span></div></div>",
            "created":1513486800,
            "id":2429225,
            "title":"An all new low for you"
        },
        "151111122":{
            "author_id":"lepherandrian",
            "author_name":"Axel",
            "choices":[
                "The lynx talks to you",
                "You find you can speak",
                "He finds another human"
            ],
            "content":"<div class=\"\"><div> <span>As the news dawned on you and you were now being lifted up from the lynx's thighs, you were now part of the very thing you gave yourself to. Just to be straight, many people would seem to feel like it was a curse, or something like of a torture. Though not for you, you were raised with excitement as you were now the crusty, stinky tail hole of your favorite creature. You still had the sense of sight, though with out any eyes, which was best when he had to lay down it would't interfere with your sight. You could also hear, smell, feel, and of course taste. Which to some would be the most vile substance they would ever consume, though of course not for you. Somehow by changing into this new form you seem to be used to the taste, as though you've always been part of this beast your whole life. It was sweet and salty, like the combination of caramel and honey, though the taste never got old. You were getting along as an anus and waited for what would come next.<br>\r\n<br>\r\nThe beast seemed to be moving as your position you were in was now shifting every time his rear legs would rub each other. From your perspective everything was upside down, and it wasn't from where your eyes was located, it was the fact that your face was parallel from the ground making you seem to be upside down. The walking back and forth made you feel calm as though no harm will happen to you, which was true since nothing would try and mess with this missing lynx. As you were relaxed you could feel your stomach, what would've been you stomach began to feel stiff and full, reminding you of an anus's job. You seemed to be looking forward to this, as well as your master. For as the time you've been awake he's been looking for a spot to relieve himself.<br>\r\n<br>\r\nIt would've been something if your master could tell you were there, though it would be weird to have conversations with a sentient ass. The lynx got right with a tree where he looked and sniffed at the spot and started to do his business, this was where you will come in. You felt the turds colliding into your mouth where you could taste them which brought tears to your eye pores. It was heavenly, like your favorite dessert but with the sweetest sugars and the best nectar. As your muscles began to push and squeeze the contents all you had to do was open your mouth. You stretched your mouth which seemed of a challenge on how tight your lips was. Then the crud began to flow out with nobody able to stop it. You realized your whole body was just the rectum which now was being forced to expand to the size of the turd. You felt tired already and you were just starting your job. The first one was the roughest as you couldn't help but pinch it, and it fell onto the foliage of the forest. You looked down and saw some fragments of bone that was crushed in his insides. You imagined it must've been your old body, which now you were looking over it like a phantom. <br>\r\n<br>\r\nYou weren't done as your mouth was still filled with the heavenly food again. To think you were living off of this being's turds, what would people say? You figured it couldn't matter since nobody will recognize you anyway. You worked on opening your mouth again and letting the turd pass through and do the rest. This time it was soft and mushy which left some residue on your mouth. This time it was long and you let it pass until you pinched it off again and it fell down onto the first one. You seem to realize this turds were huge compared to the lynx itself. You wonder what a person wondering about will find of this, and would someone somehow find your remains. You finally released the last remaining waste you were carrying and pushed it out onto the floor. As the lynx was done, he then wiped you on the bark of the tree trying to get rid of the last of your meal.<br>\r\n<br>\r\nAfter that the lynx lead the way, probably looking for something to eat, since he must be hungry after a long nap and dump. You were left exhausted yet excited to do this again. The thought of being somewhere no one could locate you, was something of a dream. While you seemed to already be living a dream itself.</span></div></div>",
            "created":1521694800,
            "id":2468115,
            "title":"No Regrets"
        },
        "1511112":{
            "author_id":"samueliscool",
            "author_name":"Poi Yo",
            "content":"<div class=\"\"><div> <span>You keep on trying to crawl your way out of the Lynx's deep confines, but all that gets you is a deep purr, and you getting sucked in, pushing you deeper into the dark depths of the beast's bowels. You soon grow exhausted from your constant crawling, and decided to start pounding at the walls, maybe to annoy the Lynx enough to let you out. You hear a loud growl, and a strong rumble from beneath you. You brace for yourself to be let go, but instead, you sink deeper into the abyss, as the fart allows the walls to open up. You notice that the deeper you go, the worst the smell gets, as the walls around you also get more slimy and dirty. You finally, after struggling, and pounding on the walls, give up for that night, exhausted from all the work you did, and fall asleep inside the cavern. Outside, the Lynx notices that you had stopped moving inside his rectum, and does a low chuckle. He lifts his ass in the air, and does a deep fart, claiming you as his new butt toy, never to be let out again.</span></div></div>",
            "created":1557637200,
            "id":2659090,
            "title":"Stuck"
        },
        "15113":{
            "author_id":"daibhidh",
            "author_name":"Daibhidh",
            "choices":[
                "It pounces and attacks you!",
                "It smugly starts wagging its butt at you"
            ],
            "content":"<div class=\"\"><div> <span>You were completely entranced. It was like the whole world had narrowed until nothing was left but you and the sphincter infront of you. Too far gone to even notice the smell anymore, you let your hand gently trail over the muscular orifice. Letting it bask in the immense heat radiating from deeper inside. Letting your fingers trail lightly over the specks and clumps still clinging to the beasts exit, evidence of its frequent use over its owners life,<br>\r\n<br>\r\nThe muscle seems to appreciate your touch, softly clenching against your palm. First tensing up into an impenetrable barrier, before slowly relaxing. Abit more every time. Slowly allowing you to explore ever deeper. A freedom you happily make use of.<br>\r\n<br>\r\nA sudden growl snaps you out of your stupor, and you suddenly find yourself staring into two eyes instead of one. Your hand starts to grow cold, and you realize it has been freed from its warm embrace. The creature had to have twisted its buttocks away from you in order to investigate the thing plaguing its behind.<br>\r\n<br>\r\nTo its credit, it seems just as surprised to find you there, as you are with suddenly being confronted with the business end of the giant predator.<br>\r\n<br>\r\nYour training could never have prepared you for actually facing down a beast like this. Though you were confident in your ability with a sword, every bit of strength you possess seems to melt before the creatures stare. You feel exposed. Vulnerable. Weak. Your mind is a warzone. Every fiber of your being is screaming at you to run, but your legs refuse to listen. You wish to disappear. To forget all notion of the foolhardy quest that brought you here and live out a life of peace and quiet in some remote farmer village. You pray to every single god you can think of to beg them for rescue. None answer. You are utterly alone and completely helpless before this monster. Like a tiny mouse that got cornered by a ferocious lion. <br>\r\n<br>\r\nUntil, finally, your flight response overcomes your fear-induced paralysis and you're able to slowly shift your leg backwards. Getting ready to bolt. You are out in the open and there is no shelter to be seen, but you don't care. Anywhere is better than here.<br>\r\n<br>\r\nUnfortunately, the sudden movement seems to also wake the lynx from whatever daze it found itself in.<br>\r\n<br>\r\nYou barely make three steps before...</span></div></div>",
            "created":1493787600,
            "id":2314478,
            "title":"You take too long to decide and it looks back a..."
        },
        "151131":{
            "author_id":"writerofyouth",
            "author_name":"Youth",
            "choices":[
                "Run. This beast id dangerous",
                "Resume what you were doing. No harm. Right?"
            ],
            "content":"<div class=\"\"><div> <span>Just as you were about to run the beast gave you a smug smile then lifted its tail revealing both its filthy anus and its huge balls. This took you a little off guard but what really got you was when he started to wag his butt, as if inviting you to continue. As you stare, shocked at what was happening you decide to...</span></div></div>",
            "created":1509944400,
            "id":2411962,
            "title":"It pounces and attacks you!"
        },
        "1511312":{
            "author_id":"writerofyouth",
            "author_name":"Youth",
            "choices":[
                "Go deeper",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>The invitation was to much to give up.  As you slowly reproach the big beautiful rear of the lynx you begin to hear it purr. Now you are standing behind his rear end and that musky scent was back in the air, back in your head. You reach out with your hand and began to stroke his anus, smearing its leftovers where ever you touched. As you rubbed over the lip the anus reflexively clenches then loosens allowing you to explore a bit deeper you decide to...</span></div></div>",
            "created":1509944400,
            "id":2411965,
            "title":"Some mistakes were made (but not here)"
        },
        "151132":{
            "author_id":"yaltenbased",
            "author_name":"YaltenJosh",
            "choices":[
                "The fun has only begun",
                "And now your adventure has ended... Permanently"
            ],
            "content":"<div class=\"\"><div> <span>You continued stepping backwards away from the gigantic beast before you. After hearing stories about how strong and destructive they are, you knew trying to fight a missing lynx was a death sentence and your only possibility of survival was to make a quick escape. While you slowly made your way out, the beast simply stared you down with a piercing glare that put you on edge. You see the muscles in the lynx's left front leg flex as the beast slowly lifted it and brought it forward, followed by its left back leg to bring itself closer to you until it was directly over you. You look up at the belly of the beast as it moved over you, even giving you a good view of its goods consisting of its sizable sheath that was home to its shaft immediately followed by a massive sack carrying two large and potent family jewels. <br>\r\n<br>\r\nYou turn as the lynx passed over you, with his pudgy hindquarters facing your direction and its head turned to face you. He knew you were trying to escape and has blocked your only exit. You gulp loudly as you feel goosebumps beginning to form on your arms and your hands begin to sweat profusely. Now there was truly no chance of escaping and all you could think about was what grisly plans this lynx had in mind for disposing of you. Was he going to eat you? Was he going to rip you apart with its claws? But your train of thought was interrupted by a low growl from the lynx. <br>\r\n<br>\r\nThe growl enticed you to look up and see his colossal ass wiggling in a playful manner and a sly look on the lynx's face. This puzzled you, you were lead to believe that these were savage beasts that only knew devastation able to destroy entire towns in less than half an hour with ease, but now one stands in front of you seemingly wanting to play? Regardless, he did give you quite the view that left you somewhat entranced. Seeing those plump cheeks wobble from side to side and his gonads sway along with them was rather alluring. Your fear slowly left your body and you let your guard down seeing this beast was not much of a threat. <br>\r\n<br>\r\nAs you continued to watch the show ensue, you were ignorant to the lynx's complexion changing from sly to devious. The backside of the beast began to descend aiming directly for you. Your field of view is slowly consumed by the lynx as it descended lower and lower. In the back of your mind you heard a voice yelling at you <i>Get out of the way, hurry!</i> however your body did not obey and soon the lynx slammed down on top of you, burying you beneath several tons of ass with a deafening <i> <b>BOOM! </b> </i></span></div></div>",
            "created":1542258000,
            "id":2578438,
            "title":"Friend, or Foe?"
        },
        "153":{
            "author_id":"zgurosm",
            "author_name":"Farterguy",
            "choices":[
                "Jump out of the way!",
                "Too late! He sat on you!",
                "Too late! He farts on you!"
            ],
            "content":"<div class=\"\"><div> <span>You stay hidden long enough to notice a winged, green and fat monster. \"It's probably a Drakulard\" You think, and you're right. The giant beast doesn't seem to have noticed you... yet. But he's walking towards your hide spot, it's just a matter of time before he realizes you are there. You decide to jump to another hideout before the giant sees you. With a swift movement, you jump into near bushes. You look out again to see if the Drakulard has heard you but... he's not there... You think he probably wandered off somewhere, but then, you realized his giant rear is above you and closing in!</span></div></div>",
            "created":1493614800,
            "id":2313750,
            "title":"A Drakulard!"
        },
        "155":{
            "author_id":"aerodeth",
            "author_name":"Aerodeth",
            "choices":[
                "a Hulagan?",
                "a Hammerhood?",
                "ANOTHER monster...",
                "How bout Bjørn the Behemoose?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>No, it's certainly another monster...</span></div></span></div>",
            "created":1493874000,
            "id":2315046,
            "title":"Nope, another Monster..."
        },
        "1553":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "The Great Argon Lizard",
                "The Grim Rider",
                "Nope, Another monster..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of these?</span></div></span></div>",
            "created":1494046800,
            "id":2315635,
            "title":"ANOTHER monster..."
        },
        "15533":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Yes, absolutely! (Encounter with a Meowgician)",
                "Not really... (Another monster?!)",
                "No, how about Spitzfire, a monster that's part canine, part dragon?",
                "No, how about Professaurus, an intelligent looking dragon monster?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does a chubby, magic slinging cat suit your tastes?</span></div></span></div>",
            "created":1494046800,
            "id":2315758,
            "title":"Nope, Another monster..."
        },
        "155331":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "He notices you",
                "He cums"
            ],
            "content":"<div class=\"\"><div> <span>You cautiously peer over the boulder's edge to try and spot the source of the grunting sound without whatever's there spotting you first. You gasp and blush at the sight, unable to take your eyes off of it.<br>\r\n<br>\r\nAgainst a tree at the forest's edge was a local monster known as a Meowgician. Appearing as a short, gray furred anthro feline that wields spells and carries with it an enchanted bell that some suggest gives it it's power. This one deviated little from the mold, the only oddity being the crystal bell slung around it's neck like a pendant.<br>\r\n<br>\r\nAnd it was totally jerking it's dick right there in the open.<br>\r\n<br>\r\nYou can feel yourself stiffen up down below, and you curse your sudden arousal. How can this be? Aroused by this weird cat just pumping it out in the open so boldly? And yet you can't take your eyes away. You leer at the feline vigorously stroking himself, currently cut off from the world by his apparently overwhelming lust.<br>\r\n<br>\r\nHis chubby belly jiggles about in tandem with his fat fuzz covered nuts, pre spilling down his rather thick looking dick. His eyes were wrenched shut, teeth gritted tight as his climax comes in hot.<br>\r\n<br>\r\n<br>\r\nJust then...</span></div></div>",
            "created":1494046800,
            "id":2315781,
            "title":"A Meowgician"
        },
        "1553311":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "In the Meowgician's home, as his captive",
                "Deeper in the forest, where the stronger monsters live"
            ],
            "content":"<div class=\"\"><div> <span>The Meowgician's expression softens, a pleased smile on his face as he slows down slightly; wanting to draw it out some more. Just then he looks up with lidded yellow eyes, which then become wide as saucers as he spots you. Oops...<br>\r\n<br>\r\n\"Myah?!\" He shoots up like a rocket, picking up his oak rod and robe which were both discarded beside him. The staff is pointed towards you while the orange garment is placed in front of his shame. Apparently he doesn't notice his hard on making a very notable bulge through the cloth. \"Cat's cradle! Who the heck are you?!\" A bit taken aback that it's talking, you pause a bit too long, the cat Monster's face contorting with anger. \"P-P-Pervert! You were watching me, right?! Meow I'm mad!\" It swings it's wooden staff in a wide arc, flinging a fireball your way. You quickly hold your shield up, but end up flung back by the explosion, your shield ending up as kindling.<br>\r\n<br>\r\nYou stand up to face the spell slinging furball, sword lifted into position but find another fireball already coming your way. You're too slow to dodge and end up bodily flung into a rock by the resulting impact, your armor thankfully absorbing most of the blow. Sadly you didn't invest in a helmet and the hard boulder does a good number on your head.<br>\r\n<br>\r\n<br>\r\nLight slowly fades from your vision, the last thing you see is the Meowgician advancing towards your prone body, it's ringing bell and gold eyes both gleaming with power...<br>\r\n<br>\r\n<br>\r\nWhat must be hours later you shake the stars from your head, feeling groggy but no worse for wear. What's really worrying is where you wake up...<br>\r\n</span></div></div>",
            "created":1494046800,
            "id":2315789,
            "title":"He notices you"
        },
        "15533111":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "You shrink down!",
                "You turn into an object!"
            ],
            "content":"<div class=\"\"><div> <span>You stand up with a start, sweat beading down your face. You try to find your sword but find you've been disarmed. Only wearing your tunic, pants and boots. You're helpless... But you try to keep cool and try to find a way out of this predicament.<br>\r\n<br>\r\nYou look around the room you're in, it seems you are either underground or in a cave surrounding by rough stone. Several torches line the walls around you. Holding you are a set of iron bars that you can't imagine squeezing through. You also glance at the big honking lock keeping the cell's door closed. You slightly regret not picking Thief as your class now...<br>\r\n<br>\r\nThe sound of a door opening catches your attention, and you look deeper in the room to spot a wooden door at the far end creaking open... And in steps the Meowgician. Wearing an evil grin and carrying a small burlap bag.<br>\r\n<br>\r\n\"Meow look who's awake! I was real surprised to see a human in my woods you know, they used to come along all the time and kill whoever and whatever they wanted! Most tried to purrloin my precious bell here.\" He points to the crystal bell around his neck, the magical treasure glinting in the torch light. \"But who knew there were some purrverts among them too!\" You blush and recoil in shock, trying to assuage you weren't wandering into the woods to look at Monsters masturbating. \"Pssh! Myah! You aren't fooling anyone! I know your type, completely no good! And I have special ways to deal with no gooders in my woods... Nyeheheheh...\" You gulp in fear, the weird cat digging into his bag and pulling out a handful of powder which he proceeds to throw at you through the bars. It ends up in your nose, mouth and eyes, causing you to sneeze and rub your poor assaulted visors. You suddenly stop when odd tingles arc through you, something is happening...! </span></div></div>",
            "created":1494046800,
            "id":2315794,
            "title":"In the Meowgician's home, as his captive"
        },
        "155331111":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Drop you and stomps on you with his soft paws.",
                "Shoves you into his butt."
            ],
            "content":"<div class=\"\"><div> <span>The weird magic powder seeps into you, vertigo making you stumble and pratfall. You groan as nausea wells up in your gut, really hoping you weren't just poisoned. But as you look up to ask the Meowgician what he did you scream as you find a now super sized cat wizard looking down at you with glimmering eyes and a sick grin.<br>\r\n<br>\r\nIt takes a few moments to realize what exactly happened. <b>You've been shrunk!</b> And only to a measly 4 inches. The formerly shorter cat licks his snout and reaches towards you. You try to run but end up caught easily, the bastard no doubt an old hand at catching mice sized beings like yourself.<br>\r\n<br>\r\nHe holds you up by the middle, your struggles nothing to his padded fingers. \"Nyeheheheh! Good look human! You're all vermin after all.\" He opens his maw wide, causing you to shout in terror. Your screams are muffled by his slick tongue pushing against your entire front, coating you in his fish scented drool. After giving you a good taste the Meowgician draws back chuckling as you gag and spit out.<br>\r\n<br>\r\n<br>\r\n\"Here's the best spot for humans like you.\"<br>\r\n<br>\r\nThe cruel cat proceeds to...</span></div></div>",
            "created":1494046800,
            "id":2315799,
            "title":"You shrink down!"
        },
        "1553311111":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "He makes you bathe his sweaty paws with your tongue",
                "He stomps on you some more"
            ],
            "content":"<div class=\"\"><div> <span>The fell feline grins as you uselessly struggle in his grip. You demand to be let go which causes your captor to grin maliciously. \"Nyah? Let go? If you say so!\" You're discarded like a banana peel, dropped to the floor. You scream in terror as the floor rapidly closes in, and you gracelessly smash onto the stone floor. You groggily pick yourself up, looking up with dizzied eyes. Filling your sight is a massive furry foot with three thick toes and big plump pads.  Your shocked cry is cut off as the Meowgician smothers you with his paw, smirking as he smushes you into the floor. <br>\r\n<br>\r\nYou grunt in pain as your entire body is pressed flat to the ground by that huge paw. Thankfully it's soft, and the cat wizard isn't putting his full weight onto you, but the musky smell and the sweat dripping onto you makes the experience thrice as unpleasant.<br>\r\n<br>\r\n\"Nyaha! Nyeheheh! Enjoying yourself purrvert?\" You try to cry out, but the soft mushy pads mute your voice. \"Yesss! I'm going to enjoy punishing you!\"<br>\r\n<br>\r\n<br>\r\nThe Meowgician ponders on what method to torment his new toy...</span></div></div>",
            "created":1494997200,
            "id":2321169,
            "title":"Drop you and stomps on you with his soft paws."
        },
        "1553311112":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You decided to rest for a bit...nothing wrong with a little nap, right?",
                "You wait till the feline is distracted before attempting to escape",
                "You feel something else start"
            ],
            "content":"<div class=\"\"><div> <span>You blush heavily as you see the feline turning around and lifting up his clothing, exposing his furry rear to you. When you notice that he was starting to bring you closer to it, you start to panic and push up against the furry paw. The feline chuckles at this and soon presses your head against the slimy pucker. You cringe from the smell and struggle more against the furry, butt cheeks as he slowly pushes you in more, sending out deep moans as he does. You then felt some bits get into your clothes as you are pushed in further up your rancid prison. Just after you get pushed in fully, some slimy bits start to cling to you as the feline lets his clothing drop back down. Just before you get a chance to relax, the feline feels a rumble and pushes, letting out a rancid fart over you and getting more filth onto your trapped form!<br>\r\n<br>\r\nYou start to ponder if you should stay in this feline's ass or try to escape...</span></div></div>",
            "created":1494046800,
            "id":2315820,
            "title":"Shoves you into his butt."
        },
        "15533111121":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "There's no chance. You're the cat caster's toy forever.",
                "The Meowgician wakes up to squeeze you out."
            ],
            "content":"<div class=\"\"><div> <span>The smell, the heat, the horrible clenching... All of it together was too much. Your willpower was sapped away by this cat's filthy hole. You struggle for a while in this disgusting, dung coated tomb. Pounding the walls with your balled fists, shouting... But it only brings the feline Monster pleasure. He jerks himself off to your predicament, quickly cumming from his pent up lust as you squirm in his rectum. \"Nyaaa...~ I'm gonna take a nap, you be good in there!\" The command makes your skin crawl. What you'd do to this jerk when you got out...<br>\r\n<br>\r\n<br>\r\n<b>IF</b> you got out! Doubt starts to claw at your psyche, and you start to sulk, the sheer stink of the Meowgician's hole momentarily forgotten. You can faintly hear snoring outside, your new owner fast asleep. As the last of your air is pushed out in a rank fart you start to faint, deciding now is the time to rest. You can try to escape later. He'll slip eventually. Definitely...</span></div></div>",
            "created":1495861200,
            "id":2325991,
            "title":"You decided to rest for a bit...nothing wrong w..."
        },
        "155331111212":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "\"I think I'll let you stew in there.\"",
                "\"I'll invite a friend!\""
            ],
            "content":"<div class=\"\"><div> <span>Somehow you sleep through the horrendous odor of the Meowgician's guts, awakened by an awful groaning noise from the fleshy dungeon. Light flashes briefly into the oversized cat's pucker, and you peer upon the outside for the first time in what feels like forever. You can't help but let eagerness take you, now's your chance! You begin to push at the entrance to his anus. It gives quickly and you begin your descent, squeezed from this pervert cat's throbbing hole.<br>\r\n<br>\r\nYou take in fresh air with a gasp once your head breaches the Meowgician's dark star, but your jolliness at the prospect of freedom is dampened by the continued groans from your captor's round gut. \"Mmngh... Mrrooww...\" You grunt in pain when the anal ring suddenly squeezes you tight, choking you. But before something truly unfortunate happens you're blasted free by a loud, vulgar fart. <br>\r\n<br>\r\n<i><b>*pfrr-FRRRRT*</b></i><br>\r\n<br>\r\nLuckily soft sand breaks your fall instead of breaking some bones, and you start to wipe the old waste coating your clothes before realization hits. Sand...? You look up in shock as the cat caster's asshole gapes open, a thick brown turd plummeting down onto you! Over a minute of shitting later the Meowgician looks down, licking his lips at the sight. You were completely buried under his poop.<br>\r\n<br>\r\n\"Nyahahaha! I hope you enjoyed your stay human! Cause you felt so good I think I'll make you my plaything from now on!\"<br>\r\n<br>\r\nYou groan. Anger and fear and disgust well up in- Why are you hard?!! Despite literally being smothered in feline shit your shaft remains hard as stone. You blush, glad he isn't seeing this shameful display too. Cleaning his anus with a magical cantrip, the feline taps his chin. \"What to do next...?\"</span></div></div>",
            "created":1500440400,
            "id":2355940,
            "title":"The Meowgician wakes up to squeeze you out."
        },
        "1553311112122":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Pffft. Heck no.",
                "Yes! Time to make a break for it! "
            ],
            "content":"<div class=\"\"><div> <span>You freeze like a pond in Winter. Friend?! You begin squirming your way free out of the fresh, warm pile of cat scat, but end up caught once again when the fel feline simply reaches down to pluck you between two fingers. \"So easy!\" The cruel monster grins broadly at you, holding you like a rebellious but especially small kit. \"What's wrong mousie? Cat got your tongue?! Nyahahah!\" You seethe and thrash, impelled by anger at this mortal blow to your pride. Yet all your struggles remain in vain at this size!<br>\r\n<br>\r\nStepping through his domain the giant cat drops you into a glass bottle and shelves it. Luckily it has holes through the cork, probably put their in the morning for the express purpose of being your prison. You put your hands to the glass, seeing your captor walk away; laughing like a nut. You consider your options, feeling hopeless for the most part. Caught like a fairy in this bottle, there's not much you can do... Except break the bottle of course.<br>\r\n<br>\r\nInspiration sparks and you note how high up you are on this shelf. All you have to do is tip it over and *CRASH* Freedom!<br>\r\n<br>\r\nBut are you strong enough?</span></div></div>",
            "created":1500440400,
            "id":2355942,
            "title":"\"I'll invite a friend!\""
        },
        "15533111121221":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Up his gorgeous butt.",
                "Down his thick canid cock."
            ],
            "content":"<div class=\"\"><div> <span>You throw yourself against the glass again and again, but can't quite muster the strength to tip it enough for it to fall. You fall to your knees, exhausted. It just dawned that you haven't eaten anything since being caught, you have no strength to fight let alone escape. You sag in despair...<br>\r\n<br>\r\nA few hours later you hear the telltale ringing of a crystal bell. He's back.... You greet your teeth and curl up, facing the wall. <br>\r\nMaybe playing dead will work... \"Here he is! Cute, right?\" That scratchy voice tickles your ears. That bastard is seriously messed up... \"Do you clean him? He's filthy.\" A regal but reedy voice accompanies your captor's. Who is that...? You can't help but turn towards it.<br>\r\n<br>\r\nA tall vulpine man wearing foppish clothes and a sword. His muzzle is turned up, narrow eyes glaring at you. Fur blue like the night under a full moon. A Night Fox according to your memory of the Monster Manual. You grimace at the thought of... Entering him, but again your body betrays your trust and your dick hardens up again. It feels warm in this stuffy prison all of a sudden.<br>\r\n<br>\r\n\"Hmph! Dog my cats, you're finicky! He'll just get dirty again when we play! Fine...\" You're released out onto the Meowgician's hand which glows a cool blue. The leftover waste coating you flakes away, leaving you nice, clean and ready to be abused. You grumble at the seeming ease that magic brings, and briefly consider changing classes if you get out of this...<br>\r\n<br>\r\n\"He's a shrimpish thing, isn't he? Even without the shrinking curse you put on him, this is a pitiful looking human.\" The fox notes, a smirk across his muzzle. You turn to glare but end up floored (or maybe 'pawed', considering your current perch.) by the sight of the Night Fox, who's now naked and brisk as a nymph in the woods. His hips are wide, which seems to be a necessity considering how full and round his ass was. You could bounce a gold piece off of those cheeks! You stammer, blushing as you also spot his hefty sheath and grapefruit sized balls. Definitely this vulpine warrior was twice the male this jerkish feline was... <br>\r\n<br>\r\n\"So, where do ya want him?\" The Meowgician asks with far too much glee. \"Hm, hard choice...\" The Night Fox looks you over closely...</span></div></div>",
            "created":1500440400,
            "id":2355952,
            "title":"Pffft. Heck no."
        },
        "155331111212211":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "You spend the night in his filthy colon, waking up in the morning.",
                "You're lost to his wonderful big butt... Forever!"
            ],
            "content":"<div class=\"\"><div> <span>The Night Fox turns around with that smarmy grin. He pulls apart one of those delightfully wide asscheeks, showing off an ebon pucker. \"I think he will fit right in, considering he is already a veteran butt plug.\" You gasp and struggle harder in the cat monster's grip, but he huffs and shoves you into his mouth. He muffledly laughs while you scream. \"Be gentle now, it has been a while since I've had something... Inserted.\"<br>\r\n<br>\r\nYou retch in disgust at the state of the Meowgician's maw, trying to swipe the drool off of you. You're interrupted by his wide, rough tongue coiling around you, slicking you in even more spit. You hear a nausea inducing *slrrrp* noise as the fleshy maw shifts. The cat mage was between his curvy compatriot's butt, giving him a firm smooch on the hole. His tongue coils around you in a vice and your vision is taken up by the dark ring of the Night Fox. You sink right in, the pervy magic meower forcing his tongue past the fox's butthole, both of them moaning in pleasure.<br>\r\n<br>\r\nYou can't help but join them, all of this hot flesh sliding over you. And this foxy warrior was so handsome somehow, and those curves... It drove you wild! The pressure of his anus squeezing you causes you to climax, making your entry slightly slicker. You can barely hear him moan as you're pushed all the way in, your feet slipping past his pucker and away from the Meowgician's tongue. Now you're slowly traveling up into the especially curvy Night Fox's rectum, surrounded by the pulsing, comforting flesh. He keeps himself much tidier than the cat at least, his interior only smelling faintly of shit. And his anal walls are so gentle, massaging you deeply as you are driven deeper inside...<br>\r\n<br>\r\nMeanwhile in the outside world the Meowgician still had his tongue circling over the fox's asshole, causing it to twitch in pleasure. \"Nggh, here it comes. Pardon the mess!\" The Night Fox himself was in the throes of pleasure, jerking his knotted member while his balls throb. The ground is blessed by his seed, splattering across the floor in wide reaching arcs. \"Aaaah...\" The pervy cat gives his fox friend another deep rim before popping off. \"Mwah! Heeheee... How does he feel?\" The equally corrupt vulpine hmms to himself, middle finger working it's way into his hole. \"Quite deep, isn't struggling as much as I had hoped.\" The cat caster shrugs and sits on his bed, hand grabbing his balls. \"Ffft! Probably liking it! The perv... Now come do me!\"<br>\r\n<br>\r\n<br>\r\nInside is nothing but darkness and warmth, and the odor is growing stronger. But you can't struggle you're so tired... But why even bother? It's so comfortable in this fox, and you could just stay a while. Maybe escape another day? Maybe...<br>\r\n<br>\r\nBefore you know it you've drifted off to sleep in the Night Fox's butthole.</span></div></div>",
            "created":1500440400,
            "id":2355962,
            "title":"Up his gorgeous butt."
        },
        "15533112":{
            "author_id":"writerofyouth",
            "author_name":"Youth",
            "choices":[
                "Run",
                "Stay and fight"
            ],
            "content":"<div class=\"\"><div> <span>As you awaken you find yourself scorched, bleeding and bruised but alive. As you look around you notice some very big trees and a lack of light. You realise exactly where you are. Quickly grabbing your sword next to you, you get into position. You weren't trained to fight these monsters. These beasts were the nastiest most vile beasts that could ever live. Just then you heard a crack in the underbrush. You decide to...</span></div></div>",
            "created":1499317200,
            "id":2348247,
            "title":"Deeper in the forest, where the stronger monste..."
        },
        "155331122":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "An immense, and immensely fat blue dragon. A Frou-Frou!",
                "A tall, ripped canine man. A Jackal Ripper!"
            ],
            "content":"<div class=\"\"><div> <span>You stand on shaky legs, the previous scuffle with that crazy cat having left you weakened.You move your hands to find your pack to grab a few medicinal herbs, but gasp as you find it's missing! The only thing you have is your sword, and you unsheath the blade, ready to stand against this new foe; even with your nerves straining.<br>\r\n<br>\r\nYou came out here to fight monsters, and injured or not that's what you'll do! So you level your sword and step towards the noise in the brush... What you find inside is...</span></div></div>",
            "created":1515560400,
            "id":2439010,
            "title":"Stay and fight"
        },
        "1553311221":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Stick around. What's the worse that could happen?",
                "Make a break for it. (And get caught)",
                "Make a break for it. (And get away scot free)"
            ],
            "content":"<div class=\"\"><div> <span>A lizard-like head pokes out from the bushes. It's scales were shades of blue, and long purple frills sagged from the sides of it's head, like a pair of hare ears. Deep green eyes were staring you right in the face. Startled, you swing your sword downward; striking true! To no effect. Your blade clangs harmlessly of it's skull, and you stand there; frozen in shock. It blinks, then rises... And keeps rising until it reaches a good 20 feet standing, your sword stuck in between it's scales like some sort of ornament. The beast reveals it's full glory to you, even slightly hunched over it was an absolutely gigantic reptile. From it's color and enormous belly you could tell it was a Frou-Frou, only this one was at least twice the size of a normal one. And it was a male, you could tell from it's fat scaly balls hanging underneath an enormous sapphire cock that was almost as big as the average person.<br>\r\n<br>\r\nIt's eyes cross, looking up at the hunk of metal. Taking your sword in between it's fingers, the Frou-Frou grins. \"Is this yours?\" It asks, in a deep bass voice. It doesn't wait for an answer before picking it's teeth with your trusty monster slayer. \"Thanksh, got something in my biters.\" While you're glad this thing is docile so far, you're a bit incensed at it's rudeness. Though being now unarmed and only a quarter of it's size you're not in a position to argue. <br>\r\n<br>\r\nNow what...?</span></div></div>",
            "created":1518152400,
            "id":2451071,
            "title":"A Frou-Frou!"
        },
        "155332":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Please and thank you! (Encounter with a Mandrake Major)",
                "Nope. (A-Another?!)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a muscular lizardman?</span></div></span></div>",
            "created":1494046800,
            "id":2315760,
            "title":"Not really... (Another monster?!)"
        },
        "1553321":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "He sat on you with his sweaty balls",
                "He sat on your face with his huge ass"
            ],
            "content":"<div class=\"\"><div> <span>As you walk along the path, you catch a glimpse of something dashing in the trees. You think nothing of it, passing it off as a squirrel moving along the branches. Unbeknownst to you, that was to distract you from something else you weren't aware of: a mandrake major behind you. <br>\r\n<br>\r\nYou were suddenly swept off your feet. You looked up to see what tripped you, and got greeted by the sight of the mandrake. </span></div></div>",
            "created":1590073020,
            "id":2839002,
            "title":"Please and thank you! (Encounter with a Mandrak..."
        },
        "15533212":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "He began farting on you",
                "He pressed his ass harder until you were pushed into his asshole"
            ],
            "content":"<div class=\"\"><div> <span>The reptilian humanoid turned around and presented his large rear, before jumping backwards with his ass facing you, and his posterior slammed onto your face. <br>\r\n<br>\r\nThe smell of swamp and sweat hit your senses all at once, making you squirm desperately under the mandrake's bum, but he clenched his muscular buttcheeks, sandwhiching your face in his smelly crack. He grabbed your mouth and forced you to open your mouth, and sat with his full weight, forcing your mouth to remain clamped in his booty. <br>\r\n<br>\r\nHe began bouncing up and down, each bounce forcing your face and mouth deeper into the mandrake's stinky bottom. </span></div></div>",
            "created":1590346920,
            "id":2840432,
            "title":"He sat on your face with his huge ass"
        },
        "1553322":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would a fantasy staple work out better for you? How about a dragon?</span></div></span></div>",
            "created":1523163600,
            "id":2477050,
            "title":"Nope. (A-Another?!)"
        },
        "15533221":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Male or female or herm? (Since I don’t have membership, herm will be under female.)</span></div></span></div>",
            "created":1523163600,
            "id":2477051,
            "title":"Yes"
        },
        "155332211":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "It shoves you up it's ass",
                "Smothered you with it's balls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You spot a black-scaled dragon flying around. It lands near you! You draw your sword and charge at the beast!</span></div></span></div>",
            "created":1565845200,
            "id":2702813,
            "title":"Male"
        },
        "1553322111":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "Used as his toilet paper",
                "Shoved deeper into his booty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The dragon knocks you down with it's tail and crashed it's smooth posterior on your face. A smell akin to rotten eggs fills your nose, causing you to squirm under the large dragon's rump. You were then</span></div></span></div>",
            "created":1566882000,
            "id":2708571,
            "title":"It shoves you up it's ass"
        },
        "15533221111":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "content":"<div class=\"\"><div> <span>The dragon used some kind of magic to keep you pinned to the  floor as he flew off for a while, but he came back and he was...smirking.<br>\r\nYou felt the magic break as he sat back on your face. But you noticed that his ass was now shit stained. The smell was absolutely horrible. He then began grinding his big butt up and down your face, using you as his toilet paper. He did this as slow as he possibly could, taking pleasure in your struggling under his smooth, onyx black, scaly ass. After an agonizing 3 hours of dragon butt torture, he clenched his cheeks, trapping you in his crack. He flew off and landed in a dense forest. He did this so that no one would hear your screams from what he was about to do.<br>\r\nHe dislodged you from his posterior with a powerful fart. <br>\r\nYou looked up and saw him use some sort of magic to summon any kind of food that would give someone really bad gas. While he waited for the gas to build up, he pushed you against a tree with his ass and began.........twerking. How did a dragon know what twerking was?! Nevertheless, he was loving this. He often stopped during his twerking to clench, resulting in your face vanishing deep into his musky abyss.<br>\r\nAfter 10 minutes, all the gas had built up, and he unleashed a 20 second wet fart right into you.<br>\r\n\"PPPPHHHHLLLLLRRRRRTTTT\"<br>\r\nHe moaned, loving your muffled screams for help. Before you could recover, he sent another fart into your face.<br>\r\n\"FFFFFFRRRRRTTTTT\"<br>\r\nHe giggled, bouncing his cheeks up and down your helpless body.<br>\r\nYou spent eternity as his butt toy. After all, dragons didn't age. At least he didn't. And his magic made it so neither did you. So that you could forever serve his perfect rear.</span></div></div>",
            "created":1572325200,
            "id":2739789,
            "title":"Used as his toilet paper"
        },
        "155332212":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Female",
                "Herm"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Female or herm?</span></div></span></div>",
            "created":1523163600,
            "id":2477054,
            "title":"Female"
        },
        "15533222":{
            "author_id":"jayguy",
            "author_name":"Jayguy",
            "choices":[
                "A Cyclops",
                "Jargon",
                "A Troll",
                "More choices!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More monsters in the mix</span></div></span></div>",
            "created":1540011600,
            "id":2566537,
            "title":"How about..?"
        },
        "155332224":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No - You make it through the forest with no major incident",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about something from Monster Hunter World?</span></div></span></div>",
            "created":1540098000,
            "id":2566727,
            "title":"More choices!"
        },
        "1553322241":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "Rathalos",
                "A different monster"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Take your pick</span></div></span></div>",
            "created":1590072360,
            "id":2839000,
            "title":"Yes"
        },
        "1553322242":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe you went through the forest with no problem and got to a lake. Do you get jumped by an aquatic or semi aquatic monster?</span></div></span></div>",
            "created":1556946000,
            "id":2654993,
            "title":"No"
        },
        "15533222421":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Semi",
                "Fully"
            ],
            "content":"<div class=\"\"><div> <span>You approach a huge lake. You cannot see across it. You walk to the edge and look across the lake. This place is very serene. It almost makes you forget about the disgusting evil that has started to take over. Just as you let your guard down something appears from the water. Is it semi or fully aquatic?</span></div></div>",
            "created":1556946000,
            "id":2655017,
            "title":"Yes"
        },
        "155332224211":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "A Sea Dog pirate? This one has some magic items on him...",
                "A Drackal?",
                "A Chompoceros?",
                "Another monster?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While trying to walk along the beach, which monster do you encounter?</span></div></span></div>",
            "created":1557032400,
            "id":2655537,
            "title":"Semi"
        },
        "1553322242112":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Turns back around...and proceeds to sit on you!",
                "It growls and charges at you!",
                "You manage to dodge it's attack!",
                "You try to run away from it!"
            ],
            "content":"<div class=\"\"><div> <span>As you walk along the beach, you noticed a huge, green creature swallowing down some prey. You didn't recognize it at first, but when it turns around, you immediately recognize it as a Drackal. Last you checked, it was a cross between a jackal, rat, and a dragon. This combination freaked you out a bit, but you keep your distance as you look over it. The creature has seemed to have gained quite a bit of pudge from all of the prey it has devoured over time. You ready your weapon and get ready to attack it before it...</span></div></div>",
            "created":1557032400,
            "id":2655612,
            "title":"A Drackal"
        },
        "15533222421121":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "It just farts, leaving you trapped in it's pudgy ass",
                "You get pushed back out with a horrible fart!",
                "The gas was causing you to fall for the creature and make you go in deeper...",
                "You try to go back out with it's next load..."
            ],
            "content":"<div class=\"\"><div> <span>You think it was going to go back to feast on whatever prey it has captured and ignored you...You let out a sigh of relief, but your relief is short lived when, as the creature turns around, you see the creature lift up it's thick tail and exposed it's grime covered pucker. You start to feel frightened and as you try to run away, THUMP...the creature has slammed it's ass down, shoving you deep up into it's bowels...<br>\r\n<br>\r\nInside of the slimy bowels, you nearly puke as it smells like a crypt inside of it's bowels! You are constantly rubbed up against the slimy walls as slimy bits cling to you and digested bits of whatever it swallowed bumped against you...and if that wasn't enough, the thick fumes inside it's ass is quite intoxicating...<br>\r\n<br>\r\nYou then hear a rumble as it gets ready to fart...</span></div></div>",
            "created":1557032400,
            "id":2655623,
            "title":"Turns back around...and proceeds to sit on you!"
        },
        "1553322242113":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You trip and fall right into it's open maw!",
                "You dodge and get right behind it...bad move!",
                "You manage to dodge it's attack!",
                "You manage to do damage to it!"
            ],
            "content":"<div class=\"\"><div> <span>As you walk along the beach, you noticed a huge, purple and pudgy creature starting to rise out of the water, and noticed right away that it was a Chompoceros! Just like a Hippo, the huge creature is quite pudgy, and has a mouth big enough to swallow you down whole with no problem! You fear that if you try to fight this thing, it will either make a quick meal out of you, or end up using it's pudge against you! None of it seems to alluring to you. You draw out your weapon just as it starts getting ready to charge at you...</span></div></div>",
            "created":1557032400,
            "id":2655630,
            "title":"A Chompoceros"
        },
        "15533222421131":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "The creature just belches as it goes about it's business",
                "You try to get out through it's mouth!",
                "You try to go out...through the back door...",
                "You unknowingly start to rub at the slimy walls as you breathe in the fumes..."
            ],
            "content":"<div class=\"\"><div> <span>You attempted to charge at it and tried to slash at it...unfortunately, you trip in the sand and landed right in it's filthy maw! You braced yourself as you worried it would bite down on you, but instead it closed it's mouth and just swallowed you...as you slip into it's spacious gut, you wished it did bite down on you as the smell inside was incredibly bad and you landed in what was a mixed of chewed up plants and whatever else the creature ate throughout the day...After you landed in your stomach, you try to get a hold of your equipment, only for the creature to grunt and belches out your gunk covered equipment...well that's great, how are you going to fight anything now?!?<br>\r\n<br>\r\nAs you sit around pondering, you decided to eat some of the fruit that hasn't been digested yet, and noticed that you wouldn't have much trouble staying in this stinking gut...though you didn't want to do that...You then hear another rumble...</span></div></div>",
            "created":1557032400,
            "id":2655641,
            "title":"You trip and fall right into it's open maw!"
        },
        "1553322242114":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it some creature you have never heard of before?</span></div></span></div>",
            "created":1557032400,
            "id":2655639,
            "title":"Another monster?"
        },
        "15533222421141":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>(The following description is an option. At the end you can choose to accept or deny this creature.)<br>\r\n<br>\r\nA strange creature bursts out of the lake startling you, making you stumble backwards. It's front legs land on the edge of the lake it starts to walk out of the water. It is huge. If you had you guess, you'd say it is 12 feet from ground to top of it's back and about 28 feet long from nose to the tip of it's tail. It has a similar body shape to a dragon, but without wings. It also has fur that looks similar to a otter's designed to make the creature sleek and fast in the water. It's underbelly is while while it's back is black, like an orca. It's tail looks thick and powerful. Right now it doesn't seem to have noticed you yet and continues to walk forward out of the water. You can see the water drip off of it quickly, becoming dry in moments. As it gets closer you can see it's well defined muscles. It looks like you'd provide no challenge to it but you don't know what to do. It would probably kill you upon noticing you.<br>\r\n<br>\r\nDo you like this creature?</span></div></div>",
            "created":1557032400,
            "id":2655651,
            "title":"Yes"
        },
        "155332224211411":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You try to get behind the strange creature",
                "You try to approach it through the front",
                "You try to avoid getting stepped on!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You didn't understand the creature in front of you and try to avoid getting trampled as it moves towards you!</span></div></span></div>",
            "created":1557032400,
            "id":2655656,
            "title":"Yes"
        },
        "1553322242114113":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>When you stumbled back you tripped over a rock and land hard on your back. You are stunned for a moment but fortunately regain your senses not too long afterwards. Unfortunately though, the creature still hasn't noticed you and continues to walk forward. You watch in horror as it lifts a paw larger than your whole torso and positions it above your prone form. It starts to move down towards you. You have to move now or risk getting crushed. You prepare yourself to roll to your right which would put your underneath the creature but you think that if you are there, you might have a lower chance of being spotted by it. You start to roll over. Are you able to avoid the paw?</span></div></div>",
            "created":1557032400,
            "id":2655679,
            "title":"You try to avoid getting stepped on!"
        },
        "15533222421141131":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>You throw yourself over to your right, narrowly avoiding the creature's huge paw. You lay still underneath the creature, facing upwards, as it continues to walk, oblivious to your presence. It is moving at quite a slow walk so it takes a while but eventually you are underneath it's tail and are almost able to stand up and run to get as far away from the monster as possible. As you watch the creature's underside go past and it's tail swooshing from left to right, you notice the creature's genitals. Is the creature male or female?</span></div></div>",
            "created":1557032400,
            "id":2655680,
            "title":"Yes"
        },
        "155332224211411312":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Anus",
                "Vaginal opening",
                "her tail",
                "The back of one of her paws"
            ],
            "content":"<div class=\"\"><div> <span>You notice the creature has female genitals and blush a little as it had a vaginal and anal opening. As you keep trying to avoid getting yourself crushed, the creature suddenly stops for something, causing you to trip and soon landing on something as she seems to be distracted by something.<br>\r\n<br>\r\nWhen you open your eyes, you notice that you landed on her...</span></div></div>",
            "created":1557032400,
            "id":2655682,
            "title":"Female"
        },
        "1553322242114113123":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Friendly",
                "Cruel"
            ],
            "content":"<div class=\"\"><div> <span>Your foot goes into a small dip in the ground, causing you to trip and land on the upper portion of her tail before you slide down onto the tip of it. The fur on her tail is fluffy and warm, as well as very soft. But, you don't have much time to appreciate the feeling of it as the creature freezes. You know something bad is about to happen so you try to slowly stand up, ready to bolt. You don't get very far though as she quickly wraps her tail around your waist, holding you in place firmly. She draws her tail between her hind legs and under her belly before standing up on her hind legs and carefully falling backwards, her body rolling down to the ground. You are surprised by her grace and ease of movement. This monster far outclasses your, and anyone else you know of's, abilities. You know you have no hope of defeating this creature. She holds your body above her with her tail. She looks at you curiously, cocking her head to the side a bit as she studies you. You can see a hidden intelligence behind her dark eyes. This scene would look cute if only she wasn't so big and your eminent death didn't hang over you like a dark cloud. You struggle a bit but there is no hope of you breaking out of her grasp. All you can do is pray for a quick and painless death as you wait for her to make her move. Is she...</span></div></div>",
            "created":1557118800,
            "id":2656068,
            "title":"her tail"
        },
        "15533222421141131231":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Lowers you down to her hip area",
                "Brings you up to her face",
                "Places you into a paw"
            ],
            "content":"<div class=\"\"><div> <span>She leans up a bit and sniffs at you before giving your body a few licks. You then hear what sounds like faint purrs as you blush and wiggle more within the tail. You notice the creature standing right back up on her hind legs and looks over you curiously before she...</span></div></div>",
            "created":1557118800,
            "id":2656157,
            "title":"Friendly"
        },
        "155332224211411312312":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "She had turned around and is going back to her den underneath the lake.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>She lifts you up towards her face, you struggle more as you get closer. Soon you are eye level with her, she had to lower her head a bit to get there. She slowly opens her mouth and gives you a long lick with a tongue wider than your head is. She places your body up to your knees inside of her mouth before she goes back down on all fours and continues to walk. Her mouth is humid and wet. The creature's breath smells a bit of fish but isn't too unbearable. Her tongue shifts around underneath your body. You struggle inside her mouth a bit, trying to get her tongue away from you and her saliva out of your mouth but it is an exercise in futility, after a couple of minutes you resign to your fate and lay limp inside of her mouth. She is taking you somewhere but since you can't see outside of her mouth, you have no idea where she is taking you. But the creature knows. Where is she taking you?</span></div></div>",
            "created":1557118800,
            "id":2656210,
            "title":"Brings you up to her face"
        },
        "1553322242114113123121":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "She was lowering you towards an area under her tail",
                "She was dropping you into her paws",
                "She decides to swallow you down to keep you safe in her fish filled belly..."
            ],
            "content":"<div class=\"\"><div> <span>You notice her closing her maw tight before you hear loud splashing from outside. The smell of fish inside of her maw gets stronger as she swims back to what you think is her den. You nearly gag as the stench is starting to get to you as more of the thick saliva keeps covering your body as she swims. Eventually, you hear some more splashing, but think there is a bit of an echo as you think she has arrived at her den. You try to cling to her tongue as she slowly...</span></div></div>",
            "created":1557118800,
            "id":2656218,
            "title":"She had turned around and is going back to her den"
        },
        "15533222421141131231212":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Stay",
                "Escape"
            ],
            "content":"<div class=\"\"><div> <span>She had stood up onto her hind legs and lifted her front paws up to catch you as you side off her tongue. You lose your grip and let off a small, and not at all manly, yelp of terror as you fall... for all of 2 feet. You land in her soft paws. She closes her maw and stares down at you as you wipe off her saliva and start to look around what might end up being your new home. It is strange, you know from your legs being wet that she went underwater, yet her cave is completely dry and you cannot see any point of entry, at least from where you are now. The creature suddenly lifts you up onto her slightly bent neck as she lowers herself back down to all fours and starts to walk deeper into her den. <br>\r\n<br>\r\nHer fur surprises you again with the speed that it dries at, it is already devoid of any water and is soft, a royal family would pay a small fortune to buy this creature's fur for clothing and pillows and the like. Too bad you have such a small chance of escaping, much less killing the beast, that the chance might as well be 0. You lay down on the creature's back and think about all of the mistakes you made to get to this point, this must be the way some cruel god is punishing you for some sin you did a while back. <br>\r\n<br>\r\nSoon the creature stops. You sit back up and see that she is standing in a large nest of sorts. Three of her could fit in there quite comfortably, which means that the nest is huge for you. You barely see over the edges of it. She uses her tail to pick you up and place you in the nest before she herself lays down in there, curled slightly with the curve of the edge of the nest. She looks at you for a bit before closing her eyes, slowly drifting off to sleep.<br>\r\n<br>\r\nYou sigh and look around, wondering what you next move should be. From what you can tell, you really only have two options. You can't attack her as your weapon is most likely laying around in the dirt somewhere on the surface so that leaves two things you can do. One you can stay with her, hoping that small act will help you gain her trust and hopefully she will let you live, and two, you can try to make your escape while she is sleeping.</span></div></div>",
            "created":1557118800,
            "id":2656230,
            "title":"She was dropping you into her paws"
        },
        "155332224211411312312121":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Sleeping under her tail",
                "Staying between her hind legs",
                "Sleeping right up against her chest"
            ],
            "content":"<div class=\"\"><div> <span>Despite your best judgment, you decided to stay with this strange creature and go back to the sleeping creature. You shiver as you start to get cold and look for a place to rest before you decide to crawl in between her hind legs. You feel a bit of warmth coming from her massive body as she slumbers quietly. You gently nudge yourself in between the legs and look at both of the inviting holes as you rest in between her hind legs...<br>\r\n<br>\r\nAfter some time, you felt more chills and you decided to move towards...</span></div></div>",
            "created":1557118800,
            "id":2656244,
            "title":"Stay"
        },
        "1553322242114113123121213":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "She is not there anymore and you are laying in her empty nest.",
                "She is still there curled around you."
            ],
            "content":"<div class=\"\"><div> <span>You slowly crawl besides her, moving up to her chest. As you near her chest, she unconsciously grabs you with her front paws and presses you gently into the warm fur covering her chest. She curls up around you. You hope that you've made the right decision as it is impossible for you to attempt an escape now that you are held onto by the creature. Not that you mind your current situation. She is nice and warm and the fur is soft and smooth. You feel her chest expanding in and out with her breath. All of these factors, the softness of her fur, the warmth, the gentle expanding and contracting of her chest slowly lulls you to sleep. When you wake up you discover..</span></div></div>",
            "created":1557118800,
            "id":2656263,
            "title":"Sleeping right up against her chest"
        },
        "15533222421141131231212132":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You remain in her paws...",
                "You try to crawl out and look between her hind legs",
                "You try to crawl out and look around in her den..."
            ],
            "content":"<div class=\"\"><div> <span>You wake up and blush a bit as the giant creature was still curled up around you. You do notice that her grip on you is not that strong and can wiggle out of it now as she sleeps. Though, if you do crawl out, you will get chilled again in this chilly cavern. You look down at her hind legs and notice they have been spread out a bit, exposing her bits again as you stay put in her paws and decide what to do...</span></div></div>",
            "created":1557118800,
            "id":2656270,
            "title":"She is still there curled around you...."
        },
        "155332224211411312312121322":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><div> <span>You squirm a bit and slip down out of her grip. You crawl backwards down her body until you are in between her hind legs. You turn around so that you can see her two holes better.  You look into them. They are both huge. Her anus is as big as your face and her vulva way bigger than that. You brush her vulva a bit and it flairs open just a bit. A rush of warm air comes out of it, hitting your face. It actually smells kind of sweet in there. You look from her vulva to her anus. You realize that since she is asleep, you could easily take a look inside of her. Do you?</span></div></div>",
            "created":1557205200,
            "id":2656486,
            "title":"You try to crawl out and look between her hind ..."
        },
        "1553322242114113123121213221":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "She wakes up with you still inside of her",
                "You wake up while she is still asleep",
                "You wake up later and decided to look at the other hole..."
            ],
            "content":"<div class=\"\"><div> <span>You get a bit curious and decided to take a peek inside of her vulva. The smell inside of it is much more intense. You blush a bit and soon start to push yourself into it, feeling at the moist walls as the smell kept hitting you in the face. Eventually, you reach a roomy chamber where the heat is comfortable enough to stay in. You decided to curl up here and close your eyes for a bit...<br>\r\n<br>\r\nLater....</span></div></div>",
            "created":1557205200,
            "id":2656496,
            "title":"Yes"
        },
        "15533222421141131231212132211":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "She decides to go and get some food.",
                "She waits for you to wake up."
            ],
            "content":"<div class=\"\"><div> <span>She wakes up with a large yawn but soon realizes that you are nowhere to be found, she looks for you frantically, worried that you might've attempted an escape but soon feels a light weight in her lower belly area. She chuckles to herself, realizing that you had found your way inside of her while she was still asleep. She decides to leave you there as she was planning on doing that to you anyways at some point.  She leaves her nest and decides what she is going to do next.</span></div></div>",
            "created":1557205200,
            "id":2656577,
            "title":"She wakes up with you still inside of her"
        },
        "155332224211411312312121322111":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "She is still hunting for food",
                "She was waiting for you to come out",
                "She was eating something as you poke out",
                "She was asleep on the beach"
            ],
            "content":"<div class=\"\"><div> <span>You are jostled awake by some movements, unaware that she is out of her den looking for food. You get tempted to leave her body, but worry about not only getting stepped on, but the warmth inside of her is very comforting. You feel the walls tighten up at times as she seems to be catching up to some prey. After several moments of her being still, you crawl towards the opening and stick your head out to see...</span></div></div>",
            "created":1557205200,
            "id":2656750,
            "title":"She decides to go and get some food"
        },
        "1553322242114113123121213221114":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Escape",
                "Stay"
            ],
            "content":"<div class=\"\"><div> <span>You see sand right in front of your face. It seems like she is laying down on a beach. You squirm and struggle, eventually pulling yourself out of her vagina. You flop down on the ground, exhausted. After regaining your breath, you move out from under her tail and stand back up. You are soaked by her juices so you discard your ruined armor, hoping that your proximity to such a powerful creature will deter others from attacking you. You take a quick dip in the water to get clean before moving back to the creature... you really have to come up with a name for her. You can't keep calling her a creature anymore... well you can figure that out later. You look over her sleeping form, she is as cute as always, you blush a bit due to the embarrassment you have with thinking about her in such a way. You rub her muzzle a bit as you think about your next course of action. This might be the best chance you have to escape her, but without your armor and weapon, you are little more than a free meal to the creatures in this area. Or you can stay with her for a bit longer. Maybe you could convince her to explore the forest a bit more with her and help you return home.</span></div></div>",
            "created":1557205200,
            "id":2656761,
            "title":"She was asleep on the beach"
        },
        "15533222421141131231212132211142":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "She wakes up with you still inside of her rear",
                "You get pushed back out of her rear at some point",
                "You slide back out of her rear in your sleep"
            ],
            "content":"<div class=\"\"><div> <span>You figured it would be too dangerous to go out alone into the wild without your armor and weapon and decided to stay with her a bit longer...the air outside on the beach is a bit chilly and coaxes you to go back towards her tail. You gulp and decided to try going into her anus and push a bit into her rear. The air inside is a bit musky, but you push on and press yourself up against the moist walls as you gently take in the smell, hearing some faint moans from outside as you get comfortable inside of the massive creature's rear...</span></div></div>",
            "created":1557205200,
            "id":2656769,
            "title":"Stay"
        },
        "155332224211411312312121322111423":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A question before we continue, is she still asleep when you eventually wake up?</span></div></span></div>",
            "created":1564117200,
            "id":2692771,
            "title":"You slide back out of her rear in your sleep"
        },
        "1553322242114113123121213221114231":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "You try to escape.",
                "You stay where you are."
            ],
            "content":"<div class=\"\"><div> <span>You wake up feeling warm fur pressing against your back and soft paws pulling you closer. Your head on the other hand is in a humid area and seems to be soaked in some sort of liquid. A large, soft, and squishy appendage is stroking the back of your head as you slowly become more lucid. Once you fully come to, you open your eyes and look around. It is very dark except for the little light that is coming in near your chest. With that light you notice the teeth that are pressing lightly into you, though fortunately they aren't piercing your skin. You slowly come to realize that you must've slid out of her rear as you both slept and she must've unconsciously positioned you in the way you find yourself in now. You are in quite the predicament. Since she is asleep while she is sucking on you, she might bite you on accident. Upon realizing this, you struggle a bit to get free, preferring yourself whole than in two parts. But when the creature groans in her sleep and her tongue moves to try and keep your head inside of her mouth while she starts to suck harder on you, treating you like a big lollipop you rethink your decision and freeze. If you try to escape, she might wake up and accidentally bite you then too. This is starting to seem hopeless for you. You have to do something though, even if that something is doing nothing and hoping she wakes up soon.</span></div></div>",
            "created":1564117200,
            "id":2692786,
            "title":"Yes"
        },
        "155332224211412":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a hybrid creature like a dragphon (A cross between a dragon and a griffin)</span></div></span></div>",
            "created":1590677760,
            "id":2842195,
            "title":"No"
        },
        "1553322242114121":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "You are smothered under it's balls",
                "It smothers you under it's ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You spot a dragphon on the path, and it has seen you! It is charging at you full speed and suddenly </span></div></span></div>",
            "created":1590678000,
            "id":2842197,
            "title":"Yes"
        },
        "15533222421142":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a centaur?</span></div></span></div>",
            "created":1566622800,
            "id":2707023,
            "title":"No"
        },
        "155332224211421":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While walking on a dirt path in the middle of the night, you decided to explore the forest a bit. You were caught off guard when you were knocked down by a centaur. Upon closer inspection, you could it was a</span></div></span></div>",
            "created":1566622800,
            "id":2707027,
            "title":"Yes"
        },
        "1553322242114211":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "He swallows you with his dick",
                "He made you his living buttplug/toilet paper"
            ],
            "content":"<div class=\"\"><div> <span>You were taken aback by the size of his butt cheeks. They were the size of boulders! Your thoughts were suddenly interrupted as he trotted to you, as you were still knocked down on the ground. He then stopped and SLAMMED his rump onto your face. The smell was 10 ten times worse than anything you could think of. He snickered and began grinding rubbing his booty up and down your face. You were literally a centaur's living butt scratcher. <br>\r\n<br>\r\n\"You are not the first human who I have chosen to put in their rightful place, also known as my perfect ass. In fact, I have introduced 8,000,000 people to my bum. You are the 8,000,000,1st. And you will be seeing them all! Now!\"</span></div></div>",
            "created":1566622800,
            "id":2707042,
            "title":"Male"
        },
        "155332224212":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "seasaur?",
                "Lleviathan?",
                "Another monster?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of the beasts do you encounter while at the lake?</span></div></span></div>",
            "created":1557032400,
            "id":2655535,
            "title":"Fully"
        },
        "1553322242121":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Approach the one that is sleeping",
                "You go towards the one eating the fish",
                "You take too long and one of them attacks!",
                "Something else happens..."
            ],
            "content":"<div class=\"\"><div> <span>As you are going along the beach, you notice a couple of monsters, both of them being Seasaurs! You notice one of them is actually awake, eating some of the fish it has caught, and the other is sound asleep! You think that you could easily take out the one sleeping, but worry that the other one might be alerted if you try...<br>\r\n<br>\r\nAfter a few moments of deciding, you...</span></div></div>",
            "created":1557032400,
            "id":2655563,
            "title":"seasaur"
        },
        "15533222421211":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You get tempted and look under it's tail",
                "You manage to climb onto it's back and take it out in it's sleep!",
                "The creature wakes up before you could do anything!",
                "The other one notices and attacks you!"
            ],
            "content":"<div class=\"\"><div> <span>You think that it's best to try to attack it from behind. You start to go around behind the massive creature, looking over it's back, and as you go around, you notice it's thick tail has moved to the side, exposing it's massive pucker. You cringe looking at it and try to climb onto the back of the creature, trying to ignore the inviting looking pucker on the massive creature...</span></div></div>",
            "created":1557032400,
            "id":2655573,
            "title":"Approach the one that is sleeping..."
        },
        "155332224212111":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You stay stuck as the creature goes back into the sea after farting trapping you",
                "You get pushed back out with a horrible fart!",
                "The creature realieves itself, pushing you out in the process",
                "As it swims, you sink deeper into the filth..."
            ],
            "content":"<div class=\"\"><div> <span>Despite the horrible smell coming from it's rear, you decided to get curious and look under it's tail. You almost gag as you move the tail a little to shine some light on the pucker. You then rub across the slimy surface, cringing as you feel the thick grime on it, occasionally picking off fish bones from the surface. You then feel some warmth from further in and decided to push your hand in deeper, grunting as you hear a squishing noise as it sinks in. The warmth inside is comforting in comparison to the cool, sea air and you decide to push your other hand in as well...that was a big mistake! The creature groans out in his sleep and decides to clench, quickly pulling you in within a few clenches. Inside, darkness surrounds you as a horrible smell fills your nose as the warmth inside surrounds you. The walls are covered in thick slime, and it reeks of rotting fish in here! As if that wasn't bad enough, the creature moans out and farts out the air that slipped in with you! The warmth is enough to keep you in the bowels, but you shouldn't stay in here too long unless you want to live in the bowels of a deep sea creature...</span></div></div>",
            "created":1557032400,
            "id":2655579,
            "title":"You get tempted and look under it's tail..."
        },
        "1553322242122":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You end up getting swallowed by the whale!",
                "You try to swim around the whale!",
                "It simply rams into you for some reason",
                "You managed to get back to shore in time!"
            ],
            "content":"<div class=\"\"><div> <span>You decided it swim out a bit into the lake, seeing if there was anything like a boat or something to cross the lake...unfortunately, you do find something, but it wasn't pleasant! You came across a whale like monster called a Lleviathan that was enormous! It spots you and starts to swim towards you! You need to think of an action fast before you end up being fish food!</span></div></div>",
            "created":1557032400,
            "id":2655587,
            "title":"Lleviathan?"
        },
        "15533222421221":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You stick around for a bit inside of the whale's stinking gut!",
                "You try to get out through it's mouth!",
                "You try to go out...through the back door...",
                "You find something in a pile of fish in the darkness..."
            ],
            "content":"<div class=\"\"><div> <span>Despite your attempt to flee, you weren't exactly fast enough to avoid it. As the whale opens it's mouth, a strong current of water starts to pull you in, pulling you into it's huge maw! You were worried that the whale would bite down on you, but end up going straight towards the throat and being swallowed whole! As you slip through the slimy tunnel, you land inside a large chamber and land on top of a pile of fish, with some fish that are still alive and flopping! You cringe as you were covered heavily in the fishy slime as the whale belches out the air that came in with you! Even though it's quite warm inside of the whale, you get a bit hungry and decided to eat some of the fish that hasn't been digested yet...you begin to worry that you would end up being a belly pet to this huge whale if you don't get out soon...</span></div></div>",
            "created":1557032400,
            "id":2655593,
            "title":"You end up getting swallowed by the whale!"
        },
        "15533222422":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it an aerial beast?</span></div></span></div>",
            "created":1557637200,
            "id":2658914,
            "title":"No"
        },
        "155332224221":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it a Roc?</span></div></span></div>",
            "created":1557637200,
            "id":2658917,
            "title":"Yes"
        },
        "1553322243":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "eyevory tusk-tusk",
                "Flatulent ferret",
                "Another monster?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe one of these?</span></div></span></div>",
            "created":1557032400,
            "id":2655544,
            "title":"no"
        },
        "15533222433":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the monster from another time? Like from the past or from the future?</span></div></span></div>",
            "created":1557291600,
            "id":2657146,
            "title":"Another monster?"
        },
        "155332224331":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Past",
                "Future"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one? The past or the future?</span></div></span></div>",
            "created":1557291600,
            "id":2657147,
            "title":"Yes"
        },
        "1553322243311":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the monster some sort of dinosaur?</span></div></span></div>",
            "created":1557291600,
            "id":2657149,
            "title":"Past"
        },
        "15533222433111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it a T-rex?</span></div></span></div>",
            "created":1557291600,
            "id":2657150,
            "title":"Yes"
        },
        "155332224331111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You take a couple of steps back as you see a colossal T-rex emerge from the forest. This T-rex is huge. It is about 8 meters tall and 26 meters long, big enough to swallow you whole without a second thought. You take another step back and ready your sword as it approaches. You don't have a clue as to how you will beat this beast. It's head swivels from side to side, nostrils flaring as it continues to approach. For each step it takes forward, you take one back. But due to the size difference, it doesn't take long before it is practically on top of you. You gulp and hope that the beast doesn't notice you. Does it?</span></div></div>",
            "created":1557291600,
            "id":2657202,
            "title":"Yes"
        },
        "1553322243311111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Friendly.",
                "Cruel."
            ],
            "content":"<div class=\"\"><div> <span>The T-rex takes another step before freezing. You freeze as well, praying that the creature hadn't noticed you but it is all for naught. The T-rex takes one more step forward and, in a surprising display of speed and dexterity, whips it's whole body around to face you. You turn around to be greeted by a massive head right in front of you, the eyes affixed to it staring at you. You stumble backwards, tripping and falling. You crawl back a bit as the beast takes another step forward. You close your eyes and prepare for the worst. Is the T-rex friendly or cruel?</span></div></div>",
            "created":1557291600,
            "id":2657203,
            "title":"Yes"
        },
        "15533222433111111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Male",
                "Female."
            ],
            "content":"<div class=\"\"><div> <span>The T-rex gives you a small lick, it doesn't seem like a tasting lick so the T-rex might be friendly, at least for now. You stand up and the T-rex does too, looking down at you, watching your every move. You start to check the T-rex out and it lets you, further cementing your idea that it is probably friendly. When you get to the T-rex's hind legs, you look up to check it's gender but you can't really tell due to the fact that it's slit could be a cock slit or a vagina. For better or for worse, it seems like the T-rex knows what you are trying to do and crouches down to show you their gender. As it  gets closer to the ground, you become tense, worried that the T-rex could crush you at any moment. The T-rex does stop well before then and you can finally see it's gender. Is it male or female?</span></div></div>",
            "created":1557291600,
            "id":2657213,
            "title":"Friendly."
        },
        "155332224331111112":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>At first glace the T-rex seems to be female. After a few moments, the T-rex snorts and stands back up. She walks forward a bit, careful enough to avoid stepping on you but not careful enough to not cause small earthquakes that nearly make you lose your footing. She stops and lowers her tail so that it just barely touches the ground. She looks back at you, waiting for you to do something. And that something seems to be to get on her back via her tail. Do you climb her tail and onto her back?</span></div></div>",
            "created":1557291600,
            "id":2657214,
            "title":"Female."
        },
        "1553322243311111121":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You look over at the anus",
                "You look over at the slit",
                "The dinosaur nuzzles at you"
            ],
            "content":"<div class=\"\"><div> <span>With a bit of hesitation, you hope onto the back of the T-rex and the both of you move out. You hold on tight to the top of the dinosaur as she moves, the scales feeling very rough to the feel as you keep clinging on. You can also hear loud thuds on the ground as she runs across a field. Eventually the two of you get to a clearing and you slowly slide off of her tail. You also take another glance at the genital and dinosaur's pucker as you get back onto the ground...</span></div></div>",
            "created":1557291600,
            "id":2657221,
            "title":"Yes"
        },
        "15533222433111111212":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Lay down and continue to try and entice you.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>You walk underneath her in order to get in front of her. As you do so, you take a quick glance at her slit, blushing a bit before looking away. For some reason you can't help but wonder what it would be like inside of her. The T-rex seems to wiggle her rear almost mockingly, she must've noticed what you were looking at and you blush harder and start to walk faster. As you do so, she does something. What does she do?</span></div></div>",
            "created":1557291600,
            "id":2657225,
            "title":"You look over at the slit"
        },
        "155332224331111112121":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>She crouches and rolls over onto her side. She looks over at you and, with a small smirk, spreads her legs a bit giving you a clear view of her slit. She uses her tail to pull you a bit closer, almost as if she is prompting you to take a closer look. You oblige her and walk over to her legs, climbing up on top of the one that is on the ground and walking closer to her slit. Soon you are face to face with it. You tentatively reach a hand towards her slit and stick your fingers inside of it you can feel her soft vaginal walls as well as the imminence heat that is trapped inside of her. You pull her slit open a bit to take a look and side and are hit by a blast of warm and humid air, as well as a soft and sweet sent coming from deep inside her. Before you know what you are doing, your face is inches from her slit and you are taking in her scent. Do you enter her?</span></div></div>",
            "created":1557378000,
            "id":2657619,
            "title":"Lay down and continue to try and entice you."
        },
        "1553322243311111121211":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "She starts hunting for food",
                "She starts heading to another location",
                "You hear another monster growling"
            ],
            "content":"<div class=\"\"><div> <span>You get enticed and begin to push yourself into the slit of this ancient beast. The smell intensifies as you go deeper into the warm slit. You feel along the slick walls as you push yourself in deeper, soon curling up into a chamber as the moisture insides covers you up as you feel the ancient beast start to stand back up with you deep inside of her...</span></div></div>",
            "created":1557378000,
            "id":2657648,
            "title":"Yes"
        },
        "15533222433111111212113":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Vore.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>From inside of the T-rex, you hear another monster growl. You have no idea what it is, but you hope that it isn't too strong. But your worries are for naught. The growls come from a large Raptor, trying to act tougher than they look but failing as the T-rex turns around and looks at them. The T-rex seemed to have intruded on the Raptor's territory so the Raptor tried to scare them off. Unfortunately for the Raptor, the chances of scaring off the much larger dinosaur is next to none. The T-rex lunges at the Raptor and grabs them in their mouth, much to the dismay of the Raptor. They strugle in the T-rex's maw as she considers what she will do with the pesky dino.</span></div></div>",
            "created":1557378000,
            "id":2657655,
            "title":"You hear another monster growling"
        },
        "155332224331111112121131":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Oral",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of vore does she put the dino through?</span></div></span></div>",
            "created":1557378000,
            "id":2657659,
            "title":"Vore."
        },
        "1553322243311111121211312":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Unbirth",
                "Anal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other kind of vore?</span></div></span></div>",
            "created":1557378000,
            "id":2657662,
            "title":"Other"
        },
        "15533222433111111212113121":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "They are friendly.",
                "They are not quite so friendly."
            ],
            "content":"<div class=\"\"><div> <span>The T-rex clamps down a bit as she grins, eliciting a yelp from the Raptor. She lays down and curls up a bit to pass the Raptor in her mouth to her tail. The Raptor starts struggling harder as it realizes what the T-rex is planing on doing to it. The T-rex rolls over onto her back, drawing her tail back before plunging it and the Raptor deep into her vagina. Her head rocks back in ecstasy as she pushes the squirming dinosaur deeper inside of her. Eventually she presses the Raptor into her cervix and gives it one final shove before it goes into her womb. She removes her tail and rolls back over, shaking her head and standing up. <br>\r\n<br>\r\nInside her womb, you are face to face with the Raptor who seems just as surprised as you are. The Raptor is quite a bit bigger than you and is severely restricting the amount of space you have in her womb. How does the Raptor respond to someone else already being in their new home.</span></div></div>",
            "created":1557378000,
            "id":2657680,
            "title":"Unbirth"
        },
        "155332224331111112121131211":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "You find a vaginal slit, the Raptor is female.",
                "You find a cock slit, the Raptor is male."
            ],
            "content":"<div class=\"\"><div> <span>The Raptor seems to feel like you both are in this situation together so it acts friendly to you. It gives you a small lick before snuggling up against you. You smile and rub the Raptor's back, eliciting a purr from the dinosaur. You run one of your hands down the underbelly of the Raptor, toward's it's crotch area. You have to slide underneath the Raptor a bit more to reach but when you find it's slit, what do you find?</span></div></div>",
            "created":1557378000,
            "id":2657683,
            "title":"They are friendly."
        },
        "1553322243311111121211312111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Help",
                "Resist"
            ],
            "content":"<div class=\"\"><div> <span>Your fingers slip inside of somewhere damp and hot, you learn that the Raptor is female. You smile and keep rubbing her back. You can feel the T-rex running and jostling the both of you around inside of her womb. She is taking the both of you somewhere but you have no idea where she might be taking you. <br>\r\n<br>\r\nThe Raptor feels a bit stressed by being inside of an unfamiliar creature's womb and fidgets a bit, wanting to find a way to relax but unable to. You hug her, trying to comfort her but she is still a bit stressed. She takes matters into her own claws and turns around, laying down with her slit on top of your face. You are shocked by the sudden turn of events and you choke on the strong scents emanating from her. It looks like the Raptor's stress got the better of her and she decided to fall back on the old faithful way of dealing with it, pleasuring herself. She grinds herself down on your face, smothering you. Do you help her or resist her? </span></div></div>",
            "created":1557378000,
            "id":2657694,
            "title":"You find a vaginal slit, the Raptor is female."
        },
        "15533222433111111212113121111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Still inside of the Raptor.",
                "Outside of the Raptor."
            ],
            "content":"<div class=\"\"><div> <span>Deciding that it wouldn't hurt and might form a bond between the two of you, you oblige her and move your arm up and pushing it deep into her vagina. She purrs and moans grinding herself harder on top of you. Suddenly, your head slips inside of her vagina. She chirps in both surprise and pleasure. You squirm as this wasn't quite your intention, you only intended to fist her not get unbirthed by her. But it seems like you have no more say in the matter as she starts to suck you deeper into her vagina. Due to her much smaller size compared to the T-rex, it doesn't take nearly as long for your head to pop into her womb and for the rest of your body to follow. Soon, the Raptor is curled up, with a womb full of human. Since you both are now sharing the same space, the Raptor has much more room inside of the T-rex. The Raptor is exhausted from her exertion and soon drifts off to sleep. You follow suit due to the cramped, but not uncomfortable conditions you have found yourself in. When you wake up you find yourself...</span></div></div>",
            "created":1557378000,
            "id":2657698,
            "title":"Help"
        },
        "155332224331111112121131211111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "In a clearing where the T-rex has made her home.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>When you wake up, you are still inside of the Raptor. You can feel her walking around due to how you seem to be swaying as if you are in an hammock. You rub around her womb, trying to let her know that you have awoken. The Raptor notices and crouches down, slowly pushing you out of her womb and onto the ground. Soon you are laying on the ground underneath a large Raptor in armor that is pretty much totally ruined at this point due to all of the juices it has been lying in. You stand up and take a look around. Where are you?</span></div></div>",
            "created":1557378000,
            "id":2657704,
            "title":"Still inside of the Raptor."
        },
        "1553322243311111121211312111111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Another creature.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>You see the T-rex asleep a the edge of the clearing. You also notice a large pile of bones, presumably from creatures the T-rex has eaten that were to large for her to swallow whole. Some of the monsters were pretty huge, other bones were from creatures that you think you could recognize, and if they were from what you thought they were from, the T-rex has killed and eaten very powerful creatures. Some of those creatures were powerful enough that they could enslave entire cities and the humans would be powerless to stop them. You gulp and wonder how strong this T-rex is. Soon after you finish checking out what is most likely your new home until the day you die. The T-rex wakes up. And with a glance at you and the Raptor that sent chills down your spines and warned you both not to leave, she left the clearing to go get something. What does she go get?</span></div></div>",
            "created":1557378000,
            "id":2657707,
            "title":"In a clearing where the T-rex has made her home."
        },
        "15533222433111111212113121111111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the creature going to be food?</span></div></span></div>",
            "created":1557378000,
            "id":2657708,
            "title":"Another creature."
        },
        "155332224331111112121131211111112":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Big",
                "Small"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the creature big or small (compared to T-rex at least)?</span></div></span></div>",
            "created":1557378000,
            "id":2657709,
            "title":"No"
        },
        "1553322243311111121211312111111122":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Another Dinosaur",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of creature did she bring to the clearing?</span></div></span></div>",
            "created":1557378000,
            "id":2657711,
            "title":"Small"
        },
        "15533222433111111212113121111111221":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "A Raptor",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of dinosaur?</span></div></span></div>",
            "created":1557378000,
            "id":2657712,
            "title":"Another Dinosaur"
        },
        "155332224331111112121131211111112211":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What gender is the Raptor?</span></div></span></div>",
            "created":1557378000,
            "id":2657713,
            "title":"A Raptor"
        },
        "1553322243311111121211312111111122111":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "She wants to unbirth the two Raptors.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Some time later, the T-rex comes stomping into the clearing, with something quite obviously in her mouth. She makes her way over to you and the Raptor while you both are laying down together, you leaning against her side. She lowers her head and lets the Raptor she is carrying slide out of her mouth. The new Raptor shakily stands up, still in shock at what had happened to him and shakes his head. The T-rex closes her mouth and backs off. The new Raptor locks eyes with the female Raptor and it seems like they know each other. The Female Raptor stands up, letting you hit the ground with a thud, and walks over to the male. The rub their necks together and as you sit up, rubbing your head you realize something. These two Raptors are mates. The T-rex must've sought out the male Raptor by trying to follow the female's scent and managed to find her mate and bring him back here. You stand up and watch the Raptors continue to great each other, getting more frisky by the second. The T-rex is watching as well with an expression you can liken to a human grin on her muzzle. She is obviously thinking of something. What does she want to do?</span></div></div>",
            "created":1557378000,
            "id":2657716,
            "title":"Male"
        },
        "1553322243312":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the monster some sort of robotic being?</span></div></span></div>",
            "created":1557291600,
            "id":2657151,
            "title":"Future"
        },
        "15533222433121":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Is it the W-01V3 otherwise simply known as the Wolf? It is a large canine like robot, about 10 feet tall from the ground to the top of it's back. It's underbelly is black and smooth like rubber, made to expand and contract, while it's back, legs, tail, and head are made of shiny metal to protect the machine. It is mechanical but can also digest things into energy to keep it powered, or can store things in it's \"stomach\". They come in two genders, male and female, and can reproduce despite being machines.</span></div></div>",
            "created":1557464400,
            "id":2658017,
            "title":"Yes"
        },
        "155332224331211":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>You get curious about the strange canine and give it a look over. You weren't quite sure how this thing is alive and you aren't exactly familiar with this sort of technology. It's as if it was constructed by aliens and was left behind by a family of them or something...You also don't quite get how lightning is flowing through it without hurting this...thing...<br>\r\n<br>\r\nYou keep looking over this machine and as you get behind it, you notice it lifting up it's metallic tail, exposing itself, showing that this strange canine is a...</span></div></div>",
            "created":1557464400,
            "id":2658191,
            "title":"Yes"
        },
        "1553322243312112":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "orally",
                "anally",
                "Getting unbirthed"
            ],
            "content":"<div class=\"\"><div> <span>You see that this is a female canine as you see both, a pussy and a strange looking pucker. The robotic then leans down, keeping her tail lifted as her rear is pushed up more, showing off it's metallic rump cheeks. You didn't know what it wants, but decide to look over it more. For an odd reason, you lean in and sniff right under it's tail, and despite it being a machine or something, it has the same musky smell as an actual wolf. The rank smell from under the tail is strong, but it seems to be a bit alluring...after some time, you decided to enter the canine...</span></div></div>",
            "created":1557464400,
            "id":2658192,
            "title":"Female"
        },
        "15533222433121122":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Starts playing with herself as you settle in",
                "Start to \"hunt for food\" or something similar",
                "She starts to walk off with you in tow",
                "She encounters another monster with you inside."
            ],
            "content":"<div class=\"\"><div> <span>For some odd reason, you decided to look at her rear again and rub a hand over her pucker. You swore you just heard her moan as you keep rubbing on the pucker. As you keep rubbing it, you feel it relax and open up, allowing your hand to sink in, feeling a strong warmth from within. You blush to yourself and keep pushing your hand in further into the tight, rubbery walls as the warmth inside was starting to get to you. You then gulp and start to work yourself in, surprised at how stretchy this hole is. You hear the machine moan and pant as she feels you starting to push into her rear. After the first half of you push in, you felt something slick and soon feels the rest of you slide in as the machine clenches tight on you, enjoying your presence in her rear. After settling in inside of her rear, you pick up a potent smell and groan from it, rubbing at the slick insides some more...<br>\r\n<br>\r\nThe robotic canine outside...</span></div></div>",
            "created":1557464400,
            "id":2658194,
            "title":"anally"
        },
        "155332224331211222":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "She keeps digesting her food, occasionally playing with you",
                "She starts to push you back out...",
                "It catches sight of something else..."
            ],
            "content":"<div class=\"\"><div> <span>As you settle into your smelly home, you felt the robotic start to chase after something. The insides tighten up around you as you feel the canine go into a sprint. It doesn't take long before it catches something and begins to consume it. You start to ponder how it could sustain itself despite it obviously being a machine. As whatever it swallowed begins to squirm, the robotic canine let's out a belch as she sits down on her haunches to enjoy her meal. You feel more sludge gather on you as the smell builds up even more around you as she relaxes around her churning stomach...</span></div></div>",
            "created":1557637200,
            "id":2659036,
            "title":"Start to \"hunt for food\" or something similar"
        },
        "155332224331211223":{
            "author_id":"cymnio",
            "author_name":"Cymnio",
            "choices":[
                "The Robo-dog’s den",
                "Still in the plains, the Robo-dog got ‘tired’"
            ],
            "content":"<div class=\"\"><div> <span>As the Robo-dog begins to trot off to who knows where, you feel yourself sliding around a bit due to the oily fluid its anus is producing. You feel yourself turned around so that your face is now up against the anus of the Robo-dog, and begin to slip through as it runs to who knows where. Fortunately for someone, I’m sure, you don’t slide all the way out, instead only your head peeks out into the dusk as the dog continues running. At some point, the Robo-dog stops, with your head still hanging out of its ass. Where are you now?</span></div></div>",
            "created":1561352400,
            "id":2678199,
            "title":"To the den!"
        },
        "1553322243312112231":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You are pushed out in front of the male canine as he sniffs you...",
                "You are pushed out and pressed up against the male's rear...it's his turn now...",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>You had somehow ended up in the robotic canine's den. You groan and try to push yourself out as it was getting a bit cramped in the machine's rear. You then decided to look around and notice another robotic canine. You also notice that it has a...phallic object between it's legs meaning that it's a male. You eep and push yourself back inside the female's rear. Just as you do, the male machine goes over and sniffs at her rump, wagging his tail out of view....<br>\r\n<br>\r\nAfter a few minutes inside of her rear...</span></div></div>",
            "created":1561525200,
            "id":2679052,
            "title":"The Robo-dog’s den"
        },
        "15533222433121122312":{
            "author_id":"cymnio",
            "author_name":"Cymnio",
            "choices":[
                "Keep going, I’m still horny!",
                "I’m done here."
            ],
            "content":"<div class=\"\"><div> <span>You try to squirm away from the male Robo-dog, but after a bit the rubbery walls begin a folding motion, shoving you toward the anus. However, you don’t see any light at the end of the rubber tunnel, and realize that something was off. The female Robo-dog had shared the news of her new toy with the male, and was willing to share. So, the female pressed her ass up against the males’. The female closed her anus while the male dilated his open, and the female slipped her ass inside the males’, and started to push you out of her ass and inside the male’s. You are squirted out of one ass and into another. The male’s ass smells more like shit than the female’s, and you try to clamber back into the female’s, but her anus retracts from the male’s and the male’s clenches shut, barely allowing enough light to let you see the black rubber interior that is constantly secreting a brown, oily fluid which is making the shit-like smell. You accept that there is no escape through the anus after attempting to pry the rubber sphincter open and getting greeted with a metallic plate also blocking your exit, which you couldn’t move at all, and decide to explore your new surroundings. You venture deeper into the male Robo-dog, and the smell worsens until you reach a secondary sphincter which is where the colon would be normally. You manage to squeeze through it, and are assaulted with a huge pool of brownish-black liquid, the same liquid that the walls secrete. Upon further inspection of this chamber, the liquid is constantly secreted in tiny amounts by the wall as a sort of lubricant for something, and periodically a flow of much less viscous liquid emerges from the ceiling, more a gelatin than a liquid. As you attempt to carefully make your way around the pool of the gelatinous material, some of the material is dropped from the roof directly onto your head. You try to dust yourself off, but find that your arms are stuck to your sides, and your legs are pinned together. Suddenly, the gelatin begins to nonstop flow from the ceiling, dragging you up with it until your head is completely submerged. Somehow, you can still breathe, and the gel begins to flow out through where you originally entered, until the pool was just under its previous level. Then, the rubber walls begin to close in, until the gel is compacted tightly with your head just barely free, and it just stays like that. You have no clue what is going on, until more gelatin begins to fill the formerly large area. This gelatin is different, however. Instead of shit-brown, this new stuff is a dull grey. You begin to feel yourself being pushed out of the Robo-dog’s shit collection chamber and back into the rectum, where you are then coated with the grey sludge. You can feel your feet pressed up against the Robo-dog’s anus, and the female is licking inside his ass. You can tell because she is licking the brown sludge up, but the grey stuff clings to you. When she is done, you feel yourself go vertical, and are deposited into a small depression in the ground along with the grey stuff, which costs your torso entirely. You try to rise, but you are stuck fast, the grey goo has you stuck in a small indentation in the floor. You try to move different parts of your body, and you can move your head around, but when you put your arms up you found yourself unable to put them back down. Then, the two Robo-dog’s walk over, visibly pleased at your predicament. Then, they do something that you half-expected at this point, and each sat on one of your arms, and you could feel the disgusting slime inside of their asses. All you can hear from your position is the metallic grunts of pleasure from both Robo-dogs, and when they are finally done with your arms, the female moves to your feet and takes both into her ass. She begins to back up, and the grey slime stops sticking you to the ground, but still is stuck to you, once the Robo-dog’s ass is up to your waist. Your arms are forced to your sides by the goo, and are abruptly sucked into the Robo-dog’s greedy rubber anus. Once she gets to your head, she is panting heavily from exhaustion. She leaves your head outside her ass, as if to taunt you by hanging your freedom in front of your nose, but you know that escape is impossible with the body-controlling grey goo coating you. <br>\r\n<br>\r\nAnd so, you spend most of the rest of your life up to your head in a Robo-dog’s ass, occasionally being forced out to please them and to eat your meal of oily shit that they produce. You literally can’t refuse, as the male has complete control over your body with his grey slime.</span></div></div>",
            "created":1561611600,
            "id":2679592,
            "title":"The life of a new ass-slave"
        },
        "155332224331211223121":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You try to push back out, despite your weakness",
                "You stay inside a little longer, it's warm up the male canine's rear...",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>A week has gone by and you have yet to escape from the mechanical canines. You have also have yet to get used to the rank smell of the inside of their rears. Right now, you are stuck deep up the male's rear, covered in the oily sludge while a strong smell fills up the chamber you are in. You groan as you feel more sludge cover you as you sink deeper up his rear. You could try to push your way out of the mechanical canine's rear and resume your quest, or stay put. As you ponder this, your fresh air is pushed out and as you gasp for air, some of the sludge gets into your maw and forces you to swallow it down...</span></div></div>",
            "created":1561611600,
            "id":2679601,
            "title":"A week later..."
        },
        "1553322243312112231212":{
            "author_id":"cymnio",
            "author_name":"Cymnio",
            "choices":[
                "Something happens",
                "You are forever the glorified sex toy of these Robo-dogs "
            ],
            "content":"<div class=\"\"><div> <span>You start to find the warmth of the Robo-dog’s rear actually quite pleasing, and the grey sludge coating you was keeping the heat in. You find yourself stroking the rubber insides of the Robo-dog’s rear, eliciting lustful moans and the walls clenching down on your body gently, secreting more oily fluid the more you rub. When the chamber fills up, it clamps down on you and flushes the disgusting goop out, leaving you with a slimy grey blanket inside of the robotic canine’s rectum. You don’t mind the heat in the slightest, not like you could get out anyways, even if your face were to be pressed up against the rubbery ass, which it isn’t, due to the grey slime that coats you and allows the male Robo-dog full control of your body if he wants. However, he seemed to prefer your genuine affection over you being his lust puppet. However, if you tried to escape, all that would happen is the female Robo-dog would put you in her ass, and you would be forced to take a punishment of some sort, and the male would ensure that you did it, weather it be to massage her rubber rectum walls or eat her oil-shit. You figured this out pretty quick, and became accustomed to the male’s ass and his warmth. Occasionally, you would be plopped into the indentation and forced to both Robo-dog’s whims, usually using your arms as dildos for their asses while you were stuck fast to the ground. Once they were done, the male would put your feet in his ass, then slowly make his way up your body, often stopping at your neck. When this happened, you simply thought of him as a mobile sleeping bag. Your head was free, while the rest of your body was inside the rectum of the Robo-dog, being gently and slowly caressed by the rubber walls inside the rectum. You are completely satisfied with your new life as a glorified sex toy, getting sanctum inside the male’s comfortable ass much of the time. Does something happen, or are you stuck like this?</span></div></div>",
            "created":1561698000,
            "id":2679678,
            "title":"Give in"
        },
        "155332224331211223122":{
            "author_id":"cymnio",
            "author_name":"Cymnio",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are never able to escape the robotic dog’s asses in your entire lifespan. What else could’ve happened, you wonder as you are being sucked from ass to ass, covered in grey slime.</span></div></span></div>",
            "created":1561611600,
            "id":2679625,
            "title":"Possibilities"
        },
        "155333":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Approach it from behind...",
                "Approach it from the front..."
            ],
            "content":"<div class=\"\"><div> <span>You look over at the huge beast, and seeing that it has a furry tail, you assume it was a beast of sorts. However, before you could make anymore movements, the creature's wings unfurl as they stretch out. You couldn't place a name for it yet so you keep watching over it. Eventually, you get a good look at it and see that it was the new monster the village guards warned about.<br>\r\n<br>\r\nIt was a Spitzfire, or as you personally call it, the \"Wyvern Dog\". Based on what you heard, this was an incredibly tough monster...<br>\r\n<br>\r\nAfter watching over it for a long time, you chuckle at what the guards have said as the big creature scratches itself like a regular dog.<br>\r\nThis monster is just a dumb, overgrown dog!<br>\r\n<br>\r\nAll is left is decide where to attack it...</span></div></div>",
            "created":1535864400,
            "id":2542064,
            "title":"Encounter with a giant, canine dragon..."
        },
        "1553331":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You feel a rumble from further in...it was about to fart!",
                "It keeps on doing it's errands with you stuck in it's butt.",
                "You feel more gunk form on you, possibly for the beast to relieve itself again..",
                "It starts to get arounsed feeling you press up on the walls..."
            ],
            "content":"<div class=\"\"><div> <span>You think the best course of action would be to attack it from behind. You ready your weapon and start to sneak up on the giant creature. The giant canine seems to be distracted by it's own scratching for now as you get closer. However, just as you step on a twig, it snaps, causing the canine to get spooked and jumps up backwards. Unfortunately, that meant you got a front row view of the canine's butt and tail hole. The canine seemingly lands on it's butt unharmed...however, unknown to it, or for now anyways, you were shoved into the beast's rear...<br>\r\n<br>\r\nInside, the bowels reeked heavily of canine filth and you could feel some sludge getting into your armor and clothes..<br>\r\nOutside, you feel the big beast start scratching itself again despite you being stuck in it's butt...<br>\r\n<br>\r\nAfter a while... </span></div></div>",
            "created":1535864400,
            "id":2542092,
            "title":"Approach it from behind..."
        },
        "1553332":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You slowly approach the spizfire  from the front, planning to attack it head on. The spizfire  cocks it’s head, watching you as you approach it. As you approach it, you start to have second thoughts about killing the beast. It just looks too cute and cuddly to harm. When you get within 10 feet of it. It rolls over exposing it’s belly to you. It looks like it wants to be rubbed. It looks at you expectantly, it’s tongue hanging out of it’s mouth and panting. It growls at your sword as you approach. You have no idea what to do now. This couldn’t be the creature that attacked your village, it was just to friendly. Do you still attack it?</span></div></div>",
            "created":1536555600,
            "id":2545903,
            "title":"Approach it from the front..."
        },
        "15533322":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Rub her belly.",
                "Enter her anally",
                "enter her pussy",
                "enter her orally"
            ],
            "content":"<div class=\"\"><div> <span>You lay down your sword and walk around the spitzfire. When you get to it’s rear, you note that it’s female. As you step over her tail and prepare to climb on top of her, you pause. Her anus and gaping pussy seemed strangely inviting, you almost want to clamber into them and sleep within her. You look up and see her looking at you, mouth partly open. She then yawns, giving you a nice look into her maw. She then closes it and cocks her head. From the brief look into her maw you got, you had to say that it looked inviting as well. There are so many options. What do you do?</span></div></div>",
            "created":1536555600,
            "id":2545905,
            "title":"No"
        },
        "155333221":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Indulgen the spitzfire and enter her body?",
                "Keep rubbing. You aren’t ready to trust her that much yet."
            ],
            "content":"<div class=\"\"><div> <span>You decide that no matter how cute and friendly she is, you shouldn’t ever ended her body. She was still a monster, you have no idea what she’d do when she has full control over your body. You climb onto her belly, accidentally brushing her pussy, she moans at the sudden contact in her sensitive spot. When she sees that you are not going to be climbing into one of her holes, she gets visually upset for a moment, wishing that you had. But that all went away as you start to rub her belly, replaced by a goofy grin, her tongue hanging out. She squirms around a bit as you rub her belly. This is hard work so are almost baking in your armor. You stop for a bit to take it off and the spitzfire is confused as to why you stopped, she cocks her head as she watches you take off your breastplate. When you take off and toss it to the side she examines you closely, seeing you half undressed only makes her want you inside of her even more. As you rub, you start to have similar thoughts. You kinda want to be within her as well. The spitzfire seemed so tame that there is no way she’d hurt you. Do you:</span></div></div>",
            "created":1536642000,
            "id":2546552,
            "title":"Rub her belly."
        },
        "1553332212":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Stay",
                "Leave"
            ],
            "content":"<div class=\"\"><div> <span>You shake your head and continue to rub her belly. The spitzfire is disappointed that you still won’t go inside her, despite how obvious you seem to want to. She decides that she’ll wait for the right time. The time when you are willing to do it as you seem to be right on the edge of submitting to her. She enjoys your rubbing until you get tired and slide off of her, coming to a rest at her side. She curls around you and nuzzles you. You rub her muzzle for a bit before deciding that it has gotten late and you should go home. You stand up and get your armor. When you’re about to leave, the spitzfire whimpers at you, begging you to stay. You stop for a moment to consider it.</span></div></div>",
            "created":1536728400,
            "id":2546880,
            "title":"Keep rubbing. You aren’t ready to trust her t..."
        },
        "15533322121":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "You do it.",
                "You don’t do it."
            ],
            "content":"<div class=\"\"><div> <span>You look outside and it’s pretty dark out. You should probably stay so you don’t get attack while going home. You walk back to the Spitzfire and take off your armor. You sit down against the spitzfire who is now on her belly and she curls around you keeping you warm. She licks you once before falling asleep. You chuckle and look back at her before going to sleep as well. In the morning you realize that the spitzfire is already up and is standing in front of you, hind end raised in the air and tail lifted suggestively. She is looking over her shoulder, hoping you will finally enter her like she wants you to.</span></div></div>",
            "created":1536814800,
            "id":2547275,
            "title":"Stay"
        },
        "155333221211":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "She starts to let rip, relieving some pressure...",
                "She takes off into the skies with you in tow!",
                "You hear growling, she apparently ran into another monster",
                "You hear growling, along with some clanging swords..."
            ],
            "content":"<div class=\"\"><div> <span>Despite your best judgments, you get too tempted and soon start to push yourself into her tail hole. You hear her growling out in pleasure as you sink in, taking in the deep smell as you feel some nasty sludge start to cover you. After you slip yourself in, you feel her clench hard, starting to pull you deeper into her rump, pulling you further in until you feel more sludge covering you. After you get yourself situated, the smell builds back up and you feel her start to move, happy with a new toy in her rear.</span></div></div>",
            "created":1550552400,
            "id":2620037,
            "title":"You do it."
        },
        "155333222":{
            "author_id":"samueliscool",
            "author_name":"Poi Yo",
            "choices":[
                "She squeezes you out.",
                "She keeps you in her."
            ],
            "content":"<div class=\"\"><div> <span>You look at the rear of the Spitzfire with intrigue, taking of your armor so that the metal plating will not get stuck inside of her. The Spitzfire does not seem to notice your infatuation with her rear end, instead she is still laying on the ground, rubbing her back against the dirt.<br>\r\n<br>\r\nAfter taking off your armor, you decide to approach the puckered ring, and slowly put your hand in it, which causes a high pitched whimper from the Spitzfire, and then a low groan. You feel the anal hole press onto your arm, sucking it in a little bit, as you put in your other hand into the muscly cavern. The Spitzfire soon flips herself to where she is on her belly, which causes you to flip onto your back yourself, and sucks your arms into her back end.<br>\r\n<br>\r\nYou feel a sudden shift of gravity, as the Spitzfire lifts her butt into the air, allowing you head and shoulders to be sucked in due to gravity. You now start to notice the bad smell all around you, as you descend deeper into her anus, having your torso sucked in as well. It smells like rotten meats and, well, feces, but it also feels very warm and inviting in there as well. You hear a giant moan from the Spitzfire, as your hips and legs slide in in one fell swoop, only leaving your feet outside of the creature's hungry butt.<br>\r\n<br>\r\nYou start to rub the inside of the anal walls, causing her to release a fart, and suck you all the way inside of her. Soon, you feel a shift in position, as the Spitzfire returns to laying on her back, shaking you a little in her anal walls. You start to rub the walls, giving pleasure to the Spitzfire as she lays down. You soon, yourself, give yourself some rest, hearing the calming heartbeats of the Spitzfire, and feeling the warmth of her ass.<br>\r\n<br>\r\nA few hours passes, and you awaken, still inside of the Spitzfire. Now back to your senses, you realize that being inside the giant dog-dragon's rump is not such a good idea after all, since she is still a wild beast. You start to shuffle your way towards the anus, which wakes the Spitzfire, and feels you trying to leave her butt.<br>\r\n<br>\r\nWhat does she do?</span></div></div>",
            "created":1557637200,
            "id":2659051,
            "title":"Enjoyment"
        },
        "1553332222":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You try again to slip back out...",
                "She starts to push you back out...",
                "You feel something thick start to cover you..."
            ],
            "content":"<div class=\"\"><div> <span>She feels you try to slip back out and lifts her rear back up to pull you back back into her bowels. As you sink back in, another fart slips out as you sink back into your current home. You feel some gunk start to cover you as you settle back in her bowels as she curls back up, moaning out happily at her new butt toy. Inside of her, you feel more gunk covering you as the only thing you can breathe in is the gas inside of her bowels.<br>\r\n<br>\r\nLater...</span></div></div>",
            "created":1557637200,
            "id":2659054,
            "title":"She keeps you in her."
        },
        "15533322223":{
            "author_id":"cymnio",
            "author_name":"Cymnio",
            "choices":[
                "Try to escape, you don’t like this anymore",
                "Stay, you enjoy the rectum in all its slimy glory"
            ],
            "content":"<div class=\"\"><div> <span>As you are contemplating the life choices that led you into a dragon-dog’s ass, you begin to smell something worse than your current surroundings. You realize that she was slowly caressing you deeper into her ass, and you were approaching the colon of the doggy-dragon. You are hit with waves of nausea as you are deposited into the colon, immediately getting coated in a thick, brown slime. You try to force your way back out, but all that does is cause the spitzfire to roll over in her sleep, throwing you against a wall and getting more of the sludge coating your body. You don’t dare to open your mouth, as if the goop smells this bad, you really don’t want to find out how it tastes. Eventually, the gel coating you begins to harden, leaving only your head free, as you had managed to wipe the gunk out earlier. You note that the rest of the slime is also hardening, then being compressed into the known and loved log shape. You are completely immobile and close to the back of the line, so it was realistically possible that you wouldn’t escape. You feel vibrations, the spitzfire waking up and stretching, and then you begin to move, trapped mostly inside a log of shit. As she is shitting, she remembers you, and watches for you to emerge. Finally, your head peeks out of her anus, which begins to relax now that her shit was done. The spitzfire sees you, and proceeds to lick your face with her forked tongue. Once she is done licking you, and making sure you are ok, she begins to walk off, your predicament having remained unchanged. Eventually, she gets back to what you can only assume is her den, as looking around from your vantage point yields a long, fluffy tail and the occasional glimpse of stone. Eventually, the tail lifts, and you are immediately pooped out of her anus and into a small indentation in the ground. You try to get out of your shit straight jacket, to no avail, when the spitzfire breathes flame. You are terrified, but the flame isn’t hurting you somehow, rather it is melting the shit encasing you. Thankful for the ability to move again, you walk up to the spitzfire and begin stroking her to the best of your comparatively small body’s ability. She gives a few quick licks, then turns around and quickly but gently pressed you back into her ass. You were actually starting to kinda like it in here, the smell was the only real downside, as you were gently squeezed by the walls, once again coating you in slime. You begin to softly rub her walls, getting a few moans from her before she yawned and fell asleep. You knew that any further stimulus would make her turn over, so you just stayed put for now. What do you do while she is asleep?</span></div></div>",
            "created":1561698000,
            "id":2679820,
            "title":"Freedom?"
        },
        "155333224":{
            "author_id":"releon",
            "author_name":"Leo",
            "choices":[
                "give her an \"internal\" belly rub",
                "snuggle in and let her do what she wishes"
            ],
            "content":"<div class=\"\"><div> <span>You rub it's muzzle, slightly entranced by it's tongue as the spitzfire licks your hand. It's hard to believe you're going through with this as you kiss the spitzfires nose, it gives you a sniff before opening it's maw nice and wide. Given a good view of where you'll be heading you blush slightly before leaning in your heading and letting the beast know your ready. <br>\r\n<br>\r\nThe spitzfire makes a small bark of approval as she licks your face clearly enjoying your taste. She puts a claw on your back holding you close and letting you know there's no going back now. You give her snout a pat as she moves forward bringing your head to the back of her throat as her jaws close around your chest. It isn't long before she lifts her head (and you) up into the air angling you downwards as her throat opens up.<br>\r\n<br>\r\n*gulp*<br>\r\n<br>\r\nWith the first swallow you feel you head sliding into her throat, the smell of meat floating up from her waiting belly. The dog dragon wastes no time sending you deeper and deeper into her body with swallow after swallow. She wolfs you down without any struggle quickly sending you through the tight tube that is her throat. You're aided through the tight confines by a copious amount of droll that lubes you up and wets the path before you.<br>\r\n<br>\r\nAfter a few moments of swallowing your head presses against a tight ring. She gives out a grunt of effort and pleasure as you're pushed through the sphincter and into her roomy stomach. With a few more swallows the rest of your body soon follows suit, leaving you in a fleshy hammock as you listen to the slow beating of her heart and more than a few gurgles as her stomach is excited by it's new occupant.</span></div></div>",
            "created":1540875600,
            "id":2570938,
            "title":"enter her orally"
        },
        "1553332241":{
            "author_id":"releon",
            "author_name":"Leo",
            "choices":[
                "She follows your scent to your home",
                "She goes to her own home a hidden cave"
            ],
            "content":"<div class=\"\"><div> <span>You push your hands into the soft flesh around you, they sink into the wet squishy sac surrounding you pushing against the walls and coating your hand in slime. Rubbing your hands in slow circles elicits a small barks and murrs from your new friend who seems ecstatic to receive all this attention. Smiling to yourself you pick up the pace.<br>\r\n<br>\r\n\"Whose a good girl?\" you say mostly to yourself not expecting her to hear you as she rolls onto her back. The motion tosses you about further coating you in stomach slime and ensuring that you squirm and cause plenty of pleasurable movement inside her. Giving a laugh you buckle down and continue rubbing the soft flesh causing her to wriggle back and forth. <br>\r\n<br>\r\nThe tight confines of the dragon dogs belly soon make it a bit hard to move as you find yourself panting as hard as your captor. Slowing down your rubbing a bit you find yourself listening to the quick breaths and excited heartbeat of the spitzfire. Why were you so worried about this monster, she clearly wouldn't hurt a fly much less a person. It had to be another monster that was threatening the town, right?<br>\r\n<br>\r\nThe spitzfire get's up with a stretch tightening her belly around you a bit before heading off to a new destination.</span></div></div>",
            "created":1542949200,
            "id":2581215,
            "title":"give her an \"internal\" belly rub"
        },
        "15533322412":{
            "author_id":"releon",
            "author_name":"Leo",
            "choices":[
                "Stay, she must be safe if she hasn't hurt  you this long.. right?",
                "Don't trust her, it's time to get out."
            ],
            "content":"<div class=\"\"><div> <span>You feel the chamber you're in sway a bit, once more inverting you as the Spitzfire gets up. The beast's stomach sways gently from side to side almost like a soft, if wet, hammock. Gently rocking you back and forth while the Spitzfire makes her way home. While she walks you can't help but rub into the soft flesh, snuggling into the plush interior of her belly. After some time passes you feel a cool liquid falling on you, seems the gals thirsty. You shake a bit and could swear she was laughing a bit at disturbing your rest.<br>\r\n<br>\r\nIt's not long after the disturbance that the Spitzfire settles down somewhere, judging by the lack of swaying. Feeling tired yourself you close your eyes, listening to her heartbeat as it slows down now that she isn't moving. You practically hear her yawn as she curls up constricting the stomach around you a bit. Giving a rather indignant pat on her belly you once again swear she's chuckling to herself.<br>\r\n<br>\r\nJudging by her slower breaths and lower heart rate the Spitzfire seems to be winding down and getting ready to sleep. While your fairly sure with how long you've been in here that you'll be okay, a nagging bit of doubt leads you to wonder as to whether you'd be safe spending the night in a monsters stomach. As you feel around a bit you feel a sphincter, though you don't know whether it'd lead further in or out her mouth... Should you risk it and stay or wiggle through the sphincter and risk going out the wrong end.</span></div></div>",
            "created":1548565200,
            "id":2608543,
            "title":"She goes to her own home a hidden cave"
        },
        "155333224121":{
            "author_id":"releon",
            "author_name":"Leo",
            "choices":[
                "Name her Lily",
                "Hold off for right now as you hear your stomachs growling."
            ],
            "content":"<div class=\"\"><div> <span>Resting your head on the soft flesh of her stomach you close your eyes. It's not long before you hear a soft snoring from the Spitzfire, as she sleeps her stomach closes in on you massaging you gently and rubbing every inch of you with slime. Yawning to yourself you feel like your trust in her was well placed, never once did you feel an acidic burn even though you spent all day in the dragon dog.<br>\r\n<br>\r\nAs the night progresses you sleep quietly, it's not long before movement all around you wakes you up. Within moments the stomach tightens around you pushing you in the opposite direction of the sphincter you found earlier.  Pushed upwards by an almost constricting force pushing you up and almost out of her mouth. As her sharp fangs frame your vision you find yourself sliding out and onto the ground.<br>\r\n<br>\r\nThe Spitzfire gives you a gentle lick, slowly cleaning the slime off of you as you lay there smiling to yourself.<br>\r\n<br>\r\n \"I should probably give you a name shouldn't I gal?\" you find yourself saying out loud as you scratch behind her ears. The Spitzfire licks your cheek seeming to affirm that at the very least she seems amiable to the idea.</span></div></div>",
            "created":1548565200,
            "id":2608566,
            "title":"Stay, she must be safe if she hasn't hurt  ..."
        },
        "155333224122":{
            "author_id":"releon",
            "author_name":"Leo",
            "content":"<div class=\"\"><div> <span>Considering you figured you'd be let out before she went to sleep you slowly start to panic. Pushing a finger through the sphincter you feel it give easily letting you slide your hand in through.<br>\r\n<br>\r\n\"Now or never,\" you say to yourself as you push through, dragging yourself into what you hope is her throat, though even coming out the other way might be preferable to waiting around and digesting. As you slip through you find yourself not in the throat but a rather roomier chamber..<br>\r\n<br>\r\n\"What the hell?\" you shake your head, the Spitzfire's breathing remains unchanged you having done nothing that would wake the dragon up. Though you did start something for the beast. Feeling around a bit you notice your hand starting to burn. A drop of something painful falls onto your head. It seems the Spitzfire had kept you in a safe crop and you had quite willingly forced yourself into her stomach.<br>\r\n<br>\r\nStruggling in the confines of her actual stomach you try and wake the beast up, however none of your movements seem to be having any effect other than coat you in digistive slime. Panting in the ever heavier air you find yourself falling down. Unable to put up any further struggles as her acids strip the flesh off your bones.<br>\r\n<br>\r\nMaybe you should have trusted her a bit more as you come upon..</span></div></div>",
            "created":1548565200,
            "id":2608583,
            "title":"Don't trust her, it's time to get out."
        },
        "155334":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Stand your ground. (Bad idea)",
                "Flee! (Good idea?)"
            ],
            "content":"<div class=\"\"><div> <span>Hunched over in the small clearing was a rare and powerful member of the Draconic family of monsters. And he was damn huge! If was standing tall, you were sure it'd be double your height. The creature's emerald scales glinted with hints of sweat, long wispy strands of white hair dangled on either side of it's snout and a thicker beard adorned it's jaw.  A black tabard was draped over it's shoulders, with a bright orange scarf to go with it. You briefly ponder where all these monsters get these accessories before your eyes go lower. It was <b>stacked</b>. The wizened dragon had an ass to kill for, it was round and plump; and currently spread open by his hands. You could see that the softer, yellowish scales that go across it's front trailed down across it's fat, flaccid cock and scale dotted balls and right to it's plump, soft asshole. Another deep groan comes from his muzzle, accompanied by a brassy fart as it's asshole crowns around a healthy brown log.<br>\r\n<br>\r\nIt just dawned on you that you're sitting here, hunched over a boulder; watching; nay... <i>Gawking</i> at a Professaurus having toilet issues. You gulp hard, unable to take your eyes off. It was like witnessing a beautiful disaster, watching the dragon roar and desecrate the ground with steaming draconic turds. A sloppy mess pours from it's hole, finishing after the several firmer logs that came before. You could smell it from here, and calling this dragon's stool foul would be the understatement of the year. You pinch your nose tight, holding back your breakfast. Some brazen alchemist would probably be scooping up that mess with extreme fervor, you've heard dragon dung is an extremely potent reagent. As you thoughts trail off, suddenly a chill rolls up your spine. You look up, and see the Professaurus has spotted you. It's craned it's neck back, and is... Well, normal people probably glare daggers. This big bastard was glaring an entire armory at you. It's pure red eyes held vicious thoughts about peeping toms no doubt. <br>\r\n<br>\r\nNow, how to resolve this?</span></div></div>",
            "created":1537765200,
            "id":2552650,
            "title":"No, how about Professaurus, an intelligent look..."
        },
        "1553341":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "He makes you clean his asshole with your tongue",
                "Another terrible thing. (Reader's Choice)"
            ],
            "content":"<div class=\"\"><div> <span>You nervously swallowed, and made a focused attempt to steel your resolve. You're not going to let this puffed up newt intimidate you! So what if it can cast a few cantrip here and there? You latch onto your sword's leather grip and draw the blade while stepping from behind the boulder. You put on your toughest face and get into your battle pose, which you practiced for weeks. Blade forward, on your toes; legs bent, ready to evade any enemy attack! But the wizardly dragon continues to look at you with that hateful, dismissive scowl. It stands up fully, and you waver some as it's full size dawns on you. It reaches over and retrieves a gem tipped magical staff it dug in the ground beside it's toilet mound.<br>\r\n<br>\r\n<br>\r\n\"You still stand before me, human. Why is that so?\" You grimace and hold your sword in both hands, thinking of an apt response. \"I've come to slay you, monster!\" ...A bit plain, but that'll do! Though your threat only makes the Professaurus scoff. A smarmy grin shows off teeth like arrowheads, glinting off the sunlight. \"Quaint, but I have a retort...\" It's eyes gleam, and the dragon points two fingers at you. You ready yourself for a magical attack, like a fireball or something, but nothing could prepare you for the scholarly dragon's arcane might. Well, a couple more levels might have. The air twists around you, and you find yourself carried by a strong current until you're shunted into the air by the magically summoned wind. Your screaming abruptly cuts off when you're launched into a tree. <br>\r\n<br>\r\n\"Interesting how all of that bravado goes out the window when you're flat on your back. That's pretty sad.\" The draconic mage steps over, stroking it's beard, while you lay heel over tea kettle, butt sticking in the air in a manner most would consider 'undignified'. You quickly scramble for your sword, but the dragon kicks it away. He leans down and easily manhandles you, holding you up by the edge of your armored breastplate. \"Now, what to do with you?\"</span></div></div>",
            "created":1538024400,
            "id":2554980,
            "title":"Stand your ground. (Bad idea)"
        },
        "15533411":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Shrinking!",
                "He had more poop backed up, and uses you like a toilet."
            ],
            "content":"<div class=\"\"><div> <span>The dragon mage ponders a fitting punishment while waving it's staff in your face. \"I should just torch you...\" You blanch with fear. T-Torch?! Your struggles are renewed with the vim only someone fighting for their life can summon, but again, it was all useless, this cruel monster was too strong. The Professaurus growls and pushes you against the tree you collided with earlier, it's rough bark scraping against your back. \"Ah ah! I'd behave if I were you, lowly human.\" It lets go of it's staff to stroke at it's beard, a devious thought making itself known. \"First though, you'll be assisting me.\" Assist? Before you can ask proper it forces you to sit against the tree, then promptly turns around and presents it's round, green scaly hide.<br>\r\n<br>\r\nThe smell hits like an avalanche, and you put a hand up to your nose to try to block it out, but the damage was done. You see through squinting eyes the dragon's asshole, darkened by it's recent bathroom escapade. You shake your head and clamp both hands over your mouth, knowing what's coming next, but the Professaurus was having none of it. It's tail smacks right into the center of her gut, and you cry out. It pounces then, working those fat cheeks around your head, trapping you in the stink. You cry out, trying to tug it off. \"I don't think so.\" The magic drake holds your wrists and jostles it's hips, making those fat buns shake and forcing your nose up against it's shit-stained pucker. \"Make it shine, human!\" You cry out, trying to make this all go away, but you stop after he threatens to pulp your head between the tree and his giant butt. Besides, it's either this, or a certain demise. You swallow the remaining shreds of your pride and get to work.<br>\r\n<br>\r\nTruly foul, no poetry could put flowery words to how disgusting this was. You quietly wail in horror as you quickly lap your tongue against the dragon's butt, scraping it's still hot dung away. Every time you pause to retch he squeezes his pillowy but strong ass cheeks around your head with enough force to hurt, so you relent to being toilet paper for this foul beast. After a dreadfully long time of cleaning the Professaurus' shitter, you pull back some to take a look at your work. It's clean, mostly. Does this mean you can go now? \"Aaah~ That was pretty good. Do you have experience with being an ass cleaner?\" You lower your head in shame. You just want to go home, take a long bath, rinse your mouth with boiling water and forget today happened. <br>\r\n<br>\r\nThough of course, it's never that easy. You quickly note he hasn't let you go, and you look pleadingly up. He's turned to look at you, insufferable grin on his elongated maw. \"Come now, be polite. Give it one last kiss.\" Diving in one last time, you decide to make this quick and plant your lips right against it's hole. Big mistake. A hot, moist fart goes right off into your mouth. You scream, and the Professaurus only holds you tighter as he fills your stomach with his gas. \"Hah hah hah! You fool!\" Another fart escapes, your scream the backing rhythm to his guffawing and the muted trumpeting of his hole. He lets go of your wrists, now using only his mighty rear to scrunch you against the tree, not satisfied with those measly poots. *FRRRPT* \"HRRRG! Filthy human...\" *FFFPT!* \"Since you liked watching, I thought you might've appreciated a closer look!\" *FFRPT! PRRRT!* \"Be grateful.\" The fart barrage ends, and you lay inert against the tree, tears rolling down your face. Not from sorrow or pain, no (Even though there's plenty to go around here.) but from the mephitic blasts doing a number on your olfactaries. This couldn't possibly get worse... Except it most likely will. But what could this odious dragon do to you next? </span></div></div>",
            "created":1538283600,
            "id":2556939,
            "title":"He makes you clean his asshole with your tongue"
        },
        "155334111":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Up his hellish scaly butt, of course!",
                "Down his fat cock.",
                "Swallowed into his gut."
            ],
            "content":"<div class=\"\"><div> <span>Eventually the cruel draconic mage grows tired of gassing you. His pucker unseals from your face with a loud *POP!*. He turns to admire his work, stroking his whiskers with an evil grin. \"Mmmm~ That's a nice expression.\" He leans down, cupping your chin in his claws. His voice was heavily muffled, the loud farts temporarily deafening you. Your vision was blurry, and you were about to black out. He admired your pale, tear stained face for a bit longer before rudely dropping you. \"Right then, I've decided I'm going to keep you. I lost my last slave in a little <b>accident</b>. If you obey me and continue to please me whenever I desire you, you won't meet a similar fate.\" By the Goddess! You can't be a slave to a nasty, cruel lizard like this! You muster up the last reserves of your energy and charge... <br>\r\n<br>\r\nAnd you're promptly swatted down as the Professaurus tail slaps you. His broad scaly foot stomps onto your face, just hard enough to daze you, instead of smashing you flat. \"Good! Keep that vim, you will need it...\" He stands over your battered, beaten body; fiddling with his gem tipped staff as he squats over you. You get a good look at his now cleaned, yellow scaled pucker as it flexes. \"What was once tall, shall become small... Once proud, is now cowed...\" Is this an incantation? You grimace as the dragon mage's staff glows, trying to brace yourself. \"Hope extinguished, form diminished! Shrink!\" The Professaurus' pucker gapes slightly, and you swore you could see a violet glow come from inside. A big plume of sparkling pink gas blows out in a loud, trumpeting fart. It washes over you, and you find it far more mild than his previous expulsions. Though the force of it starts to push you into the soft dirt, you realize the great butt gust was getting stronger! And he was getting bigger too! Or rather, you quickly realize you're simply shrinking. The sparkling gas dissipates after a couple seconds, the great chubby drake sighing; waving away the enchanted fumes. \"Ah~ There we go. Nice and portable. Now... Where to put you?\"</span></div></div>",
            "created":1586494800,
            "id":2816533,
            "title":"Shrinking!"
        },
        "1553341111":{
            "author_id":"whorexy",
            "author_name":"Whorexy",
            "choices":[
                "He forces you to soak up his farts",
                "He makes you clean out his asshole again, but from inside."
            ],
            "content":"<div class=\"\"><div> <span>He seems to chuckle to himself. \"Ah yes, why is it even a question? Since you adored my butt, I think it would be cruel to separate you from it.\" The now giant Professaurus picks you up and shoves you in his scaly rear, still smelling just as bad as before he made you his living toilet. He chuckles to himself.<br>\r\n<br>\r\n\"I never would have thought a human would make such a good \"addition\" to my cheeks!\" He laughs as he squishes his cheeks together, smothering you in his scaly crack. He seems to be enjoying your suffering in his backside.<br>\r\n<br>\r\nYou hear something. A rumble. Then...</span></div></div>",
            "created":1596732360,
            "id":2881435,
            "title":"Up his hellish scaly butt, of course!"
        },
        "15533411111":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "In the Professaurus' lair!",
                "Back in the woods."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\"><b>*FFRRRUUUMPPT!!!*</b></font><br>\r\n<br>\r\nThe burning scent of dragon feces was somehow even more potent this time, the huge; scholarly dragonoid sighing in relief as another powerful fart forces his huge slabs of butt fat to ripple.<br>\r\n<br>\r\n<font class=\"size4\" style=\"\"><b>*PHHHHRRRRPTPPT!*</b></font><br>\r\n<br>\r\nBurning charcoal and the overwhelming tang of sulfur weren't exactly your favorites. In fact, being burninated by this big, perverse scaly wizard is starting to look humane compared to this. It would beat being suffocated by his farts. A third, much weaker fart sputters out; the Professaurus' pucker winking as oily, foul sweat drips onto your face. This must be it, your very first monster encounter ending from death by farts... A fourth, glorious fart causes the wizened drake to groan in delight. You taste iron and rotten eggs, and through pained tears you see a white light...<br>\r\n<br>\r\n<br>\r\nYou're stirred awake by a cold air... Fortunately, you seem to have lived! Though now you have a splitting headache and a deep nausea. Looking around, you see that you're...</span></div></div>",
            "created":1603095420,
            "id":2924439,
            "title":"He forces you to soak up his farts"
        },
        "155334111111":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "The Professaurus is back!",
                "A new monster comes through the door!"
            ],
            "content":"<div class=\"\"><div> <span>Blue tinted bricks make up the room you awaken in. Your mind races, and you try to gather your thoughts as your head feels like it's going to go off like a bomb. It takes a while longer to get your bearings, and as you do the gravity of your situation starts to dawn.<br>\r\n<br>\r\nNo weapon, no armor. You're only in your underclothes after getting released from that evil dragon's butt. The room you're in is mostly featureless, bearing shackles attached to the walls and little else. Not even the basic decency of a bed... As you start thinking of a way to escape the heavy iron door in front of you begins to open...</span></div></div>",
            "created":1604139600,
            "id":2932098,
            "title":"In the Professaurus' lair!"
        },
        "155334111112":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "An Archdemon is about to sit on you!",
                "You notice a village nearby...",
                "You run into another ernomous, and smelly, monster..."
            ],
            "content":"<div class=\"\"><div> <span>You let out a big sigh as you were glad that you weren't pushed into some sort of toilet. You looked around and see that you were bought into the woods by the dragonic warlock.<br>\r\nThe downside to all of this is that the evil warlord's castle could be much further now...though defeating him would be easier said than done since you don't have that much experience...dammit!<br>\r\n<br>\r\nHowever, before you could look around more and come up with a strategy, you hear another enemy coming in...</span></div></div>",
            "created":1603505760,
            "id":2927760,
            "title":"Back in the woods."
        },
        "1553341111121":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "Of course not, musky Archdemon ass dominates you!",
                "You evade becoming a cushion! For now."
            ],
            "content":"<div class=\"\"><div> <span>You curse your rotten luck, ruminating on that terrible encounter earlier. You lost your sword, and you still feel sick from being forcefed dragon poop earlier, and now your armor reeks of it. It truly could not get worse... You figured, until you heard something huge swoop right over your head. Oh no... That didn't sound like a bird, or even a bat.<br>\r\n<br>\r\nYou feel a tap of your shoulder, your body goes rigid; like a blast of ice froze you in place. It takes every ounce of courage in your core to turn around and you now really wish you hadn't. Right above you, the huge frame of a powerful demon hovers above you; it's wings beating hard to keep it afloat as it turns; revealing two huge; purple cheeks covered in smooth bumps. Incoming!<br>\r\n<br>\r\nYou have to dodge! But do you...?</span></div></div>",
            "created":1603535880,
            "id":2927916,
            "title":"An Archdemon is about to sit on you!"
        },
        "15533411111211":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Stay stuck as the archdemon gets comfy",
                "You slip back out with a fart",
                "You manage to escape, but immediately bump into another monster..."
            ],
            "content":"<div class=\"\"><div> <span>You didn't dodge in time. Not only does the Archdemon manage to sit on you, but you slide easily into his slimy anus. You grunt as you feel some thick slime get onto you as you sink further. Outside, the chubby demon barely notices anything is amiss, only feeling something has slide up his butt, and it felt quite nice.<br>\r\nAfter you get pushed into the demon's thick butt, you hear some rumbling and gulp, knowing what is about to happen...<br>\r\nThe demon grunts and lets out a deep fart over you, causing you to gag as your lungs are soon filled with the fumes...</span></div></div>",
            "created":1603551300,
            "id":2927989,
            "title":"Of course not, musky Archdemon ass dominates you!"
        },
        "155334111112111":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "You wake up hours later, still inside.",
                "You wake up after he shat you out",
                "You don't wake up, because Y O U D I E D"
            ],
            "content":"<div class=\"\"><div> <span>You choke as every ounce of priceless air gets shunted out of this huge, fatty demon's gross butthole. How could this be happening again?! You pound against the walls, you push; but they don't budge. You try to sidle downwards; but the slimy walls only tug you deeper up. You hear the Archdemon let out a muffled sigh as more terrible gurgles come from all directions. Hot, sulfurous bubbles of flatus pass down through the big demon's gut, buffeting you in the terrible wind.<br>\r\n<br>\r\nThe smelly demon groans as his belly brews up a storm. \"Gwuooh... Shouldna drank so much back at the castle.\" He leans forward, blushing as more hard; brassy farts made his fat; bumpy ass cheeks clap together. \"Oof... Ooohh... That feels good.\" He couldn't quite tell what he sat on, but it didn't matter; the tickling inside his butt was pretty nice! Of course he didn't realize that tickling was you trying to fight for your life, uselessly clawing at his spongy, dirty innards. 10 minutes pass as the fat demon lounges and farts, and you pass out again....</span></div></div>",
            "created":1603578540,
            "id":2928308,
            "title":"Stay stuck as the archdemon gets comfy"
        },
        "1553341111121111":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You keep still in his smelly butt a bit longer",
                "You start to feel submissive as you breathe in just his farts",
                "You manage to escape, but immediately bump into another monster...",
                "You try to escape from his smelly butt..."
            ],
            "content":"<div class=\"\"><div> <span>You wake up much later, possibly the next day. You groan as an intense smell fills your nose. That's when you remember that you got shoved up an Archdemon's butt...<br>\r\nThe Archdemon wakes up the next day, groaning out and letting out a deep fart as he wakes. \"Mmmff, that was a rough night...think something climbed up my ass, but it can stay, it feels so good...\"<br>\r\nYou gulp hearing that and try to get out, but the thick slime keeps you in place. The Archdemon then starts to get up, letting out some farts in the process...</span></div></div>",
            "created":1603579980,
            "id":2928316,
            "title":"You wake up hours later, still inside..."
        },
        "15533411111211112":{
            "author_id":"vintagejackets",
            "author_name":"Silk",
            "choices":[
                "The Archdemon jerks off while keeping his butt plug in longer",
                "The Archdemon takes a HUGE dump",
                "The Archdemon goes right back to sleep"
            ],
            "content":"<div class=\"\"><div> <span>You awake, still awash in the foul fumes. Moving around was near impossible, your arms and legs are so heavy; and you still couldn't see inside the dark, filthy prison you were trapped in. The powerful demon stands up yawning and scratching his fat kiester as it continues to trumpet out loud; deep farts. \"Mmph! Still gassy...\" He drearily looks back, wiggling his huge butt; feeling that little thing he sat on still inside. \"Tingles down there... Hmmm~ Wonder what's even in there...\"<br>\r\n<br>\r\nYou feel the rectum clench, and you're forced to move along wherever this demon's hellish hole desires you to. What's even happening out there? This bastard's gas is unbearable, but you're so lightheaded, and you're not choking on it anymore. Has your body somehow acclimated to monster farts? You really hope that isn't the case, but the squeezing of his anal walls doesn't hurt; it was like a massage even. Almost cozy...<br>\r\n<br>\r\nMeanwhile, the Archdemon was deciding what he was going to do...</span></div></div>",
            "created":1603597740,
            "id":2928410,
            "title":"start to feel submissive as you breathe in farts.."
        },
        "1554":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You unknowingly get behind him...as he sits down!",
                "He somehow manages to keep up with you and tries to step on you",
                "He reaches down and picks you up...",
                "You manage to get away from him..."
            ],
            "content":"<div class=\"\"><div> <span>Your heart sank when you noticed that it was the almighty Behemoose! This creature was easily the size of a mountain and can easily pick up large boulders and throw them as if they were pillows! You also notice a good bit of patches growing on his body as he walks towards you. You knew right away that you currently have no chance of defeating this creature and have to get out of there fast and begin to run...</span></div></div>",
            "created":1557032400,
            "id":2655649,
            "title":"The Behemoose!"
        },
        "15541":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You wake up long after your chance of escape!",
                "You begin to take in deeper whifts of his gas...",
                "You try to get out as he relives himself!",
                "You try to get into his waste, but it slides out over you, pushing you down!"
            ],
            "content":"<div class=\"\"><div> <span>All the dust that he is kicking up is causing you to not be able to see much and you unknowingly head back toward the massive creature! When you regain your vision, your heart sinks as the first thing you see is his massive butt as he sits down! You brace yourself as you think you were about to be crushed like a bug, but instead, as he sits down, you easily slip right in between his butt cheeks as he sits! When you open your eyes back up, your are surrounded by darkness and a horrible smell! You also feel your equipment at your feet and when you reach down to try to get it back, the giant creature feels this and starts to pull you in with powerful clenches! After a few hard clenches, you are pulled into a big chamber, big enough for you to walk around in and stand up...though you didn't want to think about what you are stepping in. As you resume your search for your equipment, the massive beast groans and let's out a huge fart, pushing out your equipment and whatever fresh air surrounds you...that's just great... You cringe as the fumes fill the chamber and you start to fall asleep...<br>\r\n<br>\r\nAfter about a day, you have somehow got used to staying in this beast's ass, eating the sludge that didn't leave his body, and the gas that forms is finally breathable...and you don't seem to be too cramped...it's as if this giant's bowels were made to house some tinies...you didn't like this idea and will wait till the next day to try to escape a life inside a titan's butt...</span></div></div>",
            "created":1557032400,
            "id":2655673,
            "title":"You unknowingly get behind him...as he sits down!!"
        }
    },
    "info":{
        "author_id":"rossthefox",
        "author_name":"Rossthefox",
        "brief_description":"You encounter a monster or two during your quest. Will you defeat them or end up as a toy?",
        "created":1493586300,
        "description":"<td align=\"left\" class=\"norm\">You are a male young knight on yet, another quest to stop evil from taking over the world after a recent tragedy has occurred in your village. However, unlike the other times, the monsters here seem to want something more than just defeating you...rather it's becoming a meal for them, becoming a slave or even a toy for the big monsters!<br>\r\n<br>\r\nAnything goes except soul vore and watersports.<br>\r\n<br>\r\nAlso, try to make it around 500 characters or so to keep it interesting.</td>",
        "id":2120222,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1408725422/item_id/2005773.jpeg",
        "last_full_update":1604139600,
        "modified":1604139600,
        "pretty_title":"Dragon Quest Monster Encounter"
    }
}