{
    "chapters":{
        "1":{
            "author_id":"tiger189a",
            "author_name":"That Goddess",
            "choices":[
                "Stress Relieve",
                "Transforming",
                "Resistance",
                "Teleportation",
                "Screw it, jump off the conveyor and start your escape"
            ],
            "content":"<div class=\"\"><div> <span>Heading right out of That Lab's recruitment chamber, having been shrunken down and kicked out of a tiny exit, you were forced onto a conveyor. It gave you a little tour of what was to come, seeing other test subjects be disintegrated, turned into things, shrunken beyond rescuing or simply being crushed to death.<br>\r\n<br>\r\nYou were shocked, to say the least! These were still people and they treated then like bugs! Yet, you signed the contract and had no way of escaping, at least yet.<br>\r\n<br>\r\nThe tour concluded, leaving you mentally scarred, the conveyor bringing you towards your destination, without a single care: A huge chute with _______ written on it. </span></div></div>",
            "created":1560169020,
            "id":2671314,
            "title":"Introduction"
        },
        "11":{
            "author_id":"datman1952",
            "author_name":"Datman1999",
            "choices":[
                "The Schemer With Purple Hair Grabs You!",
                "The Excited Cowgirl With A Tan Nabs You!",
                "The Wild Yet Refined Girl Steals You Away!"
            ],
            "content":"<div class=\"\"><div> <span>   So you see it say's Stress Relief. You fear for the worst as you tumble into the chute and down it. Scared you try to grab onto something, anything in a vain attempt to save yourself from your possible doom or torture! You fail as you fall with a soft thud against the rubber of another conveyor belt. You look around seeing that you are on a round belt loop on the conveyor, it going in a circle around a table. You saw a few scientists sitting in front of you at the table part of it. They all looked at you and a few other tiny victims. They all seemed to be in different levels of interest one girl, with brown hair, tan skin, and green eyes wearing a cowboy hat, really excited as she yelled seemingly loving her job. There also happened to be a girl with purple hair, inhumanly pale skin, and red eyes sitting there as well her wearing a devilish grin on her small pink lips as she schemed looking at you. Lastly you saw a girl with brown long unkempt looking hair, her skin was white with a few freckles running across her nose and cheeks, her eyes were red as well. Her attitude scared you almost as much as the schemer's. She seemed wild and untamed yet her actions spoke of intelligence as did the round glasses on her face. She was grinning just as wide as the schemer. You had no choice but to watch as one of them reached their hands out and....</span></div></div>",
            "created":1561516860,
            "id":2678593,
            "title":"Stressed Out!"
        },
        "111":{
            "author_id":"datman1952",
            "author_name":"Datman1999",
            "choices":[
                "Give Into Your Urges And Worship Her?",
                "Resist Those Urges!",
                "Something Else Happens?"
            ],
            "content":"<div class=\"\"><div> <span>   You could do nothing as The Pale Scheming Girl grabbed you between her pale fingers. They were soft as you were raised seeing she was wearing a pink dress that had red frills at the neck going in a square around it a red bow down in front with another circle of red frills at the hips and lastly a line of red frills at the brim of the dress. There were black buttons going down it in the middle. A white lab coat perfectly sized for the young lady's petite body. Her skin was flawless and reminded you almost of porcelain with how white, smooth, and flawless it was. Her red eyes like Rubies, they almost seemed to glow as she looked you over and you well looked her over! She was wearing pink flats with a huge red bow on the toe section of the flat. Her chest wasn't very big from what you could see either she had a A cup guessing to be 75 or 76 centimeters. Her lips were small, pink, and curled up into a well cute smile if they weren't giant in front of you. She seemed pretty short honestly well to tell you the truth just small! Standing at 5 feet 2 inches!<br>\r\n   She carried you between her small pale fingers over to her office! You saw the name plate was in German, Japanese, and English! All three saying Remilia Scarlet Head Of Research And Development! Her office was huge having a big black desk on it was papers, a small globe, a stapler, a few binders, and a picture frame. The picture frame had her, a similar looking girl with blonde hair, a tiny with fluffy brown hair, and another tiny with brown short hair on both of their palms! She sat down in her  huge black puffy chair the air rushing out. Schematic's of devices made by her in picture frames on the wall. This even included the shrink ray that had been used on you before to make you well tiny! You also saw a few others that well you couldn't make out from your size aside from they were complicated as hell and a few pictures of the people in the photo from before! One of the tiny next to her pink flat! One of the blonde haired girl holding the tinies in front of her canine teeth teasing them you guessed! She set you on the black desk looking down at you. \"Can you speak English?\" 'Y-Yes?' \"Oh that's great that really makes things easy for me! I can speak almost every language ,but I prefer English, German, or Japanese!\" 'O-Okay?' \"I am Remilia Scarlet! I really need someone to help me relax from my hard work and that's where you come in little tiny!\" 'H-How can I help you?' \"Well massage, lick, rub, and any other thing you want you perverted little tiny there's a reason you signed up for this job!\" 'T-The money?' \"No because you're a pervert!\" 'I-I didn't even know I was going to be tiny!' \"Huh? Oh did they change the forms?\" You watched her click and clack at her keyboard typing away at it and clicking! \"Ah they did change it just lying now....oh well you'll learn to love being tiny and being near my feet!\" 'Huh? But I--' You were cut off as you were launched into the air by her foot slamming down on her desk your tiny body shaking as you were in front of your her huge pink flat's sole it dirty even having the corpse of a tiny it's blood around it's sticker like body completely flattened to the grooved sole. It in a line pattern going down to her heel.<br>\r\n   \"Well get to work licking and kissing then we'll move onto my bare feet. Okay~?\" She gave you a cute face it almost hypnotic as she smiled her pink lips curled her eyes almost glowing as you well felt like you had to lick at her feet! You ran up pressing your body into the plastic sole of her flat the bow barely visible. You licked at the dirt swallowing it down your throat her leaned back snuggled into her big black chair everything about her screaming cute but your body screaming run! The pink material of her sole soft and flexible! She was tapping her other foot against the air the movement weirdly arousing you as it was almost like she put a spell on you! You not really being turned on by being teased in a way like this before. Or even being sexually aroused by feet and shoes before! Her flat popped off her foot a little! The smell of cheesy vanilla hitting you like a truck. You leaned around your mind seemingly being controlled by these urges she put in you. You saw her pale heel it slightly red from her being on her feet all the day the smell beyond strong as you looked into what could easily be your coffin if you weren't careful not that you'd mind if she kept this spell on you!<br>\r\n   You got closer to her foot as her flat slammed closed right in front of you! She giggled loudly and cutely as it snapped shut. Her teasing you more \"You could have just asked Tiny~\" she said as she pulled her flat off wiggling her toes. Her nails were red both her finger nails and toe nails. Her foot was damp with sweat. Beads of sweat ran down her super soft looking foot the soles and toe bottoms red from soreness! \"Well Tiny~ wanna go wild~?\" So do you....?</span></div></div>",
            "created":1561523040,
            "id":2678630,
            "title":"Meet Your New \"Friend\""
        },
        "13":{
            "author_id":"datman1952",
            "author_name":"Datman1999",
            "choices":[
                "The Oranged Haired Nerd!",
                "The Brown Haired Cutie!",
                "The Blue Haired Mute Mystery!"
            ],
            "content":"<div class=\"\"><div> <span>          You watched as you moved towards a chute marked Resistance! You freaked as you fell down into the metal chute bouncing around before hitting hard cold metal with a thud! You were on a metal platform the words sit here in black marker in front of you. You well didn't have time to get up as a ray gun designed like a childs toy popped out of the vent in front of you shooting you as you felt weird! You felt invincible power coursing through you! You went then thrust back into darkness falling again as you landed surprisingly feeling no pain! You looked around a ton of bodies next to you the floor around you red as you heard a few loud gasps! You looked up seeing you were in the middle of a desk two computers behind you one in front! You saw a pretty orange haired girl with glasses at the one in front of you! She had brown big eyes her skin was super pale! You turned around seeing a girl with short fluffy brown hair that parted away from her head. Her eyes are hazel and her skin is a much more fair tone but still on the lighter side. And lastly there was another girl sitting at the computer next to her. There was a girl with short light blue hair her eyes were a simple green! Her skin was well just fair! She wasn't super pale or on the paler side or the darker side! The orange haired girl spoke up first!<br>\r\n          \"H-He lived...\" Then the brown haired girl spoke up next! 'H-He did! We made the perfect toy! Yay~' She honestly just looked relaxed and leaned back! You noticed they were all pretty short the orange haired girl sitting at four foot eleven inches! Followed up by the brown haired girl who sat at four foot ten inches! And lastly the blue haired girl sitting at five foot three inches! You had a better look at them as they leaned to look at you! \"W-Well who tries him first?\" The blue haired girl held up a ipad that had simply said me! 'Well I-I wrote most of the code used!\" The blue haired girl held up a ipad to them saying I made him into the perfect pervert rewriting his brain!<br>\r\n           \"Well I am the Boss here! I-I say he picks based offfffff....tada!\" She smashed her well worn black combat boots! You had never been so aroused before by well boots! Seems they really did make you into the ultimate pervert as your body and mind new that you loved so many new things! Feet, boots, flats, sneakers ,and even vore! Anyway enough about you! Right after she slammed her feet down they were in orange and green stripped knee high socks! They smelled like soda, sweat, cheese, and sour and vinegar chips! There were a few gummy bears, chips, and even a pretzel stuck to her feet and mostly crushed! Her feet were small and petite her toes slim and long her sole slim as well! 'G-Gross how does that...oh I getcha!' The other girl's ipad simply said wut? \"We make the pervert pick duh! Winner toys with him first!\" As she said that the brown haired girl neatly set down a brown pair of flats down in front of you on the desk! She slowly set her feet down towards you as well not the smells mixing! From behind you came the sugary sweaty cheesy smell of the orange haired girls feet! In front of you was the brown haired girls feet, they were in brown stockings her feet were damp with sweat! The smell mostly just sweat but there were hints of lotion to try to strave off the smell but clearly failing! And you heard a loud thud that shook you as you turned! The mute blue haired girl having set down platform sandals! They were thick white soles and then she smashed her feet down next to them! Her feet were huge! They towered over you her soles thick and meaty her toes just as plump! The smell just a thick musky scent of sweat somehow even with sandals they were bad! They well were very intimidating for feet even at your size! \"Well little guy! Go ahead and pick!\" They all wiggled their toes and well tried to coax you over! So your horny little body ran to...!</span></div></div>",
            "created":1561541520,
            "id":2678720,
            "title":"Resistance"
        },
        "15":{
            "author_id":"datman1952",
            "author_name":"Datman1999",
            "choices":[
                "Run Over And Start Climbing Up Her!",
                "Book It For The Door, Dude!",
                "Head Back Into The Lab To Get Help!",
                "Oh Shit! She's Seen You! Run!"
            ],
            "content":"<div class=\"\"><div> <span>          You hopped down to the white tiled floor rolling as you hit the ground to soften the landing! You looked around to your left a pretty brown haired girl in a lab coat was slowly stepping down barefoot on a tiny! You watched her sole slowly come down and steamrolled the tiny into a thin sticker of himself. You shuddered running back up the belt towards where you came from! You saw the door the lady who shrunk you and put you on the belt had walked in from. You slipped under the door seeing the lady sitting at the front desk! There was no one else in the lobby with her at the time! She had long blonde curly hair that went to her shoulders. Her eyes were ocean blue. Her skin was very fair and clear with no pimples or any kind of blemishes. She was wearing a dark red button up that barely contained her chest along with a tight black skirt. Black tights were under her skirt and went down to her feet which were encased in a sleek pair of black heels! <br>\r\n          You could also see the shrink ray on her desk so clearly you only had a few options here. So of these things to do you could...?</span></div></div>",
            "created":1561705980,
            "id":2679692,
            "title":"Run Boy, Run! They're Coming To Get You, Boy!"
        },
        "153":{
            "author_id":"datman1952",
            "author_name":"Datman1999",
            "choices":[
                "You Ran Towards The Anime Division!",
                "You Ran Towards The Video Game Division!",
                "You Slip Under Another Door!"
            ],
            "content":"<div class=\"\"><div> <span>          You ran back into the lab scared and nervous! You saw well the same things as before tinies being munched on, tinies being stomped or slowly steamrolled into well a sticker or a mere husk of what they were! You ran along back into the lab seeing doors marked with different departments varying from a Anime division to video game division to even a R and D Division! So you ran over towards...!</span></div></div>",
            "created":1561707360,
            "id":2679694,
            "title":"Welp Back Into The Frying Pan!"
        },
        "154":{
            "author_id":"datman1952",
            "author_name":"Datman1999",
            "choices":[
                "You're Coming Home With Me!",
                "Welp Not Good Enough Buggy! Chow Time!",
                "She Decides To Give You To A Scientist!"
            ],
            "content":"<div class=\"\"><div> <span>          You squeaked loudly as she made a grossed out face! \"Ew! Another one of you fucking bugs got out again! I should just crush you and be done with it! Or...~\" Her disgusted angry face turned to excitement as she realized she had someone to work under her. Act as her Secretary and to be bossed around and bullied by her! The perfect situation for her! Why hadn't she thought of this earlier! She would then remember oh yeah she crushed all the Escapees! Silly her she thought! She stood up walking over to him! Her clicking heels hurt your ears a little as they tapped against the ground with her steps. They sent earthquakes through the ground for you at this size. \"So Buggy I'll give you two options here! Get crushed by me or be my slave~ the choice is pretty clear here after all~!\"<br>\r\n          You didn't even have to think about it! 'S-Slave!' She grinned widely at you. Her pink lipstick coated lips curled as she giggled! \"Well of course Buggy you don't wanna be a stain do you?\" You shook your head of course as she stared down! \"First on your to do list is to give me a massage and help me relax since my job is soooooo stressful!\" She was slipping off her heels one at a time. First her right heel came off her toes scrunching in front of you. Her foot gave off a sweaty leathery smell due to her black heels. You could faintly see the outline of a tinies corpse in her nylons. The heat was intense from her foot as it was raised to you. The other heel was popped off with a wet plop it hitting the ground next to you. Her feet right next to each other! Her soles had wrinkles going all across it as her toes scrunched! \"Get to work Buggy or I'll swallow you alive~!\"<br>\r\n          You had no choice pressing your hands into her sweaty, smelly sole! Your hands burned slightly due to the acidic effects of her sweat. You could barely breath the funky smell surrounding you and choking you! She looks down at you Smugly and says....!</span></div></div>",
            "created":1561709640,
            "id":2679701,
            "title":"A Secretary And Her Assistant!"
        }
    },
    "info":{
        "author_id":"tiger189a",
        "author_name":"That Goddess",
        "brief_description":"Applying as a test subject might have been a bad idea",
        "created":1560168540,
        "description":"<td align=\"left\" class=\"norm\">As the newest test subject at That Lab™, you're in for quite a few experiments.<br>\r\n<br>\r\nYou've been handed the following rules:<br>\r\n<br>\r\n1. No 18+<br>\r\n2. Make sense and write well. Grammar mistakes and the sorts are fine unless they make understanding you a chore.<br>\r\n3. No one-line chapters unless fitting.<br>\r\n4. Male and Female are both fine.<br>\r\n<br>\r\nNow have fun being a test subject at That Lab™</td>",
        "id":2193017,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1561709640,
        "modified":1561709640,
        "pretty_title":"That Lab"
    }
}