{
    "chapters":{
        "1":{
            "author_id":"ruwth",
            "author_name":"ruwth",
            "choices":[
                "An elderly man . . .",
                "An elderly woman . . .",
                "A young man . . .",
                "A young woman . . .",
                "A child . . ."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\"><span class=\"cblue\">Physically, she is petite . . . just five foot tall and now less that 100 pounds. A tiny woman but a powerful influence in my life. She always wears dresses or skirt. I have never seen her in a pair of jeans. I remember that there was a time that she wore shorts in the summer but no more. Years and years and years ago. she might have donned a pair of slacks now and then but you would never know it now.<br>\r\n<br>\r\nShe likes things to match but has no fashion sense. She doesn't care. She wears what she likes and what is comfortable. She wears sweaters year round. She hates air conditioning. She only uses it in her apartment when she absolutely needs to so when she walks out into the buildings hallway, it is like stepping into a fridge. She does not go out without her sweater.<br>\r\n<br>\r\nShe crochets. In the winter, she wears an assortment of crochet hats that she has made herself. Folks like them. She made some for other folks when they have asked her to. She has made a couple for me.Again, they are not the latest fashion but they do have a uniqueness that makes up for that to some degree.<br>\r\n<br>\r\nShe has a little dog. She talks to him and she will tell you what he is thinking. She knows you know. They definitely have developed a relationship . . . responsive to each others moods. Sometimes they both want to be left alone. He will go under the bed. She might put him in the bedroom so she can have some private time.<br>\r\n<br>\r\nShe also has a budgy. She has almost always had a dog and a bird. This one is new to replace one that died.She talks to it and makes kissy noises. Most of her budgies have learned to say a few words here and there. And to do tricks that she has taught them. Give her time and she'll have this one doing it, too.</span></font></span></div></div>",
            "created":1307104140,
            "id":1119020,
            "title":"A woman I know . . ."
        },
        "11":{
            "author_id":"c.o.blacet",
            "author_name":"C.O.",
            "choices":[
                "An elderly man...",
                "An elderly woman...",
                "A young man...",
                "A young woman...",
                "A child..."
            ],
            "content":"<div class=\"\"><div> <span>          As I sat one fine day outside Wal-Mart on a bench, I noticed an elderly man approaching me. He walked with a slow gait and limped on his left leg which was mildly supported by a long, bright, wooden cane. He slowly crept toward the bench and sat next to me. He wore a dark brown button up shirt covered by an overcoat which was falling apart at the seams and seemed to provide no warmth or comfort so it must have simply been worn for emotional comfort or out of habit. He wore black slacks, which at one point may have fit him, but now the pant legs drearily hung below the ankles, partially covering the deep mahogany colored slip-ons.<br>\r\n<br>\r\n          He was frigid, with every deep breath his whole body shook; at the raise of a hand it shook with such ferocity that after a mere few seconds it must be returned to its nesting spot. His voice was gruff and deep and was filled with an underlying of kindness. His eyes were aged, just as the wrinkly skin upon his face, but still kept a hint of the youthful blue which had ruled there at one time. He spoke so quietly that I scarcely heard him.<br>\r\n<br>\r\n          I asked him to repeat himself and he asked me with a gentleness that I have never heard repeated, \"How are you?\" To this day day i can not remember what I said, but I remember the words he spoke. How are you. I hear it repeated in my mind every time I sit on a bench and I sit and wait for the man with a gentle voice. I know deep in my heart I will never see him again but I wish more than anything to hear that kindness once more.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n   </span></div></div>",
            "created":1307375940,
            "id":1120850,
            "title":"An elderly man . . ."
        },
        "12":{
            "author_id":"nfdarbe",
            "author_name":"Prosperous Snow",
            "choices":[
                "An elderly man...",
                "An elderly woman...",
                "A young man...",
                "A young woman...",
                "A child..."
            ],
            "content":"<div class=\"\"><div> <span>She was about five feet five inches, with completely white hair. When she went outside her hair glistened in the sunlight. Her hair was beautiful and perfectly arranged, except on windy days. She did not seem to mind the wind blowing her hair. In fact, she enjoyed the wind and anything else that had to do with nature.<br>\r\n<br>\r\nMost of the time she wore short or slacks. The only times she wore a dress was to Sunday services and funerals. She did not wear much makeup either. She wore lipstick on a daily basis, but the only time she wore anything more was Sunday services, funerals, and eating out with her husband or friends. Once a week her husband took her to her favorite restaurant and sometimes they invited me along.<br>\r\n<br>\r\nI remember the first time I went to her house, it was to help her with her computer. Her husband had bought her a computer and since she was the treasurer for her club, she wanted the books sit up in a spreadsheet. At the time she must have been about 70. I never did know precisely how old she was because she never said and never looked her age, but I do know that she met her husband somewhere around or before World War II.<br>\r\n<br>\r\nShe enjoyed all outdoor activities, but she was especially fond of golf. She loved golf so much that she played alone. One day, after a game she fell as she returned to her car and broke her leg. Instead, of calling an ambulance or asking for help she drove herself to the hospital. That was what she told anyone who ask her how she broke the leg. Knowing her that was probably how it happened because refused to request help if she felt she could do something herself.<br>\r\n<br>\r\nShe was an amazing woman. She was married to the same man for fifty years. She raised two children a boy and a girl. Then after her son and his wife divorced she raised her granddaughters. I still miss going to her house once a week to help her with her computer.<br>\r\n</span></div></div>",
            "created":1332306600,
            "id":1299082,
            "title":"An elderly woman . . ."
        },
        "122":{
            "author_id":"tobe1987",
            "author_name":"Stephanie Ferguson",
            "choices":[
                "An Elderly Man",
                "A young man",
                "A woman and child"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size35\" style=\"\">          Her name is Doris, but everyone calls her Dee. My husband had first met this wonderful lady at his business. He is a sign maker and she had recently been in a fender bender where her back bumper had a small dent. It was a new car and she wanted something to cover it up for the time being. Thinking he could match the color of her car she went in to see what he could do.<br>\r\n          I just happened to be there that day when she came in and had a talk with her. She was selling her house because her husband was in the veterans hospital close by and she was moving a couple towns over to be closer to him. At the time, my husband and I were searching for a house. She had offered us to go see it sometime which we promised we would. <br>\r\nAfter much debate the color of the car could not be matched perfectly so Dee came up with another idea, she is originally from New Zealand so she thought about putting a map of her county over the dent instead. My husband printed off a picture and placed it over the dent. She loved it! <br>\r\n          I had seen Dee over the years coming into my place of work and getting coffee.<br>\r\n          “I like my coffee like I like my men, white and sweet.” She would say then worry if she had offended anyone. I'm not sure I will meet another lady like that in my life and although I have not seen her in quite a long time I pray she is doing well.</font></span></div></div>",
            "created":1423664340,
            "id":1931708,
            "title":"A Woman Named Dee"
        },
        "13":{
            "author_id":"lilithmoon",
            "author_name":"Lilithmoon☽",
            "choices":[
                "An elderly man...",
                "An elderly woman...",
                "A young man...",
                "A young woman...",
                "A child..."
            ],
            "content":"<div class=\"\"><div> <span>I met a young man of 23 years who took my breath away. He had the face of an angel and the body of a soldier. He stood straight and tall. He wore his uniform with pride and it showed in his every action. He devoted his life to defending his country and protecting the ones he loves. I watched him sacrifice for the benefit of others time and time again. He served with integrity and honor. He gave willingly, with no thought of himself. He is the finest young man I have ever met.  <br>\r\n<br>\r\nNow, the man is 50 years young. His name is Tom and he is still a handsome devil. He is still tall and strong with penetrating green eyes and an infectious laugh. When he takes me in his arms it feels like the safest place on Earth. Nothing can hurt while I am there. I am the luckiest woman alive, for I get to live within the comfort of those arms. Tom is my husband, my hero, my world. </span></div></div>",
            "created":1332575220,
            "id":1301436,
            "title":"A young man . . ."
        },
        "133":{
            "author_id":"lilithmoon",
            "author_name":"Lilithmoon☽",
            "choices":[
                "Man",
                "Woman",
                "Child"
            ],
            "content":"<div class=\"\"><div> <span>I met a man from Galilee. His face was so serene. His eyes held the depths of compassion. He gave me comfort with a simple glance. We walked upon the shore and even the sea was calm. He spoke of peace, love and charity. This young man wise beyond his years. The wisest man who ever lived. <br>\r\n<br>\r\nHe told me he must go, his father was calling. I asked him when we could speak again. I told him I feared I would forget the things he had said. He handed me a book and said it was his word. Written within the pages was his message. Then he disappeared before my eyes. I called for him but he was gone. <br>\r\n<br>\r\nI awoke with a cry on my lips. I sat up in bed as the dream fell away. I grieved its loss. I looked at my hands but it was not there. I searched under the covers in the hope I had dropped it. It could not be found. It had all been a dream. There was no book. No written word. But, though the word was gone the message remained. Written on my heart.</span></div></div>",
            "created":1332579060,
            "id":1301449,
            "title":"A young man..."
        },
        "14":{
            "author_id":"dblameck",
            "author_name":"dblameck (David)",
            "choices":[
                "elderly man",
                "elderly woman",
                "young man",
                "young woman",
                "child"
            ],
            "content":"<div class=\"\"><div> <span>Ella to give her a name is a moderately pretty, young woman probably in her early twenties.  I never ask a woman her age.  They don't always tell the truth anyway.<br>\r\n<br>\r\nShe is five foot four inches tall or about 163 centimetres if you are into metric.  Please note however that this is in bare feet.  Ella is seldom in bare feet because she likes to wear high heels. I'm not talking about those great big platform things but she usually wears a conservative three or four inch heel.<br>\r\n<br>\r\nNow as to weight.  Asking a woman her weight is worse that asking her age.  I have the finger nail indentions on my arm to prove it.  Let us just say she is slender but does perhaps carry a few pounds on her backside.  Now I am not unhappy about that because I think its gives the perfect shape for a woman.<br>\r\n<br>\r\nShe is a fanatic about her skin.  I think she has every type of lotion ever made.  She also wears makeup but never looks like she has pasted it on.  A sort of natural look.  The lipstick is usually a pale pink unless she is dressing for a date. <br>\r\n<br>\r\nBecause she is very much a woman of today she does have a few piercing in which she wears some interesting jewelry.  Three holes in each ear with a small little ring, a larger one inch ring and then a hanging four inch ring.  Her tongue is pierced and she has a red and white ball which seems to dance in her mouth as she talks.  The final piercing  is in her belly button. <br>\r\n<br>\r\n</span></div></div>",
            "created":1332269940,
            "id":1298645,
            "title":"A young woman . . ."
        },
        "142":{
            "author_id":"jilu",
            "author_name":"Princess Zelda ",
            "choices":[
                "A woman",
                "A man",
                "A child/ A young girl or boy"
            ],
            "content":"<div class=\"\"><div> <span>Her name is Ann, she is in her late seventies. I had met her in my church and due to problems in my rented apartment I had to shift to some other temporary place for two weeks. I did not know her very well, I had seen her play the piano for the church choir and smiled at her a few times,but that's all I knew about her.<br>\r\n<br>\r\nWhen she heard about my situation, she came up to me and offered for me to stay at her house for no costs for as long as needed. I was shocked and surprised and very scared about her. I had no where else to go, so I shifted to her house. At first, I was shy and scared to talk or ask her anything, but soon we had become like two friends who had known each other for years together.<br>\r\n<br>\r\nWe spoke about various things, about life, her experiences and her days at my age now. She had not married and still lives as a single woman in that house, taking care of everything by herself. I asked her how does she manage life and reached so many years without anyone to be by her side. She said when God is there with her ,she does not want anyone else, He takes care of her.<br>\r\n<br>\r\nAt the end of two weeks, when it was time to leave, neither of us wanted to go our separate ways but I had to leave, so she invited me to her friends house where we had dinner and a lovely time.<br>\r\n<br>\r\nThis experience with her, has lifted my spirit to live a life with God as priority and also to make it a habit to talk and get to know elderly women..</span></div></div>",
            "created":1333174020,
            "id":1306420,
            "title":"elderly woman"
        },
        "144":{
            "author_id":"joanne4eva",
            "author_name":"blue jellybaby",
            "choices":[
                "Woman",
                "Man",
                "Child"
            ],
            "content":"<div class=\"\"><div> <span>Her name is Pip and I met her through University. We studied together, learned together, journeyed together. I think some people look at her and see an older woman but all I see is a woman filled with the joy of life; she always has a smile on her face.<br>\r\n<br>\r\nShe does some amazing work bringing older people and younger people together in order to break down the barriers and stereotypes. She does such a good job and makes it look really easy, when I think in reality it's probably something that's hard to do.<br>\r\n<br>\r\nShe really enjoys the simple things in life; spending time with her two beautiful daughters, holidaying at the weekend with her husband of four years, her dogs and her coffee. Oh how she loves coffee and cake! Although, she gave up cake for lent to test her will power and I do believe she's struggling with it a little!<br>\r\n<br>\r\nShe is the most amazing person I've met, she's so happy and vibrant and full of life and I have definately learned so much from her <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/smile.png\" alt=\"*Smile*\" title=\"Smile\" border=\"0\" width=\"15\" height=\"15\"></span></div></div>",
            "created":1332280680,
            "id":1298764,
            "title":"Young woman"
        },
        "1441":{
            "author_id":"joanne4eva",
            "author_name":"blue jellybaby",
            "choices":[
                "A man",
                "A woman",
                "A child"
            ],
            "content":"<div class=\"\"><div> <span>Her name is Sheila and she's my Aunt. I remember that in my childhood we didn't get to see her a lot, she worked hard and had a husband so it was a realy treat when we got to go over for a late night rendevouz with our parents or even got to stay! <br>\r\n<br>\r\nShe is one of the most kind and compassionate people I know. She's a great listener and always wants to support those around her. She's really loyal to her friends, as they are to her.<br>\r\n<br>\r\nShe's been through a tough time but come out of it fighting; she's a really tough woman and won't stand down to anyone anymore. She looks after my gran who lives in a care home. She visits as much as she can to take her out and spend time with her, even though it can be hard when Gran doesn't remember. She's a really patient person too; she never gets angry and always take the time to explain things.<br>\r\n<br>\r\nShe is also very welcoming. I visit her every week and we've been watching the Harry Potter films because she hasn't seen them and she makes me feel like her home is my home and I don't feel like that in any other place but my home. <br>\r\n<br>\r\nIn short she is truly an amazing woman and I'm really glad to have her in my life.</span></div></div>",
            "created":1333006740,
            "id":1304968,
            "title":"Woman"
        },
        "14412":{
            "author_id":"joanne4eva",
            "author_name":"blue jellybaby",
            "choices":[
                "A Woman",
                "A child"
            ],
            "content":"<div class=\"\"><div> <span>One of the most inspirational women I know is called Dawn and she works tirelessly and vigourously at the Rape Crisis Centre. She's the Development Worker there and ever since starting three years ago she's moving the Centre forward so much it's unbelievable.<br>\r\n<br>\r\nShe's a really straight-shooting person. If you ask her something she will tell you honestly, she can give criticism but she is not harsh with it. However, she's always full of compliments and whnever I talk to her she makes me feel happy and special. I don't think I've ever told her that.<br>\r\n<br>\r\nShe's in a loving relationship and has a beauitful baby daughter whom she dotes on. She's a really happy person and I think that really radiates to those around her; she's always full of life and willing to give things a go. <br>\r\n<br>\r\nWhen something seems a bit scary to me I always ask myself how Dawn would do it or how she would cope. I'm sometimes in awe of the way she's able to do things without it apparently having any affect on her; she seems to take everything in her stride.<br>\r\n<br>\r\nShe is one of the most amazing women I know and I'm proud to know her and proud of her.</span></div></div>",
            "created":1333006980,
            "id":1304970,
            "title":"A woman"
        },
        "144121":{
            "author_id":"ruwth",
            "author_name":"ruwth",
            "choices":[
                "A Woman",
                "A Man",
                "A Child"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\">I want someone to listen.<br>\r\n<br>\r\nIs that so hard to understand?<br>\r\n<br>\r\nI want someone to listen.<br>\r\n<br>\r\nAnd to lend a helping hand. <br>\r\n<br>\r\n<br>\r\nI want someone to listen.<br>\r\n<br>\r\nThoughts falling on deaf ears<br>\r\n<br>\r\nI want someone to listen.<br>\r\n<br>\r\nTo understand my fears.<br>\r\n<br>\r\n<br>\r\nI want someone to listen.<br>\r\n<br>\r\nIs that someone you?<br>\r\n<br>\r\nI want someone to listen.<br>\r\n<br>\r\nI really, really do.<br>\r\n<br>\r\n</div></span></div></div>",
            "created":1423008120,
            "id":1927657,
            "title":"A Woman"
        },
        "1441211":{
            "author_id":"ruwth",
            "author_name":"ruwth",
            "choices":[
                "Woman",
                "Man",
                "Child"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><font class=\"size4\" style=\"\"><span class=\"cgrape\">Who is she? I don't know. I thought she was my friend.<br>\r\n<br>\r\nThen came the day I realized that all I knew was her false identity.<br>\r\n<br>\r\nShe had never really listened to what I had to say. She was only being polite.<br>\r\n<br>\r\nThe words she spoke were empty words devoid of true connection.<br>\r\n<br>\r\nI cried a lot when I found out that all I knew was her false identity.<br>\r\n<br>\r\nI am asking her now to be real. I am asking for genuine interaction.<br>\r\n<br>\r\nShe says she wants to reconcile. She says she wants to connect.<br>\r\n<br>\r\nCan she? Is she capable of coming out from behind the safety of that false identity?<br>\r\n<br>\r\nCan she be real?<br>\r\n<br>\r\n</span></font></div></span></div></div>",
            "created":1460506260,
            "id":2132026,
            "title":"A Woman"
        },
        "15":{
            "author_id":"lilithmoon",
            "author_name":"Lilithmoon☽",
            "choices":[
                "An elderly man...",
                "An elderly woman...",
                "A young man...",
                "A young woman...",
                "A child..."
            ],
            "content":"<div class=\"\"><div> <span>Dakota Skye is her name and she is beautiful. Her eyes are brilliant and quizzical. Her smile shines so bright it warms me like the sun on a winter's day. Her sandy colored hair is long, straight and hangs to her waist in waves of gold. Her tiny hand in mine feels soft and light as an angel feather. She is seven years old and calls me, 'Grammy.' <br>\r\n<br>\r\nMy grand daughter saved my life. Let me explain, she saved my life by giving me a reason to live again. My world had become nothing but depression and pain. I was on the verge of giving up so often. Dakota was born and with her came a joy like I have never known. I wept at her birth. She brought pure love and happiness to my desolate world. <br>\r\n<br>\r\nNow, I cherish each and every day because I share them with her. More than that, I crave them. I am greedy for life. I want to live forever. I want to witness her life, watch her grow up, have a family of her own, and watch them grow up simply because they are a part of her. I want to be here to help her, teach her and protect her. I want to be whatever she has most need of. I would give my life for this child. <br>\r\n<br>\r\nI know regardless of what I may do for Dakota she has done far more for me. She has taught me to treasure my life and the world around me. She makes me want to be better than I am and gives me reason to endure any hardship. She holds my hand and calls me, Grammy. She keeps me on the path. </span></div></div>",
            "created":1332573180,
            "id":1301426,
            "title":"A child . . ."
        }
    },
    "info":{
        "author_id":"ruwth",
        "author_name":"ruwth",
        "brief_description":"As we walk along life's highway, we meet many people. Can we describe them? Let's try.",
        "created":1307098800,
        "description":"<td align=\"left\" class=\"norm\"><span class=\"cblue\"><font class=\"size4\" style=\"\"><b>Walkin Along Life's Highway . . .</b><br>\r\n<br>\r\nWalkin along life's highway . . .<br>\r\nLookin' from side to side . . .<br>\r\nSmilin' at the people you meet there . . .<br>\r\nTryin' hard not to cry.<br>\r\n<br>\r\nI came in touch with a young man's life.<br>\r\nHe had a smile so fine.<br>\r\nHe didn't need the love of a woman.<br>\r\nAnd so I could not give him mine.<br>\r\n<br>\r\nI met an elderly woman.<br>\r\nShe had so much to tell.<br>\r\nAnd if you didn't stop to listen.<br>\r\nWell, then she'd tell it to herself<br>\r\n<br>\r\nI met a young and handsome lad.<br>\r\nHe meant so much to me.<br>\r\nBut he was livin in a bottle.<br>\r\nSo he couldn't come live with me.<br>\r\n<br>\r\nWalkin along life's highway . . .<br>\r\nLookin' from side to side . . .<br>\r\nSmilin' at the people you meet there . . .<br>\r\nTryin' hard not to cry.</font></span><br>\r\n<br>\r\n<br>\r\n<b><span class=\"cgrape\">I wrote that song a long time ago. <br>\r\n<br>\r\nThe three people are real. <br>\r\n<br>\r\nOne of them is still in my life today . . . and still has a very fine smile. <br>\r\n<br>\r\nWe all meet people along the way and that is what this interactive is about. <br>\r\n<br>\r\nDescribe someone that you have met along life's highway.<br>\r\n<br>\r\nYour entry is to be non-fiction. <br>\r\n<br>\r\nDescribe a real person that you have met in five paragraphs or less.<br>\r\n<br>\r\nYour entry must be a minimum of five sentences.<br>\r\n<br>\r\nYou may write a poem instead of paragraphs if that is your thing. <br>\r\n<br>\r\nIf you write a descriptive poem, no less that three stanzas, no more than five.<br>\r\n<br>\r\nAt the end of your entry, offer these choices:<br>\r\n<br>\r\n<div class=\"bquote\"><span class=\"cred\">elderly man, elderly woman, young man, young woman and child.</span></div><br>\r\nAge is relative. <br>\r\n<br>\r\nIf you are writing about a 50 year old, you must choose elderly or young.<br>\r\n<br>\r\n<b>NOTE: I DID NOT KNOW THAT YOU COULD NOT ALWAYS ADD FIVE CHOICES.<br>\r\nTHANK YOU TO <span class=\"noselect\" style=\"cursor:pointer;\" oncontextmenu=\"uport_ajax_rt_opts (event, this, 'joanne4eva', '', '', '', '40', '', 'OFF', '100051356'); hide_uport (); this.shown=1; return false;\" onclick=\"uport_ajax_opts (event, this, 'joanne4eva', '', '', '', '40', '', 'OFF'); hide_uport (); this.shown=1;\"><a title=\"Username: joanne4eva\r\nMember Since: June 3rd, 2001\r\nClick for links!\" style=\"line-height: 1em;font-size:1em;font-weight:bold;cursor:pointer;\">blue jellybaby</a></span> <a class=\"imgLink imgPortLink\" onmousedown=\"if(event.which == 3) { event.preventDefault(); var mywin = window.open('https://www.Writing.Com/main/portfolio/view/joanne4eva','_blank'); mywin.focus (); event.stopPropagation(); return false; }\" href=\"https://www.Writing.Com/main/portfolio/view/joanne4eva\" target=\"_top\" onmouseover=\"uport_ajax2 (event, this, 'joanne4eva', '&lt;span style=\\'color:#990000;font-weight:bold\\'&gt;Offline or Private&lt;/span&gt;&lt;br&gt; Last On:  1/29/19', '1/29/19', 'June 3, 2001', '', '', '40', 'Preferred Author');\" onmouseout=\"hide_uport ();\"><span style=\"padding:0px 2px 0px 0px;vertical-align:middle;\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/costumicons/ps-icon-regular-40.gif\" width=\"30\" height=\"15\" border=\"0\"></span></a> FOR LETTING ME KNOW ABOUT THIS!<br>\r\n<br>\r\nIF YOU CAN ONLY ADD THREE, PLEASE USE:<br>\r\n<br>\r\n<div align=\"center\">MAN, WOMAN, CHILD</div></b><br>\r\n<br>\r\n<br>\r\nI look forward to meeting the interesting people in your life. <br>\r\n<br>\r\nI hope that you will use this interactive to hone your writing skills.<br>\r\n<br>\r\nMy grandchildren will be reading this so keep it appropriate for younger chilldren.<br>\r\n<br>\r\nThanks!.</span></b></td>",
        "id":1781902,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1537146900,
        "modified":1537146900,
        "pretty_title":"Walkin' Along Life's Highway . . ."
    }
}