{
    "chapters":{
        "1":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You and your owner are male",
                "You and your owner are female",
                "You are male, and your owner is female",
                "You are female, and your owner is male"
            ],
            "content":"<div class=\"\"><div> <span>You were running a test, studying the feasibilty of transporting matter, when you accidently got transported to a different reality. You find yourself in a glass cage, surrounded by many other humans. You hear a noise and look forward, you see a HUGE creature standing before you, you can see a bulge in its' shorts, so you know that this one is a male. You can see it has a long tiger like tail (only without the stripes).  The light colored blue fur on his body looks short and wiry.  Its’ face has a medium sized muzzle (in proportion to its’ body) medium sized ears that stood up straight, brown eyes that gave away no expression what so ever, a doglike nose and some fairly tight fitting jowls. It smiles as it looks down at you, \"Well my little friends, have we had a good day?  I certainly hope so because for many of you it will be your last!” jeered the creature.</span></div></div>",
            "created":1019883600,
            "id":101014,
            "title":"Finding yourself in a new world"
        },
        "11":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He chooses you",
                "He chooses someone else"
            ],
            "content":"<div class=\"\"><div> <span>Just then there was a commotion coming from behind the creature, four more creatures entered the room, they all looked basically the same as the first creature except a few of them seemed to be red in color as opposed to red and slightly shorter than the blue colored ones.  Upon closer inspection you suspect that these red colored ones were female, which would explain why they have different coloring.\r<br>\n“Why Enstay, you bought humans for this special occasion!” Said one of the females\r<br>\nThe blue colored creature next to the cage smiled and responded “Indeed I have, nothing is too special for the day my only son turns 21.”\r<br>\nThe other creatures smiled then the same red creature looked around and asked another question, “Where is Jonsa?”\r<br>\nEnstay thought for a second then responded, “He said he would be here shortly but that we should start to dine without him.”\r<br>\nThe red creature nodded approvingly then moved to a table that you hadn't noticed before that was loaded with some unusual, but good-looking dishes.  She took her seat and was soon joined by the rest of the creatures.  Shortly after they started eating you come back to your senses and move closer to one of the other humans in the cage.\r<br>\n“What is going on?”\r<br>\nThe human looks at you then back at the creatures before responding “We are, a delicacy among them.  We are usually bought by people who can afford us on a regular basis or like on this occasion as gifts for some great achievement.  We are bred for the sole purpose of being their dessert.”\r<br>\nYou stare at the other human for a couple moments but then you hear the door open and look over and see an apparently younger male creature walk in, smile and sit down at the dinner table.\r<br>\n“Are we to be desserts for everyone or just the birthday boy?”\r<br>\nThe prisoner looked grimly back at the stranger before responding “Traditionally each dinner guest gets the one for being present during such a special occasion and the person or people the special occasion is for will keep who is left over.”\r<br>\nYou sigh and wait a couple of seconds before he asked his next question.  “How long do humans given as gifts usually survive?”\r<br>\nThe prisoner thought for a second and sighed before answering “From what I have heard, on average, no more than two days, however there have been instances where the ‘gifts’ have survived for several weeks.”\r<br>\nYou look back at the young creature and sincerely hope that this one will want to keep you around for quite awhile.\r<br>\nThe creatures were finishing up their meals and a couple of them were looking at the humans with a look of hunger in their eyes.\r<br>\n“How are we typically eaten?” you ask\r<br>\n“One of three ways, one we may be chewed up alive, two they may eat us with some other food product, and third…” he hesitated a second before continuing, “Third we may be swallowed, alive.”\r<br>\nYou stare at him for a few moments comprehending what he just said.  Any one of those deaths would be painful, however the third seemed to be the most painful of them all.\r<br>\nThe first creature interrupt your thoughts suddenly “Well now that we are all finished with our meal why don’t we start with our dessert.”\r<br>\nAll the creatures nodded enthusiastically and started to lick their chops.\r<br>\n“Now remember, non of us may eat our human until we have all received one.” Reminded the first creature.  All of the other creatures looked slightly disappointed but excited nonetheless.  The first creature moved to the cage and picked it up and carried it to the table.  All the humans in the cage stood up fully and closed their eyes.  You look around and crouch behind a couple other prisoners so you won’t be easily spotted.  By this time the cage had reached the table and the first creature grabbed a human and placed it on his plate and placed an unusual food product on the person so he can’t move.  He moved the cage on to the next guest and waited for them to make a selection.  The creature, which was female smiled and reached in and grabbed a prisoner and held her in her hand tightly and smiled down on her.  Enstay moved on to the next guest and process was repeated.  This was done for every guest there until Enstay made it to his son.\r<br>\n“Ok son, chose which will be the lucky human.”</span></div></div>",
            "created":1019883600,
            "id":100908,
            "title":"Learning about the world"
        },
        "112":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He wants you to please him",
                "He wants you to clean his ass"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa smiled and reached in and grabbed the prisoner to which you had been speaking.\r<br>\nYou look on sadly as he was removed from the cage.  Enstay took the cage back to it original position then went back to the table.\r<br>\n“Alright, let us begin.”  Enstay reached down to his human, picked him up and unceremoniously tossed him in his mouth.  After savoring him for a few seconds he began to chew.  You can hear the crunching of bones from the cage and shuddered, imaging what it was like for the poor human.  All the other creatures were eating their humans in a similar fashion, one was chewing her human, two others were eating their humans with some food product, which you don’t recognize at all.  Jonsa however was still smiling down on his human while rubbing his belly.  After a few moments he raised him above his mouth and dropped him in.  Jonsa savored the taste of his human for several moments before he tossed his head back and swallowed.  You can watch no more and turned away, trying his best not to cry.  You notice the five remaining prisoners are acting much the same way.\r<br>\nAfter a few minutes Enstay spoke up.\r<br>\n“Well son how was he?”\r<br>\nYou turn back to see what was going on now and saw that all the creatures were done eating their humans.\r<br>\n“He was great dad, he tasted delicious and I can still feel him squirming around in my stomach!”  Jonsa said this with a very proud look on his face.\r<br>\nEnstay smiled back and said, “I am glad you enjoyed your present.  You are excused from the table to do what you want with the rest of your humans.”\r<br>\nJonsa looked at the humans with an evil look in his eyes and a broad smile on his blue face.\r<br>\n“Thank you father, I am sure I will enjoy them a lot.”\r<br>\nJonsa got up from the table and walked over to the cage, picked it up and left the room.  After leaving the room, Jonsa started running as fast as he could towards his room, while trying not to jostle the cage too much, he didn’t want to injure his humans too early in the game.  When Jonsa got to his room he promptly put the cage down on the table and looked down on his humans with pride.  He had been waiting for this day for 21 long years and now it was here.  He stepped back from the cage walked to his door and locked it then made sure his curtains were closed.  He then walked to the center of the room turned back to the cage and smiled broadly before he shucked off his shirt.\r<br>\nYou stare in shock; this creature had a very well developed chest and stomach.  He must work out a lot thought Peter.\r<br>\nJonsa started posing for his humans and chuckled a bit.  After a couple minutes he reached down to his shorts and slowly took them off.  He tossed his shorts on the floor without paying attention to where they landed.  Then he reached down and removed his tight, confining briefs.\r<br>\nYou have never seen anything so beautiful in all your life.  Jonsa had an absolutely huge sheath and ballsac, the sheath was nice and plump and was fairly long and had some very soft looking blue fur, not wiry like the rest of his body.  His ballsac hung down a ways and was also covered in the soft looking fur.\r<br>\nJonsa chuckled and posed for a few more moments before he walked closer to the cage.  Now everyone in the cage had a great view of Jonsas’ maleness as it was on eye level for them.  Jonsa smiled again then picked up the cage, carried it over to his bed and dumped all the humans on his bedspread.\r<br>\nYou were surprised when the cage turned over but was glad he landed on something soft.  You look around for moment before you get his bearings and looked up at Jonsa.\r<br>\nJonsa smiled down on his humans before he began his very well rehearsed speech.  \r<br>\n“You are all just supposed to be my food, I intend to make you more than that, for a while at least” he added with an evil grin.  “You shall all now get to now me, very intimately, and anyone who refuses to follow my orders shall be dealt with most severely.  Now before we get started we must choose a special human who will get special treatment.”\r<br>\nJonsa kneeled in front of the bed and started examining each human.  After a couple moments his eyes rested on Peter.\r<br>\n“You wear much better clothes than the others, you must be very special to them if you wear such rich clothes, therefore you shall be the special human.\"\r<br>\n You look down at your clothes and realized that they are a lot better than everyone else’s as they all wore rags while you are wearing street clothes from your world.\r<br>\nJonsa stood up “I will have to remember to be really good to you, but for now you will all receive the same treatment, at least until you get to know my body very well.”\r<br>\n</span></div></div>",
            "created":1019883600,
            "id":100906,
            "title":"He eats his first human, and takes you to his room"
        },
        "1121":{
            "author_id":"esgo0",
            "author_name":"Pricka Maguintus The Balltosse",
            "choices":[
                "Massage my cock",
                "Massage my feet",
                "Crawl in my mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jonsa says to you \"I want you to please me!\"<br>\r\n<br>\r\nYou breathed a sigh of relief that he wasn't going to eat you. \"How would you like me to please you master?\"</span></div></span></div>",
            "created":1395606480,
            "id":1766064,
            "title":"He wants you to please him"
        },
        "1122":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He puts you in a jar",
                "He wants you to sleep close to him"
            ],
            "content":"<div class=\"\"><div> <span>He smiled again then sat down on the bed a little bit away from the humans, he looked at them with an evil smile and moved over to the center of the bed and layed on his belly.\r<br>\n“You will all now clean my ass for me while I rest here” Said Jonsa with a definite chuckle.\r<br>\nThen Jonsa spread his legs apart as far as he could.  Now all the tiny humans could see deep into his ass and could see a faint outline of his anus and see the part of his ballsac that rested right below it.  All the humans could was just stare at the sight.\r<br>\nYou stare at the wonderful sight with a combination of awe, fascination and fear.  How were five tiny humans supposed to clean something that big? \r<br>\nAfter a few moments of not feeling anything from his backside Jonsa look behind him and saw all his humans starring at his butt and he couldn’t help but smile.  “Yes it is quite a beautiful sight isn’t it” he chuckled “Now why don’t you all get up and get to know it a little better?”\r<br>\nYou could tell from Jonsas’ tone of voice that this was their last chance and decided to get up and do as you were commanded. You get up and walk as slowly as he dared towards Jonsas’ ass.  As you get closer you notice Jonsas’ tail is thrashing around, apparently in excitement for the upcoming sensation.  When you arrived at Jonsas ass you look up at his anus, then look down at the ballsac right below it and decide to stand on it.  As you start to climb up onto the extremely large ballsac you notice an unusual smell, you stop for a second and try hard to recognize the smell, then you realize it was the smell of shit and was coming from Jonsas’ anus.  You get on top of the ballsac and steady yourself then look at the anus which was right in front of you, the smell is horribly strong here and upon closer examination it looked like Jonsa didn’t wipe himself the last time he took a dump.  You sigh as you realize that Jonsa had wanted to keep his ass dirty for his humans to clean.\r<br>\nJonsa could feel a human on his ballsac and was waiting patiently for the human to finish admiring his anus and start his work.\r<br>\nYou start to rub Jonsas’ anus and are doing your best to clean the titanic hole.  You aren’t sure what to do with the stuff you clean from the hole so you just take a hand full and toss it on the bedspread.  You spend several minutes trying to clean the hole before you realize the other humans aren’t trying to help.  You looked over your shoulder and see that they were all just sitting down staring at you.\r<br>\nYou get mad and yell out “Hey you guys!  Don’t you realize that if we keep him happy he might let us live a while longer?!  Get up here and help me out!”\r<br>\nThe other humans all looked at each other for a moment than apparently decided they liked the idea of cleaning Jonsas’ shit a lot more than becoming it so they started coming over to help.  After a couple minutes the majority of the humans were perched precariously on Jonsas’ ballsac and trying their best to clean him.  Those who couldn’t fit on the ballsac busied themselves by cleaning other parts of his ass that had gotten a shit treatment and not been cleaned.\r<br>\nJonsa loved the sensation of all those hands pressing up against his most private of regions, no one else had ever touched or ever been close to that hole except for Jonsa so this was a new and great experience for him.  He enjoyed the sensation for several minutes and was groaning in pleasure when he felt it.  He smiled as he realized what that feeling was and decided to do it.\r<br>\nThe humans down at his ass suddenly heard a gurgling sound come from the anus they are working on and wondered what was going on when all of the sudden the hole flexed, and released the most noxious fart they had ever smelled.  The force of the fart blew all the humans off his ballsac and they all ran away from his ass as fast as they could to get away from that smell.\r<br>\nJonsa chuckled as he watched his humans run away from his fart and felt extremely proud of himself.  He looked at his alarm clock to see how much more time he had to enjoy his new humans and groaned as he saw it was past midnight and that he would have to wait until tomorrow.  He turned over and sat down so he was facing his new pets.\r<br>\nYou look behind yourself and see Jonsas’ huge sheath and ballsac not too far away and can’t help but stare, all the humans are also staring, they didn’t get this good a view from their cage because the glass had distorted the image and they were too terrified to admire it much.\r<br>\nJonsa smiled as he saw them all stare at him.  “Don’t worry, most of you will get to know this part of me very well.  But for now I must put you back in your cage and say goodnight.”  Then Jonsa noticed a small pile of his shit on the bedspread and smiled.  “I see you all worked hard at what I assigned you, good.  That means that most you will probably live for quite awhile with me.”  Jonsa smiled as he reached down and grabbed all the humans, except for you, got up and walk over to their cage.\r<br>\nAs Jonsa was walking to the humans’ cage you can’t help but watch, hypnotized, as Jonsas’ huge ballsac sway a bit between his legs.\r<br>\nJonsa got to the humans cage and dropped them all in, then took the black cover for the cage and put it on the cage.  Then Jonsa walked back to his bed, reached down and grabbed you and raised you up to his face.\r<br>\nYou look at Jonsas’ face with fear and admiration and wonder what is going to happen.  \r<br>\nJonsa smiled at him and said “Don’t worry, I am not going to eat you yet.”  Jonsas’ other hand went to his belly and rubbed it.  “Your friend will tide me over for a while, would like to see how your friend is doing?”\r<br>\nYou wonder what he meant when all of the sudden you find yourself in front of Jonsas’ large stomach.  \r<br>\nJonsa pressed him up against his hairy flesh fairly hard and said “Listen.”\r<br>\nYou can’t help but listen; all you hear is gurgling coming from the other side and realize that was the sound of Jonsa working on your friend and also his dinner.  You can’t help but shudder a bit as you listen to the sounds.\r<br>\nAfter a few moments Jonsa raises you back up to his face and says, “Goodnight my special little pet, I will wake you up in the morning before I go to school.”</span></div></div>",
            "created":1019883600,
            "id":100910,
            "title":"Clean his ass"
        },
        "11221":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He takes you with him",
                "He leaves you with Samsa"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa then takes you over to your own small jar, drops you in and screws on the lid which had some holes punched in it earlier.\r<br>\nJonsa smiled again as he thought of how long he had waited to get his own humans and how much that waiting was being rewarded before he went over to his bed, turned off the light and went to sleep.\r<br>\nYou couldn’t sleep for a while, you were just to engrossed as you think over the events of the night.  But after a while sleep finally overtakes you.\r<br>\nYou are woken up with a start the next morning by a very loud sound.  You get up and look around and realize it was Jonsas’ alarm clock.  Jonsa groped around for the alarm clock and pushed the snooze button and layed on his bed for a few moments before pushing himself into a sitting position.  You wonder what is going to happen today then you remembered that Jonsa had mentioned school.\r<br>\nJonsa took a few moments to fully wake up then he walked over to his bathroom and closed the door.\r<br>\nAfter a few minutes you can hear the sound of running water and realize Jonsa must be taking a shower.  After several minutes the water shuts off and Jonsa emerged from the bathroom.  He was in the process of toweling himself off.  You watch Jonsa towel himself off and after a few minutes Jonsa looks over in your direction and smiles.\r<br>\n“How did you sleep little one?  I hope you slept well because we have a big day ahead of us.”\r<br>\nYou can’t help but wonder what he meant by that as you watched Jonsa put on his briefs and start looking around for his shorts.  After he found his shorts he looks over at you thoughtfully for a few seconds, then smiles and walkes over to your jar.  Jonsa unscrewed the lid of the jar and reaches in and grabs you.\r<br>\nJonsa looks over the tiny human in his hand, smils and asks “Would you like to come to school with me today?  I am sure you would, I just have one rule.  If you go with me, don’t distract me too much from my studies.”\r<br>\nYou wonder how you could distract him from his studies when you are slowly lowered down, you look to see where you are headed and realize it is Jonsas’ briefs.\r<br>\nJonsa pulls the elastic of his briefs away from his body and drops you in.  Once you have cleared the elastic of his briefs Jonsa let them snap back into place and smiles as he feels you land on the tip of his sheath.  He enjoys the sensation of his tiny human struggling to find a comfortable place to sit for few moments then finished getting dressed.  Once he had finished he left his room and headed for breakfast.  As Jonsa walked into the kitchen he could smell his favorite breakfast was being cooked and smiled, his mom always spoiled him rotten and she was doing it again by making his favorite breakfast.  \r<br>\nAs he sat down at the table his father looked down from his newspaper, smiled and asked, “Did you enjoy your humans last night son?”\r<br>\nJonsa smiled back and said, “Yes father I enjoyed them a lot.”\r<br>\nHis father smiled again “I remember when I got my first humans, I made them do so many things to please me before I ate them.  Sometimes I wish that humans weren’t so expensive so I could do it everyday.\r<br>\nJonsa smiled and nodded.  He could still feel his human moving around in his briefs so he is a little distracted.\r<br>\nThen Jonsas mother brought over breakfast and they all started eating.\r<br>\nMeanwhile in Jonsas briefs you are really enjoying yourself, you are sitting on top of the largest sheath you have ever seen and are loving the feeling of its’ soft flesh and soft fur as you move against it, you can smell the soap that Jonsa had used in his shower and you can also smell Jonsas’ musky male scent, it makes you feel really giddy.\r<br>\n After they had all eaten breakfast Jonsa thanked his mom for making it and left for school.  As he walked the short distance to his school he could feel his human struggling to find a handhold so he could stay on his sheath and smiled.\r<br>\nYou are having an extremely hard time keeping your position on Jonsas’ sheath and slowly slide off the top of it.  As Jonsa entered his school campus you finally lose your hand hold and slowly slid down the length of the sheath.\r<br>\nJonsa shuddered as he felt his human slid down his sheath and smiled in pleasure.  Then he spotted his best friend and walked over to him.\r<br>\n“Did you get them?” asked Samsa excitedly\r<br>\nJonsa smiled, nodded and patted his crotch.  Samsa smiled very broadly.\r<br>\n“How does it feel?”\r<br>\n“It feels absolutely wonderful.”\r<br>\n“See, I told you humans were the best.”\r<br>\n“True you did, so how many of your humans are left?”\r<br>\n“Three, counting the one I brought with me.”\r<br>\n“We’ll have to let them meet each other at lunchtime.”\r<br>\n“Yes we will, sorry but I have to go.  I can’t be late for class again or I will have to clap erasers.”\r<br>\nSamsa ran off to his first class while Jonsa made his way to his first class.  When Jonsa got there he made it to his desk and took out his notebook and prepared himself for another slow morning learning about psychology.  Jonsa loved his college but this was the only class he didn’t like, his professor made the whole subject seem as much fun as a broken computer.  As his professor walked in and started addressing the class, Jonsa felt his human stop moving, he must be tired thought Jonsa as he tried to pay attention.\r<br>\nYou are indeed very tired, you can no longer summon the strength to try to beat off Jonsas’ huge ballsac as it engulfs you and pins you against Jonsas’ briefs.  While you are being pinned by Jonsas’ ballsac you take the time to enjoy yourself, you enjoy the heat coming from it, the soft feeling of its flesh and fur and sensation of the huge balls inside being pushed against your body.  You are enjoying yourself so much you soon fell asleep.  You are awoken suddenly when you feel the briefs move around, you look up and see the elastic is being pulled away from Jonsas’ body again and a hand reaching in and grabbing you.  You are pulled out of the briefs and into the blinding light of day, after a couple seconds your eyes adjust and look around, you realize you are in a lunch room and there are many creatures eating around you, one or two of them even has humans as part of their lunch.\r<br>\n“Put him down on the table Jonsa.”  You look to see who had spoken and see another blue colored creature sitting close by.\r<br>\nJonsa lowers you to the table and says “Now you take yours out.”\r<br>\nYou watch as the other blue creature reaches into his briefs and pulled out another human.  He lays him on the table and says “Meet Jonsas’ human, I am sure you two would love to become friends while me and Jonsa talk.\"\r<br>\nWhile the two friends started talking above them you walk over to the other human and help him into a sitting position.  “How long have you been with the other creature?”\r<br>\nThe other human looks at you with tired eyes “I have been with Samsa for about a week now.”\r<br>\n“Does he treat you nice?”\r<br>\nThe other human gave a grim smile “Of course not, he has made clean his ass, clean his sheath and clean his teeth and many other things I would rather not talk about.”\r<br>\nYou were about to ask another question when you hear Jonsa say “Excuse me for a moment, I have to go take a dump.”</span></div></div>",
            "created":1019883600,
            "id":100916,
            "title":"Taken to School"
        },
        "112211":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You decide to look",
                "You decide to try and escape!"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa looks down at you, and grins evilly, before reaching down and picking you up.  he encloses you in his fist as you feel him stand up, and start walking.<br>\r\nIt is quite warm and confined in here, you can hear lots of chatter and talking going on outside his fingers and palm.  you shiver, thinking of how many hungry, predatory creatures are so close by to you. Jonsa walks for a couple minutes more, until you hear a door slam, then the click of a lock, and finally, the sounds of a pair of pants being undone.<br>\r\na few moments later, you suddenly find yourself free falling!  you scream in terror, for about a split second, before you land on a large, powerful, furry, warm, muscular thigh.  you sit up, and realize that Jonsa is sitting on a toilet, with you on his lap!<br>\r\nHe grins down at you, and chuckles as you hear a fart emanate from within the toilet bowl. \"mmmmm, here I go.  you can sit there with me, or, you can dare to look down, and watch as I take my dump!\"</span></div></div>",
            "created":1074229200,
            "id":185057,
            "title":"He takes you with to the bathroom"
        },
        "1122111":{
            "author_id":"chibitrunks2",
            "author_name":"Chibitrunks2",
            "choices":[
                "nod and say yes.",
                "shake your head no, and try to make a run for it."
            ],
            "content":"<div class=\"\"><div> <span>You sit there so you don't make Jonsa upset.  He smiles down at you and grunts. You look down between his slightly opened legs and watch as a bluish-brown  log slides out of his rectum.  He sighs and farts again, causing his stool to empty out into the bowl with a splash. You watch it sink to the bottom, then several other logs join it. He flushes and grins at you. You look up at Jonsa, smiling nervously. \"So did you like that little one?\" You...</span></div></div>",
            "created":1084510800,
            "id":199326,
            "title":"The Crapper"
        },
        "112212":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Jonsa wants you for lunch",
                "You stay with Jonsa for the rest of the day"
            ],
            "content":"<div class=\"\"><div> <span>“Hurry back.” Replied Samsa.  After he watched Jonsa walk away he looked at the two humans and smiled evilly.  “Why how stupid of me, I seem to have forgotten my lunch money, oh whatever shall I do?”  Then he suddenly reached down and grabbed both humans.  He looks at you and says, “Watch, this is what will happen to you eventually.”  Samsa opened his mouth and slowly lowered his human to it.  You could only watch as the other human screamed and struggled as hard as he could before he is dropped in Samsas’ mouth.  Samsa looks at you, smiled and opened his mouth so you can see what is going on inside it.  You stare as you see your new friend laying on Samsas’ tongue, struggling not to slide down his throat.  After a few moments Samsa swallowed him while keeping his mouth open so you could see his tongue rise, then fall and see that Samsas’ mouth is now empty.  After a couple seconds Samsa burped, then he closed his mouth and smiled.\r<br>\n“Your friend is struggling very hard in my belly, oh that feels so good.”\r<br>\nAs he said this he lowers you to his belly, Samsa lifts up his shirt a bit and shoves you up against it.\r<br>\n“Listen to your friends final moments, sometime tomorrow he will be nothing more than shit passing through my anus.”\r<br>\nYou could hear gurgling and some faint screams coming from Samsas’ belly and shudder as you hear that.\r<br>\nAt that moment Jonsa walked back up to the table, he looked at the scene and smiled.  He sat down.  “May I take a wild guess as to where your human is?”\r<br>\nSamsa smiled and replied, “I will give you three guesses, but you will only need one.”\r<br>\nJonsa smiled again and asked, “Is he struggling very much?”\r<br>\nSamsa groaned in pleasure, “he is struggling a lot, too bad this will only last for about an hour.”\r<br>\nYou shudder again, just the thought of being in there for an hour makes you terrified, you had been hoping it would just be a few minutes at most but now you know it will in fact be a very long time.</span></div></div>",
            "created":1019970000,
            "id":101024,
            "title":"Meet the Monsters friend"
        },
        "1122122":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Jonsa starts off",
                "Samsa starts off"
            ],
            "content":"<div class=\"\"><div> <span>Samsa handed Jonsa his human back, “I will meet you at your house later today, ok?”\r<br>\nJonsa smiled and nodded then stuck you back in his briefs.\r<br>\nYou spend the rest of that day in Jonsas’ briefs, being crushed by his ballsac and the balls that would move a bit with each step that Jonsa took.  After you have spent another couple hours in Jonsas’ briefs with no break you find that you're starting to like Jonsas’ ballsac very much.  It is just too soft and comfortable to be against for you to not like it.  After another hour or so passed you hear a bell ring and feel Jonsa get up fast and walk very quickly somewhere.  You could only guess that you are headed back to Jonsas’ house.  After a while you hear a door slam and assume you are back at Jonsas’ home.\r<br>\n“Mom, Dad I am home!”\r<br>\n“Ok son, we are in the kitchen.”\r<br>\nYou feel Jonsa walk some more as he moves to the kitchen.\r<br>\n“Son, we have been invited to a party.  We leave in 10 minutes.”\r<br>\n“I is wondering why you guys were all dressed up.  How long will you be gone?”\r<br>\n“The party is out of town and is supposed to last all night so we will probably just spend the night there.  We have left you some money for pizza.”\r<br>\n“Ok, thanks.  Is it ok if I have a friend over for a while?”\r<br>\nThere is a short pause “Sure, you may have just one friend over.”\r<br>\n“Thanks, enjoy your party.”\r<br>\n“We will son, see you later.”\r<br>\nYou feel Jonsa start walking again.  After a few minutes you hear the slam of a door and assume that he has reached his room.  Suddenly you are blinded by daylight and look up to see a large hand coming down to grab you.  The hand grasps you roughly and raises him out of Jonsas’ briefs and takes you up to Jonsas huge face.\r<br>\n“Did you enjoy your day in my briefs little one?  I know I did!” Jonsa smiled.\r<br>\nYou smile back and shouted “Yes master, I loved being so close to your balls for so long.”  You couldn’t help but notice that Jonsas’ smile grew when you said the word master.\r<br>\n“My friend Samsa will be over soon, I know we will all have a lot of fun when he gets here.  I might as well order the pizza now so it will get here shortly after he does.”  Jonsa places you on his desk next to the cage where the other humans are.  “Don’t go anywhere my pet.”\r<br>\nYou watch as Jonsa walks out of the room and couldn’t help but admire Jonsas’ butt as he left.  You notice a small hole in the seat of his shorts for his long tail and smiled at the image.\r<br>\nAfter Jonsa had left you walked over to the cage and scream into it.  “What have you guys done today?”\r<br>\nOne of the humans inside responds “We haven’t done anything except count our blessings that we are still alive and haven’t been forced to do anything nasty all day.  Though that is likely to change very soon.”\r<br>\nYou can’t help but agree with that, you are pretty sure that Jonsas’ friend isn’t coming over here just to watch some videos with Jonsa.  You hope they aren’t too rough with you tonight.\r<br>\nThen you hear a door slam downstairs and some loud male sounding voices.\r<br>\nSamsa must be here, you decide.  You hear the voices continue for a few moments then some clumping as two very large forms climbed the stairs.  You look at the open door and wait for the two friends to come in.  You don’t have to wait long, first Jonsa comes in, followed by Samsa.  Both boys were grinning broadly.\r<br>\n“So your parents are going to be gone all night!  We can do whatever we want!”\r<br>\nJonsa smiles “As long as we don’t break anything or invite anyone else over yes we can.”\r<br>\nSamsa smiled back “Oh, I think we can get by without inviting anyone else over for tonight.”\r<br>\nBoth boys smile evilly and look over at you and the cage.  You get a chill from that look.\r<br>\n“I also brought along my last human to join us.”\r<br>\nJonsa smiles “I can guess where you are keeping him until the party starts.”\r<br>\n“You would probably guess right.”  Samsa smiles then patted his crotch\r<br>\nJonsa smiled again “Unfortunately we will have to wait until the pizza gets here before we can get, too involved.”\r<br>\nSamsa smiles again “No problem, the pizza gets here in about an hour so we can enjoy ourselves at least a little bit before it comes.”\r<br>\nJonsa smiles and nods then walks over and picks you up in one hand. He then took the cover off the cage and reached in to grab the remaining humans.  He manages to fit them all into one hand and starts walking out of his room towards the family room.\r<br>\nWhen you reach the family room Samsa reachs into his briefs and pulls out his human, and then he dumps him on the coffee table.  Following suit Jonsa dumps all his humans on the coffee table, then turns to Samsa.\r<br>\n“I have already closed all the windows so we won’t have to worry about prying eyes.”\r<br>\nSamsa smiled “Then why are we still wearing this stuff?”  He quickly takes off his shirt to reveal his chest and stomach were just as developed as Jonsas were.\r<br>\nJonsa smiles and also takes his shirt off, revealing once again his wonderfully formed torso.\r<br>\nSamsa, still smiling, reaches down and takes off his shorts quickly but when he takes off his briefs he goes extremely slow to make it more dramatic. When he is done he reveals his sheath and balls were just as beautiful as Jonsas’ if not more beautiful.\r<br>\nAfter admiring the site for a few seconds Jonsa reached down and also took off his shorts and also like Samsa when he took off his briefs he went extremely slow.  When he is done he once again reveals his wonderful looking package.\r<br>\nYou are too busy admiring both boys from this wonderful angle to notice that the other humans had looked away.\r<br>\nBoth boys looked at the humans on the coffee table.  They both smile again.\r<br>\n“They seem to be scared of seeing us naked Jonsa.”\r<br>\n“All except my favorite little human, he seems to like the site of us, we will have to give him some special treatment.”\r<br>\nSamsa nods “We will play with him all night and show him every part of both of our bodies.  Shall we start my friend?”\r<br>\n“Yes I think we shall.”  Jonsa smiles, walks over and picks up all the humans and steps back.  Samsa stepped forward and moved the coffee table out of the way.\r<br>\nBoth boys sat down on the carpet with their feet together.  Jonsa dumped all the humans between their legs.\r<br>\nAfter you have sat up from your fall you look around.  You smile as you realize that you could see two sheaths and balls from where you are.</span></div></div>",
            "created":1019970000,
            "id":101026,
            "title":"Having a friend over for fun"
        },
        "11221222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Jonsa chooses you",
                "Jonsa chooses someone else"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa looked at Samsa and smiled “Do you want to start off?”\r<br>\nSamsa smiled “I think I will.”  He layed down on his back with his hands folded behind his head.\r<br>\nYou stare at the sight of Samsas’ ass and couldn’t help but admire it.\r<br>\n“All right humans, start massaging my friends ass.\"  Or you will be in BIG trouble.”  Jonsa giggled at his pun.\r<br>\nYou look again at Samsas’ ass for a second and could faintly make out his anus from here.  You manage to suppress a smile and started walking over.  “Come on guys, might as well try to make these guys happy.”\r<br>\nThe other humans looked at each other and sighed before they also got up and started walking towards Samsas’ ass.\r<br>\nAs you got closer you realize that Samsas’ tail is poking out one side of his buttocks so that it is out of the way, then he saw why.  Samsas’ anus is just a few inches off the ground (In human terms).\r<br>\n“Do you guys like the sight of my huge Bajirran ass?”\r<br>\nYou sigh and finish walking up to Samsas’ anus and start rubbing it.  As you start your labor you notice that Samsas’ ass is much cleaner than Jonsas’ was last night.  He must want to be able to feel our hands better you thought.\r<br>\n“Hey, human! Yeah, the one that Jonsa brought to school today.  You are touching where your friend will be coming out soon.  Probably even tonight!  You will get to see your friend again, won’t that be great?”  Samsa and Jonsa chuckle at that.\r<br>\nYou shudder from fear at what Samsa just said.  It is true, what you are now massaging is where your friend will come out eventually.  You sincerely hoped it won’t be tonight though.\r<br>\n“Don’t worry little human, I don’t usually feel the urge to go until after I eat so you have a while.”  Samsa chuckled again.\r<br>\nYou shudder again.  You hear a groan come from Jonsa and turned around to see him lay on his back as well.\r<br>\n“Half of you humans continue your work on Samsa and the other half come over to me.”\r<br>\nYou start to leave to go over to Jonsa when Samsa stops you.\r<br>\n“You, special human will stay here so you will get to know very well where your friend and possibly later on, you will come out.”\r<br>\nYou sigh, you don’t have a choice.  Jonsa doesn’t seem to care much about what Samsa said so you go back to massaging Samsas’ ass.  You feel Samsas’ anus flex a bit beneath your hands and hear Samsas’ moans of pleasure so you knew you are keeping him happy.\r<br>\nAfter several minutes of this you hear what sounds like a doorbell amplified several times.\r<br>\n“Be right there!”\r<br>\nYou look over and see Jonsa get up and shove some shorts on as fast as he could as he ran to the door.\r<br>\n“Don’t stop your work, humans.”\r<br>\nYou sigh as you go back to massaging Samsas’ anus while Jonsa got the food.\r<br>\nAfter a few moments Jonsa came back.  “Enjoying yourself there Samsa?”\r<br>\n“Oh, yes indeed I am.”\r<br>\n“Don’t get too attached to them.  You know where they are going don’t you?”\r<br>\n“In your belly and out your anus? I know that!  I know what happens to food after we eat it!  I pay attention to some of my classes you know!”\r<br>\n“I know, I is just reminding you not to get too attached to my food.”\r<br>\nYou feel a hand suddenly grab you and all the other humans around Samsas’ ass and lift you up.\r<br>\n“I is just hoping I could have one or two of them go into my belly too you know.  I mean, I shared a couple of my humans with you didn’t I?”\r<br>\nYou heard Jonsa sigh.\r<br>\n“Yes you did, but you had more humans than I do so you may have ONE!  And it can’t be my special human either!”\r<br>\n“Oh but he is so cute and looks so delicious!  I am sure he would just love to come out my anus!”\r<br>\n“Well he is coming out my anus so you will have to choose another one.”\r<br>\n“I will after we start on the pizza”\r<br>\nYou watch as Jonsa moves the coffee table back and place the Pizza and the humans who had been massaging him on it.\r<br>\nSamsa took a seat on the couch and instead of placing his humans on the coffee table, he placed them in front of his package.\r<br>\n“Hey!  That is a good idea!  But my special human should be with me so I will trade one of my old ones for him.”\r<br>\nYou feel Jonsas’ hand grab you and pull you away from Samsas’ ballsac and watch as his other hand places some other human in front of Samsa.  Jonsa sat down and places you and the other humans in front of his own package.\r<br>\nYou smile as you once again feel Jonsas’ soft ballsac against your skin and look up.  Past Jonsas’ sheath, which towers over you, you can see Jonsa take a bite out of a slice of pizza as he turns on the T.V.\r<br>\nAfter a few minutes of watching TV Jonsa looks over at Samsa.  You also look.\r<br>\nYou can see Samsa pick up his human, the one he brought with him, and place him on the tip of a slice of pizza and take a large bite out of it.\r<br>\n“That is a good idea Samsa, I think I will do that with one of my humans as well.”</span></div></div>",
            "created":1019970000,
            "id":101034,
            "title":"Starting the night of fun"
        },
        "112212222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Jonsa does mind",
                "Jonsa doesn't mind"
            ],
            "content":"<div class=\"\"><div> <span>You look up and watch as Jonsas’ hand came down and snagged some unfortunate human, raise him up to his slice of pizza and embed him in the cheese.  After a couple moments of smiling at the human on his slice of pizza Jonsa opened his mouth wide, took a large bite and began to chew.\r<br>\nYou looked away, you can’t bear to see a human die that way.  You didn’t look back up until you heard Jonsa swallow.\r<br>\n“GULP!  MMMM, that made the pizza taste very good!”\r<br>\n“Yes it sure did.”\r<br>\nAfter a few more moments of eating Jonsa said “So much for that pizza.”\r<br>\n“You know what is a great dessert for pizza?  A human, I think I will now eat that one human you promised me.”\r<br>\nYou looked over as Samsa reached down between his legs and grabbed the last woman of their original group.  He smiled at her for a second then opened his mouth and tossed her in.  He closed his eyes and rolled her around for a couple seconds then he swallowed.  He leaned back and patted his belly with a very content look on his face.  “She will probably live for a couple hours because the pizza will take up most of my acids.  However, on the downside that will make it a most slow and painful death.”\r<br>\nPete heard Jonsa laugh “It will probably feel great to have her struggle in your belly during that time.  The human I swallowed was dead in about an hour.”\r<br>\n“Yeah, that is about the average time it takes for a human to die in a Bajirrans’ belly” Samsa responded with a smile.\r<br>\nYou suddenly hear a fart come from Samsa.\r<br>\n“Oops, I guess that is the human I ate for lunch saying he wants to come out.”  Samsa looks over to Jonsa “Do you mind if I show your special human what has become of his new friend?”</span></div></div>",
            "created":1019970000,
            "id":101035,
            "title":"Human on the pizza and a human for dessert"
        },
        "1122122222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He craps while laying on the  floor",
                "He uses the toilet"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa smiled  “No, I don’t in fact I would like to show him what has become of the human I ate yesterday.”\r<br>\nSamsa smiled again. “I am sure he would be honored. Actually it is kinda funny if you think about it, he will get to see two of his former friends tonight even though they were eaten on different days, just because of the different speeds of our digestive systems.  You and I both know that your digestive system is slower than mine.  We timed them.”\r<br>\n“Yeah, that is right.”  Jonsa nodded.  “You and I swallowed tiny flashlights that had a very long battery life and every time we pooped we would check them to see when they came out.  Yours came out in like 6 or 7 hours and mine came out in 24.  So the timing is right for both humans to come back out.”\r<br>\nYou shudder, tonight you will see two of your former friends come out of these creatures asses, and they wouldn’t be the same as you remember them. Samsa smiles down at you.\r<br>\n“I will go first, I am sure he would love to see his newest friend before he sees his oldest friend.”\r<br>\nSamsa reached down, grabs you and starts heading for the bathroom while Jonsa smils after him, patiently waiting his turn.\r<br>\nYou shudder as you watch the door to the bathroom come closer and closer, knowing that once your inside you will be forced to watch Samsa crap out the remains of the human you knew for a short time.  Samsa entered the bathroom and closed the door behind him as he set you on the counter next to the sink.  As you look around you are surprised at how large the bathroom is.  There is more than enough room for a person to lay down comfortably on the floor.</span></div></div>",
            "created":1019970000,
            "id":101036,
            "title":"Taken to revisit an aquaintance"
        },
        "11221222221":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You ignore his warning",
                "You pay heed to his warning"
            ],
            "content":"<div class=\"\"><div> <span>This thought caused a small moan to come from you.  You now realize just how good a view you will get of your former friend coming out of Samsas' ass.\r<br>\nSamsa smiles at you as he unrolls some toilet paper and placed it on the floor so he wouldn't make any kind of disgusting mess while he gave this show for you.  Then he grabbed you and sat down just in front of the toilet paper.  Then he scooted forward and layed on his back so the toilet paper is right below his anus.  Then he made sure his tail is out of the way before he moved you right in front of his anus, which is right above the ground.\r<br>\nYou sigh as you looked at the anus right in front of you and waited for it to start flexing.  You waited a few moments then look up to see Samsas' face looking down on you with a smile.\r<br>\n\"Aren't you going to beg me not to crap right in front of you?\"\r<br>\nYou suddenly realize that Samsa did this for two reasons, one to hear his victim beg him not to crap in front of him and two to scare the victim by showing what he would eventually become.  \"No, I will not give you that pleasure Samsa.\"\r<br>\nSamsas' smile faded slightly then he shrugged \"Have it your way, now watch closely and don't you dare close your eyes or you might find yourself in a foul smelling and warm place.\"</span></div></div>",
            "created":1019970000,
            "id":101037,
            "title":"Getting a ringside seat to a crap show"
        },
        "112212222211":{
            "author_name":"Chibitrunks2",
            "choices":[
                "Samsa shits you out infront of Jonsa.",
                "Jonsa decides to shove more humans up his friends butt."
            ],
            "content":"<div class=\"\"><div> <span>You ignore what he said, really not wanting to see a fellow man get pushed out this creatures behind.<br>\r\nYou close your eyes and look the other way, covering your nose also. \"You asked for it!\"  You suddenly picked up by Samsa.<br>\r\nYou open your eyes and see him grinning evilly at you. \"Well since you won't listen to me, I guess I'll have to punish you! Now prepare for a foul smelling, and tight squeeze!\"<br>\r\nYou scream as you approach Samsa's anus.  He grins and giggles, as he slowly rub you up and down his anus. <br>\r\nHe turns you around and place your feet into his anus.  <br>\r\nYour ankles squeeze together as his tailhole clenches and puckers.<br>\r\nYou can feel the turd that he was ready to expel at your feet, you shiver and almost begin to cry as he slowly but surely inserts you into his ass.<br>\r\nFinally your body makes its way up his rump, only your arms and head sticking out.<br>\r\nHe laughs one last time and quickly pushes you all the way in.<br>\r\nYou gag and cringe as you see his anus close, trapping you in there with what's left of your friend.  The turd squelches forward, encasing your body in it.  Only your head sticks out from it, causing you to be forced to smell it continuously.  You choke and gag, the smell horrid and putrid. <br>\r\nYou feel him get up and head outside the bathroom.  You hear a couple of voices and then a hardy laugh.  You get the feeling Jonsa thinks that it's funny.<br>\r\n</span></div></div>",
            "created":1053752400,
            "id":158853,
            "title":"Punishment!"
        },
        "1122122222111":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "there is more poop up in that rectum, ready to come out",
                "Samsa and Jonsa have other plans in mind......"
            ],
            "content":"<div class=\"\"><div> <span>You can hear Samsa murr around you, still leaving you trapped deep inside of his bowels, with his turd, ready for passing, engulfing all of you but your head and arms, forcing you to sit deep in the remains of your former friend, who had the misfortune to meet Samsa's hungry belly, and get turned to this.  you ehar him murr again, then there is a slight movement.... and then, all of the sudden, the muscles around you squeeze and contract with suprising force, pushing you even deeper into the moist, thick, and horribly smelly turd.  as you are pushed in deeper, you can feel bones and other harder parts of your former friend brush and rub against you, or get pushed out of your way as you make your way deep into his digested remains.  You wrinkle your nose in absolute disgust, and fight down that load of bile that wants out of your stomach.<br>\r\nthe muscles around you squeeze and contract again, and slowly forces you, and the turd, towards the puckering and winking anus.  you feel your head press against it, squishing you between smelly, and extremely filthy, inner anus flesh, and the nasty turd you are stuck inside of for now.  you are slowly forced through the anus, feeling it squeeze and compress you a bit as you pass through.  then, light! there is light all around!<br>\r\nyou see Jonsa laying on his stomach behind Samsa, watching intently, a huge grin on his face as he watches the turd you are stuck inside of slowly slide from his friend's flexing hole.  Samsa murrs, and grunts, pushing hard, forcing more and more of the turd out of his rectum, until about half of it is out, and hanging from his butt, dangling over the ground.  you look down, and see a sheet of newspaper, put there so there wouldn't be as much of a mess, and a piece of cardboard under it so that the rug doesn't get anything....<br>\r\nthen, the next thing you know, he grunts again, and the turd falls free, landing on the newspaper with a soft, and wet, shpluck, by some minor miracle, the turd doesn't land on you, and falls on it's side, letting you stare up at both Jonsa's grinning face, and Samsa's flexing, puckering hole, somewhat stained from it's fresh dump.....</span></div></div>",
            "created":1053752400,
            "id":158856,
            "title":"Dump the toy!"
        },
        "11221222221111":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Jonsa wants to add to the nice pile!",
                "They both want some other fun....."
            ],
            "content":"<div class=\"\"><div> <span>Samsa murrs, and grunts again, and looks between his legs to grin down at you.  \"hee hee hee, watch carefully, human, there are some other former humans in there for you to meet! enjoy this, I know, and Jonsa, most definetely are! hee hee!\"<br>\r\nSamsa grunts again, then squeezes out a long, slow, but noisy, and extremely putrid fart of his anus, stinking up the air all around him.  this makes both you and Jonsa cough at the horrid stench, but, Jonsa grins and giggles.  \"mmmmm, hee hee, nasty Samsa! you always make the most nasty and putrid human farts! hee hee, those poor humans, dying just to be a putrid fart and a shit!\"<br>\r\nSamsa grins to Jonsa, and farts again, as his hole winks open, and starts letting the brown head of a turd slide out of it.  \"mmmmm, why, thank you Jonsa! I try to do putrid farts like that, to give those worthless humans some worth after they are digested! hee hee!\"<br>\r\nAs they keep talking, you stare at Samsa's stretched anus, watching as ever so slowly, the turd slides towards you, peppered with little white bones from his previous meals, and steaming from having been deep inside of Samsa for a couple days now, just like everyone else he has ever eaten and digested alive.  as you keep watching, the turd slowly slides out, then jerks a bit as it halts, until finally, it breaks off at the base, and plummets down to slam into the newspaper next to you, making a sickening shpluck sound, then fall onto the first turd, just behind your head.  you can feel the heat emanate from it, as well as the horrible stink.  you stare up at the turd, staring at the skull of an unfortunate human, which stares right down at you with it's eyes, devoid of eyeballs, and now full of brown, moist shit.<br>\r\nyou turn your attention back to Samsa's hole, just in time to see a smaller, but no less bone riddled, turd fall free, to land between your legs, and lean against your naked groin, warming it with the moist, and filthy, heat of turd, stinking and steaming.<br>\r\nSamsa laughs, and farts again, before turning around to grin down at you, and reach out a paw to squeeze Jonsa's shoulder.  \"hee hee, well Jonsa? what shall we do now? any, fun, ideas? hmmmmmm? hee hee....\"</span></div></div>",
            "created":1053752400,
            "id":158858,
            "title":"more dumpy fun!"
        },
        "112212222211111":{
            "author_id":"malystryx",
            "author_name":"Lando",
            "choices":[
                "They use you to \"sate other lusts\""
            ],
            "content":"<div class=\"\"><div> <span>\"Hehe, you know, I think it's time for my previuos meals to come out too, Samsa.\" Smasa grins and steps back while Jonsa steps forward and squats over the steaming pile,swinging his snake-like tail out of the way. \" Here it comes..\" He give a small, but audible grunt, and a gigantic wave of stench rolls over you as pushes out his huge load. His tail hole puckers, and a small brown tip emerges. He lets another small fart, and it slides out a bit further.\"Hmm, seems my meals don't want to cooperate, eh Samsa?\" \"Apparently not, but I think you can persuade them somehow...\" they both chortle. Jonsa grunts and pushes harder, you can almost see the red on his face underneath his fur, with Samsa coughing and hacking from the stink. After several long putrid farts, a log a good 2 feet in length falls out of Jonsa with a THUMP. The pile is at least twice as large now. Pushing out an aftershock fart, Jonsa grabs the toilet paper and wipes. Jonsa picks up the huge pile with TP, and drops it all in the toilet and flushes.<br>\r\n<br>\r\n</span></div></div>",
            "created":1116738000,
            "id":251784,
            "title":"Your Crappy world"
        },
        "112212222212":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Yes, it is",
                "No, it isn't"
            ],
            "content":"<div class=\"\"><div> <span>You got the message and decide it is a much better idea to watch the show rather than annoy Samsa any more than you already have.  You watch Samsas' anus started to flex, slowly.\r<br>\n\"Your friend wants to come out and see you, shall I let him out?\"\r<br>\nYou looked up at Samsas' face again and decide to play along \"Oh yes master, I desperately want to see him again.\"  Samsa smiled at this.\r<br>\nYou went back to watching the display and he noticed that the anus isn't flexing as much and that there is a blunt object starting to come out.  You know what that object is but try to avoid naming it.  You watch transfixed as the object comes out slowly.  When enough of it is out for you to see in the light he realized that it is brown like human feces, but with a blue tint to it.\r<br>\n\"Do you like my poop human, don't worry.  Someday soon you will be just as handsome as this specimen.\"\r<br>\nYou shudder and tried to avoid thinking about that as you continue watching the display going on in front of you.  After another minute or so the turd finally finished coming out of Samsas' ass and dropped clear of his anus.  You looked at the anus and saw it had stopped flexing.\r<br>\n\"Don't worry, there is more in there.  I just wanted to give you a chance to examine what is left of your friend.  If you look closely I am sure you will find some of his bones among all that mess.\"\r<br>\nYou looked up at Samsas' face and sincerely hoped he wouldn't force you to examine his stool.  After a couple of moments of no movement from you Samsa frowned.\r<br>\n\"Don't make me repeat myself, go down there and examine my poop, NOW!\"\r<br>\nYou sigh, get up and start walking towards Samsas' stool.  When you are standing next to it you start looking it over as you were ordered.  After a couple moments you notice a human skull among the fecal matter.  You shudder and look away.\r<br>\n\"I see you found his remains, would you like to see my other meals as well?\"\r<br>\nYou looked up at Samsa \"Master I would like to see your other meals, but is it really necessary for me to watch them come out?\"</span></div></div>",
            "created":1019970000,
            "id":101038,
            "title":"Watch your aquaintance get pushed out"
        },
        "1122122222121":{
            "author_id":"chibitrunks2",
            "author_name":"Chibitrunks2",
            "choices":[
                "Samsa decides to use you like a dildo.",
                "Samsa leaves and tells Jonsa that he's finished."
            ],
            "content":"<div class=\"\"><div> <span>\"Of coarse! I wouldn't have it any other way!\" He grins at you and winks his anus. \"MMM here they come!\" He grutns and pushes out several more logs on to the toilet paper, creating a nice sized pile. The smell of the file fills teh bathroom, causign you to gag and cough from teh pure stench of it. \"Whoa, that one was a doozy!\" Samsa laughs then picks you up, quickly using you to wipe his ass. You squirm and get all sorts of anal residue on you. You cringe as he puts your new dirty and quite smelly self down. </span></div></div>",
            "created":1084510800,
            "id":199328,
            "title":"Yep and a Butt Wipe"
        },
        "11221222221212":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He decides to clean up the pile",
                "He decides to leave the pile"
            ],
            "content":"<div class=\"\"><div> <span>Samsa grins evilly at you, purrrring as he reaches back, to gently rub his ass, purrrring in pleasure at how he got to enjoy you, and from the pleasure he got from dumping out the remains of those humans he enjoyed devouring so much.  He sighs, then stands up, and walks out of the bathroom, leaving you on the floor, looking filthy, next to his still steaming, smelly pile.<br>\r\nAfter a few moments, Jonsa comes in, closing the door behind himself.  \"Phew, what a smell!\" he smirks as he sees the pile his friend left behind, and chuckles, walking over, squatting down next to you, purrring, making you see his large blue balls dangle there, looking, very alluring, and sexy.  His thick sheath is just above them, looking plump, powerful, furry, and sexy as well.  And over that, is his toned stomach, where so many humans have met their end, and even more will later.  He grins, and examines the pile, \"heh, looks like Samsa digested them well... hmmm, and that he made a mess with you!  Well, now to decide, clean up this pile, or leave it there.  Clean you up, or, let you stay dirty\" he grins evilly at you, purrring.</span></div></div>",
            "created":1103605200,
            "id":229516,
            "title":"Jonsa comes in"
        },
        "112212222212122":{
            "author_id":"chibitrunks2",
            "author_name":"Chibitrunks2",
            "choices":[
                "stick you up Samsa's rump.",
                "make you pleasure him as he eats more humans."
            ],
            "content":"<div class=\"\"><div> <span>You stare up at Jonsa, watching him closely. You feel rather uncomfortable from what just happened. \"Heh, I'll just leave it here and add on to it\" With a smirk, Jonsa grunts and begins to push out the remains of the humans he ate earlier. The pile beneath him grows as he continues to add his own additions to it. You have to hold your breath because of the combined smells of his and Samsa's stool. Finishing up, Jonsa grabs you and wipes his tailhole just as Samsa did with you earlier. \"Hehe, what should we do now my special human?\" He thinks and then he grins; he's decided to</span></div></div>",
            "created":1103605200,
            "id":229518,
            "title":"Leave it."
        },
        "1122122222121222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You do your best to pleasure him",
                "You try to flee to somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa grins evilly at you, murrrring in pleasure as he gets up, walking out of the bathroom, leaving his pile of stools to steam and stink, all that remains of the humans he devoured alive, without worry or care.  he murrrs, moving back to the living room, where Samsa is munching on some more pizza, and maybe, more humans.  Jonsa purrrrrrs, and moves close to his friend, sighing as he plops down nearby, leaning back, relaxing as he reaches down, snatching up a large group of humans.  he places you on his ballsac, letting you feel his warm, furry, musky sac under you, large balls rolling around.  He sighs, smirking at you, \"mmmm, I want you to please me, while I send these humans down to feed and pleasure me from within... if you don't make me happy, then you can join them in pleasing me within\" he grins, then pulls up a human, staring at it, smiling malevolently at it's screams for mercy.  he chuckles, then slurps it, slowly opening his jaws wide as he taunts it, \"mmmmm, you look like you have a lot of life in you human.  mmmmmmm, I am going to swallow you alive, and put you in my belly, where you are going to digest so nice and slow for me, and make me feel good with your feeble struggles to escape me alive\" he grins, then purrrrs as he carelessly drops the human within his muzzle, and sucks on him a few moments, savoring his treat, before gulping it down, taking another human, to enjoy and devour again, leaving you on his balls to pleasure him.</span></div></div>",
            "created":1103605200,
            "id":229520,
            "title":"Jonsa wants pleasure and a snack"
        },
        "11221222221212221":{
            "author_id":"chibitrunks2",
            "author_name":"Chibitrunks2",
            "choices":[
                "He's enjoying it.",
                "His belly gurgles for you."
            ],
            "content":"<div class=\"\"><div> <span>You begin to sweat when Jonsa smiles eveilly at you. He takes you back to where Samsa is. Upon being placed on hsi warm soft balls, you listen to his instructions and nod. You figure it's better to please him on the outside rather than on the inside.  You begin to rub his furry sheath up and down and roll his balls around as best you can at your size. </span></div></div>",
            "created":1103605200,
            "id":229521,
            "title":"Please him..."
        },
        "112212222212122212":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Jonsa devours you slowly and lustfully",
                "Samsa intervenes"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa purrrrrrs as he swallows yet another screaming human, smiling as he ignores it's pleas, just enjoying it as it slides down to his hungry belly.  He sighs, stroking his stomach as it gurgles noisilly, starting to slowly digest the humans within. then he looks at you, and slowly smiles, licking his chops.  He reaches down with his free hand, picking you up, ignoring the humans in his other paw.  He grins evilly, and chuckles, \"mmmmmm, you know, you look very tasty, and I am very sure that you would please me much more by struggling, thrashing, and digesting inside of me, and then sliding out my ass...\" he grins softly, licking his lips, obviously intending to devour you alive.</span></div></div>",
            "created":1103605200,
            "id":229522,
            "title":"Jonsa's belly wants you more then his balls"
        },
        "1122122222121222122":{
            "author_id":"chibitrunks2",
            "author_name":"Chibitrunks2",
            "choices":[
                "Jonsa gives you up.",
                "Jonsa continues his devouring of you."
            ],
            "content":"<div class=\"\"><div> <span>You try as best you can but apparently it's not good enough. You eek and feel faint when he picks you up. You're sure that this is the end for you. As Jonsa begins to bring you to his drooly jaws, Samsa grabs his arm and stops him. \"Hey if you don't want him anymore why not give him to me? I can find several more uses for him before he becomes food.\" He grins and looks beggingly at Jonsa.</span></div></div>",
            "created":1103605200,
            "id":229523,
            "title":"Samsa saves the day?"
        },
        "11221222221212221221":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He decides to have you feed him his snacks",
                "He wants to do something else with you"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa blinks, staring at his friend, glancing at you, looking like he wants so badly to just gobble you up... but then he looks at his friend, and sighs, smiling softly, giving you the idea that there might be something going on here... \"oh, alright Samsa.. I can't say no\" he chuckles, then hands you to Samsa, making the switch over Jonsa's loudly gurgling and grumbling belly.  Jonsa sighs, and leans back, continuing to push more screaming humans into his jaws, making them go to his gut in your place as he murrrrs, starting to play with his sheath and balls lustfully.<br>\r\n<br>\r\nSamsa grins, and moves over to the floor, sitting down, then laying on his back.  he stares at you, and thinks, \"hmmmm, what to do with a human like you... I suppose I could make you feed me my snacks, course, you might get eaten up with them by accident.  or, I could start playing some sort of game with you I suppose...\"</span></div></div>",
            "created":1103605200,
            "id":229524,
            "title":"Samsa takes you from Jonsa"
        },
        "112212222212122212212":{
            "author_id":"chibitrunks2",
            "author_name":"Chibitrunks2",
            "choices":[
                "Play with his plump balls.",
                "Play with his round rear."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Samsa grins down at you. \"How bout we play a few games first? Wouldn't want to lose you so soon afterall.\" He purrs and lifts you up. \"Hehe you can either play with my crotch or my ass.\" You sigh at this and choose to</span></div></span></div>",
            "created":1103605200,
            "id":229525,
            "title":"A bit of fun."
        },
        "1122122222121222122121":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Samsa continues to enjoy your pleasures",
                "Jonsa wants to join the fun"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, if I have to choose from those two things... I think I will choose your, erm, nice balls, Samsa...\"<br>\r\nSamsa grins broadly, \"oh? well, I hope you do a better job with mine then you did with Jonsa...\" he snickers, then lowers you down as he sits up, purrring as he presses you to his balls as they rest on the ground.  He lets you go, but keeps an eye on you, to make sure that you don't try to get away.<br>\r\nyou find yourself before his big, plump, heavy, furry balls.  they have a very powerful male musk to them, and look like they have a lot of seed within them.  He purrrrs as he sits there, his belly gurgling very softly as it digests the humans he gave it just now.  he sighs, waiting for you to play with his balls, smirking down at you.<br>\r\nYou sigh, and step up to his balls, starting to stroke and play with them, making them roll around within his furry sac, making him purrrrring in pleasured delight.</span></div></div>",
            "created":1103605200,
            "id":229526,
            "title":"Play with his balls"
        },
        "11221222221212221221211":{
            "author_id":"chibitrunks2",
            "author_name":"Chibitrunks2",
            "choices":[
                "He is really enjoying it.",
                "He decides to change the game."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You stare at his heavy plump and musky balls. You walk up to them and begin to massage the extremely soft fur around them. This results in a slightly squirm from Samsa, \"hehe not to bad\" He murrs as you rub them over still. </span></div></span></div>",
            "created":1103605200,
            "id":229527,
            "title":"Fun only for Samsa"
        },
        "112212222212122212212111":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "They take you and the other humans up to Samsa's room",
                "They forget about you on the floor in their haste"
            ],
            "content":"<div class=\"\"><div> <span>Samsa purrrrs and chuckles happilly, moaning as he feels you on his balls, groaning in pleasured delight as he feels you stroking and playing with his balls in such a wonderful, hot way.... he sighs, licking his lips a bit as he pushes against you, starting to grind you against his hot balls, making his musky scent spread all over you.  he purrrrrs in delight, shivering as he enjoys this so much, his arousal starting to grow, making his sheath thicken as his pink tip starts to show itself to you.<br>\r\nJust as he is enjoying this, his ears perk up, and his eyes shoot open. \"Oh no, my parents are coming back!\" he looks at the clock, \"shoot, I didn't realize this much time passed!\" he shoots up, immediately charging to the bathroom to clean up the mess that he and Jonsa made.  While Samsa does that, Jonsa starts scooping together all the humans, scooping them into a box that still has pizza in it.  he closes it, then takes the empty ones and stuffs them into the trash.<br>\r\nIt's amazing how fast these two can clean up any trace of what they were up to so quickly, it's like they have done this kind of thing before... but then again, for all you know, they have, and you are just one more tiny human in their long going game of pleasure and snacking.</span></div></div>",
            "created":1103605200,
            "id":229528,
            "title":"Jonsa hears trouble comin...."
        },
        "1122122222121222122121112":{
            "author_id":"chibitrunks2",
            "author_name":"Chibitrunks2",
            "choices":[
                "Mom spots you.",
                "You seem to be safe for now."
            ],
            "content":"<div class=\"\"><div> <span>In all of the rush the two forget about you. You try to follow them and get their attention but it's no use. They are already upstairs in his room before you even get half way across the floor. You suddenly hear a car pull up and a door opening. You run and hide under the sofa and hope that no one finds you there.</span></div></div>",
            "created":1103605200,
            "id":229529,
            "title":" Forgotten"
        },
        "1122122222121222122122":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You start to pleasure his anus",
                "You start to wriggle around under him, maybe that's pleasure enough?"
            ],
            "content":"<div class=\"\"><div> <span>You sigh, seeing that you have no choice, and that you had better pleasure this large creature; or risk ending up in one of their hungry bellies. You give him a weak smile, \"well, then I suppose I would, be honored to pleasure your nice ass, master...\"<br>\r\nSamsa smiles, and chuckles, \"oh? Well that sounds good to me my human. You can go look at where your friends, and my latest treats, will be sliding out of me soon enough, where they will provide me one final bit of pleasure...\" He growls, turning himself on from his own taunts. He chuckles, then gently brings you around, lifting his blue tail, to reveal his two plump, well formed, muscular, bubble butt-cheeks, looking so furry, snug, warm, and powerful. He groans, and gets up enough to slip his hand underneath.<br>\r\nHe slides you under his large, furry, heavy ass. He smiles, getting you positioned just where he wants you; leaving you between his two furry, powerful ass-cheeks, staring up at his puckered, brown stained anus. \"mmmm, you better stay still human, or this will be a very short bit of work for you...\" He chuckles, then groans as he slowly sits down on you, his furry cheeks pressing around you, surrounding your small, fragile little body with his ass. You can smell the powerful, musky, dirty smell of his rear; a combination of male musk, stale sweat, and shit, both old and new.  He groans, and flexes his anus at you, teasing you with his rear exit. \"Mmmmm, get to pleasuring, my little one....\"</span></div></div>",
            "created":1125810000,
            "id":271388,
            "title":"Pleasure up his ass"
        },
        "11221222221212222":{
            "author_id":"esgo0",
            "author_name":"Pricka Maguintus The Balltosse",
            "choices":[
                "Inside",
                "Outside"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Inside or Outside?</span></div></span></div>",
            "created":1501535040,
            "id":2362515,
            "title":"You try to flee to somewhere else"
        },
        "1122122222122":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He craps on the floor like Samsa did",
                "He uses the toilet"
            ],
            "content":"<div class=\"\"><div> <span>Samsa thought about this for a moment then got up and walked over to the toilet, lifted up the lid and sat on the seat.  After a couple moments you hear some splashes and are glad you aren't being forced to watch the emergence of that poop as well.  While you wait for Samsa to finish you walk away from the stool on the toilet paper and sit down, looking away from Samsa and the stool.  After several minutes of splashing you hear them stop and feel a paw around your body as you are lifted up.  Samsa had picked you up and is carrying you over to the toilet.  Samsa lifted up the seat and lowered you so you are just above the water and Samsas' stools, several of which are floating.\r<br>\n\"Do you like the sight human?\"\r<br>\nYou shuddered slightly before answering \"Oh yes master, just beautiful.\"\r<br>\nSamsa smiled then he set you back on the counter while he picked up the toilet paper with his stool on it and dumped it in the toilet before flushing them all away.  You wonder for a moment why Samsa didn't wipe himself then realize he wants you and the other humans to clean his ass again.  Samsa went out of the bathroom and a couple moments later Jonsa walks in, smiling.\r<br>\n\"Did you enjoy the show? Well I hope you are ready for some more because my bowels want to get your friend out.\"</span></div></div>",
            "created":1019970000,
            "id":101040,
            "title":"He finishes into the toilet"
        },
        "11221222221222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He farts around you",
                "He farts you out"
            ],
            "content":"<div class=\"\"><div> <span>You sigh as you wonder how you would be forced to watch the crapping this time.  Jonsa reached over and grabs you and walks over to the toilet.  He sat down then he lowers you between his butt and the toilet seat so you are extremely close to Jonsas' anus.\r<br>\n\"Enjoy the show little human, soon you will be sliding out my anus just like your friend is now!\"\r<br>\nAs You watch Jonsas' anus starts flexing than you see the begining of a turd poking through Jonsas' anus.  You hear Jonsa grunt slightly as the first turd broke itself free and landed with a wet splash in the toilet.  After several more minutes of this all of Jonsas turds had been excreted, you watch as Jonsa got up and leaned over, realizing you are about to watch Jonsa wipe himself.  You watch as the first wad of toilet paper reached Jonsas' anus and started to be wiped across it and couldn't help but wish you could be that toilet paper for just that moment.  When Jonsa had finished wiping himself he reached back and grabbed you before he flushed the toilet.\r<br>\n\"Did you enjoy my little show human?\"\r<br>\n\"Oh, yes master.  I enjoyed your show much more than Samsas' and hope to see it again.\"\r<br>\nJonsa smiled very broadly \"We shall see my human, we shall see.\"\r<br>\nAs you left the bathroom you see Samsa on the floor with several humans cleaning his ass. \"I just loved this feeling too much not to do it again.\"\r<br>\nJonsa smiled \"Shall we see if the humans like going inside our asses?\"\r<br>\n\"Yes, I think we should.  I will stuff your special human into your ass and you will stuff one of your humans in mine.\"\r<br>\n\"Ok, but make sure you can get my special human out.  I want to eat him, not feel him drown in my ass.\"\r<br>\nSamsa smiled \"Ok with me.\"\r<br>\n\"Ok, lets start.\"  Samsa got up as Jonsa laid down and drops you in front of his ass.\r<br>\nSamsa smiled at you as he picks you up \"Enjoy your trip, little human.\"\r<br>\nYou looked ahead and had to fight down a scream as you saw Jonsas' huge anus quickly fill your field of view.  You feel your head start to get shoved against the relaxed muscles of Jonsas' anus and start to flail wildly.\r<br>\n\"OH!  That feels so good!  Push him in more, I want to feel him in my ass!\"\r<br>\nYou feel Samsa push harder and faster.  Before you know it you are in Jonsas' anus up to your knees, which are barely enough for Samsa to grab onto when it comes time to pull you out.  You take a deep breath and gag.  The stench in here is horrible and the air is quickly becoming unbreathable.  You flail around some more and are very surprised when you feel Jonsas' anus flex around your waist. You can only guess that is because this is very pleasurable for Jonsa.  You start flailing even more, namely because it is becoming very hard to breath in here.  You feel the anus flex around your waist even more and that unfortunately means you are getting pulled deeper into Jonsas' anus.  You are starting to wonder if you are going to die in this hot, humid rectum when you smell a foul stench.</span></div></div>",
            "created":1019970000,
            "id":101044,
            "title":"Watch his crap come out, then get shoved up his as"
        },
        "112212222212221":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "content":"<div class=\"\"><div> <span>You gag as he lets another fart rip over you, making you squirm in the rancid hole! You cringe as you are pulled further into the recently emptied rear as you feel more slimy residue rub off into your skin as you near his colon. Eventually, you slip into the colon as your master gets off the toilet while hearing him slip on some clothes, dooming you to his smelly ass! You try to keep yourself conscious in this horrible hole before you hear him let another fart go, knocking you out...<br>\r\n<br>\r\nYou wake back up after your nap, only to feel something warm and slimy covering you...then realize that you were pressed up against a wall with his load burying you, making it harder to breath in here! You try to gasp for air, but you black out for the last time as your master lets out a loud fart...<br>\r\n<br>\r\n----<br>\r\n<br>\r\nThe next day, Jonsas wakes up as he lets out a loud and wet fart before he gets up and heads to the restroom to relieve himself while searching for you in his load. He fails to find you and thinks you have been digested somehow...unbeknownst to him, your body is still trapped in his colon...<br>\r\n<br>\r\nYour corpse has never left the rancid ass of this creature and will remain there for the rest of this nasty brute's life... </span></div></div>",
            "created":1346304840,
            "id":1416694,
            "title":"He farts around you!"
        },
        "112212222212222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He is rough with you",
                "He is fairly gentle with you"
            ],
            "content":"<div class=\"\"><div> <span>Before you have time to work out what that smell is you are farted out of Jonsas' anus.\r<br>\n\"That felt so good little human, I will have to do that again before I eat you.  But right now it is Samsas' turn.\"\r<br>\nYou look up as Jonsa stands up and walks over to Samsa, who is lying on his back and had an unfortunate human in his hand.  Samsa smiled \"This human has bravely volunteered for the exploration mission.\"\r<br>\nJonsa smiled \"Then lets not disappoint him.\"  Jonsa took the human out of Samsas' hand and kneeled down in front of his ass and slowly pushed the human into Samsas' anus.  Samsa immediately started moaning in pleasure and you are willing to bet he is flexing his anus a lot as well.  It didn't take long for Jonsa to push the human all the way inside.  When Jonsa had finished he sat back.\r<br>\n\"Enjoying the sensation of his struggling in there?\"\r<br>\n\"Oh, yes!  I think I will fart him out, but it would a pity if he didn't have a crash pad to land on.\"\r<br>\nJonsa smiled \"Yes, indeed it would be a pity.\"  Jonsa laid on his belly and put his mouth up against Samsas' ass with his mouth wide open.\r<br>\n\"Ready?\"\r<br>\nJonsa couldn't say anything but Samsa knew what he meant.  A couple moments later you hear Samsa fart then Jonsa closed his mouth and sat up.\r<br>\n\"Is he in there?\"\r<br>\nJonsa smiled, nodded then swallowed.  \"At, least he WAS in there.\"\r<br>\nSamsa smiled at Jonsa and Jonsa smiled back as he patted his belly, which now contained pizza and two humans.\r<br>\nSamsa smiled at Jonsa  “Are they both struggling in there?”  He asked while he pointed at Jonsas’ flat belly.\r<br>\nJonsa smiled and rubbed his belly for a moment “The human I ate with the slice of pizza was sliced to pieces by my teeth so he isn’t struggling but the human I just ate is certainly struggling as hard as he can,  I do hope he likes the pizza I gave him as a snack down there.  How about your human dessert?”\r<br>\nSamsa smiled and patted his own flat belly “She is putting up quite a fight, it must be extremely painful in there for her, and she has about another hour of this to enjoy!”  Samsa smiled most evilly when he said this.  “I have always enjoyed feeling my dinners’ last struggles within me.”\r<br>\nJonsa smiled and nodded in agreement.\r<br>\nSamsa looked at Jonsa in thought for a moment then he smiled “Would you like to hear him my friend?”\r<br>\nJonsa smiled back “I sure would, and I am sure that my little pet would as well.”\r<br>\nJonsa reached down and roughly grabbed you while Samsa layed on his back with his arms behind his head.\r<br>\nJonsa layed on his belly and presses you up against Samsas’ furry belly while he layed his ear against it himself.\r<br>\nYou listened for a moment, at first all you hear is gurgling then after a few moments you hear some faint screams, human screams.  You shudder in fear.\r<br>\nJonsa also heard the gurgling and faint screams, only he had a much different reaction.  He looked up at Samsas’ face, which he was looking at as he layed against his belly, and smiled.  “She certainly sounds very happy to be in your belly as part of your dinner.”\r<br>\nSamsa smiled back “I thought as much, it must be extremely pleasant in there for her to be within me.”\r<br>\n“She certainly sounds happy.”\r<br>\nSamsa smiled again “May I listen to your human?”\r<br>\n“Sure, and be sure to let my special human in on the show.”\r<br>\nSamsa looked down at you and once again, grinned very evilly, “Of course, I am sure he would be most honored to listen to where he will be going himself in a day or two.”\r<br>\nJonsa smiled as he got up off of Samsas’ belly and leaned back with his arms behind his head.\r<br>\nSamsa grabbed you off his belly and leaned over onto Jonsas’ belly listening as he pressed you against the belly as well.\r<br>\nYou hear the same sounds you heard from Samsas’ belly, gurgling and screams of immense pain.\r<br>\n“Your meal sounds like he is having a blast in there.”\r<br>\n“I am sure he is.”\r<br>\nJonsa sat up so fast that it surprised both Samsa and You.  You slipped off Jonsas belly and landed on the ground, right in front of Jonsas’ package.\r<br>\n“I feel like having some ‘fun’ do you feel like it to?”\r<br>\nSamsa smiled, “I though you would never ask, but lets put your humans away so they don’t get in the way or get away while we enjoy ourselves.”\r<br>\n“Ok, I will leave my special human out though.  I think it would be fun to let him join in our fun.”\r<br>\nSamsa looked down at you “Ok, I will start using him while you put your humans away in their jar.”\r<br>\nJonsa smiled, “I thought you would, if you get any mess on the floor please be sure to clean it up or my parents will get suspicious.”\r<br>\nSamsa shrugged, “Fair enough.”  Then he reached down and grabbed you from in front of Jonsas’ ballsac, being careful to brush against it for a brief second.\r<br>\nJonsa shuddered for a moment then smiled very broadly “You silly little boy!”\r<br>\nSamsa smiled then layed back once again and places you back on his belly.\r<br>\nWhile this happened Jonsa got up and grabbed the humans from the coffee table and started for his room.</span></div></div>",
            "created":1019970000,
            "id":101047,
            "title":"Listen to the meals be proccesed"
        },
        "1122122222122222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You are used as a sextoy",
                "You manage to stay out of the way"
            ],
            "content":"<div class=\"\"><div> <span>As Jonsa walked off Samsa smiled down on you “Don’t worry, this won’t hurt and it will probably even be fun!  Ok now then, start by walking down my belly to my sheath and start massaging it.”\r<br>\nYou look behind youself at the enormous sheath and couldn’t help but smile.  You quickly get up and start walking over to it as fast as you can.\r<br>\nSamsa smiled, he had never seen a human so happy about wanting to please a Bajirran before, he is starting to see why Jonsa loved this human so much.\r<br>\nYou finally reach the tip of Samsas’ sheath, you stare at the slit in admiration and ran up to it and start rubbing up against it.  You can feel Samsa shudder and chuckle.  You continue to rub yourself up against it for a few moments before you move over to the side and start to massage the enormous sheath.  Once again you feel Samsa shudder in pleasure.  You continue to rub against it for a few moments, until you start to feel it swell, then while you are still massaging it you look up towards the tip and see the beginning of a red shaft poking out.  You smile and continue to massage the blue sheath that is several times your size.  After a couple moments more you decide to start to massage the red shaft that is part way out of Samsas’ sheath.  You walk over and started to rub along the length of the slimy red pole that is poking out of Samsas’ sheath.  After several moments you feel a hand grab you and squeeze you against Samsas’ cock.\r<br>\n“Mmmmmm, I will try not to crush you against my cock while I pleasure myself.  So for now, just enjoy yourself.”\r<br>\nYou know you don’t have a choice, all you can do is brace yourself for what is to come.  After a moment Samsa starts to rub you back and forth along his shaft and moan in pleasure.  You are at once extremely glad that Samsas’ cock is slippery with some excrete from within his sheath.  For several minutes Samsa rubs you along his shaft slowly.  Suddenly you feel the shaft beneath you start to pulse.  Samsa quickly takes you away from the side of his shaft and places you right in front of his piss slit.  Your face is buried in the slit and have a very hard time breathing in the manflesh.  Suddenly you are hit in the face by a very strong force, at once you know it is Samsas’ cum.\r<br>\nSamsa is moaning in absolute pleasure and enjoyed having the small humans’ face buried in his piss slit while he is cumming.\r<br>\nYou are having a very hard time breathing through the fast salty current that is spouting from Samsas’ red tool.  Finally after several more seconds the tide subsided.\r<br>\nSamsa is panting extremely hard and just loving the feeling of this little human up against his manhood.\r<br>\nYou are breathing hard, more from being deprived from oxygen than actual tiredness.  As you are leaning up against Samsas’ manhood you feel it start to soften and retreat back into his sheath.  You are a little happy about that but then you remember that many animals mate several times a day and sigh.  Somehow you get the feeling you will be seeing that red thing again all too soon.\r<br>\n“Have fun my friend?”\r<br>\nYou looked up in surprise, there is Jonsa, standing in the doorway and smiling.  “I thought you would have some fun with my human before I got back.”\r<br>\nSamsa smiled “Don’t worry, I am sure he has enough energy to deal with both of us.\r<br>\nJonsa smiled again “We shall see, I also brought this little human down with me to join in our “fun”.  Jonsa brought a human up from behind his back and the human looked terrified at the prospect of joining in these two cruel creatures “fun”.\r<br>\nSamsa looked at the human and smiled again “I think I know what you want to happen to him and we will do that, after we snuggle a bit.”\r<br>\nJonsa smiled and walked towards Samsa, who grabs you and sits up.  You have no idea what is going to happen, except that these two boys are going to have sex and you din’t want to take part in it.\r<br>\nJonsa sits down in front of Samsa and scoots very close to him, then drops his human on the ground.\r<br>\nNow you and the other human are trapped between both boys legs and their packages.  Samsas’ red tool had long since retreated back to his sheath but it is now starting to poke back out again, as is Jonsas’.  The scent of male is very strong down here and impossible to ignore.  You hear slurping up above and could only assume the two Bajirrans are kissing each other and have no desire to see that so you just sit down and close your eyes, waiting for the next torture to come.  After a few moments of kissing the two boys brake apart and decide that now is the time for their fun.  Jonsa reaches down and grabs you while Samsa reaches down and grabs the other human.  Jonsa smiled at Samsa as he takes you and starts rubbing him along his sheath.  The fur is very soft, which is lucky for you or this would have been very uncomfortable.\r<br>\nJonsa moaned in pleasure as he feels the small struggling human slide across his sheath, stirring up his manhood from within him.  You are too busy to notice you are really pleasuring your owner.  Not that it would have given you any comfort anyway.\r<br>\nJonsa continues to rub you along his sheath for several minutes before he lays back and leaves you alone on his sheath.  “Oh, Samsa.  I think it is time we stopped pleasuring ourselves and started pleasuring each other.”\r<br>\nSamsa smiled “Yes, of course.  I think I know just what would feel good right about now.”\r<br>\nSamsa grabs you and places him on the tip of his exposed shaft as Jonsa spread his legs, exposing his ass.\r<br>\nYou try to scream but nothing comes out as you realized you are about to join the two creatures as they fucked each other.\r<br>\nSamsa started to lower his shaft to Jonsas' ass as you sit there, too terrified to move, much less defend yourself from the disgusting act that is about to come.</span></div></div>",
            "created":1019970000,
            "id":101054,
            "title":"Please Samsa"
        },
        "11221222221222222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Jonsa takes you to bed with them",
                "Jonsa has a change of heart and gives you to Samsa"
            ],
            "content":"<div class=\"\"><div> <span>Just as Samsas’ shaft started to touch Jonsas anus You came out of your trance and ran as far away from the huge ass as you can.  You run down to the base of the sheath and just stare ahead, you have no desire to look back and watch the two boys have sex.\r<br>\n“OOOOOHHHHH!  This feels so good Jonsa!”\r<br>\nJonsa could only moan in response.\r<br>\nAt this point you put your hands over your ears as hard as you can, to block out as much of sound as possible.  After several minutes of muffled sounds and feeling the sheath sway beneath you the movement stops and you take your hands off your ears.  You hear some heavy panting.\r<br>\n“Oh, boy is that great!  But our little friend didn’t join in!  I can feel him standing at the base of my sheath.”\r<br>\n“Maybe it is for the best, it would have been hard to get him out before he drowned in all the cum you pumped into my ass.”\r<br>\n“Yeah, maybe your right.  Now I will let you decide how our other little friend should join in.”\r<br>\nYou hear a wet slurp as you feel Samsa pull out from Jonsas’ ass.\r<br>\n“Oh, I think he should be on my dick as you suck me off.”\r<br>\nYou heard a scream at this remark from a ways away.\r<br>\n“You know where he will end up if we do that?”\r<br>\n“Of course I know, that is what makes it so much fun!”\r<br>\n“Ok, if you know what you want, I think I will move your special little human off of me so he can get a better view of this.”\r<br>\nYou felt Samsa grip you and pull you upwards.\r<br>\n“Where would you like me to put him?”\r<br>\n“Oh, I think he would get a very good view of the action at the base of my sheath, just be careful around him ok?”\r<br>\n“Oh, don’t worry.  I will be careful with this human.”\r<br>\nThe next thing you know you are at the base of Jonsas’ sheath looking up at the semi-erect cock.  A few seconds later the other human is placed on the cock head and pushed part way into Jonsas’ piss slit.\r<br>\n“Now you can’t get away until Jonsa releases you.”\r<br>\nJonsa chuckled as he layed his head back and waited for Samsa to start sucking him off.  Samsa kneels and lowers his head.  While he is doing this he slowly opens his mouth.  The human on Jonsas cock started screaming at the top of his lungs and also started beating on Jonsas’ cock head and trying to pull himself off.\r<br>\nJonsa chuckled as he felt this.  “Don’t worry human, in due time you will be swimming around my good friends belly with my cum.”\r<br>\nThis did nothing to make the human feel better, but he didn’t get anymore time to scream and struggle, at least not in your view, because at that time Samsas mouth came down over Jonsas cock.  You hear Jonsa moan as he felt that.\r<br>\n“Be sure not to swallow that human until I cum in your mouth, I don’t want him to miss anything before he gets digested.”\r<br>\nSamsa could only grunt in response.  You hear some slurping and knew that Samsa had started to pleasure his friend, that and the moaning in pleasure from behind you.  You look away, not wanting to see this sight either, you also put your hands on your ears again.  After a few minutes you feel large fingers lower your arms, than turn your head so you will have to watch this.  You realize that it is Jonsa who is making you watch the spectacle and had timed it so you would have to watch when Jonsa started cumming.  After a few seconds of watching Samsa suck on the red shaft you hear a moan in pleasure and see that Samsa has stopped sucking and he could only assume that he is cumming right now.  After a few seconds Samsa swallows, he swallows several more times before he pulls himself off of Jonsas shaft.  Samsa licked his lips then he let out a small belch.  Jonsa chuckled.\r<br>\n“Did he enjoy himself in your mouth while my cock is in there?”\r<br>\nSamsa smiled and nodded “Oh yes, he enjoyed himself right up until I swallowed him with your tasty cum.  In fact I think he is still enjoying himself in my belly.”\r<br>\nYou shuddered, you are very sure the human is not enjoying himself at all.\r<br>\nJonsa looked at a clock that is hanging on the wall.  “Hey!  It is midnight!  We have to get to bed or we won’t learn anything in school tomorrow!”\r<br>\nSamsa shrugged “Have we ever really learned anything in school?”\r<br>\nJonsa laughed “No, but still it would not be good to fall asleep in class and be sent to detention.”\r<br>\nSamsa nodded “Ok, lets go to bed.  What should we do with your human?”</span></div></div>",
            "created":1019970000,
            "id":101056,
            "title":"Be used for their pleasure"
        },
        "112212222212222221":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Go to the health club",
                "Go somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa looks at you “I think he would enjoy spending the night half-way in my sheath.”\r<br>\nYou shudder but know that begging would do no good and are very tired so you just sit there.\r<br>\nSamsa smiled “I think he would like that indeed.\"\r<br>\nJonsa reaches down and grabs you and starts bringing you up to the top of his sheath.  At this time Jonsas' shaft had retreated into his sheath.  He slowly pushed you into his sheath feet first, moaning as he felt the live human enter it.  You could feel the slimy interior of the sheath and struggled against Jonsas grip to avoid getting stuck in this slimy place for the whole night.  Jonsa chuckled and just pushed you in faster.  A couple of seconds later you are in Jonsas' sheath up to your navel.  Jonsa laughed as he stood up to go to bed.  Samsa is also laughing.\r<br>\n“Man, it feels so weird to have a living thing in my sheath.”\r<br>\nSamsa chuckled “I bet it does, I bet it also feels weird for the human, to be stuck in your sheath.”\r<br>\nJonsa laughed as they started climbing the stairs.  A few minutes later they were in Jonsas room and started climbing into his bed, together.  As the got under the covers they faced each other and bade each other good night before switching off the light.\r<br>\nEven thought the light is off there is still enough light beneath the sheets for you to see that you are right across from Samsas’ sheath and balls.  After about an hour you finally went into a relatively peaceful slumber.  The last thing you see was Samsas’ maleness. You are awoken early the next morning by yawning.  You wake up and the first thing he saw is Samsas’ maleness wiggling in front of you.  Samsa is stretching and yawning as he is waking up.  After a few seconds you see Samsas’ maleness leave your sight as Samsa sat up in bed.\r<br>\nSamsa yawned again and scratched his belly as he tried to wake up and get ready for school.  He got up and went to the bathroom to take a shower while Jonsa is starting to come out of his slumber.\r<br>\nJonsa stretched, than sat up in bed.  He moaned as he remembered this is another school day, then suddenly he remembered about his human and thought that it wouldn’t feel so bad after all.  It felt extremely good to him to have a little human stuck inside of him.  The feeling of a sheath warmer felt so good to Jonsa he had to moan in pleasure before he reached down to pull you out so he could take his shower.\r<br>\nYou are happy when you feel Jonsas’ hands grip you and start to pull you out.  It felt very weird for you as you are slowly pulled out.  The sheath doesn’t seem to want to let you go and seems to embrace you as you are pulled out.  You are a little revolted as you feel the slimy embrace of Jonsas’ sheath as you are pulled out.  When you are finally pulled free, you left with a slimy slurp and find you are covered in some kind of slime from the inside of the sheath.\r<br>\nJonsa chuckled at the sight of the slimy human as he heard the water shut off, signaling that Samsa is done with his shower.  Jonsa got up and walked into the bathroom and waited for Samsa to get out so he could wash off.\r<br>\nYou stared when Samsa stepped out of the shower.  He is soaking wet and the water is running along his belly, then along his sheath then finally onto his ballsac where it drips off.  Samsa smiles at the you, “Like what you see little guy?”  You can’t respond and watch as Samsa started to dry himself off.\r<br>\nJonsa tapped his foot in impatience.  \"Could you please move so I can take my shower and wash my human off?\"\r<br>\nSamsa smiled, “Of course, how rude of me” and stepped out of the way as he continued to towel himself off.\r<br>\n“Thank you.”  Jonsa stepped into the shower stall and shut the opaque glass door.  He set you down on the floor and turned on the water.  You smiled as you felt the water drip on you off of Jonsas’ lean body and start to wash away the slime.  Above you Jonsa had grabbed some shampoo and started to wash off his fur.  Soapy water drips off of Jonsas’ body and onto you, you start to wash off the slime and make yourself feel clean again after two days of disgusting treatment from the Bajirran boys.  After you feel clean again you look up and can’t help but admire the show going on above you.  The sight of the water cascading off of Jonsas lean, muscular frame is a very pleasing sight for you, and for a time you forget that the creature above you is a predator that is planning to eat you.  You spent the remainder of the shower watching as the water sprayed from the shower head onto Jonsa, trickle down his broad chest, down his flat muscular belly, around his sheath onto his swaying blue ballsac and dripped down onto you.  After Jonsa had finished washing himself off he reached down and grabbed you and started to rub him all along his body.\r<br>\n“MMmmmmm, that feels good.  I love the sensation of rubbing you along my muscular body my little human.”\r<br>\nYou are also enjoying himself, the water and shampoo made the fur seem very soft against your skin and it felt very soothing to be rubbed along against the soft, blue fur.  Finally Jonsa finished, turned off the water and stepped out of the shower stall to dry himself off.  He grabbed a towel and quickly dried your little body off, then he set you on the toilet as he started to dry himself off.  You watch in facination as Jonsa toweled himself off, something about watching a huge blue male creature towel itself off in front of you fascinates you.  The quick motions of Jonsa toweling himself off causes his male features to jiggle a bit.  You stare at Jonsas' ballsac as it sways back and forth seductively.  Finally Jonsa finished toweling off and hung up the towel to dry before he grabbed you and walked back to his room to choose his clothes for the day.  Jonsa chose a bright colored t-shirt and jean shorts.  Jonsa smiled as he reached down, grabbed you and once again stuffed you into his briefs.  You can’t help but smile a bit as you are once again pressed against Jonsas’ soft ballsac and the soft fur that grew on it.  You know that this will be a very interesting day.\r<br>\nAfter Jonsa had dressed he walked down stairs, grabbed a quick breakfast and walked out the door to school.  Samsa had already left so Jonsa walked to school alone.  Ten minutes later he arrived at school and is surprised to see a large crowd in front of the school and wondered what is going on.  He walked up quickly and asked a freshman that is at the edge of the crowd.  “What is going on here?”\r<br>\nThe freshman looked at Jonsa a second before responding “There was an electrical short and it caused a small fire in a classroom.  We are waiting to see if they are going to close the school today because of that.”\r<br>\nJonsa nodded and stood at the edge of the crowd, waiting.\r<br>\nFinally after a good twenty minutes passed a tall, slightly fat Bajirran male emerged from the building.  He looked at the crowd for several seconds before speaking. “School will be closed for today while we make sure the school is safe from further electrical problems and make some repairs to the class room that had the small fire in it.”\r<br>\nThe rest of his speech is drowned out by a cheer from the students who quickly started to disperse.  Jonsa is very happy, he waited for a few minutes until he found Samsa.  “What should we do today since the school is closed?”</span></div></div>",
            "created":1019970000,
            "id":101679,
            "title":"Wake up with Jonsa"
        },
        "1122122222122222211":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You are running away",
                "You are stuck to him"
            ],
            "content":"<div class=\"\"><div> <span>Samsa smiled “We could go to the health club and work out for a couple hours to start with.”\r<br>\nJonsa smiled back “Sounds good, lets go.”\r<br>\nThe two boys walk quickly to the bus stop and get on a bus to the health club.  When they get to the health club they go straight to the workout room.  Jonsa starts to lift weights and is very quickly perspiring.  He smiles as he thinks of what it must be like for his human in his underpants.\r<br>\nYou are getting very warm in the confined space of Jonsas underpants, it is also getting very sweaty in here as well.  You cough at Jonsas’ male scent which is getting stronger the more he works out and perspires.  You can’t help but enjoy being up against Jonsas’ ballsac as it gets more and more limp from the heat in the underpants.\r<br>\nAfter about two hours of working out Jonsa is tired and sweaty so he goes to the locker room and gets undressed, sticking all his clothes in the locker.  After he takes off his underpants he looks in them for his little human, but he is nowhere to be seen.</span></div></div>",
            "created":1020574800,
            "id":101678,
            "title":"The Club"
        },
        "11221222221222222111":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You manage to get out of this locker, to somewhere else",
                "One of the male creatures here finds you"
            ],
            "content":"<div class=\"\"><div> <span>You stumble and trip as you flee from your giant master as fast as you can, doing your best to run away from him!  You whimper a bit, and try to find the nearest corner to run around, not wanting him to find you again!<br>\r\nFinally, you find one such corner, and very eagerly run around it, and start breathing a big sigh of relief.  You slide against the wall, down to a crouching position.  You sigh, and try to catch your breath, and remain hidden as you watch many pairs of huge feet moving around you.  You dare not look up, not wanting to somehow gain attention, or stare up at the males walking around over you, even if part of you does want to see them walking around naked like this...<br>\r\nAs you finally catch your breath, you start trying to plan out your next move, trying to think where you should go from here!</span></div></div>",
            "created":1083042000,
            "id":196998,
            "title":"The Great Escape!"
        },
        "112212222212222221112":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He is kind",
                "He is not so kind"
            ],
            "content":"<div class=\"\"><div> <span>You yelp in suprise, as suddenly, a large, powerful paw grabs at you.  You start thrashing as you feel yourself lifted up very rapidly, then find yourself staring at a, green, face?  You blink, as it takes you a few moments to register that this is a large, and good looking, male dragon!<br>\r\nYou stare in amazement, and as the dragon gets a grin on his face, you see that there are other creatures in this locker room as well.  There is more then just Bajiirans in this world you realize now!  But, whether this is good for you or not is yet to be seen....<br>\r\nAs you turn your attention back to the dragon, you wonder, will he be kind, or, not so kind towards you?</span></div></div>",
            "created":1083042000,
            "id":196999,
            "title":"Other things here?"
        },
        "1122122222122222211121":{
            "author_name":"Chibitrunks2",
            "choices":[
                "In his gymbag with his dirty clothes.",
                "In his mouth for safe keeping."
            ],
            "content":"<div class=\"\"><div> <span>The dragon smiles at you in his clawed hand. \"Why hello there little fellow! What are you doing running around in here?<br>\r\nYou look at him, feeling reassured that he is for the moment kind.  You smile weakily, and stutter out , \" I..r,r,ran away.  P..please d,d,don't take me back to him!\" You sweat nervously, appaled at yourself for blurting that out.<br>\r\n\"Return you? HA! Finders keepers ya know! I'm taking you home with me! Now where should I put you?\"<br>\r\nYou sigh, not liking where this is going, but at least you are leaving your master that planned to eat you one day.<br>\r\n</span></div></div>",
            "created":1083042000,
            "id":197001,
            "title":"Friendly Dragon"
        },
        "11221222221222222111211":{
            "author_name":"Chibitrunks2",
            "choices":[
                "He goes home immediately.",
                "He stops by a fast-food joint to get a quick bite."
            ],
            "content":"<div class=\"\"><div> <span>\"I'd better put you in here!\" He unzips his gymbag and tosses you on to what seems and smells to be some dirty boxers. The strong male scent wafts up to your nose, causing you to gag slightly, however you can't help but like the smell of this dragon's crotch. You grin a bit and look up only to see him zipping up the bag. The light dims and then finally shuts off completely.  All you can do now is hope that he will continue to be the kind dragon you just met.</span></div></div>",
            "created":1083042000,
            "id":197003,
            "title":"Dirty Laundry"
        },
        "112212222212222221112111":{
            "author_id":"xela",
            "author_name":"HeroicWriter",
            "choices":[
                "Your new master introduces you to his friends.",
                "The dragon returns carrying a cage."
            ],
            "content":"<div class=\"\"><div> <span>After more than an hour, finally the bag is unzipped, and the young dragon's enormous paw gingerly picks you up.<br>\r\nYou look around: the place looks like the typical teenager room, just as you expected.<br>\r\nThe scaly giant sits on his bed, holding you on the palm of his paw, and begins exploring your body with a finger...<br>\r\nYou're afraid he's going to devour you, so you kneel and beg: \"Please, don't eat me! I'll do wathever you'll want, but don't hurt me!\"<br>\r\n\"Don't be scared, little one\" he answers, smiling, \"I've always wanted a pet of my own... you try and be a nice pet and obey me, and I'll be a kind master, taking good care of you... deal?\"<br>\r\nHe looks sincere, so you nod.<br>\r\n\"Good!\" he says, then places you on the bed. \"Wait here, I'm going to come back immediately...\". He goes out of the room , and after a few minutes...</span></div></div>",
            "created":1098766800,
            "id":222745,
            "title":"Dragon master"
        },
        "1122122222122222211121111":{
            "author_id":"xela",
            "author_name":"HeroicWriter",
            "choices":[
                "They play with you.",
                "They introduce themselves."
            ],
            "content":"<div class=\"\"><div> <span>The door opens, and the dragon enters... followed by five other giants!<br>\r\nYou shiver, not knowing how they're going to treat you.<br>\r\n\"Wow, it's so cute! Can I hold him!\" one of the newcomers asks; he looks like a lion, with an enormous red mane.<br>\r\n\"Yes, but be very careful, or you could harm him\" the dragon says.<br>\r\nThe lion lifts you, and begin petting you tenderly, calming you a bit: his paws are surprisingly soft and warm.<br>\r\nYou look at the other four newcomers, who meanwhile keep making comments about you, like \"How tiny it is!\" and \"Very funny!\"; one of them is a wolf, then there's a falcon, then a turtle (gosh! he looks like one of the ninja turtles!) and a rodent-type of creature.</span></div></div>",
            "created":1098766800,
            "id":222750,
            "title":"Friends!"
        },
        "11221222221222222111211112":{
            "author_id":"xela",
            "author_name":"HeroicWriter",
            "choices":[
                "They feed you.",
                "Sex toy... oh no, please, not again!"
            ],
            "content":"<div class=\"\"><div> <span>The dragon says: \"Please, pals, not a single word on the tiny guy! He must be our little secret, otherwise I'll be forced to give it back to its owner, and I haven't got enough money to buy a trained human pet.\"<br>\r\nThe lion smiles, \"Shut up, you know you can trust us!\". He then hands him to the dragon, asking: \"What's its name?\"<br>\r\n\"Hu, I didn't name it yet, I've just found it... let's see...\" The dragon looks at you thoughtfully.<br>\r\nYou're on the point of saying your name, but then decide to keep quiet: if you're going to be this dragon's pet, you have to appear totally submissive; that's humiliating, of course, but it's better than being eaten or crushed...\"<br>\r\n\"PIPSQUEAK!\" the dragon suddenly cries out, making you start. \"It fits perfectly, doesn't it, guys?\". The others agree.<br>\r\nThen your master lifts you at the level of his emerald eyes. \"Well, my dear Pipsqueak, now you'ne got your name, and it's time you know ours... the big kitten is Nyrubi\" he points to the lion-giant, \"and then, I'd like you to meet Wuwix\" (the wolf), \"Adraxu\" (the falcon), \"Goram\" (the turtle) \"and Ir\" (the rodent).<br>\r\n\"And finally\" the dragon concludes \"I'm Kraigor, but you can... or better, you must call me Master!\"<br>\r\nThe giants' laughters almost deafen you.</span></div></div>",
            "created":1098766800,
            "id":222810,
            "title":"Names!"
        },
        "112212222212222221112111121":{
            "author_id":"xela",
            "author_name":"HeroicWriter",
            "choices":[
                "The giants kindly let you sleep.",
                "You're forced to stay awake."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, you feel giddy, then everything goes black...<br>\r\nYou wake when a sprinkle of cold water hits your face, and you hear confusedly Kraigor's voice: \"Pipsqueak! Little guy! Come on, speak!\"<br>\r\n\"It must be ill\"... \"Poor creaure, I hope that isn't a serious illness\"... \"Maybe it's feverish...\" The other giants' voices wake you fully; you sit weakly (feeling a cold and hard surface under you) and see six enormous faces/muzzles watching you anxiously.<br>\r\nWhen you move, everyone heaves a sigh of relieve, and Kraigor tenderly caresses you, saying \"Hey, my little guy, how are you feeling? What happened? Are you ill?\"<br>\r\nThey seem really worried, that's comforting for you.<br>\r\nYou quickly try and calm them: \"Don't worry, masters\" (calling them so is surprisingly natural for you) \"my illness is easily curable... I'm simply starving!\"<br>\r\nAfter a moment, they laugh again.<br>\r\nYou now see you're in a big kitchen, on the sink; you're carefully lifted and placed on a table, and soon a colossal mass of food is piled in front of you: bread, cheese, ham, biscuits, fried fish, and a lot of vegetables, you don't even recognize some of them.<br>\r\nBut at this moment, you don't think of botany at all! Hurling yourself on the food, you fill your belly with everything you see; then a teacup, as big as a wash-tub, is offered to you: it's full of milk, and you lap the sweet liquid just like a kitten.<br>\r\nEventually, being totally full, you become aware of how exhausted you are, and you begin falling asleep...<br>\r\n</span></div></div>",
            "created":1098853200,
            "id":222965,
            "title":"Hungry pet"
        },
        "1122122222122222211121111211":{
            "author_id":"xela",
            "author_name":"HeroicWriter",
            "choices":[
                "\"You're going to stay in the drawer, for now.\"",
                "\"I'm going to bring you with me.\""
            ],
            "content":"<div class=\"\"><div> <span>You're almost asleep yet, so you barely feel yourself being gingerly lifted, placed on a soft surface, and then nothing...<br>\r\nYou wake up in what you think to be a wooden room, with a very low ceiling. You look around, but without seeing any sign of doors of windows, the dim light coming by a hole in a wall... you give it a better look: that hole's shaped like a key hole...<br>\r\nAnd suddenly you realize: you're in a drawer!<br>\r\nYou call: \"Kraigor!\", but immediately correct yourself: \"Master!\" But after some minutes, there's been no response, so you resign yourself: the only thing you can do is to wait, hoping the giants haven't not forsaken you.<br>\r\nJust then, you become aware of a pleasant smell permeating the drawer, and see a big (for you) cup in a corner; it seems the same one you drank milk from... how time's passed, you wonder? Well, certainly many hours, because now you're quite hungry again.<br>\r\nYou run to the cup; it's filled with a sort of mash, mase of milk, flour, crumbs of bread, pieces of apple and minced meat. Well, you're not going to be finicky: you fill your belly again, then walk to your sleeping-place to wait your master's return.<br>\r\nYou see the thing you've slept on, it's a... sock! It certainly has been often used by his owner, because you feel now the dragon's particular scent... and you like it.<br>\r\nYou grab the \"sweet\"-smelling fabric, sniffing it avidly, getting lost in some dream...<br>\r\n\"Ouch!\" you cry, falling on the wooden surface, while the light suddenly blinds you: the drawer's been abruptly opened. Damn, you were so busy with your fancies, that you didn't even hear the massive dragon's footsteps!<br>\r\n\"Oh, good morning, little sleepyhead!\" Kraigor's voice booms from above, and you see the dragon's face smiling down to you. He picks you up. \"Finally awake, you've slept during all yesterday afternoon and night, you was very tired, uh? How do you feel now? Did you sleep well? Did you like the meal I've prepared?\"<br>\r\n\"Go... good morning, master\" you stammer, hoping he's not understood what you were doing: you don't know how he could react...<br>\r\nThen you gasp, seeing the dragon's naked, except for a towel wrapped around his waist: he clearly's just finished showering. You hope your cock won't become hard!<br>\r\nYou continue: \"yes, I'm fine, I'm very grateful for your great kindness...\" And you're sincere: considering that humans like you are, on this world, no more than toys and/or snacks, Kraigor's showing a surprising goodness, especially compared with Jonsa and Samsa... brrr, their simple memory makes you shiver.<br>\r\n\"No problem, my tiny guy\" he answers, tapping gently your head with the tip of a colossal finger-claw. \"Now listen, I'm going to go out, and...\"<br>\r\n</span></div></div>",
            "created":1098939600,
            "id":223060,
            "title":"The morning after"
        },
        "11221222221222222111211112112":{
            "author_id":"xela",
            "author_name":"HeroicWriter",
            "choices":[
                "... in his underwear.",
                "... in his pocket."
            ],
            "content":"<div class=\"\"><div> <span>\"...I'm going to bring you with me\".<br>\r\nHe doesn't ask if you agree or not, you clearly haven't voice in the matter. Oh, well, you didn't like the idea of staying in that drawer for hours...<br>\r\nHe puts you on the bed, then... he unwraps his towel!<br>\r\nYoure frozen with shock at the sight of that HUGE green column, twice as long as you're tall.<br>\r\nKraigon grabs some clothes, but while he's putting them on, he looks towards you, then smiles maliciously. \"Mmmh, it seems you like what you're seeing...\"<br>\r\nUh-oh! Your worst fears have became reality: your cock's fully erect!<br>\r\nKraigor chuckles: \"Don't worry, my little pet, I appreciate your admiration; maybe I and you can have some fun together.\"<br>\r\nTo your horror, he places you on his monstrous dick, face down; you remember the horrible experiences with Jonsa and Sansa, and tremble, but hear the dragon's calming voice: \"Pipsqueak, my poor little puppy, I've just said you don't have to worry... I'm not going to harm you, trust me...\"<br>\r\nYou wish he's saying the truth, while his huge paw wraps around both you and the cock; its grip's strong but gentle, and after a minute you begin to relax, confident again in your master's good intentions.<br>\r\nWhen you finally stop shaking, Kraigor slowly pushes you down the shaft towards his balls, then up towards the tip, then down, then up... he's masturbating himself, but also you, because your own cock's stimulated by the friction, and he probably foresaw that.<br>\r\nThen you both explode, and you're covered, and almost suffocated, by a wave of dragon-seed. You're forced to swallow a gulp of it, but it tastes good...<br>\r\n\"Well, Pip\", the dragon asks, lifting you before his beautiful eyes, \"did you enjoy sex with Great Master Kraigon?\"<br>\r\nYou manage to pant out a feeble \"Yes\".<br>\r\n\"But Master Kraigor hasn't finished yet...\", and the dragon's long, agile, wet tongue begins licking the cum away from your puny body; it stops more insistently on your balls and cock, and soon you've another orgasm, much to Kraigor's delight: he quicly swallows your product and licks his own lips. Human semen must be a delicious snack on this world, just like human meat.<br>\r\nKraigor smiles, says \"You're really a good pet\"... and kisses you, making you blush!<br>\r\nThen he gets dressed, and puts you...<br>\r\n</span></div></div>",
            "created":1098939600,
            "id":223086,
            "title":"Master and pet have fun!"
        },
        "1122122222122222211121112":{
            "author_id":"xela",
            "author_name":"HeroicWriter",
            "choices":[
                "Your master has mercy.",
                "Your master has not mercy."
            ],
            "content":"<div class=\"\"><div> <span>\"What is he doing?\" you wonder, nervously, hearing him bustling in some nearby room.<br>\r\nThen he comes in again, saying: \"This is perfect for you!\", and places something in front of you: a metal cage!<br>\r\n\"NOOO!\" you shout, desperately.<br>\r\n\"What's wrong?\" Your master seems genuinely surprised and disappointed, seeing you do not like your new \"home\".<br>\r\nYou kneel again, and cry: \"Master, please, don't lock me in a cage! You don't need it, I'll never try to run away from you, I don't even know where to run! Please, master, have mercy!\"</span></div></div>",
            "created":1098853200,
            "id":222919,
            "title":"Cage!"
        },
        "11221222221222222111211122":{
            "choices":[
                "Just like a basic household room.",
                "Covered in blood."
            ],
            "content":"<div class=\"\"><div> <span>However, he doesn't let up. \"Sorry pet, but I can't let you rome free, it's too dangerous. Don't think of this being me trapping you,\", he said, picking you up with a sympathtic look on his face, \"think of this as me protecting you. There are alot of things that could kill you without this,\", gently putting you in the cage, closing and locking the door. \"When you get used to this being your new home, I'll then let you go in and out as you wish, ok?\", he said, holding the cage close to his face. <br>\r\n<br>\r\nLooking at him, scared at what he would do if you say no, you nod quickly, satisfying him enough to bring your new home to a shaded spot by his bed. The spot was on a stool that alowed easy acsess to the bed and the cage, for both you and your master. Looking at you, he speaks in a gentle voice, \"I'll be back soon. Don't worry, you won't fall. I made sure of that,\", with a soft smile, saying, \"I just hope you like raw meat\", walking to the door and closing it with a click, leaving you alone and in something which leaves freedom out of your reach. Well, more so than before at least. Looking around the room, you see that your master is like a regular teenager, messy in some areas, but clean in most others. Then again, he is a dragon. You sigh sadly, knowing that you probably would never get used to this. Turning around, you see, that the room is...</span></div></div>",
            "created":1146858060,
            "id":317167,
            "title":"Stubborn master"
        },
        "112212222212222221112111221":{
            "author_id":"xela",
            "author_name":"HeroicWriter",
            "choices":[
                ".... to \"play\" with you.",
                ".... you need a bath."
            ],
            "content":"<div class=\"\"><div> <span>The room, except for its size, is basically like the room any human teen would have; you see a massive desk, with a tv set, a DVD player and a computer on it; but there are also a baseball bat and more sport items, here and there, and you notice several trophies on a shelf.<br>\r\n\"My new master is a sport jock!\" you think. \"Well, I must admit he's got a great body!\" then you blush at that lascivious thought.<br>\r\nJust then the dragon opens the door and walks in, approaching the cage. You see one of his enormous paws looming over you, and cringe a bit; then a few pieces of raw meat fall near you. \"Dinner's served:\" the dragon tell you with a smile, looking down to you through the bars forming the top of the cage.<br>\r\nYou sigh, disgusted by that \"dinner\", but you're afraid to disappoint the colossal creature, who now holds your life literally in his hands.<br>\r\nSo you grab one of those pieces and with quite an effort bite on it, while your master smiles in appreciation.<br>\r\nAfter you've eaten, the dragon decides...</span></div></div>",
            "created":1150931280,
            "id":325719,
            "title":"A common teen dragon"
        },
        "112212222212222221112111222":{
            "choices":[
                "You have a shower while your master watches you in bed."
            ],
            "content":"<div class=\"\"><div> <span>The cage is covered in dark red blood. All of it's dry though. Smelling a strange sort of copper smell, you realize it's the blood's smell, something which you have smelled when you got a nose bleed. Looking around, you also see a clean sort of bed, a bloody chair (literally, a bath room that's open to your master's pillow area and a water bottle, the same kind that is used for hampsters and rats so they can drink. Looking up, you see a price tag still attached to the top, saying the cage was for 14.98 and it was from a place called \"Second Hand Human Supplies (SHHS for short, smaller in price, same quality\". Obiously the last part doesn't apply to here. Walking over to the bed, you realize how thirsty you are. Walking to the water bottle, you look out of the cage and see that the skies were cloudy and not very welcoming. \"I understand this, but at the same time, I'm just confused.\", you say sadly to yourself. You also see that your master has provided some plastic cups for you. Taking one, you wonder how to get the water out. Tapping the metal part worked, as one large drop came out and into the cup, filling the bottom part. After a few more taps and a few more drops, you now have a full glass. After a few minutes of this, you nolonger have that thirst. However, you now have a growling stoumach. Walking back, you step in some blood, which is still sticky. Pulling hard, you get your foot free. Sighing, you get to your new bed ans fall asleep, despite your hunger.<br>\r\n<br>\r\nAfter a half hour or so, you are awoken by a loud click. Getting up slowly, you see that your master is back and with a box of pizza. Looking at you in your bed, you master smiles and walks over. \"Hey there little one, how are you liking your new home?\", he asks you. Looking at him, you decide to be truthful. Seeing as things could actually get worse, you decide that you might as well face your problems head on. \"Master, to tell the truth...\", you stop and look it over. Without the blood, it actually might be a okay place to live. You have someone who will take care of you and feed you, you have fresh water, a bathroom, a place to sleep, heck this might workout after all. \"To tell the truth master,\", you continue, \"It could do without the blood.\", getting a laugh from your master and the lock being undone. \"Well, that settles that. Your officially moved in,\", says your master. <br>\r\n<br>\r\nAfter dinner...</span></div></div>",
            "created":1146862260,
            "id":317173,
            "title":"Second hand home"
        },
        "112212222212222221112112":{
            "author_id":"cyrilius",
            "author_name":"Cyril",
            "choices":[
                "He orders normal food",
                "To your horror... he orders humans!"
            ],
            "content":"<div class=\"\"><div> <span>You feel the bag shaking a bit, obviously he is walking around with you. Suddenly he mumbles \"Damn, I'm hungry...\" and after a few minutes walking the dragon stops and you hear another voice: \"Hello there, what can I do for you?\" The dragon answers \"Hmmm... lets see...\"</span></div></div>",
            "created":1084856400,
            "id":199845,
            "title":"Hungry Dragon"
        },
        "1122122222122222211121122":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "You obey and talk with Alicia as you eat",
                "You SEEM to obey, but work on planning your escape..."
            ],
            "content":"<div class=\"\"><div> <span>You shiver as you hear his next words. \"I'll have the double human burger, male please, hold the onion, and extra pickles.\"<br>\r\n<br>\r\nThe other voice speaks. \"Anything else?\"<br>\r\n<br>\r\nYou hear the dragon again. \"Yeah, one of your maiden sandwiches, with mustard.\"<br>\r\n<br>\r\nYou cringe. Great, going from a man-etaing giant to a man-eating dragon. Such a suprise. <br>\r\n<br>\r\nYou shake for a moment morew, than the bag opens. \"Are you going to stay in there all day, or do you want some cheese sandwich?\"<br>\r\n<br>\r\nHUH? What is he talking about? \"I heards you! You are going to eat me!\"<br>\r\n<br>\r\nThe dragon smiles. \"Maybe someday, but not for a long time. Today, I'm having WILLING meals.\" He smiles, indicating his burger. \"And you are having a new roomate. I'd like you to meet my new slave, Alicia.<br>\r\n<br>\r\nYou are pulled out onto the table, shocked at what you see. One, the sandwich humas are actually EAGER to be food! @What gives?! Don't these guys have any sense?<br>\r\n<br>\r\nBut it is what ELSE you see that makes you wonder. There before you is themost beautiful woman you ever saw, just your age. She is dressed in foodstuffs (Obviously), but still they look good on her.<br>\r\n<br>\r\n\"Hi. I'm Alicia.\"<br>\r\n<br>\r\nThe dragon smiles. \"Now, you two enjoy the sandwich, while I eat my lunch. And please no funny ideas, I don't want to hurt you.\"</span></div></div>",
            "created":1139893200,
            "id":301441,
            "title":"Hamburgers? No... MANburgers!"
        },
        "11221222221222222111211221":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "The meal and talking continues."
            ],
            "content":"<div class=\"\"><div> <span>You sigh and obey, eating at the sandwich which, only a moment ago, Alicia was lying. It's actually pretty good. You and her talk for a long time about your lives, though hers is much more intresting.<br>\r\n<br>\r\nSeems she is what is known in this universe as a food pet. Food pets are brought up and pampered with the idea that one day they will be eaten. Oddly enough, most humans here are food pets, willing to be snacks. <br>\r\n<br>\r\n\"Giants hate us, because we don' squirm or beg or struggle. We just go down easy.\" She sobs. \"They are so cruel! I hate them all!\"<br>\r\n<br>\r\nYou cannot help but nod. Your experiences with them lately have been anything but pleasant. <br>\r\n<br>\r\n\"But I don't understand.\" You say. \"Why do you WANT to be food? Isn't that just a way of dying?\"<br>\r\n<br>\r\nShe smiles some. \"Not in a dragon. See, dragons have multiple bellies. Some are like that hamburger he's eating, and are willing to die. Me, I've been being swallowed and held inside of a storage sac as long as I can remember.\"<br>\r\n<br>\r\nYou tilt your head. \"Storage sac?\" You ask.<br>\r\n<br>\r\nShe smiles. \"Normally it is where dragons used to store their food in hard times. But now it is more like a food pets private room. I have yet to get a set owner for that room, I am usually just dismissed or used as a diet. I'd love to find one to call home.\"<br>\r\n<br>\r\nYou smile a little. This girl is odd, but she is pretty and nice. And she is just your age to.<br>\r\n<br>\r\nIntresting...</span></div></div>",
            "created":1140066000,
            "id":301846,
            "title":"Alicia and all about 'Food Pets'"
        },
        "11221222221222222111212":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "The local food store.",
                "his cavern home."
            ],
            "content":"<div class=\"\"><div> <span>The dragon smiles. \"I know! Bottoms up!\" He smiles, opening wide. Ah no, not again!<br>\r\n<br>\r\nHe tosses you in, closing it tight behind him. Wrapping you up with his tounge, he starts to walk out of the gym.<br>\r\n<br>\r\nUnfortunetly, you can hear him mmmm in delight. You apparently are very tasty. You struggle some, worried he may decide to make you a snack instead of save your life, but you are wrapped too tight to do much right now.<br>\r\n<br>\r\nAfter a while, he opens his mouth again. He msiles and spits you into his clawed hand, where you are held for now. <br>\r\n<br>\r\n\"Hey there, tasty little one! Sorry for that, but there were two reasons I had to. One, they search gym articles here, and two, you looked like you would be tasty. Turns out I was right on both counts.<br>\r\n<br>\r\n\"Uhhhh... thanks?\" You say, worried. The drgaoin smiles. <br>\r\n<br>\r\n\"No worries! I only eat willing humans. Unwilling ones give me stomach aches. But I am not giving up hope on converting you into being a willing meal.\"<br>\r\n<br>\r\nYou sigh. Bakc into trouble again. \"Don't hold your breath. I'd rather not be eaten.\"<br>\r\n<br>\r\nThe dragon nods. \"We'll see. For now, you may call me Altair. And since I have to name you as a sort of tradition, I think I'll call you Silvaro. It means 'tasty one' in human tounge, or 'kind one' the words are the same.\"<br>\r\n<br>\r\n\"But I...\" You start to say, but the dragon sushes you.<br>\r\n<br>\r\n\"Trust me, it is better you forget what names you had. The giants will find you again if you keep it. as Silvaro, you are gone from them for good now. Trust me.\"<br>\r\n<br>\r\nYou sigh. \"Fine. I'm Silvaro. But you got to admit, it is a little hard to say.\" <br>\r\n<br>\r\n\"I'll call you Var for short then.\" he smiles and walks off. You look behgind you, and you manage a small smile.<br>\r\n<br>\r\nNo matter what, you did escape. Now maybe you have a chance of getting home again. Somehow.<br>\r\n<br>\r\nTHe dragon smiles and walks off to...</span></div></div>",
            "created":1140458160,
            "id":302658,
            "title":"Ah crud."
        },
        "112212222212222221112121":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "A beautiful lady dressed in sundae toppings",
                "A tomboyish girl wearing a salad."
            ],
            "content":"<div class=\"\"><div> <span>He heads to the local Food store, still holding you in his claw for awhile. He smiles when he gets there and shows you a sign on the door. When you see it, you smile a little to. It reads:<br>\r\n<br>\r\n\"Various human foodstuffs: cakes, pies, fruit, and such. The perfect treats for pet humans. On Sale!\"<br>\r\n<br>\r\nThe dragon looks to you. \"And just to clarify, it means human food, things I can feed you.\" He smiles and walks in. \"I hope you don't mind I got to get some willing meals for myself to.\"<br>\r\n<br>\r\nYou cringe some. \"Well, to be honest, I do kinda mind. After all...\"<br>\r\n<br>\r\nAltair nods. \"I understand Silvario. they are your kiun, you cannot see them as dragon food. New arrivals usually are that way. Well, in that case, I'll keep what I get a secret.\" You manage a smile, in spite of still knowing that the dragon DOES eat people. <br>\r\n<br>\r\nMaybe he will wind up eating you.<br>\r\n<br>\r\nFor now he seems friendly. He waves to local creatures, some of which oooo and ahhhh at seeing you ,calling you a cute pet. Others, particularly a pinkish dragon who is actually kinda hot, just drool. You can bet they want you as a meal.<br>\r\n<br>\r\n\"Don't pay them any mind.\" Altair tells you, handing you some of the Fast Food treats. \"We have a code. We only eat the willing. Some do get close, but we rather eat willing prey. Besides, if you do turn willing, I already have you.\"<br>\r\n<br>\r\nYou shiver some. Unable to get being eaten out of your mind, you do not touch the food. For now. <br>\r\n<br>\r\nYou watch then as he passes various human sections. He stays away form the unwilling ones, moving to those who seem eager to be food. You spot one who stands out to you:</span></div></div>",
            "created":1140730440,
            "id":303166,
            "title":"Food!"
        },
        "1122122222122222211121211":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "Deal",
                "No Deal"
            ],
            "content":"<div class=\"\"><div> <span>You look at her and cannot take your eyes away. She is dressed in what appears to be sundae toppings, wtih a whipped cream hat and bikini and chocolate syrup all over her. Chopped nuts the side of your hand are on her shoulders, and a cherry is right on top of her head.<br>\r\n<br>\r\nBut her form gets you glued to her. She is more beautiful than any person you have ever seen before, with a shapely form and tanned skin. Her eyes are soft blue, and her lips a rose red. She has a pleasant smile as several patrons look er over, but none seem to buy her. You can see why.<br>\r\n<br>\r\nUnder the holding area where she is is a price tag: Goo, food human. $500. <br>\r\n<br>\r\nYou look to your new owner and then to her again. <br>\r\n<br>\r\n\"Ah, you see something you like huh?\" He winks and gives a low growl. You blush some. <br>\r\n<br>\r\n\"Well... she is kinda cute and...\"<br>\r\n<br>\r\n\"Say no more. I happen to have enough to get her. But I warn you, by doing this for you, you have to agree to something.\"<br>\r\n<br>\r\nYou gulp. \"What?\"<br>\r\n<br>\r\nHe smiles toothily. \"When the time comes, you consent to being my meal. Both of you.\"<br>\r\n<br>\r\nYou shiver. If you say yes, you will get to meet Goo, but you will lose her later to your new friend's stomach, one you will suffer and die in as well.<br>\r\n<br>\r\nIf you say no, you won't get eaten yet, but she will be. She actually looks like she WANTS to be.<br>\r\n<br>\r\nSo, the ultimate question: Deal or No Deal?</span></div></div>",
            "created":1141153980,
            "id":303947,
            "title":"Meet Goo"
        },
        "11221222221222222112":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "he is pleasured",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>You are very surprised when you feel the underpants get pulled from beneath you, and stayed against Jonsas’ ballsac!  Apparently Jonsas’ sweat had solidified and acted like glue thus causing you to get stuck to the ballsac.  While Jonsa looked around frantically for his little human you sway with his ballsac.  It is a very interesting experience for you, you find the idea of being stuck to a ballsac as it swayed back and forth to be very exciting.\r<br>\nJonsa is frantic, he is terrified that his human had somehow gotten away and been found by another Bajirran, he knew that if another Bajirran found him than there is almost a 100% chance that his little human would find himself in the belly of a strange Bajirran.  Then he felt a slight weight on his ballsac and sighed, of course he should have realized that.  He realized that his sweat had probably stuck his human to his ballsac as he excersized and reached down to pull you off.\r<br>\nYou can do nothing as you watch the huge hand come and grab onto you, slowly peeling you off the warm, soft ballsac.  After a few seconds you are free and brought up to Jonsas’ face.\r<br>\nJonsa smiled at him “Did you enjoy being stuck to my ballsac little human?”\r<br>\nYou could only nod.\r<br>\nJonsa laughed “Wonderful don’t worry, that sweat will wash right off when we get into the hot tub with Samsa.”  Jonsa started walking towards the hot tub room while you think about what would happen.\r<br>\nAs Jonsa enters the hot tub room he smiles when he sees that it is completely empty, except for Samsa.  Samsa smiles up at Jonsa and waved him in to join him.  Jonsa smiles back and quickly climbs into the tub.  He sits next to Samsa and slowly brings you into the water.\r<br>\nYou moan as you feel the warm water start to come up your body and quickly found himself on the surface of the water with nothing to hold you up.\r<br>\nJonsa smiles down at you, “Don’t worry little human, for some reason when something is your size they have no problem breathing underwater.  Feel free to dive down and swim around as long as you want.  We aren’t going anywhere for a while.”\r<br>\nYou think for a moment and decide to give it a try, you dive down a little ways and realize they were right, for the most part.  You don’t actually breathe through your nose, you actually absorbe the oxygen from the water through your skin.  You smile as you realize you can stay down as long as you want and dive much farther down.  You swim down until you find yourself before Jonsas’ package and smile at the sight of the sheath and balls swaying back and forth in the slight current of the water before you swim over to it and started to rub it.\r<br>\nJonsa smiled as he feels his human touch his package underwater.  He thinks how lucky he is to have gotten one of the extremely few humans thought likes to be close to a Bajirran.</span></div></div>",
            "created":1020574800,
            "id":104156,
            "title":"Found, and taken into the hot tub"
        },
        "112212222212222221121":{
            "author_id":"giant_tales",
            "author_name":"Beanstalk",
            "choices":[
                "crush the tiny man when Jonsa is not looking",
                "steal him for his own use "
            ],
            "content":"<div class=\"\"><div> <span>\"Now if you'll excuse me my little pet has a job to get started on.\" The indulgent Bajirran stretches out to get more comfortable and lays against the edge of the hot tub. He kicks up his feet to expose his wrinkly soles on the tub. In the island of his crotch region, there is a frantic splashing around and something rushing up against his growing member.<br>\r\n<br>\r\nSamsa is in shock and almost can't believe it. Could he be replaced by this tiny human? He watched in a mix of jealousy and arousal as Jonsa purred with pleasure. All the splashing around had produced a desired effect. Jonsa shifted his hips to adjust his sitting position. In the water Samsa spotted the burning red tip of the giant's exposed groin. It had taken a long time for even that and for Jonsa to finish, it could take hours. Hours of being in the hot tub and wasting all their free time. <br>\r\n<br>\r\nSamsa reached over to grab one of Jonsa's feet and rub it to appease his lover but Jonsa was occupied with his own activity. <br>\r\n\"<i>Not now Samsa</i> my pet is worshiping me.\" He grunted between breaths of growing excitement. <br>\r\n<br>\r\nFurther outrafed, Samsa decided he had only one choice left to make everything right again. </span></div></div>",
            "created":1486796700,
            "id":2276179,
            "title":"Dangerous love triangle "
        },
        "112212222212222221122":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He accidently shoves you further in",
                "He feels you, and pulls you up to his face"
            ],
            "content":"<div class=\"\"><div> <span>Underwater you tire of massaging Jonsa and swim over to Samsa and start to do the same for him.\r<br>\nSamsa smiled and shuddered as he felt the little human touch him.  He wondered why he wasn’t lucky enough to have gotten a human like Jonsas.  Then he shrugged and just enjoyed the feeling of the human against him.\r<br>\nJonsa smiles at the sight of his friend enjoying his little humans' touches when he hears the door open and close.  He looks over and is surprised to see the freshman he had talked to earlier that day walk in and start to get into the hot tub.\r<br>\nYou are surprised when you see a pair of legs enter the tub not far from you and start walking by.  The strong current they cause sweeps you along and he find yourself on the ledge that is used for sitting fairly close to Jonsa.  You look up and are horrified to see the other male Bajirrans ass start to decend towards you.\r<br>\nYou are pressed into the ledge as the freshman sits on you, you are forced to stare at the huge anus that is right before you.  You want to struggle to get away but realize that would only cause you to be discovered by the large creature and decide to wait until he decides to leave.  Fortunatley, you think with a smile, I don’t have to smell his anus.\r<br>\nJonsa is nervous as he sees the freshman sit on his human and prays that you don’t try to escape from beneath him.  “What are you doing here?”\r<br>\nThe freshman smiles, “I came here to work out and relax, it is just pure chance I found you here.”\r<br>\nJonsa smiles politely at the freshman, trying to think of a polite way to get him out of here.  Suddenly Samsa gets up and starts to leave.  “Where are you going?  I thought you were going to sit here with me for a while.”\r<br>\nSamsa looks back at Jonsa, his face full of disappointment, “I want to, but I just remembered that I have to get to work.  I forgot this is a work day because of school being cancelled so I am already late.  I will talk to you later though.”  With that he left.\r<br>\nJonsa sighed and looks back at the freshman thoughtfully.\r<br>\nThe freshman looks at the college junior before him and tried to think of a good way to start the conversation he wants.  Suddenly Jonsa does it for him.  \r<br>\n“I have seen you admiring me in gym class while we shower.”\r<br>\nThe freshman blinks in surprise then feels embarresed.  “Yeah, I hope you aren’t mad at me for that.”\r<br>\nJonsa smiled “On the contrary, I sort of like the idea of someone admiring my body.”\r<br>\nThe freshman smiles back.\r<br>\n“I am sorry, I don’t recall your name.”\r<br>\nThe freshman smiles again “It is Kessana.”\r<br>\nJonsa smiled “Well, Kessana.  Now that we are alone, and in the buff would you  like to get to know me a little more?”\r<br>\nKessana smiles “Sure.” As he startes to move closer to Jonsa he feels something beneath him and reaches down to scratch it.</span></div></div>",
            "created":1022302800,
            "id":105244,
            "title":"Enter, Kessana"
        },
        "1122122222122222211222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He pulls you out",
                "Jonsa comes in, and has more fun planned for you"
            ],
            "content":"<div class=\"\"><div> <span>You are scared as you feel the Bajirran lean to one side and see a huge hand coming towards you.  The fingers started to scratch the anus, but then they felt you and grab you roughly.  You are quickly pulled out of the water and to Kessana's surprised face.<br>\r\n“What were you doing against my anus little human?”<br>\r\nYou stared in horror at the huge face of a Bajirran you have never met before and are immediately afraid yoy will be eaten by him.<br>\r\nJonsa immediately steps in before Kessana starts to get any ideas.  “That is my human, he was swimming around when you came in and sat on him.”<br>\r\nKessana nods “I is wondering if he is yours.  Can he join us in our fun?”<br>\r\nJonsa smiled “Sure, he already knows my body.  But it can’t hurt for you to use him to help you explore my body.  Start where ever you would like.”<br>\r\nKessana smiles and goes over to Jonsa and submerges his head so he is facing Jonsa's package, he smiles then touches it for a few moments with one hand.  After he goes up for air he starts to rub you on Jonsas’ manhood.<br>\r\nYou smile as you feel yourself start to get rubbed along Jonsa's package once again and thought how nice it feels to be up against something so soft and fleshy.<br>\r\nKessana is a little surprised when he feels Jonsa reach down and start to rub his own package, but he closes his eyes and starts to moan as he feels Jonsa touch him.<br>\r\nJonsa's hand moves slowly around to Kessana's backside and grips his buttock.<br>\r\n“Would you like me to have my human explore your backside a bit more closely?”<br>\r\nKessana could only nod and hand you over as he turns around and shows his backside to Jonsa.<br>\r\nYou stare in horror as you are lowered to Kessana's exposed anus and realize you are about to be shoved in it.  You start fighting for all you're worth to avoid having that done to you.<br>\r\nJonsa smiles at his little humans struggles and just moves you towards Kessana's ass faster.<br>\r\nYou stare as the anus takes up your whole field of vision and are slowly pressed against the strong muscle of Kessana's anus.  You struggle as you feel yourself slowly sliding into the anus, face first.  It is an interesting trip for you, the anus feels like it is giving him a warm embrace and you can feel it flexing around your body as you are inserted.  After a few moments you are finally all the way inside Kessana.  You sit up and look around your surroundings.  You realize that some property of the Bajirrans anatomy allowes you to see inside of them, or perhaps it is the small size of your eyeballs that allows the small bit of light in here to let you see everything in perfect detail.  Whatever the reason you can see in here, you see that the walls of the rectum aren’t red, but more of a reddish blue.  As you explore you realize there is air in here and it has a strange scent.  As you look around you see the source of the scent.  It is a large turd at the other end of the rectum, when you get a little closer you realize there are several bones in it, and most of them don’t appear to be human bones.  You shudder and wonder if all of the owners of those bones had been swallowed whole as you feel the rectum shudder around you.<br>\r\nKessana smiles very broadly as he feels himself cum in Jonsas mouth.  He smackes his lips at the salty aftertaste of Jonsa's own cum.  He can feel the human moving around in his bowels and it makes him feel very excited, knowing that there is a small living creature moving around where many dead meals met the end of the line in his digestive tract.  Suddenly he feels a cramping in his bowels, he smiles a bit at that but suppresses the feeling, not wanting to spoil the fun.  After a few more minutes of playing around both Bajirrans sat back, panting from the effort and both sated, sexually.  Kessana lookes over at Jonsa.  “I have to use the facilities, I will fish your little human out when I am done, ok?”<br>\r\nJonsa smiles, “Yes, that is ok.  I will be waiting here for you.”<br>\r\nKessana smiles and walkes out of the hot tub room and finds an empty stall and sits down on the toilet and relaxes his bowels.<br>\r\nInside of Kessanas’ rectum you feel the walls start to contract and push you towards the anus, since you are much smaller you get there before the turds do. You look back and see that the turd is also coming along, though much more slowly.  You are slowly pushed back out through the anus and are happy when you feel yourself leave the rectum and fall through the air.  When you impact with the water in the toilet it is surprising how cold the water is.  After you recover a bit from the shock of the cold water you look up and are greeted with the sight of Kessana's flexing anus.  After a few seconds you see the head of the turd start poking out of his anus.  You can only stare in horror as it is slowly pushed out of Kessana.  You hear grunting above you as it is pushed out.  Finally it comes free from his anus and falls to the water with a great splash right next to you.<br>\r\nKessana hears the splash beneath him and smiles.  He tries to imagine what it must be like for the human to be beneath him as he poops.  He feels another turd leave his bowels and splash in the water below him. He smiles again as he feels more turds waiting their turn to be pushed out.<br>\r\nAfter several minutes more Kessana's anus stops flexing and he just sits there.  You sigh a breath of relief.  You have never seen so many turds at one time, the bowl is full of them and they all seem to have little bones in them.  Several had sunk to the bottom, but many were floating and you have grabbed onto one because you are tired from swimming to avoid the falling objects.</span></div></div>",
            "created":1022994000,
            "id":110035,
            "title":"The boy's fun, and your fun in the toilet"
        },
        "11221222221222222112221":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He tells you of his intention to eat you at dinner",
                "He tells you something else"
            ],
            "content":"<div class=\"\"><div> <span>After several minutes Kessana gets up and looks into the bowl, after a few seconds he spots you, and smiles as he reaches in and plucks you from the water.  He sets you down on the seat and tells you not to slip as he turns around again and bends down as he grabs some toiletpaper.  You turn away as Kessana starts to wipe himself.  After a few seconds you feel Kessana grab you again and hear the toilet flush as the stall door opens and you are walked back to the hot tub room.  Jonsas smiles at the two of you as you get back in the tub.<br>\r\nAfter Kessana has sat down again Jonsa looks right at you, “Did you enjoy the show?”<br>\r\nYou nod, not trusting yourself to speak.<br>\r\nJonsa and Kessana laugh.  When they are finished laughing Kessana looks at Jonsa “I know he is a human, but could you please not eat him until lunch at school tomorrow?”<br>\r\nJonsa smiles, “I was planning to eat him after dinner tonight, but I guess tomorrow would be ok.”<br>\r\nKessana smiles, “Thanks, I will see you tomorrow then.”  He hands you back to him, then gets up and walks out of the room.<br>\r\nJonsa gets up himself and walks back to his locker and gets a courtesy towel along the way and dries himself off before dressing again and putting you back in his underpants.<br>\r\nYou have a long ride back to Jonsa's house in his underpants.  There was still a lot of moisture in here from Jonsa's dip and that just makes his male scent even stronger than normal.  After about an hour in the underpants you hear the door to the house open and close, you have finally gotten back to his home.<br>\r\n“I am back!”<br>\r\n“Oh, good honey.  Dinner will be ready in just a few minutes.  I hope you are hungry!”<br>\r\n“Oh, yes mom.” You feel Jonsa slap his belly “I am VERY hungry.”  Jonsa laughs and starts to walk to the kitchen.  “Ah, my favorite!  Pounded meat with live Wols!”<br>\r\nYou hear Jonsas' mother laugh and reply “Oh, I know how much you love your Wols!  I remember back when you first tried one and how your face lit up when you felt it struggling in your tummy!”<br>\r\nJonsa and his mother both laugh while you shiver slightly despite the extreme warmth of this enviroment.<br>\r\n“I think I will go change my shirt and wash up before dinner.”<br>\r\n“Ok sweety, don’t take too long though!  We start eating as soon as your father gets home.”<br>\r\nYou feel Jonsa start walking again and wonder what he has planned for you.  After a couple minutes the top of the underpants opened and spilled in blinding light onto you.  You feel yourself get grabbed and hoisted out of the underpants and the next thing you know you are looking Jonsa right in the face.<br>\r\n</span></div></div>",
            "created":1025758800,
            "id":110036,
            "title":"Plucked out, and taken back to Jonsas' home"
        },
        "112212222212222221122211":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Eat you right then",
                "Save you for later"
            ],
            "content":"<div class=\"\"><div> <span>\"You're gonna be part of my favorite dinner!\"  Jonsa grins, maniacly.  He sets you down on his bed and places a glass box over you.  \"Stay right here.\"  It's not like you have a choice.  He removes his shirt and stomps down to the kitchen.  After about 5 minutes, you can hear thuds again.  He's coming back upstiars.  In his hands he has a massive plate of food.  Heaping slabs of meat cover the plate.  He is also carrying a bowl.  The bowl has squirming, human-sized creatures in it which you take to be Wols.  He sets his dinner on the bed and lies down.  Then, he lifts your glass prison and picks you up.  He decides to...</span></div></div>",
            "created":1161573120,
            "id":354408,
            "title":"Getting Dinner"
        },
        "112212222212222221122212":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Jonsa decides to eat you now",
                "Jonsa decides to have some more fun"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa smiles at you before he says “During dinner I will put you in my shirt pocket so you can see and hear more.  I wouldn’t advise moving around too much or trying to escape, or you may find yourself in a belly sooner than you expected and it may not even be mine!”<br>\r\nYou shudder, you know that you are going to end up in a belly eventually.  But you want it to be as long as possible before that happens, and somehow it seems better if Jonsa is the one to do it.  “I will be quiet master.”<br>\r\nJonsa smiles “Good, I will try to slip some food in for you to eat while you watch me eat.”  Jonsa then places you in his shirt pocket and walks downstairs to dinner.<br>\r\nOnce dinner has started you realize just how good a view you have of Jonsa from the pocket.  You watch as Jonsa takes cut up pieces of meat to his mouth, chew it up and gulp them down.  Watching him eat the Wols was more disturbing.  He would bring the Wols up to his face, smile at them then he would open his mouth and drop them in and swallow them.  Throughout the whole process they would be making a horrible screeching sound and would squirm alot.  With some of the larger Wols you can actually watch their shapes squirm through his throat.  Needless to say you are very happy when dinner is finshed and Jonsa heads back to his room.<br>\r\nWhen Jonsa gets back to his room he reaches into the his pocket and takes you out and sets you on his bedspread. You see that the door to his room is closed as Jonsa takes off his shirt and pants and smiles down at you.  After a couple seconds Jonsa goes over to the tank where the other humans are kept and randomly grabs one.  He walks back over to his bed and grabs you as he lays on his back.  He looks at the human he grabbed out of the tank and smiles at him “You are going to join my dinner, you lucky human and this one here is going to watch you get eaten.” Jonsa laughs at the horrified expression on the humans' face and opens his mouth wide, giving both you and the other human a very good view of it.  The other human is tossed in and you watch in horror as he stumbles around Jonsas’ wet tongue for a couple seconds before the mouth closes and you hear Jonsa gulp.  Then Jonsa opens his mouth again to show you how it is now empty.  After a couple more seconds he lowers you to his belly “Listen to the Wols and your friend my little human.”<br>\r\nYou can do nothing but listen to the gurgling, screeches and the screams coming from Jonsas’ belly.</span></div></div>",
            "created":1025758800,
            "id":110044,
            "title":"Dinner, and a snack"
        },
        "1122122222122222211222122":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You start squirming, don't want to die in here!",
                "You refuse, what could happen?"
            ],
            "content":"<div class=\"\"><div> <span>After a couple minutes Jonsa takes you away from his belly and gets up and gets the second to last human out of the tank.  He goes back to his bed and lays on his back again.  He places you in front of his sheath and places the other human before his anus.  “Second human, clean my ass while your friend up here pleases me.  Be careful not to get sucked in when I cum though.”  He looks at you and smiles “Well, get started.”<br>\r\nYou sigh and walk to the head of his sheath and start to rub it.  After a couple moments you hear a sigh from behind you “Not good enough, I guess I will have to help you.”  The next thing you know you feel a finger behind push you face first into the sheath!  You pass into the sheath very easily and find yourself in a warm, slimy enviroment with very little light.  You can barely make out Jonsa telling you to start squirming in here to make him hard, or he would stay in here until he suffocated!</span></div></div>",
            "created":1025845200,
            "id":110048,
            "title":"please him, again"
        },
        "11221222221222222112221221":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He decides to swallow",
                "He decides to spit  you out"
            ],
            "content":"<div class=\"\"><div> <span>You shudder, dying in a sheath is not very high on your list of desired deaths so you start squirming for all your was worth.  After a few moments you notice something creeping towards you, a few moments later you realize it is Jonsas’ cock!  It starts to push against you, starting to force you out of the sheath, bit by bit.  Once you have made it out of the sheath you sigh a breath of relief and watch as the cock finishes coming out.  “Start serving it human.”<br>\r\nYou sigh and go to the side of the huge cock and start to rub it as best you can.  After a few minutes you hear Jonsa sigh in annoyance and feel yourself get grabbed and pushed against the cock roughly.  You start getting rubbed back and forth along it very forcefully, fortunately for you it is slimy and you don’t get injured from it. You hear Jonsa start to breath heavily and the cock beneath you starts to pulse.  Suddenly you are taken from the side of the cock to its' head!  You stare at the piss slit before you for just a second before you are hit in the face with a powerful burst of cum.  Jonsa continues to cum for several moments, completely covering you in it.  Then he sighs and lays back, still breathing heavily.  You watch as Jonsas’ cock slowly starts drawing back into his sheath, after a few moments he are brought up to Jonsas face.<br>\r\n“Oh, you are all covered in my spunk.  I guess I better clean you off!”  You watch as Jonsa opens his mouth and tosses you in.  The mouth closes quickly, but you can still see because of some sort of light coming from the walls of the mouth.  You start getting tossed around by Jonsas’ tongue, you can feel the cum coming off of your body from Jonsas’ saliva.  Then Jonsa stops and you realize you are facing Jonsas’ throat.  You suddenly start to worry that Jonsa will swallow you now!  You can tell that Jonsa is seriously considering it.</span></div></div>",
            "created":1025845200,
            "id":129875,
            "title":"Pleasure him fully, and be shoved in his maw"
        },
        "112212222212222221122212211":{
            "author_name":"giantess bunny",
            "choices":[
                "fall into his waiting belly",
                "continue from Jonsa's pov and finish up the rest of your little toys."
            ],
            "content":"<div class=\"\"><div> <span>The very thought of falling down into that infinite blackness is unbearible, you turn and try to run, but his moist tounge is constantly hendering your attempts, you finally trip and fall onto it, defeated. The huge glowing \"room begins to tilt back and you cant help but slide toward your fate. </span></div></div>",
            "created":1051678800,
            "id":155500,
            "title":"no escape"
        },
        "1122122222122222211222122112":{
            "author_name":"giantess bunny",
            "choices":[
                "Suck him all the way in",
                "go get your last human"
            ],
            "content":"<div class=\"\"><div> <span>The little human tries futily to run on your huge tongue, however you can feel them slowly slipping back. After letting it sink in on them for a moment, you gulp deeply, sending them into the abyss of your stomach. You can feel them land in your soft stomach, your focus goes to only that for a moment, before you remember the other human clean you. The wols you ate earlier are digesting nicely and you can feel a build up of gas. \"I hope you didnt get stuck like I warned, this will be much worse if you did.\" After letting your warning sink in for a moment you squeeze out the worst fart you can muster, your anus literally seems to burst to life as the human screams and squirms, vibrating the walls.</span></div></div>",
            "created":1055739600,
            "id":162159,
            "title":"And gulp..."
        },
        "112212222212222221122212212":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He laughs and pulls him the rest of the way in",
                "He despretly pushes to try and get the human out alive"
            ],
            "content":"<div class=\"\"><div> <span>Then more light suddenly streamed in and you are spat back out into Jonsas’ hand.<br>\r\nJonsa looks down at you for a moment before speaking “You know human, you are very lucky that I promised Kessana that I would eat you tomorrow, or you would be on your way to my belly right now!”<br>\r\nYou shudder at that thought.  Suddenly you remembered the other human “Master, the other human!”  Jonsa looks at you a second before he remembers as well.  Peter watches as Jonsa reaches down to his ass and starts to feel around for him. You see the look of confusion on his face.<br>\r\n“Hmm, I can’t find him.  You look for me and tell me if you can see him.”<br>\r\nYou are quickly dropped in front of Jonsas’ anus and start to look around.  After a couple moments you notice something, and shudder.  You see a human hand sticking out of Jonsas’ anus, it is fumbling around as if looking for a way to pull itself out.  “He is inside your ass master!”</span></div></div>",
            "created":1037077200,
            "id":129876,
            "title":"ooops, ass ate the other human"
        },
        "1122122222122222211222122121":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You sleep in his undies",
                "You sleep, somewhere else...."
            ],
            "content":"<div class=\"\"><div> <span>After a couple seconds you hear Jonsa laugh “Well, I told him to be careful not to get sucked in.  I guess he decided not to listen to me!  Well, I guess I better suck him in all the way so he can enjoy the short time he has down there.”<br>\r\nYou watch in horror as the anus flexes and slowly draws in the hand.  You hear Jonsa laugh, then Jonsa tells you to wait a second.  After a few seconds you watch as the anus flexes again and for a hopeful moment you think Jonsa is pushing the poor human back out.  This hope is quickly dashed as Jonsa farts on you.  You hear Jonsa laugh again “That was your friends last breath of air, now he can do nothing but suffocate in my turd factory and be shitted out tomorrow!  You sob a bit before you are once again grabbed by Jonsa.  You are brought up to his face and Jonsa looks at you a second before speaking “Don’t worry, you will be joining your friends in a while.  But for now I think we should get some sleep.\"</span></div></div>",
            "created":1037077200,
            "id":129878,
            "title":"His ass finishes it's meal"
        },
        "11221222221222222112221221211":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Go with him",
                "Watch from the counter"
            ],
            "content":"<div class=\"\"><div> <span>\"Tonight you will sleep in my underpants, but I will chose a more loose pair so you can move around to avoid getting squished as I toss in my sleep.\"  He goes over to his underwear drawer and looks around a bit before finally choosing one of his larger pairs.  He places you on his desk and slips on his underpants, then he grabs you again and walks back over to the bed.  He sits down and opens the front of his underpants and drops you in as he lays on his back and turns off the light and starts to drift off to sleep.<br>\r\nIt takes a very long time for you to fall to sleep because Jonsa tosses and turns a lot in his sleep.  When Jonsa finally stops tossing around, you are stuck in Jonsas’ ass, very close to his anus.  You sigh when you realize that you are going to have to breathe the stench of Jonsas’ backside all night.  Jonsa farts many times in your face before he goes to sleep, fortunately for you you have many nice dreams on your last night alive.<br>\r\n\t<br>\r\n<br>\r\nYou are awoken early the next morning when Jonsa farts in his sleep.  The horrible stench wakes you up and you immediately gag on the horrible smell. There is some light already out so you can barely see the anus that is right in front of you.  You shudder as you think of how you will be coming out of that ring of muscle in a different form in a couple days.  The ring of muscle flexes and Jonsa farts right on you once again. You cough and start to struggle to get away from the ring of muscle.  The next thing you know you are nosing the disgusting ring of muscle.  After a couple seconds you realize that Jonsa must be sitting up and forgotten abut you.  You immediately start to squirm, trying to get away from Jonsas’ anus.  The anus flexes and farts yet again and a couple seconds later, you feel Jonsas’ weight shift and yourself get grabbed, for once you are glad to be grabbed by Jonsa.  Jonsa brings you up to face level and smiles at you.<br>\r\n“Well my human, today is the big day!  Since this is your last day alive I will let you have some say in what happens to you before I eat you.”<br>\r\nYou nod gratefully at Jonsa.<br>\r\nJonsa smiles again “I am going to take a shower now, do you want to go in with me or watch from the counter?”</span></div></div>",
            "created":1037077200,
            "id":129879,
            "title":"Night in his undies, how fun"
        },
        "112212222212222221122212212112":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "In his shorts",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>You look at him “I think I will just watch this time master.”<br>\r\nJonsa nods and heads to the bathroom.  He closes the door, sets you on the counter and takes off his underpants.  He turns to Peter “Take a good look human, this may be the last time you see my package in the full light of day.”<br>\r\nYou can’t help but take in every detail of Jonsas’ package, from his plump sheath to his plump, sagging ballsac which swings penously with every movement that Jonsa makes.<br>\r\nJonsa smiles at you again then steps into the shower while you watch mesmirized and proceeds to bathe himself, taking every chance to show his package to you again.  When Jonsa has finished showering and drying himself off he moves so his package is right in front of you and you can’t help but look at it.<br>\r\n“Where would you like to spend the day my little human?”</span></div></div>",
            "created":1037077200,
            "id":129880,
            "title":"Watch him bathe"
        },
        "1122122222122222211222122121121":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You try to escape",
                "You stay put"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa smiles again, grabs you and walks back into his room, placing you on his dresser while he rummages through looking for his boxers. When he finally finds them he puts them on and smiles down at you. \"Have fun in my shorts today human, and be careful not to let go or slip off, or you may fall out of my shorts and pants and someone else may find you and eat you!\"<br>\r\nYou shudder, not sure if it would be better to fall out and try to get away and risk being eaten and tortured again, or stay in the shorts and certainly be eaten.  Jonsa reaches down and grabs you. He holds you over his boxers as he holds it open. You can only look down for a couple seconds before you are dropped in. You immediately grab hold of Jonsas' plump sheath head and hoist yourself atop of it. There is some light in here so you can see everything fairly well. When Jonsa has finished dressing he walked down stairs for breakfast, you are surprised by the freedom of motion you have in here. As he watched Jonsas' limp ballsac swings back and forth freely and his sheath also swings, though not nearly as much.  Jonsa eats a quick breakfast, not even bothering to pay attention to what it is and walks quickly to school and his first class.</span></div></div>",
            "created":1037077200,
            "id":130114,
            "title":"In his shorts, again"
        },
        "11221222221222222112221221211211":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "It's a Male",
                "It's a Female"
            ],
            "content":"<div class=\"\"><div> <span>You hold on tightly to Jonsa's ballsac, feeling it sway as he moves to his first class of the day.  you hear a lot of noise in the hallway, a lot of other Bajiirans moving around, talking, doing their daily activities, with no idea of where you are.<br>\r\nAfter what feels like an eternity, you feel Jonsa slowly sit down at his desk, settling in for his first class of the day.  You relax your hold a bit, and sit there, next to his relatively large, furry, musky balls.  You think hard, do you truly want to be his lunch?  You slowly start shaking your head, of course you don't! why on earth would you want to be someone's lunch?!<br>\r\nYou growl to yourself, and immediately stand up, and start running to the opening at the bottom of his shorts.  You feel the chair start sloping down, telling you that you are almost to the end of it.  You grab onto Jonsa's leg fur, trying not to let him feel you doing that, and start carefully, slowly, climbing down his furry leg as he sits in class, trying to pay attention and learn.<br>\r\n<br>\r\nAfter a half hour of climbing down, you finally reach the ground.  whew, what a work out that was!  but you dont' have time to relax, you have to get out of here, keep from being caught by him!  You look around, and see that Jonsa sat near a wall, and that not too far away, is the door.  perhaps you can squeeze under the door, and get away?<br>\r\nYou grin to yourself, feeling excited, perhaps, you can get away, perhaps, even better, you can find a way home again!<br>\r\nYou start eagerly running along the wall, heading to the door.  When you finally get there, you lean down, and crawl under the door, and into the hallway.<br>\r\nYou move to the doorframe, and sit, sighing, trying to relax from your ordeal.<br>\r\nAs you sit there, you hear the sounds of a large creature walking down the hall.  You look up, and see, a bajiiran! </span></div></div>",
            "created":1069909200,
            "id":180023,
            "title":"Escape!"
        },
        "112212222212222221122212212112111":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You decide not to risk it",
                "You decide to try and ask him for help, see if he's nice"
            ],
            "content":"<div class=\"\"><div> <span>You shiver in fear, seeing that it's a male walking down the hallway, heading to who knows where.  You think back to how Jonsa treated you, are all males that bad? will he be cruel to you as well? should you take a chance, and try to get him to help you?</span></div></div>",
            "created":1069909200,
            "id":180025,
            "title":"Male in the hallway, nice one?"
        },
        "1122122222122222211222122121121111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "The home has pests... big ones",
                "You find your way out into the lawn"
            ],
            "content":"<div class=\"\"><div> <span>After what you've been through lately the last thing your going to do is risk to fate your own future, you see the male approaching and do your best to hide, feeling around at the wally you notice there is a small plate in the wall, feeling around for it more, trying to pull it off despertly it gives in a bit, then you notice this is actually an outlet, and its bottom isn't screwed in, moving it to the side you climb through against the wires and shove yourself into the walls ans start to climb down the wiring, hoping against hope that its insulated and no one turns on something that'd electrocute you. Eventually you climb down for what seems like miles to reach the \"Floor\" of the wall. Taking your chance to rest you pant for a few minutes whiping the sweat from your brow. Eventually you start to move again, keeping your wits about you.</span></div></div>",
            "created":1133154000,
            "id":286501,
            "title":"Never to be captured again.. to the walls"
        },
        "11221222221222222112221221211211111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "The house is infested by giant rats... giant to you",
                "Lizards? who ever heard of Lizardy pests"
            ],
            "content":"<div class=\"\"><div> <span>As you move around the floorplan of the home while in the walls you manage to get down bellow the floor, hearing footsteps above you, creaking and sounding like thunder.. of course you also notice that your not alone. You've stumbled into the homes \"pests\"</span></div></div>",
            "created":1133154000,
            "id":286502,
            "title":"The Pests"
        },
        "112212222212222221122212212112111111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "It's Caught in a Trap.",
                "Its munching on a discarded candy bar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The rats of this home are massive, though not as much as the beasts that had you. they are naked and white.. almost ten feet long... and now your face to back with one...</span></div></span></div>",
            "created":1133154000,
            "id":286503,
            "title":"Rats..."
        },
        "1122122222122222211222122121121111111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "It thanks you.. by molesting you",
                "It seems genuinly Thankful"
            ],
            "content":"<div class=\"\"><div> <span>The rat before you is a hulking beast, muscles quite evident, but he is also caught in the biggest rattrap you have ever seen. His eyes stare into you \"Hey! I thought i'd starve here, come on, help me get out of this trap, i can't reach the knob\" he fliches as he tries to lean back and point at the apparent trap release. <br>\r\n<br>\r\nYou can see the rats point his tail and but are in the trap and he lacks the flexiblity to touch the reset switch.  You move around and grab the knob, lifting it with as much stretch as you can muster.. \"Sproin\" the trap is open(nearly taking your head off in the process,  and the rat is free...</span></div></div>",
            "created":1133154000,
            "id":286506,
            "title":"Rat Trap"
        },
        "112212222212222221122212212112112":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "She sees you",
                "She doesn't see you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You shiver in fear, seeing that it's a female Bajiiran.  You press yourself to the door frame as hard as you can, trying to keep from getting spotted.  Will it work? or will she see you? and if she does, what will she do with you?</span></div></span></div>",
            "created":1069909200,
            "id":180024,
            "title":"Female in the hallway"
        },
        "11221222221222222112221221211212":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Jonsa is still going to eat you",
                "Jonsa gives you to Kessana, since he's so excited and might like you more"
            ],
            "content":"<div class=\"\"><div> <span>When Jonsa sits down at his first class you watch in fascination as his ballsac is pushed upwards towards you and that they are right beneath you, and since there was less air space in here now it is warmer and Jonsas' male scent si growing stronger.  After Jonsas' first class you are very sweaty and hot and are very glad when there is more airflow in the boxers to cool you down. Jonsas' class had lasted about an hour and a half so it had gotten very hot in the boxers because the act of sitting cut off the airflow. When Jonsa reaches his second hour class you are starting to feel sleepy from the heat down in the boxers and slowly drift off to sleep.You are awoken when a burst of light comes into the boxers and you feel yourself get grabbed by Jonsa. Jonsa is in the mens room at the moment, and it was empty except for Kessana, who is looking at you with excitement in his eyes. \"It's finally time, I am so excited!\" </span></div></div>",
            "created":1037077200,
            "id":129882,
            "title":"Some more time in his nice shorts"
        },
        "112212222212222221122212212112121":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You are digested fully",
                "You survive this somehow"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa also smiles \"I am planning to eat some of the school pizza before I eat him you know, I want to give him as much time to enjoy my belly before he becomes part of me forever!\"<br>\r\nKessana nods \"I know, I know! But it is still very exciting!\"  Jonsa smiles again and looks at you \"I am going to put you in my pocket while I eat the pizza, that way you don't escape and the other people don't have to watch me reach into my shorts to pull you out.\"<br>\r\nYou sigh, it is finally time to be Jonsas' meal, and you expected to feel fear. Instead you feel detachment. You shake your head and barely notice when Jonsa sticks you in his pocket and heads back to the lunchroom.  For you it seems that it doesn't take very long for Jonsa to eat his pizza. All too soon you feel Jonsa reach in and grab you for the last time and pull you out. You look into Jonsas' excited eyes and start feeling a bit frightened, it is actually going to happen, you aren't going to be kept as a sex toy for this horrible creature.<br>\r\n\"Eat him!\" Kessana says loudly.  Jonsa smiles at Peter \"Thank you for making me happy for the last few days, and now I thank you for nourishing the body you have pleasured.\"<br>\r\nWith that Jonsa opens his mouth and you see some bits of pizza on Jonsas' tongue and between his teeth, and his dark throat, which is greedily waiting for you. Jonsa tosses you in and quickly closes his mouth so you have no chance to try to escape, he can see somewhat in here because of the fact that it seems that Bajirran internal anatomy has a luminescent quality to it, not exactly a good thing from your perspective. Jonsa starts to roll you around in his mouth to get as much of your taste as possible. You can definitely smell the pizza that had been in here shortly before you. After a few moments of being swished around in Jonsas' slimy mouth you feel Jonsas' tongue start to tilt up and push you towards the dark opening before you, the opening that leads to your doom. It takes just a few seconds for you to slide down the large, slimy tube to Jonsas' stomach, when you arrive the first thing you notice is the smell of pizza and acid. You landed on top of the chewed up pizza that Jonsa had just eaten and when you try to stand up you sink up to your knees in the soft, warm goop. You run over to Jonsas' stomach wall and start pounding and screaming to be let out. After a couple seconds some cold, sweet smelling liquid pours into the stomach.  It is probably the Bajirran version of soda you think. Then far above you he hear a belch and felt a rush of air as it leaves the stomach. You hear a thud and realize that Jonsa is probably patting his belly in contentment.</span></div></div>",
            "created":1037077200,
            "id":129883,
            "title":"Eaten by Jonsa"
        },
        "1122122222122222211222122121121211":{
            "author_id":"gamer",
            "author_name":"gamer",
            "content":"<div class=\"\"><div> <span>You start to feel a slight tingle on your feet and realize that it must be Jonsas' acids starting to work on you and the pizza. After half an hour your feet and legs feel like they were on fire, but the skin hasn't been dissolved completely away yet, the pizza and the soda dilluted the acid enough so that it doesn't end your life quickly, but not enough to stop the horrible pain. The pain drives you to start pounding on the stomach walls even harder.  <br>\r\nJonsa smiles, he can feel his lucky human struggling inside his belly and he hopes that the feeling will continue for a very long time.<br>\r\nAfter an hour and a half in Jonsas' belly your legs have been long since dissolved and you are forced to lay in the dissolving pizza. The pain is even worse now because there is less pizza in the stomach to take the brunt of the acids. You scream uncontrollably and continue to look around inside the stomach for someplace to keep yourself safe from the acids, but you know it is pointless because you have already examined the contours of the stomach several times and found no place where you could be safe. You desperately hope for death to free you from this painful prison and to give you peace.  <br>\r\nJonsa smiles as he walks home after school, he can still feel his human inside of himself, though the struggles are getting weaker as you are slowly becoming a formless goop. He only hopes the human will live a while longer for him, he pats his stomach again and smiles as he thinks of how honored the human must feel to be his food.  <br>\r\nA little more than 2 hours had passed since you have been swallowed, you have gone unconscious a few moments ago, and now your heart has stopped beating. Your end wasn't as painful because your nerve endings were no longer existent so you could feel nothing. Now your body is quickly and efficiently turned into a goop that is passed into Jonsas' intestines to be absorbed, and what won't be absorbed will be excreted a couple days later.  Jonsa burps, then he smiles as he realizes his humans' life must have just ended. He sighs as he remembered all the pleasure the little human brought him. Yes, indeed this had been a fitting end for you, he thinks. He thinks of how tomorrow your humans' remains would be coming out of him. He wonders if he will be able to spot your bones or not. Then he shrugs, and smiles while patting his belly once again and then pushed you out of his head as he heads down for dinner.</span></div></div>",
            "created":1037077200,
            "id":129884,
            "title":"Digested by Jonsa"
        },
        "112212222212222221122212212112122":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He shoves you in his shorts",
                "he has another safe place in mind for you"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa looks up to Kessana, and stares at him for a few moments, then smiles softly, and suddenly holds you out to Kessana.  \"here, you seem to really really like him, so you can keep him.  I have eaten many other humans lately, but you haven't ever had one, have you?\"<br>\r\nKessana blinks in shock, and stares at Jonsa for several long moments, then looks and stares at you, before this huge grin spreads across his face, and he gently reaches down to pick you up.  \"ooooooo! THANK YOU SO MUCH JONSA! I will treasure him so much, I have never had a human before, but I know I will love having him around!\" then he grins evilly, and winks at you, \"and if you're a good boy, I might not eat you for quite some time, if ever! hee hee\"<br>\r\nJonsa chuckles, and smiles at Kessana, \"well, you enjoy him, ok? maybe I can see him now and again, if you haven't eaten him by then that is!\"<br>\r\nKessana grins, and nods, \"You can indeed, thank you so much for giving him to me Jonsa, thank you!\"  he keeps smiling at Jonsa, then looks at you again.  \"mmmm, well human, time to come home with me!\"</span></div></div>",
            "created":1048827600,
            "id":150598,
            "title":"Given to Kessana"
        },
        "1122122222122222211222122121121221":{
            "author_id":"esgo0",
            "author_name":"Pricka Maguintus The Balltosse",
            "choices":[
                "At home"
            ],
            "content":"<div class=\"\"><div> <span>Kessana looks a bit... odd.<br>\r\n<br>\r\nHe's panting heavily, as he says \"I'll put you in my shorts!\" He opens the waistband of his shorts, and drops you in.  <br>\r\n<br>\r\nYou see why Kessana looked so odd; he had a raging erection! It wouldn't stop jumping! With you in there, you couldn't breathe AT ALL, because the cock was up against your face so tightly! Although,  evidently, your presence was the last thing it needed!  It started shooting you over and over, leaving you drenched!<br>\r\n<br>\r\nKessana had just stood still while it was happening.  When it finished,  he continued home with a dreamy face.<br>\r\n</span></div></div>",
            "created":1395627600,
            "id":1766391,
            "title":"He shoves you in his shorts"
        },
        "1122122222122222211222122121121222":{
            "author_name":"Chibitrunks2",
            "choices":[
                "Kessana forgets about you and dumps you out after dinner.",
                "Kessana pushes you out after school."
            ],
            "content":"<div class=\"\"><div> <span>\"Now where shall I hide you? Hmmm.  I know!\"  He grins  widely and bends over, dropping his shorts and underpants.  \"You get to visit my nice shapely ass again!\"<br>\r\nYou gulp as you see his tail lift out of the way, exposing his anus to the light.  He slowly lowers you to it and begins to push you against.<br>\r\n\"Ohhh!  This feels great!!\"  He rubs you up and down his butt cleft, making you all sweaty and covered bits of dung. <br>\r\n\"Well in you go, have fun little one!\"  He places your head in front of his hole.  He grunts as it puckers, releasing a vile and rancid fart upon you.  You gag and choke on it, the smell the worse thing you've ever smelled.  Before he is done releasing his farts, he quickly shoves you up into his rectum.<br>\r\n\"OOOHHH! MMMMM... your delicious, well for my ass at least!\"  He giggles and sighs, finally out of gas.<br>\r\n\"Time to return to class again little one, now don't die in there!\"  You cringe and wince in his ass, the smell even worse than his gas. You can't help wonder what will happen to you.<br>\r\nYou feel him stand up and pull up his shorts.  You hear a heavy door open as your new master, Kessana, exits the bathroom.  Maybe this won't be that bad, after all he said that you might survive.</span></div></div>",
            "created":1053752400,
            "id":158851,
            "title":"Kessanna's Safe Place"
        },
        "11221222221222222112221221211212222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "you are at Kessana's home",
                "You are someplace else"
            ],
            "content":"<div class=\"\"><div> <span>the day seems to last forever, you can very very faintly hear voices outside as he learns his lessons in school, and talks to his friends, perhaps even Jonsa. but to you, for now at least, your entire world is Kessana's bowels.  all you hear is the gurgle of his guts as they work on whatever he ate in the last couple days, processing them to fuel his gigantic, and always hungry body.  it truly stinks in here, it is the worst smell you could ever imagine, and then some.  and every now and then, a blast of foul smelling fart gas blows past you, and escapes out of his puckered anus.  it actually does look puckered at this end, but it's dark in here, so you can only see so much.  But, for some reason, there is some light coming from the walls of his bowels, like his insides ae designed so that living creatures can see every single part of it from the inside.  <br>\r\nfor a while, you try to escape out of that anus, especially when he lets out a fart, usually silently, but it never works, the anus always closes up when you try to escape, either by a concious attempt by Kessana, or a subconcious thing his insides do to keep prisoners of his insides with him for as long as he wants them.  finally, you just lay down, and try to relax inside the hot, humid, and extremely putrid bowels.  after hours and hours of waiting, you realize that there is a lump of his poop deeper in his bowels, slowly easing it's way towards you.... it looks dark, and lumpy, and makes the smell in here even worse, by some nasty miracle...<br>\r\njust when you start feeling nervous about that lump of poop engulfing you, you feel the muscles around you squeeze powerfully, squishing you in powerful, slimy, filthy, and stinky bowel walls.  then you turn, and see his anus winking open, as he pushes you out of his bowels.  you are suddenly surrounded by light, and cold air.  you land on the ground with a soft thump, and look up to see Kessana's well formed butt hovering over you, his hole puckered tightly, holding the rest of the stuff in there, in his bowels for now.  or perhaps that turd is just not quite ready to come out.... <br>\r\nthen, you look around, to see where you are at......</span></div></div>",
            "created":1053752400,
            "id":158852,
            "title":"a day up in Kessana's bowels"
        },
        "112212222212222221122212212112122221":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "You agree",
                "You resist"
            ],
            "content":"<div class=\"\"><div> <span>You sigh in relief, realizing you are at Kessana's home, and in his room from the looks of it.  You are on the blue bedspread, feeling the cushiony material under you.<br>\r\nYou look up, and watch as Kessana turns around, grinning down at you.  It is then you realize, he's completely nude.  He giggles, and rubs his belly lightly.  \"mmmmm, welcome out little human, I've been looking forward to getting to enjoy you personally!\" he grins, then turns around again, and starts slowly sitting, showing you his ass again, including his puckered anus, hidden in between his two round, wonderfully sized rump cheeks.  You worry about them trapping you under him, then, as he sits you realize, that it's his low hanging, furry balls that are going to trap you.  You grunt, as you feel them come down on you, holding you under their warm, soft, gentle furred weight.  they smell musky to you, but, in a very wonderful, arousing way actually, you like this!<br>\r\nYou look up past his resting balls, and plump sheath, to see Kessana smiling down at you gently, but, his eyes definetely let you know that you're his to do with as he wishes.<br>\r\nKessana chuckles as he relaxes, \"you know, Jonsa's family is pretty rich, I am sure his father can afford humans for breakfast lunch and dinner, plus playtoys! heh, but, we aren't that wealthy... truthfully, you're the first human I've ever had all my own!\" he grins at you, \"so, I think I'll keep you a while!\"<br>\r\nThis is good news at least, he problably won't eat you anytime soon, since you'd be very hard to replace for him.<br>\r\nKessana chuckles again, as his belly gurgles hungrilly.  \"ah, looks like I am a bit hungry.  How about, you help me eat some of my yummy snacks?\" he grins evilly, \"Living of course\"</span></div></div>",
            "created":1065589200,
            "id":175577,
            "title":"Start getting to know Kessana better"
        },
        "1122122222122222211222122122":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "I want you two to spill your juices in my mouth",
                "It's time for some nice rope tricks!"
            ],
            "content":"<div class=\"\"><div> <span>You scream and try to grab the flailing arm as your tormeneter laughs \"Ohhh.. so you think it would be nice to restore him to the place thats not shit.. \" The huge creature pauses \"I can always eat it later\" And you watch the ass churn,your fingsers wet with saliva sliding in and gripping around the other humans arms \"Come on, tug your little human out or I'll have my smelly ass eat you too! I can always dress up a replacement like you. you feel the hot furry ass all around you as you tug with all your might, feeling the muscle actions all around you as you close your eyes and nose as best you can.. then it happens, you win!<br>\r\nFinnally the human pops out with a slick splut of nasty rear end juice tumbling over, bare as he was born, his clothing is gone as you look back and forth between the ass and the freed man as he starts to recover, your tormenter smiles wickdedly \"I did you a huge favor\" he snarls, now your going to have to do something big for me.</span></div></div>",
            "created":1038546000,
            "id":132253,
            "title":"Saving?"
        },
        "11221222221222222112222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "He decides to add his own contribution to the bowl, and forgets you there",
                "He decides to pluck you out, and do something else with you....."
            ],
            "content":"<div class=\"\"><div> <span>Kessana sits there for a little bit longer, then he sighs, and gets up, walking away, apparantly not even remembering you are down there... or, does he have something planned now?<br>\r\nYou find out soon enough, when you see Jonsa's face looking into the toilet bowl, and grinning down at you.  \"Awww, is the little human swimming with shit? well, don't worry, you will be shit soon enough.  but, for now, what shall I do with you? hmmmmm\"</span></div></div>",
            "created":1042952400,
            "id":139677,
            "title":"Jonsa comes, and wants to play with you again...."
        },
        "112212222212222221122221":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Another male comes, he's poor, so he decides to keep you.",
                "A male comes, but he's richer, so he's not sure what to do with  you."
            ],
            "content":"<div class=\"\"><div> <span>Jonsa grins evilly down at you, and giggles, \"mmmm, you know, I think I need to take a dump myself, those humans and whatnot I have eaten are ready to come back out!\"  and without another word, Jonsa turns around, to sit on the toilet.<br>\r\nThe inside of the toilet is darker now, and all you can see, is the walls of the toilet, Kessana's turds, and Jonsa's ass overhead.  he sighs, and you can fainly make out his flexing tailhole high over head.  PBBBBBHHHHHHHHTTTTTTTT!!!  Jonsa suddenly releases a loud, long, and putrid fart into the toilet bowl, making it smell even worse then before!<br>\r\nYou hold your nose, and gag on the stench of his gas, then you hear him grunt overhead, and look to see his anus winking at you, then it opens up, and a large turd slowly starts sliding towards you.  You can make out several small bones in his shit, some of them human, some of them not anything close to human, perhaps Wols?<br>\r\nyou hear him sigh happily, as his turd slowly slide from his body.  then, his turd breaks off at the base, and splashes down next to you, immediately sinking to the bottom of the large pool that is the toilet bowl.<br>\r\nhe grunts, and pushes out another turd, darker then the first, and riddled with even more bones.  it slides out much faster then the first, and doesn't break off. No, it just slides into the water, and floats, starting to coil around the edge of the toilet, starting to surround you with his stinking, steaming shit.<br>\r\n<br>\r\nafter what feels like an eternity, Jonsa sighs, and leans up to wipe himself, dropping in the toilet paper carelessly. then at long last, he stands up fully, and walks away, forgetting you're in the bowl, which is choked full of shit now, both Jonsa's and Kessana's, a lot of it has bones in it, which you try not to look at, or think about.  all you can do, is wait for someone else to come, and pray that they won't shit on you too.</span></div></div>",
            "created":1048827600,
            "id":150595,
            "title":"Jonsa's addition"
        },
        "112212222212222222":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "Samsa goes to school",
                "Samsa ditches school"
            ],
            "content":"<div class=\"\"><div> <span>Jonsa looks at you for a few moments, debating with himself for a bit. Then he looks at Samsa, \"Sorry I have been so possesive of him, to apologize I will let you take him.\"\r<br>\nSamsas' eyes lit up, \"Really?! Thanks! He will be such a wonderful human to keep for a while!\"\r<br>\nSamsa grabs you roughly, and slides you into his sheath, moaning in pleasure, \"Oh, he feels so good in my sheath! I always enjoy the feeling of living things in my maleness like this!\"\r<br>\nJonsa chuckled, \"Yes, he does look pretty silly like that. Shall we go to bed now?\"\r<br>\nSamsa nods, \"I think we shall, I always enjoy sleeping with you!\"\r<br>\nThey walk towards Jonsas' room, the walk is very interesting from your perspective. Soon enough you arrive at his room, and see that the cage is covered up. Jonsa climbs into the bed, and pats the space next to him. Samsa chuckles and climbs in next to him, they turn towards each other, and embrace each other as Jonsa turns out the lights. Though it is dark you can easily see Jonsas' package once your eyes have adjusted to the darkness. The last thing you see before you fall asleep is his package, embraced in the warm, slimy sheath of your new owner. You can only hope that he is nicer to you than Jonsa was.</span></div></div>",
            "created":1019970000,
            "id":101057,
            "title":"Switch owners"
        },
        "13":{
            "author_name":"W.I.T.",
            "choices":[
                "Let her eat you as you are.",
                "Have her put you in a cake or pie.",
                "have her put you in a sandwich or hot dog.",
                "Have her garnish you with dessert toppings.",
                "You beg her not to eat you"
            ],
            "content":"<div class=\"\"><div> <span>You stare up at the creature, wondering what he means.  Then you hear a noise, and other creatures come in.  They sit at the table, the creature smiles at one of them, a young female.  \"Happy birthday!\" the creature picks up the box you are stuck in with the other humans, and carries you over to the table, letting the other creatures select one for themselves, before moving on to his daughter.<br>\r\nYou had to admit, being chosen by a giant for food isn't a pleasant way to go. Some of those chosen are cooked and torn to pieces, while others are placed in various foodstuffs. You just saw one who was put in a hot dog and torn to bits!<br>\r\n<br>\r\nYet the one who chose you is another matter altogether.<br>\r\n<br>\r\nShe was a 16 year old girl, who chose to have her first human snack on her 16th birthday. You were given to her as that present, scared as she opened the box.<br>\r\n<br>\r\nBut when you saw her, you felt different. You saw her beutiful face and saw she was not like any other giant. <br>\r\n<br>\r\nAnd you fell in love.<br>\r\n<br>\r\n\"My little snack,\" she said, her voice sweet and kind, \"i promise that when I do eat you, It will be a wonderful experience. I will NOT tear you apart or chop you up. Rather, I will let you decide how I will eat you. I'd prefer if you were a dessert, but it's up to you.\"<br>\r\n<br>\r\nYou look at her and feel different. Believe it or not, you almost feel like you WANT her to eat you!<br>\r\nBut how? Would you let her eat you as you are, or let her put you in a foodstuff? Either way, this might just be bliss</span></div></div>",
            "created":1032757200,
            "id":122651,
            "title":"She's so lovely..."
        },
        "131":{
            "author_name":"H.O",
            "choices":[
                "She accepts, and bring you to her bedroom to play a little",
                "Her father orders her to eat you at once!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Please! swallow and digest me alive! but as it is a once in a life time experience, could we play a little before? could I see your body??? I will be part of this body soon! please!\"<br>\r\n</span></div></span></div>",
            "created":1038718800,
            "id":132765,
            "title":"I prefer being swallowed alive, but before..."
        },
        "1312":{
            "choices":[
                "She did in fact swallow you",
                "She hid you better this time"
            ],
            "content":"<div class=\"\"><div> <span>She decides okay and grabs you as the booming voice of her father screams.  \"I want to see your first victom hunny.\"  She looks at you and says \"oh well, i tried.\"  She puts you in her mouth and rolls you around on her tounge.  You get very exited at this.  Her father watches every movement she does.  Swishing you around you feel nauzeated.  Then finally she hides you under her tounge and goes to go upstairs.  Her father calls her back to open her mouth.  She goes back and opens her mouth as he sees you.  Finally he demands for her to swallow and she pouts and he gves her back a look of concern.  finaly one more swoosh around to obsorb ur taste and she swallowed hard as the gulp was heard.  Her father asked her to open her mouth again.  She opens her mouth AHHHHHHHH and he inspects.  You weren't in there.  Okay then go play in your room.  She hugs him and thanks him for making her eat you because you were so delicious. </span></div></div>",
            "created":1043816400,
            "id":141343,
            "title":"Eat him now!"
        },
        "132":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "...A cake, with lots of frosting. YUM!",
                "...A pie. It sounds more fun. MMMM..."
            ],
            "content":"<div class=\"\"><div> <span>You smile just a little, indeed very much in love. \"Well... My favorite foods are pie and cake to be honest. Apple pie especially, but I love chocolate cake...\"<br>\r\n<br>\r\nThe monster smiles. \"OOO! I love you! Those are my favorites too! Welll... Other than... well, you know.\"<br>\r\n<br>\r\nBelieve it or not, you find yourself laughing, just a little. She really is cute, unlike the others who are really being mean to their food. You, she is handling nicely and treating wonderfully.<br>\r\n<br>\r\nGuess you catch more flies with honey than vinegar I guess.<br>\r\n<br>\r\nOr Humans in this case.<br>\r\n<br>\r\n\"I can't decide which though. Either way, it'd be small, to just fit you. But would a cake be better? It would be kinda intresting to see you squirm and wriggle in a little cake, frosting on your head, and maybe a little cherry or something...\"<br>\r\n<br>\r\nYou cannot help but smile. That DOES sound kinda fun.<br>\r\n<br>\r\n\"Or perhaps a pie? But then I may have to cut you a little... and I really don't want to hurt you. Even if you ARE my food.\"<br>\r\n<br>\r\nYou have to admit thoguh, pie IS your favorite treat, maybe you could sneak a taste...<br>\r\n<br>\r\n\"Either way, I'll let you choose.\" She smiles some.<br>\r\n<br>\r\nYou choose...</span></div></div>",
            "created":1139806800,
            "id":301222,
            "title":"Cake and Pie kind of Guy"
        },
        "1321":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "\"Eat me now, I'm ready.\"",
                "\"Can I wait a bit?\""
            ],
            "content":"<div class=\"\"><div> <span>\"How about a cake?\" You say, unable to take your eyes off of her. She smiles some and giggles. <br>\r\n<br>\r\n\"Wonderful! I happen to have a few cupcakes right here. I hope you don't mind if I squish you into one.\"<br>\r\n<br>\r\nShe smiles and brings them over. They are just perfect for someone your size to be in, and still have a few things stick out. You smile just a little.<br>\r\n<br>\r\n\"Why not, gobble me up!\"<br>\r\n<br>\r\n She giggles cutely and lifts you up, her mmother giving her some more icing in a pastry bag. She smiles and winks to you. \"I promise I won't hurt you.\" She sets you on the cupcake first, then slowly starts to press you in. The moistness of the cake allows you to sink in, and they are very warm and fluffy. You wriggle about a little, trying to situate yourself as a sort of cream filling. Which you are in a sense.<br>\r\n<br>\r\nAround you the screams of those who ended up with cruel giants fill the air. She shakes her head and looks to you.<br>\r\n<br>\r\n\"Meanies.\" She whispers to you, only your head out of the cake. She begins to put icing around you as she talks. \"They cannot appreciate such a wonderful gift. To be given a human snack, a living treat that deserves a wonderful death, and treat it so cruelly.\"<br>\r\n<br>\r\nYou smile. You lick some of the frosting as she talks, the smell of it irresistable.<br>\r\n<br>\r\n\"I know better. Mom says that is why I am so pretty. Because I am unwilling to treat a human cruelly. I have a theory about it.\"<br>\r\n<br>\r\n\"What is it?\" You ask, curious. She smiles some. <br>\r\n<br>\r\n\"Humans deserve to be eaten in pleasureable ways, not just eaten.\"<br>\r\n<br>\r\nYou smile, unable to disagree. Beside,s this sure is a lot of pleasure right now. <br>\r\n<br>\r\n\"Now, when you are ready, I'll eat you up. But please do hurry, you look so appetizing.\"<br>\r\n<br>\r\nYou smile some. You are now more certain than ever that this will be wonderful. Should you make her wait? Should YOU wait?</span></div></div>",
            "created":1140152400,
            "id":302091,
            "title":"Birthday Cupcake. Yummmmmy!"
        },
        "135":{
            "choices":[
                "Keeps you as her pet",
                "Puts you in her mouth and sends you towards your future as poop"
            ],
            "content":"<div class=\"\"><div> <span>\"Look\" you say, \"You are a lovely girl why can't we simply be friends?\" <br>\r\n\"Oh\" she says, \"I think being my snack would be a very friendly thing for you to do.\"<br>\r\n\"I know\" you say, \"But I would like to continue to exist outside of you. I want to stay alive.\" <br>\r\n\"Don't be so silly.\" she says \"You are a snack, you belong in a tummy.\" She lifts up her blouse and puts you near her flat stomach. \"Isn't that nice?\" she says, holding you near her exposed belly button. <br>\r\n\"Look I admit your stomach is nice\" you say \"But if you put me in there I will turn into poop. I don't want to be poop even for a lovely girl like you.\"<br>\r\nTears appear in her eyes. \"You are mean\" she says. \"I have been so anxious to have my snack. I tried to be nice to you.\" Then she...</span></div></div>",
            "created":1036731600,
            "id":129378,
            "title":"Friend or Poop"
        },
        "1351":{
            "choices":[
                "It is Karen",
                "It is Judy"
            ],
            "content":"<div class=\"\"><div> <span>\"Look\" she says, \"I was really looking forward to my human snack, but since you want to be so selfish I will keep you. I could not bear the thought of swallowing you while you were crying.\"<br>\r\n\"Oh thank you,\" you say. She brings you to her room which looks like any young girls room. \"I must hide you in my drawer\" she says. \"My little sister will surely eat you if she finds you. She is only 12 and very pretty and really very sweet but she loves to feel a living creature squirm in her belly. If she should plead with me for you I am not sure I could hold out. It is best she does not see you. I will tell everyone you are in my stomach. There is plenty of air in this drawer and when she is not at home I will let you out. My name is Karen. My sister is Judy.\" Karen puts you in the drawer which has enough air and is rather light. You are in the drawer a few hours. Suddenly the draw opens</span></div></div>",
            "created":1036990800,
            "id":129874,
            "title":"Hidden in a Drawer"
        },
        "13511":{
            "choices":[
                "You are back in your drawer sleeping",
                "You are being digested in the pretty girl's stomach"
            ],
            "content":"<div class=\"\"><div> <span>   You are sitting in the drawer wondering what will become of you. Suddenly the draw opens. To your great relief it is Karen. You have been having nightmares about being swallowed by a giant child.<br>\r\n   No one is home now it is safe to come out she says. She lifts you out of the drawer and carries you out to a very pretty garden. It is a very nice day.You are being carried by a very pretty girl, she is feeding you morsels of tasty food.<br>\r\n   The problem is she makes it quite clear that she would be much happier if you were in her stomach .When you remark on how good the food is, she says I'm glad you like it. I was deprived of food I was so looking forward to. She drops a number of other hints then says \"I wont swallow you Screaming. If you want to be selfish you can.\" Soon you begin to wish you were back in the drawer. That night...</span></div></div>",
            "created":1037941200,
            "id":131405,
            "title":"A walk in a Garden"
        },
        "135111":{
            "author_id":"furwrite",
            "author_name":"DTF",
            "choices":[
                "You admit that you're attracted to her.",
                "She pulls you out of the drawer"
            ],
            "content":"<div class=\"\"><div> <span>After a day in the garden and subtle hints about how you deserve to be a snack, Karen brings you back into her room. She sets you in the drawer, but instead of closing it she slowly removes her blouse and jeans while standing directly over you in only her underwear.<br>\r\n<br>\r\nYou quickly learn that her body is just as pretty as her face. Lean feminine curves adorn her form as your eyes travel down her face, across her well formed breasts and across her smooth, flat stomach before trailing between her supple hips and continuing along her thighs and legs.<br>\r\n<br>\r\nShe notices where you're looking and flushes slightly. \"You find me attractive?\" Her voice asks sweetly, \"but you know I want to eat you.\"<br>\r\n<br>\r\nKaren leans down until her breasts are mere feet above you, as if expecting an answer. Mentally undressing what's left of her you feel yourself become aroused</span></div></div>",
            "created":1137560400,
            "id":296542,
            "title":"Evening with your Captor"
        },
        "1351111":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "\"Oh, alright. (I won't die right?)\"",
                "\"I'm very sorry... but I am still scared of being food."
            ],
            "content":"<div class=\"\"><div> <span>You stare at her. \"I... Yes... YES! You're so beautiful. I... I think I love you.\"<br>\r\n<br>\r\nShe looks at you. \"You... love me?\"<br>\r\n<br>\r\nYou nod. \"Yes... I do. I did when you unwrapped me, yet I was so scared of being your food. I... I don't want to die.\"<br>\r\n<br>\r\nShe smiles just a little. \"Whoever said you were going to die?\" She chuckles. \"You're food, but if you all died like that... we wouldn't have a bite left to eat.\"<br>\r\n<br>\r\nYou ponder this. You never did know much about this until you were taken as a present and unwrapped. But her beauty is your concern now. \"All I know is that I want to live, possibly as a pet, but... I love you. And no, I don't care that you eat people.\"<br>\r\n<br>\r\nshe smiles some. \"You know, that has to be the sweetest thing anyone ever said to me. Especially a human.\" She smiles some. \"I still want to eat you.. but you know... You're kinda cute too.\"<br>\r\n<br>\r\nYou smile and blush. she reaches and pulls you out, setting you on her breasts. \"But... I still want you for a snack.\"<br>\r\n<br>\r\nYou smile and say...</span></div></div>",
            "created":1139806800,
            "id":301227,
            "title":"Fatal Attractions"
        },
        "13511111":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "Make a sexual last request",
                "Make a request relating to being her meal."
            ],
            "content":"<div class=\"\"><div> <span>\"Ohhhh.... Alright... I suppose you can eat me.\"<br>\r\n<br>\r\nShe smiles some as you chime in. \"You SURE I won't die?\"<br>\r\n<br>\r\nShe giggles. \"Of course not! I said you wouldn't, and I meant it. THough it will be good-bye for awhile.\" She sighs. I wish I could just have you stay as a never ending snack. I have a feeling we both would like that.\"<br>\r\n<br>\r\nYou sigh. Maybe, but likely not.<br>\r\n<br>\r\nShe liffts you off of her, then stops. \"Wait, since you are going to be my meal... How about a last request? Only fair right?\"<br>\r\n<br>\r\nYou nod. She really is trying to be nice to you at least. You'll give her that. Cute, nice, generally kind... If you were her size you might be able to start a relationship.<br>\r\n<br>\r\nOr at least a few sweet one night stands.</span></div></div>",
            "created":1139979600,
            "id":301664,
            "title":"Giving in to your love"
        },
        "135111112":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "To be prepared a certain way (Author's choice)",
                "To be eaten a certain way (Author's choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, you want the request to be related to her food. You have something special in mind?</span></div></span></div>",
            "created":1140201180,
            "id":302092,
            "title":"The food request"
        },
        "13512":{
            "author_id":"cyrilius",
            "author_name":"Cyril",
            "choices":[
                "Some friends are visiting her and they want to play with you.",
                "She has gathered more humans from her sisters party"
            ],
            "content":"<div class=\"\"><div> <span>You look up and blink as you see a huge hand reaching in and just as you try to jump back and hide, it grabs you easily, almost completely covering you. You look in fear at another huge feminine face peering down on you and shiver as you hear her voice.<br>\r\n<br>\r\n\"Oh! Just look what I found! Another human\" She giggles. \"I'm very lucky today. The first human I ate is already digested and is moving around somewhere in my intestines at the moment. I wonder how you come in here, hasn't my sister seen you?\" <br>\r\n<br>\r\nThen you realize it. This girl is a bit smaller than Karen and her voice sounds younger. So it must be Judy. You also remember that she was one of the few who ate her human whole and without chewing. You look down and see that she is wearing a pink t-shirt and jeans, her tail swaying from side to side behind her.<br>\r\nYou yelp as she squeezes you to get your attention and hear her giggle from above \"Heh, are you looking at my belly? You know that you will be in there soon as well, little human! But don't worry. I'll wait until my body has finished the first one. Oh, I almost forgot, I have a little surprise for you as well\"<br>\r\n<br>\r\nYou look into her face and notice an cute but somehow evil little smirk on her muzzle. You wonder what she has in mind for you.</span></div></div>",
            "created":1037250000,
            "id":130174,
            "title":"Meet Judy"
        },
        "135122":{
            "author_id":"cyrilius",
            "author_name":"Cyril",
            "choices":[
                "She takes you to the others and starts to play",
                "She leaves you where you are and starts to play"
            ],
            "content":"<div class=\"\"><div> <span>She walks with you to her room and closes the door while she explains: \"Grandma and Grandpa have problems with chewing lately, so they gave me their humans and aunt Sally was not feeling good and gave me her snack as well. \"<br>\r\n<br>\r\nHer room doesn't look very different to human girls in her age. Books, playthings and CD's are lying around, however... everything looks huge from your point of view. She puts you down on her bed, sitting down just inches away from you. In panic you start to run away from her figure before she hits you with her huge tail, sending you flying backward, right against her jean-covered ass. She giggles feeling this and leans back slightly, pressing her weight down on your little body. \"To keep you from running, while I'm getting the others\"<br>\r\n<br>\r\nYou struggle wildly under her, while she reaches into a small box next to her bed. If the bed wouldn't be so soft, you would have certainly be crushed, as she shifts her weight more. You press against her buttocks, what makes her chuckle again. \"you feel funny!\" After a few minutes she finds the others and puts the three man down on her bed as well. <br>\r\n<br>\r\n\"Well, we are all here now, let's start to play\"<br>\r\n<br>\r\nBarely able to breathe you are kinda thankful as you think that she will get you out finally.</span></div></div>",
            "created":1037250000,
            "id":130175,
            "title":"More unlucky souls"
        },
        "1352":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "She decides to simply swallow you down right now",
                "She keeps you a while, to taunt you, play with you, and teach you your fate"
            ],
            "content":"<div class=\"\"><div> <span>She lifts you up closer to her face, her eyes still brimming with tears. But then she seems to calm down, and gives you a long, warm, heavy lick, coating you in some of her clear, slick saliva.  \"I tried to be nice to you, but, I suppose you don't want that! You don't see the joy in being my food, becoming my poop...\" She giggles, and gives you a naughty, kind of cruel smirk, leaning back, she holds you at an angle over her lips, forcing you to watch as they part and move around while she talks to you.  \"You don't want my kindness, so, as punishment... when I eat you, you're going to survive my digestive process for as long as possible... I want you to feel how it is to become my snack, my poop... I will walk around, enjoying my everyday life, not caring about you, though enjoying your struggles and suffering in me, while you slowly turn to my wastes...\" She giggles, quite cutely and enticingly actually. \"Mmmm, then, later, I'll sit on the toilet, and, with much pleasure and very little care... I'm gonna poop you out. Oh, you'll feel so good coming out my ass... Though, I don't think you'll get to enjoy it much yourself...\"<br>\r\nShe gives you another smirk, \"Hmmm, only question is, should I swallow you down right now, and enjoy the rest of my meal, then head off, to live my life, and enjoy myself, as you become my snack? Or, should I keep you a bit, teach you just what I am like, that you are truly meant to become my poop... Hmm...\" She giggles, her stomach making a soft growl, showing it's quite eager to recieve you, and digest you as she has no doubt done to many others before this.<br>\r\nIt looks like you can forget any hopes you ever had that she would be kind to you; it seems, your place is firmly set as her snack, and perhaps her plaything...  You can only wait to see what she has in mind.</span></div></div>",
            "created":1158961200,
            "id":348134,
            "title":"Nope, You're Gonna Be Poop!"
        },
        "14":{
            "choices":[
                "You",
                "The young teenage girl you were talking too.",
                "Another girl or woman",
                "A young guy",
                "Other?"
            ],
            "content":"<div class=\"\"><div> <span> Your name is Julie and the last thing you remember before winding up in this cage, was stepping thru the portal and passing out. The next thing you know, your laying in a glass cage, still wearing your street clothes, with at least three dozen other humans, both male and female, mostly females of various ages. You noticed that these humans are barely dressed and they clothed in the most extremely primitive animal skins. However, you notice that all of the humans appear to be very clean and they smell nice too. You look up, wiping your long the blonde hair from your face and you see what looks like a gigantic creature standing in front of you. You see a huge bulge in his leather pants, so you know that he is male. He looked like a cross between a gorilla and a tiger, only without the stripes. You see him looking down out you all, smiling evilly. He then spoke in English, “Welcome, I am your new master and I own you all now. Some of you might get lucky and I might keep as my special pets. Others will not see the end of the week.” You look up in horror and say, “What in the hell is that supposed to mean?” You hear a voice behind you and you turn around. You see a pretty girl in her early teens speaking to you in English. “What our new master means is by this, is that most of us will be eaten by them,” she said with a grim look. You look at her with a sense of horror on your face and say, “How, why?” She then responded, “ Well, they tend too strip us and swallow us alive.” Just then, the door to the glass cage opened up and the giant reached in. You watch in terror as you see him grab...</span></div></div>",
            "created":1138683600,
            "id":299023,
            "title":"You are a woman and your owner is a male."
        },
        "145":{
            "author_id":"esgo0",
            "author_name":"Pricka Maguintus The Balltosse",
            "choices":[
                "A Wiccan (?)",
                "A middle aged man"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other...          </span></div></span></div>",
            "created":1426809780,
            "id":1950494,
            "title":"Other?"
        }
    },
    "info":{
        "author_id":"gamer",
        "author_name":"gamer",
        "brief_description":"Giant creatures rule and humans are nothing more than meals and toys",
        "created":1019960280,
        "description":"<td align=\"left\" class=\"norm\">You are a Scientist, studying techonology to transport matter, when you are transported to a different reality, where giant creatures rule and humans are nothing more than meals and toys. You will run into one of them, that will likely keep you for a while for its own pleasures. You live completely at its' whim.<br>\r\n<br>\r\nI allow essentially everything, feel free to add what you want. Just please make sure it links with the previous chapter.<br>\r\n<br>\r\nAlso, the starting gender set ups are not how it has to stay.  The character (who's gender must stay the same), can have masters that are either gender.  But I would like to try and have some equality between how many gay and straight chapters there are to choose from.</td>",
        "id":409799,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1531432320,
        "modified":1531432320,
        "pretty_title":"The Other  World"
    }
}