{
    "chapters":{
        "1":{
            "author_id":"jedislayer",
            "author_name":"jedislayer",
            "choices":[
                "Kirika",
                "Chiharu",
                "Uriko",
                "Someone else",
                "an original girl (make up your own)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, let's get things started.  First, who do you want to get fat?</span></div></span></div>",
            "created":1167195600,
            "id":368621,
            "title":"Getting started"
        },
        "11":{
            "author_id":"jedislayer",
            "author_name":"jedislayer",
            "choices":[
                "normally (eating)",
                "magic",
                "science (chemical or something)",
                "Some other way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, Kirika.  Good choice.  How does she gain?</span></div></span></div>",
            "created":1167195600,
            "id":370344,
            "title":"The Girl with big boobs and purple hair"
        },
        "111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Densuke",
                "Chiharu"
            ],
            "content":"<div class=\"\"><div> <span>Kirika Misono was hanging out behind the Eiken Club headquarters, sucking on her new XL Choco-pop, and tugging at her uniform shirt. \"Shirt must have shrank.\" Kirika said to herself. But in reality, all of her phallic-shaped treats had gone straight to her waist, creating a bit of a paunch on her. Her butt had gotten a little larger, making her skirt rise a bit. But Kirika hadn't noticed yet. She heard a sound around the front of the clubhouse, and went around to look. It was...</span></div></div>",
            "created":1169355600,
            "id":375720,
            "title":"Enter Kirika"
        },
        "1111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "A new kind of treat",
                "Nothing special"
            ],
            "content":"<div class=\"\"><div> <span>She noticed Densuke. She jumped on top of him and rested her gigantic breasts on Densuke, almost breaking his neck in two. \"Hey you.\" She said. \"What are you up to today? Trying to spend time with Chiharu while avoiding the constant flirting of her sister?\" \"Not really. Every thing's been going great today!\" Densuke replied. \"Well, that's no fun for me, then.\" Kirika said, removing her breasts from Densuke's head. She took the Popsicle out of her mouth, finding out that she'd sucked all of the chocolate off of it. She then throws away the bare stick, takes out another XL Choco-pop from out of her cleavage, and resumes sucking. Densuke was staring at Kirika's slowly-growing belly. \"what are you looking at?\" She says to him menacingly. Densuke then turns red, panics, and replies \"N-nothing! I gotta go. I'll see you later, Kirika.\" Kirika just sees him leave, and then has a puzzled look on her face. She shrugs and then enters the Eiken Clubhouse. She peers into the fridge to restock herself with new XL Choco-pops when she found....</span></div></div>",
            "created":1169355600,
            "id":375726,
            "title":"Intimidation"
        },
        "11111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "The Eiken Cafe",
                "Lin Grace's Waterpark"
            ],
            "content":"<div class=\"\"><div> <span>\"Wonder what these are...\" Kirika says while picking up a new treat. They looked like the regular treats that she put in her mouth, but somehow, it seemed...different. Oh well. She picked one up and started to suck on it. Kirika let out a moan. It tasted sooo good! She had to have more! She started sucking faster on it. It seemed that the faster she sucked, the better it tasted. The popsicle had dissolved in her mouth in a matter of seconds, plumping her up. Her belly fat was definitely more noticeable. Her bra had gotten tighter, and her panties were definitely in the process of becoming a thong. But never the less, Kirika was still oblivious to the greater weight. After that Kirika stuffed as many of those pops as she could in her cleavage. She decided to go off to</span></div></div>",
            "created":1169355600,
            "id":375728,
            "title":"A new Snack"
        },
        "111111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "she spoke to Teacher and Komoe",
                "she decided to order lunch"
            ],
            "content":"<div class=\"\"><div> <span>While walking to the Eiken Cafe, Kirika was going to town on those popsicles. She had never tasted anything so incredibly tasty! By the time she had run out of all the popsicles, it was pretty obvious that she was fat. Her belly had become big and round, even flowing over her waistband. Her top had become tight, even forming a small rip in the center of it. Even her added weight made her skirt ride up, exposing her ass to everyone who wanted to look. Kirika still remained oblivious to the whole matter. When she made it to Eiken Cafe...</span></div></div>",
            "created":1169442000,
            "id":375837,
            "title":"Enjoyment"
        },
        "1111112":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Kirika noticed her new weight"
            ],
            "content":"<div class=\"\"><div> <span>Kirika sat down in the chair, which immeadiately started to creak when she put her large bottom into it. Teacher walked up to Kirika, and with the usual lack of confidence, she said: \"Good morning, Kirika. W-what would you l-like for breakfast?\" Kirika looked up at her, and said \"I haven't been here in a while, so I'll just take one of everything.\" Teacher had a puzzled look on her face. Kirika never ordered more then one thing! But she just shrugged it off, and said \"Sounds good. Komoe should have your order ready within minutes.\" Teacher then just wandered off. While waiting...</span></div></div>",
            "created":1169442000,
            "id":375839,
            "title":"Hungry Much?"
        },
        "11111121":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Komoe comes with the food",
                "Densuke and Chiharu walk by"
            ],
            "content":"<div class=\"\"><div> <span>Kirika leaned back in her chair, and looked down. She noticed big soft belly laying in her lap. She poked it to see if it wasn't an illusion. When she poked her belly, her finger sank in a little bit. When she removed her finger, her belly started to jiggle. This made her giggle, but then she covered her mouth. Nobody has ever heard Kirika giggle, ever! She also noticed that her top was very tight, and her breasts were much larger. I wonder if Densuke noticed my extra weight today, Kirika thought. Does he even like fat girls? While Kirika fiddled with her cushiony love handles, a smile peered across her face. \"This feels very nice...\" she said to herself. I might like him, but screw Densuke! I'm keeping this fat whether he likes it or not!, she thought. Just then...</span></div></div>",
            "created":1169442000,
            "id":375842,
            "title":"Realization"
        },
        "111111211":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Teacher offered her the desert menu",
                "Teacher came by with the check"
            ],
            "content":"<div class=\"\"><div> <span>Komoe drags a tray on a cart to Kirika's table. The tray was very large, and was probably hiding many fattening dishes inside. \"Here you are, Miss Kirika. I hope you enjoy it.\" Komoe said. \"Believe me, I will.\" Kirika said with a wink. This made Komoe blush. Nobody ever gets a compliment out of Kirika. She must be in a really good mood today!, Komoe thought. Kirika removed the dish to the tray, and smelled the aroma coming off of the various dishes that lay before her. The odor made Kirika drool a bit, and then she started to dig in. In about 10 mintues, every dish was bare, except for the chicken skeleton. Teacher came over, and asked Kirika if everything was to her liking. \"Oddly enough, yes! Every dish is very delicious! We're very lucky to have Komoe as an Eiken Club Member!\" Kirika said while licking the remnants of the food from her lips. Teacher was suprised, because this was quite out of character for Kirika. Kirika was patting her big round belly when...</span></div></div>",
            "created":1169442000,
            "id":375847,
            "title":"20 meals in 1"
        },
        "1111112111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Dealt with the pain",
                "Asked someone for help with it"
            ],
            "content":"<div class=\"\"><div> <span>Teacher came by Kirika's table, and (finally) noticed her belly. Could it have been all of this food that's made Kirika so cheerful?, Teacher thought. She just shrugged it off, and asked Kirika: \"Would you like desert?\" She thought about it, and said: \"Alright, just give me the biggest thing you've got!\" Teacher blinked, and walked away. \"Yeah, it's gotta be the food.\" She said to herself. <br>\r\n<br>\r\nWhile Kirika was waiting, she massaged her belly. It was sore from all the food she had eaten. Rubbing her hands around that big soft mound of flesh, made her feel good. She let out a soft moan of pleasure. I can't believe that food can make me turn myself on!, Kirika thought. She was playing with her love handles, and adjusting her bra, realizing that it was too tight. She was trying to remove it, but not only were her fingers too pudgy, but her strap was sinking into her back fat. She...</span></div></div>",
            "created":1169442000,
            "id":375848,
            "title":"Bra Troubles"
        },
        "11111121112":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Go back to the clubhouse",
                "Go get fitted for new clothes"
            ],
            "content":"<div class=\"\"><div> <span>Kirika looked around quickly for someone to help her. Then she saw Densuke and Chiharu walking by. \"Hey you two! Could one of you help me out?\" Kirika called over. Densuke and Chiharu looked at each other, and Chiharu backed away. She was too nervous, based on past experiences she's had with Kirika. So Densuke walked over to Kirika, and asked what the problem was. \"My bra is too tight for my boobs, and maybe you could help me get it undone?\" Kirika explained. \"Why can't you get it done yourself?\" Densuke asked. \"I'm not as flexible as I used to be, alright!?\" Kirika says, getting impatient. Densuke begins to put his hand down Kirika's sweater, and retrieves the bra strap from out of her back fat. He then unhooked the bra, making Kirika give out a sigh of relief. \"Aaah...much better...\" Kirika cooed. \"Thanks Densuke.\" \"Uh...no problem...\" Densuke said, while inching away slowly back to Chiharu. Once Kirika paid the bill and left, she decided to...</span></div></div>",
            "created":1169442000,
            "id":375877,
            "title":"Help from Densuke"
        },
        "111111211121":{
            "author_id":"ptrsfrms",
            "author_name":"ptrsfrms",
            "choices":[
                "Notices Densuke stuck to her backside",
                "Dosen't Notices Densuke stuck to her backside"
            ],
            "content":"<div class=\"\"><div> <span>Kirika let out a yawn as she made her way to the club house. She had decided that she had eaten to much and need to rest, but their was something bothering her. It was Densuke she couldn't get her mind off him. Ever since she saw that blush on his face and when he had helped her with her bra. Kirika felt her face get hot and wondered if she should tell Densuke of this feeling, but later she was to tired to do anything.<br>\r\n<br>\r\nDensuke was in the club house laying down on a futon staring up at the ceiling thinking about Kirika. Densuke alwasy thought that all the Eiken girls were cute, but he thought Kirika was the most beatiful and he loved when ever he got a had full of her butt or breats and today was no exception. Densuke thought about telling Kirika how he felt, but later now he need rest. <br>\r\n<br>\r\nDensuke then heard the door to the eiken club open and rolled over to see Kirika walk in. Densuke then hide under the covers thinking to himself what should he do. Kirika then turned around and noticed that a futon had been laid out, so what the heck. Kirika walked over to the futon and pulled back the covers and laid down not noticing Densuke there.<br>\r\n<br>\r\nDensuke was to busy thinking what he should do about Kirika when he felt  a great amount of presure being applied onto his body. Kirika had fallen asleep on Densuke tiny body squashing him flate. <br>\r\n<br>\r\nDensuke tired to move but couldn't so he deicded to keep quiet until Kirika decided to wake up. <br>\r\n<br>\r\nKirika finally woke up and stood up with Densuke sticking to her back side, and both Densuke and Kirika were only to greet the night. Kirika then stretchs and...</span></div></div>",
            "created":1203742800,
            "id":501566,
            "title":"Go back to the clubhouse"
        },
        "1111112111211":{
            "author_id":"ptrsfrms",
            "author_name":"ptrsfrms",
            "choices":[
                "was",
                "wasn't"
            ],
            "content":"<div class=\"\"><div> <span>Kirika then fells something on her back and she reaches to pull it off and was now holding a squashed flat Densuke. \"Hi Kirika\" Densuke said as he smiled at Kirika \"Densuke is that you how did-uh when did i-did i do this?\" Kirika asked in shock. \"Afraid so\" Densuke said as he looked at Kirika who looked like she was about to cry. Kirika then hugs Densuke into her bigger breast and begisn to squeeze him \"I'm so sorry Densuke i didn't mean to. Please don't tell Chichakru\" Kirika begged.<br>\r\n<br>\r\nDensuke could only mumble that it was okay but Kirika massives breates stopped that, but suddenly the door began to open and she quickly threw Densuke onto a chair and sat on him so no-one see him. But the door only made a clicking sound and Kirika knew that Densuke were locked in for the rest of the night. Kirika stands up and walks over towards the door with Densuke stock to her back and again to see if the door was locked <br>\r\n<br>\r\nand it...</span></div></div>",
            "created":1223442000,
            "id":592876,
            "title":"Notices Densuke stuck to her backside"
        },
        "11111121112111":{
            "author_id":"ailon",
            "author_name":"Knippi",
            "choices":[
                "Densuke starts feeding Kirika",
                "Kirika's tummy is hurting"
            ],
            "content":"<div class=\"\"><div> <span>The door was locked, so Densuke said:\"Well, there's no other choice than staying in here for the night.\" Kirika smiled. \"So let's see what we may do\", Densuke told her. Kirika saw the big fridge of the House, and felt hungry again. \"I'm straving\", she told Densuke. \"Than let's fight it!\", Densuke said, opening the big fridge, that was filled up with all kinds of fattening food. Then</span></div></div>",
            "created":1228366800,
            "id":615333,
            "title":"The door was locked"
        },
        "111111211121111":{
            "author_id":"ailon",
            "author_name":"Knippi",
            "choices":[
                "Unconfortable andhurting very much",
                "Even bigger than before"
            ],
            "content":"<div class=\"\"><div> <span>She grined as she saw all the food. \"Who is hungry?\",asked Densuke. \"Me\", replied Kirika. \"There sould be enough for tonight\", said Kirika. The boy nodded. He went to the fridge, puling out a cake, that would have never been fitiing in a normal fridge. \"So let's make you finish this\", Densuke said. He placed it in fornt of the girl, an startedd feeding her big bits of cake. One after another went into her tumy, and Desuke watched it grow bigger and bigger with every bite. Eventually the girl made it. \"That was good\", she moaned. All the cake was finished, and her tummy was</span></div></div>",
            "created":1236315600,
            "id":656781,
            "title":"Densuke starts feeding Kirika"
        },
        "1111112111211111":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Densuke attempts to soothe the beast in Kirika's belly by massaging it.",
                "There's still more food left...into Kirika it shall go!"
            ],
            "content":"<div class=\"\"><div> <span>Cake, as sweet as it is, can be a cruel and rebellious mistress when devoured at such as rate that Kirika did, and of course, her stomach would most certainly agree with this by repaying Kirika's gluttony with a rather uncomfortable ache that only seemed to build in intensity. Kirika's tummy let out a pained gurgle bring about a grimace from the purple haired maiden who beared this aching bulge beneath her massive mounds of bosom. \"Oof, I think that over did it a little...\" Kirika lamented as she placed her hands gingerly on the taut globe of her stomach, but not having such an action punishable by feeling a sharp wave of pain jolt across her over swollen stomach followed by a cacophony of groans, the skin quivering beneath her fingertips as her stomach tried it's hardest to process how much was churning inside of it.<br>\r\n<br>\r\nIt was a whole new meaning to the phrase 'Upset Stomach'.<br>\r\n<br>\r\nDid Kirika have to endure this discomfort alone? Of course she didn't, Densuke was still here (although his silence would beg to differ). She would give anything to soothe this ache from the depths of her stomach, and now that she thought of it, him rubbing her ailing stomach might just do the trick, it may not cure it completely, but it will at least ease her bad case of indigestion. Kirika turned to Densuke her eyes full of need and her lips curled into a pout \"Densuke...\" her voice is that of a childish whine, similar to that of a youngster who ate a little too much from the cookie jar \"...Can you rub my tummy...it's really messed and--Ah!\" Kirika's plea was cut short by more rumblings from within the cramped prison of her stomach. Kirika soon felt a bloating sensation in her middle which climbed from it's depths and into her throat causing her to stifle an acidic burp. Kirika then looked back to Densuke, her point already emphasised to him. \"...Please\"<br>\r\n<br>\r\nNo man could resist such a temptation like this, just the sight of Kirika's bloated form bathed in the luminous light of moon was enough to mesmerise anyone and Densuke was no different, and although he was asked to rub her stomach, there was still more food in the fridge...which mean he could feed her more. But could Kirika's stomach handle any more food? It's doubtable but only way to find out....</span></div></div>",
            "created":1238907600,
            "id":671199,
            "title":"Cake of the Rebellion"
        },
        "11111121112111112":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Densuke let's her stomach be...it sounds too upset to touch right now.",
                "Yeah, her poor belly needs a massage."
            ],
            "content":"<div class=\"\"><div> <span>Densuke didn't know why, but he had this sudden urge to stuff the remainder of the food in Kirika, despite the obvious bloating of her already swollen midsection. He wanted to see her bigger, he wanted to see her belly bulge out more, and most of all, her wanted to how fat she would become once all of this was metabolized into Kirika's system. Having his mind set on his goal of enlarging Kirika even more, Densuke walked past her, the purple haired young woman raising a bit of an eyebrow as she  saw him reach for more food. However, her stomach let out a low gurgle not wanting her to even look at any more food. \"Densuke...what're you doing...\" Kirika inquired as she painfully rubbed her bubbling belly. \"I can't *urp* eat anymore...ugh my stomach...\"<br>\r\n<br>\r\nDensuke didn't say much in return as he returned to Kirika with more food for her to ingest, and immedieatly her stomach rejected it causing Kirika to turn a light shade of green from the contents within her stomach being churned over on itself. \"Urgh...\" Kirika groaned feeling sick to her stomach at the sight of the food. \"Densuke...my stomach hurts too much...I can't *urp*...\"<br>\r\n<br>\r\nBut it was already too late to turn back, as Densuke slowly fed her a slice of cake, Kirika didn't want to eat it but found her jaws going against her wills and soon came to swallow it much to her belly's chargin, although piece of cake was able to fit thanks to the series of burps Kirika let out earlier, these helped make more room for food, if only a little.<br>\r\n<br>\r\nHowever, even with only a little space left, Densuke continued to feed the swollen Kirika in earnest, her tummy gurgling almost constantly to the influx of food it just didn't want to handle. Kirika herself was starting to feel as if she may explode but...it was a rather...unusual feeling, she liked feeling full like this, only minus the indigestion.<br>\r\n<br>\r\n------<br>\r\n<br>\r\nWhen everything had finally been eaten by Kirika, she lay on the floor her stomach now doubled in size from before, the sounds within it also doubling in intensity as it gurgled and boomed with digestion, trying it's absolute hardest to process everything Densuke forced into it. \"Oooooh...\" Kirika moaned in anguish her hands rubbing on the taut sides of her overfull stomach, she herself not being able to believe that her stomach was able to take such a large amount of food and still remain in one piece...although this wasn't saying that it wasn't near it's limit of exploding, the sheer pressure that was building inside her made her feel as though she were a bomb about to go off.<br>\r\n<br>\r\nDensuke just couldn't believe it either, not only for him having put Kirika in this state but also at how swollen her body was getting; at first she only seemed to be just a bosomy woman, but now that the extra flesh had packed onto her, Kirika's form seemed alot better. Having bigger hips that almost rivaled her bosom in size and a belly that (now) dwarfed both her breasts and her lower body by a long shot.<br>\r\n<br>\r\nKirika glanced over to Densuke who she saw something strange in his eye, a hint of pleasure. Did he enjoy seeing her this bloated? The question to this will have to wait, as she needed a massage and fast, the pressure in her stomach was mounting to an intolerable level and she needed someone to rub her belly to help relieve her of this. \"Densuke...I need a belly massage...\" She asked to him as she motioned for him to approach her. <br>\r\n<br>\r\nDensuke just stood by thinking of what he should do...</span></div></div>",
            "created":1244264400,
            "id":703155,
            "title":"Absolute Burst Limit"
        },
        "111111211121111122":{
            "author_id":"ailon",
            "author_name":"Knippi",
            "choices":[
                "Yes, let's go on!",
                "No, let me please have a rest first."
            ],
            "content":"<div class=\"\"><div> <span>There were at least three reasons for Densuke massaging her. First of all he loved Kirika, and wanted to help her. Second thing was, that he also wanted to touch what he had helped creating. All that soft big amount of flesh. Her belly, and if she allowed him to, also all the rest of her body. And the third and most important reason or him, was that he wanted to make her eat more, therefor, she had to feel confortable. So he replied: \"OK, if you want to.\" \"Oh thank you so much\", the purple haired girl said, when Densuke started to rub her tummy. And it felt so good to Kirika. She let out mounts of pleasure, and slowly all the sounds within her belly stopped. She hugged him, pushing his face in her now perhaps J-cup boobs. Densuke enjoyed every moment of that. Than he asked her: \"Are you ready for the next round now?\"</span></div></div>",
            "created":1249362000,
            "id":738601,
            "title":"Yeah, her poor belly needs a massage."
        },
        "1111112111211111221":{
            "author_id":"ailon",
            "author_name":"Knippi",
            "choices":[
                "Next Chapter"
            ],
            "content":"<div class=\"\"><div> <span>Because Kirika did not really want to move, it was again Densuke, feeding the curvy girl. The fridge seemed to never get empty, and bite after bite went into Kirika. They both were surprised, how much food went into a gril, that only hours ago hat an absolutally flat tummy. Each time the little boy stopped, Kirika's reply was: \"More, please.\" And each time Densuke would be blushing, but still feeding her. Her butt had only grown a little yet, and also her arms and legs were thin, compared to the burgers, ice and different things that had been stuffed into her. Her boobs now seemed to be the biggest in town, and her belly hang down to her knees, making it seem like a bag, filled with food.</span></div></div>",
            "created":1277368020,
            "id":905440,
            "title":"More And More Food..."
        },
        "11111121112111112211":{
            "author_id":"ailon",
            "author_name":"Knippi",
            "choices":[
                "The beach",
                "The mall"
            ],
            "content":"<div class=\"\"><div> <span>\"You're looking great!\", said Densuke, who was only able to stare at Kirika's huge bust. She let out a moan, and said: \"I thin all the eating made me tired again, can't we sleep a little?\" So they did, Densuke cuddling up to her great bossom. The next day, something had happened, that Densuke would have never expected, but because this is the world of Eiken, it just happened, that nearly all of her immense belly had shifted a little to her butt, but most of it to her bust, that had been gigantic before. So late at night it made a ripping sound, when suddenly the yellow top she wore was destroyed, showing huge cleavage. Densuke awoke, also Kirika did. Her hips and butt were a little bigger than even Teachers, her belly, still noticeable larger, cause it spilled out of the sides under her shirt, but her boobs were gigantic.       \"So you're finally the biggest i the Eiken-Club again. If not in the whole world\", said Densuke laughing and blushing at the same time. There was nomore food left anymore in the house, and Kirika had another idea: \"Can we go to the beach Densuke? But could you bring me a bra to cover these before?\" She looked at her boobs, that were nearly touching the ground. So they eventually went to </span></div></div>",
            "created":1278257160,
            "id":911412,
            "title":"End of the night"
        },
        "111112":{
            "choices":[
                "the famous waterslide, the Gigantic Crusher",
                "the snack bar"
            ],
            "content":"<div class=\"\"><div> <span>Arriving at the waterpark, Kirika had really started to gain weight. Her belly was peeking through beneath her shirt, her thighs were slowly thickening, and her thong was starting to hurt her skin as it wedged deeper and deeper into her plumper butt cheeks. Her skirt rose a bit and part of her thick butt could then be seen by the world. She changed into her two piece, which was a lot tighter and more revealing than it used to be, and walked towards</span></div></div>",
            "created":1307000460,
            "id":1118240,
            "title":"Lin Grace's Waterpark"
        },
        "1111121":{
            "author_id":"ptrsfrms",
            "author_name":"ptrsfrms",
            "choices":[
                "Kirika keeps looking for Densuke.",
                "Kirika gives up and sits at the snack bar (sitting on top of Densuke)"
            ],
            "content":"<div class=\"\"><div> <span>Kirika smiled as the warm rays of the sun touched her open skin and she couldn't help but giggle as the many of eyes men, and a few women, looked at studying her figure.<br>\r\n<br>\r\n'Not surprised, no one can take there eyes off of me' Kirika told herself still oblivous to the fact that she was three times the size of any woman.<br>\r\n<br>\r\nKirika waddleld through the water park looking for a fun slide to go on until she saw a tall blue water slide in front of her, fileld with plent of twists and turns and in the end it had a straight dive.<br>\r\n<br>\r\nKirika smiled as she tried to jog up to the giant, having to stop every few minutes to catch her breath. <br>\r\n<br>\r\nKirika finally made it to the water slide and was surprised to see such a short line, but Kirika finally understood why the line was so short. The sign to the Gigantic Crusher read \"Partner ride\" with a heavy sigh Kirika almost gave up on the fact of going down the amazing looking slide until she saw three familiar faces.<br>\r\n<br>\r\nDensuke, Chicharu, and Yuriko were all walking up to the slide and when all three saw Kirika there jaws dropped in shock. <br>\r\n<br>\r\n\"Mis-Miss Kirika?\" Densuke asked as his face turned a lovely shade of red.<br>\r\n<br>\r\n\"Oh goody you guys are here. Densuke come with me i need a partner for this ride\" Kirika said as she waddled up to Densuke took him by his hand and began the long walk up the stairs.<br>\r\n<br>\r\nAFTER A VERY LONG WALK....<br>\r\n<br>\r\nKirika and Densuke made it to the top and Kirika was overjoyed to finally be able to go down the ride, the lifeguard handed the couple a long intertupe, Kirika quickly took her place in the front of the tube and sat Densuke in front of her.<br>\r\n<br>\r\n\"Are you ready Densuke?\" Kirika asked while Densuke gave a small shake NO<br>\r\n<br>\r\n\"Then here we go!\" Kirika yelled as she pushed the large tube down the gigatic hole.<br>\r\n<br>\r\nThe journy down the long slide was funa and exciting for Kirika and even Densuke cracked a smile, and when they reached the end Kirika smiled and laughed as she hit the water.<br>\r\n<br>\r\n\"Oh my god that was so much fun!\" Kirika yelled as she resurfaced from the water.<br>\r\n<br>\r\n\"Densuke?\" Kirka said as she began to look for the little brown hair boy.<br>\r\n<br>\r\n\"Densuke where are you?\" Kirika asked as she began to look under the water and for the little boy she had a crush on.<br>\r\n<br>\r\n\"Where is that boy?\" Kirika asked as she turned her back to the crowd behind her and revealed a flat little boy stuck to her butt.<br>\r\n<br>\r\n'So that's why the call it the Crusher'  a little boy said as he watched the tall purple amazon step out of the water and call out Desnuke's name.</span></div></div>",
            "created":1315077720,
            "id":1180325,
            "title":"the famous waterslide, the Gigantic Crusher"
        },
        "1112":{
            "author_id":"senfenrir",
            "author_name":"Thatguythere",
            "choices":[
                "The ice cream is RIDICULOUSLY fattening! (40 pounds a pop)",
                "The ice cream is incredibly addicting! (5 pounds a pop and she eats three a day)",
                "She scarfs down the one she's eating, then devours the rest! (over 250 gained)"
            ],
            "content":"<div class=\"\"><div> <span>Walking around to the front, Kirika noticed Chiharu, who was opening the door to the clubhouse. Shrugging, Kirika walked over to her, her tubby butt jiggling.<br>\r\n<br>\r\n\"O-oh! Miss Kirika! Wh...what a surprise!\" Chiharu stammered, a bit shocked to see Kirika. After regaining her composure, she had to stifle a giggle, as the sight of the Eiken Club leader's belly bouncing as she walked was too cute. \"Why were you hanging out outside?\"<br>\r\n<br>\r\n\"It's nice out.\" Kirika said, walking in past Chiharu and tossing the stick from her ice cream in the wastebasket, then pulling out an even larger treat. \"Nice weather and ice cream just go together. There anything wrong with that?\"<br>\r\n<br>\r\nChiharu couldn't help but giggle, as the ice cream Kirika had grabbed was an extra-fattening concoction of Komoe's. Kirika hadn't been around when the young girl had made them, but a large amount of fat had spilled in, and the poor girl hadn't had the heart to throw them out.<br>\r\n<br>\r\n\"Whatph wrong wiph you?\" Kirika mumbled around the mouthful of ice cream.<br>\r\n<br>\r\n\"Nothing, Miss Kirika. Umm...I...I have to go...assignment and all...\" Chiharu stammered, giggling a bit more. After closing the door behind her, she burst out laughing.<br>\r\n<br>\r\n\"Still weird...\" Kirika muttered, before a glazed look came over her face.</span></div></div>",
            "created":1207112400,
            "id":515438,
            "title":"Komoe's accident, or Kirika's problem?"
        },
        "11123":{
            "author_id":"senfenrir",
            "author_name":"Thatguythere",
            "choices":[
                "\"I'm gorgeous!\"",
                "\"I've gotta get home!\""
            ],
            "content":"<div class=\"\"><div> <span>Slurping down the ice cream she was already eating, Kirika dashed to the freezer, her plump butt wobbling and sending her panties deeper into her rear. Grabbing handfuls of ice cream pops, she began to cram three in her mouth at once, going through them as fast as she could before simply spitting the sticks onto the floor and grabbing more. The effects were obvious right away, as her already sizable boobs grew with fat, and her shirt rode up her growing gut. She ignored her tightening clothes, even as her bra burst and set her massive breasts free and bouncing.<br>\r\n<br>\r\n--------------------------------<br>\r\n<br>\r\nA stead half hour of eating later, a much larger Kirika lay on the ground, slowly sucking away at the last of the pops. As the last of the fatty ice cream flowed down her throat, she grabbed the stick and threw it in the pile. Burping loudly, she groaned as she lay there.<br>\r\n<br>\r\n\"God...those were great...so creamy and smooth...and delicious...\" she murmured, lying in her stupor. Shaking her head, she sat up as much as she could and gave a small gasp as she surveyed her fat form. Standing up, she made her slow, ponderous way to the mirror, her thick thighs rubbing.<br>\r\n<br>\r\n\"I...I'm MASSIVE.\" she gasped, her hands on the creamy expanse of her belly. Massive, though, was an understatement.<br>\r\n<br>\r\nThe damage began at her face, which had blown out with a thoroughly defined second chin and tubby cheeks. Her second chin rested on a pair of what looked to be bloated beachballs with small nubs on the front of them. In reality, her breasts had swollen to immense sizes, but remained perky, thanks to the fact that the skin had grown used to her usually massive knockers. Another factor was her gut, which paled in comparison to her boobs, but was still proudly swollen with fat, hanging over her waist and obscuring her crotch.<br>\r\n<br>\r\nHer thighs and ass had been hit hard as well, each thigh the size of a redwood and each cheek the size of a well inflated beachball. The twin globes wobbled and jiggled as her thighs rubbed and crashed together. Her soft arms tapered down to tubby hands, which were busy caressing her flabby form.<br>\r\n<br>\r\n\"Oh god...I...I...\"</span></div></div>",
            "created":1207112400,
            "id":515444,
            "title":"She scarfs down the one she's eating, then ..."
        },
        "111232":{
            "author_id":"ptrsfrms",
            "author_name":"ptrsfrms",
            "choices":[
                "Kirika forgets about Densuke and lays on top of him",
                "Kirika helps Densuke out"
            ],
            "content":"<div class=\"\"><div> <span>Kirika quickly covered her boobs with her left arm and made a dash to the door and quickly opened it. Kirika had a hard time getting out the door due to her new figure but she manged to get through. Kirika then ran to the stairs and began to run down the stiars but becuase of her new sizes Kirika last balance and began to roll down the stairs, and sadly a small frail young boy by the name of Densuke was at the bottom of the stairs.<br>\r\n<br>\r\nDensuke felt the sudden shack in the stairs and looked up in utter shock as the massive amazon rolled down the stairs and rolled right ontop of Densuke boobs first. Kirika rubbed her head as she stood up \"Ow...I have to get home i can't let anyone see me like this\" Kirika whinned as she checked her hand for blood. Kiricka then felt something out of place she felt something sticking to her chest and the moment she looked down she saw Densuke. <br>\r\n<br>\r\nFlat as paper and he was soccering Kirikas mazzives boobs with his small body. \"Densuke are you all right\" Kirika asked as she pilled Densuke head of her two massive boobs and looked at Densuke. \"I'm-I'm fine just-just in a little pain\" Densuke said \"Sorry Densuke I'll make it up to you, I just need you to stay there until i get home\" Kirika said as she began to or i should say try to run all the way back to her hosue.<br>\r\n<br>\r\nKirika burst through her front door and slammed the front door shut and let out a sigh of relief \"Made it and no one saw me\" Kirika said </span></div></div>",
            "created":1236056400,
            "id":655844,
            "title":"\"I've gotta get home!\""
        },
        "1112321":{
            "author_id":"ptrsfrms",
            "author_name":"ptrsfrms",
            "choices":[
                "Densuke sees Kirika's breats and she panics",
                "Densuke sees Kirika"
            ],
            "content":"<div class=\"\"><div> <span>Kirika let out a deep sigh as she walked into her one room apartment and into her room and let out a deep sigh as she laid down on her bed face first forgetting all about poor flat Densuke , and suddenly Kirika heard a creaking noise when suddenly her bed legs gave out and Kirkas bed gave out. \"Oh come on...how can my day get worse...first my once slim body, and now my bed\" Kirika said as she picked herself and she felt something something was out of place. She out grew her bra so why does her chest feel so comfortable. Kirika looked down at her chest and noticed that Densuke was flat against her newly massive breats. 'Densuke???' Kirika told herself.<br>\r\n<br>\r\n\"Oh my gosh Densuke are you okay?\" Kirika asked as she peeled poor Densuke off her body. \"I'm Okay Kirika I'm...\" Densuke suddenly trailed off as his face suddenly glowed a bright red, and Kirika might now why</span></div></div>",
            "created":1249621200,
            "id":740327,
            "title":"Kirika forgets about Densuke and lays on top of..."
        },
        "113":{
            "author_id":"vader7476",
            "author_name":"Vader7476",
            "choices":[
                "She finds the bottle.",
                "Komoe enters."
            ],
            "content":"<div class=\"\"><div> <span>“Oh, this is no good!” yelled Kyoko as she searched all over the Eiken clubhouse.  “How could I have misplaced an entire bottle of that formula?”  After searching for the better part of an hour, the blue-haired girl finally gave up.  “If it’s not around, then someone must have taken it.  This is bad, it’s still needs to be tested!”  Defeated, Kyoko left to continue her research, hoping it would turn up before something bad would happen.  As she left…</span></div></div>",
            "created":1173848400,
            "id":389495,
            "title":"Lost bottle"
        },
        "1132":{
            "author_id":"vader7476",
            "author_name":"Vader7476",
            "choices":[
                "Komoe makes dinner.",
                "Komoe tests the strange liquid."
            ],
            "content":"<div class=\"\"><div> <span>Komoe comes in with a monstrous amount of groceries.  It takes her multiple trips to bring everything inside and fills the kitchen cabinets and refrigerator to the brim with food.  Even then, there were still a massive amount of bags on the floor left to be put away.  <br>\r\n<br>\r\n“Oh, I don’t know where I’m going to put all this food!  I guess I went overboard this time.  I’ll do my best!” Komoe said as she tried stuffing additional groceries into the already stuffed kitchen.  As she did so, her large bust swung wildly, knocking over a spice rack.  Luckily for her, the bottles were plastic, so she didn’t have a mess to clean up.  As she bent down to pick it up, she noticed an unlabeled glass bottle hiding on the floor between the refrigerator and cabinet.  “Hmm, I’ve never seen this before.  I’ll have to test it out with dinner tonight!<br>\r\n</span></div></div>",
            "created":1173848400,
            "id":389500,
            "title":"Interesting find."
        },
        "11321":{
            "author_id":"vader7476",
            "author_name":"Vader7476",
            "choices":[
                "The next day.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Dinner approached and the club members were seated at the table.  The aroma was hypnotic, almost seductive, begging to be embraced.  The large mountaint of food set forth by Komoe was picture perfect, and by its smell alone one would think of it as addictive.  Surreal would be the best way to describe the entire situation.  Even shy members like Chiharu and Teacher found themselves ready to pounce on the elaborate spread.  As Komoe sat down herself, they dug in with wreckless abandon.  Once in their mouths the sensation and pleasure was unimaginable, pure ecstasy.  <br>\r\n<br>\r\nKomoe smiled to herself.  She really outdid herself with this meal.  She had clumsily bought so much food that she had to get rid of a lot of it quickly before it would spoil, making this meal far larger than normal.  She had warned the member to try and eat a little more, but they were really taking it to heart, especially Kirika!  The busty amazon was shoveling food into her mouth with reckless abandon.  She needn’t be bothered with getting food or sauce on her sweater.  Chewing for that matter was kept to a minimal.  Her large bust shook violently as she moved quickly to get more and more to feed herself with.  Komoe’s observations were cut short as she herself started to pay attention to how much she was eating, and quickly that thought was drowned away with the thought of how delicious it all was, and getting more of it.<br>\r\n<br>\r\nAs the hours past, the initial vigor had worn off.  All the members were extremely full, but the hurt in their stomach was overpowered by their gluttonous desire for more.  The smaller members like Kyoko and Komoe had all but stopped, eating incredible small amounts in long periods of time, trying to find ways to relieve the pain as they added to it.  Kirika, the largest eater of the club, and undid her skirt to let her swollen stomach breath.  The gesture was copied by the entirety of the club.  This had helped immensely, even if it was unladylike.  <br>\r\n<br>\r\nWhen the meal finally came to an end, they were sprawled on the ground, their guts exposed and in the air.  Moving hurt, it hurt a lot.  Kyoko had passed out, sleeping beside Kirika, and sucking on a large leg bone.  Yuriko looked to her sister who was wincing as her large tits were making added pressure for her engorged stomach.  In fact, it seemed to be similar for all the girls with big breasts.  “For once, I’m glad I don’t have those huge boobs!” she thought to herself.<br>\r\n<br>\r\nKomoe under some strange will had managed to get up and set dessert on the table.  Happy the added ingredient had been such a hit, she decided to cook with it more in the future.  Groans were heard from the members as they slowly rose up to eat even more.  <br>\r\n</span></div></div>",
            "created":1173848400,
            "id":389511,
            "title":"Dinner"
        },
        "113211":{
            "author_id":"vader7476",
            "author_name":"Vader7476",
            "choices":[
                "Yuriko plays with her sister while she sleeps.",
                "Another member wakes up!"
            ],
            "content":"<div class=\"\"><div> <span> After the feast, the girls (who had been too tired to move) had fallen asleep in the kitchen.  Groggily they awoke one by one, still full from the long lasting meal.  Yuriko awoke first and struggled to her feet.  She walked to the bathroom and closed the door.  It was cold, a little too cold.  As she looked down, she realized she was naked!  But what her naked body revealed excited her to no end.  She had boobs!  Her once non-existent A-cups looked to be at least a B, maybe even a C-cup!  She cupped them gently, feeling their weight.  They were heavy!  She didn’t take time to notice her small pot belly or larger ass.  She ran out of the bathroom to see if she was the only one who had a larger chest than yesterday.  When she got to the kitchen, Yuriko found that all the girls were naked, with shredded clothes all around them!</span></div></div>",
            "created":1173848400,
            "id":389536,
            "title":"Yuriko's discovery"
        },
        "1132111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Chiharu woke up",
                "Yuriko noticed how big her belly had gotten"
            ],
            "content":"<div class=\"\"><div> <span>The one that she was most interested in was Chicharu. Her boobs were gigantic! She darted closer to her, without making a sound. They looked so big, that a letter couldn't even say how big a cup size they were! Yuriko poked them, sending Chicharu's boobs into a jiggling frenzy. Yuriko was amazed, and couldn't take her eyes off of them. Just then...</span></div></div>",
            "created":1174107600,
            "id":390309,
            "title":"Admiration"
        },
        "114":{
            "author_id":"bestthe",
            "author_name":"Johnny the Pirate Monkey",
            "choices":[
                "Densuke Mifune(The Abused One)",
                "Komoe Harumachi(The Cook)",
                "Kyoko Morooka(The Scientist)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, Kirika is going to be forced to gain. HOORAY!<br>\r\n<br>\r\nNow who does this?</span></div></span></div>",
            "created":1360171320,
            "id":1525784,
            "title":"Force Feeding"
        },
        "12":{
            "author_id":"jedislayer",
            "author_name":"jedislayer",
            "choices":[
                "normally (eating)",
                "magic",
                "science (chemical or something)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah, Chiharu, the girl whose boobies won't stop growing.  And how does she gain?</span></div></span></div>",
            "created":1167195600,
            "id":368625,
            "title":"The red-head with ever-growing boobs"
        },
        "121":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Densuke saw her",
                "she runs into Yuriko"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu was sitting around in the Eiken Clubhouse, when all of a sudden, her stomach started to growl loudly. She immeadiately got up and started to empty out the fidge. \"I have to eat. I need food!\" she said. Within a matter of seconds, the entire fridge was bare, and everything was spread out on the table. Every fattening food you could imagine was on there. Cakes, Ice Cream, even Kirika's Chocolate-covered bananas! Then Chiharu started shoving all the food into her mouth, moaning in estacy at the taste of the food. It was too good to her! <br>\r\nWithin a half an hour, the floor was lined with plates, wrappers, Popsicle sticks, you name it. Chiharu was just sitting in her chair, clutching her belly. She was in pain. She loved stuffing herself, but it did hurt. She got up and waddled out the door, her belly jiggling with every step. It looked like she had swallowed a beach ball! She was just praying to get home and take a nap without anyone noticing how fat she had gotten. While walking home....</span></div></div>",
            "created":1169355600,
            "id":375555,
            "title":"Eiken Suffing"
        },
        "1212":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "A button on her shirt popped",
                "Her Skirt ripped open"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu was waddling down the center of town, when she saw Yuriko out of the corner of her eye. \"Oh why now?\" Chicharu says to herself. Yuriko runs up to her and says: \"What happened to you? It looks like you swallowed a beach ball!\" She can't keep her eyes off of Chiharu's belly. Chicharu ignores her, and replies: \"I was hungry. It's not that big of a deal!\" <br>\r\n\"It's so a big deal! Does Mother know about this? Oh! What about Densuke?\"<br>\r\n\"Omigod. I completely forgot! Please, if you see Densuke, tell him to meet me at my house. I need a nap anyway.\"<br>\r\n\"Alright, sister!\"<br>\r\nChiharu waddled away with a worried look on her face. What would Densuke think of me? Would he still like me even if I was fat? And would mother approve of my weight gain, or would she put me on a diet? Chiharu was thinking of this while waddling home. She was getting close to her home when...<br>\r\n</span></div></div>",
            "created":1169355600,
            "id":375611,
            "title":"Bothersome Yuriko"
        },
        "12121":{
            "choices":[
                "Densuke greeted her from behind",
                "Chiharu's mom opened the door"
            ],
            "content":"<div class=\"\"><div> <span>A button on her shirt blasted off revealing a deep canyon of cleavage. Chiharu blushed a deep crimson red and tried to cover up the newly grown breasts. \"Oh now this?\" she asked herself, noticing that her breasts had grown a size or two ever since she ate. The other buttons were now yearning to burst free, as her chest began to slosh around freely. Her bra began to feel very uncomfortable as it began to dig into her big, she groaned and tried to reach back, but as soon as she left go of her chest POP! Another button came rocketing off knocking a bird out cold. Her hands flew immediately to cover her now exposed breasts. Chiharu ran or tried to run home as fast but she couldn't with the added weight from her soft belly and large breasts. As she got to her door. . . </span></div></div>",
            "created":1204347600,
            "id":504450,
            "title":"A button on her shirt popped"
        },
        "121212":{
            "choices":[
                "be catious and eat only a little bit",
                "become overjoyed that her mom has accepted her they way she is and pigs out"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu's mom opens the door and greets her by saying \"Hi honey are you ready for dinner.  It's almost done.\" All the while acting like nothing about Chiharu had changed.  Chiharu is thinking; how has she not noticed my weight gain.  While at the dinner table Chiharu notices that Yuriko isn't home and that the table is over flowing with food of all kinds.  So she decides to . . .</span></div></div>",
            "created":1205298000,
            "id":508118,
            "title":"Keiko's reaction (or rather lack of)"
        },
        "1212122":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Chiharu asks her mom for dessert",
                "Yuriko comes back to find a Bloated Chiharu"
            ],
            "content":"<div class=\"\"><div> <span>I guess she doesn't mind me being fat, Chiharu thought. When she sat down, she noticed that nobody was at the table. \"Mom, where is everybody?\" Chicharu siad with a little concern. \"Oh, Yuriko wanted to take the kids to the flea market, and Miharu had to trade shifts with someone at the park, so it's just you and me! But I prepared food expecting for everyone to be here.\" Kieko replied. She started putting down all kinds of fattening foods on the table. Chiharu started to drool. She was very hungry, and it all looked so good! She heard her fat belly start to gurgle. She squeezed her love handles. But am I happy being fat?, Chiharu thought. What if Mifune-Kun finds me repulsive? I really want him to like me. She then lost her train of thought by that hypnotizing aroma coming from the dinner table. She completely forgot what she was thinking about and started to stuff her face until there was nothing left.  <br>\r\n<br>\r\nWhen she was finished, she laid back in her chair, rubbing her now massive belly. It looked like she swallowed a globe! When Kieko was clearing the table, she noticed Chiharu, looking really big and full. \"My my! What a big girl you are, Chiharu! I'm so proud of you.\" Kieko said with a smile. \"Oooh...thanks, Mom.\" Chiharu mumbled while rubbing her big bloated gut. Chiharu then let out a table-rattling belch, making her round belly and huge breasts wobble and shake. \"Mmm....excuse me.\" She said while turning bright red. She felt so round and fat, and she loved it. <br>\r\n<br>\r\nLater...</span></div></div>",
            "created":1216702800,
            "id":558935,
            "title":"Blissful Oblivion"
        },
        "12122":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "The weight had shifted to the rest of her body",
                "Densuke was there"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu felt a tear by her pudgy leg. Her skirt had ripped! Her face went red with embarrassment. She started to waddle quicker, making her sweat. She managed to get home without driving any more attention to herself. When she got in the door, she found that her siblings were not home. \"Great. Now I can nap.\" She sighed with relief. Chiharu stripped herself of her worn-out and torn clothing, leaving her in her bra and panties. She rubbed her belly, which was still digesting all the food she ate. She cried out in pain, since her stomach was still quite sore. She waddled to her room, and passed out on her bed. When she woke up...</span></div></div>",
            "created":1169355600,
            "id":375618,
            "title":"Home Safe"
        },
        "121221":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Her Stomach gurgled again",
                "Someone knocked at the door!"
            ],
            "content":"<div class=\"\"><div> <span>When she looked up, she couldn't see anything but mountains of fat. Chiharu got up immeadiately to examine her body. She plumped out all over! Her Belly was no longer firm, but soft, and sagging a little over her waistline. Her belly had formed rolls on the sides of it. She squeezed them, letting out a moan of pleasure. She turned around, to examine her backside. Her butt had gotten larger and wider, turning her teddy bear panties into a teddy bear thong. Her arms were coated with a little bit of blubber, making them shake when she waved her arms around. Even Chiharu's face had gotten a bit plumper, but not enough for a double chin. Her breasts had even got a bit meatier, threatening to tear her bra to shreds. But the strangest thing was, it felt GOOD. She poked her belly, making it wobble and jiggle about. Chiharu giggled while rubbing her cellulite-ridden ass. That felt the best! \"How could being so big feel so incredible?\" She said to herself, while admiring her body in the mirror. Just then...</span></div></div>",
            "created":1169355600,
            "id":375624,
            "title":"BBW Chiharu"
        },
        "1212211":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "250",
                "300"
            ],
            "content":"<div class=\"\"><div> <span>Her stomach started to rumble. \"Must be Hungry again!\" She said to herself. She started to waddle to the kitchen, making her belly wobble and jiggle with every step. She looked through the fridge, getting all the delicious fattening goodies she could find. They all looked so good! Soon enough, it was the same scene as before. She was feeding herself to oblivion. Soon enough, the whole fridge was empty, and Chiharu was sitting there, rubbing her belly, which was way bigger then before. \"Mmm...so *urp* good...\" She said. She felt that her ass was even larger then before. She giggled with glee. She decided to get up, and waddled over to the bathroom scale, and stepped on it. When the dial stopped spinning, it was on....</span></div></div>",
            "created":1169355600,
            "id":375630,
            "title":"Here we go again..."
        },
        "12122112":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Densuke comes in",
                "She hears a noise"
            ],
            "content":"<div class=\"\"><div> <span>The pin on the scale stopped at 300. Chiharu giggles with excitement, causing her belly to wobble. No denying it now, she was FAT. She was staring at herself in the mirror, playing with her big belly; when all of a sudden her bra snaps off, cracking the mirror. Chiharu realizes that none of her clothes longer fit, and Densuke might come over any second! She waddled to her Mom's room as quickly as she could and started to look through her mom's drawers, searching for a top that could possibly contain Chiharu's massive breasts and belly. \"Mother is taller and bustier then me. Maybe at least one of her tops'll fit!\" she said to herself. She finds one of her Stretchy Turtlenecks. These should be ok. She tries it on, which manages to barely fit. Even though it's stretchy, it rides up over her round belly, exposing it. There is no possibility of it fitting with a bra on! Chiharu goes red at the thought of her large boobs bouncing on her belly in public. She continues to raid her Mom's drawers when...</span></div></div>",
            "created":1169355600,
            "id":375689,
            "title":"Looking for temporary clothes"
        },
        "121221121":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Fainted at the sight of Chiharu",
                "Gives Chiharu a hug"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello? Chiharu? Are you here?\" Densuke called. \"Yuriko told me you wanted to talk to me.\"<br>\r\n\"Oh shit! It's Densuke!\" Chiharu said to herself. She scrambled as fast as she could to her bedroom, and got under her bed, trying to cover her large gut, but failing. \"I'm in here, Densuke!\" Chiharu called out, and then putting the covers up to her nose, hoping Densuke won't notice the large bulge in the covers.<br>\r\n\"Hey, are you ok? I was worried that you were hurt or something.\"<br>\r\n\"No, I'm fine, thanks. Just a little too tired today.\"<br>\r\n\"Hm.\"<br>\r\n\"Hey, could i ask you a question?\" <br>\r\n\"Go Ahead.\"<br>\r\n\"Would you still like me even if I was fat?\"<br>\r\nDensuke went red at the question, because many of his fantasies about Chiharu involved her stuffing herself and getting fat. He took a big gulp and then said with a strange about of courage: \"Chiharu, I'd like you no matter what size you were; even if you were 100 lbs or 1000 lbs.\"<br>\r\nChiharu went bright pink at those words. Well, i have something to tell you, then. She then pulled out the covers, revealing her much larger body. Densuke then...</span></div></div>",
            "created":1169355600,
            "id":375703,
            "title":"Confession"
        },
        "1212211211":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Densuke is awake",
                "Densuke is still asleep"
            ],
            "content":"<div class=\"\"><div> <span>Densuke spurt blood out of his nose and fainted. Next to seeing Chiharu naked, seeing Chiharu overweight was his greatest fantasy. Chiharu gasped and came right to his side, and then heard a rip. Her panties had split right open. But she just wrapped a blanket around her waist, and started cleaning the blood off of his nose and shirt, while accidentally smothering Densuke's face into her belly fat, which was quite soft. She had picked up Densuke, and put him in her bed. \"Hm...either Densuke's really thin, or this fat has made me stronger!\" Chiharu said while patting her belly, making it wobble. She resumed raiding her mother's drawers, and found a pair of stretchy panties, which were kind of revealing (Chiharu's face went red at the thought of wearing these), and a pair of sweat pants, that'll at least be good enough for when she goes shopping for bigger clothes. After getting the clothes on, she waddled back to Densuke, to see how he was. When she made it to her room...</span></div></div>",
            "created":1169355600,
            "id":375718,
            "title":"Taking care of things"
        },
        "12122112111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "\"I'd love you to!\"",
                "\"No, not yet.\""
            ],
            "content":"<div class=\"\"><div> <span>Densuke was rubbing his head, trying to wipe off the blood from off his shirt, when he notices Chiharu standing in the doorway. \"Are you okay? You took a huge fall there.\" Chiharu said. Densuke looked at Chiharu in her mom's top, and turned red. She looked incredible. \"I'm fine\" Densuke said, \"But you gotta tell me what happened to you. You look great!\" Chiharu blushed, and went on to explain how one rumbling stomach led to her weighing 300 lbs. Densuke was blushing brightly, because it was like Chiharu was describing his fantasy. \"Wow...would you mind if I helped become even bigger then this?\" Densuke said, trying not to faint again. Chiharu went bright pink and said...</span></div></div>",
            "created":1169442000,
            "id":375760,
            "title":"Proposition"
        },
        "121221121111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "\"Sure, let's go!\"",
                "\"Nah, you need to be bigger first.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Sure, I'd love you to.\" Chiharu said with a big grin on her face. Densuke went pink, thinking that she wouldn't have said yes. \"How about we go to the mall and shop for new clothes? What I'm wearing isn't even mine, and they still barely fit.\" Chiharu suggested, while pulling her shirt down, attempting to hide her enormous belly. Densuke replied...</span></div></div>",
            "created":1169442000,
            "id":375835,
            "title":"Acceptance"
        },
        "1212211211111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "an very cute XXL Bikini",
                "an even cuter XXL Outfit!"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright. Sounds like a good idea.\" Densuke said, while patting Chiharu's belly. She went pink. It felt even better then when she pats it! Chiharu got up, which took some energy on her part, and went out the door with Densuke, hand in hand. They were both blushing. They both liked each other very much, and were holding hands for the first time. They were very happy. Chiharu were getting more looks from the boys, but the very same boys were getting menacing glances from Densuke. When they got to the mall, Chiharu giggled with glee. For some reason, all the clothes were plus-sized, implying that Chiharu would fit into them perfectly! When she finally got a set of clothes off the rack, they were...</span></div></div>",
            "created":1169787600,
            "id":376960,
            "title":"Walking to the Store"
        },
        "12122112111111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "the food court",
                "back to Chiharu's house"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu saw a perfect two-piece on the rack. So she put it on, and then came out of the dressing room. \"Well, what do you think?\" Chiharu said while twirling. Densuke's face was completely red. \"I guess that means it looks good.\" Chiharu said while giggling. She then went back in, and took off the snug bikini. While getting back into her clothes, she wondered if this day could get any better. When she was finished, she left the dressing room with the bikini in her hand. She looked over at Densuke, (who was still extremely flustered from seeing her in that) and gave him a kiss. \"Thank you.\" she said. Densuke snapped back into reality, and replied: \"Uh...Y-you're welcome.\" After paying for the clothes, they decided to go to...</span></div></div>",
            "created":1170046800,
            "id":377746,
            "title":"Comfort"
        },
        "121221121111111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Yuriko",
                "Miharu"
            ],
            "content":"<div class=\"\"><div> <span>\"Ooh! Can we go to the food court, Densuke? Please?\" Chiharu pleaded. Densuke looked at her, and said: \"Alright, but only because you're so damn cute.\" Chiharu giggled, and started to run towards the food court. Densuke blushed and smiled. She's so sexy, Densuke thought. When she made it to the booths, she stopped in her tracks. \"so much food...\" Chiharu drooled. Every stand had different kinda of fattening foods. Pizza, Fast food, Chinese, even something called \"WGX\". She wasn't sure what it was, so she might not go for that. When Densuke caught up, Chiharu said, \"could you please get me some food?\" Densuke sighed, and replied \"Could you get it yourself? It's probably gonna be a huge amount of food...\" Chiharu pushed out her gut, which turns out she was sucking in, straining her once stretchy top. Densuke's nose started to bleed, and then walked away, going to get the food. Chiharu plopped down into the seat, and started to play with her huge belly. \"Mmm...it's so warm...\" Chiharu said between moans. Chiharu was looking around to see if anyone was staring at her. Then she saw...</span></div></div>",
            "created":1170133200,
            "id":377889,
            "title":"Indulgence"
        },
        "1212211211111111":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "\"Could you get me some dessert?\"",
                "\"Can you help me up?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Well hello there!\" Chiharu heard. Oh no, please not her, Chiharu thought. <br>\r\n<br>\r\nBut it was. Yuriko managed to squeeze her tiny self next to her fat sister. \"What's all this now?\" Yuriko said while squeezing Chiharu's big soft belly. Chiharu winced in pain. \"Please stop....I'm sensitive there too....\" she moaned. \"Well, now that you said that, I'm going to do it even more!\" Yuriko said, while continuing to pinch her flabby love handles. Chiharu was looking for Densuke to help her. Densuke came back with 2 trays full of the most fattening foods in the food court. He set the trays down, and saw what was going on. Yuriko noticed Densuke, and immeadiately threw herself off of Chiharu and onto Densuke.<br>\r\n<br>\r\n\"Hello, Densuke-Oni-Chan! Ready to accept my love yet?\" Yuriko crowed. Densuke was having a great day (which is rare for him), and didn't want Yuriko to ruin it. \"No, I'm not, and I never will be! Now do both me and Chiharu a favor by going away!\" Densuke shouted. Yuriko never saw him like this, and was more startled then anything. She left, afraid what would happen if she didn't. <br>\r\n<br>\r\n\"I'm sorry you had to see that, Chiharu. Are you ok?\" Densuke said, a little shook up. \"Yes, I'm fine.\" Chiharu replied. \"Thank you for helping me. She was hurting me.\" <br>\r\n<br>\r\n\"No problem. The last thing I wanna have is for you to be hurt.\"<br>\r\n\"Thank you, Mifune-Kun....you're very sweet.\"<br>\r\n\"You're welcome. Now dig in, your lunch is getting cold. I can tell you're hungry, you're drooling.\"<br>\r\n\"Ooh! Sorry.\" <br>\r\n<br>\r\nChiharu dug in without even wiping her mouth. Wrappers and container were being thrown about, completely empty.  Minutes later, Chiharu laid back, rubbing her swollen, tender belly. \"Oooh....\"Chiharu moaned. \"Mifune-Kun...it hurts....please help me...\" Densuke sat next to her, and started rubbing her belly slowly. \"Does that help?\" \"Mmmm...of course....\" Chiharu moaned. \"...Mifune-Kun?\"</span></div></div>",
            "created":1216702800,
            "id":558954,
            "title":"Yuriko"
        },
        "121221121111112":{
            "choices":[
                "Chiharu begins stuffing her face",
                "Chiharu's parents come home"
            ],
            "content":"<div class=\"\"><div> <span>The couple decided it'd be best to go back to Chiharu's home at the time. After all, clothes shopping for a girl of Chiharu's size can really strain one's spending! As Densuke and Chiharu were midway through hanging up Chiharu's new plus-sized clothing, Chiharu's tummy began to growl again... (Oh god, he must think I'm a total pig to be hungry this many times in one day...!) Chiharu thought to herself, blushing. Densuke grinned naively and replied, \"don't worry, I was feeling a bit hungry myself. I'll go fix us something to eat.\" He then walked out the bedroom door whistling merrily.<br>\r\n<br>\r\nBy the time Chiharu was done hanging all her new clothes, she caught a whiff of a wonderfully enchanting aroma flooding into the room. She moaned in delight as she immediately ran to the source of the enticing scent. Upon entering the kitchen, she froze with ecstacy. The entire dining table was adorned with enough fattening and delicious sweets to feed a family reunion! Densuke, while lining a pie crust, turned at the sound of fast-paced footsteps. \"I wasn't sure how much you wanted, but we could always refridgerate whatever you don't want, right?\" he said, pulling up a chair for Chiharu. After snapping back into reality, Chiharu replied, \"Densuke, I didn't know you could cook!\"<br>\r\n\"Well,\" he responded, \"Komoe is pretty good at cooking, so I figured she wouldn't miss a cookbook or two...\"<br>\r\n<br>\r\nAt that point...</span></div></div>",
            "created":1195448400,
            "id":466361,
            "title":"back to Chiharu's house"
        },
        "1212211211111121":{
            "choices":[
                "\"YES!\"",
                "\"NO!\".....Wait...\"YES!\""
            ],
            "content":"<div class=\"\"><div> <span>Tears of bliss trickled down Chiharu's rounded face as she began engorging herself with entire pounds of fatty foods such as cakes, pastries, and whole pizzas. Her round belly increased in girth with every gulp she took. Densuke beamed, feeling a sense of accomplishment for making her so happy. After his moment of zen, Densuke resumed being hard at work with his cooking. \"If she stops, then I'll stop, I guess,\" he murmured to himself as he shoved cinnamon rolls into an oven and closed the hatch.<br>\r\n<br>\r\n<br>\r\nA full hour later, and Chiharu was absolutely 150% stuffed. She moaned with a mix of bliss and pain as she slowly reached for another cherry pie to stuff into her bloated mouth. To Densuke, it was clear that she was near her limit, so he simply turned off the appliances in use to sit down with a small bowl of ramen noodles for himself. He turned to look at Chiharu. Despite the massive, round, and painfully stretched belly she had sticking out 30 inches in front of her, Chiharu refused to stop stuffing. Her mother's turtleneck had already become so small, it barely covered half of her gigantic breasts. Her sweatpants were decimated, her mother's panties were stretched to a point where they seemed like something you'd see from a porno flick, and the chair she was sitting on seemed half an hour short of folding due to the colossal weight. Alas, Chiharu continued to slowly jam entire rolled-up pizzas down her throat.<br>\r\n<br>\r\nDensuke came to see that Chiharu, while in unrelenting bliss, was also wincing in pain with each swallow due to the enormous amount of belly growth in one sitting. \"I hope we can still return those clothes...\" he muttered as he watched Chiharu intently. Chiharu stopped to turn to him. \"Densu....ke...\"<br>\r\n<br>\r\nDensuke couldn't figure out if that was a wince of pain or ecstacy.<br>\r\n<br>\r\n\"My tummy hurts so much...Could you maybe, rub it a little...?\"<br>\r\n<br>\r\nNow, how did he think this one through?</span></div></div>",
            "created":1195448400,
            "id":466380,
            "title":"No More Inhibitions"
        },
        "12122112111111212":{
            "choices":[
                "Chiharu's chair gave in!",
                "Chiharu's panties snapped!"
            ],
            "content":"<div class=\"\"><div> <span>Densuke's timidness got the better of him for a quick second. Didn't seem very gentleman-like to rub a girl's belly as she ate, but it wasn't as bad as leaving her to deal with such pain alone...<br>\r\n<br>\r\nHe stood behind her so he could comfort her in this time of need, only to realize that his arms didn't entirely reach around! Didn't exactly take a brain surgeon to realize he could stand next to her instead, though.<br>\r\n<br>\r\nAs he slowly rubbed her swollen tummy, she cooed with a feeling of safety and security. No more pain, she figured as she stopped her indulgence to join Densuke with rubbing her gigantic belly. She purred and moaned in comforting delight. This kind of feeling was pure magic.<br>\r\n<br>\r\nSuddenly-...!</span></div></div>",
            "created":1195448400,
            "id":466385,
            "title":"Feelin' Bloated?"
        },
        "121221121111112121":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Her little brother and sister were playing with her belly!",
                "Her weight shifted to the rest of her body"
            ],
            "content":"<div class=\"\"><div> <span>Densuke started to hear some creaking, but dismissed it as nothing. But then the chairs legs snapped, and Chiharu fell on her round, plump behind. She blushed red with embarrassment. When she tried to explain herself to Densuke, all that came out was a huge belch. \"Oh my....how very unladylike of me....I'm sorry, Densuke...\" she mumbled. Densuke's nose was bleeding again. She looked so bloated and full, and Densuke loved it.<br>\r\n<br>\r\n\"Mifune-kun, your nose!\" Chiharu said while looking very concerned. <br>\r\n\"Oh don't worry about it.\", Densuke replied. \"It only happens around really pretty girls like you.\" <br>\r\n<br>\r\nChiharu's face went pink at this statement, and she decided to get up, which was more difficult then it sounds. When she finally got back on her feet, her panties split right in two. Her face only got redder because of this. She tried to cover up, but her clothes could barely fit normally. Luckily, her flab covered her enough for it to be concealed. <br>\r\n<br>\r\nEven though she looked really embarrassed (between her panties tearing, her belching, and her fat ass breaking the chair), Densuke brought her over to the couch, made sure she laid down on it, put a blanket over her belly, and started to rub it slowly. It was so soft and smooth....Chiharu closed her eyes and smiled. \"Thank you, Mifune-kun...you've made today the best day ever.\" She smiled. \"No, it was you who made today the best day ever.\" Densuke said. He then kissed Chiharu on the lips, and Chiharu slowly drifted off to sleep, bloated and happy. <br>\r\n<br>\r\nWhen she woke up, she found...</span></div></div>",
            "created":1216702800,
            "id":558933,
            "title":"Chiharu's chair gave in!"
        },
        "121221121111112122":{
            "choices":[
                "Yuriko was playing with her belly!",
                "She was late for school!"
            ],
            "content":"<div class=\"\"><div> <span>In an unexpected instant, Chiharu's panties, which were probably 3 sizes too small by now, snapped off her vividly round body, lashing Densuke right in the left cheek.<br>\r\n<br>\r\n\"Oh! Densuke, I'm so sorry-!\" Chiharu blurted out as her face beamed a bright pink, \"I think I need bigger clothes...\"<br>\r\n<br>\r\nDensuke ran to Chiharu's room to get her something to put on. It seemed the only clothing that might fit was an XXXXL skirt that was from the mall (for some reason, that was the smallest they came in), and the top part of her new bikini. He ran back to the dining room and handed Chiharu her skimpy new clothing. Chiharu, still visibly feeling the effects of her epic meal, strained herself to stand up. After she putting on her tiny little garments, she noticed that her bikini was holding on for dear life to contain her enormous bosom, and half her bottom was hanging out of her snug little miniskirt(although microskirt would be a better term for it). Looking in the mirror nearby, her suspicions were confirmed. She was huge! But, stroking her soft, voluptous body turned this discovery into one of the good sort. Of course, the after-effects of the colossal meal took it's toll, and Densuke had to bring her bed to her, since her room was clearly too far for her to walk in the alotted time. She gently went into slumber, smiling as she stroked her big, firm belly, which was still in the process of digesting her little food binge. Densuke softly kissed her on the cheek, turned out the light, and closed the door.<br>\r\n<br>\r\nWhen she woke up the next morning...</span></div></div>",
            "created":1195448400,
            "id":466399,
            "title":"Nap-Time"
        },
        "1212211211111121221":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Densuke stopping by to see how Chiharu was feeling",
                "Keiko with a huge table full of fattening breakfast foods"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu slowly opened her eyes to hear some giggling, and the feeling of her belly being squished and played with. Chiharu went red at what she woke up to. Yuriko was licking, kissing, and playing with her now very soft belly. \"What are you doing?!\" Chiharu said in embarrassment. \"Mmm Chiharu, you really let yourself go! You need to go on a diet!\" Yuriko teasingly scolded. \"Well for your information, I'll never go on a diet! Mifune-kun likes me this way.\" Chiharu pouted. For once, Densuke was showing off his true feeling for her without fear of rejection, and this made Chiharu overjoyed with excitement. \"And if that's what it takes for Mifune-kun to like me, then so be it! At least I won't worry about him ever falling for a tiny little girl like you!\" Chiharu was really mad at Yuriko, and wasn't taking it this time. Yuriko cowered in fear, while Chiharu's huge body was towering over her; obscuring Yuriko's view to only seeing Chiharu's belly fat and large breasts. \"Now get out of my room, and get out of my life!\" Chiharu screamed.<br>\r\n<br>\r\nYuriko cowered easily and ran out of the room like a startled cat. Chiharu let out a sigh of relief. She'd been wanting to say that to her ever since Densuke came into her life. \"Maybe all of this fat is making me more confident.\" Chiharu said to herself. She then started to examine herself in the mirror. Her miniskirt was so tight that her flabby love handles oozed over the strap. She undid the skirt, and looked through the new clothes Densuke bought her. She shuffled through a lot of them until she came across a huge pair of pants she considered to be very loose, but in fact, were very snug on her flabby legs and thunder thighs. It was so snug, in fact, that Chiharu formed a massive muffin top, much to her delight. Her top, however, could only cover her breasts, leaving her big fat belly fully exposed, and wobbling with every step. This made Chiharu have a very bright smile. <br>\r\n<br>\r\nChiharu bent down (not afraid of ripping any clothing), and found a working scale from underneath her bed. She was too curious not to look. When she got on the scale, she heard the needle wobbling until it stopped. She looked down, and saw nothing but her enormous breasts and delicious belly fat. She grabbed her fat and jiggled it in her hands. She was so proud of herself, and she's only been awake for about 10 minutes!  When she opened the door to leave, she found...</span></div></div>",
            "created":1216789200,
            "id":559346,
            "title":"Nothing changes, while everything changes..."
        },
        "12122112111111212211":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "An All-you-can-eat Buffet",
                "A diner with some very fattening meals"
            ],
            "content":"<div class=\"\"><div> <span>\"Chiharu, how are you feeling? Better then last night, I hope.\" Densuke said to her, holding back a nosebleed from her choice of wardrobe. \"Oh, Mifune-kun, I feel great! Thank you for changing my life for the better.\" Densuke held out his arms, ready to embrace her. Chiharu fell slowly forward so Densuke could catch her, but didn't realize how fat she really was. Chiharu's colossal figure sent them both tumbling to the floor, but with Chiharu on top of Densuke. \"Shinonome-San...please sit up...you're crushing me...\" Densuke groaned while getting a face full of flab. Chiharu sat up immeadiately, hugging Densuke, with a look of concern on her face. \"Are you ok? Please tell me my fat didn't hurt you!\" Chiharu was so worried she looked like she could burst into tears at any second. \"I'm fine.\" Densuke replied. \"I'm just glad you're ok.\" Densuke helped up Chiharu, and was going to take her out for breakfast.<br>\r\n<br>\r\nWhile Chiharu was waddling around Zahono with Densuke, she felt more confident then ever. She felt round, warm, and soft; but best of all she felt safe. She told Densuke of what happened earlier this morning, and Densuke couldn't have been more delighted. He gave Chiharu a big hug and told her that he was very proud of her, while squeezing her love handles, which made Chiharu blush. The tender moment was interrupted by a large growling sound. It was so violent it sounded like an angry bear. Chiharu hid behind Densuke in fear, making her fat belly rub up against his back, until she realized it was just her stomach. She blushed with embarrassment. \"I guess I'm hungrier then I thought..\" Chiharu mumbled. \"Well, where are we going, anyway?\" </span></div></div>",
            "created":1216789200,
            "id":559374,
            "title":"Densuke stopping by to see how Chiharu was feeling"
        },
        "12122112111111212212":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Chiharu's lost book",
                "A Bouquet and Roses"
            ],
            "content":"<div class=\"\"><div> <span>\"Good morning Chiharu!\" Keiko said. \"Are you hungry? I made a breakfast for the whole family, but it looks like Yuriko took everyone out for breakfast already. I don't want this to all go to waste...\" The table was stocked with every fattening breakfast food Chiharu could imagine. Chiharu's fat belly started to growl. A smile flashed across Chiharu's face. She waddled to the table as fast as her fat legs could carry her, and immeadiately started to dig in.<br>\r\n<br>\r\n She scarfed down pancakes and waffles within seconds, following it with a huge glass of Orange Juice. From Hash Browns to French Toast, Chiharu finished everything on the table. Her shirt split right in half, making it resemble a vest. Even her skirt and panties tore open, leaving her naked, rubbing her huge drum-tight belly. \"Oooh....\" Chiharu moaned. She then let out a very loud burp, bringing Keiko's attention back to her huge daughter. \"What a big eater you are!\" Keiko said with a smile. She then opened her eyes to see that Chiharu was pretty much naked. \"Oh my! You need some new clothes! Let me go upstairs and get some of my maternity clothes for you.\" Chiharu smiled and said \"Thanks, mom.\" <br>\r\n<br>\r\nWhen Keiko went upstairs, there was a knock on the door. \"Hey Shinonme-san? It's me, Densuke. Are you there?\" Chiharu's face went pink. \"He can't come in right now! I'm naked!\" Chiharu thought. \"Hold on, Mifune-Kun! I'm getting dressed!\" she called out. Keiko just then came down with some large clothes. \"You can use these! I used them when I was pregnant with your little brother and sister.\" Kieko said. \"Thanks mom.\" Chiharu replied. She put the clothes on quickly. They were loose fitting, but knowing Chiharu's new appetite, it wouldn't be for long. \"Alright Mifune-Kun, you can come in!\" Chiharu called. When Densuke opened the door, he was carrying...</span></div></div>",
            "created":1226466000,
            "id":606938,
            "title":"A Breakfast to remember"
        },
        "1212211211111121222":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Other girls started making fun of Chiharu",
                "Chiharu couldn't fit in the desk!"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu woke up to the sound of a door slamming, which was Yuriko leaving for school. Chiharu sat up, stretched, and looked at her clock. That definitely got her attention. \"Oh no! I'm running late!\" Chiharu said with a sound of panic to her voice. She quickly got up, changed into her uniform. The only problem was, was that it was way too small for her. Her shirt would ride up, leaving her now very fat belly exposed. Her skirt was so tight that it would probably tear if she was any bigger. Her ass had gotten so fat that the skirt didn't even try to hide it, exposing her tiny teddy bear panties. And even though she had no time to shower or get ready, her hair still looked well taken care of and neat. Getting her books together, she grabbed a banana from the kitchen and waddled out the door.<br>\r\n<br>\r\nWhile walking to school and eating the Banana, she looked down to examine her body. \"Wow...I've gotten so big..\" she thought while sucking on the banana. She squeezed her huge belly out of curiosity, which made her instantly blush. \"Oh my. It's so soft....I hope Densuke likes how big I've gotten.\" she thought with a smile. She was so busy feeling up her belly to notice Densuke was walking right towards her! <br>\r\n<br>\r\nChiharu quickly finishes the banana and tries to lower her shirt in embarassment, but immeadiately started to ride up within seconds. \"Shinonome-San! How are you? Are you feeling better?\" he asked. Chiharu nodded. \"Thank you for helping me last night, Mifune-Kun.\" Chiharu said with a big smile and then give Densuke a big hug. Chiharu's soft belly pressed against Densuke's, which made his face go completely red. \"You're the best guy ever.\" Chiharu and Densuke walked to school holding hands. When they made it to class...<br>\r\n<br>\r\n</span></div></div>",
            "created":1226466000,
            "id":606927,
            "title":"She was late for school!"
        },
        "123":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "she gains 50 lbs",
                "she gains 100 lbs"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu was walking to her next class when she noticed a red vial on the ground. She picks it up, and stares at it  with a puzzled look on her face. Chiharu then takes to cork off of it, and smells the vial. \"Wow, it smells great!\" She says to herself. She looks around to see if anyone's looking, and then takes a sip of it. Just then...</span></div></div>",
            "created":1169355600,
            "id":375553,
            "title":"Strange Elixir?"
        },
        "1231":{
            "author_id":"jedislayer",
            "author_name":"jedislayer",
            "choices":[
                "Ran to the club to change clothes",
                "Took another sip of that red liquid"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu suddenly started to feel very strange.  Her entire body was tingling all over.  The tingling quickly became a very warm and very pleasing sensation, making Chiharu give a slight moan of pleasure.  It was then that she noticed what was happening to her body.<br>\r\n<br>\r\nHer breasts were visibly enlarging.  With each breath she took, they seemed to swell about an inch larger.  Then Chiharu noticed the same feeling all over the rest of her body.  Her butt was slowly expanding, riding up her skirt, revealing her teddy bear panties.  Her thighs were beginning to thicken, filling up with fat.  All of her body was slowly, but very pleasantly, fattening up.<br>\r\n<br>\r\nAfter about a minute, it was over.  Chiharu looked herself over.  She had gained about 50 pounds in a minute.  Most of the weight had gone to her already huge breasts, which had added about 30 pounds, an even 15 each.  Incidentally, this made her bigger than Komoe, and now the biggest breasted girl in the Eiken club.  There were about 10 pounds added to her beautiful backside, and another 10 pounds distributed evenly over the rest of her body.  <br>\r\n<br>\r\n'This is strange,' Chiharu thought.  'How could a person gain so much weight so fast?  Stranger still, why in the world did it feel so good?'  While Chiharu pondered these thoughts, she hardly noticed just how tight all her clothes had become.  The only thing she really noticed was that her bra had snapped off, unable to contain her giant boobies.  When she DID notice, she.....</span></div></div>",
            "created":1169355600,
            "id":375561,
            "title":"A strange sensation"
        },
        "12311":{
            "author_id":"jedislayer",
            "author_name":"jedislayer",
            "choices":[
                "Drink every bottle in the fridge",
                "Wait for Densuke to come back from school"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu figured that she couldn't very well continue the day in skin tight clothes that were bursting at the seams, so she headed back to the Eiken clubhouse to grab a quick change of clothes.  While she ran, she noticed that all of her body was jiggling visibly.  It wasn't just her breasts anymore.  Oddly, though, it felt really good.  Chiharu was really confused now.  She had always hated the idea of being fat, but now that she had a little extra fat on her body, she found that she rather enjoyed it.  <br>\r\n<br>\r\nAll this thinking was a little distracting for Chiharu, however, and she almost missed the Eiken clubhouse.  When she went inside, she was greeted by Kirika, the purple haired leader of the club.  But something seemed different about her.  She seemed.....bigger.  Her breasts were a little bigger than usual, slightly oozing out of her top, and her butt had gotten bigger too, pushing her already insufficient skirt up to the point where her lack of panties was more than obvious.  And she had a slight bulge in her belly region.  All in all, Kirika looked as if she'd gain about 35 pounds since Chiharu had last seen her, which was only two days ago.<br>\r\n<br>\r\nAs usual, Kirika had a chocolate banana jammed in her mouth.  She was always stuffing her face with something; it was a wonder she hadn't gained 100 pounds just from eating those things all the time.  But that never seemed to stop her from speaking very clearly, almost as if she had a second throat.<br>\r\n<br>\r\n\"Hi Chiharu, good to see ya.  If you're thirsty, we just got a jumbo case of some new type of drink.  It's some thick red stuff in these huge bottles.  They're all in the mega fridge downstairs, if your'e interested.\"<br>\r\n<br>\r\n\"Thanks, Kirika.  I am a little thirsty after running over here.\"  Kirika hadn't even noticed that Chiharu had gained any weight, as she was too preoccupied with the treat in her own mouth.  Chiharu proceeded to the basement to see what was in the fridge down there.  When she opened the door, she nearly fainted.  There in front of her, were about 50 industrial sized bottles of the very elixir that had made her gain those first 50 pounds.  Chiharu instantly thought of the pleasure that the gaining had brought her, and wondered if she dared to seek more.  But what would Densuke think?  Would he like her if she were fat?  Only one way to find out at this point...... </span></div></div>",
            "created":1169355600,
            "id":375572,
            "title":"THE MOTHERLOAD!!!"
        },
        "12312":{
            "author_id":"feorath",
            "author_name":"Feorath",
            "choices":[
                "Densuke",
                "The club"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu liked her new, bigger self. It had felt so good to grow the first time that she wanted to do it again. So she took another sip of the red liquid. The pleasurable sensation swept over her once again. Her breasts swelled even more, each putting on another 15 pounds. Her now very fat ass pushed up her skirt and turned her teddy bear panties into a complete thong. She slapped it experimentally and watched it jiggle with glee. Her hands went wild exploring her new body. She wanted to show her new self off to...</span></div></div>",
            "created":1221368400,
            "id":581950,
            "title":"Even bigger"
        },
        "1232":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Borrow Clothes from Kirika",
                "Go shop for bigger clothes"
            ],
            "content":"<div class=\"\"><div> <span>She had just plumped up 100 lbs almost instantly. She looked at herself, and gave a sigh of relief. \"At least it wasn't all in my breasts.\" she said. Chiharu was examining her body. Her shirt now rided up over her belly, revealing the oozing fat falling out of her skirt. She felt it, and let out a moan. Apparently, her breasts weren't the only sensitive part of her body. Her ass had also gotten bigger, making her once-fit teddy bear panties into a revealing thong. Her arms, thighs, and legs had also gotten quite flabby, making her clothes very tight. She squealed with delight, loving how soft she had gotten! Chiharu already loved her large breasts, but never thought being heavy would feel so amazing! She picked up the vial and stuffed it in her clevage, which was larger then it ever was before. After playing with her love handles, she realized that her clothes no longer fit. She needed new clothes! She then decided to... </span></div></div>",
            "created":1169355600,
            "id":375566,
            "title":"Fat Fun"
        },
        "12321":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Maybe a few couldn't hurt...",
                "No. I need to find some clothes!"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu waddled as fast as she could to the Eiken Clubhouse, with every guy getting a nosebleed that she passed by, and getting jealous glares from every girl that didn't have breasts like hers. Chiharu felt so embarassed running around in tattered clothes with her giant breasts and curvy body jiggling with every movement. She cursed the fact that the Eiken Club was so far away. As far as she knew, Kirika lived at the Eiken house, along with Teacher and Komoe. She finally made it to the Eiken club house, breasts wobbling and out of breath. She went in the house, searching for Kirika. She was looking around for her when she found what would probably resemble Kirka's bedroom.<br>\r\n<br>\r\nThe room had a closet, a fridge, and a very girly queen-size bed, which made Chiharu giggle, since it was very unlike Kirika to own something girly. Chiharu opened the fridge doors to reveal it was filled with chocolate-covered bananas. They looked so delicious that Chiharu started to drool. Chiharu started to reach for one...</span></div></div>",
            "created":1226466000,
            "id":606950,
            "title":"Borrow Clothes from Kirika"
        },
        "13":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "talk to Kirika",
                "The Fridge"
            ],
            "content":"<div class=\"\"><div> <span>Yuriko was walking around when she saw Densuke flirting with Chiharu again. She groaned and said: \"What does he see in her that I don't got?\" Yuriko looked down at her chest and realized it. Breasts! Densuke liked Chiharu because of her breasts! \"But how do i get breasts like Chiharu's?\" Yuriko asked herself. She looked around, and noticed Kirika sucking on another chocolate-covered banana. \"She does eat a lot, and she's huge. I got it! To get big breasts, I need to eat a lot! Then Densuke will love me, instead of Chiharu!\" She thought. Yuriko runs off to...</span></div></div>",
            "created":1169355600,
            "id":375557,
            "title":"The jealous sister"
        },
        "132":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "The weight shifted to the rest of her body",
                "Her clothes ripped"
            ],
            "content":"<div class=\"\"><div> <span>Yuriko walked to the fridge, and took out everything she could find that was even remotely fattening. She then walked off with all the food in her hands, leaving only puzzled looks from everyone behind. <br>\r\nShe was walking to the town food court, thinking about the results of her stuffing. She drooled imagining two extremely large breasts bulging out of her sweater. \"Chiharu would be so jealous!\" Yuriko snickered with a grin on her face. When she got a seat, she plopped her flat butt down on the chair, and immeadiately started to stuff herself crazy with every fattening food that she stole from the Eiken Club Fridge. Girls were looking at her and snickering. \"Who let the Hippo out of it's cage?\" One girls said while laughing. Yuriko ignored her while still stuffing. When it was all over, Yuriko just sat back in the chair, rubbing her swollen stomach. She had fallen asleep in the chair almost instantly. When she came to...</span></div></div>",
            "created":1169355600,
            "id":375636,
            "title":"Yuriko's plan."
        },
        "1321":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "buy bigger clothes!\"",
                "get more food!\""
            ],
            "content":"<div class=\"\"><div> <span>Yuriko looked down, and only saw two large breasts. \"Wow! It really worked! I can't believe it!\" Yuriko said while cupping her new large mounds. Her mind was just playing tricks on her. In reality, she did go from a A cup to a B, making her bra quite tight. But most of her weight had shifted to her stomach, which was now a large, soft belly. Her new gut made her shirt ride up, exposing her belly. Yuriko groaned in pain, realizing her bra was way too tight for her boobs. She put her pudgy hands behind her back, which had formed new rolls, along with her belly, and undid the strap. She managed to remove the bra successfully. \"They're big, but not as big as Chiharu's! And I need to be bigger then her!\" she said to herself. \"After all this, I need to...</span></div></div>",
            "created":1169442000,
            "id":375845,
            "title":"Mind Games"
        },
        "13211":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "It fit perfectly!",
                "It was way too tight!"
            ],
            "content":"<div class=\"\"><div> <span>Yuriko got up from out of her seat (which is quite difficult since her butt had become much larger. If it was any bigger, she'd be stuck in the seat! She decided to get a bigger top to fit her new body. \"When these get even bigger, I'm definitely showing them off!\" She said while waddling to the nearest clothing store. When she made it there, she needed to stop and catch her breath. \"I don't know how Chiharu does it!\" Yuriko said to herself between breaths. When she made it into the store, she tried on one-pieces that would fit her. When she looked in the mirror...</span></div></div>",
            "created":1169442000,
            "id":375916,
            "title":"Waddling to the Store"
        },
        "132112":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "To the Beach",
                "To the Eiken Clubhouse"
            ],
            "content":"<div class=\"\"><div> <span>It was straining to stay on Yuriko, causing her a lot of pain. \"Uugh! This must be too small for my boobs!\" she said to herself. She managed to peel the one-piece off of herself, and was examining herself naked in the Dressing Room Mirror. Yuriko still saw herself as quite busty, even though the weight was more in her gut then anywhere else. She decided that maybe a two-piece would be better. When she put it on, it fit her perfectly! She was looking at herself again in the mirror, cupping her breasts. \"If I keep up with this, Mikitio and Chiharu will look flat-chested compared to me!\" Yuriko declared proudly. She decided to buy that, and an outfit with the same measurements. She wore the outfit out of the store after purchasing it. The top didn't exactly fit properly, so it rode up over her big fat gut. Yuriko decided to go...</span></div></div>",
            "created":1170133200,
            "id":377890,
            "title":"Adjustment"
        },
        "1321121":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "A pie-eating contest",
                "Densuke and Chiharu"
            ],
            "content":"<div class=\"\"><div> <span>She felt like showing off her new body, which she was having no problem doing. While waddling to the beach, a lot of guys were checking her out. This made her blush. She never got this kind of attention from guys before! This made her want to get even bigger. When she made it to the beach, she immediately changed into her bikini, which was feeling tight in the bottom. Her butt had gotten bigger and wider since her last binge. She was walking around the beach, wiggling her big ass around. Her voluptuous body caused a guy to stop paying attention to his volleyball game, making him get hit in the face with the ball. Yuriko giggled and winked at him. This caused his nose to bleed. While she waddled around the beach, she saw...</span></div></div>",
            "created":1170133200,
            "id":377891,
            "title":"Showing off"
        },
        "13211211":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "One the contest hands down.",
                "Found someone else at the contest could keep up with her gluttony."
            ],
            "content":"<div class=\"\"><div> <span>Yuriko noticed a sign advertising pie eating contest taking place on the beach and was instantly intrigued. She quickly signed up, the rules were simple whoever could eat the most pies won. Yuriko thought this would be a great way to pack on more pounds. She took her seat long table holding all the other contestants and a piping hot cherry pie was placed in front of her.<br>\r\n\"Ready ladies and gentlemen.\" The contest runner said. \"Begin!\"<br>\r\nYuriko immediately started taking into her pie polishing off her first pastry before anyone else and having it quickly replaced with another. <br>\r\n<br>\r\nYuriko gorged herself and...</span></div></div>",
            "created":1407700200,
            "id":1839812,
            "title":"A pie-eating contest"
        },
        "132112112":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Someone she knew.",
                "A original character."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it someone she knew?</span></div></span></div>",
            "created":1407733380,
            "id":1840016,
            "title":"Found someone else at the contest could keep up..."
        },
        "1321121121":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Kirika.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Yuriko ate pie after pie more of the competition got full and dropped out. Soon it was down to her and another girl.<br>\r\n<br>\r\nWho was it?</span></div></span></div>",
            "created":1409204280,
            "id":1848389,
            "title":"Someone she knew."
        },
        "13211212":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "A strange red vial",
                "A business card"
            ],
            "content":"<div class=\"\"><div> <span>She saw Densuke, and grinned. \"This is my chance to win him over!\" Yuriko snickered. She waddled over to him, sticking her chest out, and said: \"Hey, Densuke.\" Densuke stared at her gut, and replied: \"Uh..hey, Yuriko.\" <br>\r\n\"You like what you see?\"<br>\r\n\"What?\"<br>\r\n\"I've gotten bigger. You like?\"<br>\r\n\"Uh...\"<br>\r\n\"What? Am I not big enough for you?\"<br>\r\n\"Um...sure. That's it.\"<br>\r\n\"Well then, I'll get as big as I can, just for you!\" Yuriko waddled off in anger, and sadness.<br>\r\nChiharu sat up, and asked: \"Densuke, what was that?\" Densuke replied: \"Yuriko's gotten really...fat. I don't think she knows, and I don't have the heart to tell her.\" Chiharu giggled.<br>\r\n<br>\r\nYuriko was mumbling angrily to herself with tears in her eyes. \"He doesn't think I'm big. Well, I'll get as big as I can!\" Just then, Yuriko saw...</span></div></div>",
            "created":1170133200,
            "id":377893,
            "title":"Confrontation"
        },
        "132112122":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "\"There's no way I'm missing this!\"",
                "\"This has gotta be a practical joke.\""
            ],
            "content":"<div class=\"\"><div> <span>\"What's this?\" Yuriko said. She picked up the card, and it read: \"Looking to gain weight, but have a slow metabolism? Then meet me in the warehouse in town square. I can help you achieve your dream!\" Yuriko was surprised. She thought about it, and came to a decision.</span></div></div>",
            "created":1170133200,
            "id":377943,
            "title":"Opportunity"
        },
        "1321121221":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "50 lbs",
                "100 lbs"
            ],
            "content":"<div class=\"\"><div> <span>Yuriko squealed with excitement and waddled as fast as she could to the warehouse, stopping after each street to catch her breath. When she made it there, she couldn't contain her excitement. She went into the warehouse. The place was dark and looked abandoned. \"Hello? I'm here to gain weight. I saw the card. Hello?\" Yuriko called. \"Good. It is good to see you.\" the shadowy figure replied. The figure came out of the shadows, revealing itself to be Kyoko of the Eiken Club. \"Kyoko? Why do you want to gain weight?\" Yuriko said.<br>\r\n\"Because I'm jealous of all the Eiken girls! They all have big curvy bodies! I want one like theirs! Then i discovered that gaining weight helps breasts grow bigger.\"<br>\r\n\"That's what I'm doing! I'm jealous that Chiharu has Densuke, so I'm gaining weight to be bigger then her, and win Densuke over!\"<br>\r\n\"Interesting. Well, I created a formula that increases the weight of the user tenfold!\"<br>\r\n\"Wow! May I see? Please?\"<br>\r\n\"Alright. Keep your skirt on.\" Kyoko unveiled her new formula. It was a flesh-colored goo in a vial. Yuriko snatched the vial from out of Kyoko's hand, and was about to drink it. \"Careful! It works too well, and if you drink the whole thing in one gulp, you will become immobile.\" Kyoko warned. Yuriko nodded and took a sip. As soon as she sipped it, Yuriko gained...</span></div></div>",
            "created":1170133200,
            "id":377949,
            "title":"Discovery"
        },
        "14":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Kohana",
                "Lin",
                "Komoe",
                "Teacher",
                "Miharu"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We'll give you choices.</span></div></span></div>",
            "created":1169355600,
            "id":375568,
            "title":"Pick some more"
        },
        "141":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Her Skirt ripped",
                "Densuke came down"
            ],
            "content":"<div class=\"\"><div> <span>Kohana was working on her homework, when her belly started to growl. She slapped her washboard stomach, and said: \"Sssh! You'll wake up brother!\" She glanced over at Densuke, who was drooling and mumbling something about Chiharu. What else is new? Gotta focus, she thought to herself. But her belly was growling. She felt like she hadn't eaten in 3 months. \"Alright, just a quick snack, then back to studying!\" she said. She had tiptoed down the stairs, and opened the fridge. So many goodies to choose from! \"I can't decide! Oh well, I'll just have them all!\" Kohana said with a smile on her face. She started to empty all the fattening goodies that lay before her. She then started to eat everything. She loved how yummy they tasted! Within 10 minutes, Kohana was lying on the floor, motionless. She now had a large potbelly. She was rubbing it when...</span></div></div>",
            "created":1169355600,
            "id":375596,
            "title":"Going overboard"
        },
        "1412":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Yuriko tackled her",
                "Kyoko's robot landed in front of her"
            ],
            "content":"<div class=\"\"><div> <span>\"Sister? Are you alright? I heard a noise.\" Densuke called. Oh crap, it's Brother!, Kohana thought. I've got to leave before he sees me like this! Densuke was walking down the stairs, when Kohana managed to get her shoes on. She was one foot from the door when he came down. \"Are you alright? How's this mess happen?\" Densuke said while pointing to the floor. \"Uh...I'm not sure. But I'll see you later, brother. I'm gonna go and hang out with my friends.\" she replied. \"Alright, but remember to be back by sundown!\" Densuke called while Kohana was running away. <br>\r\n<br>\r\nWhile Kohana was walking around town, she was getting looks from boys in her class, that she wasn't used to getting. It was like the look that Yuriko gave Densuke. Do they think I'm hot?, Kohana thought to herself. She then looked down at her swollen gut, which was giving her more pain. She was rubbing it, while looking around. All of a sudden...</span></div></div>",
            "created":1169442000,
            "id":375843,
            "title":"Escape"
        },
        "14121":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "\"Alright.\"",
                "\"No, that seems too weird.\""
            ],
            "content":"<div class=\"\"><div> <span>Yuriko tackled Kohana. Yuriko was kissing her when she noticed Kohana's belly. \"Putting on a little weight, Densuke?\" Oh no, Kohana thought, she must think I'm brother again! \"Uh...kind of, but I'm not brother. I'm his little sister.\" Kohana said while blushing. Yuriko went red as well, and immediately stopped. \"Sorry about that. So...how come you put on weight?\" she asked.<br>\r\n\"Well, I was just hungry, and went a little overboard. It's no big deal. It does hurt though.\"<br>\r\n\"I could imagine. Anything I could do to dull the pain for you?\"<br>\r\n\"Well, you could rub my belly until the pain stops...\"<br>\r\nYuriko looks at Kohana with a strange look on her face, and then says...</span></div></div>",
            "created":1169442000,
            "id":375844,
            "title":"Confusion"
        },
        "143":{
            "author_id":"prancingdeer",
            "author_name":"prancingdeer",
            "choices":[
                "force feeding",
                "over eating",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does it happen?</span></div></span></div>",
            "created":1336245780,
            "id":1330077,
            "title":"Komoe"
        },
        "1431":{
            "author_id":"prancingdeer",
            "author_name":"prancingdeer",
            "choices":[
                "Densuke",
                "Kirika",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does it?</span></div></span></div>",
            "created":1336245960,
            "id":1330080,
            "title":"force feeding"
        },
        "14313":{
            "author_id":"prancingdeer",
            "author_name":"prancingdeer",
            "choices":[
                "chiharu",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does it?</span></div></span></div>",
            "created":1336246020,
            "id":1330081,
            "title":"more"
        },
        "1432":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Komoe decide she doesn't mind and keeps eating how she likes",
                "Komoe tries to go on a diet which backfires",
                "Komoe is encouraged to eat more by someone"
            ],
            "content":"<div class=\"\"><div> <span>Komoe placed her hand on the tiny potbelly she had been gaining over the past couple weeks. Komoe enjoyed large meals and had always been told by her mother that a growing girl needed a lot to eat but now the effects of those meals were showing on her waist. Komoe knew being fat was bad but didn't want to give up eating what she liked either.</span></div></div>",
            "created":1367301780,
            "id":1581489,
            "title":"over eating"
        },
        "14323":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Kirika",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who encourages her to indulge?</span></div></span></div>",
            "created":1393022700,
            "id":1749421,
            "title":"Komoe is encouraged to eat more by someone"
        },
        "143231":{
            "author_id":"bestthe",
            "author_name":"Johnny the Pirate Monkey",
            "choices":[
                "Force Feed Komoe",
                "Have Komoe Cook Too Much and Claim She Can't Finish It All"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Kirika do it?</span></div></span></div>",
            "created":1393336200,
            "id":1751032,
            "title":"Kirika"
        },
        "1433":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "enters a eating contest.",
                "one of Kyoko's experiments",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>other ways for her to pack on the pounds.</span></div></span></div>",
            "created":1342418940,
            "id":1379687,
            "title":"more"
        },
        "144":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Komoe needs her help",
                "Teacher examines herself in the mirror"
            ],
            "content":"<div class=\"\"><div> <span>Teacher was trying to be noticed again in the Eiken Club, but to no avail. She wondered maybe if it was her image that was making her invisible to others. But not even Densuke was paying attention to her, and he usually does! So Teacher's eyes started to well up with tears, and she ran into the basement. She noticed the fridge, and decided to have a snack. \"Maybe some food will wipe my depression away.\" she said between sniffles. Then she noticed something. It was some of Komoe's leftovers. She always makes great cooking, Teacher thought. So she heated it up, and started stuffing herself. She gobbled up the dish within seconds. The calories in Komoe's dish went straight to Teacher's stomach, which was becoming a belly. She then walked back upstairs to do something. She didn't know what, though. But then, something miraculous happened. \"Hey Teacher, I need your help.\" Kyoko called. OMG, Teacher thought. People are paying attention to me now! Maybe it's this weight I've put on. After helping Kyoko...</span></div></div>",
            "created":1169442000,
            "id":375840,
            "title":"Special Dish"
        },
        "1441":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "Her Breasts were larger",
                "She had gained 70 lbs"
            ],
            "content":"<div class=\"\"><div> <span>\"Excuse me, Teacher? Could you help me with my new dish?\" Komoe called over! Teacher was very excited. People were acknowledging my presence!, Teacher thought. \"What do you need help with, Komoe?\" Teacher asked. \"Well, I need someone to taste a sample of it.\" Komoe replied. \"Alright.\" Teacher took a taste of it, and immediately smiled. It was the best thing she ever tasted! \"Komoe! This is amazing! What do you call it?\" Teacher said. \"Well,\" Komoe said, \"I never made a name for it.\" \"I would call it Heaven.\" Teacher said, her eyes welling up with tears of joy. \"I'm gonna leave. I'll see you later, Komoe!\" Teacher walked off into the bathroom, when she noticed something in the mirror.  </span></div></div>",
            "created":1169442000,
            "id":375849,
            "title":"Komoe's New Dish"
        },
        "14411":{
            "choices":[
                "komoes dish",
                "binge"
            ],
            "content":"<div class=\"\"><div> <span>Teacher was amazed by her new figure it was no wonder they were paying attention to her now.  Her Breasts were now at least DD's.  It was amazing but she wondered wether it was the earlier binge or Komoe dish.  Well what ever one it was she had to find out.</span></div></div>",
            "created":1202878800,
            "id":497861,
            "title":"larger Breasts for teacher"
        },
        "14412":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "200",
                "225"
            ],
            "content":"<div class=\"\"><div> <span>Teacher looked at herself in the mirror. She had put on even more weight! Her shirt rode up, being more like a sports bra than an actual shirt. Her now DD-cup breasts were straining in her C-cup bra. Her belly had become big and soft, and jiggled with every step she took. Her butt was larger, and was threatening to rip her panties into shreds. Her face was fuller; close to forming a double chin. Her vision was blurry, so she wasn't sure if what she was looking at was real. So she took off her glasses. She gave herself a double check. It was real! And it seems that her eyes no longer needed glasses either! She was wondering. Is this the reason why people are paying attention to me? Because I've become heavy? Just then, Densuke walked by, and noticed Teacher. \"Hey Teacher, you look great today.\" He said while blushing. Teacher immediately went red. \"Uh...thank you, Densuke.\" she replied softly. She then went into the bathroom to check her weight, when she got on the scale, it read... </span></div></div>",
            "created":1169442000,
            "id":375887,
            "title":"Attention"
        },
        "15":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "A skinny girl",
                "A fat girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of girl is she?</span></div></span></div>",
            "created":1169528400,
            "id":376219,
            "title":"More Choices"
        },
        "151":{
            "choices":[
                "Kirika",
                "Densuke",
                "Another girl"
            ],
            "content":"<div class=\"\"><div> <span>Maxi, or Makoto Monoka, has always dreamed of being in an all girls club. What she didn't expect however is that she would be joining the Eiken club! But then again, she did sorta fill in the quota for being a member. She had nice, long red-orange hair that streaked to her butt, beautiful light blue eyes, and a nice 93cm bust to top it all off. The way she dressed... Well, kinda odd. She'd usually wear an open button-up shirt without an undershirt or a bra. In some way, she was quite like Kirika. The one thing that was REALLY odd about her though was that she always imagined being fat. And not just chubby. Not just stocky. Not even obese! Just full blown fat. But with a pair of giant breasts, a round butt, and a pair of nice, thick thighs, she could still do it... probably.<br>\r\n<br>\r\nThe first day of being at the Eiken club begins and Maxi is just letting her mind drift off again, when she is poked in the chest by none other than Kirika, the Eiken club leader!<br>\r\n<br>\r\n\"Well, hello there! Fancy seeing a new face in the Eiken club! I'm Kirika Misano,nice to meet you! And your name is?\"<br>\r\n<br>\r\n\"Oh, well... My name is Makoto Monoka, but you can just call me Maxi.\"<br>\r\n<br>\r\n\"Ahh, a nickname, huh? That's a funny one, too. Maxi... Well, welcome to the club! Make yourslef at home! OH, and incase you're wondering where your room is, it's in the hallway to the left.\"<br>\r\n<br>\r\n\"Oh, thanks!\"<br>\r\n<br>\r\n\"You're welcome. Oh, by the way, you dropped something.\"<br>\r\n<br>\r\n\"Where? I don't see anything--\"<br>\r\n<br>\r\n\"Gotcha!\" As Maxi bent over to see what was on the ground, she was groped from behind by Kirika! Of course, she had always known that Kirika was a sly fox, plus she had fallen for many tricks beofre, so this was nothing new. In fact, she liked it.<br>\r\n<br>\r\n\"Oh no, you got me!\" Maxi giggled. \"Well, once again, nice seeing you, Miss Kirika.\" And so, Maxi walked off, going to her room.<br>\r\n<br>\r\nAfter a few minutes had passed, Maxi dug through her bag and pulled out some chocolate-covered banana pops, much like the ones Kirika woukd eat, and started eating one, when the door swung open, and in came...</span></div></div>",
            "created":1269666000,
            "id":857345,
            "title":"A skinny girl"
        },
        "1511":{
            "choices":[
                "She heard a scream!",
                "Yuriko popped in, meddling as usual!"
            ],
            "content":"<div class=\"\"><div> <span>Kirika enters the room! Maxi tries to hide her banana pops in her bag and scarf down the one she had in her mouth, but unfortunately, she got caught, redhanded.<br>\r\n<br>\r\n\"Uhhh... This isn't what it looks like...?\" She tried not to completely give herself away, though her voice contradicted from the message she was trying to give. The reaction she got, however, wasn't exactly what she expected.<br>\r\n<br>\r\n\"I didn't know you like chocolate-covered bananas, Maxi.\"<br>\r\n<br>\r\n\"Yes. Yes I do.\" Maxi's face was flushed red with embarassment.<br>\r\n<br>\r\n\"Heh, it seems we have something in common...\"<br>\r\n<br>\r\n\"We like chocolate-covered banana pops?\"<br>\r\n<br>\r\n\"A lot of them, too!\"<br>\r\n<br>\r\n\"Well, this isn't much. I just made a few batches of these before I came here, pretty much for an anytime snack.\"<br>\r\n<br>\r\n\"Well, I got a whole bunch of those. Like, 2 fridgefuls.\"<br>\r\n<br>\r\nMaxi could belive her ears! Two fridges full of chocolate-covered bananas? Sure, she knew Kirika loved to eat banana pops, but to think that she actually had TWO fridgefuls? One fridgeful would've been enough, but two? Maxi's jaw just dropped wide open.<br>\r\n<br>\r\n\"WOW. That... is... a LOT of banana pops.\"<br>\r\n<br>\r\n\"You know what else? I noticed a little something missing in your whole outfit there...\" She pointed to her shirt, which was unbuttoned, but at the same the not completely exposing Maxi's bare breasts.<br>\r\n<br>\r\n\"Uhhh... Heh-heh...\"<br>\r\n<br>\r\n\"What? You think I'm gonna kick you out? Please. I have a bit of secret to tell you.\" Kirika leaned in closer and whispered in Maxi's ear,and Maxi gave Kirika the most freaked out looks ever.<br>\r\n<br>\r\n\"So, what you're saying is... YOU DON'T WEAR--\" Kirika put her hand over Maxi's mouth, trying to keep her quiet.<br>\r\n<br>\r\n\"Hey, hey, if you keep your mouth shut, I'll tell you another secret.\"<br>\r\n<br>\r\n\"...I don't think I want to hear another secret.\"<br>\r\n<br>\r\n\"No, it's nothing like that, it's a good secret. I'll tell you about it later though, alright?\"<br>\r\n<br>\r\n\"Uhhh... Okay...\"<br>\r\n<br>\r\n\"Alright! See ya!\" As Kirika walked out the room, Maxi got back to eating her banana pops, yet at the same time, she was trying not to lose her appetite. She continued to eat, when...<br>\r\n</span></div></div>",
            "created":1269666000,
            "id":857369,
            "title":"Maxi's Awkward Moment"
        },
        "15112":{
            "choices":[
                "50 pops",
                "250 pops!"
            ],
            "content":"<div class=\"\"><div> <span>Alas! The disaster of the Eiken Club, Yuriko, pops in!<br>\r\n<br>\r\n\"Hello there, new girl!\" Yuriko waved. Maxi waved back, swearing under her breath. When Yuriko started to talk, she just talked and talked and talked... No wonder Densuke didn't like her! She was annoying. Then...<br>\r\n<br>\r\n\"WOW! Your breasts are huge! They're almost as big as Chiharu's! Can I touch them?\" Maxi's face flushed, and she stammered, but Yuriko had already struck, and started rubbing her breasts. \"Oh wow... They're so big and natural... If only I had breasts like everyone else here. What's your secret?\"<br>\r\n<br>\r\n\"If you could get your hands off my boobs, I'll tell you!\" Yuriko released her breasts and listened. \"Yes? How do you do it?\" Maxi thought for a second, and simply said \"Banana pops.\"<br>\r\n<br>\r\n\"Banana pops? You mean like the ones Kirika eat?\" Maxi nodded, and she pulled out her big bag of pops and gave one to her. \"Geez, I've never had one of these before but they're SO good! If eating these will get me G-cups, then I'm gonna do it!\" Yuriko took about 50 of the banana pops and dashed off.<br>\r\n<br>\r\n\"Sucker.\" Maxi snickered as Yuriko left. As she continued to eat her pops, nearly an hour had passed and Maxi had eaten...</span></div></div>",
            "created":1271048400,
            "id":866734,
            "title":"Yuriko popped in, meddling as usual!"
        },
        "152":{
            "author_id":"masterem243",
            "author_name":"MatthewPatel",
            "choices":[
                "They noticed Doremi",
                "Doremi went unnoticed"
            ],
            "content":"<div class=\"\"><div> <span>Doremi was walking around town center when she noticed the cutest skinny girl she ever saw. You see, Doremi was bisexual. She is 5'7'', 250 lbs, and loved being fat. She had D cup breasts, a plump bottom, and a very large fat jiggly belly that was constantly exposed. She also loved skinny girls. <br>\r\n<br>\r\nSo she decided to see where this beautiful girl was going. It wasn't hard to find her in a crowd. She had very large breasts and very cute red pigtails. Thankfully, the girl Doremi was following didn't notice her, so she wasn't panicking. Thanks to Doremi's extra weight, she was having trouble keeping up with her. Doremi lost her breath, and had to stop. She saw her enter a small hut on top of a building. She couldn't believe it.<br>\r\n<br>\r\nThe Eiken Club!? Doremi thought. How can a beauty like her belong to that infamous club! She is too perfect for that place! Doremi waddled through the building, and onto the roof, and up to the back of the Eiken Clubhouse. She peered her head into the back window, and was about to watch the scene that ensued. <br>\r\n<br>\r\nShe was there with a boy. He was kinda cute, Doremi thought, but the girl he was with was much cuter! The redhead was walking to the seat and sitting down. \"Why does Yuriko always have to ruin our fun?\" she sighed. \"Well, she's jealous that we always hang out together. I think she wants me or something.\" The boy replied. \"I guess so. What do you feel like doing now? Everyone's busy doing something else.\" the cute girl said while adjusting her skirt. \"I don't know, want to go and get some ice cream, Chiharu?\" He suggested. Doremi sighed. Chiharu! What a beautiful name! Just the sound of it made her a little moist. \"Alright, sounds like fun!\" Chicharu said with a smile. Just as the two left...</span></div></div>",
            "created":1169528400,
            "id":376230,
            "title":"Introducing Doremi!"
        }
    },
    "info":{
        "author_id":"jedislayer",
        "author_name":"jedislayer",
        "brief_description":"The girls of the funny Eiken anime are getting fat!",
        "created":1167252840,
        "description":"<td align=\"left\" class=\"norm\">The girls of Eiken Club are starting to get fat.  You need to help them along.<br>\r\n<br>\r\nThis is a female weight gain story only.  No guys can gain.  No graphic sex, and no gay material, but lesbianism is fine, without the actual sex.  Also, no killing of any characters.   Don't let real limits slow you down, make them as big as you want.<br>\r\n<br>\r\nAbove all, have fun. </td>",
        "id":1194735,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1409204280,
        "modified":1409204280,
        "pretty_title":"Eiken Weight Gain"
    }
}