{
    "chapters":{
        "1":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "The Fox and the Gluttonous Wolf",
                "Little Red Riding Hood and the Big Bad Wolf",
                "The Three little Pigs and the Big Bad Wolf",
                "The Seven Goat Kids and the Big Bad Wolf",
                "a *NEW* and Original story with a Big Bad Wolf"
            ],
            "content":"<div class=\"\"><div> <span>\tOften the whipping boy of literature and lore, the Big Bad Wolf has been made the villain in many different tales and translated in many different languages. He’s terrified little girls, chased a boy who lied, and deceived seven little kids. In every story his motive has always been clear, He’s HUNGRY, Yet every time he goes out to get something to eat, he gets the bone.<br>\r\n<br>\r\n\tWell if history has proven anything, it’s every dog has it’s day, and I believe every wolf deserves his too. So let’s see to it these wolves get all they can eat and more</span></div></div>",
            "created":1295413200,
            "id":1038131,
            "title":"So much to say and do..."
        },
        "11":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "SHEEP FARM!!",
                "HOG LARD RENDERING PLANT!!",
                "DAIRY FARM!!",
                "COOKIE FACTORY!!",
                "*Or... stick with the classics* FARMERS STORAGE SHED!! "
            ],
            "content":"<div class=\"\"><div> <span>Ah the sweet life of a fox in the woods, sleeping all day, hunting mice and voles all night, what more could you possibly need? Unless of course a big fat wolf was taking advantage of your exceptional hunting skills to lounge around and eat all day. lacking the size to fend him off, the big brown mooch seems to be a permanent problem.<br>\r\n<br>\r\nI'm sorry did I say mooch? (sorry, forgot who this was really about...)<br>\r\n<br>\r\nFor the last several months the wolf had been living off the foxes meager meals, first taking advantage of his kindness by feigning a twisted ankle, then just muscling in on any meals he saw fit to eat (ALL of them). Eventually the fox just caught his dinner, then several more small animals to bring back to the lazy brown wolf who was taking up his entire den, SOMETHING had to give. so the fox spent the whole day looking, searching for anything that could help rid him of his \"parasite\"<br>\r\n<br>\r\nthen he happened upon the solution, off in a far corner of the sunny woods, hidden from most of the other woodland residents. \"Thats IT! I'll take him to the...\"</span></div></div>",
            "created":1295413200,
            "id":1038397,
            "title":"The Fox and the Gluttonous Wolf"
        },
        "111":{
            "author_id":"charcat",
            "author_name":"Charcat",
            "choices":[
                "Lead the wolf to the Sheep Farm",
                "Lead the wolf to the Farmer"
            ],
            "content":"<div class=\"\"><div> <span>The fox remembered that down an old, dusty road the humans had made, about a mile from their house, was a sheep farm. He had been there before, though it was a long time ago, before the wolf had started blocking off his meals. He grinned. This would be perfect! If the fox took the wolf to the sheep farm, he wouldn't have to make any more meals for him. There were enough sheep in there to feed a dragon, or something larger! And, if the wolf stuck around, maybe the farmer would catch him! Chuckling softly, the fox started his plan. The next morning, as he was talking, as regular, to the strict wolf, he mentioned the place. The wolf's ears perked up.<br>\r\n   \"A Sheep Farm you say. Hmm... Where is this place?\" He asked, looking extremely hungry. After the fox had told him, the wolf insisted that they go there. The wolf hadn't eaten for a few days, so he was starving. Do you:</span></div></div>",
            "created":1562352540,
            "id":2682533,
            "title":"SHEEP FARM!!"
        },
        "115":{
            "author_id":"noone30004",
            "author_name":"noone",
            "choices":[
                "The fox returns home with devious plots drifting through his head.",
                "His hollow stomach growls, it couldn't hurt to have a little bite.",
                "The Fox scopes out the location a little more."
            ],
            "content":"<div class=\"\"><div> <span>The fox rubbed his paws together gleefully as he plotted in his mind. During his nightly search for enough food to feed himself and his gluttonous wolf \"friend\" he'd found a large storage shed. He stealthily snuck around the premises to assess the situation.<br>\r\n<br>\r\nThe wooden storage shed was larger than the few he'd come across and stood a fair distance away from a similarly large house. Whoever lived here was clearly of good means. He circled around the shed and found that while the front door had a heavy lock on it, there were many smallish windows on the walls of the shed. The fox quietly put his front paws up on the window and peered inside. There was a single lantern hanging from the ceiling illuminating a massive stockpile of foods covering all four walls of the the shed. Covered in sausages and dried meats and ribs and bacon, smoked ham, not to mention overflowing barrels of apples and potatoes and other fruits and vegetables (not that the fox was a fan of those, but waste not want not). Also barrels of wine and water and huge metal jugs of milk. There was more food than the little fox could even comprehend. <br>\r\n<br>\r\nHe inspected the window, and while it was closed, it didn't appear to actually be latched. He carefully wiggled a tiny claw under the window and quietly pried it open. The fox couldn't believe his luck! He dimly wondered why none of the other woodland animals knew about this place, but quickly forgot about it.<br>\r\n<br>\r\nThe fox was entranced and salivating at the sights and smells of the huge bounty set before him, but he had to snap out of it and think of how best to take advantage of the situation. Always in the back of his mind he associated food with his mooching wolf pal, who would always bully the poor fox if he even so much as thought that he had food. All he knew was he had to find a way to turn this situation into a way to get rid of the wolf forever.</span></div></div>",
            "created":1300942800,
            "id":1075469,
            "title":"Farmers Storage Shed!"
        },
        "1151":{
            "author_id":"noone30004",
            "author_name":"noone",
            "choices":[
                "Fox waits and prepares for the Wolf to return that night.",
                "Fox goes back to the shed one last time just to check it out."
            ],
            "content":"<div class=\"\"><div> <span>The fox spent several following nights returning to the shed to get a feel for how best to lay his plans. Every night he returned, the windows were never latched. He had also never seen anyone go out there at night. But every time he returned there was more and more food there, so clearly someone was taking care of the place. He felt reasonably safe returning there.<br>\r\n<br>\r\nAlso during this time, he was decidedly unproductive for his wolf friend. Every day the wolf would come by and boisterously demand food and every time the fox claimed he had none. As the days went by, the wolf got hungrier and hungrier, and more and more desperate. The fox knew the wolf would soon be ready for his plan. This had the unfortunate side effect that the large overbearing wolf got angrier and angrier though, and the fox didn't believe he could handle much more abuse. This would be the day he set his plot into motion.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- -----------------------------------<br>\r\n<br>\r\n\"Wake up, you damn lazy fox!\" the wolf shouted in his usual gruff voice. The fox yawned innocently and blinked awake.<br>\r\n<br>\r\n\"Oh good morning Wolf, what a pleasure to see you. What brings you here this fine morning?\" The fox batted his eyes at the wolf, trying to look as innocent as could be.<br>\r\n<br>\r\n\"You know damn well why I'm here, Fox! For four whole days you haven't gotten a lick of food for us and I think it's high time you started pulling your weight around here!\" The wolf crossed his arms and glared down at the tiny fox. Fox tried very hard not to roll his eyes at his friends understanding of their relationship.<br>\r\n<br>\r\n\"Well it's funny you should mention it my dear friend because I happened to have found the mother-load of all feasts in a storage shed out on the edge of the woods.\" The fox struggled to say it as sweetly as possible without letting a hint of malice soak through. Wolf was already drooling before Fox could finish his sentence.<br>\r\n<br>\r\n\"Uhh, well, you know how dangerous it can be getting involved with civilized folk and uhh...\" The wolf trailed off, he clearly had thoughts of food dancing through his head. His eyes were glazed and unfocused as his stomach gave out a deep growl.<br>\r\n<br>\r\n\"Don't worry my dear friend.\" Fox said as he walked over and patted his friend's soft gut. \"We'll simply sneak in and out like the wind. And besides, you're a big tough guy who can protect us from any danger, right?\" Wolf eventually snapped out of his food soaked reverie.<br>\r\n<br>\r\n\"Of course! I'm the biggest and strongest bastard in the whole damn woods and don't you forget it!\" Wolf bopped Fox on the head pretty hard. Fox started to snarl, but decided to take it in stride and bide his time.<br>\r\n<br>\r\n\"You just come here tonight and I'll lead you out to the shed and we'll have ourselves a grand old dinner.\" Fox smiled up at his friend convincingly.<br>\r\n<br>\r\n\"Will do, old pal. I'll stuff myself 'til I explode!\" Wolf slapped Fox on the back hard enough to make him stumble as he practically danced his way out of Fox's den. Fox halfheartedly waved goodbye.<br>\r\n<br>\r\n\"I'll see you tonight you gluttonous old fool.\"</span></div></div>",
            "created":1300942800,
            "id":1075485,
            "title":"Devious plots drifting through your head"
        },
        "11511":{
            "author_id":"noone30004",
            "author_name":"noone",
            "choices":[
                "you may be right.\"",
                "you've got some room left.\""
            ],
            "content":"<div class=\"\"><div> <span>More than true to his word, Wolf returned to Fox's home at the first sign of darkness. Wolf clearly looked excited and could hardly stand still.<br>\r\n<br>\r\n\"Aren't you ready yet you damn lazy fox! Don't you do anything other than sleep all day!?\" Wolf yelled gruffly at the entrance to Fox's den. Fox stepped out of his home and tried hard to hide his scowl.<br>\r\n<br>\r\n\"Prompt as usual, my dear Wolf.\" Fox's sarcasm was completely lost on the wolf.  Wolf merely stared at him and fidgeted nervously.<br>\r\n<br>\r\n\"So are we going or what? I'm practically starving to death.\" Wolf growled. Fox just sighed and led him out towards the promised farm shed.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- --------------<br>\r\n<br>\r\nAfter a long and insult filled journey, Fox and Wolf eventually arrived at the shed just as night fell. Just as every night before the shed appeared abandoned and the windows unlocked. Wolf excitedly jumped from foot to foot as he waited for Fox to pry open the window, a nervous and hungry ball of energy. Fox barely had time to slip through the window before the heavy wolf practically tackled his way into the shed, his sides brushing against the window frame.<br>\r\n<br>\r\nWolf stood in awe at the bounteous feast set before him and even Fox himself had trouble controlling himself. Eventually they both snapped to their senses and leaped on the nearest delicacy. Fox started to daintily devour a smoked ham with much elation. Wolf on the other hand was gulping down a rope of sausage without hardly chewing. Fox looked over and wondered how the wolf didn't choke as he swallowed large lengths of sausage almost whole. Fox could almost see Wolf's stomach expand as he gorged and Fox quietly smiled to himself.<br>\r\n<br>\r\nFox wasn't even half way through his ham before Wolf slammed down the last in that line of sausages. Wolf then pulled down a rack of ribs almost as tall as Fox and started savagely tearing into it as though it were a fresh kill. By this point Wolf was taking on a subtle but noticeably round appearance. Wolf was always a bit soft, but underneath a layer of fat Fox could see Wolf's belly subtly growing outward. <br>\r\n<br>\r\nFox swallowed down the last chunk of ham just as Wolf was finishing off his ribs. \"I told you it'd be good, right?\" said Fox. Wolf only panted and nodded, now clearly sporting a pot belly. Fox looked down at his own gut too and noticed it was poking out several inches. Fox was always on the skinny side, especially after Wolf started stealing most of his food, so his growth was a bit more noticeable. Fox absentmindedly rubbed his gut as Wolf pulled down a roast turkey and started tearing huge chunks off and swallowing them whole. Fox looked around and pulled himself out a packet of smoked bacon. He never really got to enjoy the flavor of cooked food. Wolf didn't seem to be taking the time to notice anything at all.<br>\r\n<br>\r\nWolf tore of the last hunk of meat from his bird and let out a quiet belch. By now his gut hung almost halfway to the floor and was looking decidedly round. He was starting to look decidedly winded and starting to feel full. He panted for a moment and looked around before pulling out tray of pork chops and started chewing on them. Fox chomped down on the last bit of delicious bacon and took time to appreciate it's rich greasy flavor. He looked over at the wolf and noticed he'd started to slow down to a less manic pace. Fox rubbed his taut swollen gut that now stuck out like he swallowed a football. <br>\r\n<br>\r\nFox slyly crept over to the window and leapt back out of it. It was decidedly harder to make the jump with his swollen gut, but he still made it out fairly easily. He looked around and noticed no one around and it had now progressed into deep darkness outside. He figured they'd been there about an hour, maybe two. The night was young yet. He leaped back inside and as he landed let out a small burp, his gut not quite appreciative of his acrobatics.<br>\r\n<br>\r\n\"What the heck were you doing out there?\" Wolf asked between large bites of pork chop. he'd already managed to polish off four of them and there were still four more remaining.<br>\r\n<br>\r\n\"Just making sure no one has taken notice of us my dear friend. Now eat up while the eating's good.\" Fox smiled. Wolf seemed to nod slightly as he drifted back to finishing off his pork chops. Fox poked around a little until he noticed another string of sausages. Unlike the wolf though, he took the time to eat them slowly as he watched the wolf stuff his gut ever more. <br>\r\n<br>\r\nWolf had slowed down considerably as he slowly plowed through the last of the pork chops. By now Wolf had taken on a decidedly stuffed appearance. His stomach hung down like a large brown furred bowling ball. He had the looked like a very pregnant wolf about to drop a litter of 20 pups. His normally saggy skin was starting to get pulled tight over his swollen gut. As he swallowed the last hunk of dense pork he sat back on his butt and started rubbing his well stuffed belly. It's taut round surface stuck out almost to his knees.<br>\r\n<br>\r\n\"Well Fox, I know this food is great and all but I'm feeling pretty full. Maybe we should  go home for now and come back tomorrow.\" Wolf said. His tongue was lolling out of his mouth as he panted, to full to take deep breaths. Fox swallowed the last of the sausage in his hand and waddled over to the wolf. He eyed the wolf's belly up and down and squeezed and rubbed it as though to test it's fullness. Wolf was too stuffed to complain.<br>\r\n<br>\r\n\"You know what Wolf? I think...</span></div></div>",
            "created":1300942800,
            "id":1075510,
            "title":"Let the gluttony begin"
        },
        "115112":{
            "author_id":"noone30004",
            "author_name":"noone",
            "choices":[
                "you're just thirsty.\"",
                "you may be right this time.\""
            ],
            "content":"<div class=\"\"><div> <span>\"...you've got some room left. And after all, how often do you get to eat like this? Who says this will all be here tomorrow? Surely we'll be locked out then, right? I'm sure you could fit at least a little more in there.\" Fox softly rubbed the wolf's gut as he spoke reassuringly in his ear.<br>\r\n<br>\r\nWolf panted and nodded. \"I suppose you're right, I could go at least a little longer.\" Fox nodded also and stuck a sausage in the wolf's mouth. As wolf slowly chewed on it, Fox pulled out a huge plump roast goose and laid it in front of Wolf. Wolf sighed and dutifully tore into the bird. Fox smiled deviously to himself as he went back to the rest of his sausages and sat down. By now Wolf had slowed down to a more normal pace and Fox and Wolf glutted themselves quietly.<br>\r\n<br>\r\nFox once again decided this was a good time to test his escape rout. He swallowed the last of his sausage and stood up. He had quite a bit harder time standing up because by this point he was starting to feel pretty stuffed himself. His taut round gut looked like someone had inflated a balloon inside him. He looked back at his belly and noticed it stuck out quite a bit to the sides and hung easily halfway to the ground. He waddled over to the window and jumped up too it but his gut got stuck on the windowsill and he had to pull himself over. He landed outside with a hard thump and sat panting to himself for a short while.<br>\r\n<br>\r\n\"I *pant* believe I'm *pant* about done.\" Fox looked around and noticed there was still no sign of anyone around. It was by this point quite dark outside. Fox waited around a bit to enjoy the cool outside air after the hot stuffiness inside the shed. He gathered himself up again and leapt up to the window. Once again his stomach got in the way of a graceful jump and he frantically pulled himself inside, landing hard on his ass again.<br>\r\n<br>\r\nWolf was still sitting in front of a now meatless pile of goose bones. His eyes were half closed and he was panting shallowly. His gut had expanded quite a surprising amount and now stuck out noticeably past his knees. Wolf was gingerly rubbing his bulging gut all over and softly moaning to himself when he heard the fox land back inside.<br>\r\n<br>\r\n\"So *pant* what's it look like *groan* out there now?\" Wolf asked over the loud gurgles coming from his well stretched stomach.<br>\r\n<br>\r\n\"Still all clear. *pant* We should be good for a while yet.\" Fox said quietly. Wolf half nodded and closed his eyes as he slowly fell backwards and landed on his back with a deep thud. His titanic gut jiggled and wobbled a bit from the impact as wolf laid on the ground with his arms and legs spread eagle. His round belly stuck up almost two feet in the air. It was about as wide too, a big round ovoid of brown fur with a white patch going down the middle.<br>\r\n<br>\r\n\"You know Fox, *groan* I think I'm really full this time.\" Wolf said with half lidded eyes. Fox stood up and eyed Wolf's belly suspiciously. He walked over and put his pawns upon it and started to squeeze and rub it again. Wolf, only managed to make a weak groan. Sure enough Wolf's pelt was stretched tight over his mammoth sized gut. Fox mused to himself that he could probably curl up and fit inside Wolf's belly. Fox marveled somewhat as to how his belly sharply curved outward, going from below Wolf's relatively slim chest into a huge round testament to nature's propensity for gluttony. Fox circled around Wolf, poking and prodding his belly as he gave out slight groans of protest. Wolf followed Fox with his eyes but could barely find the stamina to lift his head.<br>\r\n<br>\r\n\"You know what Wolf? I think...</span></div></div>",
            "created":1300942800,
            "id":1075548,
            "title":"Some room left"
        },
        "1151121":{
            "author_id":"noone30004",
            "author_name":"noone",
            "choices":[
                "Wine",
                "Water"
            ],
            "content":"<div class=\"\"><div> <span>you're just thirsty. After all we've been here all night eating succulent but salty meat without even a drop to drink in this sweltering heat. You just need something to wash it down.\" Fox smiled slyly as he patted Wolf's gut.<br>\r\n<br>\r\n\"R-really? *urp* I guess I am pretty thirsty.\" Wolf slovenly licked his lips.<br>\r\n<br>\r\n\"You just wait right here and I'll find you something to drink.\" Wolf just nodded slightly as Fox grabbed a medium sized barrel and carried it over to the Wolf. He set it down next to the Wolf's head. A tap was sticking out of the middle of the barrel on the top.<br>\r\n<br>\r\n\"You ready?\" Fox asked. Wolf made a shallow gulping noise and nodded. The Fox tipped over the barrel so the the spigot on the end was wedged in the wolf's jaws. Wolf was mildly surprised, but was to stuffed and tired and thirsty to protest.<br>\r\n<br>\r\n\"Here it comes.\" Said the Fox, perhaps to excitedly, as he turned the valve on the barrel of...</span></div></div>",
            "created":1300942800,
            "id":1075557,
            "title":"You're just thirsty"
        },
        "11511211":{
            "author_id":"noone30004",
            "author_name":"noone",
            "choices":[
                "He eventually wakes up to see Fox standing in front of him.",
                "He wakes up and there's no one around."
            ],
            "content":"<div class=\"\"><div> <span>Wolf's eyes grew wide for a moment as a wash of oddly flavored liquid flowed into his mouth. Eventually he got over his surprise and started gulping it down. He'd never tasted such a fine liquid before but he knew he enjoyed it. Wolf eventually closed his eyes as he got into the rhythm of swallowing and breathing through his nose.<br>\r\n<br>\r\nFox just smiled and stepped back. He put his ear to the wolf's belly and he could just barely hear the gurgle of liquid entering his gut over the low groans of digestion. Although his stomach didn't grow much larger, it did get much denser as alcohol filled every empty nook in cranny in the wolf's overstuffed gut. Eventually fox could even feel his gut go from a hard packed ball into more of a sloshy water balloon as Wolf started to fill up to the top with wine.<br>\r\n<br>\r\nWolf was starting to notice certain effects too, because in spite of his very significant body mass, almost a gallon of wine was starting to take effect over his senses. It came on subtly at first but soon enough the wolf started to feel giddy and light headed. The soft light of the lamp over head was becoming even fuzzier as the wolf giggled to himself between gulps. He was becoming numb to the previously overwhelming sense of fullness too, even as his stomach was stretched ever more dangerously full.<br>\r\n<br>\r\nSounds became distant and muddled. His eyes drifted upward and he saw the fox standing by his head. He was grinning from ear to ear and rubbing his paws together. Wolf thought he heard Fox laughing and couldn't help but laugh a little himself when he found the breath. He distantly heard fox say something but his vision was drifting back and forth and he couldn't focus on anything. Eventually his eyes drifted closed and he was out like a light.</span></div></div>",
            "created":1300942800,
            "id":1075578,
            "title":"Liqour is quicker."
        },
        "115112111":{
            "author_id":"dannyboy101",
            "author_name":"T-Dag",
            "choices":[
                "Stay here.",
                "Find another place for food."
            ],
            "content":"<div class=\"\"><div> <span>When wolf woke up, Fox was still there in the shed with him. He had a look on his face that was a mix between unsure or dissapointed. Wolf's buzz from the wine had faded, yet he still had a bit of an hangover.<br>\r\n<br>\r\n\"Uggghhhh.....\" Wolf said still a bit groggy.<br>\r\n\"Oh. Good morning, Wolf.\" Fox said.<br>\r\n\"Mo... Morning?\" Wolf said. \"It's already morning?\"<br>\r\n\"You been asleep for hours.\" Fox stated.<br>\r\n\"HOURS?!?\" Wolf shouted. \"THEN WE GOT TO GET OUT OFF HERE.\"<br>\r\n<br>\r\nWolf knew that they had to quickly leave the shed or else the owners of the shed would find then and killed them for eating their food. Wolf got up from the ground and tried to stand up. It was a bit difficult because of his extra weight. Wolf's belly was close to touching the ground, while his entire body has gained an extra layer of fat. After a while, Wolf was able to get up.<br>\r\n<br>\r\n\"Now let's go.\" Wolf said.<br>\r\n\"That... won't be necessary.\" Fox said.<br>\r\n\"Huh?\" Wolf said looking confused.<br>\r\n\"I checked the house nearby and... apparently, the owners of the shed are on vacation.\" Fox said.<br>\r\n\"Vacation?\" Wolf asked.<br>\r\n\"Yes... vacation.\" Fox said.<br>\r\n<br>\r\nFox's original plan to get rid of Wolf was to make him stuff himself silly that he wouldn't be able to deal with the owners of the shed or escape. But his plan went south when the owners decided to... go south for vacation time. Meaning that this whole plan was down the drain. So in order to get rid of Wolf, Fox had to think of a new plan.<br>\r\n<br>\r\n\"Well... if they're not here, then we can stay and help ourselves to some more grub.\" Wolf said feeling peckish.\"<br>\r\n<br>\r\nEven with the food he just ate the other night, Wolf still wanted to eat. This then gave Fox a new idea. It may not be as good idea as his first one, but it could work. If Wolf like to stuff himself so much, then all he need to do was give him that. Stuff him to immobility, so he could never follow Fox again. It was a small plan, but it could work.<br>\r\n<br>\r\n\"Alright. How about we....\" Fox said.</span></div></div>",
            "created":1478101500,
            "id":2231713,
            "title":"Rise an shine."
        },
        "12":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "pretend to play in the flowers and talk to her...",
                "hide in the flowers and jump her (steal her goodies)",
                "hide in the flowers and jump her (eat her and the goodies)",
                "Run ahead and jump her at grannies",
                "(stick with the story) Run ahead and eat granny, then disguise himself as her"
            ],
            "content":"<div class=\"\"><div> <span>One summery afternoon a little girl was wandering through the woods carrying a basket overflowing with junkfood, What's this little girls name? I dunno, she's wearing a red hood so we can call her little red riding hood. Hey! if you wanted character depth and history, you should go read a story that doesn't involve the copious overeating of predators.<br>\r\n<br>\r\nNow as I said the girls name is not important, what is important is the fact that she's alone, and theres someone watching her as she skipped along the path with her basket overflowing with with high calorie goodies. the calm wind blew through the green tree tops and carried various leaves and debris over the dirt path, little red hood giggled as it blew the hair into her face. This same wisp of wind carried her scent to the very sensitive nose of someone quietly watching her. sliding through the trees beside the path, a quiet threat crept just a few paces behind the behooded girl. <br>\r\n<br>\r\nSlinking in a bit closer the Ebony white wolf sniffed slowly and quietly at the trace scent of the girl and her goodies. A slick tongue licked the drool off the wolf's long, fanged muzzle. He grinned at the small clearing full of flowers coming up on the path, and quickly worked out a plan...</span></div></div>",
            "created":1295413200,
            "id":1038438,
            "title":"Little Red Riding Hood and the Big Bad Wolf"
        },
        "122":{
            "author_id":"crossblade",
            "author_name":"crossblade",
            "choices":[
                "She'll feed him woodland critters!",
                "She'll take him to Grandma's for more pastries!",
                "She WANTS to get gobbled up!"
            ],
            "content":"<div class=\"\"><div> <span>He licked his lips, his tummy growling at the sight of that basket of sweets the girl was carrying! In the wild, it was rare to get any cooked goods, especially not pastries… so he didn’t want to waste this opportunity! With seemingly no sense of morals, he just hid in the nearby bushes, waiting for the little girl to pass so he can steal those sweet-smelling pastries right out of her hands!<br>\r\n<br>\r\nWhen she came close… he leaped forward with incredible speed, standing up straight before her! She let out a little squeal, covering her mouth, startled. “A-a wolf?” She stuttered, immediately taking in the sight of the massive figure before her. Eventually, her eyes settle on… his midriff. “Oh my, what a big tummy you have…!”<br>\r\n<br>\r\n“All the better to-” He was about to proudly say his classic line… only to pause, his eyes opening. “Wait!” He looked down with an embarrassed blush, trying to squish his belly down with his paws! It’s not THAT big! It’s just… well, he has been eating a lot recently… perhaps it’s gotten a little round… b-but he’s not fat or anything! “Don’t you know it’s rude to just comment on someone’s weight like that? I should gobble you up for that!”<br>\r\n<br>\r\nHe growled at the little girl, trying to intimidate her… but she wasn’t even looking up at him! Instead, her eyes were locked on his belly… and before he knew it, she was moving forward to wrap her little arms around it, happily giving it a hug! “H-hey! What are you doing? Stop that!” He stuttered, his cheeks red with embarrassment as the young girl cuddled up with his big, soft, warm round tummy.<br>\r\n<br>\r\n“Why are you so grumpy? I’m just giving your tummy a hug! It’s so super soft!” She smiled. Meanwhile, the wolf was just a hair’s breadth away from swallowing this annoying little girl in one gulp! Then we’ll see if she likes his belly so much. His intentions were indicated by his loudly rumbling stomach… but that just seemed to make her giggle. “Oh, you must be so hungry, too! Why don’t you have all these sweets?”<br>\r\n<br>\r\nShe smiled, looking up at him, resting her chin on his gut as she kept hugging it. Realizing she was serious, the wolf paused, all of his anger deflating. “Wait… what?” He said, his eyes widening a bit as he looked down at the basket she’d been carrying. “You’re just… giving me all this food…?”<br>\r\n<br>\r\n“Mhmm! Think of it as a gift!” She smiled, happily.<br>\r\n<br>\r\nThe wolf suddenly felt… a little overwhelmed. Nobody’s ever really treated him this nicely… “Uh… wow. Nobody’s ever given me a gift befor- mph!” Before he knew it, she had shoved a cupcake into his mouth, and he’d swallowed it whole on reflex! He fell flat on his butt, and couldn’t resist as the girl climbed ontop of his belly somewhat to stuff more pastries right into his gullet, force feeding him by surprise!<br>\r\n<br>\r\n“Eat up, Mr Wolf! You’re gonna need a lot of muffins to fill that tummy up!” She giggled as she shoved pastries down the wolf man’s throat. He would resist, but… these pastries were just the most delicious thing he’d ever tasted! Even tastier than children! He cooed, relaxing immediately at the flavor of all of these pastries disappearing past his lips, delighting him with flavors of all kinds.<br>\r\n<br>\r\n“Oooh… ooh…” Soon, he already felt full… but she just kept feeding him and feeding him, making him feel fuller and fuller! Before he knew it, his belly really was getting just as big and round as she imagined it as, growing into a big, round ball of pudge and fluff as she stuffed as much food as possible in there! Eventually, though, all the pastries was packed away into his big, round gut, and he let out a sigh, his tongue hanging out as he breathed. “Ah…”<br>\r\n<br>\r\n“There you go! Wasn’t that just scrumptious?” She smiled, seeming to have had a lot of fun feeding the wolf man all of that food! She slid down, and started to rub that gurgling, digesting tummy all over with her hands, feeling just how squishy it was as all of the food inside sloshed around audibly as she pressed down in various spots with her hands.“I think a nice belly rub should help it go down, hmm?”<br>\r\n<br>\r\n“You know… you’re a weird kid…” The wolf panted, strangely content with this whole deal. “But… thank you…” He was planning on just stealing the pastries, but for some reason, he was content with how this worked out, too. Especially since it seemed the girl had more ideas in mind...</span></div></div>",
            "created":1550280540,
            "id":2618259,
            "title":"hide in the flowers and jump her (steal her goo..."
        },
        "1222":{
            "author_id":"unland445",
            "author_name":"Unland445",
            "choices":[
                "Grandma sat him down for an early dinner",
                "Red begged him to play with her",
                "He tries to keep up his evil persona"
            ],
            "content":"<div class=\"\"><div> <span>\"Are you still hungry, Mr. Wolfy?\" The little girl asked innocently as she continued to massage the big bad wolf's fluffy paunch. The wolfman let out a satisfied burp as Riding Hood's little hands soothed his sore organ and shifted around the air inside. \"My grandma has lots of goodies for you at her house if you want.\" She had just come back from her grandmother's house, and she was sure the elderly women would be willing to give out more treats.<br>\r\n<br>\r\nThe big bad wolf gave out a whine of pleasure as his big tummy glorped and sloshed with the sweet stuff. He didn't think he had ever been so well fed in his life! He was so full...but at the same time, he was never one to turn down the prospect of free food. \"Buh...that be great of ya, kiddo...\" He took a deep breath and slowly got back to his feet, his distended stomach audibly bouncing and heaving in front of the little girl, still rubbing it eagerly. \"Lead the way...\" He rolled out in a food-induced daze.<br>\r\n<br>\r\n\"Hehe, alright!\" The little girl gave the wolf's stomach one last tight squeeze, before turning around to skip merrily along the path back to her grandmother's house. She began to hum a little tune, as the wolf stomped behind her as he cradled his heaving stomach. That had to have been one of the best meals he had ever had in his life. If he had eaten the girl, he would have been placated just as well...but, he would not know the whereabouts of where those sweets had come from. He never realized that not thinking gut first would get his gut more to eat~<br>\r\n<br>\r\nRed Riding Hood and the Big Bad Wold eventually make it to a little house nestled deep into the forest. From the outside, it looked rather serene and traditional, built from some white cedar and whitewashed bricks. Stout windows were placed along the rectangular structure, letting in light and giving the inside a good view of the nice garden the grandmother had. After the little girl had opened up the garden gate so her new friend could come through, he was immediately assaulted with the intense smell of baked goods and candied sweets emanating from the home.<br>\r\n<br>\r\nThe barrage of good scents on his muzzle elicited a gurgle of hunger from his stomach. The Big Bad Wolf blushed as the little girl he followed and threatened to eat giggled and rested her head on the growling ball of flab. \"Naw, you really are hungry! Don't worry, Wolfy, Gramma loves to cook food for people!\". The white and black wolf went red under his fur. How could he had let himself be talked down like this?! He was big, he was bad, he was...!<br>\r\n<br>\r\nA sucker for a good belly rub, apparently. He didn't want to, but the moment Red Riding Hood touched his stomach again, he let out a happy whine. He couldn't help it, it felt so good! He was almost disappointed to have her leave him to skip up to the door, leaving him to follow her as she rang on the bell. After a few moments, the door opened to reveal a kindly looking old women dressed up in a cooking apron. \"Why, if it isn't Red!\" She smiled, giving the girl a pinch on the cheek. \"What are you doing back so soon? I just sent you off with a basket of treats, don't tell me you ate them already?\"<br>\r\n<br>\r\n\"Nope!\" The little girl shook her head in enthusiasm. She pointed back to the big Wolfman climbing up the stairs of her porch, making him freeze up on the spot. \"I gave them all to Mr. Wolfy here! But he's still super hungry, do you have any more for him?\". The elderly women gave the nervous canine a knowing smirk, which made him feel...uneasy.<br>\r\n<br>\r\n\"Well...I'm sure I can scrounge up a few treats for your new friend!\" The sweet old lady smiled, pushing Red Riding Hood into her home gently. \"Do you mind if you give us a moment, dear? Gramma would like a little word with...Mr. Wolfy.\"<br>\r\n<br>\r\n\"Okay!\" The little girl smiled, eagerly hopping inside to play with her grandmother's collection of toys in the nursery. The old women smiled as she disappeared into the house, only for her to turn around to face the wolf with a scowl.<br>\r\n<br>\r\n\"Uh...hello there, ma'am.\" The Big Bad Wolf put up a smile as he made his way toward the grandmother, trying to be polite for once. \"It's good to meet-\"<br>\r\n<br>\r\n\"Cut the crap, Wolfman.\" The old women made the Wolf stop in his tracks as she spoke. \"Don't think I don't know how this story goes out for a second, hear me? I'm gonna make the educated guess that you were looking for more than just baked goods on that path...right?\"<br>\r\n<br>\r\nThe wolf tried to put up an intimidating front, but it fades a soon as it came under the icy gaze of the experienced women. Defeated, he relented. \"...right\".<br>\r\n<br>\r\n\"Right. So, here you are, outside of my house in the forest, where no one would hear me scream if a big, bad wolf would gobble me and my Red up whole.\" The not so kindly old women went on, making the dog in front of her cowering under her speech. \"How do I know you're not going to give in to your more...animal instincts?\"<br>\r\n<br>\r\n\"I-I-I don't wanna eat you...\" The Big Bad Wolf sniveled rather pathetically. \"I-\"<br>\r\n<br>\r\n\"Want Grandma's baked goods in your tummy and my granddaughter to rub it and use it as a pillow.\" The old women smiled, taking a step towards the black and white wolf. Without warning, she took out a chocolate chip cookie from out of her apron pocket and pooped it into his mouth the flavor melting onto his tastebuds in heaven. \"I figured. But I'm not taking in a stray dog, you hear me? My house, my rules.\"<br>\r\n<br>\r\nOn any regular day, the Big Bad Wolf would let out a terrifying roar and gobble up the old grandmother for disrespecting him like that. But, under threat of not getting to have any more of those delicious, amazing baked goods or have his tummy rubbed...he just nodded sadly, knowing fully well how low he had sunk. This was all so embarrassing. The old women smiled more like when she did with her Red and raised her hand to give the big wolf a rub behind the ears, making him whine. \"Good boy. Wipe your feet on that mat when you come in.\" With that, the grandmother walked back into her house, leaving the black and white dog to follow her in.</span></div></div>",
            "created":1551832680,
            "id":2626832,
            "title":"She'll take him to Grandma's for more p..."
        },
        "123":{
            "author_id":"fangfaceth3rd",
            "author_name":"Fangface the 3rd",
            "choices":[
                "ate her along with the rest of the food in her home",
                "winds up being stuffed up by the senile old coot",
                "free choice"
            ],
            "content":"<div class=\"\"><div> <span>The wolf crept into the flowers knowing the brat could not resist picking flowers as he knew kids always did. He waited for his quarry to get near him and she began to wander into the flowers and look for the best and was distracted as a girl like her would. He crept closer and closer and when he was near enough he pounced on her and gulped her down in one bite leaving the basket and the hooded cloak.<br>\r\n<br>\r\nHe patted his now rounded tummy and marveled at how good she tasted. He thought she was lovely but was still hungry so he investigated the basket. Inside was junk food which he had never seen before and tasted one of the samplings and loved it. he tore through wrappers and emptied the basket within minutes leaving the wolf a little wider as his belly drooped a little lower than before with just the girl. His gut was tightly packed and he took a nap to digest his load.<br>\r\n<br>\r\nWhen he awoke he was happy and again hungry. His belly was now a soft ball that hung as he stood up and began to wonder where this girl was going and he soon realized where from an address something. He donned th girls hooded cloak and ran to see this granny. The walk over made the wolf hungrier and hungrier and soon he was at his destination. He knocked on the door and was let in and when he was in he..........................</span></div></div>",
            "created":1305090000,
            "id":1104048,
            "title":"hide in the flowers and jump her (eat her and t..."
        },
        "1231":{
            "author_id":"ider88",
            "author_name":"Ider",
            "choices":[
                "Fell asleep, letting his body digest",
                "Began feeling sick and threw up",
                "Heard someone else coming close to the grandmothers cabin"
            ],
            "content":"<div class=\"\"><div> <span>Looked around, and taking in the interior of the house, before looking at the old grandmother that opened the door for him.<br>\r\n\"OH MY..\" she screamed before the wolf grabbed her by the shoulders and with one *gulp* sent her down into his belly.<br>\r\n\"Ummm\" moan the wolf as he rubbed his bulging stomach. The grandmother inside was struggling and squirming alot, her muffled screams could be heard from inside the wolf.<br>\r\nThe wolf looked around and saw abunch of treats sitting on her table.<br>\r\n\"Might as well\" thought the wolf, and began eating all the food that was layed on the table- cheeses, bacon, bread- he ate so much his belly was hard and even the grandmothers squirms were barley felt as all the food he ate left her withh room to move.<br>\r\nAfter his meal he layed down on grandmothers bed and...</span></div></div>",
            "created":1602167100,
            "id":2917435,
            "title":"ate her along with the rest of the food in her ..."
        },
        "13":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "An Inexpensive bakery",
                "An affordable Pie Factory",
                "A low priced Barbecue Restaurant (ooh... Irony) ",
                "A gingerbread house in a good neighborhood",
                "(stick with the story) a nice old brick cottage"
            ],
            "content":"<div class=\"\"><div> <span>Once upon a time there were three obese little pigs who were too lazy to get a job, so their mom threw them out and they proceeded to go off into the big scary world.<br>\r\n<br>\r\nUpon hearing this the local wolf, a stereotypical scrawny grey mongrel, grabbed his lobster bib and comically over-sized fork and knife, and watched with anticipation from the tree line<br>\r\n<br>\r\nout there they met three people each selling building materials , CHEAP<br>\r\n<br>\r\ntwo of them were scammers, selling two of the fat piggies \"Organic sticks\" and \"thermally efficient straw\"<br>\r\n<br>\r\nthe wolf's tail wagged at the stupidity of these two piggies<br>\r\n<br>\r\nBut the third little piggy struck gold when he purchased...</span></div></div>",
            "created":1295413200,
            "id":1038454,
            "title":"The Three little Pigs and the Big Bad Wolf"
        },
        "14":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "I need to get supplies for my mail order bakery business",
                "I need to get some lingerie so I can get with that ram down the road",
                "I need too buy you kids some more cookies, candies, cakes, chips, and pop",
                "I need to get some health food, you kids are getting really fat",
                "(stick with the story) I'm going to get groceries (lazy...)"
            ],
            "content":"<div class=\"\"><div> <span>deep in the middle of the dark and scary woods a picturesque cottage sat atop a picturesque hill in a picturesque meadow on a picturesque day. (I know right?)<br>\r\n<br>\r\nand frolicking in this picturesque field? no-one, oddly enough, instead the sound of a laugh track came from the cottage, were seven obese little goat kids sat and vegged out, eating junkfood and turning their brains to mush with endless sitcoms and reality shows involving singing out of key and eating gross things one normally wouldn't eat. the fat little goats weren't getting any help from their mother who provided them with all the high calorie garbage they were gorging on.<br>\r\n<br>\r\nmeanwhile peering through the window of the cottage was someone who could have used some of that junk food, a glossy black wolf stared hungrily at the goats as they continued to gorge and pork out.<br>\r\n<br>\r\nsuddenly their mother came from the kitchen \"I'm going into town...\" she grabbed her purse and her shopping bag \"I want you to lock the door while I'm gone, that darn wolf has been creeping around here and theres no doubt he wants to eat you all\"<br>\r\n<br>\r\n\"Hopw long will you be gone?\" the fattest one scratched an itch on the portion of his gut showing under his too small shirt while he feigned interest<br>\r\n<br>\r\n\"A little while, but not too long...\"</span></div></div>",
            "created":1295413200,
            "id":1038487,
            "title":"The Seven Goat Kids and the Big Bad Wolf"
        },
        "143":{
            "author_id":"darkman19",
            "author_name":"guygrower",
            "choices":[
                "In a suit and tie with a gift wrapped box.",
                "Holding a large basket of food.",
                "Running away leaving a myterious box on the porch."
            ],
            "content":"<div class=\"\"><div> <span>As the old mother left the kids cheered and a confused wolf stared in disbelief. The prospect of the kids purposly being fattened up was interesting. The wolf desided to slink back into the shadows for now and observe and plot...<br>\r\n<br>\r\nA fewhours later mother was cooking dinner and the kids eating the recently aquired junk food. The women sang a song of her home land across the seas to pass the time, while she was singing a sneaky stranger was listening to her song.<br>\r\n\"When the house loses a head and the family left for dead,<br>\r\nthen shall I feed the boys that I owwwwwnnnnn...<br>\r\ntill a man comes to give us bread, and many treats for each bed,<br>\r\nthen I will feed him too!\"<br>\r\n<br>\r\nThe wolf understood what the best course of action was for his plan. He came back the following day and knocked right on the front door. A bold move, but for his plan to work he would have to show confedence. The mother goat came and opened the door to see the wolf...</span></div></div>",
            "created":1403655240,
            "id":1817044,
            "title":"I need too buy you kids some more cookies, cand..."
        },
        "144":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "Pizza Delivery...",
                "\"It's your mother, I've got cake and icecream and cookies...\""
            ],
            "content":"<div class=\"\"><div> <span>Ands so, the mother goat kissed them all goodbye, said \"Enjoy your junkfood, cause when I get back, it's diet time... and lock the door behind me, lest you get eaten by some hungry wolf, lord knows we don't want HIM getting fat.\" and left. and so the kids all went about snacking and watching the tv. Suddenly their was a knock on the door... \"Who is it?\" said the oldest through a mouthful of chips.</span></div></div>",
            "created":1341291600,
            "id":1371087,
            "title":"I need to get some health food, you kids are ge..."
        },
        "1441":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "more than his hand caught in the cookie jar...",
                "one shouldn't eat chips while hiding"
            ],
            "content":"<div class=\"\"><div> <span>Lifting the wooden bar off the door, six of the seven fat little goat kids were jumping excitedly at the prospect of the candy and junk-food their mother was bringing home. The seventh was already waddling for a hiding place, with good reason, as the door swung open and revealed the toothy grin of the hungry wolf. Licking the remnants of the honey from his lips, the grizzly brown wolf took a moment to shake all the flower from his fur before stepping menacingly towards the kids. “Rawr...” he swiped jokingly at the air in front of him, and all the fat little goats scrambled, waddling to whatever hiding place they could reach the fastest.<br>\r\n<br>\r\n    The wolf grinned, looking around at the goats trying to squeeze under the couch, or into an over-sized flower pot, all too round to fit into their hiding places. still grinning he leaned his head back, he straightened the collar on his flannel shirt and tied a handkerchief as a bib. “Dinner is served...” He said, licking his lips and pushing out on his suspenders, the elastic bands snapped back against the flannel and he stepped into the cabin, kicking the door shut behind him. He took a moment to look around again, trying to decide where to begin, when a crunching noise from the kitchen caught his full attention.</span></div></div>",
            "created":1341291600,
            "id":1371088,
            "title":"Pizza Delivery..."
        },
        "14411":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "Were else do you store food?",
                "let's see whos in the dining room..."
            ],
            "content":"<div class=\"\"><div> <span>Padding around the marble topped island, he looked down, to see a huge pile of cookies spilled all over the floor, and wedged into the out-sized cookie jar? The first of many out-sized goat kids, up to his excessive belt line in blue flowered porcelain, and to make it worse he had a double fist-full and a mouth-full of chocolate chip. He was reaching for another cookie, when his gaze followed a set of worn denim pants up to a toothy grin. “Cookie?” he handed it up towards the wolf, who grabbed the fat little goat by the scruff of his neck and with a *pop* pulled him out of the cookie jar.<br>\r\n<br>\r\n    The wolf’s tail wagged at the considerable heft of the squat little goat. There was little hesitation as he wrapped his drooling, sneering lips around the plump little goat. there were muffled shouts coming from the wolf's throat as as the fat goats cheeks entered the wolves. The big brown canine pressed the goats fat bottom onto the counter and pressed down, forcing the kid further in. The wolf’s eyes narrowed and he reached around that tubby belly to grab the goats legs, lifted his head and the goat straight up, and forced him in. all the buttons on the flannel shirt popped and the fat little goat hit his belly like a boulder.</span></div></div>",
            "created":1341291600,
            "id":1371090,
            "title":"more than his hand caught in the cookie jar..."
        },
        "144111":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "I spy with my hungry eyes...",
                "Change, remotes, and other things found in the couch cushions..."
            ],
            "content":"<div class=\"\"><div> <span>The wolf caught himself on the counter, nearly dragged to the floor by the plump goat. “this is gonna be harder than I thought...” He regained his balance and wrapped his hands around the considerable belly in front of him, hefting the heavy bulge up he sauntered over to the refrigerator, which appeared to be trying unsuccessfully to close itself. Pulling it open the next goat, much fatter than the one in his gut, fell out with a resounding thud which shook the plates and glasses in their cupboards. The little goat also dragged a lot of food out with him, trying to shield himself with a chicken.<br>\r\n<br>\r\n    The large brown canine smiled at this, Allowing his own prodigious belly to drop, he grabbed the chicken and sneered at the little horned butterball. Taking a menacing step forward he popped the large roasted bird in his maw, and swallowed it down. A heavy gut, covered in a luxurious cream colored fur, bulged out to hit the little goat in the forehead. The goat fell backwards, giving him full view of the lupine monster as he licked his razor sharp teeth and patted his belly with pride. A moment of gloating later, he dipped low and grabbed the plumped kid by his ankle. Rising up he found the kid was heavier than he appeared, so he switched hands and used the counter for leverage.<br>\r\n<br>\r\n    Fighting gravity every inch from the floor to well above his head, the wolf was thankful it would be on his side on the journey down. At some point the fat little goat manage to grab what appeared to be a birthday cake, and was holding it between himself and the wolf. Of course this meant only one thing, the cake entered the wolf’s jaws, followed by the fattened goat holding it, and the goat only worked to force the cake down to their final destination. the wolf’s jaw did it’s job as expected, opening wider, wider, wider. “Uh oh...” the wolf thought, the obese little kids gut had found the widest aperture of the wolf’s jaws, and now it appeared he was stuck. the air in his lungs thinning the wolf started to panic.<br>\r\n<br>\r\n    Stumbling out of the kitchen and into the living room he was looking for something to help dislodge the little goat, seeing the fireplace poker he stumbled clumsily to grab it. all the while the goat in his maw was busy squirming and trying to get free, just as the wolf was in grasping distance the goat kicked both feet, causing the wolf to fall backwards. Panic hit the wolf as he watched his iron salvation fall away, he stumbled back and fell into the couch. Sitting momentarily the wolf’s life flashed before his eyes, and suddenly with a creek, the couches legs nailed themselves into  the floor. The impact was more than enough, the heavy weight of the goat forced itself down and with a pop, dislocated the wolf's jaw, two paws with gravities assistance finished the job.</span></div></div>",
            "created":1341291600,
            "id":1371093,
            "title":"Were else do you store food?"
        },
        "1441112":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "I'll take whats behind door number three Alex...",
                "Let's see what we have in thee pantry Alex..."
            ],
            "content":"<div class=\"\"><div> <span>Already gasping for air before the goat hit bottom, he smiled a bit, jaw hanging literally slack open. with a final *Glwrp* the wolf gut sagged out double, two goats, a roasted chicken, and a birthday cake filling it nicely. But the wolf hadn’t come here for just a four course meal, oh no, he was gonna have a proper feast. his attention was quickly brought to the cushion next the the one he was currently occupying. it was well above the ones on either side of it and it was doing a combination of squirming and shivering. he pulled the cover off and tossed it aside. He wouldn’t have believed it possible, but this “little” goat was even fatter than the last. grabbing by both ankles this time, the wolf dragged the goat over his squirming belly.<br>\r\n<br>\r\n    the squirming and shivering goat suddenly grew very still as he was lifted, with a grunt from the wolf, into the air above the amoral canines gaping maw. “NOOOO*hnhnhhnhn*OOOOO*hnhnhnhn*OOOOO...” the big fed wolf smirked as he raised and lowered the goat in and out of his mouth, smiling at the drastic change in pitch. “...OOO*hnhnhnhn*” he pulled the tender morsel further in, allowing his dislocated jaw to stretch around it’s own food stuffed gut. this time things went a lot smoother as the bulk of the fat little goat passed his lips and entered his throat, leaving two hooves hanging out of his mouth. At this point his head leveled with a shifting sound, he eyed a cabinet door not even close to shutting, being pulled in again and again, only to open once more. With a gulp and a slurp, the goats hooves disappeared and the wolf’s gut grew out by nearly a third.</span></div></div>",
            "created":1341309900,
            "id":1371095,
            "title":"Change, remotes, and other things found in the ..."
        },
        "14411121":{
            "author_id":"industryfox",
            "author_name":"industrystandard",
            "choices":[
                "\"Me too...\"",
                "\"well why don't you head into the kitchen and go nuts...\""
            ],
            "content":"<div class=\"\"><div> <span>Patting at his broad expanse of a paunch, the wolf put a massive clawed hand on the couch arm and pushed with all his might, forcing his much heavier bulk up into a standing position. Pulling up on his belly he lifted it away from his knees so he could walk over to the oddly animated cupboard door. “I’m gonna need a diet after this... or maybe a wheelbarrow...” allowing half of his stomach to sag down onto his legs, the amoral lupine yanked the door open and smiled. Another goat, such a fat little butterball he porked out a foot beyond the confines of his hiding space. The piggy little goat had four or five candy bars in the hand that wasn’t working the door and three more in his mouth. The wolf reached down for the overfed cervine morsel, but stopped as the goat pulled the candy bars away. The wolf grinned at the little goat ”glutton to the very end eh?” he smiled and pulled the goat out of the cupboard...</span></div></div>",
            "created":1341310080,
            "id":1371096,
            "title":"I'll take whats behind door number three Al..."
        },
        "144111211":{
            "author_id":"dannyboy101",
            "author_name":"T-Dag",
            "choices":[
                "Looked under the kitchen table.",
                "Looked inside the closet."
            ],
            "content":"<div class=\"\"><div> <span>\"Let do show you how much.\" The wolf said sinisterly.<br>\r\n<br>\r\nThe wolf then opened his mouth super wide in order to attempt eating another one of the obese goat kid. The little fatty screamed as the wolf lifted him up and dropped him down his gullet. After shallowing three of the goats, it was much easier for him. Even if the kid was pretty wide. Using his paws to force down the goat kid and one final gulp, there were now four goat kids inside the wolf's belly. The wolf's belly now stretched out more and even was close to touching the ground.<br>\r\n<br>\r\n\"This is becoming quite the meal for me.\" The wolf said to himself while patting his big belly.<br>\r\n<br>\r\nThe wolf knew there were still some little goat kids left hiding in the house. He could smell their scents. The wolf then....<br>\r\n</span></div></div>",
            "created":1513779480,
            "id":2430541,
            "title":"\"Me too...\""
        },
        "1441112111":{
            "author_id":"dannyboy101",
            "author_name":"T-Dag",
            "choices":[
                "\"Time to check the bedroom.\"",
                "\"Perhaps the closet.\""
            ],
            "content":"<div class=\"\"><div> <span>As he plows around the kitchen, the wolf was searching for the next no-so-little goat on the menu. He then happens to hear some loud crunching coming from under a table with a cloth. The wolf had a devious grin on his face as he quietly walked over to the table. The wolf then pulls back the cloth and finds another one of the fatty goat kids munching on a big bag of potato chips. She stops once she realized that she had been discovered.<br>\r\n<br>\r\n\"Crunching up quite a storm.\" The wolf said before licking his lips.<br>\r\n<br>\r\nHoping that the wolf wouldn't eat her, the goat kid offered her bag of chips. The wolf did take the bag, but instead of simply eating the chips in it, he swallowed the whole bag. He didn't even savory the chips. But he looked like he still wanted more. He then grabbed the goat and he prepared to eat her too. After gulping down 4 others, he was already used to stretching out his jaw to stuff the kits in. He started with the head and force the rest of her down. The poor kid couldn't even put up a struggle big enough to phase the wolf. One powerful gulp and she was now joining the rest of her siblings inside the wolf's belly.<br>\r\n<br>\r\nThe wolf's stomach was now touching the ground and feeling really REALLY full. It's to be expected after eating as much as he had in one day. Still, he felt that his meal wasn't over just yet. If his memory served him right, there was still one or two fatty goats left to devour.</span></div></div>",
            "created":1592599140,
            "id":2853688,
            "title":"Looked under the kitchen table."
        },
        "15":{
            "author_id":"dannyboy101",
            "author_name":"T-Dag",
            "choices":[
                "Big Bad Wolf and the Big Bad Buffet.",
                "Wolf and the Hoard of sheep.",
                "The three pigs stuff the Big Bad Wolf.",
                "Wolf and the big bakery.",
                "More story choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, what kind of fresh and new story for the wolf?</span></div></span></div>",
            "created":1475944440,
            "id":2220622,
            "title":"a *NEW* and Original story with a Big Bad Wolf"
        },
        "153":{
            "author_id":"dannyboy101",
            "author_name":"T-Dag",
            "choices":[
                "\"Not by the hairs of... well you know the saying.\"",
                "\"Door's open. Come on in.\"",
                "\"What's the magic word?\""
            ],
            "content":"<div class=\"\"><div> <span>In was the same thing day in and day out for 3 little pigs. The Big Bad Wolf would chase them in his attempts to eat them. But failed everytime they made it to their house. But unlike a house made of straw or a house made of sticks, a house made of bricks, wouldn't go down easy by some huffing and puffing.<br>\r\n<br>\r\nSure, the pigs always came back okay. But after 20 or so times, it was getting tiresome. The pigs have had enough of the wolf trying to eat them. So the 3 of them tried to think of a plan.<br>\r\n<br>\r\n\"Okay. Since that wolf still doesn't know when to quit, we have to do something.\" Pig 1said.<br>\r\n\"We agree.\" Pigs 2 and 3 said.<br>\r\n\"So what's your plan?\" Pig 2 asked.<br>\r\n\"Yeah. How do we stop that hungry wolf for good?\" Pig 3 asked.<br>\r\n\"Hungry......\" Pig 1 pondered.<br>\r\n<br>\r\nThe pig then pondered about things. The wolf always chased them cause he wanted to eat them, implying that he was hungry. Hungry was the key word.<br>\r\n<br>\r\n\"Guys, I have a idea.\" Pig 1 said. \"If the wolf is so hungry, then we should do something about it?\"<br>\r\n\"Huh?\" The other pigs said looking confused.<br>\r\n\"Okay. Here's the plan.\" Pig 1 said.<br>\r\n<br>\r\nThe three then huddled to whisper a plan to each other. Hopefully the plan that they had in mind would work.<br>\r\n<br>\r\nThe next day, the Big Bad Wolf was back in front of the pig's door and knocked angrily. Shouted out what he usually shouts out them.<br>\r\n<br>\r\n\"Little pigs. Little pigs. Let me in.\" The Wolf shouted.</span></div></div>",
            "created":1475957400,
            "id":2220687,
            "title":"The three pigs stuff the Big Bad Wolf."
        },
        "1532":{
            "author_id":"dannyboy101",
            "author_name":"T-Dag",
            "choices":[
                "Is filled with a bunch of cakes.",
                "Has this weird looking machine.",
                "Has the three pigs teasing him."
            ],
            "content":"<div class=\"\"><div> <span>Hearing the pigs say that really surprised the wolf. So much if fact, be wasn't sure that he heard them right.<br>\r\n<br>\r\n\"What did you say?\" The big bad wolf asked.<br>\r\n\"We said 'Come on in.'\" One of the pigs said.<br>\r\n<br>\r\nThe wolf was not sure what to make of this. Usually the pigs would keep their door locked and tell him to go away. But this time they WANTED him to come in. Not thinking too much of it, the wolf opens the door and goes inside the house. It was dark and he didn't see anyone in the living room.<br>\r\n<br>\r\n\"Little pigs? Where are you?\" The big bad wolf said. \"Don't think letting me in is gonna make me change my mind about eating you.\"<br>\r\n<br>\r\nThen from behind the wolf were the three pigs stacked up together. One of them was holding a frying pan. He hold the frying pan up and clucked the wolf right in the head. The cast iron was hard enough to knock the wolf out cold. The wolf was now lying on the floor. Totally out of it. The pigs all laughed mischievously.<br>\r\n<br>\r\nAbout an hour or so later, the wolf finally wakes up tied to a chair and in a giant dark. He lloks arounds and sees the room....</span></div></div>",
            "created":1479070380,
            "id":2236585,
            "title":"\"Door's open. Come on in.\""
        },
        "155":{
            "choices":[
                "Yes! Tell me what I look like!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I think this one is the best! It's called, \"Big Bad Wolf's Free Choice\"</span></div></span></div>",
            "created":1514577120,
            "id":2434105,
            "title":"More story choices."
        },
        "1552":{
            "author_id":"andrewisback",
            "author_name":"AndrewTheWolf2020",
            "choices":[
                "Big Fat Wolf's Midnight Dinner",
                "Fatness of Love (Big Fat Wolf's Valentine's Day Special)",
                "More."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I have more.</span></div></span></div>",
            "created":1516228860,
            "id":2442131,
            "title":"More!"
        }
    },
    "info":{
        "author_id":"industryfox",
        "author_name":"industrystandard",
        "brief_description":"They say every dog has his day, why shouldn't the occasional wolf?",
        "created":1295432400,
        "description":"<td align=\"left\" class=\"norm\">In an attempt to fill the void made by the loss of Zaftig City I bring to you a weight gain interactive starring the most famous of furries and villains, the Big Bad Wolf<br>\r\n<br>\r\nPlease keep it CLEAN, no scat, watersports, or graphic sex and keep the Gore and slob to a minimum (some things explode when fed too much and fat people get sweaty *shrugs*)<br>\r\n<br>\r\nthe story doesn't have to be strictly vore so to speak, be creative, \"Three little pigs bakery\" \"Grandma's Eating Dissorder\" \"The seven goat kids on the fat farm\"<br>\r\n<br>\r\nYou'll have several wolves from several stories to choose from so lets break with the choice chapter after the first 2 or 3 chapters and get to some decent stuffing.<br>\r\n<br>\r\nif you decide to end the wolfy in some manor or another be sure to leave another option to continue<br>\r\n<br>\r\nand though I encorage weight gain in other characters, try and keep it focused on wolves, any chapters treading too far from the main character will be \"edited\"* (Read \"Deleted\")</td>",
        "id":1743232,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602167100,
        "modified":1602167100,
        "pretty_title":"Big Bad Wolf Weight Gain Interactive"
    }
}