{
    "chapters":{
        "1":{
            "author_id":"wtlamp",
            "author_name":"WTLamp",
            "choices":[
                "Abby, the wannabe hero",
                "Vanessa, who wants revenge",
                "Gabriella, the BBW gainer",
                "Marilyn, the hungry murderer",
                "Others who may have gained the power"
            ],
            "content":"<div class=\"\"><div> <span>This particular world is inhabited by higher beings, commonly referred to as Gods and Goddesses. On a whole, they don't tend to meddle in human affairs much, although they might do so if they get bored enough.<br>\r\n<br>\r\nEnsaesha, the Goddess of Gluttony, is one such bored goddess. And so, she decided to meddle in human affairs by granting someone the ability to eat others whole. She appears in the person's dreams, tells them about the power, and watches what unfolds next. How said person uses that powers, she doesn't care about, as long as they're used. And how she picked the person who got the powers was completely arbitrary. This person just happens to be...<br>\r\n<br>\r\n<b>Abby Williams</b>, a college freshman who's always had a desire to be a superhero. With a genuine superpower, she may finally get her chance, although there's also the possibility that she could misuse it too. It's a good thing that spandex is stretchy!<br>\r\n<br>\r\n<b>Vanessa Shade</b>, a high-schooler who has felt oppressed for most of her life. Now, she has the capability to strike back at her tormentors, though her expanding waistline may make her new enemies that she has to \"deal with\" as well.<br>\r\n<br>\r\n<b>Gabriella Parkins</b>, a woman that's always been large and loved it. This new power of hers could be just what she needs to become the fattest woman - no, the fattest <i>person</i> - who ever lived.<br>\r\n<br>\r\n<b>Marilyn Clyde</b>, antisocial and a budding psychopath. It's the eating others part that interests her, and as long as she can still find fresh meat, who cares about how fat she gets?</span></div></div>",
            "created":1373595720,
            "id":1626660,
            "title":"It Begins"
        },
        "11":{
            "author_id":"wtlamp",
            "author_name":"WTLamp",
            "choices":[
                "\"Cutter\" Connie Calvin, a wanted criminal",
                "Councilman Sal Smith, a corrupt politician.",
                "Professor Mark Bitters, the worst teacher ever.",
                "Janine Rivers, the most popular girl on campus.",
                "Her roommate Megan. who's kind of an bitch."
            ],
            "content":"<div class=\"\"><div> <span>Abby's mind was running a mile a minute as she went about getting ready for her day. She'd had the oddest dream last night, one in which the fattest woman she'd ever seen had said something about... eating people? Odd, to be sure, but something in the back of her mind said that it wasn't just an odd thought that had occurred last night. Her thoughts left the dream as she went about choosing the day's wardrobe. After putting on her underwear, she slid a pair of denim shorts over her wide hips, and a blue button-up shirt covered her modest bust and round belly.<br>\r\n<br>\r\nAbby possessed a most unusual body, in that she was probably the fittest fat person on the campus of Metro University. Ever since she was little, she'd dreamed of being a hero, and of course heroes were strong. So, she trained however she could; lifting weights, running, and anything else she could think of. At the same time, Abby had something of a sweet tooth, which had left more then a few extra pounds on her belly, hips, and thighs. And while she had become pretty strong, she had also become pretty chubby, and the fat didn't seem to go away no matter what she did. It had caused her some distress at first, but Abby had grown to accept that she'd always be huskier than most other women. At least she had the muscle buried under the fat to help move her wider frame.<br>\r\n<br>\r\nDone dressing herself, Abby's thoughts returned to the dream as she poured herself a bowl of cereal. As has been mentioned, she'd always wanted to be a hero. And, if she really did have this power, Abby now had to ability to fulfill that dream. But first, she'd have to test this power. More than that, she'd have to test it on someone who deserved it. After all, heroes didn't go around devouring just anyone! As she thought, Abby finished off her cereal before she knew it, and found herself still hungry. And, wouldn't you know it, there was no more cereal now either. Or really, any food in her dorm room - Abby had meant to go shopping for more of it today.<br>\r\n<br>\r\nAs she got up to go, Abby finally decided who to test the power on. Sure, she might get a free meal out of doing this, but this was mainly to serve the cause of justice! The first person Abby was going to devour was...</span></div></div>",
            "created":1373617980,
            "id":1626813,
            "title":"Abby, the wannabe hero"
        },
        "111":{
            "author_id":"wtlamp",
            "author_name":"WTLamp",
            "choices":[
                "Abby finds Connie mugging an innocent girl.",
                "Connie ambushes Abby and tries to mug her!",
                "Abby doesn't find Connie. Guess \"Cutter's\" smarter than Abby thought."
            ],
            "content":"<div class=\"\"><div> <span>Today was a Saturday, which meant no classes. Abby usually spent an hour of Saturday mornings in the Metro University gym. Sure, the workouts never burned off any fat, but Abby liked shocking people who assumed that just because she was round she was out of shape. The jiggling her flesh made as she worked out was also oddly pleasurable. And so, Abby found herself on a treadmill, her belly bouncing up and down as she jogged in place. Her eyes were drawn to a television that the gym had set up above the treadmills.<br>\r\n<br>\r\nOn the television, Abby could see a local news report about Connie Calvin, a convicted criminal who had recently broken out of police custody during her trial. \"Cutter Connie\" was a mugger who mostly targeted young women. The report talked about how dangerous Connie was, and about rewards for any information leading to the criminal's arrest. There was, of course, images shown of Connie; it was a little hard to believe that the blonde, slightly overweight woman being shown was really as dangerous as the report was saying. The orange jumpsuit that she was wearing in the picture shown on TV didn't entirely disguise her thick body, and Connie's face was slightly puffy.<br>\r\n<br>\r\nIt didn't take Abby long to decide that such a criminal was a good place to start her superhero career. People like Connie had to be taken care of for the good of society, after all! On her way back to her room to prepare for her debut, Abby bought a roast beef sandwich at the campus cafeteria. It was delicious, but it didn't eliminate the hunger that had been growing all day. A hunger, that Abby decided, was her hunger for JUSTICE!<br>\r\n<br>\r\nAbby arrived at her room soon enough, and out of a drawer at the bottom of her dresser, she pulled out some clothes. Specifically, some black spandex pants, a black spandex top, and a mask. It took a little effort to put them on, but the spandex fit pretty well. I mean, sure, they really didn't disguise how round Abby's belly and butt were, but Abby had learned long ago to accept her body for what it was. People would just have to accept that not all superheroines were not the extreme hourglasses that most comic artists drew them as.<br>\r\n<br>\r\nAbby spent most of the afternoon alternately doing some homework for her classes and waiting impatiently for night to come. Dinner was two cups of instant ramen noodles, which didn't really fill her up at all. However, finally, the sun went down, and it was time for justice! Abby put on some black boots which complemented the black spandex that she had on, and put the mask on. It had a hole in the top that let her hair out, and a slight mesh over the eyes that let her see through it, but kept them disguised for the most part. Her mouth was uncovered, fortunately enough.<br>\r\n<br>\r\nAbby moved quickly off of campus and into the neighborhoods where Connie had robbed people before she had been arrested. It was probably the best place to start looking for the mugger, Abby figured. She patted her belly as she felt another hunger pang. She was hungry for JUSTICE, and hoped that tonight that hunger would be assuaged.</span></div></div>",
            "created":1375393740,
            "id":1638458,
            "title":"\"Cutter\" Connie Calvin, a wanted criminal"
        },
        "1111":{
            "author_id":"wtlamp",
            "author_name":"WTLamp",
            "choices":[
                "Abby defeats Connie and swallows her.",
                "Abby wins, but Connie ISN'T eaten.",
                "Connie gets the upper hand. Uh oh!"
            ],
            "content":"<div class=\"\"><div> <span>Abby moved with a speed and deftness that shouldn't have been possible for someone of her size as she prowled the streets, on the lookout for \"Cutter.\" She was also surprisingly stealthy; despite being rounder than most people, she didn't appear to be attracting that much attention at all. Either that, or people were just ignoring the fat girl in the spandex, but Abby liked to think it was her unexpected skills. She stopped thinking about that, though, when she heard a cry for help!<br>\r\n<br>\r\nWith all the speed she could muster, Abby sprinted towards the shout, her entire body bouncing rhythmically up and down with the movement of her legs. Fortunately, Abby wasn't too late, and arrived just in time to see Connie pull a knife on an overweight young woman who was wearing glasses. Connie had apparently ditched her prison jumpsuit, and had robbed a clothing store before attempting her latest crime. The clothing store also hadn't seemed to carry any clothes in Connie's size; the chubby criminal had stuffed her body into a tube top and shorts that left her cleavage of display and gave her a severe case of muffin top.<br>\r\n<br>\r\nAbby paused, assumed a pose, and shouted, \"STOP RIGHT THERE, CRIMINAL SCUM!!!\"<br>\r\n<br>\r\nConnie turned to look at the would-be hero, a look of confusion on her face. \"Who are you supposed to be, fatso?\" she asked.<br>\r\n<br>\r\nAbby had spent most of today thinking of a name, and now proudly yelled, \"I am Gastrowoman, and your reign of terror ends today!\"<br>\r\n<br>\r\nHer piece said, Abby rushed at Connie, prepared to do her first real rescue.</span></div></div>",
            "created":1380160320,
            "id":1669767,
            "title":"Gastrowoman Begins"
        },
        "11111":{
            "author_id":"protomite",
            "author_name":"Sandwich Boy",
            "choices":[
                "The girl is terrified, and runs away screaming.",
                "The girl thinks Gastrowoman is the coolest thing ever."
            ],
            "content":"<div class=\"\"><div> <span><i>'Gastrowoaman'</i> was much quicker than Connie had expected. By the time she had pulled her knife, a chubby fist had slammed into her chest, and sent her dropping to the ground.<br>\r\n<br>\r\n\"Ooof...\" she sputtered as she hit the dirt. This girl hit a lot harder than expected, too. Abby stood over her down opponent and grinned.<br>\r\n\"Give up?\"<br>\r\nThe escapee coughed and lurched, clearly too winded to say anything. The heroine simply stood there, awkwardly as she waited for a response. She knew she was strong, but she'd expected Connie to be tougher.<br>\r\n<br>\r\n\"Don't stop now, finish her!\" yelled the would be victim.<br>\r\n\"Huh?\"<br>\r\n\"Stomp her into jelly before she gets up!\"<br>\r\nConnie tried pulling herself up, but fell flat on her face.<br>\r\n\"Not so sure I need to...\" the plus sized avenger commented.<br>\r\n\"It's a trick! She's a bloodthirsty animal!\"<br>\r\n\"L-look, I'm not about to kill someone!\"<br>\r\n\"She's reaching for her knife!\"<br>\r\n<br>\r\nIt was true, the villain could barely stand, but she was still trying to retrieve her weapon. \"Just...gimme...gimme two seconds...give me a minute an I'll...I'll cut you up good for that...\"<br>\r\nThe bespectacled girl held her arm out to reiterate the point.<br>\r\n\"Okay, okay! She's obviously too dangerous to keep around...\"<br>\r\n\"Should I look away? Is this gonna be messy?\"<br>\r\n\"Not so much...\" Gastrowoman laughed slightly and waddled over.<br>\r\n<br>\r\nCrouching down, she carefully yanked  the knife from Connie's hand and tossed it to the side The criminal scowled at her before her attacker began to open her mouth wide. In the dark, her throat resembled some dark abyss.<br>\r\n\"Uh...okay, I surrender...\" she said weakly, before two meaty hands grabbed her arms and pulled her close.<br>\r\n<br>\r\nThe girl watched on as her rescuer devoured her mugger, staring in utter shock.She couldn't tell if this was better or worse than just flat out killing her. Stepping around to see the show, she saw Gastrowoman's fat cheek balloon out as she stuffed the villain deeper and deeper into her throat. Her lips lurched over more and more of the woman's body and pulled it in further. It was not unlike watching a python swallow an antelope...but seeing a human do it was an entirely different experience.<br>\r\n<br>\r\n\"Oh gawd! <i><b>UurRAAARRRP!</b></i> D-damn it! Holy hell!\" The engorged heroine dropped onto her fat backside as the last of her meal fell into her stomach. This wasn't anything like she was expecting. It was like eating every meal for the whole year all at once, and not entirely in a good way. She was beyond full, beyond stuffed, she had never felt anything like it. As satisfied as she may have been, it was painful and exhausting. She could hardly breathe, and had the strangest stomach ache from Connie's kicking and squirming.<br>\r\n<br>\r\nShe was really hoping it'd get easier with practice..<br>\r\n<br>\r\n\"Y-BRAHP! 'Scuse me. You're safe now, ma'ám. Justice is served, and so was dinner!\" she quipped, sounding nowhere near as smooth and confident as she'd have hoped.</span></div></div>",
            "created":1442929800,
            "id":2038229,
            "title":"Justice Is Served."
        },
        "112":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Attack him at the meeting",
                "Attack him at the office",
                "Stalk him for the perfect opportunity"
            ],
            "content":"<div class=\"\"><div> <span>For Abby, the decision was easy. Taking on a violent criminal like Connie Calvin for her first try was just reckless. Nor did devouring someone for being a dick seem like a heroic plan, no matter how rotten her teacher or roommate were. No, there was only one option and that was Sal Smith, the corrupt city councilman. Abby was well aware of his dirty dealings. Last year, Sal had been indicted in the sexual assault of a sixteen year old girl. Despite her testimony and the discovery of his DNA at the scene, Sal managed to escape prosecution. <br>\r\n<br>\r\nHe had escaped justice for far too long. But before the bastard could wind up in her belly, she had another decision to make. She had three options for getting at Sal. Firstly, she could attack him at the daily councilman's meeting and devour him in public, though that would require a disguise. Alternatively she could approach him at his private office or even stalk him throughout the day for the perfect opportunity to strike.</span></div></div>",
            "created":1373725740,
            "id":1627381,
            "title":"Going for Sal Smith"
        },
        "1121":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Power Girl",
                "Black Canary",
                "Red Sonja"
            ],
            "content":"<div class=\"\"><div> <span>If she were to become the superhero she'd always wanted to be, Abby was going to have to attack the councilman at his meeting. Her justice had to be public or else no one would know of the example she had made out of him. That being said, there was <i>still</i> one more issue that needed addressing. Because she was so set on doing this in public, Abby wasn't going to be able to go undisguised, lest she desired to wind up in jail for murder. <br>\r\n<br>\r\nDoubling back to the dorm's dressers, Abby dove in and began to search for one of her many outfits. As a fan of superheros, she had amassed a diverse collection of costumes themed around those very heroes she'd idolized since her youth. Most had been left at home but she had managed to pack a few. The three she had packed all those months ago were costumes of Power Girl, Black Canary, and Red Sonja.<br>\r\n<br>\r\nIn the end, she decided to go with...</span></div></div>",
            "created":1373727900,
            "id":1627386,
            "title":"Fitting Disguise"
        },
        "11211":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Back to the dorm",
                "Wait in the alley"
            ],
            "content":"<div class=\"\"><div> <span>In the end, she decided to go with her Power Girl outfit. Despite the infamous boob-window it was by far the least \"porny\" of the three. A much more modest option that either the corset and fishnets or the barbaric chain-mail bikini. Ripping off her denim shorts and blue button up, Abby started to slip her pudgy body into the small costume. Her wide hips and pot-belly struggled to squeeze into the fabric, but with a few tugs she managed to get the uniform unstuck. Her moderate, C-cup bosom slipped snugly into the leotard's bust. Finally, she spent a few minutes lathering her face in make-up, distorting her features beyond base recognition.  It was an odd look, but it worked.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nA half an hour passed before Abby managed to reach the town hall. It had been an entertaining walk, with the freshman catching more than a few stares for her choice in attire. While a small minority seemed disgusted that a girl her size would wear something so degenerate, the vast majority could not keep their lecherous eyes from her exposed cleavage. She had never felt as sexy as she did in that moment.<br>\r\n<br>\r\nEncouraged by the positive feedback, Abby pushed the grand double-doors of the town hall open in an energetic motion. It was a public forum, so no one really noticed, but she liked to think that it was a rather dramatic entrance. With a fire in her heart she marched down the aisle, passing the few people who cared enough to attend. As she approached the stairs to the debate stage, Abby was finally stopped by a plainclothes security officer.<br>\r\n<br>\r\n\"Miss,\" he said, stepping in front of her, \"I'm sorry, but this area's off limits. Councilmen only.\"<br>\r\n<br>\r\nWithout saying a word, Abby tensed her muscles and lunged forward, wrapping the man in a headlock. The stunned guard couldn't fight back as she slammed the poor man to the floor, knocking him out in an instant. Gasps escaped from the audience and stage as they noticed the spectacle at the staircase.<br>\r\n<br>\r\n\"Excuse me, but what the hell are you doing?\" a balding, middle-aged man said as he rose from his desk. It was Sal Smith himself.<br>\r\n<br>\r\n\"I'm here for you, actually,\" Abby said as she ascended the stairs. \"Sal Smith, you're a rapist pig who deserves punishment.\"<br>\r\n<br>\r\n\"Oh yeah, and what are you going to do?\" he laughed. \"Kill me? Good luck getting out before the cops show up.\"<br>\r\n<br>\r\nAbby realized the truth in his statement. She would have to act quickly if she were to escape the police. Swallowing her lingering doubts, Abby dashed forward, gripping the councilman's shoulders before she slammed her head down. Surprisingly, rather than collide heads in a painful headbutt, her mouth expanded like a snake's, easily engulfing Sal up to his shoulders. Utterly shocked, Sal remained limp as Abby worked he way down further, speedily swallowing the man up to his thighs. <br>\r\n<br>\r\nIt was at this point that the nearly devoured man realized that he should try and fight back. His legs began to kick widly, landing squarely in Abby's chest, but it wasn't enough. Shrugging off the pain, Abby tilted her head back, sending the rest of Sal into her waiting belly. Abby's knees nearly buckled as the 150 pound man settled in her massively distended stomach. To onlookers, it appeared as if she had an exercise ball plastered beneath her costume. A costume that, thanks to the magic of spandex, had yet to rip.<br>\r\n<br>\r\nRegaining her composure, Abby turned back to the crowd. Their mouths hung agape, utterly shocked and horrified at what they had just witnessed. Taking advantage of their inaction, she hopped off the platform and dashed once again down the aisle, her belly swinging violently with each stride. Nobody lifted a finger to stop her as she burst through the double doors a final time.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nAbby collapsed against the hard, brick wall. After running for a few blocks she had ducked into a fairly isolated back alley. Her stomach and legs were on fire. The former from the constant kicks and punches being thrown by her prey while the latter was due to the excruciating pain from running with such all that weight. Had it not been for her workout regime, she doubted she could have even walked from the hall, let alone run.<br>\r\n<br>\r\nStill, an escape was an escape. Sal was churning away in her belly and it wouldn't be long before he was reduced to a nutritional mush. What now, though? Did she risk walking back to her dorm with her meal or did she stay in the safety of the alley until the deed was done?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1373733360,
            "id":1627404,
            "title":"Sal's downfall"
        },
        "114":{
            "author_id":"protomite",
            "author_name":"Sandwich Boy",
            "choices":[
                "Abby makes herself a costume.",
                "Abby throws on an old costume and takes to the streets.",
                "One of Janine's friends comes looking for her."
            ],
            "content":"<div class=\"\"><div> <span>Abby waddled down the hall, contemplating her plan. If she really did have powers, she’d need a costume. She’d spent years of her spare time cutting up different outfits into flashy heroic ensembles; she judged them based around how at home they’d look on a comic book cover. It had been a while since she’d done it, but she couldn’t wait to start again.<br>\r\n<br>\r\nShe completely gave herself to the fantasy. A part of her knew, simply knew that it was just a silly dream, but for just a while, she wanted to pretend it was real…<br>\r\n“Hmm, well, maybe I could ask someone to let me eat them…and let them out if it works? Hmmm, not sure they’d believe me…” she thought to herself. She wasn’t sure she believed it, either. She wasn’t exactly one for throwing up her food.<br>\r\nThe whole thing made her stomach rumble, and she was soon inserting a dollar bill into a vending machine.<br>\r\n<br>\r\n“Oh hey there, Gabby!” The plump co-ed froze as the sweet voice passed her ears.<br>\r\n“It’s Abby!” she shot back as calmly as she could.<br>\r\n“Oh, sorry, sorry!”<br>\r\nBehind her stood Janine Rivers, head cheerleader, and unofficial queen on campus. Abby couldn’t stand the way she went around acting sweet and innocent to everyone she met. She could get away with murder with the right smile.<br>\r\n<br>\r\n“What do you want, Janine?”<br>\r\n“Uh, snack?” she shrugged. “Don’t tell anyone, though, I’m meant to be on a diet!” she giggled. Abby hated that insufferable giggling.<br>\r\n“Fine, I’ll just be a sec…” Abby waited for her snack to drop, but it got stuck halfway down. “Oh darn it!”<br>\r\n“Aw, you should try giving it a good shove! Way you lift those weights, you might knock a few extra packs loose!”<br>\r\n“Funny thing, Jan, I actually<i> do</i> lift weights.”<br>\r\n“…yeah, I know, that’s why I said it. I see you at the gym sometimes.”<br>\r\nAbby ignored her and gave the machine a push, but nothing happened.<br>\r\n“I know! I’ll buy the same thing, and maybe it’ll knock yours down!”<br>\r\n“…I have a better idea…” Abby grinned, cheekily, and began flexing her jaw.<br>\r\n<br>\r\nTruth was, Janine was every bit as friendly and sweet as she acted, if just a tad oblivious. But Abby didn’t know her, all she saw was some ditzy girl constantly walking with a posse of admirers getting her way without any effort. And with an annoying laugh.<br>\r\nAnd because she didn’t like her, she found herself believing every little rumour about her. That she’d invite boys to her dorm just so her clique could laugh at them. That she sabotaged her competition for Prom Queen every year. That she’d turn on one of her friends and cast them to the bottom of the social food chain just for the fun of it.<br>\r\n<br>\r\nPerhaps, had she not had that particular dream this morning, Abby would’ve talked with Janine and found out what a nice person she really was.<br>\r\nBut Janine was not that lucky.<br>\r\n<br>\r\n“Oh, neat! Where’d you learn to do that?” Janine smiled as Abby popped her jaw and opened wide…<br>\r\n<br>\r\n****<br>\r\n<br>\r\nAbby slammed the door behind her just in time. \"BRAAAAAAHP!\"<br>\r\nHer chunky middle squirmed and thrashed as Janine kicked and screamed for freedom.<br>\r\n\"It worked! Omigosh it actually worked!\"<br>\r\nA sobbing, crying voice escaped her lips with every word.<br>\r\n\"After all this time...so many years, so many nights spent dreaming...I'm going to be a hero!\"<br>\r\nShe posed heroically in front of her mirror and smiled, imagining all the good she could do, as her engorged stomach churned a poor girl into mush.</span></div></div>",
            "created":1442927700,
            "id":2038222,
            "title":"Eating up the Food Chain"
        },
        "12":{
            "author_id":"wtlamp",
            "author_name":"WTLamp",
            "choices":[
                "... those bitches on the cheerleading squad.",
                "... the douchebags on the football team.",
                "... the teachers who never gave her a break.",
                "... the jackasses at her part-time job.",
                "... her extremely judgmental and controlling parents."
            ],
            "content":"<div class=\"\"><div> <span>The first day of Vanessa's senior year didn't look like it was going to be that good. Not that the last three years had been great, but at least they hadn't started off with a cryptic dream about eating people followed by waking up with a pain in her stomach so great it nearly caused her to pass out. Eating breakfast dulled the pain, but she didn't feel full. So she ate some more, until her chubby belly peeked out from underneath her pajama shirt. As has been mentioned, Vanessa didn't exactly enjoy her last three years of high school, and often turned to food for comfort. This had resulted in her gaining some weight, which only seemed to add to her torment. Her belly was deemed to be too round, her hips too wide, her thighs too thick, her ass too big, her breasts not big enough (it seemed that Vanessa's chest was always the last place where extra fat was deposited on her body, something which aggravated her to no end).<br>\r\n<br>\r\nBreakfast being finished, Vanessa stomped upstairs, rifling through her wardrobe for something to wear. She was getting worried, since she'd tried on most of her clothes yesterday, and found that most of them were getting kind of tight. Of course, she'd only thought to do this the night before school started, and so she wouldn't have the chance to get new clothes before heading to class. After some deliberation, Vanessa picked out a t-shirt that covered her torso (though it didn't leave the shape of said torso to the imagination), and a pair of shorts that she had to suck her gut in to button properly (though the shorts basically left her thick legs on full display). Not perfect, but they'd have to do.<br>\r\n<br>\r\nAs Vanessa looked through her backpack on final time, she thought back on the dream. It was pretty weird, sure, but the ability the eat people? She'd actually be perfectly fine with a power like that, especially if it let her get back at <b>them</b>. Even now, thinking about the people who had made high school a living hell for her caused Vanessa to grind her teeth in anger. Yeah, swallowing and digesting one of them actually sounded pretty satisfying. Anything to get even with...</span></div></div>",
            "created":1373619300,
            "id":1626820,
            "title":"Vanessa, who wants revenge"
        },
        "13":{
            "author_id":"wtlamp",
            "author_name":"WTLamp",
            "choices":[
                "One of the serving staff.",
                "The chef, Pauline.",
                "Her head maid, Francine.",
                "Her friend, Zoey.",
                "Some stranger on the street."
            ],
            "content":"<div class=\"\"><div> <span>Gabriella woke up hungry. This wasn't the usual, \"stuff a stack of pancakes or two omelets in her belly\" kind of hungry that had characterized her mornings for the past few months. No, this hunger was much larger and much more insistent than that. This hunger demanded that Gabby get out of bed immediately to assuage it. Which was rather annoying, since she like to lay around in bed for an hour or so after she woke up. It helped remind her of how good her life was; after graduating high school, Gabby had won the lottery. She had then invested those winnings wisely, meaning she basically didn't have to work for the rest of her life.<br>\r\n<br>\r\nWell, she now had to work to get up out of bed without having adequate \"laze under the covers\" time. Her chunky body certainly didn't help things along. Gabby had loved her hefty self for as long as she could remember, and always would, but right now it was more of a hassle than anything else. Finally, after much (jiggly) effort, Gabriella managed to get out of bed, the sheets revealing her to be naked as the day she was born. It seemed she had fat wherever it was possible for someone to have fat; her cheeks were round, she had a double chin, her breasts lay heavily on top of her belly which was separated into two rolls, her belly lay on hips as wide as a barrel, her ass jutted from her hips like two jiggly basketballs, her thighs rippled, and even her toes looked like sausages. Gabby's body was a work of love, based on a foundation of genes that stored every calorie she didn't use, years of fast food as her family was never that rich, and now a few months of unchecked hedonism as Gabby celebrated her good fortune with feast after feast.<br>\r\n<br>\r\nGabby loved herself, and wanted there to be more of herself. She desired to be the fattest person in the world, and now had the time and means to do so. This thought led her to thinking about her dream last night. The woman she'd seen in it had been fat beyond belief, immobile under all the layers of her flab. The thought of being that fat motivated Gabby to head down to the kitchen after pulling on a robe that barely went around her fat belly and left her cleavage on display. The serving staff had already set out breakfast, and as Gabby tore into the food, she thought about what the woman had said. Something about eating people?<br>\r\n<br>\r\nThe idea sounded absurd, but Gabby was willing to give any food at least one chance. And who knows? People might end up putting the pounds on her to break some records. The only problem was deciding who to eat first...</span></div></div>",
            "created":1373621880,
            "id":1626827,
            "title":"Gabriella, the BBW gainer"
        },
        "133":{
            "author_id":"protomite",
            "author_name":"Sandwich Boy",
            "choices":[
                "Seduce one of the serving staff.",
                "Gobble up everyone in her employ.",
                "Think up a grand scheme to fill up that belly of hers."
            ],
            "content":"<div class=\"\"><div> <span>Gabrielle moaned slightly as she felt the inside of her stomach fill with food, pushing her belly outward. In one meal, she was devouring enough to feed her entire staff for two days and leave their bellies bulging. And breakfast was usually the smallest of her eight daily meals.<br>\r\n<br>\r\n“Hmmm…” she scoffed a buttery loaf of toast into her chubby cheeks and pondered the possibilities. She reached over and rang a bell.<br>\r\nMoments later, she was met by her head maid, Francine. “Lady Gabrielle, how can I help you today?”<br>\r\nGabrielle held up a hand, asking her to wait a second while she finished eating. She sat there for almost three minutes, shovelling every bite into her hungry maw. There was no shortage of fat admirers in the world, but few of them worked for Gabrielle. Most of her staff had to look away while she was eating, lest they feel sick. Francine was no exception, only tolerating her employer’s appetite because her paycheque was as fat as her.<br>\r\n<br>\r\n“Mmmmm...” the blimp of a woman belched, wiping syrup and grease off her plump lips with a napkin before tossing it in her mouth. “I swear, I should just marry Pauline. Then maybe she’d work for free, and I could order bigger portions…” She drooled at the idea of eating a single bite more.<br>\r\n<br>\r\n“Ma’ám?” Francine asked, trying to hide her annoyance.<br>\r\n“Oh, very sorry, Fran.” She patted her belly invitingly, and the maid quickly stepped over and began rubbing it. While repulsed by the massive, churning melting pot of food, Gabrielle was quite enormous, so she had to be rough on her gut. Basically, she was getting paid to punch and pummel her boss! Perfect stress relief.<br>\r\n<br>\r\n“Fran, have you ever had an incredibly silly dream that managed to…inspire you?”<br>\r\n“Can’t say I have, ma’am,” she replied, slamming her dainty fists into the fleshy stomach.<br>\r\n“Well, I-<i><b>URRAP!</b></i> Last night, I saw this woman…and she was even bigger than me.” Fran stopped for a second and imagined the horrific site before shuddering and getting back to work. “I was feeling a bit too peckish to really pay much attention, however…she said something about eating people.”<br>\r\n“Wouldn’t surprise me, the way you eat, ma’am. But I suppose if you ate people, there wouldn’t be any left!” She could also openly insult her about her enormous figure, and have it mistaken for a compliment.<br>\r\n“Oh, I see you and I are on the same wavelength again! Oh, I always like you the best, Fran. I’m going to miss you so much.”<br>\r\n<br>\r\n“M-miss me?” she froze.<br>\r\n“Please keep rubbing.”<br>\r\nFran immediately obeyed, but was no less horrified. “But ma’am! You can’t fire me, what have I done?! Please!” Her enormous employer just laughed.<br>\r\n“Don’t worry, Fran! I’d never fire such an excellent maid such as yourself! I’m just going to eat you to see if that dream really meant anything.”<br>\r\n“<b>Má’am, no</b>!”<br>\r\n<br>\r\nFran didn’t believe that Gabrielle could eat people, but still, when clutched by two meaty hands by a woman more than four times her weight, she found it startling. Her fear was quite justified, however, when the woman’s mouth widened and dropped on top of her.<br>\r\nFrancine began to scream and shove, hitting Gabby in the side of the head with all her might, but to no avail. Her fat cheeks were too padded to do any real damage, and soon her shoulders were inside her mouth. <br>\r\n<br>\r\n“Texture is a bit bland…” Gabrielle thought to herself, licking furiously across her maid’s face, and then down to her breasts. “But the struggle adds a very exciting quality to it! And so juicy…this isn’t just a meal, this is an experience!”<br>\r\nShe began to gnaw on her victim’s flat belly. She bit hard, but didn’t break the skin; Francine flinched, either way.<br>\r\n<br>\r\nThe serving staff watched in absolute horror. Their boss was tremendously overbearing, but she’d never done anything like this! One of them dropped to their knees and began to curl up, refusing with all his might to pretend this wasn’t happening.<br>\r\n“Spit her out! My lady, spit her out right now, I beg you!” Gabby revelled in their shock, and only ended up slurping her down quicker.<br>\r\n<br>\r\nA pair of shoes dropped onto the floor and Gabrielle unleashed a satisfied belch. “<i><b>BrrrrUUUUHP!</b></i> And…Oh, and so satisfying! <i>Yes, yes, yes!</i> This is beyond words!” she giggled like a child as she felt at her gargantuan girth. At her impressive size, Fran’s pounding at her stomach walls could barely be seen. Only up close could you see her flesh push and kick for freedom.<br>\r\nGabrielle had never felt so aroused in her entire life.<br>\r\n“This changes everything…oh, happy day!” she groaned, saliva dripping down her second chin and into her colossal cleavage. “I must have…more…”<br>\r\nAnd it was said that all across the planet, a billion people shivered in fear, but weren’t entirely sure why…</span></div></div>",
            "created":1442933520,
            "id":2038247,
            "title":"Helping herself to the Help."
        },
        "14":{
            "author_id":"wtlamp",
            "author_name":"WTLamp",
            "choices":[
                "Cathy, her roommate.",
                "Zack, from across the hall",
                "Joyce, the cashier at the minimart down the street",
                "Her dad. Put him out of his misery.",
                "Someone from out of town."
            ],
            "content":"<div class=\"\"><div> <span>Marilyn's roaring stomach woke her up about half an hour before her alarm would have. She swore out loud as she got out of bed, heading to the kitchen in the small apartment that she lived in. It didn't take her long to find the sugary chocolate-puff cereal that she liked to eat for breakfast. Without bothering to prepare a bowl of milk, she instead just held the box up and let the contents of the half-full box pour into her mouth. It wasn't nearly enough to sate her, but it did allow her to think of something other than food.<br>\r\n<br>\r\nMarilyn found her mind wandering to the dream she had last night. Eat anyone she wanted to? That sounded... interesting. Marilyn had always wondered what it was like to kill someone. She'd practiced on small animals that she found in the part, but was always careful to hide the evidence. Not that it would have mattered if she had hid it or not; her Dad didn't really seem to care much what she did, not since Mom ran out on them both. Of course, Marilyn acted \"normal\" for the people around her; it wouldn't do to let her classmates know what <b>really</b> went through her head.<br>\r\n<br>\r\nAnd what was going through her head was eating people. It certainly wouldn't leave any physical evidence behind. Marilyn thoughtfully rubbed her chubby belly (a result of eating nothing but sugary cereals for breakfast for a few months now) as it gurgled, almost in agreement. Yes, Marilyn thought, she had to give it a shot. But who to eat?</span></div></div>",
            "created":1375084560,
            "id":1636139,
            "title":"Marilyn, the hungry murderer"
        },
        "142":{
            "choices":[
                "She hear someone walking downstairs",
                "She hear voices coming from the othe side of the basement",
                "She start to feel weird"
            ],
            "content":"<div class=\"\"><div> <span> ”¡Hey Marilyn!\" she hear a muffled voice behind the door. Getting up, she walk to the door and open it while pondering who could be only to meet with Zack, the guy that lives across the hall. He was the person in charge of the problems in the apartment. He was also pretty handsome too, for an older man at least, he had short black hair, white skin, broad shoulders, around 6'5'' in height, a foot taller than her. She have met him before, every time something broke he was there fixing it so they have met a lot of times.<br>\r\n<br>\r\n\"Marilyn could you do me a favor ?  I need your help to change some light bulls in the basement. I can't find Matt and he doesn't even answer his cellphone so please could you do it ?\" he say taking her out of her musings. “okay\" she answer, all the thoughts about eating someone vanishing of her mind for a moment.<br>\r\n\"Thanks you, now follow me\" he say and start walking down the stairs with her following behind.<br>\r\n<br>\r\n**********<br>\r\n<br>\r\n\"Well, were here. You can look around while I go for the ladder\" he say, making her glance around and understand why he needed help. The place was ENORMOUS! It looked more like a warehouse with crates all around and badly illuminated  giving it a mystery ambient. It didn't help that the lights were really high like 3 almost 4ft tall. Hearing footsteps she turn around to see Zack carrying the largest ladder she have ever seen yet it looked like it was barely holding together by what looked like adhesive tape.<br>\r\n<br>\r\n\"I know what you're thinking but there's nothing I can do about it. This ladder have been here for years and Mr. Thornstone don't want to change it until it's completely useless\" he say with her nodding knowing that Mr. Thornstone was cheap as hell. Putting the ladder in position he ask her to grab the ladder firmly while he go up and change the light bull. Repeating the process four times more while she, bored, looked at the items of one of the crates that was open, when he start to go down to change the last light bull *CRACK* a rung broke making him lose balance, sending him plummeting face first downward. Hearing a sound Marilyn turned her face up with her mouth open to say something only to see Zack falling, his head inches from her. He fell straight into Marilyn open mouth and slid into her stomach without so much as a gulp.  Her belly grew rounder in every direction, ripping her shirt at the sides. Falling on her butt she coughed violently, her throat not used to the rapid expansion... yet. After recuperating of the coughing fit she looked down at her belly and smiled wryly as it bulged furiously. It had the size of a beachball more or less.<br>\r\n<br>\r\nShe was rubbing her belly when....<br>\r\n</span></div></div>",
            "created":1413744900,
            "id":1874186,
            "title":"Accidents happens"
        },
        "1421":{
            "choices":[
                "A little bit of guilt",
                "Nothing",
                "Hunger"
            ],
            "content":"<div class=\"\"><div> <span>But as she sat there, her belly gurgling happily as it started to digest the person within, Marilyn heard the worst sound she could possibly hear at that moment.<br>\r\n<br>\r\nIt was the rattling of the door as someone began to open it. 'got to hide' she thought slowly picking herself up as the door creaked open. “Hey, Zack! Are you down there?” She hear Matt shout while she waddle as fast as she could out of the line of sight. Setting herself behind one pile of crates. Positioning herself she saw Matt walking in. <br>\r\n<br>\r\nMatt was Zack partner in every place that needed repairing. He, unlike Zack, was a rail of a guy that recently got out of school. He-\" Huh! Weird, Zack didn't finished changing the light bulls. Well is better if I finish it\" he suddenly say, getting Marilyn out of her musings. Putting on his headphones, he grabbed the ladder to put it over the same place she was hiding, seeing where he was an evil smirk grew in her face with the idea she got in that moment. He was so distracted with the music he was hearing that he didn't saw her there. Taking advantage of his distraction she slipped slowly until she was positioned under him when something fell on her head. Looking down she saw that it was the light bull that fell on her, looking up she met her gaze with Matt blue eyes almost bulging out of his head.\"What the h-GURGLE!\" He was saying only to be interrupted when Marilyn belly suddenly began to shake and rumble.<br>\r\n\"BEEELLLCCHH!\"<br>\r\nThe force of Marilyn belch threw Matt against the top of the ladder as he stood over a rung that broke making the ladder shake with Marilyn belly, it continuous loudly rumble helped making him slip. Matt began to lose his grip on the rung.  Then, with a panicked flail, he did. Matt fell, and Marilyn was waiting.<br>\r\n Matt entered Marilyn mouth feet first and slid in up to his arms. She could feel herself expand as he entered her warm body. He stuck his arms around in the air, only to have Marilyn push them down as she smirked. Her tongue ran around Matt face and with a backwards throw of her head she swallowed the rest of his body. Marilyn pursed her lips and then released with a sigh as she ran her tongue across them with a smack. Struggling to continue standing she moved her head backwards in pleasure, enjoying the movements of the two guys trapped in her hit it.\"BUUUURRUUUURRPP!\" Marilyn  belched, pleased, Her belly began to churn and moan loudly as she rubbed it with both hands. \"Ooooh, stop moving, you're giving me a stomach-ache. HUU-UUPP!\".<br>\r\n<br>\r\nSitting against one of the crates she rested while her stomach digested the guys. For the longest time Marilyn could only sit there and digest, her belly too large for her body to pick up and move until, feeling tired, fell asleep.<br>\r\n<br>\r\n*******************************<br>\r\n<br>\r\nMarilyn opened her eyes only to be met with a crate. Getting up only to almost fall made her glance down only to be met with a wall of flesh and tattered clothes. Suddenly everything came crashing on her, the basement, the ladder and the fate of the guys. Lifting her head, her face betraying...</span></div></div>",
            "created":1413954300,
            "id":1875717,
            "title":"They're falling like flies"
        }
    },
    "info":{
        "author_id":"wtlamp",
        "author_name":"WTLamp",
        "brief_description":"The Goddess of Gluttony has given a random girl the ability to eat others.",
        "created":1373594580,
        "description":"<td align=\"left\" class=\"norm\">One day on a whim, Ensaesha, the Goddess of Gluttony, decided to bless a girl at random with the power to eat other people. Of course, all those calories have got to go somewhere; before long, the lucky girl will likely end up looking more like the Goddess who gave them the power.<br>\r\n<br>\r\nSo anyway, this is a vore and weight gain story focused around females. Put male characters in chapters if you want, but the primary focus should be on how incredibly fat and hungry that the female characters can get.</td>",
        "id":1942596,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1442933520,
        "modified":1442933520,
        "pretty_title":"Chosen to Eat (Others)"
    }
}