{
    "chapters":{
        "1":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Chandler Bing(Matthew Perry)",
                "Joey Tribbiani(Matt Leblanc)",
                "Ross Geller(David Schwimmer)",
                "Mike Hannigan(Paul Rudd)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick one of the boys that you would like to see tickled and worshipped by the other boys!</span></div></span></div>",
            "created":1361028960,
            "id":1533244,
            "title":"Pick one of the boys!"
        },
        "11":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Joey Tribbiani(Matt Leblanc)",
                "Ross Geller(David Schwimmer)",
                "Mike Hannigan(Paul Rudd)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who would you like to see tickle/worship Chandler?</span></div></span></div>",
            "created":1361029020,
            "id":1533245,
            "title":"Chandler Bing"
        },
        "111":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Worship Chandler's Feet against his will",
                "Tickle Chandler's feet and make him pay",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Joey and Chandler had plans to meet at the coffee shop after Chandler got off of work to hang out, but Chandler was at work for a really long time and he got invited to a party with his colleagues after wards. Chandler completely forgot about the plans and went out partying and dancing all night with his coworkers. He was out for a really long time and when he got home all he wanted to do was pass out on the couch and put up his sore smelly feet. Joey waited for Chandler at the coffee shop until it closed at midnight and Chandler had fully passed out when Joey walked in. Joey was mad because this wasn't the first time Chandler stood him up and he wanted to get back at him for doing it. Joey locked the door and saw Chandler laying down on the couch passed out with his smelly loafers propped up on the coffee table. Joey was extremely horny and even though he's a ladykiller and isn't gay he has a huge male foot fetish and he remembered how much Chandler's soft, smooth, sweaty feet turned him on especially after a long work day! So Joey decided to get back at him by playing a little game and he tied up Chandler on the couch and he tied him really tight with his ankles, knees, and wrists tied together so chandler couldn't escape *by this point he was extremely horny*. He says to himself, \"I haven't been this horny since I got to worship Ross's(David Schwimmer's) smelly tan soles that night in Vegas when he fell asleep\".Once Joey was done and Chandler was fully tied Joey walked over and sat down in front of the loafers to begin his fun! Joey slowly pulled off one of the worn smelly, lace less loafers to reveal an extremely sweaty extremely sheer nylon green sock and he automatically got a huge boner. Chandler's socks we're so sheer and thin that you could see every part of his feet from his squishy pink toes down to his thin arches and all the way down to his sweaty pink soles. Joey was turned on by the nylons and put the loafer up to his face and inhaled for 10 seconds *the loafer was one of the best things he's every smelled with the mixture of chandler's extremely smelly feet and worn leather* and then exhaled making an orgasmic noise \". \"Wow Chandler your feet are even sweatier and smellier than usual I think these are worse than your gym sneakers your feet really stink but it turns me on like crazy!\" Joey glued his nose to Chandlers sheer exposed toes and repeated the inhale exhale process \"Gosh your feet drive me nuts Chandler it's gonna take something big for me to let you go!\". *All of the dancing and sweating at the party and the twelve hour work day made Chandler's sheer socks and soft pink toes permeate through the room*. Joey moved to the other loafer and repeated the same process but this time was different this extremely smelly extremely sheer nylon sock had a huge hole in the sole exposing Chandlers beautifully tan/pink baby soft sole and Joey was in love! Joey automatically glued his nose to Chandlers warm, sweaty, smelly sole and sniffed it for 10 minutes \"Oh my gosh Chandler you and your feet and so beautiful I can do this all night! and that leathery smelly stench infactuates me!\" as he looked up to Chandler's sleeping face and he quickly sniffed the second loafer because it was sweaty and just out of curiousity he slipped is tongue into the worn down loafer where the sole was exposed grazed the warm worn down leather bottom. Joey was in taste bud heaven and loved the masculine taste of Chandler's smelly sweat so he slipped his tongue in again and licked the leather insoles clean! \"Oh my gosh Chandler I'm in love with your foot sweat too, the smelly masculine scent makes me want to eat your shoe!*. Joey looked at Chandlers two sweaty, smelly, sheer nylon socks and thinks about what he's gonna do next but he keeps getting spaced out by the beautiful hole in his right sock.</span></div></div>",
            "created":1361030640,
            "id":1533271,
            "title":"Joey Tribbiani"
        },
        "1111":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Continue(Rated R)",
                "Let him go he's had enough and he's learned his lesson by now"
            ],
            "content":"<div class=\"\"><div> <span>\"Now it's time for some good old fashion boy on boy revenge\" Joey said smirking to himself. Joey immediately started scribbling two of his long manicured fingernails on Chandler's sweat glistened exposed sole causing Chandler to jolt and immediately wake up. \"Mmmmph Mmmmmph Mmmmmmmmph!!\" Chandler screamed from the make shift gag that Joey made. Chandler could smell the stinky socks and taste the salty pungent sweat and a tear went down his face. \"Don't even bother to escape Chan I've got you wrapped up nice and tight there\" Joey continued, \"I bet you forgot our plans for the night did ya? Well I didn't and your gonna pay for forgetting about me for the last time!\". Chandler shook and tried to plead from underneath the gag as Joey glued his nose to one of the ultra sheer socks and inhaled a big wiff and exhaled with a sexual sound. *What the hell is he doing? Is he on drugs* Chandler said to himself as he cringed and continued to shake around with no luck. \"See what you don't know Chan is that I have a huge foot fetish and I've had my eyes set on your sweet creamy pink soles for a while now\". \"I'm gonna make you pay in the best and most pleasurable way I know how\" finished Joey. He dipped his tongue on the exposed sole and started gently wiggling the tip of his tongue back and fourth sending shivers down Chandler's spine. \"MMMMMMPHHH!!\" Chandler screamed from under the gag. \"Wow your sweaty soles taste as pleasant as I thought they would\" replied Joey. Planting his nose in the crevice of the all showing toes of the sheer sock and his tongue on the hole Joey started feeling his enhancing crotch and moaning pleasurably. Chandler was very creeped out by this but the feeling of the warm tongue on his sole started to make his bulge grow as well. Joey started to rub his nose all of the sweaty sheers until his nostrils were coated with the stench of his feet and started to lick all over them making his feet creamier and moister. As he was going up and down the protective layer of the sock he decided to stick his tongue into the side of the hole into the cavern of sweat and gunk causing Chandler to jerk and squeal. Joey's soft tongue gliding on the sweat cover feet was the worst tickle device he could imagine. Joey got excited and ripped off the whole sock from the hole. *Dammit* Chandler said to himself *those are my favorite pair*, only letting out a disappointed moan. Lets take care of this sock too as he pulled out a box cutter and tore it off gently. \"Nooooooo\" chandler moaned aware of the upcoming attack. Joey wasted no time putting two of Chandlers big toes in his mouth and sucking them up and down and he scraped the baby soft arches with his long nails. This sent off wakes of torture into Chandlers body and he started thrashing around  with tears pouring down his face. He could barely move and he was almost gonna pee his pants. Joey's tongue was swirling around the two big toes paralyzing Chandler to his core. \"Pleeeeaaaase\" Chandler pleaded from under the gag but Joey didn't listen as he immediately started gliding his tongue all over the pungent feet lapping up all the sweat and toe jam on the feet moaning and groaning all along. At this point Chandler couldn't even breathe and he was in physical pain. \"I see that your enjoying this Chan\" as he continued to show no mercy and winded his tongue around all ten toes. \"These are the best feet I've ever tasted Chan and I can see your enjoying this\" Joey said as he glared at the huge bulge in Chandlers pants. *I can't believe the feeling of Joey's tongue on my feet is turning me on I don't even like it* Chandler thought to himself as he caught his breathe waiting for the next attack. Joey decided to change his tactic and start nibbling on the soft flesh starting with the toes and sucking the balls of his feet while rubbing the bulge in Chandlers pants. *I can't believe this happening to me* Chandler said to himself as he was both scared and turned on scared by his best bud rubbing his man hood while being overcome with seizing laughter and rib pain. Joey nugged his nose into his friends soles as he reached one hand up and started pulling down Chandlers pants. \"No please anything but that Chandler muffled in fear and looked up to the sky in pain. He scribble the other hand on the feet and the slimy saliva made the feet ultra sensitive sending Chandler into another laughing fit. After the pants were down it revealed and small jock strap barely containing his hard penis. Now what?</span></div></div>",
            "created":1417041000,
            "id":1894141,
            "title":"Worship Chandler's Feet against his will"
        },
        "13":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Chandler and Joey?",
                "Mike(Paul Rudd)",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Ross has been out on the city all day on a hot summer day because he's been depressed about Rachel and he couldn't stand to be by himself for another minute. He's been in a full suit all day and loafers with no socks so he's extremely sweaty and he decided to go back to his apartment to pass out on the couch for a while who's gonna tickle him?</span></div></div>",
            "created":1432661880,
            "id":1983430,
            "title":"Ross Geller(David Schwimmer)"
        },
        "131":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Let the tickle/worship begin!",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Chandler and Joey have noticed how depressed Ross has been and they want to find a way to cheer him up. They'd been on google all day looking up methods they can use to help their friend. They finally found a recommended method on tickle torture to induce laughter and Joey had a secret foot tickle/worship fetish so he jumped on the idea and Chandler just played along. They decided to go over to his apartment to see if he was home. Lucky for them when Ross walked in he didn't close the door right away and he was laying down right on the couch with his loafers hanging over the armrest. Joey told Chandler to test and see if he was asleep as he pulled out the ropes they grabbed. Chandler gave him the all clear as he immediately started to tie the loafers together and threw Chandler some rope to tie his hands together. Ross had only taken off his jacket when he walked in and his white button up shirt still had large pitt stains. For the final touch Chandler pulled off his tie and gagged him with it. Now that Ross was completely restrained with no chance of getting out Joey took the liberty in pulling off one of the loafers exposed a large size twelve creamy tan foot. Joey was surprised at how beautiful Ross's feet were and the pungent smell gave him an instant erection. He put the loafer up to his face and inhaled as deep of a whiff as he could and exhaled with pleasure as Chandler looked over with a puzzled look. The smell was extremely strong because it was Ross's favorite pair of laofers and he wore them almost every day without socks. There was only a tiny hint of leather smell left cause he'd had them a month and the rest was of extremely pungent sweat that enveloped the room. \"Damn these are pretty rank Chandler get a load of these as he walked over and put the loafer to Chandler's face making Chandler turn his face in horror\" said Joey as Chandler responded \"wow those are some smelly dogs! I call tickling his upper body for a while first!\". Little did he know thats exactly what Joey wanted as Joey says \"of course!\" almost instantly. Joey's enthusiasm weirded Chandler out but he chose not to address it. \"So shall we get this show on the rode?\" said Chandler as started to unbutton Ross's shirt and noticed that Ross's eyes were wide open at this point and started to scream under his gag.</span></div></div>",
            "created":1432663500,
            "id":1983437,
            "title":"Chandler and Joey?"
        },
        "1311":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Continue the torture further!",
                "Finish him off!(Sexual)",
                "Let him go he's had enough!"
            ],
            "content":"<div class=\"\"><div> <span>Roars of confusion and terror came from under the gag as Chandler smiled to his face and proceeded to tear off his button up shirt. Before Ross could even blink Joey had the other loafer off and was thoroughly investigated the stench again. He dug his nose at the bottom of the moist loafer and licked the leather sole. *Mmmm* Joey moaned as he enjoyed the salty pungent taste at the bottom. He immediately dug his nose into the balls of Ross's feet and dragged his nose up and down the foot as Chandler started digging his fingers into Ross's abs. Ross started screaming in horror but the feeling of rubbing on his feet made him a little hard. As Chander saw Ross developing a bulge he moved one of this hands over out of instinct and started teasing and tickling the bulged area with his fingers causing Ross to thrash around. By now Joey was rubbing his entire face on Ross's beautiful tan soles. Ross was creeped out and could practically see the sweat and stench rubbed all over Joey's face but the sensation was making him even more hard and combined with the teasing of Chandler's fingers on the tip of his dick and the digging into his now sweaty abs he was completely hard. Joey decided to begin the tickle torture as he scraped one finger on the ball of Ross's feet causing him to jolt and giggle under the gag and he immediately unleashed all ten fingers on the two tan feet. Ross was screaming from under the gag as his soles wrinkled from the fingers and Joey laughed maniacally as his finger tips dug into the squishy soles. Every now and then he would feel Joey's nose hairs on the balls of his feet and hear him take a huge wiff and let it out moaning. All of a sudden he felt something moist and cold go up his foot and stop at his toes the sensation sent tickle shivers down his spine. Joey had begun to slurp up all the sweat and gunk off the creamy toes and soles sending Ross into a panic attack he was thrashing on the couch laughing his ass off and he could barely breathe. When he tried to take his mind off of his feet he felt Chandlers sharp fingers digging into his sensitive stomach. There were tears pouring down Ross's face and it was red as a tomato. He felt Chandler's other five fingers stroke his 8 inch dick causing him to precum. Ross could hear the sound of Joey now sucking on each individual toe and his lips smacking together as he moved from one to another. Joey was digging out ever crevice of toe jam Ross had and was moaning in content. Ross was about to pass out as he was roaring with laughter at the sensation of the sharp cold tongue weaved along his feet.</span></div></div>",
            "created":1432790340,
            "id":1984230,
            "title":"Let the tickle/worship begin!"
        },
        "13112":{
            "author_id":"oshamoshamesha",
            "author_name":"oshamoshameshaO",
            "content":"<div class=\"\"><div> <span>Ross felt utter ecstacy. Ross was completely straight, or so he thought, but the sensation of Chandler stroking his throbbing erection and Joey rubbing and licking his feet was too much. He could feel that he was about to shoot his load. They turned Ross on his back and took turns jacking him off. <br>\r\n<br>\r\n\"Oh yeah....\" Ross moaned into a pillow.<br>\r\n<br>\r\nSoon streams of Ross's cum shot into the air.<br>\r\n<br>\r\nA job well done, Joey thought. He hazed at Chandler, he's next.</span></div></div>",
            "created":1433592840,
            "id":1988465,
            "title":"Finish him off!(Sexual)"
        },
        "132":{
            "author_id":"blueemu",
            "author_name":"Blue Emu",
            "choices":[
                "Slowly start to take off Ross's left shoe, as it is slightly looser.",
                "Start sniffing and licking the bottom of Ross's loafers.",
                "Crawl around to the where the tops of Ross's feet are exposed and begin to sniff"
            ],
            "content":"<div class=\"\"><div> <span>Mike walks in, slipping through the front door to Ross's apartment. He whispers, \"Ross, are you okay? What have you been doing? \" Seeing that Ross is totally asleep, snoring deeply, Mike turns his attention to Ross's propped up loafered feet on the arm of the couch. He always wanted to do it, but, was this is chance? Mike closes the door behind him, locking it, and slowly crawls over to the edge of the couch where Ross's big feet await him. Mike can pratically smelly them through the loafers. What should he do?</span></div></div>",
            "created":1556236560,
            "id":2650367,
            "title":"Mike(Paul Rudd)"
        }
    },
    "info":{
        "author_id":"googooplexxxi",
        "author_name":"Googooplexxxi",
        "brief_description":"The Boys of the Tv show sitcom Friends tickled and worshipped by eachother! (M/M) only!",
        "created":1361028780,
        "description":"<td align=\"left\" class=\"norm\">The Boy's from Friends the Tv show get their feet tickled, worshipped, sniffed, and everything in between! Strictly (M/M) only but other than that have fun!</td>",
        "id":1919740,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1556236560,
        "modified":1556236560,
        "pretty_title":"The Boys of Friends(Tv show) Tickled!"
    }
}