{
    "chapters":{
        "1":{
            "choices":[
                "An adventure with two friends",
                "An Explosion",
                "Mark becomes a ghost!",
                "Military Possession",
                "Why not throw in an alien?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here is your chance to pick where the story goes next. Who possesses who? Where is the setting? It's all up to YOU! There's five different possible storylines to continue, a little for everyone! </span></div></span></div>",
            "created":1341637200,
            "id":1373608,
            "title":"Have Your Choice of Storylines!"
        },
        "11":{
            "choices":[
                "The Change"
            ],
            "content":"<div class=\"\"><div> <span>\"Wow this is amazing\" Shannon exclaimed while I struggled my way up the steep slope. \"Mark come quick, its amazing up here\" she shouted down to me and I looked up to see a laughing smile spread upon her face. \"Wait one second\" I grunted checking my footing on each rock to make sure that I don't fall down. With each passing step I feel the rays of the sun beat onto my skin until I finally reach the peak of the cliff with Shannon by my side. I gasp as the view that is below me, endless miles after miles of the untapped wilderness faraway from the usual buildings that replaces the wilderness. A refreshing gush of wind tingles my skin and I grasp my canteen of water and gulp down some water from all the hiking it took to get up to this cliff.<br>\r\n<br>\r\n\"Its amazing isn't it\" Shannon said as she laid down and unpacked her things getting ready for lunch. \"I can be here forever\" she smiled and I replied \"Yeah its amazing isn't it\" as I take a bite out of a sandwich and I continue \", much better than all of lifes drama\" and she nodded in agreement. I took another bite out of my roasted chicken sandwich brushed with lemon juice when Shannon yelled \"Oh my gosh\" horror spreading across her face. She pointed into the sky and I looked up to see an airplane ablaze coming right above our head until it crashed into the forests below far away from the cliff. \"Oh my gosh\" Shannon gasped while we both look at the blaze of the crash lighting up the distance. Suddenly the silence of the forest was broken again when a small metal box fell right next to us by the cliff. We both looked up in to the sky in hesitation and once we knew the coast was clear we walked over to the small metal box and examined it. \"This must have belonged to the plane\" I said picking up the box. I rotated the box in my hand to feel a heavy duty but light weight box which is locked. A small crack appeared unto the box but nothing significant to pry it open and I look at Shannon saying \"I wonder whats inside\".<br>\r\n<br>\r\n\"Who cares whats inside\" Shannon replied \", a plane just crashed and you're curious whats inside the box\" and she looked back to the destruction far away into the forest. \"I'm sure help will come Shannon, lets just finish out lunch and see what happens\" and Shannon replied with a sigh as we both sat back down and ate out lunch. We sat in silence not sure what to say until we saw multiple helicopters come out from the other side of the valley as people slid down a rope to the crash below. \"See Shannon they have things under control\" and she sighed \"I guess so\".<br>\r\n<br>\r\n\"Well then why not lets go to that waterfall\" I said trying to brighten her mood and she looked up at me and smiled \"Sure\".<br>\r\n<br>\r\nWalking through the woods was was a calming break from all the action that happened a while ago as Shannon and I casually talked down to the waterfall. \"Hello there!\" a man shouts from behind us and we turn around to see a man running from behind us. \"Thank god I finally found someone\" the strange panted \"I've been lost for two days and I thought I was going to die out here until I found you guys\" he gave a bright smile. I looked at him suspiciously while he talked. A mid aged man, he seems to have camping equipment with him but his attire seemed a bit rugged and dirty and I pushed my suspicion to the side for now and greeted him and said \"Hello whats your name?\" and he replied \"Its Joe\". \"Well Joe if you walk into the direction over there you'll end up in the Visitors center in about a hour or two\" and he nodded and sighed \"You think I can stick with you guys for a while? I need some time to rest and eat if you don't mind sharing some food and all. I rolled my eyes thinking how I was suppose to spend this time with Shannon and Shannon brightly replied \"Sure, we are actually heading down to the waterfall now so you're most welcome to come join us\".<br>\r\n<br>\r\n\"Great\" he smiled \",I wouldnt know what I would do if I never found you guys\".<br>\r\n<br>\r\nWhile walking down to the waterfall, Joe asked \"So what are you guys? Boyfriend Girlfriend?\" and Shannon laughed \"Nope we're just the best of friends since our childhood\" and he laughed \"Thats awesome\". I looked away in jealousy and sadness and I just wanted this guy to leave already. The roar of the waterfall came into ear shot and we finally saw it come into the distance. \"Wow this is awesome\" Joe exclaimed as we settled down by the river and enjoyed the summery breeze. We all jumped into the water enjoying the crisp feeling after being out in the heat for so long. \"So Joe where do you live?\" Shannon said and he replied \"I'm actually from the East coast and I'm on vacation how about you guys?\" and I reply \"We live around here\". <br>\r\n<br>\r\nWe continue to enjoy the scenery making little chit chat here and there and Joe said to Shannon \"You're cute\" and she giggled and said \"You're too\". This flared my anger and I said coldly \"Hey dude back off you're acting like your her boyfriend\" and he laughed \"Whats the problem man just complimenting your friend and its not like you guys are in a relationship\" and Shannon laughed \"Its all just for fun Mark calm down\". \"What ever\" I reply and I walk out of the river. As the sun went down we left the waterfall and Shannon asked \"Hey Joe why dont you stick with us for the night? We're only camping until tomorrow and you minus stick around so we can guide you back out of the park. \"Sure thing\" he said and all I can think about was how Joe seemed like just another guy who wants to take advantage of a girl. \"I know this great spot\" Joe said  its by the cliff follow me and as we followed him I ask \"So Joe you're lost but you know where the cliff is\".<br>\r\n<br>\r\n\"Mark\" Shannon exclaimed \", leave him alone, gosh you can be such a pain sometimes\" and Joe said \"No no its fine Shannon\" and he walked over to me \"Hey man lets be friends I didn't mean anything about earlier, friends?\" and I sighed \"Sure\".<br>\r\n<br>\r\nWhen we reached the cliff it was the same one we came from earlier and he said this is great spot. We sorted out our stuff and I watched as Joe helped us with all the coking and setting the tents up and I said \"Joe I'm sorry about earlier you really seem to be a good guy\" and he replied \"No its my fault man\".<br>\r\n<br>\r\nBefore dinner was set Joe looked out onto the cliff while Shannon was sorting the dishes out that I decided I should show the box to Joe just to be friendly. I put my backpack to my side and walked over to him and said \"Joe I have something pretty cool to show you\" and he said \"Oh really\". \"It came out of the sky from earlier\" as I went through my backpack but suddenly I felt my self picked up from behind and heard him laugh \"You know I always hated the smarter ones\" as he lunged me off the cliff. I heard Shannon scream while I flew to the ground below me and all I can think was what was he going to do to Shannon.</span></div></div>",
            "created":1341637200,
            "id":1373609,
            "title":"The Box"
        },
        "111":{
            "choices":[
                "The Next Day"
            ],
            "content":"<div class=\"\"><div> <span>I closed my eyes in pain thinking about what will happen to Shannon along my long journey to the ground. What will happen? Is he gonna kill her too? The ground rushes up to me and I wonder if death will be quick. The next few moments are hard to describe but once I hit the ground something strange happened. At first nothing. Black, nothing at all. But suddenly I feel a great pain on my back as if something is being ripped apart from the inside.So this is how death feels I think, as the pain intensifies but all of a sudden it stops and the whole forests envelops around me once again. I look around in confusion to see the cliff towering above me. \"But... I'm suppose to be dead\" and I look at the ground to see my clothes and backpack but without my body! I look upon my hands to see my hands but not really. In replace of my usual hands are transparent hands with a blue tint and the first though that comes to mind is that I must be a ghost. How did this happen? And it doesn't make any sense at all that my body hasnt been left behind when I died.<br>\r\n<br>\r\nSuddenly I realize that Shannon is still in danger. I suddenly find my self floating upwards and I mutter to my self \"This day can't get any weirder\". I fly up as fast as I can as the sun sets and I finally reach above the cliff and the first thing I hear is Shannon sobbing. \"Aww whats wrong\" Joe laughs at her \", he's not your boyfriend or anything\" as he approaches her. \"Get away from me you MONSTER!\" she screams as she stumbles and falls to the floor again and Joe grabs her and says \"You won't be getting away from me. You should have listened to your friend, don't trust strangers\" he whispers into her airs. I see Shannon flailing trying to get free and Joe pins her to the ground and snickers \"I'lll be enjoying you all night\" and Shannon wails as tears are pouring out of her eyes.<br>\r\n<br>\r\nI fly towards Joe and Shannon and shout at Joe \"Get off her you freak\" and of course no response. I take a gulp or rather a ghostly gulp and I motion to push Joe off Shannon ass he puts his full force on her arms and legs to restrain her. Upon pushing Joe, instead of him being pushed apart from Shannon I see my arms go straight through Joe like thin air and I sign \"I'm a ghost, I can't physically move things around\" but as I said this I felt a warm feeling coursing through my arms that the rest of my body didn't feel. My hands felt warm as if I had real hands again while the rest of my body felt cold and not covered. What happens Shannon screamed as Joe  began to unbutton her and rage welled up within me. I jumped onto Joe thinking I can pry him off, but instead I fly forwards into him without anything stopping me.<br>\r\n<br>\r\nAll of a sudden I gasp as as everything changes around me. I feel warm again unlike before and I jump in surprise to find Shannon whimpering beneath me as I find my arms pinning her down to the ground. \"Oh my god\" I say and Shannon looks up at me confused for a moment but tears wells up into her eyes again as she tries to flail underneath me. \"Shannon\" I say but I hear Joe's voice instead and I look quickly behind me anticipating Joe to clobber me but no one is there except the setting sun. Wheres Joe I think and Shannon sobs underneath me. Why am I holding Shannon down? I let Shannon go and I say \"Shannon...\" but instead Joe's voice is the only thing I hear. \"Oh my gosh\" I mumble as Shannon quickly gets up trying to run away. \"Shannon wait\" and she yells back at me screaming \"MONSTER\" but before she could get away I grabbed her wrist and pleaded \"Wait Shannon its me Mark!\". <br>\r\n<br>\r\nShannon looked at me confusingly and I continued \"Shannon please wait this is gonna be difficult to explain but its me Mark! Remember that time when we were kids and when I well... peed my pants in class? You were the only one who didnt laugh at me and ever since that day we were the bested of friends ever since\". The eyes in Shannon opened in shock and fluttered and she fell to the ground and as if the winds blew her off her feet. I grabbed hold of her before she fell to the ground and I laid her down gently not sure what to do next. I look upon my shaking hands to see my usual hands have been replaced by Joe's rougher and larger hands. \"Oh god this can't get any stranger\" I mutter and I hear Joe's voice leave my mouth. I shake my head in confusion as I look down upon my body to see Joe's larger frame with his dirtied clothes replacing my once clean clothes. I look at my new arms to see larger arms corded with muscles and I think I never stood a chance against Joe in a fight. <br>\r\n<br>\r\nI look down at Shannon and I sigh \"Well at least you're safe now Shannon\".<br>\r\n<br>\r\nI turn down the flames as the food for dinner is about ready, and I look into the sunset thinking if this is all a dream. How can I be a different person? Its not humanly possible! I go into Shannon's backpack and find her mirror and I fish it out and I peer into the mirror and gasp. The situation begins to settle in as I look into the green sea foam colored eyes that I never owned and instead of the face that I have grown up for the past 17 years I see it replaced by a mid twenty year old guys face that murdered me. Raising my hand to Joe's face I pinch my self and wince from the pain and I sigh realizing that I am not dreaming. Taking another look into the mirror I notice many features I have never noticed before and I guess its because its my face now. I place my hand through the short light brown hair on Joe's head and I feel a slight itch along his jawline as his new facial hair is growing in. \"This is too weird... I just grew 10 years older than what I really am and I am not even in my own body...\" I sigh sitting by the campfire we started before all this weird stuff happen.<br>\r\n<br>\r\nLooking into the flames I think about if I will ever get to go back to my normal life but I snap this depressing though in my mind by distracting my self with something else to do. \"Well if I'm Joe now then I guess all his belongings is mine\" I chuckle slightly while grabbing his hiking bag and bringing it closer to the fire. I unzip Joe's or rather my bag and I empty all its content onto the floor. Some food and water and alot of the essential hiking equipment. I gasp at the gun that is laying on the floor as I tentatively pick it off the floor and look at it for closer inspection. \"Well Joe you're a violent one aren't you\" I say. I empty out the bullets in the gun for good measures and I put it back into the bag. <br>\r\n<br>\r\nI look back into the fire just thinking about everything that has happened when Shannon moans and raises from her sleep. \"Ugh I had this worst nightmare\" she moaned and I reply in the nicest way possible \"Shannon I know what you're think but its me Mark! You can ask me any questions and I'll answer them\", Shannon becomes wide eyed and mumbles \"Oh my gosh this isn't a dream... Its ok Jo- Mark.... I trust you... Despite all this supernatural thing going on I noticed the whole change in the mentality... well when I guess when you took control...\" and she sighed \", I can't even believe I'm talking about this\".<br>\r\n<br>\r\n\"Trust me Shannon this isn't any easier on me than its for you\" I sigh \", I mean imagine dieing and then possessing the guy who killed you because he is about to hurt your best friend. Its mind blowing\", We both sat in silence for a bit until I asked \"Lets eat. I guess Joe worked up a big appetite and we both laugh almost like the old times. Eating the stew filled with vegetables and spices brought me back to old time and before we knew it the pot was empty. \"Wow Mark you ate ALOT more than you would usually eat... But I guess thats only because Joe's body is so much bigger than yours\". \"Yeah I guess but your stew was really great I'll make something for you next time\"<br>\r\n<br>\r\n\"Mark..\" Shannon sighed \"How did this all happen? What gave you the power to possess someone? And what are we gonna do about it? The problems keep on emerging one after another and its hurting my head...\". I walk over to Shannon and kneel down next to her and I take her hand but she winces and takes it away but I whisper \"Shannon its ok its me I know its hard to get use too...\" and this time she let me hold her hand. \"We'll figure out what happened tomorrow, and we'll go fetch all my stuff on the bottom of the cliff but its too late now so lets take a deep breath and calm down\". \"I guess so... but this stuff is like what comes out of a sci-fi show, lets just go to sleep and figure things out tomorrow\"<br>\r\n<br>\r\nWe both head into our own two small tents and I lay down in my sleeping bag thinking if I will ever be able to live a normal life again. Before drifting off to sleep I also thought what would happen if I am stuck in Joe's body forever.... I would probably be arrested by the police for some sort of trouble Joe go him self in and the thought really scares me. I yawn and stretch in my sleeping bag and I close my eyes into a deep sleep away from all the problems that faced me today and will face me tomorrow....</span></div></div>",
            "created":1341723600,
            "id":1373851,
            "title":"The Change"
        },
        "1111":{
            "choices":[
                "How is this happening?"
            ],
            "content":"<div class=\"\"><div> <span>The birds songs are is everywhere around the forest; waking me up to a nice start of a new day. So much has happened in the past day, as I roll around in the tent slowly waking my self up. The sun rays are peeking through my tent and I sigh thinking maybe today can be better than yesterday which is highly unlikely. Suddenly I hear the chirps of the birds stop with birds fluttering away into the distance as I groggily get up from my sleeping bag wondering whats causing the disturbance. <br>\r\n<br>\r\n\"Come out with your hands on your head!\" A man shouts from outside the tent. Suddenly my heart stops as I'm unsure what to do next. I slowly get up from out of the tent to see multiple cops surrounding the tent with guns pointed at me. \" I didn't do.....\" but then I realize I'm in Joe's body and I know what he did to put me in this situation. \"Yeah thats the guys who killed my friend\" I hear Shannon say behind one of the cops and I take a step forward saying \"Shannon what are you--\" but I suddenly see the blunt of a gun slam into my face. I fall to the ground in agony as the darkness once again begins to envelop around my senses.<br>\r\n<br>\r\n----------------------------------------------------------<br>\r\n<br>\r\n\"Its alright Shannon, you're safe now\" Greg said while he and his fellow officers brought down their gun. \"We'll bring you back to the police station for some questions and we'll bring you back home\" Greg continued and Shannon mumbled \"There is no home\" which caught Greg's attention but he didn't respond. Greg watched as Mike and Dirk handcuffed the murderer named Joe who pushed Shannon s friend over the cliff and all he felt was sadness for how Shannon must be feeling right now. Greg turned to Shannon and said \"Shannon we brought your friends stuff back up but all we found was his clothing and hiking bag...\" Greg held back the fact they also found a pool of blood around the clothing as well but Mark's body disappeared without a trace after that. \"Here you can hold his bag while we get back to the station... I know how it must feel right now Shannon but Mark's killer has been caught and there will be justice\" Greg said putting a hand onto Shannon's shoulder.<br>\r\n<br>\r\nWhile driving back, Greg chatted with Shannon for a little hoping to brighten her mood but he left her alone after she didn't seem to want to talk. Upon reaching the police station Greg watched as they dragged Mark who was still unconscious into the police station to be detained and interrogated. From what Greg heard, Joe has a police wrap for other offenses such as sexual harassment but this is the worst of them all. \"Cmon Shannon we just need to ask you a few questions\" Greg said to Shannon in the back seat and she nodded as they both got out of the car into the police station. Greg brought Shannon to one of the questioning rooms of the station and he said \"Here have a seat, would you like a cup of coffee or water?\" trying to be friendly as possible. \"No thank you\" Shannon replied softly.<br>\r\n<br>\r\nGreg sat down across from Shannon as he took out a notepad and began asking Shannon some questions about the horrid murder.<br>\r\n<br>\r\n--------------------------------------------------<br>\r\n<br>\r\nThe first thing I felt when coming around was  the throbbing feeling in my head. It feels almost as if my head was ran over a car as I let out a moan. \"He's coming around\" an unkown man says on the other side of the room. I open my eyes to find my self in a bare room with nothing except for the table in the certain of the room with a police officer from sitting across me. I tried to move but I found my arms tightly bound by the metal handcuffs securing my arms from moving around. I look across to see the police office go through a pamphlet of papers as he says \"Joe you have quite the criminal record\". I look at him without saying anything and he continues \"Did you murder Mark Lore\". <br>\r\n<br>\r\nI sat there unsure what to do and all I thought about was how am I gonna get to Shannon and get out of this situation. I don't wanna be stuck as Joe forever in Jail paying for his crimes. I begin breathing quickly as my heart races as I look around the room trying to find a way out. I need to get out and find Shannon! \"Wheres Shannon\" I said quickly, and I hear Joe's voice leaving my mouth. \"You won't be ever seeing her again\" the police officer said. There was a knock on the door and the police office got up and left the room as I look around finding my self alone. I have to get out! I begin to wiggle in my seat not sure what to do. Desperation begins to settle in as I begin to cry. I have to find Shannon! Suddenly I find self slowly losing control of Joe's body as my control over his body becomes limp. The cold sensation begins to slowly creep around me as I slowly float out of his body and I look down to find my self floating over Joe's body. \"Where am I\" Joe said struggling as he began to yell in anger. The police man came back in and resumed the interrogation and I watch as I see the fear in Joe's eye slowly creep in.<br>\r\n<br>\r\n\"You deserve it you bastard\" I say without getting a response from anyone in the room.I'm filled with joy being relieved of Joe's body as I set out to find Shannon. I touch the wall of the room tentatively to find that I can slip my way through it as if is air and I take a slide in finding my self in a bustling office of officers walking about talking to their co-workers and answering phone calls. \"I must have woken up in the police station\" I mutter as I float about the office. Suddenly an officer walks through me from behind and for a split second I felt the warm sensation of having a body to only having it disappear again. The officer stumbles slightly and looks around and shakes his head muttering \"Must be working to hard\" as he turns around the corner.<br>\r\n<br>\r\n\"Yeah they got them\" I hear a police officer say. I turn around to see two police officers talking in their cubicles as I float over to them eavesdropping into their conversation. \"They brought in a girl named Shannon and the guy who supposedly killed Mark\" the woman named Julie said. She continued \"I think they are in two two rooms\" she pointed across the room. I instantly left and floated to the other room I knew I didn't come out from as I look around cautiously thinking someone is about to stop me from entering. I look into the room and float in to find a police officer and Shannon sitting by a table as the police officer wrote notes down while asking Shannon questions. \"Shannon\" I whisper as I float up to the table. She looks really worn out and tired and her eyes are reddened from tears. \"I think that's good enough for now Shannon\" the police officer says to her. I look at his name tag to see the name Greg Thomson - Police Investigator branded onto his metal name tag. \"I'll bring you back home now to your parents now\" Greg said to Shannon and Shannon shook her head. \"I live by my self\" said replied and Greg looked saddened and said \"Oh.. ok... wait one second as I just search up your basic information to get you back home safely then\" as he got up to get out of the room. <br>\r\n<br>\r\nAs he left the room, I looked at Shannon feeling sorry for her. She has had a rough life. Her mother died when she was very young and ever since her father has never payed her much attention as he went about his business trips across the world. Her father is a very rich business CEO and he gave her plenty of money to just get her off his shoulders. Ever since she has been living alone while her father just gives her more things that money can buy but never something that money can't buy such as love and being a family. I look down feeling sadden, thinking about my own family and how crumbled it became too. Both of my parents are alcohol addicts so Shannon and I always goes out on our own to get away from our family affairs.<br>\r\n<br>\r\nGreg came back walking in looking a bit surprised looking down upon the papers. \"So you live in the condos on 11 Elm Street Room # 256?\" he said sitting down. Shannon shook her head for yes and he continued \", I know that things are rough for you now and your family situation doesn't make it any better\" he said while double checking the paper but if you ever need support just give us a ring and we'll be there for you\". Greg seems like a really nice guy trying to console Shannon. A 40 year old police officer, he has a complete bald head while I notice he has quite the beer belly setting in. \"Sorry Greg, but I have a friend to protect\".<br>\r\n<br>\r\n-------------------------------------------------------<br>\r\n\"Well we'll be bring you back home\" Greg said to Shannon giving her a smile as he got out of his seat to lead her out of the room. All of a sudden Greg lost sensation of his torso and his vision became blurred. \"Ugh\" Greg moaned as he gripped onto the table for support and he began to panic what was happening. Am I having a heart attack? As he slowly lost the sensation of his whole entire body. It almost felt as if something was slipping inside out of his that he couldn't see until everything blanked out.<br>\r\n-----------------------------------------------------<br>\r\n<br>\r\nI slowly entered Greg's body unlike with Joe and how I pushed my way into his body. I felt the warm sensation slowly fill up the coldness of being a ghost with each second that passed by. Greg began to twitch as I entered his body and I began to feel his limbs become my own. I grunted or actually Greg grunted as he fought to stay in control. He lost grip on the table and I fell down with him as we came crashing onto the floor and I hear Shannon saying \"Oh my gosh are you ok?\".<br>\r\n<br>\r\nI look up at Shannon and smile now under full control of Greg's body. \"Never better ShanShan\" I sigh smiling at her as I see her realize who is really behind Greg's eyes</span></div></div>",
            "created":1341723600,
            "id":1374137,
            "title":"The Next Day"
        },
        "11111":{
            "choices":[
                "Playing Cop"
            ],
            "content":"<div class=\"\"><div> <span>I get up off the floor and smile at Shannon and I say \"You know who I am this time ShanShan?\" and she looks at me in bewilderment. \"But... I thought it wasn't true... But only Marks ever calls me that... So its really true Mark it was you in Joe?\"  and I reply happily \"Yea-\" and  unexpectedly she jumps on me laughing \"I can't believe its you! I would of have been so lost without you Mark\" she cries a tear of joy. \"Its alright Shannon I'm here now... sort of\" I laugh looking down upon Greg's body. \"Lets get you out of here\" I say still not accustomed to Greg's deep voice. <br>\r\n<br>\r\n\"Wait, this is just too weird... I mean how does it feel to be in a different body, I can't even take you seriously while your in that police officers body....\" Shannon sighs and I sigh too \" Shannon its strange trust me, but inside of this officer we both don't know is me, so lets get out of here first before talking more about this\".<br>\r\n<br>\r\nWe both walk out and I look around thinking someone will see me for whom I truly am but everyone goes about their business not even giving us a glance. \"Coast is clear\" I chuckle, but then an officer walks up to me and Shannon and says \"Done with the questioning?\" and I reply maybe a bit too quickly \"Yeah\". I realize its the woman from earlier named Julie and she looks at me and says \"Greg where are the papers you took the notes down on?\" and I stutter \"O-oh yeah I forgot them in the room, silly me\" I let out a nervous laugh. \"Thats not like you Greg\" Julie laughs as I went back inside to grab the papers. I take a last glance at Shannon to see if she would be ok alone for a bit and she gives me a nod as Julie chit chats with her for a little. I walk back into the room and grab the papers to see a list of analysis Greg has written down onto the paper over the interview. I flip through it not interested as I head back out and hand Julie the papers. \"That should be all of it\" I say smiling at Julie and she nods and says \"Thanks, and Shannon it'll get better\" as she heads back into her cubicle. <br>\r\n<br>\r\n\"Well lets go Shannon\" I say in an authoritative voice as I lead her across the station to the door leading outside. Leaving the station, we both see a parking lot of many police cars and I gulp in hesitation \"How am I suppose to find Gre- I mean my police car?\" as a bead of sweat rolls down by face. \"Why don't we take a look at your wallet idiot\" Shannon laughs \", I bet it has some form of information in there\".<br>\r\n<br>\r\n\"Thats a good idea\" I grumble \", and don't talk to me like that I'm a police officer\" we both laugh. I pat both of my pocket to find Greg's wallet and keys and upon closer examination I laugh at Shannon \"I found a much easier way\" as I click the unlock button on the car remote on his set of keys. A beep comes from the car to our very right and I say \" Follow me miss. I'm bringing you home \".<br>\r\n<br>\r\nWe both walk up to the car and I chuckle and look at Shannon and I say \"Like my ride?\" and she laughs awe we both get into the car. \"Uhh I don't even have my license yet\" I say sitting in the drivers seat. \"C'mon Mark you have your permit that's good enough plus YOU do have your license, you're Greg remember? Just drive slower its not like anyone is going to stop a police car\" Shannon laughs. \"You know this is actually pretty cool\" I say still not used to Greg's voice \", It's almost I'm actually a police officer\" and Shannon cuts in \"YOU ARE A POLICE OFFICER\" and I laugh \"You know what I mean.\"<br>\r\n<br>\r\nWhile driving along on the road, I gulp and say to Shannon \" Things are really going to change...\" and Shannon nodded in silence but then said \"Look on the bright side Mark, its either this or no more you and I am pretty sure I would have this than no more you\" and I reply \"I guess so.... thanks Shannon it means alot\" and she replies \"No problem dork\". I continue to drive until I end up at the condo complex Shannon's father pays for her and we both get out of the car unsure what to do next. \"Ugh I cant wait to just lay down and not worry about this mess for a while\" Shannon said while she led me up to her condo. I look around still amazed at just how luxurious the area she lives in. Car after car, I see only the top models and the don't even get me started on the swimming pool. We finally arrive at her room as she unlocks the door and lets us both in and she sighs while shutting the door. <br>\r\n<br>\r\n\"Want something to eat? I'm famished\" she says as we walk into her kitchen. \"Umm, sure why not\" I reply and she fishes out some cold pizza and soda as we eat it sitting on her couch watching some cartoons. \"This is great\" I say my mouth stuffed with food and she replies \"Yeah, alot better now we are away from that huge mess, but we still don't know how this happened Mark! I mean look at you! You're in the freaking body of a 40 year old police officer named Greg!\"<br>\r\n<br>\r\n\"Think! How could of this happened!\" She moans looking at the TV and I try to remember the instant I fell what happened and I reply \"Well.... I do remember feeling this weird sensation.... on my back\" and Shannon instantly pops up and says \"It must be the box inside your book bag\" and she scrambles to the table and unzips my bag and fishes out the box that fell out of the sky. <br>\r\n<br>\r\n\"Well whats left of it\" she says, as she brings out the metal box, or at least whats left of it. She opens the box and we look inside to see an empty vial with a little note inside. Shannon grabs the note and unfolds it and reads it and her mouth opens and she stutters \"Wha-t is this...\" and she hands me the piece of paper over. \"You'll be most pleased with the results of what we have created. Use it wisely I don't think we will ever be able to create another vial. We wish you luck in using your new found powers in taking control over many business and bringing down that scumbag political party... What does this mean???\" I question and Shannon sighs \"Mark its obviously some crazy maniac who create a type of chemical which imbued you the power to become a ghost and possess people!\". Shannon begins to pace around the room and she continues \"Obviously this was bieing sent to another maniac who was going to use it to his advantage and do something horrible...\" and suddenly I find her eyes pouring into me \", Mark we might just have saved the country from alot of problems! But I'm sure the plane wasn't just falling out of the sky out of coincidence, we'll have to find out the meaning behind this.\"<br>\r\n<br>\r\nSuddenly a cell phone goes off as it vibrates in Greg's pocket and Shannon says \"Pick it up\". I tentatively pick up the phone, which just so happens to be a smart phone and I pick up the call saying \"Hello Ma-Greg speaking\" and Shannon gives me a glare and I give her back a shrug. \"Greg are you done dropping off the girl? We need you back here when you're done we have alot of paper work that needs to be done\" and I reply in \"Uhh yeah sure thing I'll be back as soon as I can\" and I hang up the phone. <br>\r\n<br>\r\n\"What do they want\" Shannon asks and I reply \"They want me or rather Greg to get back to the station to do some important paper work. Shannon shouldn't I just de-possess Greg and let him go on his own? I mean I sure don't wanna be doing his job for him and it's better if we stick together\" and Shannon nods in agreement. \"Sure just do your thing and I'll find you a good body to take control of for a while and then we can find out more about this problem...\". \"Alright here goes\" I say as I close my eyes trying to get the same sensation from earlier. <br>\r\n<br>\r\nNothing happens and I try harder and harder and Shannon says \"C'mon mark we don't have all day\" and I grunt \"I'm trying Shannon but its not working...\". I continue for a few more minutes with no avail and I say sadly \"I think I'm stuck...\" and Shannon replies \"This can't be good...\".<br>\r\n<br>\r\nGreg's phone rings again and I quickly pick it up to hear yelling on the other side \"Greg what are you doing! It doesn't take this long to drop off a girl at her home who lives only 5 minutes away! We need you right now what are you doing?\" a man yells on the other side. \"Sorry, the girl started crying so I was consoling her\" I said making up a lie and Shannon gave a funny smile at me. \"Well hurry up Greg, this is important stuff... It's about the crash in the park\" and the man hangs up. <br>\r\n<br>\r\n\"Oh gosh\" I say shoving Greg's phone back into his pocket \", They want Greg back at work because it has something to do with the plane crash...\" Shannon looks at me and says \"Well go on then go, we can't do anything about your problem with now and it actually this is perfect. You can be our inside eyes on whats happening and they'll never suspect a thing\" Shannon snickers. \"This isn't a game Shannon\" I moan \"I mean look at me as I point into the mirror \", I just want to be back to normal. Not in some 40 year old police officer who has a beer belly\" as I take both of my hands and shake the bulging belly up and down. Shannon laughs \"Oh my gosh that look too funny\". I pouted and said \"Well at least someone is finding fun out of this\" and Shannon says \"I'm sorry Mark, but you have to admit that would look funny if you were looking from the outside\". <br>\r\n<br>\r\n\"I guess so\" I smile \", well I better be off back to the station before they explode\" and Shannon gives me a tight hug and whispers \"Come back soon\". I nod and leave her condo to find my self alone again walking to an uncertain future in the body of a 40 year old police officer who probably had too many donuts.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1341723600,
            "id":1374517,
            "title":"How is this happening?"
        },
        "111111":{
            "choices":[
                "Double Trouble"
            ],
            "content":"<div class=\"\"><div> <span>I walk back outside heading towards the police car with many thoughts swarming around my mind. What is this plot behind this chemical that bestowed me of this strange power? How come I can't leave this guys body unlike the other time? When will be the next time I see Shannon? I walk up the police car and unlock the door, entering it as if I have done it many times before. I tilt the rear view mirror and I see the face of the police officer named Greg looking back into the mirror. I bring my hands up to my head as I touch his smooth bald head and I let out a soft chuckle thinking about the fact I have no hair. Staring me back into the mirror, I see a a mid aged with a circular face who is clean shaven and I give a smile to see my reflection of Greg give a smile as well. \"Well Greg I guess I'll be you for a while\" I say hearing Greg's deeper voice leaving my mouth. I tilt the rear view mirror back into its correct position and I drive off back to the police station to see what<br>\r\nis in store for me.<br>\r\n<br>\r\nI pull into the police station and I glance at the watch on Greg's wrist to find out is is 2:11 PM as I head out the car and lock the door. I walk nonchalantly back inside the door back into the bustling office of the police station when a man comes walking towards me from my left. \"Finally Greg\" he says \", we have alot of work that needs to be done so follow me\" and I nod giving a simple \"Alright\" and before he turned around I caught his name, which read \"Thomas Philman\". Thomas was about the same age as Greg, but he has a set of brown hair on top as the grey hairs starting growing in. I followed him through the office into a room that I read as his own. He unlocked the door with a scan ID and he led me in and locked the door behind us. He flipped the blinds in his room and he sat by his desk and I sat by the seat across him. I look around to see a clean small office with pictures scattered around of him with some well known people.<br>\r\n<br>\r\n\"Lets get down to business\" Thomas said and I look back at him and nod with the most serious face I can put on. He spread out pictures of the plane crash from afar and he said \"Here take a look\" and I looked at each one and I thought this was everything I've seen with Shannon nothing new and I reply \"Alright what about them though?\". \"I'll tell you what about them\" he scoffed \", something strange is going on Greg and we both know it. They surrounded the plane and wouldn't even let us in. I'm telling you that something special was on that plane\" and I question \"They?\" unsure what he meant by that,<br>\r\n<br>\r\n\"What are you today Greg? Slow? We already had this discussion before\" and he sighed \", sorry its my fault, you were out on the murder suspect and we had a really quick talk. They as in some top government officials.\" I nod and reply \"Oh yeah I remember\" leaning back onto my seat and I continued \", well we can't do much about it then can we?\".<br>\r\n<br>\r\n\"Well currently not really, but they contacted us and they said that the plane may have dropped some cargo and that if any has been found it must be reported and brought to them right away. They said its 'dangerous' if found in the wrong hands, and if I remembered correctly didn't that young lady from earlier tell you that a box fell out of the sky?\". I suddenly felt as if the room was closing in around me and I respond \"No I don't think she has\" and as I said this I see a frown appear onto Thoma's face. \"But you clearly wrote in your notes quoting what she said! Greg is your memory going whack or something\" he said handing over the papers. I grab it reading the notes that I saw from earlier and I notice the part where Greg wrote it before I possessed him. \"Oh yes... sorry Thomas I'm just not feeling that great today\" I say handing over the papers. \"It's alright Greg the works gets to all of us\" Thomas says.<br>\r\n<br>\r\nA knock on the door suddenly interrupts our conversation and I let a quick sigh of relief as Thomas gets up to open the door. He opens the door and I look around to see Julie standing there and she says \"The food order came in so come out\" and Thomas replies \"Greg and I are in a serious discussion right now so we can't eat out with the rest of you right now sorry.\" and Julie replies \"Sure thing\" and Thomas heads out to get the order while I am sitting there in his office alone. I look around and take a closer look at his pictures and I see a picture of his family. \"Something Shannon and I don't have\" I mutter and he comes in through the door as I sit back down in the seat. \"Got your favorite\" he said as he handed me a Chinese take out container. \"Thanks\" I reply as he gets back into his seat and starts eating his food as well. I open the box to find Egg Foo Young and I slip a disgusted face knowing perfectly well that I don't like whats in the box.<br>\r\n<br>\r\n\"Is something wrong?\" he said giving me a confused face and I reply with an awkward laugh \"No no\" as I take out the chop sticks and eat the container of food. I slowly place the food in my mouth to expect that same disgusting flavor that I tasted from trying it before but for some reason this time the food tasted amazing to me. \"Wow this stuff is great\" I exclaim and Thomas booms laughing \" Greg you tried this stuff so many times, of course its great. I mean you reacted as if you tried it for the first time\" he chuckled and I reply \"Uhh, well you know I'm hungry\" patting my now large stomach. \"You better watch your self Greg, don't want to over indulge your self now\".<br>\r\n<br>\r\nWe continue to eat until we finished and he said \"Well back to business, I need you to go back to the girl and find out what the box is and bring it back here\". I gulp at the situation he is putting me in and he continues \". also I need you to do a bit of research on the plane. The only information we have on the plane is the the model number and what direction is was heading which is east. See what you can dig up and get back to me\" and I reply \"Uhh sir, I don't think I can get back to the girl today, she seemed like she didn't want any visitors for the rest of the day and we need to be on good terms with her\" and he nods and says \"Well go tomorrow, the sooner the better\". I nod and disliked his response and he continued \"Well get researching\" as he led me out of his office \"Oh yeah here are the pictures if you need them for some chance\" and he shut the door behind me.<br>\r\n<br>\r\nI find my self once again in the bustling office and I look around in confusion where Greg's computer is. I walk around casually to find that all the smaller cubicles are all taken with someone sitting down and I look back around thinking that Greg may have his own office like Thomas. I take a stroll passing by each office of people I don't know until I notice one office is entitled Greg Smith. I look around a bit frightened that someone will stop me but I take a deep breath and remind my self that everyone sees me as Greg Smith and that is good enough. I try the door to find its locked and I look to see it has a same scanner like Thomas's office had. I look upon Greg's uniform to find his ID in a protector and I drag it out to find that it has a little retractable line connected to it. I pull it and look at it to find a picture of Greg looking into the camera with a stoic face. Underneath his picture it reads \"Police Investigator\" with a bar code underneath. I slide the ID card underneath the scanner and I here a little click from the door to Greg's office. \"Sweet\" I whisper to my self as I grab the doors handle and open the door to allow my self. I quickly shuffle my way in and shut the door behind me to find a similar office like Thomas had. I turn around to notice that from Greg's office, he has a view of the rest of the office which leaves me feeling a bit exposed. I close the blinds to find my self in darkness, and I look around to find a switch for the light in the room.<br>\r\n<br>\r\nI find a switch by the door and turn it on, and instantly the room is illuminated and a fan begins to spin on the ceiling. I walk around the office to find  a few cabinets with a desk centered on the end of the room. I find pictures of Greg with his co-workers while looking at the wall around his room. I also find a big leafy plant in the corner of the room and I turn around and look at his desk. Planted to the side, is a wide 25 inch monitor and I couldn't help my self but grin and say \"Man I wish I had this thing for my games\" as I wrap around to the back of the desk. I sit down in a nice plush leather seat and place the papers in front of me as I look around the room from the desk of Greg Thoma's. I laugh slightly and smile thinking how cool it is to have my own office and everyone thinking I am some respectable police officer named Greg. I look around on his or rather my desk to find some piles of papers placed neatly to the side and I notice some pictures of Greg with a teenage girl and a young boy and his arms around a woman around his age as they all smile into the camera. I gulp \"Oh god... I'm married?\" and I look at my hand and notice a wedding band I never noticed or felt from earlier. \"I flip the picture of his family to the other side, not able to stand the idea of being a father of a family and I mutter \"Well I minus see what I can dig up on the plane\" as I give the mouse a flick and see the screen light up. Instantly I moan as I see a screen flashing before my eyes saying \"Enter Password Here...\"<br>\r\n<br>\r\nSuddenly I feel the office closing in around me and I gulp \"Maybe playing cop wasn't the best idea...\"</span></div></div>",
            "created":1341810000,
            "id":1375108,
            "title":"Playing Cop"
        },
        "1111111":{
            "choices":[
                "The Family Man"
            ],
            "content":"<div class=\"\"><div> <span>The flashing screen asking for a password flashes in my face and I sigh \" What am I suppose to do now?\" as I lean back into the comfy leather chair. I take another look at the pictures Thomas gave me with nothing new except for the model of the plane and what direction it was heading but I can't even do a simple search on the internet. I take out Greg's phone wondering if I should ask Shannon to help do the research but I realize that this might be a work phone. The last thing we need is for them to notice a police officer calling a teenager girl. I sigh dumping the phone on the desk and I mutter to my self \"Things just can't get any worse...\" but then slowly I realize that my answer is right in front of me. I grab Greg's smart phone and I instantly start browsing the web for information as I input the model number of the plane into a search engine.<br>\r\n<br>\r\nI watch as the results starts pouring in as I scroll through the first few pages to find that only about a 100 of these models were made over the past 5 years and they don't come cheap. I scan through more pages with no avail and I dump the phone back onto the desk as I sigh while closing my eyes. \"I guess that's better than nothing\". Slowly I feel a drowsiness come over me and I try to shrug it off thinking I should be working but then I smile. I'm living in the life of a police investigator who just so happens to have his own office. What is there to worry about, its not like its my life. And I let the drowsiness overtake me as I find my blanking out before I can think about anything else.<br>\r\n<br>\r\nSuddenly my quick nap is disturbed when I hear a knock on the door. I instantly snap from my snooze as I was half way through a snore to find my self drooling quite alot. I grab a tissue from the box on Greg's desk and I wipe the saliva on my face and I try to pat down the small pool of drool that has accumulated onto the police uniform. I pat my self down and head towards the door to find Thomas standing there and he says \"Find anything good?\" and I reply \"Nothing much, but I did find out that there is only about a 100 of the planes made and they are quite expensive to make\". Thomas nods and says \"We shouldn't go that far into this, but I have a strange feeling about this... and I don't think that plane crash was an accident if you get what I mean\" .<br>\r\n<br>\r\n\"Well Greg, it's really none of our business anyways since the government seems to be handling it but I can't just help be curious. Anyways just make sure you get to that girl tomorrow and figure out what they found. The last thing we need is for a civilian to have something that was never meant to be in their hands.\" Thomas explains and I nod in agreement not trusting what I would say. \"Oh look at the time\" Thomas smiles \", 7 o clock time to go home, get your stuff and we'll head out together\" and he heads back into his office. I turn around not really wanting to be around more of Greg's co workers but I shrug it off as I head back into Greg's office. I look around wondering what I should be grabbing. I grab the smart phone I left sitting on the desk, and I look around unsure what else to grab. I have Greg's wallet, cell phone and keys... but then I suddenly realize I am only left with keys to the police car. I head towards Greg's desk looking for his other keys and I begin to panic as I am unable to find it anywhere.<br>\r\n<br>\r\nSuddenly I here another knock on the door, and I open the door to find Thomas all set and he questions \"Can't find your keys again?\". I smile feeling relieved at how the situation has worked out and I say \"Yeah, if I lost them man...\" and he walks in saying \"Lets find them quickly\".<br>\r\n<br>\r\nAfter a quick check I actually found the keys my self which were hanging on the clothes hanger. \"You need to have a better memory\" Thomas jokes and he laughs \" don't forget to leave the police car keys with Julie or else she'll explode on you like last time\" and I let out an awkward laugh \"Of course I won't forget about those\" as I close the office door behind me. We both walk over to Julies desk and we hand over our car keys and she says \"The next time you forget to bring them back to my Greg it will be the end of you\" and Thomas laughs and I laugh with him unsure whether if she meant it or not.<br>\r\n<br>\r\nWe both walk back out into the police station to the back parking lot where the officers keeps their real cars and Thomas says \"Well see you tomorrow\" as he enters a nice SUV and drives off. I gulp looking into the sea of cars unsure which one Greg owns as I take out his ring of keys ready to try every car if I had to. Looking at the set of keys I notice one of the keys has the iconic Jaguar symbol branded onto it and I grin \"This is like picking an apple of a tree\" as I scout for a Jaguar. After walking a few, I notice a Jaguar parked in the middle and I walked to it, maybe a bit too hastily as I try to hold in my excitement to drive such a sweet ride. I walk around the car admiring its beauty and I smirk \"Nice ride Greg or rather nice ride to my self\" and I unlock the door and leap into the drivers seat. I eagerly turn on the engine as I hear the engine roar to life and I let out a bring grin spread across my face. I zip out of the parking lot, enjoying the rush of being in the drivers seat of such a nice car. I turn on the radio and blast it as I drive down the road heading towards Shannon's condo.<br>\r\n<br>\r\nA few minutes of the joy ride, I end up at the condo complex as I pull in and park my car. I head upstairs and knock on her door as I wait for her to open the door. While waiting someone walks down the hallway and notices me and begins to walk a bit slower. Why is he acting so weird? And then I remember I'm a cop and that most people are wary around cops as I chuckle to my self. \"Umm did something happen\" the guy comes up to me and when I take a second glance I realize its the fitness instructor named Mike who was given a job by Shannon's father to make sure that Shannon stays fit. \"Just checking up on Shannon after her ordeal\" I say in an authoritative voice and I continue \", nothing to worry about\". Mike nods his head as Shannon opens the door and she says \"Hey Ma- I mean hello Mr. Smith\" as she shot a glance at Mike. \"Well I hope everything turns out well Shannon. Are we still on for tomorrows exercise?\" and Shannon replies quickly \"I don't think so I'm not feeling the best right now\" and she looks down on the ground looking depressed. \"Oh... well I do hope you feel better Shannon\" and he walks further down the hall and down the stairs. \"Well now that's out of the way come in Mark\" Shannon bright says as she closes the door behind us. <br>\r\n<br>\r\n\"Shannon you should never assume I'm in a persons body, we don't need to hint people at what may be happening\" I say as I slouch my self across her couch. \"Oh Mark, no one is going to believe it anyways\" she says \", so what did you find out?\" when suddenly I hear foot steps coming out of her bathroom. Suddenly I find Tom looking at me, as he suddenly stopped mid way in the hall way unsure what to do next. I take a furtive glance at Shannon and I whisper \"Does he know\" and she sighs \"Well I tried to tell him but to be honest I don't think he believes it\". Tom has always been Shannon and my friend since middle school. He's a bit shy and he likes to stay inside his room alot using his computer or reading sci-if books, which is why he never came to hang out with us on our camping trip. \"Well uh.... Hey Tom\" I say wondering how it feel to see a cop standing in your friends home. \"I'm not gonna bite Tom, come out here\" I say in quite a demanding voice and he quickly walks out saying \"Yes sir.\" <br>\r\n<br>\r\nI laugh and I say \"Tom, it's me Mark\" and he just nods his head unsure what to say. \"Shannon I still don't think he believes it\" and she sighs walking up to Tom \" Tom I didn't believe it the first time too, but seriously its Mark\". \"Uhh Hi Mark\" Tom says but I I perfectly know that Tom still does not believe a single word Shannon had said to him. \"Should I try to de-possess Greg and try to show him my powers\" I say to Shannon and she replies \"Well if you can Mark but you remember last time you were stuck\" as she got food out of her fridge. I take a sit down on the couch while Tom sat on the sit near the kitchen as I closed my eyes trying to usher out that feeling I felt while leaving Joe's body. A few minutes pass and I sigh announcing \"Its no use Shannon\" as I lay slouching on her couch. I watch as Tom talks up to Shannon and whispers into her air and she laughs \"Tom when will we ever get into your thick head that its true. It's just like your sci-fi books\". Tom sighs and he says \"That's why it is sci-fi Shannon, it hasn't happened\". Suddenly their conversation comes to an abrupt halt when my cell phone goes off and I moan \"What is it this time...\" as I fish it out. \"Oh no\" I moan and Shannon says \"What is it this time?\" and I reply \"I just got a text from Greg's kid asking when I am coming home. They want to eat out tonight too.....\".<br>\r\n<br>\r\n\"Well this isn't good...\" Shannon says \"But as long as you are using someones body Mark you won't be ruining their life so go back to Greg's fam- or rather I should say yours now...\" as she comes to a whisper. \"Our discussion will have to wait then\" I moan \", this isn't going to be fun\" and Shannon walks up and gives me a pat on the back \"It's alright Mark, you can do it. You're Greg now remember\" she jokes and I give her a smile. I glance at Tom to see he is looking cautiously from the corner of his eyes and I walk up to him and I say \"Well Tom I can't force you what to believe because to be honest if I was put in your shoes I wouldn't believe it either but there will be a time when you will trust Shannon and I\". I head back out and I look at the both of them I say \"Well... I'm off to my family\" as I shut the door behind me.</span></div></div>",
            "created":1341896400,
            "id":1375574,
            "title":"Double Trouble"
        },
        "11111111":{
            "choices":[
                "Dinner time everyone!"
            ],
            "content":"<div class=\"\"><div> <span>I shut the door behind me as I walk back towards the parking lot. I look at Greg's Fossil watch to see its 7:34 as I head out of the building. I look up to find find Mike laughing with a girl around his age as the walk towards me. They begin to make out, not yet noticing me and he looks up as he hears my foot steps echo in the hall way. \"Oh hey Mr. Smith\" he says standing up right while his girlfriend looks away embarrassed \", how is Shannon doing? Is she fine?\" and I reply in Greg's serious tone \"She seems fine for now, but give her space for now. You'll see me coming back later to check up on her\" as I walk pass them. \"Oh yeah\" I say turning around to them \", don't do anything stupid or I'll hear about it\" and Mike gives a nervous laugh and says \"Alright\" and I laugh giving him a light punch in the arm \"Just kidding, but stay safe\" as I head out the door. <br>\r\n<br>\r\nI walk over to Greg's Jaguar as I chuckle to my self. Wow people really act different around you if you're a cop as I take another glance at the uniform that I'm wearing. I unlock my car and sit back down into the drivers seat still admiring the car's beauty when I realize that I have to get back home to Greg's family. This isn't going to fun I sigh. I close my eyes trying to leave Greg's body but nothing. \"Well I'll just have to you for a little longer hopefully\" I moan patting Greg's beer belly. So where do I begin? I dig my hands into Greg's pocket, fishing out his leather wallet and I click the car's light to have a better look of the wallet. A nice leather wallet sits in Greg;s thick hands and I open it up to find his drivers license with his information on it. But the first thing I notice is how filled his wallet is. \"Sweet\" I smile as I take out some credit cards and look at it. I place them back in to find some money as well. I take them out and count the bills in my hands which adds up to 167 dollars and some change and I smile thinking of the video games I could have bought with this kind of money. I shove the money back into the wallet and I take out Greg's drivers license which is in the card protector of the wallet. \"Well I guess I've been driving for a while\" I smirk looking at the drivers license. I find out Greg's birthday is on February 16, 1966 and I look to find his address placed on another part of the card. \"18 Grove Avenue... where the hell is that\" I mutter and I look at Greg's car to find a GPS placed into the dash board. \"Well doesn't make a difference does it\" I smirk \", lets see how this baby works\". I turn on the car's engine to fine the GPS come to life as a meno of different options appears before me. Instantly I click the \"Where to\" button to find more options before me. One of the options was labeled \"Home\" and I smile thinking this can't get any easier. I click the button and drive off towards Greg's home and family, but I take a gulp thinking how I am the man of the household now.<br>\r\n<br>\r\nWhile driving,many thoughts began fill my mind. How should I act? What is it like to have a stable family? I think about my own family and see how big of a mess it is and I mutter \"Well can't get any worse.\" I soon end up in a quaint neighborhood of new houses after 20 minutes of driving, and suddenly I hear the GPS announce \"Arriving at home, on left\". \"Well here I go\" I say as I squint at the houses to find the number 18. \"Ahh here it is\" I say lowering the music in the car as I pull up on the driveway with two other nice cars. \"So this is where you live eh Greg\" and I get out of the car and lock it while I look at the house from the front yard. \"Wow this is pretty nice\" I whisper as I look at the professional lawn work of the house and how everything just looks so new. Nothing too crazily big but a nice size home that is well kept. <br>\r\n<br>\r\n\"Well here goes\" I say as I walk up to the house door. I look through the set of keys unsure which goes to the house until suddenly the door opens with a little kid smiling at me. \"Welcome home daddy\" he gives me a smile and then I remember he is the kid from the picture. \"Hey there\" I say smiling as I step into the house. He closes the door behind me as I look around at the house and he says \"Mommy isn't home yet but she called and said to get ready to go out for dinner after she comes back from work\" and I say \"Alright thanks kiddo\" as put my large hands on his head and give him a pat. So this is what a father feels like I smile. I take a few steps into the house and Greg's son says \"Uhh daddy you forgot to take off your shoes\" and he buzzes off somewhere else into the house. \"Oh yeah silly me\" I say as I take off Greg's dress shoes and placing with with the rest, I walk around in the house as I hear Greg's son playing with toys and I whisper \"So far so good\". I stroll around the house casually as I enter the kitchen while placing Greg's ring of keys on the counter. \"This is nice\" I say smiling as I circle the house. Everything is brand new as I walk into the kitchen find stainless steel appliances. I open the fridge to find basic food items and I shut it back even though I feel a pang of hunger hit my stomach. \"I'm a hungry man now\" I laugh shaking my stomach and suddenly I realize Greg's son looking at me laughing. I laugh too and he says \"You're funny daddy, can you play with me\" and I look down to see him playing with his toys. \"Uhh not right now son. I need to get change, but maybe later\"and I see him look down saddened. \"Hey I pinky promise\" I say as I kneel down and stick out Greg's pinky. \"All right \" he smiles as he wraps his little pinky around now my large pinky. I get back up to find my self in the living room of Greg's home and I hold in my happiness when I see a 56 inch flat screen sitting by the end of the room. I look around some more and once I saw everything I saw the stairs and decide to go to head up. <br>\r\n<br>\r\nWhen I was up, I spotted a few doors scattered in the hall way, and I whisper I wonder which one is mine. I peer into one seeing toys scattered around and head back out knowing its Greg's sons room. I hear music playing in the background behind a closed door and I see a sign that says \"DO NOT ENTER\" boldly on a sign. \"Well I guess this is my daughter\" as I walk pass it. I look into another door to find its a bathroom and the next one a closet. \"Well I guess that leaves the last one\" I think as I walk up to the closed door. I creak the door open and look inside to find a king size bed and I sigh closing the door behind me. I look around admiring Greg's bedroom with his wife and I look back at the bed suddenly dreading that I can't leave Greg's body. \"I have to sleep with his wife....\" I moan not wanting to sleep with another man's wife. I shake the head out of my head and look into the mirror to see Greg's full reflection staring back at me. If I took another glance I would have thought it was just a regular police officer but, its me in the reflection. I walk up closer to the mirror still not used to seeing Greg's reflection and I touch the mirror watching as every movement reflects back to me. I look into Greg's eyes and see my self within them in control of Greg's body. I look down at Greg's police uniform and I mutter \"Well I have to get these off don't I. Can't be walking out as a police everywhere I go.\"<br>\r\n<br>\r\nI walk to a wooden wardrobe place on the side of the room and I open it to find woman clothing folded neatly inside them. \"Definitely not mine\" I say and I look into the next one to find Greg's clothing. I scan through the clothing trying to find something I would like to wear more, but nothing but dress shirts, polos and some under shirts. Well better than wearing this police uniform all the time I sigh as I grab out a dark blue polo. I look into another draw to find old jeans, slacks, khakis, and some sweat pants and I take out the first thing on the pile which just so happens to be a pair of worn out jeans. <br>\r\n<br>\r\nSitting on the bed, I begin to unbuckle my shirt and place it on the bed. I begin to place the blue pants as well and I place it on the bed and I don't take a glimpse in the mirror feeling awkward undressing my self in a 40 year old mans body. I grab the dark blue polo and put it on as it fits loosely but nicely. \"Ahh this feels much better\" I say feeling less restrained than wearing the uniform. I put on the worn out jeans to find that it fits a bit tightly as I walk around uncomfortably, feeling as if the button of the jean is going to burst. \"Eating a bit too much Greg\" I say as I step back in front of the mirror to see how I look. Without the police uniform, I noticed as I stared back into the mirror that everything seems less serious and I grin into the mirror liking the look besides the tightness around my wait. I make faces into the mirror, laughing how silly Greg looks as I manipulate his face into funny looks. \"Maybe I should take these jeans off\" I say but suddenly the door opens as a tall woman walks into the room smiling at me. \"Hey honey\" she says as she walks up to me and I nervously say \"Hey honey\". She reaches over and gives me a quick kiss on the lips before I could react and she says \"Greg I thought we talked about not putting your dirt work clothes on our bed\" and she walks into the bedroom's bathroom and washes up. \"Oh yeah sorry\" I say as I take the uniform off and place it on a chair in the corner of the room. I look the other way feeling awkward after getting a kiss from Greg;s wife and she says \"So where would you like to eat?\" and I give a simple reply \"Anything you choose, or maybe the kids can choose tonight\" and I smile thinking how my answer fits perfectly into how Greg would say it. <br>\r\n<br>\r\nI walk back out into the hallway thinking \"Smooth sailing so far\". <br>\r\n<br>\r\n\"Well ask the kids then, I just need to clean up a little and use the bathroom\" she says and I reply \"Uhh sure\". I walk back into the hallway<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1341896400,
            "id":1375689,
            "title":"The Family Man"
        },
        "111111111":{
            "choices":[
                "When will it stop?"
            ],
            "content":"<div class=\"\"><div> <span>I walk back into the hallway of a home that is not mine but mine, and I head downstairs thinking that Greg's son will be alot easier to deal with. I don't even know the names of Greg's family I think as I sigh. Maybe I can casually coax the names out of him? I walk back downstairs to find him still busy playing with his toys and I walk up to him kneeling down as I pick him up and put him on my lap as I sit down on the couch. Something a dad would do. I think. \"Hey daddy\" he says \", are we going now?\" and I reply in a fatherly voice \"Not until you tell me where you would like to go eat\". He replies \"Anywhere Kelly wants to go is fine with me\". I smile and say \"Okay that's nice of you\" and I continue \", why don't we ask your sister together\" and he nods smiling. I grab him firmly as I walk upstairs and I shout over the music \"Kelly, open the door please.\" I hear the music get lowered and the door opens with a young teenage girl inside. \"What dad\" she says and I reply \"Well me and your brother here wanted to ask you where you would like to eat for dinner\" and she says \"Well since you really asked...\" and she continues \" how about we try that new hibachi restaurant that just opened up?\" as she looks up at me. I smile and say \"Uhh sure that sounds swell with me\" and she laughs and giggles \"Really dad? Swell? You're not a teenager.\"<br>\r\n<br>\r\n\"Oh you never know\" I laugh \"I might be an undercover teenager under the guise of your dad\" and she laughs and says \"Real nice humor dad\". I laugh a bit more thinking how everything I said was true and I take a glance into her room while she continues to read a book. I walk inside the the room to get a better view and I take a glance at her bookshelf intrigued by what she is reading. \"Nice reads\" I say and she looks at me strangely \"When did you ever like to read dad\". I stutter and say \"Well I may not like to read but its good for you so that's why I am saying nice reads\" and she rolls her eyes and goes back to reading her book as she says \"You say the strangest things sometime\". I shrug and continue to look around until I saw a One Direction poster plastered on to her wall. I made a sudden gagging noise as I usually would when I see something from One Direction, and suddenly I wish I can take it back as Kelly gives me another glare. \"Dad do we have a problem here\" and I reply \"Uhh no\". She stares at me and shakes her head \"Whats gotten into you? Suddenly you're acting like one of those annoying boys at school\" and I reply in the best fatherly tone I can \"Sorry Kelly, I'm just trying to be funny\" trying to make it seem as if this was all a joke. \"Its ok dad, you just try too hard sometimes, tell me when its time go, I wanna read some more\" and I reply with a simple \"Ok\" as I head back into the hall way.<br>\r\n<br>\r\n\"What to do now\" I mumble to my self, as I walk back downstairs unsure what to do. \"Hey daddy\" Greg's son runs up to me again \", do you think you do the airplane thing we did like last time?\" and I kneel down to his level and I reply smiling \"Sure thing kiddo, but you have to remind your daddy what I did last time, I have a bad memory sometimes\" and I ruffle his hair as he giggles. \"Well you picked me up and put me on your shoulders and you ran around the house pretending to be an airplane. You went ZOOM ZOOM ZOOM\" he said energetically. \"Taking for lift off I say\" as I pick him up and put him on my shoulders \", launching in 3...2...1... Lift off\" I shout as I begin to slowly run around the house. \"Weee\" he laughs as I run around the kitchen back into the living making and into the dining room making a complete circle. I ran and ran enjoying to watch Greg's son have fun but after a few rounds I started to lose my breath and I say \"Ok no more\" as I put him down huffing and puffing. \"Awww\" he sighs and I sit down on the couch feeling really tired as I take in deep breaths of air. <br>\r\n<br>\r\n\"But I want more daddy\" and I reply slowly still catching my breath \"Sorry kiddo, but I get worn out too easily\" as I look down onto Greg's chubby body. So this is how it feels to run around in an overweight 40 year old mans body as I wipe off some of the sweat that accumulated onto my forehead. I lay there watching Greg's son suddenly feeling really thirty and I get up and head to the counter. I fumble around looking for a glass and when I finally found one I filled it up with cold water and gulped it down immediately. \"Aww much better\" I sigh leaning on the counter of the table. <br>\r\n<br>\r\n\"Hey honey, I'm all set\" as Greg;s wife comes down with casual clothes on. She comes over to me and gives me another peck on the lips as I blush but quickly try to hide it. \"Hey mommy\" Greg's son runs up to his mom \", daddy was playing airplane with me again\" he said jumping up and down happily and she responds \"That's great  Kris! But dont overexert your father now, you know how easily tired he can get and the last thing we need is for him to be more stressed.\"  \"Oh alright, but its fun\" he says giggling while running back into the living room. <br>\r\n<br>\r\n\"So where are we eating\" Greg's wife says and I respond \"Well we let Kelly decide this time and she said she would like to go to the hibachi restaurant that just opened up.\" \"Sounds perfect to me\" she says smiling  \", alright lets get going\" and she yells \", Kids time to go.\"<br>\r\n<br>\r\nWe walk outside to the front of the house, and I realize that I don't know where the restaurant is. It would be weird if I asked since Greg should know so I say ask Greg's wife \"Hey honey do you think you can drive there? I'm a bit tired\" and she says \"Sure thing honey\" and she unlocks a BMW sedan and we all hope in. While driving there, I look out the window of the town Greg's lives in and begin to feel sorry being unable to leave his body for so long. Sorry Greg, for borrowing your body and for using it so long, its really unfair for me to do this but Shannon needed my support and you were those most viable person on hand to take control of. After a good 10 minutes, we soon end up at a restaurant called Benihana's Hibachi Grill with with a big sign that says Grand opening.<br>\r\n<br>\r\nWe exit the the car, and I am instantly hit with a nice aroma wafting its way from the restaurant and I hear my belly grumble in reaction. \"Ooooh can't way to try it\" Kelly said while we walked towards it. Kris started to hop around all over the parking lot and I grabbed him quickly and I tickled him saying \"Its dangerous to run around a parking lot you know\" and he giggled all the way into the restaurant. The scent of the food just got stronger and stronger as we were given the last table in the busy restaurant. The waiter passed out a menu to all of us and I opened the menu eagerly wanting to try everything on the menu. For a second I stop, as I look down upon Greg's body. Is his body effecting how I think? I begin to feel disturbed thinking about how another persons body can affect my thoughts, but the hunger pangs hit my stomach distracting my self back to what I should order on the menu. Steak, Chicken, Shrimp, Seafood ... I read and I smacked my lips getting hungry from reading the menu. But, then I stopped my self again thinking about Greg's health and I let out a sigh. Since I am in Greg's body its only right that I pick something healthier. <br>\r\n<br>\r\n\"What can I get you to drink\" the waiter said as he wrapped around the table. Kelly and Kris asked for soda while Greg's wife decided to try a Japanese drink and when the waiter go to me and I reply \"Water is fine\". \"Are you guys ready to order as well\" he asked and we all nodded and he wrapped around the table again. All three of them ordered Chicken or Steak and I hear Kris whisper to Kelly \"I bet dad is going to get the seafood combo\" and I look up at the waiter and I say \"I'll get the vegetable combo\".<br>\r\n<br>\r\n\"Trying to be healthier honey\" Greg's wife said placing her hand onto my own. \"Uhh yeah I guess so\" I say smiling back at her and she replies \", well that's great I've always wanted you to start going on a diet.\"<br>\r\n<br>\r\nWe say on the table chit chatting here and there as I try to put on my best father attitude. Soon the chef came out and started to cook our dinner as he did some pretty amazing tricks as the knifes danced around our eyes. \"Ohhh Ahhh\" we all said as the flames burst around the food. He started dishing out the food one by one and the aromas of the different meats began to make my mouth water. I look down at my plate feeling disappointed with what I got, but after eating a forkful I said \"Wow this is better than I thought it would be\".<br>\r\n<br>\r\nAfter we all finished our plates, the bill came and I took it and I let out a little gasp seeing the total bill hit a 100 dollars. Sorry Greg I think as I fish out his credit card.<br>\r\n<br>\r\nWe soon arrive back home about 9ish after dinner and Greg's family talks about how tasty the food was. \"That was awesome\" Kelly said \" , we should definitely go again\" as we enter the house. \"Yeah did you see how the chef guy flung the knifes around?\" Kris yelled \", it was so cool\". I smile knowing that they had a good time and I sigh \"Well Im poofed I'm going to head up and take a shower.\"<br>\r\n<br>\r\nI walk back upstairs feeling extremely tired being Greg the whole day. I look into his drawer for some pajamas, but there was nothing so I took out an undershirt, sweats and a fresh pair of boxers and brought it to the bathroom. I locked the door behind me and quickly get undressed and head into the shower feeling instantly relieved. The steam of the water relaxed me as I washed my self and I let out a sigh from being so stressed about the powers given to me. <br>\r\n<br>\r\nThe shower was almost a way to wash away Greg's skin and just become my self again...<br>\r\n<br>\r\n</span></div></div>",
            "created":1341982800,
            "id":1376097,
            "title":"Dinner time everyone!"
        },
        "1111111111":{
            "choices":[
                "A heart wrenching day"
            ],
            "content":"<div class=\"\"><div> <span>Letting out a deep sigh, I quickly exit the shower and wrap a towel around a waist feeling too awkward to be completely naked in Greg's body. I look back into the mirror of the bathroom seeing a worn out reflection of Greg looking at back at me.  Dark bags have formed underneath my eyes as I raise my hands and touch the mirror still not believing what has happened in the past two days. \"Its so strange to be in a different body\" I sigh as I look at the half naked body in front of me. In my original body, I was a lean guy, no muscles or anything but far from fat, but now staring at the mirror I see an overweight hairy 40 year old man in my place. \"So this is what it feels like to have man boobs\" I laugh trying to brighten up my mood as I shake it to see it bobble. \"Ugh this is so weird\" I moan as I look at the hairy bulging belly that I can call my own. \"You really need to start watching after your self\" I say to Greg as I shake my belly watching it bounce around in the mirror. This is way too weird having all this extra baggage I never had before. I begin to get change putting on the clean set of sleeping clothes and I look back into the mirror and I say \"I'll try to give you back your body as fast as I can Greg\" and I walk out of the room. <br>\r\n<br>\r\nI look at the king size bed in his room, feeling that I should instantly fall asleep, but I hold my self back thinking that I should at least stay up for a bit for Greg's family. It's the only right thing to do, and I did promise I would play with Kris after dinner. I walk out of his bedroom and head downstairs hearing Kelly play One Direction along the way as I walked down the steps. \"Hey daddy, you said you would play with me remember\" Kris said from the living room and I reply \"Yep, but you need to take a shower first\" as I notice he is still wearing his clothes from dinner. \"Alright...\" he says sadly as he heads back up stairs. I look back into the living room empty, and I look at the TV and smile to my self and say \"Its daddy's TV time\" as I sit down on the couch and flip the TV on. I scroll through many channels until I land on an interesting documentary about the Universe, and I sit back and watch enjoying one of the few times I had time to relax during my time as Greg so far. <br>\r\n<br>\r\n\"Well I'll be heading up to take a shower as well\" I hear Greg's wife say as she walks up the stairs and I respond \"Sure honey\". Suddenly she says \"Greg when did you like to watch science documentaries?\" she laughs and I respond \"Oh, I just thought this was interesting\" and she responds \", funny, you usually only watch TV when sports are on or something\" and she walks back upstairs. \"Well seems like we are pretty different individuals, eh Greg\" I say to my self while thinking that I don't watch much sports at all. <br>\r\n<br>\r\n\"Hmm pretty interesting\" I say as the documentary finished and I hear Kris running down the stairs while Greg's wife followed. \"Ready to play daddy\" and Greg's wife says \"Kris its bed time, you have school tomorrow\" and he says \"Awww.... but daddy said he would play with me after dinner\" and she says \"Nope, time to go to sleep\". \"Its ok honey\" I say feeling sorry for Kris \", I did say I will play with him\" and I ask \"What would you like to play Kris, but it has to be quick since you do have school tomorrow.\"<br>\r\n<br>\r\n\"Airplane!\" He says with joy and I sigh thinking how quickly I got tired from last time, but I smile and say \"Sure thing.\" I walk over to him and pick him up as I \"Launch in 3...2..1\" and I begin to run around the host like during the afternoon. \"Whheee\" Kris says giggling while I ran room to room and I smile feeling great knowing Kris was having a good time. I soon quickly began to feel the exhaustion get to me as I started to lightly sweat and found it harder to breath, but I continue to play with Kris feeling great as I hear him laugh and  he has a really great time with his dad, or at least he thinks so. Suddenly I feel a strange tightness around my chest and I say \"Alright - Kris\" that's enough \", time to go to sleep\". \"Ok daddy\" he says sadly \", it was fun though\" and I nod smiling. \"Why don't I tuck you in\" I say as I follow him upstairs into his bedroom. He leaps onto his bed and I sit down on the edge while I pull the blanket over him. \"Good night\" I say softly as he shuts his eyes, and I walk out of his room turning off the lights. \"Well that was tiring\" I say still catching my breath as I wipe off some of perspiration  that accumulated onto my forehead. My drowsiness comes back to me again, as I yawn and I mutter \"Too tired\" while walking to Greg's bedroom. <br>\r\n<br>\r\nI lay down onto the bed and I look up at the ceiling thinking of my first full day in another persons body and I mutter \"Too weird\" as I shut my eyes and pull the sheets over myself. Suddenly I hear the door open as Greg's wife comes in as well as I open my eyes slightly. \"Tiring day huh\" she says as she turns off the night and slips into the bed on the other side. \"Yeah\" I yawn feeling a bit uncomfortable sleeping with Greg's wife. I lay down shutting my eyes again, but she leans over and hugs me and says \"I love you honey, come look at me I want a good night kiss\". This can't get any weirder. I turn around the bed finding it a bit difficult with Greg's stature, but when I finally turn to the other side I see her glowing eyes smiling. \"Come give me a kiss honey\" as she closes her eyes\" and I slowly move closer bending over for the kiss. I plant my lips onto hers  leaving it there for a few seconds when I roll back and I say in a sweet but tired tone \"Good night.\" and she replies \"Good night\". I close my eyes thinking that wasn't too bad, but I begin to feel bad for Greg, as I wonder how mad he would be knowing I've been parading as her husband the whole time without her realizing. I shut my eyes yawning once more, and I mutter to my self \"Well Greg, you have a great family\" as the dreams begin to roll in. <br>\r\n<br>\r\nI toss and turn in my sleep as my head feels as if someone is pounding on it as I watched what is suppose to be a dream but feels more like a memory. But not of my own. Its quick bursts of blur but with certain parts vivid to me as I watch through someone eyes as they go about there day. RINNNGGGGG. The alarm clock goes off as suddenly my eyes open on its own as I let out a moan but I didn't control. What kind of dream is this? I try to move around unable to as the body I am in knocks the alarm clock and gets out of bed. Wait this looks familiar I think as I reluctantly am forced to move forward to another room. With a flick of the switch, I suddenly watch as the room illuminates as I'm forced to bend over as the hands in front of me splashes water into their face. The cool crisp water tingles against my skin as I suddenly I feel a towel against my face drying it off. The tower zooms out of my visions as the body raises their head to the mirror and I let out a gasp as I see Greg's reflection facing me. Suddenly the vision blurs and jumps to another one as I suddenly find my self in the police office sitting down on a chair facing the man I noticed from earlier. Thomas Philman.<br>\r\n<br>\r\n\"Aww Thomas don't be such a strict guy, She did it on accident\" I hear Greg's voice leave my mouth unwillingly. \"No I have to fire her\" Thomas says angrily \", and if you don;t get off my case I'll fire you too!\". Wow I don't remember Thomas being so mean and angry from the time I met him yesterday. Suddenly the vision blurs again as I find my self sitting down looking down at food with Greg's family around the table. I watch as Greg talks a bit with his family and he then starts talking about work and sighs \"Thomas went off again today\" and Greg's wife says \"Its ok honey, don't mind him any attention if he is on one of his many mood swings. He's a good guy but he's too serious sometimes\" and Greg replies \"Yeah I guess so\" as he shoves some food into his mouth. <br>\r\n<br>\r\nI see as some other quick visions flashes before my eye with Greg interacting happily with his family and I sit back wondering if this is really a dream.</span></div></div>",
            "created":1341982800,
            "id":1376356,
            "title":"When will it stop?"
        },
        "11111111111":{
            "choices":[
                "Get well soon!"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly I wake up to a jolt when I hear an alarm clock blaring against my ears as I moan finding my self back in bed and in control. \"Wow that was strange\" I muttered finding Greg;s wife still fast asleep. I quickly turn it off finding that its  7 AM in the morning as the sun began to creep into the room. I slipped out of bed walking towards the bathroom and I note the dream I had was exactly how I just started my day. I walk into the bathroom turning on the switch as the light burned my eyes while I squinted into the mirror. Greg's reflection squints back at me as I suddenly find my self needing to use the toiler real badly. I quickly alleviate my self while not glancing downwards still feeling too embarrassed to do so, and when I finished I splashed my self with water feeling awaken. I brush my teeth and while doing so, I noticed that some a slight beard started to grow in around Greg's jawline. I spit and rinsed my mouth and I muttered to my self \"The last thing I want is to cut my self\" as I remember all the other times the razor blade pierced my skin in my original body. \"Greg is fine with a shave\" I say as I glide my fingertips on the emerging fuzz that itches my chin. I wash up, and head back into the bedroom, and Greg's wife is yawning and getting out of bed as well. \"Good morning\" I say cheerfully as I begin to take out the needed clothes Greg wears for work. \"Good morning to you too\" she says getting out bed and walking to the bathroom shutting the door behind her. <br>\r\n<br>\r\nI go back into Greg's drawer and I pull out a pair of dress socks, and an undershirt, but unable to find his police uniform. I check all the drawers to see if I can find one with no avail. I walk over to the closet and grab the handle and slide the mirror door open to find an arrange of different clothing all handed up neatly on the closet railing. \"Aha\" I exclaim as I find a few pairs of his police uniform hanged neatly onto the side, I grab the first pair out lay it on the bed as I begun to take off my sleeping clothes until I am only garbed in a polka dot brief. I grab his undershirt and placed it on and I look down at the police uniform noticing it doesn't have the police badge and ID pinned to it. \"I'll have to get that from yesterday's clothing\" I grumbled as I put on the police shirt and pants while looking in tho the mirror. \"So this is what you do every morning\" I say after putting the uniform on. I begin to buckle his shirt and tuck it in and I look back into the mirror and I smile as I begin to see the Greg I have become yesterday. I sit down on the bed while slipping on his dress socks and I walk over and button his police badge and ID and pin it to the clean pair that I am wearing. I grab his hat and place it on top of my head and I look back into the smile in the mirror and say \"You're under arrest\" in a mean voice. <br>\r\n<br>\r\nSuddenly Greg's wife comes back out of the room and she smiles and walks over and gives me a firm hug and a kiss. \"Here's my handsome police officer\" she says after kissing me and I hug her back saying \"Here's my pretty wife\" thinking its only right to give back a compliment to Greg's wife. She walks over to her side of the bed and she sighs \"Greg, what did you forget to do?\" and I turn around and say \"Yes honey\" as I see her glaring at me as if she sees right for who I really am. She picks up Greg;s uniform from yesterday and she points at the gun still around the waist. I take a gulp and walk over and I say \"Sorry sweetie\" and she looks up at me in anger and says \"Greg, I thought you were more responsible than this, what would happen if Kris got hold of this?\" and I look down in shame for making Greg look bad. \"It won't happen again\" I say sweetly as I take the gun and its holster and plant it firmly against my new work uniform. \"Just remember next time will ya\" she says and she looks at the clock \"Oh honey your behind schedule!\" as she points to the clock and I say \"Oh silly me\" as I rush out of the room. Before stepping out I say \"I love you\" trying to make up for my mistake and she smiles and says \"I love you too\". <br>\r\n<br>\r\nI run down the stairs finding that Kris and Kelly are already up eating cereal as I rush to grab for Greg's keys and wallet. I walk up the counter and grab them as Kelly and Kris says \"Good morning dad\" and I turn back to them and say \"Good morning, gotta go though late to work.\" I walk to the front of the door slipping my feet into Greg's black dress shoes and I head out feeling a cool breeze of a summer morning. I unlock Greg's car and I drive out of the drive way and I sigh driving back to the police station.<br>\r\n<br>\r\nI soon find my self back into the some what bustling office as people are just coming in from home while some are leaving after their night shifts. \"What to do now\" I mutter to my self as the smell of coffee and morning food wafted around the air. My stomach grumbled from the smell and I sigh \"Greg, you're such a hungry man\" I whisper as I walk around the office unsure what to do. I then spot a break room as I casually walked in to find hot break fast sandwiched laying on the table. I was about to grab one until I realized that I made a commitment to only eat healthy foods while I am in control of Greg's body. I turn away and grab and apple on my way out as I walk into Greg's office unsure what to do with his job. I ate the apple watching his co-workers go about their business when suddenly I here a knock on the door and see Thomas peering into my office. <br>\r\n<br>\r\nI cautiously walk to the door dumping the apple in the garbage still remembering the strange dream that I had from yesterday. \"Can he really get that mean?\" I say as I open the door and said \"Hello Thomas\" and he asks \"Mind if I come in\" and I reply \", sure\" as I let him walk in shutting the door behind him. \"So whats the problem\" I say while sitting down in Greg's seat. \"Well I just wanted to remind you to go get the box from the girl, I contacted the FBI that are still in the forest saying we have found something\" he said while sitting in front of me. \"Uh....\" I stutter. I can't give him the box or else they will definitely know the chemical has reached someone else s hands. \"I think it may have been an misunderstanding between me and the girl. She seemed pretty out of it when I asked her the questions\" and he glares at me and says \"So you're saying your notes are useless?\". <br>\r\n<br>\r\n\"No no thats not what I am saying\" I say feeling a bit panicky. \"Well then Greg, I want you to go to her and get the god damn box then\" he says as he gets up and closes the door behind him quite hard. \"Ugh\" I moan as I walk back out of the police station, and begin to drive back towards Shannon's condo. While driving I give her a call and she picks up sounding drowsy and she sighs \"Whose calling\" and I reply \"It's me Shannon\" and she replies \"Uhh sorry I don't know a Greg\" and I sigh and say \"Did you forget already its me Mark\" and for a she replies \"OOOOO I forgot about the voice change\" she laughs \", so whats up\" and I reply \"Well I'm dropping by we have a problem\" and she says \"Ok.\" and hangs up. <br>\r\n<br>\r\nWhile driving I see a speeding car fly through a solid red light and I sigh as I flip the sirens on and chase after the car. Zooming by other cars, the speeding car soon slowed down and pulled to the side as I stopped behind the driver. \"Wow thats a nice drive\" I smile while looking at the brand orange sports car. I walk up to the car slowly and when I look down at the driver I see its Shannon's health instructor, Mike. \"O--h heyy Mr. Smith\" he says timidly and I sigh and say \"You know what you did wrong correct?\" and he nods and says in a weak timid voice \"It won't happen again I swear.\" I look down at him glaring and I say in a serious tone \"Mike, you could have killed someone, and I'm sorry but I am going to have to give you a ticket\". \"You'll be receiving a ticket in the mail\" I say walking back up to him and I continue \"I excepted more from you. You can go\" and I walk back in the police car watching him pull off slowly driving down the road. <br>\r\n<br>\r\nI knock onto Shannon's door and she says \"Hey, come in\" as I walk in and she shuts the door behind us. \"So I am guessing Tom went back home\" and she sighs \"Yeah, he says were crazy blah blah blah, so whats the problem\". \"Well this guy wants to get that box we found and hand it over to the FBI\" I say sitting down and she says \"You know we can't do that. If the bad guys find that I had it something is going to happen\" and I sigh \", I know\".<br>\r\n<br>\r\n\"Well you go back to him and say that it didn't fall out of the sky. Tell him it was actually a present given to me by Mark before he died and that he actually threw it at me when I wasn't looking to make it seem as it fell out of the sky. Also add how we got hold of it early in the morning way before the crash happened.\" Shannon says \", well you better be off before he gets more angry, plus I want my sleep\" and she leads me out of her condo. \"So cranky when you're sleepy\" I laugh and she slams the door in my face.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n\"She said what?!?!\" Thomas yelled while I sat in his office. \"Greg I should simply just fire you for taking such hideous notes then! I bet she is hiding something and if you won't find out then I will!\" <br>\r\n<br>\r\n\"Uhh sir, she was sure in what she said! She even showed me the box, it was a present with a necklace inside! Leave the poor girl alone for heavens sake\" I reply blocking the door before he can leave. \"You know what I think Greg? I think you're hiding something. I see it in your eyes\" he says glaring at me \", take the day off you're in my way.\"<br>\r\n<br>\r\n\"You can't\" I plead as he pushed me out of the way and opened the door. This can't be happening! Suddenly I clench my chest in pain as I fell to the floor. My vision blurred and I wondered if this was it.</span></div></div>",
            "created":1341982800,
            "id":1376453,
            "title":"A heart wrenching day"
        },
        "111111111111":{
            "choices":[
                "Being the Boss"
            ],
            "content":"<div class=\"\"><div> <span>My vision blurs in and out as I find my self being dragged somewhere. Is this is it? Am I gonna die in Greg's body? I moan as I black out, the last thing I saw was the worried look of Thomas as the doors shut in front of him as the ambulance drove off.<br>\r\n<br>\r\n---------------------------------------------------------<br>\r\n<br>\r\nI fall in and out of consciousness as I hear people walk about in the hallway across the room. I try to get up with no avail, as my body feels as if it weight a ton. A sudden drowsiness comes over me as I see a nurse look down upon me and she whispers \"You need your rest\" and fall back in to darkness.<br>\r\n<br>\r\n\"He is stable now, but don't make loud noises or do anything to agitate him please. He is pretty weak at the moment\" I hear a man say as he leaves the room as I slowly wake up from my my sleep. \"It'll be alright kids\" I hear Greg's wife says with a hint of her crying in her voice. I listen as I hear Kelly and Kris sobbing on the bed next to me, and I open my heavy lidded eyes finding Greg's family surrounding me. \"Hey guys\" I choke finding my self really weak and almost unable to talk. \"Daddy!\" Kris cries as he tries to jump on my but Kelly holds him back. \"Remember what the nurse said\" Kelly says sniffling and she smiles at me and says \"Hey dad\". Suddenly I feel soemone lightly hold my other hand as I tilt my head slowly looking at Greg's wife sobbing and she croaks \"You scared us to death dear\" and I give a slight smile and I say in a light voice \"I'm sorry that I scared you\".<br>\r\n<br>\r\nGreg's wife wipes away a tear and she smiles and says \"Kids lets leave your dad alone, he needs his rest\" and I smile at them weakly as they left the room. I close my eyes and let the sleepiness come over me as I fade back into a sleepy dream...<br>\r\n<br>\r\nI wake up to here shuffling in the room and I croak \"Guys?\" thinking it's Greg's family again. I open my eyes to see Thomas turning around facing me with a deeply sadden face and he drags a seat and sits by me. \"Its all my fault\" he says shaking his head \", I put you into this bed... and I almost killed you\". Despite of Thomas's mean attitude I say \"It's alright Thomas, it's my fault. I mean look at me, I need to watch what I eat now\" I say softly. \"No Greg, it's my fault, I'm too rough on everybody and this is the perfect example of what has happened from my actions.\"<br>\r\n<br>\r\nHe sits around talking to me here and there and he suddenly says \"I'm sorry for bringing this up again but.... Greg I have to double check what the box is! The FBI are pressing me on the matter and I even told them that it was all a mistake but they want me to double check anyways or else they will take the matters into their hands...\" \"No\" I croak realizing Shannon and my secret can not be leaked. \"I'm sorry Greg, I really do hope you get well\" and he gets up to leave the room. \"Nooooooo\" I croak realizing he can't go as I try to get up my self to stop. With no avail, I find my self in a physically stricken state and I watch in horror as Thomas takes a last sadden glance at me.<br>\r\n<br>\r\nSuddenly I find my self ripping away from Greg's body as I float above him and I look as Thomas leaves the room. \"NOOOOO\" I shout knowing perfectly well no one can hear me as I float my way out of the room. \"Yes I am done talking with him\" Thomas says to Greg's family and I say angrily \"You're not getting away this time!\" as I ram my self into his body just as he began to shake hand's with Greg's wife. Suddenly I feel my self washed over with the warm sensation of having a body as I suddenly find my self having a slight smile saying \"Thank you\" while shaking Greg's wifes hand.  \"Thanks for coming\" she says with a sad smile \", it really means alot.\" I nod and look down at Kelly and Kris and I smile sadly as I think about the short time I had gotten to know them. I kneel down to Kris and Kelly and I say \"Your dad is a great guy, and I know he will get better soon for you guys\" as I ruffle off up Kris's hair \", so be good eh?\" and I get back up and smile \"Well good bye guys, thanks for letting me visit\" and they smile and wave be good bye as I walk away. <br>\r\n<br>\r\nI sigh while I aimlessly walk around the hospital not sure which way to go, while all I can think about is how I am now Thomas. Well can't think here, as I slowly find my way out back to the front of the hospital. \"This is going to be such a pain\" I moan as I hear Thomas's serious tone of voice leave my mouth. I look up at the sky to see the sun setting and I gasp \"I've been out in Greg's body for a whole day!\" I raise Thomas's burly arms to my view as I take a glance at his watch to see that its 8:04 PM. I guess I don't have to go to back to then. I walk about the large parking lot looking for the car that I saw him walk in yesterday and after 10 minutes I finally found his car near the end of the parking lot. <br>\r\n<br>\r\n\"Nice ride Thomas\" I say, while I still can't believe his voice is leaving my mouth. Parked in front of me is a big truck and I climbed into the driver's seat as I zip out of the parking lot. I notice a GPS on the dashboard as it came to life and I click home, feeling a strange tiredness after becoming Thomas. \"I'd rather not annoy Shannon right now anyways\" I sigh \", especially when she I've made a jump.\" For 20 minutes I drive until I the GPS announces Thomas's home on the right. \"Arriving at home\" the GPS says as I look up at the house I pull in. \"Hmm no lights on?\" I say as I lock the car and walk up to the front door. I unlock the door with one of the keys on his keyring and I walk in to find the house completely dark. I flip the switch illuminating the front entrance of the house and I announce \"Anyone home?\" as I shut the door behind me. I walk about the house flipping the light switches on as I didn't receive a response. <br>\r\n<br>\r\nI flop onto the couch in his living room looking around noticing Thomas's house is much smaller than Greg's as it is only a single level home. So Thomas, you're living with no one else? I sigh staring at the ceiling, and I mutter \"Well I guess this is a break from always pretending to be somebody else\" but Thomas's voice leaves me mouth bringing me back to reality. I get up off the couch as Is I venture into the other rooms of his home, as I find his bedroom at the very end of the hall way. I flip the switch off the room as I walked and noticed that his queen size bed is only messy on one side. \"I guess you do live by your self Thomas\" as I walk around and look into the mirror. <br>\r\n<br>\r\nThomas's reflection starts back at me as I walk up to the mirror feeling strange. It almost felt as if the reflection was going to bark at me for doing something wrong but then I realize behind his light blue eyes was me. \"You're a burly guy eh Thomas\" I say as I feel a significant different in his body structure and stature. Standing around 6 ' 4 compared to Greg's 5 ' 8 I looked down upon my self feeling like a giant. I look back into the mirror noticing how strong he looks as I look at his arm seeing how wide it is. It's the width of someones thigh! Thomas didn't have defining muscles as I flexed my arms, but he wasn't fat either. I look upon his face that is now my own, and I glide my hands through his thick but somewhat thinning hair, and I smile simply having hair again on top of my head. I glance down at his thick beard he has growing, as I glide my hand feeling the roughness and I smile into the mirror and say \"I've always wanted a full grown beard\" but I stopped smiling feeling creep-ed out at the reflection of a happy Thomas. Taking a step back, I look at Thomas in his police uniform and I sigh \"Quite the intimidating officer\". I look upon my new face and I notice that it has a mean look to it that could scare anybody off. <br>\r\n<br>\r\nI smile into the mirror manipulating my new face, and I let a booming laughter as I see strange facial expressions that I thought never existed from Thomas. \"Well I should just give Shannon a heads up then\" I say as I find Thomas's house phone and I dial her phone number. \"Hello?\" I here Tom says on the other side and I say \"Just give Shannon the phone\" knowing he will never believe me. \"Shannon its some weird guy asking for you!\" he yells and I hear \"Hello Shannon speaking.\"<br>\r\n<br>\r\n\"Shannon it's me Mark\" I say and she responds slowly \"Wait....you sound different...don't tell me you...\" and I respond \"Yeah I did. I had to, but its a long story. I'm now in the body of Greg's coworker who kept pushing him to get the box\" and she responds \"Oooooooo that makes sense,\" \"By the way why is Tom back in your condo? I thought he thought we were all nuts or rather you but....\" and she sighs and whispers \"I told him that it was all a joke just to get him back. Well you should drop by as soon as you can because we need to talk\" and I reply \"Yeah we do, well good night\" and we hang up the phone. I look at the clock in Greg's room to find it is 9:10 and I yawn feeling extremely tired for some reason. <br>\r\n<br>\r\n\"You must have worn your self out Thomas\" as I take another glance into the mirror to see that I am now a burly giant and intimidation police officer named Thomas whom is known to be to serious.</span></div></div>",
            "created":1342069200,
            "id":1376799,
            "title":"Get well soon!"
        },
        "1111111111111":{
            "choices":[
                "Chief of Police"
            ],
            "content":"<div class=\"\"><div> <span>\"Well at least it seems I'm alone\" I sigh, as I feel a hunger grow over me. As I take another glimpse around Thomas's home I mutter \"My god this place is a mess\" as I see papers all scattered over the floor. I walk into the kitchen and sigh at the huge pile of dishes that are unwashed, and I open the fridge and sigh again. \"Didn't good food shopping or something Thomas....\" as I peer into the fridge to only see some drinks but nothing to eat. I look into the fridge to find it empty as well, but I laugh \"Hey I am a grown man now, I'll just go out and buy something\" and I smirk thinking about the endless possibilities of what I can eat.<br>\r\n<br>\r\nI head back out, and drive to a supermarket and I smirk \"Well Thomas if you can't do the food shopping I'll do it for you!\" and I walk in almost as if I was a little kid in a candy store. I grabbed a pushing cart as I begin to fill the cart with chips, frozen pizza, and soda, and while shopping I notice I received some furtive glances probably because I'm now a cop. I ring up the bill to find its 67 dollars and I smile while handing over Thomas's credit card. The benefits of the job I smirk. I head back out and pack the grocery as I drive back to Thomas's home feeling a great hunger come over me and I sigh \"You may not be fat like Greg, but you can get just as hungry.\"<br>\r\n<br>\r\nI head back inside instantly popping the frozen pizza into the oven, and I lay down on the couch with my arms behind my head and sigh while closing my eyes. \"Whats the disgusting smell\" I say as I smell traces of a foul odor for a while but now it is extremely strong as I gag. \"Wait can it be...\" I think as I take a sniff at my open armpits, and I receive a full blast of Thomas's body odor. \"Ewww\" I moan as I bring my now burly hairy arms back down \", You don't take care of your house and you don't take care of your hygiene nice...\" I say as I get \", well as long as I am in your body I won't be dealing with this smell\" and I head into his bedroom and I open his drawer to find his clothes not neatly folder. I fumbled my way through his clothing as I grab out an undershirt and some briefs and a sweat pants. I look at his undershirt to find a yellow tint in the armpit area and I sigh \"This is nasty... but then again what different does it make, this is his body, this is his home, and this is his clothing, Only difference is that now I am in control...\" as I head to the bathroom. I walk in to the bathroom finding it much smaller and a bit outdated as I unbuckle his clothing finding my self soon bare with only his briefs on.<br>\r\n<br>\r\nI look back into the mirror to see a giant ape of some sort. With his already bulging arms, I look at his chest to find two not as flabby pecs compared to Greg's, and a belly to not be proud of or disgusted of. I quickly take off his briefs, as the odor really started to get to me, and I jumped into the shower instantly enjoying the relief of what hot water can bring to you. I soaped myself down at least twice, and this time I enjoyed using some shampoo through Thomas's short cut brown and grey hair. I hop back out of the shower as I pull his supposedly clean clothes on and I look back into the mirror seeing a refreshed Thomas that definitely no longer smells. \"You really do have a mean face\" I say as I touch his face, and suddenly I heard the oven ring and I smile \"I'm starving\" as I head back into the kitchen. I take the pizza out, enticed by the hot sweet smell a pizza brings and I push Thomas's mail and other junk off his dining room table as I open a 2-liter of Coke and a bag of chips. I turn on the TV onto a a sci-fi show as I eat, and before I knew it I burped leaning on the chair as I gasp at the amount I just ate with ease. \"Wow.... I ate the whole pizza, drank 3/4 of the big coke bottle and half of the bag of chips...\" and I pat my slight bigger belly and laugh \", well looks like you need alot to fuel your self Thomas.\"<br>\r\n<br>\r\nI take another glance at the clock to find its 10:57 as I yawn and mutter \"Ugh have to go to work tomorrow... but at least its Friday tomorrow and hopefully Thomas doesn't work on the weekend.\" as I drag my self up and start shutting the lights that I have left on. I walk into Thomas's room and yawn as I take a glance into the mirror feeling strange in Thomas's body. I walk up mirror and sigh \"One day I was talking to you like a normal person, but now look!\" as Thomas's voice leaves my mouth. Its difficult enough to always hear a stranger's voice replace my own as I climb in to Thomas's bed. Well at least I don't have to put on another mask of pretending to be him when I'm in his home. I shut the lamp and roll the blankets over me as the dreams come rolling in the second I close my eyes.<br>\r\n<br>\r\nI groggily wake up, as the alarm goes off next to my bed. I moan and snap the alarm clock off as I roll out of bed and look into the mirror to see a disheveled Thomas. \"AHH\" I scream hearing Thomas's loud booming voice echo in the room. Jumping away from the mirror as my heart raced away, I began to chuckle and sigh as I mumble \"Almost completely forgot about everything...\" while I looked at the alarm clock to see it reads 5:11 AM. I sigh and moan \", And why do I have to wake up so early? Oh yeah I'm Thomas Philman the big shot at the police station\" I say cockily looking into the mirror looking at how my life has changed . I walk out into hallway and into the bathroom while dragging my feet as I flip the switch to see my new body illuminate before me. I look at the mean looking face in front of me and I mumble \" You know why you look so mean Thomas. First off its your attitude but, this beard doesn't help at all\" as I place my now thick fingers into his beard finding it firmly stuck no where to go. \"Well as long as I am you this beard has to go\" I say as I find his stash of hygiene goods \", ah look what we have here, Something to shave with and a brand new deodorant stick. No wonder you were so smelly.\"<br>\r\n<br>\r\nI quickly brush his teeth, and I begin to shave his beard carefully, as the fuzz of hair begin to fall down into the sink below me. I look into the mirror and grin, \" Now people can actually see that bright smile of yours\" as I look at Thomas's face which looks alot happier without all the excess hair. \"A brand new look to go with a brand new personality\" I laugh as I clean up the mess in the sink I made. I grab the deodorant stick and and walk back into his room, and I look around trying to find a fresh pair of a police uniform. I look into his closet to find it empty and I moan \"Where do you keep your work clothes if not in here?\" and I continue to look around until I notice a pile of dirty clothes in his hamper. \"YOU HAVE TO BE KIDDING ME\" I shout as I find multiple police uniforms laying in the pile of dirty clothes. I grab one and smell it to find it has a musky odor to it and I sigh \"I don't want to wear some smelly clothing of someone else... plus this is wrinkly...\" as I shove it back into the hamper.<br>\r\n<br>\r\nI continue to look for a clean pair of his work clothing and I sigh looking at the pair I dumped onto the floor from yesterday. I grab the shirt and sniff it to find a trace of the body odor from yesterday, but nothing too bad and I sigh \"Yesterdays clothing will have to do...\"<br>\r\n<br>\r\nI take off my sleeping clothes finding my self bare again as I look down at my massive chest. \"So weird to have so much hair on my chest...\" I laugh as I grab an undershirt and put it on. I take the new deodorant bar I found in his bathroom, and I apply them to his arm pits and say \"I won't be smelling anything today.\" I shake off his police shirt trying to get rid of any dirt as I put it back on feeling slightly disgusted from wearing another guys dirty shirt. But then again, I'm wearing his body. I buckle the shirt and put on his pants tucking the shirt in. I tighten his black leather belt around my waist, and straighten out any wrinkles and I look back into the mirror seeing the man I became yesterday. \"Oh nice\" I say as I spot a bottle of cologne. I spritz a bit around Thomas's clothing and I laugh \"Its almost like new!\"<br>\r\n<br>\r\nI step back in front of the mirror and smile seeing the same man from yesterday but with a happier and more lively aurora. \"I don't know what happened to your life Thomas, but its time for a change\" as I walk out of his house heading to work. </span></div></div>",
            "created":1342587600,
            "id":1381285,
            "title":"Being the Boss"
        },
        "11111111111111":{
            "choices":[
                "Infiltrate the FBI",
                "Its a mistake"
            ],
            "content":"<div class=\"\"><div> <span>\"Good morning sir\" I hear as I walk into the police station. \"Good morning\" I say nodding as I walk deeper into the station. As I approach Thomas's room, I am greeted by other officers and I nod greeting them back with a smile. \"Nice new look sir\" Julie says walking up to me \", is something wrong sir? You seem...different?\" and I look at her and say \"Ehh... how do I describe it.... I've had a change of heart about life I guess\" and she says \", Oh really? I hope you're not taking it too hard about what happened to Greg\" and I shake my head and say \"No, but I so wish him ta speedy recovery.\"<br>\r\n<br>\r\n\"That's great\" Julie says \", just to remind you, you have a few messages that you should check as soon as possible. Another reminder that you are required at a dinner tonight with the mayor and other council members as a commemoration for the 75th anniversary of the Massunutten Police Force. You will be meeting at the Hyatt at 8 PM and you will be picked up my a cab from here around 7:30.\" and she looks up at me waiting for a response. \"Yes sounds excellent, thank you Julie\" and she smiles and says \"No problem sir. I'll be bringing you your breakfast as soon as Free comes back and brings it it\" as we arrive at Thomas's office door. She walks away leaving me alone as I unlock Thomas's door with his ID strapped to this chest pocket. I walk and close the door behind me and sigh as I look up at the blinds to find it already shut.<br>\r\n<br>\r\nI slide into his leather chair, and I sigh thinking about all the things that I have to do as Thomas, as it piles up from the very beginning of his work day. I look down at his telephone to find the number two flashing before my eyes. I click the play button and the answering machine announces in its monotonous tone \"Message 1 June 29 6:32 PM\" and suddenly I hear an unknown man say \"Hey Thomas its Bryan! Will you be coming down for the county fair today? It will be great if you can to watch over things and maybe make a speech. Your lasts year speech was great! Call me!\" and he hangs up the phone. \"Message 2 June 30 4:57 AM\" and I hear a woman's voice say \"Hello Mr. Philman its me Maria again, please contact me as soon as possible about the update about the box. My number is 250-555-3894.\" and she hangs up.<br>\r\n<br>\r\nI sit thinking about who this Maria is and what she wants know about this box when suddenly I leap in fright as I hear a knock on my door. I walk up to it and open the door to find Julie with a brown bag and a hot cup of coffee and she says \"Here you go. And the coffee is just the way you like it. No sugar no milk. Can I do anything else for you?\" and I ask \"Uh yeah actually, I got a call from Bryan and supposedly their is a county fair today.\" and Julie responds \"Oh I can't believe I forgot!\" she says with slight feat in her eyes as she looks up at me. \"Hahaha, its okay Julie. So do you think I should go?\" I ask not sure what Thomas would do. \"It's actually sort of mandatory that you should go, since its only right for the the Police Chief to show up at the country's anniversary of it being founded. But if you are busy with other things, I guess you don't have to go,since you usually don't go every year. But I think you should go for once and stop working your self to death\"<br>\r\nand I reply \"Oh really? I think I'll be going this year then. \" and she smiles surprisingly \"Wow, what has gotten into you Thomas? It's great that your showing your town your support in our community\" and she leaves me as I shut the door.<br>\r\n<br>\r\nI sit back down at Thomas's desk a growing hunger as I empty the content of the brown bag to find a sandwich wrapped in a tin foil. I unwrap it to find a turkey, ham, and cheese sandwich and I eagerly take huge bites out of it enjoying it completely. Suddenly I find the sandwich disappear in a flash and I laugh \"Wow, you can really eat Thomas\" still feeling hungry. I look at the coffee and sigh in disgust as I say \"I hate coffee! I mean how can you not even put sugar and milk in it?\" as I look into the black liquid. \"It sure does smell refreshing though..\" I say \", maybe a sip won't hurt\" as I bring the piping hot coffee to my lips and I take a sip. A bitter coffee taste fills my mouth as I gulp it down. Strangely it actually tastes really good! \"It seems like that the body I am in has effects my usual tastes as well\" as I down the coffee in a flash.<br>\r\n<br>\r\nI look at the clock to find its 7:!1 in the morning and I decide that I should call this \"Bryan\" as I take out his cell phone and call the only Bryan in his listing. \"Hey Thomas so are you coming or you have the usual too much work excuse?\" he laughs and I reply in a friendly voice \"Not this time around! I'll be coming! So what time does it start\" and he replies \"Oh wow thats great! It starts at 11 PM, but you should come earlier so you can greet the council members. Oh yeah if you can, make up a little speech, since you are the Police Chief of this town after all\" and I reply \"Oh... of course, see you there\" and I hang up the phone.<br>\r\n<br>\r\n\"Well I have plenty of time to go meet up with Shannon\" I say to my self as I copy down Maria's number to bring with me when I meet her. I walk out of his office and Julie says \"Do you need anything sir?\" and I reply \"Nope, I have to run a few errands\" and she nods and goes back to her work. \"Nice shave Thomas, it makes you look younger\" I hear someone say to me from my back and I say smiling \"Thanks\" as I head out of the police station.<br>\r\n<br>\r\n-----------------------------------------------------------------<br>\r\n<br>\r\nI walk up to her room and knock on her door and she unlocks the door and says \"Uhh good morning officer, how may I help you\" and I reply in a serious tone \"You can help me by letting your friend Mark in\" and I see her face bright up as she quickly lets me in. \"Wow this guys is huge\" she exclaims \", so who are you now?\" and I reply sitting down on her couch \"You are talking to the Police Chief of our town\" as she gapes at what I say. \"Good thing too that I possessed this guys! I had a freaking heart attack in Greg's body because he said he will come here and figure out for him self what the box is. And then at the end of the day when I came to in the hospital, he came to say sorry but bring up the damn topic again saying he has to do it. That's when I was finally able to leave Greg's body and I rammed my self into this guy to stop him.\"<br>\r\n<br>\r\n\"Wow\" Shannon says \", so what do we do now?\" and I reply \"Well it just so happens that I now can talk to the FBI about the box but I didn't call the lady yet. Oh yeah where's Tom?\" I say looking around and she says \"Oh you know the usual. He felt too embarrassed to have a sleep over with a girl, and he still thinks I am a bit crazy, but if you come during the day you'll catch him.\" I nod and say \"Well it just so happens that Thomas was left a message by the FBI agents this morning\" and I continue \", and this women name Maria said she wants me to contact her about the box as soon as possible. \"<br>\r\n<br>\r\n\"Hmm....\" Shannon thinks \", well the most obvious thing to do is to tell her that it was a mistake but.... we could possibly infiltrate the FBI if we plan everything correctly.... and of course the whole plan would revolve around you.\" I stare at her thinking and I say \"Well....\"</span></div></div>",
            "created":1342587600,
            "id":1381286,
            "title":"Chief of Police"
        },
        "111111111111111":{
            "choices":[
                "Dinner Time!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I think we should hear what she has to say.\" and I continue \"I mean look at me Shannon! I'm in the body of the Chief of Police, and before this Greg and that maniac who killed me and started this whole mess. Plus the person behind this... he or she had something plotted but it failed and who is to say that he or she isn't at it again? I think we should find out the bottom of this and maybe... just maybe a way to get me back in my original body...\"<br>\r\n<br>\r\n\"Well its really your choice in the end Mark. But I am behind you on anything, but what is the plan?\" and I reply \"I'll just improvise along my way into the call\" and I pick up Thomas's cell phone and dial in Maria's number. After a few rings she says \"Hello Thomas, so what are the updates on the box?\" and I reply in a cool voice \"I think it may be something but at the same time maybe nothing at all. Do you think you can meet me up at my office on Monday? And we will drop by the girls house for the last time to determine it together\" and she hesitates and says \"Why not today?\" \"Well I'm very busy today with all these events being hosted and I am jam packed filled for this weekend, but trust me when I say this girl won't be going anywhere. Monday will be the earliest time I am open\" I reply in a somewhat mean voice and I hear her sigh on the other line. \"Alright Thomas, Monday it is, 9 Am should be fine correct?\" and I reply in a curt voice \"Yes, well I have to go alot of work<br>\r\nto do today\" and she says good bye and we both hang up the phone.<br>\r\n<br>\r\n\"Well looks like everything is set for Monday\" and in the mean time we can come with up a plan to infiltrate the FBI.\" I say, but then I am interrupted by a knock from the door. \"Oh it must be Tom\" Shannon says getting up and opening the door. \"Good morning Shannon, I was thinking about Mark and I thought we should do a little memorial for him...\" but he notices me as he walks in putting down his bag. \"Uhhh hi Mr. Philman... What are you doing here?\" and I sigh and say \"Tom, its me Mark for the last millionth time...\" and I watch as he just stands there looking blankly at my face. All of a sudden he gasps and looks at Shannon speechless as he slowly walks up to me. \"Answer this question first.... something only Mark would know. What game do we play together and what is your username?\" and I laugh \"League of Legends, and my username is ThePunish3r102 and the E is a 3.\"<br>\r\n<br>\r\n\"I can't believe it...\" Tom says looking at me in disbelief and he comes up running to me and gives me a hug and he says \"I can't believe this is true...\" and we all begin to laugh together. \"This is coming straight up from a sci-fi book unbelievable! Its great to have you back Mark\" and I laugh noticing Thomas's voice more \"I've never left... just that I came back in a different body.\"<br>\r\n<br>\r\nWe all sit down around Shannon's living room catching Tom back up to date and he sighs \"This is so much to wrap around my mind. Its almost my mind is going to explode!\" and while I lay down taking up a whole couch to my self I say \"Wait when you first came in Tom... you acted as if you know me, I mean Thomas.\" and he sighs and says \"I actually do know the guy. He's my dad's friend and he actually came over to my house alot for dinner until... well.. his wife and kid died in a fire.\"<br>\r\n<br>\r\nI sit in silence and reply \"Wow must have been hard for him...\" and I look at the clock to see its nearing 10 oclock. \"Well I have alot to do today as Thomas. I said that I would go to the county fair today from this guy name Brian.\" and Shannon responds \"THATS TODAY? I almost forgot! Hey lets go to the country fair Tom, it should be fun! Plus we get to stick and see how Mark plays the Chief in Police\" she laughs. \"Hey its not funny\" I say smiling \", its not easy to pretend to be somebody else all the time. But at least I have you guys, if I didn't I would be crazy by now.\"<br>\r\n<br>\r\n\"Well I have to go. I promised I would be there earlier.\" and Tom says \"Why don't you just bring us? You can drop us out a bit away from the park, so it doesn't look weird for Thomas\" and I reply \"Sure why not.\"<br>\r\n<br>\r\n\"Wow this is cool! You get to drive a truck! I wish I could start driving already\" and I laugh \"I guess a benefit of my powers\" as I pull out towards the park. \"Here you guys get off here\" I say and they nod as they get out of the truck. I drive down into the park as I think about my past memories at the County Fair. Many games, food, and music, it was one of the best things Shannon, Tom and I would do during the summers. I pull up where most of the fair was already set up, and I park into a spot and get out of the car unsure where to go.\"<br>\r\n<br>\r\nI walk into the fair, smelling great food and I look around to see a crowd beginning to form around the podium on the other side of the park. I walk over unsure what to do, until I heard someone yell \"Hey Thomas\" I look over to see a man waving me over. Who is this person? I smile and walk over and he says \"Thanks for coming this time man! I thought when I called you, you would say no, but here you are!\" and I laugh \"Yeah here I am Brian.\" \"Well just go behind the podium, you have a seat on stage, and I hope you have a good speech. Oh by the way nice new look you have! \" he laughs as he walks somewhere else in the crowd. I gulp walking to the back of the podium as I see some other people chatting and laughing. \"Oh great, Thomas is here everyone\" I hear one of them say as they all wave me over. I smile and and shake hands with them, not even sure who they are, but then I notice the Mayor who sticks out of my memory.<br>\r\n<br>\r\n\"Glad you can make it this year Thomas\" the mayor says shaking my hand and I reply \"Its my pleasure.\" Suddenly I hear Brian over the speakers \"Welcome to the Massanutten County Fair!\" and I watch as the people I were just talking to were ushered up to the front stage as I followed them. I look into the sea of people, feeling nervous as I never liked a big crowd and I take a seat that was given to me. I look into the crowd as the Mayor gets and says \"Welcome everybody. The next three days of our country fair is going to be a blast, and I wish everyone a fun time.\" and he goes on more about our town until he suddenly says \"I would like to call up Thomas Philman Chief of Police to the stand for a few words.\" Nervously, I step up feeling my knees go weak as I walk across the stage to shake hands with the Mayor as he sits down. I smile into the crowd as my palms become sweaty, but then I spot Tom and Shannon waving at me which gave me the boost I needed. \"Good morning everyone and<br>\r\nwelcome to the Massanutten County Fair!\" I say using Thomas's booming voice to my advantage. \", I would just like to wish everyone to have a good time and stay safe or else I will have to arrest you\" I say jokingly as the crowd laughs. \", but in all seriousness I wish everyone to have a good time, with their family and friends and enjoy the great entertainment, food and games! I know I'll being enjoying the food that's for sure\" I laugh as the crowd laughs with me.<br>\r\n<br>\r\nI walk back to my seat and sit down and I sigh. That wasn't too bad. I soon find the fair beginning as people walk around having a great time. I walk over to Shannon and Tom and I laugh and say \"How was I\" and they smile and Shannon says \"It was great!\" and she whispered \", I almost believed that you were actually Thomas.\" Suddenly I watch Brian approach me and I say loudly \"Well you kids go off and have a good time. Stay safe!\" as I turn around and face him. \"Hey man wanna get something to eat? I'm starving\" and I laugh patting him on his back \"Sure, I need to fill my hungry stomach too.\"<br>\r\n<br>\r\nFor the next few hours I enjoyed the fair for the most part, but I had to put on an act, as I was greeted by many people that I didn't know but seemed to know Thomas. Suddenly one of the council members names Cher walks up to me and she smiles \"You should leave soon to get ready for our dinner. Have to freshen up and get dress so don't forget\" and I look at Thomas's watch to see that it is 6 pm. \"Thanks for reminding me Cher\" as we both walk off to our cars, and Tom and Shannon pops up from the crowd and walks along with me with cotton candy. \"Where are you going?\" Tom says with a mouthful of cotton candy in his mouth.<br>\r\n<br>\r\nI sigh and reply \"I have to head to this dinner to celebrate the 75th anniversary of the Massanutten Police Force, and I have to go home, well Thomas's home and get spruced up for the dinner.\" They both laugh and say \"Have fun being the Chief of Police\" as they run back to the fair. I sigh as I drive back to Thomas's home thinking about how difficult it is to keep this act up.<br>\r\n<br>\r\nI walk back inside his quiet home, as I walk into his bedroom looking for his dress clothing. I open his closet to find, a few expensive suits inside and I laugh \" Well I guess you do have to dress nicely if you're chief of police. I pull one out of the plastic protector admiring the material of the suit, and I find his dress shirt, , socks, and tie already with the suit. I begin to strip off his work clothes as I begin to place on Thomas's suit piece by piece until I look back into the mirror seeing the reflection of Thomas being well dressed. \"Wow I never had something this nice to wear before\" as I think about my dysfunctional family and how my parents would use all their money on themselves.<br>\r\n<br>\r\nI take another look into the mirror to see a tall strong looking man dress in a well fitted suit and I smile saying \"This should be fun\" as I look at my self behind the eyes of Thomas. \"Lets go eat dinner shall we?\"</span></div></div>",
            "created":1342587600,
            "id":1381289,
            "title":"Infiltrate the FBI"
        },
        "1111111111111111":{
            "choices":[
                "May I take your order?"
            ],
            "content":"<div class=\"\"><div> <span>I find my self standing around at the police station as I glance at my watch to see that its 7:24 PM. \"Hey you look great!\" Julie says as she walks out from the police station and I smile \"Thanks\" and she responds \", well I hope you have a great time!\" and she walks out to the back to go back home. Suddenly I watch as a black cab pull up close to me and the guy rolls down the window and says \"Hello, you're Thomas Philman correct?\" and I response \"Yes I am.\" and he says \"Well come on in.\"<br>\r\n<br>\r\nI sit down into luxury cab and I looked around thinking this is a nice car. Fine leather seats and everything was crisp and clean, I smiled. Another benefit of being Thomas I suppose. After 20-30 minutes, the driver pulled up to the Hyatt and said \"Well here you are mister, enjoy your night!\" and I thanked him giving him a tip of 5 bucks. I walked out closing the cabbie door behind me and I walked into Hyatt restaurant, as fine aromas began to wrap around my nose. I looked around in the fancy restaurant as I gaped at how I never been to anything fancier than a dine in.<br>\r\n<br>\r\n\"Hello sir, how may I help you?\" a waitress says walking up to me and I stutter \"U-uh, I'm Thomas Philman, and I am here for the dinner with the mayor and council members\" and she looks into a list of names as I look around nervously. I felt like she would look up at me and see me for who I truly am, but she looks up and smiles \"Ah yes, they are already waiting for you. If you would follow me\" and I smile and I follow her into the restaurant as I feel my stomach grumble from the smell of the restaurant. She leads me into a meeting room and I see the group of politicians sitting down waving me over.<br>\r\n<br>\r\n\"Hello Thomas\" the mayor says greeting me while they all get up out of their seat to shake hands. \"Hello\" I say to each and everyone of them, already feeling a bit nervous. \"So where here to commemorate the police force of Massanutten, and to also discuss some things that we have planned for the town.\" the mayor says \", but lets order first?\"<br>\r\n<br>\r\nA waiter comes around passing out a fancy menu to each and everyone of us, and I eagerly open the menu, while the whole table decides what they should be looking for. \"Wow...\" I say and I look up to receive strange looks from some of the council members, and I look down feeling embarrassed. I look down upon the menu finding different sections for, steaks, seafood, and other dishes and I sigh feeling a bit disappointed. What I really can go for is a nice burger and fries, but I searched the whole menu with no avail. \"All we all set to go?\" the waiter says at my side and the whole table says \"Yes\" and looks at me. \"Uhh, yeah I'm all set as well\" and the waiter nods \"Well lets start of you shall we?\"<br>\r\n<br>\r\nI stutter not even having a clue what to order and I look down at the page and I decide to go with one of the steak entrees on the menu. \"I would like to get the NYC Prime Steak\" I say and he asks \"How would you like it done\" and I reply \", medium rare is fine\" and he then wraps around the rest of the table on what they want. As he finishes, another waiter comes out and puts a bunch of glass cups on the table as he pours water into one cup and wine into the other. I watch as everyone on the table grabs a cup of wine and I do the same as I smell the alcoholic grape smell from the glass. \"To 75 years of protecting Massanutten\" the mayor says and I smile and say the same thing as we hit each others glasses gently.<br>\r\n<br>\r\nI watch as the other take a sip of their wine and I look down upon my own cup feeling a bit excited that I am not \"old\" enough to drink. I take a sip as it sends down a tingly sensation down by throat. Tastes pretty good I guess but not as good as a can of coke. \"Lets get down to business...\" the mayor says \" we need to discuss some ideas we though we can implement into the town, but we need your thoughts on whether you think they will be effective or not. I put down my glass beginning to feel nervous. I can't make these decisions! I'm only 17 years old for heavens sake. \"Actually before we get to that, I need to use the restroom\" I say getting up and they all nod as the talk to each other about other things.<br>\r\n<br>\r\nI quickly walk to the bathroom, feeling shaky on what I am suppose to do as Thomas. I walk into the men bathroom to recollect my thoughts and I look into the mirror and sigh. I see a man before me that is more than twice my age, twice my size, and has job as the chief of police. \"You have to pull your self together\" I mumble looking into my new eyes. \"I am Thomas Phil\" I mumble to my self a few times, but then all my emotions comes out rushing at once. I begin to cry. It's all to much to handle! I'm in a strangers body living his life, and it's getting to me as the tears pour out of my face. It's just to stressful! I quickly grab some paper towels as I wipe the tears and snot that accumulated on my face, and I laugh softly at the mess I made Thomas look like. \"Sorry for ruining your tough guy image Thomas\" I smile as I feel the snot in my nose and the redness in my eyes.<br>\r\n<br>\r\n\"I seriously don't think I can do this though...\" I mumble \", I can't make Thomas's decisions for him... so maybe... just maybe I can depossess him for the night and possess someone else?\" But the problem is that I seem to not be able to control my powers fully. But then again I remember the last time I possessed Thomas, there seemed to be no struggle so maybe I am getting better at using it? Well its one way or the other I say staring in the mirror with a more serious face. \"I can't make these vital decisions for the town as Thomas...\" as I walk back out to the table. I open the door and walk a few steps out and I smile spotting my host easily. \"Oh hello sir\" the waiter of the table says \"If you excuse me I have to use the bathroom.\" and I sure as I try to extract the ghostly feeling I had felt for the past 3 times.<br>\r\n<br>\r\nI thought it wouldn't work for a second, as the frustration grew over me. I don't wanna make tough decisions for Thomas! It's not right for me to do it! But then suddenly I felt a slight tug as I stumbled to the floor, and I hear the waiter say \"Woah, are you ok man?\" Just a bit more. I slowly lose more and more control of Thomas's as I begin to feel a struggle of control over his body. Suddenly I pop out of his body in ghost form, and I hear him gasping on the floor as the waiter worriedly watches over him saying \"Sir are you okay? Do I need to go to get some help?\"<br>\r\n<br>\r\n<br>\r\nAaron worriedly watched over the struggling man on the floor and he help the man up after he seemed to get back together. \"Sir are you fine now?\" Aaron says watching him to see if he has another fit attack. \"No... no I'm fine... everything seems like such a blur though.... like everything that has happened. I know I did it... but it feels like I didn't do it....\" the strange man said muttering to him self. Aaron ignored what he said feeling a bit strange, and he says \"Sir let me lead you back to your table\" and he helped show Thomas back to his table. Aaron watched at the other people on the table asked if he was okay and he said \"Sir, if you need anything just let me know\" as he quickly walked back towards the bathroom unable to hold his bladder anymore. Suddenly as he approached the bathroom, he felt a cool sudden feeling as he felt his whole body go numb as he slowed down to a stop in front of the door. Aaron tries to move, but he watched as his vision slowly faded to blackness and his limbs almost felt as if they were disconnected from his body as an icy touch fills his warm core...<br>\r\n<br>\r\n<br>\r\nI watch as the waiter walks away from the table back into the direction of the bathroom. I follow him, and right before he enters the bathroom, I slowly forced my icy ghostly body. The warm sensation slowly came back to me, until suddenly I felt a heart beat. I look around as I notice I am facing a the bathroom door of the restaurant, and a new feeling washing over my senses. I need to take a piss and badly! I rush into the bathroom, going straight to one of the stalls. Wait. I don't wanna invade this guys privacy as I feel too awkward at the thought. I grab for the powers to depossess the waiter, and this time it came around a bit easier than before. Suddenly, I feel the rush of the cold wrap it self around me as I hear the waiter below me shudder. \"...hmm something felt extremely weird... oh well gotta take this leak\" and I float outside the stall as I hear the splash of piss hitting the water. I watch as he walks out and heads to sink to wash his hands. I jump back down upon him forcefully this time as a second later, as I gasp as the sudden warmth of his body, I find my self standing over the sink and I turn on the faucet as I wash my new young hands before me under my control.<br>\r\n<br>\r\n\"Hi...\" and I look at his name tag \", Aaron, I will need to use your body for a while, but not for long.\" I say in my new younger voice. I look into the mirror and see a guy who is probably older than me by 7 years. He is pretty well built, as I feel the clothes strapping onto my new body pretty well and I laugh while looking at the waiter uniform I am waiting. I find my self wearing a pair of black flacks, and a fitted white dress shirt with a black tie strapped around my neck. I also find a strange cloth that holds stuff wrapped around my waist holding two note pads with orders on it and a few pens. I look up at my new face to see a guy who looks like he just got out of college as long dreads of black hair hangs off my head. \"Well this is different having alot of longer hair for once\" as I put the hair out of my now green laughing eyes.<br>\r\n<br>\r\nI smile into the mirror to see Aaron's face brighten up and I say in his young crisp voice \"May I take your order?\"</span></div></div>",
            "created":1342587600,
            "id":1381297,
            "title":"Dinner Time!"
        },
        "11111111111111111":{
            "choices":[
                "Sitting in the Passengers Seat"
            ],
            "content":"<div class=\"\"><div> <span>Taking a last glance into my new reflection, I walk back out into the dimly lit restaurant as people are enjoying their dinner. I look back onto Thomas and the council members chatting away and I notice that Thomas still seems to be a bit disorientated. I wonder how it must have felt to be possessed... by me. The whole idea still seems unreal to me as I watch the other waiters walk about the fancy restaurant taking orders and bringing the entrees to the guests. Crap I should be working too. Looking down upon my new body, I look back up to see the same outfit on the other waiters and waitresses and I gulp unsure what to do. I never had a job as a waiter... and especially not at a high end restaurant like this. Soothing music plays throughout the room as an amazing aroma wafts it way in every part of the restaurant. Unsure what to do, I take out the notepad from Aaron's pouch as I look through the pages hoping it will guide me on what I should do next. \"What kind of shitting writing is this...\" I grumble as scribbled orders are written across the pages. \"Well Aaron, your... well actually my handwriting sucks...\" I moan as I shove the notepad back into the pouch annoyed.<br>\r\n<br>\r\n\"I can't do this\" I mutter and I realize why don't I just enter my ghost form and not have a single worry about Aaron's job. Stepping to the quieter side of the restaurant, I close my eyes and I search for the strange power to depossess Aaron. Feeling a sudden pull, I let out a gasp as I feel the cold sensation fill me to the core as I find my self once again floating above Aaron who seems dazed. \"What the fu--...\" Aaron says, as he looks around in confusion and I hear him mutter to him self \"This shitty job is getting to me\" as he walks back onto his usual business.<br>\r\n<br>\r\nHmm theres nothing else to do in the meantime so I guess I'll just follow him and see what a waiter is suppose to do. I float slightly above him as he walks around the restaurant to the table he attends to. I watch as he helps a table with an order, and I laugh \"Well doesn't seem to hard. All you have to do is be friendly and take the person's order.\" After he takes the groups orders, I stroll along as he goes to an empty table with empty dishes laid out about the the table. He reaches over for the check and I watch as I see a scowl come across his face as he whispers \"Assholes can't even give a nice tip...\" as he shoves the the tip into his pocket. He piles up the dirty dishes together and surprisingly fits all the dirty plates onto his hand and arm and I laugh \"Well I guess that's one thing you learn how to do as a waiter and I follow him as he keeps all the dishes in balance as he walks into the kitchen of the restaurant. He opens the door to the kitchen and suddenly I find my self in a bustling atmosphere as chefs are working on dishes as some dishes are being walked out. I hear food being chopped. The sizzle of meat and colorful vegetables on the pan. The dancing flames underneath the pans and pots. I can almost imagine smelling the amazing dishes being created... if only it wasn't for my ghostly state. <br>\r\n<br>\r\nWatching Aaron put dirty dishes and utensils into selected containers, I quickly become confused what is done behind the doors of a restaurant and before I knew it Aaron quickly turns around and walks through me as I let out a shout \"Watch out!\". I suddenly felt a quick burst of warmth to only feel the coldness wrap around me again and I turn around to find Aaron almost tripping on him self. \"Wooh watch out there Aaron\" I hear one of the chefs laugh and Aaron responds grumpily \"This job is giving me a headache man...\" as he pick up alot of entrees in one go as I smile in amazement at what you are able to learn to do as a waiter.<br>\r\n<br>\r\nFollowing him, I watch as he walks back into the soothing atmosphere of the restaurant as he strolls over to Thomas's table. Deftly, Aaron places the entrees down all in a swift motion and covers his annoyed mood with a false smile as he goes around the table filling the emptying glasses with more wine. \"Can I do anything else for you\" Aaron says and I can tell he seems to be in a grumpy mood behind his act. \"No we are fine...\" Thomas says as the other council members nods in agreement and Aaron replies \"All right if you need anything just call me over\" and he walks over to table with the with an older couple chatting while eating some desert.<br>\r\n<br>\r\nI silently glide along him getting bored as I watch him walking over to the table when suddenly a sudden shift in the air frightens me. A strange sensation fills my ghostly body as I see my transparent self slowly dissolving into the air. Whats happening?!?! I feel my self lose the grip on my surroundings as I almost feel like I am being shredded to little pieces. Panicking, I don't even think as I fly towards Aaron who is handing over a check a few booths away. Am I going to make it? Flashes of my life flies before my eyes as I get closer and closer to Aaron's back. What has gone wrong with my powers? <br>\r\n<br>\r\nInstantly the disintegration of my ghostly self is replaced of the warm sensation of being in a body as I sigh in relief but in response I only let out half a grunt for an off reason. Looking down at the couple, they look up at my worryingly and the older lady asks in a worried voice \"Are you ok young man? You look like something just hit you on the head\" and I respond \"I'm fine\" but to no avail. Whats happening? Am I not in Aaron's body? Suddenly my mouth moves on its own as I let out a soft groan and I unwillingly say \"....ouch.... Yeah I'm fine... don't worry about me I think I am just having a really rough night. Hope you enjoy the rest.... of your dinner, now if you would excuse me...\" and I try to stop my self from talking but I seem to have no control of any bodily movements. <br>\r\n<br>\r\nI panic as my movements are guided by an invisible force as I try to gain control of Aaron's limbs and arms with no avail. I find my self mutter under my breath \"I can't wait to get out of here\" as I unwillingly rub my head as I walk about without control. So this is what it must feel to become powerless... but the more frightening thing is that I'm actually conscience... I watch in fright through Aaron's eyes as he goes about his work. Am I gonna be stuck like this forever? </span></div></div>",
            "created":1349672400,
            "id":1443107,
            "title":"May I take your order?"
        },
        "111111111111111111":{
            "choices":[
                "Back in the Driver's seat"
            ],
            "content":"<div class=\"\"><div> <span>What the hell happened? I watch gloomily as I move around the restaurant without any control of what I am doing. I can't be stuck like this forever... Can I? I tried multiple times as time transpired to regain control of Aaron's body but with no success. \"I'm hoping you all had a wonderful evening\" I find my self saying in Aaron's voice, as I look down upon Thomas's table. \"Yes everything was great\" Thomas awkwardly smiled and the other council members also gave their thanks as well as Aaron watched them walk out of the restaurant. And also my shot at going back home to follow through with the plan. What happens if I can't snap out of this? I'll never be able to see Shannon and Tom again... and they can even get in trouble once Thomas gets back into contact with Maria and the FBI. The horrible idea lingers as I barely register the work Aaron continues to do over the night.<br>\r\n<br>\r\nI snap out of my thoughts as I feel Aaron's exhaustion of working. It feels like I have been doing the work as a drowsy feeling starts to cloud my mind. Aaron's physical state is effecting me as well as all his senses becomes my own. \"Finally done\" Aaraon sighs as I feel the warm water rinsing through his hands. The warmth spreads out throughout his body as he sighs and a relaxing feeling takes control of me. I sit by helplessly as Aaron clocks out of his work and he says bye to some of his co-workers as he leaves the restaurant into the warm summer night. Suddenly, I find my self digging into my pockets as I hear a jingle and a pair of keys appears in Aaron's hand and in the other a cell phone. <br>\r\n<br>\r\nThe screen flashes on and it reads 10:00 PM and Aaron quickly goes through the screen as he begins texting someone named \"Shirline\" a message.<br>\r\n<br>\r\n\"hey babe, just got out of work and im so bummed out. horrible day. but at least i can look forward to being with you later ;) be back soon\" and he sends the message as he looks back up and walks into the parking lot to an old sports car. Shirline must be his girlfriend or something. Nothing special compared to the many recent new cars I have driven as my other hosts, but still nice as Aaron drives off into the night. Slowly coming to a stop in front of a townhouse complex, Aaron lowers his blasting music as I try to figure out where I am. After being driven 25 minutes in the night, I have lost direction of where I am at as Aaron drove down many unfamiliar highways going over 90mph at certain points.<br>\r\n<br>\r\nAaron walks in the building as I watch him go up to the 3rd floor and opening room #311. \"Hey baby welcome back\" a young woman in her 20s says as wraps her arms around Aaron's shoulders. Aaron closes the door behind him and he smiles \"Miss me?\" and I watch as I lean over in Aaron's body and begin to kiss Shirline. A sudden feeling overcomes all my other emotions as I look into Shirline's eyes. It's almost I have known her my self... Actually I do know her. She's my girlfriend for the past 4 years and we moved in with each other after college.A beautiful girl, Shirline is only a little shorter than Aaron. Long locks of dark brown hair falls on to her shoulders as she stares into my soul with those dark brown eyes that I swore I have met many times before. Breaking the kiss, Aaron says \"Let me settle down, I'm starving and tired\" which snaps me back into the present as find my self shocked that I tricked my self into thinking that I was Aaron for a second. Being in the passenger seat must be effecting my mind.<br>\r\n<br>\r\nGetting quick glances at the rooms before Aaron can shift his view to something else, I now find my self in a lower quality apartment than Shannon's which is also much smaller. Suddenly I am walked over to the kitchen of the apartment as Aaron fishes out some questionable leftovers which I can't identify a can of coke. He dumps the food into the microwave and he snaps the can of coke open as he takes eager gulps of the cold fizzing drink. A tingly sensation spread throughout my body as I suddenly feel refreshed from the tiring work Aaron has put me through. \"So how was your day at work\" Aaron says as he loosened the tie around his neck and Shirline replied \"It was fine nothing new really. Excited though about your interview for that job you've been aiming for\" and Aaron replies \"Yeah, my college years may finally pay off and get me out of this shit hole\". Suddenly a ping comes from the microwave, and Aaron fishes out the leftover which happens to be pasta and he ravenously finishes the meal within minutes. <br>\r\n<br>\r\nBy the time Aaron finished the meal, it has satisfied the hunger I felt as well. Aaron puts the dirty dish in the sink as lets out a big yawn as I find my self being led to the bedroom the drowsiness becomes unbearable. I look to find Shirline already on one side of the bed and Aaron says \"God Im so tired... and I still have to take a shower and set up my clothes for tomorrow...\" and Shirline smiles \"It's ok Aaron. Just do all that tomorrow and get your rest now. You have a big day tomorrow and its more important to get some rest and just relax\" and she pats the bed inviting him over. \"Oh all right... but I'm so dirty from all the work today\" Aaron says as he strips off his work clothes to the side leaving him self bare with only boxers on. Catching a side glance in the mirror, I see Aaron, who has a lean built with an intricate tattoo on his right arm and chest, but before I could take a closer look his attention is diverted to the bed.<br>\r\n<br>\r\nFeeling a bit naked, I watch helplessly as Aaron climbs into bed with Shirline. \"Its ok Aaron, I like you dirty\" and she leans over and gives Aaron a passionate kiss that he gives back. Aaron's emotions begin to coarse through me again as I find my self thinking that I'm Aaron all over again. From the kiss, Aaron becomes aroused as the emotions become more intense,and his thoughts become my own. I lean over onto Shirline wanting more, but she pushes me away and says \"Sorry baby but that will have to wait till tomorrow so you can get the rest you need. The last thing you need is to go to work more tired than you are now\" and she gives a quick peck on the lips as she flips the light switch off. I sigh or rather Aaron sighs feeling disappointed, and he mumbles \"Alright...feeling nervous about tomorrow though...\" and she replies \"Just get your rest and everything will work out just fine\".<br>\r\n<br>\r\nLaying on the bed, Aaron stares at Shirline sleeping for a little as I feel the same emotion of wanting more. Sighing, he turns and looks at the ceiling and slowly the drowsiness comes back in control as he slowly shuts his eyes sending us both into a deep slumber...<br>\r\n</span></div></div>",
            "created":1349758800,
            "id":1443160,
            "title":"Sitting in the Passengers Seat"
        },
        "1111111111111111111":{
            "choices":[
                "A little bit like Aaron"
            ],
            "content":"<div class=\"\"><div> <span>A shriek of the dreaded high pitch noise goes off as I moan in reaction and mutter \"Just a few more minutes...\" and an unfamiliar voice replaces my own. My eyes snap open to a semi-dark room and I grin to my self realizing I'm back in the driver seat of Aaron's body. A wave of relief washes over me as I let out a deep sigh. \"I won't have to be stuck in that nightmare ever again\" I whisper to my self and I hear a groan as Shirline climbs out of bed turning off the alarm. \"Oh sorry, did I wake you?\" she yawns and I reply sleepily \"Its okay...\" and she smiles and leans over and gives me a quick kiss leaving a tingling sensation on the tip of Aaron's lips. \"Well I'll let you go back to sleep, you must be bummed out still\" and I smile slightly realizing the exhaustion that Aaron's body is still going through. Taking a glance at the clock I see its 5:47 AM and I yawn as the sleepiness starts to roll back in and I mutter \"Alright..\" as my eyelids heavily closes as the warmth of Aaron's bed cradles me back into a gentle sleep.<br>\r\n<br>\r\nThe caressing rays of the sun crawls its way through the blinds of the room as I wake up gently as I hear cars pulling out and driving away until I hear no more. Opening my eyes, I'm blinded by the rays of the sun that creep through the blinds and I yawn feeling more rested than before. \"Anybody home\" I shout hearing Aaron's voice echo through out the room and I smile as no one responds back. \"Finally back in control\" I yawn as I lean into a sitting up position on Aaron's bed and I look down upon Aaron's body to find my self completely naked except for the pair of boxers he has left on. Well this is another thing difference between Aaron and I. In my regular body, I would always wear pajamas to the sleep and being so disrobed in Aaron's body feels strange. Glancing at the clock, I see that its 8:53 in the morning and I roll off Aaron's bed feeling the cold touch of the floor beneath my feet. Looking around Aaron's room, I note that its pretty tiny with a dresser on the side with a big box television sitting on top of it. I notice alot of pictures of Aaron and Shirline together smiling in different locations, and I can't help my self but smile.  All of the rooms items are older as I walk around the room and maybe I am only noticing this after living in more luxurious situations for the past few days. This place seems a bit like my own home except for the fact that I can consider my self in charge and not have to worry about my parents alcoholic rants and constant fighting. \"I guess that's one thing that is a benefit\" I mutter as I look into the mirror to see the reflection of Aaron staring back at me.<br>\r\n<br>\r\nI actually feel more free for once. With my new strange powers I can escape my life with my parents and live on my own without the worries of my old life. I can literally become anyone I want. I stare into the mirror to see my new reflection and I smile still feeling the strangeness of seeing someone else body in the reflection of my own. \"This is me\" I whisper as I flex Aaron's lean muscles and I grin looking at the intricate tattoos he has wrapped around his right arm and a dragon across his lean chest. I glance up to my face and I see Aaron's face staring back at me. I touch the light beard around my pointed chin and I smile when I see how messy Aaron's hair got over the night as it resembles a mop from a janitors closet. With my new powers, I am able to be freed of my parents abuse and become anyone I like... Now I am an adult, named Aaron who has a pretty girlfriend, and who is able to control his own life without anyone else interfering.<br>\r\n<br>\r\nI shake my head in disagreement, although I may have to now live in other people's bodies in order to survive, I am still myself. I walk closer to the mirror and touch my new finger tips to the reflection. I may be Aaron on the outside, but I look into his green eyes and I still am able to see my self. I have my friends Shannon and Tom, and even though my parents have only brought bad memories I cant help but think what has happened to them after they found out I'm \"dead\". \"I am Mark\" I say confidently, and I can't help but chuckle still not used to be in a new body almost everyday.<br>\r\n<br>\r\n\"I should give Shannon and Tom a call\" I sigh as I turn away and look for a phone to call them with. Oh wait... I look around to see Aaron's dirty work clothes from yesterday and I rummage into the pocket to find the cell phone I saw from yesterday. I activate the phone and I groan. Its locked. \"Well one thing that doesn't happen with my powers is gaining the person's memories\" I mumble and I put the smart phone on the bed as I look around for a telephone. I look around in the bedroom with no avail, so I decide to check the rest of the apartment. \"There is bound to be a telephone here somewhere...\" I sigh as I walk into the brightly lit apartment room. The sun rays are flowing in giving Aaron's and Shirline's home a nice homey feeling. \"Ah there it is\" I exclaim instantly seeing a phone on the wall. <br>\r\n<br>\r\nEagerly typing in Shannon's cell phone number I hear an error on the other line and it says \"Sorry but you are unable to make long distance phone calls. Please call your telephone provider for more information\" and I hang up the phone in frustration. Damn it. Aaron and Shirline is not paying for the extra fee to make long distant calls possible. What am I going to do now? I can't stay as Aaron! He has an interview today that I know nothing about! I march around the apartment in frustration unsure what to do. My train of thought is broken when I smell the all too familiar smell of being in a dirty body. Body odor. Take a sniff at Aaron's armpit, I smell a slight mixture of deodorant that is wearing off as the smell of his body odor is starting to kick in. Surprisingly, all this frustration has effected me greatly. \"Strange usually I don't get worked up like this\" as I feel slightly sweaty after pacing around the room in anger. Must be the usual way Aaron's body reacts to stress.<br>\r\n<br>\r\n\"Well not sure what else to do now, so minus take a shower for Aaron's sake\" and I think about the idea of depossessing Aaron again to give him his privacy like before but with last night's scary event I don't think its such a good idea. Walking back into his room, I look into the only drawer in his bedroom and I fish out the first clothes I can find. A tank top, a boxer, and a pair of basketball shorts. \"Hmm comfy enough I suppose\" I mutter as I walk back out into the living room of the apartment to find the bathroom across the room. Walking in the bathroom, I flip the switch to find the bathroom and I almost jumped when Aaron's reflection filled the mirror. Laughing, I smile \"Don't think I will ever get used to that\". <br>\r\n<br>\r\nTrying to get this done with, I place the clean clothes to the side as I pulled off the boxers finding my self completely naked in a strangers body. Looking away, I slip in to the shower and twist the nob as a full blast of cold water strikes me full force. I jump feeling quite jittery about the whole situation as it is but slowly the warm water begins to gush out sending a warming caress around my body. Applying the shampoo and body wash, my usual habits got the best of me as I looked down instantly feeling that I just breached Aaron's privacy. Not like controlling his whole body and life is any worse as it is. Lets just say he has a bigger package than I do. I think that's more than enough I sigh as I turned off the water. <br>\r\n<br>\r\nTaking a step outside feeling slightly awkward, I instantly found the ground rushing up to me. How can I be so clumsy? Hitting the cool moist ground, the world instantly becomes black as my conscience fades into the darkness.</span></div></div>",
            "created":1350018000,
            "id":1444856,
            "title":"Back in the Driver's seat"
        },
        "11111111111111111111":{
            "choices":[
                "Getting into deeper trouble"
            ],
            "content":"<div class=\"\"><div> <span>Rolling in the darkness, quick bursts of images flashes through my mind. What is this.... Images and memories not of my own flashes in my mind to only disappear a second later before I can get a true grasp of what was actually being shown to me. A sharp dull pain wakes goes through my head, as I moan bringing back out of the strange dream. \"Ouch...\" I moan, feeling a dull pain on the side of my head. The cool tiled floor of the bathroom tingles my naked body as I open my eyes feeling as if something is banging on the inside of my head. Slowly getting up, the dull pain pulses as I moan and rub the front side of Aaron's head. Still damp from the shower, I look into the mirror to see a big bump on the side of Aaron's head as I rub it trying to ease the pain out. \"Sorry Aaron\" I grunt as the pain sends a nausea feeling in the pit of my stomach. I pull on the Aaron's clean clothes to the side instantly feeling more comfortable. It's just too weird to be naked in someone's body. Walking outside of the bathroom, each step sends a dull pain into my head. Sorry Aaron, its bad enough that I am using your body already... \"Well I know there is some ice packs in the fridge that I just recently bought\" I mutter as I fish into the refrigerator fishing out the ice pack I bought from Target. The ice pack leaves an icy touch to my fingertips as I wrap it around a towel and placing it on the bump of my head.<br>\r\n<br>\r\nI sigh in relief, as the dull pain begins to slightly fade away as I lay down onto his bed. Laying there, I sigh and mutter \"Good thing I remembered to buy the ice pack...\" but then I realize the strangeness in what I have been saying. I didn't buy the ice pack! Looking into my past, I see a very blurred vision of me buying the ice pack, but then I slowly realized what has went wrong. A piece of Aaron's memory has somehow got scrambled up into my own. The thought of Aaron's memories becoming my own, sends a shiver up my or rather his spine. How weird can this get? Must be from me accidentally slamming his head onto the floor... I chuckle slightly but next time I need to watch after the body I am in a bit more carefully. <br>\r\n<br>\r\nGrabbing his phone by my side, I check the time to see that I have been passed out for 15 minutes. Wooh. Its 9:24 and I sigh as I unlock the phone... but then I realize that I don't even know the password as I entered the 4 digit code into the phone. Instantly the smart phone lights up as it brings me to the main menu, and I laugh. Wow some of Aaron's memories has really gotten into my head... I mean his. His pin code just so happened to be 8008 and I chuckle. How mature Aaron. Well this is a perfect time to call Shannon. Smiling at my change of luck, I dial in Shannon's cell phone number as I wait through the rings for a few moments. \"Hello\" I hear Tom say through the phone and I reply \"Hey Tom, it's me Mark. I know I may sound different right now but that's because I'm in a different body right now\" and I hear whispers in the background and I hear Shannon sigh and \"Give me the phone idiot\".<br>\r\n<br>\r\n\"Mark is it really you??\" I hear Shannon say in a slightly worried voice, \" You need to get here pronto! I'm not sure what you did but everything has gotten messed up. Right now I just got a call from Thomas saying he wants to meet me about the box. At first I thought it was you and I called him Mark, and he got confused that I mistaken him as you! You have to get back here now before he gets here with the FBI. I think they are onto something...\" and I stutter \"Oh shit! I'll come as soon as I can just don't open the door for them. Maybe you should leave and go hide somewhere else now, don't let them catch you\" and Shannon replies \"Shit, he just pulled into the parking lot and two other people are with him! Hurry. Also next time you need to contact us call Tom. They may be tracking my number\" and she hangs up. <br>\r\n<br>\r\nOh shit... I hop out of Aaron's bed as I quickly grab his essentials. His wallet, cellphone, and keys as I rush out of the house dumping the ice pack to the side. They can't possibly find out what has happen to me? Can they? Who are these people behind all this?! I quickly jostle to the car I Aaron drove in yesterday as I jump straight into the driver's street. I peel out of the parking, realizing I don't know where the hell I am at. Bingo. Good thing some of Aaron's knowledge became my own I smirk as I use his smartphone GPS to guide me out of this unfamiliar town back to Shannon's apartment. <br>\r\n<br>\r\nPeeling out and zooming down the road I look at the expected time of arrival to be 27 minutes later. Aww shit. Hopefully I won't be too late.<br>\r\n</span></div></div>",
            "created":1350277200,
            "id":1447688,
            "title":"A little bit like Aaron"
        },
        "111111111111111111111":{
            "author_id":"arcusxeno22",
            "author_name":"Arcus",
            "choices":[
                "Time to go back home"
            ],
            "content":"<div class=\"\"><div> <span> I arrive at the parking lot. Running towards the lift, it opens and I see Shannon and Tom have been caught by Thomas and his men. \"Oh man, how i want to help them???\" my heart whispered. As the ideas pop out in the mind, I pushed the henchmen to let them free. Thomas tries to grab them but i halts him with a punch on his face. \"Now, run !!!... I will follow you from the back.\" Shannon and Tom run as fast as they could. The henchmen stand up and put a fight with me. Thanks to Aaron's memories on how he learned martial arts, i dodge all the attacks and counter it with my youth punch.<br>\r\n<br>\r\nThey all beat up. Feeling satisfied as i turned back to see what happen to Thomas, a hard punch lay on Aaron's face. As the force of the punch is very powerful even i have been dragged out of Aaron's body. \"What a punch is that??\" I floats on the air. Thomas apprehends him. Aaron gains his consciousness and confuses as his hand was handcuffed. \"Sir, what have i done?? Why you arrest me??\" asks Aaron. Thomas just silent and his face turns anger as his captives flee from him. \"Two of you, take him to the station!!\" The henchmen quickly bring Aaron into the police car. Thomas follows them from the back.<br>\r\n<br>\r\n\"I feel sorry for Aaron as he has to be responsible for what i did\". Flying in the sky to find Shannon and Tom. Something catches my sight while scouring the sky, i see two of them resting at the abandoned house not far from me. I must quickly approaches them before this form reaches its limit. <br>\r\n<br>\r\n\"Tom, you think what happened to Mark after we left him??\" Suddenly, Tom's body begin to convulse, then he replies \" I'm ok, you don't have to worry\" Shannon puzzled as he says something ridiculous. \"What are you talking about?? I'm not asking about you..\" Tom put his hand on her shoulder. \"Its me, Mark. Do you remember??\" She gasped in shock as i explain the truth to her. \"Mark?? Are you possess Tom??\" I replies \"Yes, its me Mark, i have to do it as there are no other bodies here that i can use except him. If i don't i will disappear like the last time.\" I explain in details to her.<br>\r\n<br>\r\nUnexpectedly, she hugs me as hard as she can. It feels weird as i have been hugged inside Tom's body. \"Sobs....sobs.... I'm scared Mark, I'm scare if i lost you...\" her tears falling on Tom's shirt which means my shirt now. I'm pleased as she really concerns about me. \"Don't worry sweetie, I will always be with you even with different bodies, I will... But for now we must find a way out of this problem before it become worst.\" To be honest, this situation has become out of control. Now, we have been suspected and nowhere to go. Thomas must be serious about that box. Firstly, i must find a place that we can hide.</span></div></div>",
            "created":1446181200,
            "id":2054679,
            "title":"Getting into deeper trouble"
        },
        "1111111111111111111111":{
            "author_id":"arcusxeno22",
            "author_name":"Arcus",
            "choices":[
                "Discuss some plan"
            ],
            "content":"<div class=\"\"><div> <span>The day turn dark as Shannon and I wander aimlessly in the city. Thought that i have to think a suitable place for us to hide, its useless as this whole city have many police station. We can easily get caught by Thomas and his men. Oh my that brawny head. Why the government really wants that empty box for?? I cannot stand anymore. <br>\r\n<br>\r\nWhile carrying Shannon upon my arms, cause she really tired of walking for several hours, we reach a familiar housing area. \"Hmmm.... i think i have been here before\" thought me as i try to remember. After a while wandering, i notice how strong Tom's body as he could carry Shannon who weights about 50 kg for a period of time.<br>\r\n<br>\r\n\"I'm sorry Tom as i have to force myself to use your body\" i say to my host. I reach in front of a small house that looks gloomy. Taking a few small step, we stand by the door. Oh... now i remember. This house is my parents possession. We once live here before both of them even me living separately each other cause by family problems. Ahhh... it makes me heartache trying to remember the dark past of my family.<br>\r\n<br>\r\nLet's left the memory flows just like a river. I open the door and scan the whole house thoroughly. The night become just like a shadow that engulfs entire city. As the condition inside my house is in control, I lay Shannon on the old bed. The dust that cover all the furnitures make me difficult to breath normally. Cleaning anything that should be clean and rearrange the furnitures, now it looks like a simple house for sure.<br>\r\n<br>\r\nTired of cleaning, i take off the shirts as the unpleasant odour begin to rise. \"Eeewwww.... the smell, it could kill me if i don't take a bath\" . All the parts of my clothing have been removed, just leaving a pair of boxer as usual. I enter the small bathroom compared to my previous body, Thomas. This bathroom is quite spacious. <br>\r\n<br>\r\nLooking to the mirror, i'm a little bit surprised to another strange reflection of my body. To see Tom's relection seeing me back. I'm still can't take it normally. Not expecting this body also has a lean muscle thats look nice and fit for a taciturn person like him. Maybe in quietly, he works up his muscles to get this body shape. A hazel brown hair down to his neck, a pair of coal black iris that attractive. Hmmm... Tom has many unique features that him looks faultless. <br>\r\n<br>\r\nIt has been my routine to check the body of my host everytime i possess the different person. After take some bath, i applies my old shirt that i found in the antique cupboard. Walking to the room where Shannon sleep, i see that she has wake up from her slumber. \"Where are we??\" answer me \" In my old parent's house, i found it accidently while we wandering in this housing area. We can stay here for awhile before we proceed the next move\". A sweet smile etched on her face. Shannon go to take a bath. I try to find something to eat in the kitchen. </span></div></div>",
            "created":1446181200,
            "id":2054722,
            "title":"Time to go back home"
        },
        "11111111111111111111111":{
            "author_id":"arcusxeno22",
            "author_name":"Arcus",
            "choices":[
                "Tommorow morning"
            ],
            "content":"<div class=\"\"><div> <span>Going out to buy some food ingredients, i left my mom's shirt on the bed for Shannon to wear. With precaution steps, i try to avoid from bumping with any police officers along the way to go and return from the market. In the kitchen, i search for the cooking utensils and wash them as they have not been used for a long period.<br>\r\n<br>\r\n Haaachooo... the dust all over the place make my nose hurt. Well, this house was abandoned for five years and now it could be a nest for some creepy creatures. Maybe for the time being, i have to clean a little so I and Shannon can use it for living. <br>\r\n<br>\r\nAs i preparing the ingredients, a warm hands hug me from the back. \"What kind of food for the dinner today, my chef??\" Shannon's seducing voice makes my heart melted for awhile. I think i should cook her favourite foods so she would be happy after all this kind of hardship. \"I will cook chicken lasagna and fresh green salads, you favourite foods sweetie\" She lays a passionate kiss on my cheek and asks me what ingredients that she can help to prepare.<br>\r\n<br>\r\nEven i was in Tom's body, she treats me just like my old self, i think it would be hard for her to see i'm dead and didn't have the real body. But my life must be go on. From my perspective, i can get my old body if i can find the scientist that make this liquid. <br>\r\n<br>\r\nThe meals is ready to eat. Both of us sit and eat together. We have some chit chat, change stories and interests. It would be the best dinner ever as you can eat with your lovely girlfriend and have some funs even in Tom's body. After cleaning the dishes, i jump to the bed as the tiredness start to spread throughout my body. For what happen to me when in Aaron, i remove my shirt and Tom's fit body reveal clearly. I think this kind of habit have adapted to me as i possess Aaron. Shannon enter the room and shocks for what she sees in front of her. \"Why you undress??\" asked her.<br>\r\n<br>\r\n\"Hmmm.... i just kind of inherited some of my previous host habit to sleep with shirt off.\" She sits on the bed besides you. \"It didn't bother me if its your body but i feel guilty for Tom.\" I thought for a moment, it would be right for what Shannon said just now. \"How about this only night??\" suggest me as i think this the only time that i have to spent with her.<br>\r\n<br>\r\n\"Maybe its ok for this night\" her hand starts to rub Tom's chest, i mean my chest gently. The feeling begin to arise through this body. I also put my hand on her back and hug her. A soothing kiss lays on my face as she rubs all part of my body. That night was flipping fantastic and the fine moment for me and Shannon together. Oh i forget...sorry to Tom, i have to borrow your body for this unforgettable event. <br>\r\n</span></div></div>",
            "created":1446267600,
            "id":2055135,
            "title":"Discuss some plan"
        },
        "111111111111111111111111":{
            "author_id":"arcusxeno22",
            "author_name":"Arcus",
            "choices":[
                "A sudden attack",
                "Release from the anti ectoplasmic cage"
            ],
            "content":"<div class=\"\"><div> <span>         On the next morning, I opened my eyes and saw my body moved on his own. Oh come on, is it the passenger seat again?? But something seem unusual. Tom was carrying Shannon on his arms. Where he wanted to go with Shannon?? I need to take over now. As I struggle to overpower him, but still in passenger seat. Oh no, don't tell I've been trapped inside this body as secondary mind.<br>\r\n<br>\r\n          Tom entered a huge science laboratory. This is the first time I saw this place. He continued towards a specific room. In that room, a man with lab coat was discussing with his aides. \"Oh, Tom. You arrive finally. Put Shannon in that cell. How about the specimen ??\" asked the man. After putting Shannon, Tom answered, \"Well, the specimen is still inside my body. I have block his control and dominance. Thanks to your potions, Prof. Isaac\". That mean Tom knew I am in his body after all ?? This can't be true. Prof. Isaac approached Shannon, who is imprisoned in nearby cell. \"Oh my cute Iris, you are the one who hide him all along. Luckily for me, I make you live with Tom, so that he can watch over you and take the opportunity to catch your boyfriend. What a great plan\" laughed him.<br>\r\n<br>\r\n           Tom take a sit on one of the electronic chair. The aides help him to prepare for a process. \"Now, we will begin the De-possession process in order to separate that brat from Tom's body. Please make sure all the machine set up. We will begin now!!!\" commanded Prof. Isaac. He pushed a blue button on the table and all the machine begin to work. An arm of machine generated a high current and pulled me from outside of Tom's body. As the De-possession process begin, both me and Tom shout like a hell as the pain is unbearable. Within a few minutes, my spirit formed beside Tom and imprisoned in an anti-ectoplasmic cage. He fell unconscious after the process. \"The process is a success. Now, we can finish this once and for all\". said the professor.<br>\r\n<br>\r\n            \"What do you want from me??\" asked me. He grinned while preparing some sort of chemical formula. \"Well, someone involve himself in something he don't know and messing around like it was a child play. The liquid that you are exposed is my one and only creation in order to control this world. But it fell into you who is not mature boy. Now, we will extract the liquid from you but the risk is you will feel a slow death for a moment\". No..no..no.. I don't want to die like this. This is madness. I have to do something. What should I do?? </span></div></div>",
            "created":1485277680,
            "id":2268543,
            "title":"Tommorow morning"
        },
        "12":{
            "author_id":"bodyswapman",
            "author_name":"Swap",
            "choices":[
                "Home sweet home",
                "Another side another story possess a fire fighter instead",
                "Another side another story Possess Tyler friend instead",
                "Reader choice",
                "Reader choice"
            ],
            "content":"<div class=\"\"><div> <span>I walked through the streets of my neighborhood.Like usual it was a boring day for me ,my parents where drinking at there friends ,My best  friend Matt is packing for vacation,and all the other people I know just don't like to do stuff with me especially if you had a troubled life like me .Like I said earlier my parents where drug addicts they constantly did it and not only did it effect there lives ,our house ,even how they work they ruin my entire life ,You know how people give you look's if you did something wrong well people give it to me if like I where some kind of outsider .At high school They think I needed mental help just because I  had this kind of life but they just don't get it.<br>\r\nThe night was dark and a bit cold as I past through a field going towards a abandon factory ,that factory always cheered me up for some reason maybe I did cause that's where me and Matt met ,I kept walking towards it passing through a broken gate that had a gaping hole he size of the car ,I could already see the factory ,it used to be an old chemical testing factory but Matt's dad checked it out and he didn't find any chemicals except for a door that wouldn't open .<br>\r\nI open the door and see all of me Matt stuff that we added here it kinda turned into a clubhouse for the both of us when we where kids now it's  just a place for us to hang out or to have a good time .<br>\r\nI hang out on a couch that had a hole in it's back ,it felt nice to be here as I laid down on the couch trying to have the rest of this day in piece.<br>\r\nSuddenly outside of the factory some builders where getting ready to blow the factory apart ,they already check inside and all ready set the explosives they just didn't know who was inside ,they pushed the red button and boom went the first bomb ,I woke up from the loud bang and then another one came up BOMB it was even louder then the first I couldn't move well a BOOM an even louder one came up I then finally noticed that half the factory was either on fire or destroyed ''OMG what happened''I yell I get up and start  getting all the important things that me and Matt had there .<br>\r\nSuddenly another boom came up and that one opened the Door that wouldn't open ,I hurried to get the rest of the stuff and just to get out of the place then another bomb  erupted BOOMMMB this open blew the room behind the door apart and it exploded violently destroying everything in it's path .I ran towards the door but I couldn't out run the explosion ,then the explosion and fire hit me as I went hurling towards a corner even farther from any entrance and I laid there thinking I was dead as fire spread from my body ,I felt sad that My life had to end like this but For some reason I didn't feel pain or the heat from the fire at all ,I looked at myself ''Wow im a ghost ''I said ,my body was gone except for the clear blue see through soul I had left ,I got up and started to walk through the fire ''Wow this is so cool''I said  ,I walked towards the door and exited the building and once I step foot out of it the Final bang went off BOOOOOOOMMMMMMMBBBBBB,it destroying the rest of the factory ,I think of all the good things that happen there noe gone ,I see the Builders and Some fire fighters I walk over to a Builder he had a white helmet over his short blond hair he was tall and young probably in his 30 he had a fire proof jacket on an also some jeans he also had a name tag on I read it out ''Tyler Galway/ Builder''  ,even though I didn't have a mind I could still think and I had one though in my mind <br>\r\n''Possess Him''<br>\r\nI agreed I didn't know how but I had to get A body besides It's only for a little while I'm technically half dead dead anyways ,I move my right leg over to his and feel the warmth of a body ''So that's how''I said ,I move my left leg over to his left leg and feel warm again as I start positioning my lower half into his  then positioning me arms into his long muscular ones then positioning my head even though it's around his neck ,then forced the rest of my body into his and for some readon the ghost figure did the rest.<br>\r\nTyler fell on the ground as did I as he let me go in control ''Ahhhhh what's happening to me''He says .He finaly leaves into the mind and I finaly gain control ''TYLER YOU OKAY!'' his friend says ,I open my eyes feeling way different then I did before but even more different then I did in my body ,I get up feeling tall muscular rather then my short average sized body ,I start talking in a deep voice ''Yea man I feel okay except my head hurt's a bit I think I'll go home'',Your head did hurt and You wanted to figure out what happen to you as soon as possible ,''Go ahead tyler just come back to this work site tomorrow 10:00am sharp okay''His friend say's , you nod and strart walking towards  a place with a group of cars parked together ''I wonder which one Is Tyler's''You say to yourself ,In the back pocket of your jeans you feel some keys and take it out pressing the alarm ,the one that rang was a aToyota tundra that was fairly nice ''Not bad '' you said,You walk over there and yank open the door ,You had some drivers traning so you knew how to drive but didn't know where Tyler lived ,You search for a gps and fing one in the glove box ''There the bugger '' you said ,You turn it on and put go home , ''Maybe becoming Tyler wsa like God giving me a second chance at life I'll make this one better then my last besides I might even try to leave his body and find a new one''You say ,you turn on the tundra and start driving towards a new life.</span></div></div>",
            "created":1350190800,
            "id":1446518,
            "title":"The explosion"
        },
        "121":{
            "author_id":"vojirst",
            "author_name":"E",
            "choices":[
                "expolore your new body",
                "sleep"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look threw your host memories to find were you live. Once you get there will be shocked his live in a mansion all by himself. Once you get out the car and get into the house you want to what the first thing you want to do.</span></div></span></div>",
            "created":1383368400,
            "id":1687490,
            "title":"Home sweet home"
        },
        "13":{
            "choices":[
                "Practice being a ghost.",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Mark wakes up and gets ready for his boring job. He hates being an accountant, but it pays the bills. He goes through the motions, showers, brushes his teeth, gets dressed, and grabs his briefcase. But as he crosses the street to get to his car, Mark gets hit by a car!<br>\r\n<br>\r\nMark regains consciousness, but he feels different. He is floating, and everything around his is moving very slowly. He looks around and sees a red sports car, an ambulance, some paramedics, some cops talking to a guy, and his dead body! \"I'm dead?\" he thinks. Mark remembers what happened now. He was hit by the guy driving the red sports car. Mark is so overwhelmed he doesn't really know how to feel. He floats back to his home to get his thoughts together.<br>\r\n<br>\r\nWhen he goes to the front door, Mark tries to figure out how to get inside. He reaches for the handle, but his hand passes through it. He tries to phase through the door, it feels weird, but Mark got inside. \"Being a ghost is going to take some getting used to.\" he thinks to himself.<br>\r\n</span></div></div>",
            "created":1385096400,
            "id":1697705,
            "title":"3"
        },
        "131":{
            "choices":[
                "He possesses the rabbit",
                "Something happens",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Mark looks in the mirror and realizes he doesn't have a reflection. \"It makes sense,\" he thinks. \"I am a ghost after all.\" He goes through his house and thinks about how good his life really was. Mark's house is nice for a single man. He feels like he didn't appreciate it when he was alive. \"Well, it's too late now. Better figure out what to do now.\"<br>\r\n<br>\r\nMark decides to figure out how to be a ghost. He remembers watching movies and T.V. shows with ghosts in them and wonders how to use their powers. Mark looks at his globe and tries to spin it. He tries to use his ghostly hands, but they just phase through. He tries to use his mind, but that does nothing. Finally, Mark phases into the globe and possesses it. He is now able to see all around the globe. It feels weird, but after he gets used to it, he tries to spin it and it works! Then Mark tries to tip it over buy leaning to the side and it falls over! \"I did it!\" Mark thought. \"I learned how to move things and how to possess!\"<br>\r\n<br>\r\nHe dispossessed the fallen globe and floats over to his pet rabbit. It's in a cage running on its wheel. Mark always wanted to know what it's like to be his pet so he tries to possess his rabbit Arthur.<br>\r\n</span></div></div>",
            "created":1385096400,
            "id":1697712,
            "title":"Practice being a ghost."
        },
        "1311":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "search the room for something to be",
                "someone enters the room",
                "leave Arthur's body"
            ],
            "content":"<div class=\"\"><div> <span>Mark phases into Arthur's body, soon taking control over it. By doing so, Mark falls off the wheel. Soon, after opening his eyes, Mark sees everything around him in a large scale. The cage, the wheel, and everything else in his room has gotten large.<br>\r\n<br>\r\n\"Woah, so this is what being a rabbit is like.\" He thought. For him, all of this is a brand new experience. It's like he had tried something new, and is still feeling its effects on his body. While looking around, Mark then notices something strange.<br>\r\n<br>\r\nFor some reason, he feels a bit different than usual. His body is quite furry, making him feel all warm. Looking behind him, Mark notices that he has a tail, a poofy one at that. \"I wonder if I can move it.\" Mark wonders.<br>\r\n<br>\r\nTo Mark's surprise, he manages to shake it a little. Happy with himself, he continues trying to see how he can move it, only noticing that he can shake it a bit or a lot.</span></div></div>",
            "created":1488941400,
            "id":2286343,
            "title":"He possesses the rabbit"
        },
        "13111":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "Mark becomes the toy",
                "Mark decides to do something else"
            ],
            "content":"<div class=\"\"><div> <span>He then hops on the wheel, hoping to see why Arthur likes the wheel so much. The little bunny must have a reason for it. Using his new paws, Mark makes a crawl-like movement while on the wheel, slowly operating it.<br>\r\n<br>\r\nAfter a while, he begins to test himself in hopes of seeing how far his bunny potential can be. Running in the wheel, Mark begins to have a little fun. Moving his rabbit limbs as much as he can, Mark continues to run on the wheel, excitedly embracing his new form.<br>\r\n<br>\r\nThis is more exercise that he has done for the year.  There is so much to enjoy and see when he can take over objects and animals. He could do this forever if he wants. He's even able to see his bed, with it being so close to the cage.<br>\r\n<br>\r\nWith Mark's powers of possession, almost anything can be controlled. He could prank someone just by being a living teddy bear or doll set to haunt them or be played with. Maybe he could even take over some guy who has a hot girl and date them.<br>\r\n<br>\r\nGetting enjoyment out of this fun power is the only thing he can do. Looking at his action figure up on the shelf, Mark wonders if he should take it over instead. Years have gone by since he's ever found great interest in it, and with his newfound powers, Mark can probably have fun once-again.<br>\r\n<br>\r\nThinking it over, Mark realizes that being Arthur has gotten a bit boring. If anything, he might as well wander about and possess something else. Phasing out of Arthur, Mark heads over to the action figure, eager to see how things will be.</span></div></div>",
            "created":1490936580,
            "id":2297626,
            "title":"search the room for something to be"
        },
        "131111":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "have some fun",
                "just explore the room more"
            ],
            "content":"<div class=\"\"><div> <span>Taking possession of the action figure, Mark soon begins to move the limbs and head. In complete control, Mark realizes that he has fully taken over something inanimate and humanoid. So far, he can move a bit.<br>\r\n<br>\r\nInterested in this new body, Mark looks down at himself, noticing his strange look, being that of some kind of superhero knight. For some reason, he feels a bit of wonder surge through him, as though lingering emotions have finally been fulfilled.<br>\r\n<br>\r\nIt has been so long since he played with toys, especially since he's grown and met people and chose to play video games and watch movies instead.<br>\r\n<br>\r\nYears back, it wasn't that interesting to him. He only kept the toy around for the childhood memories he had with it. Soon, he would end up putting the action figure on the top shelf was an honor as that's where he wanted to keep most of the stuff he didn't use. At least now he can have a little fun.<br>\r\n<br>\r\nJumping off from the shelf to the bed, Mark feels that he can be dangerous if he wants to. He looks at himself, realizing how scary that could have been if he weren't exactly a toy.<br>\r\n<br>\r\nBeing a knight type of toy, he wonders if he can explore his room and have fun. Hopefully Arthur might not find it strange. He then jumps off to the floor. After regaining his composure, Mark feels glad that he can do these things now.<br>\r\n<br>\r\nMark runs around, feeling free and happy to be an action figure. He feels great to have these powers to test out. Being a hero is kind of fun. It's something he felt like experiencing, but in a life-size kind of way instead of being small.<br>\r\n<br>\r\nAlthough it's strange to feel like plastic, at least he won't hurt himself. Mark just only wishes he could wear accessories on him like his clothes. Either way, he'll make things work if he plans on being stuck as a toy.<br>\r\n<br>\r\nMark plays around in his room by running and doing hero poses. Stuff that he has seen on the live screen and on tv. The power of being a hero is within him, as he has now become the protector of his home. No evil shall befall his home for he shall be there to save the day. A protector and savior, that is something he is, even if he is small.</span></div></div>",
            "created":1490936760,
            "id":2297629,
            "title":"Mark becomes the toy"
        },
        "1311111":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "go pet Selene",
                "watch Selene"
            ],
            "content":"<div class=\"\"><div> <span>While he is playing hero, his cat, Selene, calmly enters the room. Selene has often found her way around the house, being the curious and exploring type. She wouldn't be the type to do much, but still, Selene has found it easier to just relax and be lazy at times. Perhaps she was searching for some food to eat.<br>\r\n<br>\r\nLooking at Selene now, Mark realizes how different things are. She is so adorable now compared to her larger size. Mark might even climb on her and ride around for some fun.<br>\r\n<br>\r\nStill a toy, Mark just watches her, hoping to see her go about her day. Selene stares at him, noticing the strange animated actions of the toy before her. The toy before Selene is moving all weird like, when it would be inanimate.<br>\r\n<br>\r\nThat doesn't matter to Mark, though. Mark can't help but be amazed by all of this. Mark watches as Selene licks herself. For him, this is just too good. To see a giant cat just going about it's day is just inspiring to watch.<br>\r\n</span></div></div>",
            "created":1490936820,
            "id":2297630,
            "title":"have some fun"
        },
        "13111112":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "try to grasp the situation at hand",
                "leave the toy"
            ],
            "content":"<div class=\"\"><div> <span>The cat calmly walks around the room, exploring it all. Selene stares at the toy while doing so. After a bit, Selene walks over to the rabbit. With a nod from the cat, the rabbit shakes its nose. Watching it all, Mark questions the antics of the cat. For some reason, the cat readies herself before she jumps up in the air.<br>\r\n<br>\r\nReaching the cage, she swipes at it. The cage falls off the desk and flies in the air. It hits the bed beside the desk as it topples over. The rabbit jumps out in time, receiving little injury. Selene jumps up to Arthur before glancing down at Mark. Both of Mark's pets stare at him. Mark looks worried, wondering what's going on.<br>\r\n<br>\r\nSelene rushes over to Mark, as fast as she can. With quick thinking, Mark dodges the charge from his own cat. Before he can do anything, Arthur rushes over and bumps into him.<br>\r\n<br>\r\nMark gets hit by Arthur and gets pushed away. Skidding across the floor from the impact, Mark wonders what he should do. This is all strange to him, like he's dealing with something out of the ordinary.<br>\r\n<br>\r\nArthur runs over and tackles him again, knocking him back. In response, Selene quickly runs over and swipes her tail at Mark, sending him away again. Mark tries to grab the floor, but realizes that he's unable to.<br>\r\n<br>\r\nSelene once again charges at Mark, pinning him down with her paw. Mark struggles under her paw, unsure of what to do. His cat is strong, probably from the food he's been giving her all this time. Even Arthur is daring and dangerous. Instantly, Selene swipes at Mark, sending him towards a wall. Mark hits the wall, and tries to get back up.<br>\r\n<br>\r\nIn his mind, he can only process what's going on. Selene shouldn't be this mean, and Arthur should be acting like a normal bunny, not some kind of bunny that will love you unconditionally only to snap a guy's neck on a bad day. If anything, he should be petting them, and they should not be acting like this.<br>\r\n</span></div></div>",
            "created":1490936940,
            "id":2297632,
            "title":"watch Selene"
        },
        "131112":{
            "author_id":"fatfan12345",
            "author_name":"Explosion king",
            "choices":[
                "They let it happen",
                "Interruption "
            ],
            "content":"<div class=\"\"><div> <span>Mark floated around his room before hearing a garage door. Looking down the street he saw his friend Pete pulling into his driveway. Mark smiled as he flew over to his friend's house. \"Pete's always good for a laugh.\" Mark thought aloud gliding through the wall into Pete's room. As Pete opened the door he started putting some food on his desk and booted up his computer. \"Hey Pete what's up?\" Mark asked casually but Pete went about his business. Mark flew next to him looking quizzically.<br>\r\n<br>\r\n\"Dude it's me, Mark!\" Mark exclaimed but Pete didn't seem to notice still. Mark clenched his fists \"Hey look at me!\" Mark yelled throwing his arms around which got Pete's attention.<br>\r\n<br>\r\n\"Who's there?\" Pete asked looking around the room frantically.<br>\r\n<br>\r\nMark looked quizzically. He looked at himself seeing he was still transparent. But his arm landed in the computer. \"Pete can you hear me?\" Mark asked.<br>\r\n<br>\r\n\"Who are you? What are you doing in my house?\" Pete asked looking in Mark's direction but not quite looking at him.<br>\r\n<br>\r\n\"Pete it's me Mark.\" Mark said as it reverberated from the speaker.<br>\r\n<br>\r\n\"M-Mark? No! You're dead!\" Pete insisted backing into a corner nervously. Mark sighed.<br>\r\n<br>\r\n\"Okay let's try this.\" Mark thought aloud taking his hand out of the computer and floated towards Pete. Mark shut his eyes focusing on his powers till he appeared in front of Pete.<br>\r\n<br>\r\n\"JESUS CHRIST!!!\" Pete screamed pressing as much of himself against the wall as possible in animalistic fear.<br>\r\n<br>\r\n\"Pete relax!\" Mark said feeling exhausting with this already.<br>\r\n<br>\r\n\"You're dead! What happened I-I watched them bury you!\" Pete said in disbelief as he felt his palms nervously.<br>\r\n<br>\r\n\"I'm a ghost, watch this.\" Mark said phasing through the bed a couple times while Pete just looked on utterly speechless at what he was watching.<br>\r\n<br>\r\n\"This can't be real. I'm sleeping. That's it! I'm asleep and this is a dream and-and when I wake up this'll all be gone!\" Pete insisted but it was basically pleading<br>\r\n<br>\r\n\"I'm real Pete. Now's a good time for me to try something out. Hope this works.\" Mark said as he focused again<br>\r\n<br>\r\n\"WHAT WORKS!?\" Pete asked fearfully before Mark became opaque right in front of Pete who looked just as shocked as when he entered this bizarre situation. Mark started running his arms over stuff and he collided with them like any normal person would<br>\r\n<br>\r\n\"Oh cool. I'm tangible.\" Mark said gingerly before turning back to Pete \"Go 'head give me a touch.\" Mark extended his arm in Pete's direction. Pete sheepishly reached out at Mark, fearful of the unknown Pete was reluctant to touch Mark, and when he did Pete recoiled at ill ease <br>\r\n<br>\r\n\"You're really cold.\" Pete remarked as he shifted and backed away from Mark to another part of the room<br>\r\n<br>\r\n\"Hey I'm still me. I-\" But as Mark walked over to Pete he fell through the floor. A moment later floating back up in his ghost state \"Guess Not as long as I wanted.\" Mark shrugged<br>\r\n<br>\r\n\"Mark this is creeping me out, man.\" Pete whimpered fearfully<br>\r\n<br>\r\nMark stroke his chin in thought \"Hey I've got an idea.\" Mark smiled but Pete just kept his uneasy attitude. Mark focused again as he changed once more. Instead of becoming opaque he transformed his features. His face softening while his neck grew slightly longer becoming more slender. His hair growing longer draping down curtaining his feminine face. Next his shoulders shrank along with his biceps and his arms grew just a bit longer. His chest shrank as two breasts grew from his chest. The porcelain like fingers of his hands ran down his waist as it narrowed into an hourglass. While his hips flared out till they touched each other, his legs slimmed and his knees buckled. As that was completed her street clothes began to turn into a dress with sparkling sequins. She rested a french tipped nail on her apple cheeks in thought before a look of realization dawned on her face. She shut her eyes focusing till a tiara appeared on her brow, with a cute smirk directed at Pete she said in a sultry voice \"Well Pete gonna say hello to Markerella?\" She asked cutely<br>\r\n<br>\r\nPete became flustered shuffling over. Mark giggled sweetly as Pete reached out to her reaching to her hand, Mark became solid and accepted his hand \"I think you're really pretty.\" Pete murmured. Mark gave a good natured laugh.<br>\r\n<br>\r\n\"Aren't you the sweetie?\" Mark asked rhetorically before Pete phased through him. Mark floated past Pete and turned back around, as he focused again and became solid Mark put back the princess aires back on with a light chuckle \"So... got a request for your Princess?\" Mark asked<br>\r\n<br>\r\n\"Um...\" Pete whimpered with an embarrassed smile stretching across his face. Mark gave knowing smile coming over taking Pete's hand putting over her pronounced breast<br>\r\n<br>\r\n\"Is this what you wanted?\" Mark asked in a sultry tone<br>\r\n<br>\r\nPete nodded which made Mark giggle \"Well why didn't you say so?\" Mark pulled Pete closer and Pete sheepishly put his other hand on Mark's other breast while Pete remained stock still \"Well go on!\" Mark implored \"They don't bite.\" Mark said softly. Pete proceeded to fondle Mark's pillowy soft chest. Getting more adventurous Pete reached down between Mark's shapely thighs to her vagina. Mark reeled in surprise \"Woooo! Getting pretty excited huh, tiger?\" She teased<br>\r\n<br>\r\nPete blushed as he lean in to kiss Mark which she happily reciprocated putting her arms around Pete fondling his head and shoulders passionately </span></div></div>",
            "created":1512452700,
            "id":2424150,
            "title":"Mark decides to do something else"
        },
        "13112":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "a family member",
                "a friend"
            ],
            "content":"<div class=\"\"><div> <span>After thinking about it, it's great to be a furry rabbit. Being a small and adorable creature really changes the perspective of things. This might be something Mark will enjoy being. Taking bites from the food placed a while back, Mark just relaxes in the cage and lets his mind drift off.<br>\r\n<br>\r\nHis life was good, at times. Although he dealt with trouble with people and sometimes being clumsy. But after gaining these strange powers, he feels different. While he is still enjoying the easy life of being a rabbit, Mark expresses great interest in seeing how things are. Arthur has been a good bunny, easily able to not be as troublesome as expected.<br>\r\n<br>\r\nBusy with his thoughts of wonder, someone enters the room.</span></div></div>",
            "created":1490937000,
            "id":2297633,
            "title":"someone enters the room"
        },
        "13113":{
            "author_id":"earm-falcon",
            "author_name":"earmd-falcon",
            "choices":[
                "He still phases through",
                "he actually touches the table"
            ],
            "content":"<div class=\"\"><div> <span>As Mark has fun playing with Arthur's tail hopping around the cage, He suddenly realizes something what about his friends and family. Mark dispossess his pet rabbit and thinks about his best friend Pete, He would be devastated knowing how you were run over by a car and died. Besides they could never see or hear him, It was terrible to know how you could check on your friends and family but you could never respond to tell them that you are ok. And even if he would possess someone they might think that person is crazy or it might really freak them out. Mark starts to think about his best friend Pete again, He concentrates on all the good times they had together and everything from playing on the playground as kids from working out at the gym and hanging out. Suddenly Mark feels something strange as he gets lost in thoughts thinking about Pete, All of a sudden Mark feels like he gets the goosebumps. He feels strange but as he looks at the mirror he sees the reflection of his best friend Pete, Mark quickly turns around but Pete isn't here. Mark looks at himself to see that he somehow turned into Pete, he tries to touch the table .</span></div></div>",
            "created":1524469020,
            "id":2483266,
            "title":"leave Arthur's body"
        },
        "131132":{
            "author_id":"earm-falcon",
            "author_name":"earmd-falcon",
            "choices":[
                "Pete comes in and interrupts you",
                "You strip and masturbate as Sarah"
            ],
            "content":"<div class=\"\"><div> <span>Mark is surprised as he is actually able to touch the table, This would mean he can make physical contact with objects. He thinks for a moment and puts two and two together, Wow so i can touch stuff and people would be able to see me this is great. Then he sees a photo of him with his girlfriend Sarah, Ohh Sarah she is such a sweet angel who was always there for you. Suddenly you get a idea as you concentrate really hard, Slowly you start to turn from Pete into Sarah. Your hair turns pink and grows a little just past your neck, And your clothes turn into a dress with white sleeves who are in a mosaic style with rozes which go to his shoulders from there its all pink with a lovely skirt which also had the print of a roze on her middle and with last but not least her roze headband and heart shaped earings. You looked into the mirror admiring the sight of Sarah's body. You let your hands roam around as you used to do while holding her in your arms, Mark checks everything from her cute face and sweet lips to her little tight pussy. Ohh wow i look just like her, You put your hands on your or Sarah;s mouth as you also have her angelic voice. You Can't hold it anymore as you look at Sarah in the mirror and want to play with your girlfriends body..... (Just then)</span></div></div>",
            "created":1524934680,
            "id":2485267,
            "title":"he actually touches the table"
        },
        "1311321":{
            "author_id":"earm-falcon",
            "author_name":"earmd-falcon",
            "choices":[
                "Seduce Pete",
                "Possess Pete"
            ],
            "content":"<div class=\"\"><div> <span>Pete walks into your apartment and he looks surprised at you.\" Sarah? .....ehm did you come here to try to say goodbye as well?, Pete says stuttering.\" You notice how he is blushing as he looks at you or Sarah and tries to look away, You smile at your best friend as with Sarah's angelic smile. Yes Pete but as a matter of fact i actually hoped to see you here as well.\" Pete suddenly turns red and quickly looks away,A.a.a..and why is that he says stuttering.\" You chuckle because your his best friend silly if anyone would be devastated by his loss it would be you his longest and most loyal friend, You/Sarah walks towards Pete and hug him.\" W..Wow ... Sarah i don't think we should....\" You look surprised at him,What do you mean we are just comforting each other?, Nothing wrong with that right? you say as you snuggle closer to him as Sarah feeling his strong muscles.\" I... i guess not he says with a deep sigh.\"You already had your suspicions about Pete having a crush on Sara but now you are sure, However he has also shown to be a true friend so you think of what to do next.<br>\r\n<br>\r\nYou could try to seduce him and see how much fun that will be<br>\r\nor<br>\r\nYou can possess him and head to Sarah and seduce her in Pete's body<br>\r\n<br>\r\nYou Look at Pete in the eyes and ........</span></div></div>",
            "created":1524961260,
            "id":2485517,
            "title":"Pete comes in and interrupts you"
        },
        "132":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "College Frathouse ",
                "The Burton Household",
                "Go somewhere"
            ],
            "content":"<div class=\"\"><div> <span>          <i>\"Levitating is one thing checked off my ghost powers list.\" </i>Mark thought. As a young kid, Mark is a geek to all things paranormal. From the common ghouls to the exotic ghost stories of Cambodia, he knows it all. His room was covered by ghostly products back in the day. And every morning, he rushes to the television and watches Danny Phantom. But as the years went by, his interest dwindled. He stashed all the toys and posters in attic and placed them there for good. This experience however, sparked his once forgotten interest. \"Ghost Ray!\" Mark shouted. But no matter how loud he shout, no ghastly ghost lasers is coming out of his hands.<br>\r\n<br>\r\n          For the past few minutes, he tried clones, ghost wail, ghost sense and other ghost powers Danny might have. Like ghost ray, none worked. Still, he gets to levitate, become intangible and invisible. But there is still one thing he forgotten though, overshadow. Overshadow is basically possession with a rehashed name. Danny did not often use it because he would solve the plot easily. Still, he got a hard feeling on his wiener when he does the ghost cartoon character overshadows someone. Only when he was a teenager when he realized that he got a fetish for \"Body Possessions\". <br>\r\n<br>\r\nSo to start testing his overshadowing properties, he first must find a host. Luckily, he lives in a suburban location with myriad of neighbors. From the houses alone, you can see who is rich and who is not. Directly in front of his house was a frat house. Before this day, he cursed how loud those delinquents next door. They think they are the kings of the world with their weekly parties and unlimited booze. The tenants inside calls him \"dork\" or \"nerd\" and many other names. With this ghost powers, he could have his revenge. <br>\r\n<br>\r\nTwo blocks down is the Burton Household. Harry Burton is a CEO of some company and it made them insanely rich. Just last year, they gobbled up nearby houses so that their place could expand. Their place is still a mess with the renovations and building of a large private pool. From what the rumors say, Harry's two sons are back home from their studies in London. The older one is said to be a playboy while the younger remains in the shadows.<br>\r\n<br>\r\nThere are still many places to go and many people to test my powers on. So should I find a host in these two places or move on to another?</span></div></div>",
            "created":1490511360,
            "id":2294912,
            "title":"Test out your powers"
        },
        "1322":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Possess the teen, Phillip Burton",
                "Go for the older brother, Jake Burton",
                "Go for the dad, Harry Burton"
            ],
            "content":"<div class=\"\"><div> <span>          The Burton household was by look, half finished, The front of the stood a large gate with a wide garden. In the center was a marble dolphin fountain. From common sense alone, you could say that these Burton family is monstrously rich.<br>\r\n<br>\r\n          Mark floated carelessly throughout the manor. He did not mind his floating skill because he knows that he is intangible thus he will not hit anything. Until he floated towards a wrinkled servant. All sensations in Mark's body changed. Suddenly he felt weak and tired, mostly his legs. Aching and searing pain is making his back ready to collapse. His eyesight became blurred, his speech slurred and his hearing, inaudible. Gravity grasped him once again and this time, with more punishment. With a will on the mind, Mark pushed himself off the servant's body. In it's place, the servant stood dazed, unsure of what happened.<br>\r\n<br>\r\n          <i>\"Icky.\"</i> Mark blurted out. Once he regained composure, he floated again. more careful this time. <br>\r\n<br>\r\n          The center of the house was a large area with the cliched mirrored staircase going to the top. Above was an umbrella of sparkling crystal chandelier, lit up with the rays of the outside. Maids and servants crowded most of the place. Doing cleaning and sorting the countless things that riddled the place. There were the men in suits that seldom appear in the lobby. Mark thinks that they were the renovation personnel.<br>\r\n<br>\r\n          Deeper into the house, he found much more rooms that would shame his own house. He floated to each one, careful not to accidentally possess someone. He stopped into one room that was different than the rest. An awfully large bedroom was at the center, Posters of several music bands and artists covered most of the walls. In one side, a cabinet full of trophies stood shining. Mark flew closer to see what awards they were.<br>\r\n<br>\r\n\"Phillip Burton, for the award of Mister Prom Night 2011. Mister Prom Night 2012, Award for Mr. Lakeside 2011 and and a same yet separate award for 2013.\" Mark rifled through the awards and at the same time, he though <i>\"This guy must be a hottie to get awards like these.\"</i><br>\r\n<br>\r\nSuddenly, the door behind Mark opened up. A blond teen, wearing a suit and a clean plaid black pants. On his chest bears the crest of the Lakeside Mermen and the personal pin of the lakeside boys club. All of this was known to Mark as he inspired to be one himself, until they mocked him because of his supernatural interests. Mark floated closer to the teen and inspected him from top to bottom. His hair was shining gold, with the signs of darkening in the underside. When he opens his mouth, he could see that his teeth were perfect unlike his. Mark's teeth was crooked at the top when a bully punched him.<br>\r\n<br>\r\n\"I told you, I'm staying here for the autumn mom. Jake sides with me and so does dad.\" The teen blared. He was obviously angry but he still and his composure. \"It's late over there and I also need some rest. Okay, bye mom.\" He turned his phone off and jumped into the bed. Now Mark is on the dilemma.</span></div></div>",
            "created":1490517660,
            "id":2294948,
            "title":"The Burton Household"
        },
        "1323":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "The town center (Park, Public Pool, Plaza)",
                "Lakeside",
                "More locations"
            ],
            "content":"<div class=\"\"><div> <span>          Lakewood isn't that much of a city and not that much of a town either, maybe in the middle of both. So far, the town is new, just built in the 1940s. There were late gold rushes in those times and the area of Lakewood was reported to have a large collection of gold in the mountains beside the lake. No gold were found though, except for the precious silver the town became famous for. As of now, the place has a population of 90.000, a large park and its own resorts and public pools. The are around Lake Ivartead became a famous tourist spot both in the summers and winters. The waters are pristine and cool during summer. Some geological unexplained phenomena makes the water comfortingly warm during the cold winter months. Mark, himself, makes sure he experiences the Ivarstead water every month.<br>\r\n<br>\r\n          Mark was still floating in his windowsill, choosing a place to visit.  He could visit the town center and look for locals. With the schools closed for the upcoming winter, students are flocking over there to relax and probably visit the daily concerts over there. The Lakeside however brings fresh faces to the picture. Tourists from around the world visits the place, looking for its mysterious temperature changing phenomena. There would be Asians, Europeans and much more ethnic people over there. Or Mark could just think for more places.</span></div></div>",
            "created":1490512800,
            "id":2294920,
            "title":"Go somewhere"
        },
        "13233":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Downtown Lakeside",
                "A day long trip to California"
            ],
            "content":"<div class=\"\"><div> <span>          Lakewood isn't that much of a large town so the options for Mark is quite small. Aside from the town center, the other populated place is downtown. Many shops established their places there. Mark would go there once in a while to buy necessities at the dollar store. Aside from the shops, not much. Deeper downtown is the underground for illegal immigrants and drug addicts. Testing his powers on such places seems stupid.<br>\r\n<br>\r\n          Another place came up to Mark's mind. California is a new place to feel fresh. The city is a melting pot of different culture and techno hub. It would take at least a day to get there. He could travel there by jumping from body to bodies at the road. Maybe enjoy some pit stops along the way. The Pancake Drive is the place where Mark looks up the most when he takes a trip to West.</span></div></div>",
            "created":1490690160,
            "id":2295917,
            "title":"More locations"
        },
        "15":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "You have more control",
                "Everything goes dark",
                "Someone grabs you!",
                "The voice is back"
            ],
            "content":"<div class=\"\"><div> <span>You're in highschool, just beginning your senior year. School has just started and it's fall with the leaves losing color, daylight dwindling, and temperatures tumbling. <br>\r\n<br>\r\nAnother Saturday night is here and you have nothing planned. Your parents actually have the weekend planned for a little getaway which means you have the house to yourself. Mitch, your older brother returned to college a few weeks ago for his sophomore year. <br>\r\n<br>\r\nNow you're sitting watching TV with nothing else to do. You do have some homework you probably should get started on before your parents get back tomorrow. The procrastinator in you is making it difficult to do it though. <br>\r\n<br>\r\nRandomly, your dog that has been asleep in the other room, has gotten up and is now running around through the living room, into the dining room and into the kitchen. He comes over to you on the couch is whining to you. You're trying to pet him to soothe him. <br>\r\n<br>\r\nAlmost on queue your house begins to rattle. You've seen this sort of thing before on the news where the animal freaks out before something serious like an earthquake. The problem is that you don't get earthquakes where you live. <br>\r\n<br>\r\nYour house continues now to shake as things are falling off of shelves and your dog is in full on panic. For sure this has got to be an earthquake. You're about to race out of the door when you see a bright flash light pouring in though your back window. It comes from high up and then seems to collide with the ground. Bracing yourself, you fear it's going to be an explosion but there was little sound at all. Your house made one final shake and thud and that was it. <br>\r\n<br>\r\nQuietness is throughout your house as your power goes out for a few seconds and then comes back on. What ever that was had to crash into the ground. But how come no huge sound? There's a forest behind your house too it had to hit the trees!<br>\r\n<br>\r\nBut nothing at all. Just a thud with shaking. The curiosity is killing you to what it was. You need to check this out. So you grab a flashlight and your cell phone and head outside. <br>\r\n<br>\r\nYour backyard continues for a little bit and you reach the tree line. There's a faint light that seems to be in front of you within the trees. The single light that you thought was there is actually a cluster of small lights. The area is actually well lighted and right in the center is this round shaped object. It's probably about 8ft tall. Almost like a shiny metallic coats the surface of the object. <br>\r\n<br>\r\nAs you're about to approach it, you hear voices and you quickly duck behind a shrub. These two burley guys in suits walk over to the object. It kinda looks to textbook. Two guys in suits that look like they work for the  government are here immediately after this mysterious object crashes? <br>\r\n<br>\r\nYou're trying to desperately hear what the two men are saying. But their voices prove to be too muffled to hear anything. All you hear is small chatter. <br>\r\n<br>\r\nOn the other hand you have the perfect advantage point of them. The light coming from the object is bright enough to illuminate the whole area. It looks like they are talking into their walkie talkies. <br>\r\n<br>\r\nThen you feel your arm start to go numb on you. Then your other arm as it begins to spread throughout your body. \"What the fu...\" You begin to say as all a sudden you can't talk. You're now paralyzed laying here in the woods with the whole ongoing situation. Its even hard to talk to yourself in your mind. The only thing you retain is your sight fortunately. <br>\r\n<br>\r\nIf anything else could possibly go wrong, you begin to hear something in your head. Like a slow, quiet voice echoing in your head. You think you have about lose all sense of normalcy, now there's a voice in your head. But the voice begins to get louder and you can make out what its saying. <br>\r\n<br>\r\n\"Please don't worry or have any fear. We're doing this to you for your best. We know that you are just curious, and you will see. But, it seems people from your government are also curious and don't have good intentions. We will take care of them while you are laying here. Once they are handled, you will be able to explore, human.\"<br>\r\n<br>\r\nHuman, human...that word is ringing throughout your head. What have I gotten myself into?</span></div></div>",
            "created":1439442000,
            "id":2020741,
            "title":"Why not throw in an alien?"
        },
        "151":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Continues on...",
                "The possessed man starts convulsing",
                "His partner returns"
            ],
            "content":"<div class=\"\"><div> <span>With the word human ringing in your ears, you gain more control of your body. <br>\r\n<br>\r\nNow you're able to move your limbs, but paralyzed by fear, you dare not to move much more. Who are these creatures? How far advanced are they? You would watch SciFi things on the history channel and thought the people on there were just making shit up. The things about UFOs and other things they insisted existed must actually. Now your curiosity is about the two men, what their fate is.<br>\r\n<br>\r\nPeering through the bush, your eyes focus on the two government men. They're still talking into their radios, as they're walking around the site. It seems like they're waiting for someone else to arrive. <br>\r\n<br>\r\nAs you continue to focus on the men, you notice a mist like form coming from the capsule. With the darkness and little light its hard to exactly tell what it is. The mist continues to form and surround the two men. It flows from behind them and and engulfs them. They start to bend over and convulse some what, and their bodies shoot back to the upright position. <br>\r\n<br>\r\nThe taller one of them starts to crack his neck around while the other stretches out his arms. A million things are running though your mind. Did these other worldly creatures just take over these guys? <br>\r\n<br>\r\n\"Human you are free to come over now as you wish.\" Startled you're almost so much shaken with fear you don't want to move. But something just seems to be pulling you to the possessed guys.<br>\r\n<br>\r\nSlowly you stand up and walk over the the capsule with the men.  The taller one began to say, \"Now I know what you saw was basically incomprehensible for you. I'm sure you have many questions and you do show fear. But I beg of you that you need to trust us, and don't be fearful. We won't hurt you. First we must get this thing settled between your officials. My partner here is going to leave and go with your officials. While I will sit here and explain things with you.\" On that queue, the stockier man left. <br>\r\n<br>\r\n\"Ok,\" is all you manage to say. \"Great now that we got that settled, let us try to explain some things to you. We come from a distance universe, a world, very different from yours. What you saw as that mist is our true form. We don't have bodies per say. We have very different capabilities then you humans do. But in turn, you humans can do other things that we can not. We took over these men so it would be easier to communicate with you in a form you're familiar with.\" <br>\r\n<br>\r\nHe flexes his bicep, and smiles back at you. \"A very good body at that.\" You just turn a shade of red, trying not to show your bisexual side. <br>\r\n<br>\r\n\"Also just to let you know we can read your thoughts with our telepathy capabilities.\" We smirks back at you as you blush even further.<br>\r\n<br>\r\n\"Anyway you are probably wondering what we're doing here in the first place. The reason is we are a curious type of being. We have just advanced our technologies so much that we are able to travel the vast universe. Our world sent me and my partner out in search of any other life in the universe. When we spotted earth, we had to explore it. But as entering the atmosphere, some of your government officials were tipped of and had some rather bad intentions. So once we landed we had to take over these guys, and my partner went to go square things with the government. You just happened to be here and I felt I needed to explain things to you.\" <br>\r\n<br>\r\nYou're about to ask why didn't they fool you, when you're interrupted. <br>\r\n<br>\r\n\"No need to ask, I can see into your mind. We didn't keep our identities from you because from reading your mind we knew you didn't have bad intentions and our lives weren't in danger. We are curious beings just like yourself, and we plan to explore your world and report back to ours.\"<br>\r\n<br>\r\n\"But I need to ask a big favor of you, could we manage to stay with you? You really are the only person here so far that we can trust. In return we can give you a taste of what its like to be one of us.\"<br>\r\n<br>\r\nYou're in a huge mess, and unsure of what to do. But for some reason you're curious about these alien creatures. You want to help them out and it would be kinda cool to have a taste of their powers.<br>\r\n<br>\r\n\"Well that's settled we can't thank you enough for your kindness!\" The possessed official states. <br>\r\n<br>\r\nThis telepathy thing is kind of getting annoying, you're not even talking anymore.<br>\r\n<br>\r\n\"You don't like communicating by telepathy?\" He states right a way. You give him a look and he laughs. <br>\r\n<br>\r\n\"Sorry, just our force of habit,\" he smiles and laughs. \"We can communicate via talking if you prefer.\" <br>\r\n<br>\r\n\"That would be perfect,\" as you're talking for the first time. </span></div></div>",
            "created":1439701200,
            "id":2021784,
            "title":"Feeling more like yourself"
        },
        "1511":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Morning arrives",
                "Shit! You overslept, you're parents are home"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, shall we continue to your house?\" The man states. <br>\r\n<br>\r\n\"Uh are you just going to leave your...uh...space craft? Right there?\" <br>\r\n<br>\r\n\"Oh certainly I will.\" You look at him confused. Then he goes over to the craft and places one of his hands on it. You see him mutter something in his language, and within a few seconds the entire craft is invisible! <br>\r\n<br>\r\n\"Woah that's amazing! How did you just make that whole thing invisible?\" You question him. He turns around to look at you, \"Like I said before we have many capabilities beyond your realm of comprehension,\" as he smirks back at you.<br>\r\n<br>\r\nYou just shake your head in response. He then laughs back at you. <br>\r\n<br>\r\n\"One thing I am forgetting,\" he starts as you turn to look at him, \"This body.\" He looks down at the man he's controlling. <br>\r\n<br>\r\n\"Oh yeah what are you going to do with him? Doesn't he need to report back to the government? He can't just stay at my house and go missing.\" <br>\r\n<br>\r\n\"Maybe he can do both things at once,\" the man says, as he smiles once again. <br>\r\n<br>\r\nWaiting to be amazed again you look at him. He begins to stare down at the ground and looks like he's focusing very hard on it. Then he starts to convulse and like out of thin air a carbon copy of the man appears. He looks exactly like the man he's currently possessing. The copy is just staring out into space. Looking up from the ground, the alien turns to look at his double and says something in his language to him and he just turns around and walks away from the two of you. <br>\r\n<br>\r\n\"Amazing. You know we have this scientific law stating matter cannot be created nor destroyed, here,\" you state as you smile at him. \"Yeah that doesn't apply to us,\" he gives almost a sly smile back at you as he says that. <br>\r\n<br>\r\n\"Now we can finally continue to your house.\"<br>\r\n<br>\r\nYou show him the way back through the woods and into your backyard. You can hear your dog barking up a storm. \"Hey Sparky, shh!\" You try to calm down your dog, but to no avail he doesn't quit. <br>\r\n<br>\r\n\"Sorry about him, he does that a lot,\" you say to the man. He smiles back. You get back into your house as the man follows. Turning on some lights you try to situate yourself. \" You can just make yourself at home as I feed my dog.\" <br>\r\n<br>\r\nYour dog however is just razor focused on barking at the man. You keep yelling at him to stop and eventually he loses interest and turns away. After feeding Sparky, you go back into your living room to find the man sitting on the couch with his jacket and dress shirt off. \"I'm sorry, I'll turn on the air conditioning if you're hot.\" You say as you feeling you're turning red again as you can see more of his muscular torso exposed. <br>\r\n<br>\r\n\"I can still read your mind, you know,\" as he grins at you, \"But yeah I can go for some air conditioning right about now.\"<br>\r\n<br>\r\nTurning red as ever, you turn on the air and offer him something to eat. He's actually really hungry and you can go for some food too. You two eat some sandwiches and continue to talk. <br>\r\n<br>\r\n\"You're house really is incredible,\" he states. He's particularly amazed by the television and your smart phone. Things that you completely take for granted.  \"Yeah everything must be so foreign to you.\" <br>\r\n<br>\r\n\"It definitely is. But having this human as a host makes the change much easier. After reading his life and memories I can just use those to help myself. Also while I'm in control of my hosts, I can impersonate them perfectly. That's how my partner is doing what he's doing.\" <br>\r\n<br>\r\n\"What is he doing exactly, though?\" As you butt in. <br>\r\n<br>\r\n\"Oh he's just making sure that your government isn't out to hurt us. He's making sure that we're undetectable while we're here. We're not ready to come out and expose ourselves til we feel its safe.\" <br>\r\n<br>\r\n\"That's fair enough. On another note, my parents are coming back tomorrow from vacation so I'm not going to be home alone like now. What are you going to do then?\" <br>\r\n<br>\r\n\"Way ahead of you,\" as he says taking a bite of the sandwich. \"After reading your memories I knew you wouldn't be home alone tomorrow. I have two options that you can choose for me. Either I can take over your dad for the time being, or one of your neighbors, I promise you that no harm will come to them.\"<br>\r\n<br>\r\n\"Uh, if you can promise that, you can take over my dad. That way you'll be closer. Wait I have a question. When is your partner coming back?\"<br>\r\n<br>\r\n\"Oh he probably won't be back for a few days. He's undercover doing some detective work. He'll be back, though, eventually and he'll fit right into your life, like you wouldn't even know he's there,\" as he says that with some sneer.<br>\r\n<br>\r\nYou roll your eyes back at him as he laughs. <br>\r\n<br>\r\nYou start to smell something a little unsettling. You try to figure out where its coming from and realize it's the man. <br>\r\n<br>\r\n\"Hey, you might wanna take a shower.\" He starts to give you a strange look. \"Smell yourself.\" He sniffs and almost immediately he gives you a sour face. \"Yeah that's probably a good idea,\" he laughs. \"The bathroom is upstairs, first door on the right,\" you tell him. He then proceeds to go to the bathroom. <br>\r\n<br>\r\nYou think for a quick second if he knows how to use the shower and to shower himself. But you know he has ways of figuring it out.<br>\r\n<br>\r\nTime passes as you watch TV and feel yourself falling asleep, but before you can, your friend comes down the stairs, dressed in one of your dad's v-neck shirts and a pair of his cut off shorts. <br>\r\n<br>\r\n\"I hope you didn't mind, I raided some of your dad's clothes, I couldn't put back on the ones I was wearing,\" he says as he plops down on the couch beside you. \"Yeah that's fine. You needed something to wear and I'd doubt any of my clothes would fit you,\" you say as you admire his thick torso, showing though the fabric of the shirt, barley containing it. <br>\r\n<br>\r\nHe smiles back at you. \"Yeah I think I'm a little more bigger than you in this body. \" <br>\r\n<br>\r\n\"Yeah just a little,\" as you laugh. He then throws one of his big arms around you. \"I know you like this,\" he says as he looks at you. You're blushing hard as ever. He just continues to smile at you, as you two continue to watch TV and drift off to sleep together.</span></div></div>",
            "created":1439701200,
            "id":2021834,
            "title":"Taking in a friend"
        },
        "15112":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Going back as someone else",
                "Your mom answers the door",
                "Losing control...."
            ],
            "content":"<div class=\"\"><div> <span>Peacefully you awaken to the sight of light streaming into your house. You realize that you fell asleep on top of the man's chest. He has an arm around you which doesn't seem to bad. You feel utterly relaxed until you glance at the clock on the wall. <br>\r\n<br>\r\n\"Holy shit its a quarter to 1 already! My parents are going to be back at 1!\" You exclaim as you jump off your friend. That wakes him up startled. \"Yes there's plenty of time, just hide this man's clothes, while I get ready,\" he says in a relaxed tone. <br>\r\n<br>\r\n\"Wait how are you going to do this?\" <br>\r\n<br>\r\n\"It's very simple. Once I depossess this man his body will fade away. Since I made a double of him yesterday, he is completely fine. I can't just get out of his body now and have two of them rooming around,\" as he chuckles. <br>\r\n<br>\r\nYou now go and gather up the mans nice loafers, his coat, and dress shirt and bring them into your room. Then you get his tank, briefs and pants and put them in your room as well. When you get back downstairs your friend is no where to be found.<br>\r\n<br>\r\nWorried for a second you realize he depossessed the man as you see your dad's clothes laying on the floor. <br>\r\n<br>\r\n\"Don't worry, I'm fine now I'm back in my normal form.\" As a voice echos in your head. \"This always gives me a headache,\" you think to yourself. <br>\r\n<br>\r\nWith no time to spare your front door opens up and your parents are back. Quickly you shove your dads clothes that are laying on the floor behind the couch.<br>\r\n<br>\r\nYour parents come in and ask how you've been and you ask them about their trip. They seem pretty tired from it all but you're still wondering when your friend is going to make his move.<br>\r\n<br>\r\nWhile your dad is walking into the kitchen it almost looks like he arches his back a little and then completely straightens out. He stretches out his arms and turns to look at you and winks. You have to admit, it kinda turns you on having something controlling your dad. <br>\r\n<br>\r\nFor the next few hours, he does a perfect impression of your father and completely fools your mom. <br>\r\n<br>\r\nYour mom goes to bed pretty early since she's tired which leaves you some alone time with your dad. <br>\r\n<br>\r\n\"So how is it controlling my dad?\"<br>\r\n<br>\r\n\"It's another body with a whole new set of memories to contend with. But otherwise not bad. He has decent body too.\" He says as he flexes a bicep.<br>\r\n<br>\r\n\"Yeah he works out occasionally. He used to be in fantastic shape in college, played football. My brother basically took after him as he's playing football.\" You say.<br>\r\n<br>\r\n\"You should have played to, you follow it pretty much.\" <br>\r\n<br>\r\n\"Nah I was into different things and I didn't want my parents keep comparing me to my jock brother.\" <br>\r\n<br>\r\n\"I see. So do you still want me to give you some of our abilities?\" <br>\r\n<br>\r\n\"Shit I almost forgot about that! But of course I do!\" You say almost like a little kid.<br>\r\n<br>\r\n\"Haha very well. Once I give you this gift you will inherit our ability to possess humans. You'll turn into a spirit form while your body continues on, similar to the copy of the man I made. Once you depossess your host, you'll go back to your original body. Easy as that.\"<br>\r\n<br>\r\n\"That's so sick.\" Is all you can manage to say aloud. \"When do I get the ability?\" <br>\r\n<br>\r\n\"Oh you already have it.\" He says with a chuckle. <br>\r\n<br>\r\n\"Wait what? How?\" <br>\r\n<br>\r\n\"From the moment I met you. I knew you would want to be able to do this.\" <br>\r\n<br>\r\n\"That's incredible!\" You exclaim.<br>\r\n<br>\r\n\"Ready to test your new powers out?\" He says.<br>\r\n<br>\r\n\"Yeah and I have the perfect host in mind!\"<br>\r\n<br>\r\nAlmost like you've had these powers all your life you turn into your ghost form with ease. You drift from inside of your house, to the outside where its early evening. You see your neighbor, James, laying on his deck catching some last rays of sun and keeping his all important tan. <br>\r\n<br>\r\nHe has almost a golden brown tan, with a wide, meaty, v-shaped back. There's sweat covering his back which means he must have been tanning for awhile. Then you realize you he must have fallen asleep. Perfect.<br>\r\n<br>\r\n You remember he's around 25 just out of college, with his first home. Now he's all yours for the time.<br>\r\n<br>\r\nHe's wearing these skimpy white trunks. Wasting no time, you funnel your form into his trunks. Now you continue to funnel into his ass.<br>\r\n <br>\r\nNow he's definitely not sleeping anymore, as he's now flipped back over convulsing. But in little time you feel yourself slowly gaining control of his body. You feel his legs and his thick arms becoming yours. Then in almost a single motion you gain control of his head and open your new eyes for the first time. <br>\r\n<br>\r\nYou're now seeing his body all up close and you have all control over it! His body is covered in sweat as you stretch out his limbs. <br>\r\n<br>\r\n\"Damn it feels amazing being in control of a hunks body.\" You say aloud as you palm a pec. <br>\r\n<br>\r\nYou stand up on your deck and flex one of your calves. After finding a towel, you get most of the sweat off your body. Laying nearby you see an ocean blue tank and a pair of sunglasses. You slip the tank over your torso, which takes some effort with your heavy built body. The sunglasses go on without any effort however. <br>\r\n<br>\r\nNow as you walk over to your house, you pass a window in which you catch your reflection. You drop your sunglasses and show a cocky expression, perfectly impersonating your neighbor. <br>\r\n<br>\r\n\"Its good being a hunk,\" you say in James' deep voice.</span></div></div>",
            "created":1440046800,
            "id":2023372,
            "title":"Shit! You overslept, you're parents are home"
        }
    },
    "info":{
        "author_id":"heyyy3",
        "author_name":"Smith1990",
        "brief_description":"After the accident Mark got this new and amazing power",
        "created":1340866560,
        "description":"<td align=\"left\" class=\"norm\">It was a another normal, boring day for Mark. Until a strange accident occured. After having the accident he learns that he is a ghost now and can possess people to continue his life. He could possess anyone, but he prefers guys. Since he doesnt want to go to a different gender. Mark continues his life through the eyes of others, living their lives for them. This is a fun experience for Mark where he meets new people and lives numerous lives. <br>\r\n<br>\r\n<br>\r\n<br>\r\nOnly rules are.... to keep it fun!<br>\r\n</td>",
        "id":1876371,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1524961260,
        "modified":1524961260,
        "pretty_title":"Body Possession "
    }
}