{
    "chapters":{
        "1":{
            "author_id":"guidom99",
            "author_name":"wolf99",
            "choices":[
                "wolf99's route",
                "camm's route",
                "evi fuzzy9's route",
                "readers choice",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Loin God of Gods<br>\r\n<br>\r\nAn avatar the last airbender story staring Sokka.<br>\r\n<br>\r\nThe start<br>\r\n<br>\r\nI am sure you have heard of them, the Loin Gods, you know special males born in the Water Tribe who are gods of sex. They have no need for clothes, since like all woman Mother Nature loves them so they mostly only wear paints to keep the men from getting to envious. But I bet you did not know that there are three tires of them. there is the basic loin god who has the benefits of, not needing clothes no matter the weather, perfect physical conditioning, total recall(that’s above even a photographic memory. it means you never forget anything) and they have a high capacity to figure things out. Almost forgot they are born with a huge cock and a sexual aura that effects both sexes equal they are the bisexuals of the loin gods.<br>\r\n<br>\r\nThe second tier loin gods possess all of this but also super human strength and a stronger moral values so they only fuck single woman. There sexual aura also only effects woman and cause uneasy in men.<br>\r\n<br>\r\nAnd then there is the one in every fifty plus generation’s God of Loin Gods. When they are born every man on the planet that has a wife or girlfriend will literally knock them up that year for they instinctively know they will not get laid as much as soon as this Loin God of Gods hits puberty. Do to the avatar’s universe having a female god to watch over it (not the one true god, just the gal god has watching and taking care of his children in this universe) the men are ok with that. For this Loin god possess the lesser tires abilities and more. They have no interest in woman, until the woman are at least fourteen until they hit 18 then them only have eyes for adults as they do not like pedophiles and kill them. All nations respect this man and gladly let them fuck there wife’s and daughters to strengthen the nations. They also are completely strait.<br>\r\n<br>\r\nThe God of Loin Gods lives for hundreds of years as there ageing is slowed at physical prime. They can chose what sex there kids will be, if they are a bender, even the kind of bender they will be. He can knock up their own mother and the kid will be perfect in all ways and they often do. He can also chose if he will knock up a woman.<br>\r\n<br>\r\nThe sperm of a Loin God of Gods is not only nourishing enough to keep a woman full for a year after leaving the area. It is a bit of a narcotic with no withdrawal symptoms for human females. The sperm can heal any ailment a woman has from being born blind to curing cancer. This miraculous sperm also solves morning sickness and will strip away the pounds a woman gains from carrying a baby for nine months. It also heals all mental problems a woman has, hell many woman will feed their new born daughters this special man milk as it heals any passible birth defects if they are not born form the God of Loin Gods. The sperm can also impregnate an infernal woman and is rumored that, if a woman is killed with this sperm in there womb or belly they will be revived and fully healed.<br>\r\n<br>\r\n Straggly a god of loin gods will not fuck their daughters ever, nor are girls born for them attracted to their father, this is to be fair to the other men of the world.<br>\r\n<br>\r\nThey can also grow a second cock in order to either please more than one woman at a time or give a girl a nice hard DP. O and you never want to hurt a woman in front of this gods as they will kill you, your men, and then they will proudly mount your head on a pike in front of their house, as a warning to other men to not hurt a woman and they greatly enjoy every moment of it, though not as much as fucking woman. He can also chose to make a woman part of his harem. These chosen woman age as the loin god does. Also a Loin God of Gods cannot hurt a woman when fucking her no matter, how hard he fucks her they will only feel pleasure, unless the woman likes a pain with her pleasure that is.<br>\r\n<br>\r\nAs a matter of fact the when the last God of Loin Gods was born, it caused the Water Tribe to split into two. He and his harem built the Southern Water tribe themselves. Men from the northern tribe moved there later after hearing about all the beautiful young woman born there. Ever since then all Loin Gods regardless of tier were born in the Southern Water Tribe.<br>\r\n<br>\r\nA few weird facts about the Loin God of Gods are: the Avatar for their time period is always a female and from the air nomads. They can make female spirits take their human form. Hell it’s rumored that if a Loin God of Gods calms down an Avatar the last two female avatars will be reborn. Also since the Loin God of Gods always takes the Avatar as a member of his harem they pass the Avatar spirit to the next one seventy years later before taking her as there teacher since the girl is never born from the Loin God of Gods. There cocks also grow to their full size on the day they hit puberty. Also when their mothers give birth to a Loin God of Gods they lose all the weight they gained and are ready to have another child that day. They also have known interest in jailbait after they hit the age of 21.<br>\r\n<br>\r\nAlso the Loin God of God’s rite of manhood is they fuck their mothers the day they hit puberty, then they are considered men.<br>\r\n<br>\r\nIt just so happened that the next God of Loin Gods is born in ASC 84 and his name is Sokka. That day the Southern Water Tribe villages degraded into a massive orgy. And a lot of kids were born that year all over the world. And the men of the Southern Water Tribe later got drunk as hell, during the party thrown to celebrate the birth of the next Loin God of Gods, after all woman do not drink when pregnant or will become pregnant. The men woke with one hell of a hangover a week later.<br>\r\n<br>\r\nLet’s skip to ASC 95 the day Sokka hit puberty. <br>\r\n<br>\r\nKya a water bender and Sokka’s mother just finished sucking off her son’s massive cock and were enjoying the taste of his semen. That’s when the Fire Nation commander came into the families hut. Mad that she was being interrupted she water bend at the man and he proceeded to kill her.<br>\r\n<br>\r\n“I’m going to kill you with my bare hands.” Sokka says, pissed off.<br>\r\n<br>\r\nThe Fire Nation officer finally noticed the ten year old boy with the eighteen inch cock who was hidden by the woman he just killed. Also the woman got back up fully healed and breathing.<br>\r\n<br>\r\n“You can fuck me good and hard after you take care of this problem Sokka. Have fun killing the Southern Raiders.” Kya says with a lustful smile.<br>\r\n<br>\r\nKya who’s tattered shirt now barley covered her massive E-cup tits, just smiled as she watched her son rip the head off the man who just killed her. She sees a bit of Sokka’s cum on her hand.<br>\r\n<br>\r\n“Better not waste this treat.” Kya says as she licks off her hand with a smile.<br>\r\n<br>\r\nNeedless to say the Southern Raiders freaked out when they saw a three foot kid with better musculature then most adult men and a rock hard dick that should be tripping him, and covered in blood running at them gleeful smile on his blood stained face. None of the shore party lives and southern raider’s ship’s bow had a small perfectly made fist shaped dent in it.<br>\r\n<br>\r\nAfter picking up one of the fallen soldiers spears Sokka goes back to his hut and grabs the head of the dead commander before mounting it on the blade. Sokka then puts his new lawn ornament into the ground, a happy a grin on his face. He then goes to the bath house to get cleaned up. Then he heads back to his hut to and his waiting mother ready to become a man. <br>\r\n</span></div></div>",
            "created":1385760780,
            "id":1700584,
            "title":"the start"
        },
        "11":{
            "author_id":"guidom99",
            "author_name":"wolf99",
            "choices":[
                "skip to five years later(wolf99)",
                "sokka's first time(wolf99)",
                "sokka's first time (readers choice)",
                "readers choice",
                "readers choice."
            ],
            "content":"<div class=\"\"><div> <span>Kya knew Sokka would get a cleaned up before he came back. So she took the time to change into something less warm and sexier, after telling Hakoda to take Katara and stay at with Gran-gran. Since Kya took a bath before Sokka even woke up. So she changed into her sexiest lingerie and threw on her parka. She then grabbed some wood and started a nice warm fire. Then she waited for Sokka to return.<br>\r\n<br>\r\n“I’m home mamma.” Sokka says before he enters the hut still naked as the day he was born and soaking wet. <br>\r\n<br>\r\n“Hello Sokka ready for some fun?” Kya asks as she drops her parka glade the fire warmed the hut up.<br>\r\n<br>\r\nKya was existed to finally get the chance to fuck a loin god since the last one was captured during the first raid before she was born. It was even better since Sokka was a Loin God of Gods and she was going to take Sokka’s virginity was a nice bonus. She admired his sleek well-muscled body.<br>\r\n<br>\r\nSokka just stared at his mother’s body in shock arousal. After her revival Kya’s body shed some of the weight she had gained well pregnant with Katara, including her stretchmark’s, all thanks to Sokka’s cum. She was wearing her red sea cotton lingerie, consisting a small bra, stockings, long gloves, and a guarder belt with her panties over it.<br>\r\n<br>\r\nKya was also quite stacked still having a MILF’s build. Her large E-cup tits no longer had that hint of sag they used to and her large round ass no longer had any cellulite. She had nice thick thighs, wide hips, and long legs. Kya’s chocolate brown skin had was nice and smooth. Needless to say Sokka’s monster went to half mast, his sexual aura going into overdrive as well.<br>\r\n</span></div></div>",
            "created":1386590940,
            "id":1705362,
            "title":"wolf99's route"
        },
        "112":{
            "author_id":"guidom99",
            "author_name":"wolf99",
            "choices":[
                "time to fuck (wolf99)",
                "some of the other woman of the tribe want to fuck sokka too",
                "other choice"
            ],
            "content":"<div class=\"\"><div> <span>“Is Sokka ready to have his big fact cock sucked by Mommy again? But first Sokka do you want to see Mommy naked?” Kya asks her son with a naughty grin on her face.<br>\r\n<br>\r\nSokka could only nod yes as his cock hardened to full mast. As a Loin God of Gods the only thing to Sokka that is taboo is fucking his daughters, jailbait, and girls under the age of 13, these are thing Sokka just would not do. Sokka’s special sperm removes all genetic abnormalities so it did not matter if he knocked up a family member.<br>\r\n<br>\r\nWith a horny, lustful grin Kya turn around and pulls her red thong down her large brown ass, shaking her hips causing her round ass to jiggle deliciously. Sokka stares in awe at his mother’s large jiggling ass and tiny soaking wet cunt. Kya continues to shake her ass for some time for the Loin Gods enjoyment. She grabs her bra and unhooks it before turning around to face her son, her large tits jiggle as she turns free but not revealed. Sokka eyes are drawn to the brown v-shaped bush between his mother’s shapely thigh’s when some red fabric falls in front of it, Sokka looks up to see his mother’s massive tits in all their fully unveiled glory.<br>\r\n<br>\r\n“Big boobies” Is all the Sokka can say as he stares at his mother’s large brown tits. Kya had large dark brown areola and her nipples where hard from arousal.<br>\r\n<br>\r\n“Does Sokka like Mommy’s naked body?” Kya asks as she rubs her tits a bit letting out a small moan. <br>\r\n<br>\r\n“Now Mommy wants to suck your big fat cock again so here I cum.” Kya says as she gets on her hands and knees and crawls to Sokka. Not even bothering to grab his cock Kya just opens her mouth and starts to swallow all eighteen inches of hard, thick cock down her throat in one go. Do to the special properties of a loin god of god Kya does not choke as deep throats her son’s massive cock. Kya hums a short tune as she sucks all of her son’s massive dong. However Kya pulls off of Sokka’s cock after finishing the tune, grabbing onto it with both hands to jack him off.<br>\r\n<br>\r\n“Sokka Mommy wants you to practice for when you fuck her pussy. So when Mommy takes you back into my mouth I want you to move your hips back and forth until you cum again. Don’t worry mommy like this, it’s called face fucking and you should only do it if a woman tells you its okay to do it to them.” Kya says with a smile before kissing the massive head of Sokka’s cock. She then opens her mouth and consumes Sokka’s cock whole again.<br>\r\n<br>\r\nSokka waits for his mother to touch her lips to his pubic hair before he grabs her hair gathers into two pig tails and does as his mommy asked him to. Sokka listens to his mother’s moans as he fucks her face, looking into her deep blue eyes as he does so. He could swear his mother had a smile on her face despite the fact that his cock really stretched her lips out. Sokka watched his mother lift her right gloved hand and slides it down her body to her pussy. Kya starts fingering herself as her son fucked her mouth and throat. She has two orgasms before her son speaks.<br>\r\n<br>\r\n“I'm going to cum mommy.” Sokka yells as he closes his eyes. <br>\r\nKya just smiles and pulls back so only the head Sokka’s cock is in her mouth so she could taste his divine semen. After getting a mouth full of spunk Kya pulls off and takes, shot in the face getting a full facial before letting Sokka spray the rest of his load on her tits.<br>\r\n<br>\r\n<br>\r\n“That is the best thing I have ever eaten dear. Well mommy cleans herself she wants you to lick her pussy and suck her love bead. I will give you advice as you do it.” Kya says with a smile as she spreads her knees so Sokka can get at her pussy.<br>\r\n<br>\r\nKya begins wiping off her face with her hand as Sokka eats her out with surprising skill. She his half way to an orgasm when she finishes eating the cum Sokka shot onto her face. Kya twists herself so Sokka can watch her lick the semen off her tits well as he ate her out, wrapping her long legs around the boys head.<br>\r\n<br>\r\n“Watch mommy eat your cum well you eat her out. Fuck baby you have very long tongue and are a natural fur muncher. Keep it up until mommy says so ok” Kya says with a Lust fueled smile as she starts licking off her tits with her pink tongue.<br>\r\n<br>\r\n“Yes mommy.” Sokka says with his mouth full.<br>\r\n</span></div></div>",
            "created":1387050300,
            "id":1707612,
            "title":"sokka's first time(wolf99)"
        },
        "12":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Continue to fuck him with tentacle play",
                "Continue to suck his neck with suckers and play behind his ears.  ",
                "Send a Pelican Owl to another village for a girl their age to come. (Wolf99's)",
                "Something Else (email Wolf99 first)",
                "Something Else (email Wolf99 first)"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cblue\"><b><i>It's four years later in the canon basically.  </i></b></span><br>\r\n<br>\r\nSokka was moving back and forth as he was on his knees.  He had his elbows on the back of a girl's body as he had his chin sitting in his hands.  He somewhat looked bored as he was somewhat tired of fucking his sister.  Sure, he enjoyed sex, but with the leaving of the men from the Ice and the fact that a majority of the girls his age were in different villages.  He only had readily available to him, his sister.  It's not like his sister isn't hot or anything, on the contrary she was the most attractive girl in all of the Ice.  <br>\r\n<br>\r\nA year ago his and Katara's mother had died in an attack.  She had died to a bastard named Zuko who was looking for the Avatar. Instead he found the legendary last water benders and tried to get rid of them, for some 'honor' to be given back to him.  Sokka had been hunting at that time and swore when he heard that his sister survived thanks to his father that he would slaughter this Prince of the Fire Nation.<br>\r\n<br>\r\nKatara finally came as she screamed out in pleasure.  She hit the fur under her as she panted out.  That was the 12th time she had came this morning.  Sokka pulled out as he then stood up and put on his cloths.  Katara then looked up at her brother and lover as she then decided to make him happy.  She pulled her hands back as some snow wrapped around Sokka's feet turning into water.  She then pushed forward as the water froze into ice.  <br>\r\n<br>\r\nBefore Sokka could react she water bent some snow to his wrists from the ground.  The hands were behind his back as his pants were in mid hike up for preparation of tying his rope belt.  Katara grinned as she then pulled the front of her brother's pants down.  <br>\r\n<br>\r\nHis long and girthy cock was visible, as her heart jumped at the fucking size of it.  Oh how she was going to make her brother happy.  She understood the boredom of only doing it with one girl day after day when you are a loin god. She didn't like to think of herself as incapable to be the only girl for her brother.  But, she had to face the truth a loin god was just too special to only be used by one woman.   Still that didn't stop her from trying to at least make him happy that he still had her to fuck.<br>\r\n<br>\r\nShe was going to try something new today, something that she had been practicing on herself.  She took took the warm water from above the fire in the bone ash pot.  The water was still warm from boiling eggs, but with the eggs boiled a while ago, the fire was now ash and the water warm.  She bent the water around Sokka's cock as he moaned with his eyes rolling back. <br>\r\n<br>\r\nShe moved the water like a pair of hands as she stood up.  She then water bent herself in an octopus form where there were eight warm tentacles of water.  She grinned when her lover's eyes widened in a mixture of surprise and worry.  Oh how she was going to have fun with this.<br>\r\n<br>\r\nShe then threw her right arm at him as four tentacles went at his body.  She moved her fingers around as they attacked his chest and ears and neck.  She made little suckers appear along them as he moaned and moved his head with the tentacles trying to get more.  <br>\r\n<br>\r\nThis made Katara happy as she moved her left arm at his lower half of his body.  The tentacles moved in harmony with the other tentacles.  However these tentacles when at his balls, cock, urethra and his anus.  One of the tentacles when up at his prostate as he moaned out.  It felt nice to get cleaned out and stimulated on the p-spot at the same time.  <br>\r\n<br>\r\nWhat did Katara do to Sokka next?<br>\r\n</span></div></div>",
            "created":1386475080,
            "id":1704794,
            "title":"camm's route"
        }
    },
    "info":{
        "author_id":"guidom99",
        "author_name":"wolf99",
        "brief_description":"Biased on Evilfuzzys9’s fruit of the Loin God on fanfiction.net with his permission",
        "created":1385760660,
        "description":"<td align=\"left\" class=\"norm\">I did get permission from evilfuzzy9 to use his idea for this story. Credit for creating the original concept of the loin god is his.<br>\r\n<br>\r\nRules for this story<br>\r\n<br>\r\n1.Sokka is not gay or bi in this story. <br>\r\n<br>\r\n2.Aang is a 14 year old named Yang, after the last female air nomad Avatar and does not need to have a hair style like Yangchen. She can have a full head of hair if you want her to. she looks kind of like Jinora but older. Toph and Azula are 15 like Sokka.<br>\r\n<br>\r\n3.Sokka will not fuck his daughters in this story since I don’t like father/daughter incest stories.<br>\r\n<br>\r\n4.No gore, scat or yaoi sex. Male/male coupling with someone other than Sokka is ok but no sex seen with them.<br>\r\n<br>\r\n5.Yuri with the girls you chose for Sokka’s harem is ok.<br>\r\n<br>\r\n6. no killing Sokka off to gain his powers for your own or just to kill Sokka.<br>\r\n<br>\r\nThis is a crack humor story so have fun with the rest.<br>\r\n</td>",
        "id":1964724,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1387050300,
        "modified":1387050300,
        "pretty_title":"Loin God of Gods"
    }
}