{
    "chapters":{
        "1":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "15 year old male human wanting their childhood back.",
                "15 year old female human wanting their childhood back.",
                "15 year old male furry wanting their cub/pup days back.",
                "15 year old female furry wanting their cub/pup days back.",
                "Let's try some older humans/furries"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Welcome to Age Regression Theme Park. Some of the best rides a child can enjoy are here. You have just signed a document stating you wished to be regressed. You are a</span></div></span></div>",
            "created":1491541200,
            "id":2301156,
            "title":"Enjoy Your Time Here"
        },
        "11":{
            "author_id":"vexxus",
            "author_name":"Vex",
            "choices":[
                "womb of a caregiver ",
                "spa and pool-park,5 years old",
                "giant playground,7 years of age",
                "simulation of another time period, (readers choice of age)",
                "you smirk \"suprise me\". (readers choice)/ Actually, let's try another human boy."
            ],
            "content":"<div class=\"\"><div> <span>your name is tyler...your 15 years old and you were sent here on vacation by your parent's a a form of therpy as you were over stressed from things such as school...as you were an honor student and considered pretty smart..but have been over worked lately. you were told that this place would help you relax and forget your cares..you were not sure exactly what your parents meant by this,as they did not tell you,saying it would spoil the surprise.<br>\r\n<br>\r\nthe first person you see when you arrive into through the main gate is a suprisingly young looking girl at the entrance...who could not posubly be any older than 21.<br>\r\n<br>\r\nshe just smiles and greets you,asking for your name<br>\r\n<br>\r\n\"tyler\" you reply<br>\r\n<br>\r\nlooking you up on her computer she looks at you curious.<br>\r\n<br>\r\n\"oh,it says here your going to be with us for at least a weak...and that this is your first time here?\"<br>\r\n<br>\r\n\"yeah,it was my folks idea\" you nod...\"so...what kind of place is this?...i was not told exactly where i was going,only that it was a park of some kind?\"<br>\r\n<br>\r\nshe smiles and nods \"you could say that,im surprised we are not well known by now\" \"we were just a theme park...but we have extended a bit and are actually a whole resort with all sorts of new activities to cater to the pleasure,excitement,relaxation or recreation of all our guests...regardless of thier current age.<br>\r\n<br>\r\n\"current age?\" you raise your brow.<br>\r\nthe girl only smiles \"oh yes,youl find here that you can spend your time reliving any age of your childhood\"<br>\r\n<br>\r\n\"how is this possible?\" you look,a bit skeptical....\"well,we have various methods that one might choose to regress,not only will the regression be phisical but can be mental as well...and we have a veriety of caregivers charged with doing whatever they can to make your experience here comforting\" ....\"this sounds...almost too hard to believe\" you only gawk in amazement \"but this sounds fun,better than boring school work...im definitely in\".<br>\r\n<br>\r\n\"good\" the girl nods \"all i need now is now is a preferred age you would like to start at,and where you would like to go first,then we will ranomly choose a care giver for you and we will go from there\"<br>\r\nas she shows you the options on her computer<br>\r\n\"hmmm\" you give a slight smile how about...<br>\r\n <br>\r\n</span></div></div>",
            "created":1577655180,
            "id":2766654,
            "title":"on vacation"
        },
        "112":{
            "author_id":"vexxus",
            "author_name":"Vex",
            "choices":[
                "you somehow recognized her...is that your girlfriend Ally!?",
                "its your girlfriend...but you lost all memory of her",
                "its someone you honestly don't know."
            ],
            "content":"<div class=\"\"><div> <span>the girl at the front just nods...\"step through this darkroom and you will find yourself just as you asked..\"this wont hurt will it?\" you ask,to this the woman only shakes her head...\"no but you will feel a bit of a tingly sensation...\" \"oh yeah?\" you smirk. \"not like that..\" she turns slightly red and laughs.\" \"though...for some the experiance is something of a fettish,but im not one to judge\" she shrugs.<br>\r\n<br>\r\nyou nod and thank her as you step through into the back room and just as you were told,you feel a tingle come over you as you grow slightly warm,almost numb and feel like the room is spinning...soon everything goes dark and you wake up to the feeling of warm tropical sunshine on you as you open your eyes you see you were laying on a warm beach blanket...looking over your,now 5 year old self you were wearing a little blue shirt with a dinosaur on it and matching shorts,and sandles... you could also feel that you are wearing s snug pullup underneath your shorts \"i feewl difwent\"...you feel as if your somone else,younger even...but as far as you recall you have always been the 5 year old little boy you are now...you can't quite remember it.<br>\r\n<br>\r\nyou definitely don't remember where you are as you look around you see you are in a giant room with a big skylight and a large wading pool with a fountain...with a mist coming up from it...giving off that its undoubtedly warmed.<br>\r\n<br>\r\nyou get up,and soon hear the sound of somone coming in...you turn only to see a teenaged girl...about fifteen,maybe even sixteen years of age with blue eyes and long blond hair in a pony tail wearing a white tanktop,jean shorts and flip flops.<br>\r\n<br>\r\n\"there you are sweetie...wow you make for a cute kid\" she giggles...\"just think of me as your big sissy..ive always wanted a little baby brother\".<br>\r\n<br>\r\nyou look at her and she gives holds her hand out for you to take it....</span></div></div>",
            "created":1577656860,
            "id":2766660,
            "title":"spa and pool-park,5 years old"
        },
        "12":{
            "author_id":"wviewerdwj1421",
            "author_name":"DJ Noah",
            "choices":[
                "Kathy",
                "Gabriel ",
                "Sumire",
                "Amanda",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span>You were a 15 year old female but who are you?<br>\r\n<br>\r\nKathy - a redhead Irish tomboy who wanted to regress so she had no responsibilities for a while.<br>\r\n<br>\r\nGabriel - a muscular Mexican that had enough of working hard and want a more carefree day.<br>\r\n<br>\r\nSumire - a petite Asian that feels neglected and want more time in the hands of a caring mother figure.<br>\r\n<br>\r\nAmanda - a well rounded and curved rich girl. She is curious what it would be like to be raised by a furry.<br>\r\n<br>\r\nWho are you?</span></div></div>",
            "created":1578078300,
            "id":2768797,
            "title":"15 year old female human."
        },
        "123":{
            "author_id":"wviewerdwj1421",
            "author_name":"DJ Noah",
            "choices":[
                "A funhouse.",
                "A merry-go-round.",
                "A spa.",
                "A lazy river."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          “There you go miss. Enjoy your time here.” said the Lady at the ticket booth.<br>\r\n<br>\r\n          “Sure.” Sumire shyly said as she head into the park. Where does she head too?</span></div></span></div>",
            "created":1582860420,
            "id":2794063,
            "title":"Sumire"
        },
        "125":{
            "author_id":"vexxus",
            "author_name":"Vex",
            "choices":[
                "sera?",
                "Tabi?",
                "Christine?",
                "No Someone else."
            ],
            "content":"<div class=\"\"><div> <span>how about another girl,(also aged 15)<br>\r\n<br>\r\nSera- a very sweet natured blond,blue eyed girl who adores children (little boys especially)that comes to the park with her 16 year old boyfriend at her own urging...thinks he works too hard and as a suprise,wants to regress him to a child and take care of him.<br>\r\n<br>\r\nTabi- a \"bookworm\" brunette with brown eyes,here as a summer job and is curious exactly what its like here,a bit of a skeptic,she has heard  about  what takes place here but does not believe it...yet<br>\r\n<br>\r\nChristine- an attractive girl with black hair and beutiful green eyes,a cheerleeder and the most beloved and popular girl at school..wants to relive her young childhood and and her first kiss.<br>\r\n<br>\r\nare you..  <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1583665080,
            "id":2798211,
            "title":"Someone else."
        },
        "13":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Canines",
                "Felines",
                "Bears",
                "Rodents",
                "Some other furry group."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you are 15 year old teenage boy furry who's looking to have their younger years back. You feel you grew up way too fast. Before we start our adventure, what group of furries do you belong to?</span></div></span></div>",
            "created":1491541200,
            "id":2301157,
            "title":"I want to be a little boy again"
        },
        "131":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "A wolf",
                "A fox",
                "Other Canine types."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so which type of Canine are you wanting to become a pup of.</span></div></span></div>",
            "created":1491541200,
            "id":2301158,
            "title":"Canines"
        },
        "1311":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "The Regular Pack. Just you. You don't plan to stay forever.",
                "The Sibling(s) Pack. You and other little ones will get the same Mama.",
                "The Family Pack. Your Mama will still be your Mama.",
                "The Adoption Pack. You have reasons for wanting a new Mama permanently. ",
                "Well... I actually have some other Pack ideas. (Keep options open for others.)"
            ],
            "content":"<div class=\"\"><div> <span>So, you were a 15 year old wolf boy who's been getting good grades, helping family where ever you can find work, and dealing with the regular high school bullies and what not. <br>\r\n<br>\r\nBut your Aunt noticed you had been over stressing yourself, and one night, when you mentioned you wished you could go back to being a cute little pup, your aunt offered you a solution. AR Theme Park. A place to literally live out your pup days again. And there were different set ups they had. <br>\r\n<br>\r\nThere was the \"Family Pack\" Which offered that the Mother of the little one(s) could continue mothering their pup(s)/cub(s)/joey(s)/etc, and get to baby them at the same time, for the duration of their stay at the park. <br>\r\n<br>\r\nThere was the \"Regular Pack\", which basically meant, the single regressie would be assigned a mother for the duration of their stay at the park. <br>\r\n<br>\r\nThere was the \"Sibling(s) Pack\" where there would be more then one little one was regressed and assigned the same Mother from the park, and this meant it could be your actual siblings, a friend, or someone else you didn't know if you came alone, and got the same mother assigned as you did, so you could make friends with a little one you never met as adult.<br>\r\n<br>\r\nThere was the \"Be a Parent Pack\", which was only reserved for females, so this option wasn't open to you.<br>\r\n<br>\r\nThere was also \"Adoption Pack\", where, if you were an orphan, or had a very good reason to get a new mommy, that new mother assigned to you would take you to their home to let you stay at the park, and never \"have\" to leave. Now, of course, this didn't mean you would be prohibited from going to places outside the park, but your home now was at the park for the rest your life, which could be eternal, depending on how many times you would regress yourself. And the mothers at the park were no older then 35 years of age at most, some having been here hundreds of years.<br>\r\n<br>\r\nThe secret was, this was where the legendary Fountain of Youth was, and no one was the wiser, aside from employees who took an oath of secrecy to keep it's location from other countries wanting control of it's power for malicious reasons. The Employees here wanted it to be used to help people who were struggling in their grown up years, either due to poor parentage, poor neighborhoods, or just being robbed of parents all together. And employees ranged from human, to Anthros of all spieces, Canine, Feline, etc. So the Mamafurs on the list were a wide variety.<br>\r\n<br>\r\nNow, before we delve into what age group you will decide as a wolf pup, let us first decide what Pack listed above you want to select........</span></div></div>",
            "created":1591158660,
            "id":2845056,
            "title":"A wolf"
        },
        "1313":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "A coyote.",
                "A dingo",
                "Not these give me more."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, how about these options.</span></div></span></div>",
            "created":1491541200,
            "id":2301159,
            "title":"Other Canine types."
        },
        "13133":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Husky",
                "African Wild Dog",
                "Nope keep going."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's some other choices.</span></div></span></div>",
            "created":1491541200,
            "id":2301160,
            "title":"Not these give me more."
        },
        "131333":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Hyenas",
                "German Shepards",
                "Nope lets try some other canines."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1491541200,
            "id":2301161,
            "title":"Nope keep going."
        },
        "15":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Yes, a 25 year old human male.",
                "Yes, a 25 year old furry male.",
                "Yes, a 25 year old human female.",
                "Yes, a 25 year old furry female.",
                "Nope, let's try older....... or should we go for younger, like 10 years old?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay do we wanna try 25 years?</span></div></span></div>",
            "created":1491765180,
            "id":2302353,
            "title":"Let's try some older humans/furries"
        },
        "151":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "5-10 years old",
                "0-5 years old",
                "Unborn"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size5\" style=\"\">You're Alex and you're taking your 6-year-old daughter Lisa and your 4-year-old daughter Mary with you to AR theme park.  After getting through the entrance you move straight to their main attraction... age regression.<br>\r\n<br>\r\nHow young do you go?</font></span></div></div>",
            "created":1573519980,
            "id":2745432,
            "title":"Yes, a 25 year old human male."
        },
        "1513":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "An anthro volunteer",
                "A human volunteer",
                "Someone you know (maybe one of your daughters)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size5\" style=\"\">After you pick the unborn option, you get given a second option of who you want to carry you in their tummy.<br>\r\n<br>\r\n1. An anthro volunteer<br>\r\n<br>\r\n2. A human volunteer<br>\r\n<br>\r\n3. Someone you know<br>\r\n<br>\r\nWhen you look at option 3 you can't help but look down at your daughters as they look up at you with pleading eyes.</font></span></div></div>",
            "created":1573520460,
            "id":2745433,
            "title":"Unborn"
        },
        "15133":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "Lisa (6-years-old)",
                "Mary (4- years-old)",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size5\" style=\"\">Lisa age 6 (your daughter)<br>\r\nShe has quite the bubbly personality and likes pulling pranks on her little sister but she makes sure she doesn't go too far as to not upset her sister as her little sister means the world to her.<br>\r\n<br>\r\nMary age 4 (your daughter)<br>\r\nShe's extremely shy and doesn't like to speak that much but she has a big heart for her family and loves her <br>\r\nbig sister most of all, so much in fact that she occasionally sneaks into her sister's bed at night to cuddle.</font></span></div></div>",
            "created":1573521120,
            "id":2745440,
            "title":"Someone you know (maybe one of your daughters)"
        },
        "151331":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "Yes (take Mary with you)",
                "No (leave Mary behind)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">As you're about to pick Lisa, Mary grasps your hand and says \"can I come too?\" in a voice too cute for words.</font></span></div></span></div>",
            "created":1573521420,
            "id":2745442,
            "title":"Lisa (6-years-old)"
        },
        "151332":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "Yes (take Lisa with you)",
                "No (leave Lisa behind)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">Just as you were about to pick Mary, Lisa asks you \"can I come with you?\" in a cheerful voice.</font></span></div></span></div>",
            "created":1573521660,
            "id":2745443,
            "title":"Mary (4- years-old)"
        },
        "155":{
            "author_id":"blank1199",
            "author_name":"Blank",
            "choices":[
                "11 year old ---",
                "12 year old ---",
                "Younger "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>11 year old ----<br>\r\n<br>\r\n12 year old ---<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1501828680,
            "id":2364352,
            "title":"Nope, let's try Younger "
        },
        "1553":{
            "author_id":"blank1199",
            "author_name":"Blank",
            "choices":[
                "9 year old ---",
                "10 year old ---",
                "Younger?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>9 year old ---<br>\r\n<br>\r\n10 year old ---</span></div></span></div>",
            "created":1501828740,
            "id":2364353,
            "title":"Younger "
        },
        "15533":{
            "author_id":"blank1199",
            "author_name":"Blank",
            "choices":[
                "8 year old ---",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>8 year old ---</span></div></span></div>",
            "created":1501828800,
            "id":2364355,
            "title":"Younger?"
        }
    },
    "info":{
        "author_id":"weatherwatcher",
        "author_name":"Talcane",
        "brief_description":"Welcome to the theme park that makes your regressive fantasies become reality.",
        "created":1491514980,
        "description":"<td align=\"left\" class=\"norm\">Welcome to AR Theme Park, aka Age Regression Theme Park. Here, you can have all your regressive fantasies become reality. Worried about parents having to be present, no need to worry, Motherly caretakers are already on site to take care of all the precious little ones, including you. You could just regress to a rambunctious 5, 6, or 7 year old, or you could regress to so young that one of the mommies on sight can carry you in their tummy for as long as you want them to. At this theme park. It is open 24/7 365..... 366 every leap year. So not only do customers who want another chance at babyhood come to this place, those who want a chance to be mothers to little ones forever come as well. Perhaps you are that mother if you are female. And all fun activities kids love are all around this park. Some customers have never left the park area since arriving, by choice of course. And great things is housing is within the park.<br>\r\n<br>\r\nAlso, there will be the option to have an anthro furry as a caretaker, and/or have you as a baby/child furry.<br>\r\n<br>\r\nThings Not Allowed:<br>\r\n1. No death<br>\r\n2. No gore<br>\r\n3. No bullies, including caretakers acting mean to the ones they take care of.<br>\r\n4. No making the situation uncomfortable for either party, both the regressee and the mother caretaker have to be willing and comfortable about the situation.<br>\r\n5. No heavy details of diaper usage. Keep the mentions as minimal as possible.<br>\r\n6. No making the mothers on site, or the owner having evil intentions about the park.<br>\r\n7. No evil intentions period.<br>\r\n8. No vore other than unbirth.<br>\r\n9. No regressing the main character (you) so far back that the main character was never conceived.<br>\r\n10. No Herms.<br>\r\n11. No gay male relationships. Lesbian mothers are okay.<br>\r\n12. No making males caretakers, and/or leaving them as the only option.<br>\r\n13. No one past the age of 35 years old as a starting age.<br>\r\n<br>\r\nAs long as you follow these rules, anything goes. Have fun. Please help me to get at least 70 chapters up.</td>",
        "id":2117794,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1591158660,
        "modified":1591158660,
        "pretty_title":"AR Theme Park"
    }
}