{
    "chapters":{
        "1":{
            "author_id":"drywalldryad",
            "author_name":"DrywallDryad",
            "choices":[
                "Nancy Drew",
                "Bess Marvin",
                "George Fayne",
                "Another character."
            ],
            "content":"<div class=\"\"><div> <span>First, pick a character.  The choices are:<br>\r\n<br>\r\nNancy Drew -- an inquisitive teen sleuth with red-gold hair and a nose for the truth, Nancy is dedicated to solving mysteries and putting baddies behind bars.   She also has a knack for getting herself knocked out and tied up, which would be good if this was a different sort of kinky story -- but with a little gumption and creativity, I'm sure we can fatten her up.<br>\r\n<br>\r\nBess Marvin -- blonde, chubby, fashionable, and loves guys.  And eating.   She really loves eating.   This canonical glutton is sure to become a breakout star!<br>\r\n<br>\r\nGeorge Fayne -- a slim, athletic brunette (and a girl, despite the name), she's the cousin of Bess and never misses an opportunity to make fun of her weight.  She's a real jerk about it.  Will Bess get her revenge?  We'll see!<br>\r\n<br>\r\nOr, try someone else, including characters from the Her Interactive games.</span></div></div>",
            "created":1330211760,
            "id":1284077,
            "title":"The Case of the Character Choice"
        },
        "11":{
            "author_id":"drywalldryad",
            "author_name":"DrywallDryad",
            "choices":[
                "Nancy has to go undercover at a plus-sized modeling agency.",
                "A crook's scheme to render her a little less stealthy... ",
                "Wild Card!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Disciplined, organized, and dedicated, Nancy might be a tough one to fatten up, but there are ways.  There are always ways.</span></div></span></div>",
            "created":1330212840,
            "id":1284104,
            "title":"Nancy Drew"
        },
        "111":{
            "author_id":"benz02",
            "author_name":"HedgeOvrlrd",
            "choices":[
                "Fattening Parents",
                "Feeders/Feedee",
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Nancy Drew's Options<br>\r\n<br>\r\nOption #1: <br>\r\n<br>\r\nNancy tries to eat as much as she can without getting sick, and her parents help feed her.<br>\r\n<br>\r\nOption#2:<br>\r\n<br>\r\nNancy wants to be a PHAT Detective, and she enlists her friends BIG Bess and BUFF George to help her with her predicament.<br>\r\n<br>\r\nOption#3:<br>\r\n'<br>\r\nWriter's Choice</span></div></div>",
            "created":1536220260,
            "id":2543703,
            "title":"BINGE Eating Nancy"
        },
        "12":{
            "author_id":"drywalldryad",
            "author_name":"DrywallDryad",
            "choices":[
                "A day of overindulgence begins at a cute little bistro...",
                "Bess follows Nancy to a case in an exotic location -- with great food.",
                "A new, ridiculously ineffective fad diet hits River Heights!",
                "The old standby -- the guy she's currently drooling over turns out to be an FA.",
                "Wild card!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pretty, boy-crazy, and perpetually a few pounds north of where she wants to be, Bess leaves a trail of shattered hearts and abandoned diets wherever she goes.   The options are limitless!  And by limitless, I mean five.</span></div></span></div>",
            "created":1330212420,
            "id":1284095,
            "title":"Bess Marvin"
        },
        "121":{
            "author_id":"drywalldryad",
            "author_name":"DrywallDryad",
            "choices":[
                "Downhill (phew!) - for a walk along the river.",
                "Uphill (ugh!) - to her home in the heights."
            ],
            "content":"<div class=\"\"><div> <span>It was a beautiful sunny afternoon in the bucolic town of River Heights.   The birds were singing.  The brooks were babbling.  The shifty-eyed criminals were plotting diamond heists in their dank lairs.   And Bess Marvin and George Fayne were having lunch at that cute little bistro on the corner of Fifth and McIntosh.<br>\r\n<br>\r\nTall, dark-haired, and athletic, George was dressed for the weather in a tank top and jogging shorts.  Even with her slim frame coddled by the rich red leather of the Kitty Corner's booths, she looked alert and energized, ready to hop up and break into a sprint at any moment.    <br>\r\n<br>\r\n\"I guess I'll have a fruit cup -- ooh, and these salads look good,\"  George said, looking over the menu.   <br>\r\n<br>\r\n\"They do!\" Bess agreed enthusiastically.  \"Maybe I'll have one with my cheeseburger!\"<br>\r\n<br>\r\n\"Oh, Bess,\" George chided, \"really?  A cheeseburger?\"<br>\r\n<br>\r\n\"Well, why not?\"  Bess answered stiffly.<br>\r\n<br>\r\n\"You've put on <i>quite</i> enough weight this summer already, cousin o' mine.\"<br>\r\n<br>\r\nBess blushed.  Okay, so she was a <i>little</i> on the plump side.  Maybe more than just a little.   But so what if her designer jeans were getting tight and her favorite shiny blue T-shirt was starting to fray at the seams from the effort of holding her in?  As long as you could get manage to squeeze yourself into a size ten, you <i>were</i> a size ten, darn it!<br>\r\n<br>\r\n\"It's only scientific,\" Bess explained.  \"If you fill yourself up at lunch, then you won't have to urge to snack all day.\"<br>\r\n<br>\r\n\"No <i>science</i> could come between you and a snack,\" George scoffed.   <br>\r\n<br>\r\n\"Just you watch, unbeliever!  I bet I barely even touch my dinner tonight!\"<br>\r\n<br>\r\n\"On <i>pizza night?</i>  I'll eat my hat if you're not licking the crumbs off of that platter, as usual.\"<br>\r\n<br>\r\n\"Well then, I hope you like the taste of hat.\"<br>\r\n<br>\r\n\"I hope so too,\" George grinned,  \"because it's probably the only thing that'll be left for me.\"<br>\r\n<br>\r\n\"Oh, you're impossible!\"  Bess crossed her arms over her chest.   \"I <i>will</i> get a cheeseburger if I want, and that's that!\"<br>\r\n<br>\r\n\"No one's stopping you.\"<br>\r\n<br>\r\n\"Only -- uh -- won't you get one too?\"<br>\r\n<br>\r\n\"Nope.  I'm eating healthy.  You know, cuz, some of us enjoy seeing our feet once in a while.\"<br>\r\n<br>\r\n\"Pleeease?\" Bess begged.   \"Look at that waiter -- he's a complete dream!  And he doesn't know about scientific diets and things, so he'll think I'm ... I'm...\"<br>\r\n<br>\r\nGeorge raised one dark eyebrow.  \"An oinker?\"<br>\r\n<br>\r\n\"Hey!   But yes.\"<br>\r\n<br>\r\n\"Fine,\" Bess's cousin sighed.   \"But it's your treat.\"<br>\r\n<br>\r\n\"Are you lovely ladies ready to order?\" asked the complete dream, who had sauntered up to the table with a smoldering look on his face and a pad of paper in his hand.<br>\r\n<br>\r\nBess smiled and fluttered her eyelashes at him.  \"We'll have the double cheeseburger baskets.\"<br>\r\n<br>\r\n\"And a fruit cup, and salad,\" George added.<br>\r\n<br>\r\n\"I'll take a salad, too!  With extra dressing.  Extra <i>light</i> dressing.  And an extra side of fries.\"  Bess looked away.  \"Um, you know... so the light dressing won't go to waste.\"<br>\r\n<br>\r\n\"Would you two like some... milkshakes with those fries?\" purred the waiter seductively. <br>\r\n<br>\r\n\"Ooh, yes, please,\" Bess cooed before George could say anything.<br>\r\n<br>\r\n\"Wonderful!  Then I'll make sure you get a little <i>extra</i> ice cream -- if you think you can handle it, that is.\"<br>\r\n<br>\r\nBess adjusted her shirt, wondering if the steam drifting out of her collar was just her imagination.   He was just so taut and swarthy and scrumptious.   \"We sure can!\"<br>\r\n<br>\r\nWhen their food came, Bess practically inhaled hers.  The burger was delicious -- thick and cheesy, piled high with vegetables and dripping with grease.   The fries were hot and crispy and there were plenty of them, and the salad was bursting with zesty flavor.    She was almost two-thirds finished when she noticed that, aside from her fruit and salad, her cousin had only eaten a few fries.<br>\r\n<br>\r\n\"George!  Why aren't you eating?\"<br>\r\n<br>\r\n\"I did eat.\"<br>\r\n<br>\r\n\"But why aren't you eating your <i>cheeseburger?</i>\"<br>\r\n<br>\r\n\"Huh?  I didn't want to eat it.  I said you could <i>order</i> it, if it made you feel better.\"<br>\r\n<br>\r\n\"But it's pointless if you don't <i>eat</i> it!\"  Bess hissed, looking over her shoulder to make sure the waiter was occupied at another table.    \"How exactly does it help me look like less of a glutton if I'm cleaning my plate and you're sitting there picking away like a bird?\"<br>\r\n<br>\r\n\"If you don't want people to think you're a glutton, maybe you should start by not stuffing half a pound of cheesy beef into your face in a public place, hmm?  Bess?  Uh, Bess, what are you doing?\"<br>\r\n<br>\r\nBess had leaned over the table, grabbed George's hamburger, and taken an enormous bite.<br>\r\n<br>\r\n\"Mine too? <i> Really?</i>\"<br>\r\n<br>\r\n\"Wllmph mm pammph for iff, dimmt I?\" Bess swallowed.  \"And if you're not going to make your meal looked lived in...\"<br>\r\n<br>\r\nDefiantly, she stuffed a handful of George's fries into her mouth and chewed furiously.  She'd managed to put a serious dent in her cousin's meal by the time the waiter returned.<br>\r\n<br>\r\n\"Everything okay here?\"<br>\r\n<br>\r\n\"Mm-<i>hhmm!</i>\"  Bess nodded cheerfully, cheeks bulging with food.  She hoped he hadn't noticed her quickly taking her hands off the remains of George's burger.<br>\r\n<br>\r\n\"Are we going to need some boxes for that today?\"<br>\r\n<br>\r\nGeorge laughed.   \"Boy, do you not know Bess.\"<br>\r\n<br>\r\nBess shot her a poisonous look.  As soon as the waiter was gone, she snapped, \"I <i>might</i> have needed a box, you know.\"<br>\r\n<br>\r\n\"You haven't left a meal unfinished since you were old enough to feed yourself.  What you'll <i>need</i> is a shoehorn to get you out of this booth.\"<br>\r\n<br>\r\n\"I will not!\"<br>\r\n<br>\r\n\"Whatever, I've got to get going.  Here's a fiver for my share, okay?  And another couple of bucks for the tip.\"  George dropped a few crumpled bills on the table and stood up.   \"Just stop before you go into another food coma, okay?\"<br>\r\n<br>\r\nBess snorted.  What kind of pig did George think she was, anyway?   Making sure the coast was clear first, she emptied the rest of her cousin's food onto her plate.  No sense letting it go to waste -- and this way, it looked like George was the one who'd gobbled her food down and run.<br>\r\n<br>\r\n\"Did we save room for dessert today?\"  <br>\r\n<br>\r\nIt was the hunky waiter again.   Bess gave him an apologetic look.  \"Sorry -- I don't think so.\"<br>\r\n<br>\r\n\"Are you sure?  The apple pie is delicious today.\"<br>\r\n<br>\r\n\"I'd -- I'd really better not -- \"  the plump girl said.   She shifted position, trying to sit so that he couldn't see her stomach.  She was sure had a bulge in it the size of two big, greasy dinners.  Finishing the second milkshake had <i>probably</i> been a mistake.<br>\r\n<br>\r\n\"It's fresh out of the oven.\"  He looked at her with puppy-dog eyes.  \"We can give you a sample slice, if you'd like.\"<br>\r\n<br>\r\n\"Well, maybe... maybe just one teeny tiny little slice.\"<br>\r\n<br>\r\nThree slices of pie later, Bess waddled out of the Kitty Corner.  She felt decidedly taken advantage of after catching Hunky McSexerson making an identical set of puppy eyes at the girl one booth over.   <br>\r\n<br>\r\n<i>That rotten tease was never interested in me at all</i>, she fumed.  <i>He just wanted to move more pie!</i>  She was <i>glad</i> that after paying the bill she'd only had twenty-two cents left over for the tip.   <br>\r\n<br>\r\nLeaving the restaurant, she headed --<br>\r\n</span></div></div>",
            "created":1330216020,
            "id":1284133,
            "title":"Cheeseburgers in River Heights"
        },
        "1211":{
            "author_id":"drywalldryad",
            "author_name":"DrywallDryad",
            "choices":[
                "SUCCESS!  Bess gets the dreamboat's digits.",
                "FAILURE!  She's \"just not his type\", and gets nothing but a bellyache."
            ],
            "content":"<div class=\"\"><div> <span><i>Gosh, am I full</i>, Bess thought, running a hand over the curve of her stomach. <i>I've</i> got <i>to walk some of this off before it settles in for a long-term stay!</i><br>\r\n<br>\r\nDownhill seemed more welcoming than uphill (and it was really the same exercise either way, she told herself), so she made her way towards the river.   It was a slow and uncomfortable walk -- she really was far too stuffed to go at more than a snail's pace.  Any faster, and a wicked stitch began along her sides.<br>\r\n<br>\r\nThe scenery of the riverbank was beautiful.   Burbling waters flecked with white foam, the beautiful emerald green of the lilypads and their slippery inhabitants, the gentle white and brown of the ducks, and --<br>\r\n<br>\r\n\"Hot dogs! \"<br>\r\n<br>\r\nAny other day, the hot dog cart itself would have grabbed Bess's attention.   There wasn't much better than a piping hot tube of processed meat dripping with relish and mystery sauce, yours to eat while you strolled along the riverbank on a beautiful spring day.  She was in no mood for it today, of course -- but what the hot dogs themselves lacked in charm, the hot dog<i> vendor</i> made up in spades.<br>\r\n<br>\r\nIt was Josh Hansen, the tall, slender senior with coal-black eyes and hair like golden wheat.   She knew him by name -- he placed on four out of five Hottest Guys in School lists, and was ranked in the top three by the controversial Fayne Metric.  Bess didn't exactly accept that one as authoritative, of course, but still -- he was pretty up there.  She felt herself going weak in the knees just looking at his.  He made that sexy waiter look like a particularly un-sexy dishwasher.   He turned to face her, those dark, smokey eyes taking her in --<br>\r\n<br>\r\n<i><br>\r\nCrap!  Josh Hansen is looking right at me and I'm standing here with a major case of burger bulge!</i>, she realized.  If she looked half as big as she felt, it was a horrifying thought.  Instinctively, she tried to suck in her stomach.  It was useless.  Her abdominal muscles made a feeble attempt at contracting around the huge lump, but there simply was nowhere for her to hide so much food.   <br>\r\n<br>\r\nShe sighed. <i> Great.  Burger bulge it is, then</i>.<br>\r\n<br>\r\nWell, all she could do was make the best of it.   She gave him her most winning smile, her whole face lighting up like a sunbeam, and tossed her hair over her shoulder.   She also squared her shoulders and inhaled as much as she could hold.  If she couldn't make her stomach look smaller, darn it, at least she could make her chest look <i>bigger</i>.<br>\r\n<br>\r\nJosh returned her smile with a friendly grin of his own.  \"Hey, I know you, don't I?  From school?  Um, don't tell me--\"<br>\r\n<br>\r\n<i>He knows me! </i> It was all Bess could do to keep from squealing it out loud.  She could have melted right into a happy little puddle, right there in the grass.<br>\r\n<br>\r\n\"Beth!\"  Josh said with a triumphant snap of his fingers.  \"Beth Martin!  Right?\"<br>\r\n<br>\r\n<i>For you I am</i>, Bess swooned, nodding enthusiastically.<br>\r\n<br>\r\n\"You sit next to me in calculus, don't you?\"<br>\r\n<i><br>\r\nTwo seats to the left and one seat back.</i>  \"Yes!\"<br>\r\n<br>\r\n\"Well, it's great to see you, Beth!  Out enjoying the weather?\"<br>\r\n<br>\r\n\"Uh-huh!\"<br>\r\n<br>\r\n\"How about I fix you up a nice hot dog?\"<br>\r\n<br>\r\n<i>Uh-oh</i>.   Bess's overfull stomach lurched uncomfortably at the thought of more eating.  \"It -- it's not that I wouldn't love one, of course,\" she said apologetically.   \"I'm flat broke, though.  Too bad!\"<br>\r\n<br>\r\n\"Oh, that's all right, this one's on the house.\"  He pulled a frighteningly large foot-long hot dog from the deep recesses of the cart, stuffed it into a dishearteningly puffy bun, and began slathering it with positively gruesome amounts of ketchup, mustard, and relish.<br>\r\n<br>\r\n\"Wow,\" Bess said nervously.  \"Big.\"<br>\r\n<br>\r\n\"Biggest dogs in town!\"<br>\r\n<br>\r\n\"Goody.\"  She took it gingerly in both hands.  <i> Oh, my poor little stomach.   You don't deserve this sort of treatment.  But if I turn it down now, he'll think I don't like him, and I can't let that happen.  So you're just going to have to take one for the team.</i><br>\r\n<br>\r\nTo her stomach's eternal credit, it took it like a champ.  Well, it did have eighteen Thanksgivings' worth of room-making experience, after all.  Still, by the time she finished, she was absolutely<i> crammed</i>.  And where did all that flirting and food get her?<br>\r\n</span></div></div>",
            "created":1330216800,
            "id":1284141,
            "title":"Burgers + Hot Dogs = One Filled-Up Flirt!"
        },
        "12111":{
            "choices":[
                "George and Nancy help Bess come home to pizza",
                "Bess wants to call Josh's number immediately!"
            ],
            "content":"<div class=\"\"><div> <span>\"Wow, you must really like hot dogs,\" said Josh brightly, \"I think that enjoying hot dogs is a really inspirational quality in a girl.\"<br>\r\n<br>\r\n<i>A really inspirational quality! </i>Bess nearly squealed.  Josh was practically asking her out on the spot!  She was so excited that she could barely keep still, but she was so stuffed that any movement made her feel sick. She just hoped that she could keep it together until he actually popped the question...<br>\r\n<br>\r\n\"That was...really great, Josh,\" she wheezed weakly, \"I think that...thinking that girls who like hot dogs are inspirational...is...um...it's really great.\"  The normally dizzy flirt was feeling even dizzier than usual; her head was spinning with nitrates.  Sweat beaded her flawless forehead, having little to do with the temperature of the night air and more to do with her night of excessive eating.  She had to concentrate with all her might to keep from fainting and she was certain that she must look like an overstuffed pillow...but she was still in the running.  She struggled to keep sucking in her bloated gut, but the additional after-meal made it even more difficult. Her full tummy quivered with the effort.  She was so full that it was only sheer willpower that kept her from exploding.  She had never dreamt that it was possible for a girl to feel this absolutely stuffed over capacity.<br>\r\n<br>\r\n\"Hey, listen Beth, why don't you call me sometime?\" Josh pulled a slip of paper out of his pocket and scribbled down some numbers.  Bess nearly leapt out of her too-tight skin.  He wasgiving her his number!  And George always said that excessive eating would never pay off! Well, that just goes to show what she knew.<br>\r\n<br>\r\nJosh tapped his nose conspiratorily as he handed the paper to her, but Bess was feeling too stuffed and woozy to give the odd gesture much thought.  She snatched the slip out of Josh's hand, flashing him faltering but still winning smile.  She held the frozen smile long enough to watch Josh push his hot dog cart around the corner.  <br>\r\n<br>\r\nBess waddled to the nearest bench and collapsed with a hard WHUMP.  The poor girl might have been a veteran glutton, but tonight she had really outdone herself.  Satisfied that her crush was out of view, she sighed heavily and released her stomach muscles; her paunch lurched forward, pushing up the hem of her shiny blue shirt. She felt a slight blush of embarrassment at the size of her stuffed belly, but, since she was alone, she was just happy that she wasn't splitting her shirt.  She closed her eyes and concentrated on her shallow breathing, gingerly running her hand over her painfully bulging middle.<br>\r\n<br>\r\n\"What are you doing, lamaze?\"<br>\r\n<br>\r\nBess opened her eyes to see a smug-looking George and a concerned-looking Nancy standing before her.  Bess immediately dropped her hands to the hem of her shirt and tugged it back down over her bulging midsection.<br>\r\n<br>\r\n\"Are you alright, Bess?\" asked Nancy, \"You look a bit green, you know.\"<br>\r\n<br>\r\n\"I'm going to puke,\" sulked Bess. \"What are you guys doing here?\"<br>\r\n<br>\r\n\"Obviously we're looking for you,\" said George, \"We started getting worried when you didn't show up for pizza, but I should have known better than to leave you behind alone when there was either food or available men in town.  Though, from the looks of it, I'd say that food was the culprit that's kept you out late.  What did you do, Bess? I didn't think it was possible but you look even bigger than when I left you after dinner.\"<br>\r\n<br>\r\n\"N-nothing,\" said Bess defensively, \"I just had a tiny tiny little sliver of three pies. And a hot dog. But I only ate that so I could get this!\"  Bess crammed her hand into the pocket of her binding jeans to triumphantly pull out the paper Josh had given her. \"Look what I got! Josh totally gave me his number! Ohhhh..\"<br>\r\n<br>\r\nWaving the paper had jostled her stuffed belly too much and Bess doubled over in pain.<br>\r\n<br>\r\n\"You got a guy's phone number for stuffing yourself?\" George was incredulous. \"I never thought I'd see the day...\"<br>\r\n<br>\r\n\"Come on, George,\" said Nancy, \"You've said quite enough. Come on, Bess, give me a hand and we'll help you get home.\"<br>\r\n<br>\r\n\"I'm dying,\" moaned Bess, \"Let me burst in peace.\"<br>\r\n<br>\r\nNancy looked at her chubby friend dubiously.  Bess was definitely looking quite green.<br>\r\n<br>\r\n\"Stop being so melodramatic, Bess,\" said George. \"All you've got is an acute case of indigestion. And it serves you right! If you hadn't made such a pig of yourself, then maybe you wouldn't be in this situation now.\"<br>\r\n<br>\r\n*** <br>\r\n<br>\r\nAcross the river, Beth Martin waited impatiently.  The plump blonde bore a substantial resemblance to Bess, although her dueling scar and eyepatch clearly advertised that she was a real no-good-nik.<br>\r\n<br>\r\n\"Where is that stupid contact?\" she said, checking her watch again. \"He was supposed to be here twenty minutes ago.\" Her stomach growled. \"And after I specifically skipped lunch just so I would have room for the secret signal.\"</span></div></div>",
            "created":1330506420,
            "id":1286224,
            "title":"SUCCESS!  Bess gets the dreamboat's digits."
        },
        "121112":{
            "author_id":"drywalldryad",
            "author_name":"DrywallDryad",
            "choices":[
                "The next day, Bess receives a strange delivery...",
                "Beth Martin calls her 'clients', demanding to know what's going on."
            ],
            "content":"<div class=\"\"><div> <span>\"Hello, Josh!\"  Bess said cheerfully.  \"No, no, that's too flippant -- how about: helloooo, Josh.  No way!  That sounds downright <i>naughty</i>.  Mmm, what if I said 'He--<i>urrp!</i>'\"<br>\r\n<br>\r\n\"I think you've got a winner there,\" George said sarcastically from her spot in the front passenger seat.  \"If I was you, though, I'd wait at least <i>five</i> minutes to call him, so you don't sound desperate.\"<br>\r\n<br>\r\n\"That's enough, George -- but she's right, you know, Bess,\" Nancy said.  \"At least wait until your stomach settles down!\"  <br>\r\n<br>\r\n\"It's how my cousin's brain works, you know,\" George explained.  \"All she's ever got on the mind is boys and food -- so if you actually stuff her full enough that she doesn't want more food, there's only one thing left.\"<br>\r\n<br>\r\n\"Ha, ha,\" Bess said darkly.   Her dark expression turned pale as the car swung around a broad curve, and she put a hand to her mouth.   \"Oohh... Nancy, take it easy on those...\"<br>\r\n<br>\r\n\"Do you need to get out, Bess?\" Nancy said, a little worriedly.  It wasn't cheap to clean the upholstery.<br>\r\n<br>\r\n\"She's bluffing,\" George said confidently.  \"That girl's stomach is a pit of no return.  Food checks in; it doesn't check out.\"<br>\r\n<br>\r\n-----<br>\r\n<br>\r\nSometime later, in one of River Heights' seedier \"abandoned\" warehouses, a dingy phone began ringing.   The hand that picked it up belong to one Jimmy \"The Rat\" Hooch, a beady-eyed, beetle-browed hood who'd found himself on the wrong side of the law more than once.  <br>\r\n<br>\r\n\"Yeah, ah, Stately Cleaneahs, Mr. Stately speakin'.\"<br>\r\n<br>\r\n\"Oh,\" said Bess on the other end.  \"Er, is Josh there?\"<br>\r\n<br>\r\n\"Josh who?\"<br>\r\n<br>\r\n\"Josh... Hansen?\" Bess said.  \"It's me, it's Bess, er, he gave me this number today?\"<br>\r\n<br>\r\n\"Ohhhh.  <i>Dat</i> Josh Hansen.  Uh, yeah, dis is, ah, his uncle, capiche?  He ain't here now, but he told us to expect your call.\"<br>\r\n<br>\r\n\"Oh, he did?  Did he, uh, did he... say anything about me?\"<br>\r\n<br>\r\n\"He's been keepin' an eye out for you for a while, no pun intended,\"  Jimmy said.  \"He said he'd be passin' you the number as soon as he confirmed you had the stuff.  So ... I take it by the fact that we are conversin' that you proved to him you've got the goods?\"<br>\r\n<br>\r\nBess blushed.  \"Well, I don't like to brag...\"<br>\r\n<br>\r\n\"Good.  As I'm sure you're aware, we're all eager to get our hands on dose hot pieces a' merchandise.\"<br>\r\n<br>\r\nBess frowned.   \"Er... that's, uh, that's... nice of you, but I'm really just interested in Josh.\"<br>\r\n<br>\r\n\"Hey, hey, say no more!  I know how it is.  You wanna deal with a familiar face.  How about we arrange a little 'date' ... just the two of you?\"<br>\r\n<br>\r\n\"I'd love to!\" Bess squealed.  \"Tell him I accept!\"<br>\r\n<br>\r\n\"Good.  He'll be pickin' up the 'bill', of course.  At the usual goin' rate -- twenty big ones?\"<br>\r\n<br>\r\n\"Mmm... I don't know,\" Bess mused.  It was nice of Josh to pay, of course, but two people couldn't have much of a date for just twenty dollars!  \"I think he should budget for a little more.  At least, uh, forty?\"   <br>\r\n<br>\r\n\"Forty!  You're off your nut, dollface.  Twenty-five.\"<br>\r\n<br>\r\n\"Fine, twenty-five.\"  Bess rolled her eyes.  She could always spring for movie tickets herself.<br>\r\n<br>\r\n\"Good.  We'll arrange a meetin', then.  Look for a message... in the usual way.\"<br>\r\n<br>\r\n\"What usual way--\" Bess began, but there was a click on the other end.<br>\r\n<br>\r\n\"Is everything okay, Bess?\" Nancy asked, looking up from her pizza.<br>\r\n<br>\r\n\"Josh's uncle is weird,\" Bess sighed, clapping the phone shut.   \"Oh... shut that box, would you?  I can't stand the thought of pizza right now.\"<br>\r\n<br>\r\n-----<br>\r\n<br>\r\nJimmy \"The Rat\" looked over the table of pizzas prepared by his associate Jerry \"The Skunk\".    \"So, you're sure you did the message right this time?\"<br>\r\n<br>\r\n\"Yeah!  I tol' ya, I done it perfect!  You got the dame's address?\"<br>\r\n<br>\r\n\"Looked it up from her number, tracked her down.  She ain't even usin' a disposable phone,\" Jimmy snorted.  \"Sloppy.  An' askin' for forty grand!   This chippy's got guts, I'll give her that.\"<br>\r\n<br>\r\n\"Hope she has the stuff, that's all,\" Jerry said.  \"Or the boss ain't gonna be happy.\"<br>\r\n<br>\r\n\"She'd <i>better</i> have it,\" Jimmy said darkly.  \"Otherwise, she's gonna find out what happens to two-bit freelancers who t'ink they can pull a fast one on... the <i>Stratemeyer Syndicate</i>.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1330999440,
            "id":1289715,
            "title":"The Date Is Set"
        },
        "1211121":{
            "choices":[
                "These no-goodniks leave Bess with 4 boxes of pizza.",
                "These no-good-niks want to know where da goods are. "
            ],
            "content":"<div class=\"\"><div> <span>Bess spent the next day in a daze, alternatively bubbling with excitement and in boiling indread.  Everything just had to be perfect for the big date!  Of course, Bess had the perfect dress to wear to her date. She was an absolute clothes horse and a veteran shopper, so she could never pass up a beatiful dress at a bargain price. That half her clothes didn't even seem to be in her size was only testament to Bess' commitment to the shopping experience. And to her steadfast belief in that elusive future date when one of her many fad diets finally panned out and delivered her into size 0 country.<br>\r\n<br>\r\nToday, however, was not that day.  If anything, the night of meat product gorging might have added just the barest fraction of extra padding to poor Bess's already rounded hips and rump. It definitely left her with a bit of a belly bulge, since even a whole day later she felt like she hadn't digested everything.<br>\r\n<br>\r\n\"What do you think of this one?\" asked Bess, pulling yet another stylish but woefully mis-sized dress out of her closet.  <br>\r\n<br>\r\nGeorge looked up from her magazine.  \"I think the same thing I thought about all the others,\" she said, \"I'm sure they're all good.\"<br>\r\n<br>\r\n\"George Fayne! You're really no help at all! This is a very important date for me! It's the FIRST date! The first date is the one that determines whether there's going to be a second. I've got to look absolutely smashing if Josh is going to be impressed with me.\"<br>\r\n<br>\r\n\"In that case, I think your first criteria should be whether the dress ACTUALLY fits you. How many pounds ago did you buy that thing? Or is that another one of your 'Someday I'll pass up a meal' fantasy buys?\"<br>\r\n<br>\r\nBess grimaced. \"George, you're being very rude!\"<br>\r\n<br>\r\nGeorge threw up her hands. \"Hey, I'm just giving you honest feedback!  Wear whatever you want, but don't come crying to me when you have a wardrobe malfunction during your dinner.\"<br>\r\n<br>\r\n\"I most certainly will not be doing that,\" huffed Bess. <br>\r\n<br>\r\nGeorge smiled impishly and returned to her magazine, ignoring Bess' grunting and mumbling as her chubby cousin fought with the unforgiving fabric.  Bess wriggled her way into the snug dress slowly, taking frequent breaks.  It was a delicate operation and she was determined to win without splitting any seams. <br>\r\n<br>\r\n\"Having trouble?\" said George without looking up.<br>\r\n<br>\r\n\"Not at all! This dress is supposed to be a little tight, you know, to show off your curves.  I'll... just have to suck in a little.\"<br>\r\n<br>\r\n\"Yeah, too bad you can only suck in your stomach.  If only you could suck in your rear as well...\"<br>\r\n<br>\r\n\"That's quite enough, George.\"<br>\r\n<br>\r\n\"Well? What do you think of that?\"<br>\r\n<br>\r\nBess was wearing a simple white summer dress with red embroidery and a red shrug.  George suspected that it was desined to be more flowy than it appeared on Bess; the garment was just a tad too tight around Bess's chubby frame, hugging her like a lost child with anxious attachment disorder.  Josh might not notice Bess' ample curves and soft paunch if he was blind, but, otherwise, there wasn't much chance that anyone would mistake Bess for anything other than a chunky little chubbette. <br>\r\n<br>\r\n\"You sure you should be wearing that, cuz?\" said George dubiously. \"You look ready to burst out of it.\"<br>\r\n<br>\r\n\"I'm sure it will hold just fine, thank you very much,\" said Bess just a tad crossly. She turned to critique herself in the mirror and attempted to suck her belly in even further. \"...as long as I don't breathe.\"<br>\r\n<br>\r\n\"Yeah, or eat. Oh wait. Well, no chance of that happening, huh?\"<br>\r\n<br>\r\n* * *<br>\r\nThe doorbell rang exactly on time.  <br>\r\n<br>\r\n\"Oh, that must be him now,\" squealed Bess, clapping her hands together. \"He's so handsome and punctual!\"  She skipped to the door as effectively as a plush girl stuffed into a poorly-sized dress could.  She paused briefly before opening the door to compose herself -- standing up straight, taking a deep breath, smoothing her wavy blond hair, and steadying herself.  She quickly wiped the broad smile from her face.  She had to be all business when she answered the door. No good letting Josh know just how excited she was about their date -- he might get the wrong idea that she was some kind of floozy!<br>\r\n<br>\r\nBess threw open the door, her smile returning despite herself. \"Oh, Josh, I'm just -- oh?\"<br>\r\n<br>\r\nBess' momentary smile turned to a confused grimace as she took in the sight of the two greasy characters standing on her stoop. Neither one looked at all like Josh and both looked like trouble!  Each man was carrying two long flat boxes of what very pointedly smelled like pizza.<br>\r\n<br>\r\n\"Dis 323 West Lilac Grove, River Heights?\" rasped the larger man, Lundberg Stetson cap perched on his sloping, ape-like brow.<br>\r\n<br>\r\n\"Um, yes,\" said Bess uncertainly. She didn't like the look of these two at all.  They looked like exactly the sort of ruffian that her friend Nancy should be investigating.<br>\r\n<br>\r\n\"Yeah, we gots a real special delivery fer a Miss Marvin 'ere,\" said the shorter one.  Jimmy \"The Rat\" Hooch shoved the greasy pizza boxes into Bess' hands.  Bess stared in astonishment.  <br>\r\n<br>\r\n\"Did George put you up to this?\" asked Bess, \"Ooo! I swear, that cousin of mine! She must think she's quite clever. Yes, I know I'm a bit plump, but this is completely uncalled for--\"<br>\r\n<br>\r\n\"Hey, that don't got nuthin' ta do wit us,\" interrupted Jimmy. \"We's just fulfillin' our deal like we sed onna phone last night, toots.\" <br>\r\n<br>\r\n\"Oh! Oh, I see, of course! You must be Josh's uncle!\"<br>\r\n<br>\r\n\"Dat's me,\" said Jimmy, a disconcerting leer pasted across his greasy, rodent-like mug. His bloodshot eyes scanned the room.  Nice digs, he thought.  This broad must actually make some good moolah in the racket to afford it.  Well, \"Da Boss\" had insisted on using Beth Marvin, saying she was the best in the business.  Jimmy had his doubts after talking with the bubbly airhead on the phone last night, but maybe she up to snuff after all? After all, it took some real cojones to try and weasel extra money out of Jimmy \"The Rat\" Hooch.  The only other person who had ever done that before was Jesse \"The Weasel\" Scaramonga...  <br>\r\n<br>\r\n\"But why are you giving me... oh! Oh, of course! That Josh is such a romantic, I had no idea!\"  She had thought that Josh was giong to take her out, but instead he had planned a romantic evening at home.  He'd probably be showing up any minute with flowers and a romantic movie and they could sit in the den and light candles and kiss and get married and have 2.5 children! What a dream!  <br>\r\n<br>\r\n\"An' ere's yer extra 20,\" said the larger man, shoving an extra two pizza boxes into Bess's hands.  Bess struggled to juggle the boxes without getting any grease on her nice new dress.  It wouldn't do to have Josh arrive to find her covered in pizza oil! <br>\r\n<br>\r\n\"Soooo you got yer goods,\" said Jimmy. \"You be sure we get our, capische?\"<br>\r\n<br>\r\n\"Oh, didn't Josh already pay for these?\"<br>\r\n</span></div></div>",
            "created":1332621240,
            "id":1301651,
            "title":"Bess Dresses for Success...ful Dinner Date"
        },
        "13":{
            "author_id":"drywalldryad",
            "author_name":"DrywallDryad",
            "choices":[
                "A sports injury sidelines her; shame, and she's usually so active...",
                "George pigs out in front of a dieting Bess, just to be mean.",
                "Wild card!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A slender, fit tomboy who loves working out and teasing her cousin about her weight -- make Bess happy and help pack a few pounds onto Little Miss Defined Abs here!</span></div></span></div>",
            "created":1330213140,
            "id":1284110,
            "title":"George Fayne"
        }
    },
    "info":{
        "author_id":"drywalldryad",
        "author_name":"DrywallDryad",
        "brief_description":"The Case of the Shrinking Skirts!",
        "created":1330210980,
        "description":"<td align=\"left\" class=\"norm\">This is a stuffing, overeating, and weight gain story set in the world of the Nancy Drew series.  Follow these guidelines and make your addition at least a few paragraphs, and I'll try to add chapters when I can as well!<br>\r\n<br>\r\n- Keep it grounded in reality, featuring quantities a person could conceivably eat and gradual, realistic gains.<br>\r\n- Avoid scat, vore, exploding, children (in a fetish context), non-food/drink-related inflation, character death, or excessive slobbiness.  (MILD slobbiness is fine.)<br>\r\n- Leavening the sexy bits with plot and character development is highly encouraged!  Making it more than \"she ate, then she got fatter, then she ate, then she got fatter\" is how stories stay interesting.<br>\r\n- Try your best to use good grammar, spelling, and punctuation.  I'll do my best to catch and fix mistakes (both mine and others'.)<br>\r\n<br>\r\nI'd prefer to avoid supersize/immobility or male weight gain, if possible, and probably won't add to anything heading in those directions.  Other than that, have fun, and if you enjoy this one, check out my other chapters!<br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":1850673,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1536220260,
        "modified":1536220260,
        "pretty_title":"Nancy Drew Female Stuffing / Weight Gain"
    }
}