{
    "chapters":{
        "1":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Haircut",
                "Get a gym membership",
                "Clothes shopping",
                "Piercings and tats",
                "Someplace else"
            ],
            "content":"<div class=\"\"><div> <span>It was a mundane life... not the one you had spoken about when you were younger or hoped for before time slipped away and you fell into the day to day job, bills and routines. You don’t see your old friends anymore any sometimes do things with co-workers but you don’t like your job and feel you have settled. You wish you could just try something new... be someone else for even just a brief bit...<br>\r\n<br>\r\nYou feel something break inside of you. Today is the day... you put down your pencil, clock out early and shove the glass doors of your workplace with gusto. You are going to break this rut... you are going to do something different... something you have always wanted to do...<br>\r\n<br>\r\nYou look at yourself in the reflection... you are wearing a bland outfit... have a neat parted haircut of an office worker... and a body that has lost its youthful bounce. What should you change first?</span></div></div>",
            "created":1547614800,
            "id":2603825,
            "title":"A new life awaits"
        },
        "11":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Big Al the owner",
                "Cheerful Susan the owner",
                "Clara the quiet goth looking girl",
                "The hip looking Miguel",
                "Neither... you don’t want to be here."
            ],
            "content":"<div class=\"\"><div> <span>You walk down the street and keep walking until you see a barbershop that looks between a mix of old school clippers and men’s grooming and part salon.<br>\r\n<br>\r\n“Al and Susan’s” sort of calls to you. Curious you walk in. You find a husband and wife team own the shop and offer everything from cuts, colorings and stylings.<br>\r\n<br>\r\nAl looks like a burly convict with tattoos, a shaved head, tattoos and curly mustache. His giant arms look like they might tear out hair instead of cut it. Susan however is bubbly and smiley and running around like a chicken without her head screwed on straight. She has two customers and seems to be multi tasking well enough. You also see a quiet stylist reading further in the back of the shop and a twenty-something high fade barber finishing giving a teen a stylish cut.<br>\r\n<br>\r\nWho do you choose to change your hair?</span></div></div>",
            "created":1547614800,
            "id":2603828,
            "title":"Haircut"
        },
        "111":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Punk",
                "Gym rat",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Despite Al’s tough exterior, he is very nice and clearly has experience under his belt. He asks what you want today.<br>\r\n<br>\r\n“I want a new me. I want to be transformed.”<br>\r\n<br>\r\nAll fingers his large meaty hands through your hair. “Ok, your hair is about six inches long and is over grown in the back and sides. We could go almost any direction. Any style you are thinking of?</span></div></div>",
            "created":1547614800,
            "id":2603829,
            "title":"Big Al the owner"
        },
        "1111":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Mohawk",
                "Colored liberty spikes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“I want to go punk Al.” You feel your heart jump at choosing something new.<br>\r\n<br>\r\n“I love it. I was one back in the day. We have a few directions we can go:</span></div></span></div>",
            "created":1547614800,
            "id":2603833,
            "title":"Punk"
        },
        "11111":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Black",
                "Keep it natural",
                "More wild options"
            ],
            "content":"<div class=\"\"><div> <span>You try to imagine your hair gone on everywhere but the top... you gulp and commit to the new you.<br>\r\n<br>\r\nLet’s do the Mohawk you say, seeing a crooked smile come from your lips. He turns the chair from the mirror and begins clipping the top of your hair. He sprays a water bottle and uses a comb to line up and separate unwanted hair from where your tall Mohawk will soon stand.<br>\r\n<br>\r\n“No turning back... are you sure kid?” Al asks as he turns on the clippers in front of you. You answer by simply nodding and then he gets to work. You imagine with each sweep of his clippers your hair being molded into shape. You see a mental picture of yourself with a colored mohawk and going to punk shows and just being absorbed into something new.<br>\r\n<br>\r\nHe brushes away at the clippers as they are clogged from your longer side hair. You sneak a peek to the right to see... your hair just shorter and not shaved... you were expecting more. Gently turning your eyes forward again, Al keeps working the sides little by little shortening it before getting ready to shave the sides clean of any hair.<br>\r\n<br>\r\nIt seems to take a long time and you sigh. He reaches back to grab some tools and you sneak another peek. You are stunned. You only have a streak of hair down the middle except for very short hair on the sides. You reach up from under the black drape covering you and notice the forest of hair on the ground around you. You feel your head almost not believing that this is yours. You don’t even look like yourself anymore. The mild mannered, clean look is gone and you can’t help but beam. <br>\r\n<br>\r\nAl grunts and you turn forward again. He finishes off shaving the sides and asks if you want it colored after he is done. His wife Susan can blend any color if you want.</span></div></div>",
            "created":1547625000,
            "id":2603835,
            "title":"Mohawk"
        },
        "111112":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Tip Al $20",
                "Tip Al $5",
                "No tip: you may be unemployed tomorrow."
            ],
            "content":"<div class=\"\"><div> <span>Al smiles and reaches for some gel. He begins working the product into your hair.<br>\r\n<br>\r\n“In my day we used egg whites. Some people mixed water with glue... not that I advice for that. Plenty of great things to get it to stay up.”<br>\r\n<br>\r\nYou watch in the mirror as he brings his hands together and tugs your your upward. He first makes triangle points and sprays them into place with jar spray before fanning them out and spraying again. You watch and learn how to get your hair up.<br>\r\n<br>\r\n“The back is the tricky part. A good place to start if you are doing it alone.” Al advises. <br>\r\n<br>\r\nHe finishes styling your hair and he removes the black cape. You reach up to your foreign head and smile. You look out of place with your office clothes, collared shirt that is still tucked in... the mismatch looks funny. You can’t imagine they will accept this back at the office.<br>\r\n<br>\r\nYou thank Al.</span></div></div>",
            "created":1548755940,
            "id":2609260,
            "title":"Keep it natural"
        },
        "1111121":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Clothes shopping: new pants and shoes",
                "Tattoos and piercings",
                "Head to mall and explore"
            ],
            "content":"<div class=\"\"><div> <span>Taking the $20 tip Al smiles.<br>\r\n<br>\r\n“I’m glad you like it. You know, I have something you can take with you. Follow me to the back.”<br>\r\n<br>\r\nUnsure of this... you follow Al and go to an area that has supplies and he leads to a small back office with a closet. You notice the air conditioning makes your head feel cold and become aware of the strange pulling of your hair as it towers almost six inches straight up and back.<br>\r\n<br>\r\nReaching into a closet he pulls out a vintage leather jacket with bobby pins, a mix of leather and jean material with pink logos and spikes worked into the material.<br>\r\n<br>\r\n“You were generous with me and this thing hasn’t fit me in years. One punk to another, I think you should have it.” <br>\r\n<br>\r\nYou thank him and look at the retro jacket. It is perfect... better than anything you could have bought... it is authentic... you decide as you feel your personality shift a bit: it is you. You tear off your button-up shirt and buttons are sent flying. Youn let your office shirt fall to the ground leaving you with your white under shirt. You slip on the jacket. It fits as if it was made for you. Al grunts with approval and tells you if you want to maintain the Mohawk and have the sides cleaned it will be discounted.<br>\r\n<br>\r\nYou walk out of the salon looking very different from the person who went in. Where to next?</span></div></div>",
            "created":1548756660,
            "id":2609263,
            "title":"Tip Al $20"
        },
        "111113":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Red",
                "Pink",
                "Another color"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You think of more colors to dye your mohawk.</span></div></span></div>",
            "created":1547625060,
            "id":2603836,
            "title":"More wild options"
        },
        "1111133":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Blue",
                "Platinum blonde",
                "Another color "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these colors?</span></div></span></div>",
            "created":1547625180,
            "id":2603837,
            "title":"Another color"
        },
        "11111333":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Zebra",
                "Rainbow",
                "An even different color"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You could go more exotic like:</span></div></span></div>",
            "created":1547625240,
            "id":2603838,
            "title":"Another color "
        },
        "111113333":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Orange",
                "Purple",
                "Yuma let’s try:"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hmm... how about:</span></div></span></div>",
            "created":1547625300,
            "id":2603839,
            "title":"An even different color"
        },
        "11113":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Pompadour and shaved sides",
                "Loose faux hawk",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Al continues offering options.<br>\r\n“We could also do...”</span></div></span></div>",
            "created":1547624220,
            "id":2603834,
            "title":"Other"
        },
        "1113":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Skater",
                "Emo ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You think through more options:</span></div></span></div>",
            "created":1547614800,
            "id":2603830,
            "title":"Other"
        },
        "11133":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Preppy",
                "Rapper",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You keep thinking of even more options...</span></div></span></div>",
            "created":1547614800,
            "id":2603831,
            "title":"Other"
        },
        "111333":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Surfer",
                "Rock star",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hmm... maybe:</span></div></span></div>",
            "created":1547614800,
            "id":2603832,
            "title":"Other "
        },
        "12":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Ironworks: gym for serious body builders.",
                "9th Avenue: all purpose gym with different levels of weight rooms",
                "Trainer Gainer’s athlete gym ",
                "Fletchers boxing, martial arts and simple weight room",
                "XTra MMA"
            ],
            "content":"<div class=\"\"><div> <span>You don’t like the little swell of a gut you see through your shirt... nor the extra skin under your chin... you look older than you should. You duck into a bathroom and untuck your shirt and look underneath. A flabby round tummy with stray hairs and a chest that looks like a deflated balloon greets you.<br>\r\n<br>\r\nYou had always meant to work out and build muscles but you always came up with excuses. Pulling out your phone you search for local gyms and find the ones with the best reviews. The following gym reviews seem promising:<br>\r\n<br>\r\nIronworks: gym for those serious about building muscle mass. Trainers available as are meal plans and supplement consulatation.<br>\r\n<br>\r\n9th Avenue Gym: Raquetball, pool, basic workout area, hard core weights and three types of classes including cycling, Zumba and CrossFit.<br>\r\n<br>\r\nTrainer Gainer: a gym designed around athletes and helping them excel to the next level. Complete with cool down room, league sign-ups and numerous cardio and aerobic classes.<br>\r\n<br>\r\nFletchers: weight room, shower space and boxing arena. Boxing and Martial arts classes available through our week.<br>\r\n<br>\r\nThe idea of enrolling into an MMA class also might be a good idea and you find an MMA gym called XTra MMA:<br>\r\n<br>\r\nWhere do you begin shaping the new you?</span></div></div>",
            "created":1548754500,
            "id":2609257,
            "title":"Get a gym membership"
        },
        "121":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Follow the meal plan: eat clean.",
                "Fast food and get some new gear",
                "Skip the groceries and clothes shopping: you have stuff right?"
            ],
            "content":"<div class=\"\"><div> <span>You walk into a concrete and metal entrance that almost looks like a converted warehouse. Everything looks solid and the spaces are big. You notice a large area devoted for free weights with dumbbells that you can’t imagine towing. You look at the clients and almost all look like they stepped out of muscle magazines or as if they aren’t too far from being featured there. You immediately gulp and few out of place.<br>\r\n<br>\r\nBefore you can think about walking out another near penguin walking hulk walks into the door and makes eye contact with you. You aren’t’t dressed for this place in either body or wardrobe. You are about to move to let the tanned Hercules pass when he stops and smiles at you.<br>\r\n<br>\r\n“Thinking about cutting and running? Listen, for what it’s worth, I hope you stay. We all entered this place at one point and didn’t feel like we belonged, but you can here because you want something. You should stay and give yourself a chance to find what we all found.”<br>\r\n<br>\r\nAppreciative of his kindness you decide against leaving. A muscular woman enters and smiles at the man you are standing with.<br>\r\n<br>\r\n“Are you making friends with my hubby Gary?” She beams brightly. “I’m Emma. If you are new here, we could use a new gym rat to remind us what it was like to get started.”<br>\r\n<br>\r\nYou fill out the registration paperwork aptly names paperwerk... and watch as Emma and Gary get started. More gym goers enter and a few greet you or nod your way. Somehow you expected a more elitist atmosphere, but so far it seems like maybe this was a good choice.<br>\r\n<br>\r\nRiley, the girl helping you sign up for the gym sets up a trainer to work with you and says she will start with you today, but will start off with Michael next time you come in. She documents your goal, prescribes a meal plan and you don’t think you have seen that much protein at a buffet before. You borrows a set of workout gear from one of the gym goers and you equip the extremely loose clothing. You pull the draw string as tight as possible and few as the holes in the muscle shirt sag past your shorts. Riley deposits your clothes behind the counter and you enter the gym.<br>\r\n<br>\r\nShe shows you where the machines are and what you can use for each workout day. She starts you on chest and biceps. You quiver at the weight of the bar but keep pushing though it. You felt embarrassed as she adds a five pound weight to each side and tell you to repeat the set. You comply and feel like all eyes are on you. When you sit up you see approving nods from other gym goers.<br>\r\n<br>\r\nThe workout continues and you are told to just bring back the clothes on your next visit.  You feel tired from the workouts but glad and even... energized? More than anything you are feeling hungry. You check your wallet to find that you have just enough cash to do groceries for the week to keep up with the meal plan and get the whey, creatine and piles of meat needed or you could eat cheap and fast food and than get some better clothes for the rest of the week. Foodnor gym clothes and tennis shoes?</span></div></div>",
            "created":1548919620,
            "id":2610292,
            "title":"Ironworks: gym for serious body builders."
        },
        "122":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Beginner’s gym",
                "Advanced Gym",
                "A game of Raquetball"
            ],
            "content":"<div class=\"\"><div> <span>You like the idea of classes, a pool, maybe a game if raquetbalk and especially different weight rooms by skill. You will be in the basic room to get started. You don’t even know your max weights and hope you can find someone to spot you as you get started... you may actually need a trainer.<br>\r\n<br>\r\nThe gym is polished and has a black rubber type floor. You see a smoothie station as you walk offering an array of after or pre workout drinks. You see two attached raquetball courts to the left past the smoothie station with benches for viewing games also attached to the main entry area and a path to the pool swinging to the right.<br>\r\n<br>\r\nA smiling teenage girl and a twenty-something guy stuffing towels in a hamper are at the counter. There are numerous people coming and going and you note  that the protein drinks must be tasty as many people stop to get one.<br>\r\n<br>\r\nThe girl greets you and asks you to fill out paperwork. The fee is higher than you would like, but she also gives you a t-shirt with the gym logo on it and you also see other gear like workout shorts, sneakers, swim trunks and racquets on the walk behind. You also purchase a pair of gray workout shorts and head to the locker room to change. She says that Paul will give a tour once you are changed.<br>\r\n<br>\r\nYou sit on the cool metal benches of the locker room and look around. You try not to stare as numerous people come in and change. You are trying to get an idea of how things work: where to get towels, what doors lead where so you don’t appear lost. You put your stuff into a little locker with the number 26 and hope no one takes your stuff. You will need to buy a lock.<br>\r\n<br>\r\nYou exit to the main area dressed in new tennis shoes, socks, your gray shorts and your black cotton shirt. Paul greets you and starts the tour. Where do you wish to explore more?</span></div></div>",
            "created":1548755220,
            "id":2609259,
            "title":"9th Avenue: all purpose gym with different leve..."
        },
        "1221":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Ask for clarification on training and supplements",
                "Go for it!  Get thick!!!",
                "Decline and continue the tour"
            ],
            "content":"<div class=\"\"><div> <span>Paul takes you into a brightly lit room walled with mirrors. Cardio machines line the wall to your left and guided workout machines form three lines in the middle that have pictures and tracks to guide bars and weights. Any worry about form is quickly dispelled as you see a walkthrough for each machine clearly labeled. Along the right wall is a mirror are free weights that don’t go higher than 50 pounds.<br>\r\n<br>\r\nYou see a mix of overweight and underweight people either sweating on a stair stepper, elliptical or treadmill. You aren’t  very inspired by who is in the room and almost wish you could skip this initial starter room and start hitting heavy weights with the big boys. As if reading your mind, Paul speaks up.<br>\r\n<br>\r\n“There are supplements and we could give you special training if you wanted to bulk up faster.”<br>\r\n<br>\r\n“Really? That sounds great.”<br>\r\n<br>\r\n“If you want to be a gym rat we can get you there in no time. I can start training you today if you want.”</span></div></div>",
            "created":1551737940,
            "id":2626371,
            "title":"Beginner’s gym"
        },
        "12212":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Just go with the flow",
                "Heck no!",
                "Ask about the injection"
            ],
            "content":"<div class=\"\"><div> <span>Paul leads you to the locker room and hands you a protein drink. Drink this he demands. You start gulping it down which is hard as the chocolate flavor is mixed with other ingredients you can’t figure out. Pull down your gym shorts he asks and then you see it: a syringe filled with an amber yellow liquid. </span></div></div>",
            "created":1551738180,
            "id":2626372,
            "title":"Go for it!  Get thick!!!"
        },
        "122121":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Tell Paul you want to do this naturally",
                "Keep up with his supplements."
            ],
            "content":"<div class=\"\"><div> <span>You pull down your shorts and underwear a few inches and Paul sticks you in the rear. It doesn’t hurt, but just punches and suddenly he beams at you. Finish up that shake and go to the bench in the beginner’s floor.<br>\r\n<br>\r\nYou finish up the shake and walk up confidently to the bench. You are ready to do this as you see Paul ready to spot you. <br>\r\n<br>\r\n“We are going to go heavy right away. It will be too much for you, but you are going to do four sets and I want you to push with everything you’ve got. When you think you are done... you still have two more. No exceptions, no excuses.”<br>\r\n<br>\r\nYou don’t know how much weight is on the guided bar machine thing, but it is too much for you to even lift off. Paul works the bar into your hands and you immediately lose all confidence you just had. The bar fees like it is going to crush through your chest and keep going through the floor. Your cheeks fill up with air as you strain under an impossible weight. Paul let’s the bar linger and linger as you push and push... he encourages you to keep pushing. After three guided attempts with Paul doing most of the lifting you blurt out:<br>\r\n<br>\r\n“I can’t keep going, I’m done.”<br>\r\n<br>\r\n“If you can talk, you are not done. Two more. PUSH!”<br>\r\n<br>\r\nSomehow, you push just enough to get Paul’s approval.<br>\r\n<br>\r\n“Okay, first set done, now let’s pick up the dumbbell and work out your biceps.”<br>\r\n<br>\r\nYou attempt to give him a look, but his look is even more fierce and slightly reprimanding. Your wobbly arms grab the dumbbell and he shows you how to do the set. He assists you as you don’t feel you can even get through the first set.<br>\r\n<br>\r\nThe rest of the workout feels just as miserable but somehow you start to feel energy and are able to give just a little more and more as the workout continues. Paul pats you on the back and you both head to the locker room after you finish six exercises for your chest and arms.<br>\r\n<br>\r\nHe tosses you another shake and guzzle it down greedily. He arranges to deduct an extra amount for training and a meal plan. He instructs you On what to eat and you take the meal list for the next week. He also gives you baggies of shake powder to mix for your pre and post workout shakes.<br>\r\n<br>\r\nYou leave the gym and feel pumped, excited and better then you have in a long time. When you get home and start to relax you start feeling the aches and somehow... it is enjoyable... almost addictive. You like the burn your muscles feel. You go grocery shopping and buy more chicken then you thought possiblen to consume in a month and start the eating regimen.<br>\r\n<br>\r\nYou go to the gym and Paul greets you the next day. </span></div></div>",
            "created":1551739200,
            "id":2626376,
            "title":"Just go with the flow"
        },
        "1221212":{
            "author_id":"ruckayu",
            "author_name":"Ruck",
            "choices":[
                "Talk to Paul about it",
                "Whatever, I’m getting results",
                "Enough is enough switch gyms."
            ],
            "content":"<div class=\"\"><div> <span>Days turn into weeks and you are starting to see changes. Your muscles are filling out quickly and you are starting to get admiring glances. You can’t believe you didn’t do this sooner.<br>\r\n<br>\r\nYou start hanging out more and more with Paul and he ups the dosage and by the end of your first month you are inducted into the advanced gym. You feel a swell of pride as you see your new gym mates are more along the lines of Hercules versus the pudgy Patrick the Starfish. <br>\r\n<br>\r\nThe weight is getting easier and easier and you are getting big really fast. You also notice that you get agitated more. It’s easy for things to run you the wrong way and you feel... almost angry at times.</span></div></div>",
            "created":1551740040,
            "id":2626383,
            "title":"Keep up with his supplements."
        }
    },
    "info":{
        "author_id":"ruckayu",
        "author_name":"Ruck",
        "brief_description":"Whether haircuts, clothes, workoutsor new friends, a transformation story forms a new you.",
        "created":1547622540,
        "description":"<td align=\"left\" class=\"norm\">It was a mundane life... not the one you had spoken about when you were younger or hoped for before time slipped away and you fell into the day to day job, bills and routines. You don’t see your old friends anymore any sometimes do things with co-workers but you don’t like your job and feel you have settled. You wish you could just try something new... be someone else for even just a brief bit...<br>\r\n<br>\r\nYou feel something break inside of you. Today is the day... you put down your pencil, clock out early and shove the glass doors of your workplace with gusto. You are going to break this rut... you are going to do something different... something you have always wanted to do...<br>\r\n<br>\r\nWhere do you head?</td>",
        "id":2179969,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1551740040,
        "modified":1551740040,
        "pretty_title":"The need for change..."
    }
}