{
    "chapters":{
        "1":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Continue as your mom.",
                "One of your neighbors.",
                "One of your mom's friends.",
                "Someone from school.",
                "More Options."
            ],
            "content":"<div class=\"\"><div> <span>It was just like any other day when you first discovered the Possession Gun. It was a Friday night and you were sat on your bed on your laptop doing nothing out of the ordinary for a 16-year-old boy. It was as if by magic whilst browsing YouTube, which you swore didn't have popups, that a mysterious advert appeared on the screen. \"Possession Gun\" the colorful ad said. You were about to click off when you glanced over and saw what it claimed to do. \"Take control of anybody in your life. Whether it's a crush, a celebrity, a teacher, or even a complete stranger. They're all yours to play with for £14.99\". Naturally with what it was promising you were intrigued, so you clicked on it and were taken to a website. Scrolling through there was a video of the 'Possession Gun' being used. You clicked on it and watched as a middle-aged man used the gun to shoot a girl walking down a street, when the bullet hit her she instantly froze. The man then approached her frozen body before literally stepping inside of it, a second later the girl started moving again, she headed straight up to the camera giving the thumbs up and the video ended. It was surely just special effects, but as you scrolled through the website and watched the plenty more videos available you started to believe more and more that it was real. Each one of them was of the same guy and one of them was even of him using it on Jennifer Lawrence! Whilst she walked her dogs he shot her with the gun and then quickly ran over and took over her body, then flashing a mischievous grin at the camera all the while her dogs barked manically. How could they get Jennifer Lawrence to act in that? This was the final straw and for £14.99 it was worth it, even if it was fake. So, you ordered one.<br>\r\n<br>\r\nYou were pretty surprised when, as promised, a day later the package arrived at your house. “Johnny you’ve got a parcel!” Your mom called down to you from downstairs whilst you sat playing Fortnite. You didn’t even care that you were in the top 5 instead turning off the console and charging downstairs. “What is it?” Your mom asked as you slipped onto the landing.<br>\r\n<br>\r\n“Um… Nothing. Just something off Amazon.” You lied grabbing the box out of her hand before quickly sprinting back up to your room to unbox it. Your mom just shrugged before going back into the living room to carry on watching her show. Back in your room you ripped the box open unveiling the alien looking metal gun. You unraveled the it from the bubble wrap and held it in your hands. It was made of a clean shiny metal and had a little bit of heft to it, for £14.99 it would have made a cool model regardless of whether it was fake, which you assumed it was. <br>\r\n<br>\r\nLooking back in the box you found the instructions, unfolding the paper and giving them a read. They were basic, \"Simply aim and fire.\" It said. Reading on a bit further you were disappointed to read that it was a pay to use thing, it cost £10 per use and each use lasted 12 hours, however their was a FREE first trial use which lasted 30 minutes. That's all you needed, you were eager to test if it worked. But the only person in the house was your mom, you didn’t know whether it was right using it on her, she was your mom after all.<br>\r\n<br>\r\nDeciding it was your only viable option you shrugged “Fuck it.\" And grabbed the device beginning on your way downstairs. Your mom was in the living room watching TV. Peeking around the door you spied her on the couch. “Here goes.” You said to yourself internally before slowly and stealthily raising the gun around the door steadying your aim on her and pulling the trigger. As expected from the video’s nothing left the barrel of the gun but as you peered around the door you noticed your mom had suddenly stopped moving. “Had it worked?”. Slowly you edged your way into the room, “Hi mom.” You said hesitantly, she didn't move or say anything, nearing closer you waved your hand in front of her face, her gaze didn't move fixed onto the TV without wavering. “Mom?” You asked her, but nothing. The first part had worked!  If that had worked then surely the second part would. You remembered the videos on the website and decided to finish the job you literally just needed to go into her. <br>\r\n<br>\r\nEven though your mom sat frozen like a statue on the couch you still remained nervous. Hesitantly turning around you sat down totally expecting to land on your mom's lap. But you didn’t, instead you phased right through it, looking downwards you saw your ass phased half way into your mom’s slightly pudgy belly. “No fucking way!” You couldn’t help but say amazed at what you were seeing. Excited at this you quickly laid down fully phasing more of your body deeper into your mom’s body. Then as you flung your head back onto the couch everything went black. You panicked momentarily before you were able reopened your eyes. <br>\r\n<br>\r\nSomething was different. <br>\r\n<br>\r\nYou sat up, feeling an extra weight on your chest. You glanced down only to see two large bumps pushing out from beneath a light green shirt. You realized it was your mom’s shirt, and her breasts. \"It fucking works!\" You exclaimed hearing your mom's voice leave your lips trembling with excitement. Quickly getting up you ran over to a mirror and were greeted by your mom staring back at you. \"I'm controlling mom!\" You said grinning, watching as her reflection had the same grin in the mirror. <br>\r\n<br>\r\nYou could hardly believe it, unable to help but tremble as a you realized the gun you'd bought was totally legit, eliciting an overwhelming wave of excitement to spread through your body like a tsunami. Your mom’s face practically beaming as you gazed in the mirror at her body which you were currently wearing. The sight was surreal indeed, to see somebody else staring back at you in the mirror where you normally saw your own reflection, and especially since that person was your mom.<br>\r\n<br>\r\nYou moved forward to get a closer look at her face, rubbing up and down her cheeks as you observed your stolen form. It felt like some unbelievable out of body experience, finding it practically impossible to grasp that you were in control of your mom’s body. But you were, and you could make her do whatever you wanted. You pulled a funny face, puffy out your cheeks, flaring your nostrils and raising your brow. You grabbed your nose and turned it up watching as your mom made a pig face in the mirror. You couldn’t help but giggle lightly finding yourself a little taken aback, becoming aware of her high-pitched voice leaving your lips. <br>\r\n<br>\r\n“Mrs. Wards a stupid bitch!” You cursed in a spiteful tone, giggling as you heard your mom insulting your English teacher.<br>\r\n<br>\r\nYou grabbed your head at either side finding yourself overwhelmed once again. “This is fucking amazing!” You stated a shaky excitement to your tone. Your mind overflowed with all the people you could target with the possession gun.<br>\r\n<br>\r\nYou thought of one person in particular:<br>\r\n</span></div></div>",
            "created":1546146000,
            "id":2596142,
            "title":"The Purchase"
        },
        "11":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "She returns a few minutes later acting normal.",
                "She returns a few minutes later slightly confused but still normal.",
                "Whilst you wait someone else knocks at your front door.",
                "Your dad returns home before her.",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>Your mind was racing with possibilities but for now you were your mom and you had something you wanted to do. You see a few months ago you’d had a little bit of an incident with your neighbor Latisha, basically to make a long story short, you were playing football with your friends when Sam wacked the ball, it went flying over the fence into Latisha’s garden and straight into a window. It not only broke the window but also her tortoise cage and resulted in her tortoise, Britney, escaping never to be seen again. Your mom had tried to rectify the situation by paying Latisha £300 and a bottle of wine all of which you had to pay your mom back for. What better way to do that than head to the cash machine withdraw some money from her account and give it back to her as your repayment. It was fool proof.<br>\r\n<br>\r\nYou grabbed your mom’s handbag, put on her coat and shoes and headed out of the house. Instantly you could feel the cold outside, locking the door you headed off towards the center of the small town you lived in. As you walked you couldn’t help but be aware that you were your mom. Everything felt different. First of all your perspective was lower than you were used to, being about 5 inches taller than your mom you could really feel the difference. Your short legs were forced to take more steps to cover the same distance. Then there was her long hair tickling your neck and back as it ruffled in the wind. Then with each step you could feel your body jiggling in places it never had before. You couldn’t help being overly conscious of one place especially, your mom’s breasts which jiggled up and down even from within the bra which on its own was completely strange to be wearing. Feeling this thing encapsulating your chest area, it wasn’t made any better since you could feel your mom’s hard much thicker nipples chaffing against the insides of the cups. Who knew having breasts felt so weird. Though you had to admit as much as it felt weird it also felt… kinda nice.<br>\r\n<br>\r\nYou brought your eyes down to them. As you continued to walk you watched and felt them bounce up and down. They felt quite sizable each one like a sack of jelly swinging from side to side as you walked. You’d never really noticed it but your mom had quit a large pair of breasts. You stopped momentarily, turning to face the window of one of the shops to look at your reflection. Pulling the coat to the side you pushed the shirt tight against your mom’s stomach amplifying the shape of her breasts. Turns out they weren’t big, they were huge. Your mom was veritably stacked.<br>\r\n<br>\r\nYou set back off walking thinking about how you’d not noticed this before. Perhaps it was the fact that she wore thick baggy clothes that rather than making her look busty made her look fat or maybe it was because no normal son looks at his mom in a sexual way. It was just wrong. She was your mom for Christ’s sake, you came from inside her, you sucked on the very nipples that now hung from your chest. The thought was fucked and you quickly tried to ignore it but as you walked your mind focused on nothing but your mom’s large breasts and every feeling they elicited. From their large weight pulling down on your chest, to their jello like jiggling and pendulum like sway. From the large thick rubbery nipples that capped them off brushing against the material of the bra cups, even to the tiniest tingle of the hundreds of small bumps around her areola rubbing against the bra. Like a blind man you were imagining what they looked like from what you were feeling and as much as you tried to ignore it boy in your mind did they look delicious. Slowly like a panther stalking his prey the urge to check them out crept up on you… And then pounce.<br>\r\n<br>\r\n“Ah fuck it!” You suddenly exasperated out of no where as you halted to a complete stop. A passerby in the street shot you a strange glare not that you would have noticed you were busy perusing the street for somewhere you could check out your mom’s tits. You spotted a clothing shop a few stores down and quickly set off inside seeing a set of changing rooms at the back. There were a few customers in the store and also some members of staff. You pretended to browse some aisles of clothes not wanting to look suspicious before grabbing a pink dress and heading over to the corridor of changing rooms and slipping into the one furthest at the end.<br>\r\n<br>\r\nYour mom’s reflection greeted you as you entered locking the door behind you. Though you knew it would be her you couldn’t help but feel a little taken aback again, it being absolutely wild to see someone other than you in a mirror. Whereas before you hadn’t seen her as anything, just your mom, now you couldn’t help but see her differently, finding yourself titillated as you looked at the curves and contours of her body. You took off your coat and brushed your hands down your sides appraising her form. Her hips weren’t thick, and her ass wasn’t fat, it seemed all the flesh had gone to one place in particular. <br>\r\n<br>\r\nYour eyes gravitated to her chest to where you knew her recently realized epic chest hung. You brought your hands up and cupped them feeling your hands sink into the soft cushiony flesh as you lifted them up slightly. You were touching your first pair of breasts, albeit your mom’s pair of breasts whilst you were wearing her body, but they were a pair of breasts all the same. You watched her reflection as she raised them upwards, her hands disappearing into the overabundance of flesh as she did. Looking at them now it was obvious that your mom had some insanely large tits. Tits that you now had attached to your body. You released them from your grasp watching them fall like magnificent boulders back against your torso.<br>\r\n<br>\r\nNow it was time to get them out. You shuffled on your feet slightly with excitement catching sight of your mom’s eager looking face. “Sorry mom. I just have to do this!” You said grinning mischievously. Proceeding then to grab the hem of your shirt and in one fluid motion yank it over your head revealing unceremoniously to you your mom’s boobs clad in a solid white bra. Your eyes went wide as you caught sight of the best sight you’d probably ever seen. Your mom’s boobs looking unbelievable even within such a boring looking bra. They were ginormous, pushing tightly against the fabric begging to escape and leaking from the bra wherever they could. The bra really didn’t fit her, there being jelly blobs of fatty tissue overflowing from the tops, the bottoms and the sides of the cups.  “Mom your boobs are fucking epic!” You began bouncing up and down in the changing room watching as your mom’s titty flesh jiggled around manically from angles wobbling almost like liquid as you ate in a sight you should have never seen. Your mom looked a spectacle as you forced her to jump around childishly. <br>\r\n<br>\r\nEventually you grew bored of this and decided it was time for the main event. You moved your hands up behind your back and began trying to undo the bra, fiddling at the annoying little latch trying to get it free. “Come on!” You moaned yanking and pulling at the latch but to no avail, it had defeated you. But all was not lost there was another angle of approach. With that in mind you grabbed the bottoms of the bra cups and looked at your reflection. <br>\r\n<br>\r\n“Here goes nothing.” You said as you motioned to yank up but instead of pulling off the bra to be greeted by probably the best sight of your short life you found yourself suddenly staring at a plank of wood feeling totally disoriented. You reached for your head feeling dizzy and trying to make sense of what had happened as you turned around. With a start you jolted backwards instantly making sense of the situation, standing in front of you was your half naked mom who looked to be in a worse state than you hunched over with her hand over her eyes clearly dazed and confused.<br>\r\n<br>\r\n“Shit!” You couldn’t help but gasp quietly. With a swiftness you reached for the door and quickly slipped out closing it behind you and leaving your confused mom alone in the changing room as you darted out of the store. You didn’t stop making sure you were out of sight of the entrance before stopping against a wall. “What the fuck!” You said to yourself. The device had gone and kicked you out. “Shit.” You realized the timer must have run out, remembering you only had 30 minutes in your mom.<br>\r\n<br>\r\nYou peered around the corner to see if your mom left the store but not wanting to risk bumping into her you decided to head home. Using the key from under the plant pot you went inside. The first thing you did was hide the gun in your room before heading down stairs and turning on the TV waiting for your mom to return.</span></div></div>",
            "created":1546146000,
            "id":2596148,
            "title":"Continue As Your Mom."
        },
        "111":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "You quieten down but carry on exploring.",
                "You decide to go and greet him.",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>You lay on the sofa in your living room, the TV was on, but you weren’t watching it instead finding yourself eagerly peering out the window checking every few moments to see if your mom had returned.<br>\r\n<br>\r\nAfter about 10 minutes you suddenly saw her open the gate at the bottom of your garden. You quickly poked your head back down and shuffled trying to get into a casual position to make it look like you were watching TV. Moments later she entered the front door.<br>\r\n<br>\r\n“Hello!” She called out to whoever was in the house as she normally did whenever she came home from being out. <br>\r\n<br>\r\n“Hi mom!” You called back, it being what you’d normally do. <br>\r\n<br>\r\nShe poked her head around the door. “Hi Johnny.” She said smiling. Your eyes couldn’t help but lock onto her hefty chest now tucked back inside her top, you’d been so close to getting a peak at them.<br>\r\n<br>\r\nLooking her back in her eye, as not to look weird, you slightly hesitantly asked her “Where’ve you been?” You wanted to see if she knew anything about what had happened.<br>\r\n<br>\r\n“I just popped out of the house for a bit, didn’t feel like being cooped up all day.” She said casually. “What have you been up to?”<br>\r\n<br>\r\n“Oh not much. Just chilling. Watching TV.” You lied to her.<br>\r\n<br>\r\n“Alright. Well I’m going to get started on tea, dad should be home soon.” She said and with that turned back and headed towards the kitchen.<br>\r\n<br>\r\n“Ok.” You said sounding casual, though inside you were torn. Part of you desperately wanted to finish off what you’d started but another part of you was now telling you it was totally wrong, she was your mom after all and dad would be home soon too. But then they were some insanely large boobs who cared if they were your moms and besides, she’d never know seemingly none the wiser after your last outing. Your dad wouldn’t be a problem either, he just went off to his home office anyway to continue working. Inevitably it didn’t take much longer for your horny mind to convince your rational mind that possessing mom was clearly the better option and the next thing you knew you were piling up the stairs to get the gun from under your bed. Heading back down you found your mom in the kitchen humming away to herself as she chopped some vegetables. <br>\r\n<br>\r\n“Perhaps I should let her finish cooking.” Your thought to yourself, you couldn’t exactly cook so you wouldn’t be able to finish dad’s meal. “And?” Your horny mind instantly interjected. “Your dad can cook for himself.” That was true, he often did when mom was out, you could just send him a message saying you and your mom had gone out and that he could make tea. That would kill two birds with one stone and you could just spend the evening hiding in your room with your mom’s body. “Oh yeah!” You said internally. With that decided you pulled the gun from behind your back and shot her.<br>\r\n<br>\r\nAs expected, she froze stiff. A greedy grin grew across your face as you put the gun on the side and approached her. Her statuesque form stood the chopping knife in her hand and a pleasant smile across her face as her eyes stared vacantly out the window. <br>\r\n<br>\r\nYou prodded her cheek and yet she didn’t react, she couldn’t, the instructions said she was in an unconscious state almost like she was asleep. You grabbed the knife sliding it out of her lose grip putting it on the counter. Then you grabbed your mom by the hips and pivoted her so she was facing you. Her eyes stared vacantly at your neck locking onto nothing in particular but frozen like balls of glass.<br>\r\n<br>\r\n“Nipple cripple!” You said as you reached up and pinched where you could see her nipples making little indents in her shirt. It was fun playing with her when she didn’t react.<br>\r\n<br>\r\nThough as much fun as it was your dad would be home soon and you needed to be out of sight. With that you went behind your mom and just stepped into her form. Your mom’s face sprung back to life as you took pilot of her body. Instantly your hand’s up to squeeze your tits. “Oh yeah.” Then you grabbed the veg your mom had been chopping and quickly threw it in the bin, cleaning up all the mess she’d made cooking before locking the front door and heading upstairs with the gun in hand. <br>\r\n<br>\r\nYour mom’s tits jiggled wonderfully as you leaped up each step, enjoying the feeling of their weight as you went into your room and locked the door. You threw the gun on your bed before grabbing the phone out of your mom’s pocket and firing your dad a text. “Me and Johnny have gone to town. If you’re back before us you’ll have to make your own tea.” You sent then chucking your phone on the bed and opening the wardrobe and pulling out the full body length mirror.<br>\r\n<br>\r\nOnce again you were staring at your mom’s grinning face and curvy form in the mirror. It was crazy how quick your view of her had flipped, this morning she was just your mom but now she was a hot MILF whose body you wanted to defile. <br>\r\n<br>\r\nYou really were perverted. But did you care? Not right now. Not as your hands were pulling her top off over your head presenting you with the view you’d seen not long ago. You were back where you left off but this time nothing would stop you from going further. <br>\r\nYou reached up behind your back, with more time on your hands you decided to do this properly, working your fingers at the latch, once again struggling to get the thing free. Then Suddenly you felt a ‘ping’ and you lurch forward as the bra stopped supporting your mom’s breasts and fell to the floor. Quite by accident and completely by surprise you found your staring at your mom’s naked breasts.<br>\r\n<br>\r\nYou gulped loudly as your eyes went wide at the site. They were incredible. Your mom’s boobs being undeniably humongous. Each huge sack of pale flesh hung like a large tear drop from your chest sagging slightly more than you’d expected, resting just over your mom’s ribs and just above her navel. They pancaked out as they rested on the slight pudge of her belly yet they still bulged out firm and round, the creamy white flesh looking deliciously full and fat as you feasted on their magnificence. Capping them off were two enormous dark pink nipples, each rubbery nub being about as thick as your thumb and sticking out at least an inch from her breast, they were surrounded by a teacup sized areola scattered with tiny sensitive pimples. Your mom’s breasts looked nothing like you’d imagined, they looked better! <br>\r\n<br>\r\n“Mom your tits are fucking epic!” You stated almost proud that she could have such a magnificent pair of breasts. Each sack of heavy titty flesh looking like they had been crafted by a god with your exact tastes, they were perfect. Way better than anything you’d ever seen online and none of those fake silicone breasts, your mom’s tits being completely natural home-made beauties. You could tell from the stretch marks where her pale skin had been stretched over time by gravity and the weight of these things.<br>\r\n<br>\r\nAnd now they were all yours to play with and would be for the next 12 hours. You couldn’t help yourself and like a beast unleashed your hands leaped up and began mauling your mom’s breasts. Groping and kneading at the soft plaint titty flesh, pulling and twisting at the large rubbery nipples. Your knees went weak and your brain tingled it feeling so fucking good. Like nothing you’d ever felt, it feeling way better than masturbation with your penis ever had girls clearly having it better than men. Your passion overtook you as you decided to get friskier, cupping your right breast underneath you hoisted it up, you were easily able to arch your neck over and grab the nipple between your teeth. You proceeded to suck and rub your tongue along the rough tips of your mom’s turgid nipples tasting a sweet, slightly salty tang to them. It was like you were a baby again as you watched your mom’s reflection suckling herself like a hungry baby. You couldn’t help but wonder if you could fit her other nipple in your mouth as well. Pinching that one on either side you raised it up and with the other one locked between your teeth you bit onto it.<br>\r\n<br>\r\nTo your amazement you managed to get a hold of it and now you were staring in the mirror at the insanely hot image of your mom sucking on both her hard nipples at the same time. You wanted to say “Fuck me!” But couldn’t speak with your mouth full, a lesson your mom had taught you when you were younger, now appreciating its application. <br>\r\n<br>\r\nYou sucked away at your mom’s tits for a couple of minutes before you heard the rumbling of a car from outside. You released the nipples from your teeth, your mom’s breasts slapped against your torso jiggling back to rest. Before then heading over to the window to see your dad climbing out of his car, he was back<br>\r\n</span></div></div>",
            "created":1546232400,
            "id":2596795,
            "title":"She returns a few minutes later acting normal."
        },
        "1111":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "You're natural sportiness shines through and you thrash them.",
                "You're mom's body is too off putting and you end up embarrassing yourself. (RES)",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>You watched out of your bedroom window from your mom’s body as your dad climbed out of the car. He had a stern look across his face, probably because he had to cook himself tea, boy would he be angry if he knew what you’d done to mom. Though you imagined that she would be angrier. To find out that her son had been wearing her like a suit and had seen her in a way only one man had in her entire life, that man being your dad and her high school sweetheart. She’d flip her shit, not that this bothered you, it wasn’t like she would ever find out what about what you were doing. Like they say ‘what you don’t know can’t hurt you’. Besides you’d come too far to turn back now, you planned on going all the way, your mom was no longer just your mom she was a sexy MILF and you were too curious to see her vulgar body to stop now.<br>\r\n<br>\r\nWith that said you turned back to the mirror, back to your mom’s topless form. You couldn’t help but bring your hand’s up once again to squeeze the heavy titty fat. Enjoying the feeling of the soft pliant flesh before pinching her hard nipples and pulling them outwards. You closed your eyes and let out a light moan as you basked in the pleasure for a moment then releasing them and watching the buoyant masses wobble back to rest. Your eyes then perused lower down, passed your mom’s pudgy belly and slight love handles and down to the space between her thighs. Her vagina was calling you, feeling it quiver at the thought of making an appearance. Your hand moved to rub it through the material of the jeans, it felt good but you knew it would be better to touch it directly. So fiddling furiously with the belt you undid your mom’s jeans before doing a little shimmy and watching them tumble to the ground as your tits swung from side to side. You flicked the jeans away and stared at your mom’s form, naked but for a pair a silky white panties.<br>\r\n<br>\r\nYou briefly critiqued your mom’s legs and ass. Both being no where near on a par with her tits. Her legs being short and pudgy whilst her ass, although having a little fat to it, didn’t have much shape being disappointingly rather flat. Not that it stopped you from turning around and trying your best to twerk, though finding your mom’s tits jiggling way more than your posterior. With that you turned back to look at the now empty place between your legs covered by only a white pair of panties with a dark damp spot on them which you knew you were responsible for. Beneath that thin fabric of clothing was your mom’s vagina, the very vagina you had been birthed from. The very thought made it tingle with anticipation, it was about to become the very first vagina you’d ever see, it was so taboo that it made it all the more erotic. You couldn’t wait, hooking your fingers in the waist band you prepared to pull down when suddenly.<br>\r\n<br>\r\nBEEP! BEEP!<br>\r\n <br>\r\nA car horn went off outside. You stopped what you were doing and moved over to the window. “What the heck!” It was Anita, your mom’s best friend, you recognized her car. “What’s she doing here?” You asked yourself in a panic. She climbed out the car and jogged up to the house in her tennis gear. That’s when you realized it. Your mom and Anita played tennis on a Saturday. “Shit!” You could hear Anita knocking on the door, followed by your dad’s footsteps as he went to answer it. Then there was muffled chatter before your mom’s phone started vibrating. “Shit!” You cursed again, it was your dad calling. Grabbing it you climbed into your wardrobe and closed the door to make sure they weren’t going to hear you before answering.<br>\r\n<br>\r\n“Hello!” You said jolly as your mom normally did.<br>\r\n<br>\r\n“Hi Tracy. Anita’s at our house and is wondering where you are. You’re playing tennis aren’t you?” Your dad said.<br>\r\n<br>\r\nYou didn’t know what to say but you had to respond quick. “U~Uh… Yeah we are. I’m um… Just on my way back now.” You told him then cursing internally at what you’d said as he carried on talking.<br>\r\n<br>\r\n“Ok great. Anita says be quick!” He told you. “Alright see you soon.” He finished then hanging up.<br>\r\n<br>\r\n“Shit!” You swore angrily. He now thought you were on your way home, but in fact you were already inside, what were you going to do? As you climbed out of the wardrobe you looked over to the window, it was your only option. <br>\r\n<br>\r\nTaking one last look at your mom’s breasts you began to put her clothes back on. Putting your jeans back on before picking up the bra, stuffing your mom’s breast meat back into the large cups you reached around your back and began fiddling with the bra. “Come on! Come on!” You groaned quietly as you tried and failed attach the small hooks. After a minute or so you gave up entirely deciding that you’d rather be braless than any later. So throwing the bra on your bed you grabbed your mom’s green top and threw it over your head then looking over your reflection. Your mom looked relatively normal but for her low hanging tits swooping out prominently whilst her nipples poked through the thin material like bullets. It was a rather hot sight, one that your mom would never let occur if she was in control, but she wasn’t and for now it would have to do. <br>\r\n<br>\r\nAfter quietly unlocking your bedroom door you headed over to the window forcing it open then looking out at the lattice fence attached to the wall nearby. It was your best way down and so without hesitation you clambered over the ledge and grabbed onto the fencing, swinging your body onto it you slowly and steadily climbed down. Your unrestrained breasts caught on every level of the lattice but eventually you made it to the ground. Looking around to make sure no one was watching you sneaked over to the front door like Tom Cruise in mission impossible. Once there you casually stood up straight as if nothing was amiss and entered the front door.<br>\r\n<br>\r\n“Hello!” You called out once inside, ready to play the part of your mom in front of Anita and your dad.<br>\r\n<br>\r\nAnita poked her head out of the kitchen. “Finally you’re here. Quick get ready, we need to go. Sarah and Gwen will start moaning if we’re late.” She said hastily almost pushing you upstairs. You didn’t say anything, quickly running upstairs and going first into your room to grab the gun and your mom's bra before darting over into your parents’ room straight away stripping out of your clothes. Back once again to being just in your panties you couldn’t resist having another peak at your mom’s topless form in the mirror. Your hands crept up and kneaded her tits before you remembered your rush. Turning from the mirror you searched the room for your mom’s tennis gear, pulling open drawer after drawer looking for anything that resembled tennis clothing. Eventually you found a drawer filled with sports clothing. “Jackpot!” Scuffling around inside you pulled out a pink sports top followed by a white sports skirt. You pulled on the skirt before picking up the bra and heading back to the mirror. Once again stuffing your titty flesh into the cups you reached behind your back to attempt to conquer the latch for a third time. <br>\r\n<br>\r\n“Fucks sake!” You fumed after a minute of failed attempt. “I really need to practice that!” You told yourself as you gave up again, throwing the bra onto the bed in a huff. At least you’d realized that the bra latch was your kryptonite before any real interactions with a girl, that would have been seriously embarrassing. So with your third failure you threw on the pink top, the tighter top did a better job than the lose pink shirt at holding your mom’s magnum tits but also managed to make them look 10 times larger, your mom’s thick nipples also being way more prominent, being able to make out the outline of her wide areola. You raised your shoulders, shrugging to your reflection, there was nothing you could do about it now. <br>\r\n<br>\r\nSo with that you grabbed the gun, putting it a bag you found lying on the floor of your parents room and headed downstairs your breasts bouncing around with every step. Anita was waiting at the bottom, her eyes locked straight onto your breasts doing a double take but choosing not to say anything as you said.<br>\r\n<br>\r\n“I’m ready. Lets go!”<br>\r\n<br>\r\nAnita handed you you’re racket and you headed out the door, with her following on behind. “Bye Matt!” She yelled through the house as she closed the door behind her. She unlocked the car and as you both hopped in you realized that you were going to have to sit and talk to her as if you were your mom for the next 10 minutes or so. You prepared for awkward silence.<br>\r\n<br>\r\n“So did you forget about tennis or something?” She asked as she started the engine and began reversing the car.<br>\r\n<br>\r\n“Um… No. I just got caught up doing something in town.” You told her. “So who are we versing today?” You asked her trying to change the topic, knowing that she didn’t have a clue what you had actually been doing but feeling extremely awkward lying.<br>\r\n<br>\r\n“God you really are off it today. We’re playing Sarah and Gwen. You better be on you’re ‘A’ game, these two I’ve wanted to beat these two ever since they were slagging off Henry after Gwen’s son Mac beat him.” She told you referring to her son Henry, she sounded pretty feisty and serious.<br>\r\n<br>\r\n“Really what did they say?” You asked naturally curious, never seeing this bitchy side to Anita, it was fascinating to see.<br>\r\n<br>\r\n“Oh did I not tell you? Basically…” She began telling you the story.<br>\r\n<br>\r\nAs you pulled into the tennis club you knew two things; women were a lot bitchier than you knew and this was a grudge match. Climbing out the car Anita had gotten you psyched, you clicked your neck on the left, then on the right, before setting off marching on inside ready to give these silly housewives a good spanking.</span></div></div>",
            "created":1546491600,
            "id":2598398,
            "title":"You quieten down but carry on exploring."
        },
        "11112":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "You explore your body in the shower.",
                "Henry knocks on the bedroom door.",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>A few minutes later you and Anita walked out onto the indoor tennis court where Sarah and Gwen stood waiting. “Nice of you to finally show up!” Sarah sneered condescendingly.<br>\r\n<br>\r\n“I wish we were sorry!” Anita retorted heading over to the bench next to theirs. “You ready to get beaten then?” She gave them fighting talk.<br>\r\n<br>\r\n“Like you and Tracy would be able to beat us.” Gwen laughed cockily, Sarah joined in the fake laughter seeking to get you and Anita riled.<br>\r\n<br>\r\n“Oh we’re gonna rag you!” You responded viciously. “You’ll see.” <br>\r\n<br>\r\nThey both laughed again. “Alright Tracy. Keep your bra on.” Sarah poked, “Oh wait, looks like its too late for that!” They continued to cackle obnoxiously. <br>\r\n<br>\r\n“Are you cold Tracy? You look a bit nippy.” Gwen jested getting involved with the childish puns.<br>\r\n<br>\r\n“Santa called, he wants his sacks back!” Sarah joked all the while the two carried on their incessant snorty laughter.<br>\r\n<br>\r\n“Shut up you two. Lets just play!” Anita barked back.<br>\r\n<br>\r\n“Ooh! Well at least Anita’s supporting you… more than you can say for your bra.” Gwen joked and the two high fived carrying on laughing as they walked onto the court and into position. You clenched your fists in anger as you followed Anita on court. How were these two women so irritating? You thought all middle-aged housewives were kind and motherly, well at least all your mom’s friends generally were, but these two, they were like two wicked witches and they knew just how to stir shit up and get under your skin. You felt your mom’s skin tingling with annoyance, they were so far under it that they could probably see you tucked away inside.  These two women being the most annoying people you knew imagining that not even Sam would hold up against them. But every time they insulted you they were insulting your mom and that was not ok. It was time to mess them up. You remembered back to the last time you’d played your mom at tennis, if these women played anything like her you were sure to rag them.<br>\r\n<br>\r\nWith that Anita threw the ball up in the air and served the game into action. Gwen returned it in your direction and you readied yourself to play a finished. Swing… Nothing. “Woah!” You gasped pulled forward by your swinging tits, lurching unintentionally towards the ground, totally off balance, as your legs tried their best to keep up with your body but to no avail, ending up sprinting forward a few steps before pummeling towards the ground landing square on your tits. It was the most humiliating thing to ever happen to you, and your mom, hearing Sarah and Gwen erupt into cackled laughter as you clambered back to your feet.<br>\r\n<br>\r\n“Tracy are you alright?” Anita asked helping you up.<br>\r\n<br>\r\n“Yeah she’s fine. Those airbags broke her fall!” Gwen joked and the two erupted louder into laughter. <br>\r\n<br>\r\n“Yeah I’m fine Anita.” You said rubbing a hand against your right breast which stung a little. “Fucking bitches!” You cursed. “Lets carry on.”<br>\r\n<br>\r\nWith that Anita let go of you and jogged back to her spot. She waited for to get back into position before serving again. You’d have liked to have said the game completely turned around from that point on, and like a movie you overcame and conquered those two bitches, but that was far from the truth. In fact you’d been beaten two sets to none having only won 2 games in the whole match. Anita had played excellent however you just couldn’t get used to your mom’s body and the new center of gravity that came with it, not helped by her two huge unrestrained tits swinging around uncontrollably with each step and swing of the racket. You felt extremely humiliated, even whilst hidden beneath your mom’s skin, imagining that your mom would never hear the end of it from Sarah and Gwen who had already started dishing it out.<br>\r\n<br>\r\n“Well looks like that was a bust for you too.” Gwen sneered as you quickly packed up your things to get the hell out of there. <br>\r\n<br>\r\n“Yeah you two look like a right pair of tits… Oh and you two look stupid too.” Sarah joked starting up that awful laughter again. You were half tempted to shoot them with the gun, holding the bag firmly in your hand’s but choosing to resist knowing it was a stupid idea and instead just quickly bucking ass with Anita feeling ashamed of your thrashing.<br>\r\n<br>\r\nWhen you got out into the car park you breathed a sigh of relief finally away from those god awful women and that terrible humiliation. Though as Anita hopped in the car, throwing her racket angrily in the back seat you realized she was seriously pissed off. You felt like a kid about to get bollocked and so hesitant to get in the car you slowly opened the boot and delicately placed your bags down. You pretended to rummage around in your bags for a moment, catching sight of the gun you looked up over the chairs and saw Anita’s fuming face in the rear-view mirror. At that moment you didn’t really think instead just grabbing the gun from the bag you raised it up and pointing it at the back of Anita’s head you pulled the trigger. Instantly she stopped her angered fidgeting, freezing like a statue staring vacantly out in front. Seeing that you quickly put the gun back in the bag and slammed the boot shut, before jogging around and opening the door to the seat where Anita was sitting. You took a brief glance around to make sure the coast was clear and then sat down in the driver’s seat as if Anita wasn’t even there.<br>\r\n<br>\r\nAfter a brief moment of darkness you opened your new eyes instantly raising your hands up in front of them. They were Anita’s feminine hands. You grabbed the rear-view mirror and turned it towards you to find Anita’s face staring back at you, a mischievous smile curled her lips upwards. You glanced down, her tits greeted you, the two sizeable mounds cased firmly inside a tight sports bra and top. Your hands came up to cup the hefty mounds, much smaller than your mom’s but clearly firmer. “This should be fun!” You chuckled to yourself before turning the keys in the ignition.<br>\r\n<br>\r\nThough you’d never driven a car, driving Anita’s automatic was like driving a go-kart and with the help of her Sat-Nav you managed to get safely to her suburban house. You’d been here before and knew her kids, Henry and Rosie, relatively well from a few holidays your families had been on together. It was late in the evening which meant they would both probably be in there so you needed to do your best at pretending to be Anita, not that they would be able to guess that you were actually Johnny possessing both your own mom and Anita at the same time. Knowing this you climbed out of the car, grabbed the bag with the gun from the boot and headed to the door.<br>\r\n<br>\r\nOnce inside you felt like an undercover agent in a place you weren’t supposed to be but disguised so that no one would ever know. Knowing your disguise was impenetrable you sauntered in feeling adventurous. “Hi mom!” Came a female voice from your left as you walked passed one of the doors. You stepped back and looked inside the room to see Anita’s daughter Rosie sitting watching TV.<br>\r\n<br>\r\n“Hi Rosie.” You grinned, “Whatya doing?” You asked leaning on the door frame and looking into the room.<br>\r\n<br>\r\n“Um… Just watching TV.” She said shooting you an odd glare. “Are you alright?” She asked intrigued by her mom’s slightly weird demeanor.<br>\r\n<br>\r\n“Never better!” You chirped before turning around and heading on into the kitchen. You scavenged through the cupboards and pulled out some food, all stuff that Anita would never normally touch, but tonight Anita was going to indulge. With a few packs of crisps, a pack of biscuits and a tub of ice-cream in hand you meandered up to Anita’s room, passed Henry’s room where you could hear him playing some online game. Closing the door, you threw the food on Anita’s bed before you headed over to the mirror where you were greeted by the sight of Anita staring back at you.<br>\r\n<br>\r\nIf you’d thought seeing your mom’s reflection was a strange sight, well this was a stranger one. It was a women you very rarely saw, and when you did see her you didn’t really interact with her, yet now here you were in her room, in her body, staring at her reflection. It was hot to say the least. Made hotter by the fact that Anita was such a strong independent woman yet here she was completely submissive to you. You moved in close to get a better look at her face much like you had with your mom. Her skin was smooth and soft, you rubbed a hand along your cheek and then pulled down on the skin below her eyes. It was amazing to get to peruse somebody like this. You lifted up your upper lip so that you looked like a goofy toothed rabbit enjoying the funny sight it created. As you did though you noticed something you’d not before when you were your mom. The sweet aroma of Anita’s breath crept up your nostrils. You cupped your hands over your mouth and breathed out then taking in the smell. It was such a weird and perverted thing to do yet Anita scent was amazing even after all that exercise. Taking it a bit further you raised up your arm and gave your arm pit a sniff. Anita’s feminine musk meandered up your nostrils and it was too late when you realized that her arm pits didn’t smell so good. She needed a shower.</span></div></div>",
            "created":1546578000,
            "id":2598669,
            "title":"You're mom's body is too off putting an..."
        },
        "1112":{
            "author_id":"zeylar",
            "author_name":"noname",
            "choices":[
                "Skip to evening",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Actually, this is just what I need\" you thought as you bit your lip and your vagina moistened and nipples hardened. Naughty images of your now husband flashed in your mind. You undressed and got on some black stockings, a garter belt. You put on a bra but no panties as you didn't want to struggle with the garter belt when you would inevitably take the panties off anyway. You were feeling very naughty and would not let this moment pass. Lastly you put on black high heels and a night robe your mother had hung next to the bedroom door. The robe was quite small and also black. You tied together the robe, as you wanted what was underneath to be a surprise for your husband. Like unwrapping a gift you thought. \"As long as I am like this, I should not think of us as father and son. No, I am Tracy Thompson, a 43 year old wife and mother and the man in that case is Matt Thompson, my handsome husband. You heard the front door open and with that you made your way downstairs, walking carefully not to slip on your high heels.<br>\r\n<br>\r\nMatt groaned as he had had a very rough day at work. He had bought a few groceries on the way home and would just load them into fridge and freezer before taking a power nap in the bedroom. As he was unloading the bag of groceries, he felt two hands at his hips and someone hugging him from behind. \"Had a rough day honey?\" she whispered as Matt turned around and greeted his wife with a hearty smile. \"You have no idea babe\" he answered managing to crack a smile despite the rough day. \"I got just what you need\" she said in her most seductive voice as she dismantled the robe and let it fall to the ground. There you stood clad in only stockings, a bra and garter belt. Your husband's jaw dropped as he hadn't seen his wife like this since their last anniversary. He just stood there as you unbuckled his pants, pulled down his boxers and flopped out that delicious cock. It looked way bigger from this perspective, as you had on accident seen it before in your old male body. Your hands were also smaller which made it feel way bigger than your own cock felt as Johnny.<br>\r\n<br>\r\nYou grinned as you rubbed his cock up and down while getting on your knees, preparing for the inevitable. You licked your lips and took the fat cock into your mouth. You only needed one hand on the cock, so you thought to make use of the other, as you started massaing your breast with it. The cock tasted a bit sweaty but you ignored that as you started bobbing up and down on the shaft. \"Ah fuck, you know just the spots honey\" your husband moaned, which boosted your confidence, being surprised that you had managed your first blowjob to be so good. You were already as good as your mother it seemed. With this extra confidence you went deeper and deeper, until you hit the base of his shaft, surprised that you didn't gag. Matt grabbed your head with both hands and started thrusting you harder onto his cock. You both moaned as this went on and your husband sped up the thrusting. You made some funny noises as Matt fucked your mouth. Not long after you felt the cock throb and you knew what was happening. He kept your head in place and thrusted deep into your throat as you accepted his gift and his cum splashed into your throat and you swallowed it like the dutiful wife you now are.<br>\r\n<br>\r\nYou sat there, breath taken away from the rough blowjob you'd just given your husband. But he was far from done, and you could barely react before he got you on feet, turned you around and bent you over the kitchen counter. You loved being dominated like this and just let your husband do whatever he wanted with you. He just now realized you did not wear panties and could also see how wet you were as he grinned and wasted no time in easing his cock inside. You moaned out loudly as you felt the tip enter your vagina. He continued pushing deeper and you couldn't believe how good it felt, \"Nothing can feel this good!\" you thought. He filled you up as it eventually got to a stop and you knew he was as deep as he could possibly be. He pulled out slowly but never left your pussy completely, as he rammed the cock right back in and took you by surprise. \"OOOOOH MY GOD\" you moaned as the top of your lungs as your husband started thrusting roughly, your bodies slapping together as he did so. He was so rough and you absolutely loved it. \"Mmm fuck yeah give it to me babe! Fuck me harder\" you begged, thrusting back into him to show your need. He complied as he gripped you by the hips and thrusted for all he was worth, determined to give you the fuck of your lives. \"OH oh oh OOH\" you moaned between every thrust as you were in complete bliss, you never wanted this to end. All that mattered right now was that cock sliding in and out of you. You came hard as your pussy clamped down on the dick which made your husband groan. This was enough to put him over the edge as well, as he was nearing climax. You were still in orgasm-state and didn't register anything other than something thrusting into you at this point. Matt moaned loudly as he thrusted deep inside your pussy and came once again, being so turned on that his body simply couldn't resist letting more out so soon. \"Mmmmm\" you moaned as you felt the cum shoot inside you and made a naughty grin while thinking \"I'm such a pervert\". Your husband's dick slipped out of you as you felt some cum drip out and you could just stay bent over, being completely spent and barely able to support yourself on the kitchen counter.<br>\r\n<br>\r\n\"You're such a good fuck babe. I need some rest\" Matt whispered as he went upstairs.<br>\r\n<br>\r\n\"Mmm I need to do this again\" you thought.<br>\r\n<br>\r\n<br>\r\n--------------------------------------------------<br>\r\nWhat does Johnny decide to do next?</span></div></div>",
            "created":1551157200,
            "id":2623427,
            "title":"You decide to go and greet him."
        },
        "112":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Continue Exploring",
                "Your Dad Suddenly Walks In",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>As you sat on the sofa your eyes were locked on the TV but you weren’t watching it, instead you were going over that past hour. You could take over people's bodies! It was unbelievable, the feeling of being someone else, being your mom. Everything felt new and exhilarating, you had to try it again.<br>\r\n<br>\r\nYour mind went to your mom. “Fuck!” You felt so torn. This was your own mom, surely you couldn’t do that to her. Not again, that time had just been a trial run. But it did feel amazing to be her and you couldn’t get  the image of her in just her bra out of your head. Her tits being huge, practically drooling as you thought back to the cubicle, her huge breasts overflowing from the edges of the cups which themselves looked ginormous. <br>\r\n<br>\r\n“Hello. I’m back!” You suddenly heard a voice from the entrance hallway. It was your mom! Before you could react she opened the living room door. You glanced over her body, a few minutes ago it’d been yours. It being a weird thought to process. “Where did you run off to?”.<br>\r\n<br>\r\n“Uh.” What does she mean by that? “What do you mean?” You asked her confused.<br>\r\n<br>\r\nShe shot you a motherly scowl. “Why did you run off from the store? I needed your help carrying these back. That’s the only reason I took you with me.” She turned away and gestured to something your eyes pondered a second on her breasts before noticing some shopping bags on the floor from the shop you went in.<br>\r\n<br>\r\n“Wait what?” You uttered surprised. Wait was this the gun? Covering up the fact that you possessed her by making her believe you went to the store together. But you’d never actually been there together, well only for a brief second before you hauled ass out of there. Or had she…<br>\r\n<br>\r\n“Was it the image of mommy in her bra that scared you away?” She joked as casual as ever then turning and nonchalantly walking into the kitchen. You were frozen, what did she just say? You quickly followed her into the kitchen. <br>\r\n<br>\r\n“I wasn’t per…” You began but she’d already begun speaking herself.<br>\r\n<br>\r\n“I may be old but I’m not that scary.” She turned from putting something away to you, looking down at her body before back up. “I used to make the boys swoon and now I make them run in fear.” She laughed. “Maybe I’ve just let myself go. Too much cheese probably.” Shrugging she set off past you into the hall.<br>\r\n<br>\r\n“Right I’m going for a nap so try keep the noise down for a bit.” She said before heading up stairs with her bags. As she moved out of sight your eyes went wide as you processed the conversation. Albeit talking about herself a bit strange but other than that she seemed fine, she didn’t have a clue that you’d taken over her body. The gun made had her forget.<br>\r\n<br>\r\nYou walked up the stairs and into your room deep in thought. You knew you could never settle unless you saw those tits and as much as you loved her, right now was the perfect opportunity, your mom was asleep in her room with nobody else in the house. You could just take her over this once, check out her tits for a bit and she’d wake up tomorrow morning none the wiser, like nothing even happened. You’d be satisfied and could just move on to possessing chicks that weren’t in your family. You had to do it.<br>\r\n<br>\r\n“Fuck it. Just this once” You stated to yourself as you relinquished restrained and released a wave of excitement and teenage horniness. Reaching under your bed you pulled out the magic gun. Then jumping to your feet and slowly making your way over to your mom and dad’s bedroom. Twisting the handle, you gradually opened the door. Your mom was lying on her back with her eyes closed. <br>\r\n<br>\r\nYou shivered with excitement, raising the gun up from your side you pointed it at her, this was it! With the simple twitch of your finger you shot her with the invisible beam. Her stomach stopped rising.<br>\r\n<br>\r\n“Mom?” You called out. Nothing.<br>\r\n<br>\r\nYou quickly dashed into her room and shut the door behind you. Approaching your mom's bed you stared at her frozen body half expecting her to suddenly jump up and scare you. But no, the magic of the gun had her frozen in place. How it did it you didn't know, nor did you care, the gun went against pretty much everything you knew. It was magic! Science couldn't explain this, or how you earlier today took over your mom's body as your own. There was no even need to know, why waste time trying to figure the gun out when you could be using it to take over people’s bodies. Just the prospect sent a shiver down your spine. <br>\r\n<br>\r\n\"Sorry mom. But being you earlier today was just too unbelievable to not do again.\" You stated truthfully. It wasn't that you didn't care about your mom, seeing her lying there so peaceful, you would never do anything to hurt her. But well you know... she had tits, great big ones and being her earlier felt so good. It wasn't like what you were doing was hurting her. The gun covers it up like it did earlier, so what was so bad about taking just a little peak at her boobs just this once. Your eyes moved from her face to her breasts which rested on her chest like two mountainous peaks.<br>\r\n<br>\r\n\"It’s just this once.\" You told yourself again. You couldn't resist reaching out and poking one of those big mountainous peaks. Your finger sank into the soft mound before bouncing back out. It was the first breast your hands had ever touched. \"The guys won't believe I got to second base!\". You did it again pressing a little harder this time, sinking your digit deeper into the pliant flesh looking over to your mom’s face as if to check if she was going to catch you.<br>\r\n<br>\r\nYou felt so perverted, like you were groping your mom whilst she slept. Feeling daring you hopped up on the bed and kneeled with your legs on either side of her. Grabbing her by the shoulders you yanked her up into a sitting position surprised that she didn’t flop down like a ragdoll. Instead she was stiff, like a mannequin. Intrigued you grabbed her right arm and lifted it up to her side letting it go and watching it stick in place. You gasped in amazement. It was like she a mannequin for you to pose. <br>\r\n<br>\r\nGrabbing both her arms you pointed them up in the air and went down to grab the hem of her shirt pulling it over her head and arms before throwing it to the floor. Your eyes set on your mom's bra clad boobs for the second time. You were once again blown away by the size of the solid white cups, practically looking parachutes and yet your mom’s boobs still overflowed from the sides and tops, pressing together in the middle to form a deep chasm of cleavage. You couldn’t help wonder what size they were.<br>\r\n<br>\r\nMoving behind her fiddling around at the strap for a second you found the tag… 38L!<br>\r\n<br>\r\n“No way!” You exasperated, “That’s humongous!” Caught off guard even after seeing the size of the things, even having them attached to your chest. “My god. I have to see them!” Now finding yourself all the more eager, the anticipation growing as you began fiddling with the bra. Any slight guilt you’d had about it being your mom had completely gone as you comprehended that you were about to see a pair of tits bigger than Milena Velba’s. Then as if cracking the combination to a safe the bra pinged open.<br>\r\n<br>\r\nGiggling like a giddy kid you shuffled back in front of her, the bra had clearly loosened but her raised arms were preventing it from dropping. Lowering them down you took a deep breath. With that you grabbed the shoulder straps and slipped them over her shoulders watching as the bra dropped to her lap and your mom’s tits came tumbling unceremoniously out.<br>\r\n<br>\r\nYou let out an audible gulp as you stared at your first ever pair of real-life naked breasts and being some of the biggest you’d ever seen, even online. Your mom’s tits being absolutely ginormous! Looking even bigger now they were out of the bra humping out prominently from her body each hefty sack looked to be overflowing with soft pliant boob fat, looking so heavy as they just hung there pendulously. They weren’t perfectly round or perfectly firm with various marks on the milky white skin where they’d been stretched, now sagging like two humongous tear drops to just above her slightly pudgy stomach. Capping them off in the centre were her nipples and even they were giant, two long and thick succulent looking nubs. It being wild to think that you’d spent countless hours sucking them as a baby. A wide brown areola surrounded them, each one about the size of a saucer and scattered with numerous little pimples.<br>\r\n<br>\r\nYour dick was stiff as a pole as you stared, your mom’s tits were unbelievable. “I… I can’t believe it.” You stuttered in awe, breasts this beautiful had been hidden under your roof all along. “Mom your boobs are incredible!” Your hands came up and lifted up each one feeling their weight as your hands sank into the soft flesh before letting them go and watching them jiggle nicely back to rest. Then giving her long nipples a flick, you watched them twang back. “God these are huge.” You stated placing your index finger next to her right nipple, the brown nub being just under half its length and easily thicker. Pinching both of them, giving them pull and twist impressed by how stretchy and malleable they were.<br>\r\n<br>\r\n“I wonder how that feels.” You said and with one thought and one swift movement you dived into your mom’s body. <br>\r\n<br>\r\n“Wow that was trippy!” You gasped in your mom’s voice as you opened your eyes. Maybe diving in like that wasn’t such a good entry method, feeling a bit light headed as you glanced down. Your eyes went wide as you saw your mom’s huge boobs now hanging from your chest. Wanting to see them better you jumped up off the bed feeling one of your tits just about hitting you in the chin as you bounded over to the mirror. Seeing your mom’s beaming face and topless torso reflecting back at you. It being a totally weird sight to comprehend. Not only because your mom was casually stood with her massive tits out. But because you’d, not 5 minutes ago, been talking to her down stairs and now you were wearing her body. The thought being totally wild.</span></div></div>",
            "created":1551750960,
            "id":2626472,
            "title":"She returns a few minutes later slightly confus..."
        },
        "113":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "Martha Graves, the old police woman next door",
                "Rose Martinez, the latina church lady that comes by every so often",
                "A strange suited salesman looking guy"
            ],
            "content":"<div class=\"\"><div> <span>Nothing...nothing was the thing you felt while watching the television with the cartoony characters whacking each other against the head happily till the sound affects and dialogue begins to drone in both your ears. Feeling a ball of heat welling up in your tummy while the muscles in your face contort into a aggravated scowl with both your hands shooting out to claw out at the air like a damn deranged cat. \"Fuck!? Why is there a demo, a demo with such a short time limit!\" You shout, kicking your feet about like a toddler throwing a fit till those claws retract to hover over your chest with the smooth palms of your hands motioning around above the flat canvas of your chest to mimic the sensation of running them over your mothers drooping plump tits while rocking your boney ass against the seat to mimic even just the feeling of your mothers chunky fat cheeks wobbling and jostling with her heavy steps. Even though it was just thirty minutes the experience was like nothing you've ever had before and sure as hell couldn't get out of watching some silly porno beneath the covers at night.<br>\r\n<br>\r\n\"Just when it was getting good...i-it's fucked up but mom...mom why do you have to be built better than most cam girls, Ana busts, Lorain triple G's none of them. Gah im fawning over you too!\" You growl, frustrated with the taint of the experience imprinting itself into your mind, but how could you forget really? The feeling of her sensitive orbs of tit meat jiggling and chaffing against the silken cups of her bra or the soft bulge of the jelly like things matching with the deep valley of cleavage she has leaving you to shiver with goosebumps. \"If only...if only there wasn't a dumb time limit, that pink dress might've looked good on mom. Maybe I can go back when she gets back?\" You mumble to yourself, missing the warmth of all that fat around your body even if most of it was located in your moms udders. \"Maybe try on a thong, was looking at those epic things but it felt like mom definitely has butt for days.\" You coo and curl those thin lips into a devious smile, just thinking about how those things could gobble up a pair like it's candy or even pumping and kneading her thing fingers into the mounds of flesh. \"Like a giant teddy be-Gah!?\"<br>\r\n<br>\r\nYou howl and jump from the couch, slamming those hands to your side to a heavy thud of some knuckles against the front door forcing your heart to run tracks against your ribs, \"I did nothing! Wait, why am I acting guilty I wasn't doing anything bad?\" you murmur and shake again from another hard knock on the door. whipping your head around to gaze at the amber wooded door with it's peephole and mail slot built into it's body, shuddering at the instant loss of the perverted induced high you were getting reminiscing about your mothers body. \"Uh, hold on I'll get right to ya, you jerk.\" you mumble and make your way around the couch towards the door with almost a extra lift to your feet as though you were in your mothers heels again and lacking the weight to stumble about. rising right up to your tippy toes to peer right into the peephole to see who is on the other side.</span></div></div>",
            "created":1549170000,
            "id":2612436,
            "title":"Whilst you wait someone else knocks at your fro..."
        },
        "12":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Latisha Smith",
                "Martha Graves",
                "Skylar Graves",
                "Liz Dale",
                "Somebody Else."
            ],
            "content":"<div class=\"\"><div> <span>As you stared at your mom's beaming face you thought of all the people on your street who you could use the gun on.<br>\r\n<br>\r\nThere was <b>Latisha Smith</b> you’re next door neighbor to the left and a very attractive 36 year old independent black woman with a hatred for men. She was pregnant by Donor Insemination and was due to have a baby boy in the next few months which she planned to raise as a single mother. Taking over her thick form would be very satisfying seeing as she hated your guts.<br>\r\n<br>\r\nThen there was <b>Martha Graves</b> you're next door neighbor to the right. She was in her early fourties and according to your mom was a police constable on her way to becoming a Sergeant. You'd once seen her in her police gear and had to say she looked pretty hot. You wouldn't mind hopping into her skin and going on a few front-line police operations.<br>\r\n<br>\r\nThen there was Martha's daughter, <b>Skylar Graves</b>. She was 19 years old and a very good looking girl though she would never give you the time of day. Like her mom she had a dream of becoming a police officer but for the time being worked at the local Wilko's. It might be fun to take a trip to her work in her lush body.<br>\r\n<br>\r\nThen across from you there was <b>Liz Dale</b> a 48 year old MILF who you and your friends ogled whenever you had the luxury of seeing her in the street or when she visited your mom of whom she was friends with. She was a stay at home mom with two teenage boys, Ben (14) and Alex (17), who you sometimes hung out with. When you did she always treated you kindly being a generally bubbly jolly person. Oh and you'd once had a peak at one of her bra's in the laundry, the big black thing was a 38K and you really wouldn't mind getting your hands on the fleshy orbs that go inside.  <br>\r\n</span></div></div>",
            "created":1546146000,
            "id":2596156,
            "title":"One Of Your Neighbors."
        },
        "121":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "You shoot and she freezes in place!",
                "You shoot but it doesn't work!",
                "Suddenly there's a knock at the door."
            ],
            "content":"<div class=\"\"><div> <span>As you stared at your mom’s grinning face in the mirror one person came to mind. Latisha Smith you’re super stacked next-door neighbor. She pretty much hated your guts, well she had a strange hatred for all men, but you in particular she detested. It was a sunny day back in summer when you and your friends were playing football in your garden. “Gerrard!” Sam had yelled as he went for an ambitious volley as the ball dropped from the air, he connected a little too sweetly and the ball was sent straight back into the air and over the fence to Latisha’s. The next thing you heard was a smash as the ball flew straight through a window. You thought that was the worst of it, but the ball carried on bouncing and smashed her pet tortoises cage, Britney, the fucking tortoise, quickly, or rather slowly, dashed her way to freedom escaping out the broken window never to be seen again. Later that day when Latisha got home your mom sent you over to help clean up the mess and when Latisha found out her tortoise was missing, she went absolutely ballistic. Naturally she blamed it all on you since it was your friend who did it and you were all too happy to hall ass out of their as she started shouting. Since that day football is an absolute no go and every time you’ve seen her in the street she’s given you stares of murderous daggers.<br>\r\n<br>\r\nYou could just image peering out from behind her eyes at her smug face staring back at you in the mirror whilst you wore her curvy body like a Halloween costume. The thought of having a man completely in control of her body would absolutely devastate her but to you it made the prospect all the more erotic.<br>\r\n<br>\r\nIt wouldn’t be hard to get access to her either since you were currently in your mom’s body after all your mom was a women and after the incident she’d gone over with £300 and a bottle of wine to apologize, taking all the credit for it even though you had to spend all summer working to pay her it back. Not that you cared about money any more suspecting it would be pretty easy to obtain now you had the possession gun.<br>\r\n<br>\r\nTurning from the mirror you practically beamed as you realized what you were about to do. You grabbed the gun off the sofa and put it in your mom’s handbag. With that you gave yourself one last look in the mirror before heading out the door locking it behind you. As you made the short walked to Latisha’s you passed a man finding yourself suddenly thinking far too much about the movement of your legs and arms and ending up walking like a rigid robot much like you did whenever you walked passed an attractive girl. Now you felt overtly conscious that you were currently your mom as you did. If you couldn’t act normal in front of a random stranger how could you do it in front of Latisha who actually knew your mom. You stopped at the bottom of her driveway talking yourself out of going before psyching yourself back up. “You can do it Johnny!” You stated. “Just go in and shoot her. Simple as.” With that you marched up her drive way and without hesitation rang the bell regretting it the second you heard it ring. A nervous wave washed over you, not ready to face Latisha whilst possessing your mom, but now you didn’t have a choice as not a moment later the door swung opened.<br>\r\n<br>\r\n“Hi Tracey. What are you doing here?” Latisha greeted in her husky but sassy voice. You were taken aback by the size of her, since you’d last seen her, she’d grown to almost double her size. Naturally she was a curvy woman, but the pregnancy had blown her proportions wild. The black maternity dress did absolutely nothing to hide her vulgar body and the first thing you noticed was the size of her baby bump, the large hump doming out excessively stretching the material of the dress till you could almost see her dark ebony skin through it. Then sitting on top of her pregnant belly were her breasts. Two large sacks of milk filled deliciousness practically begging to escape from the low cut dress. To say she hated men she definitely loved taunting them, you traced a vein down the overflowing flesh disappearing under the dress as it headed towards the center where you could see her clearly hard nipples poking through eager to make them selves known. Staring at her body you knew if you in your own body you’d have a bulging hard on right now being totally mesmerized by this woman which you disliked so much.<br>\r\n<br>\r\n“Tracey?” You suddenly heard Latisha say breaking you out of your trance as you realized you’d been staring at her body for the past 10 seconds. “What are you doing here?” She asked folding her hands over her chest as if slightly uncomfortable. <br>\r\n<br>\r\n“Oh… Uh… I… I just wanted to see how you were getting along. You know uh… Being pregnant and all.” You stuttered awkwardly trying your best not to look back down at her tits. <br>\r\n<br>\r\n“Oh ok. Well do you want to come in for a coffee?” She asked slightly hesitantly gesturing inside.<br>\r\n<br>\r\n“Yeah sure.” You smiled reaching slowly moving your hand towards your mom’s handbag as Latisha turned around to head back inside. You waited for her large jiggly ass to face you before quickly pulling out the gun, aiming at her and pulling the trigger waiting for her to inevitably to freeze.<br>\r\n<br>\r\nBut nothing. She carried on walking around the corner and into her kitchen. You quickly stopped and looked down at the gun. On the interface it read “NO CREDIT”. Shit! You’d forgotten to set up your payment details.<br>\r\n<br>\r\nSuddenly Latisha peered back around the corner, you whipped the gun behind your back before she could see it. “You coming?” She asked you.<br>\r\n<br>\r\n“Yeah. Just taking my shoes off.” You smiled awkwardly back. She watched you take one of your shoes off before disappearing back around the corner. You looked back at the guns screen. ‘Payment option’ you clicked. <br>\r\n<br>\r\n“Do you take sugar?” Latisha called back as you clicked PayPal.<br>\r\n<br>\r\n“Yes.” You called back trying to type in your email to the box. Suddenly Latisha shot back around the corner this time with a drink in her hand. You managed to slip the gun back in your mom’s bag.<br>\r\n<br>\r\n“Here you go then.” She said holding one up which you took from her. “Living room?” She asked.<br>\r\n<br>\r\n“Yeah sure.” You agreed then following her in cursing inwardly that you’d not set it up in time.<br>\r\n<br>\r\nShe sat down on one sofa and you sat on the other. There was an awkward silence as you both took a sip of your coffee, you didn’t really have a clue what to say. But you had to say something. “So how are you feeling?” You asked gesturing down to her pregnant belly. Just then the loud noise of a drill could be heard from next door, it was Andre your neighbor, he was building an extension on his house. Much to Latisha’s clear disgust.<br>\r\n<br>\r\n“I’d be alright if Andre wasn’t carrying drilling holes every three seconds. Stupid ogre is constantly making noise!” She grunted, then let out a deep breath. ”Urgh. I’m just tired. The little one has got me tired girl. I used to spend all day running around doing things, like tennis, and now I can hardly be bothered leaving the house. I feel like all I get up to since I went on leave is travelling from the sofa to the kitchen to get some food because girl am I hungry all the time. In the past week I have eaten about 12 tubs of ice cream.” She told you. “And there it goes again. Would you mind going into the kitchen and grabbing the ice cream from the freezer?” She suddenly asked you. This was your chance.<br>\r\n<br>\r\n“Sure thing!” You said, probably a little too eager, leaping to your feet and grabbing your mom’s handbag before scurrying out of the room. You entered the kitchen and quickly pulled the possession gun out of the bag. Tapping the screen, it turned on back at where you left off. You quickly finished typing your email before then putting in your password and pressing login.  “PAYMENT ACCEPTED” appeared on the screen. You fist pumped the air in celebration. <br>\r\n<br>\r\nNot even grabbing the ice cream from the freezer you headed back to where your victim was waiting like a sitting duck. You peered around the corner into the living room seeing her sat on the sofa. You pulled up the gun and aimed square at her head.<br>\r\n<br>\r\n-\tYou shoot and she freezes in place!<br>\r\n-\tYou shoot but It doesn’t work.<br>\r\n-\tThere’s suddenly a knock at the door.<br>\r\n-\tSomething else.<br>\r\n</span></div></div>",
            "created":1546146000,
            "id":2596158,
            "title":"Latisha Smith"
        },
        "1211":{
            "author_id":"pursuerknight",
            "author_name":"ThePursuerKnight",
            "choices":[
                "Seriously explore Latisha, Thoroughly!",
                "Do something embarrassing with her!",
                "Readers choice",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>You smiled with glee as you watched Latisha’s face shift from a neutral expression into one of both surprise &amp; confusion. That expression was what was left on her face as you pulled the guns trigger. <br>\r\nYou stared at your neighbor for a few seconds, finger still on the trigger just incase, as to make sure she was frozen. When she didn’t move, not even to breath or blinked, you fist bumped the air and let out a “Yesss~!” In response to your success. Then you walked up to Latisha’s pregnant body and idly began to examine her, you liked what you saw even with her bulging belly, she was a very attractive woman... shame you’d pissed her off so badly in the past. <br>\r\n<br>\r\n“Well the past is in the past, and oh-boy am I excited for <i>our</i> future! But first, I should drop off mom, the trail said something about 30 minuets &amp; I don’t wanna get caught mid ‘<i>exploration</i>’ of one mother by my own mother.” <br>\r\nYou said, looking down an groping you current bodies breasts gently, then you placed the gun down on top of the coffee table &amp; made your way out of Latisha’s home &amp; back into your own. <br>\r\n<br>\r\nOnce home you went back to the seat on the couch where your mom was previously sitting &amp; began planning on how to leave her. However mid way through that thought you suddenly found yourself standing in front of your mom (who was still frozen, though likely not for too long). <br>\r\nYou made a mental note on how easy escaping a body was, but you wasted no time &amp; hurried out into your backyard, once outside you rapidly ascended over the picket fence which border your houses yard &amp; Latisha’s. You dropped down from the fence before rushing back inside through the back door, &amp; you were happy to see both the gun &amp; a pregnant Latisha where you’d left them. <br>\r\n<br>\r\n“Let’s do this~!” <br>\r\nYou said with a perverse smile before you all but jumped into the thick, pregnant body of your neighbor. &amp; just like with your mom you immediately woke up to find yourself were Latisha had been left. <br>\r\n<br>\r\nYou new dainty black hands divided themselves into two teams, tits &amp; everything else, simple yet efficient! One hand found itself rubbing your newly acquired belly, admiring how different you felt, while your other hand pulled down the top of your maternity dress to expose two large black orbs concealed in a black maternity bra. <br>\r\n<br>\r\n“Oh <i>fuuuck yeaaah</i>~!” <br>\r\nYou said in your new voice, and you watched with great interests as your hand pulled one breast out and began roughly groping it, sending a tang of pain yet massive surge of pleasure through your stolen body. Your other hand took its time hiking up Latisha’s dresses skirt &amp; rubbing the quickly wetting twat which was held within a set of maternity knickers.<br>\r\n<br>\r\n“Oh yes! Johnny I’m such a bitch~! Use me like a fucking toy!” <br>\r\nYou said, pretending to be Latisha, which heavily added to your aroused state. You continued to finger, rub, &amp; grope your new body for what felt like hours... but eventually you decided to...<br>\r\n</span></div></div>",
            "created":1552598100,
            "id":2630265,
            "title":"You shoot and she freezes in place!"
        },
        "12113":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "Try out webcamming for quick cash",
                "Raid her phone, see if there is someone to join you",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You keep your eyes glued to the silky smooth orbs of chocolate tit fat engorged with the tightest of sensations welling up around the base of your fat swollen nipples trying to poke their way through the silky cups of Latisha's maternity bra acting as a last line defense of keeping her bulging tit meat from spilling out, only by just a bare thin line with how her veins poke out through her skin. \"Weeeeeell thank you for admitting that you've been a B I T C H Latisha, take a better ma-woman to admit they've been wrong...as for your offer~?\" your voice oozes out from between her warm soft lips with such a skin melting cadence from her husky voice. \"I think I'll take you up on it, there's a whooooole lotta woman to take advantage eat up...unlike that dumb tortoise of yours!\" You shout and blow some air out from between your lips to move her hair away from your line of sight to soak in more of YOUR body, from the big round tunny jutting out against the thin stressed material of what feels like a rather comfy maternity dress to just the barest of hints of red nails from your toes wiggling against the hard wood floor...just taking it all in...her hard heavy heart beat the weight of some little person in her belly to even the crinkle of her maternity panties wedged up between her fat chunky cheeks.<br>\r\n<br>\r\n\"...A-and boy where do I start hehe~? First off, how big are your damn tits boo? How are you gonna be hating on dudes when you got guys like me dying to just wobble these titties around~!\" You shout, using what strength she has to bounce up and down in place sending her tits wobbling and bounce wildly with each soft smack against her tummy that wobbled with the impact of her heels against the floor, sloshing the sweet milk around her jiggling tits with one loud smack sending them loose from the maternity bra prison. \"Gooood damn girl your like a jell-o house, just, one, more...shaaaaake~!\" You yell with one last smack from the jump sending her tits slipping out with a snap of the fabric sending the bra sliding right off your body, though not like it mattered much with the two swollen tear drop tits spreading out against your chest and resting ontop of your belly still sloshing around from the motion with her fat erect nipples hanging off the edge along the spillage of her udders.<br>\r\n<br>\r\nCupping them with your dainty hands, a gooey snicker leaves your mouth, just how big were those damn things swollen, or if you could even hoist them up at all with the over flowing flesh spilling between your fingers with such a warming vigor that the nervous beat of Latisha's heart could be felt through your tips. \"Go ahead and play with all you want Johnny boo, aint like any nasty man gonna touch them beside yooooouuu f-fuck me thats good~.\" You coo, mashing the swollen things together causing a painful sting to stir in the tips of your nips, \"Grk...then you wouldn't mind if I take a l-little nibble then huh, dumb bitch...\" You grumble, hoisting one tit up and and snapping at the rubber nipple with those sharp canines, showing her body no mercy, doubting she'd even treat her tits with the same amount of roughage as your now going by how the raw grind between her canines and the gentle lap of her tongue squirms a tingling zig zagging sensation from the nipple all the way down to her bush covered muff gushing against her panties.<br>\r\n<br>\r\n\"Mmmnnaaah~! F-fuck me haaa~!\" You shudder, her voice shivering from a guilty pleasurable act being music to your ears with a soft snap of nipple flopping out from your mouth with a loud clap of her tit smacking back onto your round gut, \"No wonder y-your so damn mood Latisha, these things sore as fuck and your nipples are sensitive than my own on track day! d-do you even milk your se-wait.\" She mumble and grin, reaching up and running her thumb into the moist gnawed nipple while tracing her nails along the warm curve of her tummy to resonate a motherly warmth in her belly, frowning and clearing out her throat, \"Of course Johnny, this milk is being saved for my baby cause no man will ever get to touch these tits beside me blegh blegh blegh...not tonight, what else is there to explore~?\" you purr, sliding those nails closer and closer to her lower tummy near the humid region between her legs that no man has gone before, \"I remember when your tits where \"smaller\" Latisha, who was the lucky dog who got you all engorged...especially this thing!\"<br>\r\n<br>\r\nYou yell out, swinging those hands back and clapping them back into her ass cheeks poking out from her lifted up dress with a thunderous wet smack of those dainty hands hitting the bare sweaty skin barely covered by her maternity panties, much like her tits her palms sinked into the plump cheeks and becomes enveloped by sweltering flesh with a heavy rock of your hips to pump your hands into em. \"was so much smaller when I saw you earlier in the year, what did you eat Latisha!? Gaaah so much things I wanna do to this ass, these tits gaaaah!\" You growl with her husky voice and even claw her nails into the cheeks, \"So much to do and only 12 hours...fuck it I know what I can do!\" You grumble and slap her cheek with enough force to push her hips out.<br>\r\n<br>\r\n\"Gngh~! Gonna do a lil victory lap, clear out the mind and get my shit in order girl....victory lap naked!\" You say, turning her plump lipped grin into that of a immature smile that spilled out the raw teenage mind in that straightened haired head of hers as you hook your thumbs under the dress wedged in the underside of her maternity dress and slowly peel it off her smooth lotioned skin like a wrapper coming off a sweet coco candy bar to reveal her smooth jutting tummy with it's near round curvature and outie belly button barely hanging into the little silver piercing hooked on it, jumping just a bit to send it and your bare tits wobbling and swinging about in a struggle of a time to not just rip the dress off the girl of your hips but the damn panties wedged up her cheeks and muff. \"C'mooooooon Latisha~! Wooooork with Johnny, c'mon guuuh...it's either the belly or the tits but im feeling winded.\" You gasps and yank down one last time with a very loud tearing coming from the waist of the dress...not that it mattered now with your skin rippling with goose bumps under her A/C's cool air touching against the now free hair muff and bare ass in the living.<br>\r\n<br>\r\n\"Yeeeeees~! first time undressing as a bad thick bitch!\" You cuss out and pump your fist in the air with a little jump up and down making your ass cheeks clap a bit and your tits smack up against your chin, \"Bad bitch cause im not latisha, nah uh I'm johnny, big boy Johnny~!\" You sing out with her voice cracking to the strange rhythm of your son, taking a nice long strut around the couch with a natural rock of her hips to guide you along and a lovely bounce to her bosom while you bob her head to a invisible tune. \"Got a dick so big it phases right through ya, ya im johnny can't think of a tune so just gonna hum, Hmm hmm hmm~!\" You hum and strut from the living room and around her kitchen to get used to the sway, snapping your fingers as the soft swollen flesh of her tits smack against the underside of your chin between the awkward heavy thump of her heels rippling the supple flesh of her gapless thighs before stopping outside the kitchen with your hands resting behind your head and a nice slow gyration of her your hips to shake her hips about. \"Gonna take out my frustrations on a bitch who likes turtles more than humans uh huh, latisha, latisha, gonna wake up covered in uh...uh?\" you stop and blink, \"Something mind blanked out~.\" you sing and strut back to the couch, dropping your ass onto the cushion with enough weight to make the wood frame creek.<br>\r\n<br>\r\nGasping out and reaching out to grab the possession gun to dangle by the handle. \"Guuuh~! All thanks to you ya pricey device mwah~!\" your say, planting those soft lips against it's cold plastic surface with a pull away to see a light print of your lipstick staining the surface and the little digital screen still thanking you for the despite as you slowly sink the barrel into the veiny engorged cleavage of your chest.\"...gonna cost me a fortune, only got like 120 in allowance left...and it's 10 bucks per shot?\" You mumble, sinking the barrel into the cleavage and pulling it out slowly. \"And I don't think mom is gonna give me more money with the excuse of me wanting to get into some fat booty...unless?\" You mumble and look over the two drooping orbs and the now more apparent cushion of a lap poking out from the view of your tummy. \"...Latisha, how about...how about you pay back that 300 dollar bottle of wine my mom got ya, with uh let say internet related webcamming~? little ass shake here, some milking there~?\" You asks, yourself with a knowing smart ass grin...  </span></div></div>",
            "created":1552636500,
            "id":2630479,
            "title":"Poke around a bit more and contemplate what to do!"
        },
        "121131":{
            "author_id":"pursuerknight",
            "author_name":"ThePursuerKnight",
            "choices":[
                "Try out Sexy, yet doesnt fit",
                "Try out proper, yet doesn’t fit",
                "Try out sexy, yet fits",
                "Try out proper, yet fits"
            ],
            "content":"<div class=\"\"><div> <span>Webcaming seemed like the better choice, as it allowed you full experience in Latisha’s thick body as well as a quick &amp; efficient way to establish a income! So now came the arguably more difficult part, setting up said source, so with a smile &amp; sigh you slowly got onto your stolen feet and began making your way through the house. <br>\r\nAnd as you did you couldn’t help but to constantly reach down &amp; grope your new fat, ebony asscheeks, occasionally you’d grab ahold of the maternity knickers waistband &amp; pull upwards, giving Latisha a deep wedgie which only served to send a mixture of pleasure &amp; discomfort through your stolen body. This made the whole trip far more enjoyable yet time consuming... but not nearly enough to deprive you of any <i>needed</i> time.<br>\r\n<br>\r\nYour search for the stairs was relatively easy, as you’d passed by it earlier inside your moms body, going up the stairs in Latisha’s heavily pregnant body... now that was a bit difficult... as you’d find yourself running out of breath every step or two. <br>\r\n“Damn... this is a fucking experience! Definitely not a good one either...” <br>\r\nyou exclaimed in your neighbors voice, finally making it up the stairs, you let out a sigh as you began searching for the bedroom. If you were gonna do anything <i>erotic</i> you had to look <i>exotic</i>! The bedroom was easy to find as the door had been left wide open, thankfully...<br>\r\n<br>\r\nSo upon entering your neighbors neatly made room you noticed two things. First, there was a desk with a fancy looking computer on it facing the bed, that’d definitely come in use soon~! Secondly, upon wobbling into the closet, you noticed that Latisha had a HUGE range of clothes to wear. From erotic &amp; kinky to right &amp; proper. She had them all...<br>\r\n<br>\r\n“Oooh I can wait to try these all on~! Or *Ahem*... I cant wait until Johnny sees me in all of these~! That’ll get me really excited...”<br>\r\nYou purr before looking through the selection of clothing you had. You noticed that some definitely wouldn’t fit you in your current pregnant state, but that could definitely be an advantage! If used correctly~!</span></div></div>",
            "created":1552680120,
            "id":2630632,
            "title":"Try out webcamming for quick cash"
        },
        "124":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Ben",
                "Alex",
                "Roger (Liz's husband)"
            ],
            "content":"<div class=\"\"><div> <span>As you thought about the possibilities the gun brought you one person came to mind, Liz Dale. She was one of your neighbors and a kind motherly figure who was good friends with your mom. She had shoulder length brown hair and a mature but tender face and well as for her actual figure, to the delight of you and your friends she was super fucking stacked. Her body clearly had an extra bit of weight to it but that was normal for a mother of her age and besides most of the weight either seemed to go straight to her tits or ass because they were both huge. Especially her tits which you couldn’t help but become infatuated with, every time you hung out with her sons’, Ben and Alex, you couldn’t resist gawking at them. She had a habit of wearing tops that showed only a hint of cleavage but that meant whenever she bent over it would unleash a delicious chasm between her fleshy pale tits. She also seemed to wear very unsupportive bra’s so that her tits bounced around like bouncy castles with every step she took. By complete accident Liz had made you an absolute slave to her body and now you had an opportunity to see it.<br>\r\n<br>\r\nWith Liz decided as your target you lay back down on the couch with your eyes closed and focused on leaving your mom’s body. Finding yourself a second later lying on top of your frozen mom, she’d be like that for about 20 minutes before the trial would wear off, hopefully dad wouldn’t get back before then.<br>\r\n<br>\r\nYou didn’t even consider the repercussion of him finding her like that before you’d tucked the gun into your waist band and left out the door marching across the street to the Dale’s house. You wasted no time knocking on the door. <br>\r\n<br>\r\nWho greeted you?</span></div></div>",
            "created":1546750800,
            "id":2599531,
            "title":"Liz Dale"
        },
        "1241":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "You pull the trigger and she freezes in place.",
                "Ben's dad suddenly appears from behind the door.",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>“Hey Johnny, what’s up?” Ben greeted you as he swung the door open his short chubby form still dressed in his pajamas. The lazy bastard. You looked over his shoulder into the house before looking back around into the street. Nobody.<br>\r\n<br>\r\n“Hey what’s that behind you?” You suddenly said pointing behind pretending something shocking was there. He turned around for a second which was all you needed. Grabbing the gun from behind your back you whipped it out in front and shot him watching as he instantly froze. Then in a split second you sprinted into his form and the next thing you were him.<br>\r\n<br>\r\nLooking down you could see his pudgy belly contained within the blue pajama top. You brought your hands up to inspect, one had the gun in, and both had chunky sausage fingers, you were definitely Ben. You hooked a finger in the front of his pajama bottoms waist band and pulled out. “Wow.” You couldn’t help but gasp, Ben was packing. Letting it go a cheeky smile spread across your face as you closed the front door before heading into the house. As you sauntered through the posh halls and into the kitchen you couldn’t help but feel excited, like you were a spy on an infiltration mission. You moved over to where you knew the living room was and looked in to see Alex playing Fortnite.<br>\r\n<br>\r\n“Alex. Where’s mom?” You asked him.<br>\r\n<br>\r\nHe finished somebody off in a build battle before turning to you. \"I think she's upstairs getting a bath.\" He told you before turning back to his game. You left him to it and turned to head upstairs. Even though you were currently in the body of somebody who was allowed in this home you creeped through it like an intruder. Slowly sneaking your way up the stairs you began to hear the tap running as the bath filled up, you peaked around the bathroom door, no sign of Liz. She was probably getting ready in her bedroom. You headed over to where you knew her bedroom was and slowly pushed open the door. There she was wearing her bathrobe looking in her wardrobe humming away happily to herself. You weren’t going to waste any time and raised the gun up, your finger twitched as you steadied yourself to pull the trigger.</span></div></div>",
            "created":1546750800,
            "id":2599717,
            "title":"Ben"
        },
        "1242":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Relax in the bath.",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>“Hey Johnny, what’s up?” Alex greeted you as he opened the door, his tall skinny form dressed as he normally did in a blue pair of jeans and casual black T-Shirt.<br>\r\n<br>\r\n“Just wandered if you wanted to hang?” You asked him casually, calling on him like this was a pretty normal occurrence.<br>\r\n<br>\r\n“Yeah sure!” He pleasantly agreed as he turned around to go back inside. “Me and Ben were just playing some…” He began, you didn’t let him finish, quickly looking over his shoulder into the house before looking back around into the street to see if anybody was around. There wasn’t anyone. So quickly grabbing the gun from behind your back you whipped it out in front and shot him watching as he instantly froze. Then in a split second you sprinted into his form and the next thing you were him.<br>\r\n<br>\r\nLooking down you felt taller, being an extra few inches of the ground than normal. You could see the clothes you’d been looking at a few moments ago, now you were wearing them. You brought your hands up to inspect, one had the gun in, but you could tell they weren’t yours, you were definitely Alex. You hooked a finger in the front of his jeans and pulled out. “Meh.” You shrugged, “Mines bigger.” Letting it go a cheeky smile spread across your face as you closed the front door before heading into the house. As you sauntered through the posh halls and into the kitchen you couldn’t help but feel excited, like you were a spy on an infiltration mission. You moved over to where you knew the living room was and looked in to see Ben playing Fortnite. <br>\r\n<br>\r\n“Ben. Where’s mom?” You asked him.<br>\r\n<br>\r\nHe finished somebody off in a build battle before turning to you. \"I dunno.\" He told you before turning back to his game. <br>\r\n<br>\r\n“Useless.” You quipped before turning to head upstairs. Even though you were currently in the body of somebody who was allowed in this home you creeped through it like an intruder. Slowly you sneaked up stairs holding the gun in your right hand like a spy on a mission. <br>\r\n<br>\r\n“What sort of game are you playing?” You suddenly heard the feminine voice of Liz as she laughed at her crazy looking son. You lurched around to see her on the landing above stood in a fluffy light blue dressing gown. You couldn’t help but notice the mountainous peaks that humped out massively and were capped off by two hard nipples poking through the material like bullets. You gulped loudly caught off guard by this ambush.<br>\r\n<br>\r\n“U~Uh… I was…” You stuttered trying but unable to come up with an excuse for you acting like some sort of spy.<br>\r\n<br>\r\n“I though Ben was the childish one.” She just laughed as she carried on walking seemingly towards the bathroom. “Well can you try to spy quietly I’m going to relax in the bath.” She stated as she grabbed the door behind her and began to pull it shut.<br>\r\n<br>\r\n“Uh… Mom!” You called out after her.<br>\r\n<br>\r\nShe poked her head back around the door. “Yes?”<br>\r\n<br>\r\nYou raised the gun up, she rolled her eyes thinking you just silly, before you pulled the trigger and she froze in place. You quickly ran towards her, only having chance to notice her eyes still frozen looking up into her head before jumping into her body. The next thing you knew you were Liz and unlike with Alex everything felt different.<br>\r\n<br>\r\nQuickly you turned back inside the bathroom and locked the door. Darting over to the mirror you saw Liz Dale staring back at you. “Oh my God!” You squeaked hearing her voice leave your lips. “I’m Liz!” You said excitement filling your new voice. You were Liz. You had her warm pretty face staring back at you. It was aged with some slight wrinkles, yet it made her look better and even with you looking out from behind her eyes her face still bubbled with that motherly tenderness that always radiated from her.<br>\r\n<br>\r\nIt didn’t take long for your attention to move from your newly acquired face however as your eyes naturally darted down to her body clad in only a bathrobe, it was yours and all you had to do to see it was undo the small piece of rope tying the middle together. Obviously you didn’t waste any time grabbing one of the loose strands and undoing the bow letting the gown drop to the side revealing to you only the space down the middle of her body. Your eyes latching onto the huge cleavage which hung down to below her ribcage before moving down to her vagina and the thick tuft of dark brown pubic hair which covered it. “Fuck me!” You said seeing this sight. You quickly shrugged the rest of the gown off and unveiled Liz’s full body in all its naked glory. <br>\r\n<br>\r\nYou gasped loudly as her huge tits came into view. “Now those are some big titties!” You gloated in her voice amazed at the sheer size of them. You’d wanted to see them for so long, the big orbs of flesh being objects of your imagination for years now, having 100% thought that you’d never actually see them and be destined to dream about them. But no, here you were seeing them in the flesh and they were everything you’d imagined and more. Liz had tits boys your age dreamed about, big round and perfectly full. Yet there was something even better about these tits, because they were real. They were extremely massive real-life tits of just a normal mom, none of this fake silicone stuff that you always saw online. No Each pillowy sack of flesh was real, filled with natural titty fat to a size bigger than her head and bulging out massively from her chest. The sheer size of the things had made them sag lower than they would have when Liz was younger. The skin tasked with holding these behemoths up had been stretched so that the two huge masses hung like two teardrops hanging down to her rib cage. As you traversed the huge mountains of flesh with your eyes you found them gravitating towards the centre point where two huge dark pink nipples stood poking out prominently from each breast like flags to mark the summits of each peak, each one surrounded by a thick layer of pink areola. You felt like you’d just made the discovery of a lifetime, having just unveiled a new wonder of the world. “These should be in a museum!” You joked to yourself as your hands decided to come up and get involved in the action. Sinking your fingers into the two spherical masses feeling their heavy weight as they over flowed from your palms. You watched Liz in the mirror as she groped, kneaded and mauled at her tits enjoying the private show she was unknowingly giving you. You moved from the soft pliant flesh to the rugged hardness of her large rubbery nipples pinching them between your fingers and beginning to twist and pull at the pleasurable nubs. Your knees weakened and your whole body tingled as you went to town on your tits. You felt something building inside of you, it felt amazing, slowly rising more and more, coming to a peak and… “Oh yeah!” You gasped breathily as your body began to spasm, your muscles clenched and your hips bucked, a blissful tingle spread throughout your whole body as you exploded inside. You let out an uncontrollable scream in Liz's voice as you dropped down grasping onto the sink for support. <br>\r\n<br>\r\nYou'd just orgasmed! That was your first ever female orgasm from just Liz’s tits and it was fucking epic! <br>\r\n<br>\r\nYou slowly push yourself back up to a standing, feeling your numb limbs struggling to support your weight. You managed though to get back up and looked in the mirror to see Liz’s face once again, she was smirking pleasantly, a satisfaction as a bead of sweat dripped down her forehead. As you basked in the afterglow your eyes arched downward past your tits and to your nether region. You moved in closer to get a better look, thrusting out your hips as you did. Hiding shyly behind a thick bush of pubic hair you could see the soft pink folds of Liz’s vagina. You brushed your hand through some of the hair and guided out of the way getting a better view of the crinkled feathery folds which glistened out in the open. You used your other hand to grab one feeling a tingly jolt of pleasure as you did. Using your other hand you grabbed the other and pulled apart opening up to you the shiny wet walls of the inside of Liz’s vagina. It was a surreal sight indeed, seeing Liz’s kind face staring down eagerly at her own vagina, it was a sight you should have never seen, heck it was a sight Liz had probably never seen. Yet here you were staring at your very first vagina and it looked unbelievable. Slowly you took a finger and slipped it into the deep hole watching it disappear as it brushed against the walls deeper inside. Each movement elicited a small jolt of pleasure and so you slowly began to pump in and out each time brushing harder against the top side and feeling the pleasure resonate throughout your whole body. You neck arched back and your free hand grabbed your tits, mauling them as you went to town on Liz’s body. “Oh” You couldn’t help but moan, this pleasure was on a whole other level, way better than masturbating as a boy and it didn’t take long before that same feeling began building up inside your loins.<br>\r\n<br>\r\nAbout 30 seconds of masturbating later and it reached its peaked and with a loud moan you erupted into a spasm of all-consuming pleasure. This time you couldn’t stay up and you flopped down onto the floor in a heap of sweaty tingles. You stayed laid there for a few minutes basking in that wonderful afterglow your whole body feeling numb and loose, like nothing you’d ever felt before. Eventually you managed to convince yourself to move and climbed to your feet catching sight of Liz in the reflection. She looked so disheveled, nothing like she normally did, all prim, proper and well kept, no right now her hair was messed, sweat was glistening over her body whilst juices dripped from her vagina, she looked like a horny slut and you very much enjoyed the sight.<br>\r\n</span></div></div>",
            "created":1546750800,
            "id":2599773,
            "title":"Alex"
        },
        "12421":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "The truth",
                "A slight twisting of the truth.",
                "A lie. Agreeing with Sam."
            ],
            "content":"<div class=\"\"><div> <span>You glanced away from Liz’s disheveled reflection over at the bath, hot steam resonating from the water inviting you to get in. It would be a nice way to let your body recover after that vigorous masturbation so without much further thought you stepped into the tub and lowered yourself down feeling the hot water enveloping your jiggly body. “Oh yeah!” You were in heaven right now, relaxing your body in the soapy water as your numb tingling muscles recovered back to normal. For a few minutes you just lay there, with your eyes closed, basking in the pleasure that resonated through Liz’s body without a care in the world.<br>\r\n<br>\r\nYour mind began to wonder, imagining all the possibilities for fun you had with Liz’s body at your disposal thinking it would be fun to toy with Alex and Ben... “Oh Shit!” You suddenly remembered something. You were already possessing Alex, you’d completely forgotten. He was underneath his mom’s skin, essentially he was possessing his own mom. You laughed at the thought. “What a pervert.” You joked looking down at Liz’s body, her breasts swaying like buoys in the water. If she was your mom you probably wouldn’t have been able to resist either, lucky for you, unlike Liz, your mom was just short and fat so you’d never have that dilemma. <br>\r\n<br>\r\nYour hands came up and pinched the large rubbery nubs which poked above the surface of the water, giving them a quick pull and twist before letting them snap back into position sending the floating titty flesh rippling like waves in the ocean. You couldn’t get over how big her tits were or that you’d actually seen them, heck you were currently bathing with them. The very orbs of flesh that you’d made wishes to see were now attached to your chest, they were yours. As was the rest of Liz’s body, the prospect was absolutely mind blowing. Looking at over her floating tits at the kingdom, which was Liz’s body, that you now controlled. All of it was yours from the hairy bush that covered her vagina down her smooth legs to the tips of her small toes and back up to her thin nose which you could see sat between your eyes. You couldn’t help but rub your hands around your body feeling more and more of the body which you now owned a strange feeling power and excitement washing over you as you did.<br>\r\n<br>\r\nUnsurprisingly this lead your hand’s back to your tits and vagina and before you knew it your were pumping away again, rocking up and down in the bath, water splashing everywhere as pleasure resonated through your body. You brought a tit up to your mouth and began nibbling at the nipple between your teeth. That same feeling of intense pleasure was rocking your insides again and you could feel it slowly building and building until it overwhelmed you. “Oh fuck yeah!” You gasped as your hips thrust into the air and your muscles tensed up as you exploded into your third orgasm. You dropped back down into the bath with a splash completely uncaring of any mess you’d made your mind only aware of the blissful pleasure which resonated throughout your whole body. You couldn’t believe how pleasurable Liz’s body was.<br>\r\n<br>\r\nFor a few minutes you just laid there, basking in the afterglow before deciding to get out of the bath. So grabbing onto the sides you climbed out of the bath catching another look at Liz’s meaty body in the mirror before reaching down for her gown which you quickly donned. You nonchalantly tied the string in the middle, leaving it pretty loose and leaving a good chunk of Liz’s body on display before, still dripping wet, heading off towards her bedroom. <br>\r\n<br>\r\nLiz’s room had always been off limits to you so opening the door you found yourself surprised at the sheer size of it. The room being practically three times as big as yours and every inch of it completely spotless. Not that this surprised you Liz being an absolute neat freak, but not anymore. “Won’t be needing this.” You quipped undoing the strap and dropping the gown to the floor. You looked around the room for a moment before heading over to a chest of drawers to the side of the huge king size bed that lay square in the middle.<br>\r\n<br>\r\nPulling open the top drawer you found it stacked full to the brim with bra’s, staring at an overabundance of huge parachute like cups. You scuffled around inside for a moment before pulling one out you held it up in front of you. It was a lacey white one and absolutely ginormous, the cups practically covering your whole view. <br>\r\n<br>\r\nIt could have been the one you’d sneaked a peak at in the laundry room a few months ago, that one being a lacey white one as well, back then you’d trembled as you picked it up, being so excited to just get a glimpse at it and at how big it was, imagining the huge fleshy tits that it housed inside. Now you had those huge fleshy tits hanging from your chest. You brought the bra down and placed the cups around your tits, they fit snuggly, if not a little tightly. Grabbing onto the straps you brought them behind your back and tried clipping the little latches. After a few tries they attached and you let go of the bra, it stayed up supporting your tits feeling a slight weight off your back. You grabbed a matching pair of white pants and threw them on.<br>\r\n<br>\r\nMoving over to the mirror you caught sight of Liz in her underwear. Surprisingly it was hot to see her like this. The underwear looked modest, yet her body couldn’t help but ooze a certain sexual vulgarity, every part of Liz’s mature curvy body looked so deliciously meaty. From her wide motherly hips to her large breasts overflowing slightly from the cups of the bra, then down to her fleshy thighs which looked toned yet jiggly. <br>\r\n<br>\r\nYou couldn’t help once again see that Liz was fucking hot! Not that you didn’t already know it, though you wondered whether she did. She never wore anything to remotely enhance her body sexually, not even make up, her face normally being much like it was now, completely natural but for a bit of base layering. Then her clothes always pretty much covered her whole body but, sometimes, for a slight hint of her mighty cleavage. Yet you knew she could drive men wild with her body. It was a shame really that such a work of art was never put on display. Though now you could change that.<br>\r\n<br>\r\nWith that you thought about leaving her body, feeling a slight tingling feeling before suddenly detaching from Liz and stepping out of her body. Seeing this unfold in front of you as Alex appeared out of his mom’s half naked body. Doing the same again you stepped out of Alex’s body and were back to being yourself stood next to two frozen husk that were actually your neighbors. It was kind of like Russian dolls you mused to yourself before pulling your phone from your pocket, it having entered the body of Alex and then Liz when you’d possessed them, this was the only way to gain access to it. With that you chucked it on the bed before stepping back into Alex followed then by Liz.<br>\r\n<br>\r\nBack in control of her curvy body you wasted no time unclasping her bra and kicking off her panties finding yourself once again staring at her naked body in awe. “The boys are gonna fucking love this!” You beamed as you reached over and grabbed your phone, poking in your password and opening the camera app. You pointed the camera at your reflection and pulled a few poses, finding one you were happy with before taking a photo making sure not to get Liz’s face in the picture. You clicked share and selected your group chat before sending the photo. “Contender for number 1 best tits?” You said. You and your friends having a top 10 list for the best tits you could find, this alone being clear evidence that you were all veritable virgin perverts. The top three spots currently went; Milena Selba, then Nadine Hansen, then Maserati. These were three very big boobed adult models you’d found online who’d held the top spot for months. Though you knew Liz’s behemoths could definitely steal one of those spots.<br>\r\n<br>\r\nIt literally took a second before James had responded. “Whose that?!” He asked seemingly intrigued.<br>\r\n<br>\r\n“Just some MILF I found.” You typed back.<br>\r\n<br>\r\n“Her tits are fucking epic!” Sam responded clearly impressed, his shared passion for big tits evident.<br>\r\n<br>\r\n“They’re pretty nice!” Travis piped into the conversation. <br>\r\n<br>\r\nYou snapped another photo, this time turning to the side and thrusting out your chest. “They’re fucking massive!” You sent it with a message.<br>\r\n<br>\r\n“They are fucking impressive I’ve got to say.” James agreed with your joint awe. Then Sam sent a message that made your stomach drop as you read it.<br>\r\n<br>\r\n“Wait! Is that your house in the background?!” He asked. Your eyes went wide with shock at how he’d spotted that. How had you failed to notice that in the background? Shit! You internally cursed.<br>\r\n<br>\r\n“Isn’t that where Alex and Ben live?” Sam continued deducing having hung out with them a few times. Then after a few moments pause throwing the final blow. “Shit! Is that their mom?!”<br>\r\n<br>\r\nYou put your hands on your head in shock and confusion. How was Sam so perceptive, he was like a detective. Showing you even further his perverted skills as he continued. “It is as well! It’s Liz Dale!” He sent and following it he sent a photo of her from Facebook, then he resent one of the photos you’d sent. “Look! She’s wearing the same ring, and the same wrist band!” He said.<br>\r\n<br>\r\nWhat the fuck! He was like Sherlock Holmes. Managing to decipher your whole ruse in a matter of seconds. The chat blew up as they realized the tits belonged to somebody they knew.<br>\r\n<br>\r\n“No way!” Travis said.<br>\r\n<br>\r\n“Fuck me! How did you get those photos Johnny?!” James asked.<br>\r\n<br>\r\n“This is mad! Did you use that WiFi hack I told you about? You managed to pull it off?” Sam asked. He’d been showing you some hacking method he’d been trying to pull off last week, he’d asked to use your WiFi to do it but you’d not let him.<br>\r\n<br>\r\nYou dropped down on the bed, your mind racing, you didn’t know how to respond. Eventually you told them…</span></div></div>",
            "created":1547096400,
            "id":2601762,
            "title":"Relax in the bath."
        },
        "12422":{
            "author_id":"blobber",
            "author_name":"Blobber",
            "choices":[
                "You see Roger has the gun and make a play for it.",
                "Get out of there!"
            ],
            "content":"<div class=\"\"><div> <span>“I think we need a bath.” You said to your sweaty reflection raising up your arm and taking a whiff of Liz’s arm pit. “Woowee. Yeah definitely.”<br>\r\n<br>\r\nWith that you hopped on into the hot water. Taking a deep breath you stretched your arms back and thrust out your chest really hitting the spot stretching out your older stiffer body. Letting out a satisfied moan you settled down but bringing your arms back forward they caught upon something resting on the counter besides the bath. You only had a split second to see what the object was as it fell into the bath. <br>\r\n<br>\r\n“The gu…” You exasperated but not before a bolt of electricity surged through your body causing everything to fade into darkness.<br>\r\n<br>\r\n-------------<br>\r\n<br>\r\nAs you regained your consciousness your head felt heavy, and you couldn’t help but be confused as to where you were. Not that you were complaining feeling warm and cozy where you were, the surface where you lay being cushiony and soft, eliciting a relaxing heat. With your head still spinning and confused you just lay there slowly drifting off to sleep.<br>\r\n<br>\r\n“What in the earth! I best be dreaming or you are in big trouble young man” A voice suddenly erupted instantly sending you into an alert state as your eyes opened wide as they noticed where you were. Finding yourself laying atop Liz’s curvy body. The memories flooded back into your brain as you recalled possessing her body, though you weren’t her any longer.<br>\r\n<br>\r\n“Were you fucking spying on me?” Liz shouted, using a swear word which you’d never heard her use before. Her face was red with rage, she was pissed. To her it looked like you’d come in to spy on her, that actually being much better than her knowing that you’d been wearing her body. But still you were in for a royal bollocking. <br>\r\n<br>\r\n“No! No I wasn’t.” You pleaded quickly jumping off of her and out the bath.<br>\r\n<br>\r\n“Well what on earth else could you have been doing you perverted little boy!” She berated you trying her best to cover up her body but there simply being too much jiggly flesh to control. “Get out! Get out now. You are in for it young man!”<br>\r\n<br>\r\nShe pointed towards the door, just then you spotted the gun float into view at the other end of the bath. It was your way out. Quickly leaping forward you grabbed it, standing back and pointing it towards her. “What are you doing? What is that?” Liz asked angrily.<br>\r\n<br>\r\nNot wasting any time answering you pulled the trigger expecting her to freeze but instead a few sparks came from the gun as your whole body seized up and you fell backwards onto the floor like a stiff plank of wood. Dropping into unconsciousness as your head hit against the tiled floor.<br>\r\n<br>\r\n-------------<br>\r\n<br>\r\nWhen you awoke you were still on the bathroom floor. You quickly looked up to the bathtub. Liz wasn’t there. She must have gone to get Roger and the two were probably discussing what terrible punishment they were going to give you.<br>\r\n<br>\r\n“Shit!” You said to yourself quickly climbing to your feet. You had to get out of there. Running out the bathroom you were on hyper alert looking out for anybody as you silently descended the stairs. Tiptoeing across the landing you rounded the corner to the kitchen where the back door exit was. However when you looked into the room you spotted Liz pacing up and down in her dressing gown, nearby was Roger looking sternly over towards Alex who sat on the couch holding his head in the hands was.<br>\r\n<br>\r\n“Alex you do know what you’ve done is a very serious matter. What on earth were you thinking? Spying on your own mother!” Roger shouted at the confused and terrified looking boy. It was at that moment that you remembered you’d been wearing Alex when you’d possessed Liz. So when the gun malfunctioned and kicked you out of your bodies it kicked you out of Liz first, and then Alex. So Roger and Liz thought Alex was the one perving on his own mom. You couldn’t help but pump a fist into the air as you realized you were saved from definite humiliation.<br>\r\n</span></div></div>",
            "created":1555003740,
            "id":2643562,
            "title":"Something Else."
        },
        "124221":{
            "author_id":"blobber",
            "author_name":"Blobber",
            "choices":[
                "Head back to Liz's house.",
                "Go somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>“And what is this thing?” Roger, Liz’s Husband, asked. Raising your attention as he raised the gun up in the air.<br>\r\n<br>\r\n“Shit!” You cursed to yourself, you needed to get the gun back.<br>\r\n<br>\r\n“I don’t know what it is.” Alex managed to say meekly, in between snuffles, the unlucky kid crying at his predicament. You sensed an opportunity to get it back and taking it jumped out from around the corner.<br>\r\n<br>\r\n“That’s mine. I’ve been looking for that all over.” You said trying to act casual, hopefully they’d buy that it was just some toy you’d lost. That was if they listened to you, Roger continuing to berate Alex.<br>\r\n<br>\r\n“You better not be bringing in some sort of weapon into this house!” He said sternly.<br>\r\n<br>\r\n“No its just a toy.” You said stepping well into the kitchen. Again they didn’t acknowledge you. “Hello!” You said trying to get their attention.<br>\r\n<br>\r\n“Well you tried to shoot me with it!” Liz suddenly piped in, stepping forward and grabbing the gun from Roger. “What does it do? How do you like having it pointed in your face?” She said angrily pointing it towards Alex, her finger hovering over the trigger.<br>\r\n<br>\r\n“No don’t do that!” You called out jumping forward and reaching for the gun, grabbing Liz’s shoulder to turn her away from Alex and stop her from turning him into a suit. Only as soon as your hand hit her you jolted and for a second everything went black. A moment later you were in a different position, your hand now holding the gun as you aimed it at Alex. “What the…” You gasped quietly.<br>\r\n<br>\r\n“What is it Liz?” Roger asked, turning to you worried. Your eyes went wide as you heard what he called you.<br>\r\n<br>\r\n“Uh. Uh. Nothing.” You stuttered. “G~give me a second.” You quickly turned and made your way out of the kitchen bounding up the stairs and into the bathroom and in front of the mirror. “Liz!” You blurted out seeing your neighbors mature feminine face once again staring back at you in the mirror. <br>\r\n<br>\r\n“But how?” You’d not shot her with the gun, and she’d been totally conscious and moving when you’d possessed her, not frozen like the gun had made her before. Liz’s face dropped into a look of thought as you tried to figure out what was going on. It had to have something to do with the gun falling in the bath, had it made the gun malfunction? You didn’t want to pull the trigger to find out, remembering the last time you had, the thing practically knocking you into the spirit realm. <br>\r\n<br>\r\n“Wait!” You suddenly had a realization, remembering that no one had seen you when you’d been down stairs. “No. Surely not.” You stated doubtful of what you were currently thinking. “Well I guess there’s only one way to find out.”<br>\r\n<br>\r\nWith that you thought about leaving Liz’s body and in a moment later you were standing behind her. She was instantly conscious, looking a little dazed, shaking her head in confusion to how she’d gotten there. You took a moment to look down at your body. Or more lack thereof. You gasped, it couldn’t be. Liz walked off without acknowledging you, leaving the bathroom and closing the door. You looked up to the mirror. Nothing.<br>\r\n<br>\r\n“No way!” You were actually a spirit. The gun had somehow malfunctioned when it fell in the water. When you’d used it instead of turning Liz into a possessable suit it had turned you into a spirit. It was fucked, and you had no idea why. But you didn’t care. “This is epic!” You exasperated, your current predicament being way better than the gun. You were invisible and could still possess people without even having to freeze them for twelve hours.<br>\r\n<br>\r\nQuickly you went after Liz. Grabbing the handle to open the door you expected to pull it open but instead found yourself falling through the seemingly non-existent door. “No!” Now at the other side of the door. Turning around you reached out watching as your hand phased right through it. You poked your head back through peering through the closed door into the bathroom. “Epic!” You realized if you could go through walls then surely… <br>\r\n<br>\r\nSuddenly, with just a thought, you dropped through the floor. But you didn’t land on the floor below, instead you were now floating in the air. You were a proper ghost, you could fly, and somehow you just knew how to control it. Sending yourself hurtling through the building and up into the air flying out the top of the house. “This is amazing!” You said to yourself in sheer amazement as you flew higher into the sky over the other houses on your street. You flew across to the park, looking from high above at the many people who were there.<br>\r\n<br>\r\nSpotting a female jogger running by you swooped down and into her back. Instantly you had a body again. You carried on running, copping a feel of her breasts and letting out a joyous “Woooo!” which elicited some odd stares from the other park goers. Before then phasing out of her body and launching back into the air.<br>\r\n</span></div></div>",
            "created":1555006320,
            "id":2643587,
            "title":"You see Roger has the gun and make a play for it."
        },
        "1242211":{
            "author_id":"blobber",
            "author_name":"Blobber",
            "choices":[
                "Roger walks in.",
                "Your own body walks in."
            ],
            "content":"<div class=\"\"><div> <span>You watched from the sky as the jogger, without slowing her stride, shook her head in slight confusion before jogging into the distance. <br>\r\n<br>\r\nYou could hardly believe the power you now had. Your life having gone from totally average to totally awesome then to totally unbelievably awesome in the space of a day. The gun being the best purchase you ever made. Which reminded you, you probably should go get it. You didn’t want somebody breaking it, or even maybe even using it and getting the powers you now had, no this was all for you. At least for now.<br>\r\n<br>\r\nSo with a rapid acceleration you sped off back towards the Dale’s house, making it there in record time. You swooped right on in, phasing through the houses walls passing a sulking Alex crying in his room and then dropping into the kitchen where Liz and Roger were sat quietly, Roger reading the paper whilst Liz sat eating a sandwich and playing on her phone. They were clueless to your presence as you hovered in front of them. Nearby on a counter you spotted the gun.<br>\r\n<br>\r\nWasting no time you flew into Liz’s chest and instantly took control of her body. Straight away you could feel her extra jiggly parts unrestrained still only covered by a thick fluffy dressing gown.<br>\r\n<br>\r\nYou took a moment to cram the sandwich she’d been eating into your mouth before hopping to your feet enjoying the feeling of Liz’s huge tits bouncing up with you before dropping back against her chest with a slap. You grabbed the gun and began to leave the house only stopping when you realized Roger was looking at you, questioning whether you were about to go outside in just a dressing gown. Doing a quick 180 you decided to head upstairs to get dressed, beside you quite fancied checking out Liz’s curvy body again.<br>\r\n<br>\r\nYou bounded up the stairs passing Alex’s room. Hearing him snuffling away a mischievous idea came to mind. You stopped, placing the gun on a side counter, then pulling one of the ties loose on your gown before heading inside.<br>\r\n<br>\r\nStepping into the messy room Alex looked up, though his eyes not making it passed your mid-section. Bouncing erratically between your huge cleavage and hairy pussy which was on display between the loose cloth of the dressing gown. You closed the door behind you before speaking.<br>\r\n<br>\r\n“I just came in to say we didn’t mean to go so hard on you.” You began in a mock motherly tone, his eyes finally dragging themselves up to your face though stretched wide as Alex tried his best not to look down. You moved in close and sat down on the bed next to him. “I understand you’re a young boy with needs but I’m your mother ok. Its not alright to spy on me.” You said giving him a concerned motherly look. “However. I know earlier in the bathroom is only going to leave you wanting more. And if we’re going to get past this I need you to be done with this fantasy. So…” You stood up from the bed and turned to face him. “I hope this will sate your appetite.”<br>\r\n<br>\r\nGrabbing each side of the gown you pulled it over your shoulders and let it drop to the floor. Alex flinched back, his face a mix of shock, fear and amazement as, from his perspective, his mom revealed her body for him to see.<br>\r\n<br>\r\nYou stood there silently as his eyes devoured every inch of your stolen body. For 30 seconds you just let him stare.<br>\r\n<br>\r\n“Well. What do you think?” You asked him intrigued.<br>\r\n<br>\r\nHe looked back up to your eyes for the first time in a while, his face looked worried. “I…I~I think this is wrong.” He said meekly.<br>\r\n<br>\r\n“Nope.” You disagreed instantly, “If we’re going to get passed this you need to be satisfied.” You told him sternly. The 17-year-old boy looked beyond meager and confused.<br>\r\n<br>\r\n“B~Bu..”<br>\r\n<br>\r\n“No buts. What do you think of my body?” You interrupted him.<br>\r\n<br>\r\nHe looked back down over your body. “I… I… I…”<br>\r\n<br>\r\n“Personally, I like my tits best.” You told him taking the huge sacks of pliant flesh in your hands lifting them up and giving them a firm squeeze as you looked down at their magnificence. Shuffling your hands then to give the large rubbery nipples a tweak before letting go and letting them drop back against your chest. “What do you think?”<br>\r\n<br>\r\nAlex’s eyes locked on the large dark pink nipples as he nervously tried to speak. “T…They’re nice.” He said meekly, you enjoyed how awkward and uncomfortable you were making him.<br>\r\n<br>\r\n“Oh come on Alex they’re better than nice. These things drive the boys wild. I mean look what they’ve done to you.” You said laughing. Alex just sat there looking timid. You were actually surprised by how much of a pussy he was being, he was like a cat caught in the headlights.<br>\r\n<br>\r\n“What do you like then?” You asked him. You bent over, spreading your legs and grabbing your vagina. “My pussy?” Turning around then and giving your jiggly bum a slap. “My ass?” You gave him a second to answer.<br>\r\n<br>\r\n“Mom. What are you doing?” He asked as he suddenly began to burst into tears. <br>\r\n<br>\r\n“Oh shit!” You cursed to yourself. Not expecting him to all out bawl. His cries being quite loud, the 17-year-old practically crying like a baby. You grabbed the gown, quickly putting it on before running over to him. “I’m sorry. I’m sorry. Be quiet.” You said trying to calm him down bringing him to hug your now covered body. “I was just trying to make things right. I’m sorry if I went too far.” You reasoned, trying to justify your prank so you didn’t get in trouble.<br>\r\n<br>\r\n“I’m sorry too!” He suddenly cried out in between tears pulling you in tighter. “I shouldn’t have been spying on you.”<br>\r\n<br>\r\n“I~It’s ok.” You responded, a smirk spreading across your face, out of the view of Alex. God he was easy to play. “I think you know not to spy on me again. Besides, evidently you can’t handle my naked glory.” You teased him. <br>\r\n<br>\r\nHis crying began to slow and he pulled out of the hug. “So can we not talk to anybody about what just happened ok?” You said.<br>\r\n<br>\r\nHe nodded his head. Good enough. <br>\r\n<br>\r\n“Ok well, I’ll leave you to it then.” You said quickly climbing to your feet and getting out of there leaving Alex to wallop in your torment. What a day he’d had. A polar opposite to yours.<br>\r\n<br>\r\nClosing the door you grabbed the gun off the counter and headed over to Liz’s room. Putting the gun on the bed you moved over to view your reflection in the mirror. A mischievous grin was across Liz’s face as she stared back at you looking nothing like her kind motherly usual self. You undid the gown and shrugged it off your shoulders, it drops in a heap on the floor unveiling Liz’s naked body in all its naked glory. <br>\r\n<br>\r\nThe sight still absolutely blowing you away. Astonished at how just a normal everyday lady, one that you knew, could have such unbelievable tits. Cupping the massive masses and feeling their hefty weight, a light moan slipping from your lips as you enjoyed the feeling. <br>\r\n<br>\r\n“God these are some nice tits!” You said.<br>\r\n<br>\r\n“I couldn’t agree more.” A voice behind you suddenly said.</span></div></div>",
            "created":1555023000,
            "id":2643700,
            "title":"Head back to Liz's house."
        },
        "12422112":{
            "author_id":"blobber",
            "author_name":"Blobber",
            "choices":[
                "You're eager to follow your body.",
                "Stay in Liz."
            ],
            "content":"<div class=\"\"><div> <span>You quickly turned around startled, only to see your own body walking into the room. He stared at you intently as he closed the door behind him. <br>\r\n<br>\r\n“What the heck! You’re me!” You exasperated amazed. There were two versions of you running around.<br>\r\n<br>\r\n“No I’m not you. I’m from customer service here to sort out this mess you’ve made.” He replied in an impatient tone.<br>\r\n<br>\r\n“What? Customer service?” You asked confused. <br>\r\n<br>\r\n“Yes, customer service. You broke the gun and made a right mess. Lucky for you the remote unlocked a gold tier perk that is way out of your price range. Only your body was left stuck in that kid in the room across. I wanted to just leave you stuck as a ghost but a higher up told me to sort it out. So you better leave a good customer review.” Your body told you, or more the random person who worked for the company that sold you the possession gun.<br>\r\n<br>\r\n“Uh. Well I suppose, thanks for helping me out.” You told him. “What do you mean gold tier perk?”<br>\r\n<br>\r\nHe huffed, rolling his eyes. “Did you not read the manual at all. Basically for a price, and a big one, you can unlock a feature on the gun which when used turns you into a spirit, much like you are. It leaves your old body acting like it normally would whilst you can go off and have all the possession fun you want.” He said rather fed up by the end of his explanation. However you were excited, these were knew advancements.<br>\r\n<br>\r\n“Wait so the gun will still work?” You asked eagerly.<br>\r\n<br>\r\n“Yes. Just not how it used to.” The customer service man said lethargically.<br>\r\n<br>\r\n“Epic! Oh and so if you were to get out of my body it would just act normally?” You pestered him further.<br>\r\n<br>\r\n“Yep.” And with that a small man in a white uniform and cap suddenly slipped out the side of your old body which instantly regained consciousness.<br>\r\n<br>\r\n“W…Where am I?” He asked confused, then looking up and catching sight of you naked in front of him. “M… M… Mrs. Dale?” He uttered shocked, amazed and amused all at once. It being totally bizarre yet amazing to see yourself like this, even if he was babbling like a clown.<br>\r\n<br>\r\nThe customer service guy quickly slipped back inside retaking control of your old self. “Right. I’m going to drop this husk over at your house and then I am gone. If you have any more questions call the number on the manual. But please don’t.” He said before then exiting the room closing the door behind him and leaving you there astonished and elated. <br>\r\n<br>\r\nYour day just kept getting better and better. You now had a gun that would let you slip out of your body at any time you wanted, leaving it to run itself. The possibilities with this power were endless. No more school, you could just send your body whilst you went off possessing people, maybe even your teachers. God you could finally lose your virginity, well you couldn’t but your body could, and to anybody you wanted.<br>\r\n<br>\r\n“This is unbelievable!” You couldn’t help but blurt out. Then turning and looking out the window as the customer service guy walked up your drive before stopping. You assumed he had just left your body, but there was no sign of him, just your body shaking his head before continuing on inside. <br>\r\n</span></div></div>",
            "created":1555029660,
            "id":2643726,
            "title":"Your own body walks in."
        },
        "124221121":{
            "author_id":"ghastlyghost",
            "author_name":"Gengartheghoul",
            "choices":[
                "A cute girl from school who lives nearby",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You were brimming with excitement; after all, the possession gun was an amazing tool on its own, but to have these new weird ghost powers too?<br>\r\n<br>\r\n\"This is so fucking awesome!\" You laughed again, jumping back and plopping down on Liz's cushy bed. \"Sorry girls, but I gotta go.\" You jokingly pout, taking a brief minute to play with Liz's massive rack... that turned into a quick fingering of her pussy, that turned into another masturbation session with one hand fingerblasting your cunt and the other holding a breast to your mouth. It didn't take much more time of this for you to orgasm yet again in Liz's body, and you laid back with a sigh as you felt your breasts jiggle.<br>\r\n<br>\r\n\"She's amazing...\" You panted, considering the very real possibility of getting to fuck Liz... or rather, get fucked by your body on autopilot. \"I think Liz has done enough for one day.\" Her face curled into a tired grin as you briefly concentrated before leaving her body, resulting in Liz looking like she'd just fallen asleep naked on some dirtied bedsheets.<br>\r\n<br>\r\nWithout wasting any more time, you flew down the street back towards your house and into your room... where you saw yourself lounging around on your laptop. The surrealness of the situation didn't stop you for long, though, and you quickly flew into your real body and assumed control.<br>\r\n<br>\r\n\"Wow, now this feels weird.\" You said, taking a second to move your limbs around and readjust to a more natural-feeling weight distribution. \"Hmm, now how am I gonna get myself to believe that there's another 'me' with these powers?\" After some brief deliberation, you grabbed a nearby sheet of notebook paper and hastily scribbled out a note:<br>\r\n<br>\r\n\"Hello Johnny,<br>\r\nIt's me, you! Not to confuse you or anything, but I, or rather we, have just come across something amazing. Basically, any girl we want can be ours... literally! All you have to do is open the door for the next girl to come by and ring our doorbell. I'll explain more then.<br>\r\nSincerely,<br>\r\nJohnny\"<br>\r\n<br>\r\nAfter placing the note on your nightstand, you gently laid yourself down in a comfortable position before leaving your body as a spirit and flying outside, leaving your body to wake up on autopilot.<br>\r\n<br>\r\nIt was a pretty good plan you came up with on the fly; the only thing you were missing was who to possess first...</span></div></div>",
            "created":1555123080,
            "id":2644107,
            "title":"You're eager to follow your body."
        },
        "1242211211":{
            "author_id":"ghastlyghost",
            "author_name":"Gengartheghoul",
            "choices":[
                "Meeting up with your body",
                "Something comes up"
            ],
            "content":"<div class=\"\"><div> <span>One of your secret crushes for most of your time in high school was Beth Perry; a cute goth chick with a spunky attitude and a curvy body. Unfortunately you didn't quite know where she lived, but you did know that one of her friends lived a few blocks away! Lily Evans was a petite girl the same age as Beth, with a similar fashion sense and personality. You always thought she was pretty cute too, so you decided she would be the first girl you possess to show off to your body on autopilot.<br>\r\n<br>\r\n\"Here we are!\" You said to yourself, floating up to Lily's house. There were no cars in the driveway and, floating into the garage, none inside the garage either. You were concerned for a second that she might not be home, so you quickly phased inside and began looking around. You chuckled at some of the family photos around the house, showing who you assumed to be Lily's parents and younger brother dressed normally and smiling, along with Lily herself in dark, brooding clothes with a dark, brooding expression on her face. She was short like her mom, looking to be only a bit above 5 feet tall. Your casual inspection of the seemingly empty house was interrupted, however, by the faint sound of music playing from upstairs. Filled with excitement, you flew straight upwards and phased into what appeared to be a well-kept bathroom, and the sound of the music got louder. Floating into the hall and through a closed door, a grin broke out on your face as you saw your target.<br>\r\n<br>\r\nLily was enjoying a lazy afternoon, blasting My Chemical Romance songs, with her parents out to support her younger brother at his hockey game. Not that she really cared, of course. She preferred the house to herself anyways. She planned on having some friends over later since she'd have the house to herself until the late night. Lily was wearing a casual black dress with similarly black tights beneath, laying on her stomach on her bed as she flipped through images and social media posts on her phone. Blowing some of her shoulder-length dyed blue hair out of her face, she opened a group message with her friends to respond...<br>\r\n<br>\r\n\"Wow, this is crazy.\" You mutter to yourself as you float around Lily's room, looking at her various punk rock band posters and messy clothes strewn about. But you were mainly focused on Lily herself, laying on her bed totally oblivious to your presence. Excitedly, you dove into her back, phasing through her dress and into her body... eliciting a surprised gasp from Lily as she felt her body go numb and her vision fade.<br>\r\n<br>\r\nBefore long, you were looking at a phone with some blue hair in your face. You felt a lot lighter as you sprung up from the bed and to the nearest mirror in Lily's room. You saw Lily Evans staring back at you, but with a big smile on her face in stark contrast to her usual pout.<br>\r\n<br>\r\n\"I still can't believe it!\" You laughed, enjoying the sound of Lily's voice leaving your throat. You took time to feel up your face with your dainty new hands, their fingernails painted black. Lily did look pretty cute, her beady face complimenting her small appearance. \"Huh, this is like the polar opposite of Liz.\" You pouted, running your hands over your small breasts. You didn't realize how much you missed being able to suck on your own tits until now... but Liz was a bit of an outlier in breast size anyways. \"They're still alright.\" You gave them a few squeezes, then kick back on the bed to examine your skinny legs. \"Wow, so smooth...\" You said, loving the silky feel of the tights on your legs. Cautiously, you lifted up the hem of your dress to see (no surprise) some dark black panties beneath the tights. Your hands were instinctively drawn to rub at your new, smooth crotch as you felt the same warm feelings of arousal that you did in Liz.<br>\r\n<br>\r\nBut this didn't last too long, as the vibration of Lily's phone snapped you back to reality. \"Oh right, I gotta head back home!\" You said, grabbing Lily's phone without even reading the notification. You tossed it a nearby purse, slinging it over your shoulder. \"Wow, I'm so fashionable.\" You stuck your tongue out and shook your hips, before slipping on some flats and quite literally running out of Lily's house and back towards your own...</span></div></div>",
            "created":1555376760,
            "id":2645216,
            "title":"A cute girl from school who lives nearby"
        },
        "125":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "Alisha Khatri!",
                "Another neighbors?",
                "Try visiting some under the guise of your mother?"
            ],
            "content":"<div class=\"\"><div> <span>Another house or so down was <b>Alisha Khatri</b> (50) Mrs.Dales neighbor who you've ogled one or more times in the rare occasions jogging about the neighborhood when you got nothing better to do than gaze out the window like a lemming. Remembering soft she looked with the skin hugging runners wear, specifically those black spats conforming to what you could've sworn was two cushions of an ass stuffed in there with pillow hips and thighs and a vague memory of her chest and dusky skin as well as the cute head dress that covered her braided hair...what else comes to mind is her possible employment at school but that memory is as iff as ever and her sagging bra-less bosom wobbling in her runs. She has two daughters you've seen a bit more of that follow her in physical appearance but you can't tell if the might be as warm and welcoming as their mother is with her soft cheeks face and the golden smile imprinted into your mind.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1550638800,
            "id":2620516,
            "title":"Somebody Else."
        },
        "13":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Your Aunty Sharon",
                "Anita Jarvis",
                "Kate Madden",
                "Somebody Else."
            ],
            "content":"<div class=\"\"><div> <span>As you stared at your mom's beaming face in the mirror you couldn't help but think of some of her MILF friends.<br>\r\n<br>\r\nThere was your <b>Aunty Sharon</b> who it turns out was coming up to stay with you from down south for a few days. She was one of your mom's oldest friends, you at some point started calling her aunty because of how close she was with your mom. You'd had a crush on her for years mainly because she had some of the biggest boobs you'd seen, boobs that had triggered your fascination with all things boobs.<br>\r\n<br>\r\nOr there was <b>Anita Jarvis</b> your mom's current best friend. You saw a lot of Anita as she was extremely close to your mom, the two often playing tennis together and Anita often tried to drag your mom to the gym. Even at 43 she was still into her fitness and you could tell from her body which was slim and toned and much to your pleasure her boobs were still large thanks to a boob job she'd gotten when she was younger. She didn't have a man to enjoy her body, having gotten divorced 5 years ago though she had two children who lived with her, a boy your age named Henry and a daughter named Rosie who was also a police officer in the same department as your neighbor Martha.<br>\r\n<br>\r\nThe there was <b>Kate Madden</b>, one of your mom's more wild friends. She was married to a rich lawyer who's name you couldn't remember and liked to live a life of luxury which she often tried to drag your mom into.Your mom didn't mind the spa days away it was the snobby parties and wild nights out that your mom couldn't stand. She was in her late 30's and a blonde babe with plenty of energy to spare, her boobs were big courtesy of her husband and you wouldn't mind filling in for her at one of her wild parties or events.<br>\r\n</span></div></div>",
            "created":1546146000,
            "id":2596164,
            "title":"One of your mom's friends."
        },
        "131":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "You shoot and she freezes in place!",
                "You shoot but it doesn't work!",
                "You decide not to fire."
            ],
            "content":"<div class=\"\"><div> <span>It was the day after you’d used the gun on your mom and after spending the 30 minutes trial period in your mom’s body you were ready to get some proper use out of the gun. Last night had been hell as you waited excited for the moment your aunty arrived. But that time had finally come and as you watched the train pull into the station you shivered with excitement.<br>\r\n<br>\r\n\"There he is mom! I've found him!\" You heard the loud call of your 10-year-old cousin as the doors finally opened and she stepped off the train. She was as excited as she normally was to see you, running up and wrapping her arms around your waist into a hug. \"Hi Alice, how are you doing?\" You asked her patting her on the top of her long curly hair. <br>\r\n<br>\r\n\"I'm great!\" She chirped smiling up at you but still squeezing you tightly. Behind, her mom, or your aunty Sharon, was just getting off the train carrying their three bags of luggage. It was your mom's best friend who she'd known since before you were born, though they were so close that she become you aunty.<br>\r\n<br>\r\n\"Hello!\" She smiled pleasantly at you, though that was all you saw of her face as your lecherous eyes quickly darted down to her massive breasts which jiggled nicely as she dropped off the train and onto the platform. Not wanting to look like a perv though you dragged them back up to her face.<br>\r\n<br>\r\n\"Hi! Good journey?\" You asked as politely as you could, giving her the kind and polite façade you always put on when family came over.<br>\r\n<br>\r\n\"Yes excellent.\" She replied dropping the bags and leaning in for a hug. You returned the squeeze feeling her soft breasts pressing like pillows against your chest and smelling the sweet flowery scent of her perfume. You probably held the hug for slightly too long, simply enjoying basking in the closeness of your body to hers, though you had to release as not to make things awkward. As you pulled out she looked you over, “God, you’re getting so big!” She stated laughing, it was a standard comment really even though you were 16 and had stopped growing, well according to your dad anyway.<br>\r\n<br>\r\nYou just laughed awkwardly at the remark then quickly moving on, \"I'll get these then?\" You said grabbing their luggage and then leading them away.<br>\r\n<br>\r\nAs you walked the few hundred meters back to your family’s house you and your aunty discussed the normal things, how school was going, and how football was. As you did you couldn't help but take sly glances at her large chest as it jiggled with every step. You'd been infatuated with it ever since you hit puberty. Your aunties chest being practically the size of watermelons how could any teenage boy not be, imagining that she was ogled to no end by the boys at the school that she worked. She taught year 7's which was about the year you would have been when you first started noticing her huge boobs. <br>\r\n<br>\r\nIn fact, you could remember the day you became infatuated with them, your aunty had bent over to clean the kitchen table after a family meal and her low-cut top left a huge window in which you could see her huge bra clad boobs swaying majestically as she wiped. You didn't even know back then that 'Cleavage' was the word for what you was staring at, but boy did that dark chasm of delicious milky flesh arouse your interest. Since then your fascination in big breasts has only grown and with it the huge crush that you have on your aunty. <br>\r\n<br>\r\nThough you had to say she wasn't exactly the best-looking woman you'd ever seen, though she was by no means ugly. Her face was average, at least for a 46-year-old woman, she had soft green eyes, a small but strong nose and a mouth that was constantly curled into a kind tender smile. Framing her face was her brown shoulder length hair which she always wore down, having never seen her with it tied up or back. She'd probably best be described as a knock off Jennifer Anniston, in her face at least, her body being way different. Below the neck was what you really liked about her because your aunty was curvy, really god damn curvy. She had those massive boobs hanging from her chest, but below them she also had wide hips and an ass that most women her age would kill for, it being so round and large. <br>\r\n<br>\r\nHer body was currently hugged nicely in the clothes she wore. Her huge globes being contained in a green sweater which, although being high cut and boring, accentuated the curves and sheer size of those huge mountainous peaks. As for her large bubble but, that was being hugged nicely within the confinements of her tight jeans. You weren’t sure whether your aunty knew she had a totally vulgar body, she dressed in a way that was totally respectable for a middle-aged woman but yet totally showed off her body at the same time. Whether she did it on purpose or not, you didn't care, you was just happy to take in her body whenever you had the chance. <br>\r\n<br>\r\nWhen you arrived at the house and she was greeted by your parent's you had one of these chances, whilst they were all distracted talking you gawked at her curvy body from behind. A shiver of excitement tingled down your spine, you couldn't wait to get your hands on it later. <br>\r\n<br>\r\nYou were practically shaking whilst your parents and your Aunty caught up, your mind racing with thoughts of what you were going to be doing later. So rather than stand there and look like a mad person you took their suitcases up to the spare room before heading back to your room and grabbing the gun from under the bed. \"Later my friend. Later\" You grinned. You had to take a few deep breaths and calm down before heading down stairs back to everybody to continue to act like the gracious son and nephew which you knew you were far from.<br>\r\n<br>\r\nFor the next couple of hours, as dark fell, you just watched TV and kept Alice entertained with your iPad. Though as your little cousin showed off her skills at Angry Birds you couldn't help but stare at every aspect of your Aunty Sharon's body. Soon it would be yours. Your penis had been hard at the thought of it for over an hour, eventually you decided you needed to rub one out, so casually tucking your erection into your waist band you went upstairs. Once in your room you jumped onto the bed, instantly whipping out your penis and beginning to ferociously masturbate. You were just about cum when suddenly you heard footsteps coming up the stairs, you had to hold yourself back from cumming, it was rule number one of wanking, never cum if you hear movement, so that the person doesn't enter the room and find you all covered in cum. You quickly pulled your pants up and headed over to the door, peaking through the small gap you saw your Aunty Sharon, her tits jiggling nicely as she climbed the stairs. It's like she was taunting you, telling you that you had to wait 4 hours before you could enjoy her sexy body whilst everyone was asleep. She went into the spare bedroom across the hall, you watched as she bent over, presenting her big round ass to you, and opened up a suitcase. She pulled some things from it and put them on the floor, your eyes were drawn to one thing especially, the big hefty white bra that she'd thrown down. You rubbed your still erect penis through your clothes as you imagined those big cups being wrapped around her breasts, around those big pale masses of beautiful flesh, imagining her big hard nipples rubbing against the soft material, imaging what it would feel like. <br>\r\n<br>\r\nThis blew your excitement overboard. \"Oh, I can't fucking resist!\" You groaned heading over to the bed and pulling out the gun from under it. You turned the thing on and checked that it was still logged into your PayPal, which you'd connected it to earlier, before you headed over to the door. You peered around and saw she was just about to turn and leave, so wasting no time, and just like you had done with your mom, you pulled the gun around the door and aim at her square in the head.<br>\r\n</span></div></div>",
            "created":1546146000,
            "id":2596165,
            "title":"Your Aunty Sharon"
        },
        "1311":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Carry on exploring.",
                "Your dad suddenly shouts up complaining about the wifi being slow (RESERVED)",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>You pulled the trigger and instantly your aunty stopped moving. You quickly sprinted across the hall and into the spare room, closing the door behind you.<br>\r\n<br>\r\nLooking your Aunties frozen body up and down you could hardly believe it, you finally had access to her body and in a few moments time it would be all yours. But before you clambered on inside you couldn't help but look her frozen body over, it was weird being able to examine somebody like this. You got up close and personal in her face, right now you could see every last freckle on her pale aging skin. This was amazing, analyzing her face over like she had probably never done, it was so intimate and as you stared deep into the blueness of her eyes you found yourself lost in them.<br>\r\n<br>\r\nSuddenly though, as you were gazing into your frozen auntie’s eyes, you heard footsteps coming up the stairs. \"Sharon? Did you find them?\" It was your mom, and she was about to walk in on you staring at your frozen Aunty. You had to get in her! Quickly, wasting no time you went behind your frozen aunty and in one smooth motion stepped into her body. Your vision went black for a moment before quickly returning. You were now wearing your Aunty Sharon's body. You didn't have much time to ponder this though as your mom abruptly burst into the room.<br>\r\n<br>\r\n\"Did you find it?\" She asked though you had no clue what she was referring to.<br>\r\n<br>\r\n\"Um... No.\" You said awkwardly, now being very aware that it was your aunties husky, yet feminine voice leaving your lips. You turned to your mom noticing that we were now level in height, having been nearly a foot taller than her previously, being rather lanky and skinny yourself.<br>\r\n<br>\r\n\"Well I'm sure it’s in here somewhere.\" Your mom said then bending over and beginning to search through the suitcases. As she did you took stock of your new form, reaching your hands up and briefly cupping the two huge breasts that now hung from your chest. “Oh my god!” You mouthed to yourself, they felt so heavy! You brushed your hands down your sides, then bringing them around and to a stop on your Aunties large rump, feeling the firmness of it as you gave it a light squeeze. <br>\r\n<br>\r\n\"Ah here it is!\" Your mom suddenly exclaimed making you flinch back to a normal standing position. She raised up some sort of key, it probably being the keys to your parent's villa in Spain which you remembered your Aunty and her husband had just visited. You couldn't help but remember going to Spain with them, a full week of staring from a distance at your aunties huge breasts clad in nothing but a tight black one-piece bikini, that was a good week. But this week you would be looking at her huge breasts very up close and personally clad in absolutely nothing, it was safe to say this was going to be a better week!<br>\r\n<br>\r\n\"Are you coming back down to watch a film then?\" Your mom asked, though you knew it wasn't actually a question and you could hardly say no.<br>\r\n<br>\r\n\"Um... Ok. I'll be down in just a second.\" You managed to buy yourself some time. With that your mom headed downstairs whilst you darted straight over to the bathroom. Once in you locked the door and headed straight over to the mirror. Your mouth curled into a cheesy grin when you saw your Aunty Sharon staring back at you, the same excited expression splattered across her face. <br>\r\n<br>\r\n\"Hoooo-ly shit!\" You said taken aback. You knew the device worked and that you were currently possessing your aunty but seeing her staring back you in the mirror was still hard to grasp. You Pulled a number of silly faces in the mirror much like you did with you mom watching as your Aunty did the same. Pulled your chin back into your neck giving yourself a triple chin whilst you blew out your cheeks, bursting into laughter at the spectacle you’d created. It was so weird watching her act so strangely, usually being so prim and proper that it was funny seeing her like this. You felt a little bit of gas building up inside and decided it was better out than in. You squeezed hard and suddenly it came out in a loud toot, once again bursting into laughter. \"I thought women didn't fart.\" You joked.<br>\r\n<br>\r\n\"Sharon, are you coming?\" You then heard your mom shout up the stairs. Fuck! You had to go.<br>\r\n<br>\r\n\"I'll be seeing you later.\" You almost taunted your reflection as you turned to leave the room, though not before catching a whiff of the fart you'd just let out. \"What a stinker\" You joked before heading downstairs.<br>\r\n<br>\r\nYour family were all sat down waiting when you re-entered the living room, and as you sunk down on the couch next to Alice none of them were any the wiser that you were an imposter wearing Sharon's body. Not even her own daughter.<br>\r\n<br>\r\nWhen the film started you knew you’d never be able to stay the full feature, the fact that you were currently wearing your Aunty and had the sight of her breasts bulging into your vision was simply turning you on too much. You could actually feel your Aunties pussy getting wet and her nipples tingling, it pained you to be in here watching some childish film when you could be upstairs exploring this beautiful body. That's why after about 10 minutes of agonizing waiting you excused yourself from the room. <br>\r\n<br>\r\n\"Do you want me to pause it?\" Your dad asked as you left.<br>\r\n<br>\r\n\"No, keep it going. I uh... Need to ring Kevin.\" You lied referring to your Aunties husband, then quickly leaving the room.<br>\r\n<br>\r\nYou pretty much leapt up the stairs, so eager to get into the bathroom that the bounce of your stolen breasts nearly pulled you down into a face plant. But luckily you stayed on your feet and swiftly made it into the bathroom and back in front of the mirror. \"Why hello again!\" You said, once again greeted by the sight of your busty aunty staring back at you.<br>\r\n<br>\r\n\"Well no point in waiting!\" You reached down and grabbed the hem of your sweater and pulled it over your head. It snagged momentarily on your auntie’s large tits, but with a harsher tug it sprung right off sending you aunties tits tumbling out. You threw it on the floor before looking back to your reflection. \"Fuck me!\" You gasped as you saw your aunty now topless but for a huge lacey white bra, her huge fleshy tits spilling over from the sides, the bra clearly being too small. Though you bet it was hard to bra shop for tits this big, the bra was probably custom made.<br>\r\n<br>\r\nWanting to go further your hands reached up behind your back and began unclasping the latch of the bra. A moment later you felt yourself lurch forward as the latch sprung undone. You grabbed the cups of the bra to not let them fall off, keeping your aunties modesty covered for now, you wanted to make this a moment to remember. You had to prepare yourself mentally, you were about to see your aunties boobs! Boobs that you’d been yearning after for over 5 years, boobs that you should never ever see naked, but you were about to. And, as you felt your hands pressing against the soft masses and watched in the mirror as you pressed them into your chest making their size look obscene, you couldn’t resist. So, with one unceremonious drop you let go of the bra and let them tumble into view. You froze when you did. <br>\r\n<br>\r\nThey were even better than You'd expected! <br>\r\n<br>\r\nThe two big pale masses of pliant flesh hung like two huge teardrops from your chest. They sagged a little, though that was expected with the size of them, yet they were still so full and round, almost like two basket balls hanging from your chest. In the middle of which, pointing out like two large laser pointers were her nipples, they were brown and thick, probably poking about an inch out from the breast, and surrounding each nipple was a dark brown, teacup size, areola, with scattered across it a number of small little bumps.<br>\r\n<br>\r\n\"Oh My God! What the fuck!\" You exclaimed as your hands came up and cupped your huge stolen boobs, feeling as they sank into the soft, yet still firm flesh. \"They're amazing!\" You gasped. They truly were, your aunty possessing some of the best boobs you'd ever seen, even with 5 years of porn viewing. Your hands began to grope away at the pliant masses, there was just so much flesh to play with! You grabbed at the two large nipples and began tugging and pulling on them, feeling them jolt with pleasure as you did. You watched your aunty in the mirror as her reflection did the same, she looked like a child having the time of her life, juggling and jiggling her breasts like they were a couple of playthings. Just watching her do this in the mirror made the whole thing ten times hotter than it already was. Eventually you let them go watching as they dropped back into place with a jiggle. <br>\r\n<br>\r\n\"I have to take a few photos!\" You stated, though you could see them any time you wanted for the next three days whilst your aunty stayed over you wanted to immortalize them on your phone and maybe even some online forums you knew would love to see them. So, pulling out your aunties phone you opened the camera and began posing as you snapped picture after picture. After about 10 minutes or so you had filled her SD card with pictures of nothing but her breasts. Now you just had to send them to yourself, so logging into your dropbox you dragged them all over, watching as the bar read 1% complete. Boy was it going to take a long time. But you didn't care you had the rest of your body to explore.<br>\r\n</span></div></div>",
            "created":1546146000,
            "id":2596198,
            "title":"You shoot and she freezes in place!"
        },
        "14":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Mrs. Landy",
                "Mrs. Ward",
                "Beth Perry",
                "Claudia Wentworth",
                "Somebody Else."
            ],
            "content":"<div class=\"\"><div> <span>As you stared at your mom's beaming face in the mirror you thought about all the people at your school who you could use the gun on.<br>\r\n<br>\r\nThere was <b>Mrs. Landy</b> your biology teacher and a kind caring woman, probably around her late 20's. She was a short lady with shoulder length brown hair and a pretty face. She made you enjoy biology and you often looked forward to going to her classes when you had them. You also wouldn't mind using her body to teach yourself a little bit of biology, though you suspected her huge jubbly tits which you and your friends loved to ogle in class wouldn't be representative of the average, 'normal' pair of breasts.<br>\r\n<br>\r\nThen there was <b>Mrs. Ward</b> you’re strict English teacher. A tall stern mature woman, probably in her 40’s, with a thick curvy body. She had for some reason taken a mean disliking to you and you would just love to take her body out for a spin and get a little bit of sweet revenge.<br>\r\n<br>\r\nThen there were some of your fellow pupils who you wouldn't mind taking for a ride.<br>\r\n<br>\r\nYou could take over <b>Beth Perry</b>, a goth chick of which you had a secret crush on. She wasn't your typical girl but instead kept to her little group of skaters not caring for school politics or about what anybody thought about her in general. She wore her hair long and black and went strong with the black eye liner and lip stick. Much to her displeasure the school forced her to wear a uniform, assuming that she'd lather herself in black if there wasn't one, this meant you could see that behind her goth demeanor she was probably quite a babe her body being thick and curvy with a pair a large boobs which were constantly straining against her school top. You were curious to see what she was hiding under her clothes.<br>\r\n<br>\r\nOr there was <b>Claudia Wentworth</b> who was two years above you and one of the most popular girls in your school. With her long blonde hair, supermodel face, and athletic body she had all the boys in her own year fawning for her and to your year she was practically a goddess. The thing was she knew she was hot and so was pretty up herself. Your friends would be utterly bewildered if she all of a sudden approached and started speaking to them or maybe even more. Alternatively using Claudia you could surely get Megan, your crush, to start noticing you.<br>\r\n<br>\r\n</span></div></div>",
            "created":1546146000,
            "id":2596179,
            "title":"Someone from school."
        },
        "142":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "You pull the trigger and Mrs. Ward Freezes.",
                "You pull the trigger but it doesn't work.",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>“Then if you look to the first line of the second stanza, you’ll notice the writer uses the blue curtains to represent his overwhelming depression and the fact that his life…” Mrs. Ward your English teacher droned on about some stupid poem though you were hardly listening to a word she was saying. There was nothing more boring than English lessons, you could speak English perfectly fine why did you need to carry on learning it and why the hell did you need to know about some ancient poem about the ocean. And no the curtains were just fucking blue you internally fumed as your teacher continued to drone on. It felt like you’d been in the lesson for hours.<br>\r\n<br>\r\nSuddenly you felt a nudging on your arm, it was Travis next to you. You looked over, he was gesturing up towards the front. You turned that way finding Mrs. Ward and the rest of the class staring intently at you. “Johnny what technique has the writer used on lines 7 and 9?” Mrs. Ward asked you her stone cold glare shooting nerve racking lasers down every fiber of your being.<br>\r\n<br>\r\n“Uh… Uh…” You stuttered looking down at the poem on your desk scrambling to find where you were, Travis quickly pointed it out. You read the lines but absolutely nothing came to mind. Hesitantly you looked back up. “Um… I’m not sure Miss.”<br>\r\n<br>\r\nShe tilted her noes downwards looking over the rim of her glasses at you. “Why am I not surprised?” She said displeased, “Perhaps if you stopped flailing off into dreamworld you might actually know something and maybe, just maybe, improve your grades.” With that telling off she moved on as the class nerd Sally Bennett raised her hand to answer.<br>\r\n<br>\r\nYour stare lingered on your teacher as anger filled your veins. You could hardly wait for the lesson to end and you could finally use the gun on the old hag. It had been almost impossible to hold back until now after using the gun on your mom you couldn’t wait to use it again and this time you would have 12 hours to get some proper use out of the thing. Boy you couldn’t wait to reduce Mrs. Ward down to nothing but an item of clothing to wear and do with as you pleased and it wouldn’t be long now.<br>\r\n<br>\r\nFor the next 10 minutes or so you sat daydreaming about the possibilities before the bell suddenly sounded breaking you out of your trance. <br>\r\n<br>\r\n“Ok class. That’s all for today, I’ll see you tomorrow.” Mrs. Ward said as people began packing up their things as the noise level of conversation grew.<br>\r\n<br>\r\n“God she really hates you doesn’t she.” Travis said to your left as you packed up ready to leave. You switched between looking at him and Mrs. Ward, not wanting to let your target out of sight.<br>\r\n<br>\r\n“Yeah tell me about it.” You responded. <br>\r\n<br>\r\nWith that Travis rose to his feet. “Come on then lets get out of here.” He said. <br>\r\n<br>\r\nYou had no intentions of leaving the room, at least not as yourself. “Actually Travis I need to ask Mrs. Ward something so I’ll catch up with you later or just see you tomorrow.” You told him. <br>\r\n<br>\r\nHe shrugged. “Oh alright. See you later then.” Before making his way out of the room with the crowd of other students. You waited until most of the students were out of the room before standing up and slowly making your way over to Mrs. Ward who was now sitting at her desk on her computer. <br>\r\n<br>\r\n“Hi Miss. I was wondering if I could ask you a question.” You said nervously.<br>\r\n<br>\r\n“Go on then. What is it?” She said bluntly her eyes still transfixed on the screen.  Just as you were about to make up a question to distract her the last student left the room. “Come on. I don’t have all day.” Mrs. Ward moaned. <br>\r\n<br>\r\nYou didn’t even respond instead turning around and walking over to the door closing it shut and twisting the latch to lock it. “What on earth are you doing?” Your teacher said as she noticed what you were doing. You didn’t say a word just slowly pulling the door blind down keeping your eyes locked on your teacher intently as you did. You wanted to at least have a little fun with her before you turned her into your own person meat costume. <br>\r\n<br>\r\n“What the heck is this? Open the door you strange boy.” Mrs. Ward said sternly. She rose to her feet. <br>\r\n<br>\r\nYou quickly reached into the bag and pulled out the gun “Ah ah ah.” You stopped her.<br>\r\n<br>\r\n“What on earth is that!?” She fumed stopping in place a shocked expression dropped across her face. “Don’t do anything stupid.”<br>\r\n<br>\r\n“Oh I won’t be doing anything stupid. You on the other hand. You’ll be doing plenty of stupid things not too long from now.” You said smiling mischievously. You slowly arched around and closed the window blinds all the while staring and pointing the gun intently at your nervous teacher.<br>\r\n<br>\r\n“You’ve gone crazy.” She said panicky, “Just let me go and we can forget this ever happened.” <br>\r\n<br>\r\n“Oh I won’t be forgetting this ever. You on the other hand, you won’t remember any of this. The school will most definitely remember this day as well. The day Ward the Witch finally got her comeuppance.” You said hearing how evil you sounded, years of anger a the torment of this women were finally coming out and now you were ready for some fun. “Well her goes nothing.”<br>\r\n<br>\r\n“No! No wait!” She shouted.<br>\r\n</span></div></div>",
            "created":1546146000,
            "id":2596182,
            "title":"Mrs. Ward"
        },
        "1421":{
            "author_id":"mercer21",
            "author_name":"Mercer21",
            "choices":[
                "\"It's okay Travis, I shouldn't have been a big dumb bitch\"",
                "\"It's okay Travis, I should've been more careful\""
            ],
            "content":"<div class=\"\"><div> <span>\"YOUNG MAN, YOU'RE-...\" Mrs. Ward shouted with barely contained anger, but you pulled the trigger before she was able to finish whatever she was going to say and the gun's effect was immidiate.<br>\r\n<br>\r\nMrs. Ward's petite, soft hands dropped and tangled at her side, limp and useless. Her expression changed from her usual angry one to a completely neutral one. Her eyes were unfocused, staring straight in front of her.<br>\r\n<br>\r\nYou decided to test her response before doing anything else. \"Mrs. Ward's a stupid bitch!\"<br>\r\n<br>\r\nAfter seeing no response from your teacher, you walked over to her and examined her further. Your eyes wandered over to her face and you couldn't help but notice how attractive she looks when not grimacing all the time. Despite being in her forties Mrs. Ward still looked fairly attractive for her age.<br>\r\n<br>\r\nYou froze when you heard a sound coming from beyond the room. Your head turned towards the door and you could just make out voices coming from the hallway. The voices were growing louder so you assumed that they were coming to this room.<br>\r\n<br>\r\nPanic set in. <i>I'll be in so much shit if someone sees me alone with a fucked up teacher!</i><br>\r\n<br>\r\nActing quickly, you practically leaped at Mrs. Ward's frozen form. You were sucked into her body and your point of view changed almost immediately. Just like with your mom, you felt weight on 'your' chest and quickly grabbed one of her large knockers, hoping to get a quick taste of Mrs. Ward.<br>\r\n<br>\r\nThere was a knock on the door and you quickly dropped your stolen hand from Ward's breast before telling them to come in. The door opened and Travis walked in, looking around the room before focusing on you.<br>\r\n<br>\r\n\"Excuse me Mrs. Ward, have you seen my phone? I think I left it here somewhere.\"<br>\r\n<br>\r\nYou tried to walk over to Ward's desk, but you fell. Ward's heels and the unfamiliar center of mass were enough to mess with your balance. You grunted and glanced at Travis, who was trying his damndest to look like he's not laughing hysterically. You got up, and walked very slowly this time. After digging in Ward's desk for a moment, you found Travis's phone.<br>\r\n<br>\r\n\"I have it right here Travis.\"<br>\r\n<br>\r\nTravis walked over to you and took his phone from your out streched hand. \"Thank you, Mrs. Ward,\" he thanked you \"...and sorry for laughing at you just now.\"<br>\r\n<br>\r\nA thought crossed your mind. Maybe you should tell Travis who is currently piloting your teacher? Seeing the confusion on his face would be worth it in and of itself. The two of you could also cause much more mischief together.</span></div></div>",
            "created":1555147380,
            "id":2644211,
            "title":"You pull the trigger and Mrs. Ward Freezes."
        },
        "144":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Explore this body\"",
                "Prank my friends\"",
                "Posses another person\""
            ],
            "content":"<div class=\"\"><div> <span>It was the morning after the day before and following last nights events you came up with a plan to possess Claudia; she was the queen bee and you wanted to see what her life was like, being a teenage girl that all your friends were head over heels about. One that could move grown men to babbling monkeys with a seductive smile and hint of cleavage. You ate breakfast quickly that morning, prepared by none other than your mom who didn't have a clue about what happened last night, even after your unfortunate ejection from her body. Having been laid down watching TV when all of a sudden, after the half hour trial was up, you slipped upwards out of her body abruptly finding yourself lying on top of her cushiony form as she groaned in a daze. You'd quickly rolled off onto the floor and crawled out of sight as she regained her bearings and simply carried on watching TV.<br>\r\n<br>\r\nFinishing eating you headed out for the bus and after a short bus ride you got off at school. However instead of going with your friends to your lockers you left them and headed your way outback; which is where you knew Claudia always hung out.<br>\r\n<br>\r\nYou found her chatting with another one of her popular friend's, Phoebe Cartwright, a dark haired beauty with a slightly pudgy form, though most of her weight was in her large bouncy tits which made all the boys fawn for her, hence why she was in the popular group. But you weren't here for her. You listened to the conversation for a few minutes before, lucky for you, another group came over and asked Phoebe if she was coming to class, Claudia mustn't have had a class with them and wanted to finish her cigarette. Now was your chance, with Phoebe gone Claudia was alone and mostly unaware, you grabbed the gun and aimed at her, then holding the gun steady you took the shot. She suddenly stiffened like a board and stood straight like a pencil, seeing this hesitantly you walked up to her.<br>\r\n<br>\r\n\"Hey...uh Claudia?\" You said nervously. No response, you took that as her way of saying \"come on in! Lets prank your friends!\" Because with that you stepped right into her form.<br>\r\n<br>\r\nYou woke up slightly dazed and almost fell down with your new weight and height, you looked down and saw two huge mounds of flesh that you now assumed to be your new boobs that come with the Claudia package. You grabbed your new butt and squeezed getting a feel of one of the most coveted things in your school and boy did it feel amazing.<br>\r\n<br>\r\nYou quickly stopped and ran off inside looking for the nearest restroom so you could see your stolen body in the mirror. Spotting one just inside the back entrance you made sure to head inside the girls one where you were you found your beautiful new form staring back at you in the large mirror above the sinks. \"Mmmmm wow this body is killer!\" You say to yourself, squeezing yourself up and down. \"But what to do with it?\" You wonder as you massage your new boobs.<br>\r\n<br>\r\n\"Aha! I know what to do!\" You say proudly with your new answer in mind, \"i'll...<br>\r\n</span></div></div>",
            "created":1546232400,
            "id":2596944,
            "title":"Claudia Wentworth"
        },
        "1442":{
            "author_id":"ghastlyghost",
            "author_name":"Gengartheghoul",
            "choices":[
                "\"I'd like to take Phoebe for a spin!\"",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"They're gonna flip their shit!\" You laugh to yourself, sounding like a giggle in Claudia's voice, as you imagine messing with your friends. \"After all, this body is pretty sweet.\" You firmly grab onto Claudia's large breasts, groping them through her expensive-looking sweater vest. After only a few seconds, though, you unbutton her top all the way, revealing her bra-clad rack.<br>\r\n<br>\r\n\"Won't be needing this!\" You say as you unclip the back of the bra and let the straps slide off your shoulders and down your arms... revealing two sizable yet perky breasts. Claudia's pretty face lit up with glee as you jiggled and squished together the bare tits... but half of your enjoyment was simply watching Claudia feel herself up in the mirror with a stupid grin on her face.<br>\r\n<br>\r\n\"Gotta say, she's pretty popular for some good reasons...\" You reach down and take two meaty handfuls of Claudia's ass, enjoying how squishy her tush is. But before you can continue your examination properly, you hear the lunch bell ring from outside the bathroom... and soon after, the sound of many students milling about the halls. \"Shit!\" You mutter, trying desperately to put her bra back on but to no avail. After a few seconds of struggling with it, you simply decide to drop it on the floor and kick it under one of the stalls, quickly buttoning up Claudia's shirt as you hurry out of the bathroom, passing by a few other girls that give you weird looks.<br>\r\n<br>\r\n<br>\r\n<br>\r\nIt takes you a few minutes to get food in the lunch room, although you enjoy every second you spend in Claudia's beautiful form. Even though you relished all the eyes that were on you, for now you tried to blend in as your host, making your way towards a table with Phoebe and a few other popular girls.<br>\r\n<br>\r\n\"Hey Claud!\" Phoebe calls out, motioning you to take the open seat right next to her. You gladly accept, and the next few minutes are spent listening to petty gossip... as you try your best to sneak peeks down Phoebe's v-neck on occasion, ogling her massive hooters. The other girls at the table were certainly lookers as well...<br>\r\n<br>\r\nYou then remembered that you wanted to mess with your real friends, so you hastily excused yourself as the other girls resumed their gossip. Confidently striding over to the table where James, Sam, and Travis were sitting, with a noticeably empty seat.<br>\r\n<br>\r\n\"What's up, losers!\" You stick your tongue out as you taunt the boys.<br>\r\n<br>\r\n\"Gee, Claudia, bitchier than usual today, I see.\" James rolled his eyes.<br>\r\n<br>\r\n\"Why don't you make like a tree and fuck off.\" Sam made a dismissive gesture and went back to eating.<br>\r\n<br>\r\n\"Really? Well, what if I told you I was really Johnny, and...\" You unbutton the top few buttons of her sweater-vest and quickly flash them your tits. \"...I found something amazing?\"<br>\r\n<br>\r\n\"Wh...what the fuck?!\" Travis nearly shouted, drawing some attention as you quickly redressed.<br>\r\n<br>\r\n\"Let's find someplace empty.\" You motion for your friends to follow, and although they can't really understand much, they follow you anyways as you head to the hallways, exaggeratedly swaying your ass with every step... knowing that your friends were watching.<br>\r\n<br>\r\n<br>\r\n<br>\r\nAs you eventually found a currently unused and unlocked classroom, you quickly explain the possession gun you bought recently, complete with a demonstration of jumping in and out of Claudia's body.<br>\r\n<br>\r\n\"This is so fucking weird...\" Sam muttered, trying to make sense of the situation.<br>\r\n<br>\r\n\"Yeah, could this be dangerous?\" James said.<br>\r\n<br>\r\n\"So you just pay a few bucks and you can literally BE anyone you want?\" Travis interrupted, seemingly more excited than the other two guys. \"Hell yeah I want in on this!\"<br>\r\n<br>\r\n\"Alright, who's it gonna be?\" You flash a smile from Claudia's body as you hand over the gun into Travis's excited hands.<br>\r\n<br>\r\n\"Well, obviously...\" he says.</span></div></div>",
            "created":1546664400,
            "id":2599024,
            "title":"Prank my friends\""
        },
        "14421":{
            "author_id":"darthbane0908",
            "author_name":"Mr.Y",
            "choices":[
                "Have him wait here and you go get Phoebe and bring her here",
                "Readers choice "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Well, it's obviously going to be Phoebe\" Travis says getting ready to leave. You quickly stop him \"wait, I have a plan\" you say smiling at him \"the plan is....\"</span></div></span></div>",
            "created":1546750800,
            "id":2599902,
            "title":"\"I'd like to take Phoebe for a spin!\""
        },
        "1443":{
            "author_id":"cale55",
            "author_name":"Sonic42",
            "choices":[
                "yes",
                "no",
                "yes and add her husk to the Claudia one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you use Claudia's body to get to Megan and possess her?</span></div></span></div>",
            "created":1546318800,
            "id":2597353,
            "title":"Posses another person\""
        },
        "14431":{
            "author_id":"darthbane0908",
            "author_name":"Mr.Y",
            "choices":[
                "Take off Megan's clothes and start exploring her body",
                "Readers choice "
            ],
            "content":"<div class=\"\"><div> <span>As much as you loved Claudia's body, you had to possess Megan, your crush, so after playing with Claudia's breasts for a good minute or two you then leave the bathroom and head for Claudia's class and luckily for you Megan and Claudia had the same class. <br>\r\n<br>\r\nYou finally enter Claudia's class which was art and spot Megan sitting at a table in the corner and drawing. You get to her and sit by her, you look at her and smile \"Hey Megan, you think you could come with me for a minute?\" She looks up at you \"Sure\" she saids getting up and begins to follow as you start to leave.<br>\r\n<br>\r\nAfter about 2 minutes you find a currently unused classroom. Leading Megan in, she closes the door and turns toward you \"what did you need help with?\" You then quickly turn around and pull out the gun and fire it at her and she then freezes in place, so you phase out of Claudia and run straight into Megan's body. <br>\r\n<br>\r\nKnowing that the classroom was not being used for the entire week you quickly run out of the classroom and into the nearest bathroom, not caring about Claudia since no one would see her and the 12 hour time limit would go out with no problem.<br>\r\n<br>\r\nIn the bathroom you quickly go to the large mirror above the sinks and see your beautiful new form staring back at you. \"Now this is a killer body, it's better then Claudia's body\" you say as you grab your new butt and squeezed it, getting a feel of good it felt. You then take your hands and reach under Megan's shirt and move underneath her bra resting your hands on Megan's breasts. You then start fondling your breasts, giving them a tight squeeze and massaging the nipples which began to get harder as you did so. You then...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1546750800,
            "id":2599948,
            "title":"yes"
        },
        "15":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "To Mom's Office",
                "Something Else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You could head to your mom's office to see what actually went on there?</span></div></span></div>",
            "created":1546318800,
            "id":2597225,
            "title":"More Options."
        },
        "151":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Take the woman's body and fit mom in the briefcase",
                "Wear the woman's body over mom's and stack husks",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>(Re-upload of chapter by <span class=\"cblue\"><b>Sblogsy</b></span>)<br>\r\n<br>\r\nYou made your own dinner that night. It wasn't dignified for you, but it needed to be done.<br>\r\n<br>\r\nYou spent most of the next day convincing your mom that she had fallen asleep in front of the TV.<br>\r\n<br>\r\nAt last, the time you had planned meticulously. The time you would check out mom's office was near. You could not wait.<br>\r\n<br>\r\nYou had packed your bag on Sunday night. Less than half of the homework was complete. That didn't matter. All the time you spent on the laptop, which was normally to do homework, was finding that website again and scrolling through pages and pages of terms and conditions to link in your dad's credit card to the gun, which could be digitally managed and financed online. Your dad would only let you transfer about £100 from him without permission, so you were secure that he wouldn't complain to much when looking at this expenditure. If you wanted to do more in future, you could always possess one of his female investors and do his business some favours... <br>\r\n<br>\r\nYour dad had chosen to go to work early on this particular day. He left the house at 7:15. You had barely gotten a couple of hours sleep between 3:00 and 5:00, so you struggled to stay awake as you listened to him leave from inside your bed.<br>\r\n<br>\r\nThe front door shut and you sprang to action, picking up the gun from the hidden storage space under your bed. You march to your mum and dad's room, heart pounding through your chest. If this went wrong, teachers would be majorly p'd off.<br>\r\n<br>\r\nYou open the door, gun steadied with both hands like in your favourite American action movies. You could hear your mom’s quietly snoring away. Feeling suitably confident, you move cautiously to her snoozing form... ok, you were ready.<br>\r\n<br>\r\nAIM. FIRE. Nothing. <br>\r\nPhew.<br>\r\n<br>\r\nYou wipe the nervous sweat off your brow. Now for the real test. \"Mom!\" you call, \"Mom, I need help!\". You waited for any movement, your mom would have normally come running if she heard you calling for help. But no reaction.<br>\r\n<br>\r\nYou approach the bed on your tiptoes and quietly lower yourself onto it at your dad’s side. You lie on your back next to her on the bed, half expecting her to turn and shout at you. This was naughty. But you needed to do it. You roll 45 degrees. 90 degrees. You feel the weight of your body slowing your roll. Too heavy. You needed to eat a little less of mom's food and exercise a bit more. 180 degrees. On your front, listening to her shallow, silent breathing on your cheek. 270...<br>\r\n<br>\r\nSlam!<br>\r\n<br>\r\nYou're in your mom again and you're at the end of the bed. “Woah!” You gasp as you accidently carried on rolling, wobbling over the edge of the bed before. Kerplunk. “OW!” You said now lying flat on the floor, your mom’s breasts and her pudgy belly softening your fall slightly.<br>\r\nThey tingled a little in pain because of the impact, it was weird, it felt natural, normal almost... as if this body had always been yours. Your memory contradicted you; this should feel weird. You should sense the difference in muscle and fat and bone ratios. You were wrong. You did not feel that. You felt boobs, and that was strange, but that was it.<br>\r\n<br>\r\nYour mind raced through possibilities, although you began to doubt how much of it was actually yours. Philosophically, this had huge significance. This could prove or dispute afterlife, god, karma... Physically, you figured out why breasts felt strange more than anything else: Your mom would spend half the day in a bra and half outside of it. Yep. Case closed. It must feel we-ird t-o b-e - n-ot w-ea-r-i-n-g -a- b-r-a.<br>\r\n<br>\r\nYou had your mom's boobs, the ones you were suckled on. The ones your dad had undoubtably once groped before conceiving you. The ones you had avoided for all these years because it was so obviously, goddamn, frigging AWKWARD!!<br>\r\n<br>\r\n...<br>\r\n<br>\r\nYou calmed yourself. This was no time to be hysterical. You needed to get changed now.<br>\r\nPussy. You drew your attention between your legs and half-fantasised and half-freaked out in dread. Ew.<br>\r\n<br>\r\nAn experiment. That was all this was. An experiment. Not a pervert. An experiment. Yes. an experiment.<br>\r\n<br>\r\nFor humanity, nature and culture.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nNearly shedding a tear in despair. You try to focus on other aspects of the plan as you strip out of her pyjamas and clothe her naked body in underwear, and a bra held together by an elastic band doubled over (which you had brought into the room with the gun). You would have time for womanly sensations in another woman, okay, this was your mom, this was family... this was creepy.<br>\r\n<br>\r\nSpeech. Mom's voice. Think about that.<br>\r\nOkay... \"Hello. I'm... I'm Tracy, heeh.\" So weird. So weird. So goddamn weird. Strange...<br>\r\nYou practice (getting into your underwear, your mom's underwear...) - your anthropology talk.<br>\r\n\"Ms. Ward, bitch, and class, heh, I'm here to talk to you about my hobby...\"<br>\r\n\"Anthropology sounds more complicated than it actually is...\" such a weird high pitched voice. Your mom's voice was still your mom's.<br>\r\n<br>\r\n\"... I believe that these customs, within our very own classroom, have shaped us as people and will shape our futures, our children's futures and in generations, possibly whole cults and peoples.\"<br>\r\n<br>\r\nAt the same time, you became acustom to your mum's facial muscles and navigate her expressions effortlessly.<br>\r\n<br>\r\n\"Thank you for your time. If anyone other than bitch-face Ms. Ward has a question.\" You grin.<br>\r\nOkay.<br>\r\n<br>\r\nNow for actual decisions. This was something not in your method. What clothes to wear. It had to be a suit.<br>\r\n<br>\r\nStart with the top layer, it was hard to concentrate with your mother's chest so exposed. A difficult choice, not, there was only one shirt there. Plain white. Like the bra. You chose well.<br>\r\n<br>\r\nNow, the skirt. Something to hide her weight, something smart, something black. You settle for a dark brown pencil skirt.<br>\r\n<br>\r\nThe matching blazer. Check.<br>\r\n<br>\r\nA simple necktie. This was familiar check.<br>\r\n<br>\r\nStockings. Eek. After ages of yanking and pulling. You pull your mom's skin-coloured stockings over the flab on her thighs and her plain panties...<br>\r\n<br>\r\nYou had seen so much. Would you have been aroused if you were male? Oh no, what a tough question! What a tough answer...<br>\r\n<br>\r\nFlats. It had to be flats. You could try heels. Could you try heels? No, not heels. Flats.<br>\r\nIn your new shoes, you waddle to the bathroom. Argh. You should have done that first. Why did you do all that planning to make simpleton errors.<br>\r\nWhat felt different?<br>\r\n*<br>\r\nFirst of all your perspective was lower than you were used to, being about 5 inches taller than your mom you could really feel the difference. Your short legs were forced to take more steps to cover the same distance. Then there was her long hair tickling your neck and back as it ruffled. Then with each step you could feel your body jiggling in places it never had before. You couldn’t help being overly conscious of one place especially, your mom’s breasts which jiggled up and down even from within the bra which on its own was completely strange to be wearing. Feeling this thing encapsulating your chest area, it wasn’t made any better since you could feel your mom’s hard much thicker nipples chaffing against the insides of the cups. Who knew having breasts felt so weird. Though you had to admit as much as it felt weird it also felt… kinda nice.<br>\r\n*<br>\r\nYou needed this practice anyway. Like a symbiotic. You had to adapt to a host. You went to the toilet. In one go, you peeled the panties, skirt and tights off. You ogle at the damp... consider experimental progress dammit!!<br>\r\n...<br>\r\nHaving... relieved yourself. You washed your hands and face and, as planned and researched, applied some light make-up and did your hair.<br>\r\n<br>\r\nHaving done everything else, you decided to skip breakfast to catch the bus you had researched, you were not driving and risking lives on theory.<br>\r\nNot excited, not shocked, not anxious, not emotional at all, really, you acquire your key-card, purse and briefcase containing a laptop, the gun and a mirror and set out.<br>\r\n...<br>\r\nYou sit at the bus stop alone. Uncomfortable, you try to recollect how mom would normally sit. You cross your legs and... for the first time in your life, feel better for doing it.<br>\r\nAn experiment that worked.<br>\r\nYes.<br>\r\n...<br>\r\nYou board a near empty bus and sit in the least populated segment in the middle.<br>\r\nA pretty, yet less busty young woman sits next to you. \"Hiya, Tracy.\"<br>\r\nOh, no, a friend from work you didn't know.<br>\r\nYou look around the bus, everyone else is distracted on their phones and tablets. You lay the briefcase on your lap.<br>\r\n\"Whats up? Tracy?\"<br>\r\nYou ignore her and fish out the gun. Aim it at her. Fire.<br>\r\nHer liveliness vanishes and she goes limp, a mere empty husk.<br>\r\n<br>\r\nYou need to possess someone.<br>\r\nIf you leave your laptop on the bus and put the mirror in your blazer, you could maybe fit a husk in, but you would get caught by the next stop, so you would have to decide fast.<br>\r\n<br>\r\n<br>\r\n<br>\r\nleave mom there and take over the woman's body<br>\r\nPut the woman in the briefcase and change later<br>\r\nLeave the woman behind there and stay as mom<br>\r\n</span></div></div>",
            "created":1546318800,
            "id":2597226,
            "title":"To Mom's Office"
        },
        "1511":{
            "author_id":"sbloggsy",
            "author_name":"sblogsy",
            "choices":[
                "Possess the woman who just went into the bathroom",
                "Continue your self-pleasure",
                "Search for another body in the office"
            ],
            "content":"<div class=\"\"><div> <span>The woman's main advantage over your mother was her height, towering at about 6 ft 2, but with most of it due to her unnaturally long, bony, hairless, skinny legs which were rigid straight, all the way down to her tiny heels. She was not especially wide at the hips and upper thighs like your mother was and there was always a fist-wide gap between her thighs. She was wearing a short, grey skirt with black and grey pantyhose, with lace patterns of roses completely covering her legs.<br>\r\nHer belly curved, exiguous with regards to love handles, flat on the surface as if an extension of the legs from her box-like pelvis. Yet her breasts, not at all sagging like your mothers, as if two bombs, frozen in time mid-explosion, not even close to being contained by the bra. You could feel the lace against her nipples, now, your nipples. <br>\r\nYour suit was nearly identical to mom's except the skirt cut off much higher, in part an optical illusion from the heels. Those would be interesting to walk in. You weren't opposed to the experience. That was your purpose, no?<br>\r\nHer arms showcased an identical appeal to her legs, a few inches longer than your own lanky arms. These qualities reflected only beauty to you, not weakness as it did when you were still a boy.<br>\r\nWho? You? Who? Johnny You? Johnny Who? Johnny Thompson, you joke! Tracy Thompson.<br>\r\nTracy Thompson lay there, a motionless husk. You lean over on your seat, feeling several layers of different, foreign, exotic fabrics brush your ass.<br>\r\nYou pack your suit clad mother inside the duffel bag, which you had emptied onto the seat where your mother was, and, despite it bulging suspiciously and being extremely heavy, you decide this is as inconspicuous as you can manage to make things...<br>\r\nLooking around, panicked, you hide the gun and the mirror on the inside of your blazer, pick up the duffel bag containing your mom, and make your way to the front of the coach, leaving expensive material booty behind but carrying some pertness on your own. <br>\r\nThe heels really made it hard to walk on the bus and, you fall over several times, not made easier by a displaced centre of gravity, dizziness after the sudden possession, the motion of the bus, the heaviness of the duffel and the shame of everyone staring. Fascinating.<br>\r\nSwinging your hips and upper body, though, you do realise your rack, your top half, is way easier to carry and less overbearing than when you were Tracy. Oh. You check your pockets: in your outside blazer pocket was a key-card. The name read: Michelle Lloyd.<br>\r\nThe strawberry-blond hair on the photo, barely shoulder-length with possibly permed curling, was held in real life by a single loose scrunchy at the back.<br>\r\nYou lead the hair as you walk. It flips, whips and bounces obediently, like a sentient being on your head, maybe a dog or a cat. It was all yours, yours, yours, yours. <br>\r\n...<br>\r\n\"Looking moody, Miss Lloyd,\" observes the jovial, fat, maniac of a bus driver, when the bus has stopped just outside town.<br>\r\n\"No, I'm fine,\" you grumble. You were never one for speaking sweetly, and you had clearly forgotten to get into character.<br>\r\n\"Monday!\" he laughed, \"Back to work blues for all but me.\"<br>\r\nNarcissist, you think, pervert. You tolerated nearly all kinds of human. Not narcissists and not perverts. They turned History away from the people, from the true heroes. They corrupted the world.<br>\r\n\"You want to know why, Miss Lloyd?\"<br>\r\nYou force a smile, it was the best impression you could do of Michelle's smile when she first met you. You were about to ask but he had started anyway, oblivious to your awkwardness.<br>\r\n\"Me missus is taking me out for dinner, tonight. Fancy that! Date night - after all these weeks.\"<br>\r\n\"Great,\" you say. This was the only thing that could ruin this great moment. Perhaps you would go on a quest to rid the world of people like this guy. Your new-found power could do no better.<br>\r\n\"So, how's-\"<br>\r\nYou just lost it. \"Just shut up you fat piece of lard! Your aftershave stinks and I'm sure you're wife would appreciate you being less communal with your private relationship!!\"<br>\r\nYou storm out of the coach. You accidentally left all money in your purse, so you couldn't get another bus. The driver lets you go. Obviously, the bloke is too fat to chase after you, even if he did notice your purse. That would be enough of a tip for his stupid feelings.<br>\r\n...<br>\r\nUsing the address on the key-card, you navigate to the office building. A beautiful tower of glass worthy of any capital city.<br>\r\nYou meet a male co-worker on the way, who walks with you.<br>\r\n\"Can I help you with the bag?\" he offers.<br>\r\n\"No,\" you murmur.<br>\r\n\"Whatever happened to 'no boss'\", he giggles. Not another one. Was he really that bad or were you just being paranoid. They were all your own emotions. All your own intuition.<br>\r\n\"I'm kidding,\" he informs you, \"jeez, I thought you were the jokester. What's with you today? Lemme guess... did the bus driver drive you insane.\"<br>\r\nYou were about to moan to him, but you noticed the pun and began to smile. \"That's the Michelle I know!\" he says. You pick your head up. \"You'll do great when you take over Tracy's job.\" He reminded you of Sam, and that reassured you.<br>\r\n\"Huh?\"<br>\r\n\"You're both getting promoted. Don't tell her though\"<br>\r\nMom was getting a promotion. \"That's fantastic!\" you cry.<br>\r\n\"I love it when happy accountants get recognised,\" he smiles. You mentally note how he left your mom out of that remark. Was your mom happy at work? You never asked her.<br>\r\nHe pulls out his keycard, swipes it on the scanner beside the door and walks through. You do the same.<br>\r\n\"You'll be every bit the woman as Tracy was.\"<br>\r\nWait. Tracy. Your mom.<br>\r\nYou need somewhere safe to put her for the day. In fact, you need somewhere safe for Tracy, too. Without her laptop, Tracy would not be able to work. Not just that, you didn't even know anything about accounting. <br>\r\nYou spot the women's toilets on the way to the elevator. That was the perfect place to leave mom and collect your thoughts. You might need another body, too. And the toilets was perfect for that.<br>\r\n\"I'm just going to the toilets, I forgot this morning.\"<br>\r\n\"Oh,\" he states, shocked, \"Be quick, Michelle,\"<br>\r\n\"Will do!\"<br>\r\nYou begin running, but almost fall over as you are reminded that knowing how to walk in heels was vastly different from knowing how to run in them. You must have looked really desperate to boss man, because you heard him walk away and call the elevator.<br>\r\nYou enter the girl's toilets and...<br>\r\nLook at yourself. Look at Michelle. You looked good.<br>\r\nYou quickly dump the duffel bag in a random toilet cubicle and pull it from under the door to barricade it. <br>\r\nReturning to your weird reflection in the mirror, you perform the same routine of pulling faces in the mirror as you did with mother, only this time you you wink seductively at your reflection.<br>\r\nYou look around, there was nobody in the bathroom except for you. This was the only mirror in the entire bathroom. You would be able to hear someone approaching from outside. You raise your right leg into the air, feeling gravity, elasticity and movement from the skirt on your thigh. Slowly, you move it upwards, concentrating with avid fascination on the lady in the mirror. The skirt stretches, and then begins to fall back and roll a little at the end, crease in the middle and tighten on the waist. You feel all the physics of it against your thigh as you inch your knee closer to your chest, hook your heel on the edge of the sink and admire the full view up Michelle's skirt.<br>\r\nPink knickers. You can see them through where the tights were stretching in the middle. You could feel them above your thighs. You could feel the organs below the garment. You felt a calling.<br>\r\nYou reset both hands on the top of Michelle's right ankle, and massaged your way up, adjusting yourself for a good view. You delight in the soft fabric on both your palms and fingers, and your legs. Bliss<br>\r\nYou examine the topography of each area, each pleasure spot. All that skin was yours now. All the weight lost was what you could be proud of. What you were showing off to yourself. You had a right to be entitled.<br>\r\nYou had a right to what this host offered in her smooth, dry, cool legs. You could use her two-tone black-grey fingernails. All yours. All you. <br>\r\nYou apply pressure to the warm flesh that was your inner thigh. <br>\r\nYou have a compulsion to stand up. To climb onto the sink. It comes from a primal perversion you held for a long time. This amuses your stolen face. You were a long way out from home. This was unethical, but fun as hell.<br>\r\nYou put all your weight on that one heel, and, outstandingly, you stand without the aid of your hands. You crouch on the sink, perched like a bird. Your lower half is spread open at an obtuse angle, revealing the space between your legs and fixing your skirt to take up minimal space at the hips.<br>\r\nDrooling at the sight of the thin muscles tensing in your legs through the pretty tights and feeling breeze through the knickers, you unbutton the blazer and untuck the dress-shirt.<br>\r\nYou hear someone coming and abort your position at the sink. You scurry into a cubicle and lock the door.<br>\r\nYou try waiting, but impulse takes you over. You pull down the skirt to your feet and grope around your crotch with both hands, pulling at the tights. Hands underneath the tights, stroking the knickers. You peel the tights down. You unbutton the blouse and take it off along with the blazer.<br>\r\nYou look down: close enough and with enough bravado to see the outline of diamond hard nipples.<br>\r\nYou hands cup around the two lumps massaging them harder and harder until you decide to pull the straps down your arms, uncomfortably so. You tug at the back to undo the chest-handcuffs. When you pull as hard as you can, snap, the bra falls to your hips.<br>\r\nGinormous, gargantuan mounds of fat, finishing with brown circles, climaxing with erect, sharp projections, stabbing outwards and upwards into the air. The forms jump and swing with excitement and anticipation for what was below. Pinch. Oh. Harder. Oh yes. Hurts so good. <br>\r\nAnd you...</span></div></div>",
            "created":1546318800,
            "id":2597306,
            "title":"Take the woman's body and fit mom in the br..."
        },
        "15111":{
            "author_id":"sbloggsy",
            "author_name":"sblogsy",
            "choices":[
                "be Olga",
                "be Michelle"
            ],
            "content":"<div class=\"\"><div> <span>You retrieve the gun from your blazer and unlock the cubicle door. Realising that you had essentially cuffed your legs together with your tights, you phase out of Michelle and exit the cubicle.<br>\r\nThe cleaning lady in the bathroom does not look up from the floor that she was mopping. If she had, she would have noticed a pyjama-clad teenage boy in the female restroom of a secure office building - and probably screamed.<br>\r\nYou steady your trembling gun, aiming for her head. You fire.<br>\r\nCRASH!<br>\r\nThe mop gives way and the woman's empty body slams onto the floor. You think...<br>\r\n<br>\r\nThe cleaning lady was an older, stockier woman. Her face was round and her neutral-coloured hair short. She had small facial features - small eyes, small nose, small mouth, but an above average forehead, which was neither good nor bad. She had no wrinkles to show old age.<br>\r\nHer uniform hugged her nondescript figure down from her skinny neck to her plump rear end. Her breasts were larger than Michelle's, but smaller than your mom's. Her arms and legs though, were muscular particularly her impressive thighs, easily three times the width of your old arm. Her skin coloured to a natural shade. She had stood up at 5ft 6 before, so was quite a bit shorter than you were used to being bak when you used to be used to being male...<br>\r\nHer uniform was nice, still, a blue utility dress and apron, going down well below her legs. She wore black flats, which clashed with the near-navy shade of her dress.<br>\r\nShe wore a name-tag, which you read before entering her: Olga Johnsons.<br>\r\n<br>\r\nOlga did not wear underwear. That was a shock. Not necessarily unwelcome, just...<br>\r\nShe also, wore very tight shoes, and a fluffy bra with... padding!<br>\r\nThis was the perfect opportunity to explore as this woman, and see the rest of the office, leaving Michelle and mom behind in a bathroom cubicle.<br>\r\nYou could also use Olga's clothes to disguise Michelle, explore both female bodies in somewhat privacy, explore the rest of the office building with Olga and mom hidden.<br>\r\nThe boss-man-who-reminded-you-of Sam would notice if you were Michelle, and that could get you in great trouble. It could lead to him discovering bodies in the toilets and suspecting some kind of drug conspiracy, and demanding answers from you.<br>\r\nMichelle would be fine if she kept out of his way, though. <br>\r\nYou had been in the bathroom as Olga, you could say you witnessed mom (Tracy) and Michelle in the bathroom to buy more time. You couldn't stall like this until lunchtime, so whatever choice you make would solicit a twenty minute quest and not very much longer.<br>\r\nWhat a significant choice!</span></div></div>",
            "created":1546405200,
            "id":2597458,
            "title":"Possess the woman who just went into the bathroom"
        },
        "15112":{
            "author_id":"sbloggsy",
            "author_name":"sblogsy",
            "choices":[
                "Try to possess the unconscious cleaner",
                "force your way into the busy cubicle and possess the woman within"
            ],
            "content":"<div class=\"\"><div> <span>Forget it. You wiggle the pink knickers down your sexy lower body. The moist red slit is visible through thick columns of hair. You laugh and guffaw boyishly.<br>\r\nYour right middle finger, followed by the other index the forbidden cavern. It reminds you of the time you first discovered masturbation. The pleasure.<br>\r\nThe accommodating crack yawns open receptive, but as your fingers explore deeper the organ convulses, trying to snap shut like a Venus fly-trap, but your fingers spread out and stretch it.<br>\r\nUnimaginable waves of sexual stimulation force you against the wall and you thump your back against the wall, tongue hanging out and hyperventilating. Your fingers twitch at the edge of an ocean of juice dribbling, spitting, oozing fluids falling down her, your legs. You realise just how privileged you are, a jester playing in a god, or goddess. Women had so much more life, more personality, more character on them, the energies, the hair, the boobies etc. The penis was nothing in comparison. A lame joke.<br>\r\nYour purplish sea of emotion cried out tears down your legs as you drag yourself, scraping your bum against the wall, lower to the floor. Your left leg leaps into action and hurls itself at the bathroom door, straining on the tights and knickers bounding your legs together, as you spread wide open.<br>\r\nYou lick your fingers generously and begin to scratch the vulgar, obscene orifice of dreams... Pleasure intensifies, and, rubbing your back against the tiled wall like a bear, moans begin to escape your mouth. An eternity worth of sensation condenses into each second.<br>\r\nYour left hand, unoccupied, pinches hard on Michelle's tit. Drooling and purring softly, you pant like a dog in the heat.<br>\r\nThe vagina goes into spasm. It begins to violently shake and vibrate, beyond your control. You squirt out a puddle of effeminate secretions, coating your thighs, having splattered through drenched, moist pubic hair with a white crusting of sweat and lady-waters, caking your hands and wrists too.<br>\r\nYou sweat and tear up as you suppress a girlish scream in your throat. You had made enough noise to alert everyone in the bathroom. You had ruined Michelle's underwear and skirt with trickles of cum. You had probably better stop.<br>\r\nYou try to shift weight but slip onto your side, staining your blazer in the spillage. You hear the ripping of the lace in the tights and fabric of the skirt. Scared from the fall, you kick your legs, flinging your heels into the next cubicle and completely freeing your right leg from hosiery and skirt, with cold, wet knickers clinging to your foot.<br>\r\nSomehow, by a crazy miracle, you transfer the panties entirely to the alternate foot, and, testing Michelle's flexibility, bend the foot to your nose and mouth.<br>\r\nA strong, simple aroma comes from the panty and pantyhose on your left foot. Both the pink underwear and the now-single black stocking dangle into your mouth.<br>\r\nStretching the already-sore groin area with difficulty, you wriggle the foot around and lodge the blasted lewd fibres into your mouth.<br>\r\nYou have to chew down aggressively on these, swallowing vaginal milk and sweat and gagging on its tastelessness, while both hands continue to pound the vag from the inside. Your legs kick up in the air as you look down on an absolutely horrific crime scene. If only you could close your eyes and continue forever.<br>\r\nYou worm your way about the toilet cubicle, smearing your hair on the wetted floor. No-one would clean this up.<br>\r\nNow naked except for a lone black remnant of what were once black and grey lace hose, bathed thoroughly in your own mess. You reach for the lock on the door and slide it with a wet thumb, making the door handle wet. You crawl on your slender stomach to the middle of the bathroom and see the cleaning lady in the corner, earphone's in, swaying from side to side with her mop.<br>\r\nYou slither over to her and clamp your jaw around her leg, taking down the innocent woman. Your mind regains clarity and your slasher smile fades.<br>\r\nThere was another cubicle occupied, you can tell by the locked door and fair toned ankles...<br>\r\nThe woman opens her mouth, preparing to yell, you have to act fast.<br>\r\nYou repeatedly bash the woman's head against the wall, phase out of body, a clean pyjama-clad teen once more, and run into the cubicle, your feet splashing on your snail-trail. You pick up the possession gun and...</span></div></div>",
            "created":1546405200,
            "id":2597636,
            "title":"Continue your self-pleasure"
        },
        "151122":{
            "author_id":"adianjayz",
            "author_name":"adianjayz",
            "choices":[
                "You suddenly feel hungry.",
                "You suddenly feel lightheaded.",
                "You suddenly feel nature calling."
            ],
            "content":"<div class=\"\"><div> <span>You ponder your options for your next target. You don't want to go back to Michelle's body, since you left her in quite a mess. You also don't want to possess the cleaner lady. After banging her head against the restroom wall too many times, you are afraid that taking her body would just leave you with a big headache. That leaves only one option, as your eyes slowly pan over to the occupied cubicle.<br>\r\n<br>\r\nYou make your way to the cubicle adjacent to the occupied one. You stand on the toilet lid to take a gander at the occupant from above. The woman, looking to be in her early to mid-20s, is feverishly typing on her smartphone, apparently answering several friends' texts. Loose, light brown hair flows down the sides of her cream-colored face. She is wearing a white button-down blouse with an emerald and sapphire necklace around the collar. Outside, the woman wears a royal blue blazer that looks colorful yet sharp. Below, she is wearing a tight black pencil skirt that ends couple of inches above the knee. Scanning down her crossed, slender legs, you notice that her feet are encased by white mid-heels. Overall, the outfit has a bright tone that is not seen in either your mom’s or Michelle’s outfit. <br>\r\n<br>\r\nYou surmise that this woman is a recent intern in the office, given her more youthful demeanor and appearance. “Actually, being a young intern wouldn’t be bad, since I won’t have many responsibilities. I could just stay back and plan my next move. Besides, her body is quite well-toned…”, you think to yourself. <br>\r\n<br>\r\nAs you salivate over your potential new body, you feel your leg slip a bit, and you quickly grab the cubicle wall to prevent yourself from falling. However, the sound from the impact alert alerts the young woman, as she looks up from her phone. Surprised to see a peeper into the cubicle, the woman is about to scream. Knowing that you are caught, you quickly grab your possession gun and take aim at the young woman. Before she can scream, you pull the trigger. Closing your eyes by instinct, you are half expecting a scream. However, the scream never came. Similar to the previous attempt, the woman stops moving, sitting cold as a lifeless husk on the toilet seat. <br>\r\n<br>\r\nBefore anyone else enters the restroom, you immediately hop over the cubicle wall and land in front of the lifeless body. Taking one last quick glance at the body that you will take over, you turn around and sit on the toilet to phase yourself into the body. When you fully enter the body, you black out momentarily before opening your eyes to your new view.<br>\r\n<br>\r\nYou find yourself facing toward the cubicle door with your legs crossed. One of your hands is holding a phone. You hold the phone up to your face. The screen displays a half-written message replying to an invitation to a girls’ night tonight. You smile to yourself, thinking that it could be interesting to see what girls would do at these gatherings. After all, these are the things you are curious about as a high school boy. After finishing the text message, you stick the phone into a blazer pocket so you can inspect the other curiosities of this body. <br>\r\n<br>\r\nWhile some feminine sensations feel similar, there are certainly some differences. You move your hands to your chest to feel your new breasts. They are not too bad, but they certainly don’t compare to your mom’s. You speculate that your new breasts are just a cup size smaller than Michelle’s. However, the smaller breasts mingle well with the slender form of this body. Feeling down your new torso, you uncross your thin and long legs. In contrast to your previous hosts, you are not wearing any tights or pantyhose. It feels like you are not really wearing anything below the torso besides a thin layer of panties. The cool air draft in the restroom rushes up between your legs and into your crotch area, accentuating that weird feeling. But speaking of panties, you are curious to see what color this woman is wearing. You predict that she is wearing something flashy. Even without looking, you can feel that the lacy panties don’t cover much of the nether region, which turns you on. You slowly spread your legs in anticipation, feeling the skirt stretch and slowly rise along the uncovered thighs…<br>\r\n<br>\r\nYou suddenly hear a stir from outside the cubicle. You stop in your tracks, afraid that someone heard you for some reason. As you listen closer, you hear a person getting up from the floor, slightly moaning in pain. “It must be that cleaning lady,” you whisper to yourself, slightly jumping at the high-pitched voice coming from your mouth. You never had the opportunity to hear this voice, as the woman never spoke in the restroom. <br>\r\n<br>\r\nThe cleaning lady mutters, “This job is going to kill me someday. I need to either quit or ask for a decent raise.” The lady then walked out of the restroom, still rubbing her head and moaning from her apparent headache. You feel somewhat sorry for her, as she really does not deserve the repeated hits to the head. You are just caught by surprise when you made your way out of the cubicle. But it does not matter now; you have a new body to explore and a new opportunity to experience. <br>\r\n<br>\r\nAs you return to feeling yourself, you suddenly feel a discomfort from your new body. <br>\r\n</span></div></div>",
            "created":1550984400,
            "id":2622494,
            "title":"Force your way into the busy cubicle and posses..."
        },
        "1513":{
            "author_id":"sbloggsy",
            "author_name":"sblogsy",
            "choices":[
                "Leave mom there and take over the woman's body",
                "Put the woman in the briefcase and change later",
                "Leave the woman behind there and stay as mom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or do one of these?</span></div></span></div>",
            "created":1546318800,
            "id":2597253,
            "title":"Something Else."
        },
        "152":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Katherine Judd",
                "Emma Peters",
                "Somebody Else."
            ],
            "content":"<div class=\"\"><div> <span>Staring at your own mom’s grinning face in the reflection a mischievous idea popped into your head. You definitely wanted to tell your friends about the gun. But what sort of friend would you be if you didn’t have a little fun with them first and while you were at it you could have yourself a little exploration. Afterall you couldn’t have this power and not see tits. <br>\r\n<br>\r\nThat meant there were a few possible targets.<br>\r\n<br>\r\n<b>Katherine Judd</b> was Sam’s mom. Taking over her was especially tempting being a total and utter MILF! Toned and athletic, she was a blonde bombshell. Having for years imaged what she looked like naked, dreaming that the divorced lady would fancy you and one day take you into her room, dropping her gown and showing you her beautiful body.<br>\r\n<br>\r\n<b>Emma Peters</b> was Travis’s mom and much like her short chunky son, she was a short chunky lady. She was an exceptionally kind and intelligent woman, working as the head of HR at some big firm in the city. Whenever you went around to Travis’s she always catered to your every need. Maybe today she could take that a step further and lend you her body so you could prank Travis.</span></div></div>",
            "created":1552174860,
            "id":2628212,
            "title":"Something Else."
        },
        "1522":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Continue Exploring",
                "Go See Travis.",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>Leaving your mom lying on the couch you grabbed your bike and bucked ass over to Travis’s house. As much as Sam’s mom was unbelievable you wanted Travis to be the first person you told about the gun, having always been closest with him. Also with Travis’s dad currently out of town on business there was no better opportunity than today to have some fun with Travis whilst wearing his mom’s body.<br>\r\n<br>\r\nIt didn’t take long for you to arrive at Travis’s large house. Scouting out the front window you planted your bike around the side making sure not to be spotted as you made your way around the back. You looked like a spy on a mission as you moved along the walls stealthily with the magic gun by your side. Peaking through an open window you could see his mom at the sink doing the washing up. Pulling at your phone you text Travis,<br>\r\n<br>\r\n“Wuut?” You sent.<br>\r\n<br>\r\n“Not much. Just sat in my room playing Apex why?” He replied a second later. This was going to be too easy. <br>\r\n<br>\r\nPeaking back around, his mom was still there. So slowly you raised the gun up, aiming it at her through the open window and pulled the trigger. She instantly froze with a plate still firmly gripped in her hand. You were about to hoist yourself through the window when all of a sudden Travis walked in.<br>\r\n<br>\r\n“Shit!” You cursed quietly ducking back out of sight.<br>\r\n<br>\r\n“Hi mom. We got any Chocolate?” He said as he entered, going over to one of the cupboards and looking inside for a moment unaware that his mom had been petrified. You gazed in anxiously as he seemed to take an eternity to search the cupboard, what were you going to do. “Jackpot!”  Travis suddenly blurted out as you tried to come up with a plan. “No worries mom. I found some.” He said as he turned and jollily waddled out ripping open a Mars bar as he exited the room clueless to the fate that had befallen his mom.<br>\r\n<br>\r\nYou breathed a sigh of relief, waiting a few seconds before then traversing through the window. Dropping down inside you quickly scurried over to his mom, giving her a brief look over but not wanting Travis to return you quickly phased into her body. Instantly you felt your whole body was different, feeling yourself being weighed forward as you opened your eyes. Putting down the plate you raised your hands in front of your face. They were Mrs. Peter’s hands.<br>\r\n<br>\r\nWanting to see yourself you sprinted over to a mirror in the hallway finding Travis’s mom staring back at you as you slipped into view. “Wow!” You said in amazement. The sight being totally wild to see someone other than yourself looking back at you in the mirror.  You puffed up your cheeks and pulled a funny face, Mrs. Peters copied you in the mirror and you couldn’t help but let out a little laugh at how silly she looked. <br>\r\n<br>\r\nThen naturally your eyes gravitated downwards. You were wearing a baggy purple sweater, the sort of thing Travis’s mom normally wore. It rounded out over her chubby belly, then lower down her legs were squeezed into a pair of loose fitting jeans. Mrs. Peters not exactly being the epitome of fashionable or good looking, seemingly just preferring to look like a regular plain Jane not doing anything special with her clothes or hair, just letting it hang casually, yet neatly down to her shoulders whilst her face only had a slight hint of make-up. She was more motherly than MILFy. Or more so now you were, it being pretty hard to forget seeing her plump motherly reflecting back and feeling a foreign tingly sensation resonating from between your legs as a result.<br>\r\n<br>\r\nYour eyes sashayed down to the spot where you felt it, moving a hand there and cupping the mound that you knew was Mrs. Peter’s vagina and thrusting out like Michael Jackson. You pressed in a little harder feeling the tingling intensify. You looked behind you up the stairs to where you knew Travis’s room was as a mischievous thought cropped up. “Maybe just a little bit.” You grinned to yourself as you turned and began up the stairs. At the top you quietly tiptoed passed Travis’s room, still feeling like an intruder even while possessing his mom. Getting past unheard you quickly slipped into his parent’s room.<br>\r\n<br>\r\nYou gasped quietly as you looked upon his parents for the first time, it being previously out of bounds. The room being gigantic compared to your own room with a huge king sized bed in the middle. Though right now you weren’t here to check out the real estate. Moving over to the wardrobe mirror to see your stolen reflection.<br>\r\n<br>\r\n“Hi Mrs. Peters.” You grinned at her image cockily, she’d absolutely kill you if she knew what you were doing. But she couldn’t, her body down to the last freckle being completely under your control and you planned on exploring it. She wouldn’t have been your first choice but still, you were here wearing her body having her tits and vagina attached to you, how could you not check them out even if just for the novelty.<br>\r\n<br>\r\nSo rather unceremoniously you began, “Here goes!” Grabbing the hem of the thick purple sweater you pulled it up over your head and dropped it to the floor. You brought your gaze back to your reflection only to be left completely dumbfounded by what you saw. “No way!”<br>\r\n<br>\r\nHanging in front of you, clad in a lacey white bra were two of the biggest tits you’d ever seen. Each one being as big as a soccer ball bulging out from the bra forming a deep long cleavage down the center. “Mrs. Peters what have you been hiding?” You asked her impressed. How had she kept these a secret from you for all these years you’d been friends with Travis. “This changes everything!” Travis’s mom was veritably stacked. They clearly weren’t the perfect pair of breasts, the huge sacks sagging quite a bit, clearly filled with fat, swinging down and resting atop her chubby stomach forming and impressive shelf of abundant titty flesh. <br>\r\n<br>\r\nLooking closer you could see two large brown nipples smushing up against the translucent material of the bra cups. You reached up and pinched them, giving them a little tug and feeling them tingle pleasurably. “Oh I have to see these!” You stated, your hands reaching quickly behind your back as you fiddled with the latch. <br>\r\n<br>\r\n“Come on. Come on!” You groaned as you fidgeted, “Yes! Got it.” The weight on your chest suddenly got heavier as the latch pinged open and without warning the bra dropped to the floor as Mrs. Peter’s boobs came tumbling out. Your eyes widened as you took in the sight. <br>\r\n<br>\r\nNow unrestrained they sagged even lower to just above her belly button, hanging like two huge teardrops from her chest. You’d heard Sam best describe breasts like these, they were like “two huge socks filled with sand” and a lot of it. Each heavy sack looking so full and heavy, it being no wonder they sagged down, their being marks on the pale skin where it had stretched having tried and failed to keep the huge masses firm and perky. Capping off each impressive udder were two equally as impressive nipples, the brown rubbery nubs being long and thick, surrounded by a humongous areola that must have been as wide as a small plate, taking up a significant proportion of the breast.<br>\r\n<br>\r\n“My god Mrs. Peters these are insane!” You stated completely blown away. Your friend’s mom having a pair of extremely vulgar breasts, and somehow she’d kept them hidden from you for so long. You and your friends just thought she was fat, yet though she was still a bit chubby what made her look fat was the fact that she had two monstrously massive tits hanging from her chest. It was no wonder she kept them hidden Mrs. Peter’s being a literal human cow carrying these huge udders around.<br>\r\n<br>\r\nYou couldn’t help but bring your hands up and grab the fleshy mounds, feeling the saggy flesh sinking into your palms as you squeezed harder, smushing them into your chest like playdough radiating a satisfying pleasure. You grabbed the long nipples and began pulling and twisting at the rubber nubs impressed with how long they could stretch looking like two delicious Salamis as you toyed with them. You couldn’t resist pulling one up and biting it between your teeth, taking it in your mouth and sucking at it whilst you mauled the other one in your hand. It didn’t taste like Salami but chewing and licking at the rough yet bouncy texture of the sizable nipple sent you crazy. Feeling your whole body tingling in pleasure as you continued mauling with your hand and gnawing with your jaw all the while watching the image of Mrs. Peters going to town on herself in the mirror. It being absolutely wild. Feeling the pleasure building up inside of you, growing greater and greater before…<br>\r\n<br>\r\n“Oh yeah!” You couldn’t help but scream out as the pleasure exploded from inside of you. Falling forward, your knees numb, you managed to catch yourself on the wardrobe. Standing their panting as your breath fogged up the mirror, basking in the pleasure surprised at how good you currently felt. Had you just orgasmed in Mrs. Peter’s body, and only using her tits.<br>\r\n<br>\r\nYou pushed yourself back up and stepped away from the mirror to look back at your reflection. Mrs. Peters stood there looking flustered, sweat dripping down her face and without a top on, her two humongous tits on show, each one red from groping and one wet with saliva. It was a wild view and one that you should never be seeing. Yet here you were having stolen Mrs. Peters from her house work you were exploring her body to your hearts content and right now you had no intention of stopping.<br>\r\n</span></div></div>",
            "created":1552182900,
            "id":2628238,
            "title":"Emma Peters"
        },
        "15221":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "Continue (Reserved)",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>Lifting up your dainty hands you took Mrs. Peter’s huge boobs in them still completely amazed that she had managed to hide such vulgar atrocities from your for this long. Her body being totally hot, not your normal preference but seeing her so brazenly displaying her huge pale sacks and wide brown areola was just unbelievably erotic. Watching and feeling as you gave her long thick nipples a twist you experienced a tingling sensation coming from your loins.  <br>\r\n<br>\r\n“Well no point in stopping now.” You said as your eyes drifted to where you knew her vagina was hiding. Being able to make out her pussy lips quivering knowing where this was about to lead. Starting at the belt buckle you quickly pulled it out. This was going to be it, your first real life vagina, Mrs. Peters non the less, but still a vagina all the same. You bent over feeling your massive tits swinging down as you hooked your fingers into both your panties and jeans before without much preparation yanking them down and kicking them off presenting to you Mrs. Peter’s sex. <br>\r\n<br>\r\nYour eyes grew wide as you stared upon it, finding yourself unprepared and amazed at the sight in front of you. Mrs. Peter’s vagina was definitely an outie, her two thick wrinkly pink labia sticking out prominently and parting to reveal a deep crack of shimmering pink flesh in between. Surrounding the flowery flesh was a thick layer of black pubic hair spreading across her front section like an out of control jungle. You weren’t even shocked, knowing that Mrs. Peters wouldn’t get any action, her husband always being out of town, clearly having let herself go as a result. You combed your hand through the thick bush, bending into a squat and moving towards the mirror to get a better look. Ending up on the floor with your legs spread wide for the best possible angle. Seeing Mrs. Peter’s beaming face peaking over her chubby belly like a meerkat in the mirror. <br>\r\n<br>\r\nYou lowered your fingers and stroked the outer lips, jolting slightly, surprised at how nice it felt. Then you grabbed at each lip and pulled them apart, opening up Mrs. Peter’s vagina so that you could see inside. You could hardly comprehend it, the image being so surreal, you were staring into a real-life vagina. “This is insane.” You couldn’t help but say as you looked into the fleshy folds. You'd watched porn before but never did they get this up close and personal, right now you could see every fold of the moist pink glistening flesh doubting that even Mrs. Peters had carried out this depth of inspection of her sex.<br>\r\n<br>\r\nFrom here there was only one place to go and that was deeper. So taking two fingers you slowly inserted them into the hole feeling the wet soft flesh of Mrs. Peter’s vagina envelop them as you did. Watching as they were sucked in deeper before they eventually both disappeared inside. You wiggled them around a little bit, feeling the wet cushiony walls before you slowly began to pump in and out with the two digits, feeling your neck instantly arch back as pleasure coursed through your body. You couldn’t help but bring your free hand up and grab viciously at your breasts as your other went to town on your vagina. Once again you found your self lost in masturbation. <br>\r\n<br>\r\nMuch like you had earlier you slipped a nipple into your mouth, now every part was accounted for. Feeling pleasure resonating through your whole body unable to stop your self from moaning as for the next few minutes you went to town on Mrs. Peter’s body. It being a feeling incomparable to anything you’d ever felt, completely blowing masturbation in your own body out of the water, women really having it good. <br>\r\n<br>\r\nIn the end, as the pleasure came to a peak, finding yourself with three digits working away at your vagina with one your tits stuffed into your mouth to stop yourself from screaming. Which was just as well as when you finally erupted in a spasm of all-consuming pleasure, you let out a loud moan which still managed to resonate even through your breast stuffed mouth. You flopped down on the floor in ignorant bliss feeling juices leaking out of your tingling vagina.<br>\r\n<br>\r\nYou lay there sprawled out on the floor basking in the afterglow of your insane orgasm for a few minutes before you found the energy to sit up. Looking in the mirror at your reflection you nearly came again. Sitting there slouching was Mrs. Peters completely naked with her legs spread wide, her dripping vagina on clear show, whilst her humongous tits hung pendulously down to her sides. Her hair was dishevelled, and she had a satisfied look splattered across her face looking like a horny slut who’d just masturbated herself to orgasm. You couldn’t help but smile.<br>\r\n<br>\r\nPushing up on your elbows you clambered to your feet. You briefly looked over your fully naked form in the mirror having been too preoccupied with your vagina to do so before. Finding Mrs. Peters body to look totally insane. From her huge tits humping prominently out, lurching over her slightly chubby belly. Then down to where her hips reached out wide and motherly, curving down into two chunky legs and thick thighs and then behind into an extremely fat and wobbly ass. You gave it a firm slap and watched it jiggle. “A lot of junk in that trunk.” You laughed before moving away from the mirror and heading into the bathroom where you watched in another mirror as you sauntered over to the towel rack your whole body wobbling like it was made of jelly. Grabbing a towel you set about drying yourself off trying not to get too enthralled as you rubbed your body all over.<br>\r\n<br>\r\nOnce you were done you looked over your stolen body. Now it was time to do what you came here for and have a bit of fun with Travis.<br>\r\n<br>\r\nYou sauntered back into the bedroom and over to the wardrobe. Opening it up you found it filled quite sparse. On one side there were men’s clothes hung up, clearly Travis’s dads, and then on the other there were just a few thick sweaters, and a number of suits and coats. “Well this is boring.” This wasn’t going to do if you wanted to have some fun with Travis. You pulled open the top drawer on the closet, it was filled with boring panties and bra’s each one like parachutes and being made more to cover up and support Mrs. Peter’s huge tits than to show them off. “Won’t be needing any of these.” You grinned moving onto the next drawer. It was filled with t-shirts. You pulled out a plain green one holding it up in front of you, disappointed by how large and baggy it was with only a small hole at the top where the head came out, showing absolutely no cleavage. Searching through the rest of the drawers the theme was the same.<br>\r\n<br>\r\n“Absolutely nothing.” You huffed stepping back from the wardrobe. You thought for a moment when suddenly you remember that there was always a pile of laundry down in the utility room. If you couldn’t find anything sexy then putting some of Travis’s clothes on would always be funny. Imagining that your current form would struggle to fit into even his clothing. His T-shirts would be like crop tops with Mrs. Peter’s monster tits.<br>\r\n<br>\r\nYou creaked open the door and looked out before slipping out of the room and through the hall your naked body wobbling around finding it quite funny to be streaking through the house. Imagining that Travis would think his mom had lost her mind if he saw her doing this. A part of you wanted him to be downstairs in the kitchen just so he could catch you but unfortunately, he was no where to be seen. Even so if anyone happened to look in any of the windows they were sure to see Mrs. Peters running naked through her house. Regardless you headed straight for the utility room and as suspected found a pile of dirty clothing in a basket. You closed the door before heading over to it.<br>\r\n<br>\r\nScuffling around inside you found a dirty pair of Mrs. Peter’s panties, giving them a sniff, having a slight musky odor to them but it otherwise being quite nice. Definitely erotic. You chucked them to the side and carried on searching eventually pulling out a shirt that belonged to Travis. It actually being from you, well your mom, for his birthday. It being red and reading “No Mom, I can’t pause an online game.” Giggling at the irony seeing as you were about to don it. <br>\r\n<br>\r\nPulling it over your head you had to tug hard, Mrs. Peter’s was smaller than Travis yet her humongous tits meant the shirt had to be stretched obscenely in order to get it on. The end result being that your tits were instantly obvious, the strained material reaching to just below where they sagged to being able to see their undersides if looking from below. Your nipples were eager to make themselves known poking through the stretched red material with ease. <br>\r\n<br>\r\nYou went back to the basket and donned a pair of his black joggers, on your legs they were fine but higher up Mrs. Peter’s fat ass ate them up, the shape modling to her big ass cheeks and on the other side yanked into her vagina creating a prominent camel toe. Looking yourself over you were pleased with how incredibly stupid you looked, there being absolutely no way Mrs. Peters would want to be caught dead in what you were wearing. Yet here she was looking like she was a teenage boy who’d been wearing these clothes before suddenly transforming into a chubby huge titted middle aged woman. Her whole body squeezed tightly into the too small clothing emphasising every obscene part of her incredibly vulgar body.<br>\r\n<br>\r\nNow it was time to go have some fun with Travis.<br>\r\n</span></div></div>",
            "created":1552261980,
            "id":2628636,
            "title":"Continue Exploring"
        },
        "15223":{
            "author_id":"jonx2016",
            "author_name":"MrSuits",
            "choices":[
                "You head back to the house.",
                "Johnny suddenly turns up at the den.",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>*** Travis’s POV ***<br>\r\n<br>\r\n“God damn reload!” You fumed as you were killed for yet another time on Apex Legends. It really wasn’t your game, or at least you needed to be playing with your friends to actually be in with a chance of winning. But none of them seemed to be answering at the moment. You checked your phone again. Absolutely nothing, Johnny having text you seemingly wanting to do something only to not reply for over the past hour. I wonder what he’s doing? You thought to yourself just as your belly erupted into a bellowing rumble. “You want some food?” You asked your seemingly sentient stomach.<br>\r\n<br>\r\nIt was about time for tea, you wondered what your mom was making tonight. Bouncing to your foot you set off to find out, bounding down the stairs and into the kitchen. “Mom what’s for tea?” You asked as you rounded the corner expecting her to be in there making tea or doing some housework. She wasn’t there. You headed into the living room, maybe she was watching TV. No not there either. Maybe she’s in her room.<br>\r\n<br>\r\nHeading back upstairs you went over to her door. Planting one knock on it. Then two. No response. Has she gone out? You wondered. Turning the door handle you slowly creaked open the door and looked in to see if your mom was there.<br>\r\n<br>\r\n“Mo…” You began but stopped, your heart skipping a beat at what you saw. There sprawled out on the bed was your mom, completely naked. Her chubby body wobbling around manically as she rammed her fingers deep into her shimmering vagina. Further up her other hand groped viscously at one of her tits whilst the other sack of flesh was stuffed into her mouth, gnawing away intently. She was totally lost, unaware of your presence, furiously getting herself off finding yourself unable to look away. Your jaw about down to your knees as you just stood there watching. Feeling your trousers tighten at the front as your dick grew hard at the sight. A huge part of you wanted nothing more than to close the door and run, forgetting anything you’d seen, this was your mom for god’s sake. But the sight in front of you was just too erotic. Finding yourself blown away at your mom’s body. Her tits looking absolutely ginormous as she greedily mauled and sucked at them, watching the huge pale sacks of flesh wobbling unbelievably as she bounced up and down. Then capping them off in the center were two equally as massive nipples. The two very nipples you sucked on as a kid, the long brown nubs stretching and twisting impressively as she toyed with them.<br>\r\n<br>\r\nSuddenly she thrust her hips up and out of her mouth came a whaling moan, muffled by her breast which was still rammed into her mouth. Jerking instinctively you closed the door and ran back into your room quickly jumping onto your bed facing against the wall. You lay there in silent hoping your mom hadn’t heard you slam the door, scolding yourself for being so heavy footed. A minute later you heard her door open. You listened to her footsteps, they were coming closer! Then they stopped, right outside your door at the top of the stairs. You took a deep breath trying to be as quiet as possible. Please go down stairs. Please go down stairs. You pleaded internally.<br>\r\n<br>\r\nYour door creaked open and you heard your mom walk in. You faced the wall as she closed the door behind her.<br>\r\n<br>\r\n“Travis?” She said, she knew, you could tell from her tone. You daren’t turn to her.<br>\r\n<br>\r\n“Yes?” You asked meekly.<br>\r\n<br>\r\n“Travis did you see what mommy was doing?” She asked sternly. Fuck!!! You froze not knowing what to do, your mom had caught you spying on her whilst she got herself off, you’d be grounded for a month. A year even! Why did I have to stay!? Fuck my teenage hormones!<br>\r\n<br>\r\n“Travis? Did you? Look at me Travis!” She demanded, she sounded unbelievably pissed.<br>\r\n<br>\r\n“I… I wasn’t. I… I didn’t mean to. Its just I…” You began stuttering nervously. You turned to look at her, “It’s just I…” You jerked back again as your eyes went wide. She was still naked! Your eyes dropping down to her tits, it being practically impossible to ignore the two huge sacks hanging pendulously from her chest. Your mom’s tits being of absolutely insane proportions, big and round and crammed full of titty fat. Swinging down and resting on her chubby belly like two humongous tear drops. You tried to pull your vision away, fully aware that your mom could see you staring at her. But you couldn’t help but feast your eyes on the buffet that was her naked body as she stood there not even bothering to cover up as if inviting you to stare. Studying her long brown nipples and wide areola, before moving down to her glistening vagina and the bush of pubic hair above it.<br>\r\n<br>\r\n“So it seems you were staring.” She chided tilting her head slightly and raising her hands to her hips looking at you in disapproval. Weirdly as you pulled your eyes from her vagina, she had a mischievous smirk across her face. Was she enjoying this? <br>\r\n<br>\r\n“I… I…” You stuttered, what on earth could you say. You’d been caught red handed perving on your mom twice now.<br>\r\n<br>\r\n“Zip it!” She snapped, moving in slightly closer. You couldn’t help but watch her big tits swing slightly as she did. “So you like mommy’s body do you?” She then asked towering above looking down on you with a jaded grin. You tried to utter something, anything. But nothing came out but air. “Do you like mommy’s big tits?” She reached up and hoisted her tits up in her hands looking down as if to assess them herself. “I definitely like mommy’s tits.” She said giving them a little jiggle in her palms. You could feel your brain melting in your head as you tried to make sense of what your mom was doing, why was she acting so strangely? Normally she didn’t even go swimming at the beach because she didn’t want anyone to see her body and yet now she stood openly presenting herself to you. <br>\r\n<br>\r\n“And they taste nice too.” She lifted one up to her face and took the nipple in her mouth pulling in her cheeks as she sucked before letting it go with a loud pop. “Here you try.” She said leaning into you and raising up her tit for you to suck, an excited look on her face.<br>\r\n<br>\r\n“Mo… Mom I don’t…” <br>\r\n<br>\r\n“Suck it!” She demanded sternly. Her glare now an intimidating scowl. <br>\r\n<br>\r\n“Bu…”<br>\r\n<br>\r\n“Suck it!”<br>\r\n<br>\r\nWhy was she doing this? You pleaded internally. Your eyes lowered down from her face to the tit she presented to you. The long brown rubbery nipple pointing directly towards you. Slowly you moved forwards your mouth slightly agar. You hesitated for a second, surely you couldn’t do this.<br>\r\n<br>\r\nYour mom had other ideas. Suddenly she grabbed the back of your head and pulled you onto the waiting nipple. You felt it hit your tongue before naturally you jerked the other way pushing away from your mom. <br>\r\n<br>\r\n“Sto…” She pulled you back in filling your mouth with her soft titty flesh. You pushed away, this time she moved you momentum and came with you. Forcing you back on the bed she leaped on top of you mounting you with her leg on either side as you tried to struggle free. But she was too heavy and she carried on forcing your face into her tits. Finding yourself almost suffocating with your head now in between the two massive sacks whilst she swung her them from side to side slapping you in the face with her giant boulders.<br>\r\n<br>\r\n“If you love mommy’s titty’s so much, have them!” She said laughing, bouncing up and down, enjoying herself as she taunted you. You meanwhile overwhelmed with shock, fear, confusion, and betrayal felt your eyes begin to well up with tears and with an almighty wail you cried out. “Stoooop!”<br>\r\n<br>\r\nShe did. Pulling back away she looked down on you, her face dropped into a look of shock as she eased her pressure and you managed to wriggle out from underneath her. Quickly you sprinted off and out of the room, running downstairs and straight out the front door before steaming down the street. Eventually you arrived at a den you and your friends had made in the nearby woods. Dropping down inside you continued to bawl your eyes out trying to make sense of what on earth had just happened. Your own mom had just sexually assaulted you. It was like she was a different person, abusing and taunting you with her naked body. What was worse is you could feel your still hard dick pressing against your trousers. So many different signals going off in your head you just sat there with your head in you hands completely and utterly dumbfounded.<br>\r\n</span></div></div>",
            "created":1552699860,
            "id":2630758,
            "title":"Travis POV"
        }
    },
    "info":{
        "author_id":"jonx2016",
        "author_name":"MrSuits",
        "brief_description":"You come across a special gun which lets you possess the body of anyone you like.",
        "created":1546203660,
        "description":"<td align=\"left\" class=\"norm\"><b>Who are you?</b><br>\r\n<br>\r\nYou’re just a normal perverted boy named Johnny Thompson. In between going to school, playing football and hanging with your friends you don’t get up to much. However that was all to change when one Friday night you make a miraculous purchase that opens up your world to all sorts of mischievous sexual hijinks and opportunities. This purchase was the ‘Possession Gun’ a mysterious device that allows you to possess the body of anybody you please.<br>\r\n<br>\r\n<span class=\"cgreen\"><b>How does the gun work?</b><br>\r\n<br>\r\n-\tShooting a victim with the gun will cause them to freeze in place, turning them into an empty husk for a minimum and maximum of 12 hours. In this state they are unaware of anything going on so you can do with them as you please. Alternatively, in this ‘husk’ state you can phase yourself into their frozen body by simply thinking about doing so and stepping literally into their body and taking over control of what was once theirs. <br>\r\n-\tEach possession lasts a maximum of 12 hours however control of the victim’s body can be released simply by thinking about leaving their body. At which point you will phase out of them. However, they will remain frozen in place until the 12-hour time limit of the Possession Gun is up. Therefore, once a victim has been shot either you are them, or they are a frozen husk. When they are a husk anybody is able to take over their body simply by thinking about taking over it and walking into it.<br>\r\n-\tWhen in control of a target you do not have access to any of their memories or mannerisms and will be completely in charge of controlling their body.<br>\r\n-\tOnce the 12-hour time limit is up you will be ejected from their form and if conscious at the time of ejection they will snap straight back to life. The magic of the gun ensure they are unaware and unsuspicious of any time lost as a result of the Possession Gun.<br>\r\n-\tYou can possess a person whilst wearing another person’s body. If the timer is up for a possessed person who you possessed another person whilst wearing they will suddenly phase out of you.<br>\r\n-\tUpgrades can be bought from the gun catalogue though they are generally pricey.</span><br>\r\n<br>\r\n<b>Characters:</b><br>\r\n<br>\r\n-\t<b>Johnny Thompson (You):</b> You’re a slightly below average 16-year-old boy, in year 11 at high school. You have a nice way about you but can be mischievous at times. Due to your poor athleticism and average looks you get picked on by those looking for someone to torment, mainly Ed. Your have three best friends; Sam, James, and Travis who you share your passions for Fortnite, football, and big breasted women. You’re about 6 foot 1 and a bit lanky, with blue eyes and short brown hair which you sweep over to the side.<br>\r\n<br>\r\n-\t<b>Tracy Thompson:</b> Your 43-year-old mother. Works at an office in the local town though you’re not actually sure what she does. She is a kind lady however she can be stern when she wants to be. She is relatively short and slightly pudgy, has dark brown shoulder length hair and greeny-blue eyes. She had a pretty but plain face which was lucky for you, meaning that your friends didn’t wind you up unlike with Sam’s MILF of a mom who you all regarded as the best MILF of all time. <br>\r\n<br>\r\n-\t<b>Matt Thompson:</b> Your 45-year-old dad. A tall, burly man standing at about 6ft 4in, which is where you inherited your height. He was usually quite busy at work, though he owned his own business so got to decide when he wanted to work. That seemed like all the time and you very rarely got to hang out or have fun with your dad.<br>\r\n<br>\r\n-\t<b>James Anderson:</b> One of your three best friends. He was the good looking confident one of your group. Tall and well-built with wavy blonde hair he had a few girls fancy him even if he was too scared to pursue them.<br>\r\n<br>\r\n-\t<b>Sam Judd:</b> One of your three best friends.  He was a little bit of a prankster, still reasonably looking he could come off as quite irritating. Like marmite people either love him or hate him.<br>\r\n<br>\r\n-\t<b>Travis Peters:</b> One of your three best friends. He was kind of the runt of the group, he was a little bit overweight and you sometimes wound him up about it, it was only playful banter though, if anyone else said anything to him then you always had his back.<br>\r\n<br>\r\n-\t<b>Megan Bennett:</b> A girl from your school of whom you’ve had a crush on for at least two years. She didn’t mind speaking to you though interactions with her were few and far between since she hung with the popular girl group who really weren’t fond of you and your friends. She was beautiful with long blonde hair and a slim, athletic figure.<br>\r\n<br>\r\n-\t<b>Mrs. Ward:</b> You’re strict English teacher. A tall stern mature woman, probably in her 40’s, with a thick curvy body. She had for some reason taken a mean disliking to you.<br>\r\n<br>\r\n<span class=\"clblue\"><b>General:</b><br>\r\n<br>\r\n•\tKeep chapters to a minimum length of 1500 characters. Below that, will be deleted unless option chapters.<br>\r\n•\tKeep characters and events consistent.<br>\r\n•\tThe only gay stuff allowed is lesbianism, any man on man will be removed.<br>\r\n•\tTry to keep grammar good. <br>\r\n•\tPOV can be changed.<br>\r\n•\tThe gun, and the rules above, are the only means of possession.<br>\r\n•\tFor adding features to the gun please email my writing.com account.<br>\r\n•\tHave fun with it!</span><br>\r\n</td>",
        "id":2178573,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604586780,
        "modified":1604586780,
        "pretty_title":"The Possession Gun"
    }
}