{
    "chapters":{
        "1":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Jason, 24, HP, is rich and lives in a mansion with his two sisters….",
                "Jack, 16, DHP, just started his sophomore year of high school….",
                "Sarah, 23, HP, won the lottery, moved into a nice cozy neighborhood….",
                "Lisa, 20, DHP, works at a restaurant that caters to swallowers…."
            ],
            "content":"<div class=\"\"><div> <span>          In this world, some people have the power to swallow other people whole. Not everybody has this power, 50% of girls and women have it, but only 5% of guys have it. Since there are so many people with the power, it can’t be controlled so, the actions of people with the power, just have to be accepted as a part of life. People just have to be careful around the people that have the power, or they will become a filling meal for someone. One thing that has been successfully made illegal is that guys are not to swallow other guys; doing so is punishable by death.<br>\r\n          There is a rumor that some regular people without the power have developed a power of their own. This power gives them the ability to be swallowed whole digested, and then reform at the place where they live. There are so few accounts of it, though it is still considered a myth. The most rare accounts of this ability are where the person that has it also has the swallowing ability. Which if those accounts are true, those people have best mistake protection a swallower can have, because they can go around gulping down people without the worry that they might be preying on another swallower and accidentally get found out, overpowered, and swallowed themselves. It is also useful for digestion situations, because some swallowers aren’t very strong or athletic and in that case, they won’t be able to move after swallowing someone and depending on where they ate, they could become prey for other swallowers; some swallowers like to prey on swallowers that have just had a meal, because it is like having two meals in one.<br>\r\n          There is also one other law that everybody obeys, and that is the minimum age for swallowing people. People that are under 16 are not to be eaten; once people turn 16, they are fare game for gulping. It is one reason why there are many swallowers that become high school teachers; they then request to teach sophomore through senior classes, the pay of teachers may not be good, but they can occasionally pick a tasty looking student to turn into a free lunch. <br>\r\n          Another aspect of the world is that some restaurants cater to swallowers by sending out capturing crews to subdue non-swallowers to add to the menu; it is and expensive menu selection, but a great one, the restaurant goer gets to describe the type of person they want to swallow, body characteristics and such, though if that type of person isn’t in stock, the waitress will ask the customer if he or she wouldn’t mind waiting 20 to 30 minutes while one of the crews goes out to capture what the customer wants. On rare occasions, if what the customer describes isn’t in stock, but the waitress fits the description, the waitress under contract has to offer herself to the customer. Since it is a rare occurrence and it is the only way customers are allowed to order their waitresses, people usually do this and they get to have striptease show and then the waitress offers herself willingly to be swallowed. Under normal circumstances, if what  customers order is in stock, their meal is brought out to them with legs and hands tied with edible string, mainly of course for the reason that people tend not to want to be eaten. <br>\r\n          Though, there have been rare occurrences where a capture crew didn’t realize that they caught a girl or woman with the power, and then when the customer orders her, he or she decides to untie the meal because meal claims to be willing and wants to play first, so the customer eagerly unties the meal and once she is free she devours the customer. Many guys with the power, if they are unlucky in finding a girlfriend, they use the restaurant to do this. All they have to do is come in describe the girl they want and order her to go, so they get one girl tied up to take home. Surprisingly, relationships that start out that way, tend to work, because the girl is usually so happy that the guy saved her from being restaurant food that she falls in love with him or is grateful enough that she goes along with having a new boyfriend to take care of her. It is ideal because since 99% of the girls taken out from these restaurants, don’t have the power, so the guy doesn’t have to worry that his girlfriend might gulp him in his sleep or some other time. Though there are guys that do this take out business so they can take a girl home to have a fun night in bed with, then end the night with a girl filled belly. It could be said that it is a twist on a one-night stand, instead of ‘do her and leave her’, it is ‘do her and eat her’.<br>\r\n          The same concept can happen with the mail order bride industry. A girl thinks that she has been sent to the States to marry a nice guy, but it turns out that the guy just has a craving for international food; lately, Asian and Italian girls are ordered the most, followed close by Irish girls with red hair. The industry knows this happens, but they don’t care, it brings them more money, so what if an innocent young girl is shipped off to feed some guy’s appetite.<br>\r\n          It is a dangerous world. Though, it is a more interesting world. In this world, whose story will you follow?<br>\r\n<br>\r\nHP= Has the Power<br>\r\nDHP= Doesn’t Have the Power<br>\r\n</span></div></div>",
            "created":1283922000,
            "id":952484,
            "title":"The World Of Swallowing"
        },
        "11":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "He was going to one of the restaurants that catered to swallowers….",
                "To the mall to find a nice girl to swallow….",
                "He woke up to Mina licking his feet again….",
                "He had planned to eat his sisters today….",
                "He woke up tied up; one of his sisters had planned to eat him…."
            ],
            "content":"<div class=\"\"><div> <span>          Jason was 24 and rich. He lived in a large mansion with his two lovely sisters. They had inherited the mansion and several hundred million dollars each, when their parents died in an accident. Nikki was 18; she was 5ft 5ins tall and had medium length blonde hair. She was of a plump body type, with C-cup breasts and a cute, round, and plump ass. His other sister Jill, was 26 years old, she was 5ft 8ins tall and had medium length brown hair. She was of a semi-plump body type, with D-cup breasts, luscious round ass. He had never really thought about them in a sexual way other than the thought that he would like to send their lovely bodies along his tongue and down to his belly. His mouth would water just thinking about swallowing his sisters. Normally trying something like that would be dangerous, because they both had the power and were normally cautious around him, cause they figured he might try to devour one of them, so trying to gulp one of them would be hard and might end with him being the one gulped. Though, now he felt confident that he didn’t have to worry no matter what happened.<br>\r\n          Last month, their cousin Vicky who was 25, came to visit for a week. She had the same body type, hair, and measurements as his sister Jill. Vicky had been taunting and flirting with him all during that week. She invited him to the guest room she was staying in, he thought he was going enter in and commence to gulping her, but it was the opposite. When he entered, she quickly grabbed, stripped, and gulped him. In practically record time he was curled up in her sexy belly. He spent the rest of the day and night wiggling and shouting to be let out as she cutely burped every ten minutes or so, and played with herself. Nikki and Jill didn’t particularly like Vicky all that much. Because of that, Vicky decided not to tell them what she had done to Jason, when they asked her who she had gulped, she just told them it was someone she had met at a bar the night before.<br>\r\n          Lucky for Jason, he wasn’t and ordinary person. When Vicky had devoured him, he thought that there was no hope and that he was going just be another meal to nourish his cousin’s hot body. But the next day he found that he had reformed in his room without a scratch on him. Jason chose to keep his new power a secret. Jason figured that his power was genuine and would last, because a hot redhead at the mall had also eaten him, during that month after Vicky. He thought he was going make love to her in a changing room that she had lead him to, but he ended up filling her belly. Things turned out fine then too. He wasn’t as scared that time, and actually found that he enjoyed curling up in the bellies of hot girls.<br>\r\n          Another resident of the estate was the maid that Jason had hired six months ago. He had been tired of sharing the mansion cleaning chores with his sisters so he hired a 20 year-old Asian girl named Mina. She was cute little thing at 5ft 3ins, with medium length black hair; she had a semi-plump body type with C-cup breasts and a delightful round ass. His sisters acted like they were angry that he hired her, but they didn’t seem to complain when they found that they didn’t have to clean the house and do their laundry. Though they would say that he just hired her because he wanted something pretty to look at every day. He had to admit that that was part of it, but he also wanted help someone who needed it, life wise and emotionally that is. Six months ago was when Jason was in his last month of college; he had met Mina earlier then that at the beginning of the semester. He had waited to take some of his lower level classes during his last semester so that he would have an easy last semester. Mina was in a couple of those classes with him and they ended up sitting next to each other and became acquainted. He learned that she didn’t really know what she wanted to do in life, and that she didn’t like college because no matter how hard she worked, she never seemed to be able to get the fantastic grades like some of the other students. She didn’t like the fact that she was just getting by her classes.<br>\r\n          One night during the last week before finals week, Jason had advertised that he was having a study group meeting at his mansion. A few girls from his class showed up along with Mina. Mina had told him one time that being around large groups of people made her nervous. He noticed that she was being rather fidgety during the study group meeting. He watched her get up several times and start to clean up the room and he saw her go upstairs and come back down with clothes and took them to the laundry room, then she would sit back down again, she also went in to the kitchen and cooked some snack food and brought it out to the group. Of course he thought it was strange, but then the idea came to him.<br>\r\n          He offered her a way out of her worries about college. He had made a contract up the night before and handed it to her after class. It was a one-year contract. It stated that she would be the maid at his mansion to clean it, do the laundry for his family, and occasionally make dinner or other meals for him if he asked. In return for her services, she would receive 28800 dollars for that year after taxes, 2400 a month; also she would be given the nice sized guesthouse out back to live in. The guesthouse was completely furnished and every room in it was big; it had one bedroom and bathroom, a kitchen and a living area, and a study/office. The contract also stated that after the year was up, she could either, renew the contract for another year or for however long she asked, or she could leave to pursue other ventures. It also said that if she renewed her contract, he would give her a pay raise if she had done exceptional work the previous year, which he knew she would.<br>\r\n          After she read the contract, she smiled, giggled, and quickly signed it. She gave him a big hug and a kiss. She said it was the best present a person in her situation could ask for. She finish that semester and came to work for him. She told him that she was never going back to college. She said she loved cleaning and that if he would pay her, she would clean for him as long as he wanted. Back to the now, it had been that six months since he hired her. During the last month, five times he awoke from an afternoon nap to Mina licking and sucking on his feet. When she would realize he was awake, she would stop, smile nervously, and giggle lightly as she ran out of his room. He wasn’t sure if she had a crush on him and was flirting in a strange way, or if during those times she had been debating to swallow him. He really liked being woke up that way. After the fifth time he decided that the next time it happened, he would ask her what she was doing. If she were flirting with him, he would open the door for her to be his girlfriend. She was a sweet and kind girl, so he had to admit that he could see a future for the two of them, possibly marriage, though he had to get to know her more first. Other than that, if the feet licking was her wanting to swallow him, then since he knew he would be fine, he would give her the go ahead to gulp him, he thought it might be interesting to be in her belly, since she was of much smaller proportions compared to the other girls that ate him.<br>\r\n<br>\r\nSo, how does Jason start out in this story? Where was he? What was he doing?</span></div></div>",
            "created":1283922000,
            "id":952495,
            "title":"A Rich Life: A Special Secret"
        },
        "111":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Medium sized semi-plump brunette…",
                "Medium sized plump redhead….",
                "Small sized semi-plump Asian girl…."
            ],
            "content":"<div class=\"\"><div> <span>          Jason had decided to have dinner at one of the restaurants that catered to swallowers. The restaurant was called, Delicious Dish, people on the menu wise, only the most beautiful and appetizing girls and women were on the menu. There were other food items and meals on the menu, but most people came to truly have a delicious dish so to speak. He entered the restaurant at 6:30pm, luckily it was a slow night and he was quickly seated. Soon he heard a familiar voice, “Hey there handsome, back for another big dinner? So who would you like in your belly tonight?” “Well, you’re looking extra delicious tonight, you on the menu yet sweet cheeks,” Jason asked. The girl laughed and smacked her own ass, “Not yet, though I’d give you a call the moment I found out.”<br>\r\n          The server’s name was Erica. She was 23 years old, with medium length brunette hair. She was 5ft 5ins tall with a semi-plump body type, C-cup breasts and the most perfect plump round ass he had ever seen, in her tight work slacks, it had a slight barely noticeable jiggle. He had been to the restaurant twenty-four times in the past year, and he made sure that he was there when she worked, well she told him her schedule. At first he had thought his attraction to her was just her body and wanting to gulp her right there in the restaurant, but after a few visits, he got to know her a little and they began flirting with each other. He felt that she really liked him too; he wanted to ask her out on a date, but he was afraid that his urges might over power him and he would eat her up and end up regretting it. He certainly couldn’t devour the girl that could be the love of his life, but who could tell if she was anyway.<br>\r\n<br>\r\nWhat did Jason order?<br>\r\n</span></div></div>",
            "created":1283922000,
            "id":952503,
            "title":"Smitten With The Serving Girl"
        },
        "1111":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Erica brought over a tasty and scared young brunette on a platter….",
                "Erica brought over a tasty and eager older brunette on a platter….",
                "Erica came back, with an empty platter...."
            ],
            "content":"<div class=\"\"><div> <span>          “Well Erica, you are making me hungry,” Jason said, “I guess I’ll take a Medium Brunette Girl Meal, someone in your size.” “Excellent choice,” Erica said, “From what I hear, brunettes are actually the most ordered and loved meal in restaurants like these.” Erica went to get him his meal and he enjoyed watching her walk away. He still wasn’t sure what he would do if the situation came for her to be served to him, if the right girl wasn’t in stock. He wanted to gulp her, but he strongly wanted to date her and see if she was the perfect girl for him.<br>\r\n<br>\r\nWhat happened next?<br>\r\n</span></div></div>",
            "created":1283922000,
            "id":952506,
            "title":"One Medium Brunette Meal"
        },
        "11113":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "He gives in to his urges. He made love to her and enjoyed her for dinner.",
                "One sexy Erica to go, on to a passionate night in his bedroom…."
            ],
            "content":"<div class=\"\"><div> <span>          Jason waited for several minutes, but when Erica returned to his table, she was just carrying a large and empty serving tray. He was puzzled by what was going on, especially when she motioned for him to follow her. She led him to one of the small fancy private dining rooms. After they entered, she closed and locked the door. He sat down and she laid the serving tray onto the large table. He smiled and got quite excited when she started slipping off her work pants. She had her back turned to him while doing so and she bent all the way over to slip the pants totally off, which gave him a lovely view of her scrumptious round ass. She was wearing a pair of blue silk panties that were tight and barely covered her luscious rump. She turned and took off her work shirt to reveal lively plump breasts covered in a blue silk bra.<br>\r\n          Jason’s eyes got even wider with surprise as Erica climbed up onto the serving tray and laid down along it on her left side, facing him. She brought her index and middle finger of her right hand up to her lips and sucked on them for a few seconds. She then slipped them out and traced a line with them down her chin, along her neck, in between her breasts, over her belly, and slid them down in between her legs inside her panties. She moved them around a bit, moaned, and slid them back out. She then positioned her open palmed right hand behind herself and smacked her ass two times with it. Her sparkling dark blue eyes stared straight into his eyes and then she spoke, “Mmm, well we didn’t have a girl of my size in stock, so I’m serving you something even better…me.”<br>\r\n          Jason licked his lips and opened his mouth but couldn’t speak because he was in awe of the incredibly sexy sight in front of him. Erica giggled and grinned, “Oh, surprised that your plan worked this time. You can’t believe that after all the playful banter we have been sharing with each other over the past year, it will actually happen this time. We can make this as long an experience as you want, that is why I moved us to a private dinning room. I thought that we should have a little hot fun with each other; that you could play with your food before you devour it. Your food definitely wants to play with you.” He told her that he definitely was going to take her up on the hot fun offer, but he revealed that he was torn on whether he would actually go through with eating her or decide to form a stronger relationship with her and have her has his girlfriend.<br>\r\n          Erica smiled and turn a little red in the face, “Weeellll….I do have strong feelings for you and really like you a lot. That is why I don’t mind if you gobble me up. If I am to be eaten by someone, I want that someone to be you. I have an idea. Why don’t you just take your time looking at and talking to me, then decide if you are going to just have fun with me and then devour me or if not that then you can make me a to go order and take me home with you where we can explore and decide on what will happen from there.”<br>\r\n<br>\r\nWhat happened? Was Jason able to resist eating the girl he thinks he loves?<br>\r\n</span></div></div>",
            "created":1283922000,
            "id":952509,
            "title":"Erica Serves Herself"
        },
        "112":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Decided she was too sweet to eat",
                "Pinned her to the wall, chuckling",
                "Went for a bit of foreplay"
            ],
            "content":"<div class=\"\"><div> <span>Jason got into his expensive car and drove to the mall, hoping to find a sweet young thing to snack on. He went immediately to the area with the most clothing outlets after arriving. He looked from girl to girl in the stores, but none of them seemed quite right. Then he saw her. Standing near the entrance to one store, a red headed girl who appeared to be around twenty. She was examining a white blouse with blue lining. When she saw hims staring at her, she smiled shyly and looked away, blushing. Jason almost laughed out loud. The poor girl thought he was attracted to her. Well, he was, but in a different way, as well. He walked up to her, grinning easily. \"Hey, I'm Jason. Mind telling me your name, gorgeous?\" The girl looked up at him, her green eyes slightly nervous. \"Amanda,\" she said softly. Jason casually looked her up and down. Average breasts and butt, slim build, petite, with a gorgeous face and decently long legs. He motioned towards a dressing room. \"You want to...?\" The sweet, innocent young woman blushed deeply. \"I...I don't know...no guy ever...\" He gently touches her arm, giving an encouraging smile. \"Come on. It'll be fine.\" She smiles, encouraged by his easy-going manner, and followed him into the room. He shut the door, and...</span></div></div>",
            "created":1362166800,
            "id":1541690,
            "title":"To the mall to find a nice girl to swallow…."
        },
        "1122":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Amused by her pathetic display",
                "Moved by her honesty and let her go",
                "Disgusted by her stupid whining"
            ],
            "content":"<div class=\"\"><div> <span>He pinned her to the back wall of the small changing room. Amanda gasped as she hit the wall, her eyes blazing with terror. \"Wha-what are you doing?\" she cried out. Jason leaned close and licked her from jawline to behind her ear. Then he whispered, \"You shouldn't have been so trusting, sweety. I almost hate to eat such a cute little thing, but,\" he shrugged, \"You know how it is.\" Amanda's eyes filled with tears. \"Please, don't eat me. I have so much to live for. I'm supposed to get a degree in biology, and get a job, and get married, and...and...\" she lowered her head. \"Please let me go,\" she whispered. Jason felt...</span></div></div>",
            "created":1362167040,
            "id":1541691,
            "title":"Pinned her to the wall, chuckling"
        },
        "11221":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Ignored her offer",
                "Accepted her proposition"
            ],
            "content":"<div class=\"\"><div> <span>Jason chuckled. \"Sorry, dear, but you're going down my throat right now.\" She tried to scream, but Jason wrapped his lips around her head, sucking it in, licking her perfect, sweet face. His hands went to her blouse, unbuttoning it quickly and taking it off. He then removed her bra and pinned her smooth, flawless arms to her sides. Her modest breasts were now free, and he sucked more of the innocent girl in eagerly. When her boobs entered his mouth, his tongue danced on them, licking the nipples, hardening them. Amanda moaned involuntarily as she was swallowed to her waist. Jason unbuttoned her jeans and slipped them off, along with her shoes and panties. He drove his tongue into her nether region and took another gulp, securing her place as his meal. Amanda squirmed and kicked her legs, partly from fear and partly from arousal. Jason finished pleasuring her and swallowed her thighs, making sure to taste every inch of her perfect, delicious, soft skin. He consumed her knees and calves, leaving only her green painted toenails out of his body. He tickled them, causing the girl within to squirm even more. Her faint, hysterical laughter could be heard through the walls of his stomach. Finally, he swallowed her completely and smiled. He placed a hand over her petite form, now in the fetal position in his stomach. Amanda was now begging for him to let her out, promising money, sexual favors, anything to be allowed to live. Jason smiled and...</span></div></div>",
            "created":1362167460,
            "id":1541693,
            "title":"Amused by her pathetic display"
        },
        "112211":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Some random girl",
                "Jill, his sister"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, lovely,\" Jason said, grinning. \"But I've been starving, and you were just the thing to fill me up.\" Amanda screamed at the top of her lungs, annoying Jason. In response, he tightened his stomach walls, until she was screaming not in fear, but in pain. He heard cracking bones, and the poor girl's cries silenced. Jason's acids went to work on her broken, lifeless corpse, melting down meat, flesh, and bones to make a gelatinous soup in his stomach. Jason was about to leave, when someone opened the unlocked changing room door and walked in. It was...</span></div></div>",
            "created":1362167700,
            "id":1541695,
            "title":"Ignored her offer"
        },
        "113":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "She was flirting….",
                "She wants to eat him, but she doesn’t want to lose her job….",
                "She actually wants him to eat her…."
            ],
            "content":"<div class=\"\"><div> <span>          Jason felt the pleasant warmth and wetness of Mina’s tongue as she yet again woke him up from a nap. He decided to not open his eyes and let her go on. After another couple of minutes he finally arose from the bed. Mina was about to leave again like she had done in past, but Jason told her to wait and she did. “I’m sorry for doing it Jason,” Mina said, “I just can’t help myself.” Jason smiled, “It’s okay, I really like it when you do it. I stopped you because I just can’t go on with this without knowing why you are doing it. Are you flirting with me or something? If not, are you thinking about eating me up, do you want to send me to that cute belly of yours?”<br>\r\n<br>\r\nWhat was Mina’s answer?<br>\r\n</span></div></div>",
            "created":1283922000,
            "id":952499,
            "title":"Woke Up By Mina’s Tongue"
        },
        "1132":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Yes, she strips him and eats him head first....",
                "Yes, she strips him and eats him feet first....",
                "Not yet, she strips herself and him to make a little love before lunch...."
            ],
            "content":"<div class=\"\"><div> <span>          Mina lightly laughed, \"Mmm, well I do like you a lot Jason, and yes, I have wanted to eat you up for some time. I had planned on eating you back when we were still in college, but then you gave me the great gift of an easy job with great pay, which freed me from the chains of college. As you know, once a week I taste you a little. But I can't eat you, because if anything happens to you because of me, your sisters will probably fire me. I can't lose such a great position. Though, I guess I have developed a great liking towards you, I guess I was also flirting with you each week. I could definitely see myself dating you, maybe even further than that. With your tone of voice before, I can guess you have the same relationship interest in me. The problem is I just find you incredibly tasty and appetizing, to the point even now I am using all the willpower I have to keep myself from jumping on you and devouring you.\"<br>\r\n          Jason smiled, leaned into her, gave her a kiss on her lips, and leaned back, \"Well Mina, my lovely and hungry maid, I will tell you something that you will love. I am one of those special people that has the power to survive being devoured and digested. If you eat me, I will reform here on my bed tomorrow, unharmed. I've kept this secret for awhile because I am still a little uneasy about if the power is permanent, because if swallower girls knew of my power, they would be be fighting over me and gulping me down every chance they got, because to girls like you, I would pose as an infinite meal. Swallow me, I reform, and you swallow me again. I have to admit that I really like the feeling of being swallowed and being in the bellies of beautiful girls and women, but if the power doesn't last, it would be the end of me, because I would have willingly offered myself to a girl as meal. Even with that on my mind, I reveal my secret to you because I want you to be the girl that gets to eat me as much as she wants. I won't mind if anything happens to me because of you. I really like you a lot and would really like to get a chance to see what it is like to be in the belly small sized lovely girl like you. I bet it will be an even tighter fit than being eaten taller girls. So what do you say, now you know my secret, are you ready to eat me up. Oh, and just so you are reassured and not worried about your job position, I will leave a note to my sisters. It will tell them that I allowed you to eat me, and that you are to keep your job even if I don't survive the experience.\" <br>\r\n          Jason grabbed a pad of paper, wrote the note, and laid it on the nightstand, \"Okay Mina, I'm yours for lunch, eat me up.\" Mina smiled and licked her lips as her belly started to rumble, \"Wow such a special offer. Jason, I definitely accept and as you can hear, my cute little belly as you call it, is very interested and having you in it.\"<br>\r\n<br>\r\nWhat happened next? Does she eat him now?</span></div></div>",
            "created":1284206940,
            "id":954507,
            "title":"Secret Revealed To Mina"
        },
        "1133":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Mina tells Jason she's a reformer",
                "Jason decides to save her for later",
                "He ties her up and delivers her to a restaurant to be served to him "
            ],
            "content":"<div class=\"\"><div> <span>\"Well actually...\"  She said looking up at him.  \"I was wondering if you would eat me?\" <br>\r\n<br>\r\nJason's eyebrows shot up.  Mina was hot and sexy, with her dark raven hair and silky light tan skin.  Were was she from?  Somewhere in or around China he didn't know what part.  He would love to feel her slowly digest in his belly, but that would be the end of her.<br>\r\n<br>\r\n\"Mina, are you sure?\"  He asked.  Mina shyly nodded.  \"But Mina you know digestion is excruciating.  I mean- I had surgery when I was little that made my nerves remove the pain, but I'm rich you-\"<br>\r\n<br>\r\n\"I'm an immigrant yes.\"  She said with a smile.  \"But I- I want to be part of you.\"  As she said this she took off her shirt, revealing her sexy light tan tummy and strapless bra.  She laid across Jason's legs, as though she was on a plate.  \"I want to give you nutrients.  And yes digestion is extremely painful, but, I would almost like that, a sacrifice from me, a painful sacrifice.  To feel you.\"<br>\r\n<br>\r\n\"Really.\"  Jason said running his fingers around her soft belly.  Mina giggled as he ran his fingertips down her ticklish sides.  He felt himself turned on by the idea of eating Mina, feeling her moan and squirm in his acids.<br>\r\n<br>\r\n\"Let me satiate your hunger.\"  She said, arching her back, pushing her belly into his hands and towards his heads.  He bent down and licked her gorgeous tummy, making her giggle as his licked and was entranced by her wonderful flavor.  He bent down and started to lick and nibble all around her midsection, getting on her hips and pinning her to the bed.  She tasted so good.  <br>\r\n<br>\r\n\"I don't want to lose you.\"  He said between licks.<br>\r\n<br>\r\n\"Make me a slave Jason.  A slave to satiate your hunger, take my body and dominate it, dissolve it.\"<br>\r\n<br>\r\n\"I can't lose you.\"  Jason said still tasting her.  She tasted divine.</span></div></div>",
            "created":1404113460,
            "id":1820201,
            "title":"An offering"
        },
        "12":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "It was the weekend and he was lying on his bed….",
                "He was at school and Melissa asked if he could come home with her….",
                "Claire was blocking his exit after school, she remembered him from last year…",
                "His young biology teacher, Miss London, asked him to stay after class….",
                "He grabbed by a girl after school and taken to her car…."
            ],
            "content":"<div class=\"\"><div> <span>          Last month, a week before his sophomore year in high school started, Jack turned 16 years old. That was when he found out that he didn’t have the swallowing power. He was so scared to go back to school. He was safe last year, but still saw all the frightening things that could happen to him. <br>\r\n          Several times he walked into the boys’ restroom to find some girl gulping down an upperclassman. A few times he saw the head junior cheerleader, Claire, under the football field bleachers, swallowing up other girls; he heard that if she found out that new cheerleader recruits weren’t swallowers, she would trick them into meeting her and eat them. They were Claire’s after school snack. Any guy that dated her or hit on her, ended up disappearing. One time she caught him staring at her in surprise because he was startled by seeing her gulp another girl. When that happened, she let out a little burp, rubbed and patted her belly, and grinned a cute but scary grin and said to him, “You better stay hidden next year freshy, cause I don’t like people watching me eat, people that do that usually end up in my belly. But, if you’re interested in being food, just seek me out next year and I will be glad to send you to my belly which you apparently can’t stop staring at.” He had stared at her belly because he couldn’t look away from seeing the movements of the poor girl inside, wondering what it felt like, wondering how long the girl had before she was just another glob of mush to nourish the body.<br>\r\n          Claire was a senior this new school year. Claire was 18 years old and 5ft 7ins tall with long red hair that she usually tied back into a ponytail. She had a lean but not skinny body type, her cheerleading kept most of the weight from eating all those students, off; she also had C-cup breasts, and a well rounded ass, though it did cutely jiggle a bit along with her thighs, because some of the student eating had fattened those parts. Jack’s older sister Allison would also be a senior this new school year. She was 18 years old and 5ft 8ins tall with medium length blonde hair. She had a semi-plump body type with D-cup breasts, and very nice plump round ass. She had eaten a student or 20, during her years in high school. <br>\r\n          During their lazy free days off, when he would lay about on the couch watching television, he would occasionally tease her as she walked by; he would point at her ass and say, “Hey, I’m missing a big soft pillow, bring yours over here and sit it down.” Sometimes when she didn’t get angry from him saying that, she would just retort, “Be careful what you ask for little bro, because one of these days you might make this pillow bigger and softer.” During that last week before the new school year, he actually wanted that to happen. He was so scared that he would be eaten on the first day, that he begged her to do it. He wanted to choose who devoured him and since they usually got along well together and she always looked out for him and kept him out of trouble, than what better way to reward her then letting her make a meal out of him. That week he actually had dreams about being in her belly, which for him wasn’t a nightmare but a good dream. She declined his offer each time that week, she would say, “If I’m going to eat my little brother, it will be on my terms. You will have to do something really bad, or I will have to be so hungry, that I rather eat you to save time, than go out hunting for my dinner. Besides, I’m actually trying to cut back this year. I don’t want my ass to get any bigger, and if I ate you, you would definitely fatten me up.<br>\r\n          Jack had hoped so much that he had had the power. He always thought about what it was like; he wondered if people with the power ate people because they could or because they liked it or did they eat people because the power gave them some kind of urge that they had to eat people to suppress it. He knew a few girls in his class level that if he had gotten the power and they hadn’t, he could see himself devouring them, they were beautiful girls, but they also had that quality he thought that if he was going to eat girls, they would be tasty; though he wondered how girls tasted. He knew that swallowers never chewed, so did girls have a flavor that made them taste good? Did they all taste the same, or did they each have their own flavor and what determined that, if it was the case? In all that thought he also wondered what would make a girl want to eat him, he didn’t think he was all that special, would girls really be competing to eat him like he had heard about in the school gossip last year, about other guys. He probably thought about it too long, but had decided that if he was going to get swallowed up by a hungry girl, he hoped that it was someone he liked or knew, and that she would be sweet and nice to him before she sent him to his fate.<br>\r\n          Now, it is three weeks into his year as a sophomore. Jack had got a little less preoccupied about the danger of being eaten. He found out that most girls just swallowed guys that did them wrong or they really liked them and loved them so much that they couldn’t resist gulping them. He couldn’t say that he had found a girl that loved him like that, but if he did, he wasn’t sure if he would allow her to do it, though he wondered if he could even stop a girl that wanted to gulp or even know when it would if it occurred so he could avoid it. <br>\r\n          There was one girl that he was getting close to, though he felt like it was going to be more like a friendship with her, mainly because she was a senior. Senior girls were usually out of lower classmen league; if there was a sophomore/senior couple, it was most likely that the senior was a guy, because girls always have it easier when it comes to getting dates with older students. The girl that Jack was becoming friends with was Melissa. She was 18 years old and 5ft 6ins tall with medium length brunette hair. She had a semi-plump body type with C-cup breasts, a very well rounded plump ass. Unlike his joking with his sister, he truly wanted to lay his head down on Melissa’s ass like it was a pillow. She sat next to him in their geometry class. He learned that she did extremely well in all her other subjects, but she just wasn’t good at math. It was her third time taking the class and of course if she didn’t pass, she wouldn’t graduate. He didn’t know why other people hadn’t helped her in the past, but decided that he was going to help her through the class. So far in the first three weeks, she had been making A’s and B’s, though on the first test she got a D because she blanked on most of it because she was nervous.<br>\r\n          After that he told her that he could teach her to stay level headed during a test, and also easy ways to remember important parts for the test. When he said that, he got the question that any guy like him would say yes to. Melissa had smiled and asked, “Well if I find a good time for both of us, maybe one day a week you could come home with me and tutor me in those helpful ways. I’ve already told my mom all about you, and she said that I could bring you home any time I wanted. So, what do you say, will you help me?” Of course he said yes; he thought that if he helped her and had some alone time with her, maybe he could help their friendship grow to something more.<br>\r\n<br>\r\nSo, where does this story begin?<br>\r\n</span></div></div>",
            "created":1284008400,
            "id":952992,
            "title":"A Dangerous New School Year"
        },
        "122":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "They arrive at Melissa’s house….",
                "She takes him to make-out ridge instead…."
            ],
            "content":"<div class=\"\"><div> <span>          It was a nice Friday and it was just after lunch. Jack was in his geometry class and it was almost time to leave for last period, which was a study hall. The period tone sounded and he was about to leave when Melissa grabbed his arm. “Are you free tonight, I was hoping to have you ride in my car with me back to my house,” Melissa said with a smile and face that looked like she was quite eager, “My mom said that Fridays are okay if you’re really serious about helping me learn memorizing tactics for our geometry tests.” It was the moment Jack had been hoping for, in his eyes, if he was looking to earn points and try to have real relationship with Melissa; he felt that helping her like this might be the key. “Of course I’ll come home with you to help, it would be cruel of me not to help you graduate,” Jack said. Melissa giggle, “Great, thank you! It means a lot to me. After school, meet me by my car in the student parking lot. It is in the beginning of the last row close to the guard post at the school exit. It is space 469 and my car is blue, it’s actually the only blue car in the row.<br>\r\n          Jack left for his study hall. His sister Allison was in the same study hall. He sat next to her and a few minutes after the period started he told her that he was going home with Melissa after school. “Aawweee, my little bro has girlfriend,” Allison said a little sarcastically, “You think that if you help this girl that you will get to be her boyfriend. I hope for your sake that she just wants your help and be your friend or girlfriend. But, as you said, she is a senior. It is very rare that a senior girl wants to be friends with a lower classmen; let alone have one has her boyfriend. It is more likely that she has been leading you on, and that now she has decided to take you home to have you for dinner. If that is the case, you better hope she will at least let you have a little fun with her before she devours you. But that’s just me, I tend to be nice and give my food a pleasurable present before I eat it.” “No, I doubt she will eat me, she just seems too nice,” Jack said. Allison laughed lightly, “It’s the really nice girls that tend to end up being the swallowers that eat the most people. She might not eat you, who knows, but you also have to know that she is only half of what you have to worry about. I don’t know much about her, but I do know from what some of the senior guys talk about, her mom is young and beautiful. She’s thirty-six and said to be a little taller and more body development than Melissa. They call her Hungry Hot Hanna. The stories are that several guys have tried to get close to Melissa to get close to Hanna, but they all say that Melissa told them that all the guys that have tried it, ended up in her mom’s belly. I also heard that even Melissa’s friends that aren’t out to get close with Hanna, end up in Hanna’s belly. I wouldn’t even feel safe going to Melissa’s house to study, because the word is that Hanna isn’t a picky eater. She loves all young high school students, male, female, non-swallower, or swallower. She doesn’t follow the unwritten code that swallowers should only eat other swallowers in self-defense, though I wonder how many swallowers follow the code anymore. So, if Melissa isn’t planning gobbling you up, then stick close to her and don’t get too close to her mom.”<br>\r\n          Jack thought about what his sister had said. He hoped that Melissa’s intentions were good, though he wondered how he would feel if she decided to eat him. Finally, the end of school tone sounded and he packed up and started to leave. Just before he got to the stairs, Allison stopped him, “Well little bro, good luck. If I don’t see you again I’ll know what happened; I’ll ask Melissa if you were tasty or if her mom had a good meal. Oh, and if you do get gobbled up…wiggle, girls love that. Bye.” Jack then went out to the student parking lot and met up with Melissa.<br>\r\n          They both got in and Melissa drove away from the school. Jack was nervous; he hadn’t been to a girl’s house before, let alone a girl that wanted him to come home with her. He wasn’t just nervous about that, he wondered if he was willingly traveling to his end, in the belly of a Melissa, or possibly her mom. Melissa saw the nervous glances he was giving her, and his fidgeting. She laughed, “I guess you haven’t been alone with or went home with a girl before. Don’t worry, it will be fun.” He thought on what her idea of fun might be. He glanced at her again, though he wanted to be a gentleman around her since he was really interested in her; being a guy, he still had the underlying hope that helping her today would lead to some special fun in her bedroom.<br>\r\n<br>\r\nWhat happened next?<br>\r\n</span></div></div>",
            "created":1284008400,
            "id":952997,
            "title":"Leaving With Melissa"
        },
        "1221":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "He helps her with her geometry test memorization techniques….",
                "She wanted to change clothes, she sent him down to get drinks….",
                "She gets a call; she has to go to work at her part-time job…."
            ],
            "content":"<div class=\"\"><div> <span>          After about an eight-minute drive, they had arrived at Melissa’s house in the suburb. Jack was surprised because he actually recognized the nice sized two-story house. He was only a few streets away from his house. Just as Melissa pulled into the driveway, Jack saw lovely woman watering some flowers in the front yard. He especially took notice of her backside; it was round and well formed. The woman turned around and waved. He came to the conclusion that it was Melissa’s mom, Hanna. He could see what all the fuss, that Allison told him, was about. Jack felt that she looked more like she was in her early to mid twenties, rather than 36. Hanna looked like a slightly older and larger proportioned Melissa. She was a couple inches taller than Melissa at 5ft 8ins also with medium length brunette hair. She also had a semi-plump body type, but more filled out with D-cup breasts and an even plumper round ass. Though he did really like how she looked compared to Melissa, he felt that he rather stay with Melissa and have a relationship with her, than have fling with her mother. If Melissa aged anything like Hanna and possibly developed like her, he would rather have Melissa. She was closer to his age anyway. Also, Jack thought that Hanna would most likely just eat him.<br>\r\n          Melissa reinforced his thought, “Jack, I have to worn you. Do your best not to find yourself alone with my mom. You are a young high school student, her favorite food. She would have to seriously adore and like you not to eat you; an example of how much she would have to like you is that last month she devoured her best friend of twenty-five years, because she couldn’t help wanting to eat her friend’s nice ass. So you would have to be more important to her than a best friend. To tell you the truth, I think the only reason she hasn’t swallowed me is because I’m her only child, though I’m still not convinced that being her daughter is enough to keep her from gulping me. That’s why I need you to help me graduate; after that, I have enough money saved up to get my own apartment and then have part time job when I go to college.” “Got it,” Jack said, “Steer clear of Hungry Hanna.” Melissa laughed, “Ah haven’t heard that in awhile, it is very true too. Where did you hear it?” Jack smiled, “My sister Allison, don’t know if you know her.” Melissa smiled, “Back only by reputation, I’m lucky to have you here. She must really like you. I would have figured she would have gulped you the moment she found out you didn’t have the power.” “Yeah, she’s nice to me, kind of looks at herself as my protector,” Jack said, “She actually didn’t want me to go home with you. She said that I would most likely get eaten by you or your mom.” “She might be right. Who knows, I might get a little hungry during our study session tonight decide that you would make a perfect snack,” Melissa said sarcastically, giggled and gave Jack a wink. He laughed nervously.<br>\r\n          The two got out of the car and went to the front door and met up with Hanna. Hanna patted Jack on the head, “So this is the little cutie who’s been helping my daughter with her math work. You look so sweet I could just gobble you up.” Jack noticed that Hanna licked her lips after she said that. “Hands off mom,” Melissa shouted and hurried Jack inside and up to her room. Melissa closed her door and said, “Well this is my room. I know you are a nice honorable guy, so I guess I don’t have to tell you, no funny business with me.…..unless I allow it.” Jack liked the sound of “unless I allow it”, maybe he did have a shot at being her boyfriend. “The reason I said that,” Melissa explained, “Is that you will be sleeping in here with me tonight. I particularly don’t like sleeping in the same room with people, but I can’t avoid it. I use to have my friends and boyfriend sleep on the big comfy couch downstairs, but a couple years ago when my friends came of age, my mom decided that they were fair game.  I lost two best friends, a boyfriend, and my sweet and kind cousin Sally to her that year. And after that, she has lured several guys that I brought home, into her room and devoured them, as well as captured and gulped several girlfriends of mine that I was studying with, when I wasn’t in the room to stop her. That is actually why over the two years she has developed that hot fat round ass of hers. Stay away or you will be next to be apart of it.” Jack felt sorry for Melissa that she lost so many people to her mother.<br>\r\n<br>\r\nWhat happened next?<br>\r\n</span></div></div>",
            "created":1284094800,
            "id":954184,
            "title":"Melissa’s House"
        },
        "12211":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "She moved in close, to make-out with him….",
                "They head down to the dinning room for dinner…."
            ],
            "content":"<div class=\"\"><div> <span>          For an hour, the two did their homework for their classes, then Jack started to impart his test memorization techniques to Melissa. She was a good listener and kept close eye contact with him, which distracted him because she had such a sweet lovely face. It made him stumble a few times with what he was trying to tell her, but he was able to correct himself quickly. She diverted his attention even more when she got so excited about how she was getting what he was saying in his lesson that she gave him a great big tight hug, practically imprinting her sweet scent onto him.<br>\r\n          The distractions and studying went on for another hour. He wasn’t sure if she sensed how he was feeling about being with her. He wondered if she was actually trying to send him signals. But since he had never spent time alone with a girl, he hadn’t the slightest clue how to act around her. The weak and bad side of him just wanted to jump on her and show her what he was feeling, though luckily the strong side of him was in control and made him decide to just wait to let her make a move if it is what she was wanting.<br>\r\n<br>\r\nWhat happened next?<br>\r\n</span></div></div>",
            "created":1284094800,
            "id":954246,
            "title":"Study Distractions"
        },
        "122112":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Melissa and Jack go back to her room and get intimate….",
                "Melissa and Jack go back to her room and study more then go to bed…."
            ],
            "content":"<div class=\"\"><div> <span>          Seven o’clock came and it was time for the two to go down to have dinner. “Just to let you know,” Melissa said, “My mom loves to toy with the people I have sleepover for a night. She’ll probably address you as being food or something like that. I’ll of course be in the room, so you won’t have to worry about her getting her mouth on you.” Jack told her he understood and that there shouldn’t be a problem. The two went down to the dinning room where the table had been set for three. There were several side dishes placed around a large platter. On the platter was a large roasted chicken. “Time to gobble up this delicious chicken,” Hanna said entering the room with a carving knife and fork. She proceeded to carve off sections for everybody. They all then sat down to eat.<br>\r\n          “Well, Jack,” Hanna said, “You’re quite tasty looking. Too bad my pesky daughter is here, it would be you on that platter instead of the chicken.” Melissa huffed a sigh, “Mom…your pesky daughter needs him to graduate. He is helping me with my geometry class. One should not eat such a kind and helpful person. That is why I eat only people that are rude and try to hurt me.” It was then that Jack remembered that Melissa was a swallower; she had been so nice, polite, and grateful to him about him helping her that he had forgotten that she could do such a terrifying thing. <br>\r\n          “Oh, don’t think that one little math class will prevent you from graduating. I have my connections in the school system; you would be passed from that class even if you failed. Also as I have told you before, don’t be picky about who you eat; rude or nice they’re all good for eating,” Hanna replied to Melissa’s points and winked at Jack, “Oh, it is a shame you aren’t my dinner tonight; the pleasures I would give you as I thoroughly enjoy swallowing you. As my past dinners could attest to you if they were still around, going to your end in my belly would be a very satisfying experience.” Hanna licked her lips and winked again at Jack. He saw Melissa turning red. She looked at him and smiled, then quickly looked away. She also had an anxious look about her other than her anger, “Mom, do you remember what you promised me before the start of this school year…don’t talk I’ll tell you. You said that if I found a boyfriend this year, that you wouldn’t eat him, that if anyone were allowed to eat him it would be me. Well, I’m telling you now, Jack is my boyfriend.”<br>\r\n          Jack was stunned; of course he wanted be Melissa’s boyfriend, but he didn’t expect her to reveal her feelings about him so abruptly. Hanna also became red with anger, “Melissa, don’t do this, think about it. Hhrrrrr…well if this is what you want, then I am okay with it for now, but I urge you not to make this a permanent relationship. I recommend that if this relationship lasts until graduation, eat him before you go to college, or better yet, have him as your after graduation meal. He is still young and would have two years left in high school while you are at college. It will be better to go to college unattached, it will be easier for you to get more tasty college guys…and girls that way.” Melissa sighed again, “Whatever.” Jack was happy that he would be having a relationship with Melissa. He knew that his life would most likely be short because of not having the power, so he might as well have the best time with the girl he wants to spend time with. He even thought that if the relationship did last the whole school year, he might actually go with Hanna’s suggestion. He would offer himself as an after graduation meal for Melissa. The dinning room was silent for the rest of the meal.<br>\r\n<br>\r\nWhat happened next?<br>\r\n</span></div></div>",
            "created":1284094800,
            "id":954251,
            "title":"Heated Dinner Argument"
        },
        "12212":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Melissa’s door is still locked, he heard Hanna call to him….",
                "Melissa was done changing, and he went back in her room…."
            ],
            "content":"<div class=\"\"><div> <span>          After a half an hour of studying, Melissa got up from the bed. She motioned for Jack to get up as well. “I need to change into something more comfortable,” Melissa said, “There’s soda in the fridge. Go down and get us a couple while I change. But remember, move quickly and don’t get caught alone with my mom. If she is in the kitchen, just forget the drinks and come back. If she enters a room with you, leave immediately. I warn you, she is very good at distracting guys. You seem strong of character so, I’m not too worried about her luring you to her, but don’t approach her for any reason.” She opened her door and Jack left.<br>\r\n          He felt confident that he could escape any situation that Hanna could possibly have in store for him. He hurried down to the kitchen and got the sodas. Nervously he looked about and noticed that Hanna wasn’t around. He sped upstairs and made it back to Melissa’s door.<br>\r\n<br>\r\nWhat happened next?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1284094800,
            "id":954253,
            "title":"Sent To Get Soda"
        },
        "122121":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "No, he enters her room and she gets up, closes the door, and locks it….",
                "Melissa’s door opens and Jack rushes inside…."
            ],
            "content":"<div class=\"\"><div> <span>          Jack got back to Melissa’s door, but it was still locked. He wondered what was taking so long. Just then, he heard a voice and froze. It was Hanna’s voice, “Hello Jack, come here, I want to thank you for helping my daughter.” He hadn’t noticed, but Hanna’s bedroom was right across from Melissa’s. The reason he hadn’t encountered her in the rest of the house was because she had been staying in her room. He slowly turned. Hanna’s room door was open and he could see she was lying on her bed. His jaw practically dropped, he saw that she was half naked. She was only in her underwear, and it didn’t cover her very well. She was very beautiful, so it was hard for him to look away. “Don’t be shy,” She said in a sultry voice, “Come in, I know you want to. Think about it, why pursue my daughter when you can be with someone that is ready and willing, plus extremely youthful and more experienced?<br>\r\n<br>\r\nWas Jack able to resist Hanna?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1284177000,
            "id":954255,
            "title":"Half Naked Hanna"
        },
        "12213":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "He woke up to what sounded like Melissa telling him to unlock the door….",
                "He woke up. He felt cold and like he was on a metal surface…."
            ],
            "content":"<div class=\"\"><div> <span>          Jack and Melissa had only gotten an hour of studying in when the phone rang. It was for Melissa. The grocery store where she worked part time, demanded that she come in and work a half a shift to cover for a worker that had to go to the hospital. “I’m sorry Jack,” Melissa said, “Since you’re staying the night anyway, I guess you will be alright and I will be back in about five hours.” Jack laid on her bed as she went to the bathroom to quickly change into her black slacks and blue uniform shirt.<br>\r\n          It didn’t take long for her to get ready. She came back in the room with a couple cans of soda, a bag chips, and a pudding cup with a spoon. She patted Jack on the shoulder, “Again I’m sorry. I brought up some snacks for when I am gone. I’ll be gone for at least five hours. My room has a lock on it. I want you to lock it when I leave, for the obvious reason that this would be an ideal time that my mom will probably use to devour you. This room is connected to a small bathroom, so that won’t be a problem.” Jack followed Melissa to her room door. She exited and turned around, “Do not open this door unless I am the one at it.”<br>\r\n          Jack shut the door and laid down on the bed. He just lounged about for an hour, during which he had a soda, a handful of chips, and the pudding cup. He felt a little sleepy so he decided to take a nap to pass the time before. He didn’t think that anything bad could happen to him. He was behind a locked door.<br>\r\n<br>\r\nWhat happened next?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1284094800,
            "id":954186,
            "title":"Melissa Gets A Call"
        },
        "122131":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Yes, she came in and closed and locked the door, then laid on her bed….",
                "No, it was her mom, Hanna, doing a very good impression of her daughter…."
            ],
            "content":"<div class=\"\"><div> <span>          Jack awoke to some knocking at the door and a voice that sounded like Melissa. “Let me in,” the voice said, “I’m back from work and I’m tired and just want to go to bed.” He got up from the bed and went over to the door. He hadn’t seen what time it was because his eyes were still blurry from being asleep. It sounded like Melissa so he rubbed his eyes, unlocked the door, and opened it.<br>\r\n<br>\r\nWas it Melissa at the door?</span></div></div>",
            "created":1284094800,
            "id":954187,
            "title":"A Voice At The Door"
        },
        "122132":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Hanna enjoys her meal of Jack….",
                "Melissa came home early. She tries to free Jack…."
            ],
            "content":"<div class=\"\"><div> <span>          Jack awoke to cool breeze and felt that he was lying on a cold surface that felt like metal. He was still groggy and his vision was a little blurred, so he tried to bring his hands to his face to rub it away, but he couldn’t. He found that his hands had been tied behind his back and his legs were bound as well. His blinked his eyes several times and his vision finally cleared. He could see that he was in the dinning room of Melissa’s house. Ahead of him on the wall was a clock; it was 7:15pm. Melissa had only been gone three hours. He looked down and saw that he was lying on a large metal serving platter. He got really scared by his situation when he glanced back and saw the smiling face of Hanna.<br>\r\n          She leaned in and licked his toes a couple of times, “Mmm yum. I see that my dinner is finally awake.” Jack through his fear he stuttered out, “D-d-dinner. I-I-I locked the room, how?” Hanna laughed, “Naïve boy, did you think I would give my daughter a lock on her door that I didn’t know how to pick and get into if I needed or wanted anything.” Jack asked her how she got him down to the dinning room and tied him up without waking him. “Well I could have just had you in her room,” Hanna answered as she lifted his backside so it pointed in the air, “But I like to change the ways I eat people and I also like to toy with them. So I used a little chloroform to knock you out long enough for me to make preparations. I of course waited for you to wake up because there isn’t any fun or pleasure in swallowing and digesting a limp and unmoving meal.”<br>\r\n          Hanna loosened the rope enough that she could spread his legs, but not to where he could move enough to kick her. He was startled when he felt her licking between his legs. She moved her tongue along his thigh and then up to a more sensitive area, which produced an immediate response even though Jack particularly didn’t like what was happening. Yes on any other occasion he would be into having a beautiful woman like Hanna pleasuring him in such a way, but he knew her intentions. Being the food for a beautiful woman might be purposefully pleasurable to some guys, but he rather be gobbled up by a beauty that he really cared about, not some random hottie. He hoped that he would escape this some how, even if it meant that Melissa came and saved him only to eat him herself. Hanna finally stopped tasting and sucking on him, “Mmm high school youths are always delicious. Now that your body is sufficiently aroused, it is time to devour you. That phone call came at just the right time to allow me easy access to this delicious dinner. You’ll be sleeping in a proper bed tonight, I have been told it is quite tight, but comfy.”<br>\r\n<br>\r\nWhat happened next?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1284094800,
            "id":954192,
            "title":"Tied Up On A Platter"
        },
        "1221321":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Hanna went up to her room to lie down while her body worked on him….",
                "5 mins after dinner, Melissa comes home to find Hanna with her full belly…."
            ],
            "content":"<div class=\"\"><div> <span>          Jack did his best to hold back his fear and keep his composure as he felt Hanna start to suck on his toes. She sucked his feet into her mouth and continued to work him into her mouth and down her throat. At his calves, she quickly untied the binding rope and speedily gulped him down to keep him from wiggling out of her mouth with the power of the free part of his legs. She had successfully swallowed him up to his hips, so he couldn’t move his legs because they were tightly confined in her gullet. His feet and lower legs had already entered her stomach.<br>\r\n          Her mouth was now around his waist; she lifted her arms up and sat up with her back now straight in the chair. She held him up and in place with her hands as spent extra time enjoying his midsection, thoroughly tasting him with her tongue. He couldn’t help be pleasured by the attention she was giving him. It also didn’t help matters that when he looked down he could see straight down and into her open blouse which had partially unbuttoned because of her swallowing him. She had a fantastic rack; he had to admit that he enjoyed the view and that if he didn’t have strong feelings for Melissa, he would have definitely been one of the numerous high school boys that wanted to get with Hanna. She finally finished with him as she moaned from the extra flavor that he couldn’t hold back from letting into her mouth. She let go and untied the binding around his arms and hands. She held them at his side and quickly gulped him further down. He came to the realization that Melissa wasn’t going to come home in time. He was going to be another lost friend for Melissa’s, just another tasty meal to fill her hot mother’s belly.<br>\r\n          Jack took one last look of the outside world as Hanna’s mouth enveloped his head and face. Her mouth closed and he felt the warm wetness of her tongue slid over his face, tasting him one last time before his head entered her throat. Finally the last of him was in her stomach. He wiggled around to do his best to get into as comfortable a position as he could be in, in the tight space. Hanna cutely burped a couple times from the movements that disrupted the air in her belly. She contentedly rubbed her belly, “Mmm, you were tastier than some of Melissa’s other friends that I have had.” Jack yelled, “You aren’t a very nice or smart mother! Your daughter is a nice and kind girl that should be able to bring friends home without having to worry about them. Besides, you just ate the friend that would have helped her pass her math class and graduate high school.” <br>\r\n          Hanna laughed, “Oh, you are not in any position to question me as a mother. I’m saving Melissa from the drawn out loss of high school friends, which would happen when she goes of to college and drifts apart from them. I’ve always told her it is better to eat as many tasty high school friends as she can, that way she will have those urges out of the way for when she makes real friends in college that she wants to keep. Besides, I have connections in her high school and with the college she will be going to; it doesn’t matter how her math class turns out, she will be graduating and then attending college.” Jack guessed he was half okay with his situation since he now knew his love would be able to graduated and continue her life, though he would have rather this scenario have played out with him in Melissa’s belly instead, if not getting to be her boyfriend.<br>\r\n<br>\r\nWhat happens next?<br>\r\n</span></div></div>",
            "created":1284094800,
            "id":954194,
            "title":"The MILF’s Meal"
        },
        "12213211":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "content":"<div class=\"\"><div> <span>          Hanna decided to go finish her dinner by going to bed. Jack got jostled around and it got tighter for him in her belly as she got up from the dinning room chair and turned. She had done this many times in the past, so she didn’t have too much trouble holding her big round Jack filled belly as she waddled over to the stairs and made her way up to her bedroom. She finally made it and laid down on her bed. She rubbed her belly, “Well it was nice to go through the whole meet and eat with you Jack, but big meals make me sleepy. I’ve been told that my belly is tight, but a comfy, so I guess you might as well sleep till your end comes. It will take some time to digest you sweetie, so you might as well rest while it happens. Try not to go all to my ass, it is big enough as it is.”<br>\r\n          Jack agreed that he might as well sleep. He was surprised by how warm and cozy it was to be inside Hanna’s belly. He resigned himself to the fact that he was just nourishment for her sexy body. A few hours after both fell asleep, the process accelerated and her belly filled with acid and the noxious fumes. The fumes actually spared him the pain from the acid, because they asphyxiated him. Her hungry belly worked on him as she slept through the night and all the next day and night.<br>\r\n          Hanna finally woke up after sleeping for more than a day. She felt revitalized and energetic. She looked at herself in a full length mirror after undressing before taking her morning shower, and was quite happy with what she saw. Jack had nourished her body perfectly to the point that he had enhanced most of her body. Her ass was just a little bit rounder, her breasts were fuller and perkier than they had ever been, and her thighs were even more shapely, which made her seductive meal luring walk, ever more seductive. Melissa was heart broken that she lost Jack, she yelled at Hanna that she actually felt she was starting to love him and had wanted to make him her boyfriend. If only Melissa had come home earlier to save him or if only the lock on her door was unpick-able, he would gotten want he wanted and been able to be with Melissa, but instead he nourished the body of a sexy MILF.<br>\r\n</span></div></div>",
            "created":1284094800,
            "id":954201,
            "title":"Nourishing Fate"
        },
        "1222":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "It was a distraction to get him in place. She swallows him headfirst….",
                "She actually just intended to make love with him…."
            ],
            "content":"<div class=\"\"><div> <span>          Melissa drove for fifteen minutes. Jack saw as they went through the residential areas and suburbs. He didn’t really think anything about it, other than maybe she lived further in the countryside. He then began to wonder what she was doing when she drove onto a slightly hidden dirt road in the woods. The road started to incline and then they cleared the trees stopped in a large clearing at the top of a hill. Out in front he could see the town off in the distance. She had driven him to make-out ridge.<br>\r\n          Jack’s heart started to beat faster when Melissa crawled through the middle into the backseat, smiled mischievously, and motioned for him to join her. He couldn’t help himself, since he guessed what she could be wanting to do. He got in the backseat with her and waited to see what she would do. She grabbed his shirt and almost tore it trying to get it off him. He couldn’t believe what was happening, so he was frozen with shock. She moved in very close, then pulled him in and started to kiss him. He really liked her so he of course started to kiss back. They made out for a couple minutes.<br>\r\n<br>\r\nWhat was Melissa’s intentions?<br>\r\n</span></div></div>",
            "created":1284008400,
            "id":952999,
            "title":"Make-Out Ridge"
        },
        "12221":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Yes, he was digested by Melissa and is no more….",
                "No, Melissa digested him, but he reformed in his room the next day…."
            ],
            "content":"<div class=\"\"><div> <span>          After about five minutes of kissing, Jack felt Melissa grab a hold of him tighter. Her right hand went up his back and rested on the back of his head. He felt her push hard and she began to envelop his head with her whole mouth. She easily gulped his head and his shoulders quickly slightly pinning his top arms to his sides. He was sad that his sister had been right about Melissa that she would most likely have been interacting with him to make him vulnerable and easy prey. In a desperation move to try and get her to cough him back up, he put his right hand on her ass and grabbed a hold tight, while he put his left hand down her pants and started probing her womanhood with his fingers. He thought that if he pleasured her or offended her enough that she would spit him back up.<br>\r\n          Jack could tell he had pleasured her with his actions because she released a couple moans of pleasure and approval that reverberated around his head in her throat and out her mouth around his chest. His actions had the opposite effect of what he wanted. Instead of releasing him, she swallowed faster and gulped him up passed his belly, which pinned most of his arms. His hands and a little past his wrists flailed about out from her lips. Melissa “mmmed” and “ahhed” and then proceeded by unzipping and slipping off his jeans and then sliding off his underwear. He had already been aroused from and since the start of the make-out session. She giggled through her swallowing as she playfully batted at his manhood. His head, shoulders, and chest had entered her stomach. She lightly rubbed and tugged on his manhood to get him ready for what came next. He did his best to hold his composure from being pleasured greatly. It was then that she pushed it up against him so that it was pointing at her mouth. She speedily swallowed it and his midsection and backside. She played with him thoroughly by sucking and moving her tongue. He couldn’t take it any more and let loose along her tongue and down her throat. She moaned and “mmmed” approvingly about the new flavor.<br>\r\n          She had swallowed him up to his knees. The lower part of his legs wiggled franticly outside her mouth. In a couple more minutes, she had slurped the rest of him down. Every bit of him had slipped into Melissa stretched but still tight and cramped belly. The girl that Jack thought he really loved had made a meal of him at make-out ridge.<br>\r\n<br>\r\nWas this the end of Jack?<br>\r\n</span></div></div>",
            "created":1284008400,
            "id":953002,
            "title":"Make-Out Meal"
        },
        "122211":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "content":"<div class=\"\"><div> <span>          It was an interesting experience being curled up in the warmth of a beautiful girl’s belly. Jack heard Melissa’ stomach gurgle and groan. He did his best to wiggle and move. He tried pounding his arms and hands on the sides of her stomach, “Melissa, why did you eat me? I really loved you; I was going to help you with your math class, now you will fail if you don’t have help. I thought I sensed some signals from you that you loved me too.” <br>\r\n          Melissa patted her belly and let out a cute little burp, “Of course I loved you Jack. I loved how you tasted. I loved how you followed me and fell straight into my trap. Boys that turn sixteen, whether they have the power or not, are so gullible; all a curvaceous hottie like me has to do is bat my eyelashes and give a few compliments, then act like I need help, then young boys like you obliviously walk right into my belly. Oh, and don’t worry about that math class. Since I turned sixteen and found out I had the power, I chose a class that I would use to lure young prey to me. Find a nice kind student to try and help me because ‘I’m just not good at math’. Hilarious how well it works. I purposely failed the first two years. It got me some easy meals. The first year, I got two boys and a girl, yes I work both sides of the fence, sometimes I feel that girls taste better. The second year I did a whole lot better, four boys, and couple more girls. Sweet sixteen is right, sweet meals to swallow.”<br>\r\n          “I can’t believe this happened,” Jack shouted, “My sister was right. She suspected that you were playing me, the only part of the disappearance stories I believe were that it was your mom that ate all the people you brought home.” Melissa giggled as she rubbed her belly, “Oh, your sister was right about me and about my mom. She loves naïve young students like I do. Some of the students I lure, not just the ones from the class ruse, I bring home for her to have a meal as well. It is amusing how hard the boys try to bed my mom, though the only bed they end up in is the cozy bed of her belly. I am surprised that you aren’t as frantic and lively as most of my prey is once it is in my belly.” Jack moved a bit, “As I told you, I really had strong feelings for you. And knowing that I had a very good chance that my life would be short, I decided to take a risk on you. Yes it got me devoured by you, but at least I am feeding a beauty like you.” <br>\r\n          “Ah that is so sweet,” Melissa said letting out another burp, “It’s rare to find a meal that accepts his fate. Well time to lay back and relax as I digest you, maybe I’ll take a nap. My mom knows I’m here; she won’t be worried, sad that I didn’t give you to her, but not worried. You were a fun dinner, cuter and kinder than most boys. You know, I think I will complete the sibling set. My next target is your sister; she was suspicious of me, but I bet she is just as susceptible as you were to my advances. I’ve seen that lovely ass of hers, it will be delicious.” Jack relaxed and waited for digestion to begin. He smiled about what Melissa had planned. At the beginning of the school year he had begged Allison to eat him; now he knew that in a way she would. Melissa would digest him and make him a part of her, but he knew that when he didn’t come home, Allison would know what happened and confront Melissa and see that she had a few enhancements from the nourishing she received from him. Even without that, Allison was smart enough not to fall for Melissa, so Allison would eat her, indirectly making him a part of her and get revenge on Melissa for eating him.<br>\r\n          That is exactly what happened. After Melissa digested Jack, her ass got a little extra padding and her breasts filled out more. Allison devoured Melissa and a few days later she finished the job by going over to Melissa’s house and gulping her plump mom as well. Allison was grateful that her brother led her down the course of getting to eat two juicy sweet meals, but she wasn’t too happy that it broke her diet for the year. She gained quite a bit of extra plumpness in her ass and breasts. She was at the point that many swallowers were thinking about breaking the fine line code and going after her. But no one was able to do it. She gulped all that tried. In the year book that came out a few weeks before she graduated, it had under her picture, “Most likely to eat the entire senior class before graduation.”<br>\r\n</span></div></div>",
            "created":1284008400,
            "id":953003,
            "title":"Not The Love He Was Looking For"
        },
        "123":{
            "author_id":"skees",
            "author_name":"ItsMe",
            "choices":[
                "Breasts. She wanted to play with her food a bit more.",
                "Mouth. She was hungry.",
                "The biology teacher walked in, putting a stop to her actions. Jack was her's."
            ],
            "content":"<div class=\"\"><div> <span>          The final bell rang and Jack got up from his desk.<br>\r\n          He was planning on being one of the first to leave the class, but he clumsily knocked off his books from his desk as he retrieved his bag. He picked up the books and was one of the last to leave. As he got to the door, someone entered. She was wearing a cheer leading outfit with the school colors. She looked him straight in the eye and smiled her soft, luscious lips. Jack took a subtle gasp, it was Claire and she seems to be blocking his way.<br>\r\n          \"Have we met?\" She asked, knowing the answer.<br>\r\n          \"I don't think we did.\" Jack tried to move around her, but every action he does, she moves in front of him. She began to hum in a thinking tone, tilting her head to the side, placing a finger on her chin and looking up. Jack peered across the room, maybe there was an open window. There was none, in fact, it dismayed him to know there was no one else in the room. He looked in front of him to see Claire has gotten closer and straighten her back, allowing her breasts to be ever closer into view.<br>\r\n          \"Oh I remember you.\" She said before licking her lips, \"You're the kid that couldn't stop staring at me that one time.\" Claire grabbed his hands and set them on her exposed belly. Jack started getting extremely aroused. He didn't want to get eaten, that doesn't mean his manhood can't be excited.<br>\r\n          \"Claire, please-\" Jack began to beg.<br>\r\n          \"It looks a lot better when it's not occupied,\" She continued as if he said nothing, \"doesn't it?\"<br>\r\n          Jack glanced down to see her smooth belly just below her cleavage. She was right, it did look better, more inviting even. She placed her hands on his chest and grasped his shirt. She pushed him back until he was lent against the counters on the other side of the room. Her tongue glided across her lips again. Claire placed his hands on her bare hips and pounced on him. He was lying on his back with her sitting on his waist. Jack was clearly turned on by this, and Claire noticed. Jacks working senses, however, are telling him to run.<br>\r\n          Claire grabbed his hands gently and slid them north towards her...</span></div></div>",
            "created":1411968780,
            "id":1863637,
            "title":"Caught by the cheerleader"
        },
        "13":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "The parents from across the street want Sarah to watch their girl for a week….",
                "Knock at door. The neighbor boy kicked his ball into her backyard….",
                "Knock at door. A plump cheerleader, she was trying to raise some money….",
                "She goes to a swallowing restaurant….",
                "More choices…."
            ],
            "content":"<div class=\"\"><div> <span>          Sarah’s life was turning out better then she had hoped for. That was good of course. She had just graduated college, though now it really didn’t matter to her anymore. She had recently won the lottery. She chose to take the lump sum option and after taxes she received one hundred and eighty million dollars. Did all her homework on the matter and found the best financial people to help her. She invested some of the money and banked a good deal of it as well. She didn’t go crazy with the money the only thing she bought was modest fully furnished two story house in a nice little suburb and a new car. Those purchases only cost her five hundred thousand dollars. The house had a nice front and backyard. The backyard had a small pool. The reason she was spending so little was because she wanted to invest and grow the money so that she wouldn’t have to worry about money for the rest of her life, and maybe use it to have and raise a family.<br>\r\n          She was young, only being 23 years old, so she felt that the family plan could wait for five or so years, sooner if she really found a guy she liked, one that she didn’t immediately swallow. She had the looks to lure any guy she wanted to her. She was 5ft 8ins tall with medium length brunette hair. She had a semi-plump body type with D-cup breasts and a very well rounded plump ass. It was an ass that came from eating quite a few of her classmates when she was in college, guy and girl alike. Interesting part was that she actually preferred eating girls. Guys tended to taste the same no matter whom she ate, but girls were different. Depending on the type of girl, each could have a certain flavor. The flavor seemed to depend on the hair color of the girl. Blondes had a light sweet flavor, redheads were spicy, black-haired girls were extra sweet with a little spice, and brunettes were special. Brunette girls were Sarah’s favorite, brunettes tended to have many flavors, sometimes they could taste like a blonde, sometimes like a redhead, and other times like a black haired girl, but for the most part, brunettes tended to be a balance of sweet and spicy, just enough sweet and just enough spicy. Sarah was a little vain, and occasionally when she looked into her full-length mirror, she wished that she could eat herself, especially since she was a brunette.<br>\r\n          Her situation was a dream come true for a young swallower. Sarah didn’t have to worry about money. She had a nice secure house in a lively well-populated community with a nice sized town nearby. It was a place filled with many unsuspecting meals. She had ‘made friends’ with several families in the neighborhood. Nobody knew she was a swallower, they just knew that she was a very rich person. There were quite a few tasty looking of age teens that lived on her block, as well as some nice looking wives/moms. There weren’t too many fathers on the block. It is understandable in this day and age, the man of the family would have either been eaten by his swallower wife or if he didn’t have a swallower wife, a hungry woman at work or in town would probably have devoured him. There was also a high school only a few miles away, so since she had plenty of free time, Sarah could go hunt for some free meals there, though if she didn’t want to work for her food, she could just go to a swallower restaurant, since she could definitely afford to go to one whenever she wanted. She had also thought of ordering a few mail order girls to have a little fun with then devour; she always wanted to try foreign food.<br>\r\n          Sarah had an easy life a head of her. She had paid of her college bills with her lottery money, and she wouldn’t have to use the degree to find a job anyway. She all the free time in the world to have as much fun as she could handle. The world was now her oyster and she was going to gulp it and most likely many of her neighbors.<br>\r\n<br>\r\nWhat was happening in Sarah’s life now? What was Sarah doing now?<br>\r\n</span></div></div>",
            "created":1283922000,
            "id":952489,
            "title":"A Lottery Swallower"
        },
        "134":{
            "choices":[
                "Digest Lucy now. ",
                "Goes home and digests Lucy. ",
                "Goes home and throws Lucy back up. "
            ],
            "content":"<div class=\"\"><div> <span>So, Sarah decides to try one of those fancy swallowers restaurants. She researched on the Internet all night to find the best restaurant in her area and she finds one; 'Mikey's Mouthful'. With five-star ratings and cost not a problem, she books a reservation for the next night at 7pm. <br>\r\n<br>\r\nSo, the next night she sets off and arrives at the restaurant just on time. She was given a table and a waitress came over. <br>\r\n\"Good evening ma'am, welcome to 'Mikey's Mouthful'. Are you ready to order now?\" Sarah was actually ataken back by the waitress' naturally beauty. She wore a white corset that went down to her knees, 5-inch stiletto's, and very little make-up. She wasnt the type of girl you'd expect in this place. <br>\r\n\"Yes, I'd love a number 24 please, which is a average-height brunette.\" Sarah still couldn't help but stare at the waitress's fair sized breasts. <br>\r\n\"I'm sorry, we've just sold our last 24. I can offer you something else, or you could choose me, as waitress's are available to order when your first choice is unavailable.\" It looked as if the girl wanted to eaten, so Sarah didn't want to miss this opportunity. <br>\r\n\"Well, if you're offering, then I'd love to purchase you.\" Sarah grins, struggling to believe her luck. <br>\r\n\"Ok then!\" The girl giggled. \"That'll be $150 please.<br>\r\nSarah hands her the cash and the girl walks off, only to return moments later. <br>\r\n\"Thank you. Now, I'll just go and get ready, then I'm all yours!\" The girl skipped away after leaving what looked like an ID card on the table. Sarah picked up the card, which read;<br>\r\n\"Lucy, aged 25. Swallower, with the 'Power'. Enjoy!\".  <br>\r\nSarah realised she was in for a real treat tonight. How could she resist this girl, whose face was so pure and breasts moulded to perfection. Then, a pair of swinging doors at the back of the restaurant swung open and out cam Lucy, wheeled in on a metal trolley. She was naked, not a scrap of clothing on her. Her legs were tied together at her ankles and thighs, and her arms were secured behind her back. Her silky light brown hair was plaited beautiful and tied up, and all the other hair on her body had been shaven. Sarah was highly turned on. <br>\r\nAs Lucy was lifted onto the table by two other waitress's, Sarah could feel her nipples turn to stone, and developed this feeling of excitement in her stomach. <br>\r\n\"Well hello there. Are you ready to eat me?\" Lucy wiggled her toes in Sarah's face, who was just staring at Lucy's delicate body. <br>\r\n\"I sure am.\" Sarah nodded. <br>\r\n\"Great! You eating my head first or feet first?\"<br>\r\n\"Erm, I think I'll eat you head first. That is if that's all right with you, Lucy?\" Sarah couldn't wait to get started, but she also wanted to savour this moment. <br>\r\n\"Of course! I don't mind either way I suppose. Oh, do you mind taking a picture of us two together, it's the first time I'll be eaten.\" Lucy shuffled into position while Sarah took a great shot of them both. <br>\r\n\"Ok, let's go!\" Sarah picked up Lucy's head and placed it on her mouth. She began to swallow. Lucy was sucked into Sarah's stomach. As her breasts entered Sarah's mouth, Sarah gave them each a huge lick and suck, which turned both of them on even more! Sarah kept swallowing until she reached Lucy's sex. Sarah dived her tounge straight in, resulting in them both receiving the greatest orgasm of their lives. Sarah noticed she was bulging quite a lot now, so she rested Lucy's legs on the table and unbuttoned her shirt, exposing her large belly. Then, she grabbed Lucy's legs and continued to push them down her throat. Sarah wrapped her lips around Lucy's ankles, untied the rope and prepared to take the last major swallow. Lucy gave her toes one last wriggle before her feet, bare and delicate, left the freshair and entered Sarah's body. <br>\r\n<br>\r\nOnce Lucy was comfortablely curled up in Sarah's stomach, Sarah decides to...</span></div></div>",
            "created":1292015160,
            "id":1012041,
            "title":"She goes to a swallowing restaurant…."
        },
        "1343":{
            "choices":[
                "Sarah awakes and Lucy has been digested.",
                "Sarah awakes to find Lucy next to her (Lucy somehow escaped)",
                "Sarah awakes to find Lucy escaped and then devoured her!"
            ],
            "content":"<div class=\"\"><div> <span>Once Lucy was settled nicely in Sarah's stomach, Sarah pushed herself to her feet and walked, well more like waddled, over to the door. After enjoying such a huge meal, the fresh air of the warm night seemed to please Sarah. She had always been one with a love for the outdoors, but right now she was in no fit position to take a casual stroll home - with a stomach full of sexy girl and night-time meal-seekers on the prowl, Sarah figured it would be best to drive home. She climbed into her new car, only to find the steering wheel uncomfortably forced into her girl-filled stomach. After adjusting the chair, she carefully made her way home. She never thought driving on a full stomach would be so difficult, but she arrived home thirty minutes later and stumbled through her door. <br>\r\n\"Well Lucy, what shall I do to you now?\" Sarah laughed to herself, rubbing her large bulge. \"How about I throw you back up and we have a little...fun?\" Sarah kicked off her shoes and proceeded up the stairs. She jumped backwards onto her bed and rubbed her stomach. She then began the process of regurgitating Lucy. Sarah had only done this procedure once before but she was confident about it. <br>\r\n<br>\r\nSarah felt Lucy's head move up her body. Soon it filled her throat. Bit by bit, Lucy's body began to reappear from Sarah's mouth. Lucy squinted as light filled her eyes once again. Sarah pushed out Lucy's succulent breasts, taking great pleasure in tasting them for a second time. As Lucy's sex emerged, Sarah took no hesitation in driving her tongue straight into Lucy's wetness. Lucy moaned in pleasure and Sarah licked her thoroughly. Soon enough, only Lucy's delicate feet were left in Sarah. Sarah had always admired the beauty of the female foot, so she gave Lucy's feet an almighty suck before letting them fall onto the bed. <br>\r\n<br>\r\nSarah looked down at the nude Lucy, who was sprawled out on the bed covered in Sarah's bodily fluids. Sarah crawled on her knees to Lucy, who sat up and moved closer to Sarah. Sarah took Lucy's hands and guided them towards her blouse. Lucy began to unbutton Sarah's blouse as they shared a passionate kiss. Once the blouse was thrown to the floor, Sarah reached behind her and unclipped her bra, allowing her lovely breasts, which she had always been rather proud of, fall free. Lucy was now pulling Sarah's stockings down. Sarah fell backwards, allowing Lucy to pull off her stockings. Lucy took Sarah's bare feet in hand and started to kiss them and suck her toes while Sarah wriggled out of her damp panties. <br>\r\n<br>\r\nNow with both girls naked, the real fun began. After several amazing hours of kissing, girl-on-girl sex, foot licking, toe sucking, and breast gropes, the girls lay back and enjoyed the relaxing feeling you get after a night of orgasm after orgasm. They shared one last passionate kiss before Lucy sat up. <br>\r\n\"Tonight has been great fun but you paid for a meal, so you still have to digest me.\" Lucy giggled as she jumped on top of Sarah. \"Oh, and if you ever want to meet up again, you know where to find me!\" <br>\r\nSarah sat up and grabbed Lucy's head. She forced it and began to consume the naked girl yet again. She spent several minutes just holding Lucy's sex in her mouth as she drained her of any 'juice' she may have left. She gave her feet one last suck and then swallowed Lucy completely. After such an amazing, yet tiring night, Sarah decided to climb under the duvet and get some sleep. </span></div></div>",
            "created":1311040440,
            "id":1150086,
            "title":"Goes home and throws Lucy back up. "
        },
        "13431":{
            "choices":[
                "\"Yeah, I'd love to help!\"",
                "\"Sorry, I don't fancy it.\""
            ],
            "content":"<div class=\"\"><div> <span>Sarah awakes with the morning sun blazing through her window. She rubs her eyes and takes a peek under the covers to see her naked body was back to its original size. She threw the covers back and slowly climbed out of bed. She grabbed her red velvet robe and flung it round her nude body. Sarah walked downstairs and poured herself a glass of milk. Although it was 10:00am, last nights amazing meal had filled Sarah enough that she didn't require a breakfast just yet. So she went and sat down in the lounge and turned on the TV. Sarah loved to snuggle up on the sofa with nothing but her robe on and watch TV or read a magazine. And she didn't appreciate it when someone rang the doorbell. Rather annoyed, Sarah peeled herself from the couch, tightened her robe, and went and opened the door. Fortunately, it was her best friend Jessica. Jessica had very long brown hair, was quite tall, and had large breasts. Although not as pretty as Sarah, she sure was a very attractive young lady. Without needing an invitation, Jessica gave Sarah a hug and proceeded into the lounge. Sarah, still slightly sleepy having only just got up, shut the door and returned to the lounge. <br>\r\n\"So? How was last night?\" Jessica smiled, edging closer to Sarah. \"You did go to that restaurant, didn't you?\"<br>\r\n\"Yes, I went. And it was extremely fun, I must say!\" Sarah laughed, glancing at her stomach, smiling at the thought of Lucy's remains in her stomach. \"I had this amazing girl named Lucy and once I'd eaten her, I came back here, threw her back up and we had...well let's just say we had some fun before I ate her again and digested her.\" <br>\r\n<br>\r\nSarah filled Jessica in on what happened the previous night, and Jessica told Sarah about her date that night and how it had ended in disaster when the guys wife turned up. Jessica and Sarah had always had trouble with men, so they would often joke about marrying each other just to save on all the hassle. <br>\r\n\"Anyway, the reason why I call round was to see if you have any plans for tonight?\" Jessica shouted in from the kitchen as she made herself a drink. <br>\r\n\"Not tonight, I was just planning on having a quiet night in. Why?\" Sarah called back, who was still in the lounge. <br>\r\n\"Well my sister is going away tonight for the weekend so her daughter is staying with me until Monday and for her school homework she has to make a film of her consuming someone so I said we'd help her. What do you say?\" Jessica returned to the lounge and sat back next to Sarah. <br>\r\n<br>\r\n</span></div></div>",
            "created":1311546720,
            "id":1153865,
            "title":"Sarah awakes and Lucy has been digested."
        },
        "134311":{
            "choices":[
                "Vore restaurant for lunch.",
                "She gets eaten on the way to town!"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, I'd love to help!\" Sarah announced. \"How old is she now then?\"<br>\r\n\"Freya is seventeen in a couple of months, so she's been learning about vore at lot lately.\" Jessica explained. \"She's coming round to mine at about five this evening, so you can come round whenever you're ready.\"<br>\r\n\"Why don't you come round here and do it?\" Sarah suggested. \"We can do it in the spare room upstairs, there's plenty of room in there, plus I've just decorated it.\" <br>\r\n\"That's a great idea! We'll be round at about six o'clock then.\" Jessica was now just leaving to go to work. <br>\r\n<br>\r\nIt was now noon and Sarah still wasn't dressed. She went upstairs, but took a detour to the bathroom first. After a rather lengthy bathroom visit to say goodbye to Lucy, Sarah threw on some clothes and decided to into town for a few hours. With money not being a problem, she could go to anywhere she wanted, provided she could get home on time for Jessica and Freya. <br>\r\n<br>\r\n<i>Where does Sarah go?</i></span></div></div>",
            "created":1311547260,
            "id":1153868,
            "title":"\"Yeah, I'd love to help!\""
        },
        "135":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "She went to the high school to catch some young belly fillers….",
                "She looked at a mail order bride/food service site and placed an order….",
                "She went to a bar to pick up a fun companion, most likely a late dinner…."
            ],
            "content":"<div class=\"\"><div> <span>          Sarah had the free time and money to do anything she wanted. There are still more possibilities of what she can do. The high school would soon be letting out for the day, so she could head over there and catch a couple tasty students for dinner. She could use a mail order bride/food service and order a couple tasty foreign chicks to have fun with then eat. The service wouldn’t care that she was a woman ordering brides, as long as she paid them, they didn’t care if they were sending the girls straight into a person’s belly. She could also go to a bar and pick up some sweet treat to take home.<br>\r\n<br>\r\nWhat did Sarah do?</span></div></div>",
            "created":1283922000,
            "id":952491,
            "title":"What Else Could Sarah Do"
        },
        "1351":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "She regurgitates Cassandra and lets her go if she agrees to come back weekly.",
                "She regurgitates Cassandra but ties her up and keeps her as a slave. ",
                "She enjoys Cassandra's moans and begging as she digests the gorgeous latina."
            ],
            "content":"<div class=\"\"><div> <span>Sarah decided to go and catch some young tasty treats for a snack.  She drove to a local high school and got there at dismissal.  She saw a good portion of the kids walking home.  She was looking for a nice tasty girl.  She found that girls generally tasted as good as they looked.  She soon spotted one.  She was walking home by herself listening to her iPod.  She looked Mexican, definitely Latina.  She wasn't very much over five foot but she had that nice golden skin tone and great curves.  She followed her and was discreet until she could catch her with no one around to help her.<br>\r\n<br>\r\nFinally she got her chance, no one was around as the girl walked down a street.  Sarah chuckled at a sign that read “Dead End Ahead.”  She pulled up to the oblivious girl and parked in a driveway right in front of her.  She grabbed her tranquilizer and got out of the truck she was driving.  The girl looked at her but didn't pay her much heed.  She was taken by almost total surprise when Sarah pounced on her and sunk the tranquilizer into her arm.  The tasty looking girl struggled for a few seconds in Sarah's arms before becoming temporarily paralyzed.  <br>\r\n<br>\r\nShe placed the girl in the back of the truck and tightly bound her ankles, knees, elbows and wrists.  The girl was not busty but she had a decent chest, had a pretty face and long dark hair.  The girl was paralyzed but still conscious as Sarah got back in the truck and drove off.  She hummed to herself and started to mock the girl on how tasty she looked.  As they got closer to her house, the girl started to regain her mobility.  <br>\r\n<br>\r\n“Can, you talk yet?”  Sarah asked.  The girl grunted a few minuets later she spoke.<br>\r\n<br>\r\n“Yes.”  She said tiredly.  <br>\r\n<br>\r\n“So tasty-thing, what's your name.”  She said smiling.<br>\r\n<br>\r\n“Ca- Cassandra.”  The girl replied.<br>\r\n<br>\r\n“Well Cassandra we're at the last place you'll ever have to worry about.”  Sarah said grinning.  Cassandra started to whimper as Sarah came around and carried her in on her shoulder.  Cassandra started begging.<br>\r\n<br>\r\n“Please don't eat me I don't want to die!”  Cassandra said crying.  “Please sophomore year just started!”  She struggled with her bonds, she was tied up in edible tape that copied the taste of who it restrained.  Meanwhile Sarah cut away at her shirt, bra, pants and panties.  She looked at her completely shaven and tasty meal.<br>\r\n<br>\r\n“You're going to be a good meal.”  She said giving Cassandra's smooth and sexy belly a quick tickle, this made Cassandra squeak and squirm.<br>\r\n<br>\r\n“No please, I hear digestion is excruciating!”  She said begging.  Sarah shrugged.<br>\r\n<br>\r\n“It is.”  She said simply as she took in Cassandra's toes and got a wonderful flavor.  Cassandra tasted great, salty and sweet.  She hoped she squirmed in her belly as her digestive juices slowly dissolved her young and unfortunate victim.<br>\r\n<br>\r\n“Please miss!”  Cassandra said begging.  “Don't you want like a slave or something.  Please I have to babysit my younger brother.”  Sarah just took in the arch of Cassandra's foot.  The first idea wasn't half bad.  She wouldn't mind having a girl as good looking and tasty as Cassandra as her slave, she wasn't to worried about the second part.  Cassandra just started to whimper and shake and Sarah got to her ankles.  She gulped in nice and slowly, she nibbled and enjoyed her calves.<br>\r\n<br>\r\nShe then went up slowly to her thighs.  They were toned but meaty, she slapped them a bit and made them nice and tender.  She then bit down on them and enjoyed there flavor for a few minuets.  Then she moved on and took in her curvacious ass.  It was soft and meaty, she enjoyed it before she got to the best part, her midsection.<br>\r\n<br>\r\nShe slapped it hard for a few minuets, making Cassandra cry and making her golden belly red.  Then she tickled the ultraticklish girl's belly for a few minuets until she was out of breath.  Then using her long tongue she slid around her smooth and soft belly.  It tasted so good and she loved the soft texture.  She slid her tongue all around, coating Cassandra's midsection in wet saliva.  She put her tongue in her navel and enjoyed that as well.  Then she bit down hard a couple of times and chewed her stomach.  This made Cassandra groan in pain.  <br>\r\n<br>\r\nAfter almost a half hour Sarah swallowed again.  Cassandra was shaking so much from fear she couldn't speak.  Most of her body was in Sarah's gullet now and she bit down and tasted her ribs before taking in her developed breasts.  Cassandra was able to mumble out some sort of plea before her face was licked and it to entered Sarah's throat.  Finally she slurped up Cassandra's arms like spaghetti and leaned back as Cassandra entered her belly with a plop.  Cassandra was forced into a vertical hogtie with her arms and lower legs pressed behind her and her midsection sticking out into the stomach wall.  This meant at first her midsection would take the brunt of the acids.<br>\r\n<br>\r\nSarah stroked her belly and contemplated her choice.  Should she let Cassandra out or digest her.  She always enjoyed as her meals tried to escape the burning acids and they forced to soak in.  The squirming felt good.  But perhaps she could let her out and go home.  She didn't like that idea but she could keep her as a slave.<br>\r\n<br>\r\nAcids started to coat Cassandra.  “Please it already burns.  Please it hurts really bad!”  The Mexican sixteen year-old yelled.  Sarah knew that the acids would burn even more later and again contemplated her options.  </span></div></div>",
            "created":1346808240,
            "id":1421088,
            "title":"A Mexican Snack"
        },
        "13511":{
            "choices":[
                "Cassandra comes back every week like promised",
                "Cassandra breaks her promise to Sarah "
            ],
            "content":"<div class=\"\"><div> <span>Sarah felt slightly and for the poor girl, and found a bit of mercy inside of her. She regurgitated Cassandra, looking at the young girl's petrified face. \"I'll let you go, but you have to come back here with me every week. If not I'll swallow you and I won't let you out. Got it? Cassandra shook her head wildly and broke into a run, down to her house. She hugged her little brother who was standing on the porch than hauled him inside, clearly still frightened by Sarah.</span></div></div>",
            "created":1403461020,
            "id":1815929,
            "title":"She regurgitates Cassandra and lets her go if s..."
        },
        "13513":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Wait until nature calls",
                "Find more yummy girls to eat"
            ],
            "content":"<div class=\"\"><div> <span>As Cassandra begged, Sarah began to pleasure herself, competely ignoring her meals pleas. Cassandra screamed again as the brunt of acids hit her. Sarah's belly almost jumped as the struggling girl within was reduced to so much meaty goop. Sarah whispered some last words to her meal as she slipped away. \"If it makes you feel better, you were scrumptious, cutie.\" Cassandra merely moaned and then, as acid poured down her throat, died. He body was soon nothing but runny liquid in Sarah's stomach. Now, Sarah decided to...</span></div></div>",
            "created":1362168240,
            "id":1541697,
            "title":"She enjoys Cassandra's moans and begging as..."
        }
    },
    "info":{
        "author_id":"writerlord",
        "author_name":"OBusywriter",
        "brief_description":"Follow the lives of people as they live in a world where vore is common place.",
        "created":1283970600,
        "description":"<td align=\"left\" class=\"norm\">This is a story about a world where some people can swallow other people whole. It has come to the point where most people that have this power of vore, consider people with out it as food.<br>\r\n<br>\r\nRules, follow them to the letter or your chapter will be deleted:<br>\r\n<br>\r\n1.) This story is strictly F/F, F/F, M/F. So no M/M, to avoid it, just have one guy in a story arch at a time. Once one guy is totally gone from the story, you can add another if you want.<br>\r\n2.) There are only to be humans, no animals or human like animals or aliens.<br>\r\n3.) The age range of new characters if you add them is 16 to 36. No younger no older.<br>\r\n4.) Sometimes a character can find out they have the power to survive being digested. They will digest, but later they reform at their home with the same but a new body. This power can disappear, but of course the character won't know it until it is too late. The survive power makes it so that the person can't feel being digested.<br>\r\n5.) No mentioning of the swallower going to the bathroom after digesting a person. Well, you can say they went to the bathroom, but no graphic details. Also, don't mention how a swallower has to stretch his or her mouth to swallow someone, it is implied and doesn't need to be said, I don't like thinking of it anyway.<br>\r\n6.) Chapters must be at least 5 good sized sentences long. I would like longer chapters but I understand that not everybody can sit and write that long.<br>\r\n7.) Run your work through a word processing spell checker before adding. I can't be bothered by going through and changing grammatical errors, if I see them I will just delete the chapter.<br>\r\n8.) The stories in this interactive are in the third person prospective. So no \"you\" or \"I\", unless it is a character talking in quotes.<br>\r\n9.) Look at how I do quotations with my dialogue in the chapters that I write, do yours the same way. I can't stand it when people have dialogue with no quotation marks used or used improperly, it is confusing. I usually go in a deleting rage if I see it.</td>",
        "id":1706306,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1411968780,
        "modified":1411968780,
        "pretty_title":"A Life Of Vore: Volume.1"
    }
}