{
    "chapters":{
        "1":{
            "author_id":"bl00dedge1",
            "author_name":"Hallmark ",
            "choices":[
                "Continue Home",
                "Possess a Pokémon ",
                "Team Rocket shows up",
                "A trainer thinks your a Pokémon ",
                "Readers choice on what happens next"
            ],
            "content":"<div class=\"\"><div> <span>Ash was walking back to Pallet Town after the Johto League and decided to spend a bit more time at home with his Pokémon and his super hot mom. Ash always like hot older women like Nurse Joy, Officer Jenny, Mistys sisters, and Jessie, if she wasn’t apart of Team Rocket. <br>\r\n<br>\r\nAs he walked he noticed a strange altar in the middle of the forest curiously he went over to the center and read the plaque. For those who wish for a great gift it shall be bestowed upon you however it shall only work for one who is pure of heart and has a kind soul<br>\r\n<br>\r\nAs Ash touched the center he wished he had the power to possess any women that he chooses and that he could have a wonderful harem, and finally be a Pokémon master.<br>\r\n<br>\r\nThe altar glows and suddenly a bright light covers the forest and Ash feels different before anything else he notices himself turning into a liquid form and once he becomes a puddle it swiftly forms into a slime body.<br>\r\n<br>\r\n“Woah! This is awesome but how do I change back into my human form? Maybe if I concentrate I can turn back.” Ash wondered. He pictures his body and next thing he knows he’s back into his human form.</span></div></div>",
            "created":1579064400,
            "id":2774166,
            "title":"Prologue"
        },
        "13":{
            "author_id":"bl00dedge1",
            "author_name":"Hallmark ",
            "choices":[
                "Jessie",
                "James",
                "Meowth",
                "Cassidy",
                "Goivanna"
            ],
            "content":"<div class=\"\"><div> <span>Ash hears rustling in the bushes and turns back into his liquid form, hides in the grass, and waits patiently for the Pokémon to come out. One problem it wasn’t a Pokémon it was Team Rocket Jessie James and Meowth.<br>\r\n<u> Honestly, don’t they ever give up. They should realize that they will never get pikachu or any of my Pokémon.</u> Ash said in his head as he looked at the three stooges going over their “master plan” to try and catch pikachu.<br>\r\n<br>\r\nAfter going over their plan, they set out a picnic basket and prepare to eat their feast. You notice their drinks and slip into one of their drinks without them noticing. Once inside you mix with the lemonade and find it refreshing and cool. Suddenly the cup moves and you look and see that —-is about to drink you.</span></div></div>",
            "created":1579496400,
            "id":2776128,
            "title":"Team Rocket shows up"
        },
        "131":{
            "author_id":"bl00dedge1",
            "author_name":"Hallmark ",
            "choices":[
                "Head back to Pallet",
                "Leave Team Rocket",
                "Transfer Jessie’s Pokémon to Ash"
            ],
            "content":"<div class=\"\"><div> <span>Jessie chugs down her lemonade without noticing Ash slip down into her stomach. Ash, in Jessie’s stomach, quickly rushed to her mind to try and take over her body.<br>\r\nOnce Ash reaches the brain, he wraps himself around it and slowly starts to join with her brain.<br>\r\n<br>\r\nOn the outside, Jessie grabs her head and wonders why it feels like someone is pounding in her brain. Eventually her eyes roll back and Ash’s brown eyes replace her old ones and her chest grew from C cup to DD cup.<br>\r\n<br>\r\nAsh looks and sees James and Meowth gone, he realizes that he has Jessie’s body and start groping her chest but feels a bulge in the lower region. He pulls up his skirt and sees that Jessie’s body grew a bulge instead of having a vagina.</span></div></div>",
            "created":1579496400,
            "id":2776129,
            "title":"Jessie"
        },
        "1313":{
            "author_id":"bl00dedge1",
            "author_name":"Hallmark ",
            "choices":[
                "Everyone thinks Ash looks like Jessie"
            ],
            "content":"<div class=\"\"><div> <span>Ash decided to save the Pokémon that Jessie had in her possession. Taking out her Rocket ID he saw that she had Seviper, Wobbufet, Yanmega, Woobat, Frillish, and Pumpkaboo. “Wow, she has some interesting Pokémon to bad they are pretty weak while being in Team Rocket but now I can help them become stronger.” Ash said as he started calling in all of Jessie’s Pokémon and started to transfer them to his own account.<br>\r\n<br>\r\n“Now that they’re in my account and on my person, it looks like ‘Jessie’ can now leave Team Rocket and actually be a great trainer. I do wonder how my mom and Pokémon will react to me being in Jessie’s body.” Ash said as he started to see James and Meowth come to his location.</span></div></div>",
            "created":1579496400,
            "id":2776131,
            "title":"Transfer Jessie’s Pokémon to Ash"
        },
        "13131":{
            "author_id":"bl00dedge1",
            "author_name":"Hallmark ",
            "choices":[
                "Try out his new body on his mom",
                "Leave Jessie’s body and put her away",
                "Call a female to join the fun"
            ],
            "content":"<div class=\"\"><div> <span>James and Meowth were coming back to their picnic spot and suddenly they spot ‘Jessie’ standing at their spot before shouting “Twerp, how are you here.”<br>\r\n<u> Wait, does that mean they only see me as Ash? Well at least Mom won’t be surprised to see her son in a woman’s body with my manhood still intact. Now to take care to these two idiots and send them packing with some of my new Pokémon.</u> Ash thought before grabbing a Pokeball and sending out Yanmega. The dragonfly Pokémon thought of Ash as her trainer and was ready to battle. “Alright Yanmega send these fools packing with Ancient Power and Sonic Boom.” Ash ordered Yanmega. Yanmega fires a silver orb and then a powerful sonic wave that mixes with the orb and it becomes a silver sonic boom. It explodes on contact with James and Meowth and sends them both flying; “Good work today Yanmega. Let’s go home and see my mother.” Ash told the insect before returning her to her ball.<br>\r\n<br>\r\nAsh finally makes it to Pallet town before nightfall and rushes to his home where he relaxes and knocks on the door to see his mother open the door. “Ash welcome home. I missed you so much.” Delia says while squeezing Ash’s head in her impressive bust, who couldn’t help but cop a feel, to see how soft they are before he finally got his head loose. “Hey mom notice anything different about me?” Ash questions his mom to see her reaction. <br>\r\n<br>\r\n“Ash I know that your a girl with a manhood but honestly learn to cover it up, you’ll scare the girls that way. Now come inside you look like you could use a bath and some food.” Delia says as she walks back to the kitchen.<br>\r\n<br>\r\n“Wow, even my mom only sees me as her son. Sweet, now I can have some real fun with these puppies and a couple of pretty girls as well.” Ash says to himself as he ponders about having hot women with him in bed having wild sex and having a harem family.</span></div></div>",
            "created":1579496400,
            "id":2776132,
            "title":"Everyone thinks Ash looks like Jessie"
        },
        "131312":{
            "author_id":"bl00dedge1",
            "author_name":"Hallmark ",
            "choices":[
                "Go as himself",
                "Possess someone else",
                "Possess his mom (RC) on who"
            ],
            "content":"<div class=\"\"><div> <span>“Hey Mom, I’m going upstairs to change is that alright?” Ash asked his mom. <br>\r\n<br>\r\n“Sure thing sweetie, I’ll let know when dinner is ready.” Delia said to Ash.<br>\r\n<br>\r\n“Thanks mom.” Ash told her before going into his room and saw that it was the same as before. Ash laid on his bed and tried to leave Jessie’s body and succeeded in his attempt. He looked over at Jessie’s body and saw that she still had the blank look in her eyes. <br>\r\n<br>\r\n“Wow, her mind is really broken. Oh well into the closet you go can’t have my mom seeing you before the main event comes. Now do I go as myself or possess someone else?” Ash pondered before coming to a decision.</span></div></div>",
            "created":1579496400,
            "id":2776133,
            "title":"Leave Jessie’s body and put her away"
        },
        "1313121":{
            "author_id":"bl00dedge1",
            "author_name":"Hallmark ",
            "choices":[
                "Go in as himself",
                "Possess his mom when emerged",
                "A girl arrives at the door (RC on who)"
            ],
            "content":"<div class=\"\"><div> <span>Ash turned back into his human form and went down to the kitchen where he had a good look at Delia’s butt. Suddenly, Ash started to get horny and wondered if he should posses his mom or try to hold it together. <br>\r\n<br>\r\nAfter struggling and some cold water he was fine and made his way to the table so he could eat but noticed his mom was sitting in a table only in an frilly apron. Ash almost died of a blood loss right there until he saved himself before asking his mom why she was wearing only an apron.<br>\r\n<br>\r\n“I’m sorry Ash, but it’s so hot outside and I was sweating like crazy in my clothes so I took them off and hid my modesty with my apron.” Delia explained to Ash as she started to unknowingly scratch her butt because it was itchy. Ash enjoyed his dinner telling his Mom all about your adventures until she asked “ So what are you going to do now Ash?” <br>\r\n<br>\r\n“I’m thinking of taking a little break for maybe a month or two so I can rest and maybe get a girlfriend or two. Either way I want to spend time with you mom.” Ash said to Delia, who looked so happy and decided to hug him but all Ash could feel are the flesh orbs on her chest called boobs.<br>\r\n<br>\r\n“Well I’m going to go take a shower do you mind waiting for me?” Delia asked Ash.<br>\r\n<br>\r\n“Don’t worry mom go take your shower.” Ash said to her as she started to turn on the water and started to bathe in the warm water. Ash wanted to see what she looked like in the nude.</span></div></div>",
            "created":1579496400,
            "id":2776134,
            "title":"Go as himself"
        },
        "14":{
            "author_id":"bl00dedge1",
            "author_name":"Hallmark ",
            "choices":[
                "A clone took over Misty",
                "Misty is now a servant to Ash",
                "Someone comes out ",
                "The process is incomplete"
            ],
            "content":"<div class=\"\"><div> <span>Ash turns back into his slime form until he hears a trainer come out of the bushes and looks right at him. <br>\r\nThe girl is in a two piece swim suit and has a moderate chest which you realize is actually your friend Misty. <br>\r\n<br>\r\n“Woah, I’ve never seen you before I what kind of Pokémon you are? Ah, who cares I’ll just catch you. Go, Staryu.” The starfish comes out an shoots stars at Ash but they bounce off of his body surprising both Misty and himself. “Staryu try Water Gun!” A jet of water was followed and Ash just drank the water like he was thirsty and he noticed how he was able to absorb the attack. Looking within himself he noticed he has the ability absorb which allows him to copy any move that hits him and he can regenerate quickly from the pain. <br>\r\n<br>\r\nSeeing an opportunity before him, he tried to release a thunderbolt and it worked. Staryu was hit head on and fainted after the attack. Misty was shocked and called back Staryu and just before she tosses out another Pokémon Ash flings a piece of his slime form at Mistys mouth and swallowed.<br>\r\n<br>\r\nMisty clutched her stomach and started to feel funny until she had a blank look on her face and collapsed on her knees with her mouth open drooling.<br>\r\n<br>\r\nAsh crawls over and waves his hand in Mistys face but realizes she’s not awake.</span></div></div>",
            "created":1579496400,
            "id":2776153,
            "title":"A trainer thinks your a Pokémon "
        },
        "144":{
            "author_id":"bl00dedge1",
            "author_name":"Hallmark ",
            "choices":[
                "Waterflower Dinner and Movie",
                "The sisters were swimming",
                "They were doing a gym battle",
                "Taking care of the Pokémon at the gym"
            ],
            "content":"<div class=\"\"><div> <span>“So the possession is only complete all of me is in her. Okay time to be Misty.” He jumps into her mouth and as he enter, her mouth closes and eventually her eyes came back but she had a a large chest now and a tuft of black hair in her orange hair now.<br>\r\n<br>\r\nFeeling like she’s alright she goes back home and is approached by her sisters who need her for something.<br>\r\nLittle did she know, Ash was waiting to take over and have a good time with them.</span></div></div>",
            "created":1579496400,
            "id":2776155,
            "title":"The process is incomplete"
        }
    },
    "info":{
        "author_id":"bl00dedge1",
        "author_name":"Hallmark ",
        "brief_description":"Ash finds a ritual and makes a wish. But now he must survive being a slime",
        "created":1579120380,
        "description":"<td align=\"left\" class=\"norm\">No Death<br>\r\nNo yaoi but Yuri alright.<br>\r\nDon’t make every chapter all about sex put some adventure like Ash being a Pokémon for a while or pretending to be someone else</td>",
        "id":2210383,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1579523640,
        "pretty_title":"Ash the Slime"
    }
}