{
    "chapters":{
        "1":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "6 inches tall.",
                "3 inches tall.",
                "2 inches tall.",
                "1 inch tall.",
                "1/2 an inch tall."
            ],
            "content":"<div class=\"\"><div> <span>It was a nice day, not to hot, not to cold. Your youngest sisters were out back in the pool last you checked, Jenny was laying down on the couch in a bikini, and Jessica was asleep in her room. However the day seemed like it wasn't going to be a nice day for much longer as you walked towards the pool, totally not to spy on your younger sisters potentially screwing each other, as all of a sudden you felt light headed. \"What... what is... going...on?\" you state as you collapse on the floor near the door to the backyard.<br>\r\n<br>\r\nYou woke with a pounding in your head, and noticed by the slight shift in light outside you guess it had been around a half hour. however when you went to get up, everything remained at floor level, in fact it seemed everything was off sized, scaled up big time. you approached a small chunk of metal that was a nail head in the wall from Melody trying to tack on a poster before Jenny simply removed the poster ten minutes later. As you approached the nail you noticed something your had been shrunken, and more precisely you were</span></div></div>",
            "created":1594357200,
            "id":2865638,
            "title":"The Story Begins"
        },
        "11":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Decided to go to the living room to look for help.",
                "Decided to go visit Melody and Ashley for help.",
                "Decided to go visit Jessica for help.",
                "Decided to go visit Jenny for help.",
                "Had one of your sisters walk into the hallway from outside."
            ],
            "content":"<div class=\"\"><div> <span>You were six inches tall. You realized you might need help getting back to normal.<br>\r\n<br>\r\nAs your mind worked on the fact you were shrunk as far as you had been you realized you might need to suck up whatever pride a tiny man can have and go visit your sisters to see if any of them can help you.<br>\r\n<br>\r\nYou looked around and saw the TV was still on so it stood to reason the living could have someone in it still.<br>\r\n<br>\r\nYou looked at the hallway branching from the one you took to go out to the backyard, and knew your little sisters would help you for a price both agreed upon.<br>\r\n<br>\r\nYou looked at the stairs going to the second floor to where your, Jessica and your parents bedrooms were. Jessica would likely find your situation amusing enough to help transport you around the house, likely in a way you might regret.<br>\r\n<br>\r\nYou looked at the room affixed to the hallway between the storage closet and the living room entryway and knew Jenny would do something about your situation, but that was a last resort.<br>\r\n<br>\r\nAs you sat there you</span></div></div>",
            "created":1594440060,
            "id":2865714,
            "title":"6 inches tall."
        },
        "115":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "One of your Youngest Sisters holding one of their toys...",
                "Jenny in only a towel, coming in from sun tanning...",
                "Jessica walked towards you in a wet bikini..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were about to head towards the living room when the ground began to shake and as you turned you saw</span></div></span></div>",
            "created":1594584420,
            "id":2867162,
            "title":"Had one of your sisters walk into the hallway f..."
        },
        "1151":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Jump up and get inside the head of the toy as it passed you.",
                "Run after your sister and try to get her attention..."
            ],
            "content":"<div class=\"\"><div> <span>One of your youngest sisters, holding a toy that looked like a three foot gummy worm with a bulbous head, the toy resting at two inches thick along the main 'body' but the head bulged out to be around three and half inches thick at the thickest. The toy was hanging over one shoulder, the head just a scant inch from the ground, as she stepped over you.<br>\r\n<br>\r\nYou saw a chance to get noticed, but was it worth the risk of being turned into an unknown voyeur of your little sisters masturbating?</span></div></div>",
            "created":1594585200,
            "id":2867182,
            "title":"One of your Youngest Sisters holding one of the..."
        },
        "12":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Decided to go to the living room to look for help.",
                "Decided to go visit Melody and Ashley for help.",
                "Decided to go visit Jessica for help.",
                "Decided to go visit Jenny for help.",
                "Had one of your sisters walk into the hallway from outside."
            ],
            "content":"<div class=\"\"><div> <span>You were 3 inches tall. You realized you might need help getting back to normal.<br>\r\n<br>\r\nAs your mind worked on the fact you were shrunk as far as you had been you realized you might need to suck up whatever pride a tiny man can have and go visit your sisters to see if any of them can help you.<br>\r\n<br>\r\nYou looked around and saw the TV was still on so it stood to reason the living could have someone in it still.<br>\r\n<br>\r\nYou looked at the hallway branching from the one you took to go out to the backyard, and knew your little sisters would help you for a price both agreed upon.<br>\r\n<br>\r\nYou looked at the stairs going to the second floor to where your, Jessica and your parents bedrooms were. Jessica would likely find your situation amusing enough to help transport you around the house, likely in a way you might regret.<br>\r\n<br>\r\nYou looked at the room affixed to the hallway between the storage closet and the living room entryway and knew Jenny would do something about your situation, but that was a last resort.<br>\r\n<br>\r\nAs you sat there you</span></div></div>",
            "created":1594440060,
            "id":2865713,
            "title":"3 inches tall."
        },
        "13":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Decided to go to the living room to look for help.",
                "Decided to go visit Melody and Ashley for help.",
                "Decided to go visit Jessica for help.",
                "Decided to go visit Jenny for help.",
                "Had one of your sisters walk into the hallway from outside."
            ],
            "content":"<div class=\"\"><div> <span>You were 2 inches tall. You realized you might need help getting back to normal.<br>\r\n<br>\r\nAs your mind worked on the fact you were shrunk as far as you had been you realized you might need to suck up whatever pride a tiny man can have and go visit your sisters to see if any of them can help you.<br>\r\n<br>\r\nYou looked around and saw the TV was still on so it stood to reason the living could have someone in it still.<br>\r\n<br>\r\nYou looked at the hallway branching from the one you took to go out to the backyard, and knew your little sisters would help you for a price both agreed upon.<br>\r\n<br>\r\nYou looked at the stairs going to the second floor to where your, Jessica and your parents bedrooms were. Jessica would likely find your situation amusing enough to help transport you around the house, likely in a way you might regret.<br>\r\n<br>\r\nYou looked at the room affixed to the hallway between the storage closet and the living room entryway and knew Jenny would do something about your situation, but that was a last resort.<br>\r\n<br>\r\nAs you sat there you</span></div></div>",
            "created":1594440060,
            "id":2865712,
            "title":"2 inches tall."
        },
        "134":{
            "author_id":"annsin",
            "author_name":"Annsinn",
            "choices":[
                "You move towards her vagina.",
                "You move towards her butthole.",
                "She's awake."
            ],
            "content":"<div class=\"\"><div> <span>...Suddenly changed your mind. No harm would be done if you, well, experimented a bit right? You could talk to your sisters later... You begun moving towards Jenny. Two reasons for that, one, you already had antagonistic relations with her, so you wouldn't feel bad taking advantage of her, and two, she, uhm, was taking a nap around this time.  <br>\r\nYou stealthily walked into her room. The sound of her steady breathing filling your ears. You hesiteted, it was your sister after all. <br>\r\n\"It's for science.\" You murmured. <br>\r\nYou started climbing on her blanket. Suddenly, the blanket began falling, with horror you increased you pace barely manging to fall on the bad. <br>\r\nBreathing with relief you looked up, shock and awe spreading on your face.<br>\r\nWhat you saw was Jenny's gigantic, naked body, you gulped heavily, you dong getting hard just from this sight. She lied on her stomach, her face peaceful.<br>\r\nYou smiled wickedly, observing her. You lust conrinued to rise till you couldn't help yourself, climbing up her body. You looked at her two majestic peaks. Normally, they were medium sized, but now, they seemed like mountains. Their biggest plus, was how rounded they were. In fact, the third reason you went to Jenny was her looks. All your sisters were good looking, having similar genes passed from your parents, but she especially. Her personality on the other hand...<br>\r\nYou finally scaled to the top, her soft flesh caving under your feet. You lied down, enjoying her warmth. <br>\r\nHaha, Jenny, if only you know you were gonna end up being violated by your big brother, your flesh between my legs! You started moving your hips, pounding her butt.<br>\r\nA fart escaped her ass, you could distinctly smell digested fish. The odor horrible, yet it only made you harder. Despite the riging bells in your hand telling you that your actions were rushed, you increased your speed. <br>\r\nUnsatysfied, you stood up, wishing for something more. <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1594837200,
            "id":2869129,
            "title":"Decided to go visit Jenny for help."
        },
        "1343":{
            "author_id":"annsin",
            "author_name":"Annsinn",
            "choices":[
                "...My tummy?",
                "...My rectum?",
                "...My vagina?"
            ],
            "content":"<div class=\"\"><div> <span>Yous stand up. You gaze moving up her body, suddenly, horror gripped your heart. You saw her looking at you, a wicked smile, similar to yours spreading on her face.<br>\r\n\"Hey, J a k e.\" <br>\r\nYou shuddered. \"J-J-Jenny, I-I didn't think you would be awake, H H A H A, i won't bother you anymore!\" You run to her legs, trying to get away from her. You still remember what she once told you...<br>\r\nBut before you could escape, she gripped you.<br>\r\n\"Not so fast b i g bro.\" She brought you to her face, your struggles rendered useless. <br>\r\n\"You can fuck me as much as much as you want.\" The words making you hard again. You felt her breath assulting you.<br>\r\n\"In my stomach!\" She grinned. <br>\r\n\"W-wait, y-you can't just, like that, n-noo...\" She opened her lips, thrusting you inside, her saliva covering you, her gigantic tongue wrapping you. <br>\r\n\"Jenny wait, you didn't even try my in your other holes, please listin!!\" You cried desperately.<br>\r\nSurprisingly she spit you out, taking you to her rear. You felt relief wash over you. She brought you over her pussy, spreading her legs wide, till you saw her blackishly-pinkish hole, you gripped your nose in disgust, it recked with fish! There's no way she can put you there right? You were 2 inches high after all. You gulped with fear, asher asshole began flexing. Her breathing got more rugged, and she starte fingering herself. <br>\r\n\"Who would've thought you'd became this small.\" Jenny laughed.<br>\r\nLicking her lips she moaned with pleasure. With hatred and arousment she said. \"My dddddddear brother. How does it feel, knowing, you're gonna end up in...\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1594839060,
            "id":2869146,
            "title":"She's awake."
        },
        "13431":{
            "author_id":"annsin",
            "author_name":"Annsinn",
            "choices":[
                "Acid started melting you (possibly end?)",
                "You were nearly immune to her acid."
            ],
            "content":"<div class=\"\"><div> <span>\"...My tummy?\" She moved you to her face, her stomach growled.<br>\r\n\"W-what but you just...\"<br>\r\n\"Jack, oh Jack.\" Jenny brought you to her asshole again, it flexed, before farting, you coughed in disgust, it was that odor of fish again! <br>\r\n\"Stinks, ugh, aren't you ashamed?\" <br>\r\nIn response, she brought you closer, a series of farts blowing on you, making you nauseous.<br>\r\nSnorting, she continued. \"You're gonna go through my ass anyway, so why bother?\"<br>\r\n\"How does it feel, being your hhhatfulll sister's meal?\" Her stomach growled, she parted her lips, putting you inside.<br>\r\nShe fingered herself, more and more moans escaping her lips, you were a bit big, so she had to prepare herself.<br>\r\n\"Jack, Jack, ummm!! I want you in my belly so much!\" Unable to help herself, she swallowed you whole.<br>\r\n\"NOOO!!!\" You cried, as her throat muscles pushed you deeper inside. You begun struggling, but the walls were too slippery.<br>\r\nJenny coughed heavily, stopping herself from vomiting you. <br>\r\n\"I, will, have, you, inside, regardless of what, HAHAHAH!\" She laughed maniacally, a laugh that only a killer could have. Her masturbation quickened, her whole body moving as if possesed!<br>\r\nYou went down her espharagus, and soon you saw your destination.<br>\r\nWas this your end? You 19 years of life, ending just like that? Digested by your hatful sister?!<br>\r\n\"DAMN YOU! IF I SURVIVE IT! YOU'RE GONNA REGRET IT!\" You shouted in hatred and fear. <br>\r\nShe couldn't hear you, her moans of pleasure filling the whole house, alarming other inhabitants! She was about to get away with murder, the notion turning her even more on, she climaxed, yet even that didn't stop her, she changed to fingering her dirty asshole...And it was killing of her hateful brother! And digesting him on top!<br>\r\nYou fall into her stomach, her erratic movements sending you from one wall to another. You heard a plethora of organic sounds. Her heartbeat, her growling stomach, her moving intestines, and more. It was so hot in here! You started sweating. <br>\r\nHer stomach was relatively empty, with only a few pieces of fish laying around, giving off horrible odor, nearly as bad as her farts. You punded her walls, hoping she would throw up, but to no veil.<br>\r\nYou saw her walls producing acid, about to digest you...<br>\r\n\"JENNY!!!\" You cried with intense hatred. If only you could survive till her stomach pushed you downwards, you recked your brain trying to think of a way. Strengly you could see well, you also didn't need any or little air, the only good news so far.<br>\r\nThan...<br>\r\n<br>\r\n</span></div></div>",
            "created":1594841100,
            "id":2869158,
            "title":"...My tummy?"
        },
        "14":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Decided to go to the living room to look for help.",
                "Decided to go visit Melody and Ashley for help.",
                "Decided to go visit Jessica for help.",
                "Decided to go visit Jenny for help.",
                "Had one of your sisters walk into the hallway from outside."
            ],
            "content":"<div class=\"\"><div> <span>You were 1 inch tall. You realized you might need help getting back to normal.<br>\r\n<br>\r\nAs your mind worked on the fact you were shrunk as far as you had been you realized you might need to suck up whatever pride a tiny man can have and go visit your sisters to see if any of them can help you.<br>\r\n<br>\r\nYou looked around and saw the TV was still on so it stood to reason the living could have someone in it still.<br>\r\n<br>\r\nYou looked at the hallway branching from the one you took to go out to the backyard, and knew your little sisters would help you for a price both agreed upon.<br>\r\n<br>\r\nYou looked at the stairs going to the second floor to where your, Jessica and your parents bedrooms were. Jessica would likely find your situation amusing enough to help transport you around the house, likely in a way you might regret.<br>\r\n<br>\r\nYou looked at the room affixed to the hallway between the storage closet and the living room entryway and knew Jenny would do something about your situation, but that was a last resort.<br>\r\n<br>\r\nAs you sat there you</span></div></div>",
            "created":1594440060,
            "id":2865711,
            "title":"1 inch tall."
        },
        "142":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Approach the masturbating Melody for her aid.",
                "Approach the sleeping Ashley for her aid.",
                "Melody noticed you and decided to play a prank on Ashley."
            ],
            "content":"<div class=\"\"><div> <span>You decided to go see what your adorable, helpful cute youngest sisters had planned as the price for helping you.<br>\r\n<br>\r\nYou walked down the hallway, and though it took a bit of time to reach their room it tool a lot less time then going anywhere else but the living room.<br>\r\n<br>\r\nAs you saw the pink with blue hearts door approach you hurried to a sprint hoping you didn't wind up a stain under foot as Melody loved to go barefoot around the house.<br>\r\n<br>\r\nIt took five minutes to get in and approach the bed where you heard at least one of them snoring cutely. The bed frame fortunately was pock-marked from Melody bouncing a golf ball of al things off the frame, and though it took three solid minutes to climb you caught you breath at the top and found two sights that let you know your aid might be tough to buy, for the moment at least, from both of them.<br>\r\n<br>\r\nOn the far left snuggled against a pillow bearing your picture, was Ashley, sleeping naked as she always did (not-so-un)fortunately. She was splayed out to where you could easily climb up her arm and yell in her ear to wake her up, you could also climb her other arm to be right where she could see you easily but be in easy inhaling distance, you could climb her legs with the blanket over her legs to try getting her attention another way.<br>\r\n<br>\r\nOn the right side near the edge of the bed closest to the door was Melody, rubbing one out while tossing gummy bears both in her mouth and swallowing them whole and stuffing gummy bears into her erect cock and rubbing them down. She had on a thong partly down the front and no bra on. That was all she had on, it looked like she picked up Ashley's sleeping naked habit as well.<br>\r\n<br>\r\nYou looked between them and slowly walked closer until you were equal distance between them, and then you made your decision.</span></div></div>",
            "created":1594441140,
            "id":2865727,
            "title":"Decided to go visit Melody and Ashley for help."
        },
        "1421":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Run forward and climb into the back of her thong and hope she notices you.",
                "Climb Melody's Wood to strike the tip.",
                "Climb into her hand when she grabs more gummy bears."
            ],
            "content":"<div class=\"\"><div> <span>You decided not to potentially risk your life in vain by going to Ashley when she is asleep, at normal size she once decided to chew on your hand and had it in her throat before she woke up and slowly spat you hand out of her mouth, doing so seemingly because  she had to reluctantly give you your hand back. The worst Melody had done was shove your hand up her skirt to fondle her cock.<br>\r\n<br>\r\nAs you approached noticed three place your could likely get her attention.<br>\r\n<br>\r\nThe first place, plain and simple was to climb in the back of her thong. You were after all facing it more then her front once you reached the halfway point towards her.<br>\r\n<br>\r\nThe second place to climb her cock and attack it to draw her attention and hope she didn't stuff you inside with the gummy bears.<br>\r\n<br>\r\nThe third was to climb onto her hand when she grabbed the next handful of gummy bears to... dispose... of.<br>\r\n<br>\r\nYou knew you had to make a choice swiftly.</span></div></div>",
            "created":1594443120,
            "id":2865736,
            "title":"Approach the masturbating Melody for her aid."
        },
        "1422":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Approach Ashley's right arm and yell in her ear.",
                "Approach Ashley's left arm and yell at her, hoping she doesn't eat you.",
                "Approach Ashley's blanket clad legs and ass."
            ],
            "content":"<div class=\"\"><div> <span>As you looked between the two, your choice was made as Melody gave a cry of ecstasy before a massive deluge of gummy bears half melted mixed in with enough cum that Melody filled a nearby jar to the brim, the mix of materials slightly bubbling.<br>\r\n<br>\r\nDeciding you did not a bath in Melody's cum before potentially becoming a late night snack for her, you hurried over to where Ashley lay.<br>\r\n<br>\r\nOnce you got closer you noted something, Ashley was humping the pillow with your picture and one of her hands was definitely between her legs, the other seemed to be fondling her breasts in her sleep.<br>\r\n<br>\r\nYou looked at her, your approach stopped at a spot where you were just slightly closer to the blankets then her arms. You now had a choice to make, what way would you use to get Ashley's attention?</span></div></div>",
            "created":1594443660,
            "id":2865739,
            "title":"Approach the sleeping Ashley for her aid."
        },
        "14223":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Go to the depths of her crack and punch her anus.",
                "Go down to her pussy and begin to rubher clit to wake her up."
            ],
            "content":"<div class=\"\"><div> <span>You decide to go for the easier option, distance wise, of her blanket covered legs and ass. Around forty-five second later you reach her blanket clad legs and begin to slow climbing trek to the top of Mt Ashley's-Ass.<br>\r\n<br>\r\nAround a minute of climbing you reach the top of her leg, gently sloping to the twin mountains Ashley had known as butt-cheeks.<br>\r\n<br>\r\nYou slowly began to look around for a way to get her attention.<br>\r\n<br>\r\nFrom your vantage point on her leg you could see only two ways to get her attention</span></div></div>",
            "created":1594450560,
            "id":2865819,
            "title":"Approach Ashley's blanket clad legs and ass."
        },
        "1423":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "You squirm and are noticed then saved before Ashley swallows.",
                "You squirm but are ignored, being left to the cummy bears fate as well.",
                "You squirm and are noticed then intentionally swallowed by Ashley."
            ],
            "content":"<div class=\"\"><div> <span>As you decided to head towards Ashley, Melody noticed you and her lust addled mind saw not her loving older brother but a moving toy to contain.<br>\r\n<br>\r\nMelody's hand snaked out and before you could make it five steps her fingers encircled your body. Then with a quick tug you were brought over her head and you saw a gummy bear slide down her throat without her swallowing and right when you thought your end would be to Melody's gullet, salvation seeming came to your aide as Ashley groaned and rolled over her hand smacking Melody's so you missed her maw.<br>\r\n<br>\r\nYou were about to celebrate before you noticed you were on a crash course with Melody's urethra.<br>\r\n<br>\r\nGravity this time hurt you more then help as a fall into your sister's cock could have been, gravity this time drug you under and just out of sight of the tip looking in, but you could still see out.<br>\r\n<br>\r\nMeanwhile Melody had noticed at the last second that she had almost eaten her tiny beloved older brother alive. She wanted to thank Ashley for knocking you out of her hand, by placing you where you could get a front row seat of Ashley's butt showing off the amount of candies it could devour.<br>\r\n<br>\r\nMelody decided to prank Ashley by telling her it was treat time.<br>\r\n<br>\r\n\"Ashley.~ Wakey wakey.~ Time for breakfast.~\"<br>\r\n<br>\r\nMelody's words were like a dip into ice water as Ashley seemed to move a bit before her hand seemed to wrap around Melody's cock and start stroking, ironically sliding you closer to the tip but building up a suction pressure that kept you from escaping Melody's cock.<br>\r\n<br>\r\nAs Melody was stroked off by her sister she felt a tingling itch inside her cock, but she ignored it. Several minutes later Melody was moaning Ashley's name right before Melody climaxed.<br>\r\n<br>\r\nYou had a harrowing few minutes, but after an eternity seeming to have gone by, Melody moaned and the back pressure keeping you pinned was released in five bursts as she came into the mouth of her sister Ashley, four flooding deluges of cum sent down Ashley's throat and making a small bulge in her belly, while the last load sat in Ashley's mouth, you having managed to get lucky enough to not be sent straight down your younger sister's throat.<br>\r\n<br>\r\nMelody saw Ashley open her mouth to show off her, and Melody peered into her sister's mouth admiring what her cock did to five bags of gummy bears, alongside how quickly she had done it as well. Melody was about to turn away as Ashley's mouth began to close and a faint suction formed at the back of Ashley's throat. You began to squirm and the faint ripples drew Melody's attention.</span></div></div>",
            "created":1594445880,
            "id":2865749,
            "title":"Melody noticed you and decided to play a prank ..."
        },
        "14233":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "content":"<div class=\"\"><div> <span>Just as Melody was about to poke the center of the small ripples, Ashley's tongue rose up and the liquids were pushed to the back of her throat before a loud, deafening to you, wet GULP! sounded off. Melody had a single second to see the face of her brother wet with cum squished against a partly melted and mixed with cum gummy bear before Ashley's throat jerked you down into its nearly crushing embrace. A second followed by a third GULP! resounded until you splashed down in the slightly bulging belly of your youngest sister.<br>\r\n<br>\r\nMelody was about to say something when a loud groan resounded from Ashley's stomach.<br>\r\n<br>\r\nYou had only been in the stomach for a short time before acids began to pour out of the walls in a crazed manner. It was several seconds later you watched as the half melted, or more, gummy bears melted away, before you realized the one you had been using as an island was melted as well and began to thrash around. Several painful horrifying moments later your battered and melting body shut down, sparing you the pain as digestion kicked it up a notch.<br>\r\n<br>\r\nAshley giggled and patted her stomach before shaking it, not a single thing solid remaining inside, before she let out a loud \"BBBBBBBBBBBBUUUUUUUUUUUURRRRRRRRPPPPPPPPPPPP!!!!\" that shook her sloshing round belly. Minutes later the contents of her belly drained into her intestines before Ashley fell back asleep. Within an hour Melody watched as her twin sister's ass swelled an inch before she let out a puff of gas. Melody giving her sister's asscheeks a squeeze, before kissing them and saying \"Farewell big bro... at least you live on somewhat as a cute butt!\"<br>\r\n<br>\r\nMelody then lifted her re-erect cock and plunged into her sleeping sister's ass, half an hour later finishing inside her before giggling and planting a kiss on Ashley's asshole, lightly sucking some of her cum from her sisters ass.<br>\r\n<br>\r\nWhile your end might not have been a good one, you padded your youngest sister's ass making her days a bit better until middle school when she sat on a fellow cheerleader during a pyramid and from there her ass devoured roughly half the team, and the next day she had asscheeks that literally suffocated Melody the next morning who was stuffed up there as well. At lunch that day Ashley had grown a cock matching her twins one the size by then reaching just shy of 18 inches long and four inches thick. By the time anyone figured it was Ashley and how she was behind the disappearances she had asscheeks measuring roughly 55 inches in size. Ashley's breasts only went up to c-cup. Ashley when locked away in an asylum, excuse me mental health help facility, cell had taken to calling her cock 'Melody' and her ass 'Jake'. she would stay in that cell until she turned twenty and got free before devouring the staff and other patients over the course of a day. Her cock 'Melody' devoured the 20 staff members and had balls so large they measured 22 inches by the time her balls melted the staff inside them, and her ass doubled in size from the 39 other patients.<br>\r\n<br>\r\nAshley would later die when she came, the force literally stopping her heart as she came her pleasured face noticeable to all in her room.</span></div></div>",
            "created":1594583820,
            "id":2867140,
            "title":"Just the start of Ashley's hunger for people..."
        },
        "15":{
            "author_id":"unzahabis",
            "author_name":"Tesra Tensrad",
            "choices":[
                "Decided to go to the living room to look for help.",
                "Decided to go visit Melody and Ashley for help.",
                "Decided to go visit Jessica for help.",
                "Decided to go visit Jenny for help.",
                "Had one of your sisters walk into the hallway from outside."
            ],
            "content":"<div class=\"\"><div> <span>You were 1/2 an inch tall. You realized you might need help getting back to normal.<br>\r\n<br>\r\nAs your mind worked on the fact you were shrunk as far as you had been you realized you might need to suck up whatever pride a tiny man can have and go visit your sisters to see if any of them can help you.<br>\r\n<br>\r\nYou looked around and saw the TV was still on so it stood to reason the living could have someone in it still.<br>\r\n<br>\r\nYou looked at the hallway branching from the one you took to go out to the backyard, and knew your little sisters would help you for a price both agreed upon.<br>\r\n<br>\r\nYou looked at the stairs going to the second floor to where your, Jessica and your parents bedrooms were. Jessica would likely find your situation amusing enough to help transport you around the house, likely in a way you might regret.<br>\r\n<br>\r\nYou looked at the room affixed to the hallway between the storage closet and the living room entryway and knew Jenny would do something about your situation, but that was a last resort.<br>\r\n<br>\r\nAs you sat there you</span></div></div>",
            "created":1594357200,
            "id":2865710,
            "title":"1/2 an inch tall."
        }
    },
    "info":{
        "author_id":"unzahabis",
        "author_name":"Tesra Tensrad",
        "brief_description":"you shrunk at home, hope you don't mind your sisters getting a new toy called you.",
        "created":1594428420,
        "description":"<td align=\"left\" class=\"norm\">Alright, so this is my take on the now common, Shrunk around your siblings at home.<br>\r\nnow then ground rules:<br>\r\n<br>\r\nNo other males besides passing mentions.<br>\r\n<br>\r\nAt least five lines of setting and dialogue, both not necessary, but preferred.<br>\r\n<br>\r\nNo sudden death unless you can justify it, such as \"You started walking towards Jenny's room and once there you began climbing her bed to look for her only for her to roll over and crush you under her ass. Jenny let out a small moan of satsifaction before a small burst of gas slipped out onto your corpse as she ground her hips and ass thoroughly removing any evidence of you being there turning you into nothing more then a faint stain on her asscheeks that she washed off the next morning.\"<br>\r\n<br>\r\nNo parents in the story besides phone calls, your father is an overseas businessman and your mother a nurse at the hospital nearby, both tend to only be home on sundays for around the three hours at church plus an hour lunch before heading back to work if they come home at all.<br>\r\n<br>\r\n<br>\r\n<br>\r\nAlright now onto the setting:<br>\r\nSo you are Jake, age 19 dark brown hair with a red tint when freshly cleaned, brown left eye with green scattered around the iris, green wth brown right eye. you may or may not have a giant giantess fetish, alongside other fetishes you might not even know you had. Jake is male.<br>\r\n<br>\r\nYour oldest sister, Jessica, at 23 she should be out looking for a job but the fact she had been laid off from working in a maid cafe last week gives her a little room to return back home. has large chest, roughly high DDD low E cups, has massive ass and in school when she was a student she earned the knickname \"Ass-ocolypse\" from when a fight broke on the cheer sqaud and one girl was thrown against and between her asscheeks and was promptly knocked out by your sister just shaking her ass. you had seen her threaten your youngest sister with a ten minute timeout head buried between her cheeks, and when she made good on the promise your sister's head and knec vanished between Jessica's asscheeks, from the measurements she muttered this morning her ass went down some but still measured roughly 40 cm a peice. You suspect your sister is into smothering at the least, and by the few times she had gummy bears stuck to her cheek, buttcrushing seemed very likely. you and her are neutral towards eachother due to a dare you had been given where you had to stick your head between her asscheeks and slap both as hard as you could, you don't remember if you did though... once when you mentioned the shrunk around the house movie you all watched a few years ago, she said she might just simply 'lose' you after setting you near her butt.<br>\r\n<br>\r\nYour younger sister Jenny, at age 17, Jenny is the middle sister and the only one you have an antagonistic relationship with due to you calling her flat-chest when she can rival Jessica with the rght clothes, but her ass is only moderately sized, roughly a handful not that you would know as she is your sister and you don't cop feels on your sister's ass when she is sleeping... right?? She once said if she found you shrunk, nobody would find your body, not as a body at least.<br>\r\n<br>\r\nYour youngest sisters, Melody and Ashley, twins who besides the hair were identical, both had cute bodies, both where 14 and rather open on their experimenting between themselves, and both had recently got into giantess by finding your stash of giantess porn, but both had tried to sell you on vore a few times the last week. Both had nice perky curvaceous bubble butts that you suspect where born from the chemical infused food the school feeds the students, both had small medium range B-cup breasts, and Melody had a surprise you had seen once when you accidentally walked in on her showering, a small cock. Melody had it full mast that time and it was a surprising 6 inches hard and roughly by estimation it should be around 2 and a half when soft. Ashley has propositioned you several times to \"show her the most mature way to deflower someone.\" personaly you think the joke gift of dictionaries she kept getting influenced her to talk as if she was already an adult. Melody mentioned f she found you less then an inch in size you were as good as a white washed snack for Ashley, while Ashley mentioned she would have a living doll, and maybe a toy for her butt.<br>\r\n<br>\r\n<br>\r\nNow then, try to keep it from being too graphic, and no absolute gore/torture such as Jake being eaten alive in bites, he would have to be swallowed whole.<br>\r\nLast rule, story is in second person: you/your for referring to the MC.</td>",
        "id":2226534,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594841100,
        "modified":1594841100,
        "pretty_title":"Shrunk at home with your sisters."
    }
}