{
    "chapters":{
        "1":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Laya",
                "Panzerschreck",
                "Sandra",
                "Ariya",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Name: Laya Eateric<br>\r\nSpecies: Snow Leopard (Panthera Uncia)<br>\r\nAge: 37<br>\r\nHeight: 6'4\"<br>\r\nWeight: 215lb<br>\r\nDescription: Russian. Rather chubby, G-cup breasts and a nice pot belly. Wears jeans and a dark red, long sleeved shirt.<br>\r\n<br>\r\nName: Laura \"Panzerschreck\" Bäcker<br>\r\nSpecies: Leopard (Panthera Pardus) Note, is a \"black panther\"<br>\r\nAge: 23<br>\r\nHeight: 5'9\"<br>\r\nWeight: 135lb<br>\r\nDescription: German, with thick Bavarian accent. Is very fit, E-cup breasts and has better abs than most guys, even without looking like a builder. Her butt is by far the biggest out of these characters. Restores and tests weaponry as a job. Wears jeans and dark green t-shirt.<br>\r\n<br>\r\nName: Sandra Eateric<br>\r\nSpecies: Snow leopard-dog hybrid<br>\r\nAge: 18<br>\r\nHeight: 5'5\"<br>\r\nWeight: 170lb<br>\r\nDescription: Laya's daughter. Quite cubby. D-cup breasts and a large gut. Wears whatever still fits.<br>\r\n<br>\r\nName: Ariya<br>\r\nSpecies: Spotted hyena (Crocuta crocuta)<br>\r\nAge: 16<br>\r\nHeight: 5'3\"<br>\r\nWeight: 95lb<br>\r\nDescription: Very skinny, struggles to find food; wears whatever she can find. B-cup breasts.</span></div></div>",
            "created":1320987600,
            "id":1221364,
            "title":"First, Select the Character"
        },
        "11":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Bigger appetite than normal",
                "Trying to catch up to her girlfriend's (Li's) size",
                "A pill in her food",
                "A fat female friend takes her out to eat.",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is Laya getting fatter?</span></div></span></div>",
            "created":1320987600,
            "id":1221369,
            "title":"Reasoning?"
        },
        "111":{
            "author_id":"enderman7654",
            "author_name":"enderman7654",
            "choices":[
                "eat till there is no more food left"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><span class=\"cpink\"><b></b></span></span></div></span></div>",
            "created":1594870740,
            "id":2869435,
            "title":"Bigger appetite than normal"
        },
        "112":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "A fattening 5-course meal",
                "a cart full of fattening pastries and sweets",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Within the confines of their own home, Laya Eateric was sitting on the large couch alongside her lesbian lover, the obese Wolf-Lioness hybrid, Leeuwin Van Dam, but she prefers to be called \"Li\" for short. <br>\r\n<br>\r\nBeing a mixed breed between a wolf and a lioness, Li had the shaggy fur and tail of a wolf, but she had head, body, and fur color of a lioness, along with a pair of baby blue eyes and light brown hair. However, she also had a body filled with 890 pounds of pure body fat. Her breasts were a size J-cup, Greenpeace was a profound apron belly, her buttcheeks were the size of yoga balls, requiring 2 to even 3 chairs to hold her obese rear. Li's legs and arms weren't spared from the obesity, as the wolf-lioness hybrid's legs were filled with fatty cellulite to both jiggle and rub against each other when Li walked. Her arms and hands were chubby  but still allowed for movement. Finally, Li's face was coated in a thin layer of fat, as she displayed a pair of chubby facial cheeks and a thick double chin coating her neck.<br>\r\n<br>\r\nAs for what the two lesbians wore today, Laya wore a red bra underneath a large T-shirt and a pair of red panties, while Li was wearing a custom XX-Large purple silk bra underneath a XXX-Large T-shirt and a pair of custom XX-Large purple silk panties, as the undergarment hugged Li's large booty. <br>\r\n<br>\r\nAfter Laya was done feeding her obese lover in one of their monthly \"Fatty Binges\", Laya got off of her stuffed lover's large belly, as she then caressed it, while Li looked down at her apron belly, put a fatty left hand-paw on it and said, \"Uuuugghh.....Sooo...Biiig..\" \"Awwww. It's alright, Li. Let me help you with your bellyache.\" Laya replied, flirting with her obese girlfriend, as Laya began to caress and rub Li's stuffed apron belly, allowing Li's body to digest all the good crammed inside her stomach much more fluently.<br>\r\n<br>\r\nThen, Li let out a loud burp as she said, \"~UUUUUUURRRP~ Thanks, honey. I really needed that belly rub.\" In response, Laya giggled a bit and replied, \"Anytime, sweetie.\" Then, she looked at Li and asked, \"Um, Li....Do you remember when you managed to fatten me up a bit from your mother's food?\" <br>\r\n<br>\r\nLi definitely remembered that day. Out of all of the food in the world, Li's mother's food was the most fattening, capable of making a scrawny furry into a fat furry. After all, this was how Laya managed to gain that chubby frame of hers. So in response of Laya's question, Li answered, \"Of course, how else would you manage to have those plump curves of yours. Why?\" <br>\r\n<br>\r\nFrom hearing Li's question, Laya blushed a great amount and hesitantly answered, \"You see, I uh...I, um.....\" \"Oh I get it now; you want to be a big fat furry like me, don't ya lass?\" Li's said, now realizing Laya's intentions, causing the chubby snow leopard to blush even more, making her ears droop, eyes closed and said, \"Yes.\" <br>\r\n<br>\r\nSeeing Laya upset, Li managed to get her obese self up from the couch, waddle in front of Laya, facing her. Then Li grabbed the chubby snow leopard, smooshing her against Li's fat frame and said, \"I'm sorry for making you upset about this. If you wanted to get as big as me in the first place, then why didn't you say so?\" Hearing those words made Laya feel better, as she looked up at her obese lover and said, \"Y-You really mean it, sweetie?\" \"Yep.\" Li replied, as the two furry lesbians kissed passionately, lasting for around a minute two.<br>\r\n<br>\r\nThen, shortly after breaking their kiss, Li looked down at Laya with a sincere smile and said, \"Now then, what do you say we start fattening you up, hmmm?\" Laya responded with a single nod, as Li set her lover back down on the couch, then waddled into the kitchen to cook some fattening food from her mother's cookbook. When Li was done cooking, she brought out....</span></div></div>",
            "created":1387774800,
            "id":1712408,
            "title":"Plumping Up For A Lover"
        },
        "1122":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "...Get ready for dessert!",
                "...A nice belly massage",
                "Or perhaps something else?"
            ],
            "content":"<div class=\"\"><div> <span>Laya sat on the couch, watching TV as Leeuwin cooked a big meal for her. She had her hand on her stomach, which growled at the thought of food, let alone the smell coming from the kitchen. \"Ooof, hurry up, Li! Before I try eating you!\"<br>\r\n<br>\r\n\"Ahaah, ye'd not win there, lass, I'd gulp you down first~\" teased Li, in spite of her gut's groaning of being much too full, followed by yet another loud belch. Laya rolled her eyes and looked back at the TV, rolling up her shirt and rubbing her gut. It wobbled and jiggled at the slightest poke, and was nearly the size of a small pregnancy, and hung over her belt. Her belly button was like a small cave, almost a full inch across, and seemingly endless due to the shadow over the inside of it. Laya considered undoing her belt to play with her gut further, but decided against it; she'd do so after eating.<br>\r\n<br>\r\nLi waddled back to the living room , pushing a cart full of cakes, pies, and other baked treats. Laya drooled and her belly growled at the sight. \"Oh my, Li...this is wonderful!\"<br>\r\n<br>\r\n\"Hehe, eat up then, what are ye waitin' for?\"<br>\r\n<br>\r\nWithout another moment's hesitation, Laya dug in, cramming her face full of anything and everything, just grabbing and shoving down whichever was closest. Li grinned, enjoying the site of the rotund ravenous Russian gorge herself, and helped her by pushing some of the food closer as she emptied the closest area.<br>\r\n<br>\r\nLaya's belt groaned and creaked as she continued to eat, having consumed a whole wedding cake's worth thus far. Pausing to catch her breath, Laya sighed and let out a low \"Oooorrrrrrpp~!\" Her gut gurgled, eliciting a slight moan from it's owner; her shirt had ridden up to show her gut, comically hour-glassing where her belt restrained it. \"Oooohhhh, I'm so full...\" she groaned. \"Feed me, Li,\" she grinned, leaning her head back and laying open her maw.<br>\r\n<br>\r\n\"With pleasure!\" grinned the obese hybrid, who began stuffing rolls down Laya's waiting gullet. With one final creak of tightening leather, Laya's belt finally gave with a loud <b>SNAP!</b> The buckle rocketed off and smashed through a window. Her gut lurched forth with a loud <i>Blorp,</i> setting with a wobble. Sitting down, Laya's gut nearly reached her knees.<br>\r\n<br>\r\nCart emptied, Laya groaned in pleasure, rubbing the sides of her stuffed belly with both hands. \"Ugh, I'm about to burst....oof...\" Li grinned, patting the overfilled stomach.<br>\r\n<br>\r\n\"Alright Laya, now it's time to...\"</span></div></div>",
            "created":1390021200,
            "id":1729421,
            "title":"Who says cakes are dessert?"
        },
        "11223":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Have a nice soak in the hot tub.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are the two lovers planning to do?</span></div></span></div>",
            "created":1429074000,
            "id":1964662,
            "title":"Or perhaps something else?"
        },
        "112231":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Whipped Cream",
                "Hot Fudge"
            ],
            "content":"<div class=\"\"><div> <span>\"I think a nice relaxing soak in the hot tub will feel nice after all those treats.\" Li said as she helped the extremely obese Layla up to her feet and guided her down the stairs, into the basement, where the tub was kept.  The two reached the basement and found the hot tub.  It was large enough to be the size of a small pond.  \"I should tell you, though.\" Li said \"I have made some adjustments to the tub.\".  Li smiled as she walked over to a small computer console and started pressing several buttons.  Several minutes later, Layla smiled when she found the tub, but she was surprised to find that the tub wasn't being filled with water.  Instead, it was being filled with, </span></div></div>",
            "created":1431838800,
            "id":1979089,
            "title":"Have a nice soak in the hot tub."
        },
        "1123":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Several bowls of ice cream",
                "A massive tub that was filled with whipped cream",
                "A cart piled with all kinds of food"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Li bring out?</span></div></span></div>",
            "created":1429506000,
            "id":1967188,
            "title":"something else"
        },
        "114":{
            "author_id":"awsomeoneamy",
            "author_name":"AmytheAwsomeOne",
            "choices":[
                "250 and 300 lbs",
                "400 and 500 lbs",
                "600 and 900 lbs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How fat are her friends? </span></div></span></div>",
            "created":1380344400,
            "id":1671355,
            "title":"A fat female friend takes her out to eat."
        },
        "12":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Decides staying fit is too much work",
                "Was recently pregnant but never lost her \"eating for X\" appetite.",
                "Forcefed",
                "Sleepeating",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is she gaining?</span></div></span></div>",
            "created":1320987600,
            "id":1221370,
            "title":"Reasoning?"
        },
        "122":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Ignore her hunger and go about her usual work.",
                "Eat a small salad at home. ",
                "Go to town and see what restaurants are open."
            ],
            "content":"<div class=\"\"><div> <span>Panzerschreck stood in front of the tall mirror in her bedroom, looking over herself. She was wearing only a bra and panties, and wasn't content with the way she looked. It had been a day since she was discharged from the hospital, having given birth to three cute leopard cubs.<br>\r\n<br>\r\nHer good sized breasts had gone up a size, straining her old bras slightly; indeed, the fluffy fat started to overflow, but not by much. Her stomach, once prominently displaying her abs, had put on a slight potbelly over them, forming a muffin top. But the biggest change was lower. Her rear, which was always large, but had mostly been from muscle. Now though, it had a large helping of fat over it, giving her a jiggly-butt you could set a dinner tray on. Her muscular thighs had also swollen a bit, so that they were touching and rubbed together when she walked.<br>\r\n<br>\r\nPan sighed, rubbing her chubby belly. \"I'd like to lose zis...\" she mumbled, poking her gut; her finger sank in about two inches. Sighing again, she decided to get dressed: green t-shirt, jeans, and boots. She had a slight trouble getting her jeans to button up, but when she finally did, her stomach formed a muffin top; her shirt rode up, stopping just above her cute navel. \"Scheiße...it'll have to do...\"<br>\r\n<br>\r\nJust then, her stomach let out a deep, low rumble. Pan blushed and rubbed her tummy, and decided to...</span></div></div>",
            "created":1340341200,
            "id":1365074,
            "title":"Baby Fat"
        },
        "125":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "A group of Furries from space abduct her and offer to serve her",
                "She inherits an ice cream factory",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these options?</span></div></span></div>",
            "created":1438232400,
            "id":2014457,
            "title":"Other"
        },
        "1253":{
            "author_id":"equestor",
            "author_name":"Equestor",
            "choices":[
                "Option 1",
                "Option 2",
                "Option 3"
            ],
            "content":"<div class=\"\"><div> <span>The big muscled black Puma looked at her reflection. Carefully examinating her body. E-cup breasts and better abs than most guys would look with envy, even without looking like a builder she had a big phisique.  She took her measring tape, wraped around her arm and flexed it. While flexing she was slowly counting<br>\r\n<b>-„Eins, zwei, drei... funf”. </b><br>\r\nShe unraped of her arm and did the same on her leg. She noticed that her leg was bigger <br>\r\n<b>- „Nein. Iz ztill too big.” </b><br>\r\n<br>\r\nEver since Laura started training as a way to spend her free time out of work and to burn off her giant butt. Yet while she was trying so desperatly. Instead of burning the fat out of that area it got more buldged with muscles. She tried everything from jogging to sauna and that even did not work. Co-worker of Pan suggested that maybe she should try something completly diffrent<i> instead of working on her butt and legs maybe she should work on other muscles, so that her rear wont be that big in comparison.</i> She was wroking for over a month. She developed some nice muslces on her, but the progres was slow. She was about to start to work more until going to the next room, she bumped into someone. <br>\r\n<b><br>\r\n- Oh Pan! T-terrible sorry. Did not see you there</b><br>\r\n<b>- Iz ok. –</b> she recognized that voice it was Charles, a horse anthro. Friend, who started to train with her. He has white fur a long mane. He also had a problem at the gym. He started he had problems to get her legs keep up with the rest of its body. Although he was not skipping leg day. He still looked like a triangle. He passed her hoof to hoist her up. Laura was expecting to meet his green eyes. Her eyes met with his massive pecks. She lifted her eyes and her jaw dropped. <br>\r\n<b>– Waz? Charles? </b><br>\r\n<b>- Well? What do you think? –</b> he asked, making a double flex bodybuilder pose<br>\r\nPan was stunned. She has not seen him for 2 weeks. He was already taller and more massive then her. The thing that she was more concered was about legs of his training partner. His legs were buff as well. He finally looked like a equally muscled biuld stalion. She could compare his legs to tree trunks. She was just speechless.<br>\r\n<b>- I see so it worked.</b><br>\r\n<b>- Waz worked?<br>\r\n- Actually was looking for you. I just bought a special suplement online. I read it give  equalizing results on muscle building and defing them. Was working for them for 2 weeks. I saw some results but was wondering how othert saw it. And as the look on youre face i guess it worked wonders. </b><br>\r\n<b>- D-du ? –</b> she snapped out of her shock <b>– you think it will work for me?</b><br>\r\n<b>- We wont know until we try huh?</b> – He dashed outside and quckly came with a 0,5l bottle of the green colored suplement <b>– Ok the dosing, you have to pour into a cup of water exactly 2 drops. Mix it and then work for 1 hour of training. More training then more drops. And be careful it very concentrated. And for training do the usual. Even if you keep working that big bum of yourse. Ok now excuse me i have to take my part of training i Wonder how big can i get.?</b><br>\r\n<br>\r\nHis loud thuds echoed throughout the gym. Laura was still looking at him with some admiration. Then looked at the suplement. Well if it did these Wonder to Charles she wonderd how will she look. Just like Charles said wont know untile he try. She took a nearby cup poured her mineral water and add 2 drops of the suplement, she quickly drank it and return to her training.<br>\r\n<br>\r\nShe ended her training afther half an hour, she felt exhausted only becose she had trained before and felt winded, <br>\r\n<i>„Maybe will cal zit a day and finish the next day for longer. –</i> she thought and put the words into action. She came back home made some quick dinner and collapsed into bed.<br>\r\n<br>\r\nThe next day she woke up with her stomach rumbling. She go tup and walked to the kitchen to get her breakfast. As she was walking through the rooms she felt funny, but not could tell what it was. She ingored it until she walked next to a full body mirror. She stopped and noticed…<br>\r\n<br>\r\nOption 1 - Her belly was sticking out almost covering her abs (gained 10 lbs.)<br>\r\nOption 2 - Her whole body got chubier (gained 25 lbs)<br>\r\nOption 3 - Bigger?<br>\r\n</span></div></div>",
            "created":1588982880,
            "id":2832584,
            "title":"Equalizing suplement"
        },
        "13":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Finds her Mom's (Laya's) hidden stash of fattening treats",
                "Laya keeps offering her more and more for dinner!",
                "Eating contest at the fair",
                "Raids an ice cream shop",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is she bulking up?</span></div></span></div>",
            "created":1320987600,
            "id":1221371,
            "title":"Reasoning?"
        },
        "133":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Pie.",
                "Hot dogs.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was a beautiful summer day and Sandra was enjoying the fair mainly for the food. Wondering the fairgrounds was stick of cotton candy in one hand she noticed a sign for a eating contest. <br>\r\n\"Eat the most________ and win a prize!\"</span></div></span></div>",
            "created":1404018000,
            "id":1819554,
            "title":"Eating contest at the fair"
        },
        "1333":{
            "author_id":"greececatz",
            "author_name":"Greece Catz",
            "choices":[
                "\"Bowls of Chili\" (Farting) ",
                "\"Steins of Soda\"! (Burping)   ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe some gas product ing ones? </span></div></span></div>",
            "created":1454389200,
            "id":2098398,
            "title":"Something else."
        },
        "135":{
            "choices":[
                "Force fed by an enemy?",
                "Other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some more options?</span></div></span></div>",
            "created":1492837200,
            "id":2308932,
            "title":"Other"
        },
        "1351":{
            "choices":[
                "Mean Girls",
                "Ex-Boyfriend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is Sandra's enemy going to be?</span></div></span></div>",
            "created":1492837200,
            "id":2308933,
            "title":"Force fed by an enemy?"
        },
        "13511":{
            "choices":[
                "After a few hours, school ends",
                "The teacher begins her lessons"
            ],
            "content":"<div class=\"\"><div> <span>The bell rang out, a signal for the anthropomorphic students that class had finally started and lunch would be over. Students were beginning to pour into the classroom, taking their seats at their desks. Finally sitting back at her desk, Sandra and her girlfriend Rita were once again greeted by the jeers of a certain group of girls. These girls were Mary, Tori, and Lexy, two wolves and a cat. Mary and Lexy both had amazing curves, unlike the large and soft bellies of Sandra and Rita. Tori was slightly chubby, the fat one of the group.<br>\r\n<br>\r\n\"Hey girls, the piggies are back!\" Mary declared with a cruel laugh as she pointed at Sandra and Rita's bellies.<br>\r\n<br>\r\n\"Yeah,  I bet they've been eating slop all day\" Tori chuckled as she added to Mary's taunts.<br>\r\n<br>\r\nSandra sighed as she rolled her eyes, \"What do you three want with us this time?\"<br>\r\n<br>\r\n\"You two are too easy to make fun of,\" Tori began to explain to the two chubby girls, \"I love putting big fatties in the place they belong.\"<br>\r\n<br>\r\n\"Whatever, let's just ignore her.\" Sandra told Rita, who nodded as class began again.<br>\r\n<br>\r\n</span></div></div>",
            "created":1492837200,
            "id":2308938,
            "title":"Mean Girls"
        },
        "135111":{
            "choices":[
                "Sandra wakes up ",
                "Sandra has a vision"
            ],
            "content":"<div class=\"\"><div> <span>Finally leaving school after her seven classes, Sandra put in her little headphones and began the long walk back home. She was listening to some songs by Prince, David Bowie, and a few other of her favorite musical artists. Walking through the downtown area, Sandra looked around, sensing that someone was nearby.<br>\r\n<br>\r\n\"Hello? Who's there?\" Sandra called out, trying to find out who was around herself.<br>\r\n<br>\r\nThere was no response from the nearby buildings, staying quiet. Sandra sighed, \"I think I'm just being overly paranoid.\" as she continued her way back home. Her mothers, Layla and Li, were both gone on business trips, so she would be alone for two weeks.<br>\r\n<br>\r\n\"Hello there, fatty girl.\" Tori's voiced echoed from a dark alleyway. <br>\r\n<br>\r\n\"What the hell do you want?\" Sandra growled as Tori, not noticing the footsteps of two other people.<br>\r\n<br>\r\n\"Get her, girls!\" Tori cried out as Lexi and Mary tackled Sandra to the ground. A piece of duct tape was placed over her mouth as Tori knocked the lights out of Sandra.</span></div></div>",
            "created":1492837200,
            "id":2308943,
            "title":"After a few hours, school ends"
        },
        "1351111":{
            "choices":[
                "Sandra tries to struggle",
                "Sandra gives in"
            ],
            "content":"<div class=\"\"><div> <span>Finally waking up, Sandra found herself somewhere deep and dark. This appeared to be a basement, which had a lack of bright colors. Trying to get up, Sandra noticed that she was chained up to a wall. The metal felt rough against her fur, making her feel quite uncomfortable. Her sausage-like fingers felt even thicker, like there was pressure in her body.<br>\r\n<br>\r\n\"My my, it seems the piggy has found herself trapped.\" Tori's voiced echoed from the shadows, approaching Sandra with a grin.<br>\r\n<br>\r\n\"What the hell did you do to me?!\" Sandra demanded as she struggled to break free.<br>\r\n<br>\r\n\"Those chains are too strong for a fatty like you to break.\" Tori chuckled as she poked Sandra's soft belly, feeling the fat surround her finger. Sandra squirmed as Tori began to laugh, wiggling her finger through the wiggling fat.<br>\r\n<br>\r\n\"Just let me go, please!\" Sandra begged Tori as the wolf-girl came to her face, looking her directly in the eyes.<br>\r\n<br>\r\n\"Sorry, but I want to make a huge pig out of you, then I'll show everyone that you're nothing but a fat little piggy.\" Tori replied, tickling Sandra's double-chins.<br>\r\n<br>\r\nNow feeling a mix of anger and despair, Sandra knew she only had two options.</span></div></div>",
            "created":1492837200,
            "id":2308947,
            "title":"Sandra wakes up "
        },
        "13511112":{
            "choices":[
                "Feed you breakfast",
                "Play with your belly"
            ],
            "content":"<div class=\"\"><div> <span>Sandra gave in, stopping her resistance against Tori's chains. Grinning like a Cheshire cat, Tori squeezed two of Sandra's rolls of fat, making her moan a bit as Tori jiggled them up and down.<br>\r\n<br>\r\n\"That's a good piggy, giving in to your master.\" Tori teased Sandra with pursed lips, like she was talking to her pet.<br>\r\n<br>\r\n\"W-what are you going to do to me now?\" Sandra stuttered as she asked Tori, who looked at the leopard-dog hybrid girl.<br>\r\n<br>\r\n\"First off, let's...</span></div></div>",
            "created":1492837200,
            "id":2308950,
            "title":"Sandra gives in"
        },
        "135111121":{
            "choices":[
                "Eggs!",
                "Pancakes!"
            ],
            "content":"<div class=\"\"><div> <span>As Tori finished her sentence, a group of chefs entered the basement. Each one was wheeling a cart, which seemed to be letting of quite a bit of steam. The smell of these carts were familiar, which made her drool.<br>\r\n<br>\r\n\"Are those eggs? And bacon? And sausages?\" Sandra asked, her drool reaching her breasts. Tori grinned as she ran her fingers down her breasts, feeling her saliva.<br>\r\n<br>\r\n\"Yes they are, and they're all yours to eat!\" Tori told Sandra as one of the chefs brought the cart to Sandra. Tori pulled out a fork as one of the chefs presented a plate of sausages. <br>\r\n<br>\r\n\"This looks amazing!\" Sandra declared as Tori forked a sausage.<br>\r\n<br>\r\n\"Does the little piggy want a sausage to feed her fat body?\" Tori asked Sandra in a taunting voice, waving the thick, juicy sausage in front of Sandra's face.<br>\r\n<br>\r\n\"Yes, yes I do!\" Sandra cried out as Tori smacked Sandra's belly, making the fat ripple. Tori put the sausage in Sandra's mouth, which she gobbled down with great vigor.<br>\r\n<br>\r\n\"Good girl! Now, dig in!\" Tori replied as she presented the platter of sausages to Sandra. Sandra purred as she dug her face in the sausages. Tori chuckled at this, sticking her finger into Sandra's navel and jiggling her belly. Various bits of sausage went flying around, covering her chubby face in meat.<br>\r\n<br>\r\n\"I'm done, can I have more?\" Sandra asked as Tori went to get another platter.<br>\r\n<br>\r\n\"Of course, do you want eggs or pancakes?\"</span></div></div>",
            "created":1492837200,
            "id":2308957,
            "title":"Feed you breakfast"
        },
        "1351111211":{
            "choices":[
                "Sandra is full",
                "Sandra wants more"
            ],
            "content":"<div class=\"\"><div> <span>\"Eggs! Eggs!\" Sandra replied, like a pig offered the choice of two fattening meals.<br>\r\n<br>\r\n\"Good girl! These will make you even fatter!\" Tori declared as she picked up the platter of scrambled eggs. Taking some with a large fork, Tori stuffed the large amount of scrambled eggs in Sandra's mouth, pushing the food down with her fingers.<br>\r\n<br>\r\n\"Yum! Are these your private cooks?\" Sandra asked with food in her chubby cheeks.<br>\r\n<br>\r\n\"Why yes, they're here to make sure you grow into the giant piggy I want you to be.\" Tori answered, giving Sandra's belly another smack.<br>\r\n<br>\r\n\"Hey, can I have more food? Please?\" Sandra begged Tori, who was running her fingers down Sandra's stomach, who wriggled at Tori's cold fingers.<br>\r\n<br>\r\n\"That's a good piggy, you want more food.\" Tori replied, giving her the rest of the eggs. Sandra, after just a couple of seconds, plowed through the eggs, leaving the plate clean.</span></div></div>",
            "created":1492837200,
            "id":2308960,
            "title":"Eggs!"
        },
        "13511112111":{
            "choices":[
                "Muffins",
                "Donuts"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright Tori, I'm full.\" Sandra replied with a sigh, her now slightly larger belly grumbling.<br>\r\n<br>\r\n\"Nope, you're a piggy, so I'm gonna fatten you up!\" Tori laughed as she was handed the plate of pancakes, stuffing two into Sandra's mouth. Struggling to spit the pancakes out, Sandra was met with Tori's fingers forcing the food down her mouth.<br>\r\n<br>\r\n\"Stop! I don't wanna!\" Sandra cried out, her voice become a bit more slurred. Trying to break her binds, Sandra began to struggle like a tied-up pig.<br>\r\n<br>\r\n\"Good girl, thank goodness these pancakes have special drugs in them,\" Tori began to explain, \"These drugs will numb your mind, making you lose everything, including your speech.\"<br>\r\n<br>\r\n\"What you do?\" Sandra asked, her voice sounding a bit more dumb. Her mind began to slow down a bit, all higher thoughts coming to a screeching halt. Sandra began drooling as she started to wave her fatty arms, causing her belly to wiggle.<br>\r\n<br>\r\n\"That's right, just get fat and dumb.\" Tori sighed happily, blowing a raspberry on her fat belly, which made Sandra laugh.<br>\r\n<br>\r\n\"That tickle!\" Sandra laughed as Tori picked up the last plate, being a plate of...<br>\r\n<br>\r\n</span></div></div>",
            "created":1492837200,
            "id":2308965,
            "title":"Sandra is full"
        },
        "1352":{
            "author_id":"fofinha",
            "author_name":"Guilherme Manente Cruz Berlitz",
            "choices":[
                "Your boyfriend wants to see her much bigger",
                "she discovers a new addictive chocolate cookie",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The options.</span></div></span></div>",
            "created":1531864740,
            "id":2521237,
            "title":"Other?"
        },
        "13523":{
            "author_id":"tolkienboy",
            "author_name":"Chaser",
            "choices":[
                "Yes",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or she just always wanted to get fat on her own?</span></div></span></div>",
            "created":1550197200,
            "id":2617857,
            "title":"others"
        },
        "14":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "A kind woman offers her a meal",
                "A restaurant throws out lots of perfectly good food",
                "Stumbles upon a huge fruit orchard",
                "Fially gets a job, at a fast food restaurant",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She's so scrawny and starved, how's she gonna pack on the pounds?</span></div></span></div>",
            "created":1320987600,
            "id":1221375,
            "title":"Reasoning?"
        },
        "141":{
            "author_id":"trashbingirl23",
            "author_name":"Trashbingirl",
            "choices":[
                "Get an air tank and Inflates Ariya",
                "Gets a food hose and Force feeds Ariya"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Since Ariya was so skinny ,a nice, plump woman offered her a meal She starts to...</span></div></span></div>",
            "created":1591116120,
            "id":2844752,
            "title":"A kind woman offers her a meal"
        },
        "142":{
            "author_id":"dogwolf93",
            "author_name":"Mr Doggy",
            "choices":[
                "She starts to flesh out",
                "She gets caught",
                "Something else (Your choice)"
            ],
            "content":"<div class=\"\"><div> <span>A dark clear night in the city.<br>\r\nAriya sat leaning against the alley wall. The poor starving hyena hadn't had a decent meal in...she can't remember how long. Her stomach stung with gnawing hunger as it roared up at her. She could only rub it in a futile attempt to calm it.<br>\r\nShe was so hungry she had become a little dazed and lost her way. Too weak to think about anything other than where to find food that didn't have insects or rot crawling all over it.<br>\r\nAs she curled up and lay on her side in the pitch black alley, she attempted to try and get some sleep, to ignore the pangs of starvation.<br>\r\nThat is, until, she heard a noise. Her ear flicked and she looked up as she saw a door swing open nearby. A large human, male she assumed, walked out with a large black bag and dumped it against the alley wall. Ariya was thankful for the darkness, the man couldn't see her so he couldn't shoo her off.<br>\r\nAs the human walked back inside, Ariya's mind was finally taken off her hunger and instead burned with a question.<br>\r\nWhat was in the bag?<br>\r\nStaying quiet as a mouse, she slunk on all fours to the bag, pawing and sniffing at it.<br>\r\nHer claws had managed to create a small tear in the bag and instinctively pointed her nose into it, snuffling.<br>\r\nShe gasped. Eyes widened. Stomach roaring. Her first smile in ages.<br>\r\nFOOD!!<br>\r\nShe took both sides of the rip and tore the bag open, watching as the enormous bounty of delectables poured out like a wave in front of her. She didn't know what any of it was but it smelt amazing!<br>\r\nHumans are such idiots, she thought. Why would they waste such good food?!<br>\r\nAnd with that, the starving hyena dug into her feast.</span></div></div>",
            "created":1345093200,
            "id":1406280,
            "title":"On the House, In the Alley"
        },
        "1421":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "That night, more food is thrown out.",
                "She gets caught!",
                "She tries to ask for a job there."
            ],
            "content":"<div class=\"\"><div> <span>Ariya moaned as she dug into what was, for her, an enormous meal. While she still was not sure just <i>what</i> any of the food was, but she didn't care. All she knew was that it was delicious, and that it wasn't rotten.Her stomach gurgled happily at finally getting a large meal, but Ariya wasn't really noticing, but trying to cram as much down her throat as she could, as fast as she could. And there was a <b>lot</b> of food in the bag, she was already feeling quite full, but Ariya didn't want to stop. Who knew when the next time she'd get lucky like this!<br>\r\n<br>\r\nAriya lied back, patting her bloated belly. Before, she'd been very scrawny, every one of her ribs on show. Now though, she looked like she was full-term pregnant! Her stomach was gurgling painfully, unaccustomed to dealing with such a big meal. \"Urf....oww....\" she groaned, letting out a small hiccup. \"Sooo...stuffed...\" Her belly growled at her, sending a mall twinge of pain across her abdomen. Ariya stood up with a groan, her overfilled gut sloshing sickeningly. \"She couldn't remember the last time she felt....well, full at all, let alone stuffed to bursting. Despite the strong ache, she seemed to enjoy it, as she found a spot out of the way of rain should the weather change, and lied down.<br>\r\n<br>\r\n------<br>\r\n<br>\r\nAriya yawned the next morning. Her back felt stiff as usual, as could be expected from the places she had to sleep. She sighed, stretching a bit. She felt her stomach growl, something it was almost always doing. But it felt...stronger. Ariya sighed, rubbing her stomach...and squeaked at what she felt. She looked down past her tiny breasts, at her stomach. \"Is...is this...fat...?\" She started to grin, looking back at the alley she had stayed at the night before. \"...Maybe I could stay here...\"</span></div></div>",
            "created":1350104400,
            "id":1445876,
            "title":"Not So Scrawny"
        },
        "14211":{
            "author_id":"leonwisawesome",
            "author_name":"joey",
            "choices":[
                "Aria dosnt stop eating",
                "Aria becomes very very fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Aria then became the biggest girl at the school</span></div></span></div>",
            "created":1441602000,
            "id":2030946,
            "title":"That night, more food is thrown out."
        },
        "142111":{
            "author_id":"sweetace2211",
            "author_name":"AceSweet2211",
            "choices":[
                "That night, more food is thrown out.",
                "She tries to ask for a job there."
            ],
            "content":"<div class=\"\"><div> <span>Ok, since some idiot put in a one sentence chapter that doesn't even go along with the current story, I'm going to put this here along with the original choices from the chapter before the one before this, where there wasn't an idiot behind the keyboard.<br>\r\n<br>\r\nAlso, because I do not have a basic membership or above, I cannot put all three choices, so I am going to put the two than I think people can do more with.</span></div></div>",
            "created":1474866000,
            "id":2215225,
            "title":"Back on track."
        },
        "142112":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "The next night, Ariya feels strange after she finishes the bag of food.....",
                "Ariya decides to do something risky: see if she could ask for a job there."
            ],
            "content":"<div class=\"\"><div> <span>(The fool that posted that last chapter, that was frigging shameful of you. Learn about context, ya nignog.)<br>\r\n<br>\r\nAriya decided to stick around the place where the man had dumped the food the night before, hoping to get lucky again. Her decision was the right one, as the same man threw out more perfectly good food in black trash bags the next night....and the next night....and the next night....and so on. And each night, Ariya would open the trash bags and gorge herself on the food contained with in until it was all within her belly, before making her way into the alleyway she had made into her current residence to sleep on a overfull stomach, letting it digest. While Ariya had lost track of time a while back, it had been two weeks since she had first decided to camp the alleyway for a consistent meal. Her constant gorging had internal effects as well as the obvious external ones: her stomach got used to being crammed full of food, so it stretched out and hurt less every time she ate her ‘dinner’. Her hunger pains also slowly faded away from her having a constant source of food.<br>\r\n<br>\r\nHer body was showing the signs of her gorging even more then a normal person’s would, due to her having gone without proper food for a long while, and her body desperately trying to build the fat back up she had lost. Her body thickened quite quickly, her thighs going from bony to thick to always touching, and her butt becoming much larger and far less firm. Her waist filled out, her ribs now buried in a layer of fat and a nice set of love handles framed her larger, round gut, which was as big as it had been after her first gorge. Her breasts were bigger then before, but still rather small. Her arms had gotten chunky, and her paws had swelled slightly. Her face had filled out a bit, and the beginnings of a second chin was visible. Ariya was grateful for this, as not only was it a layer of warmth the ratty clothes she currently wore sorely lacked, it was also a layer of protection she had for whenever she had to move on...if she could move on.<br>\r\n<br>\r\nWhile every concurrent day risked either the man not throwing food out the next day or her increasingly fat ass getting caught, Ariya found she couldn’t move on from the location she was currently in. The constant stream of food she was getting was a luxury she couldn’t afford to lose, and she couldn’t guarantee that wherever she ended up next would have the same opportunity. <br>\r\nSo, she decided to stay put, as her other options were no good. </span></div></div>",
            "created":1595758320,
            "id":2875421,
            "title":"Hefty Hyena"
        },
        "145":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "She finds an abandoned ice cream factory",
                "A wealthy, yet kind- hearted man, offers to let her stay at his penthouse",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these options?</span></div></span></div>",
            "created":1430715600,
            "id":1973367,
            "title":"Other"
        },
        "1452":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "Head to the estate",
                "Head to lunch",
                "Eat then and there."
            ],
            "content":"<div class=\"\"><div> <span>Ariya, maybe running from home was a bad mistake. Living off what she can find is hard, and that's only when she can actually find something. She is most of the time either looking for food or something to help cover the indent she calls her stomach. What was left of her clothes was enough of a faded shirt to cover her chest and a pair of sweat pants that were more like uneven shorts. It doesn't help that winter was coming in either. It means snow and food is being sent off to other charities Ariya isn't apart of. Her pride kept her from identifying as homeless and doesn't gain any of the benefits. She was out of luck.<br>\r\n<br>\r\nShe was walking down the street as the first flakes of snow fall with a whimper from the poor hyena. She stuck out like a sore thumb. This got the attention of a limo who pulled up. In the back seats showed a zebra with his mane sweeping to the side. He had a think African accent with a suit of grey and a tie blacker than his stripes. \"Hello, miss. Sorry if I offend you, but you don't look too good. I can help fix that though.\" <br>\r\n<br>\r\nAriya didn't know what to think off the bat, but hearing of him fixing it, while looking like he had the money to do so, made her light up. He did continue talking though. \"We can get you cleaned up and fed soon after you get in th-\" \"YES!\" She interrupted. The zebra shrugged and opened the door for her. <br>\r\n<br>\r\n\"I am Tian. And you?\"<br>\r\n<br>\r\n\"I am Ariya. Where are we going exactly?\"<br>\r\n<br>\r\n\"It will be a surprise. Don't worry,\" he smiled as they...</span></div></div>",
            "created":1510653540,
            "id":2415055,
            "title":"A wealthy, yet kind- hearted man, offers to let..."
        },
        "1453":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "She's abducted by a group off Furries from space who offer to serve her.",
                "She wanders into a massive cave that is filled with all kinds of food",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these options?</span></div></span></div>",
            "created":1431320400,
            "id":1977042,
            "title":"Readers Choice"
        },
        "14531":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "She hears something strange above her",
                "Something grabs her from behind"
            ],
            "content":"<div class=\"\"><div> <span>Ariya was walking through a large forest late one night.  All she was wearing an oversized-black leather jacket, and a pair of oversized cargo shorts.  The female spotted hyena shivered in the cold night air, and her stomach growled with hunger.  It had been days since she had anything to eat.  She'd been living on the streets for months.  She was hoping for someway to make her life a little easier.  Ariya was passing through a very dense thicket of trees when, </span></div></div>",
            "created":1431838800,
            "id":1979087,
            "title":"She's abducted by a group off Furries from ..."
        },
        "145311":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "In a small medical room",
                "In a bedroom with someone standing over her"
            ],
            "content":"<div class=\"\"><div> <span>Ariya suddenly heard a strange buzzing noise coming from above her.  She looked up and gasped as she saw what appeared to be a massive ship hovering above her.  Suddenly, a bright blue light shone down onto the female spotted hyena.  Ariya rose her hands to her face, since the light was almost blinding.  She then started to feel extremely dizzy.  She fell to the ground and immediately passed out.  Several hours later, she woke up to find herself, </span></div></div>",
            "created":1432702800,
            "id":1984221,
            "title":"She hears something strange above her"
        },
        "1453111":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "The bridge ",
                "The hot tub room"
            ],
            "content":"<div class=\"\"><div> <span>Ariya woke up to find herself in a small room.  She was laying on a small table with a bunch of pads stuck to her chest.  Sitting next to her was a small screen that was displaying what Ariya could assume was her body's vital signs.  Suddenly, a door nearby opened and in walked a female kangaroo with bright green fur, a voluptuous body,  and was wearing a white lab coat.  She smiled upon seeing Ariya.  \"I see our guest is awake.\" she said as she walked toward Ariya.  Ariya started feeling nervous as the female kangaroo approached.  \"There's no need for you to feel frightened.\" the kangaroo said as she gently caressed Ariya's hand.  Ariya eventually managed to work up the courage to speak.  \"Who are you and what am I doing here?\" she asked, her voice stuttering slightly.  <br>\r\n<br>\r\nThe female kangaroo chuckled as she detached the pads stuck to Ariya's chest.  \"My name is Sarnia.\" the kangaroo said \"My colleagues and I have come from the far reaches of space, traveling through numerous galaxies.  We have brought you on board our gargantuan vessel\".  Ariya stared as at Sarnia as she sat up on the table.  \"But why did you bring me here?\" Ariya asked, still feeling somewhat nervous.  \"My crewmates and I could see that you were in great need of help.\" Sarnia said.  The female spotted hyena gasped upon hearing this.  \"Our crew has decided that we will be more than willing to serve your every need.\". the female kangaroo said, giving a short bow.  Ariya gasped again at this.  \"But why?\" she asked, uncertainly.  \"We felt you deserved to have a better life instead of roaming around, starving, barely able to survive on your own.\" Sarnia added.  Ariya smiled warmly at these words.  Sarnia then helped Ariya off of the table and led her out of the medical room, and into a series of corridors.  The female spotted hyena stared in amazement.  \"This ship is massive.\" she said.  \"It has enough room to support the population of a small city.\" Sarnia replies, smiling.  After several minutes of walking, Sarnia led Ariya to, </span></div></div>",
            "created":1436331600,
            "id":2005210,
            "title":"In a small medical room"
        },
        "14531112":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Whipped cream",
                "Chocolate syrup"
            ],
            "content":"<div class=\"\"><div> <span>Sarnia led the skinny female spotted hyena to a room, which she accessed with the touch of a button.  Ariya gasped when they walked inside.  There was a large tub in the center of the room that was the size of a small lake.  \"I thought you might like a relaxing dip in the ships tub, madam.\" Sarnia said as she walked over to a small computer console.  Ariya smiled as the female kangaroo started pressing various buttons.  Minutes later, the tub started to fill.  However, much to Ariya's surprise, it wasn't being filled with water.  Instead, it was being filled with, </span></div></div>",
            "created":1436331600,
            "id":2005213,
            "title":"The hot tub room"
        },
        "145311122":{
            "author_id":"deadmouse550",
            "author_name":"deadmouse550",
            "choices":[
                "Check the controller",
                "dive in!"
            ],
            "content":"<div class=\"\"><div> <span>Ariya jaw dropped at the sight. \"Is there something wrong?\" said Sarnia looking at Ariya. \"no... It's beautiful.\" Ariya said drooling slightly. \"Okay I'll be back i'm going to check up on the ship. Oh and theres a controller on the table to change the settings.\" as Sarnia left Ariya in the room.</span></div></div>",
            "created":1510713420,
            "id":2415353,
            "title":"Chocolate syrup"
        },
        "14533":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "She eats a strange glowing rock from space, and starts eating everything.",
                "She wins a mega lottery and spends her money on food.",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these choices?</span></div></span></div>",
            "created":1468126800,
            "id":2177880,
            "title":"More Choices"
        },
        "15":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Li",
                "Riley",
                "Rita",
                "Tanika",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Name: Leeuwin \"Li\" Van Dam<br>\r\nSpecies: \"Lupis Leo\" (lion-wolf hybrid)<br>\r\nAge: 21<br>\r\nHeight: 7'0\"<br>\r\nWeight: 890lb<br>\r\nDescription: Scottish. Laya's girlfriend. Enourmously fat, breasts literally watermelon size, but can stand to eat more. Very ill-fitting Black jacket, a black t-shirt with pentagon on it, and jeans.<br>\r\n<br>\r\nName: Riley O'Shane<br>\r\nSpecies: Lynx-Saluki hybrid<br>\r\nAge: 42<br>\r\nHeight: 6'7\"<br>\r\nWeight: 395lb<br>\r\nDescription: Irish, Li's older cousin. H-cup breasts and quite a gut, but has lots of muscle hidden under all that fat. Wears jeans and a light green T-shirt that doesn't cover her belly.<br>\r\n<br>\r\nName: Rita Montane<br>\r\nSpecies: Stripped skunk<br>\r\nAge: 16<br>\r\nHeight: 5'0'<br>\r\nWeight: 350lb<br>\r\nDescription: Sandra's girlfriend. Very fat skunk, D cup breasts and a derpy attitude. Wears jeans and a red sweater that only partially covers her gut.<br>\r\n<br>\r\nName: Tanika<br>\r\nSpecies: Dalmatian<br>\r\nAge: 16<br>\r\nHeight: 6'0\"<br>\r\nWeight: 1500lb<br>\r\nDescription: Very fat, but it's compact. Double-E breasts. Wears ill-fitting jeans and red shirt.</span></div></div>",
            "created":1320987600,
            "id":1221386,
            "title":"Someone else"
        },
        "152":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Gets a girlfriend/boyfriend who is a feeder",
                "Her job requires OR causes it",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is Riley gaining?</span></div></span></div>",
            "created":1390021200,
            "id":1729430,
            "title":"Riley"
        },
        "1522":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Required for modelling",
                "Caused by sampling at restaurant",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Two possibilities: <br>\r\n<br>\r\nRequired by job: Riley becomes a BBW model, an thus they want her to grow.<br>\r\n<br>\r\nCaused by job: Riley starts running a restaurant, and consequently gains from sampling the foods.</span></div></span></div>",
            "created":1390021200,
            "id":1729431,
            "title":"Her job requires OR causes it"
        },
        "15221":{
            "author_id":"lostwriter10",
            "author_name":"LostWriter",
            "choices":[
                "Find an all-you-can-eat buffett",
                "Someone shoes up."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Riley looked between the flyer and the oversized bikini she had. She was thinking about ways to fit into her new wardrobe.</span></div></span></div>",
            "created":1501072740,
            "id":2359630,
            "title":"Required for modelling"
        },
        "15222":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Black Pudding",
                "Cottage Pie"
            ],
            "content":"<div class=\"\"><div> <span>On the edge of town, in the less busy streets, there was a small but profitable restaurant known as the Fat Cat Cafe. It wasn't the biggest one out there, not at all, and it only had a single location, but it had managed to make enough money to move into a standalone building of its own. The restaurant and food itself was in an Irish style, considering that's where the owner herself, Riley, came from. It was somewhat more expensive than most competing restaurants, but more than made up for that by serving big portion sizes...and big quality ones as well. Even the thinnest girl would be waddling as if pregnant by the time she finished eating.<br>\r\n<br>\r\nRiley O'Shane chugged down an entire pot of a Coddle, followed by a loud, wet belch. \"Mmnn,\" she groaned. \"Excellent dish, lass\" She looked down to the eager young cook, a good two feet shorter than herself. \"A bit too much water, and could do with more onions, but it's still something Oi'd pack moi belly full with,\" she grinned.<br>\r\n<br>\r\n\"Ooh, thanks Ma'am,\" she smiled, and then jumped a bit as Riley's stomach gave a low, sloshy grumble of satisfaction, but only with the taste; it demanded ever more food. It always did, Riley was a glutton through and through, and difficult to satisfy as far as volume.<br>\r\n<br>\r\nRiley sighed contently. She knew she'd picked a good choice of career. Everything was going well, people loved the food, and she'd gained a good 25 pounds in the last two weeks; her new outfit, bought before then and perfectly fit, was now strained, with seams starting to bust, pants buttons ready to pop, and seams and her belt creaked with each movement.<br>\r\n<br>\r\nIn addition to normal restaurant owner duties, she would also cook dishes herself sometimes. And would almost always taste test every batch made, especially by newer employees. Riley's sizable gut growled ominously.\"Mmn, belly's rumblin'....hmmm...\" She looked over to the various cooks, and decided she'd taste-test...</span></div></div>",
            "created":1390107600,
            "id":1730160,
            "title":"Never Trust a Skinny Chef"
        },
        "153":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Sandra encourages her to eat more.",
                "Eating contest(s)",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And what causes her to fatten up?</span></div></span></div>",
            "created":1402030800,
            "id":1808005,
            "title":"Rita"
        },
        "1532":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Sandra",
                "Laya"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Against who?</span></div></span></div>",
            "created":1404104400,
            "id":1820138,
            "title":"Eating contest(s)"
        },
        "15321":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Rita.",
                "Sandra."
            ],
            "content":"<div class=\"\"><div> <span>Rita sat across the table from her girlfriend. The tables piled high with food in preparation for their contest. The two enjoyed stuffing themselves immensely and it was only a small leap towards competitive eating against one another. Rita was confident she was going to win being the heavier the two.<br>\r\n\"You ready?\" Sandra asked.<br>\r\n\"Definitely.\" Rita responded.<br>\r\n\"All right then, one two three go.\" Sandra said signaling the start of their competition. <br>\r\n<br>\r\nThe two began quickly stuffing their faces but in the end who won?</span></div></div>",
            "created":1406091600,
            "id":1832577,
            "title":"Sandra"
        },
        "155":{
            "author_id":"panzerleopard",
            "author_name":"PanzerschreckLeopard",
            "choices":[
                "Maxine",
                "Jayde",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Name: Maxine Küper<br>\r\nSpecies: German Shepherd<br>\r\nAge: 25<br>\r\nHeight: 5'6\"<br>\r\nWeight: 195lb<br>\r\nDescription: German. Completely lesbian. Quite chubby, mostly in her belly and ass. E-cup breasts. Sweat pants and t-shirt.<br>\r\n<br>\r\nName: Jayde Lua<br>\r\nSpecies: Domestic Cat<br>\r\nAge: 29<br>\r\nHeight: 5'8\"<br>\r\nWeight: 145lb<br>\r\nDescription: From Trinidad. Pretty slim and fit, but not as much as Panzerschreck. D-cup breasts. Blue Tshirt, studded belt, dark blue jeans</span></div></div>",
            "created":1320987600,
            "id":1221409,
            "title":"More!"
        },
        "1551":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Maxine's girlfriend is obese, & she wants Maxine to be as big as her",
                "Maxine is an FA, and she wants to fatten herself up for some romance",
                "How about some more reasons?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, so why is Maxine trying to fatten herself up for?</span></div></span></div>",
            "created":1387774800,
            "id":1712356,
            "title":"Reasons For Obesity?"
        },
        "15512":{
            "author_id":"trulymadhatter",
            "author_name":"Hatter",
            "choices":[
                "Go find a resturaunt.",
                "Go to the store and find some yummy things, maybe encounter someone there."
            ],
            "content":"<div class=\"\"><div> <span>Maxine had set up a large feast in here home. The reason behind it was to catch the eye of a girl she had met, Nina was her name. An adorable short and very chubby Chartreux cat with clean grey/blue fur and a soft face sprouting mischievous looking orange eyes, she had responded to Maxine's advances by squishing Maxine's belly and saying that she was might be interested if Maxine had some more meat on her bones. After an expectant stare, she waddled off and said \"Meet me at the diner across the street from here friday at 9 if anything changes.\" After sitting there for a minute, Maxine made up her mind and drove off to the grocer to buy some food.<br>\r\nHer feast began by demolishing a pizza, followed by some milk and then a full cake, and some soda to go with it. It did help that she was certainly used to pigging out a bit she guessed but she was already feeling a bit full after eating so much so fast. She slowed down a bit and ate another two pizzas before she felt finished off. Her gut was poking out under her over sized T shirt and felt weighty on her lap. There was still be more food to be had but it was time for a break. She carried the remaining foods over to the couch area and turned on the television to hopefully snack up the rest of it while she watched the teli.<br>\r\nAfter an hour or so of watching shows she looked at the remaining cake and a half with another carton of milk next to it and with the girl she saw in mind, she stuffed the rest of the food down and collapsed down on the bed when she forced the last bits down. \"I think thats everything...\" She thought and she waddled into the bathroom to wash up and proceeded to pass out on after she fell on her bed, with thoughts of the girl she met in her head.<br>\r\nShe rested peacefully until a dream of the smiling cat cuddling with her began. It was warm and soft but she suddenly noticed that was unable to move. The girl had tied her up and was telling her to open up her mouth so she could put more food into Maxine's enormous belly but she couldn't, her mouth would not move.<br>\r\nShe then woke, sadly realizing it was just a dream.<br>\r\nAfter putting on her clothes, and noticing some slightly increased tightness due to yesterdays binge, she took inventory of her food supply and found it empty.<br>\r\nWhats she gonna do about it?</span></div></div>",
            "created":1450587600,
            "id":2076914,
            "title":"Maxine is an FA, and she wants to fatten hersel..."
        },
        "1552":{
            "choices":[
                "She starts overeating due to depression",
                "She tries a new weight pill",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is Jayde going to gain weight? (For the second story, only her belly gains weight.)</span></div></span></div>",
            "created":1416978000,
            "id":1894213,
            "title":"Reason for Gain"
        },
        "1553":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Lil deville ",
                "Elizabeth the pink poodle",
                "Next character"
            ],
            "content":"<div class=\"\"><div> <span>Name:  Lil deville <br>\r\nSpecies:  jack russell terrier<br>\r\nAge: 1 year old<br>\r\nHeight: 8ft <br>\r\nWeight: 2500lbs<br>\r\nDescription: American. Single. Massively fat, all around her body. Her dress from rugrats.<br>\r\n<br>\r\nName: elizabeth<br>\r\nSpecies: american poodle<br>\r\nAge: 25<br>\r\nHeight: 7ft <br>\r\nWeight: 2000lbs<br>\r\nDescription: American. Big pink and sassy. T shirt.</span></div></div>",
            "created":1350104400,
            "id":1445886,
            "title":"Other"
        },
        "15533":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Let me go with her.",
                "Give me another choice again."
            ],
            "content":"<div class=\"\"><div> <span>Name: Sarah Drakkar<br>\r\nSpecies: Silver fox<br>\r\nAge: 19 years old<br>\r\nHeight: 6 ft 5in<br>\r\nWeight: 250lbs<br>\r\nDescription: A smart confident young woman, out in the world for the first time after moving away from home. She has mostly black fur, with lighter gray fur along her stomach and breasts, with a white patch on the end of her tail. She hasn't had much time to cook for herself, so fast food and take out has become common, and has started to have an impact on her weight. She has gained mostly all over giving her a rounded appearance.</span></div></div>",
            "created":1387774800,
            "id":1712399,
            "title":"Another character possibility"
        },
        "155331":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Sounds like a plan.",
                "Try again."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And what is the reason for young Ms. Drakkar to be gaining?<br>\r\n<br>\r\nPerhaps a new female friend she has met in the city is helping to fatten her up, saying it isn't right for a young girl like her to be so skinny?</span></div></span></div>",
            "created":1390626000,
            "id":1732900,
            "title":"Reason for gaining"
        },
        "1553311":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "It's Shiara, \"speak of the devil\".",
                "It's someone she doesn't recognize."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, where is it? I know it's here somewhere.\" A young woman voice calls out through an apartment, boxes stacked around the rooms, evidence of a recent move. \"I know I packed it, but where....no, no, no!\" A thump and clatter comes from the bedroom, where the voice was coming from. \"That wasn't supposed to fall like that.\"<br>\r\n<br>\r\nWith a sigh, Sarah puts the fallen box back onto the stack and starts sorting through the items that spilled out of it. \"No, no, that's not it, I didn't even know I still had this but still no... I know I packed my old jewelry box here somewhere, just where did it end up though?\" She says to herself as she looks around at some of the other boxes she had checked through. With a shake of her head, she flops down on her bed. She is a bit surprised by the fact that her body keeps moving for a second or two after she has stopped.<br>\r\n<br>\r\nLooking down her body, she is somewhat surprised by what she sees. Her generous bust is pushing against her formerly loose shirt, a bit of cleavage visible through the neck hole. Below that is her stomach, a plush furred dome pulling the hem of her shirt up. Her hips are stretching her pants out a good amount, tightening them across her rump. Her whole body is plumped up a bit from when she was still living at home, and that wasn't all that long ago.<br>\r\n<br>\r\nShe knew that that she had put on some weight, but this was the first time that she actually noticed all of it on her body. Not having time to hit the gym and mostly only eating fast food and vending machine snacks were likely culprits. She just didn't have the time to cook for herself usually, and didn't have the time or energy to hit the gym or do any beneficial amount of exercise between her work at a local office building (mostly running mail around, or taking care of some of the errands throughout the building), and taking some college classes in the hours where she wasn't working. This was actually one of the first times that she had any real amount of free time in a while.<br>\r\n<br>\r\nThe more she thought about it through, she started to think that perhaps Shiara was also at least partially to blame for her increasing weight. Shiara was a secretary for one of the big wigs at their work. After their first meeting, over a handful of mail, Shiara had taken a liking to Sarah and kind of taken the young vixen under her wing. Shiara had started showing Sarah around the city, and was helping her to form connections within the business. More often than not, their meetings would also involve large meals from some of the various more upscale restaurants that Shiara seemed to frequent. She always seemed to be lightly pushing Sarah to try this, or take a taste of that, and so on. Sarah was glad to have made a new friend who was helping her out like this, but was kind of surprised by how much food showed up when Shiara was involved.<br>\r\n<br>\r\nA knock at the door stirs Sarah out of her thoughts. She also realized that she had one hand under her shirt, kneading her soft stomach without her knowing she was doing it. With a huff, she pulls her hand out, stands up, and makes her way to the door. Checking through the peephole, she sees... </span></div></div>",
            "created":1390971600,
            "id":1734926,
            "title":"New Body and a Guest."
        },
        "15533111":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "She accepts Shiara's help and decides to try this place out with her anyways.",
                "She gets help from Shiara, but declines going out to eat with her this time."
            ],
            "content":"<div class=\"\"><div> <span>Looking through the peephole, Sarah can only two large round blue mountains with a long valley between them. Shaking her head a bit, Sarah opens the door, knowing that only Shiara would likely be knocking on her door with only those mounds visible. She was proven correct when she saw Shiara standing there with a smile on her face.<br>\r\n<br>\r\n\"Hey Sarah, I was just in the neighborhood and decided I should check up on you, see if you've gotten anything more unpacked...\" Looking through the door, she can easily see the boxes still in stacks behind Sarah. \"And I guess that would be a no. Do you mind if I come in, I might be able to help you out.\"<br>\r\n<br>\r\n\"Yeah, yeah, come on in. I've been trying to get some stuff unpacked, but mostly I've been looking for my old jewelry box, I know I packed it somewhere, but it's just a matter of where.\"<br>\r\n<br>\r\nSarah looks back over her shoulder as Shiara came in and shut the door. Shiara was a large specimen of a dragoness, standing at about seven feet tall, and covered in deep blue scales. One of the first things that most people seemed to notice was Shiara's immense bust, large fleshy breasts, slightly lengthened under their own weight, Shiara tended to wear low cut tops to better show her cleavage. Had that been her only defining trait, Sarah would have likely thought of Shiara had just had an overdone breast enlargement. The rest of her body showed just how her bust had gotten like that though. Her breasts rested atop the bloated sphere of her stomach, large and fleshy drooping down onto her hips. The weight of her stomach and the fat on her sides combined to form large rolls that went across her sides and her back. Her hips always seemed to be straining whatever bottom she seemed to squeeze herself into, each of them easily wider than most other people's shoulders. Her arms and lower legs seemed to nearly constantly ripple with the fat encasing them. Her face had rounded cheeks with a fleshy chin under her muzzle. Despite her size, or perhaps even because of it, Shiara took good care with herself. She never seemed to have problems getting around even with all of her weight, proving the muscle buried under the fat. She always took the best care of her long black hair, and her body, keeping all clean and shiny. All in all, Sarah only wished that she could show as much confidence in her body as Shiara does in hers.<br>\r\n<br>\r\n\"Well, I'm sure that you'll find it. Though it might help if you start unpacking everything first.\" Shiara suggested, smiling as she saw Sarah looking over her body. Shiara certainly enjoyed positive attention about her body.<br>\r\n<br>\r\n\"I've been trying to, but everything else has been keeping me busy, what with work and schooling and everything.\" Sarah responded, as she led Shiara to her living room and removed a couple of boxes from the couch. She then took a seat in a nearby chair, leaving Shiara to sit down on the couch herself, her body settling and taking up much of the room on her own.<br>\r\n<br>\r\n\"What do you say I help you out a bit, then perhaps I could interest you in joining me for a meal. I know of a great place nearby, and I think you'll like it.\" Shiara said with a grin.<br>\r\n<br>\r\nSarah gave an amused sign, she had been expecting Shiara to offer food to her again. She was starting to wonder if perhaps she shouldn't be eating with Shiara so much though.</span></div></div>",
            "created":1391230800,
            "id":1736465,
            "title":"An invitation."
        },
        "155331111":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Sarah submits to Shiara's \"help\".",
                "Sarah is able to resist."
            ],
            "content":"<div class=\"\"><div> <span>With a sigh, Sarah agreed \"Yeah, we can go out to get something to eat, but only after we get some done here.\"<br>\r\n<br>\r\n\"No problem, I wasn't planning on having us run off yet anyways,\" Shiara responded. \"Now, shall we get to work?\" She said as she heaved her body off of the couch, which seemed to groan with relief after the dragoness had lifted her weight off.<br>\r\n<br>\r\nTogether, they started working on the boxes. Surprisingly, Shiara seemed to move with a bit more grace than Sarah would have thought possible, mostly avoiding the boxes as they worked, not counting a few accidents. Things were quickly put away as the two of them worked at it, and the boxes were quickly folded down and made ready to recycle. More than a few times as Sarah had to reach up high or bend over low to put something away or pick something up, she thought she could feel Shiara was staring at her, but she couldn't catch the dragoness in the act, so she just shrugged it off.<br>\r\n<br>\r\n\"Ah there it is.\" Sarah said after nearly finishing with another box. \"Why did it end up in this box though,\" holding up the jewelry box she had been looking for. The box it was in clearly contained some kitchen supplies her parents had given to her, not really a place for a jewelry box.<br>\r\n<br>\r\n\"Who knows how some things end up where they do, but I did tell you that you would find it.\"Shiara responded as she finished with another box herself. \"Well, I do believe that we did a pretty good job so far, so what do you saw we stop here and go out for that bite to eat?\"<br>\r\n<br>\r\nSarah looked at her apartment, they had done a great job already, getting more done in the last while than she had mostly since she had moved in. There were still a few boxes here and there, but all in all the place was starting to look more like a home rather than a warehouse.<br>\r\n<br>\r\n\"I guess we can get going  thank you for all of your help so far, Shiara.\" Sarah said with a smile.<br>\r\n<br>\r\nShiara just beamed, \"Oh, it's no trouble. I enjoy helping you out Sare.\"<br>\r\n<br>\r\n\"Just let me put this away and we can get going.\" Sarah said as she took the jewelry box back to her bedroom. Setting it on the dresser she was about to leave when she noticed her closet door was ajar, and inside it looked like some of her clothes had been moved around a bit. Sarah didn't remember any clothes being in any of the boxes they had done, so had Shiara been in her closet when she wasn't looking? Sarah shook her head, and got rid of that idea. She had likely just forgotten to shut the door when she got dressed this morning.<br>\r\n<br>\r\n\"Besides what reason would Shiara have to go through my closet?\" Sarah thought to herself as she shut the closet door and left her bedroom.<br>\r\n<br>\r\nShiara was already standing there with the door open and waiting. A quick elevator trip a few floors downstairs, and they were out on the street. Sarah started to walk towards Shiara's car, specially made for someone of her dimensions, but noticed that Shiara was walking the other way.<br>\r\n<br>\r\n\"Aren't we taking your car, Shiara?\"<br>\r\n<br>\r\n\"Oh, no, it's just a couple of blocks this way, dear.\" Shiara responded, before continuing on her way, easily clearing a path through the people on the sidewalk.<br>\r\n<br>\r\nSarah thought about it for a moment and then followed the retreating form of the dragoness, stuck behind that massive shifting butt as the people flowed around Shiara. Shiara seemed to be setting the pace much more than Sarah could, despite their weight differences.<br>\r\n<br>\r\nA few blocks over, Shiara pointed to a seemingly small building front that Sarah had never paid much attention to before, and led them inside. As Sarah went inside, she saw the small sign with the name of the restaurant. It said simply \"The Feeding Room\".<br>\r\n<br>\r\nInside she found Shiara already talking with a hostess, a slender rabbit girl in a frilly outfit.<br>\r\n<br>\r\n\"Your usual room, Shiara?\" The rabbit femme asked.<br>\r\n<br>\r\n\"Not today, Lana. I'm just bringing a first timer in here to get her something to eat.\" Shiara said, looking around a bit before finding Sarah standing behind her and bringing her around so that Lana could see her. \"This is Sarah, and she hasn't been in town for long.\"<br>\r\n<br>\r\n\"Oh, hello, Sarah, my name is Lana, though I guess you already know that.\" She said with a giggle. \"Any friend of Shiara's is welcome here. I'll show both of you to a table then.\"<br>\r\n<br>\r\nLana then walked out from behind the little stand to a door that would likely lead into the main part of the restaurant. As she stepped out though, Sarah was more than a little surprised to see that Lana's stomach was left uncovered and was easily the size of a small beach ball. Shiara seemed to not notice, or if she did, found nothing odd about it, merely motioning for Sarah to come along.<br>\r\n<br>\r\nAs they stepped through the door, Sarah found that she had drastically underestimated the size of the place. It was easily the size of a warehouse, and mostly opened spaced. Half of the space was taken up by multiple rows of buffet tables, while the other half was taken up by seating. There wasn't that many customers here, but that didn't stop them from taking up a lot of room. Almost all of the people were women, and more than half of those were all in the larger stages of what Sarah would call fat. Most of those were somewhere smaller than Shiara, a few were around her size,  while one was truly immense, almost whale-like in her size.<br>\r\n<br>\r\nAs Lana led them to a table in the back, a few of the others looked up and gave a wave or otherwise acknowledged Shiara. It seemed that she was quite well known here.<br>\r\n<br>\r\nSarah took a seat on one side of the table, thinking that Shiara would sit on the other. Shiara instead motioned for Sarah to move over, before taking a second seat and sitting herself down, effectively pinning Sarah in the corner behind Shiara's body.<br>\r\n<br>\r\n\"I'll let you two get settled in. You know the drill, Shiara. I'll get the drinks, and then we can get started with the food.\" Lana said with a smile as she walked off.<br>\r\n<br>\r\nSarah looked up at Shiara, \"So what's up with this place?\"<br>\r\n<br>\r\n\"Oh, it's just a place that's more than a little appreciative of the larger female form.\" Shiara responded, looking out across at the other people.<br>\r\n<br>\r\n\"Yeah, I think I got that.\" Sarah said, looking out herself. There was a number of waitresses moving back and forth between the seating, the buffet tables, and a few doors that most likely led to the kitchen. She stared as four waitresses carried a huge covered platter between them, heading for a series of doors along one wall that Sarah didn't notice before.<br>\r\n<br>\r\n\"What's back there, behind those doors?\" Sarah asked.<br>\r\n<br>\r\n\"The private rooms, things can get a little more...\" She seemed to think about the right word for a bit. \"Interesting back there, shall I say. I figured I would just get you started a bit more basic first.\" A grin curling her muzzle and denting her cheeks.<br>\r\n<br>\r\nSarah was about to respond but Lana came back with a couple of huge glasses filled with what seemed to be pink lemonade. Sarah was about to say that she hadn't ordered it, but was cut off by Shiara.<br>\r\n<br>\r\n\"Lana, we'll just take the standard, don't want to get started off too fast.\"<br>\r\n<br>\r\n\"Coming right over.\" Lana said before darting off again.<br>\r\n<br>\r\nSarah looked back at Shiara quizzically, who responded \"It's the standard drink that comes with, it helps with the digestion. And as for the food, don't worry about it.\"<br>\r\n<br>\r\nSarah was again cut off as Lana led a line of waitresses to the table, each of them loaded down with platters heaped with many delicious looking food items. Fried chicken, mashed potatoes, a whole ham, a huge turkey breast, and on and on.  Soon, the huge table was completely covered with food. As the rest of the waitresses filed off, Lana remained behind.<br>\r\n<br>\r\n\"Will there be anything else, Shiara?\"<br>\r\n<br>\r\n\"Not right now it seems, and pass along my compliments to the chefs, it all looks great as always.\"<br>\r\n<br>\r\n\"Of course.\" Lana said and left with another giggle.<br>\r\n<br>\r\n\"Well come on, don't want the food to get cold.\" Shiara said, before starting to dig into one of the pieces of fried chicken.<br>\r\n<br>\r\nSarah was stunned by the amount of food in front of her, but she was feeling somewhat hungry. So she took a drink from the glass and tried some of the ham with the mashed potatoes. Then she tried some of the turkey. Shiara would stop from time to time to look at Sarah's progress, As Sarah started to slow down, Shiara tutted.<br>\r\n<br>\r\n\"Is that all your're going to eat, I think you can do better than that. What do you say I help you out a bit?\" Shiara couldn't quite read the look that Shiara was giving her, and wasn't sure whether she should be scared or not. Did she really want to eat any more, even if Shiara was going to be \"helping\" her?</span></div></div>",
            "created":1391230800,
            "id":1736759,
            "title":"Lost becomes found and gluttony to come."
        },
        "1553311111":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "It doesn’t take her long to figure out she’s at her home.",
                "It doesn’t take her long to figure out she’s in a bedroom she doesn’t recognize."
            ],
            "content":"<div class=\"\"><div> <span>After a moment of thinking, Sarah nods her head and is about to answer, but Shiara is already in action. She turns a bit closer to Sarah and pulls more food closer before offering her a heaping forkful. Opening her mouth tentatively, Shiara pushes the fork in and wastes no time in getting another ready. Soon they hit a steady rhythm as more and more food is packed into Sarah’s stomach, far more than she would typically be willing to eat. Her swelling stomach protests each new bite of food shoved in, but something about Shiara makes Sarah shove that feeling aside and continue eating. Her whole brain is devoted to the simple task of eating what Shiara is giving her.<br>\r\n<br>\r\nTurkey and mashed potatoes, pulled pork, fried chicken, and on and on, everything becoming a bit of a blur as Shiara feeds and encourages Sarah. Before long, plates are being cleared and stacked to the side at a dizzying pace. Shiara is eating some as well, but if Sarah is more aware she might have noticed that far more of the food is migrating into her than the larger dragoness and it shows with how her stomach is slowly but steadily marching out across her lap.<br>\r\n<br>\r\nAfter quickly devouring half a dozen warm and butter-soaked rolls, Shiara offers up the glass of lemonade before her, and Sarah only nods her head. She guzzles down half the glass, relishing the coolness flowing into her stomach. It even seems to help the overstuffed feeling that was pricking at the back of her mind and helping it to be washed away as more food quickly follows. More and more plates are sopped clean and set aside as their contents travel into Sarah. Lana even stops by to check how things are going, but seeing that Shiara is having her fun the rabbit just grabs one of the piles of plates and slowly totters away.<br>\r\n<br>\r\nSarah slowly drops down into a haze, her body running on autopilot despite rocketing past her normal limits. Shiara doesn’t miss a beat though, and Sarah’s body doesn’t slow down either, continuing to eat and eat as she drifts off.<br>\r\n<br>\r\nSarah slowly comes to, her mind still dazed and hazy. She can’t quite remember where she is or what happened to her, but she can tell that she is laying down on something soft. Slowly running her tongue over her dry lips, her taste buds are hit by a mishmash of flavors. A small burp only adds to the overlapping tastes, making her a bit sick. The tastes stir up some of her memory, mainly Shiara and that food…all of that food. Her eyes snap open and she tries to get up, but lances of pain help prove that she is not going to be moving much at all. Screwing her eyes shut, she can only lie there as the pain washes over her.<br>\r\n<br>\r\nAfter a few moments, the pain lessens enough for her to think about doing anything again. She slowly opens her eyes and tries to find the source of the pain. It doesn’t take long for her eyes to spy her stomach over the curve of her breasts. Where before the paunch was just barely visible beyond her bust, now it is a huge swollen sphere, looking like she has swallowed an overinflated beach ball. Even her arm feels sluggish as she slowly brings her hand up to touch it, pain instantly bursting out and confirming that she was really that stuffed full. After some more time for the fresh wave of pain to fade, she opens her eyes again, and now realizes that she is naked. Slowly pushing herself up just a fraction, she is able to look around a bit beyond herself, and sees that is on a bed, explaining the softness that she is lying upon. Casting her eyes about, she tries to cut through the fog wrapped around her brain and try to figure out where she is and what happened.</span></div></div>",
            "created":1430456400,
            "id":1972104,
            "title":"Submission"
        },
        "15533111112":{
            "author_id":"salvo820134",
            "author_name":"Salvo",
            "choices":[
                "It was at Sarah’s apartment ",
                "Sarah’s favorite sandwich shop"
            ],
            "content":"<div class=\"\"><div> <span>Sarah awoke not yet opening her eyes. she stretched and yawned sitting up relieved the pain from what she thought was the night before had subsided but her relief was cut short when she opened her eyes. Sarah wasn’t in her bedroom or home for that matter she then looked around the room that was vastly nicer then hers, it was a large master with the bed facing a massive flatscreen in its own large tv stand which had its own storage compartments, to the right of the tv was a set of double wooden doors to enter or exit, closer to the righthand side of the bed was a large dresser with a mirror attached to it, 10ft away directly to the right of the the large bed Sarah saw another set of doors leading to a giant bathroom and a large walking closet directly in front of it. She also saw two double windows which had heavy curtains which barely let in any sunlight. Sarah also noticed how comfortable the bed was making her not want to leave it for a second due to its very comfy pillows and nice warm blanket, moments later she finally sat up but as she did she felt resistance.<br>\r\n<br>\r\nSarah un-covered her self noticing that not only had she visibly gained weight from the previous binge but she was naked as well revealing every ounce or pound of damage. Her once rounded appearance had evened out due to the fact that the fat had placed itself on her legs, butt, chest and a little on her arms. Not even thinking about the strange room and more concerned about her weight Sarah ran to the bathroom looking for a scale, after a while she found a rather industrial looking scale wondering why someone would need one so advanced. She stepped on and waited for the digital numbers to appear when they did she gasped \"260!!! There’s no way I gained 10 pounds in one night how is that even possible \" said the rather shocked Racoon, she knew she had been gaining wait since her new job but that was over the course of a couple months. Sarah turned around to see that a section of the  wall behind her was a mirror which stretched from floor to ceiling. It also displayed every inch her new curvaceous self, she traced every curve and poked every new bit of padding getting slightly aroused when her hands reached her rear then found their way to her breasts which had went up a couple of sizes. <br>\r\n<br>\r\nAfter what seemed like half an hour passed Sarah snapped out of her trance and went to try and find out a little more about the house she was in, but when she reached the set of doors to leave the bedroom they swung open and a familiar dragoness came into the room wearing only her underwear. Sarah sighed in relief that it was shiara not minding fact she was in only her bra and panties. \"I brought you back to my place after our dinner in the feeding room, after we got back I threw you on the bed and put your cloths in the wash I hope you don’t mind\" said shiara, \"thank you shiara, once again you saved my ass. I don’t know how I would have made it home last night I was so stuffed\" the two laughed at Sarah’s comment. However Sarahs smile faded as motioned to her new padding \"I just can’t believe how fat I got I mean look it’s just disgusting\" said Sarah. Shiara then opened her mouth \" look Sarah there’s nothing wrong with the way you look I mean it’s just a couple pounds. Also I think it’s overrated to be skinny, you have to practically torture yourself to stay in that shape...plus you can’t enjoy yourself whith something tastey. Sarah then replied \"well I never thought of it that way I mean after that all food we had so much better then what my gym was telling me to eat maybe I shouldn’t be so hard on myself\"...Shiara grinned when Sarah wasn’t looking her eye to eye as she already had a plan in mind.<br>\r\n<br>\r\nShiara-\" welllets go sleeping beauty Breakfast is getting cold\" Sarah responded with nothing but questions \"how long was I out, how would I be able to eat after all that, and uh... where are my clothes at now???\". Shiara and Sarah reached the dinning room and Sarah sat down at a rather large and Sturdy table, \"I’ll be right back\" said shiara as she walked to the kitchen, she returned moments later with a large plate full of scrambled eggs, sausage, pancakes which were coated in syrup but not enough to soak into the other foods, muffins, doughnuts, banana bread, and hash browns setting it in front of Sarah then returning with an identical plate and sat down. Sarah spoke up\" you expect me to eat all this I...\" but her protest was cut short as the smell of the food caught her nose and she was overcome by a ravenous hunger. As she began to dig in Shiara watched and smiled \"I’m glad you like it my mom taught me how to cook when I was little and I eventually got things right\" she said as she began to calmly eat her own plate. \"Now to answer some of your questions I put your cloths on the bathroom counter but I gues you missed them, your probably hungry after sleeping for a 24 hours as well. Sarah’s head snapped up begging taken away from the most delicious breakfast she’s had in a while \" a whole day what about work oh no, oh no, oh no, My boss is going to kill me. Shiara giggles to herself and piped in \"Sarah remember I’m in charge of your bosses boss I worked something out\" Sarah perked up and that is \"well Sarah before our dinner I needed to complete a couple of projects that my manager gave me, he also told me I had How ever much time I needed to get it done and I said that I’d like you to assist me\". <br>\r\n<br>\r\nNow, he told me that was fine and to take my time since I’m a fovorite of his due to my productivity but as long as I make sure your just as productive\". Sarah smiled \"thanks shiara I owe you one\" I have a payment in mind but for now let’s just get through breakfast. Also if you don’t mind you’ll be staying here at my place just so that you don’t need to keep going between houses, Sarah agreed \" that’s fair thanks shiara\" \"no problem\" shiara replied. Sarah then continued to eat, after about thirty minutes she was full finishing some of the portions on her plate and putting a dent in others. Although the portions weren’t massive there were just a lot of different foods. Sarah didn’t want to waste anything so she asked shiara for help once again who was over top the smaller racoon and feeding her the rest of her breakfast before Sarah could finish with the sentence. First was the rest of the banana bread, then the bacon, then the cheesy eggs, then came two unfinished muffins, lastly was a side plate consisting of four doughnuts which made Sarah moan in delight. This made shiara smile leave to refill the plate and give it to Sarah again, before Sarah could to protest she was once again met by the over powering flavor of the doughnuts going into a state of bliss. When they were done it looked like Sarah had swallowed a basket ball as her stomach was nice and round from the heavenly breakfast which lead her to let out a sigh. The two then began to discuss the details of their projects, shiara told Sarah that they would have way more time then what they actually needed and to think of this as a long vacation.<br>\r\n<br>\r\nAfter getting finished Sarah went back to the master bedroom to get ready to go back to her apartment so she could get her things. Sarah meeped when she realized that she she was still completely naked being slightly embraced but then focused started to wonder if shiara was trying to make her gain weight, she pushed the thought aside thinking that she was just treating Sarah to all of this since she was her guest and as a close friend. But little did Sarah know that shiara was trying to in a friendly way but that she was also going to make Sarah a lot bigger. As Sarah finished with her shower she dried her self off, made her hair, etc, then went to put on her clothes. First Sarah out of her panties which felt a tad tight and road up the crack of her ass beginning to look more like a thong, then she put on her bra which felt very tight doing little to hold back her larger breasts, next came her jeans which had been slightly loose before now were skin tight showing off her thick legs and rear. Lastly she put on her shirt which had hung a little over her pants before her gain now fit her perfectly. Sarah took this in and thought that although it was a some what large amount of weight considering that it had been only a couple of days it had even out her body enough from her belly that it didn’t look all too bad in fact she held the weight pretty well. <br>\r\n<br>\r\nSoon after she was completely finished getting ready she hauled herself (considering she was still digesting her breakfast) into Shiaras car. She found it rather spacious and comfortable feeling like she was a child in a parents car. The space of the vehicle made the dragoness look like a average person despite her size, which only meant that Sarah looked comically small as the seat was almost three times as wide as well as taller then Sarah. She even slightly struggled to look out of the window to see where they were going. As they drove she and Shiara talked about life, work, and a new step for Sarah-food, and after a very relaxing car ride they came to a stop and Sarah was happy to see where they were.</span></div></div>",
            "created":1521035580,
            "id":2464409,
            "title":"It doesn’t take her long to figure out she’..."
        },
        "1553312":{
            "choices":[
                "Yes! You got it right! ",
                "NEVER!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so maybe she was walking around and she bumped into you!  You were shocked and wanted to take her out to dinner. Mainly because if how it was love at first sight. </span></div></span></div>",
            "created":1427518800,
            "id":1955131,
            "title":"Try again."
        },
        "155332":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Go with this character.",
                "Another choice please."
            ],
            "content":"<div class=\"\"><div> <span>Name: Alexandria (Alex) North<br>\r\nSpecies: Raccoon<br>\r\nAge: 20 years old<br>\r\nHeight: 5'2\"<br>\r\nWeight: 190 Ibs<br>\r\nDescription: a shy bookworm who's studying for her college degree. Doesn't get out much but would like to be more social. It's most of her fat accumulates and her breasts and ass giving her a soft hourglass figure and a relatively small belly that she can usually cover with a thick sweater. </span></div></div>",
            "created":1402030800,
            "id":1808011,
            "title":"Give me another choice again."
        },
        "1553321":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "New roommate takes her out to meals with other people to make her more social",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And why is she getting fatter?</span></div></span></div>",
            "created":1405659600,
            "id":1829808,
            "title":"Go with this character."
        },
        "15533211":{
            "author_id":"casualcritic",
            "author_name":"CasualCritic",
            "choices":[
                "First impressions are everything, pick the blouse.",
                "Stick with what you know, nothing is better than sweaters."
            ],
            "content":"<div class=\"\"><div> <span>\"Alex, hurry up! You don't want to make Jean and the others wait long, do you?\"<br>\r\n<br>\r\n\"This is my first time meeting your friends, Claudia, it's not like I can wear just anything.\" Alexandria sat comfortably behind the bathroom door, taking advantage of one of the few private places offered in her dorm. Her dear doe dorm-mate had invited her out to eat with her circle of friends and while she may have preferred a cozy sit-down for another chapter of <i>Dawns Last Light</i>, she had promised herself to be more sociable this semester and break out of her shell. Besides, food with fri... acquaintances was never a wrong choice.<br>\r\n<br>\r\nShe had already decided on a pair of black slacks as her bottom, in no small part due to them hopefully having a slimming effect on her round rear. But it was the top she was having trouble with. She had already stripped of her shirt, leaving only a baby blue bra to keep her warm, but even holding each article of clothing up against herself in the mirror, she couldn't decide.<br>\r\n<br>\r\nIn one hand was a periwinkle blouse she had borrowed from Claudia's closet. She knew it would look good with the pants and was fancier than most of her own humble wardrobe. She could make a good impression with it. However, Claudia didn't necessarily share her dimensions. The doe was a tad more slight than the raccoon's own body, especially in the chest. She might have to leave a button or two undone just to wear it and she'd hate having to watch what she ate to keep from stretching it further.<br>\r\n<br>\r\nOn the other hand, quite literally, was thick violet sweater from her sweater collection. Of all her clothes, she found them to be the most comfortable and they were SO comfy. It fit her well and she could eat as much as she liked without worrying about its fit. In addition, while she may have some weight around her middle, you would never tell under her thick top, giving her an hourglass-like figure even if she wasn't particularly thin. Of course, that wouldn't impress her new friends and it wouldn't look near as nice as the blouse's pair.</span></div></div>",
            "created":1492923600,
            "id":2309760,
            "title":"New roommate takes her out to meals with other ..."
        },
        "155332111":{
            "author_id":"casualcritic",
            "author_name":"CasualCritic",
            "choices":[
                "An old-fashioned diner",
                "They're college students, it's going to be fast food."
            ],
            "content":"<div class=\"\"><div> <span>How she looked now would influence how Claudia's friends would think of her for a good while and she decided she'd rather come across as more loose and friendly, not something she felt her normal attire could convey. She carefully folded her sweater and put it aside for latter.<br>\r\n<br>\r\nAfter pulling the sleeves on, she began buttoning her borrowed blouse from bottom up. She was slightly surprised by how easy it was. Unlike herself, Claudia was a track star here on scholarship and was keen on working out. But in the end, they apparently weren't so different in clothes size, only that where Alex had a layer of flab, the deer had a set of abs. It wasn't exactly loose, but luckily her stomach wasn't taxing it.<br>\r\n<br>\r\nThe problem arose when she got to her chest, which was definitely larger than her roommates. While not overly busty, in her opinion, she didn't have to be when Claudia was practically flat-chested. Trying to button over her breasts left her panting for air and she only got as far as the third button. Any attempts to do up the one above that simply couldn't make it. It would have to do.<br>\r\n<br>\r\nThe raccoon gave herself one last look in the mirror. Admittedly, it didn't look so bad. It was tight across her bosom and didn't fully cover it, but it wasn't indecently so. It certainly showed off her curves more than she was used to. Despite its comparitevely small size, she didn't have to worry about a wardrobe malfunction so long as she didn't breathe deeply... at least not right now. As she exited the restroom, her doe friend seemed to approve the decision as well, given her surprised expression.<br>\r\n<br>\r\n\"Alex, this a side of you I haven't seen before. I didn't even know you owned a shirt like that.\"<br>\r\n<br>\r\n\"Thank you! That's because it's yours.\" That... seemed to upset her for a moment.<br>\r\n<br>\r\n\"That would explain why you're actually showing your breasts. Can't do it up all the way?\" Despite some fervent blushing, she had to nod yes.<br>\r\n<br>\r\n\"It's not too bad, is it?\" <br>\r\n<br>\r\n\"No, no, it's still tasteful. I approve of you going out of your comfort zone. But I wish you would've asked first. You might as well have it now.\" Alexandria readjusted her borrowed blouse to disguise her faux pas.<br>\r\n<br>\r\n\"Hey, don't worry about it. C'mon, we gotta go in order to beat the traffic.\" The two got up, Alexandria making sure to grab a novel for the short trip, and moved to Claudia's sedan. She found the seatbelt more uncomfortable without her sweater to guard against it.<br>\r\n<br>\r\n\"By the way, where are we going? I don't think you ever said.\"<br>\r\n<br>\r\n\"Oh, you'll see. It's my treat but in return, you have to trust me.\"</span></div></div>",
            "created":1493096400,
            "id":2310556,
            "title":"First impressions are everything, pick the blouse."
        },
        "155332112":{
            "author_id":"casualcritic",
            "author_name":"CasualCritic",
            "choices":[
                "An upscale establishment renowned for good food",
                "An all-you-can-eat buffet, where else?"
            ],
            "content":"<div class=\"\"><div> <span>It wouldn't do any good lying to people she intended to befriend and nothing was more Alexandria than fluffy sweaters. Setting her friend's outfit aside, she tossed the purple garment over her head and threaded her way through it. She took a moment to admire how she would look, how others would see and assume about her,  before deeming it satisfactory. Even a chubby raccoon could look svelte with the right outfit.<br>\r\n<br>\r\n\"Sorry about making you wait, Claudia,\" she announced as she left the bathroom. \"I couldn't decide what to wear.\"<br>\r\n<br>\r\n\"I could've helped with that. A sweater. All you have is sweaters.\"<br>\r\n<br>\r\n\"I have a few more things than just that. Their just a little more specialized. Oh, you'll probably want this back.\" The raccoon tossed the borrowed blouse back to her friend, who only barely caught seeing as she wasn't expecting her dorm mate to try something of hers.<br>\r\n<br>\r\n\"Well if this was the other option, I approve of your decision. I'd probably have to sew a button or two back on this thing if you tried it on.\"<br>\r\n<br>\r\n\"My bust isn't THAT big.\" Put on the defense, Alexandria turned away from her roommate and crossed her arms over her chest, not wanting to draw more attention to her twins.<br>\r\n<br>\r\n\"Sure, but neither are mine and you can't tell me your boobs aren't bigger than mine.\" Claudia wasn't lying. Just in general, Claudia cut a more trim figure than her raccoon pal. Not that she was technically thin, but having gotten to college on a track scholarship left her in good shape. What Alex had in fluff, Claudia had in muscle, all except for their chests, where Claudia had flattened hers down with exercise Alex was wondering if she needed to upsize hers.<br>\r\n<br>\r\n\"Now c'mon Alex, Jean and Jared are probably already there and waiting on us.\"<br>\r\n<br>\r\n\"Oh, yes, sorry sorry.\" Before she left out the door, the masked animal made sure to nab a small novel from a nearby shelf. Claudia didn't notice until after she locked the door behind them.<br>\r\n<br>\r\n\"A book? Really? I thought the whole point of us going out was so you could see more people, not read in a different background.\"<br>\r\n<br>\r\n\"I'm gonna do that. ...I'm just nearly done with this book and I thought I could polish it off if there was a lull in conversation.\"<br>\r\n<br>\r\n\"You like to polish off a lot of things, dontcha?\" Her cervid friend lightly elbowed her in the stomach.<br>\r\n<br>\r\n\"You got me. I don't like to leave things unfinished. Why else did you think I never have leftovers?\" The pair chuckled at her small joke. Although, Alex noticed they didn't head for Claudia's car.<br>\r\n<br>\r\n\"Are we not driving there?\"<br>\r\n<br>\r\n\"Nah, it's not too far. I figured it'd be more economical to walk.\" A moment of silence.<br>\r\n<br>\r\n\"Where exactly are we eating? You never told me.\"<br>\r\n<br>\r\n\"You'll see.\"</span></div></div>",
            "created":1492923600,
            "id":2309773,
            "title":"Sweater Weather"
        },
        "1553321121":{
            "author_id":"casualcritic",
            "author_name":"CasualCritic",
            "choices":[
                "There's always room for dessert",
                "That's enough for one sitting"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, there's our destination.\" Claudia hadn't been kidding when she said their destination was a short walk away, just three blocks down from where they lived. Though Claudia handled those three blocks a lot more gracefully than Alex did, who felt a tad flush in the face and was breathing harder than when she started. What she hadn't prepared for was seeing they were visiting Bin 201, a rather up-to-do and pricey establishment favored with good reviews.<br>\r\n<br>\r\n\"Bin 201?! Why didn't you tell me? Isn't this place super expensive? Ohhh, and I'm not even dressed for the occasion.\"<br>\r\n<br>\r\n\"You look fine, Alex. And don't worry about the price, I'll foot your tab. You worry too much! There's nothing wrong with a little fine dining among friends. It's not like we're making a habit of eating here.\" The pair walked into the lobby area and were soon escorted to their dining quarters. She noted it was booth seating.<br>\r\n<br>\r\nJared turned out to be a Siamese cat of some regard. He was thin, wiry, and introduced himself as a starving artist of the film variety. Why a man described as starving was bothering to eat here rankled her sense of budgeting, but he was amicable and quick to laugh. Jean was a jackal with a roguish, toothy grin and a drawling voice. She actually boasted a larger bust than Alex, but the raccoon was otherwise bigger than her, especially in the rear department. Judging from her admittedly gorgeous cocktail dress and perfect teeth, she was the one who suggested this place.<br>\r\n<br>\r\nClaudia introduced them in her typical fashion of snarky remarks that still sounded cordial. On second thought, seeing as Claudia was wearing a nice skirt, and she never wore skirts, maybe she should've seen their dining choice coming. Alex 'eeped' and waved to them meekly while letting Claudia handle the introductions.<br>\r\n<br>\r\nThey all seated themselves and Alex somehow find herself cooped up in the corner. Menus were passed around. There was a lot of good stuff available and the raccoon's grumbling tummy was not helping matters. In the end, she decided that since most expensive diners had small portion sizes, she'd choose two: fish and fowl.<br>\r\n<br>\r\n\"So you're the famed Alexandria. Do you prefer Alexandria or Alex?\"<br>\r\n<br>\r\n\"Alex.\" She actually preferred Alexandria for people she wasn't familiar with.<br>\r\n<br>\r\n\"Dahling, you look simply adoooohable in that outfit. Where on Earth did you find that top?\"<br>\r\n<br>\r\n\"I'm not sure.\" Ross and she found it on clearance.<br>\r\n<br>\r\n\"Claudia says you two share a dorm. What are you going for?\"<br>\r\n<br>\r\n\"A degree.\" History with a minor in Western literature.<br>\r\n<br>\r\nTheir food arrived and Alex was pleasantly surprised to find they actually offered reasonable portions. Her fish was served with two pieces each larger than her hand and a heaping bed of rice. Her pheasant contained two thighs, two wings, and a serving of mashed potatoes requiring an entirely different bowl. She clapped excitedly at her good fortune. Claudia went with a salad dish and Jared must've ordered an appetizer. Jean had something she couldn't pronounce and was the only one to get an alcoholic beverage.<br>\r\n<br>\r\nThe chubby raccoon was glad to eat her meal in piece and her dining partners didn't ask her as many questions while she was eating. This allowed her to listen to, and actually enjoy, the conversation at hand while only needing to nod yes or shake her head no. Several of them asked if she needed help eating everything but while she allowed samples, she wouldn't let them take a plate. Despite having factually more food than everyone else, she still finished ahead of everyone and felt quite sated. She barely noticed her stomach now rested comfortably in her lap.</span></div></div>",
            "created":1492923600,
            "id":2309822,
            "title":"Uptown Fill You Up"
        },
        "15533211212":{
            "author_id":"casualcritic",
            "author_name":"CasualCritic",
            "choices":[
                "One good night's sleep later....",
                "Obligatory dream sequence option "
            ],
            "content":"<div class=\"\"><div> <span>\"Well, it was a pleashah meeting you fahnally, Alex. You live up to ya reputation.\"<br>\r\n<br>\r\n\"Indeed, perhaps we'll see each other around campus, hmm?\" The raccoon nodded her agreement while mulling over some stolen greens from Claudia's dish. She waited for the pair to leave before confiding something with her roommate.<br>\r\n<br>\r\n\"Claudia, could give me a hand?\"<br>\r\n<br>\r\n\"Sure. With what?\" Not wanting to say anything, the masked lady instead elected to try to push herself out of the booth. But her pudgy tummy had already been teasing the table edge before dinner. After essentially two full course meals, it enfolded the edge in a soft embrace. With her midsection pushing against it, Alex couldn't find much to squeeze out of the seat.<br>\r\n<br>\r\nClaudia gave an exasperated sigh, like she half expected this to happen, and grabbed the raccoon paws. With a little pulling, Alex was able to escape the trap. She took a moment to brush some crumbs from her sweater, briefly sending a few ripples down her fluffy body.<br>\r\n<br>\r\nAs they walked home, she briefly considered undoing her pants to let her stomach breathe, but decided such a move would be far too risque. \"Thanks for taking me out, Claudia. I enjoyed it!\"<br>\r\n<br>\r\n\"Really? You seemed awfully quiet most the night. I don't think you ever gave an answer larger than five words.\"<br>\r\n<br>\r\n\"Well you know I'm shy. It takes me some time to open up. It was enough for me to hear you guys converse.\"<br>\r\n<br>\r\n\"Giving you time to stuff your face?\" Claudia not-so-subtly looked down to her friend's bulging belly.<br>\r\n<br>\r\n\"That too. Not everyone can be fit like you.\" The deer chuckled at Alex's blase attitude to her weight.<br>\r\n<br>\r\n\"Fair enough. You do you. Just don't let your appetite get the better of you.\"<br>\r\n<br>\r\n\"You're just jealous you can't indulge yourself without worrying how it'll effect your performance.\"<br>\r\n<br>\r\n\"Says the girl who got stuck in an inner tube.\"<br>\r\n<br>\r\n\"It was part of a bet.\" Having brought up that embarrassing moment from last semester, she let Claudia win this one.<br>\r\n<br>\r\nAfter getting back to the dorm, Alex felt bushed. Walking, socializing, eating a big meal, all that adds up if you aren't used to it. Ready for bed, the stuffed raccoon shed herself of her outerwear, as per usual, and fell to her bed in naught but her lingerie. She was out in the blink of an eye, snuggled up all cozy like in her comforter.</span></div></div>",
            "created":1493160300,
            "id":2310687,
            "title":"That's enough for one sitting"
        },
        "155332112121":{
            "author_id":"casualcritic",
            "author_name":"CasualCritic",
            "choices":[
                "A day on the town sounds dandy.",
                "Home is where the raccon is."
            ],
            "content":"<div class=\"\"><div> <span>Alex's alarm brought her back to the world of the living. She fumbled around for her phone so she could snooze it and was peeved upon having to actually get out of bed to find the bothersome noisemaker.<br>\r\n<br>\r\nSince she was already awake and on her feet, there wasn't much use in getting back in bed. Might as well just start the day. She briefly considered going to their kitchen and popping a few waffles in the microwave. After all, she often went overboard on how many she needed and took extra time to cook them all. And Claudia was gone too, probably in the middle of her morning run. But even knowing she was alone in her dorm, she still didn't feel comfortable waltzing about in her undies. She disrobed before bed knowing that there wouldn't be much skin showing while beneath the blankets and there was a reason she got dressed in the bathroom, away from the judgemental stare of her dorm-mate. So a shower first it was!<br>\r\n<br>\r\nAfter about 40 minutes, a particularly poofed out Alexandria emerged from the bathroom with a towel wrapped about herself. You might think this is because she enjoys long showers but as she is sure to explain, it's more because being covered in fur requires a significant amount of time to dry. She paid especially good attention to her tail.<br>\r\n<br>\r\nHer phone said today was going to be a warm one so the forecast called for her beige shorts... and a sweater. The lighter one, with the zigzagging pink and white stripes. Though her shorts were hugging her rear quite tightly today. And she was having such trouble with her bra as to take it down a notch. She'd have to find time to visit the store. But luckily, sweaters rarely judged you for what you did last night.<br>\r\n<br>\r\nWandering into what they classified as the kitchen, Alex grabbed the box of waffles from her mini-fridge and shoved nine of them into the toaster oven. The box didn't say how long to cook that many, but she'd done this enough to know what they needed.<br>\r\n<br>\r\nWhile her breakfast heated up, she finally had a chance to properly check her phone. No classes today, so she had some free time. Claudia had texted her about a pool party she was required to attend. She wanted to snap back a reply detailing the reasons this was a bad idea, not the least of which she wasn't comfortable wearing bathing suits in front of strangers, but instead went with a beleaguered \"Fine.\"<br>\r\n<br>\r\nBut that wasn't until this evening. Right now, her biggest concern was how to tackle this afternoon. She could go out on the town, maybe get some shopping done. There was all sorts of things a women with a disposable income could do. But just lounging at home had its own promise. Just her, a book, and several stacks of snacks. Light eating for light reading, as she called it.</span></div></div>",
            "created":1493235900,
            "id":2311172,
            "title":"One good night's sleep later...."
        },
        "1553322":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "Yeah!",
                "Nah."
            ],
            "content":"<div class=\"\"><div> <span>Name: Tabitha (Tabby) Reed<br>\r\nSpecies: House cat<br>\r\nAge: 21<br>\r\nHeight: 10 ft<br>\r\nWeight: 3000 lbs<br>\r\nDescription: The daughter of a rich entrepreneur, Tabitha is a very large, very spoiled cat who gets everything she asks for, and despite being spoiled, Tabitha is still a sweet girl. Fat accumulates pretty evenly across her body, but her belly gains slightly more than the rest of her. Tabitha usually wears a pink t-shirt and white mini-skirt.</span></div></div>",
            "created":1431838800,
            "id":1979655,
            "title":"How about a big cat."
        },
        "15533221":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to be in the story?</span></div></span></div>",
            "created":1432011600,
            "id":1980434,
            "title":"One thing first"
        },
        "15533222":{
            "author_id":"greececatz",
            "author_name":"Greece Catz",
            "choices":[
                "Let's fatten up the big guns! ",
                "More characters please, "
            ],
            "content":"<div class=\"\"><div> <span>Bertha \"Tyke\" Lokwarm<br>\r\nSpecies: Brown Bear<br>\r\nHabitat: Forest<br>\r\nWeight: 3500lbs <br>\r\nDescription: Very round in all areas (especially her rear), she has a large family that consists of five other bears not including her, she is the youngest and weighs the least out of anyone in her family. Her parents are very nice, jolly bears who care for all their children equally. Bertha is not neglected. She's a nice southern gal with a big appetite. She wears a short skirt with daisies on it, which hardly covers her large rump, her shirt appears to be the only one she owns since her family is very poor, it is too small for her and partially covers her breasts. Despite being poor, everyone in the forest looks up to her family since they are bears. They look up to them in fear, but all of them are very nice. <br>\r\nPersonality: One of the nicest bears you'll meet, but she is not naive or innocent. She has a heart of gold. When provoked she keeps quiet and silently harms the animal who provoked her. Be warned: she has a bit of a temper. She will do anything for her family. And that may include getting morbidly obese. <br>\r\nFlaws: Loud, Hot-headed, sometimes too nice, big appetite, somewhat feared by all creatures in the forest, lonely. <br>\r\n</span></div></div>",
            "created":1454389200,
            "id":2098388,
            "title":"Nah."
        },
        "155332221":{
            "author_id":"greececatz",
            "author_name":"Greece Catz",
            "choices":[
                "She's sick of being called \"Tyke\" so she tries to become fatter than her family",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her age is also 19 years old. <br>\r\n<br>\r\n<br>\r\nNow, how does she get fat? </span></div></span></div>",
            "created":1454389200,
            "id":2098401,
            "title":"Let's fatten up the big guns! "
        },
        "1553322212":{
            "author_id":"greececatz",
            "author_name":"Greece Catz",
            "choices":[
                "A witch comes by and curses her? ",
                "Nope, next! "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this? </span></div></span></div>",
            "created":1454389200,
            "id":2098402,
            "title":"Other"
        },
        "155332222":{
            "choices":[
                "Follow this character.",
                "Give me someone else."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/cat2.png\" alt=\"*Cat2*\" title=\"Cat2\" border=\"0\" width=\"15\" height=\"15\"> <span class=\"cindigo\"><b>Kacey Dionec</b></span><br>\r\n──────────<br>\r\n<b>Species:</b> Black Cat<br>\r\n<b>Age:</b> 22<br>\r\n<b>Height:</b> 6'2\"<br>\r\n<b>Weight:</b> 280 lb<br>\r\n<b>Description:</b> Currently unemployed. Addictive personality. Quite chubby, and insecure about her weight. G-cup breasts and a bubble butt.</div></span></div></div>",
            "created":1477285200,
            "id":2227620,
            "title":"Maybe her?"
        },
        "1553322221":{
            "choices":[
                "The Mall",
                "The Lake"
            ],
            "content":"<div class=\"\"><div> <span>Something things in life are just plain hard.<br>\r\n<br>\r\nFinding a half-decent, secure job in a small, remote town is hard. Being the only cat in an all-rodent community is hard. Losing weight is especially hard, at least for me.<br>\r\n<br>\r\nBut I’m no stranger to hard work. And after all, I have my ways of ‘coping’.<br>\r\n<br>\r\nIt used to be drinking, but I quit that at rehab. But just my luck, the second I dropped one habit, I picked up another. No rest for the wicked, I guess. So what do I do when I get stressed nowadays? You guessed it -- I eat. I eat a lot.<br>\r\n<br>\r\nAnd I have quite a few things to be stressed about. For example, the crappy studio apartment I live in was designed for someone half my height, so I have to constantly duck down to avoid smashing my head against the ceiling.<br>\r\n<br>\r\nCurrently, I was scowling at my own naked body with disgust in the mirror (basically part of my morning routine now). <span class=\"cindigo\"><b>“Hey, come on. You don’t look too bad. You’re just a bit… curvy,”</b></span> I say to myself, but don’t believe my own words. I doubt anyone would want a girl with a belly like mine. <br>\r\n<br>\r\nThings used to be different. I used to be slim and sexy, with a perfect hour glass figure. Men and women alike used to admire and/or envy my body as I passed, but now, they hardly give me the time of day.<br>\r\n<br>\r\nI get dressed, stretching on a t-shirt that doesn’t even completely cover my belly anymore, and pants that struggle to contain my thick thighs. At this rate, I’ll have to buy an entirely new wardrobe. I shudder at the very thought of how much that must cost. I already blow enough money on food these days. As I put on more and more pounds, I can’t help but feel I’m digging myself into a deeper and deeper hole, physically and financially.<br>\r\n<br>\r\nImmediately upon getting ready, I rush to the apartment complex’s gym before anyone else got there. I like to have the whole gym to myself, you see. Exercising in front of anyone else makes me feel self-conscious.<br>\r\n<br>\r\nTo my dismay, my downstairs neighbors was at the gym, but luckily, she seemed like she was wrapping up. I pretend to do warm-up while I wait for her to leave, but just as I was getting comfortable, I felt someone tugging at the base of my shirt.<br>\r\n<br>\r\nI look down, to find a curious little mouse boy looking up at me. Ah! This must be my neighbor’s son. I was used to being taller than my neighbors, as mouse people were roughly around 3 feet tall on average, but this kid was around half of even that height. Thus, I was about for times as tall as the boy was, and towered over him like a mountain.<br>\r\n<br>\r\nI almost found the scrawny little mouse cute, until he started laughing. <span class=\"clgrey\">“Haha! Wow, lady! You’re really fat!”</span> he laughed, and I cringed. Was I really that overweight?<br>\r\n<br>\r\nI stared at his mother, expecting her to step in, but apparently, she wasn’t paying any attention. <b><span class=\"cindigo\">“Gee, thanks, kid. I really needed to hear that today,”</span></b> I say sarcastically with a roll of my eyes, before walking over to the other side of the gym, trying to put some distance between me and him. Unfortunately, he doesn’t seem to get the message, and follows me.<br>\r\n<br>\r\n<span class=\"clgrey\">“How did you even get so big, lady?”</span> he pestered me, following me across the gym. When I reach a dead end, I sigh, turning to face him. Normally, I would get angry at this point, but he was just a kid. He was probably just curious.<br>\r\n<br>\r\n<span class=\"cindigo\"><b>“You shouldn’t ask people about their weight, young man,”</b></span> I lecture the tiny mouse in the most assertive voice I could muster. <span class=\"cindigo\"><b>“It’s not polite.”</b></span><br>\r\n<br>\r\nHe stares at me for a second, before smirking. <span class=\"clgrey\">“Why should I care? You’re just a fatty,”</span> he mocks me, with the worst smug smile on his face. Alright, now I’m mad!<br>\r\n<br>\r\n<span class=\"cindigo\"><b>“Why, you-”</b></span> I start to growl angrily.<br>\r\n<br>\r\n<span class=\"cbrown\">“Kyle! It’s time to go!”</span> his mother calls from across the gym, interrupting me before I could launch into my angry tirade. He stuck his tongue out at me, before darting off, leaving before I could get out another word. I was left to silently fume with anger, but I decided to just push the whole incident out of my mind and not let it ruin my work-out.<br>\r\n<br>\r\nI didn’t know much about exercising, but I figured as long as I was burning calories, I was making some progress, right? Well, I ran into a few problems. First off, the equipment at this gym was designed for mice, and was way too small for me to use effectively.<br>\r\n<br>\r\nBut the other problem seems to be physical. No matter what I do, I seem to be completely unable to really lose any weight. Every pound I gain seems to be here to stay. Maybe I just have a bad metabolism? Either way, after putting myself through the most strenuous routine I could manage, I still hadn’t made any progress.<br>\r\n<br>\r\nI emerged from the gym about three hours later, panting from exhaustion. I use up the last of my energy to stumble back to my apartment and crash on my bed. These trips to the gym seemed to be agonizing and completely ineffective… but I had to do something. I wasn’t going down without a fight!<br>\r\n<br>\r\nThe worst part is, though, that all that work only made me even hungrier. I clutched my big belly as it growled loudly, whimpering at the feeling of starvation. I certainly wasn’t hungry for health food, either -- I was hungry for something sweet. I tried to resist the siren’s call of the cookies in my pantry, but my willpower, unfortunately, is extremely weak.<br>\r\n<br>\r\nI relent, unable to control myself. I grab the cookies, futilely resolving to only have a few… but the second I look down upon them, and that delicious smell hits my nose, I’m gripped with a pure, uncontrollable desire. That was another one of my problems, in fact; whenever I get my hands on something tasty, I literally can’t help myself.<br>\r\n<br>\r\nI start chomping down on the cookies, taking my time at first, but gradually becoming more and more eager, until I was literally swallowing them whole one-by-one. I knew I would regret this later, but… they just taste so good! I was hardly in control of my body, at this point. I was running on auto-pilot, in a moment of pure indulgence.<br>\r\n<br>\r\nThe next few moments are a blur. All I can recall is the sweets disappearing down my gullet in waves, and the delicious taste relaxing and making me, if only for a moment, forget all my problems. Soon, I reached to grab some more cookies, only to discover I had cleared out the entire sleeve!<br>\r\n<br>\r\nStill unsatisfied, I threw the emptied packet aside, digging through my pantry for more junk food to calm my burning stomach. It seemed like, with every passing day, my gluttony was only growing stronger and more uncontrollable.<br>\r\n<br>\r\nOnly once I had cleared the entire pantry of snacks did my feast come to a stop. I laid on the bed again, wrapping my hands around my belly in awe, which was now filled with junk food. I should probably feel regretful right now, but honestly, I just feel content. Having a big, full stomach was incredibly relaxing to me.<br>\r\n<br>\r\nI lay there for a while, enjoying the feeling of my own hands massaging my achingly full stomach. Man, what has come over me recently? I’ve just been in a nosedive lately, health-wise. I’d work with a personal trainer of something, but I’m not sure I have the money to spare. At this point, though, I’m seriously considering it.<br>\r\n<br>\r\nI watched television for a while, ruminating on my situation. As I said, I was the only cat in an all-rodent town, so everyone was around half my height and at least moderately afraid of me. Thus, I didn’t really have many friends in town, which got a little lonely sometimes. Well, all the time, actually.<br>\r\n<br>\r\nJust as I was about to doze off, my phone started to ring loudly. I groaned, grabbing it and seeing it’s from a friend from my old town -- a cougar named Elly.<br>\r\n<br>\r\n<span class=\"cindigo\"><b>“Hey, Elly,”</b></span> I greet nervously, trying to sound natural.<br>\r\n<br>\r\n<span class=\"ctan\">“Hey, Kacey! I’ve been trying to call you for a while now,”</span> she greets, with her typical giddy tone of voice. I envy her enthusiasm, now more than ever. <span class=\"ctan\">“It’s been so long since I’ve heard from you. I’ve just been dying to see how your new life has been going!”</span><br>\r\n<br>\r\n<span class=\"cindigo\"><b>“Umm… it’s going great,”</b></span> I lie.<br>\r\n<br>\r\n<span class=\"ctan\">“Really, now?”</span> she says, a little speculatively. <span class=\"ctan\">“I read that that store you’ve been working at went belly-up recently. So you’re probably out of a job now, right?”</span> I sighed. Apparently news travels quickly. I used to have a pretty decent manager job downtown until the company closed the store down and threw me out on my big, round butt.<br>\r\n<br>\r\n<span class=\"cindigo\"><b>“Yeah, but I’m not going to let that slow me down,”</b></span> I groan, through gritted teeth. <span class=\"cindigo\"><b>“You know me. A real go-getter.”</b></span><br>\r\n<br>\r\n<span class=\"ctan\">“That’s my girl! Glad to hear you’re doing well,”</span> she replies. <span class=\"ctan\">“How’s the town, by the way? Your sis showed me some pictures of it, and it looks absolutely beautiful.”</span><br>\r\n<br>\r\n<span class=\"cindigo\"><b>“Oh, that’s for sure, at least,”</b></span> I admit. The scenery around here, up in the mountains perched right over an exquisite blue lake, was breathtaking. <span class=\"cindigo\"><b>“It’s been a little, uh… awkward settling in, though. You know how mice are around cats.”</b></span><br>\r\n<br>\r\n<span class=\"ctan\">“Oh, do I ever! A mighty timid lot, they are,”</span> she laughs. <span class=\"ctan\">“But they’ll always warm up to you if you give them the chance. You just have to get out a little more, that’s all.”</span><br>\r\n<br>\r\n<i>Get out more.</i> For some reason, that line struck me. I <i>do</i> need to get out more. Lounging around this apartment all day every day has been driving me a little nutty. But where could I go?</span></div></div>",
            "created":1477285200,
            "id":2227624,
            "title":"Mundane Monday"
        },
        "1553322222":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Lyra",
                "Megan",
                "Another choice chapter, please"
            ],
            "content":"<div class=\"\"><div> <span>Name: Lyra Greyson<br>\r\nSpecies: Holstein Friesian cow<br>\r\nAge: 24<br>\r\nHeight: 7 feet 8 inches<br>\r\nWeight: 275 pounds<br>\r\nDescription: A happy go lucky and confident bovine woman, Lyra also possesses a will of iron when the situation demands. She has recently put on a bit of weight, but this has mostly only enhanced her already exaggerated hourglass figure.<br>\r\n<br>\r\nName: Megan Thompson<br>\r\nSpecies: Arctic wolf<br>\r\nAge: 26<br>\r\nHeight: 4 feet 11 inches<br>\r\nWeight: 286 pounds<br>\r\nDescription: Sullen but fiery, Megan is a struggling artist who hasn’t been able to find her muse. She has always been heavy for her age, especially considering her height, and the recent bouts of comfort eating hasn’t been helping.</span></div></div>",
            "created":1478408400,
            "id":2233661,
            "title":"How about these?"
        },
        "15533222221":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "He is a big and well built wolf.",
                "She is a tall and fat dragon vixen.",
                "Lyra’s date is someone else."
            ],
            "content":"<div class=\"\"><div> <span>Lyra flopped back onto her bed, her short black and white fur still glistening from the shower…as well as the sweat she worked up therein. Just a short while ago, she had returned home after a lovely night out on a date, her stomach still pushed out a bit from everything she had eaten. She didn’t normally eat as she had been—both tonight and over the past while, but things had been going so well for the bovine lass that she didn’t see the harm in splurging a bit. The bit of weight she had put on didn’t bother her either, especially with how nicely it added to her already large breasts and butt.<br>\r\n<br>\r\nA quick glance down showed the large white mounds of her bust rising proudly over her body, capped with pink nipples teasing out of the short fur and growing stiffer as a cool breeze teased them. She had to prop up on her arms to see over them, and that still only provided a slight view, but it was enough for her to see her belly beyond, a slight layer of pudge softening her midsection. Sitting up fully, her curtain of long deep red wavy hair fell forward, partially obscuring her view, but still allowing enough for her to see her well rounded hips. Lyra was also well aware of her seam straining rump providing a nice soft seat.<br>\r\n<br>\r\nBrushing her hair back, she looked up and traced the trail of clothes – two sets of clothes in fact – leading from her bedroom door to the bathroom door. A smile came to her face as she remembered the trail starting at the front door, hands roaming bodies, lips pressed against each other, tongues intertwining. Her date tonight had gone very well, even resulting in some after dinner fun back at her place. The shower had been first up, but Lyra hoped that there might be an encore performance as well. Almost as if on cue, Lyra heard the vent in the bathroom shut off, followed by the lights and the door opening. Out stepped her date, just as naked as she was and just slightly dryer.</span></div></div>",
            "created":1478408400,
            "id":2233757,
            "title":"A night gone well"
        },
        "155332222212":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "…still sleeping next to and atop her.",
                "…already making up a late breakfast.",
                "…gone."
            ],
            "content":"<div class=\"\"><div> <span>Immense, that was the first word that popped into Lyra’s mind when she first saw Isabella, and that description still held true, in fact it was even more so now than when the bovine had first laid eyes on the dragon vixen—draxen. Standing just over eight feet and five inches tall, Isabella towered over most anyone, Lyra included. She was also extremely wide, fat swelling her body in all directions. Giant jiggling breasts, a massive mound of a stomach, huge hips, there wasn’t a part of Isabella that wasn’t so swollen with fat that the slightest motion would send her wobbling for minutes if not longer. Her hybrid heritage also lent her an exotic air, and her body was covered in thick black and grey fur mixed with bands and patches of onyx scales. She also possessed such incredible confidence that Lyra was even a bit jealous.<br>\r\n<br>\r\n“It’s nice to be appreciated sometimes,” Isabella –Izzy for short – said with a sultry purr, exaggerating her slight Spanish accent. “But don’t you know that staring can be considered rude?”<br>\r\n<br>\r\nIzzy added a sashay to her walk, sending further ripples throughout her huge body, as she stepped up in front of Lyra. Still seated on the bed, the relatively smaller bovine was nearly completely lost in the shadow of the much larger woman standing over her.<br>\r\n<br>\r\n“Well, you are a very impressive woman after all, so it’s hard not to stare” Lyra said, similarly exaggerating her southern drawl.<br>\r\n<br>\r\n“Hmm…don’t I know that,” Izzy said with a slight grin curling her lips, barely visible to Lyra because of the swell of the dragon vixen’s bust.<br>\r\n<br>\r\nIsabella’s hands then roamed her body, or at least what they could, poking and prodding, wiggling and jiggling, and grabbing and lifting as they went. Before she was even done playing around with herself, she took another step forward, then another, and another, till Lyra was being swamped by the flesh of the massive draxen. Izzy still kept moving, and then proceeded to lean over, falling onto the bed and Lyra, though for Lyra, it was less a fall and more an onrushing avalanche of dark furred fat. The smaller woman was completely buried under Izzy, faced with a bit of a struggle to breathe, but she couldn’t stop it, nor would she if she could. With enough squirming around, Lyra managed to get her face partially into the vast canyon that was the larger woman’s cleavage, which allowed her to almost get enough air to breath. Izzy laughed a bit at feeling Lyra’s movements beneath her, though it was more something that the cow felt rather than heard because of her situation.<br>\r\n<br>\r\nThen, without warning, Isabella reached under and took a hold of Lyra before slowly rolling around, so that their positions ended up reversed: Lyra atop Isabella, though it was far easier for the smaller of the two like that. As much as Lyra enjoyed the feeling of being crushed by so much woman, it did make things difficult for her. Things like the multiple rounds of lovemaking that kept the two of them awake for much of the night, the unfortunate bed creaking and groaning under the immense load and even larger forces it was subjected to. When the sun was just starting to tint the sky over the horizon, both women were completely spent, and so they finally curled up and went to sleep, Lyra bundled up against the bulk of Isabella’s body.<br>\r\n<br>\r\nWhen Lyra finally awoke past noon, she found Isabella was…</span></div></div>",
            "created":1478494800,
            "id":2233878,
            "title":"A big night"
        },
        "1553322222121":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Lyra and Isabella finish everything and a bit more.",
                "Lyra and Isabella have some fun with their meal.",
                "Isabella turns the tables on Lyra and has some fun of her own."
            ],
            "content":"<div class=\"\"><div> <span>Lyra woke up warm, though with half of her body buried in Izzy’s fat, that wasn’t too surprising. She snuggled back down, ready to go back to sleep for a bit longer. That didn’t work out so well as a loud growl drowned out the soothing noise of Isabella breathing slow and low, and caused Lyra to pop back up. When it happened again, she realized that Isabella was hungry, and her stomach was expressing it’s unhappiness with that situation even though she was still sleeping. Regretfully, Lyra detangled from the covers as well as Izzy’s rolls of fat, feeling the cool air settle on her body, chilling her skin even through her fur. She started to walk off, but quickly turned on her heel and leaned over the hills and valleys of Izzy’s body to give her a quick peck on the cheek and brush a lock of her blue hair out of her face; even asleep the draxen responded slightly, a smile curling the edges of her lips. That little enjoyable task finished, Lyra turned around again and grabbed a robe before heading out of the room, pulling the robe on as she went. Her hands traced her curves, feeling how the heavy meal she had the night before had added just a bit to her frame: a little bit larger bust that caused the robe to hang a bit further out, same with her butt hiking the already high-cut rear a bit higher, and a little bit more weight to her stomach in the shadow of her breasts.<br>\r\n<br>\r\nAs Lyra walked through the spacious penthouse apartment with tall and wide windows affording a view of the city bustling far below, she reflected on how much she enjoyed the time spent with Isabella since she had asked the smaller woman to come live with her. The perk of being able to have Isabella all to herself was a nice one, almost as nice as the perk of also being involved with adding even more luscious fat onto the tremendous draxen. Lyra stopped in the living room, propping her arms on the back of one of the couches, looking out through the floor to ceiling window that dominated the far wall and provided a wonderful view of the ocean at one side and the local mountains at the other.<br>\r\n<br>\r\nIt still impressed Lyra about the contrast that Isabella provided; she worked in what basically amounted to a strip club, a very classy one that featured only people pushing the high end of the scale, but a strip club nonetheless. Despite that, Isabella was smart and extremely wealthy; a combination of a big inheritance and astute investing meant that Isabella never actually had to work a day in her life. She still chose to sometimes appear in that club though; she enjoyed and even craved the attention she got there, they lusty and envious gazes that she got from almost everyone who showed up at the club.<br>\r\n<br>\r\nThat was where the two of them met actually: Isabella was an infrequent act at the club, but still the headline act, while Lyra had only heard about the club third hand and had barely been able to work up the nerve to actually go. Even after she arrived, her confidence was about to fail her till the lights dimmed and the massive bulk of the draxen swept down the stage packed into tight fitting clothes. Something about the shifting fat, the shimmering fur, and the grace and confidence in every movement made Lyra sit back down and watch the show, watch pieces of Isabella’s outfit slowly, tantalizingly slip off of her body, revealing more and more flesh and being flung either onto the stage or even out into the audience. The bovine had been getting hot and bothered already, but when the draxen finished taking everything off, she leapt up onto the center stage pole, locked her legs up high and leaned back till she was hanging upside down, her body rapidly flowing according to gravity’s whims. That almost proved too much for Lyra, but she still surprised herself when she managed to persuade someone to let her slip backstage to meet the incredible woman that had captivated her attention.<br>\r\n<br>\r\nIsabella was apparently impressed as well and really shocked Lyra by asking the smaller woman out. Their relationship blossomed from there, till eventually Izzy asked Lyra to move in with her. Lyra had been ecstatic, and still was too; being with such gourmand gave Lyra’s culinary talents such a workout, talents she had acquired from both her mother and father and that she was only too happy to put to such good use. Last night had just been a fun night out for the two of them, time for both to enjoy without needing to worry about the making or cleaning up of the meal, or in the case of Izzy meals, she packed away quite a bit.<br>\r\n<br>\r\nReminiscing wasn’t going to feed Izzy today though, so Lyra turned away from the panoramic view and made for the kitchen. Once there, she set an even more rapid pace, dashing to and fro making use of everything in the well-appointed kitchen. Her robe fluttered as she prepared platter after platter of food, veritable heaps of it, mostly to fill the ravenous maw of Izzy, with some left for herself. When she hit a bit of a lull, she leaned back on the center island, while still keeping an eye on everything. A hand strayed a bit of its own volition, coming to rest against her pudgy belly. Again, she thought about the weight she had been putting on, how it had been adding onto her already impressive hourglass figure, as well as adding a bit of extra width to the middle of that hourglass. Izzy certainly didn’t seem to mind, she actually seemed to prefer Lyra’s extra padding, as well as tempting her with a bit of extra food here and there. The southern lady also enjoyed eating and was coming around to the feeling of her belly nice and full and maybe even a bit overfull, sometimes even quite a bit overfull if Izzy had anything to do with it. The smells of everything she was cooking was already making her drool a bit, both from the implied taste as well as the thought of every morsel packed away within both of their bodies.<br>\r\n<br>\r\nLyra was just finishing up with dishing everything up when she heard the bed creaking in a very recognizable way. Immediately after, she could also hear the steady thumping of a great mass ponderously making its way through the house. Lyra quickened her pace, taking multiple trips back and forth till the table was almost groaning under the feast laid out atop it, and yet there still wasn’t enough room, some had to be left covered and waiting on the island in the kitchen. As she finished placing down the last platter of bacon – and wiped up a bit of a spill – Lyra felt and heard Izzy come up behind her; the thumping stopped and she was well aware of the wall of softness pressing against her back. Without looking back, Lyra dropped one of her hands and groped part of the lowest swell of Izzy’s stomach, feeling the fat squish between her fingers and bringing a pleased rumble to the draxen’s throat. Releasing her grasp, Lyra then motioned for Izzy to take a seat before doing so herself: Izzy in her specially reinforced chair – which still obviously strained and groaned under the woman lowering herself on the piece of furniture – while Lyra took a seat beside her. Izzy then showed some incredible restraint, holding back despite the clear hunger that was being stirred in her by the sights and smells of the food, and let Lyra get her portion first, since there wasn’t like to be much of a chance of that once Isabella got started herself. With Lyra done, Izzy dug in with wild abandon, but definitely not like a slob, as despite her speed and gusto she made sure that every morsel made its way into her mouth.</span></div></div>",
            "created":1478581200,
            "id":2234288,
            "title":"Good times"
        },
        "15533222221213":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "It does, very frequently, as does Lyra needing to get new clothes.",
                "It does, occasionally, but often enough to have an impact on Lyra.",
                "It doesn’t, Isabella had her fun, and they return their focus to the draxen."
            ],
            "content":"<div class=\"\"><div> <span>Lyra soon finished her portion, while Isabella was still going strong. The bovine waited a while, savoring the view of the draxen stuffing herself with such enthusiasm, but eventually figured that she should bring the rest of the food out. Clearing away some of the already cleaned plates, she soon returned with the remaining platters. When she returned, Lyra saw that Izzy was just about finished with the larger first portion, but had slowed down. Lyra found this somewhat odd, and was more surprised by the predatory gleam in Izzy’s eyes. The larger woman motioned for Lyra to take her seat again, and she figured that Izzy must have wanted to be fed by her or something, which was a reasonably common occurrence, but Lyra soon found that Izzy had something else in mind.<br>\r\n<br>\r\nOnce Lyra was seated, Isabella shifted around – her chair groaning the whole way – so that the two of them were facing each other. Izzy’s fleshy stomach and breasts flowed over the smaller woman, pinning her in place yet again. The look on Izzy’s face and the way she kept licking her lips started to concern Lyra, making her wonder if Izzy was going to eat her like she had occasionally done to some other people, especially those that went to the club and never returned, except as further padding on her body. Lyra was somewhat relieved when Isabella picked up a serving spoon, loaded it down with a small mound of food, and held it in front of the smaller woman’s mouth.<br>\r\n<br>\r\n“You’ve been doing well so far, my pet, but I think we can do better, so you’re going to eat everything I give you, right?” Izzy asked, but the tone in her voice left no doubt that it was a command, rather than a question.<br>\r\n<br>\r\nLyra saw little choice but to nod her head slightly and open her mouth wide. What followed was unlike anything the smaller woman had ever personally experienced before: Isabella used Lyra like a food balloon, stuffing her with ever last remaining bit of food. The two of them almost became a machine with Izzy scooping up the food, and Lyra dutifully opening her mouth and eating every bit. The remaining bit was more than two to three times what Lyra ate in an average day, and yet Izzy was making sure that the bovine was eating every bit in one sitting. Lyra’s eyes glazed over not even halfway through being fed everything and a portion of her mind that was still functioning kept thinking that she would explode with the next bite, but it never came.<br>\r\n<br>\r\nIzzy kept praising Lyra for doing such a good job, as well as saying that they only had a bit more to go, and tenderly lightly caressed and rubbed the smaller woman. Lyra’s stomach continued to balloon further and further, and her hide creaked and groaned, the sounds mingling with her moaning as more and more food was shoved into her mouth, adding to the lump in her stomach. After giving Lyra the last spoonful, Izzy tenderly kissed the bovine on the nose, before prodding the rock hard mass of her stomach. Some part of Lyra’s mind registered that it wasn’t exactly painful, but it also wasn’t very comfortable either. Trying to say so only resulted in a massive belch that rocked her in her seat and caused her stomach to clench around the hard ball of food. She must have blacked out for a bit because the next thing Lyra knew, she was laying down in the living room on one of the sofas, with her head resting against the pillowy fat of Izzy’s stomach, and the TV droning.<br>\r\n<br>\r\nLyra’s mind felt foggy and unresponsive, almost as unresponsive as the rest of her body. She managed to look down just slightly, but it was enough to see her stomach rising over her, even higher than her breasts, quite a new development for the bovine considering the impressive size of her bust. She was distracted when a handful of chips were shoved into her mouth.<br>\r\n<br>\r\n“Don’t think we’re done here, dear. I’m going to make sure to take full advantage of this,” Isabella purred as she pressed another handful of chips into Lyra’s mouth.<br>\r\n<br>\r\nIzzy kept Lyra stuffed the whole day; snacks for the most part, but dinner of several different take out places packed so much food into Lyra’s stomach that by the time the two of them retired to bed, the smaller woman was completely pinned in place by the groaning mass of her stomach. It looked like she had a beach ball in her body, but the weight of it was more like a supersized medicine ball. The draxen seemed very pleased with herself, a near constant rumble in the back of her throat that tickled Lyra’s ear as they lay together on the bed. Lyra couldn’t do much of anything, barely able to gasp for breath, and unable to move because of her stomach and the shock of how much she had eaten throughout the day. Izzy didn’t seem to mind though, perfectly content to enjoy the look on Lyra’s face and the rock hard boulder of her stomach. As they drifted off to sleep together, one thought kept popping up in Lyra’s mind: was this going to be happening again?</span></div></div>",
            "created":1479186000,
            "id":2237366,
            "title":"Feeding time"
        },
        "15533222223":{
            "author_id":"cynderfan",
            "author_name":"Fan of Spyro",
            "choices":[
                "Cierra",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Name: Cierra Alaan<br>\r\nSpecies: an ironic cheetah/zebra mix<br>\r\nAge: 30<br>\r\nHeight: 5'6\" (about 1.68 meters)<br>\r\nWeight:  350 pounds (about 158.76 kg)<br>\r\nBust size: double F cups<br>\r\nBackground: always lazy, and constantly eating, Cierra had always wanted to be larger. A lot larger even. Her eating habits were passed down from generations of heavy furs, on both sides. The heavier they were, the healthier their kids came to be, with Cierra'a health being a feat of nature.</span></div></div>",
            "created":1479013200,
            "id":2236329,
            "title":"Another choice chapter, please"
        },
        "155332222232":{
            "author_id":"the_1st_wing",
            "author_name":"the lightning walker",
            "choices":[
                "I'll take the sneaky kitty!",
                "Next!"
            ],
            "content":"<div class=\"\"><div> <span>Name: Tariza Bentlif<br>\r\nSpecies: Siamese Cat<br>\r\nAge: 23<br>\r\nHeight: 5' (1.52 meters)<br>\r\nWeight: 175 lbs (about 79.38 kg)<br>\r\nDescription: Sly but cutesy, Tariza used to be a straight a student. But that all came crashing down when she was kicked out of college from being caught sneaking snacks out of the teachers lounge. Now, she lives on the outskirts of the city, in an abandoned cottage in a forest. She makes a living by thieving off things and bringing them back for herself. She has garnered an infamy with the cities PD. Mayhaps she gets caught and gets stuffed as punishment? Or maybe she swipes an artifact that causes her to gain?</span></div></div>",
            "created":1574060400,
            "id":2748165,
            "title":"Kleptomani-cat"
        },
        "1553322222322":{
            "author_id":"hedkrakka",
            "author_name":"hedkrakka",
            "choices":[
                "Tiffany Hookbill - Big Snake on Campus",
                "Or perhaps an amphibian?",
                "And now for something completely different"
            ],
            "content":"<div class=\"\"><div> <span>(A/N: I suspect I'm playing a little fast and loose with the Furry part of the title, but oh well :P )<br>\r\n<br>\r\n<b>Choice 1:</b><br>\r\n<br>\r\nName: Tiffany Hookbill<br>\r\nSpecies: Blue Eyed Leucistic Rainbow Boa<br>\r\nAge: 21<br>\r\n<span style=\"text-decoration:line-through\">Height</span> Length: 27 feet<br>\r\nWeight: I'm not stupid enough to ask... (guessing about 500 pounds or so, due to her length)<br>\r\n<br>\r\nAdopted as an egg by a family of ducks, Tiffany always felt a little out of place while growing up. She was the sole ectomorph in a house of endomorphs. She struggled a lot with her family's a/c in the summer. Winter, as you might imagine, was right out. Playing with the other kids presented its own challenges, as her biology meant she could never play as long or as hard as the others. And it was so hard finding someone who just wanted to sun themselves for awhile.<br>\r\n<br>\r\nTiff, as her friends call her, understandably grew up shy and bookish. Despite her first attempt at college ending in failure, after a gap year(s), she's ready to give it another go. Her major is archaeology, and she's always been particularly interested in Ancient Egypt, the largest, greatest and oldest of the serpent realms. She's always dreamed about visiting that ancestoral land, and with her new school offering Summer Abroad courses, it was a very real possibility.<br>\r\n<br>\r\nShe was quite thin when she graduated high school, as her family ate a diet heavy in veggies and insects, and Tiffany couldn't bring herself to eat the bugs. However, she discovered the glory of red meat her first go at college, and unfortunately for her waistline, she ate as frequently as a duck. It was perhaps a good thing that she was only at school for a year, as she managed to pile on over a hundred pounds in very short order, shocking those who knew her both with the scale and rapidity of her gain. She'd attempted to lose weight during her time off from school, if for no other reason then to end her Mom's nagging, but hadn't managed to lose more then a token amount of weight.<br>\r\n<br>\r\nAnd while she's stated numerous times that she'll keep her appetite under control, that may be easier said then done...<br>\r\n<br>\r\n<b>Choice 2:</b><br>\r\n<br>\r\nOr perhaps another choice?</span></div></div>",
            "created":1574310180,
            "id":2749558,
            "title":"Next!"
        },
        "15533222223221":{
            "author_id":"hedkrakka",
            "author_name":"hedkrakka",
            "choices":[
                "Chelsea comes home",
                "Time skip",
                "And now for something completely different"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm home!\" Tiffany announced as she slithered into the house. She received no reply to her call.<br>\r\n<br>\r\n<i>\"Chelsea must still be out,\"</i> she thought as she hung up her coat and purse by the door. <i>\"Good.\"</i><br>\r\n<br>\r\nTiffany had a large paper bag in hand, courtesy of MacGuffin's, a local fast food chain famous for its burgers. Her stomach let out a quiet growl as she made her way to the dining room. <br>\r\n<br>\r\nTiffany and her friend Chelsea were renting this house from her uncle Chuck. It wasn't a very big place, but more then enough for the two young women. There were three bedrooms upstairs, and Chuck had given them the option to sub-rent the third room if they so desired. On the main floor, the front door opened into the small living room. From there, you could go into the kitchen, which in turn branched into the dining room and a pretty impressive bathroom for such a small place. The utility room was also directly off the kitchen, and through the dining room was access to the mud room, which contained a stackable washer/dryer, a deep freeze, and a freestanding pantry.<br>\r\n<br>\r\nThe driveway out front was only large enough for a single car. Chelsea used that, while Tiff parked her vehicle in the garage out back. Granted, the only road access to the building was a dirt backlane, but she seldom drove, taking the bus everywhere. <br>\r\n<br>\r\nAnd if there was one flaw with the house, it was definitely the location. It was a long way from everything - the beach, the campus, the shopping district, everything required a long commute. About the only things that were close were a couple of schools, a handful of churches, and an assortment of fast food joints and steakhouses.<br>\r\n<br>\r\nAnd the smells of the latter had been driving Tiffany just nuts.<br>\r\n<br>\r\nTiff had seen her weight just soar her first year at college, and given she was eating out five times a day, it wasn't too hard to figure out why. She'd always eaten so light at home. No offense intended to her own mother, but she wasn't a very good cook, and the diet of a duck was definitely not one for a snake. The first time she'd eaten one of MacGuffin's double-deep fried rat burgers, she knew what was missing on her plate, and she'd eaten like she was making up for lost time.<br>\r\n<br>\r\nBob and Flo Hookbill had been stunned when they saw their daughter that summer, a college drop out and 142 pounds heavier then when she left. In part to stop her Mom's nagging and in part because she knew she was pretty overweight, Tiffany had tried her hand at diet and exercise. She hadn't been very successful, to be honest, only managing to shed about six pounds in the last year and a half. Granted, she had given herself a lot of cheat days, and she really didn't work out much at all, but she'd been pretty good, okay?<br>\r\n<br>\r\nStill, even though her Mom worried about her waistline once she went back to uni, she'd mostly stuck to the same diet she'd had at home. And the smells had been driving her mad with hunger. She'd earned herself one greasy meal. Right? Right.<br>\r\n<br>\r\nAs she opened the bag, she couldn't help but flick her forked tongue out, tasting the fast food grease in the very air, leaving her mouth watering. She felt a familiar pop as she unhinged her jaws, opening her mouth wide enough to engulf the burger whole.<br>\r\n<br>\r\nNow, rumors to the contrary aside, she was perfectly capable of chewing her food, and given she would have liked to savor this, she'd have done so if she had enough time. However, Tiffany didn't know how long Chelsea would be out, so she had to make this quick. Chelsea was majoring in kinesiology, and the cocker spaniel girl was a bit of a health nut. Perhaps even more then her Mom, she'd been shocked by Tiffany's significant and rapid gain. She was always on her to eat better and work out, and while Tiff wasn't totally enamored with just how big she'd gotten, she was far from a willing participant in what sounded like sheer torture.<br>\r\n<br>\r\nOne by one, she slid each of her 6 double-patty burgers down her gullet, her throat stretching to allow the massive things easy access to her stomach. Swallowing the last one, she let out a content sigh and rubbed her belly, allowing herself only a moment of rest before springing to action. <i>\"Well, depending on your definition of 'spring',\"</i> Tiffany thought as the food baby she now carried worked to hinder her mobility somewhat. Her instincts screamed at her to find a sunny spot and rest, but she didn't dare waste a moment. Back home in Maine, she could just hide the evidence in the garbage can, as her parents had no sense of smell. Chelsea, on the other hand, had a <b>VERY</b> good sense of smell. Tiff wasn't sure if the woman had any bloodhound in her family tree or not, but she wouldn't have been surprised.<br>\r\n<br>\r\nSpraying liberally with a can of febreze, Tiffany continued tasting the air until she was certain there was not a trace of fast food smell in the house. Popping a couple scotch mints into her mouth, she sucked and chewed on the candies as she slowly, languidly slithered through the back door. She knew it probably would have been safer to eat her meal at the fast food place (after all, what would she have done if Chelsea had been home?), but she was too self-conscious to eat such a large quantity in a public place.<br>\r\n<br>\r\nAs she opened the back door, she inhaled the warm, humid air with a happy sigh. The Florida climate may have been rather uncomfortable for the mammals, but it was perfect as far as the snake-woman was concerned. There was a reason so many of the reptilian immigrants to the US chose to move to The Sunshine State. Her nearly white scales shone in the late afternoon sun, and she beelined towards her favorite feature in the whole house. <br>\r\n<br>\r\nAt some point, one of the previous owners had installed a sauna in the backyard, and after she'd first used it, Tiffany had decided that it was the single best addition to any home imaginable, bar none. She languidly slithered past the rain barrels and Chelsea's small vegetable garden. She thought she might have crushed a cucumber plant, but she was rapidly sliding into full digestion mode, and simply wasn't as careful or concerned as she would was been otherwise. <br>\r\n<br>\r\nTurning the heat on to start warming it up, she quickly got undressed, dutifully ignoring how jiggly her scaly flesh felt under her fingers, or how hard she had to work now to feel the firmness from her heavily stuffed belly. As the steam blasted from the first spoonful of water, she leaned back with a small grin playing on her face. <i>\"Life is good...\"</i></span></div></div>",
            "created":1574316240,
            "id":2749586,
            "title":"Tiffany Hookbill - Big Snake on Campus"
        }
    },
    "info":{
        "author_id":"panzerleopard",
        "author_name":"PanzerschreckLeopard",
        "brief_description":"A weight gain interactive for many characters. Stuff them, watch them grow! (Females only)",
        "created":1321035000,
        "description":"<td align=\"left\" class=\"norm\">Here, we have many furries, all female, of various shapes and sizes. You're gonna get a chance to make them big and FAT!<br>\r\n<br>\r\nVore is allowed, but only soft vore. NO hard vore anything other than the mouth.<br>\r\n<br>\r\nBelching and some slobiness is okay, but keep farting to a minimum, preferably only for comedy.<br>\r\n<br>\r\nNo death or weight-related illnesses!<br>\r\n<br>\r\nSex &amp; bi/lesbian is allowed, but not too graphic.<br>\r\n<br>\r\nSome characters might also grow in height as they fatten.<br>\r\n<br>\r\nKeep weight gain semi-realistic. A character can fatten by no more than 50% of their body weight before that particular meal.</td>",
        "id":1825318,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595758320,
        "modified":1595758320,
        "pretty_title":"Some Furries Get Fat!"
    }
}