{
    "chapters":{
        "1":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Natsumi Hinata",
                "Fuyuki Hinata",
                "Aki Hinata",
                "One of his own comrades",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The Keroro Platoon have tried &amp; failed several times to capture Pokopen/Pekopon for their home planet Keron. And sometimes their plans haven't even gotten off the ground. But Sgt. Keroro is determined to one day take over.<br>\r\n<br>\r\nOne day, Keroro held a meeting with his platoon, Private Second Class Tamama, a cute young Keron with a very ugly split personality, Corporal Giroro, the trigger happy munitions expert with a fiery temper, Sergant Major Kururu, the brilliant but demented inventor known for his dark personality, and he even brought in Lance Corporal Dororo, the often-forgotten ninja. Also there was Angol Moa, destroyer of worlds &amp; niece-figure &amp; lover of Keroro, (Tamama despises her, because he admired Keroro as well)<br>\r\n<br>\r\n\"Listen up,\" the Sergeant announced, \"I've finally figured out how we can take Pekopon!\"<br>\r\n<br>\r\n\"You always say that...\" replied Giroro. He knew the past several hundred plans to overtake Pekopon have failed, usually because of Keroro's tendency to not finish the plans for invasion.<br>\r\n<br>\r\n\"This time it will be different from the past several hundred times! Kururu?\"<br>\r\n<br>\r\n\"Kukuku,\" snickered Kururu, \"using the technology &amp; parts of several of our past inventions used for transforming, including the Age Transformation Gun &amp; the Oni Girl Gun, I have created... The MULTI TF GUN! It can change age, make people into animals, &amp; change size &amp; appearance, as well as a few other effects.\"<br>\r\n<br>\r\n\"Gero gero, Excellent!\" said Keroro.<br>\r\n<br>\r\n\"Small Problem, though.\"<br>\r\n<br>\r\n\"What is it?\"<br>\r\n<br>\r\n\"I haven't tested it yet, but I will quickly.\"<br>\r\n<br>\r\n\"You're not testing it on me!\" Giroro shouted. Giroro was always used as the guinea pig for Kururu's twisted experiments, and he wasn't going to allow himself to be exposed to the numerous effects of THAT weapon! <br>\r\n<br>\r\n\"I'll find a test subject,\" announced Keroro, taking it from the inventor's grasp, \"and soon we'll have Pekopon on their knees!\"<br>\r\n<br>\r\nHe decided to test it on...  </span></div></div>",
            "created":1254286800,
            "id":768358,
            "title":"The Newest Invasion Plan"
        },
        "11":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "The Age Feature (AR or AP?)",
                "The Size Feature (Grow or Shrink)",
                "Animal Transform",
                "Inanimate Object Transform",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Keroro decided to use Natsumi, the teenaged Hinata girl, as a victim, since she had been bossing him around, beating him senseless, and forcing him to do chores ever since he landed on Pekopon. This, he figured, would be payback time!<br>\r\n<br>\r\nLater, Keroro decided to lounge around his room (which used to be the house's basement and led to the Keroro Platoon's hideout) in order to lull Natsumi into a false sense of security. Any time now, she'd be yelling for him...<br>\r\n<br>\r\n\"STUPID FROG!!!\"<br>\r\n<br>\r\n\"Ah, right on schedule,\" Keroro chuckled to himself.<br>\r\n<br>\r\nJust then, the door burst open and there was Natsumi, mad as heck. \"What do you think you're doing?\"<br>\r\n<br>\r\n\"Oh, nothing,\" the Keronian responded.<br>\r\n<br>\r\n\"Well, there's a sink full of dirty dishes &amp; it's your turn to wash &amp; dry them!\"<br>\r\n<br>\r\nJust then, she noticed that Keroro wasn't responding. He was only snickering to himself &amp;... it seemed like he was holding something...<br>\r\n<br>\r\n\"What is that you have? You're hiding something from me, AREN'T you? Alright, let's see it!\"<br>\r\n<br>\r\nKeroro was selecting something to use on her. So many options, so little time. He had to choose one quick, or else Natsumi would catch on, pound him to a bloody pulp, or both.<br>\r\n<br>\r\nSo he decided to use...</span></div></div>",
            "created":1254286800,
            "id":768429,
            "title":"Natsumi Hinata"
        },
        "111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Older",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He decided to change Natsumi's age, but should he make her younger or older? And how much younger or older?</span></div></span></div>",
            "created":1254459600,
            "id":769277,
            "title":"The Age Feature (AR or AP?)"
        },
        "1111":{
            "author_id":"dragonwriter45",
            "author_name":"Dragonwriter45",
            "choices":[
                "18",
                "Her mom's age (26)",
                "older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keror fires the gun to make Namine younger than notices that the gun is set to make her older. How old does she come?</span></div></span></div>",
            "created":1283317200,
            "id":948284,
            "title":"Older"
        },
        "1112":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "A lil' kid",
                "A toddler/ baby (choose)",
                "A newborn/ past birth (choose)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keroro figured that if Natsumi were younger, she'd be less of a threat. But how young would he make her?</span></div></span></div>",
            "created":1254546000,
            "id":769371,
            "title":"Keroro will make Natsumi younger when he decides"
        },
        "11121":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "still has her teenage mind",
                "really is a little girl now"
            ],
            "content":"<div class=\"\"><div> <span>     Natsumi feels herself shrink as if the light from the gun is melting away her body. Her screams quickly increase in pitch. Her developing womanhood inverts back into prepubescence. Her clothes slither off her demoted form; her pants fall off completely leaving her shirt to hang onto her entire body as if it was a dress.<br>\r\n     When the light fades, Keroro sees his nemesis in the form of an adorable kindergarten child only a few centimeters bigger than him. When Natsumi begins to speak, it is clear that she...</span></div></div>",
            "created":1390626000,
            "id":1732898,
            "title":"A lil' kid"
        },
        "111211":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Keroro",
                "Natsumi"
            ],
            "content":"<div class=\"\"><div> <span>     \"Stupid frog!\" Natsumi shrieks with her squeaky voice. Keroro, in response, laughs harshly at her face.<br>\r\n     \"You're so cute, Natsumi-dono.\" he then continues to laugh. Natsumi's face burns red with rage. She runs as the best as she can, while trying not to trip on her own shirt, towards Keroro, hoping to to give him a sucker punch. You wins the fight?</span></div></div>",
            "created":1390626000,
            "id":1732901,
            "title":"still has her teenage mind"
        },
        "1112111":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "gets capture by the Keroro Platoon , being unable to fight",
                "cries from a boo boo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Natsumi did not take into account that her arms are no longer as long as they used to be. Keroro moves slightly to the left to avoid Natsumi; the momentum of the unsuccessful attack causes Natsumi to finally trip over her shirt. Natsumi...</span></div></span></div>",
            "created":1390626000,
            "id":1732955,
            "title":"Natsumi loses"
        },
        "11121112":{
            "author_id":"normjr",
            "author_name":"kingler",
            "choices":[
                "Keroro tries to stop her crying",
                "Aki come in"
            ],
            "content":"<div class=\"\"><div> <span>She falls onto her face after tripping, she turns over and sits up to see Keroro towering over her and laughing \"stop waughing you big meanie\" she screams crying \"dat weawwy huwt\" she says as the tears start flowing.<br>\r\n<br>\r\nWhat happens next</span></div></div>",
            "created":1413262800,
            "id":1871451,
            "title":"cries from a boo boo"
        },
        "11122":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Toddler",
                "Baby"
            ],
            "content":"<div class=\"\"><div> <span>Keroro decided to make Natsumi younger than a child. He figured turning her into a toddler or a baby would make her more helpless. Besides, even if she did hit him, the blows probably wouldn't hurt very much. But he had to quickly decide what to make her: Toddler or Baby?</span></div></div>",
            "created":1254978000,
            "id":772267,
            "title":"Toddler or Baby?"
        },
        "111222":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Angry (mental settings off)",
                "Like a baby (mental settings on)"
            ],
            "content":"<div class=\"\"><div> <span>Keroro quickly set the gun to the correct settings, turned around &amp; fired at Natsumi. She was surprised when the beam hit her, but even more surprised as to what was happening to her. She was getting smaller, her breasts were shrinking into her chest, &amp; baby fat started developing on her. It must've been the \"If I Could Do My Life Over\" gun, she figured, but it wasn't, it was something entirely new!<br>\r\n<br>\r\nBy the time she had become a baby, she stopped regressing. Her now oversized clothes morphed into a diaper &amp; pink dress. As Keroro was admiring what he did to her, Natsumi felt...</span></div></div>",
            "created":1255842000,
            "id":777692,
            "title":"Baby Natsumi"
        },
        "1112221":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "accidently uses her diaper in front of her nemesis",
                "tries to walk to Keroro to punch him in the face"
            ],
            "content":"<div class=\"\"><div> <span>\"Stuwpid fwog! Wat did you do to me?!?\" Natsumi screams in horror towards her new form, not noticing her new lisp. Keroro, overjoyed towards his work, simply laughs loudly at her. Natsumi, despite herself, feels a tear fall from her face from the humiliation. \"This isn't funny!\" She...</span></div></div>",
            "created":1433048400,
            "id":1986014,
            "title":"Angry (mental settings off)"
        },
        "1112222":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Transform her in some other way",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>At that moment, a blank look entered her eyes. She couldn't remember anything or anyone. All she could do was suck her thumb while curiously crawling around &amp; examining everything. <br>\r\n<br>\r\nKeroro was extremely pleased with this. Not only was she helpless in this new form, she also couldn't remember anything about her past life at all. Now he had an advantage over her! Should he do something else to her?</span></div></div>",
            "created":1256533200,
            "id":781939,
            "title":"Mentally a baby"
        },
        "11122221":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Shrink",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's one way he could transform her again?</span></div></span></div>",
            "created":1260594000,
            "id":804815,
            "title":"Transform her in some other way"
        },
        "111222211":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Play around with (Really) Tiny Baby Natsumi some more",
                "Choose another effect/ target"
            ],
            "content":"<div class=\"\"><div> <span>Keroro decided to try out the size option. He decided against using the growth feature, because not only would he need a lot of space to do it, he didn't want to expose what he was doing to anyone else. At least not yet. Besides, he wanted to reduce the former pink-haired terror down in more than just age to show just how helpless she was before him. So he activated the \"Shrink\" option, and fired at Baby Natsumi. Within a matter of seconds, the baby shrank down until she was no bigger than a mouse.<br>\r\n<br>\r\n\"Kero Kero Kero! Not so high-and-mighty now, are you, Natsumi-domo?\" Keroro taunted, picking up Natsumi by the back of her dress (which shrank with her) and dangling her in front of his face, while occasionally poking her little tummy. The (really) tiny baby squeaked and cooed as she was being dangled high above the floor, practically oblivious to her current situation. Suddenly, she slid out of the little dress and started to fall towards the ground.<br>\r\n<br>\r\n<i>Whoops</i>, thought Keroro, and quickly shot out his free hand to catch Natsumi in time. She was unhurt but dazed, and upon recovering, she started to crawl around on the Keronian's hand, as she was now small enough to fit on his palm with room to spare. Keroro sat down, put the dress back on the baby, and let her crawl and roll around on both his hands for a bit. He was amazed by this turn of events. Kururu's own shrinking device was huge and cumbersome, but he managed to find a way to fit the technology onto a more portable device, along with several other effects from some of his other creations. Despite being a creepy jerk, Keroro had to admit, Kururu was one heck of a scientist. As he watched Natsumi grab onto his thumb, he was trying to make up his mind on what to do now.</span></div></div>",
            "created":1371013200,
            "id":1609864,
            "title":"Shrink"
        },
        "111222212":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Growth",
                "Next choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could he do to Baby Natsumi?</span></div></span></div>",
            "created":1274936400,
            "id":890150,
            "title":"Other choices"
        },
        "1112222121":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "He makes it to the gun & tries to stop her",
                "He gets pulled out & the madness continues"
            ],
            "content":"<div class=\"\"><div> <span>\"Well at least I know the age feature works, but what about the others?\" Keroro thought to himself, as Natsumi, now a baby, was lying on her back sucking on her toes. So Keroro decided to have a little fun with the size feature by putting the settings at growth. Once Natsumi was siting upright again, he fired the gun at her, causing her to grow to a giant size. Not large enough to fill his room or even the whole house, but still pretty huge. <br>\r\n<br>\r\nAs Keroro was setting the device to make her shrink, the now giant Baby Natsumi picked up Keroro, causing him to drop the gun. She then stared at him a moment before putting him in her mouth &amp; sucking on him like a pacifier. Inside her mouth, Keroro's screams &amp; shouts could be heard. \"AAAAAHHH! LET ME OUT! NO, DON'T LICK ME! I'M GETTING COVERED WITH SALIVA! YUCK!!! NATSUMI, GET ME OUT OR YOU'RE IN BIG TROUBLE! No pun intended. HELLLLLLLP!!!\"<br>\r\n<br>\r\nEventually, Natsumi pulled him out covered with saliva &amp; not looking very pleased. But of course, she didn't seem to notice in the slightest, as she began giggling &amp; slamming him against the ground &amp; swinging him around like he was a toy. Eventually, a few of the figures of Keroro's gunpla collection got accidentally knocked over by Natsumi's swinging. \"NOT MY GUNPLA!\" he said upon seeing this. At that point, he'd had enough. The moment he got near to the ground, he quickly grabbed ahold of the carpet as best as he could. Natsumi began trying to pull him out, but he had a firm grip &amp; a steel determination. Soon, he began making his way towards the TF Gun by grabbing handful of carpet after handful in order to move, as well as keep himself from being swung around again.<br>\r\n<br>\r\nWhat'll happen next?</span></div></div>",
            "created":1274936400,
            "id":890166,
            "title":"Natsumi gets HUGE"
        },
        "11122221211":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Returns Baby Natsumi to normal size",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>With enough effort, Keroro managed to make his way over to the TF Gun and pick a setting for it while keeping a hold on the carpet. Then with his free hand, he grabbed the technologically advanced weapon and pointed it toward Natsumi. \"Playtime's over!\" shouted the Keronian, before letting loose a beam of energy that made contact with the giant baby girl.<br>\r\n<br>\r\nWhat effect does the beam cause?</span></div></div>",
            "created":1370494800,
            "id":1605589,
            "title":"He makes it to the gun & tries to stop her"
        },
        "111222212112":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Shrink Natsumi Much Smaller",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could it do?</span></div></span></div>",
            "created":1423285200,
            "id":1928988,
            "title":"Something else"
        },
        "11122222":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Mess around with her/ take advantage of her",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could Keroro do with Baby Natsumi?</span></div></span></div>",
            "created":1274763600,
            "id":889014,
            "title":"Something else"
        },
        "111222222":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Keroro gets a sudden thought",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1274763600,
            "id":889016,
            "title":"Something else"
        },
        "1112222221":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Regress him as well",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As he saw the tiny baby that used to be Natsumi, Keroro just remembered: <br>\r\n<br>\r\nGiroro. The Lance Corporal had a huge crush on Natsumi, &amp; he would be rip-roarin' pissed if anyone messed with her. However, Keroro cited her as one of the main obstacles of the invasion, so it would be extra-hard to avoid his wrath.<br>\r\n<br>\r\nKeroro anxiously scanned the area to make sure he wasn't there. To his relief, he was nowhere in sight. So now he had to figure out what to do with Giroro before he finds out about Natsumi's regression.<br>\r\n<br>\r\nWhat should he do?</span></div></div>",
            "created":1274763600,
            "id":889049,
            "title":"Keroro suddenly remembers about Giroro"
        },
        "11123":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Newborn",
                "Past Birth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe if Natsumi were even younger than an infant, then she'd be powerless! Should Keroro make her a newborn or regress her past birth?</span></div></span></div>",
            "created":1263790800,
            "id":822214,
            "title":"A newborn/ past birth (choose)"
        },
        "111231":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Take advantage of her age & size by messing with her in different ways (Non-TF)",
                "Transform her some other way"
            ],
            "content":"<div class=\"\"><div> <span>Keroro remembered hearing how Pekoponians are helpless at birth &amp; the first few months of their lives, so if he wanted Natsumi, his biggest obstacle, out of the way, he'd turn her into a neonate (scientific name for \"newborn\") &amp; leave her in the care of someone else while he &amp; his comrades were out commencing the invasion. Giroro would most likely be pretty furious at him if he found out, since the Lance Corporal happened to have a crush on Natsumi, but Keroro would deal with him later. So, having made up his mind, he quickly fired at Natsumi.<br>\r\n<br>\r\nSoon, a bright light filled the room as Natsumi began shrinking down in both age &amp; size as her clothes got too big &amp; wound up covering her completely. Keroro waited for a reaction until he detected movement in the pile of clothes with faint, muffled cries heard within it. He pulled away some of the loose clothing until it revealed what Keroro was expecting: a tiny, naked, newborn baby human with short pink hair, crying. However, she went silent as she looked up at the Keronian looking down at her. <br>\r\n<br>\r\nWhat does Keroro plan to do next with her?</span></div></div>",
            "created":1271394000,
            "id":868933,
            "title":"Newborn"
        },
        "111232":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "someone becomes pregnant",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keroro set the gun to the \"past birth\" setting. In only a few seconds, the infant Natsumi disappears from existence, quickly shrinking into a microscopic zygote. Before Keroro can process what has happened to her, ...</span></div></span></div>",
            "created":1433048400,
            "id":1986012,
            "title":"Past Birth"
        },
        "1112321":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Aki Hinata",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who becomes pregnant?</span></div></span></div>",
            "created":1435381200,
            "id":1999449,
            "title":"someone becomes pregnant"
        },
        "11123212":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Koyuki",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could become pregnant?</span></div></span></div>",
            "created":1435452780,
            "id":1999892,
            "title":"Someone Else"
        },
        "112":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "shrunk",
                "grew",
                "shrunk and grew at random places"
            ],
            "content":"<div class=\"\"><div> <span>Without pure concentration of thought, Keroro hastily proceeded with the size option of the gun. He aimed at and fired the gun at Natsumi before she could touch him; but, the invader has no idea which size setting he set the gun. The answer came to Keroro as soon as Natsumi flinched and her body...</span></div></div>",
            "created":1254459600,
            "id":769303,
            "title":"The Size Feature (Grow or Shrink)"
        },
        "1121":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "the same size as her",
                "double her size",
                "much bigger than her"
            ],
            "content":"<div class=\"\"><div> <span>Natsumi stopped when she felt her clothes getting loose, then looser and looser. She also learned that Keroro appeared to get larger. After realizing her situation, the changes stopped. \"What did you do, stupid fro...?\" before Natsumi could finish, she saw that Keroro, compared to her, became...</span></div></div>",
            "created":1254459600,
            "id":769305,
            "title":"Natsumi shrunk"
        },
        "11211":{
            "author_id":"m1lk",
            "author_name":"M1lk",
            "choices":[
                "Keroro",
                "Natsumi"
            ],
            "content":"<div class=\"\"><div> <span>\"Gero gero gero, How do like being small?\" He says. He starts twirling around. Natsumi squits, takes one step, AND PUNCHES HIM ACROSS THE FACE!<br>\r\n\"STUPID FROOOOG!\" She shouts as she starts pounding him. Unfortunately she also hit the gun, and it went of and hit..</span></div></div>",
            "created":1289106000,
            "id":989474,
            "title":"the same size as her"
        },
        "112112":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Shrink more",
                "Grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens to Natsumi ?</span></div></span></div>",
            "created":1363237200,
            "id":1550098,
            "title":"Natsumi"
        },
        "1121121":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "He beats her as she did in the past.",
                "He paused"
            ],
            "content":"<div class=\"\"><div> <span>When the laser beam collided Natsumi, she began to shrink, until she do more than half the size of Keroro.<br>\r\n\"No! It's not possible!\"<br>\r\n\"Gero, gero, gero! Now, how it feels to be the smallest, huh? Now, I will take revenge at you!\"<br>\r\nHe approaches Natsumi, and then he...</span></div></div>",
            "created":1363237200,
            "id":1550103,
            "title":"Shrink more"
        },
        "11211212":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Natsumi Grows",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>While he was able to take his revenge, Keroro stopped.<br>\r\n<br>\r\n\"What is wrong, Sergeant?\", asked Tamama.<br>\r\n<br>\r\n\"I-I can't.\" said Keroro<br>\r\n<br>\r\n\"What?\" said Tamama<br>\r\n<br>\r\n\"I-I just can't.\" said Keroro. \"I know she did bad things at me, but it is unfair. She is too small and too defenseless. I just can't beat her know.\"<br>\r\n<br>\r\nS-Stupid Frog...\" said the now chocked Natsumi.<br>\r\n<br>\r\n\"Sorry to all this mess, Natsumi-dono. I'll reconvert you at your normal size.\"<br>\r\n<br>\r\nKeroro took the TF gun, and arm it to Natsumi. And then </span></div></div>",
            "created":1363237200,
            "id":1550108,
            "title":"He paused"
        },
        "112112122":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Keroro mess up, and Natsumi shrinks more.",
                "The gun seems does not seem to work"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There is an other choice...</span></div></span></div>",
            "created":1363237200,
            "id":1550109,
            "title":"Other"
        },
        "1121121222":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "\"Yes, it's the life, baby. Ku ku ku...\"",
                "\"Nah, the effects stopped tomorrow.\""
            ],
            "content":"<div class=\"\"><div> <span>While Keroro was retransformed Natsumi its true size, the gun began to spark, and exploded.<br>\r\n<br>\r\n\"Gero! What happened?!\"<br>\r\n<br>\r\n\"Looks like the gun overloaded because of these two successive uses. Ku ku ku...\" said the creepy Kururu.<br>\r\n<br>\r\n\"So, you said me I am obliged to spent my entire life in this shruken body?!\"</span></div></div>",
            "created":1363237200,
            "id":1550110,
            "title":"The gun seems does not seem to work"
        },
        "11211212222":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Natsumi woke up at her shrinking size.",
                "She find herself at her normal size"
            ],
            "content":"<div class=\"\"><div> <span>\"Ku ku ku... Don't worry, effects of the gun will stop tomorrow.\"<br>\r\n<br>\r\nAll breathed a sigh of relief.<br>\r\n<br>\r\n\"But, what will I do this night?\"<br>\r\n<br>\r\nSo, Keroro decied to explain the all situation to Fuyuki and Aki.<br>\r\n<br>\r\n\"Eh?! So, Sis is stuck in that little body until tomorrow?!\" said the chocked Fuyuki.<br>\r\n<br>\r\n\"Y-Yes. Sorry.\"<br>\r\n<br>\r\n\"Oh, my poor little Natsumi\", said Aki, which hugged Natsumi.<br>\r\n<br>\r\n\"Mom, calm down, you literally crush me.\" said Natsumi, who was pressed against the enormous (On her view) chest of her mother.<br>\r\n<br>\r\n\"Oops, excuse me.\" said Aki, gently putting Natsumi on the ground.<br>\r\n<br>\r\n\"To be forgiven, I will make dinner tonight, and all chores this week.\", said Keroro.<br>\r\n<br>\r\n\"Hmm... Okay. Oh, and one more thing, Stupid Frog.\" said Natsumi. She smiled. \"Thanks.\"<br>\r\n<br>\r\n\"Y-You welcome, Natsumi-dono! Now, I'll make dinner!\"<br>\r\n<br>\r\nAnd this evening, all of them (Tamama, Dororo and Koyuki came also) were appreciate Keroro's food. Then, Aki use old puppets clothes, and gave them to Natsumi, who sleeped in her own bed. The next day...</span></div></div>",
            "created":1363237200,
            "id":1550117,
            "title":"\"Nah, the effects stopped tomorrow.\""
        },
        "112112122221":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Aki enters in the room",
                "Natsumi begin to grow at her normal size"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Natsumi woke up, but she found her at the same size of yersteday<br>\r\n<br>\r\n\"Eh?! But I am supposed to be at my normal size now?!\"<br>\r\n<br>\r\nSuddenely, something happened...</span></div></span></div>",
            "created":1363237200,
            "id":1550123,
            "title":"Natsumi woke up at her shrinking size."
        },
        "1121121222212":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "content":"<div class=\"\"><div> <span>Natsumi felt a weird sensation, and her body began to glow. Then, Natsumi felt her clothes began tighter, and the room began smaller. She then realized she was growing.<br>\r\n<br>\r\n\"Oh no! Quick, a solution! This story must no contain nudity, I must found clothes quickly!\"<br>\r\n<br>\r\nBut she was too small for open the cupboard. And she'll never be large enough to open it without exploded out of her clothes. But then, she saw something. She thinked about it, but then, the first little button of her clothes popped out, so she decided to take it after all. And then, Giroro enters in the room.<br>\r\n<br>\r\n\"So, Natsumi, did you return to your normal- What?!\"<br>\r\n<br>\r\nNatsumi was now at her normal size... in a bunny costume (Not a real bunny, the sexy one). She was now embracing red, and Giroro also. Suddenely, Giroro had a nosebleed of such power, than he passed the roof, and stop nosebleeding at 300 feet in the sky, and fell on the roof also. Natsumi still wondering why this strange costume was in her room. She gave rapidly the awnser when she heard the creepy laugh now by her and all who read this part of the story...<br>\r\n<br>\r\n\"Ku ku ku...\"<br>\r\n<br>\r\n\"KURURUUUUUUUU!!!!!!\" yelled Natsum in anger<br>\r\n<br>\r\nEnd of the story, thanks for reading, and hope you have enjoyed.</span></div></div>",
            "created":1363237200,
            "id":1550147,
            "title":"Natsumi begin to grow at her normal size"
        },
        "1122":{
            "author_id":"nmh488",
            "author_name":"SomeGuy",
            "choices":[
                "Increase her height",
                "Make herself older",
                "Grow the other girls"
            ],
            "content":"<div class=\"\"><div> <span>Natsumi stared at herself in shock as she was growing, noticing the buttons on her shirt starting to pop off, her skirt starting to tear, and her shoes breaking apart. She continued to grow to 10ft, to 15ft, to 25ft, and stopping at 50 ft. The house roof broke apart as Natsumi came up to her full height, where at this point, her clothes exploded, leaving Natsumi in her magenta-colored underwear, and her pigtails came apart, lengthening her hair to the middle of her back.<br>\r\n<br>\r\n\"Stupid frog!\" shouted Natsumi, \"Now look what you did to me!\" Keroro, trying to calm the giantess down, said, \"It isn't all bad Natsumi! You're hardly noticable!\" \"Hardly noticable?!\" shouted Natsumi, now steaming with anger, \"What's hardly noticable about a scantily-clad, teenage giantess?!\" Natsumi was fuming at this point and picked up Keroro with her fingers. Keroro, now frozen with fear, asked the colossal girl, \"Um, Natsumi? Put me down, please? We don't need to be extr-\" Before Keroro could finish his sentence, Natsumi flicked him away with the intent to send him to Europe.\"KEROOOOOO~!\" is all the green sergant could say before soaring away.<br>\r\n<br>\r\nNatsumi noticed the TF gun at her feet and said, \"Hm, what's this?\" As soon as she picked it up, the gun grew to fit her hand. She examined the gun carefully and noticed the setting on the gun was set to \"Grow\". \"Aha!\" said the titaness, \"So this is what the stupid frog used to make me grow!\" She then had an idea, \"If he was going to use this to take over Earth, imagine the fun I could have with this!\" She then decided to...</span></div></div>",
            "created":1265691600,
            "id":833403,
            "title":"Giant Natsumi"
        },
        "11221":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "\"Yep, it's perfect !\"",
                "\"Hmm... I can go bigger !\""
            ],
            "content":"<div class=\"\"><div> <span>\"That stupid frog, making me huge...\" grumbled Natsumi, stepping out of the gaping hole she had created and into the streets. But with the gun in her hand, the pink-haired giant didn't look so angry. In fact, she looked giddy. \"But I gotta say, all those old kaiju movies made it look... kinda fun !\" she admitted to the world. \"No monster to fight, no stupid frog to worry about, I can just explore however I want ! Maybe I should make myself a little bit more decent... nah !\" <br>\r\n<br>\r\n\"But...\" she hummed, looking at herself. \"Kaijus are supposed to be bigger than that. No need being huge if I can't get the full experience. Fortunately...\" she grinned, and started adjusting the settings of the gun. An easy task, since the gun was custom-made for Keroro, and the instructions were kept simple. Once she felt she had it, she put the gun against her temple, and closed her eyes with a big grin. \"Here we go~\"<br>\r\n<br>\r\nShe fired the laser, then reveled in the tingly feeling and seeing the scenery shrink before her eyes, as she grew larger by the second. She could see the whole block before, now the whole city landscape was in view ! When her growth spurt came to a halt, she stood at 200 feet tall ! The whole city looked awestruck at the teen titan, while she looked ecstatic.<br>\r\n<br>\r\n\"<b>Whoaaaa, I'm humongous ! The city looks so pretty from up here !</b>\" she rejoiced, scrutinizing the horizon. \"<b>Hmm... Am I the right size though ?</b></span></div></div>",
            "created":1582682700,
            "id":2792931,
            "title":"Natsu-zilla! Giantesses wanna have fun, de arimasu"
        },
        "11222":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "\"I need to grow, and grow\"",
                "\"I need other giantesses with me\""
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I could make me older, it seems this weird gun have the option.\"<br>\r\n<br>\r\nAnd then, she points the gun on herself and pushed the trigger. Then, her hair started become longer, and her whole body became more adult. And when she stopped, she was at the same age she had when her and the rest of the troup went to the beach. Fortunately, her underwears grew too.<br>\r\n<br>\r\n\"Now, I'm even stronger! But to be sure to be the most powerful...\"</span></div></div>",
            "created":1363237200,
            "id":1550214,
            "title":"Make herself older"
        },
        "11223":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Yay!",
                "No!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But which of them? Mois?</span></div></span></div>",
            "created":1363237200,
            "id":1550151,
            "title":"Grow the other girls"
        },
        "112232":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Go for the Mom!",
                "No, another one."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Aki?</span></div></span></div>",
            "created":1363237200,
            "id":1550152,
            "title":"No!"
        },
        "1122322":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Yes!",
                "No, we must be careful with her other personality."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the shy Momoka?</span></div></span></div>",
            "created":1363237200,
            "id":1550157,
            "title":"The rich girl"
        },
        "11223222":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Yes for the ninja!",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, what about her best friend Koyuki?</span></div></span></div>",
            "created":1363237200,
            "id":1550164,
            "title":"Ninja time"
        },
        "112232221":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "\"Yes, it will be great!\"",
                "\"I'm not very sure...\""
            ],
            "content":"<div class=\"\"><div> <span>Koyuki was jumping from tree to tree as usual, when she saw the giant Natsumi, and wend to her encounter.<br>\r\n<br>\r\n\"N-Natsumi?!\" said the shocked Koyuki.<br>\r\n<br>\r\n\"Oh hey Koyuki\", said the smiling Natsumi. \"Do you like my new form?\"<br>\r\n<br>\r\n\"Well, it's... impressive.\"<br>\r\n<br>\r\n\"Hey, I have an idea. Why didn't you grow with me?\"<br>\r\n<br>\r\n\"Eh?!\"<br>\r\n<br>\r\n\"Come on, it will be fun! We could be the biggest friends in the world, literally!\"<br>\r\n<br>\r\n\"Well...\"</span></div></div>",
            "created":1370235600,
            "id":1603105,
            "title":"Best and biggest friends in the world!"
        },
        "1122322211":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "\"We could grow more!\"",
                "Something else happened"
            ],
            "content":"<div class=\"\"><div> <span>\"Of course! It will be great\" said the now cheerful Koyuki.<br>\r\n<br>\r\n\"Okay, just don't move\" said Natsumi, while aim the gun to Koyuki.<br>\r\n<br>\r\nAnd then, she pulled the trigger. At this moment Koyuki sensed nothing. And yet, nothing changed.<br>\r\n<br>\r\n\"Eh? Why is it nothing happens?\" said Natsumi, visibely disappointed.<br>\r\n<br>\r\n\"Well, maybe batteries are dead. Well, too bad-.\" said Koyuki, before felt a tingle sensation.<br>\r\n<br>\r\n\"Are you okay Koyuki?\"<br>\r\n<br>\r\nKoyuki just stared at herself at she saw her clothes became tighter and tighter, and her environnement became smaller and smaller. Her ninja sandals exploded, the rubber band who was holding her hair exploded too. She was now 20 foot tall, and still growing.<br>\r\n<br>\r\n\"It works!\" said the excited Natsumi\" It really works!\"<br>\r\n<br>\r\nFinally, Koyuki's clothes gave up and just ripped and fall down in pieces. She finally reached the point of 50 foot tall, and yet stopped growing. <br>\r\n<br>\r\n\"Wow!\" exclaimed the now enormous Koyuki, \"I'm huge!\"<br>\r\n<br>\r\n\"So? It's exciting, isn't it?\"<br>\r\n<br>\r\n\"Yes, it's really great! But now, what are we going to do?\"<br>\r\n<br>\r\n\"Hum...\"</span></div></div>",
            "created":1370235600,
            "id":1603110,
            "title":"\"Yes, it will be great!\""
        },
        "112232222":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about her two other friends, Yayoi and Satsuki ? (Wich one or both, decide after that.)</span></div></span></div>",
            "created":1363237200,
            "id":1550167,
            "title":"No"
        },
        "1122322222":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Go for the tough one!",
                "Still no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, the last take is Oka, who passed here by hazard.</span></div></span></div>",
            "created":1363237200,
            "id":1550189,
            "title":"No"
        },
        "11223222222":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "Ah, finally!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Oh well, you are quite difficult, are you? So, what about all girls in one take?</span></div></span></div>",
            "created":1363237200,
            "id":1550191,
            "title":"All in one!"
        },
        "113":{
            "choices":[
                "catgirl",
                "bunny girl",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what type of animal does she change into 2.</span></div></span></div>",
            "created":1301202000,
            "id":1077480,
            "title":"Animal Transform"
        },
        "1133":{
            "author_id":"mysterykid18",
            "author_name":"Mysteryguy18",
            "choices":[
                "Keronian",
                "Viper",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about a keronian or a viper?</span></div></span></div>",
            "created":1451009520,
            "id":2079088,
            "title":"Alien"
        },
        "11331":{
            "author_id":"kutenaiabi",
            "author_name":"Kutenaiabi",
            "choices":[
                "Mental Change",
                "No Mental Change"
            ],
            "content":"<div class=\"\"><div> <span>A beam shot out of the ray and struck Natsumi, who screamed.<br>\r\n<br>\r\n\"Gero gero gero!\" Keroro laughed as smoke consumed Natsumi. \"Now, let's see the effects of the ray!\" He smirked, looking at where Natsumi was as the smoke cleared....and his jaw dropped. \"Gero?!\"<br>\r\n<br>\r\nStanding right where Natsumi used to be was a Keronian! Her skin was pink, and on her white belly was a symbol of a sun. The same symbol was on her dark red cap, which had long ear flaps and two small horns. Her eyes were slightly closed, but they were clearly blue.<br>\r\n<br>\r\nShe seemed woozy, and confused. \"Where...who...?\"<br>\r\n<br>\r\n\"Uhhh...Natsumi-dono?\" Keroro reluctantly said, getting the transformed Natsumi's attention.<br>\r\n<br>\r\n(What next?)<br>\r\n</span></div></div>",
            "created":1537669020,
            "id":2551903,
            "title":"Keronian"
        },
        "113311":{
            "author_id":"kutenaiabi",
            "author_name":"Kutenaiabi",
            "choices":[
                "Show Others",
                "Transform More People"
            ],
            "content":"<div class=\"\"><div> <span>Natsumi suddenly clutched at her head for a second, her eyes scrunching tightly. Eventually, they opened, revealing themselves to have turned gold instead of her usual brown.<br>\r\n<br>\r\n\"...Natsumi-dono?\" Keroro eventually says again, getting her attention once more. She gave a oddly cute smile, then saluted.<br>\r\n<br>\r\n\"Recruit Sumumu-no relation to Sumomo-reporting for duty!\" She said, grinning. \"How can I help you, Sergeant?\"<br>\r\n<br>\r\nKeroro flabbergastedly looked at Natsumi-no, Sumumu, before starting to darkly chuckle. \"Gero gero gero gero...I have eliminated the worst threat to our invasion, and created a powerful new ally!\" Sumumu clapped her hands and cheered slightly, causing Keroro to preen even more!<br>\r\n<br>\r\n\"I have to show this to the others!\" He said...before getting a dark expression. \"Or, I could eliminate more threats...\"<br>\r\n<br>\r\n(What Next?)<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1540431360,
            "id":2568218,
            "title":"Mental Change"
        },
        "1133112":{
            "author_id":"kutenaiabi",
            "author_name":"Kutenaiabi",
            "choices":[
                "Transform Fuyuki",
                "Transform Aki",
                "Go After Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>Keroro thought for a little bit longer...before pointing dramatically. \"I have decided, Recruit Sumumu, that we will deal with other threats to our invasion before we inform the others of my success!\"<br>\r\n<br>\r\nSumumu saluted once again, nodding. \"Yes, Sergeant! Which one will we transform next, sir?\"<br>\r\n<br>\r\nKeroro then froze, realizing he had no idea who to transform next.<br>\r\n<br>\r\n\"Uhhh...\" He awkwardly thought. \"Uhh...there are some options here...we can either transform one of the other Hinatas, or go after another threat to our invasion....\"<br>\r\n<br>\r\nKeroro coughed, before pointing and saying \"Next, we will...\"</span></div></div>",
            "created":1540938720,
            "id":2570832,
            "title":"Transform More People"
        },
        "115":{
            "choices":[
                "Oni girl?",
                "French maid",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more choices</span></div></span></div>",
            "created":1363237200,
            "id":1550344,
            "title":"Other"
        },
        "1153":{
            "author_id":"kutenaiabi",
            "author_name":"Kutenaiabi",
            "choices":[
                "Into Meronian",
                "Into Keronian",
                "Into Axolotl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1537666380,
            "id":2551870,
            "title":"more"
        },
        "12":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "age",
                "gender (just for fun)",
                "size",
                "species",
                "other choices"
            ],
            "content":"<div class=\"\"><div> <span>As much as Keroro wanted to get back at Natsumi, he didn't want to spoil the fun... or get killed should the gun fail. Seeing as Fuyuki is the next person able to foil his plans and is currently in the house, Keroro declared him as his first target.<br>\r\nKeroro sneaked to the doorway of Fuyuki's room to find him reading an occult book, as usual. Once the Multi TF Gun got fully charged, Keroro turned to the door, aiming the gun at him.<br>\r\n\"Gunsou...,\" Fuyuki said, noticing the invader just before the gun fired and shot him in the torso. The rays changed his...</span></div></div>",
            "created":1255582800,
            "id":776522,
            "title":"Fuyuki Hinata"
        },
        "121":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Older",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fuyuki could feel his body getting...</span></div></span></div>",
            "created":1287550800,
            "id":978396,
            "title":"Fuyuki's Age Changes"
        },
        "1212":{
            "choices":[
                "a one year old baby boy",
                "a two year old baby boy",
                "More ages"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fuyuki felt his body getting smaller and younger. The sensation terrified him! he started to fear that he would regress into nothingness. <br>\r\n<br>\r\nFortunately for him, he stopped regressing once he was</span></div></span></div>",
            "created":1376197200,
            "id":1644417,
            "title":"Younger"
        },
        "12121":{
            "choices":[
                "Keroro approached Fuyuki",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Fuyuki was now a naked one year old baby boy sitting on a pile of his oversized clothing. Not sure of what to do, he began to cry like the baby he was.<br>\r\n<br>\r\nWatching from the sidelines, Keroro laughed quietly at how silly Fuyiki now looked. However, he sensed the child's sadness and fear, and he was tempted to go over to comfort him. However, if he revealed himself to be the cause of what happened, that might mean extra chores for a week! Keroro decided that if he was going to help, he wouldn't make it obvious he caused it. <br>\r\n<br>\r\nFuyuki continued crying until.....</span></div></div>",
            "created":1382763600,
            "id":1684332,
            "title":"a one year old baby boy"
        },
        "121211":{
            "choices":[
                "His sister runs in",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Keroro set the gun aside and walked to Fuyuki. He then looked at him with fake horror.<br>\r\n<br>\r\n\"Oh my God! Are you okay?\" Keroro exclaimed.<br>\r\n<br>\r\nHe picked Fuyuki up and rocked him.<br>\r\n<br>\r\n\"Shh, it's okay little buddy.\"<br>\r\n<br>\r\nFuyuki sniffles as his crying ceased. He then begins to pees on Keroro. Keroro was frozen in shock. <br>\r\n<br>\r\n\"EW! GROSS!\" He held Fuyuki far away from him. <br>\r\n<br>\r\nNoticing Keroro's reaction, Fuyuki laughed as he continued peeing. Finally, Fuyuki's peeing had ceased, and Keroro sighed out of relief. <br>\r\n<br>\r\n\"What am I going to do with you?\" Keroro wrapped Fuyuki in his old clothing. <br>\r\n<br>\r\nFuyuki smiled up at Keroro and sucked his thumb. Keroro smiled and stroked his hair.<br>\r\n<br>\r\n\"You're pretty cute, for a Pekoponian.\"<br>\r\n<br>\r\nSuddenly</span></div></div>",
            "created":1385787600,
            "id":1701085,
            "title":"Keroro approached Fuyuki"
        },
        "122":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "turn me back now",
                "turn me into something else",
                "let me borrow that gun"
            ],
            "content":"<div class=\"\"><div> <span>Luckily, Keroro still considered Fuyuki his friend, so he went for \"gender change mode\" just for his amusement. After the smoke faded, Keroro's eyes widened, seeing a girl that resembled Fuyuki crouching on the floor, covering her eyes from the light that came a few seconds before. She looked a lot like him and wore his clothes, except she also had hair that reached her back, small breasts, and also obviously resembles Fuyuki's mother, Aki.<br>\r\nFuyuki, hearing the smoke hiss and no longer noticing the bright light, slowly opened \"her\" eyes. Analyzing her room through the smoke, she is surprised that none of her possessions were damaged. That's when she remembered  the Keron invader still near her door.<br>\r\n\"Gunsou, what did you...\" Fuyuki stopped from the shock of her higher voice and new, strange bodily sensations. After Fuyuki saw her new body, she panicked and blushed in embarrassment. Keroro, amused by Fuyuki's reaction, laughed uncontrollably.<br>\r\n\"I can see you're already blossoming into a woman, Fuyuki-dono,\" Keroro taunted after a few seconds of laughing.<br>\r\n\"What did you do?\" Fuyuki said with a little more fear and confusion in her voice.<br>\r\n\"I used this to transform you into a girl,\" Keroro said, showing Fuyuki the device, \"it can turn you into other things as well.\"<br>\r\n\"That's awesome, Gunsou,\" Fuyuki said, being her usual self.<br>\r\nKeroro turned his back from her and grinned. \"Stupid Pekoponian. Now that I see the ray gun was a success, I can proceed with Natsumi-dono and Mama-dono, then this planet.\"<br>\r\n\"What?\" Fuyuki asked. Keroro trembled in shock, realizing that he whispered to himself instead of keeping his thoughts in his head like he was supposed too.<br>\r\n\"Nothing. I better go now,\" Keroro ran.<br>\r\n\"Wait!\" Fuyuki yelled, making the sergeant stop, \"can you ___?\"</span></div></div>",
            "created":1258779600,
            "id":795039,
            "title":"female Fuyuki"
        },
        "1222":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "a keronjin",
                "some other kind of alien",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Gero?\" Keroro eyed at Fuyuki questionably. He did not except to get any requests. \"What do you have in mind?\"<br>\r\nFuyuki smiled, \"I was wondering if you could make me...\"</span></div></span></div>",
            "created":1289106000,
            "id":988681,
            "title":"turn me into something else"
        },
        "12221":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "it worked. Fuyuki has become a Keron-jin version of himself",
                "Keroro forgot to change back his gender. Fuyuki is a Keron-jin girl"
            ],
            "content":"<div class=\"\"><div> <span>Fuyuki smiles, \"I was wondering if you could make me a Keron-jin.\" Being a fan of the occult, he wanted to know what it is like to be an alien for a long time. Now he can be one with his best friend.<br>\r\nKeroro likes the idea too. He nods, enters the input for the ray gun, and fires at Fuyuki. He watches as his former Pekopon-jin friend shrinks and take on Keron-jin shape. By the time the transformation finishes, Keroro looks at Fuyuki astonished. Fuyuki takes a look at his form and realizes...</span></div></div>",
            "created":1289106000,
            "id":988690,
            "title":"a keronjin"
        },
        "122212":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "demands to be turned back into a guy",
                "doesn't mind this extra change"
            ],
            "content":"<div class=\"\"><div> <span>Keroro begins to get nervous about how Fuyuki is going to react after finding out his mistake. In Fuyuki's place stands a cute, female Keron-jin. She looks a lot like Chief Medic Pururu with the exception of Fuyuki's eyes, blue skin, and the shape of a UFO on her belly. \"Gunsou!\" she shouted, noticing that something about her is amiss. If it were not for his anxiety, Keroro would have laughed from listening to Fuyuki speak. <br>\r\n\"Uh... relax, Fuyuki-dono! I just have to change back your gender,\" Keroro exclaims, trying to save himself from any wrath from her. Fuyuki...</span></div></div>",
            "created":1289106000,
            "id":988998,
            "title":"Fuyuki is a Keron-jin girl"
        },
        "1222121":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "turns Fuyuki into his male Keron-jin self",
                "accidently transforms Fuyuki in a different way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keroro searches for the gender settings of the gun, seeing that Fuyuki is not pleased with still being female. In the rush to change him back into a male, he...</span></div></span></div>",
            "created":1295067600,
            "id":1035656,
            "title":"Fuyuki demands to be turned back into a guy"
        },
        "12221212":{
            "author_id":"dragonwriter45",
            "author_name":"Dragonwriter45",
            "choices":[
                "Age-related",
                "Different type of transformation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Keroro accidently change Fuyuki's age or is it a different transformation?</span></div></span></div>",
            "created":1295067600,
            "id":1035919,
            "title":"accidently transforms Fuyuki in a different way"
        },
        "122212121":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "age regression",
                "age progression"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keroro accidentally uses the gun to change the female Keron-jin Fuyuki's age. The gun has been set to...</span></div></span></div>",
            "created":1295758800,
            "id":1040390,
            "title":"Age-related"
        },
        "1222121211":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "a young tagpole girl",
                "a baby tagpole girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keroro sees that Fuyuki is shrinking even from her small Keron-jin body. She ends up as...</span></div></span></div>",
            "created":1295758800,
            "id":1040399,
            "title":"age regression"
        },
        "12221212112":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "refuses to let Kururu brainwash Fuyuki",
                "reluctantly thinks it over"
            ],
            "content":"<div class=\"\"><div> <span>Keroro could not believe his eyes, seeing that he just turned his best human friend into a baby Keron-jin girl. She looks like what she looked like a moment ago, only smaller, with a diaper that somehow came into existence, and a look on her face that tells him she has no idea what is happening. Although it does feel weird to have her like this, Keroro did have to admit, from Keron-jin standards, she looks so adorable.<br>\r\n\"Kukukuku.\" Keroro jumps, no longer focusing on Fuyuki, from the familiar yet ominous laughter. Kururu enters the room with the usual, sinister look on his face, but Keroro can tell that he is up to something. \"I would like to try something.\"<br>\r\n\"Wh-what do you have in mind?\" Keroro asks although he is not sure he wants to know what thoughts currently lurked in his dark mind.<br>\r\n\"Kukuku. Why don't we hypnotize little Fuyuki while she is in this state? Small children are so easy to manipulate. We can turn her back to her formal age afterward so we can have her side with us in the platoon.\"<br>\r\nKeroro feels a horrible jolt in his heart. It is a good plan and being an invader is his job, but would he do that to his friend? Keroro...<br>\r\n</span></div></div>",
            "created":1295758800,
            "id":1040419,
            "title":"Fuyuki is a baby tagpole girl"
        },
        "1222121212":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "an adult Keron-jin woman",
                "an elderly Keron-jin woman"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fuyuki begins to age rapidly. When the gun is finished changing her, she became...</span></div></span></div>",
            "created":1295758800,
            "id":1040394,
            "title":"age progression"
        },
        "122212122":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Yes please",
                "Uh... no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Keroro accidentally turn Fuyuki into a different alien species.</span></div></span></div>",
            "created":1295758800,
            "id":1040423,
            "title":"Different type of transformation"
        },
        "1222121221":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Viper / Nyororo",
                "a different alien species"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fuyuki just watches in disappointment as her Keron-jin form disappears. She becomes a...</span></div></span></div>",
            "created":1295758800,
            "id":1040430,
            "title":"alien species change"
        },
        "12221212211":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Viper",
                "Nyororo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keroro stares at Fuyuki with a look of terror. Fuyuki looks at herself to see what is wrong, shocked to find she has been turned into one of the Keron-jin species'  worst enemies: a...</span></div></span></div>",
            "created":1295758800,
            "id":1040432,
            "title":"Viper or Nyororo"
        },
        "12221212212":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Angolan",
                "Axolotlian (Sumomo's species)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which alien species does Fuyuki get turned into?</span></div></span></div>",
            "created":1295758800,
            "id":1040436,
            "title":"a different alien species"
        },
        "122212122121":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "someone approaches the duo",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Fuyuki looks at herself as soon as the transformation is complete; she seems to have turned back to normal. Before she says anything, she suddenly felt like she needed to check again. This time she notices something different; the boys clothes she had on before had been replaced by a strangely familiar attire, which consisted of a purple and white costume with a violet cape and what feels like a crown on her head.<br>\r\n\"I became just like Mois-chan,\" Fuyuki says surprised, feeling awkward from wearing a copy of her friend's clothes. Keroro snickers a bit from her embarrassment. Other than the clothes, he did not mind too much about her new form. The only other difference she can think of for her new form is whatever biological differences Angolans and Pekopon-jins may have from each other. She looks the same she did when Keroro first bent her, formally his, gender, just with an attire Pekopon-jins would call \"unusual\". Before either Fuyuki or Keroro know it, ...</span></div></div>",
            "created":1295758800,
            "id":1040443,
            "title":"Angol Fuyuki"
        },
        "1222121221211":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                " Mois",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fuyuki and Keroro hear someone approaching. Before Fuyuki could hide, ___ saw them.</span></div></span></div>",
            "created":1316667600,
            "id":1192875,
            "title":"someone approaches the duo"
        },
        "12221212212112":{
            "choices":[
                "yes",
                "no someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was is fuyuki's sister</span></div></span></div>",
            "created":1326690000,
            "id":1259686,
            "title":"someone else"
        },
        "1222121221212":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "started to act more like Mois",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Fuyuki was thinking about her situation, she immediately ____ .</span></div></span></div>",
            "created":1316667600,
            "id":1192883,
            "title":"something else"
        },
        "12221212212121":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Mois",
                "Natsumi"
            ],
            "content":"<div class=\"\"><div> <span>Keroro alters the settings of the transformation ray gun. He points the gun at Fuyuki, preparing to turn her back. However, upon pulling the trigger, they hear a beeping noise instead. A text appears on the setting screen: \"Subject genetically unstable. Wait 24 hours for reuse.\"<br>\r\n\"What does it say, Gunsou?\" the new Angol girl asks the frog-like alien.<br>\r\n\"Uh... I think you are stuck like this for a while.\" Keroro covers his face, preparing for a beating like that from Natsumi.<br>\r\n\"You could say, there is no way out?\" Fuyuki utters, before covering her mouth, realizing what she said. She is becoming more like Mois with each passing second. \"This is bad.\" Out of nowhere, ___ approaches the duo.</span></div></div>",
            "created":1338872400,
            "id":1353458,
            "title":"Fuyuki starts to act more like Mois"
        },
        "122212122121211":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Mois hugs Fuyuki, happy to have a new sister",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Oji-sama!\" Mois appears spontaneously from the front door, coming to check on the progress of the invasion. Before she says anything else, she stares curiously at Fuyuki.<br>\r\n\"Mois-chan, I...\" Fuyuki tries to explain.<br>\r\n\"Fuyuki? You look just like me.\" Mois says with curiosity still radiating from her eyes. Before Fuyuki can say anything, ...</span></div></div>",
            "created":1338872400,
            "id":1353610,
            "title":"Mois"
        },
        "1222121221212111":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "actually likes the idea",
                "is not interested"
            ],
            "content":"<div class=\"\"><div> <span>Fuyuki is surprised to feel Mois embrace her. Keroro just stares at the two girls. While Mois shows affection, Fuyuki tries to free herself from her strong grasp to breath. About ten seconds later, Mois finally releases Fuyuki. \"What was that for, Mois-chan?\"<br>\r\n\"We look like sisters. You could say, two peas in a pod?\"<br>\r\n\"Sisters?\" Fuyuki asks whether he heard her correctly. Thinking about it, she...</span></div></div>",
            "created":1338958800,
            "id":1353637,
            "title":"Sister"
        },
        "12221212212121111":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "let's do things Pekoponian girls do",
                "let's destroy a planet together (she gets carried away)"
            ],
            "content":"<div class=\"\"><div> <span>Being an enthusiast of the occult, Fuyuki actually takes the idea into thought.Ever since she befriended Keroro, she got to experience life alongside aliens. But now, she gets to do that as an alien, an alien whose species has the power to destroy planets to be precise. Plus, whether she is willing to admit it or not, she is starting to adapt to being a girl. \"You could say, splitting image?\" Fuyuki confirmed to Mois. She covered her mouth from saying that while Mois giggles. Fuyuki is still going to have to get used to talking like Mois as well as looking like her.\"What do you want to do... sis?\" Fuyuki asks, feeling it is somewhat weird for referring to someone other than her actual sister, Natsumi, as her sister. Regardless, she is enjoying her situation so far.<br>\r\n\"Let's see,\" Mois utters to herself. She thinks about it for a second before answering...<br>\r\n</span></div></div>",
            "created":1338958800,
            "id":1354131,
            "title":"Fuyuki actually likes the idea"
        },
        "122212122121211111":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "a shopping mall",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mois grabs her new sister's hand and drags her some place else for some girl time. She takes Fuyuki to...</span></div></span></div>",
            "created":1435545660,
            "id":2000484,
            "title":"Let's do things Pekoponian girls do"
        },
        "122212122122":{
            "author_id":"mysterykid18",
            "author_name":"Mysteryguy18",
            "choices":[
                "I'm sure",
                "No, new species please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure you want an axolotlian Fuyuki?</span></div></span></div>",
            "created":1451009640,
            "id":2079090,
            "title":"Loophole"
        },
        "1222122":{
            "author_id":"flame432",
            "author_name":"christis",
            "choices":[
                "yes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you know what gunsou no need to change me back i like being a female keronjin in fact why dont you make me an honerary member of the armpit platoon</span></div></span></div>",
            "created":1334552400,
            "id":1317063,
            "title":"doesn't mind this extra change"
        },
        "12221221":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "a private on par with Tamama",
                "an assistant on par with Mois"
            ],
            "content":"<div class=\"\"><div> <span>Keroro is shocked to hear the current Lady Fuyuki say that. After getting over the fact, he takes her request into consideration. Keroro likes the idea, figuring that he could use her to take down Natsumi. After finishing his thoughts, Keroro recruits \"Fuyuyu\" as...</span></div></div>",
            "created":1353992400,
            "id":1477030,
            "title":"Welcome to the platoon"
        },
        "122212212":{
            "author_id":"mecham",
            "author_name":"mecham",
            "choices":[
                "After finishing the back yard....",
                "Attack of the Tamama"
            ],
            "content":"<div class=\"\"><div> <span>\"Gunsou, why are we in the back yard?\" Fuyuyu asked.<br>\r\n<br>\r\n\"Well, Natsumi asked me to clean the yard today, but I just got a new Gundam model that I just couldn't say no to\", Keroro replied.<br>\r\n<br>\r\nFuyuyu face turned pale, \"Wait...so that means-?\"<br>\r\n<br>\r\n\"Yep. You're now Mois's official assistant in all things that I need. And if you do a good job, I might even through you a bone once in a while\", Keroro said as he stretched himself. Then he proceeded to skip away to his room calling out, \"Whelp that's it for now, welcome to the platoon Fuyuyu! I'll be in the base if you need me\"<br>\r\n<br>\r\n\"Gunsou,wait!\" Fuyuyu cried but Keroro was too far gone as he closed the door behind him.<br>\r\n<br>\r\n\"Well now what?\" Fuyuyu said aloud to herself when she heard another voice, \"Uncle Keroro?\"<br>\r\n<br>\r\nFuyuyu turned around to see Mois in her usual Earth attire with a rake in one hand and a garbage bad in the other.<br>\r\n<br>\r\n\"Oh, hello, who are you? Have you seen my Uncle anywhere? He would look almost like you, except not a female and no tail\", Mois said, \"Wait, I don't think we've met before, I'm Moi\"<br>\r\n<br>\r\n\"Oh, don't be silly Mois. We've met before. I'm-\" Fuyuyu stopped herself before she realized Mois hadn't met her as this form. She cleared her throat and retorted quickly, \"Gunsou-san's new...er...lackey...for you?\"<br>\r\n<br>\r\n\"Oh...Really? That's great!\" Mois said handing Fuyuyu a smaller rake and trash bad, \"Keroro always said we could use some more help in regards to the invasion. Well, every bit counts. These leaves aren't going to rake themselves\". And with uncharacteristc cheerfullness, Mois proceeded to work on the garden.<br>\r\n<br>\r\n\"Why do I get the feeling that Gunsou-san is trying to get out of his chores again?\" Fuyuki asks as he helps Moi. Meanwhile, from across the way, both Moi and Fuyuyu are being spied on.<br>\r\n<br>\r\n\"What's going on here? Why is Gunsou-san hiring another female into the platoon? Can't he see that we were wade for each other! I'm the only lackey he's ever going to have! I've had enough! I MUST DESTROY THEM ALL!!!!</span></div></div>",
            "created":1353992400,
            "id":1477130,
            "title":"an assistant on par with Mois"
        },
        "12221222":{
            "author_id":"mysterykid18",
            "author_name":"Mysteryguy18",
            "choices":[
                "Fuyuki agrees",
                "Fuyuki refuses"
            ],
            "content":"<div class=\"\"><div> <span>Keroro thought to himself, <i>'Hmm...if we pretend that Fuyuki is my girlfriend visiting me from Keron, then Giroro and Natsumi will have to treat me with respect! Plus, everyone will think I'm so cool for having a long distance relationship! Kerokerokero!'</i><br>\r\n<br>\r\nKeroro coughed into his hand, \"Sorry, buddy, but can't do that. The others would figure it out way to fast if some random Keronian girl showed up without a message from HQ and became a member.\"<br>\r\n<br>\r\nFuyuki looked down, \"Oh, that makes-\"<br>\r\n<br>\r\nKeroro interrupted, \"However!\" Fuyuki looked up at him, \"If we pretend that you're my girlfriend who has come to visit me and support the invasion, we'll be able to fool them. What do you say?\"<br>\r\n</span></div></div>",
            "created":1540924920,
            "id":2570729,
            "title":"Girlfriend"
        },
        "124":{
            "author_id":"mysterykid18",
            "author_name":"Mysteryguy18",
            "choices":[
                "Keronian",
                "Viper",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a keronian or a viper?</span></div></span></div>",
            "created":1451009820,
            "id":2079094,
            "title":"Which species?"
        },
        "125":{
            "author_id":"cobraman",
            "author_name":"Jusenkyo",
            "choices":[
                "panties :)",
                "gum",
                "other things"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about inaniment objects that have his thoughts and sences.</span></div></span></div>",
            "created":1316667600,
            "id":1192892,
            "title":"other choices"
        },
        "1252":{
            "author_id":"cobraman",
            "author_name":"Jusenkyo",
            "choices":[
                "contiue with Mother and son boding",
                "see the frogs cause more havoc"
            ],
            "content":"<div class=\"\"><div> <span>Guro Guro he though before leaving the poor boy to be gum sitting on the desk. the gum on the other hand was wondering what was going on he was reading when suddenly he was staring at the celing and couldn't move. then he saw his mother enter the room.<br>\r\n<br>\r\nAki PoV <br>\r\n<br>\r\nshe had seen a the Sargent sneaking back from her sons room so she dicided to check it out. when she got there nothing was there. \"AWW, and i wanted to see something good too. she pouted and then she saw the gum sitting on the open book ' must have left some gum out, i'm sure he wouln't mind' she said as she popped the pice into her mouth. 'mmm, this has a wonderful flavor i hope it never runes out'</span></div></div>",
            "created":1333947600,
            "id":1312301,
            "title":"gum"
        },
        "13":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "age regression",
                "shrinkage",
                "Keron TF",
                "inanimate object",
                "expansion"
            ],
            "content":"<div class=\"\"><div> <span>\"Gero gero,\" Keroro laughed to himself as he smiled from his ingenious plan. If he controls the alpha member of family, who is obviously Aki, then he be able to have Natsumi and Fuyuki bowing under his knees, if that's even physically possible considering his small stature. He even overheard from Natsumi that she will be home tonight from her long job. Just thinking of this made his smile larger and more sinister.<br>\r\nKeroro hid in a bush on the front of the house when Aki arrived. She took off her motorbiking helmet and headed to her home. Before Aki could reach the door knob, though, she saw a shining light from the same bush. All she can do is endure the strong sensation all over her body. Keroro has the gun set to...<br>\r\n</span></div></div>",
            "created":1254286800,
            "id":768491,
            "title":"Aki Hinata"
        },
        "131":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Baby",
                "5 Year old",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Aki was shrinking into her clothing &amp; getting younger. But how young would she get?</span></div></span></div>",
            "created":1254373200,
            "id":768829,
            "title":"Aki's Youth restored"
        },
        "1311":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "like a baby (mental settings are on)",
                "somewhat angry and scared",
                "happy (if you knew Aki, this would actually make some sense)"
            ],
            "content":"<div class=\"\"><div> <span>Even though the regressing feeling was familiar to her due to previous experiences as a teenager, then a little kid, she isn't exactly ready for this. This time she could barely move and everything looked much larger to her. Aki scanned herself, somewhat shocked to find she is now an infant. The adult muscles she once has seemly vanished; she now a lot of baby fat, but not enough to look chubby. Her adult clothes vanished, replaced by a little green dress covering what felt like a diaper. She can't help but feel...</span></div></div>",
            "created":1254373200,
            "id":768863,
            "title":"From motherhood to babyhood"
        },
        "13111":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "moved on his next victim",
                "abducted the infant"
            ],
            "content":"<div class=\"\"><div> <span>It only took her a few seconds before Aki lost her adult mind. A blank stare entered her eyes. She sucked her thumb and aimlessly gazed at the world around her.<br>\r\nKeroro smiled heavily to himself. He believed he might even actually succeed this time. Now that that step was finished, he...</span></div></div>",
            "created":1254373200,
            "id":768867,
            "title":"Aki acts like a baby"
        },
        "131111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Natsumi",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He'd take care of Aki later. Right now, he decided to use the weapon on someone else...</span></div></span></div>",
            "created":1254978000,
            "id":772263,
            "title":"Keroro will choose another victim"
        },
        "1311111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Make her a baby!",
                "No, make her some other age/ TF"
            ],
            "content":"<div class=\"\"><div> <span>Next he decided to go after Natsumi, since she was the one who was always giving Keroro trouble &amp; forcing him to do chores for the Hinata family. Maybe he could make Natsumi a baby like her mom. That way, she'd be helpless under him &amp; he could do whatever he wanted with her (Although he figured Giroro, who has a crush on Natsumi, would get onto him for this, maybe he could use it on him if he ever did that). Should he make her a baby or another age or even another transformation?</span></div></div>",
            "created":1255496400,
            "id":775975,
            "title":"Natsumi's Next!"
        },
        "13111112":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Another age (specify)",
                "Another Transformation (specify)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Keroro could make her some other age than a baby, or even a completely different transformation...</span></div></span></div>",
            "created":1255496400,
            "id":775973,
            "title":"Another age/ transformation?"
        },
        "1311112":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Fuyuki",
                "Next choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Natsumi's brother, Fuyuki?</span></div></span></div>",
            "created":1254978000,
            "id":772264,
            "title":"Fuyuki?"
        },
        "13111121":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Sure, throw Natsumi into this!",
                "Nah, just Fuyuki."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about both the Hinata siblings?</span></div></span></div>",
            "created":1254978000,
            "id":772266,
            "title":"Brother & Sister"
        },
        "131111211":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Age Regression",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He figured since he did the \"general\" of the house, he might as well do the \"subordinates\". So what does he decide to do with them?</span></div></span></div>",
            "created":1259816400,
            "id":800661,
            "title":"The Hintata siblings"
        },
        "1311112111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Babies, like Aki now is",
                "Another age"
            ],
            "content":"<div class=\"\"><div> <span>He decided to regress the two teens as well, so he quickly snuck in &amp; peeked in on them. He saw that they were waiting around for their mother, &amp; were completely oblivious to the fact that she was now on their front lawn as a tiny baby. \"They don't suspect a thing, Gero Gero Gero\" he snickered to himself.<br>\r\n<br>\r\nAround that point, they were both slowly starting to wonder what happened to their mom. But their thoughts were interrupted when they were stricken by a beam of light. Keroro had set the features &amp; had just fired on them. They began to shrink into their clothes &amp; get younger as they became...</span></div></div>",
            "created":1259816400,
            "id":800666,
            "title":"Natsumi & Fuyuki get regressed next"
        },
        "13111121111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Like normal babies (Mental Settings were on)",
                "Other moods"
            ],
            "content":"<div class=\"\"><div> <span>Natsumi &amp; Fuyuki had no idea what was going on in the light, although the changes they went through at that point felt very familiar. When the light faded, they got a better look. Everything was now larger &amp; it was pretty difficult to move at that point. They looked at themselves &amp; were surprised they had regressed all the way down to infancy, which had never happened before. They had a fair amount of baby fat &amp; their old clothes disappeared &amp; were replaced by more age-appropriate attire. Natsumi was in a little pink dress &amp; Fuyuki was in a teal romper, both of them covering what felt like diapers. At this point, they were now feeling...</span></div></div>",
            "created":1259816400,
            "id":800674,
            "title":"Baby Natsumi & Fuyuki"
        },
        "131111211111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Aki became happy (She now had some friends to play with)",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Only a few seconds after the transformation, the two baby siblings lost their previous minds as blank stares entered their eyes. Natsumi laid down on her back &amp; began to suck on her toes. Fuyuki started slowly crawling around &amp; gazing at everything around him.<br>\r\n<br>\r\nKeroro sat in the shadows, pleased with what he did. \"Now all three of them are babies,\" he said quietly to himself, \"And they will be powerless to stop me from starting off the invasion. I wonder, though, if I should try something else out or go with this plan to turn every Pekoponian into babies, rendering them helpless. Gero?\" At that point, he noticed something.<br>\r\n<br>\r\nAki had crawled up the stairs &amp; into the house where she saw the two babies that Keroro just regressed Natsumi &amp; Fuyuki into. Around this point...</span></div></div>",
            "created":1259816400,
            "id":800680,
            "title":"Mentally infants as well"
        },
        "1311112111111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Try another function on them.",
                "Capture them somehow."
            ],
            "content":"<div class=\"\"><div> <span>When Aki, now a baby both physically &amp; mentally, saw her two children as infants as well, she didn't know that those were Fuyuki &amp; Natsumi. She just saw two babies that she could play with. With that, she had a cute little smile on, she cooed \"Ah!\" in a sweet tone, &amp; began to crawl over to where the other two were. <br>\r\n<br>\r\nSoon, all three babies were playing &amp; babbling with each other. Keroro had gotten so focused on them, that he nearly forgot what he was doing there. \"Nearly lost my train of thought for a second from watching them,\" he thought, \"Ok, what do I do with them now? I have yet to try some of these other functions out, so I could use this gun on them again, but I could also capture them somehow to keep them under control. Wouldn't want THEM tampering with anything we may have planned...\"<br>\r\n<br>\r\nWhat should he do?<br>\r\n<br>\r\n</span></div></div>",
            "created":1274504400,
            "id":887332,
            "title":"Aki became happy (She now had some friends to p..."
        },
        "13111121111111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Animal TF",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are some other things that Keroro could try out on the infant Hinatas?</span></div></span></div>",
            "created":1382850000,
            "id":1685087,
            "title":"Try another function on them."
        },
        "131111211111112":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Sure",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about shrinking them?</span></div></span></div>",
            "created":1382850000,
            "id":1685089,
            "title":"Other"
        },
        "1311112111111122":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Sure",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe there's a function that could turn them into stuffed toy dolls.</span></div></span></div>",
            "created":1423285200,
            "id":1928986,
            "title":"No"
        },
        "13111121111111222":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Inanimate Object",
                "Another function"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps they could be turned into another inanimate object.</span></div></span></div>",
            "created":1423285200,
            "id":1928987,
            "title":"Nah"
        },
        "1311112111112":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Aki, Natsumi, and Fuyuki could communicate with each other. True, in their state, they can't talk normally, but they could either communicate through their thoughts and actions or they could speak in baby talk which only they could understand (though it will be translated for all the curious viewers out there.) Keep in mind that their mentality has been regressed as well, so they don't know who they were before this happened.<br>\r\n<br>\r\nShould they be able to communicate with each other?</span></div></div>",
            "created":1384146000,
            "id":1693122,
            "title":"Something else"
        },
        "1311112112":{
            "author_id":"dragonwriter45",
            "author_name":"Dragonwriter45",
            "choices":[
                "Age Progression",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Keroro accidently age Natsumi and Fuyuki?</span></div></span></div>",
            "created":1295413200,
            "id":1038148,
            "title":"Something else"
        },
        "13111122":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Both Natsumi & Fuyuki",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He might do Natsumi &amp; Fuyuki together, or he could do someone else...</span></div></span></div>",
            "created":1269925200,
            "id":859282,
            "title":"Next Choice"
        },
        "131111222":{
            "author_id":"dragonwriter45",
            "author_name":"Dragonwriter45",
            "choices":[
                "Koyuki",
                "Someone different"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Matybe Koyuki could be a good test subject?</span></div></span></div>",
            "created":1298264400,
            "id":1058059,
            "title":"Other"
        },
        "131112":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Use her as a hostage",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>He figured now that she was in this helpless state, he could abduct her easily. From there, he would decide what to do with her. <br>\r\n<br>\r\nKeroro snuck up behind Baby Aki, who was still sucking her thumb and gazing at her environments, wrapped his arms under Aki's armpits and picked her up. Aki, not seeing Keroro, could feel herself being lifted off the ground with a little difficulty. Keroro discovered to his surprise that human infants are harder to carry than he imagined, especially with his smaller stature. Soon, due to the weight he was carrying, he lost his balance and fell on his back. Aki didn't get hurt, though, since the frog-like alien she didn't see carrying her had cushioned her fall.<br>\r\n<br>\r\nKeroro picked himself up quickly and dragged the baby from view of the front lawn. He hid in the bushes and set Aki down in his lap. Aki was still looking around in wide-eyed wonder, while Keroro was trying to think of what he could do with her.</span></div></div>",
            "created":1254459600,
            "id":769295,
            "title":"abducted the infant"
        },
        "1311122":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Try another feature on her",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could Keroro do with Baby Aki?</span></div></span></div>",
            "created":1279947600,
            "id":923580,
            "title":"Something else"
        },
        "13111222":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Aki notices Keroro & takes an interest in him",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could possibly happen?</span></div></span></div>",
            "created":1280034000,
            "id":924328,
            "title":"Something else"
        },
        "131112221":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Pick her up & carry her, in spite of all this",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>At that point, Aki turned around &amp; saw Keroro. She smiled &amp; cooed happily, then grabbed Keroro's cheeks &amp; began pulling on them, causing his face to stretch &amp; distort as she giggled &amp; laughed at how funny Keroro looked. She eventually pulled Keroro forward &amp; gave him a big kiss on his mouth. Keroro pulled her off &amp; begin wiping at his face in disgust.<br>\r\n<br>\r\nAki then began squealing with joy as she lunged forward &amp; hugged the Keronian. This startled Keroro, who was caught off guard by the child's action. Aki really seemed to like the feel of his body (apparantly, she must've liked the moist feeling of his skin) as she didn't seem to let go. Soon, she began to fall asleep while holding on to him. Keroro tried to stand up carefully, so as to not disturb her, but she was still attached to him, clinging onto him as her legs dangled down. Keroro quickly sat back down before she slid off. He tried to pry her small arms off, but they had a surprisingly tight grip on him.<br>\r\n<br>\r\n\"This is gonna be harder than I thought,\" Keroro said, looking at the tiny Pekoponian sleeping peacefully close to him.<br>\r\n<br>\r\nWhat should he do now?</span></div></div>",
            "created":1283230800,
            "id":947900,
            "title":"Aki notices Keroro & takes an interest in him"
        },
        "1311122212":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Shrink her!",
                "Nah, maybe something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keroro felt that shrinking Baby Aki to a smaller size would make her easier to carry. Looking at the gun he previously used on her to make her a baby, he set the size dial to make her small enough. But should he go through with it?</span></div></span></div>",
            "created":1288933200,
            "id":987317,
            "title":"Shrink the Baby?"
        },
        "13111222121":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Check on Natsumi & Fuyuki (with Anti-Barrier on)",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>He decides to go through with it. Having set the dial, he fired at the tiny baby gripping on her. Instantly, Aki began to get smaller &amp; smaller in size as her grip got more &amp; more loose. Surprisingly, throughout all this, she was still asleep. Finally, she became as small as one of Keroro's gunpla models, so Keroro could finally stand up again. He picked up the tiny Baby Aki &amp; held her close, then he sneaked out of the bushes. As he did all this, he was trying to think of where to go next. He at least knew that the invention was working, but he figured that Natsumi &amp; Fuyuki would be wondering where their mother went. Should he check on them or not?</span></div></div>",
            "created":1289019600,
            "id":988077,
            "title":"Shrink her!"
        },
        "131112222":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Aki could slip out when Keroro's not looking and crawl around some?</span></div></span></div>",
            "created":1423285200,
            "id":1928985,
            "title":"Something else"
        },
        "13113":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "cried to get someone's attention",
                "ended up getting captured by Keroro before she could do anything"
            ],
            "content":"<div class=\"\"><div> <span>Strangely, Aki was actually somewhat happy like this. Now she could have a break from her job and spend some time with her kids-now-older-siblings. Plus, being the daring, adventurous ex-woman she is, she could use this event to find inspiration for new manga.<br>\r\nHowever, she knew deep-down that this shouldn't happen and she could be in danger. She...</span></div></div>",
            "created":1254373200,
            "id":768870,
            "title":"happy (if you knew Aki, this would actually mak..."
        },
        "131131":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Natsumi & Fuyuki",
                "Keroro (He was trying to get her to stop)"
            ],
            "content":"<div class=\"\"><div> <span>Since Aki was now unable to talk, she tried to get someone's attention the best way she could at this state: crying. Her mouth turned down for a little bit, she began to moan and whine, and eventually she managed to build up a full-blown wail.<br>\r\n<br>\r\n\"...uuuuUUHHWAAAAAAAAAHHHHH!!!\"<br>\r\n<br>\r\nWho came to her?</span></div></div>",
            "created":1382418000,
            "id":1682769,
            "title":"cried to get someone's attention"
        },
        "1311312":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Keroro managed to keep a hold of her",
                "Aki slips out of his grasp"
            ],
            "content":"<div class=\"\"><div> <span>Afraid that his actions would be noticed, Keroro quickly hid the gun and ran over to Aki, who was still crying and wailing. <br>\r\n<br>\r\n\"Mama-domo! Shhhh! Please be quiet! Don't cry! Don't cry!\" Keroro said gently. <br>\r\n<br>\r\nAki stopped bawling when she heard the familiar voice of the Keronian, and when she saw him put his hands on her shoulders as if to comfort her, she calmed down very quickly.<br>\r\n<br>\r\n\"There now,\" Keroro said to the baby girl as he began to wipe her tears away with his hand. Not long after that, Aki wrapped her arms around Keroro in a tight hug. Suddenly, Keroro heard a voice.<br>\r\n<br>\r\n\"Hello?\"<br>\r\n<br>\r\n\"Uh-Oh.\"<br>\r\n<br>\r\nIt was Fuyuki. He had heard the crying and was curious of the source, but he didn't see anyone. That was because Keroro barely managed to drag Baby Aki into the bushes where he was hiding before Fuyuki could see either of them. Aki, however, wanted to see her son, so she struggled to break free from Keroro's hold, but Keroro gripped her as tightly as he could.<br>\r\n<br>\r\nDoes Keroro keep his hold on Aki, or does Aki manage to get free from it?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1382850000,
            "id":1684944,
            "title":"Keroro tries to get her to stop crying"
        },
        "1313":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Newborn",
                "Teenager",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options for regression</span></div></span></div>",
            "created":1269925200,
            "id":859280,
            "title":"Other"
        },
        "13133":{
            "author_id":"normjr",
            "author_name":"kingler",
            "choices":[
                "yes",
                "no different age."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a 2 year old, old enough to walk and say a few words, but not old enough to have any sort of power over the platoon.</span></div></span></div>",
            "created":1398747600,
            "id":1789045,
            "title":"Other"
        },
        "131331":{
            "author_id":"normjr",
            "author_name":"kingler",
            "choices":[
                "giggle",
                "cry."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Here we go dynamite woman\" the frog said aiming the gun and firing it in a flash the ** year old woman was replaced by a toddler in an over sized out fit, she blinked a couple times before starting to...</span></div></span></div>",
            "created":1413694800,
            "id":1874206,
            "title":"yes"
        },
        "1313311":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "On",
                "Off"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One other thing first, will the mental setting be on or off?</span></div></span></div>",
            "created":1415595600,
            "id":1884237,
            "title":"giggle"
        },
        "1313312":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "On",
                "Off"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One other thing first, will the mental setting be on or off?</span></div></span></div>",
            "created":1415595600,
            "id":1884238,
            "title":"cry."
        },
        "131332":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Sure",
                "Nah, something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about she gets regressed to before she was born?</span></div></span></div>",
            "created":1435435080,
            "id":1999791,
            "title":"Pre-birth"
        },
        "133":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "on",
                "off"
            ],
            "content":"<div class=\"\"><div> <span>Aki rapidly shrinks from her normal, tall figure; she becomes smaller than Fuyuki and Natsumi and eventually reduces to Keroro's size. Her skin changes into that of a lighter green than Keroro's amphibious skin. From behind, she sprouts a tadpole tail to represent her new keronian femininity. Another second passes before the rest of the necessary changes take place. Throughout the transformation, the TF gun's mental change setting was set to ___.</span></div></div>",
            "created":1316667600,
            "id":1192896,
            "title":"Keron TF"
        },
        "1331":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "yes, Natsumi won't stand a chance",
                "no, that will backfire somehow",
                "something else will happen"
            ],
            "content":"<div class=\"\"><div> <span>Aki looks around the area as if to analyze what has happened. She then looked at Keroro and jumped. Immediately, she gives him a proper salute. \"Private Akiki, reporting for duty, sergeant!\"<br>\r\n\"Gero gero,\" Keroro mutters, smiling from his success. 'Step 1 is complete,' Keroro thinks to himself, 'now that Mama-dono is and thinks she is a keronian like myself, I can use her to take down Natsumi-dono... and force her to give me back my precious Gumpla!' Akiki has kept her salute while Keroro was in his train of thought. Noticing her presence once more, he looks towards her.<br>\r\n\"Alright, private. I have a mission for you: if you see a certain red-haired girl around these parts, I want you to take her down and bring her to me! Is that understood?\"<br>\r\n\"Yes, sir!' Akiki shouts enthusiastically. Will Keroro equip Akiki with the TF gun to fight against Natsumi?</span></div></div>",
            "created":1316667600,
            "id":1192900,
            "title":"Private Akiki"
        },
        "13313":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "\"I need to inject you once every two hours!\"",
                "\"You may start to think you are a Pekoponian!\""
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden, Kululu appeared from behind Akiki and said, \"Far be it from me to unintentionally throw cold water on your scheme, but won't this new recruit of yours draw too much suspicion from the children, especially when their mother mysteriously disappears? What do you think they, particularly Natsumi, will do to you when they put two and two together?\"<br>\r\n<br>\r\nKeroro got a scared look on his face and thought, \"Oh, no! I never thought of that! What am I going to do?!\"<br>\r\n<br>\r\nKululu then chuckled and said, \"Don't worry about it, Sergeant. I've got a solution for this.\" Before either Keroro or Akiki could ask what, Kululu pulled out a syringe and stuck it in Akiki's arm.<br>\r\n<br>\r\n\"Hey, what are you--\" Keroro was about to say, but then he noticed Akiki growing taller while being covered in a blinding light. When the light receded, Akiki looked just like she was before, Aki Hinata, the mother of the Hinata family.<br>\r\n<br>\r\n\"No! Kululu, what did you do?\" Keroro asked while shaking Kululu. However, he stopped when he heard a surprised gasp escape from Aki's lips.<br>\r\n<br>\r\nKeroro looked up to see Aki staring at her body, especially playing with her boobs, while saying, \"This is incredible, Sergeant! I look like a Pekoponian woman now!!\"<br>\r\n<br>\r\nKululu chuckled as he said, \"I injected you with the genetic material of Aki Hinata so you could take on her appearance to carry out your mission, Private Akiki.\"<br>\r\n<br>\r\nAki picked up Kululu and squeezed him against her boobs, screaming, \"Thank you, Kululu! This is incredible!!\" She then dropped Kululu, saluted to Keroro and said, \"Don't worry, Sergeant! The red-haired girl will be yours in no time!\"<br>\r\n<br>\r\nKululu chuckled again as he said, \"Don't get ahead of yourself, Private; there is a catch to the injection.\"</span></div></div>",
            "created":1362632400,
            "id":1545428,
            "title":"something else will happen"
        },
        "133131":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "The TF Gun",
                "A different machine"
            ],
            "content":"<div class=\"\"><div> <span>\"What?\" Aki asked, now back to keeping her hands playing with her breasts.<br>\r\n<br>\r\nKululu chuckled as he said, \"Well, in order to keep the transformation up, I need to inject you with the woman's genetics every two hours.\"<br>\r\n<br>\r\n\"WHAT?\" Aki cried. She then lifted Kululu and squeezed him against her breasts. \"Please find another way for me to keep this body! I want to keep my sweater puppies!!\"<br>\r\n<br>\r\nKululu chuckled again, muffled by Aki's breasts. He then lifted his head and said, \"Well, there is one other way.\"<br>\r\n<br>\r\n\"Really?\" Aki asked still keeping Kululu between her breasts. \"What is it?\"</span></div></div>",
            "created":1362718800,
            "id":1546108,
            "title":"Continuous Injections"
        },
        "1331312":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "The MULTI TF GUN",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>Kululu took from behind his back what it looked like a bracelet, then chuckled <br>\r\n<br>\r\n\"If you put this bracelet on your wrist you will stay in that Pekoponian form for an entire day, but after that I'll have to recharge it for an hour. What do you say Akiki?\" Kululu asked<br>\r\n<br>\r\nAkiki then grabbed Kululu and Keroro and started squishing them on her boobs and said \"Oh thank you Kululu, thank you.\" After that she put Kululu down and asked Keroro with puppies eyes \"Sir you don't mind if I stay like this a little bit longer do you?\"<br>\r\n<br>\r\nKeroro grinned and said \"Gero gero gero of course not private Akiki, we could use you as our perfect camuflage for our invasion, besides there a lot of advantages in keeping you in that Pekoponian form\" Keroro said by constantly admiring private Akiki's body<br>\r\n<br>\r\n\"Thank you sir, thank you\" Akiki said by giving another squish hug to her sergeant. After putting Keroro down Akiki went to Kululu and asked<br>\r\n<br>\r\n\"Can I have the bracelet now?\" <br>\r\n<br>\r\nKululu chuckled and said \"Of course private, here it is\" and with that he gave her the bracelet. Akiki immediately took it and she put it on. After that the bracelet kind acted like a mini computer, emitted a few lights and then it stopped<br>\r\n<br>\r\nKululu chuckled again and said \"Perfect, it's working\" <br>\r\n<br>\r\nAkiki was overjoied, and after a few bounces of happines, she did a salute once again \"Thank you sir. I will not fail your mission: the red hair Pekoponian girl will be your\" <br>\r\n<br>\r\nGeroro grined and then said \"Gero gero gero, I'm counting on you private Akiki. Here you can have this to help yu with your mission\" Keroro said by giving her </span></div></div>",
            "created":1398661200,
            "id":1788182,
            "title":"A different machine"
        },
        "13313121":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "Keroro has a plan",
                "Free choice of private Akiki",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>\"Gero gero, here private, use this on the Pekoponian Natsumi\" Keroro said by giving his new subordinate the gun<br>\r\n<br>\r\nAkiki took the gun from her sergeant's hands and then started to sensually moan by huging that weapon<br>\r\n<br>\r\n\"Oh thank you so much sir for trusting me. Do I have orders on how to use this on the target, or am I free to go\" Akiki asked</span></div></div>",
            "created":1398747600,
            "id":1788622,
            "title":"The MULTI TF GUN"
        },
        "133131212":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "body expansion ",
                "Keron TF once again",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>\"I trust you private Akiki, gero gero gero. Make sure that The target Natsumi will become a masterpiece\"Keroro said while grinning<br>\r\n<br>\r\n\"Aye aye Sir\" Akiki said by saluting her superior and after that she put the gun on her shoulder and started walking like a soldier to the house. <br>\r\n<br>\r\nOnce inside she studied her weapon and then decided what option activate \"This will be perfect, I'm sure the sergeant will be very pleased, ki ki ki ki\" Akiki said while giggling<br>\r\n<br>\r\n1 hour later<br>\r\n<br>\r\nThe door of the house opened and Natsumi entered the house \"I'm home\" she screamed, but right after that she noticed that her mother was right in front of her, with her hands behind her back.<br>\r\n<br>\r\n\"Mom, I knew you were home early tonight but I didn't thought this early\" Natsumi said after putting her schoolbag down and approaching her mother.<br>\r\n<br>\r\n\"Oh well, you know how the work of a manga's writer is, sometimes you cannot go home until midnight, sometimes you just have half a day\" Akiki responded tring to sound as Pekoponian as possible.<br>\r\n<br>\r\nAfter that chat, Natsumi noticed her mother's hands and asked \"What are you hidding behind your back mum? Is it a present?\" Natsumi asked hoping<br>\r\n<br>\r\n\"You got it Natsumi, and it's for you\" Akiki said smiling<br>\r\n<br>\r\n\"REALLY? What is it mum?\" Natsumi asked excited<br>\r\n<br>\r\n\"THIS\" Akiki said by pointing the gun at Natsumi's face and firing it. Natsumi did't have time to react and was hitted by the shinning beam, that previously hitted her mother as well. After a little, NAtsumi clearly felt a strong sensation all over his body since the gun was set to</span></div></div>",
            "created":1398747600,
            "id":1788682,
            "title":"Free choice of private Akiki"
        },
        "1331312121":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "Appearance alterations",
                "Mental changes",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>Natsumi felt that her body was clearly changing. The first thing she felt was that she was growing in high, in fact in about one minute she was as tall as her \"mother\" was, and her clothes were about to burst because of that sudden growth<br>\r\n<br>\r\n\"What are you doing mum? Is this another... OUCH\" Natsumi tried to say something but then she suddenly felt a huge pain in her chest. She looked down at her tits and noticed that they were growing considerebly, and after a few seconds (and also the fact that she lost about 3 bottoms of her shirt) she had the same blossomed chest that her mother has. Then suddenly<br>\r\n<br>\r\n\"Auch, now what?\" Natsumi said by putting her hands on her ass and felt that it was also growing considerbly and stopped growing only when it was as big as a watermelon. After that Natsumi was so shocked by her new body that she didn't hear her mother say<br>\r\n<br>\r\n\"Okay phase one complete\" and then she activated another function on the gun and then said \"now on to phase two\"  and with that she fired another beam at Natsumi. What will it be this time?</span></div></div>",
            "created":1398834000,
            "id":1789238,
            "title":"A whole new body for Natsumi"
        },
        "13313121212":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "Sergeant Keroro's maid",
                "Sergeant Keroro's clown",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>Private Akiki activated a new function on the gun and then pointed at Natsumi, specificly in her eyes and fired. This time the beam was less shining than the previous one, and also the effect were not visible like the previous one<br>\r\n<br>\r\n\"Okay initiate subliminal waves\" Private Akiki said as she increased the power of the beam, which in a matter of seconds became a lot more powerful starting influencing and manipulating Natsumi's brain. <br>\r\n<br>\r\nAfter about thirty seconds Natsumi expression became completly empty, like the one of a doll, her mind as well as her eyes were now completly blank. The private Akiki smiled at her success and said \"Okay phase two completed, now on to the final phase\" and with that she pressed a button on the gun and from a little pocket of the gun a little micro and an earphoneappeared.<br>\r\n<br>\r\nPrivate Akiki took the micro and put the earphone on Natsumi's ear and then she said<br>\r\n<br>\r\n\"1 2 3 can you hear me?\" Private Akiki said in the micro, while Natsumi nodded<br>\r\n<br>\r\n\"Good listen, whatever I'll tell you, you will be. You are </span></div></div>",
            "created":1400475600,
            "id":1798899,
            "title":"Mental changes"
        },
        "133131212121":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "Yes,Maid Natsumi is born",
                "No, something went wrong",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>\"I am Sergeant Keroro's maid\" Natsumi repeated<br>\r\n<br>\r\n\"Your mission is to serve and please the Keroro platon, especially Sergeant Keroro\" Private Akiki continued<br>\r\n<br>\r\n\"My mission is to serve and please the Keroro platon, especially Sergeant Keroro\" Natsumi repeated<br>\r\n<br>\r\n\"You always smile in front of the Sergeant, and always obey him, no matter how difficult,sensual or degredating his requests are\" Private Akiki continued<br>\r\n<br>\r\n\"I always smile in front of the Sergeant, and always obey him, no matter how difficult,sensual or degredating his requests are\" Natsumi repeated<br>\r\n<br>\r\n\"You are happy when the Sergeant is happy and you'll do whatever it takes to make sure that his mission is a success\" Private Akiki continued<br>\r\n<br>\r\n\"I am happy when the Sergeant is happy and you'll do whatever it takes to make sure that his mission is a success\" Natsumi repeated<br>\r\n<br>\r\n\"Very well, once I'll say the word \"Gero\" these commands will be activate in your head and you will be reborn as Maid Natsumi. Is that understood?\" Private Akiki asked <br>\r\n<br>\r\n\"Yes ma'am\" Natsumi responded         <br>\r\n<br>\r\n\"Very well. Gero\" Private Akiki then said.<br>\r\n<br>\r\nWill the transformation be a success?</span></div></div>",
            "created":1400734800,
            "id":1800321,
            "title":"Sergeant Keroro's maid"
        },
        "1331312121211":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "A french Maid Outfit",
                "A sexy Bikini",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>Natsumi blinked her eyes and after that she saw that Private Akiki was right in front of her<br>\r\n<br>\r\n\"Private Akiki. It's an honor to see you ma'am. How may I serve you?\" Natsumi asked in a very degnified manner to who once was her mother<br>\r\n<br>\r\n\"Yes, it's a complete success\" Private Natsumi said by making a little dance of happiness while watching her former daughter turned into a maid. After that she continues \"Maid NAtsumi, you now have to go to the Sergreant hideout, you have a lot of things to do in order to be forgiven for your past mistakes\" Private Akiki said with a tone of command<br>\r\n<br>\r\n\"Oh no. I have to hurry\" Maid Natsumi said, but once she was about to leave her shirt tore off (because of the growth of her breast). Private Akiki noticed that<br>\r\n<br>\r\n\"Wait\" Private Akiki ordered and then she said \"Dressed like this, you are not fit to see the sergeant. You need a look change\" <br>\r\n<br>\r\nAfter that Private Akiki took a bag on her left and from it she pulled out</span></div></div>",
            "created":1401685200,
            "id":1805831,
            "title":"Yes,Maid Natsumi is born"
        },
        "13313121212111":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "Let's follow Maid Natsumi",
                "Let's stay with Private Akiki",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>\"Here put this on at once\" Private Akiki ordered to Maid Natsumi by giving her a french maid outfit<br>\r\n<br>\r\n\"As you wish Private Akiki\" Maid Natsumi said witha big smile on her face, and after that she started change herself right in front of Private, who took this as a chance to admire the Maid she has created for her sergeant<br>\r\n<br>\r\n\"Mmmhhh, really not bad. The sergeant will be pleased\" Private Akiki thought<br>\r\n<br>\r\nAfter ten minutes, Maid Natsumi was now completly dressed in her new uniform.<br>\r\n<br>\r\n\"I'm ready Private Akiki\" Maid Natsumi said, always smilling and making her boobs bounce.<br>\r\n<br>\r\nAkiki looked at her subject dressed with a black sleevless vest, that really showed her boobs, high black hills, a white apron and on her head a white cap.<br>\r\n<br>\r\n\"Splendid. Go now to the Sergeant and please him in every way he likes. I have to wait in case that lame pekoponian former brother of you shows up and deal with him\" Private Akiki said while ricalibrating her weapon<br>\r\n<br>\r\n\"As you wish Private Akiki\" Maid Natsumi responded by bowing down and after that she headed for Keroro's secret hideout</span></div></div>",
            "created":1401771600,
            "id":1806540,
            "title":"A french Maid Outfit"
        },
        "133131212121113":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "yes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Koyuki show's up and isn't happy about what happened to her friend.</span></div></span></div>",
            "created":1454962380,
            "id":2101437,
            "title":"Other choices"
        },
        "13313121212113":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "A Keroro outfit for prisoners",
                "A manga character outfit",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A few extra choices</span></div></span></div>",
            "created":1401685200,
            "id":1805832,
            "title":"Other choices"
        },
        "133131212121132":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "A Gundam character (reader's choice)",
                "A Macross character (reader's choice)",
                "A character from another manga/anime"
            ],
            "content":"<div class=\"\"><div> <span>Maid Natsumi looked at the outfit and asked, \"Are you sure about this, Private Akiki?\"<br>\r\n<br>\r\n\"Trust me, Sergeant Keroro will love it if you dressed like this!\" Akiki said.<br>\r\n<br>\r\nWith the reassurance, Natsumi smiled at her former mother and said, \"Okay, if you say so, ma'am!\" She then disrobed and dressed up as...</span></div></div>",
            "created":1401685200,
            "id":1806155,
            "title":"A manga character outfit"
        },
        "1331312121212":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "\"Welcome, Sergeant! How may I serve you?\" (with a smile)",
                "\"What the hell did you do to my mother?\""
            ],
            "content":"<div class=\"\"><div> <span>Natsumi blinked, then looked at her \"mother\" and frantically asked, \"Mom, what was that all about? Why do I look like a bimbo?\"<br>\r\n<br>\r\nIn her mind, Akiki panicked. \"Oh, crap! Why aren't the subliminal messages working? Sergeant Keroro is going to be so mad at me for failing!!\"<br>\r\n<br>\r\nNatsumi then looked at Akiki's hands and asked, \"Mom, what's that in your hand?\"<br>\r\n<br>\r\nAkiki quickly put her hands behind her back and said, \"Oh, nothing really important, dear! Why don't you get dressed in new clothes?\"<br>\r\n<br>\r\n\"I would, but because of whatever you're trying to hide, none of my clothes will fit! Fess up; what's going on?\"<br>\r\n<br>\r\nBefore Akiki could respond, she heard another voice from behind her, one she knew all too well. <br>\r\n<br>\r\n\"Ah, Private Akiki! How's the acquisition of the Pekoponian Natsumi coming along?\" Keroro asked, sipping a cup of tea. He then opened his eyes to see Akiki standing in front of the newly transformed Natsumi, both staring at him. He then started to panic and said, \"Oh, crap! What am I gonna do?!\"<br>\r\n<br>\r\nNatsumi then approached Keroro and said...</span></div></div>",
            "created":1401685200,
            "id":1806160,
            "title":"No, something went wrong"
        },
        "133131212123":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "Sergeant Keroro's secretary",
                "the platoon's mascot",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A few more choices</span></div></span></div>",
            "created":1400475600,
            "id":1798955,
            "title":"Other choices"
        },
        "1331312123":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "Age regression",
                "Animal transformation",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are a few more options</span></div></span></div>",
            "created":1398747600,
            "id":1789154,
            "title":"Other choices"
        },
        "13313121232":{
            "author_id":"batjap",
            "author_name":"batjap",
            "choices":[
                "Earth animal",
                "Space animal",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Turning her into an animal? Okay but what kind?</span></div></span></div>",
            "created":1400475600,
            "id":1798965,
            "title":"Animal transformation"
        },
        "13313121233":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "Doll TF (reserved)",
                "Clothes TF",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could Akiki have done to Natsumi?</span></div></span></div>",
            "created":1400389200,
            "id":1798422,
            "title":"Other choices"
        },
        "133131212331":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "Keroro plays with Rag Doll Natsumi",
                "Akiki encounters Fuyuki",
                "Elsewhere, with (reader's choice of character)"
            ],
            "content":"<div class=\"\"><div> <span>Akiki squealed with delight as she picked up Natsumi. <br>\r\n<br>\r\nNatsumi was now a rag doll, outfitted in a frilly dress that resembled her school uniform. She had stitched-open eyes and a stitched smile. Her hair was now a mop of pink yarn and her arms and legs hung loosely at her side.<br>\r\n<br>\r\n“Wha…what’s going on?” Natsumi thought. “Why would Mom do this to me?”<br>\r\n<br>\r\n“Yay! I did it!!” Akiki shouted with joy as she started heading to Geroro’s room. She made her way toward the “secret” lair of Geroro’s platoon and cheerfully shouted her arrival.<br>\r\n<br>\r\n“Sergeant Keroro! Sergeant Keroro! I did it!! I have the red-haired Pekoponian for you!!”<br>\r\n<br>\r\n“What? This is all that frog’s fault?! That does it! As soon as I get my body back to normal, he is so dead!!” Natsumi thought angrily in her head.<br>\r\n<br>\r\nKeroro walked out and sleepily said, “What is it? I was just dreaming about Gunda…Private? What’s in your hand?”<br>\r\n<br>\r\n“It’s the Pekoponian you wanted out of the way!” Akiki cheerfully said, squatting down to hand Keroro the toy Natsumi. “I turned her into a toy for your playing pleasure!”<br>\r\n<br>\r\nKeroro eagerly reached out and grabbed the Natsumi doll from Akiki’s hands and looked with teary eyes at the private. “It’s so beautiful! Thank you, Private Akiki!”<br>\r\n<br>\r\n“Just doing my duty, Sergeant!” Akiki said, standing up to salute.<br>\r\n<br>\r\nKeroro then gave Akiki a pat on the shoulder and said, \"Good work, Private! Now keep an eye out for the male Pekoponian child who lives here. If he starts becoming too suspicious, use the Multi-TF Gun to get him out of the way.\"<br>\r\n<br>\r\n\"Yes, Sir!\" Akiki said as she walked back to where she was when she met Natsumi.</span></div></div>",
            "created":1400389200,
            "id":1798606,
            "title":"Natsumi's just a Rag Doll"
        },
        "135":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "\"I could use the gun to grow more!\"",
                "\"I could use the gun to grow other girls!\"",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>\"Gero gerori. Go to the expansion mode then!\" And Keroro pushed the trigger. Before Aki could move, she was surrounded by the strange light. And then, Aki began to feel her clothes tighter.<br>\r\n<br>\r\n\"K-Kero-chan? What is happening to me?\", said the choked Aki.<br>\r\n<br>\r\n\"You grow, Mama-dono, you grow.\"<br>\r\n<br>\r\nThe buttons of her shirt and her jeans began to popped out, and her belt exploded. The rubber band who kept his ponytail ripped out. Her shoes also ripped out.<br>\r\n<br>\r\n\"It feels pretty warm. Hmmm...\" said Aki. After 5 minutes of growing, she was now in her underwears, standing on 100 feet tall. Fortunately, she was invisible.<br>\r\n<br>\r\n\"Wow, it's so exciting! Hum, what could I do now?\"</span></div></div>",
            "created":1363323600,
            "id":1550821,
            "title":"expansion"
        },
        "1353":{
            "author_id":"superdimentio",
            "author_name":"Eclair",
            "choices":[
                "\"I could rampage the town!\"",
                "\"I could show Natsumi and Fuyuki my new form!\"",
                "\"I could visit the world!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some other choices...</span></div></span></div>",
            "created":1363323600,
            "id":1550824,
            "title":"Other choices"
        },
        "14":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "mess with Giroro anyway",
                "Tamama",
                "Angol Mois",
                "Dororo",
                "Kururu"
            ],
            "content":"<div class=\"\"><div> <span>Keroro thought about what could happen if he used the gun of the enemy first, how he might fail like usual, how Natsumi might skin him alive for this. Keroro's eyes widened in response. Trying to get of the bad thoughts, he decided to test it on one of his fellow comrades, but which one?</span></div></div>",
            "created":1254459600,
            "id":769315,
            "title":"One of his own comrades"
        },
        "141":{
            "author_id":"vcld-j4m",
            "author_name":"Vcld-J4M",
            "choices":[
                "continue messing with Giroro",
                "Mess with Keroro [make him zap himself?] ",
                "other [make your own]"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n                \"No....Oh no, Keroro you better not!!\" Giroro yelled as he jumped up from his seat near the small table that sat on the floor. Keroro smiled evilly and placed a hand on his chin.<br>\r\n                 \"Sorry Giroro but you are the tough guy around here, I'm just a tad curious what you look like when you're older. Gero, gero, gero!!\" Keroro laughed evilly as he messed with one of the dials and he took aim at the red alien frog. Before Giroro could react a giant yellow ball shaped energy blast popped out of the gun's barrel and got Giroro square in the chest and exploded. Everyone waited patiently as the giant wall of smoke started to clear and when everything was visible everyone stood frozen in their spot. <br>\r\n                  \"Keroro I'm going to kill you!!!\" Giroro yelled as he grabbed Keroro and went to choke him but noticed Keroro kept staring at something that was behind him. \"What's your problem?\" <br>\r\n                  \"Maybe a cat got his tongue.\" a very familiar and creep-ily deep voice suggested and a click from a reloading gun was heard behind his head. Giroro forced himself to turn around and gasped seeing a red Keronian that looked just like him but his eyes weren't the normal black color, they were small and beady red, giving off a very threatening glare. Oh...and not to mention that he was holding a 22 mm caliber gun right in between Giroro's eyes.<br>\r\n                  \"G-Giropon?!\" everyone gasped, this wasn't the first time that a 'Giroro clone' had came to the household. Back when a mysterious rock from outer space made Giroro's seven personalities come to life a few months ago, they hoped to never see him or the other six personalities. Giroro swore under his breath and withen a few seconds both of the Giroros were wrestling each other [to the death maybe?].<br>\r\n                   \"Kyaa!! How would you say? Commotion in motion!!\" Mois screamed as she covered her eyes. Kururu laughed evilly as he grabbed his gun back from Keroro. <br>\r\n                   \"Kukuku!! Keroro you idiot, you put it on the wrong dial!\" <br>\r\n                   \"Gero? Really Kururu? Then what brought Giropon up? I want one too!!\" he squealed as he could picture himself with seven other of 'him-selves'.  Kururu laughed again and pointed to the small dial with a question on it. <br>\r\n                    \"Idiot, this is the miscellaneous dial!! So after we zap someone with this then we won't know what happens do we? Kukuku!\" he chuckled and then froze as a sword's blade was placed at his throat from behind, just the same way a ninja would do it. Kururu looked back at another figure that looked at Dororo but a grey-ish blue and had small green beady eyes. \"And who are you?\" <br>\r\n                     \"D-Dororo?!\" Keroro and Tamama gasped, even the two Giroros stopped to see what the commotion was about. Giropon looked at the darker Dororo and looked over seeing the real Dororo trying to smooth a bump that was on his head, he instantly knew who it was. <br>\r\n                     \"That's not Dororo.\" Giropon said as he stood up and walked over to the other Dororo and patted his shoulder as if they were buddies. \"This is Doropon. He's the Sergeant that in my platoon.\" he said. Doropon looked over at Giropon and removed the sword from Kururu's throat and Kururu gave out a nervous laugh. <br>\r\n                     \"Isn't that something? Kukuku! A Giropon, and a Doropon!\" <br>\r\n                     \"And you're the one to talk?\" Doropon asked as he placed the sword back in his sheath. \"We have a Keropon, a Tamapon, and a Kurupon as well.\"<br>\r\n                     \"Really?!\" <br>\r\n                     \"How are they like?!\" Tamama and Keroro asked as they gave big shiny eyes at him. Doropon chuckled half heartedly. <br>\r\n                     \"You really want to know?\" <br>\r\n                     \"Yes!!\" they yelled and Doropon looked up at them and smirked.<br>\r\n                     \"They're nothing like you, and they're nothing like us either...they're actually girls.\" he said. Keroro, Tamama, and Kururu stayed silent and Kururu gave out another nervous laugh. Giroro froze not saying anything and looked at Giropon.<br>\r\n                      \"You're kidding.\"<br>\r\n                      \"Nope, he's right we're the only men in the group, which is pretty nice when you think about it but when you <i>really</i> think about it, it's hell.\" he said and looked over at Doropon. \"So how'd you get here?\"<br>\r\n                      \"Well when the green guy shot you this guy was in the way.\" Doropon said as he pointed at Dororo. \"He tripped and after I was brought him I gave him a welcoming punch.\" he said. Keroro sighed and messed with some more dials. <br>\r\n                      \"I wonder what else this thing can do!\"<br>\r\n                      \"Don't you even dare!!!\" both of the Giroros yelled. <br>\r\n<br>\r\n[[I'm gonna stop here, I give credit of course to maniacaldude for this awesome topic thinger, I had to try it out, it was the only Keroro Gunso stuff here other then my own posts. And of course it was fun, <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" class=\"emoteZ\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\"> I give this thing 5 stars. :D take it from here ppl!!!!<br>\r\n- {color=red}Vcld-J4M]]  </span></div></div>",
            "created":1260939600,
            "id":806600,
            "title":"Mess with Giroro anyways"
        },
        "143":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Age Regression",
                "Keronjin",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Ojisama?\" Keroro hears the soft and kind voice, looking towards his figurative niece, Mois, in response. She continues, \"I would like to volunteer as a test subject. You could say, taking one for the team?\" She concludes with a warm smile, showing her willingness to be altered. Keroro, at first, hesitated to do so from fear that he might accidentally hurt her in the process; he soon caves in, however, from gazing at how comfortable she seems to be with the concept.<br>\r\n\"Okay, Mois-dono. If that is what you want...\" he mutters before setting off the ray gun. After thinking for a moment about which setting would be best to be used on Mois, he chooses the ___ setting.</span></div></div>",
            "created":1433134800,
            "id":1986561,
            "title":"Angol Mois TF"
        },
        "1431":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "a little kid",
                "a toddler",
                "even younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How young is Angol Mois going to be?</span></div></span></div>",
            "created":1433480400,
            "id":1988275,
            "title":"Age Regression"
        },
        "14313":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "yes",
                "no, Keroro accidently unbirths her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Angol Mois get turned into a baby?</span></div></span></div>",
            "created":1433480400,
            "id":1988276,
            "title":"She will get even younger?"
        },
        "15":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Who said it had to be Keroro?",
                "Momoka (Tamama protests)",
                "Koyuki (Dororo protests)",
                "Saburo (Kururu... doesn't care)",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who did Keroro decide to test the weapon on?</span></div></span></div>",
            "created":1254632400,
            "id":770071,
            "title":"Other choices"
        },
        "151":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Tamama",
                "Mois",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just when Keroro was about to make his decision, someone else volunteered to do the job. Who is it?</span></div></span></div>",
            "created":1254632400,
            "id":770074,
            "title":"Who said it had to be Keroro?"
        },
        "1511":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Angol Mois",
                "Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>\"Gunso-san?\"<br>\r\n<br>\r\nKeroro turned to the source of the voice, which came from his eager young Private, Tamama. \"May I try it out?\"<br>\r\n<br>\r\n\"Of course, but be careful with it, alright?\" Keroro said, handing the gun to Tamama.<br>\r\n<br>\r\n\"Don't worry, I will,\" the Private Second Class responded back.<br>\r\n<br>\r\nWho did he plan to use it on?</span></div></div>",
            "created":1423112400,
            "id":1928518,
            "title":"Tamama"
        },
        "15111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Appearance",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>When he was away from the others, Tamama was plotting to use the TF Gun to his advantage. Namely, to deal with his rival for Keroro's affections, Angol Mois.<br>\r\n<br>\r\n\"Ohohohohoho!\" Tamama chuckled darkly, \"This is too perfect. That woman won't know what hit her!\"<br>\r\n<br>\r\nHe was trying to think of which function on the device he could use to carry out his vengeance on the oblivious space girl.<br>\r\n<br>\r\nWhat should he change about her?</span></div></div>",
            "created":1423112400,
            "id":1928524,
            "title":"Angol Mois"
        },
        "1512":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Keroro",
                "one of the Kerons",
                "one of the Pekoponians"
            ],
            "content":"<div class=\"\"><div> <span>At that moment, Mois gave in to the excitement from seeing the weapon. \"Can I try, oji-sama?\" she cheerfully asked her \"uncle.\"<br>\r\n<br>\r\nKeroro stopped his thoughts to look at the Angolian girl behind him. \"Of course you can, Moa-dono,\" Keroro said, trusting her completely. He relinquished the Multi TF gun, placing it on Mois' eager hands.<br>\r\n<br>\r\n\"What?\" Tamama barely whispered. One of his eyes twitched in a rapid frequency. He wanted to forcefully take the weapon from her, but he has to keep his temper under control for Keroro.<br>\r\n<br>\r\nMois analyzed the weapon, admiring its design. After a few seconds, she planned to use the Multi TF gun on...</span></div></div>",
            "created":1265864400,
            "id":834711,
            "title":"Mois"
        },
        "15121":{
            "author_id":"lotoflol",
            "author_name":"LOL",
            "choices":[
                "He becomes a human",
                "He changes gender"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Finally I can change you as I want\" said Mois.<br>\r\nHe was hit by the rays and he fell on the ground.<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat would he become...</span></div></span></div>",
            "created":1400907600,
            "id":1801721,
            "title":"Keroro"
        },
        "15123":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Natsumi",
                "Fuyuki or Aki"
            ],
            "content":"<div class=\"\"><div> <span>Mois crawled through the basement door to the Hinata household, holding the Multi TF gun behind her back. A few minutes ago, she volunteered to use the gun on one of the Pekopon-jin. Keroro agreed, despite Tamama and anyone else's reactions, to this,believing this may work as a new invasion strategy. Having himself using the gun would be dangerous with the Pekoponians around, especially Natsumi. But, who would suspect the \"innocent\" Mois of using such a weapon, especially since she already has the Lucifer Spear to attack with. She promised herself not to hurt them since they were still her friends, but her feelings for Keroro made her willing to do this. Besides, the idea of using such a weapon is tempting for her to ignore. She soon spotted...</span></div></div>",
            "created":1265864400,
            "id":834752,
            "title":"You could say, a transforming experience?"
        },
        "151231":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "age regression",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Mois finds Natsumi in the living room, lying on the couch. Just when Mois is about to pull out the Multi TF Gun, Natsumi noticed her. \"Konnichi wa, Moa-chan. What's that you're holding?\" she questioned, seeing that Mois has one of her hands behind her back. Mois hesitated for a second from shock, then moved on, \"Sorry I got to do this, Natsumi-san. You could say, duty calls?\" she shouted before firing the gun at her. The set is set to...</span></div></div>",
            "created":1265950800,
            "id":835219,
            "title":"Natsumi"
        },
        "1512311":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "baby",
                "something else younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Natsumi tried to scream, but the transforming energy was too strong to let her do so. By the time she realizes she is getting younger, she already became a...</span></div></span></div>",
            "created":1265950800,
            "id":835223,
            "title":"That's right. Another age regression."
        },
        "15123111":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "transform Fuyuki before he finds out",
                "give Natsumi to Keroro"
            ],
            "content":"<div class=\"\"><div> <span>The energy around Natsumi's body disappeared. Where the teen once was now lies a baby girl at the age of one or two with two red pigtails. Natsumi's clothes have been replaced by a diaper and a little pink dress used for infants.<br>\r\n<br>\r\nMois stared at the girl for a second before being struck by joy. She couldn't help but squeal and jump in glee. \"Aw! Natsumi-san, you're so cute! You could say, an adorable result?\" Mois picked up the confused and startled infant, whom just found out what happened, from the couch. Mois holds Natsumi in her arms, looking down at her lovingly. Natsumi struggles to have Mois let go of her, but she is too strong for her now. Before long, Natsumi relents. She looks at Mois in defeat, instantly noticing her eyes. Natsumi remembers this happened a few times before with Kururu. Whenever he stared into those eyes, like when he got turned into a baby just like her one time, he soon cracked. She tries to look away, but she cannot stop looking. The eyes are just so bright and comforting, as if there is no reason to be scared. After a while, Natsumi's baby instincts begins to replace her teenage instincts. She also starts to become sleepy. Natsumi calmed down, cooed happily, and fell asleep on Mois' arms.<br>\r\n<br>\r\nWhat is Mois going to do now?</span></div></div>",
            "created":1265950800,
            "id":835243,
            "title":"Natsumi and Mommy Mois"
        },
        "151231111":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Age Regression",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Mois smiled as she saw Baby Natsumi sleeping calmly in her arms, but then she remembered something. \"Oh! Fuyuki-san! I better transform him before he finds out. You could say, covering up the crime?\"<br>\r\n<br>\r\nShe was about to put Natsumi down onto the couch, but she figured that Natsumi might wake up, crawl away, &amp; get lost somewhere (that &amp; she was too cute to resist), so she decided to take the sleeping baby girl with her. Carefully &amp; quietly, Mois snuck to to Fuyuki's room &amp; saw him researching some occult info, suspecting nothing. Mois was going over the numerous options over how to transform Fuyuki. She eventually chose...</span></div></div>",
            "created":1266987600,
            "id":841599,
            "title":"Fuyuki's Next"
        },
        "1512311112":{
            "choices":[
                "yes",
                "no someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>then how about gender change fuyuki</span></div></span></div>",
            "created":1326690000,
            "id":1259690,
            "title":"Something else"
        },
        "151231112":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "give up Natsumi to Keroro. It can't be that bad.",
                "protect Natsumi from her \"beloved\""
            ],
            "content":"<div class=\"\"><div> <span>Mois quietly sat on the couch looking at the infant Natsumi sleeping peacefully on her arms. As strange as it sounds, despite Natsumi formally being a teenager, Mois could not help herself from forming a motherly bond with the infant Natsumi is now. It's just like when Kururu was turned into a baby at one time.<br>\r\n\"Gero, gero,\" Mois hears, almost jumping out of the couch in shock and waking Natsumi in the process.<br>\r\n\"Oji-sama,\" Mois recognizes her \"uncle's\" trademark utterance. Keroro walks toward Mois with a sinister smirk on his face. His smirk enlarges upon noticing the baby Natsumi on Mois' arms. This slightly disturbed Mois.<br>\r\n\"Good job, Mois-dono,\" Keroro complimented her.<br>\r\n\"No problem, Oji-sama,\" Mois replies, happy to hear this from her figurative uncle, \"You could say, anything for family?\" Mois looks at Natsumi again. \"So what are we doing to do with her?\"<br>\r\n\"We'll take her to Kururu for experimentation.\"<br>\r\nAt this point, Mois' heart jumps in fear. \"What?\" she says, doing her best to keep Keroro from knowing her sudden discomfort.<br>\r\n\"Yes. Kururu says that, with Natsumi-dono in this state, he can take Natsumi's DNA and then use his new transformation gadgets to produce an army of loyal keron soldiers with her abilities.<br>\r\nMois feels unsure about what will be her next move. She wanted to make her oji-sama happy, but, at the same time, the thought of leaving Natsumi with Kururu while she is helpless made her shudder. At this point, two shoulder angels (yes, in this case, two angels would be more appropriate) appear from her imagination.<br>\r\n\"Give Natsumi-san to Oji-sama,\" says the angel on her left shoulder. \"Do it for him. You could say, a present from the heart?\"<br>\r\n\"No! Don't do this! You know this is wrong!\" says the angel on her right shoulder. \"She's just a baby! She will be scared and helpless like this! You need to protect her! You could say, motherly instinct?\"<br>\r\nMois looks at the cute, infant Natsumi sleeping on her arms again. She becomes more reluctant to act than before.<br>\r\n\"Mois-dono?\" Keroro notices Mois has not moved since he spoke. Mois needs to make a choice fast. She chooses to...</span></div></div>",
            "created":1316667600,
            "id":1192939,
            "title":"Mois' Choices"
        },
        "1512312":{
            "author_id":"dragonwriter45",
            "author_name":"Dragonwriter45",
            "choices":[
                "Age Progression",
                "Different setting"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wat about if Mois accidently made Natsumi older?</span></div></span></div>",
            "created":1298264400,
            "id":1058060,
            "title":"something else"
        },
        "151232":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Fuyuki is in his room",
                "Aki just came home from work"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After some searching, Mois noticed Natsumi is nowhere to be seen. However, she saw that...</span></div></span></div>",
            "created":1265864400,
            "id":834754,
            "title":"Mois finds Fuyuki or Aki"
        },
        "1512321":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "shrinkage",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mois sees that Fuyuki is in his room, studying the occult as usual. Hiding behind the door, she sets the gun to ___ before firing at the boy.</span></div></span></div>",
            "created":1289106000,
            "id":988652,
            "title":"Fuyuki is in his room"
        },
        "15123211":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "goes out to TF someone else",
                "gives Fuyuki to her uncle for an invasion plot"
            ],
            "content":"<div class=\"\"><div> <span>A blinding light covers Fuyuki's room.When it fades, Mois finds a 1-inch tall Fuyuki on his chair, wondering what just happened. \"Mois-ch...\" Fuyuki notices her before she captures him and places him into a glass jar she carried with her while making sure the lid is closed enough to contain him but not enough to keep out oxygen to let him breathe.<br>\r\n\"You could say, a job well done?\" she says to herself. Fuyuki tries to shout for help, but hardly any sound came out of the jar. Mois...</span></div></div>",
            "created":1289106000,
            "id":988674,
            "title":"shrinkage"
        },
        "1512322":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Age Regression",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Just then, Mois heard the front door open and shut. From her hiding place, she saw that Aki, Natsumi and Fuyuki's mom, had just gotten him from the manga company she worked at. She sat down on the couch, exhausted. Mois saw her chance, and, after switching the setting to ___, she fired.</span></div></div>",
            "created":1382850000,
            "id":1685084,
            "title":"Aki just came home from work"
        },
        "1513":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Giroro",
                "Kururu",
                "Dororo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If neither Tamama nor Mois takes the opportunity to use the Multi TF gun, who does?</span></div></span></div>",
            "created":1295067600,
            "id":1035705,
            "title":"someone else"
        },
        "15132":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Giroro",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Kukuku. Sorry. My gun; my call,\" Kururu swiftly swipes his creation from the sergeant's hands. He aims it at...</span></div></span></div>",
            "created":1390453200,
            "id":1732264,
            "title":"Kururu takes the gun"
        },
        "155":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "The whole Hinata family",
                "Akina, the Hinata grandmother",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could be transformed by this new weapon?</span></div></span></div>",
            "created":1254805200,
            "id":770944,
            "title":"Who else?"
        },
        "1551":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Age",
                "Size",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Keroro was considering which of the Hinatas (Natsumi, Fuyuki, Aki) he wanted to use as a subject, but then he thought, \"Why just one? Why not all THREE of them?\". He considered this for a second &amp; was enjoying the idea immensely. He decided to go with that, but he had to wait for the mother, Aki Hinata, to get back from work before he could try it on them. In the meantime, he could decide how to TF everyone in the Hinata family.</span></div></div>",
            "created":1255150800,
            "id":773323,
            "title":"Keroro targets the entire Hinata family"
        },
        "15511":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Children",
                "Babies/ Newborns (choose which one)"
            ],
            "content":"<div class=\"\"><div> <span>Later that night, Aki, Fuyuki &amp; Natsumi were all asleep. This was the point Keroro was waiting for. He quickly snuck into each of their rooms, set the gun to a specific age, &amp; fired at them. In their sleep, they were gradually regressing. They didn't stop until they became...</span></div></div>",
            "created":1265259600,
            "id":830423,
            "title":"The Hinatas get regressed"
        },
        "155112":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "babies",
                "newborns"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Since there is a notable difference between babies and newborns, do you want to turn the Hinatas into babies or newborns?</span></div></span></div>",
            "created":1295067600,
            "id":1035662,
            "title":"Babies/ Newborns (choose which one)"
        },
        "1551121":{
            "author_id":"maniacaldude",
            "author_name":"maniacaldude",
            "choices":[
                "Yes (They're mentally infants, with no recollection of who they are)",
                "No (They still have their memories and personalities)"
            ],
            "content":"<div class=\"\"><div> <span>Keroro turned all three of the Hinatas into tiny babies. Throughout this, they remained asleep while the invention worked its high-tech magic. The rays also made their clothing change while they were asleep, shifting shape until they turned into attire more fit for sleeping babies: diapers and pajamas with feet.<br>\r\n<br>\r\nAfter the deed was done, he snuck away to his room, went to sleep, and awaited the reactions in the morning.<br>\r\n<br>\r\nOne thing, though, did he turn the mental setting on?</span></div></div>",
            "created":1371013200,
            "id":1610173,
            "title":"Baby Hinatas"
        },
        "1553":{
            "author_id":"thiagotm",
            "author_name":"T.G.Almeida",
            "choices":[
                "Keroro himself, who better than myself to test it",
                "Sumomo, who is visiting them",
                "Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>Keroro than thought \"Who is better than myself to test the weapon\" since he was going to be the one using it to conquer Pekopon or maybe he could see if Sumomo that was visiting them wanted to test it too since she is a pop star maybe he could say that he would her changing her form for one of her presentations, when in reality he was only going to use her as a test subject.</span></div></div>",
            "created":1316667600,
            "id":1192905,
            "title":"Keroro or Sumomo"
        },
        "15533":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Pururu, who will be visiting, be affected the transformation ray?</span></div></span></div>",
            "created":1321419600,
            "id":1224187,
            "title":"Pururu"
        },
        "155331":{
            "author_id":"destroyer9573",
            "author_name":"Destroyer",
            "choices":[
                "Make her younger (she is rather obsessed about her youth)",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How should Keroro transform Pururu when she appears?</span></div></span></div>",
            "created":1321419600,
            "id":1224188,
            "title":"yes, Pururu"
        },
        "155332":{
            "author_id":"mysterykid18",
            "author_name":"Mysteryguy18",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Alisa Southerncross?</span></div></span></div>",
            "created":1451015400,
            "id":2079134,
            "title":"The Darkhunter?"
        },
        "1553322":{
            "author_id":"mysterykid18",
            "author_name":"Mysteryguy18",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Nebula?</span></div></span></div>",
            "created":1451015460,
            "id":2079136,
            "title":"Her father?"
        }
    },
    "info":{
        "author_id":"maniacaldude",
        "author_name":"maniacaldude",
        "brief_description":"Based off the hit anime/manga Keroro Gunso, Keroro decides to use TF to his advantage",
        "created":1254348000,
        "description":"<td align=\"left\" class=\"norm\">This is based off the hit manga/anime series Keroro Gunso.<br>\r\n<br>\r\nToday, we see the amphibian-like invaders working with transformation, either for part of an invasion scheme, or just to mess around.<br>\r\n<br>\r\nTransformations:<br>\r\nAge (AR/AP)<br>\r\nTG<br>\r\nAnimal TF<br>\r\nSize (Shrink/ Grow)<br>\r\nAppearance<br>\r\nOni Girl<br>\r\nInanimate<br>\r\nExpansion<br>\r\n<br>\r\nA lot of other transformations can be used, but there are a few rules.<br>\r\n<br>\r\nNo killing off characters<br>\r\nNo sex or vore<br>\r\nPut effort in describing what's going on<br>\r\nKeep to the rating, people!<br>\r\n<br>\r\nOther than that, anything goes! The first post is mainly the start to a specific plot line, but it's free to go in any direction you desire.</td>",
        "id":1603979,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582682700,
        "modified":1582682700,
        "pretty_title":"Keroro, Invasion Through TF! De Arimasu!"
    }
}