{
    "chapters":{
        "1":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Finally human again.",
                "Memories of a lifetime",
                "Something else.",
                "Choice four",
                "Choice five"
            ],
            "content":"<div class=\"\"><div> <span>Everything seemed to happen all to quickly.  You didn't expect anything like this to happen in a million years. It all seems like a strange syfy movie. Your scared and unsure what to do and now you will continue your life.  Well let's bring it back to where it all began. <br>\r\n<br>\r\nIt was a brisk afternoon for a day in early May. Its the time of year that everyone breaks out their summer clothes, all the foliage comes on the trees and everyone opens their pools. But today was different. It felt eerily like a fall afternoon. There was a chilly wind which just reinforced the theme of the day.  <br>\r\n<br>\r\nJust as you normally do you were on your walk home from school. As you were walking along the wooded area along the road something in the brush caught your eye.  It almost looked like a bright metallic blue which really stood out from the green brush. You had nothing better to do today so you decided to check it out.<br>\r\n<br>\r\nIt almost looked like some blue goo, maybe about to handfuls big. But there was something really intriguing about it. You stuck your hand out to reach and touch it and perhaps pick it up. But as your finger tips touched the blue goo substance it all a sudden looked to be absorbed by your body. You feel your eyes widen and your body tingle and shake all over and that's all you remember before you collapsed.  <br>\r\n<br>\r\nAwakening your vision seemed to change completely.  Now you could see all around you lIke 360 degrees. Not only that but you were now looking at the ground rather than being 6 feet off the ground what your used to. The other strange thing was your legs and your arms were gone! There was a puddle of water in front of you which really painted the situation well. <br>\r\n<br>\r\nAll of what your body was is now all completely gone. Basically what remains is now you are a mass of blue goo. The same blue goo what you saw earlier! What the hell when you touched it before it must have transformed you into it! Now your scared you have no idea what do to and where to go. You can't face your family like this. Your not even sure if you can even move around. But slowly you kinda figure out how to and now you can slither around. <br>\r\n<br>\r\nThere's no way your going to reach your house at this speed by slithering. It must be passedone 5 pm and your parents are probably worried sick about you.  \"Well I guess I'm staying out here for the night,  until I can figure all this out.\" You thought. Finding a spot off the road and by a tree you will probably keep yourself here for the night. <br>\r\n<br>\r\nIt's getting dark and you have so much racing though your mind. One of the thoughts your have that there is a military base located in town and maybe this is one of their special products.  You really have no idea and you'll wait til tomorrow to find out. You hear some leaves cracking behind you and as you look back you see a wolf of some kind. You remember your dad telling you there's wolves here in the woods. <br>\r\n<br>\r\nThe animal comes over to you and starts to sniff.  Then something bizarre happens.  The wolf starts to luck you up. You feel yourself pass into some warm cavities in it's mouth. Your first thought is that your going to die buts that's not what happens at all. All a sudden you are looking out a set of eyes about two feet off the ground. You feel four paws and you have a tail now.  Your now in b intro of the wolf now!  Testing your new powers you run through the woods and around trees. It's suprisingly a lot of fun. This is something you could get used to.<br>\r\n<br>\r\nNow since you were able to possess an animal maybe you could possess a human. It was getting dark and maybe you would have to stay in the wolf's body over night. Just as the thought crossed your mind you heard more footsteps this time and you looked around and noticed a man in hunting gear. He probably was out hunting for the today and now was going home since it was getting dark. You really wanted to see if you could possess the guy and get out of the wolf and back into a human form. <br>\r\n<br>\r\nAfter puking yourself out of the wolf you slithered on the ground and snuck up behind the guy. Going unnoticed you jumped onto his boot, you were hoping he didn't notice you.  Crawling, you made your way into his boot and fell onto his foot. You were getting tossed around by his walking and needed to focus. You made your way out of his boot and up his pants leg.  Suddenly he stopped and you realized he noticed you. \"Shit, shit, shit, what do I do?\" So just on instinct you tried to press yourself into his leg. Unsure if it would work you decidea to give it a try. As you did you felt yourself slowly take over the man's body. First his legs then his torso and arms and finally head, he began to shake all over and you started to feel bad for him. He ended up dropping his bow and other equipment.  But as soon you started to possess him you now had full control as you gain your vision and looked through his eyes for the first time. You were human once again. </span></div></div>",
            "created":1390366800,
            "id":1731439,
            "title":"When it all started"
        },
        "11":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "See who your son is",
                "No, your wife wants something",
                "Neither you're to tired"
            ],
            "content":"<div class=\"\"><div> <span>Opening your eyes the world as you knew it greets you.  You feel good getting out of the wolf's body and back into a human one. You can move your arms and legs around again but it still feels foreign to you what your in someone else's body.  It is just a really strange feeling.  <br>\r\n<br>\r\nWell anyway you continue walking after you pick.of your new hunting equipment.  \"Never been hunting before, \" you giggle. As you get ahead you notice a red pickup truck, must be yours. As you approach it you toss your equipment into the back and catch your new reflection in the mirror.<br>\r\n<br>\r\nYou must be about 45 now as you look at your blue eyes and masculine figure. The guy or now you, have short cropped brown hair and stubble for a beard. \"Gunna need a shave soon,\" as you scratch your chin. Your dressed in camo gear from head to toe and you can feel it fitting snuggly on your body. You can feel this guy has a nice solid build a he must take care of his body. You flex a massive bicep appreciatively and grin.<br>\r\n<br>\r\nYou jump into your new pickup and start it up immediately,  you can start to feel some of your memories beginning to come though. You've only been driving for about a year now and driving this big pickup could be a bit difficult.  But it seems this guy's experience is seeping though.  As you think where you live, the memory comes though and you remember. <br>\r\n<br>\r\nAlong the ride home you learn a few things about your new host. He's actually 48 years old and named Mike. He's married and has four children. Three sons and one daughter. The youngest son and daughter go to the middle school in town and the two oldest sons go to your high school actually.  The oldest is named Kyle and is actually in your grade.  The last name is Mitchell, you've never heard of him but maybe once you see him.you'll reconigze him.<br>\r\n<br>\r\nThe drive is short to your new house and what you see is not what you expect.  Its actually in a nice part of town and a new and nice sized house.  Parking your truck in your driveway you jump out of your pickup. Recalling from memory you get your hunting equipment and open the garage up and toss it in. You hear a dog bark and it comes running towards you as you open the door. <br>\r\n<br>\r\nThe inside of the house is as lovely as the oustide. Its decorated well, must be by your wife. You turn on some lights and see that the time is 9pm and realize everyone must have went to bed. Yawning you stretch your arms and strup off your boots and head upstairs.  <br>\r\n<br>\r\nHeading into the bathroom you take a piss. Suddenly,  almost scaring you your wife comes in. \"Hey honey how was it?\" Using your new voice, \"It was alright, I missed a few deer though.\" \"Oh well its okay. She leans over to kiss you on the neck.  Wooh you do smell honey. Take a shower and I'll be waiting for you in the room.\" She's gives you a wink. You just smile in return.  That's sex she's wants. You smile. You're still a virgin and you can lose your virginity tonight.  Still smiling you smell your pits and do realize you smell. So you strip off your long sleeve shirt and then your pants and under wear and socks.  At first it's weird seeing someone else naked in the mirror but you realize it's technically yours now. You have a strong almost athlete's build. Big arms and chest with a small beer gut. And you have meaty legs as well. <br>\r\n<br>\r\nAfter cleaning yourself all up you go into the closet and pick out some boxer briefs and a wife beater. Then you continue and head into your new room to find your wife in some lingerie. </span></div></div>",
            "created":1400821200,
            "id":1801349,
            "title":"Finally human again."
        },
        "112":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Yes that's a good idea",
                "You wanna stay the dad for a bit",
                "How about taking Ricky for a spin?"
            ],
            "content":"<div class=\"\"><div> <span>Feeling a little horny and excited you went out and saw your wife. You two locked eyes and fell on top of each other on the bed.  The night contined to be hot and steamy and you loved it.<br>\r\n<br>\r\nLight greets you as you wake up. You awake to a smile on your face as your wife is sleeping next to you.  You stretch and yawn and scratch a hairy pec. Getting up you realize your naked. Grining you remember last night's events and get some clothes on.<br>\r\n<br>\r\nLooking at your alarm clock it's 7 in the morning. From memory you remember you don't have to be into work until 10 this morning. You go down the stairs and grab some breakfast.  Down there you see your three sons all eating and watching tv. They all say, \"Hey dad.\"  \"Hey how you doing guys.\" Your daughter must still be upstairs getting ready. Actually like on que she comes down stairs. \"Jake come on were going to be late to school.\" She grabs your youngests arm and kisses you on the cheek. <br>\r\n<br>\r\nThat leaves your two oldest boys. Ricky and Kyle. Ricky is in 9th grade and Kyle is in 12th. \"Dad did you get anything yesterday? \" Ricky asks.  \"Nah son I left a few get away. \"  \"Aw that sucks. \" They then go upstairs to get changed.  After seeing Kyles face you actually do remember seeing him.  You think you might actually gave a class or two with him.  Well maybe you should take his body and go to school as him to check things out. </span></div></div>",
            "created":1400821200,
            "id":1801360,
            "title":"No, your wife wants something"
        },
        "1121":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Kyle's life",
                "Slowly slipping away",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Thinking,' you still wanted to take some time to think everything over. But remembering how it felt like to possess and besomeone else got you excited.' You want to investigate school from the angle of Kyle since he's the one in your grade. First you're going to have to get out of the dad's body.' <br>\r\n<br>\r\nYou walk up the stairs and go into the bathroom that's across the hall from Kyle's. Knowing that this isn't going to be pleasant you want to just get it over with.' You sit your body on the toilet first.' Then you have yourself in a sense puke yourself from his body.' Just like you did with wolf last night.' You can feel yourself lose control of your arms and legs.' Then all a sudden you are falling onto the floor.' Looking up you see your previous host hunched over on the toilet seat.' You hope he's going to be okay.' <br>\r\n<br>\r\nSetting your plan in motion you crawl along the floor and across the hall under the doors.' Now your in Kyle's room.' You see him putting his socks and his pants on.' As he's going for his shirt you jump at the chance and leap for his foot.' Unsuspectingly you attach yourself to his foot and crawl up his leg.' Moving fast before he really begins to notice you decide to go in a different way this time.' You come up to his briefs and throw yourself underneath them. Now he is really noticing you as he's hitting at you.' Going from the back you shoot yourself right into his ass.' He's grabbing at his ass as his knees to the ground.' Within moments you are gaining control of his body's limps and finally his head. You widen your eyes and your vision changes. <br>\r\nYour now Kyle Mitchell,' and unlike being in his dad's body before you gain access to his memories immediately.' Recalling he does remember he has two classes with you. \"Well this should be interesting. \" you think as you finish putting on your button down shirt. You fix your blue jeans and you feel that your ass is still sore. You can't help to laugh. In his mirror you notice your new reflection. He has the same brown hair as his dad, short and not completely straight.' He has brown eyes instead, and he like his dad has some stubble on his face. You flex a bicep to check his muscle mass and suprisingly he has some decent biceps and pectorals. Lifting up your shirt and sure enough is a taut waist with some development of abs. Before leaving you style your hair to how Kyle likes it and go down stairs. But first you go across the hall quick to find the dad not there. It seems that he's okay.<br>\r\n<br>\r\n\"Took you long enough,\" your little brother groans. \"Shut up Ricky. \" \"Oh I bet you were just trying to get ready to impress Cindy, \" he taunts you. \"What ever dude, come on we have to go to school.\" You say. Your amazed that you can pull off being different people so well. <br>\r\nGrabbing the keys from the shelf you go outside and shut the door.</span></div></div>",
            "created":1400907600,
            "id":1801475,
            "title":"Yes that's a good idea"
        },
        "11211":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "The day goes smoothly",
                "Something is wrong"
            ],
            "content":"<div class=\"\"><div> <span>Getting into the truck almost feels like second nature to you. It feels like you've been driving it for awhile now. You've realized when you possess someone you take all of their memories and traits. This can come in real handy sometime.<br>\r\n<br>\r\nYou start up the truck and almost get a chill as the engine revs up. Its Kyle's prize possession and he takes fantastic care of it. As your backing up, you catch your reflection in the front mirror. Your brown eyes really go great with the plaid shirt you're wearing. \"Cindy is really going to like this,\" you think to yourself. <br>\r\n<br>\r\n\"Uh Kyle, you there? We going to leave?\" Your brother questions. \"Yeah yeah, sorry dude, just zoned out there.\". Your brother just rolls his eyes and you begin to pull out of the driveway.<br>\r\n<br>\r\nThe school is just a short few minute drive from your new residence. After getting to school, Ricky hops out and says goodbye and goes his way. Now you're entering your old highschool as someone completely different. This should be interesting as you think to yourself.</span></div></div>",
            "created":1434762300,
            "id":1995377,
            "title":"Kyle's life"
        },
        "112112":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Damian, the school \"badass\"",
                "A big police officer patrolling school"
            ],
            "content":"<div class=\"\"><div> <span> Walking into school as someone completely new feels some what erotic too you as you try to hide a growing bulge. Your jeans constrict this but the feeling is just too much to over come. Trying to fight the urge away you locate your locker. <br>\r\n<br>\r\nFrom memory you know Kyle has Calculus first period so you grab his textbook and binder. You get there right before the bell rings and grab your normal seat. Kyles a bit of a loner in this class as he keeps to himself since none of his friends are in this class. He's actually really smart but the people he hangs out with aren't so he keeps to himself in most of his advanced classes.<br>\r\n<br>\r\nThe teachers monotone voice is simply to much to bare so you tune it out. This of course leads you get the urge again. This time you can't fight it any longer and it needs to happen. \"But in school?\" You keep thinking this to yourself. Fuck it, you can't handle it anymore. You flag down the teacher and he let's you leave the room.<br>\r\n<br>\r\nYou nearly run down the hall to the bathroom. Praying that no one else is in there, you get your wish. Grabbing a handful of paper towels you head into the stall. You drop your jeans which fall on top of your boots. You still can't believe you're going to be jacking off in some other guys body and on top of that, in school! A few minutes of steady movements and the time finally comes. Damn! Jacking off in some other guy is such a different, amazingly good experience. <br>\r\n<br>\r\nThe rewarding experience is short lived though. As the last of your cum comes out you start to notice something blue. It looks like goo of some sort. It keeps flowing out of your dick at a steady stream. What the fuck is this?? Just then you begin to feel dizzy and light headed. You're losing control of your host. You feel yourself slump over and watch the remainder of your goo leaves Kyles dick. <br>\r\n<br>\r\nYou have no idea how long you blacked out for. It must have been more than a few minutes since Kyle got up and left. Now you are back in your goo form and have no sense of time. But from your 360 degree vision you see you're alone in the stall behind the toilet. <br>\r\n<br>\r\nNow you have to debate what you should do. You're back in your goo form which will take forever to move around. So you know you need to get another host. But how far do you venture out and face getting caught. This leads you to decide to stay by the toilet and pick the next person who comes.<br>\r\n<br>\r\nWhat you think is an eternity passes by no one comes. Ready to give up and leave the stall you hear someone come into bathroom. You hide behind the toilet ready for your move and to make sure they don't see you. Hearing the loud footsteps of the guy you know its got to be someone big. You notice the guy is wearing these black leather motorcycle boots. Looking up from the floor your eyes and his eyes meet almost simultaneously. Just then do you realize who it is...<br>\r\n</span></div></div>",
            "created":1434940380,
            "id":1996895,
            "title":"A feeling you can't shake"
        },
        "1121122":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Fuck it, go over to the girl",
                "You really shouldn't raise suspicion"
            ],
            "content":"<div class=\"\"><div> <span>Staying absolutely still you don't move an inch. Both of you are now staring directly at each other. The officer of course can't tell that you are looking at him. All he has is a curious look on his face. There doesn't appear to be any fear in his eyes, he is a police officer anyway.<br>\r\n<br>\r\nAstonished at all of this, he keeps his eyes fixed on you. He begins to bend himself over and sticks his hand out towards you. This is all shocking you and you're unsure of what to do. Amazingly he sticks his hand close enough to you, he touches you. Not only touching you he picks you up and you're now in mid air. <br>\r\n<br>\r\nYou're sitting in his hand as he has this curious look on his face. He begins to poke and probe you which makes you ticklish. You're really debating what you should do. You really want a body again and this is the perfect time. On top of that, this guys body doesn't look bad at all. In fact it would be kind of sick if you possessed this big police officer. His tight fitting uniform shirt hanging off his pecs with those knee high leather riding boots just make the decision much easier. <br>\r\n<br>\r\nJust as he continues to probe you, you latch onto his index finger and start to slither down his hand and arm. Immediately he takes a big step back and tries to shake you free. He has no such luck of course, and you continue down his arm and into his shoulder. At this point he's trying to claw you off his body.<br>\r\n<br>\r\nThis only makes you more determined as you climb onto his neck and onto his chin. As he's trying to claw you off, his fingers are just slipping through your form. Its not working at all. Almost to the finish line, you jump into his open mouth. You feel the guys body spasming for control and you inert your form into his body. Every part you take control of , first his legs then his torso then his arms and finally his head. That's the last time he looks out as you take full control from all his senses and look out of your new eyes for the first time.<br>\r\n<br>\r\nYou take a step back because you need to take all of this in. This leads you to knock into the stall door. \"Damn this guy's ass is huge,\" as that's the thing that knocks into the door. Looking down you see your new chest poking out from under your uniform shirt. Your pants feel as slim fitting as possible as you feel your dick and your thighs crammed into them. Then you finally notice your knee high boots. You bend over to run your hand over the leather and feel yourself get goosebumps. Your pants feel even more tight like they're about to rip as you bend over. Overwhelmed by all of this you head out of the stall. <br>\r\n<br>\r\nYour boots squeak on the floor as you walk over to the mirror. Walking in your new body also is going to take some getting used to. Your new height has got to be well over six feet, maybe 6' 3\" or 4\".  All you have to say is \"damn,\" as you catch your reflection in the mirror.<br>\r\n<br>\r\nThis guy has sexy cop written all over him. From his dark tanned skin, to his dark five o'clock shadow to his bulky muscles. All of this body is now yours to play with. As your running your hand over your new chest and abs a boy walks in. Probably no more older than a freshman and he catches you feeling yourself up. He simply just stares at you and you turn to his direction. He's kind of dumbfounded that he's seeing a cop feeling himself up in the school's bathroom. Turning to him, \"Hey kid what you looking at?\" You give him an intimidating facial expression and puff out your chest to prove your point. He doesn't even think twice and turns right around and leaves the bathroom.<br>\r\n<br>\r\nYou grin to yourself at this. All of this authority is going to take some time to get used to and you have plenty of it. After one last look you walk out into the hall way. <br>\r\n<br>\r\nIt looks like classes have just let out and this is passing time. You're seeing many of the same people that you used to see every day. Now this time your vantage point has completely changed as you're above nearly everyone. Now you're eye level or taller than all the football and most basketball players. This gives you this sweep of confidence that you didn't have before. It also doesn't hurt that you're an officer which everyone seems to respect. <br>\r\n<br>\r\nWhile walking you get a buzz from your walkie talkie. Its one of your partners at the school and he needs your help with something. You probably should check this out so you don't raise any suspicion. As you look up something catches your eye.<br>\r\n<br>\r\nIts this stunning looking girl. She's beautiful from head to toe. She has long flowing blonde hair and flawless skin. She's wearing a tight mini skirt that shows off her body. She continues to smile at you and you do the same. But she's gesturing for you to come over. You haven't went over much of your memories yet. For some reason you feel you know this girl. Like her and the cop are friends or know each other for some reason. Then it hits you. Apparently the cop whose body you inhabit has been having an ongoing romantic relationship with her. She's only a junior on top of all this. You guys are only about five years apart but this is definitely frowned upon. The officer has done a great job hiding this from people and shes done the same. It's just been this exciting, fling you too have. Just thinking about it now makes you hard. \"Shit what do I do?\" </span></div></div>",
            "created":1435211220,
            "id":1998531,
            "title":"Feeling the authority"
        },
        "11211221":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "One manly scream",
                "Darkness surrounds you",
                "He picks you up!"
            ],
            "content":"<div class=\"\"><div> <span>\"Dammit I'm going to regret this, \" you think to yourself.  This girl is so beautiful, you can't your eyes off of her. She has flowing dirty blonde hair, and blue eyes. You can't remember her from when you were at the school though. The guy's emotions are washing over you and you feel the need to go over to her.<br>\r\n<br>\r\n\"Hey how are you doing?\" You ask her.<br>\r\n<br>\r\n\"Great now that I'm with you,\" she says while pinching your arm.<br>\r\n<br>\r\nYou jerk your arm away,\"You gotta watch this, we're in public.\" You say to her a little more quietly. <br>\r\n<br>\r\n\"Yeah Yeah I know. I just wanted to make sure you're coming over later.\" <br>\r\n<br>\r\n\"Of course I am.\" You say with a wink. \"I wouldn't miss it.\" <br>\r\n<br>\r\n\"Good. I'll see you at about 4. My parents won't be home until 5, so that gives us a little time.\" She says as she smiles.<br>\r\n<br>\r\nYou give her a smile back. \"Yeah I'll see you then. The bell is about to ring, you should get to class.\" <br>\r\n<br>\r\nShe squeezes your arm once again, and leaves. Looks like officer here is having a little fuckfest with a junior. This is going to be great.  <br>\r\n<br>\r\nThe day is only about two more hours long, and you walk around the halls almost mind-numbingly. Your school is pretty secure as it is, so you are unsure of why there are a few cops patrolling the school. At the end of the day you get a briefing about the days events, which involved a \"fight\" with some freshman, that your coworker took care of.<br>\r\n<br>\r\nYour coworker Sam is about 10 years your senior, around 35 or so. He also has black hair and he's a bit shorter than you with a slight pouch. You don't see a ring on his finger so you assume he isn't married.<br>\r\n<br>\r\nNow there is another officer patrolling school along with you two. His name is Bruce and he's in his fifties. He is married with a few kids from what you can remember. He's a very intimidating man at your height or slightly taller, with a beer belly. <br>\r\n<br>\r\nUsually Shane has to stop by the station after school, but today he doesn't. Which is probably why him and the junior planned their fling today. Truthfully you're a little bit nervous about what lies ahead but you're excited as well.<br>\r\n<br>\r\nYou think about stopping at your house and showering but then you think that it might be even sexier if you show up in your uniform. She might get a kick out of it. Remembering her address, you take a short drive over to her house. <br>\r\n<br>\r\nA few houses away you park your car so you don't raise too much suspicion. With some new found energy you walk down the sidewalk and up the driveway. You remember the garage password so you open it and enter from there. <br>\r\n<br>\r\nHer black Labrador runs up to you greets you right away. You make sure to pet it as it licks you.<br>\r\n<br>\r\n\"Shane is that you?\" She yells saying as she turns the corner and you see her. <br>\r\n<br>\r\n\"Who else would it be?\" You say with a smirk on your face, as she runs up and kisses you. <br>\r\n<br>\r\n\"You can't believe how much I waited for this. This week has been so stressful for me.\"<br>\r\n<br>\r\n\"Well now I'm here to take care of you,\" you say and she grabs your hand and leads you to the couch.<br>\r\n<br>\r\nYou guys do some floor play beforehand on the couch, which involves some making out and just getting into the mood. <br>\r\n<br>\r\n\"Ok, I think we're ready to head upstairs to my room,\" she says. You of course follow right on behind her, as you're unbuttoning your shirt. <br>\r\n<br>\r\nYou too practically run up the stairs and turn the corner to head into her room. As the door closes you fling yourself onto your bed and continue stripping. Just as she's on top of you, taking off her shirt, you hear the dog barking and the door slamming.<br>\r\n<br>\r\n\"Fuck, my brother is home. He said he would be at his friends after school. Hold on I gotta see what he wants. \"  You shake your head and let her go, as she redresses.<br>\r\n<br>\r\nYou hear them talking from upstairs, but nothing you can truly make out. But they start coming upstairs, then an idea hits you. <br>\r\n<br>\r\nSitting on her bed you force yourself out of Shane.  As you are slithering down his leg you see him fall onto the bed. You venture under the door and hear them down the hallway.  As a figure comes you bolt behind a table. You look and see the junior look pissed off and head towards her room.  You continue down the hallway and see an opened door. Turning to crawl into it, you see two giant feet in front of you.<br>\r\n<br>\r\n\"Fuck, \" is all you think</span></div></div>",
            "created":1460424720,
            "id":2131561,
            "title":"Fuck it, go over to the girl"
        },
        "112112212":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "University Life",
                "Highschool For Now",
                "A Different Path"
            ],
            "content":"<div class=\"\"><div> <span>There was nothing you could possibly do, darkness was all around you. You assumed her brother wanted to squash you some how. But as you braced for certain death, you were being pulled into his foot through his sock. As he felt you being sucked into his foot, that's when he tried as hard as he could to pull you off, but it was too late.<br>\r\n<br>\r\nYou could feel bit by bit gaining control of his limbs and then his head. Once again you were able to open your eyes and breathe. A bit off balance, you stumbled around.  That's when you realized the kind of body her brother had. You always thought she had the younger brother that was a freshman. But no this one was much older, probably a sophomore in college, and you were glad you found him.<br>\r\n<br>\r\nAlthough he wasn't as muscular as Shane, he was well toned from what you could tell from his tank top. After stripping that, you did some poses in the mirror and then you saw he had these interesting tattoos that navigated his body. Something to make him feel more intimidating. He also had a nipple piercing which you thought was a little odd. \"Maybe he plays for both teams,\" you snickered to yourself as you finished posing in his body and lifted his waistband to check out what he was packing. All of his memories should be coming over shortly.<br>\r\n<br>\r\nYou pulled back on your tight tank top and swaggered over to your sister's room. Curious to see what she would do you knocked. \"Yo is everything alright in there? I heard some strange noise coming from here.\" You say trying not to laugh. You even hear her telling Shane not to say anything.  \"Yes Derrick. Everything is fine, \" she says. <br>\r\n<br>\r\nKnowing that you should let them be, you go back into your room. A few minutes later you glance out your window and see a very worried Shane walking down the sidewalk to his car. As Derricks memories begin to come in you get a feel for his life. Derrick of course knows about his sister's little get togethers with the officer. He likes to mess with her from time to time by showing up randomly back at home.<br>\r\n<br>\r\nAlso you have come to realise that your suspicions before were right, and he gets quite a bit of action from both sides. Even one of the reasons why he doesn't say anything about the relationship is that Derrick wants to get with the cop but he's unsure of how to possibly do this. The cop of course is only a few years older than Derrick so that wouldn't be a problem. \"Maybe I can help him score, \" you think to yourself.  But you laugh it off.<br>\r\n<br>\r\nWell now things get interesting.  Derrick goes to college about a half an hour away and he needs to be back for classes tomorrow. You could take him back to college and have some fun investigating the university or you could try to stay here some how. </span></div></div>",
            "created":1461121020,
            "id":2136140,
            "title":"Darkness surrounds you"
        },
        "1121122121":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Your roommate it is!",
                "See who else is worth investigating",
                "Tomorrow morning..."
            ],
            "content":"<div class=\"\"><div> <span>\"Yo I'm going to head back to college for tonight,\" you say to your sister as you grab a few things Derrick wanted to bring back to campus. \"Tell mom and dad I stopped by.\" She says of course and tells you that she will see you in a bit. You grab some more clean clothes he needs and pile the stuff into your car. The car isn't a pretty one, but it's a decent car for a 21 year old. As you sit in it, a faint stench of weed greets you. \"Well this oughta be fun,\" you say to yourself as you pull out of the driveway.<br>\r\n<br>\r\nYou pull into the college just as the sun is beginning to set. Derrick's college is fairly large from what you can remember, which would be perfect to find potential hosts. As you walk up to your dorm at least a dozen people come up to you and say hello. Derrick is quite the popular guy it looks like. You get into your dorm and drop off your things and lay on your bed. It looks like Derrick's roommate is out and you have the place to yourself for the evening. You glance at a picture on the nightstand with Derrick and his roommate and notice he's another built guy, probably of spanish decent. That could very well be your next host.</span></div></div>",
            "created":1465010340,
            "id":2158402,
            "title":"University Life"
        },
        "11211222":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Shane's best friend stops by",
                "A girl Shane has been seeing"
            ],
            "content":"<div class=\"\"><div> <span>All of this is so foreign too you. To play it safe you should just stick to your job and talk to the girl later. You actually have her number disguised under another contact so you can call her later. Looking back over to her you make the hand jester of a phone and mouth \"call you later\" too the girl. She just rolls her eyes and shrugs you off. You get hard again by just looking at her. She really is amazing looking.<br>\r\n<br>\r\nYou have plenty of time to enjoy this guy's body. First though you need to get familiar with his job and coworkers.<br>\r\n<br>\r\nHe has two other officers that patrol the school with him. It's not that your school is in the shitty part of town, it just promotes the idea of safety. They're both pretty good friends of the hunk you're in possession of. Ones named Josh and the other is Andrew. <br>\r\n<br>\r\n\"Yo Shane we need you over here,\" Andrew calls you.<br>\r\n<br>\r\nThere's apparently a fight with two guys going on and he needs your additional help breaking it up. You've had your fair share of fights, since you fought in MMA. <br>\r\n<br>\r\nAlmost immediately you are able to break it up. The rest of the afternoon you and your coworkers bullshit, with the help of gaining memories, makes this possible. Andrew asks if you wanna hangout after work and you say you might be doing something with your girlfriend. He basically shakes his head and says he'll be at his house. You know you'll just be watching sports and getting drunk which doesn't sound that bad at all. So you leave it sound<br>\r\n<br>\r\nOnce schools out you locate your car. It's this sick black mustang that looks vintage. Yes its a '69 and Shane's pride and joy. He actually did most of the restoring himself. Opening the door you slide yourself right into the car over the leather seats. Its actually erotic feeling and even Shane gets the same feeling from time to time. The way your leather jacket slides right over the leather seats is almost to much to handle. Shane's or your dick begins to harden but you try to save the feeling for later. You get your classic aviators from the visor and slip them on. Taking a few moments you peer into the mirror and you look badass as ever, as this cop.<br>\r\n<br>\r\nYou live a few minutes away at this apartment complex in town. Its a fairly newer building and looks modern. You park your precious car in a covered lot and grab your bag. Walking into the building you pass by a women who smirks at you as you pass by. \"This must happen a lot,\" you say to yourself as you have to get used to this. You take the elevator up a few floors and walk down the hallway to locate your apartment. Fumbling with your keys in your pocket you unlock the door and open it to find...</span></div></div>",
            "created":1438563000,
            "id":2015827,
            "title":"You really shouldn't raise suspicion"
        },
        "112112221":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Give one some control back",
                "Practice on these two guys"
            ],
            "content":"<div class=\"\"><div> <span>Opening the door into your apartment you find a man dressed head to toe in camo and army attire standing in your kitchen. Immediately you're extremely confused and worried it's a worker from the army base that's found you. But all worries fade away as he turns and you see his face. Its one of Shane's childhood friends.<br>\r\n<br>\r\n\"Yo whose my favorite guy?\" As Shane's friend, Antonio shouts from across the room. A little thrown off about why he's doing here you say confused, \"Hey what's going on man? What are you doing here?\" <br>\r\n<br>\r\n\"I'm here on assignment and I realized that you lived here so I figured I'd surprise you,\" as his voice booms. \"Well you definitely did,\" you say as you set your bag down. You go over to him and you give each other a bro hug. While you're hugging him you feel his strong muscled body. He's filling out his uniform in all the right places. <br>\r\n<br>\r\nYou ask him to sit down and offer him a drink. You take off your jacket and have a drink with him on the couch. You guys talk for what seems like hours. He explains why he's here and what's been going on in his life and you do the same. Which is really nice to talk to someone like this. <br>\r\n<br>\r\nThe suns starting to go down and Antonio says he should be getting back to the base. You agree because you are tired and a little excited to be exploring your new body later.<br>\r\n<br>\r\nJust as you're saying your goodbyes you turn to get something in the kitchen, Antonio calls out, \"Hey I gotta hand it to you, I was almost fooled. You did an amazing job. This is so impressive.\" <br>\r\n<br>\r\nYou turn around and do a 180. By now Antonio is standing right in front of you. You're left speechless. All you could muster to say was, \"What are you talking about?\" <br>\r\n<br>\r\n\"Dude I know you're not Shane, I know how you got your power to take over people.\" This is chilling. You were so close into the clear. \"Don't worry, I'm not here to arrest you or take you into the base to be probed. You didn't do anything wrong. You weren't sure what happened to you and didn't know what was going on. But I am going to ask of you to come with me to the base so the scientists there can get a good look at you. They had no idea the stuff they were working on was this advanced and they want to interview you. Once they found out you were in Shane's body they asked me to come because Shane and I are best friends. They wanted to see how believable you were. So will you come with me to the base?\" <br>\r\n<br>\r\nYour mind is reeling from all this but eventually cough up and say \"Yeah I guess the gig is up.\" You chuckle. \"I'll come with you.\" But inside you're not completely certain that this guy is telling the truth. He still works for the government and he's not fully trustworthy. So you have a little plan developing in your mind. You turn around and cough a bit of your goo into your hands.  Antonio is hunched over picking through his bag for something. Slowly you approach him from behind, making sure you do this right, you take your hands and smother his face. <br>\r\n<br>\r\nHe turns right around and you can see his eyes bulge. Before he can do anything about this he collapses to the ground. You lift his heavy set body onto the couch. You were unsure if this was going to work, but it was worth a shot. You feel your goo work it's way into Antonio and you feel you're gaining control. <br>\r\n<br>\r\nYou start talking to him, \"Antonio, Antonio are you there?\" After a few times you hear Antonio's body say the same words. You say \" Testing one two, one two,\" and he repeats the same thing.  Then now feeling control of his body you begin to crack your head, flex your arms, and feel your strong abs. Just as you're doing this you realize Shane is doing the same exact thing. Then you try to just think about Antonio and almost seamlessly he is under your control only. With a little work you have him walking around on his own without moving Shane. \"This is incredible,\" you say as Antonio while looking into a mirror. As Antonio you're staring back at Shane who is almost like a statue. Then you  refocus on Shane and you are back into his body and Antonio is now a statue.<br>\r\n<br>\r\n\"This is too amazing I now have control of these two guys perfectly</span></div></div>",
            "created":1438576920,
            "id":2015921,
            "title":"Shane's best friend stops by"
        },
        "1121122212":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Answer that phone",
                "Act dumb"
            ],
            "content":"<div class=\"\"><div> <span>\"So I guess the military wanted me to come in for questioning,\" you say as you look at Antonio who is frozen in place. Smirking to yourself you pace around your apartment you try to figure out what to do. <br>\r\n<br>\r\nThe best thing you could probably do now is try to read Antonio's memory to see what the military wants. There has to be more to his story. The government is never that lucid. Maybe it's years of conspiracy theories but something tells you this isn't the full story.<br>\r\n<br>\r\nStaring back at you is an undeniably handsome reflection. You have short, manicured hair along with brown eyes. Your olive skin makes you look healthy as ever. Your muscles now are even more bigger than Shane's. Seeing your military uniform gives you this sense of power and intimidation. All you want to do is tear off the uniform to expose your body underneath. Now fully concentrating on Antonio's mind you try to figure out what's going on.<br>\r\n<br>\r\nYou learn all about Antonio's childhood and how is father left him as a kid and how Shane and him are best friends from elementary school. You take note of his strong Spanish heritage and see that Spanish was his first language. <br>\r\n<br>\r\n\"Yo soy Antonio. Yo tengo veinticinco años y tres hermanos. Sandía es mi fruta favorita. Yo trabajo para gobierno de Estados Unidos.\" You could just go on and on speaking in Antonio's fluent Spanish. This also means that you not only can disguise yourself as the person but you also inherit their abilities. <br>\r\n<br>\r\nAntonio was also into mixed martial arts for awhile, you see. You perform over a dozen moves flawlessly while tapping into his memory. \"Antonios or I still got the moves. These can come in handy.\" <br>\r\n<br>\r\nNow you tap into more of his memories to see if he was telling the truth. After a few moments you basically get a grasp of the situation. Most of what he was telling you is actually true. The scientists and researchers there didn't know that their concoction was this far advanced. To their knowledge they did not know that you can spilt yourself up to control multiple hosts either. That's why they only sent Antonio here to get you. Since if you tried to take Antonio, Shane would recover and you would still have him to contend with. Also they didn't know that you can attain a hosts memories or abilities. Antonio knew that once the scientists found this out they were going to probe you and try to change you back.<br>\r\n<br>\r\nAfter seeing what you can do this is pretty amazing and you don't really want to go back to your life. You can control anyone you please and be a carbon copy of them. <br>\r\n<br>\r\nNow you're more and more curious about what's going on at the base. Since you are now controlling a captain who is stationed at the army base, this would be a perfect opportunity to explore. <br>\r\n<br>\r\nBy now it's getting pretty late and you know Antonio needs to get back to the base soon so he doesn't raise suspicion. As you're thinking of what to do your phone rings, it's the base.</span></div></div>",
            "created":1438685040,
            "id":2016499,
            "title":"Practice Makes Perfect"
        },
        "11211222121":{
            "author_id":"heyyy3",
            "author_name":"Smith1990",
            "choices":[
                "Getting over to the base",
                "Your car gets swarmed ",
                "Shit, you forgot his keys !"
            ],
            "content":"<div class=\"\"><div> <span>Hesitantly you answer the call from the base. You know it's from your general whose in charge of the whole operation. He's about to have Antonio's... rather your head since you were supposed to return to the base over an hour ago. Almost shaking you answer the phone.<br>\r\n<br>\r\n\"Alvarez where the fuck are you? You were supposed to be back over an hour ago.<br>\r\n<br>\r\n\"I'm sorry general there is no excuse for not calling you. The subject had left Shane's body before I could get to him. Shane is completely normal from what I could observe. I just got carried away talking with him since it's been so long since I have been able too.\"<br>\r\n<br>\r\nYou can hear the general slam his fist into his desk. \"Captain it's alright. Just make sure to let me know everything that is happening. This is an extremely important situation we have ongoing here. We need to catch this thing before anything serious happens and this leaks out into the public. \"<br>\r\n<br>\r\n\"Message received, I'll report back to the base right away.\" The general agrees and you hang up.<br>\r\n<br>\r\nThat wasn't so bad you think to yourself. You're now looking into a mirror and see Antonio's reflection glaring back at you. This was a lot easier with the help of Antonio's memories.<br>\r\n<br>\r\nGlancing over you spot the elephant in the room \"Oh Shane what are we going to do with you?\" You question him, but of course he doesn't answer. Now you contemplate your next move. The best idea seems to see if you can depossess Shane and focus yourself into Antonio. Since you are going to use him to get into the base.<br>\r\n<br>\r\nSlowly you begin to focus yourself out of Shane. You walk over to where he is slumped over the couch and see your goo flowing out of his mouth. Within a few moments it's over with. Shane though, is still passed out. You gather up a few things that Antonio happened to leave before, and leave before Shane even wakes up.</span></div></div>",
            "created":1460257620,
            "id":2130503,
            "title":"Answer that phone"
        },
        "1123":{
            "author_id":"cplaystennis",
            "author_name":"Vchris1989",
            "choices":[
                "Ricky's fantasy is a threesome with two of the hottest cheerleaders at school",
                "Ricky's fantasy is gay sex with the football quarterback",
                " You're too horny right now!  The fantasy must wait!"
            ],
            "content":"<div class=\"\"><div> <span>As much as you enjoy the strength and masculinity of Mike's body, you are just dying to take sexy Ricky for a spin.  He may be 14, but you can tell he's already on his way to being a fit, strong young man.  His early interest in the outdoors and, based on Mike's memories, rising stardom as his high school's first ever freshman varsity basketball MVP have given him a degree of muscle mass and tone unheard of for someone his age.  If you weren't currently possessing his father's body and mind you would absolutely bet twenty bucks that he was at least 17, especially given his height of 6'2\".  Even the hair on his legs and that early onset five o' clock shadow have you further wondering how any boy could be so manly.  You wanted that for yourself.  What would that stardom and popularity feel like?  What would it be like to have a model physique and to be able to run your fingertips over chiseled abs along your torso?  You were about to find out...<br>\r\n<br>\r\nQuickly, you work out your plan in your head and set events into motion.  You see Kyle leaping down the stairs while Ricky is still picking sneakers or something like that.  Mustering up all your fatherly charm you toss Kyle the keys to Mike's prized vintage corvette and tell Kyle to turn heads, but to be careful.  Kyle is dumbfounded and so happy and appreciative of this fatherly gesture, but he comes back to earth for a second to ask what about Ricky.  Before you can even finish the lie about Ricky all of a sudden feeling ill, Kyle is already out the door hopping in his hot ride for the day.  Using Mike's past memories you determine that his wife is loaded with errands clear until carpool this afternoon. That leaves an unsuspecting Ricky alone and to your own devices...<br>\r\n<br>\r\nWalking up the stairs you try with your mightiest effort to noiselessly move Mike's mighty frame.  Reaching the top of the stairs you listen for a sec and hear what sounds like shoe laces being tied.  Ricky zooms out of his room almost into your chest and freezes from the unexpectedness.<br>\r\n<br>\r\n\"Sorry, Dad.  Didn't know you were there.  Sorry for keeping you waiting. I-\"<br>\r\n<br>\r\n\"Son,\" you reply, \"you forgot your backpack\"<br>\r\n<br>\r\n\"Oh shit!  One sec I'll be right bac-\"<br>\r\n<br>\r\nJumping into action, you rush Ricky and push him through the doorway the instance his back turns.  The shock knocks the air out of him and you use this chance to take full advantage of Mike's larger and beefier frame- wrestling Ricky onto his back and pinning him down with your solid torso.  <br>\r\n<br>\r\n\"DAD!  What the freaking hell are you doing?!  Get the fuck off me!\"<br>\r\n<br>\r\nRicky clenches his teeth and tries with all his might to pull free, but you easily keep his arms pinned.  Waiting for the right moment you suddenly see your opening.  Right as Ricky opens his mouth wide open to scream for help, you lunge your mouth forward and lock lips onto his.  Ricky is screaming into your mouth, but you do not let up on this kiss of transfer.  Your essence immediately begins leaving Mike's body as it floods into Ricky's wide open mouth.  Ricky shakes uncontrollably and stops gasping for help as you begin to feel light-headed.  Ricky's eyes are closed and he has a slightly uncomfortable look on his face as you black out and the last of your essence cascades down Ricky's throat with a slosh.  <br>\r\n<br>\r\nBLINK<br>\r\n<br>\r\nSuddenly your vision has refocused and you take a hulking gasp of air.  You breathe in the smell of manly cologne and that's when you realize Mike, or your Dad now, is passed out on top of you.  You are able to push him to the side now that he's out like a light.  <br>\r\n<br>\r\n\"Had a fun ride, Dad, but I'm going to be enjoying this young body all day today.\"<br>\r\n<br>\r\nHoly crap you loved hearing that voice.  It was such a cool guy type of voice--the type that people would gladly obey.  And now it was yours.  God-something about controlling such an alpha-man in the making was getting you going.  Or was it just Ricky's insane testosterone levels?  Definitely both.  You stand up on limber yet strong legs and walk over to the mirror smiling and trying out all sorts of goofy and sexy faces that this body most definitely never displayed...until now...<br>\r\n<br>\r\nYou take off Ricky's sneakers and socks and examine your new size 13 feet.  Even his feet were beautiful!  They had that athletic look and weren't overly hairy--perfect for wearing some fratty flip flops.  You bend over and feel your hairy calves, getting an electric rush as you massage your calves up to your lean inner thighs.  A shiver surges down your spine and you tear off Ricky's shorts, leaving on his boxer briefs for the sake of saving the best for last.  But holy fuck, you can clearly see a monster snake under those briefs that is already inflating and more and more the longer you stare at Ricky's bod--No, your body.  <br>\r\n<br>\r\nTaking off this T-shirt you laugh like a giddy kid as you run your hands up and down your toned torso with absolute amazement.  <br>\r\n<br>\r\n\"This kid could be a freaking Calvin Klein model today!  Well now 'I' can!\"  <br>\r\n<br>\r\nYou keep caressing these toned abs, reveling in their ridges and ripples, squeezing your perfectly carved pecs and groaning whenever you accidentally brush up against your sensitive nipples.  Your new cock is completely hard at this point and threatening to tear your Calvins to shreds from the tension.  It must be at least 8 inches hard and THICK!  Holy crap, this kid is a god.  And you get to benefit from that from now on if you wish.  <br>\r\n<br>\r\nGetting a little carried away with yourself, you forgot about the Dad problem.  He is still out of it on your new bed, but he is starting to jostle and grunt a bit.  Taking preemptive action you decide to experiment with your power as you spit a pea sized amount of your essence into your hand.  Walking over to Dad, you place the pea drop on his mouth and direct it to enter and find the brain.  It slides through Dad's lips obediently and as it travels through his system you witness first-hand as his body tenses and seizes before he grabs at his head, moaning in a knowing vocalization of self-defeat.  Dad screams at the ceiling with all his might as his back arches, the veins on his neck and arms bulging to the max, before he collapses back onto your bed with a thud that vibrates the room.  He is breathing heavily and blinking with curiosity as if he were just now discovering the concept of self-awareness.  <br>\r\n<br>\r\n\"Dad?\" you ask.<br>\r\n<br>\r\n\"Yes, Ricky?\" he asks softly as he turns his head and flashes you a satisfied smile.<br>\r\n<br>\r\n\"How are you feeling?\"<br>\r\n<br>\r\n\"I've never felt better in my life!\" he exclaims with childish splendor, \"I'm so excited by the thought of following your orders.  You are my master, and I will do anything for you.  It feels so good just saying that!\"<br>\r\n<br>\r\nYou are shocked, but in a good way.  This outcome is even better than you imagined!<br>\r\n<br>\r\n\"Dad, here are your first orders.  You'll go out for the rest of the day and leave me to my own devices.  When we're alone you can act like this, but if anyone else is around in person or on the phone you have to be your regular self.  Also, you are aware of my identity and are completely fine with it.  In fact, you will serve as an occasional vessel along with being my helper for acquiring new bodies.  Now go have a great day, and be sure to call the school and tell them I have a fever and uncontrollable vomiting--something to get me out of school and practice for the day.\"<br>\r\n<br>\r\nAs Dad searches for his corvette keys you tell him to just take the family jeep and he beams a smile as he scoops up the keys and walks out the door.  <br>\r\n<br>\r\n\"Wow, what a day,\" you muse to yourself, \"Okay, Ricky, let's search that pretty head of yours and see about making a fantasy come true.\"<br>\r\n<br>\r\nYour new manhood begins engorging the moment those words leave your succulent new lips.  </span></div></div>",
            "created":1413608400,
            "id":1873929,
            "title":"How about taking Ricky for a spin?"
        },
        "11232":{
            "author_id":"writingweirdo",
            "author_name":"<3",
            "choices":[
                "Take a bit of control of Justin",
                "Go after him naturally "
            ],
            "content":"<div class=\"\"><div> <span>Wow, being Ricky is great! You get redressed in cargo shorts and  tank top, both colours going great with Ricky's, i mean your tan skin. grabbing Ricky's phone and slipping on some Vans means you're ready to go get your game on with one of the hunky jocks on the football team. Ricky's dad took the truck to work so you guess you'll have to bike to school. <br>\r\n<br>\r\nBoy, does the wind feel good blowing through your new styled-to-perfection hair. The bike ride was refreshing but you can't wait to get to school. You sneak in through the gate to football practice (which is nearing its end) and take a peek at the hunks on the field. You can see Justin, number 48, the quarterback making an amazing play. \"I can't get too distracted\" you think to yourself and sneak over into the locker room. Breathing in the manly scent of sweat and testosterone is wildly invigorating for Ricky's nostrils. Hiding in the bathroom stall, you hear all the jocks coming in from practice, all shouting and smiling. They all strip and change back into their street clothes and one by one leave school. <br>\r\n<br>\r\nJustin, like usual, stays behind. He's always the last to go home, and now it's just you and him in the locker room. <br>\r\n<br>\r\n</span></div></div>",
            "created":1499297700,
            "id":2347924,
            "title":"heading out"
        },
        "13":{
            "author_id":"mysterykid18",
            "author_name":"Mysteryguy18",
            "choices":[
                "Yes, wolves rule!",
                "No, stay a human",
                "Possess a different species",
                "Possess a different species (than choice 3)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to see what it's like be a wolf and possess the wolf again?</span></div></span></div>",
            "created":1460258040,
            "id":2130511,
            "title":"Something else"
        },
        "14":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "The Family",
                "The Jocks",
                "The Clay Brother",
                "Search for more",
                "Get out and hitch on another ride. "
            ],
            "content":"<div class=\"\"><div> <span>Your non-existent heart contorts and seems to be crushed by something. Everything around turned into a mix of colors, every sound a sickly soup of garbled noises except one.<br>\r\n<br>\r\n\"Incapacitating drug worked. Target currently disoriented. Moving in to contain.\" A voice above said.<br>\r\n<br>\r\n\"Permission granted.\" Another voice. Much deeper and masked with static.<br>\r\n<br>\r\nWhatever these people are, they seem to be trying to catch you. The man you once tried to posses reaches down to touch. Most expectations dictate this his hands would just pass through you since you are liquid. In this case, it's not. His hands is sparking and some strange energy allowed your parts that he touched turn tangible. It was unnerving and you struggled to let go. You form an appendage and tried to punch the man. He did not see that coming and it striked him in the eyes. With a momentary disorientation, his hold of you loosened. The opportunity is possible  in the smallest window of time. You hit him again and you find yourself launched free from his grasp.<br>\r\n<br>\r\nIn the wide perspective, you could see him both fall off the ground and the trees you swiftly try to swerve as you escape. He was dazed but nor for long. As he grew smaller over the horizon, he rushes to the direction you ran off too and all the while, he was talking over the walk talky strapped on his chest. Aside from the wide perspective this goo gave you, you could also sense the slightest vibration in the air and as so, you could faintly hear what he and that walk talky is saying.<br>\r\n<br>\r\n\"Subject turned aggressive and ran away, sir?.\"<br>\r\n<br>\r\n\"The subject gives off a specific radiation. Turn on your tracker D-124.\" The man turned something on his wrists and dashed to where you are running from. He was more accurate now and far more determined. The run, more like slither, was exhausting yet you kept going. The distance between you shortened. In the distance, you could hear the ground rattle. The asphalt of the highway was mere distance from you. You kept slithering and once in the middle of the road, you waited for the right opportunity. <br>\r\n<br>\r\nThe man raised something from his hips and pointed at you. A weapon, although not something you recognize. In the distance, a red four seater is coming nearer. All you need is a whole ten seconds and you are free from your pursuer. The man pulled the trigger and a line of electricity surged. With luck, it missed. It barely scratched your left but its near presence alone turned your surface tangible. Another pull of the trigger and another swerve to the left. The electricity hit the asphalt and left a smoldering patch. One hit from that thing and you're toast. <br>\r\n<br>\r\nThe car whizzes above you. Your tentacles latched on. Your pursuer cursed and reached for his contact. <br>\r\n<br>\r\n\"Target found transport. Red Ford Focus. Californian Plate and going for the I-5. Further instructions requested.\" <br>\r\n<br>\r\nThe voice from the other end did not talk for a few seconds. \"Engage code yellow.\" <br>\r\n<br>\r\n<br>\r\nThe ride was hot, windy and dry. Inch by inch, you slither your way inside the car. A guy was alone inside. From the looks of it, he's in his early 20s and probably lean in shape. His hair was ash and beneath those eyelids, a hazel eye shows the lack of focus in the road. <br>\r\n<br>\r\nThe heat from the outside has decreased your mass by half. And whatever that pursuer did to you, it left bits of you to crystallize and hinder your ability to crawl as fast. You needed to recuperate fast. A barrel of water or something might help. <br>\r\n<br>\r\nYou look around. It seems that you are in the interstate 5 and pretty much far from your home. From the movies you watched, going back home isn't the sharpest idea right now. Whoever these people are, it's a matter of time before they fund out who you are. So for the least, you should hitch this ride and transfer vehicles.<br>\r\n<br>\r\nAbove you, the person driving is unaware of your presence. Or the way you are nearing him and latching a tentacle near his face. A second was all it took before you completely engulf his face. He was trashing but kept his hands steady on the steering wheel. Mere moments later, the last bits of you are slithering down the man's throat. The fight for the mind was as easy as the fight outside. He was taken unawares and he did not have the time to strengthen his will. He gave in as soon as you entered. <br>\r\n<br>\r\nYou blink momentarily and saw the world swirl into black and brown. The road stretched long and the dessert widened on both sides. You adjusted the rear mirror and inspected your face better. Rugged at first sight. His chin is unshaved and has a small scar running from the bottom. Your eyes are hollow hazel and deep with bags. This guy has probably seen better days. <br>\r\n<br>\r\nYou revved up the speed of the car, careful not to reach the speed limit. A minute later and you topped at a diner at the side of the road. The parking lot seemed stocked with cars, mostly civilian vehicles. It's the start of the summer and most people are going to Vegas. Inside the diner, the smell of pancakes and bacon welcomed your nose. As it turns out, this host you are currently possessing haven't eaten breakfast, let alone dinner. But there's no time for that. You head to the bathroom and towards a stall which seemed the cleanest. Getting in was easy but getting out, not so much. It took most of your willpower to regurgitate yourself out. By the end of it, your previous host is foaming in his mouth. Not dead to say the least, but unconscious for several hours. <br>\r\n<br>\r\nYou slither yourself out of the stall and rushed at one of the sink. You turned the tap and absorb as much as you can drink. All the while, you so at out the crystallized pieces of you down the drain. It was a pain I have them inside you. Once back at full size, you flattened yourself and snuck at a tube that lead to the diner ceiling. With your wide perspective, you spied several viable host you can try on. <br>\r\n<br>\r\nFirst is a family of three, a dad and his twin 12 year old sons. You looked around and it seems that the father doesn't have a wedding ring. His two twin sons are fighting over the maple syrup while the dad was too busy scrolling through his phone. <br>\r\n<br>\r\nOn another tale to the left, a group of jocks are locked on to the television where a football game is playing. A blonde among them is shouting slurs with a southern accent. While the rest are shushing him to oblivion. <br>\r\n<br>\r\nOn the table to the right of the father, a familiar sight welcomes you. It's Blake Clay and his younger brother Richard \"Rich\" Clay. Lives a few blocks away from you and way more popular than you. They might be the ticket to check your family or in some ways, stay at your hometown. <br>\r\n<br>\r\nIn a moment, you ponder. The family, the jocks or the \"Clay's\". Who do you choose? <br>\r\n</span></div></div>",
            "created":1519536660,
            "id":2457333,
            "title":"Choice four"
        },
        "15":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "The Driver",
                "The Shotgun",
                "The Teem",
                "The Kid",
                "Remain a passenger on the car"
            ],
            "content":"<div class=\"\"><div> <span>Excitement is something most people feel when they ride a roller coaster or do something strange. Excitement is a good thing in moderate amounts. But as for James who is currently possessing the body of an unknown hunter in the woods, his excitement is bearing him down. Without focus, he underestimated the willpower of the hunter, let alone see how determined the hunter is in removing him from his body.<br>\r\n<br>\r\n\"What the fuck!?\" The hunter cursed. Something weird jumped at him. He doesn't know if it is an animal or something. But all he knows that it's desperately trying to get inside his body. With his willpower and a large inhale and spit, he managed to spit out most of the thing attacking him. He looked at it and saw that it is gleaming blue amidst the green and brown surroundings. He inhaled once more and spat more than he could do back home. There was no time to hesitate, he pulled open his rifle and shot whatever that things is. With one shot, he hit the thing straight through its main body. Another shot then another and another until all eight bullets are used. He glanced, and stood amazed that his actions were all for naught. All eight bullets, without their canisters, are floating at the body of that hideously cerulean monstrosity. Once again, he did not hesitate as he ran away towards his truck. <br>\r\n<br>\r\nJames on the other hand, has his excitement replaced with fear and then replaced with relief like a rollercoaster's quick twists and hoops. So far, bullets are ineffective against him. But so far, he has no host to escape this musky forest. He also realized that he needs serious concentration if he is ever going to posses someone. As he slid from trees to trees, he kept a lookout for some weak minded animals to take over. The shots from the hunter's gun scared the animals away and the only soul left for miles is James'. Nevertheless, he kept moving and moving he was mere inches away from the interstate road.<br>\r\n<br>\r\nThe cars whizzed and strobed in a flash of colors. Big trucks, small cars, strange vehicles and two wheeled motorcycles sped past James. He looked sidewards and saw a steady stream of cars coming his way. James concentrated and formed an appendage as thin a straw yet as long as a broom. He pulled and twisted his appendage, like a lasso and flicked it towards a random car he hit. As is with the cars, James was pulled in a blinding speed, away from the forrest and into whereever this car is going. Judging from the sign, he must be going somewhere over north. Specifically, Colorado. <br>\r\n<br>\r\nAnyway, as the car sliced on the great green landscape, James managed to enter the car on one of its numerous hidden entrances. Inside, the cool breeze of the AC surprised James. The cold tingles ran through the surface of his translucent skin and shivered his non-existent bones. On the driver's seat was a man, of great mass. His face was almost engulfed with a huge clean cropped brown beard.<br>\r\n<br>\r\n\"Another hour and we're there.\" The driver said.<br>\r\n<br>\r\nA man who's somewhat younger sat shotgun beside the driver. Although, unlike the driver, this guy is just starting to grow a beard. \"You've been telling that for the last three hours.\"<br>\r\n<br>\r\nBehind the driver are two boys who are uninterested with the ongoing conversation between the driver and the shotgun. On the left seat was a teenager with bright brown eyes and a dirty wood colored hair. He has his earphones tightly packed on his ear while fiddling with his social media account on his phone. On the right however, a kid, probably 13 to 15, is fiddling with his phone to. Like the person beside him, he was more interested in the cartoon playing on his phone rather than the bickering of the people in front of him.<br>\r\n<br>\r\n\"Well, I like to keep you people excited on our trip.\" The driver said.<br>\r\n<br>\r\n\"We're already excited for the past few days. And it says here on my GPS, that we won't be reaching Seattle till Monday morning.\"<br>\r\n<br>\r\n\"Bah!\" The driver groaned. \"You and your techno gizmo. I prefer to use the method I grew up with.\"<br>\r\n<br>\r\n\"Well whatever you say dear.\" And the shot gun kissed the driver on his bushy cheeks and proceeded to fiddle his phone like the boys at the back.<br>\r\n<br>\r\nAs this fight between the new and the old are unfolding, James temporarily forgot that he is a being capable of possessing bodies and bad one at that. Well, maybe not this time. As the four people fell into a mellow silence, he decided that he must pick one. And this time, he needs all the focus he could get.<br>\r\n</span></div></div>",
            "created":1521788220,
            "id":2468176,
            "title":"Thrown out"
        },
        "154":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Contact them",
                "Don't contact them",
                "Change hosts"
            ],
            "content":"<div class=\"\"><div> <span>Picking the kid is probably the best, James thought. One thing, is that kids have little to no willpower and they are easier to overpower since they are younger. Luckily for James, the kid is distracted with his phone. The element of surprise is at his hand but the only problem is, how can he do it without alerting the three other guys at the car. James stood silent as he came up with a rather dangerous idea.<br>\r\n<br>\r\n------<br>\r\n<br>\r\n“What was that?” The driver said. The other passengers are too distracted to notice that something nudged at the back of the car. Come to think of it, the three other passengers felt that the car is wriggling a lot. With most of the vibrations coming from the right backside of the car. The driver slowed down and signaled to the other drivers that he is going to take a halt at the nearest clearing.<br>\r\n<br>\r\nOnce properly parked, all occupants of the car went outside to see that one of the tires somehow deflated.<br>\r\n<br>\r\n“We just vulcanized that tire before we left. Don’t tell me it’s punctured.” The shotgun grumbled. <br>\r\n<br>\r\n“Don’t worry. Just sit back and I’ll look into this.” The driver assured. He went to the trunk and procured several tools to fix the current conundrum. <br>\r\n<br>\r\nJames saw this as a chance. He unlatched himself from the underside of the car and followed the smallest feet he could see. In a bit of luck, the little runt decided to have himself some nature trek in the nearest woods. James elongated himself like a snake and slithered through the grass, still like a snake. The boy went farther and farther but not without the eye contact of one of his guardian. He looked around the green and brown surroundings and found himself a dry stump. He flicked away bits of dirt away from the stump and sat on its woody surface and proceeded to fiddle back with his phone. On the other hand, James slithered neared and nearer until he was a mere movement away until he could touch the boy. In one silent but deadly strike, he coiled himself around the boy’s face like the face hugger from the Alien movies. The driver was too preoccupied with finding objects that could have punctured the car wheel, while shotgun was too busy watching the driver and lastly, the teen was still fiddling with his social media. This gave James the chance to focus on possessing the boy and dominating his already feeble mind. Liter by liter, James entered the boy’s orifices. All the while, he felt the tingle that made him connect with the boy’s mind. In rush he never felt before, another set of memories, different than his own, entered his mind. His name is Stan Woods, age 12 and skilled in playing soccer. He had a brother named Ian Woods, age 19, lanky and one of the rare handsome nerds. His father is named Jonathan Woods, age 48 and he is the driver of the car. The shotgun was surprisingly their father’s husband. Well, 2nd husband. His name is Oliver Sparrow, age 32 and Stan seems to think that he is a secret superhero judging from the cool name. <br>\r\nWith one blink, a thousand sensations returned at once to James. The smell of pine and decaying wood. The sound of the tools and the frustrated groans of his superhero father. He could taste the lingering flavor a bacon and egg breakfast they had. And he could feel the heat of his body against the gradual cold. <br>\r\n<br>\r\n“I’m this kid.” James muttered in Stan’s high pitched but somehow cute voice. “I’m a fucking kid.” He silently screamed. <br>\r\nIn just a matter of hours, James’ life was flipped not just upside down but splashed everywhere. He read stories online about this kind of powers. He joined groups with other people with the same interests. Together, they made stories, illustrations and captions doing this exact same thing. But now, it’s not on the realms of imagination anymore but a power he could truly use for himself. At his phone, a cartoon was playing on Youtube and this means that the phone has data. James could reveal himself with his circle of Internet friends and maybe, he could meet up with them.<br>\r\n</span></div></div>",
            "created":1521788460,
            "id":2468178,
            "title":"The Kid"
        }
    },
    "info":{
        "author_id":"heyyy3",
        "author_name":"Smith1990",
        "brief_description":"You are a new recruit in the government and they need you for a new project.",
        "created":1390398660,
        "description":"<td align=\"left\" class=\"norm\">It was just an average day and you were living a normal life. Until an accident happened to yourself and changed your life forever. You are James a typical teenage boy, 18 years old and a senior in high school.  You have some friends but not overly popular.  You have two parents, a mom named Martha and a dad named Robert.  Also you have an annoying younger sister (15) named Brittany and an older brother named Tony (19) which you admire, even though he may treat you harsh at times. <br>\r\n*****<br>\r\n<br>\r\n<br>\r\nRules for this interactive<br>\r\n<br>\r\nChapter additions should be at least two paragraphs long<br>\r\n<br>\r\nI will award anyone who adds a good chapter addition GF points.<br>\r\n<br>\r\nTry to keep it more to MtoM possessions, but any are just fine!<br>\r\n<br>\r\nKeep in mind I reserve the right to change anything I feel is not abiding by the rules.<br>\r\n<br>\r\nFinally, anyone can add to this story, and have fun with it!</td>",
        "id":1973164,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1521788460,
        "modified":1521788460,
        "pretty_title":"Body Possession Adventure"
    }
}