{
    "chapters":{
        "1":{
            "author_id":"lawliet",
            "author_name":"Lawliet",
            "choices":[
                "Run to the Tifa cosplayer",
                "Run to the cosplayers playing cards",
                "Attempt to get the woman's attention on the bench ?",
                "Too late ! Someone noticed you under the bench and is reaching for you suddenly.",
                "Something else (You decide) "
            ],
            "content":"<div class=\"\"><div> <span>You've just arrived at the anime convention you've been anticipating for months ! You just got done putting all your baggage in your hotel room and have decided to head to the main convention floor to look around before you get into your cosplay. <br>\r\n<br>\r\nAs you enter the main floor of the convention, You're amazed at all the gorgeous cosplays, several amazing quality outfits from many of your favorite games and anime. <br>\r\nYou head over to a nearby bench to take a seat and set up your camera but as you make your way to the bench, you begin to feel light headed... <br>\r\n<br>\r\nBefore you know it, you're sitting on the floor, your head is pounding and the sounds of the convention seem to be louder than usual. You take a moment to gather your head, assuming you must have fainted suddenly, you shake your head a bit and stand back up, noticing something drastically different as you look around the convention. Everything around you is chaotic, you've suddenly shrunk to about three inches tall.<br>\r\n<br>\r\nYou quickly begin to run towards the bench, knowing that being in the middle of the convention floor is horribly dangerous. <br>\r\nYou reach the bench, scurrying under it and taking a look around trying to decide what you should do now. <br>\r\n<br>\r\nYou look to the left, you see a group of Final Fantasy cosplayers, a woman dressed as Tifa is sitting on the ground, you might be able to get her attention of you can make it to her. <br>\r\n<br>\r\nYou then look to the right and notice a group of several different cosplayers sitting in a circle playing cards who also seem like they'd be easy to be noticed by. <br>\r\n<br>\r\nWhile attempting to decide where to go, a younger woman sits down on the bench, her feet not far from your hiding spot under the bench. <br>\r\nYou look up at her, unable to see her outfit too well, you look at her feet, noticing her shoes, white flats, you wonder if you'd be able to get her attention as well. <br>\r\n<br>\r\nEither way, you need to act fast, you muster up your courage and attempt- </span></div></div>",
            "created":1442364120,
            "id":2035057,
            "title":"Day 1"
        },
        "11":{
            "author_id":"asmallfriend",
            "author_name":"Keiji ",
            "choices":[
                "Into her boobs",
                "Into her panties",
                "In to her shoe",
                "other",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You run up and yell her name \"Hey lady down here\". \"Shes probably distracted by her phone I'll try climb to her shoulder then call her\" You tell yourself. You reach her upper torso and you hear her phone vibrate. You turn around and look at the phone. -Hey I'm at the panel come meet me here- its was from her friend Carly. \"Ok time to go then\" you hear her say. <br>\r\n<br>\r\nSuddenly she gets up and you lose your grip and fall.<br>\r\n<br>\r\nWhere do you fall?</span></div></div>",
            "created":1442558580,
            "id":2036132,
            "title":"Run to the Tifa cosplayer"
        },
        "111":{
            "author_id":"asmallfriend",
            "author_name":"Keiji ",
            "choices":[
                "One the ground",
                "In her panties",
                "Fall on to her chair"
            ],
            "content":"<div class=\"\"><div> <span>Here's a pic of the cosplayer: <a rel=\"nofollow\" href=\"http://www.gamersbin.com/attachments/localized/75136_5.jpg\" target=\"_blank\">http://www.gamersbin.com/attachments/loc...</a><br>\r\nYou fall off but then you felt yourself stuck in something soft you look up and see her face you then relize thsat your right between her boobs. Each step that she took moved you deeper and.<br>\r\n<br>\r\n What seemed like 30min of her walking you found yourself stuck far inside her boobs. After a while you feel you feet reach a while you felt your feet escape her entrapment. \"Oh I'm almost out hopfully I'll fall out soon\" you tell yourself. Suddenly you felt everything stop and a huge vibration almost fall you out. \"Great she probably sat down and is at the panel\" you tell yourself.<br>\r\n<br>\r\n\"Hey Carly I'm over here I saved you a seat\" the girl said. You were able to listen to their whole conversation. \"Thanks Winter. I can't wait for this Anime quiz\" Carly said. \"Oh so thats her name. Pretty cool\" you tell yourself. \"Ya me too I wonder what Anime they'll mention this time\" Winter said. \"They'll probably quiz you on the new stuff. And this time I'm sure we'll wreck the other team\" Carly said. \"Ya but I haven't seen a lot of the new or popular stuff\" Winter says. \"Well I'm sure theres one that you'll know\" Carly said. \"Ya\" Winter says.<br>\r\n<br>\r\nYou heard the announcer enter the room and he explained how everything work. You felt like you were stuck inside her boobs for an hour now. Moments later went by and you heard them start the game. For the first few rounds Winter didn't stand up. But then you heard the announcer say \"A story based in a Virtual World\". \"OHH I KNOW THIS ONE\" you felt her shoot straight so fast you feel out of her boobs and fall straight down. <br>\r\n<br>\r\nBut where do you end up.</span></div></div>",
            "created":1443429900,
            "id":2040832,
            "title":"An adventure in her boobs"
        },
        "1112":{
            "author_id":"asmallfriend",
            "author_name":"Keiji ",
            "choices":[
                "Tickle her to get her attention",
                "Wait it out"
            ],
            "content":"<div class=\"\"><div> <span>You feel yourself come to a come to stop. You open your eyes but all you could see was white clothing, you then found yourself unable to move around either. Warm feeling comes over your back \"where the hell am I\" you say trying to shift your head. Right above your head was a whole patch of hairs. \"Am I in her panties. Oh shit what should I do\"</span></div></div>",
            "created":1443693840,
            "id":2042148,
            "title":"In her panties"
        },
        "112":{
            "author_id":"asmallfriend",
            "author_name":"Keiji ",
            "choices":[
                "Tickle her o get her attention ",
                "wait it out"
            ],
            "content":"<div class=\"\"><div> <span>You feel yourself come to a comets stop. You open your eyes but all you could see was white clothing, you then found yourself unable to move around either. Warm feeling comes over your back \"where the hell am I\" you say trying to shift your head. Right above your head was a whole patch of hairs. \"Am I in her panties. Oh shit what should I do\" </span></div></div>",
            "created":1443678840,
            "id":2042098,
            "title":"Into her panties"
        },
        "13":{
            "author_id":"lawliet",
            "author_name":"Lawliet",
            "choices":[
                "She notices you ",
                "She sees you but thinks you're a bug",
                "She doesn't see you",
                "Something else (you decide)",
                "Something else ( you decide) "
            ],
            "content":"<div class=\"\"><div> <span>You decide the best option, is to try to get help from the woman sitting on the bench. <br>\r\nYou carefully walk up to her foot, climbing onto her shoe and then looking up at her leg, you decide it would be far too dangerous to try climbing so instead you think of trying to get her to notice you on top of her foot. You begin lightly stomping down as you stand on her foot but she doesn't seem to notice. <br>\r\nAfter a few more moments of trying, the woman sitting on the bench decides to stand up and begin walking off. <br>\r\nYou almost fall off her foot but you manage to grab the edge of her flat shoe and hold on tight as she walks, after a few more steps the woman notices something feels a bit odd and looks down at her shoe to see what the problem is. </span></div></div>",
            "created":1442365260,
            "id":2035068,
            "title":"Attempt to get the woman's attention on the..."
        },
        "14":{
            "author_id":"lawliet",
            "author_name":"Lawliet",
            "choices":[
                "She decides to be cruel",
                "She tosses you back out into the hallway",
                "She forces you to massage her feet",
                "She has a change of heart and wants to help you",
                "She thinks you'd make a good slave rather than a toy"
            ],
            "content":"<div class=\"\"><div> <span>Before you have a chance to react, you're quickly grabbed tight and pulled out from under the bench, then quickly stuffed into what seems to be a purse. <br>\r\n<br>\r\n\"Oh, Sorry, I dropped something\" You hear a woman say to excuse suddenly bending down next to the girl who was already sitting on the bench.<br>\r\nYou start to hear the clicking of heels and feel the purse you're in start to bump gently as your captor begins to walk away with you. <br>\r\n<br>\r\nAfter several moments you hear a door open, then close and suddenly you're dumped onto a soft surface. You look around and quickly realize it's a bed in a hotel room.<br>\r\n<br>\r\n\"Oh yes ! You're real!!\"  you hear as you look up to see a gorgeous young woman in a Miku cosplay. \"I can't believe it, I thought you were a toy when I spotted you, this is even better ! Oh I'm going to have so much fun with you little guy\" she says as she plops down onto the bed next to you, the shaking of the bed suddenly knocking you onto you back. You struggle to stand up as she looks at you trying to decide what to do first. <br>\r\n<br>\r\n\"You can't be serious, you can't just kidnap people and play with them just because they're tiny ! I need help dammit !\" You shout up at the woman, upset by her lack of sympathy to your situation. <br>\r\n<br>\r\nShe looks at you a bit more stern now and speaks. <br>\r\n\"Well then, If you're going to be so rude, I know exactly what I'm going to do to you first\" </span></div></div>",
            "created":1442364900,
            "id":2035065,
            "title":"Too late ! Someone noticed you under the bench ..."
        }
    },
    "info":{
        "author_id":"lawliet",
        "author_name":"Lawliet",
        "brief_description":"You've shrunk at a con, will you survive ? I doubt it.",
        "created":1208291160,
        "description":"<td align=\"left\" class=\"norm\">You've Just arrived at the con of the century, unfortunately for you, You've suddenly shrunk. Will you survive long enough to enjoy the con ? Or will your fate be decided by the various women that might find you. <br>\r\nBasic Giantess/Shrink story. <br>\r\n<br>\r\nRules are simple, write quality chapters and stay on topic, Giant women only, no men. <br>\r\nWrite in first person, I.E. \"You run to the door, barely making it in time.\" <br>\r\nFeet, Vore, Crushing and Cruelty all encouraged. <br>\r\n<br>\r\n<br>\r\nHave fun. </td>",
        "id":1414382,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1443693840,
        "modified":1443693840,
        "pretty_title":"Shrinking at an Anime Con."
    }
}