{
    "chapters":{
        "1":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Monkey D. Luffy",
                "Roronoa Zoro",
                "Sanji",
                "Smoker",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who will be the lucky (or unlucky) man?</span></div></span></div>",
            "created":1285045200,
            "id":960761,
            "title":"In the Begining..."
        },
        "11":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "An abandoned warehouse!",
                "A potion shop in a dark alley!",
                "A fancy, new resturant!",
                "Some kind of strange animal...",
                "The rest of his crew!"
            ],
            "content":"<div class=\"\"><div> <span>It was yet another day for Monkey D. Luffy as the Straw Hat crew pulled into port to restock their supplies.<br>\r\n<br>\r\nLuffy had originally fallen asleep on the ship. Ussop was about to wake him, when Nami stopped him.<br>\r\n<br>\r\n\"Don't you dare!\" She growled at the long-nosed pirate.<br>\r\n<br>\r\n\"Wh-What?\" Ussop said, a little intimidated by the femme fatal. \"I was just gonna wake him up so he could come with us...\"<br>\r\n<br>\r\nNami scowled. \"If you do that, we're going to end up spending five times as much as we usually do!\" She explained.<br>\r\n<br>\r\n\"But Luffy always comes with us...\" Ussop said, looking down at his sleeping friend and captain.<br>\r\n<br>\r\n\"Oh! I'm sorry!\" Nami said sarcastically, \"I didn't know YOU managed the budget around here!\" She was obviously getting a little upset that Ussop was defying her. \"Now come on!\" She growled, taking Ussop by the ear and dragging him off the ship.<br>\r\n<br>\r\nIt wasn't until a few minutes later that Luffy woke up. He looked about for a little bit, yawning as he walked about.<br>\r\n<br>\r\n\"Where did everyone go...?\" Luffy said.<br>\r\n<br>\r\nIt took him a little while, but he soon saw that he was docked at port.<br>\r\n<br>\r\n\"Hey! Cooool!\" He shouted, looking out at the gigantic town before him. \"I gotta check this place out!\"<br>\r\n<br>\r\nWith that, Luffy hopped off the ship, and ran into town.<br>\r\n<br>\r\nThe streets were crowded, filled with many, many people. He was constantly getting nudged around, due to his somewhat thin frame.<br>\r\n<br>\r\nAs he walked about, he discovered...</span></div></div>",
            "created":1285045200,
            "id":960768,
            "title":"Stretching Out!"
        },
        "111":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Get taller!",
                "Bulk up!",
                "Shrink down!"
            ],
            "content":"<div class=\"\"><div> <span>Luffy got tired of being pushed around unintentionally, so he fled, getting away from the crowd as fast as possible. He had even been knocked over a few times in his walk! Not to mention that not a soul would bother to help him up. He could understand if people were busy, and it was a cold world, but was a helping hand so hard to find? It was almost as if everyone here was full of malice in their own way... Who would want to ever come here?<br>\r\n<br>\r\n\"Wow, a lot of people are so rude!\" Luffy said with a frown, finally managing to get away. What he didn't realize is that he was down by the docks again. In fact, he could even see his ship not too far away! \"Hey! How is that even possible!? I went uphill the whole time!\" He shouted. Now that he thought about it though, he was knocked around a lot... He could've easily been disoriented. \"Stupid people...\" He then grumbled, wandering aimlessly.<br>\r\n<br>\r\nAs the rubber boy moved about, he soon found a rusted out old warehouse.<br>\r\n<br>\r\n\"What's this...\" He asked himself, looking up and reading the sign. Most of the lettering was faded, but Luffy's eyes only saw one word: \" __T RE____A___S ___U___ ___RE\"<br>\r\n<br>\r\n\"Wow! Treasure!?\" Luffy grinned, \"Alright! I musta hit the jackpot!\" He charged in, looking all about, trying to find where the \"treasure\" was. It was a bit dark, but all he could see were crates. He then glanced over at one, which read:<br>\r\n<br>\r\n<div align=\"center\">\"R__JE___E__<br>\r\nOLD<br>\r\nG______\"</div><br>\r\n<br>\r\nLuffy squinted a little, mumbling to himself as he made out the words.\"R... Rj... Rjj Gol... ROGER'S GOLD!\" Luffy shouted, running over to the crate. He was too dense to even realize there was no way Gold Roger's fortune would be in some crummy warehouse. After a little effort, he managed to pry a crate open, looking inside. However, to his dismay, it was just a bunch of powder... \"What the heck... This isn't Roger's Gold!\" Luffy shouted, overturning the crate. He sat on top of it, his arms crossed as he pouted. \"I wanted gold...\" He said in a moody tone. He looked at the powder for a moment, then looked away. Then a familiar aroma hit his nose.<br>\r\n<br>\r\nLuffy whiffed once... Twice... Three times, as he now started to look around. He got on all fours, as his nose led him back to the powder. \"This smells like... Meat!!!\" He shouted, licking up a little of it. \"Hey! This isn't half bad!\" He said, lapping up more in his tongue like a dog.<br>\r\n<br>\r\nAs Luffy kept eating the strange powder, he didn't even notice as he was starting to...</span></div></div>",
            "created":1305878460,
            "id":1109396,
            "title":"Gold Roger's Gold!?"
        },
        "1111":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "He does! Now, to find a way out...",
                "He doesn't! This warehouse is getting awfully small...",
                "Uh oh! Someone's coming in!"
            ],
            "content":"<div class=\"\"><div> <span>Luffy was happily lapping up the spilled powder, not noticing as his body slowly started to grow larger! It was a gradual process. His legs slowly stretched longer, his hands spreading out more and more on the ground where they were planted while his feet pushed up against the straps of his sandals. He didn't even notice as his tongue was suddenly able to lap up more and more of the powder at one time, further fueling his impressive growth. His body retained the same proportions as he expanded; quite simply, more of him just kept coming into existence! The powder was fueling some sort of process in his body sending his normal growth patterns completely askew, kicking it into overdrive!<br>\r\n<br>\r\nFinally, after the last of the powder was resting in Luffy's belly, he stood up, happily licking his lips, getting any last remnants of the powder from off his face and into his mouth. \"Wow! That stuff tasted really good!\" He patted his stomach only to notice something odd. \"Hey...when did my clothes get so small?\"<br>\r\n<br>\r\nThe buttons on his vest were being stretched to their max, small ovals of flesh visible between them as Luffy's body continued to bulge and expand within them. His shorts were no better off, riding halfway up his thighs, the cuffs pulled tight against them. All of this served to highlight Luffy's rather sizable bulge which was only growing larger along with the rest of him! He wiggled his thick toes as they grew over the edge of his sandals, the straps snapping one by one.<br>\r\n<br>\r\n\"Woah...I'm getting bigger!\" Luffy said, his eyes wide as he looked over his body.<br>\r\n<br>\r\nSuddenly, one by one, the buttons on his vest popped, flying into the dark recesses of the warehouse as they could no longer take the strain of Luffy's growth. A low tearing sound filled the air as his shorts followed suit, rips appearing all over the denim. To make matters worse, the waistband was starting to cut deep into his skin, making him wince. His large hands fumbled with the button before it mercifully popped off, the zipper running down until his bulge surged out passed it, his boxers clinging desperately to his hips, trying to survive the onslaught. As the shorts finally fell to pieces around him, leaving him only in his boxers, Luffy's head hit the roof of the warehouse, pressing stubbornly against it. \"A-Aw man! I need to get out of here!\"<br>\r\n<br>\r\nHe made his way over to the entrance only to trip over a small box, sending his massive body crashing to the ground. His vest tore clean in half as he got to his knees, his bent back ripping through it like wet tissue paper. Luffy crawled over to the entrance and was dismayed to see it was now far too small for him to leave through. He flicked the doors open with his fingers and put his hands through, trying to rip the door open wider. Unfortunately, it was impossible. The metal comprising the warehouse was far too thick! Even his gigantic size was no match for it.<br>\r\n<br>\r\n\"Crap! I'm stuck!\" He muttered furiously to himself.<br>\r\n<br>\r\nHe sat back down, looking nervously up at the ceiling which was coming ever closer. At this rate he was going to get stuck in here! He moved to the back of the warehouse and hoped against hope he would just stop growing soon!</span></div></div>",
            "created":1305883080,
            "id":1109405,
            "title":"The Incredible GROWING Captain!"
        },
        "11111":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Grow taller!",
                "Fill out, his flat stomach bulging out!"
            ],
            "content":"<div class=\"\"><div> <span>Just a few feet short of the ceiling, Luffy opened an eye and looked up. He let out a happy sigh, knowing he was safe for the time being. He looked around, trying to find a way out of here as soon as he could.<br>\r\n<br>\r\n\"Hey!\" He said suddenly, \"Where's my hat!?\" Even at this size, the boy was still worrying over his beloved straw hat Shanks had given him. He saw it down below on top of a crate, where it must have popped off when he was growing. He moved to pick it up, knocking over several other crates in the process! As he held it in his hands, he knew it was way too small to lay on his head... He figured it was best to store it somewhere safe, so he placed is in his naval for the time being. Gently, he pat his abs, chuckling a little. As his did, another smell, just as delicious as the last, had begun to caress his nostrils. He looked down at the powder, and dipped his finger in. That finger then went to his mouth as Luffy processed the flavor.<br>\r\n<br>\r\n\"Mmmm... Tastes kinda like cake!\" He said, grabbing up a handful and eating it... Then another... And another, until the crate was empty yet again! Luffy was licking his fingers, happy with yet another \"meal.\"<br>\r\n<br>\r\nThe dense boy still hadn't learned his lesson from last time, as now he began to...</span></div></div>",
            "created":1305888420,
            "id":1109417,
            "title":"Those Who Don't Learn from History..."
        },
        "111111":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Find Franky and tell him to start modifying the ship",
                "Explore the town at his new size"
            ],
            "content":"<div class=\"\"><div> <span>\"Mmm! Man, who knew there was so many tasty things in this place!\" Luffy said happily, licking lips as he patted his stomach. Of course this good mood only lasted a short time before his head was pressing up against the ceiling of the warehouse once again! Even sitting down his head was threatening to break through the ceiling!<br>\r\n<br>\r\n\"Crap! Stupid powder!\" He muttered to himself, sliding his body down lower, propping himself up on his elbows as his large toes started to get scrunched up against the opposite wall. Thinking fast, Luffy shoved his left leg out the door, giving him a little more room to stretch out, his right knee smashing into the ceiling, denting it, his right foot getting uncomfortably squished against the wall. Flexing his toes, Luffy managed to rip just enough of the wall out to allow his toes more room, the thickly swelling digits widening them by the second as Luffy continued to grow more and more.<br>\r\n<br>\r\nWhile he was concentrating on that, he unconsciously tried to sit up in a more comfortable position and smacked his head, hard, against the ceiling, denting it quite severely. The giant rubber man gripped his head in pain, before glaring up at the ceiling. \"Why you...!\"<br>\r\n<br>\r\nLuffy pulled back his arm as best he could before launching it at the ceiling. The horrible shriek of twisting metal filled the air as Luffy's massive fist punched a hole through the roof. Luffy blinked, his anger dissipating in his surprise. It seemed he was now strong enough, thanks to his much larger (and still growing) size, to break down the warehouse! With a mischievous grin, Luffy began to rain blows all around him, fists, elbows, feet, knees and anything part of his body that he could.<br>\r\n<br>\r\nTo the people of the quiet town it was as if a ferocious hurricane was blasting inside the warehouse, the metal walls bulging out all over, massive limbs appearing and disappearing as an enormous <i>something</i> laid waste to the storage facility. Suddenly, a massive man burst through the roof of the building, showering the area with chunks of twisted metal. The man's arms were in the air, clenched into fists, his back arched slightly with his face turned up towards the bright sun. \"Aaaah! That feels so much better!\" His voice, while childish still, was deeper and more intimidating, though his easy going smile helped alleviate some of the people's fears. Unfortunately, it wasn't enough. Screams erupted all around the town as people began to run, eager to get as far away from this mysterious naked giant as quickly as they could.<br>\r\n<br>\r\nLuffy, meanwhile, scratched his head, tilting it as he watched everyone panic. \"Huh...Wonder what they're problem is?\" He shrugged and put his hands on his hips, looking around. From his new vantage point he could easily see the Thousand Sunny. He giggled slightly as he realized he was probably way too big to fit on it. \"Franky's going to have to really put in some over time to build up the ship!\"<br>\r\n<br>\r\nWith a casual kick, Luffy knocked down the wall in front of him (which reached to about his knees) and stepped out onto the road, walking back towards the town. His every step made the ground shake which only increased the fear of the general populace. Luffy, dense as usual and not noticing that <i>he</i> was the cause of all this turmoil, casually put his arms behind his head and strolled about. \"Hmm...now what should I do?\"</span></div></div>",
            "created":1305924000,
            "id":1109651,
            "title":"The Great Warehouse Escape"
        },
        "112":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Luffy gets bored and heads back to the ship...why are his clothes so tight?",
                "Luffy finds a place to eat! Food activates the growth.",
                "Luffy starts to feel strange..."
            ],
            "content":"<div class=\"\"><div> <span>Luffy was about to bound down the street, passed a dark alley, when something caught his eye. He double backed and ran down the alley, stopping in front of a strange looking shop. The sign above the door said something in a foreign language...\"Lasciate ogne speranza, voi ch'intrate\"...Luffy tilted his head, stared at the words, tilted his head the other way, stared some more, scratched his head under his hat, shrugged, and pushed the door open. An ominous rattling sound accompanied the opening of the door, the interior of the shop shrouded in a thick darkness. Strange bottles and vials were lined up against the walls on rickety looking shelves, dusty books and strange looking equipment were set up in a darkened alcove, the counter to the shop was stained with a dark red liquid, and the air was musty with the scent of ages.<br>\r\n<br>\r\n\"Wow! What a dump!\" Luffy said energetically, his voice cutting through the silence and pretty much destroying any semblance of a mood there once was.<br>\r\n<br>\r\nA light was suddenly flicked on and the shop was thrown into sharp relief, the place looking much more cheery and normal now. A man in a tattered cloak appeared from the back room, his face obscured by a hood, only two glowing yellow eyes peeking out at the grinning captain.<br>\r\n<br>\r\n\"What do you want? Can't you see I'm trying to create ambiance here?\" The man had a raspy voice.<br>\r\n<br>\r\n\"I saw that hunk of meat in the window and was wondering how much it was! I'm starving!\" Luffy said, pointing.<br>\r\n<br>\r\nThe man looked and said, \"That's not a hunk of meat you simpleton! It's a chest made of human bones and covered in human skin! A priceless treasure from a dead civilization!\"<br>\r\n<br>\r\nLuffy poked it and said, \"I don't know...looks like jerky to me...\"<br>\r\n<br>\r\nThe man hobbled over to Luffy and slapped his hands. \"No touching! Now if you're not here to buy anything I suggest you leave! You're trying my patience!\" He started pushing Luffy out the door. Luffy easily pushed the old man aside, easy to do since he was half Luffy's size, and ran over to a nearby cabinet. \"Hey what's in here?\"<br>\r\n<br>\r\n\"Don't touch! Don't touch! That's my potion hutch! I keep all my most valuable and dangerous potions inside!\"<br>\r\n<br>\r\nLuffy totally disobeyed and opened the hutch, \"ooohing\" at all the different bottles inside. He started grabbing them at random and looking them over. \"What does this one do? Oooh, or this one? WOW! That one looks cool!\"<br>\r\n<br>\r\nBottles started flying left and right, the old man panting as he caught each one. \"Stop! Stop! If you stop and leave my shop I will give you one for free!\"<br>\r\n<br>\r\nLuffy stopped and looked over at the man. \"Really? Awesome! Which one?\"<br>\r\n<br>\r\nThe old man sighed and closed the hutch, padlocking it shut, and then made his way over to the counter. Once he was behind it, he pulled out a small ivory box and said, \"Inside this box, is a most mysterious and powerful potion. I've been searching for hundreds of years for the ingredients to create such a potion! There is only one vial in existence and it is immeasurably valuable. I will give this potion..to you!\"<br>\r\n<br>\r\nHe pushed the box over to Luffy who snatched the bottle out of it and popped the cork. \"Thanks! You can keep the box if you want.\" He guzzled the potion down as the old man stored the box away. \"Okay. There. Free stuff. Now please leave!\"<br>\r\n<br>\r\nLuffy sighed happily and tossed the potion over to the old man. \"Thanks old man! I'll see you later!\"<br>\r\n<br>\r\nThe old man just waved his hand at Luffy as he exited the shop. He laughed to himself and put another random potion in the box. \"Sucker! That was just one of my cheaper potions! Ah, the old ivory box trick never fails.\"<br>\r\n<br>\r\nHe patted the box and stored it away under the counter before heading into the back room again and flicking off the lights, returning the shop to it's atmospheric gloom.<br>\r\n<br>\r\nLuffy eagerly dashed around the city, looking for other things to do, having no idea that the potion in his belly was slowly starting to change him. The old man had thought he was giving Luffy a dud potion, but thanks to Luffy's unique physiology, he was about to change more than anyone expected!</span></div></div>",
            "created":1285045200,
            "id":960920,
            "title":"A potion shop in a dark alley!"
        },
        "1121":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "He strips his clothes off.",
                "He starts to grow."
            ],
            "content":"<div class=\"\"><div> <span>The straw hat boy looked around. Everything in this town was so cheap! Surely that was something Nami was appreciative of. Unfortunately for Luffy, he was flat broke, and people around here didn't seem too kind about giving free samples... Maybe a different approach?<br>\r\n<br>\r\nLuffy walked up to a random vendor, and skipped right to the front of the line.<br>\r\n<br>\r\n\"Hey! I betcha I can eat all your food!\" He said instantly to the man.<br>\r\n<br>\r\n\"Wh-What...!?\" The man said, suprised that not only had this kid cut everyone in line, but now he was giving orders AND demanding to eat his entire stock. \"Get out of here!\" He shouted angrily.<br>\r\n<br>\r\n\"Awww, c'mon! Just one bite!\" Luffy begged, picking up one of the octopus balls.<br>\r\n<br>\r\n\"No!\" The vendor said, slapping Luffy's hand, making him drop the ball. \"Get lost!\"<br>\r\n<br>\r\nLuffy continued to beg, but no matter what kind of tricks he tried to pull, the man refused to give Luffy even a mere lick of his wares. It went on for a good few minutes, before customers started yelling and getting upset, some even walking away. This is where the vendor drew the line. He began to shout at Luffy, making threats.<br>\r\n<br>\r\nLuffy eventually sulked off, a little disappointed that he couldn't even get a free sample. As he walked, he looked back at the stand. He watched in discontent as the man used a tissue to pick up the ball Luffy had touched, and tossed it into the nearby trash. How cruel. Luffy was almost tempted to go back and get that ball, but knowing the vendor, he'd probably yell and say that it was HIS trash.<br>\r\n<br>\r\nCrawling up the plank, Luffy sat on the edge of the boat, looking out on the town. He was a bit disheartened by this all, and he didn't even want to return to the city for the remainder of the trip.<br>\r\n<br>\r\nAs he sat, he started to sweat. Sooner than normal. Sure, it was sunny out, but usually it took a while for Luffy to start perspiring. He tugged a little at his red vest, which was stuck tight to his skin... As a matter of fact, his entire outfit fet really tight. He still had a little room in his shorts, but his trademark red vest felt like it was shrinking on him. At the same time, the straps on his sandals seemed to hug his feet a little too close as well...<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1285045200,
            "id":961027,
            "title":"I'm On a Boat!"
        },
        "11212":{
            "author_id":"fernando001",
            "author_name":"Ferny002",
            "choices":[
                "Luffy decides to wait for Zoro on the boat",
                "He goes into town, looking for Zoro"
            ],
            "content":"<div class=\"\"><div> <span>Luffy suddenly felt a tingling sensation spread from is head to his toes. He felt the plank begin bending down, threatening to break under his weight, signaling him to get off the plank. When he looked his body over, he was shocked!<br>\r\n<br>\r\n\"What the... hell!?\"<br>\r\n<br>\r\nLuffy watched as his shirt started stretching across his swelling pecs, his shirt inching upward, revealing his abs as a fourth row of them popped out above his six-pack. He could feel his back flaring out as his shoulders swelled and broadened and his neck grew thicker and longer, a large rip appearing down his back. Luffi was enjoying this, and laughed in ecstasy as he watched his legs thicken and stretch, his thighs bulging, tearing open his shorts. His shirt finally shredded into pieces, exploding off his huge torso as his boxers had trouble containing his massive, and growing manhood. His already big feet grew over the front and edges of his sandals, the strap soon ripping to shreds. His massive, strong feet soon completely crushed his sandals under their soles, his toes flexing and bending in pleasure, cracks appearing below them. The boat leaned more to the right side, showing how heavy he was.<br>\r\n<br>\r\nNow about eight feet tall and STILL growing, though it had slowed down a bit, Luffy flexed an arm, his jaw dropping as he watched his bicep rise, and rise! He looked down at his feet, and wiggled his huge toes, smirking.<br>\r\n<br>\r\n\"This! Is! Awesome!\" Luffy yelled as he continued growing, \"I've gotta show Zoro this!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1285045200,
            "id":961174,
            "title":"It takes affect!"
        },
        "112122":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Luffy finds Zoro",
                "Luffy is too hungry! He gets more food before he finds Zoro"
            ],
            "content":"<div class=\"\"><div> <span>Luffy cracked his knuckles and jumped off the boat, crashing into the ground, creating a small hole as he did so, stretching up to his full height and grinning like a child. He couldn't possibly wait another second! He wanted to show Zoro how big he got and was still getting! He was only dressed in an incredibly tight pair of boxer shorts that left nothing to the imagination but he didn't care. It's not like anyone was going to tell him what to do!<br>\r\n<br>\r\nHe began to run into town, shoving people aside left and right thanks to his tremendous bulk. Passerby stopped and stared at the enormous man, some too slow to get out of his way were tossed aside like pebbles in a storm. Some screamed in fear, not sure what to make of this strange person who was causing such havoc!<br>\r\n<br>\r\nLuffy wasn't, of course, intentionally causing havoc. He was just excited! His huge, thick feet slapped the ground with every pump of his massive legs, the ground shaking as his thunderous weight slammed into it. Several vendors who had loose items on their tables had to quickly grab them before they fell off their tables. Luffy was a regular force of nature! He passed by several food stalls without thinking about it, when he suddenly came to a screeching halt. He turned and slowly walked back to a certain stall that was selling octopus balls. He grinned at the terrified vendor and said, \"Hey...got any free samples NOW?\"<br>\r\n<br>\r\nHe flexed his impressive biceps, the huge mounds of muscle bursting up from his arms, veins snaking across them, his chest bulging out, Luffy's face glaring at the man. \"O-Of course sir! H-Have as many as you want!\"<br>\r\n<br>\r\nLuffy grinned and gathered up all the balls into his huge arms. \"Thanks little man!\"<br>\r\n<br>\r\nHe eagerly began to stuff his face as he walked away, the vendor fainting dead away at this terrifying experience. It didn't take long for Luffy to eat the man's entire stock of food. He licked his fingers and released a mighty belch. \"Heh, that stuff was great! Too bad it barely filled me up.\"<br>\r\n<br>\r\nHe patted his abs, his belly still gurgling away as he continued looking for Zoro. He was getting impatient...where would Zoro be?<br>\r\n<br>\r\nLuffy snapped his fingers. Of course! Wherever they were selling swords! He began to run through a different section of the town, looking for a place that sold weapons. Zoro's bright green hair shouldn't be TOO hard to spot.</span></div></div>",
            "created":1285045200,
            "id":961197,
            "title":"Living Large"
        },
        "1121222":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "starting growing again!",
                "demanded more meat!"
            ],
            "content":"<div class=\"\"><div> <span>Before Luffy can even spot his turf-headed friend, he started to grow hungry. Those little octopus balls weren't as filling as he had hoped. Luffy's stomach let out a loud roar as he kept running through the stone streets of this giant town. He set his hand over his abs, which was now possible thanks to his shirt bursting off his body.<br>\r\n<br>\r\nHe wanted food, and he wanted it now! Without a second thought, he dashed into the nearest resturant. There was a sign that hung from the door. It read \"Las Comidas del Gigantes.\" But Luffy paid it no mind. All he knew was that he could smell food coming from inside the building.<br>\r\n<br>\r\nHe dashed in. As he did, his nostrils were assulted with a wide variety of pleasurable scents. Lamb so tender that it could melt in your mouth... Pork sparkling with delicious, mouth watering fat... Beef so amazingly prepared, that the meat practically melted in your mouth! Oh yeah... This was DEFININTELY Luffy's kind of resturant.<br>\r\n<br>\r\n\"This is my kind of resturant!\" Luffy said proudly, grinning widely as he did. He ran right up to the counter, and pulled the waiter over the counter with ease, thanks to his beefy biceps. \"Gimme all the meat you got! Now!\" Luffy demanded.<br>\r\n<br>\r\n\"Do you have money?\" The man asked with a sly smile.<br>\r\n<br>\r\n\"Do you wanna keep your face!?\" Luffy barked back at the man, trying to put up a tough front to get what he wanted.<br>\r\n<br>\r\nThe man looked over Luffy, before smiling again. \"Heeeeey... You're a big guy, aren't you?\" He said, changing his tone from snobby to sneaky.<br>\r\n<br>\r\n\"Heck yeah!\" Luffy said, setting the man down, and flexing his body.<br>\r\n<br>\r\n\"Tell you what.\" The man began. \"I'll let you eat for free, IF you try our latest product! It'll fill you up for sure!\" He said, keeping his sneaky grin.<br>\r\n<br>\r\n\"Sure thing!\" Luffy agreed. Truth be told, he stopped listening after the man said \"eat for free.\"<br>\r\n<br>\r\nA few moments later, the same man brought Luffy a large, silver platter than held one of the largest pieces of meat Luffy had ever seen. The man stood there, watching the straw hat boy. Luffy didn't mind. He hefted the thing up, and started taking huge bites out of the thing.<br>\r\n<br>\r\nLuffy had the whole thing downed in under two minutes. Which was generally slow for him, but it would've went faster if he would've stopped talking with his mouth full to say how perfect this was.<br>\r\n<br>\r\nAs he finished, he pat his slightly distended stomach.<br>\r\n<br>\r\n\"Did you enjoy your meal, sir?\" The man asked as he smiled at Luffy.<br>\r\n<br>\r\n\"Yeah! It was amazing!\" He said, grinning.<br>\r\n<br>\r\nThen, withouth Luffy noticing yet, he...</span></div></div>",
            "created":1285131600,
            "id":961279,
            "title":"Lunch!"
        },
        "11212221":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Luffy demands his free food!",
                "He spots Zoro walking outside and chases after him"
            ],
            "content":"<div class=\"\"><div> <span>As Luffy belched, his leaned back in his chair, not noticing that his already quite huge body was growing even bigger! Slowly but surely he was taking up more and more space at his table, the chair underneath him creaking and bending, the legs looking ready to burst at any second. Luffy, oblivious as he was to his swelling body, was starting to attract attention from the other patrons of the restaurant. He was getting a few nervous glances as people weren't positive they were seeing what they thought they were seeing and a few REFUSED to look because they REFUSED to believe what they were seeing. And of course there was a fair few who were openly staring, enjoying the sight. Suddenly, the chair legs snapped, sending Luffy crashing to the floor, the entire restaurant shaking as though it was hit by a vicious attack. Luffy frowned at the broken bits of wood and said, \"Wow, these chairs suck!\" He was about to complain when he noticed he was still able to easily see and reach the top of the table, despite the fact that his toned ass was quite clearly still seated on the wooden floor. He laughed and said, \"Wow, either these tables are getting smaller or I'm getting even bigger!\"<br>\r\n<br>\r\nHis arms flexed instinctively as he held the table in front of him, the wooden circle snapping as though it was made of rotten wood. Luffy laughed again and tossed one half aside, taking the other half in his hands and ripping it in half, over and over again, until only scraps of wood and sawdust was left. Luffy grinned like a child playing with a toy the entire time. His growth seemed to have halted for the time being, but he had easily doubled his height, the six foot door now woefully inadequate to fit his enormous physique. Of course, Luffy didn't know that yet, since he was still sitting at his table. He patted his abs thoughtfully and wondered if he should get some more food. He WAS entitled to free food now after all.<br>\r\n<br>\r\nAs Luffy considered this grave decision, the sly waiter who had served him was watching carefully from a small window in the kitchen. A notebook was open in front of him and he was taking notes on the reactions to Luffy's body. The meat he had given him had specifically been a special recipe, guaranteed to increase a man's size and strength if he ate it. What the man didn't know, however, was that Luffy was already feeling the effects of the old man's potion, meaning the growth from the meat and the growth from the potion (which hadn't even begun to run its full course) was now stacking effects. Luffy, in other words, was in for quite a bit of growth.</span></div></div>",
            "created":1285131600,
            "id":961471,
            "title":"That Growing Feeling"
        },
        "112122212":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "lick my feet?\"",
                "turn the other way?\" Luffy said with an evil grin."
            ],
            "content":"<div class=\"\"><div> <span>Luffy let out a noisy belch, rubbing his stomach happily as he did. \"Hey!\" Luffy shouted out to the guy behind the counter. \"Bring me mo--\" He stopped as he saw a green blur in the corner of his eye. \"Oh! Hey! Zoro!\" the straw hat pirate said happily as he saw his friend walking just outside the resturant.<br>\r\n<br>\r\nWith that, Luffy got up off of the ground, and ran out of the building, making a huge hole in the doorway as he ran out the door. The man behind the counter snickered, watching happily. This all went as he was planning... Dressing as the man in the potion shop... A sly waiter in a resturant... The question was, what exactly did he want with Luffy? And how far was he going to take this? He had every little thing plotted out... But what he didn't know was that Luffy was a rubber man.<br>\r\n<br>\r\n\"Zoro!\" Luffy shouted on the streets, chasing after his friend, \"Hey! Zoro!\"<br>\r\n<br>\r\n\"What is it, Lu--\" Zoro stopped talking after he had turned around to see how large his captain had grow. \"Luffy!? What happened to you!?\" He said, expressing a little bit of worry.<br>\r\n<br>\r\n\"Isn't it great!?\" Luffy said happily, flexing his biceps with a wide grin. \"I dunno what happened, but I've been growing bigger and bigger!\" He explained.<br>\r\n<br>\r\n\"Have you been experimenting with your Gear Third?\" Zoro said in an annoyed tone.<br>\r\n<br>\r\n\"No way!\" Luffy replied. He was putting on a little flexing show as he spoke with Zoro. Zoro just seemed to block it out. The two stood there in silence for a little while as Luffy kept showing off his massive body to Zoro.<br>\r\n<br>\r\n\"So... What do you want?\" Zoro finally asked him, getting annoyed and bored.<br>\r\n<br>\r\nLuffy grinned as he looked down at Zoro. \"Hey! Why don't you...</span></div></div>",
            "created":1285131600,
            "id":961495,
            "title":"The Man of Rubber"
        },
        "1121222122":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Absorb Zoro's size and make it his own!",
                "Grow once more from eating!"
            ],
            "content":"<div class=\"\"><div> <span>\"Why the hell would I do that?\" Zoro asked with his usual scowl.<br>\r\n<br>\r\n\"Just do it!!!\" Luffy insisted. It looked like he would have a fit if Zoro didn't do as he said, and Zoro, quite frankly, just wasn't willing to put up his his crap. So, reluctantly, he turned around and looked the other way.<br>\r\n<br>\r\nLuffy looked around, taking a quick peek at the nearby people. It looked like no one was paying attention. Everyone was all crowded around windows and various stands. He then turned back to Zoro once more. He stomach made a dull growling as he looked down at the now tasty looking swordsman.<br>\r\n<br>\r\nWith that, Luffy began to stretch mouth, preparing his maw. He was starting to drool already! Not sparing a second thought, his mouth came down on Zoro, covering the male up to his neck.<br>\r\n<br>\r\n\"H-Hey! What the...!?\" Zoro said, his voice muffled slightly. Luffy began to work Zoro deeper in, drool sliding down Zoro's arms as they soon were pinned tight to his body. Luffy's tongue ran over Zoro's head, getting just a small taste of Zoro's flavor. His eyes rolled back a little. If his head alone tasted this great, then what would the rest of his body be like!? Hasty as ever, Luffy quickly began to work Zoro deeper into his cavernous mouth, moaning slightly as he did. However, Zoro wasn't making it easy! He kicked, he struggled, trying to do everything he could to get free of his captain's mouth.<br>\r\n<br>\r\nLuffy soon got low enough that Zoro couldn't use his swords. Luckily the moss headed pirate hadn't thought to use them sooner! Luffy ripped the swords off, and tossed them aside. Meanwhile, Zoro was trying he hardest to kick Luffy in the face. To no avail, Luffy then lifted him off the ground, making Zoro slide down in past his hips. Luffy began to suck on Zoro's body. These clothes were getting in the way of Zoro's flavor! Quickly, Luffy was trying to make his was to somewhere more secluded.<br>\r\n<br>\r\nHe just managed to squeeze into a nearby alley. Maybe not the best place, considering there were a lot of people on the streets, but at the same time, at least it offered him some protection from the outside. Zoro had managed to slip from Luffy's maw just a bit. This worked to Luffy's advantage, however. He used this opportunity to jerk Zoro's pants right off of his thick legs. He would've removed Zoro's briefs as well, but Zoro was already starting to slide idly down Luffy's throat. Impatiently, Luffy began to shove Zoro a little deeper, his thick tongue running over the smaller male's tough, thick legs. They were even better than his head!<br>\r\n<br>\r\nZoro could barely be heard as Luffy kept pushing him deeper, licking everywhere he could. He'd always loved meat... But who knew that flesh could be even better!? Before Luffy knew it, he had just about finished Zoro. He tilted his head back, letting Zoro slide down his throat, and giving his feet a little taste, before the swordsman was completely gone down Luffy's gullet. Luffy rubbed his distended belly, sighing happily.<br>\r\n<br>\r\n\"Heeheehee.\" He giggled to himself. \"I've never had such great meat before!\" He smile. As he licked his lips, he felt a little something in his teeth. His hands were a bit big to reach, and the little whatever this was in his teeth was quickly annoying him! Looking around, he spotted one of Zoro's swords, and unsheated it. Then he started to scrape his teeth with it, managing to get out what he then saw was actually a piece of Zoro's shirt! Luffy chuckled, and tossed it aside, before letting out a monstrous burp.<br>\r\n<br>\r\nJust then, Luffy's body began to...</span></div></div>",
            "created":1286514000,
            "id":971338,
            "title":"A Mossy Meal"
        },
        "11212221221":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "It was time to eat more people, and grow even more huge!",
                "Head back to that potion shop, and see what else that man had in store..."
            ],
            "content":"<div class=\"\"><div> <span>Luffy ran his hand over his abs, which distended quite a bit from his once rippling stomach. \"Ahhh, Zoro, you tasted really good...\" The captain said to himself, idly rubbing his stomach. He could still feel Zoro wriggling around inside, which only made him groan in pleasure. \"Squirm all you want, it feels great!\" Luffy said, sitting down in the alleyway, continuing to rub his stomach.<br>\r\n<br>\r\nAfter a few moments, the wriggling stopped. Luffy let out a dark chuckle, but before he could say anything witty, he felt his body give off a strage heat! His body shot up a good five, if not six feet! Astounded, Luffy stood up to his new height, surprised as he looked down! His muscles started to swell too, his biceps started to pump up, as his burly pecs started to push out from his body! He grinned as his hands ran over his tightening abs, as he could even feel his dick growing longer!<br>\r\n<br>\r\nLuffy just laughed to himself. \"Did I just gain Zoro's muscles?\" He asked aloud, \"His height too!? Maybe I should eat a little more often!\" He laughed at his own dark joke. Looking out the alleyway, he started to walk onward, people stopping and staring at the massive man. Luffy loved all the attention. He ate it up just as he had eaten Zoro up!<br>\r\n<br>\r\nIt was then that Luffy decided...</span></div></div>",
            "created":1306229460,
            "id":1111809,
            "title":"Become One with the Captain!"
        },
        "12":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "make you bigger!\"",
                "make you stronger!\"",
                "make you bigger AND stronger!\"",
                "make you invincible!\" Chopper lied. It would actually SHRINK Zoro!",
                "make you... better...\" Chopper blushed. (Hyper)"
            ],
            "content":"<div class=\"\"><div> <span>Slowly, the Thousand Sunny rode gently on the ocean blue.<br>\r\n<br>\r\nIt was a brilliant day, as the sun shone down on the Straw Hat crew. Robin was reading in the shade, Ussop was fishing, Nami was counting their most recent funds, and Sanji was chasing Luffy, trying to get back some stolen meat. It felt like just another day out at sea.<br>\r\n<br>\r\nOn the ship, there was a slight grunting as Zoro was lifting his weights. It created a soft breeze, as the swordsman easily made use of the 500 lb weight. This was nothing. He could go 800 if he really wanted to. He had to warm up first, lest he WANTED to pull a muscle.<br>\r\n<br>\r\nAs he worked, Chopper wasn't too far away. The cute little blue-nosed reindeer was mixing chemicals around, going between the test tubes and his little mortar and pestle. Zoro, however, paid him no mind since the little guy was nice enough to do the same for him.<br>\r\n<br>\r\nHowever, this \"contract\" was soon broken, as Chopper walked over to Zoro, his hooves making the cutest little \"klip-klop\" as he walked across the wooden deck.<br>\r\n<br>\r\n\"Zoro! Zoro!\" Chopper shouted as he ran up to his green-haired friend.<br>\r\n<br>\r\nZoro paid the creature no mind as he kept working. He was too focused on becoming stronger to stop and talk.<br>\r\n<br>\r\n\"Zoro! Hey!\" Chopper called, hopping up and down, trying to get Zoro's attention.<br>\r\n<br>\r\n\"What...!?\" Zoro said, just a little miffed.<br>\r\n<br>\r\n\"I have something for you! It's really cool!\" The reindeer smiled, looking up at the larger male.<br>\r\n<br>\r\nZoro set the weight down, which made a loud \"THUD!\" as it hit the ground. \"What is it?\" Zoro asked, at least a tiny bit interested in what his crewmate had to say.<br>\r\n<br>\r\n\"Lookit this!\" Chopper held up a test tube, which held a strange emerald liquid.<br>\r\n<br>\r\n\"... And? What is it?\" Zoro asked him, not really impressed. In fact, he was a bit disappointed.<br>\r\n<br>\r\n\"It's amazing! This liquid will...</span></div></div>",
            "created":1285045200,
            "id":960773,
            "title":"Path to the Worlds Greatest"
        },
        "121":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Zoro grew a few inches! (slow growth)",
                "Zoro shot up a few feet! (fast growth)",
                "Nothing happened yet..."
            ],
            "content":"<div class=\"\"><div> <span>\"...make you bigger!\" Chopper said happily. Zoro was interested now. He looked over the test tube, and snatched it right out of Chopper's little hand.<br>\r\n<br>\r\n\"Bigger, eh?\" He said, holding the vial to his face. \"What kind of bigger?\" He then asked the little reindeer companion, looking down at him.<br>\r\n<br>\r\n\"I... Don't know...\" Chopper said. \"I haven't even tested it yet... W-Wait! You're not thinking of drinking it, are you!?\" A wave of panic suddenly sweeped over the small animal's mind. \"I haven't tested it yet! It could poison you! There's no way we'll even know how big you grow!\" He began to babble Zoro was starting to get annoyed by it all. This was the side of Chopper he liked least.<br>\r\n<br>\r\nAs Chopper continued to ramble on, he raised the glass tube to his lips, and started to gulp down the strange purple liquid. It flushed right down his throat, Chopper starting to panic as he saw this happening. He even tried to stop the swordsman, but all attempts proved futile, his tiny limbs just flailing around helplessly. Soon Zoro wiped his mouth, politely handing the tube back down to Chopper.<br>\r\n<br>\r\nChopper just looked at the container and screamed in panic as he always did. \"Zoro!\" He shouted, \"Th--\"<br>\r\n<br>\r\n\"It wasn't tested, I got it!\" He said sternly, a little annoyed with Chopper's whine. Although it was within good reason.<br>\r\n<br>\r\nBefore Chopper could offer a rebuttal...</span></div></div>",
            "created":1289624400,
            "id":993129,
            "title":"The Plan"
        },
        "122":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Zoro started shrinking!",
                "Zoro started growing more muscular!",
                "Zoro was getting... fatter?!"
            ],
            "content":"<div class=\"\"><div> <span>... will make you stronger than any other man alive!\" Chopper said happily, holding the elixer right before Zoro's eyes. Zoro's eyes widened a bit. Strongest man in the world!? He'd be stupid to pass that up! And here Chopper was, waving the possibility right here in his face!<br>\r\n<br>\r\nChopper shook it a little. \"Here! It's for you!\" He said with a sweet smile, \"I know you want to become the world's greatest swordsman, so I thought this would help you!\"<br>\r\n<br>\r\nZoro took the vial in his hands, and looked down at the little animal. Chopper smiled innocently, waving up at the taller male. Just a bit apprehensive, Zoro took a whiff of the liquid. It was light green, and bubbly, and smelled of lemons and body sweat. Zoro was repulsed at first, and looked down at Chopper once again for reassurance.<br>\r\n<br>\r\nChopper was watching anxiously, wanting to see how the little experiment would turn out! He waited with baited breath, wanting Zoro to take even one little taste!<br>\r\n<br>\r\nZoro sighed. What was the harm? Even if it was a bit toxic, at least Chopper, the crew's doctor, was here, and he'd be able to fix Zoro up in a moment's notice.<br>\r\n<br>\r\nTaking one last gulp, Zoro drank it, feeling the liquid running past his gumbs and down his throat. It almost burnt a little going down, but at least it didn't taste god awful. The tingle was no problem for the swordsman at all. He had drank plenty of alcohol in his life, so one little sizzle didn't even register.<br>\r\n<br>\r\nZoro grunted, holding his gut a little. He could feel his stomach already starting to churn, as...</span></div></div>",
            "created":1304226000,
            "id":1097929,
            "title":"Guinea Pig"
        },
        "1222":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Zoro demands more of that elixer from Chopper!",
                "Zoro goes to show off his new physique to the other men!",
                "Little did Zoro know, that flex made him grow ever so slightly..."
            ],
            "content":"<div class=\"\"><div> <span>As Zoro's hand gently ran over his abs, he felt them tighten, before relaxing... And tightening again, only to relax once more. Finally, they tightened again, but this time he noticed that they didn't relax like before! In fact... They felt like they were expanding now!<br>\r\n<br>\r\nSure enough, just under Zoro's hand, his abs were growing stronger, larger, and more defined. His biceps began to swell with strength, growing from their usual baseball size, up to softball size! And they were only growing larger as he time went on! His already hard pecs were swelling up with stregth, filling out his shirt and pressing against it. Every contour of his massive chest was outlined. You could even see his nipples, slightly erect, poking at the shirt as his chest continued to fill out. His sleeves were growing tighter around his arms, and would soon tear at the slightest flex.<br>\r\n<br>\r\nZoro's lower body wasn't left out of this amazing opportunity! His thighs started to grow, feeling tight against the material of his pants, as his calves started to ball up as well, reaching a plump, round size. His pants started to ride up, as even his ass was growing firm and tight, bulging up and out until it was nice and bubbly, until it was flexed, where it then became two iron cheeks. To top off his massive growth, Zoro's already significant manhood as grown out as well, sliding from his crotch down his thigh, pinning under the material of his pants. The massive swordsman must have been packing at LEAST ten inches!!!<br>\r\n<br>\r\nSurprisingly enough, Zoro's clothes had not yet torn! The large man now looked down and over his body. \"Wh-Whoa...\" was all he could muster as he looked over his new physique.<br>\r\n<br>\r\n\"Wooooooow!\" Chopper said in admiration. \"That turned out even better than I expected!\"<br>\r\n<br>\r\n\"Wow...\" Zoro repeated, \"... I'm huge!\" Grinning, the beast of a man then gave a massive FLEX, much of his clothes now falling to pieces as his new muscles bulged and grew. A few veins popped up here and there, adding to just how intimidating Zoro looked!<br>\r\n<br>\r\nIt was then Zoro decided...</span></div></div>",
            "created":1304226000,
            "id":1097931,
            "title":"Buffing Up!"
        },
        "12222":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Luffy gives up!",
                "Luffy manages to lift Zoro!"
            ],
            "content":"<div class=\"\"><div> <span>Zoro grinned. He was overjoyed. \"Thanks a ton, Chopper!\" He said to the little brown reindeer, \"I always knew you were good for something!\"<br>\r\n<br>\r\n\"Me? Oh you! Shut up! You don't know what you're talking about!\" Chopper said, blushing and looking away. It may have sounded rude, but it was his way of accepting a compliment.<br>\r\n<br>\r\n\"How about you go back to doing your thing, and I do mine?\" Zoro suggested, started to make his way from the bow to the main deck.<br>\r\n<br>\r\n\"Oh! But Zoro!\" Chopper called, \"I still have to run some tests on you!\"<br>\r\n<br>\r\n\"Yeah, yeah...\" Zoro agreed idly. \"How about you make more of that stuff and we test what happens when I overdose?\" He told Chopper, before making his way down the stairs. Chopper would have stopped him, but he new that with Zoro's new size, he probably didn't stand a chance, even at heavy point. He decided for now, it was probably best to do just what Zoro said.<br>\r\n<br>\r\nAs Zoro made his way down the stairs, he looked about. Ussop was working on some new gadget, not like he cared, and Franky was tending to some little knot hole that was in the side of the boat. Zoro made a few steps forward, his boots making an audiable sound as he took each step. It was then that Zoro met his eyes with his first target. It was none other than the ship's captain, Monkey D. Luffy. He wasn't up to anything important anyway.<br>\r\n<br>\r\nAs Luffy was looking up at the sky, lying on his back. Most people would be thinking, but Luffy did no such thing. His mind was as blank as a fresh sheet of paper. It was then that Zoro stepped in, casting a shadow over Luffy.<br>\r\n<br>\r\n\"Huh? What happened to the sun...?\" Luffy asked, sitting up and turning around. His jaw dropped as he looked up and up and up at the massive tower of muscle before him. \"Whoooooa... Zoro!?\" Luffy hopped up to his feet. \"Zoro! Is that really you!?\"<br>\r\n<br>\r\nZoro just grinned, and flexed his bicep, the muscle peaking up with a vein running right along the side. \"You bet it is!\" He said confidently. \"You like what you see?\" He said with a cocky smirk.<br>\r\n<br>\r\n\"You got so huge!\" Luffy exclaimed, \"How did you do that!?\"<br>\r\n<br>\r\n\"Hey, I work out a lot.\" He answered with a smug smile. \"I guess you just never paid enough attention to see how huge I was getting!\" Zoro changed poses, bending forward and letting out another flex, his shirt practically falling to shreds. He didn't have sleeves anymore, the shirt was now riding up, and had a significant tear down the center where his pumped pecs had torn through.<br>\r\n<br>\r\n\"I guess not...\" Luffy agreed idly, crossing his arms as he looked over Zoro's new body.<br>\r\n<br>\r\n\"Tell 'ya what.\" Zoro began, \"Since I'm obviously so much stronger than you now, how about you let me be captain.\"<br>\r\n<br>\r\n\"What!? No way! You can't be captain! I'm captain!\" Luffy argued back. Zoro just chuckled.<br>\r\n<br>\r\n\"I wasn't asking.\" Zoro asked, his usual scowl returning. \"Look, Luffy, don't you agree the captain should be the strongest man on the crew?\" He asked, \"And just look at me! I'm huge!\" He gave another proud flex, using both his biceps, \"I'm obviously the strongest man here, so that makes me the new captain!\"<br>\r\n<br>\r\n\"Nuh-uh!\" Luffy replied stubbornly. \"I'm still the captain since I found this crew!\"<br>\r\n<br>\r\nZoro sighed. He grabbed Luffy by the front of his shirt, and held him over the ship's edge. \"You see that down there?\"<br>\r\n<br>\r\n\"H-Hey! Zoro! Put me down!\" Luffy demanded.<br>\r\n<br>\r\n\"Down there is water. Remember? The one thing that leaves you totally helpless. If you fell in there, you couldn't save yourself.\" Zoro said. It may have been cruel, but it was the cold, hard truth. He then moved back and set Luffy down. \"So let's face it. I'm WAY stronger than you.\"<br>\r\n<br>\r\n\"No you're not!\" Luffy continued to argue, not budging a bit on this matter. Zoro sighed. He pushed Luffy down on his stomach, and sat down on his back. Luffy grunted, before letting out a moan. A few of the crew members heard, but they all figured that Luffy was just complaining about being hungry again.<br>\r\n<br>\r\n\"You think you're so strong? Lift me.\" Zoro said. \"If you can't, then I'm captain.\"<br>\r\n<br>\r\nLuffy rose his thumb up to his mouth, but Zoro caught him and took it away.<br>\r\n<br>\r\n\"No using your devil fruit powers.\" He then said, \"Only raw, brute strength.\" He then sat on top of Luffy's hands, pinning them down.<br>\r\n<br>\r\nThings went on like this for a good ten minutes or so, before...</span></div></div>",
            "created":1304226000,
            "id":1097942,
            "title":"Zoro in Charge!"
        },
        "122221":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Zoro goes about asserting his dominance!",
                "Luffy goes to Chopper for help..."
            ],
            "content":"<div class=\"\"><div> <span>Luffy laid under the massive swordsman, panting and tired out. He had tried repeatedly, and even tried inflating himself like a balloon, but it was no use, since Zoro would just pound down and deflate the boy before he could get anywhere.<br>\r\n<br>\r\n\"I knew it.\" Zoro said, a slight smile across his lips. He stood up, and lifted Luffy up in his arms. He began moving back up to the bow of this ship. As he soon arrived, he set Luffy down by his weights.<br>\r\n<br>\r\n\"How about you lift these for a couple of years and then see if you're a match for me?\" He said with a cocky grin. He knew he had won. He then started to walk back down to the main deck. He had bigger fish to fry, like that annoying cook Sanji, or prove that he was even stronger than the human android, Franky.<br>\r\n<br>\r\nLuffy lied out on the deck once more, still panting and tired out. Normally he had such energy, but having what was like a 280 pound weight on your back as you tried to move didn't make things easy... He lifted his head a little, looking at the weights. These things were by no means light. The easiest one to lift was five hundred pounds alone! Luffy groaned, lying his head back once more.<br>\r\n<br>\r\n\"How did Zoro get that huge...?\" He thought to himself. \"Wish I could be that big... Then I'd show him just how strong the captain is...\"</span></div></div>",
            "created":1304226000,
            "id":1097945,
            "title":"Captain Zoro!"
        },
        "1222211":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Zoro moves on to the next crew member to intimidate!",
                "Chopper delivers another dose of the elixir!"
            ],
            "content":"<div class=\"\"><div> <span>After totally deflating his former captain's enthusiasm, Zoro made his way down the stairs, heading into the bowels of the ship. There was one man in particular he was looking forward to showing off to. The stairs creaked as Zoro made his way down them, his weight almost too much for them to handle. He was so big and heavy now it was practically impossible to move with any kind of finesse so he settled for pure intimidation! He had never been one for sneaking around much anyway! Once he reached the bottom of the stairs he made his way down the hall, his shoulders almost brushing up against the walls in the narrow passage. Seeing this made Zoro grin. As soon as Chopper made more of that stuff he wouldn't be able to even fit down here! Not that he'd need to. The ship's engines were down here along with the food storage and the kitchen. This was really the domicile of someone opposite of him. With a confident smirk, Zoro turned the corner into a rather large room. The sizzling pans and boiling pots identified the room as the kitchen where Sanji was hard at work making food for the crew to eat. He really didn't like it whenever anyone disturbed him down here, unless it was Nami or Robin of course. Zoro, however, couldn't care less what Sanji wanted or preferred. It was about time the cook learned his place.<br>\r\n<br>\r\n\"Hey, what reeks in here?\" Zoro said, knowing the insult would have the desired effect.<br>\r\n<br>\r\n\"Shut up! I don't need to hear any lip...from...you?\" Sanji's retort started out fierce but slowly died away as he turned and saw the massive Zoro framed in the doorway, grinning at him.<br>\r\n<br>\r\nZoro muscled his way in, the door frame cracking slightly, as he approached Sanji, thrusting his meaty pecs into the cook's face. \"What was that? You got something to say to me?\"<br>\r\n<br>\r\nSanji irritably tried to shove Zoro but the massive swordsman wouldn't budge even an inch. Getting frustrated, Sanji picked up a ladle and smashed it against Zoro's chest...the piece of metal merely dented. Zoro reached up and jerked the ladle out of Sanji's hands, twisting it into a pretzel before tossing it aside like it was nothing. \"So, things are going to be working a little differently from now on.\"<br>\r\n<br>\r\n\"Yeah? Says who?\" Sanji spat out defiantly.<br>\r\n<br>\r\n\"Says me, your new captain!\" Zoro retorted with a grin. \"Luffy already handed the position over to me! So from now on, you do exactly what I say!\"<br>\r\n<br>\r\n\"No way! I'm not doing anything an idiot like you says!\" Sanji shouted.<br>\r\n<br>\r\nZoro grabbed the cook roughly by the collar and lifted him off his feet, bringing him close to his face. \"Yes you will! Unless you want those precious legs of yours to be snapped like twigs!\" Zoro used his other hand to grab Sanji's leg, squeezing it slightly. \"You know I could do it.\"<br>\r\n<br>\r\nSanji could feel the power radiating out of Zoro's hand. There was no doubt he could do it. \"Fine! Whatever! Just put me down!\"<br>\r\n<br>\r\nZoro dropped Sanji who landed rather hard on his butt. \"That's better! From now on, I get served first! As much food as I want, no complaints!\"<br>\r\n<br>\r\nZoro was starting to let his power go to his head. There was something intoxicating about being able to push anyone around like this. Especially Sanji! He had always been a thorn in his side. \"So do you have any objections?\" Zoro asked with a grin.<br>\r\n<br>\r\n\"No, I get you.\" Sanji muttered mutinously.<br>\r\n<br>\r\n\"Good! You'd better start making more food. This huge body needs a lot of fuel!\" Zoro laughed as he left the kitchen, satisfied.</span></div></div>",
            "created":1304326980,
            "id":1098466,
            "title":"Overwhelming the Chef"
        },
        "1222212":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Meanwhile, Zoro was...",
                "One of the crew members spots the colossal Luffy!"
            ],
            "content":"<div class=\"\"><div> <span>Luffy hopped up, stretching a little and working all the kinks out of his sore body. Zoro's little domination spiel really did a number on his muscles, but nothing a little relaxation wouldn't fix, but right now, Luffy decided to go see Chopper, wondering if the little reindeer had any idea what happened to the ship's swordsman.<br>\r\n<br>\r\nLuffy walked up behind Chopper, who was working on something specific, judging by how he was moving. \"Hey Chopper--\"<br>\r\n<br>\r\n\"WAAAAH, don't hurt me! It's not done yet! I'm sorry!\" He said, holding his arms our as if expecting someone was going to hit him.<br>\r\n<br>\r\n\"What are you talking about?\" Luffy asked, tilting his head, \"Why so freaky?\" He asked.<br>\r\n<br>\r\n\"O-Oh! Luffy!\" Chopper said, letting out a sigh of relief. \"I thought you were Zoro...\"<br>\r\n<br>\r\nLuffy almost took it as an insult, considering how mean Zoro was to him just recently. \"So what are you doing there?\" He asked, pointing to the liquids the reindeer was mixing.<br>\r\n<br>\r\n\"Th-These?! Nothing!\" Chopper said, hiding them a little. Luffy's arm stretched and pulled one out from the mess.<br>\r\n<br>\r\n\"Then what's this?\" The former captain then asked, wanting to know. He gave it a light whiff. \"Smells kinda weird...\"<br>\r\n<br>\r\nChopper immediately got up, jumping up and trying to reach for the vial. \"No! No! You can't drink that! That's too concentrated!\" He said, his attempted showing no progress at getting the vial back.<br>\r\n<br>\r\nBefore Chopper could issue another warning, Luffy drank it down, not even know what it was. \"Blech... That didn't taste good...\" He said with his tongue now out. It went down like alcohol, leaving a burning, tingling trail as it went down. Almost as soon as it hit his gut, Luffy let out a sudden groan, dropping the vial, which Chopper then caught and set down safely. \"Grk... Chopper... What was that...?\" Luffy asked, gasping a little.<br>\r\n<br>\r\n\"It was the muscle potion I was working on for Zoro!\" He explained, a bit worried, \"You drank the concentrated part! There's no telling what that could do to you!\"<br>\r\n<br>\r\nAs if an answer, Luffy's entire body pulsated, his muscles bursting with new size all at once. His chest had developed pecs, which now slammed into his vest, causing the buttons to strain to hold back the muscle. His abs deepened, each one bulging out powerfully, becoming harder than steel. Like balloons, his arms swelled to a massive, giant size, his forearms quickly filling out, giving his an unparalleled grip. Luffy's back started to broaded, his shirt now tearing from him, like the hulk he was becoming. His delts swelled up to a gargantuan size, increasing his intimidation factor. His ass and thighs burst from their cloth prison, rippling with beautiful, powerful muscle, as his calves grew in tune with the rest of his body. His feet broke free from the sandals, snapping the straps like uncooked pasta. Luffy's own \"monster\" was growing as well, pressed tight against his zipper, only barely held back.<br>\r\n<br>\r\nLuffy was panting and wheezing, but with every breath, the behemoth of a man only grew larger and more powerful! To Chopper, it merely looked as if Luffy was being pumped with mass and power, growing more beastly with each passing second!<br>\r\n<br>\r\nLuffy, his growth finally done, managed to get to his feet. His thighs rubbed tightly together, his bulge barely restrained by a pair of jean shorts that now looked like hot pants. His vest had long since shredded, a few pathetic strands barely able to hold on to his godly body from his shoulders. Luffy's pecs were like two massive watermelons, but even that was an understatement! Ever move Luffy made, his powerful body shook, so much mass pressed into his form. Every inch of his massive physique was bulged out. Luffy almost looked unreal!<br>\r\n<br>\r\n\"Wh-Whoa...\" He panted, looking over his body. He lifted an arm and flexed his bicep, the titanic muscle welling up and bulging, a peak on his peak. \"Wow... I got really huge!\" He said, grinning, \"Let's see Zoro take this... d-down...\" He said, wavering a little. He then fell with a noisy thud that was able to shake the entire ship! It was a surprise he didn't fall through the deck!<br>\r\n<br>\r\nIt was clear to Chopper that Luffy's body was worn out from all the sudden, if not painful, growth. Chopper looked around, a bit panicked, doing his best to stay calm...</span></div></div>",
            "created":1305892680,
            "id":1109431,
            "title":"A Doctor's Advice (And Potion!)"
        },
        "12222121":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Luffy wakes up and starts searching the ship for Zoro",
                "Zoro finds Franky and orders the changes"
            ],
            "content":"<div class=\"\"><div> <span>Zoro had just made his way back onto the top deck, looking around for Franky to show him who was the REAL super guy around here when the entire ship suddenly rocked back and forth, nearly tossing Usopp (who had been fishing) over the edge. Likewise, below deck, Sanji had nearly spilled a vat of soup all over himself due to the shaking which also caused a multitude of vegetables to go spilling onto the floor. Zoro was able to easily keep his footing thanks to his larger size and more stable body mass. He quickly ran over to the side of the ship where Usopp was slowly getting back to his feet and peered over the edge of the ship. The water was calm and serene. It was incredibly unlikely that any sea creature had slammed into the boat. His eyes scanned the horizon, looking for any sign of an enemy ship. Nothing. Still, it didn't hurt to be sure! With a swift movement his meaty fist enclosed around Usopp's collar lifting the cowardly man into the air, Zoro's fierce eyes staring into his own.<br>\r\n<br>\r\n\"Z-Zoro?! Is that you?\" Usopp managed to squeak out, his feet kicking wildly in the air.<br>\r\n<br>\r\n\"Yeah, yeah, but shut up for a second!\" Zoro ordered, tightening his grip. \"Did you see anything that could have caused that shaking? A sea king? A ship? Anything like that?\"<br>\r\n<br>\r\n\"N-No! Nothing! I didn't even have a bite on my line!\" Usopp rattled off, trying to free himself from Zoro's grip. \"Now let me go!\"<br>\r\n<br>\r\n\"Feh. Fine.\" With a casual flick of his wrist Zoro sent Usopp flying into the mast. With a sharp crack he was knocked unconscious. Zoro couldn't help but smirk, flexing his arm, his veiny bicep erupting from the thick appendage. \"Damn! I wasn't even trying! Guess I really don't know my own strength!\"<br>\r\n<br>\r\nHe chuckled before cracking his knuckles and moving towards the lower decks. Whatever caused this was probably down there. \"Maybe Chopper finished the next dose for me!\" He thought, a dark grin slowly stretching across his face. All of this power was starting to go straight to his head.<br>\r\n<br>\r\nZoro's shoulders scraped somewhat uncomfortably against the walls on either side of him as he moved into the lower decks of the ship. \"Nnngh...I'm going to have to get Franky working on expanding this ship as soon as possible!\" Zoro had grandiose plans for the Thousand Sunny and the whole Straw Hat crew. Although now that he was captain they were going to have to change the name. He'd come up with something later. Right now his mind was preoccupied with the idea of a massive war ship, something that would strike fear into the hearts of anyone who would oppose him as he took his place as the greatest swordsman in the world! And why stop there? As long as he had Chopper mixing this formula he would keep getting stronger and stronger until the whole world would be under his command! The World Government was already beginning to weaken in this New Age of Pirates. Why not put a pirate in charge? And why not make it the biggest, strongest one of all? Zoro grinned as he began searching the lower decks, kicking open any door he came across, a few of them breaking off their hinges.<br>\r\n<br>\r\nChopper heard the heavy footfalls of Zoro's boots as the muscle bound swordsman slowly made his way closer to him. Panicking, he turned to his Heavy Point and started laboriously dragging Luffy over towards the closet. If Zoro saw Luffy in this state he would surely be angry and the subject of that anger...would be him! With the crunching sound of heavy wooden doors being forced off their hinges filled his ears, Chopper managed to pull up as much strength as possible and shove Luffy into a closet, barely managing to shut the door before Zoro burst in. Chopper jumped, reflexively shrinking back down to his normal form as Zoro widened the door frame with his broad shoulders, splintering the wood on either side of him as he walked slowly inside. Chopper gulped, his knees shaking as he stared up at this looming mountain of muscle before him. Luffy, while a few inches bigger and nearly twice Zoro's mass, was not even half as terrifying as Zoro whose face made it clear that no games would be played with him.<br>\r\n<br>\r\n\"O-Oh! H-Hey Zoro!\" Chopper said, trying to sound cheerfully optimistic. \"W-What's up? The potion isn't...isn't quite ready yet!\"<br>\r\n<br>\r\nZoro's cold gaze fell onto Chopper as he walked up to him, barely able to see the little reindeer creature beyond his thick pecs. Chopper cowered in Zoro's shadow, his legs feeling as weak as wet noodles.<br>\r\n<br>\r\n\"Do you know what caused the ship to shake like that?\" Zoro asked.<br>\r\n<br>\r\n\"Shake? What? Shake? What do you mean? Shake? I have no idea what you're talking about...shake?\" Chopper babbled.<br>\r\n<br>\r\nZoro rolled his eyes and said, \"How much longer until the potion is ready then?\"<br>\r\n<br>\r\n\"Um...\" Chopper glanced back at his equipment. Technically he had all the separate ingredients ready except for the concentrated dose which he would need to remake so it could all be done in about ten, fifteen minutes. \"Soon!\"<br>\r\n<br>\r\nZoro smirked and said, \"Good! You're an invaluable member of this crew Chopper! I'm counting on you.\"<br>\r\n<br>\r\nChopper chuckled, suddenly forgetting his fear as he heard the praise. He was a sucker for compliments. It made him feel special~ Obviously Zoro knew that and with guys like Chopper it was better to be loved than feared. \"Don't worry Zoro! I'll have it done really quick for you!\"<br>\r\n<br>\r\n\"Keep up the good work kid.\" Zoro said, waving a little as he headed out the door.<br>\r\n<br>\r\nAs soon as Zoro's crushing presence was gone Chopper suddenly realized what had just happened. \"Ooooh! I can't believe I fell for that!\"<br>\r\n<br>\r\nHe almost opened up the closet again before remembering how Luffy was set up in there. If he opened the door the gigantic captain would tumble down onto the floor, shaking the ship once again! \"Well...he'll be fine in there! I hope he wakes up soon though! He's the only one who could stand up to Zoro!\"<br>\r\n<br>\r\nChopper went back to his duties, wondering what the extent of this once seemingly harmless experiment would be.</span></div></div>",
            "created":1305930360,
            "id":1109746,
            "title":"Chopper's Going to be Busy for Awhile..."
        },
        "122221212":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Later, the ship docks at a nearby port to stock up.",
                "Meanwhile, as Chopper was still working..."
            ],
            "content":"<div class=\"\"><div> <span>Chopper looked down at his chemicals. Looking over at the closet, he started to hope that Luffy would wake up soon and make everything the way it was before. Then again, there was no telling if Luffy wouldn't end up as power hungry as Zoro had become...<br>\r\n<br>\r\n---------------------<br>\r\n<br>\r\nNot far away, Zoro had begun making his way to Franky's room. Franky was busy working on some kind of upgrade for his body, when he could feel a slight rumble outside his room. He got to his feet, and moved to the door. Just as he was about to open it himself, it slammed open, Franky was blown back on his rear, which was just barely concealed behind his blue speedo. He was surprised as he looked up and saw a massive Zoro grinning down at him.<br>\r\n<br>\r\n\"Hey Franky!\" Zoro said in a cocky tone. \"What are you doing? Nothing important? Thought so.\" Zoro picked the smaller male up and set him on his feet, dusting him off. \"Tell you what, how about you get to making this ship bigger?\" He asked, grinning all the while.<br>\r\n<br>\r\n\"Bigger?\" Franky asked, still a little shocked and unable to answer properly.<br>\r\n<br>\r\n\"Yeah! Bigger! I keep grinding my shoulders on these tiny hallways!\" Zoro explained, \"Is it really hard for you to understand!? Don't you see how fucking massive I am!?\" Zoro barked, flexing his biceps and pecs together. \"A man like me needs room to walk! Got it!?\"<br>\r\n<br>\r\nFranky wasn't exactly scared or impressed, but for the time being, it was just better to agree and give Zoro what he wanted. \"Yeah, I... Uh... Guess I could...\" He said, looking briefly over at his tools.<br>\r\n<br>\r\n\"Good!\" Zoro smiled, glad to see how easy this was. To further demonstrate his power, he got closer, his dominating presence bearing over Franky. \"Make sure it gets done.\" He then told Franky, his tone noticably darker. With that, he turned around, his massive pecs just brushing over Franky's face as he left. Franky blushed a little, rubbing his face where the muscle touched.<br>\r\n<br>\r\n\"... That felt... Weird.\" He thought to himself, watching Zoro's magnificent body leave the room. That back, rippling with power, those perfectly sculpted ass cheeks, those thick thighs, rubbing together... Franky slapped himself suddenly to break away from his trance!</span></div></div>",
            "created":1305934080,
            "id":1109775,
            "title":"Stronger Than an Android!"
        },
        "1222212121":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Zoro shows off in town, buying some new clothes",
                "Chopper hurries off to buy more chemicals while Luffy wakes up"
            ],
            "content":"<div class=\"\"><div> <span>After breaking out of his daze, Franky quickly ran down the hall after Zoro. \"Hey! Wait a second Zoro!\"<br>\r\n<br>\r\nZoro sighed and turned around, an act that ripped two chunks out of the walls. \"What is it now?\" The impatience was clear in his voice.<br>\r\n<br>\r\n\"I can't make any modifications to the ship while it's still moving. We're going to have to dock first.\" Franky explained.<br>\r\n<br>\r\nZoro scratched his chin and said, \"Yeah, good point. We need to stop and stock up on supplies anyway. Steer us towards the nearest port then!\"<br>\r\n<br>\r\nFranky nodded and said, \"You got it! We'll be docking in a few minutes! If I'm remembering this area right we're just about to pass a small port town!\"<br>\r\n<br>\r\nZoro yawned and waved his hand. \"Yeah, yeah, whatever. Just get it done!\"<br>\r\n<br>\r\nWith another wall ruining turn Zoro continued down the hallway. Franky found himself entranced once more as Zoro walked off. He looked even more massive in the miniscule hallways. \"Wow...he wasn't kidding! These halls ARE too small!\"<br>\r\n<br>\r\nRushing towards steerage, Franky set a course for the nearby town. It would probably be good for everyone to get off the ship for awhile, away from Zoro...though Franky was too impressed by Zoro's body to want to be <i>too</i> far away. Just seeing those bulky muscles was giving him ideas for new upgrades...not just for his own robotic body but for Zoro! Of all the crew members so far, Franky was taking the change in command the best. He didn't care who was in charge as long as he was able to go about his own business uninhibited and since Zoro needed him for adjustments to the ship, that's exactly what was happening. The same could be said of Chopper and Sanji though Sanji hated the idea of Zoro being in charge. The female crew members weren't currently on board so their opinions were negligible. They wouldn't be returning from their own ventures for another few weeks...if Zoro ever cared to go back and pick them up.<br>\r\n<br>\r\nA few minutes before they docked, Zoro ducked into Chopper's room once again. The little reindeer was hard at work, adding the last few chemicals together to create another dose of the potion. He sighed as he held up a familiar looking vial, filled with the powerful chemicals that could so drastically alter the male human body. With a quick hand movement Zoro snatched the vial from Chopper's hoof. Chopper jumped in shock, looking fearfully up at Zoro who grinned back down at him. \"Thanks shorty! I was just starting to get thirsty!\"<br>\r\n<br>\r\n\"W-Wait Zoro! Don't drink it down here! You wont' be able to get back out without wrecking the ship!\" Chopper pleaded.<br>\r\n<br>\r\nZoro's expression clouded over for just a second. He bent down, his thick muscles pressing up close to Chopper, his heaving pecs inches away from his nose. \"Listen carefully Chopper because I'm only going to say this once.\"<br>\r\n<br>\r\n\"W-What?\" Chopper asked with a gulp, his eyes glued to the thick slabs of muscle in front of him.<br>\r\n<br>\r\n\"I'm the captain around here now. I will do whatever I want, whenever I want, no matter what the consequences. If anyone tries to get in my way...\"<br>\r\n<br>\r\nHe suddenly moved in closer, his pecs surrounding Chopper's tiny head. He flexed every so slightly, causing the twin orbs of power to press tightly on either side of Chopper's face. The little doctor felt like he was going to pass out. He could feel the pure power flowing through Zoro's gigantic pecs. With a hard flex he could be seriously hurt!<br>\r\n<br>\r\n\"...They'll be sorry.\" Zoro finished, his voice a low, dangerous growl. \"Is that clear?\"<br>\r\n<br>\r\n\"C-C-Crystal...\" Chopper stammered.<br>\r\n<br>\r\n\"Good!\" Zoro said, standing back up with a warm smile on his face. \"But since you didn't know any better I'll be nice and not drink this down here. But remember your place from now on.\"<br>\r\n<br>\r\n\"Y-Yes sir!\" Chopper said meekly.<br>\r\n<br>\r\nThe ship suddenly came to a halt, the sounds of the port town drifting in through the windows. Chopper looked curiously out the window. \"Oh! Why are we stopping?\"<br>\r\n<br>\r\n\"Supply run.\" Zoro said simply. \"And Franky needs the ship to be still so he can improve it.\" A thought suddenly occurred to Zoro. \"Say, how much of the chemicals are left? That you use to make this stuff I mean?\"<br>\r\n<br>\r\n\"Huh? Let me check...\" Chopper pattered over to his supply cupboard and looked it over. \"Uh oh...looks like I'm running low. There's only enough left for a few more vials!\"<br>\r\n<br>\r\nZoro smirked and said, \"Good thing we've stopped then.\" He pulled a small bulging bag and tossed it to Chopper. \"I've been saving up some gold for awhile now to buy some new swords but now that I've got these GUNS...\" He flexed his biceps, hard, reveling in eveyr opportunity to show off. \"I don't think I need swords as much anymore.\"<br>\r\n<br>\r\n\"Yeah? So you're giving it to me?\" Chopper said happily.<br>\r\n<br>\r\n\"Yeah! But you're going to use it to buy as much of those chemicals as you can.\" Zoro said with a grin.<br>\r\n<br>\r\nChopper's mouth fell open as he looked into the bag. \"B-But...there's enough here to buy whole BARRELS of the stuff!\"<br>\r\n<br>\r\nZoro felt his cock twitch as he thought about it. So much power was his just from a tiny little vial...imagine how much he'd grow, how strong he'd get with barrels of the stuff! \"Yeah...that's perfect! Get as much as you can! And make the stuff as strong as you can! Got it?\"<br>\r\n<br>\r\nChopper felt faint as he gripped the bag tightly. \"S-Sure thing....\"<br>\r\n<br>\r\n\"I knew I could count on you!\" Zoro said happily, twirling the vial in his fingers. \"Well, I'm going to take a stroll around the town and maybe find some new clothes. Nothing too constricting though. Why would I want to hide a body like this?\"<br>\r\n<br>\r\nHe laughed and left Chopper to his thoughts, popping open the vial and dumping the contents into his mouth just as he reached the top deck. Instantly he felt the warmth spread through his body, filling him with more power! His muscles expanded bigger and bigger, his pecs tearing what was left of his shirt right down the middle, unleashing his gorgeous chest and spectacular abs to the open sea air, his broad shoulders making a massacre of the sleeves, the white cloth fluttering defeated to the deck of the ship. Zoro groaned, his head tilting back as his biceps pumped up to greater sizes, his back flaring out, his height pushing up taller and taller. Down below, the button on his pants popped off, the zipper coming quickly undone, revealing Zoro's longest and most powerful sword, his briefs straining to contain it, a patch of green pubic hair visible as the waistband stretched beyond repair. His pants swiftly were becoming shorts, his thick thighs splitting the tight leather like an old husk, his tanned legs fully on display. With a grunt Zoro felt his toes pop out of the ends of his boots, the tops of his feet bursting out of the tight confines like a butterfly emerging from its cocoon. With a laugh Zoro tore the remains of his boots off, tossing the worn leather aside, treating his pants the same way. He stretched his massive body in the bright warmth of the sun, his colossal form a truly intimidating sight to behold. He bounced his pecs with a smirk, hands at his hips, before looking off into the town.<br>\r\n<br>\r\n\"Heh...time to show these people what a real man looks like!\" Zoro's powerful feet slapped carelessly against the boards of the deck, creating loud thumping noises with every movement. His body, already having processed the chemicals once before, had made better use of them this time, giving his body greater growth. It seemed that every time someone used the potion, the effects of the growth would be more powerful. The winds of change were blowing...and things would never be the same</span></div></div>",
            "created":1305937560,
            "id":1109789,
            "title":"Zoro's Ambition"
        },
        "12222121212":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Confronted with the massive Luffy!",
                "Oh no! Highwaymen are trying to rob Chopper!"
            ],
            "content":"<div class=\"\"><div> <span>Chopper looked about on the streets, the berries deposited in his backpack. Now all he had to worry about were pickpockets... But so far, the town seemed rather peaceful. It was much different than the usual brand of rogues and pirates. Chopper actually able to feel at ease here, looking in all directions as he wandered the streets.<br>\r\n<br>\r\nSoon, he came to an herbal medicine store where he could stock up on all the medicine he would need. Not to mention, he'd need a lot of it! Zoro was only getting bigger, and with that, might have to end up making bigger doses to satisfy the musclebound captain. The little reindeer walked up to the counter, where a friendly old lady walked up, greeting the little guy.<br>\r\n<br>\r\nMeanwhile, back on the Thousand Sunny, a giant was just waking up from his long slumber.<br>\r\n<br>\r\n\"Uhhhg...\" Luffy shook his head, rubbing his head. \"What happened...?\" He asked himself. \"Wh-Why is it so dark!? And why do I feel so heavy!?\" Luffy's hands ran over himself in the darkness, trying to find out what was up. \"... Oh! Right!\" Luffy chuckled, \"I'm huge! And now I gotta go find Zoro...\" He grinned, wiggling around. All his mass made it hard to move around in the tiny closet. The wood walls were creaking and snapping under the great power this childish human now held.<br>\r\n<br>\r\nFranky was out in the hallway, repairing a wall, when he heard a loud crash! Immediately looking over, he saw a giant fist burst out of the wall! \"What the hell!?\" The android jumped back, surprised by it. \"Is that Zoro...?\" He wondered for a moment, squinting and looking over. \"No way, that skin is too pale to be Zoro's!\"<br>\r\n<br>\r\nThe first and forearm retreated back into the wall. More thumping was heard, before Luffy broke through the door, escaped from his prison. As he immediately stepped out of the hallway, he soon found himself stuck.<br>\r\n<br>\r\n\"Dang it...\" Luffy groaned. Recklessly, he took in a huge breath, and inflated like a balloon. The outlines of his muscles were still apparent even in this inflated state! Luffy then jumped out and onto the deck! Franky had seen the whole thing, his eyes wide.<br>\r\n<br>\r\n\"What... What the hell is happening to everyone around here!?\" He proclaimed, \"This is nuts! Now I have to make the halls even BIGGER! Not to mention that gaping hole!\" The android wiped his hand down his face. \"We're gonna be here a while...\" He then groaned.<br>\r\n<br>\r\nLuffy was a blimp of muscle. His legs were thick, and impeded his speed. Looking about, he had seen the boat had stopped, and everyone was off the ship, save Franky. A smirk slid across Luffy's lips. \"Heh... Looks like I have to go find everyone!\"<br>\r\n<br>\r\nBack in town, Chopper was just leaving the store, the old lady blushing as she saw the heavy point Chopper leaving, his backpack filled with everything he needed, not to mention a good eight bags full, four held on each arm. They weren't too heavy for him, as long as he made his way to the ship right away, everything would work out just fine.<br>\r\n<br>\r\nAs Chopper made his way back to the Thousand Sunny, he found himself...</span></div></div>",
            "created":1305959940,
            "id":1109987,
            "title":"Chopper's Travels"
        },
        "122221212121":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Luffy arrives at the weapons market and gets frustrated when he can't find Zoro",
                "Luffy gets lost on the way to the weapons market...and runs into Zoro!"
            ],
            "content":"<div class=\"\"><div> <span>Chopper shrugged the bags further up onto his shoulders, two of the other bags held in place by his large biceps while the last one was clenched in his fists. He had to half raise his arms in order to carry them all like this and he was relieved when he saw the ship in sight. His arms had been starting to get tired! Just as he turned the corner, stepping onto the path that led up to the Thousand Sunny, he ran smack dab into a wall. The poor doctor yelped as he fell back, holding his little blue nose. \"W-What did I just...?\"<br>\r\n<br>\r\nHe blinked as he looked down at the ground and saw a rather thick pair of feet, the toes flexing carelessly as a massive man stood before Chopper! The reindeer's eyes slowly looked up passed the bulging calves and over the massive thighs, so thick with muscle that they were rubbing up against each other, barely clothed by a pair of jean short shorts that were unbuttoned and unzipped, giving Chopper a full view of the man's enormous bulge. His boxers looked like they were ready to burst! Gulping slightly, Chopper continued the slow ascent of his gaze, admiring the massive wall of abs, each one cut deep into the man's torso, rippling and flexing with his every movement and breath. Feeling weak, he looked up passed the man's enormous chest, each pec a powerful ball of muscle bulging out and hanging over the abs like a shelf. The man's broad shoulders, thick neck, and impressive traps were just icing on the cake. Of course, by now Chopper new exactly who he was looking at. \"Oh...h-hey Luffy! I see you're awake....\"<br>\r\n<br>\r\nLuffy chuckled and said, \"Yup! And now I'm going to go find Zoro and teach him a lesson! I still really need a first mate so I'm not going to kick him off the crew or anything but he needs to learn who the REAL captain is around here!\"<br>\r\n<br>\r\nHe flexed his mountainous biceps as he said this, a determined look on his face. Chopper groaned as he imagined a fight breaking out between Luffy and Zoro in the middle of town. There had to be some way to stop that from occurring! The whole town could end up in ruin!<br>\r\n<br>\r\n\"Hey Chopper!\" Luffy's loud voice suddenly broke through Chopper's thoughts. \"Do you know where Zoro went?  It'll be easier if I know where to look!\"<br>\r\n<br>\r\nChopper knew <i>exactly</i> where Zoro had gone! He was getting a new wardrobe to better fit his body...although with the amount of the potion he ordered made there was no telling exactly how long the clothes would last! But he couldn't tell Luffy that! This was the perfect chance to try and make sure they avoided a fight breaking out! Thinking fast, he said, \"Um...I think he said he wanted to go look at some new swords!\" Chopper lied on the spot. \"I would go looking for him there!\"<br>\r\n<br>\r\n\"Alright! Thanks a lot Chopper!\" Luffy said, running off, his one track mind focused on getting to Zoro. Chopper sighed, making his way back to the ship. He was surprised that Luffy hadn't even mentioned the amount of stuff the doctor was carrying. This was the first time Chopper had bought medicine in bulk.<br>\r\n<br>\r\n\"Oh well...that just makes my job easier!\" Chopper thought to himself, boarding the Thousand Sunny. He made his way down into the lower decks, passing Franky who was completely absorbed in his work. It looked like he was measuring the halls and fixing a hole in the ceiling. As Chopper passed he muttered to himself, \"I'm going to have to start by expanding the whole ship's frame...\"<br>\r\n<br>\r\nChopper quickly dropped the bags inside his room before turning back into his normal form. He wiped the sweat off his forehead and took off his backpack as well, unloading everything he had bought onto his work table. After that, he dragged the extra bags into the closet to store, although the massive hole and the broken down walls made it look more like a junk room than a storage room. Now that he had nothing left to stall with he sat back down at his work table and started mixing up another, more powerful dose of the potion for Zoro. He knew that in the long run this was a HUGE mistake but he had gone too far now to stop. If he didn't do as Zoro said there was a chance that he would get hurt! He hoped that Luffy would be more reasonable and put a stop to Zoro's antics...but judging by his personality he might just want to keep growing too! Which would be worse? The tyrannical but fair and complimentary Zoro or the more laid back, reliable former captain Luffy?<br>\r\n<br>\r\nChopper put his hands to his face and sighed. \"Either way...we're totally doomed!\"</span></div></div>",
            "created":1306099980,
            "id":1110860,
            "title":"Luffy's Confrontation"
        },
        "1222212121212":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Luffy stretches his arm and captures Zoro!",
                "Zoro manages to escape his former captain!"
            ],
            "content":"<div class=\"\"><div> <span>While Chopper began working up another batch of his special serum for Zoro, Luffy had made his way into town. Every step he took was making a small quake around him. The waves of people parted before him, making Luffy grin happily. He knew what an unstoppable force he was, and he was loving every second of it! He was the greatest specimen of man in the entire town, making people swoon, forcing mothers to cover their children's eyes as the musclebound giant walked by. With his head held high, he kept making his way to a weaponry dealer.<br>\r\n<br>\r\nZoro was not too far away, in a \"big and tall\" type store, trying to find clothes. The cashier kept looking at him, alarmed by the size of the man. More so, he was worried about all the clothes Zoro had been tearing through, however he was much too scared to confront Zoro.<br>\r\n<br>\r\n\"Dammit, this doesn't fit either.\" Zoro grumbled, tossing it aside. He was already working through the XXXL sizes, and he still was unable to find something even remotely comfortable. There was a small pile on the floor, some shirts in tatters, while others only had small tears. He was getting closer! And the man didn't seem to have a care in the world!<br>\r\n<br>\r\nAfter another ten minutes or so, Zoro found a stretchy, army green shirt that would at least help him last a little while... As for pants, he was stuck with a beige pair of cargo shorts. The shirt stuck tight to his chest, making his pecs bounce with every step he took. His abs weren't clearly outlined, but anyone could clearly see they were there. He walked up to the counter, pulling out a small sack of cash. He tore off the tags from the clothes, handing them to the cashier.<br>\r\n<br>\r\n\"Here. I'm going to wear this.\" He said. The cashier just stared at his large hand for a moment. \"... What?\" He said with annoyance. He glanced over at the pile of clothes he made, then back at the cashier. With a gruff sigh, and a roll of his eyes, he said, \"Ugh, fine...\"  He pulled out a little extra cash. Rushing, the cashier quickly took the cash and gave Zoro his change. He was almost cowering as he watched the large man make his way out of the store without a sound.<br>\r\n<br>\r\nAs Zoro walked out, he could hear a slight commotion not to far away. Curious, he walked over and soon saw what everyone had been marveling. It was Luffy! And he was massive! Zoro's jaw dropped almost instantly as he saw the former captain walking down the street!<br>\r\n<br>\r\n\"What the hell!? How did he get so huge!?\" Zoro thought violently to himself, \"He got even bigger than me!\"<br>\r\n<br>\r\nAs Zoro was thinking to himself, he then remembered the hesitation Chopper has shown him back on the boat. That nervous look... Not to mention how he just happened to be running so low on materials. They had just stopped at an island not too long ago! How could Chopper be out of medical ingredients already? It was at this point, Zoro became a bit weary of his trust to Chopper.<br>\r\n<br>\r\nAddressing the situation at hand, Zoro started to turn, about to make a run for it. Unfortunately, he was pretty huge, and stood out in a crowd. Luffy immediately was able to spot him.<br>\r\n<br>\r\n\"Zoro!\" He shouted, his voice a bit deeper. Zoro actually stopped in his tracks! The crowd surrounding Luffy all looked over at the huge man. \"I found you! Now I'm gonna make you pay!\" He threatened, making his way over. Each footstep was a loud stomp, the pavement cracking under the massive man's feet.<br>\r\n<br>\r\nZoro immediately ran for it.</span></div></div>",
            "created":1306130100,
            "id":1111153,
            "title":"Clash of the Colossus"
        },
        "12222121212122":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Zoro angrily confronts Chopper",
                "Luffy gets distracted in his search"
            ],
            "content":"<div class=\"\"><div> <span>Thinking fast, Zoro kicked the legs off of a display stand, sending a cascade of fruit down into the street. Luffy, his eyes focused entirely on Zoro, didn't see the sudden obstruction. While his big feet managed to utterly smash the smaller fruit, the larger fruits tripped him up, his legs flying up into the air, sending the behemoth down onto his back, causing the ground to shake all around him, cracking a few windows and causing a sign to fall down. Zoro chuckled and took off, escaping down an alleyway before Luffy managed to get back to his feet. When he saw that Zoro had escaped from him he growled, gritting his teeth before slamming his foot against the ground in a rage, knocking down everyone in the immediate vicinity. The massive captain charged down the street, the ground constantly shaking and vibrating under his tremendous weight. He was pissed and he was going to find Zoro and make him pay if it was the last thing he did!<br>\r\n<br>\r\nZoro, meanwhile, watched from the shadows as the rubber man barreled down the street past him before taking off in the opposite direction, back toward the ship. A dark scowl was on his face as he made his way through the crowds, roughly shoving aside anyone who got into his way, trying to ignore the explosive sounds coming from the other areas of town where Luffy was ripping apart anything in his path in his search for Zoro. Chopper had some explaining to do and he was going to give Zoro all the answers he had if the green haired man had to beat them out of him! Deep in the back of Zoro's mind, he refused to acknowledge a rather simple fact: Luffy's size and strength, so much greater than his own, intimidated him. He had been sure that he was the biggest, strongest guy around, and now Luffy was challenging that view! He refused to lay down and let Luffy take back control of the crew! That would be a sign of weakness, something that Zoro couldn't abide in his quest! Soon, the Thousand Sunny loomed into view. Breaking into a sprint, Zoro jumped and landed on the deck, shaking the ship back and forth. \"CHOPPER!\" his voice bellowed out angrily.<br>\r\n<br>\r\nBelow the decks, Chopper nearly dropped his beaker, Zoro's voice practically making him wet himself. \"O-Oh no...He saw Luffy!\" It was the only thing that made sense. Panicking, Chopper looked for something, anything he could use to appease Zoro. He could hear the huge swordsman's steps getting louder and louder as he got closer. He stopped and put his hooves together saying a little prayer before turning around to face Zoro whenever he arrived.<br>\r\n<br>\r\nAs all of this was going on, Luffy was standing still in the middle of the street, the only person visible in the immediate area. Everyone else had cleared out as soon as Luffy appeared, an enormous mountain of muscle with a look of pure rage on his face. Glaring left and right, Luffy immediately knew Zoro wasn't in the streets...but that didn't mean he wasn't in one of these buildings! He ripped the door off the nearest building with a slight grunt, tossing it aside before forcing his way in, shattering the door frame as he did so. The room was empty except for a lone man, his knees shaking as he looked up at Luffy. Stretching out his arm, Luffy grabbed the man by the collar and lifted him up to his face. \"Hey!\" He barked. \"Did you see a green haired guy come in here?\"<br>\r\n<br>\r\n\"N-No! I haven't seen anyone like that!\" The man babbled.<br>\r\n<br>\r\n\"Feh!\" Luffy carelessly tossed the man aside, shoving his way back out the door. He growled in frustration as he looked down the road at the dozen or so buildings lining the street. This might take awhile.</span></div></div>",
            "created":1306133460,
            "id":1111173,
            "title":"Free but not Clear"
        },
        "123":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Lifting the weights is suddenly MUCH easier for Zoro",
                "Zoro decides to take a nap",
                "Luffy is bored...so he starts to pester Zoro"
            ],
            "content":"<div class=\"\"><div> <span>\"bigger AND stronger!\" Chopper was practically jumping up and down in excitement. \"See, I used those roots and leaves we found on that last island and, through the chemical process of blah blah blah\"<br>\r\n<br>\r\nZoro just stared blankly at Chopper as he babbled on about chemistry, medicine, and other boring things that held zero interest for Zoro. But, he DID hear something that was pertinent to his interests. A special liquid that made him bigger and stronger? He wanted some of that! He would do whatever it took to become stronger, as a person and as a swordsman, and if this stuff helped do just that, then there was nothing to think about.<br>\r\n<br>\r\n\"Hey Chopper!\" Zoro said loudly, his deep voice cutting through Chopper's high pitched childish one.<br>\r\n<br>\r\n\"Y-Yeah Zoro?\" Chopper wilted a little, thinking he was going to get yelled at.<br>\r\n<br>\r\n\"What are you planning on doing with that stuff?\"<br>\r\n<br>\r\n\"Huh? Oh! I was going to run some tests on it. I don't know how well it works and the whole thing is still pretty unstable. You see...\"<br>\r\n<br>\r\nZoro rolled his eyes as Chopper launched into yet ANOTHER lecture about...something, Zoro stopped listening before he even started. This was going to get him no where.<br>\r\n<br>\r\n\"You want to test it? Test it on me!\" Zoro said, leaning down and snatching the vial from Chopper's hoof.<br>\r\n<br>\r\n\"Huh?\" Chopper stared at his empty hoof for a second before screaming. \"No! No! You can't drink that yet Zoro! The effects are unpredictable! You could end up killing yourself!\"<br>\r\n<br>\r\nZoro lifted up one boot and planted it on Chopper's face. \"Settle down kid! Nothing like a little drink is going to kill me! All that's going to happen is I'm going to get stronger and you're going to get your test results!\"<br>\r\n<br>\r\nChopper shook his head, waving his arms around, trying to warn Zoro about the dangers of the chemical but Zoro wasn't listening. He popped the cork off with his thumb, tilted his head back, and emptied the vial into his mouth. The liquid splashed inside and with a single gulp, disappeared down Zoro's throat. He tossed the vial aside and patted his stomach. \"Not bad! Tasted like limes!\"<br>\r\n<br>\r\nZoro stepped off Chopper's face and the little reindeer instantly jumped back up, looking worried. \"Zoro! You don't understand! That stuff was unstable! I don't know how big or how strong you'll get! We're in the middle of the ocean! This could be disastrous!\"<br>\r\n<br>\r\nZoro rolled his eyes and said, \"Stop worrying so much. What's done is done!\" He flexed his arm and his normal, but still impressive, bicep rose up. \"Hey...when is this stuff supposed to take effect?\"<br>\r\n<br>\r\nChopper fidgeted and said, \"I don't know! I haven't run any tests on it! You're the first one to drink it! That was my only dose too! Actually it was more like three or four doses...\"<br>\r\n<br>\r\nZoro shrugged and said, \"Well, I'm going back to lifting.\"<br>\r\n<br>\r\n\"Okay...I'm going to do some reading...\" Chopper scampered off to his room to grab a few books he would need.</span></div></div>",
            "created":1285045200,
            "id":960936,
            "title":"For Me?"
        },
        "1232":{
            "author_id":"fernando001",
            "author_name":"Ferny002",
            "choices":[
                "He slowly began growing",
                "He quickly began grwoing",
                "Luffy finds him, right in time to watch him begin growing"
            ],
            "content":"<div class=\"\"><div> <span>Zoro yawned, suddenly feel exhausted. He had barely even started working out, so why was he so tired? Whatever the case was, he needed to take a nice, relaxing nap, right now! As he got up, and started walking, he didn't like the feeling of tightness around his body. Zoro tugged on his shirt, attempting to adjust it, but to no avail since is pecs were pushing too hard against the front of his shirt. His pants were also riding up slightly, he could feel the actually feel the wind blowing against his lower calves, his pants having untucked themselves from his boots. His feet felt a little crammed into his normally perfect fitting boots, his toes scrunching up slightly. <br>\r\n<br>\r\nAs he got to his hammack, he kicked of his boots, and jumped on it. It felt as if it was sagging down more than usual... but Zoro ignored that fact. He rubbed his lower abs, now revealed as his shirt rode up slightly, helping him feel more relaxed. He let his feet hang off of either side of the hammock, noticing now that they couldn't keep them right in front of him without his legs bending. <br>\r\n<br>\r\n\"Just a quick, little nap'll do wonders for me...\" <br>\r\n<br>\r\nAs Zoro closed his eyes, falling asleep, Luffy was wandering around like a lost puppy on the deck. He was soooo BORED... where was Zoro? He wanted to lift weights with him! Now! Or at least do something fun and time consuming!<br>\r\n<br>\r\n\"Ah... Where IS he?\" He asked himself.<br>\r\n<br>\r\nAs Luffy continued looking around, he had know idea what was happenning to his crew member as he slept. Zoro smiled in his sleep on his hammock as....<br>\r\n<br>\r\n</span></div></div>",
            "created":1285045200,
            "id":961127,
            "title":"A Nap does the Body Good!"
        },
        "12321":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "He makes it to the deck and Luffy spots him",
                "He runs into Sanji before he makes it to the deck"
            ],
            "content":"<div class=\"\"><div> <span>As Luffy searched around the rather large ship, Zoro continued napping in his room. The hammock was slowly sagging down more and more, the threads groaning and creaking as the weight slowly became too great for it to bear. Zoro merely grunted and shifted his position a little, his shirt riding up even more as his shoulders broadened and his back flared out. Suddenly, his toes punched five holes in the front of each boot, Zoro sighing as his feet no longer felt like they were curled up and crammed inside the boots. The rest of his foot slowly started pressing up against the top and out against the sides, the leather material creaking as his feet slowly became too much to contain. His pants were suffering a similar strain, his briefs tightening around his waist as his enormous package swiftly filled the pouch, his butt pressing out against the material. His shirt was now pulled up halfway, his rock hard abs fully visible. Or at least half of the four rows. The sleeves began to tear as his biceps swelled up and burst through.<br>\r\n<br>\r\nSuddenly, the hammock snapped and Zoro crashed down onto the floor, the boat rocking slightly as the great weight suddenly crashed down on it. Zoro grunted and sat up, looking around in confusion. \"Huh? What happened?\"<br>\r\n<br>\r\nHe got to his feet and cursed loudly as a loud CRACK filled the air.\"Dammit!\"<br>\r\n<br>\r\nHe looked up and was shocked to see the ceiling was right above him! He looked over his body and smirked a little. \"Heh...looks like Chopper's little experiment worked!\"<br>\r\n<br>\r\nZoro looked quite impressive, his bulging muscles barely contained by the pathetic clothes he still attempted to swear. He bounced his pecs with a grin, a large tear forming from the collar, halfway down his chest. \"Man...I feel stronger than ever!\"<br>\r\n<br>\r\nHe grabbed the doorknob and pulled, ripping the door off the hinges without even trying! He got out into the hallway, only to find he was having to crouch over more and more. \"Heh, looks like I gotta get to the deck if I want to stretch!\"<br>\r\n<br>\r\nHe began to make his way up there.</span></div></div>",
            "created":1285045200,
            "id":961192,
            "title":"Boys Grow the Most in Their Sleep"
        },
        "123211":{
            "author_id":"servantjupiter",
            "author_name":"NightBlade",
            "choices":[
                "\"I want you to examine my body after I remove these clothes\" (Muscle Worship)",
                "\"I'll let you see in a sec!\" (Stars undergoing another growth spurt(."
            ],
            "content":"<div class=\"\"><div> <span>Zoro reached the deck with swift ease, his growing body moving with greater stride than he would at original size. As he arrived on the deck he felt the sun basking his skin in warmth where the tears on his clothes were. He was surprised no one had seen him. \"Wanted to show off a little for someone-\" he stopped talking as he looked around to see Luffy right next to him, his head tilting as he looked at Zoro. \"Hey Luffy.\"<br>\r\n<br>\r\n\"Hey Zoro. Is there something off about you? Cause I saw you come up the deck and there seems to be something different.\" Luffy didn't notice the changes. Zoro wondered if he was purposefully being ignorant or just being his usual stupid self. <br>\r\n<br>\r\n\"Nah there's nothing wrong. See?\" Zoro said confidently as he flexed his right arm. His massivve bicep rising and tearing what little was left of his already burst sleeves, exposing it for all to see. The veins coursing with his empowered blood and ensuring his new mass was nourished. Luffy seemed to come to the realization he had hoped.<br>\r\n<br>\r\n\"Oh I got it! Sanji must have shrunken your clothes on purpose didn't he?\" Luffy questioned. It surprised Zoro, because he'd not usually go for the more mundane answer for the situation. Which in all honesty made his ignorance more annoying to Zoro. <br>\r\n<br>\r\nHe took a step forward, his massive frame shadowing Luffy as he looked down. \"I'll let you figure it out in a second if you agree to it.\" Zoro smirked as he looked down, barely seeing him over his new thick and wide pecs.<br>\r\n<br>\r\n\"Sure but I'm not sure what you want to-\" Zoro snatched him before he could finish that sentence and spoke.</span></div></div>",
            "created":1499475180,
            "id":2349386,
            "title":"Unnoticed For Now"
        },
        "14":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Set it aside for later.",
                "Drink it.",
                "Suddenly, an escaped pirate came in, nabbing the vial without Smoker noticing!",
                "Throw it away.",
                "Test it on a captured pirate!"
            ],
            "content":"<div class=\"\"><div> <span>Smoker was sitting in his office, thinking quietly to himself one day. The lights were off, and only the tiniest bit of light was able to shine through.<br>\r\n<br>\r\nThere was still a lot of piracy in the world. This irked Smoker. As an officer of the marines, it just didn't settle with him, knowing that every second of every day, someone was pillaging... Plundering... Those disgusting vagrants... Always stealing from others. The very idea of it all disgusted him.<br>\r\n<br>\r\nAs he was reveling in his hatred of pirates, Tashigi burst in, only to trip suddenly, her glasses falling from her face as she landed.<br>\r\n<br>\r\n\"Oh dangit...\" She mumbled, searching on the ground for her glasses. Her hand could be heard plopping around on the cold, stone ground as she searched. The fall had disoriented her a little. Soon she managed to find her spectacles, and set them on top of her head. \"Smoker!\" She said, saluting him as she stood in his doorway.<br>\r\n<br>\r\n\"What do you have to report, Tashigi?\" Smoker said, remaining in his thinking pose. He didn't seem to be phased by Tashigi's little accident. The klutz was doing it all the time. He knew she'd be okay.<br>\r\n<br>\r\n\"Sir! We've recently confiscated that captured pirate ship!\" She reported.<br>\r\n<br>\r\n\"So? What of it?\" Smoker asked. He was pretty sure of everything that was there. Gold, money, some food... It was highly likely that it was just another ship, and he dismissed it as so.<br>\r\n<br>\r\n\"Well, we found this strange vial, sir...\" She said, searching in her pocket. \"Oh, I hope I didn't smash it...\" She mumbled to herself as she seached her pockets, approaching Smoker's desk.<br>\r\n<br>\r\nShe set it down onto the wood, as her glasses slid down from her head and back onto her face. She didn't seem to mind.<br>\r\n<br>\r\n\"What is this junk?\" Smoker said, holding up the tiny vial, looking at it. He was about to just toss it against the wall, but decided to hear what Tashigi had to say about it first.<br>\r\n<br>\r\n\"I don't know sir!\" She said in a slightly embarassed tone. \"We just know that when we were advancing on the ship, every last member of the pirate crew was scrambling for it!\"<br>\r\n<br>\r\nSmoker's eyebrow lifted a little. This was odd... Out of everything, why would the pirates go after this little thing, and not try to fight back or guard their treasure?<br>\r\n<br>\r\n\"Is that all?\" Smoker asked. His tone suggested he was indifferent, but his face said otherwise.<br>\r\n<br>\r\n\"Yes sir! I was merely told to disclose this to you, and report it's story!\" She said with her usual stern look.<br>\r\n<br>\r\n\"Very well... Dismissed...\" Smoker told her. With that, she gave one last salute, and left Smoker alone, shutting the door as she left.<br>\r\n<br>\r\nSmoker put out his cigar, looking carefully at the tiny bottle. While he was once thinking of how much he hated pirates, now he was racking his brain over why this bottle was so important. He held it up, sloshing the thick, red liquid in the container. He couldn't tell a thing about the liquid.<br>\r\n<br>\r\n\"Maybe...\" he thought to himself, as he popped open the cork, and took a whiff. It had a powerful, energizing smell to it. So much so, that his eyes popped open. He looked down at the vial again, sloshing it a little.<br>\r\n<br>\r\nHe decides to...</span></div></div>",
            "created":1285131600,
            "id":961515,
            "title":"Dog of the Navy"
        },
        "15":{
            "author_id":"ammexous",
            "author_name":"Amme",
            "choices":[
                "Tony Tony Chopper",
                "Ussop",
                "Franky",
                "Portgas D. Ace",
                "More Choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More popular guys...</span></div></span></div>",
            "created":1297573200,
            "id":1053524,
            "title":"More Men"
        }
    },
    "info":{
        "author_id":"ammexous",
        "author_name":"Amme",
        "brief_description":"The guys of One Piece grow huge!",
        "created":1285044420,
        "description":"<td align=\"left\" class=\"norm\">Welcome to the world of One Piece Giants! This is my first story ever, so if some of the entries are too short, please forgive me. I'm not sure how long I'm supposed to write...<br>\r\n<br>\r\nBefore you write here, please allow me to set down some ground rules.<br>\r\n<br>\r\n1. No females. There's plenty of Giantess stories already in existence, if you want to read about women, go there.<br>\r\n<br>\r\n2. Poorly written chapters will be dealt with accordingly.<br>\r\n<br>\r\n3. No toilet stuff.<br>\r\n<br>\r\n4. Sex is allowed.<br>\r\n<br>\r\n5. No limit on how large characters can get.<br>\r\n<br>\r\nThat's all! If you have the time, please add on!</td>",
        "id":1709524,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1499475180,
        "modified":1499475180,
        "pretty_title":"One Piece Giants"
    }
}