{
    "chapters":{
        "1":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Eve",
                "Kate ",
                "Lilly",
                "Tony",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>From the size of everthing around you you guess your about 1 inch tall. You realise this is very bad anything could happen to you at this size you needed to find help and quick you started to walk around the forest to find some help you dont know how long you've being walking for but you where getting really tired, just when you where going to stop for a break you heard someone talking it sounded like it was coming from the other side of this bush you were next to not wasting anytime you ran right throuth it dogeing leaves and branches until you reached the other side. Once you finaly made it out of the bush you looked around trying to find the person who was speaking but as you looked to the left you where shocked to see it was a wolf. which wolf was it.</span></div></div>",
            "created":1498107600,
            "id":2340660,
            "title":"1 inch"
        },
        "11":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Sits down ",
                "Walks away",
                " She smells your scent "
            ],
            "content":"<div class=\"\"><div> <span>You recognise this wolf it's eve the crazy overprotective mother of Lilly and Kate she was looking at the forest on top of a huge rock she had a relaxed look on her face you guess she was enjoying the sunset or something. You need to try and get her attention but how it would take you days to climb to the top of the rock so you had to get her to come down here, guess I'm gonna have to try and shout her name you thought out loud HEYYY EEEVVE! Her ears perked up when she heard her name being called out. Hello who's there she said looking around the area on top of the rock she scanned the area for few minutes looking for who called her name, hum that's odd I could've sworn I heard someone calling me she said jumping of the rock oh shit you said as you saw eves front paws heading right towards you. Nooooo you screamed as her two titanic paws where coming closer and closer until booooom the force of her paws hitting the ground knocked you of your feet and sent you flying through the air ooooooh shit you shouted as you hit the ground the impact knocked the air out of your lungs and left you gasping for air pant pant pant oh god that was so close you muttered but you relief was short lived as you saw eve walking in your direction boom boom boooom you thought this was the end you closed your eyes shut preparing for the worst but, you where surprised that you didn't feel eves huge paw slowly crushing you into nothing.<br>\r\n<br>\r\nYou slowly opened your eyes and what you saw made your jaw drop you where staring right at eves behind you got a clear vue of her vagina and tail hole you knew this was a bad spot to be in but you didn't have the strength to move you just had to pray she didn't sit down.<br>\r\n<br>\r\nWhat does eve do?</span></div></div>",
            "created":1499317200,
            "id":2348583,
            "title":"Eve"
        },
        "111":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "You where getting sucked into her ass!!",
                "She needed to fart",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Your heart stopped when you saw her huge tail hole slowly coming towards you, no please don't si- booooom you didn't get a chance to finish as her ass came down on you. <br>\r\n<br>\r\nYou where directly under her tail hole but luckily you where still in one piece (sigh) that was a close one, but now wbat am I gonna do if I try to get here attention now she might get the wrong idea but I really don't wonna be under here any longer it frigging stinks you muttered as you where thinking of what to do next something started to happen. </span></div></div>",
            "created":1499317200,
            "id":2348595,
            "title":"Sits down "
        },
        "1113":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Eve gets up ",
                "you get sucked in",
                "she wanted you in another hole"
            ],
            "content":"<div class=\"\"><div> <span>As you lay there trapped beneath Eves butt you decided you'd had enough. I ain't dying here not like this, you tried with all your strength to wriggle out from under the massive wolfess you crawled all the way to the back where here tail was located. <br>\r\nY crawled for what seamed like hours (but it was only 5 minutes) you eventually reach your destination you were outside free from that stinking hole. <br>\r\n<br>\r\nOnly one problem your struggleing did'nt go unnoticed Eve felt everything and now she was looking directly at you and she looked very very mad. <br>\r\n<br>\r\nYou just stood there paralyzed with fear at the sight of the enraged wolfess sweat was dripping down your face your body shaking as you looked at the really pissed of face of Eve. You exspected her to just bolt around and rip you limb from limb but surprisingly she just smiled but this wasnt a friendly smile it was the kinda smile that promised pain and suffering, this made you even more scared you started to back away but before you could even turn around to run Eve lifted her butt and slamed it down on you, you were once again trapped beneath Eves tail hole but this time it was flexing like it was trying to suck you up!<br>\r\n<br>\r\n</span></div></div>",
            "created":1503205200,
            "id":2371980,
            "title":"Other"
        },
        "11132":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Tell her to piss off",
                "Try to make her spare you",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Eves flexing tail hole managed to grab your leg it started to slowly suck you in. Nononono please no you screamed and kicked at the huge stinking hole, (giggle) my your a fiestey one but your only delaying the inevitable Eve said in a sickly sweet voice one way or the other your going in there and I'm going to crush you into the little shit stain you are (grunt) Eve flexed her tail hole again pulling you further in. <br>\r\n<br>\r\nYou were now up to your waist in eves butt you closed your eyes dreading the moment when you will be inside of this sycho bitch, but suddenly you felt eve move she was standing up you tried to look past the huge ass you were half way inside of but you couldn't see anything besides wolf ass, well little one it's nearly time to die do you have any last words she said smiling with a mad look in her eyes. <br>\r\n<br>\r\nIn a situation like this you decided to.</span></div></div>",
            "created":1503205200,
            "id":2372035,
            "title":"you get sucked in"
        },
        "111321":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "content":"<div class=\"\"><div> <span>Tsk tsk and here I was hoping you'd at least try and persuade me to let you live but oh well goodbye little one eve clenched and flexed her tail hole pulling you all the way in. <br>\r\n<br>\r\nAaaarrrrrr you screamed as you felt the crushing weight of the slimy walls of eves ass each time she clenched her tail hole it felt like your bones where being crushed and then there's the horrible smell it stung your eyes and burnt your nostrils. <br>\r\n<br>\r\nOutside eve was having a blast each time you struggled it sent a wave of pleasure throughout her body, oh yes yes keep struggling keep struggling ohhhh eve moaned and wiggled her butt at the pleasure she was feeling<br>\r\n<br>\r\nInside it was hell for you your legs where broken your six of your ribs were as well you were begging for death at this point for the pain to just finely end but to your utter surprise everything stopped moving the walls weren't clenching around you anymore you could even smell fresh air you looked behind you and saw day light eves butt hole was wide open! <br>\r\n<br>\r\nYou crawled towards the exit fighting through the intense pain you felt it was tough but you made it to the exit you were now laying on the ring of eves ass you saw the drop at the bottom but you didn't care dying out there was better than in here you thought. Just as you were about to slide out (clench) the huge ring of flesh had closed around you crushing you instantly the only left was your arm sticking out of eves anus. <br>\r\n<br>\r\n</span></div></div>",
            "created":1503205200,
            "id":2372040,
            "title":"Tell her to piss off"
        },
        "111322":{
            "author_id":"coolest",
            "author_name":"Coolguy",
            "choices":[
                "Keep you as my personal toy",
                "Keep you as a pet.",
                "Help you find you a way to get your life back."
            ],
            "content":"<div class=\"\"><div> <span>You were struggling all of your efforts to get out eve's ass and that you didn't planned on dying in her tailhole. You had only one option that could save your life and that try to reason eve to not crush you. \"Please miss let me out and I will explain everything you need to know. I didn't mean to look at your ass and that I am trying to find help! Please let me out my Goddess!\" You scream to her and hoping that she hears your cried for help.<br>\r\n<br>\r\nEve heard your cries and that she decided to released you off out of her tailhole and onto the ground.You were breathing heavily after almost nearly die under her stinky butt but the worse has come to yet as she turned around and face down at your tiny little body. You shiver in fear as she give an intimate expression on her face.<br>\r\n<br>\r\n\"Well I am listening! What was that you needed help? Also explained fast!\" She says to you in irritated voice and that you can't find the words to describe your current situation. You try as best you could to describe anyway on how you got to the park and ended up shrunk to an inch tall and that you were trying to get an attention to her but she sat on you and that ended up in her tailhole and being stuck too as well.  <br>\r\n<br>\r\nEve begins to change her expression that she is no longer being irritated for you being stuck in her tailhole in the first placce and that trying to crush you to death thinking you were perv looking at her butt or something. Eve begins to think his story is true but what she doesn't get is why he is all sudden small and why would he be around animals with only an inch tall.<br>\r\n<br>\r\nShe leans down to your position with her face closing on your body. \"Well I am sorry little guy, I didn't mean to hurt you and I thought you were trying to play some games with my butt and that you were perv that needs to being punished or killed.\" She says to you.<br>\r\n<br>\r\n\"Well I wasn't trying to being pevert to you but I just needed help to get back my life and back to my size. Do you think you could help me....miss?\" You said, \"My name is Eve, thank you very much and that I am willing to..\"</span></div></div>",
            "created":1508389200,
            "id":2403477,
            "title":"Try to make her spare you"
        },
        "1113221":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "I'm upgrading you ",
                "We're going home ",
                "We're doing it again "
            ],
            "content":"<div class=\"\"><div> <span>Your mouth felt agape at what she just said \" yo- you can't be serious \" you looked up at eve and saw her give an evil smile \" I am in fact deadly serious \" she replied back looking you in the eye (giggles) she reached out behind you with her paw and brought you closer to her. You where now looking directly up at her smiling face her fangs slightly showing \" now listen very closely human \" she said with a serious face \" I own you you do what I say when I say it and in return I not kill you understand. <br>\r\n<br>\r\nYou rapidly nodded at her not daring to say a word (giggle) \" now let's get started shall we \" she flicked you forwards towards her back legs you flow through the air landing in an awkward position on the ground (groan) you pushed yourself up off the ground spitting out dirt \" eeewww what the hell was that f- you paused as you looked up at eves looming moist vagina the sight and musky smell sending you into a trance like state you just couldn't look away (giggles) eves giggling woke you up out of your trance and then you realise eve was sitting down! <br>\r\n<br>\r\nYou tried to rise to your feet but eves vagina was already pushing you back down (thump) you were now trapped between eves pussy lips the heat and musk was so intoxicating that you couldn't help but strip off it was a little awkward taking off your clothes from your position but you managed, (sigh) your bareskin felt great against eves musky love tunnel your dick was painfully erect you couldn't resist (hump) (hump) (hump). <br>\r\n<br>\r\nEve moan in ecstasy at your humping \" oh yeah that's it my little boy toy give me all you've got \" eve cried out grinding her behind against the ground. The friction from eves grinding felt amazing against your bareskin it was starting to burn a little but the pleasure was well worth the pain. <br>\r\n<br>\r\n\" ready here it comes little one aaaahhhhh \" eves came all over you nearly downing you in her cum you struggled to try and find air but you couldn't move from both exhaustion and eves but holding you down. <br>\r\n<br>\r\n(Gasp) <br>\r\n<br>\r\nEve jumped off you when she realised you were still under her she looked down and your little cum soaked body and giggled. So how was it for you little human \" eve said to you, you look back at her with a smile and said it was awesome! <br>\r\n<br>\r\nEve smiled at your response \" good because. \"</span></div></div>",
            "created":1509426000,
            "id":2409308,
            "title":"Keep you as my personal toy"
        },
        "11132211":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "The next morning ",
                "Through the night ",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>You quirk your eyebrow at what she said \" what do you mean by upgrading me \" eve smiled down at you \" what I mean is your going from boy toy to what is you humans call it boy- boyfriend \" your eyes widen at this she must have really enjoyed the sex we just had, if you can even call it that \" umm not to sound ungrateful or anything but why am I now your boyfriend when just two seconds ago you said you wanted me as your sec toy.\" <br>\r\n<br>\r\n(Chuckle) <br>\r\n<br>\r\nI was only Kidding about that well half Kidding we are definitely doing that again my little human\" you just laughed at eves response \" well no complaints here my sexy wolfess \" you blushed when you realised what you just said eve blushed too (giggles) well then let's head back home then hu- oh sorry what's your name! Eve said wagging her tail and smiling down at you, \" um Jacob my names Jacob my goddess \" eves blushed again at what you called her \" Jacob that's a nice name.\" <br>\r\n<br>\r\nThanks hey where are my clothes \" you looked around but couldn't see them anywhere (cough) you looked up at eve \" umm I have an ideal \" she glanced at her backside \" oh \" we'll get them back tomorrow for now let's just head home eve slurred you up into her mouth and ran back to her den. <br>\r\n<br>\r\nIt was a little smelly inside her mouth but you just ignored it and lied down on her tongue enjoying the warmth. Eves had now arrived st her den she was tired from the journey so she thought it best to get some sleep. <br>\r\n</span></div></div>",
            "created":1509426000,
            "id":2409324,
            "title":"I'm upgrading you "
        },
        "111322111":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Play ",
                "Try and get your clothes back ",
                "Meet my daughters "
            ],
            "content":"<div class=\"\"><div> <span>You woke up the next morning about to try and stand up then you realise your still inside eves mouth. Wow you looked around and saw you were surrounded by bums and lots of sharp slightly yellow teeth \" humm I wonder if I could make some kinda toothbrush for her teeth I'll probably have to do it for her obviously \" you crawled to the front of eves mouth her huge fangs blocking your way out (tap) (tap) you knocked on eves teeth trying to wake her up so you could get out. <br>\r\n<br>\r\nTwo minutes have gone by and nothing (sigh) you sat back down on her tongue and just waiting for her to let you out. <br>\r\n<br>\r\nOutside. <br>\r\n<br>\r\nEve slowly opened her eyes and started to rise up unknowingly knocking her little boyfriend around in her mouth she stretched her back in doggie style and yawned opening her mouth wide (gulk) eve suddenly starting choking on something lodged in the back of her throat cough cough cough what ever was in eves throat came flying out covered in mukus rolling onto the floor. <br>\r\n<br>\r\nWhat the- (gasp) eve reconised the little ball of spit was her boyfriend \" oh baby I'm so sorry \" eve ran towards you licking all the goooey slime off your body. Cough cough \" what the hell eve I thought you where gonna eat me \" you shouted up at her making her halt her licking and flattening her ears \" I'm really sorry honey I didn't realise really \" eve gave you her puppy eyes whimpering. <br>\r\n<br>\r\nYou looked at eves sad face and began to regret shouting at her \" hey hey it's ok babe I'm sorry for shouting I know you didn't mean to do it \" you comforted her. Eves ears perked up hearing you forgive her \" thank you honey \" eve gave you a little kiss. <br>\r\n<br>\r\nSmiling up at you giant wolf girlfriend you wondered what are going to do now \" so what now eve.\" Hummm well we could \" </span></div></div>",
            "created":1509426000,
            "id":2409350,
            "title":"The next morning "
        },
        "1113221111":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Climb me ",
                "Wolf and mouse ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This peaked your interest \" what do you have in mind \" eve smile down at you in lusty way \" well we could play.\" </span></div></span></div>",
            "created":1509426000,
            "id":2409354,
            "title":"Play "
        },
        "11132211111":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "The back ",
                "Front "
            ],
            "content":"<div class=\"\"><div> <span>Climb you? <br>\r\n<br>\r\nYes the idea of this game is if you can reach the top of my head I have to do something you tell and it can be anything thing you want \" she said lustfuly you blushed \" well what happens if I loose \" eve gave a sinister smile bending down to your level \" you have to do what ever I tell you to do \" (wink) <br>\r\n<br>\r\nOk enough teasing let's begin shall we love \" eve said smiling at you \" ok so where do I start \" hummm eve thought for a second humm \" you could start at.\"</span></div></div>",
            "created":1509426000,
            "id":2409355,
            "title":"Climb me "
        },
        "1113221113":{
            "author_id":"coolest",
            "author_name":"Coolguy",
            "choices":[
                "Eve came with her two daughters",
                "Eve came alone no luck finding her two daughters",
                "A wolf had appear in den before Eve came in"
            ],
            "content":"<div class=\"\"><div> <span>\"hmmm...We could meet my daughters.\" Eve said and that you couldn't believe what you were hearing. Meeting one wolfess was already enough but seeing more made you feel terrified and weak.\"Your....daughters? How..many you have? You said nervously up at Eve and that she grin happily. \"Well I have two beautiful daughters darling and that I think it is good to meet my family too. I just don't want to get hurt or anything if they discover you in my den. So I think it is best to meet them now.\" She was right actually and that it would be better to meet them first instead of them being discover by them. Who knows what they are capable of and that it could happen earlier today where Eve almost crush you in her ass and that you didn't want to be crushed or anything.<br>\r\n<br>\r\nEve looks at you as you were thinking and she kind of read your mind as you were going into your thoughts \"It's okay Honey, I won't let them hurt you at all and that I should protect you if there is any problems with them. I do have to say though if you made any of my daughters cried or hurt, then you will be likely be punished for your crimes and I mean it!\" She says in a overprotective motherly way. You felt a chill in your bones that she is being quite serious about that and that you take no chance in arguing about it. \"I will try my best to pleased you and your daughters as best as I can babe.\" You said and that you pat your hands onto her paws to make her calm down a little bit. You can see that her expression had change and that she apologize for being terrifying you but she still made you understand that she is protective though. You had no problem with her feeling towards her daughters and that she leans down to lick your body to make feel more comfortable than being in fear.<br>\r\n<br>\r\n\"Okay dear, just hold on for a minute while I find my daughters, I believe they are close by. So I won't be that long. If you need to hide, you can until I called your name or hear us coming from the den. So anyway, be back in a minute.\" She says and with that, she gets up and walks out of the den to look for her daughters. Meanawhile you hide behind the rock just in case another wolf came in the same den.<br>\r\n<br>\r\nNot so long....</span></div></div>",
            "created":1509771600,
            "id":2410870,
            "title":"Meet my daughters "
        },
        "11132211131":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Booty bump ",
                "Snatch ",
                "Hide and seek "
            ],
            "content":"<div class=\"\"><div> <span>From your hiding spot you could hear multiple footsteps coming closer to eves den. Thump thump thump thump. Jacob you can come out now \" eve called out to you gulp you peeked your little head round the side of the rock, you swear your heart stopped for a second at the site of three gigantic wolves \" mom who are you talking to \" lily asked her mother with a raised eye ridge.<br>\r\n<br>\r\nOh sorry dear but it would be easier to just show you \" eve walked over to where you where hiding following your scent sniff sniff sniff you could feel the sucksion of eves sniffing she was just round the corner from your hiding spot. Oh come on out Jacob we're not gonna hurt you \" hearing the seriousness in eves voice you decided to come out and show yourself gasp Kate and Lilly both had shocked exspretions on there fuzzy faces. Wha what how the two sisters said in perfect sink they both started walking towards you with both curious and shocked faces, felling slightly intimidated by the advancing wolves you took a few steps back but stopped when you felt something cold and wet against your back, looking behind you saw eves beautiful eyes staring back at you with a caring look in them \" it's ok they won't hurt you I promise \" eves comforting words eased your fears a little you now stood in front oh both Kate and Lilly with eve standing over you \" well girls this is Jacob my boyfriend.\" <br>\r\n<br>\r\nTo say Kate and Lilly where shocked would be an understatement to how they looked now WHAT!!! They shouted not out of anger but surprise \" but how he's so tiny and a human at that \" Kate said to her moth \" yeah mum like how do you even you know \" Lilly said blushing at the thought of her mother and you, chuckle eve stepped closer to her daughters and whispered something to them causing them both to blush and giggle. <br>\r\n<br>\r\nWhat did she say to them you wondered \" umm hey eve \" eve looked down at you smiling yes dear, umm what exactly did you tell them \" you looked up at eve expecting hear to answer but to your surprise she just turned around presented hear butt and said grab the fur on the to underside of my tail she said. <br>\r\n<br>\r\nNot giving it a second thought you grabbed onto the fur of her tail not noticing your where not dangling in front of her anus. Now girls where gonna play some games so Jacob feels a little more comfortable around us \" they both cocked there heads in curiosity wondering what they mother had in mind. <br>\r\n<br>\r\nOk first let me exsplain the rules of some of the games we'll be playing. <br>\r\n<br>\r\nBooty bumping: you have to try and take him from me only using your butt. <br>\r\n<br>\r\nSnatch: you have to try and take him from me and keep me away for ten minutes. <br>\r\n<br>\r\nHide and seek: he'll hide and we go seek him. </span></div></div>",
            "created":1509771600,
            "id":2410935,
            "title":"Eve came with her two daughters"
        },
        "111322111311":{
            "author_id":"coolest",
            "author_name":"Coolguy",
            "choices":[
                "Eve",
                "Kate",
                "Lily"
            ],
            "content":"<div class=\"\"><div> <span>\"Well girls, we will be playing booty bumping!\" Eve said with a chuckle. Kate and Lily was shocked to hear that their mother saying playing booty bumpin with a tiny human that is holding her tail. \"I am not sure it is a great idea mom, I think we might crush him with our butts, don't you think?\" Kate said \"Yeah mom, aren't we going to hurt him?\" Lily followed up. \"I don't think you two understand what I am going to do. I am going to lifted my tail up while he is hanging on to my tail, once our butts are close enough each other,  I will move my tail back and forth that he will dropped down and landed between our butts together. Once he landed into our butts, you girls have to take him away from me for while and that you girls win the game. Sounds good?\" Eve said to them while you are still surprise she would play some games with their daughters that includes their booties. You wasn't sure you want to take part of this since you could still be easily crush or fall to the ground in pain.<br>\r\n<br>\r\n\"Well I guess it sounds to good to me mom, I mean if your really comfortable with your new boyfriend Jacob.\" Lily said in shy blushing voice. \"Yeah I guess we can play that game.\" Kate said. \"Well excellent girls, I am sure this will make you girls feel comfortable being around this tiny human. I am sure he will love this game. Right honey?\" She turns her head back to Jacob to see him still holding on her tail. You nod in response that you are comfortable playing with the girls even though you are still a little uncomfortable with them. You was sure you will be relaxed once they get cozy with you.<br>\r\n<br>\r\n\"Okay girls, lets play!\" Eve said and that she moves her tail up in the air so you can see kate and Lily looking up until Eve said butts in the air and close to her. They wasted no time and that their huge beautiful booties are in the air colliding with Eve's butt.. You had to admitted that you were excited to see three beautiful goddess going to play with you between those butt cheeks.<br>\r\n<br>\r\n\"Here we go!\" Eve commanded and that her tail started to move back and forth lightly while you still hang on tight. You were scared that you might dropped to your death if you missed landing onto a wolfess but you had to take a chance and so with the tail moving lightly, you let go screaming before you plopping down between the wolfess's ass. They were rocking between butt to butt and that you can smell the musk between their holes. You had to also admitted it was lovely but at the same time, you were rocking in the booty bumping back and forth. One minute you will be by Eve's tailhole and then the next you be by her daughter's tailhole. You wasn't sure where you are going to land but soon at the end, you landed on one of them and that she moved out of the way before you were taking again.<br>\r\n<br>\r\nWho was the winner?</span></div></div>",
            "created":1512210480,
            "id":2422921,
            "title":"Booty bump "
        },
        "1113221113112":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Have a little fun in Kate’s maw ",
                "Be sat on ",
                "Someone interrupts"
            ],
            "content":"<div class=\"\"><div> <span>Haha yes I win! Kate said cheerfully wiggling her butt that you where still hanging onto for dear life. Eve and Lilly where looking a little disappointed but they new Kate won fair and square. Well done sweetheart eve said to Kate trying to sound happy but couldn’t completely hide the jealousy in her voice, yeah good going Kate but what happens now Lilly’s said tilting her head to the side. <br>\r\n<br>\r\nEve rolled her eyes in thought not thinking this far ahead. Well Kate won the game so I guess it’s up to her eve said looking at her daughter who had a thoughtful look on her face. <br>\r\n<br>\r\nWell what can I have Kate questioned her mother. Eve wondered for a little bit before replying well you do what ever you want to do with my little Jacob but only as long as you don’t mistreat him understand young lady eve said seriously looking into her daughters eyes. <br>\r\n<br>\r\nOh of cause mom I wouldn’t dream of hurting him oh wait a sec hey are you still ok back there Jacob? Yeah I’m ok Kate you called back still hanging in front of Kate’s musky hole, but you still couldn’t help but get a boner even though you where her moms boyfriend it was still pretty hot. <br>\r\n<br>\r\nHey mom Lilly could you give us sometime alone Kate said. Oh of course dear but don’t be too rough with him eve said giving her daughter a sly smile walking out of the den Lilly was following close behind blushing very badly. <br>\r\n<br>\r\nWell now that where alone tell me Jacob what does mom like to do with you Kate said looking at her butt that you where still hanging onto. Well we haven’t really had the chance to get a...little more intimate with each other but from what I can tell she like my taste and loves sitting in me you said blushing furiously <br>\r\n<br>\r\nKate blushed a little at what you said but couldn’t help but giggle well how about you decide little man Kate said sexually. Wha...what do you mean Jacob said nervously. <br>\r\n<br>\r\nWell we could have a little fun with my mouth or you can have my big furry butt on you oh I wonder how you would feel under there your little body pressed under my sweaty tailhole completely at my mercy Kate said drooling with a lusty look on her making you more than a little nervous but at the same time very curious. <br>\r\n<br>\r\nThinking for a little bit you decided to. </span></div></div>",
            "created":1512311580,
            "id":2423423,
            "title":"Kate"
        },
        "11132211131123":{
            "author_id":"coolest",
            "author_name":"Coolguy",
            "choices":[
                "Into their maws",
                "Onto their paws",
                "Up into their tailhole/being seated"
            ],
            "content":"<div class=\"\"><div> <span>You were about to decided what you wanted to do with Kate until you hear booming steps from behind and that Kate looks who walks in the den to see it was her sister Lilly. She was shocked to see her coming through the door. \"What do you want Lilly? I was about to play with Jacob here.\" Kate had said. \"Yeah I am sorry about that and that our mom wanted me to come join in the fun with you since she thinks I should know the little guy more too as well.\" Lily said with her expression kind of sad and that Kate see that their mother had force her to come in and so Kate decided why not have her join the fun.<br>\r\n<br>\r\n\"Okay Lilly, you can stay here and we both can play with little Jacob here. I bet he will love what we are going to do to him.\" They giggle and give you the evil smirk on there face as if they are going to hurt him but deep down they wouldn't do that at all.You were a little nervous since you are looking at the two of them looming over you and licking their lips. \"Wait don't I get to choose what I want to go or do first?\" You said nervously to them and that their expression has change from smirking to curiosity. \"So tiny Jacob, what do you like to do first? I mean we can put you in our mouths, you can lay on our paws or lick them or you can be in our booties. Which are you going to take?</span></div></div>",
            "created":1516438020,
            "id":2442961,
            "title":"Lily Interupts"
        },
        "111322111311231":{
            "author_id":"coolest",
            "author_name":"Coolguy",
            "choices":[
                "Back in Kate's mouth",
                "Back to Kate but in her booty",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Well I think my first option is that I would love to be in your two maws. I believe it is good place to know what I taste like and also comfy place to relaxed too.\" You said to them and that they give you giggles. \"Okay Jacob as you wished and I will be going first to give you a tour.\" Kate said as she layed down close to your body on the ground and started to open her slimy mouth to show her teeth and tongue inviting you. You got to admitted it looks terrifying to see sharp fangs that could chew you up but you know she and Lily wouldn't do that at all. You were nervous to move until Lily booped you with her nose from behind to go forward towards Kate.\"Don't worry little guy, we won't eat you. Go on into my sister's mouth. I know you you'll like it there.\" She says in a cute voice as she looks down at you and smiling innocently to you. You looked back for a moment to see she gives you a warm heart and with a few steps forward into Kate's mouth. You could already felt her breath blowing you some wind as she breathes in and out from her mouth. <br>\r\n<br>\r\nIt smelt really horrible but you moved forward anyways, as you were on her tongue and going into her mouth. Once there, she closed her mouth slowly and lifted her body from the ground.You can feel her whole body was lifted in the elevator as she started to walk a little bit. Her mouth wasn't completely shut yet but you can tell in her view that everything was pretty in her den that made you felt small. You layed on Kate's tongue as the wind of her bad breath is overwhelming you but you didn't mind at all since you were going to get used to this sooner or later and that being small wasn't too bad you didn't think. <br>\r\n<br>\r\nAs you layed on her tongue, you begin to feel her tongue moving around your body upside down and side to side as she was getting your taste in her mouth. You started to panic when she was moving your body back at her throat and thought you be swallowed but she push you back forward with her down and that she started to relaxed with her tongue. \"mmmmmmmhmmmm...you taste pretty good for a human little guy.\" Kate said with her mouth close and still having her powerful bad breath knocking you down. You wanted to say thanks but couldn't as you were getting chocked in her mouth. So in a way to saying thank you to her, you rub your hand down to her tongue and she can feel in a way that you love being her. <br>\r\n<br>\r\nAs you were getting comfortable in her mouth a little bit, you see her open her mouth wide and that in your view you can see purple eye staring at you with such curiosity. \"Oh wow Kate, he looks so comfortable in your mouth and that I wanted to know what he taste like. Can I Kate? Can I have in him his mouth? I promised I won't swallowed or anything. I mean I know our Mom will killed us if we did. I know I can be gently please Kate.\" Lily said in her excited voice and that you couldn't help but laughed as she was acting like a little kid if she was a human or something. <br>\r\n<br>\r\nAs Kate thought for a while, she nodded her head and passed your body into her mouth. She did this with a french kissed to wolf to wolf as the tongue move to catch you to one side to another and with their breathe smelling like dead meat, You were tossed in between the wolf mouth for a while before you ended up in the white wolf mouth of Lily and that you had to say it was worse than Kate's mouth since her breath smelled really bad like there is meat had been sitting here months without removing or anything. You thought you were going to passed out for a moment but then her mouth open up a little bit and that you can see Kate looking inside to see if you are okay. You waved that you were okay with this before Lily closed her mouth and play with you a little bit. You can feel her tongue moving from side to side and up and down more often than Kate. You have to say that she was a little bit violent than Kate was and that she was trying to get all the taste for herself. She kept you going for this like 15 to 20 minutes before she stop and decided to do with you. \"mmmmmm....Oh wow you taste really great Jacob and that I would love to keep you in for a night in my mouth but I think it is time for you to go...\"</span></div></div>",
            "created":1516441560,
            "id":2442970,
            "title":"Into their maws"
        },
        "1113222":{
            "author_id":"coolest",
            "author_name":"Coolguy",
            "choices":[
                "To sleep with you while you were in her mouth or other.",
                "To meet her two beautiful daughters.",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>\"I am willing to keep you as a pet.\" She says and that you couldn't help but your heart shattered in pieces to hear her words saying that she will keep you as a pet. You thought she would help you out with your story, but then again she almost had crushed you with her anus and that arguing with a giantess wolf wouldn't be a smart idea right after she spare your life with your pleads.<br>\r\n<br>\r\nYou begin to tear a little bit but stay at your composure and nodded your head in agreement to her. \"Thanks Eve and I would love to be a pet to you. Thanks for sparing me and sorry about being inside your butt too. I should have dodge out of your way before sitting on me but I guess that's no excused though. So really sorry about that.\" You said to her and that you wanted her to be in her good side by just apologizing to her and that hoping at least she is a forgiving wolfess. Your answer came with her a big licks to your body and that she seems to accepted your apologized and such.<br>\r\n<br>\r\n\"Now that's a good little pet. Apologizing your actions is a good way to getting rewards though. I might just get your to normal life back but I don't think I want to since you humans do hunt us wolves sometimes and I can't let that to endanger my species and such. So being this tiny and keeping you as a pet seems like a good way for your new life. So anyway, I think it is time for us to go back to the den and you can possible meet my beautiful daughters too as well if they are home. So now my tiny pet, let's get going to your new home\". Eve said and with that, she open her mouth to you showing her teeth and tongue that was sticking out front of you and that her breathe came to you with a rush of air. Already you can smell her bad breath and that she wasted no time in catching up to you with her tongue leap out onto your body. You had a wet slime onto you and with a flip in the air, she catch you her mouth, closing it shut so you won't escape or anything.<br>\r\n<br>\r\nYou were in quite a ride as she move up with her paws and started walking to her den with you inside her mouth. You kind of gag the air you receiving. You were not only in one spot but you were moving around back and forth while her stomping paws walking the way she came.<br>\r\n<br>\r\nOnce she was in den, she decided to...</span></div></div>",
            "created":1508475600,
            "id":2403797,
            "title":"Keep you as a pet."
        },
        "113":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Hehehe close your eyes ",
                "Crawl in my vagina ",
                "Sits on you "
            ],
            "content":"<div class=\"\"><div> <span>(Sniff) (sniff) that scent its familiar eve thought. Following her nose eve looked between her front legs and but saw nothing however she could still smell your scent so she looked further down between her legs her head was nearly touching the ground now. <br>\r\n<br>\r\nAs eve looked at her back legs she saw your little body between her back legs her eyes nearly buldged out of her head at the site of a tiny human boy. <br>\r\n<br>\r\nWhat's he doing looking at my butt!! She screamed in her head, her cheeks where red as roses but her fur hid it. Well guess I'd better have a little talk with this pervert eve thought as she rose her head upright and turned around.<br>\r\n<br>\r\nBoom boom boom<br>\r\n<br>\r\nEve was now facing you with a pissed off look on her face, oh boy she's not happy you thought, I'd better try to tell her this isn't what she thinks or she might kill me. <br>\r\n<br>\r\nUmm hi there I know this looks bad but I can assure you this is not what you think you said loud and clear to the giant wolfess. <br>\r\n<br>\r\nOh is that so little man then why pray tell where you looking at my butt she said nastily showing her teeth. <br>\r\n<br>\r\nAs you explained to eve why you were between her legs she started to calm down as things started to make sense. <br>\r\n<br>\r\nOh dear I'm sorry I nearly squished you eve said with a sad face. <br>\r\n<br>\r\nHey don't worry about it no harm done I'm just glad you didn't sit down otherwise things probably wouldn't have ended well for me. <br>\r\n<br>\r\nHey!! Are you calling me fat she nearly shouted. <br>\r\n<br>\r\nNononono I just mean your butts pretty big but not in a bad way you quickly defended. <br>\r\n<br>\r\nOh so you like my butt hummm eve said seductively with a lustful look in her eyes. Well if you like it that much why don't we have a little fun she suggested. <br>\r\n<br>\r\nYour cheeks turned red at the suggestion but you weren't completely against it iether. Well um what do you have in mind you said nervously.</span></div></div>",
            "created":1501563600,
            "id":2362942,
            "title":" She smells your scent "
        },
        "12":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Squished ",
                "Stuck between her toes ",
                "Her paw stopped just in time",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You looked up at the gigantic wolfess with the most beautiful coloured fur you'd ever seen her lovely brown eyes her long thin graceful body her huge stomping paws that were coming right at you!!!!<br>\r\n<br>\r\nYou awake from your trance at the sound of her booming paws you looked up at her huge face as it got closer and closer to you. You looked up at her face and thought she was going to notice you but you were wrong as her face was replaced by the underside of her paw, you could clearly see  all the bits of mud and leaves that stuck to her paw. <br>\r\n<br>\r\nYou just stood there frozen with fear at the sight of her paw coming down on you. NOOOOOO!!!!!!</span></div></div>",
            "created":1501563600,
            "id":2362977,
            "title":"Kate "
        },
        "121":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "content":"<div class=\"\"><div> <span>You where forced to the ground by the immense weight of her paw your bones began to slowly break as she put more and more weight on you but then all of a sudden you felt the weight leave you but you were still stuck to her paw. Oh god no you muttered before you felt the weight on you again it went like this for awhile you suffering beneath Kate's paw and she blissfully unaware of the life she was slowly taking until she took her final step then you died nothing left but a little red stain on Kate's paw.</span></div></div>",
            "created":1501563600,
            "id":2362985,
            "title":"Squished "
        },
        "122":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "HELL YEAH ONWARD!!!!!",
                "Better not risk it",
                "Someone was coming into the den"
            ],
            "content":"<div class=\"\"><div> <span>Boooom the thundering sound of Kate's paw hitting the ground shook you to the core but you where surprised that you felt no weight on you but instead around you!<br>\r\n<br>\r\nBefore you could put two and two together you felt you feet leave the ground as Kate took a step with you trapped between her musky toes. Oh man what did I do to deserve this you screamed as she look another step.<br>\r\n<br>\r\n<br>\r\nKate was on her way back to her den for a little nap after a good days hunting she was unaware of her tiny passenger as she just kept walking to her den once she reached the entrance she went to her sleeping place and lied down. You awoke still trapped between Kate's toes damn it I must have passed out you thought (snor) (snore) wha you looked up at Kate's face and saw she was fast asleep (sigh) good now maybe I can get out of here you struggled at first but managed to get free of Kate's toes. <br>\r\n<br>\r\nOk now I gotta get out of here you said as you started to run to the exit but stopped when you saw Kate's tail lying on the ground motionless you continued to look up Kate's tail and saw her butt you started to get an erection at the site you slowly started to walk closer but stopped to think is it worth getting killed. <br>\r\n<br>\r\n</span></div></div>",
            "created":1501563600,
            "id":2362997,
            "title":"Stuck between her toes "
        },
        "1221":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Up the booty",
                "Cave diving ",
                "Something happened "
            ],
            "content":"<div class=\"\"><div> <span>You slowly walked towards her behind not wanting to wake her up you tried to be as quiet as you could, once you pushed past her tail that was blocking your way at first you where greeted by the sight of her pussy and tail hole you looked to the left and right trying to decide where you want to explore first. </span></div></div>",
            "created":1501563600,
            "id":2363003,
            "title":"HELL YEAH ONWARD!!!!!"
        },
        "12211":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Anus ",
                "Open mouth ",
                "Belly "
            ],
            "content":"<div class=\"\"><div> <span>You climbed up to Kate's pucker using her fur as rope (pant pant) good thing I used go rock climbing on a weekend or I don't think I'd last this long you thought as you climbed across her behind. You were just  below her vagina and realised you are gonna have to climb it to get to your destination \" oh boy here goes nothing \" you reached out for her lips trying to get a decent hold (gasp) Kate had kicked in her making you loose your grip falling to the ground ( aaaahhhhhhh) you screamed as you fell waiting for the huge impact that was soon to come.<br>\r\n<br>\r\nHuh all of a sudden you felt something soft on your back and then you felt weightless again \"what the hell\" you looked down and saw you where still in the air except this time you could see Kate's whole body, how's this possible you looked around trying to figure this out but then you realised that you where still in grave danger reaching out with your hand trying to grab anything that would save you from falling to your doom, you felt your fingers brush against something not caring what it is you gripped it and held on with all your strength. <br>\r\n<br>\r\n<br>\r\nOh god oh god you muttered gasping in relief that you where save by a little root that was hanging from the ceiling but your relief was short lived when you realised you where losing your grip \" nononono please\" you lost your grip and now you where falling again as you looked down you noticed that Kate was now laying on her back and you where heading straight for her. </span></div></div>",
            "created":1506834000,
            "id":2395068,
            "title":"Up the booty"
        },
        "122111":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Inside the den ",
                "Still inside Kate's butt ",
                "Somewhere else "
            ],
            "content":"<div class=\"\"><div> <span>Your felt the heat of Kate's tailhole press against the top of your head before you slid all the way inside he butt the sweat from he anus helped to slip you inside with little to no resistance at all. <br>\r\n<br>\r\n(Gasp) <br>\r\n<br>\r\nKate woke up feeling your squirming inside her ass \" moooooooaaaaaan \" Kate was getting really wet from your movements inside her butt. Inside Kate's ass you where struggling against the movements of her clenching colon the pressure and heat was becoming a bit too much for you \" shit.....fuck why do I always do stupid shit \" you kicked and beated against Kate's ring trying to get out. <br>\r\n<br>\r\nOutside Kate's was very very wet and with Humphrey out with his friends none could help her so she had to improvise' \" I can't take this anymore \" she bent her head down to her moistening lips and furiously licked at them trying to make herself cum faster. <br>\r\n<br>\r\nOooohhhhh \" Kate moaned at the feeling of her own tounge pressing against her love hole \" oh oh yes oh yeah \" Kate's was getting close to climax and at the same time she was unknowingly clenching her tailhole slightly crushing your little body. <br>\r\n<br>\r\n( aaaaahhhhhh) <br>\r\n<br>\r\nKate's screamed out as she came all over the floor and at the same times clenching her tsilhole almost turned you into mush. Aaaaahhh you screamed at the crushing force of Kate's colon the huge amount of pain you felt was almost unbearable \" oh a- ow you son of a-\" you passed out from exhaustion inside of kate. <br>\r\n<br>\r\nThe next morning you woke up. </span></div></div>",
            "created":1509426000,
            "id":2409285,
            "title":"Anus "
        },
        "122112":{
            "choices":[
                "Finds water and drinks it",
                "Coughs you out"
            ],
            "content":"<div class=\"\"><div> <span>Right when you began to fall, you notice that Kate is opening her mouth as if she is yawning. It was some unfortunate timing as you fell right into her open mouth and to the back of her throat. She coughed right when you landed and you were boosted back up to the back of her mouth desperately hanging on to one of her back teeth.<br>\r\n<br>\r\nYou could feel as if she was standing back up from her laying down position. All of a sudden, you hear a very loud noise from her throat that turned out to be words that nearly turned you deaf saying “FEELS LIKE SOMETHING IN MY THROAT”<br>\r\n<br>\r\nThat is when Kate...</span></div></div>",
            "created":1573791900,
            "id":2746961,
            "title":"Open mouth "
        },
        "12213":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "New friend",
                "Slave ",
                "Pet"
            ],
            "content":"<div class=\"\"><div> <span>Just as you were about to decide Kate let out a huge fart (pptttttttttpp) the blast knocked you off your feet and you went to the floor gagging eeeewww what has this girl being eating you wonder but you didn't have time to start thinking about Kate's diet as you where still in front of her butt the blast didn't knock you too far it seems. You started to stand up but stopped when you saw Kate's smelly butt hole getting closer, she's sitting up you screamed out loud as her anus pushed you back down. <br>\r\n<br>\r\n(Grumbling) oh my stomach Kate moan as she let out another fart on you, what the heck did I eat she moaned letting out an even bigger fart ewww that stinks I'm glad nobody else is in here she thought to herself but oh boy was she wrong. <br>\r\n<br>\r\nUnderneath Kate's butt you where struggling to breathe the foul smelling air coming out of the wolfs ass was suffocating you, if I don't do something I'm gonna die you thought looking at her huge pink pucker getting an idea this is ganna taste so bad you groaned. <br>\r\n<br>\r\n(Chomp) <br>\r\n<br>\r\nYELP<br>\r\n<br>\r\nKate jumped to her feet leaving you plastered to the ground disoriented, owowow she moaned rubbing her butt with her front paw what the heck was that she said to herself as she looked at where she was sitting tow seconds ago and was surprised at what she saw. A tiny human but what's he doing in here she thought but a smirk appeared on her face as she looked down at the panting human. <br>\r\n<br>\r\nWell it looks like I've get a. </span></div></div>",
            "created":1501563600,
            "id":2363015,
            "title":"Something happened "
        },
        "1222":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Garth ",
                "Humphrey ",
                "Lilly "
            ],
            "content":"<div class=\"\"><div> <span>You ran as fast as you could to the exit not bothering to check your surroundings as you neared the den entrance. (Pant pant). \" man that had to be the fastest I've ran in my life\" you said to yourself trying to catch your breathe once you recovered you looked around to see were you where \" oh my god\" all around there where wolf dens and each one looked inhabited. <br>\r\n<br>\r\n\" I am righteously fucked now \" as you looked around you didn't notice that there was a wolf walking right towards you each step it took shook the ground ( well to you at least) but you still didn't notice the rumble in the ground nor the paw that passed over your head (BOOOOOM) the impact from the wolfs paw hitting the ground knocked you off your feet you flew a few feet in the air only to come back down and roll away from the huge paw. <br>\r\n<br>\r\nYou rolled all the way down from the den stopping at the bottom (groan) you tried to pick yourself up but you couldn't so you just laid there trying to get your strength back not noticing how much danger your in for there was another wolf about to sit in the same spot you are laying. <br>\r\n<br>\r\nWho is it</span></div></div>",
            "created":1502773200,
            "id":2369674,
            "title":"Better not risk it"
        },
        "12223":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Lily climaxed ",
                "She farted ",
                "She stood up "
            ],
            "content":"<div class=\"\"><div> <span>You looked up at the huge white furry butt coming straight towards you \" crap \" (thump) Lilly fuzz rear came down on you full force knocking you out instantly. Lily was sitting down outside just enjoying the sight of the full moon unaware that she was sitting on someone, sigh lily lied down still looking at the moon with a sad look in her eyes. <br>\r\n<br>\r\nWhy can't Garth just spend more time with me \" Lilly thought to herself still not noticing the little man dangling from her tailhole by his one trapped leg. <br>\r\n<br>\r\nGroan you started to regain conscious from the boulder size ass that nearly squashed you \" ow ow were am I now \" you looked around and saw the ground at the bottom and noticed your foot trapped in the pink anus \" sigh why me \" you muttered trying to pull your legs free unknowingly causing lily pleasure. <br>\r\n<br>\r\nGasp lily blushed feeling something struggling against her butthole causing her lips to become wet. What's happening \" lily moaned bucking her behind against the ground grinding her sweaty tailhole all over you. <br>\r\n<br>\r\nOh fuck \" you screamed trying in vain to escape from the white wolfs grinding \" grrrrr come on you bitch \" you struggled with all your engergy it seemed to be in vain that is until. </span></div></div>",
            "created":1509426000,
            "id":2409362,
            "title":"Lilly "
        },
        "1223":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Eve ",
                "Winston ",
                "Lilly "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was coming into the den? </span></div></span></div>",
            "created":1512229380,
            "id":2423001,
            "title":"Someone was coming into the den"
        },
        "12233":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Paw ",
                "Butt ",
                "Mouth "
            ],
            "content":"<div class=\"\"><div> <span>Coming through the entrance was a pure white wolf with purple coloured eyes they where so beautiful you just couldn't look. While you were distracted by her eyes her paw came flying into you knocking you several feet away from her but you where still in her path. <br>\r\n<br>\r\nGasping for air from Lilly paw knocking the wind out of you, you tried to stand up and run away but you where too slow Lilly's paw came down on you trapping your legs. No no no you tried digging your fingernails into the dirt to pull yourself out from under her paw but you couldn't nave an inch. <br>\r\n<br>\r\nJust when things couldn't get any worse Lilly started to walk towards Kate putting more weight on the paw your legs where trapped under. Ow fuck no! You streamed at the immense weight of the giant wolf it felt like your legs where gonna brake any second now, fortunately Lilly lifted her paw of your legs before that could happen. <br>\r\n<br>\r\nWhew that was close. You started to crawl on the ground the weight may not have broken your legs but they hurt too much to use at the moment. While you where trying to get away you failed to notice the incoming. </span></div></div>",
            "created":1512237900,
            "id":2423072,
            "title":"Lilly "
        },
        "122331":{
            "choices":[
                "She noticed something under Lilly’s hind paw [you]",
                "She noticed a flower on Lilly’s ear"
            ],
            "content":"<div class=\"\"><div> <span>Even though you may have escaped from your legs being broken from Lilly’s paw, you forget that she has hind paws as well. You don’t notice them until one of those paws came down on you again trapping your entire body except your head.. Thinking as soon as she puts her weight on you again, that it may be the end for you, the paw suddenly stops on its position. Looking at the small view you have, you notice that Lilly seems like she is sitting. If that is the case, you may be in this spot for quite a while. You could still feel the massive weight of her paw on your body but it was bearable and just enough for you to still breathe. Though you may not be able to move, you are slightly relieved that you are still alive despite this interesting encounter with these wolves. While you were deep in your thoughts, you didn’t notice that Lilly and Kate were having some conversation. You then suddenly hear Kate say the words “Hey Lilly, what is that?” You pause as you were a bit scared to find out what she was talking about.</span></div></div>",
            "created":1573781880,
            "id":2746909,
            "title":"Paw "
        },
        "124":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "You dodged just in time ",
                "Other ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok how about some other options. </span></div></span></div>",
            "created":1519756500,
            "id":2458425,
            "title":"Other"
        },
        "14":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Tony looking right at you ",
                "Tony still looking for you ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>oh crap I can't let him see me there's no telling what he'd do to me you said a little louder than you ment. Tony left ear twitches at the sound of your voice his head slowly turned in the direction he heard your voice he looked left and right but was confused when he didn't see anyone. <br>\r\n<br>\r\nHello who's there he growled. Oh shot I need to get out of here you thought you slowly started to walk backwards until (snap) your body froze at the sound of the noise you slowly looked down and to your horror you'd stepped on a twig, and then you realised that tony might have heard it you looked up and saw.</span></div></div>",
            "created":1499403600,
            "id":2349304,
            "title":"Tony"
        },
        "141":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Eat you ",
                "Crush you ",
                "Sit on you "
            ],
            "content":"<div class=\"\"><div> <span>Not wasting anytime you took off running back the way you came you when just a few feet away from the bush you where nearly there until you felt something crag your shirt and lift you in the air. Aaaaaahhhh you screamed as tony lifted you off the ground he through you a couple a feet behind him and slowly walked towards you, what are you doing on my territory tiny human (snarl) <br>\r\n<br>\r\nUm i don't know I just woke up he this small aaand I was just trying to find help you said crawling backwards as he got closer and closer, oh is that so well how unfortunate that your not gonna get any help from me because I'm gonna. </span></div></div>",
            "created":1499403600,
            "id":2349314,
            "title":"Tony looking right at you "
        },
        "1411":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Tony swallowed you ",
                "He spat you out ",
                "You managed to grab one of his back teeth "
            ],
            "content":"<div class=\"\"><div> <span>No wait please don't I'm begging you!! But tony just ignored your pleese and slowly bent his head down and opened his mouth right above you.<br>\r\n<br>\r\nYou could see Tony's jaws getting closer to you I need to move quick you thought, you tried to push your body of the floor but you where still week from tony throwing you. <br>\r\n<br>\r\nI'm not dying here you said pushing yourself off the ground but it was too late Tony's jaws where around you before you could run, tony now had half of you in his mouth your legs where still hanging out kicking in the air. <br>\r\n<br>\r\nNononono please let me out!!! <br>\r\n<br>\r\nTony just ignored you and sucked the rest of you in murrrrr you don't taste half bad he thought. <br>\r\n<br>\r\nInside Tony's mouth you where gagging at the stench of his breath oh god it smells so bad in here you shouted that old bastard I hope yo- shit you said dodgeing tony teeth not realising you where standing on them. <br>\r\n<br>\r\nWhoa that was a close one but you relief was short lived when you fell Tony's tounge rising. <br>\r\n<br>\r\nHe's going to swallow me alive!!!!<br>\r\n<br>\r\nYou slid down his tongue heading straight for the that dark abys that was the the back of his throat, this is it you thought with tears in your eyes does. </span></div></div>",
            "created":1499403600,
            "id":2349333,
            "title":"Eat you "
        },
        "14111":{
            "content":"<div class=\"\"><div> <span>Tony takes one gulp sending you toward his gut. You then hear a big burp which took away a lot of the air in the stomach you were in making it quite difficult to breathe. The acids in the stomach burned a bit but luckily it was only up to your ankles... than is until it felt like the small room you were in was flipping upside down. It seems that Tony was now laying on his back and enjoying its recent meal. The acid that was only up to your ankles was now all over you and began to fill up. Fortunately due to the smell and the lack of air made you pass out so you won’t have to experience the rest of the painful process. While Tony gets back up and to his den to sleep after his delicious meal.</span></div></div>",
            "created":1573793820,
            "id":2746965,
            "title":"Tony swallowed you "
        },
        "1413":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Stuffed up his butthole ",
                "Trapped beneath his balls "
            ],
            "content":"<div class=\"\"><div> <span>Tony said turning round preparing to sit on you well goodbye little human he said with a smile on his face as he started to sit. <br>\r\n<br>\r\nYou looked up at Tony huge ass coming right towards you thinking one thing RUN!!!<br>\r\n<br>\r\nYou tried to dodge the incoming ass of the old wolf but ended up getting. </span></div></div>",
            "created":1499403600,
            "id":2349339,
            "title":"Sit on you "
        },
        "14131":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Accept ",
                "Refuse "
            ],
            "content":"<div class=\"\"><div> <span>You felt the flesh of Tony's anus crashing down on you went head first up his tail hole you couldn't see a thing but you where surprised that it was actually not as tight as you thought it would be you could move around on your hands and nears with no trouble at all but the smell was unbearable. <br>\r\n<br>\r\nEeeeewww why do I have to have such bad luck you said covering your nose, well at least I'm alive now I've just gotta get out of this old bastards ass but first you needed to figure out which way to go because you couldn't see a damn thing, oh wait I've still got my flashlight you thought pulling it out of your back pocket. <br>\r\n<br>\r\nOutside <br>\r\n<br>\r\nOooooooohhh darn he feels good in there Tony thought humm I guess he might be off some use to me hey!! Human can you hear me!!!!!! You heard Tony calling you what do you want now you said angrily, I'll make you a deal if you can make me cum from in there then I might let you go....... are you fucking kidding me first you throw me through the air then stuff me up your butt now you want me to give you a rimjob!!!!<br>\r\n<br>\r\nHey it's your choice stay in there if you like Tony said shaking his ass smirking, inside Tony you bouncing of the walls of his ass and getting deeper and deeper into his colon. <br>\r\n<br>\r\nTony could feel you getting further and further away from his pucker soon he'll be at the point of no return Tony said smiling, come on kid it's either you help me or you die in there he said. <br>\r\n<br>\r\nYou gritted your teeth knowing if you wonna survive this your gonna have to do it but you really don't want to. <br>\r\n<br>\r\n</span></div></div>",
            "created":1499403600,
            "id":2349395,
            "title":"Stuffed up his butthole "
        },
        "141311":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Yes ",
                "No",
                "Maybe "
            ],
            "content":"<div class=\"\"><div> <span>Ok fine you win!!! You started rubbing and kicking against the fleshy walls surrounding you. Tony just smiled and moaned in pleasure your squirming made him get an erection his big canine dick throbbed “oh yeah keep it up in there” Tony moaned he could feel the sperm building up in his balls. <br>\r\n<br>\r\nHearing Tony’s moaning gave you hope if you keep this up he’ll get what he wants and I’ll get out of here. Crawling towards Tony’s sealed butthole you began to beat on it making Tony moan even louder. <br>\r\n<br>\r\nTony humped the air he could feel it he’s gonna- aaarrrrr Tony screamed in pleasure his cum make a big white puddle on the ground. Wow it’s being awhile” he muttered a little disappointed that it ended so soon but a smile grew on his face when he got an evil idea. <br>\r\n<br>\r\nBending down Tony pushed you out of his ass grunting a little. You felt Tony’s bowels clench you thought he was gonna crush you but relaxed when you saw his anus opening “he’s finally letting me out” you fell out of Tony’s open tailhole and landed on the ground with a thud. <br>\r\n<br>\r\nGroaning you stood up facing the wolf’s looming ass but to your relief he turned round to face you. So we good? You asked him. Tony smiled and said. <br>\r\n</span></div></div>",
            "created":1512666000,
            "id":2425107,
            "title":"Accept "
        },
        "14132":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "The next morning ",
                "You died in there ",
                "Tony got you back out "
            ],
            "content":"<div class=\"\"><div> <span>Luckily only your legs got trapped however the amount of weight was unreal it felt light someone was slowly crushing your legs in a vice “get get off me you old bastard! You screamed at him but Tony just ignored you but didn’t ignore the feeling he was getting from having you trapped under his balls. <br>\r\n<br>\r\nHumm I wonder”Tony muttered as he got into a humping position but he kept his waist low enough to keep you pinned. Groaning he began to slowly move his hips up and down like he was mating with another wolf. <br>\r\n<br>\r\nThe rocking of Tony’s bolder size balls was causing you extreme pain it’s felt like your legs where gonna brake!! Please....stop.....stop it yo- your gonna (snap) aaaaassrrrrrrrrrrrrrrr. <br>\r\n<br>\r\nYou screamed as both your legs broke from Tony’s humps you cried in pain Tony had now stopped humping and lifted his balls off of you and started to back up a little. <br>\r\n<br>\r\nCrying from the pain you started to try and crawl away praying that the wolf would leave you alone you got a few feet and stopped when you smelled something musky looking behind you, you felt your heart stop. <br>\r\n<br>\r\nThere just a few feet behind you was some kinda monster it was a big red worm like creature except it was much thicker and it looked like it had viens? And that was a big black hole on the head. <br>\r\n<br>\r\nYou nearly screamed but stopped when you heard a grunt above you, looking up you saw white and brown fur “oh my god that not a monster it’s his erect dick” you started to crawl away trying to get as far away as you could. <br>\r\n<br>\r\nSeeing this Tony began to follow his dick lightly scraping against the ground gaining on you fast. The tip of Tony’s penis was pressing against your feet feeling it Tony humped a little causing your legs to get stuck inside his pee hole. <br>\r\n<br>\r\nYour screamed when you felt your legs get stuck inside Tony’s throbbing dick you could feel it pulling you into the giant pillar of flesh. Nononono the penis slurped you up to your waist it was like a scene from a monster movie. <br>\r\n<br>\r\nThe giant pulsing cock slowly started to swallow you. You thrashed screamed and begged but Tony didn’t care he just watch with an emotionless expression. With one final tug you where sent down into Tony’s empty balls. </span></div></div>",
            "created":1512668040,
            "id":2425112,
            "title":"Trapped beneath his balls "
        },
        "142":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "You walk towards Tony ",
                "You walk away it's too risky ",
                "Another wolf walks round the corner "
            ],
            "content":"<div class=\"\"><div> <span>(Sigh) Tony didn't hear you he was still looking in the wrong direction and moving away from you, well guess I better get moving before he sees me you moved as quietly and carefully as you could so he didn't notice you. <br>\r\n<br>\r\nAs you moved away from Tony you looked behind you to see if he was still looking for you but you were surprised to see that Tony was not looking at you instead at the ground with a sad look on his face you stopped trying to sneak away once you saw that the old wolf was upset about something. Poor guy maybe I should go and ask him what's wrong, then again what if he attacks me I'll be doomed but if he doesn't and I manage to cheer him up a little he might help me. </span></div></div>",
            "created":1501650000,
            "id":2363487,
            "title":"Tony still looking for you "
        },
        "1421":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Balls ",
                "Tail hole",
                "Between both"
            ],
            "content":"<div class=\"\"><div> <span>You walked towards the giant wolf as slowly as you could even though you wanted to make him happy you were still very afraid he could swallow you whole with ease, as you got closer you noticed he had tears running down his furry face awww poor guy you thought. You where now right beside Tony he still hadn't noticed you yet, um hello sir. <br>\r\n<br>\r\nYELP!!! <br>\r\n<br>\r\nTony jumped fright not realising he wasn't alone he looked down and his jaw dropped you could see his giant yellowish fangs you shuddered at the sight but did your best to ignore it. Hello there I just wanted to see if you were ok I noticed you crying and I thought I'd see what was the matter you said up to the wolf who's jaw was still hanging. <br>\r\n<br>\r\nTony came out of his shock five seconds after you spoke he now had a confused look on his face he head was cutely tilted to the side as he stared at you, you a tiny human came up to me a wolf to see why I was upset he said looking down at you. <br>\r\n<br>\r\nErrrrr yes sir <br>\r\n<br>\r\nHummm why would I tell you<br>\r\n<br>\r\nWell if you don't want to you don't have to I just thought you could use the company but if you don't want to talk then I'll leave you said turning around (stomp) you jumped back at the sight of a red furry paw in front of you looking up you saw Tony's face. <br>\r\n<br>\r\nWait sorry I didn't mean it like that I'm just.... (sigh) it's the day I lost my mate so that's why I'm a little upset he said looking down at you, you don't have to leave I could use the company I'm sorry I snapped at you he said moving his paw from your path. <br>\r\n<br>\r\nSo what's your name big guy you said smiling up at the wolf (chuckle) my names Tony pup and what's yours he said looking down at you smiling, my names Jason it's very nice to meet you Tony. <br>\r\n<br>\r\nYou and Tony talked for hours about your past lives you told some funny stories and he told you some of his the sun was starting to set it'll be dark soon. <br>\r\n<br>\r\nYawwwn it's getting late Jason I should probably get back to my den your welcome to come if you like Tony said hopefully. You thought for a few seconds thinking if you should humm well I don't have anywhere else to go so yeah I'll come Jason said to Tony, great follow me he said walking away from you you ran after him trying to keep up with his mighty steps. <br>\r\n<br>\r\nTen minutes later <br>\r\n<br>\r\nYou both arrived at Tony's den you where exhausted from all the running you couldn't wait to lay down and rest you looked up at Tony about to ask him a question but stopped when you saw you were still behind him his two hind legs where at either side of you (gulp) you looked up and saw Tony's balls just hanging there I hope he doesn't sit down you thought still staring at his huge orbs. <br>\r\n<br>\r\nHey Jason Tony said from upfront your head bolted to the direction of his voice not wanting to seem like a weirdo you ran to the front of him so he could see you but instead of running around the side of him you ran right underneath him without realising it. Once you reached the front of Tony's legs you looked up at the old wolf he had an amused look on his face what were you doing back there he said smiling, you could feel your cheeks getting red looking away you muttered nothing Tony didn't look convinced but let it slide for now. <br>\r\n<br>\r\nWell come on then let's go sleep he said walking over you you couldn't help but look up at Tony's passing sheeth and balls above his furry package just looked so- enjoying the view, you froze at the sound of Tony's voice your eyes followed along Tony's belly all the way to his chest where his head was dangling between his front legs staring at you smiling. <br>\r\n<br>\r\nIf you want a closer look I'd be happy to show you my legs are getting kinda tired he said as his back legs began to fold you looked up at his balls and anus getting closer and closer, oh boy you muttered as Tony's behind came down on you trapping you under his. </span></div></div>",
            "created":1501650000,
            "id":2363506,
            "title":"You walk towards Tony "
        },
        "14212":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "The root was breaking!! ",
                "Tony climaxed ",
                "Tony suddenly got up"
            ],
            "content":"<div class=\"\"><div> <span>Tony wiggles his butt loving the feeling you where giving him every struggle sent  a wave of pleasure up the old wolf’s spine. Moaning in ecstasy Tony’s dick started to emerge from his sheath the ginormous pillar of canine meat throbbed with every struggle. <br>\r\n<br>\r\nUnder Tony’s butt things weren’t so fun for you his anus was too smelly but the sweat from the giant ring of flesh was acting as a kinda lube if it weren’t for the little foot you were hanging onto you’d probably be in his butt by now. <br>\r\n<br>\r\nNot that would be a bad thing it’s just that the wolf doesn’t seem to realise how dangerous this is for you so you thought it best to just hang onto the root and struggle as best you can to try and get Tony to cum before his hungry tailhole eats you up. <br>\r\n<br>\r\nWhilst Tony’s was grinding his butt into the ground something started to happen. What? </span></div></div>",
            "created":1512663120,
            "id":2425098,
            "title":"Tail hole"
        },
        "142121":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "You were still up inside Tony's ass!",
                "Tony was licking under his tail, trying to get you out",
                "You feel Tony pushing you out somehow..."
            ],
            "content":"<div class=\"\"><div> <span>You hear a faint snap and that was when you realized the root you were clinging to has broken...this is not good!<br>\r\n<br>\r\nYou try to shout out to Tony, but his smelly rear sucks you in easily and fully.<br>\r\n<br>\r\nJust as Tony felt something get sucked into his rear, he lets out a deep howl as he covers the walls in his jizz. While he is panting, he looks back to see if his little buddy is still back there, but then realizes something...<br>\r\n<br>\r\n\"Huh, where did he go? I guess that was him that slipped up my ass.\"<br>\r\n<br>\r\nThe old wolf stretches out, tightening his rear up a little as he does so. He then goes into his corner and starts to curl up.<br>\r\n\"Night Jason, see you in the morning...\"<br>\r\n<br>\r\nDeep inside of the old wolf's rear, the tried to push against the walls, but they are so slick and slimy that you have a hard time getting a group. Some time after the wolf falls asleep, he let's out a gentle fart, causing you to gag in his bowels.<br>\r\nYou try to keep yourself from puking, but after a while the fumes were starting to make you feel relaxed in Tony's rear.<br>\r\nJust as Tony let's out another fart, you slip into slumber yourself, deep in the old wolf's butt...<br>\r\n<br>\r\nIn the morning...</span></div></div>",
            "created":1519779900,
            "id":2458590,
            "title":"The root was breaking!"
        },
        "15":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "Winston ",
                "Humphrey ",
                "Garth",
                "Hutch ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's some other choices </span></div></span></div>",
            "created":1499403600,
            "id":2349381,
            "title":"Other"
        },
        "155":{
            "author_id":"redeyes98",
            "author_name":"Dav",
            "choices":[
                "King ",
                "Princess ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your choice </span></div></span></div>",
            "created":1505538000,
            "id":2386735,
            "title":"Other"
        },
        "1553":{
            "author_id":"kaijufanforeve",
            "author_name":"KaijuFanForever",
            "choices":[
                "Stinky",
                "Runt",
                "Claudette"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about the puppers?</span></div></span></div>",
            "created":1580176140,
            "id":2779387,
            "title":"Other "
        }
    },
    "info":{
        "author_id":"redeyes98",
        "author_name":"Dav",
        "brief_description":"You are shrunk in alpha and omega can you survive?.",
        "created":1498170960,
        "description":"<td align=\"left\" class=\"norm\">You wake up somewhere in jasper park and yourve shrunk how small are you?</td>",
        "id":2125965,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1580176140,
        "modified":1580176140,
        "pretty_title":"Shrunk in Alpha and Omega"
    }
}