{
    "chapters":{
        "1":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Woke up outside the house...shrunken",
                "Inside the house...shrunken"
            ],
            "content":"<div class=\"\"><div> <span>It's three in the afternoon and Jenny is about to come home from her job.  You decide to head over to her place to talk with her.  You step outside of your house and begin your quick walk next door.  Today is the day you decide to ask her out on a date.  You have been planing this for a couple of weeks now and worked up the courage to ask her out.  Nothing is going to stop you now.  You walk up her walkway and reach under the doormat to find the spare key.  You remember the day she told you about the key and how you were welcomed into her home anytime.  Smiling you begin to unlock the door when all of a sudden you black out.  Waking up, your head is dizzy like waking up from a long night of drinking and realize you are...</span></div></div>",
            "created":1339563600,
            "id":1358685,
            "title":"Its going to be a great day!"
        },
        "11":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Shrink",
                "Stay the same size"
            ],
            "content":"<div class=\"\"><div> <span>You awoke with light shining down on you and the sound of birds chirping.  You sat up and felt a warm breeze pass over you.  You open your eyes to get the biggest shock of your life.  You were staring up at a gigantic door.  You stood up and turned around to see your environment.  It wasn’t just the door it was everything: trees, grass, the house, and even the animals.  You were small.<br>\r\n<br>\r\nYou didn’t know what happened so you ran the events through your head… you were big before you came to Jenny’s house now.  You touched the door handle and … that had to be it.  You found out the cause now you need to find a way to fix it.  An idea barely formed in your head before you heard a car pull up to into the drive way; Jenny.<br>\r\n<br>\r\nJenny just got out of her car and your heart started to beat faster.  She looked stunning even at your size.  She looked tired and her hair was a little messy from a hard day’s work, but her beauty still shone through it all. Jenny walked up the steps and put the key into the lock to unlock the door.<br>\r\n<br>\r\n“No Jenny don’t you’ll-”<br>\r\n</span></div></div>",
            "created":1343717220,
            "id":1394145,
            "title":"A big world"
        },
        "111":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Go into the lawn ",
                "Find a way inside"
            ],
            "content":"<div class=\"\"><div> <span>Jenny suddenly was big then she became the same size as you.  <br>\r\n<br>\r\n“Jenny!”  You shout as you ran over to pick up the unconscious women.  <br>\r\n<br>\r\n“Come on wake up.  Please be ok…” you kept saying when you heard a mummer coming from her.<br>\r\n<br>\r\n“Mark?  What happened?”<br>\r\n<br>\r\n“Oh thank God you’re ok.  Listen this may sound crazy but-”<br>\r\n<br>\r\nHer eyes got huge as she looked at the size of her house, “Oh…. My…. God.”<br>\r\n<br>\r\n“We shrank.” You finished as she looked all around.<br>\r\n<br>\r\n“How did this happen?”<br>\r\n<br>\r\n“Beats me last thing I remembered I touched the doorknob and…”<br>\r\n<br>\r\n“Same thing,” she said.  “You think it was a chemical.”<br>\r\n<br>\r\nYou shook your head no, “I don’t think so,  All I know is we should either find some shelter in the yard or find a way inside.”<br>\r\n<br>\r\n</span></div></div>",
            "created":1345579740,
            "id":1409758,
            "title":"At least you got a friend"
        },
        "1112":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Jack",
                "Christane"
            ],
            "content":"<div class=\"\"><div> <span>“If we find a way inside we can get help,” Said Jenny.<br>\r\n<br>\r\nEasier said than done; the door obviously couldn’t be opened by pushing, and there were no cracks to get in through.  Hoping someone might open the door you two sat there waiting for hours.  Eventually it was about to get dark.  <br>\r\n<br>\r\n“Well we can either wait or we can find shelter in the lawn,” you say standing up.<br>\r\n<br>\r\nLetting out a sigh, “Alright let’s try the lawn…”<br>\r\n<br>\r\nJust than the door opened to show Jenny’s 15 year old daughter opening the door.<br>\r\n<br>\r\n“That’s weird her cars here but… she must be over at Mark’s house.”  She left the door open a little as she peered over to your house.<br>\r\n<br>\r\nNot waiting for the opportunity to disappear you grabbed Jenny’s hand and dashed for the door.  You just made it as the door closed and sealed you two inside Jenny’s home.  You didn’t have time to get Christiane’s attention as she walked off away from the door.<br>\r\n<br>\r\n“Ok Jack I’m going to order pizza,” she shouted.<br>\r\n<br>\r\nThere was a distance thundering sound as a toddler ran into the room and shouted, “PIZZA!!!”<br>\r\n<br>\r\n“Yeah, Yeah just hold your horses…”  Christiane went into the kitchen to order pizza.<br>\r\n<br>\r\nYou and Jenny stood there debating what to do.  You said try and get Christiane’s attention because you trusted her more than Jack.  Whereas Jack was still a kid and might not understand the situation.  Jenny said he would understand her, because she was her mom.  You both decided…<br>\r\n<br>\r\n</span></div></div>",
            "created":1345596060,
            "id":1409985,
            "title":"Thats a big house"
        },
        "11121":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "\"Cool new bugs to play with\"",
                "\"Yay Snacks!!\""
            ],
            "content":"<div class=\"\"><div> <span>“Well Jack is closer than Christiane,” you finally gave in.  “I just hope he notices us and not steps on us.”<br>\r\n<br>\r\nJenny hit your shoulder playfully.  “Come on stop being so negative.”  This time she grabbed your hand and led you toward her son.  It was a long distance to walk but the eventually got to Jack.  He was sitting down on the carpet playing with some action figures.  He had a slight bored expression on his face as he moved the toys around making sound effect.  You and Jenny reached him and she shouted, “Jacky, Jacky!!! Look down here babe!!!”  Slowly his head turned toward you two.<br>\r\n<br>\r\nJack was bored and hungry as he played action figures.  He just heard his belly rumble and beg for food.  He hoped the pizzas came soon.  What he really needed was a snack.  There was a noise down by is right foot and he peered over and saw two small bug like figures standing there.  A smile crept over his face.  He reached out his hand and picked both of them up.<br>\r\n<br>\r\nYou didn’t like the look he gave you two.  You tried to tell Jenny but she said he was just glad to see them.  The giant hand reached out and grabbed both of you and brought you up to his face when he said…<br>\r\n</span></div></div>",
            "created":1345596780,
            "id":1410000,
            "title":"Jack"
        },
        "111211":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Dinner time",
                "Flat out of luck"
            ],
            "content":"<div class=\"\"><div> <span>“Just what I was looking for, new toys,” Jack said as he closed his hand into a fist.<br>\r\n<br>\r\nIt silenced both of you off before you could protest.  Jack then stood up and picked up his action figures in his other hand and went to his room.  He was going to play with his new toys to take the thought of hunger off his mind.<br>\r\n<br>\r\nWhen his hand opened up you say Jack placed you down on his bed.  He took a step back and had a grin on his face.<br>\r\n<br>\r\n“Now what to play,” he asked.<br>\r\n<br>\r\n“Jack you have to get us to Christiane.”  Both of you started to shout, but either he didn’t hear you or didn’t care.  <br>\r\n<br>\r\n“Oh I know, we can play tag!”<br>\r\n<br>\r\nJenny looked at you and asked, “Tag?” <br>\r\n<br>\r\nJack picked you up and Jenny up and placed you down on the ground.  He started to explain the rules, “I’ll be it and count to 10 and then I’m going to chase you two and try to tag you.  Sounds fun right?  Ok 1…2…3…”<br>\r\n<br>\r\nYou and Jenny ran to find somewhere to hide but there was nothing to hide under.  You both saw a dresser across the room and ran like your life depended on it.  You barely got half way when Jack shouted, “Ready or Not!!!”  <br>\r\n<br>\r\nJack slammed his foot down and then started to walk ever so slowly slamming his feet down.  Each slam made your body shake from the impact.  Jack was catching up fast.  But you and Jenny almost made it to the dresser when a foot slammed down in front of you two.<br>\r\n<br>\r\nYou heard Jack giggle at you, “Ahhhh so close.  Now time to be TAGGED!”<br>\r\n</span></div></div>",
            "created":1345654320,
            "id":1410477,
            "title":"A friendly game of tag"
        },
        "1112111":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Success",
                "Too far"
            ],
            "content":"<div class=\"\"><div> <span>\"Dinner!\" Christian said, just as Jack's foot was lifting up and hovering over you and Jenny.<br>\r\n<br>\r\n\"Dinner?  Dinner!\"  Jack shouted.  Placing his foot on the ground Jack bent over and picked up both you and Jenny and brought you to his face as he smiled at you two.  \"We're having dinner now.  We can play later.  Now it's time to go eat some pizza!\"<br>\r\n<br>\r\nYou and Jenny were still trying to protest his actions and tell him who you were, but he quickly slipped you two into his pocket.  You didn't know what was going on as he ran to the kitchen for dinner.  There was some movement then he was placed down on a chair.<br>\r\n<br>\r\n\"OK, Jack.  Here is your pizza slice,\" Christian said which Jack let out a gleeful laugh.<br>\r\n<br>\r\n\"Oh I forgot to get cups...\" Christian said as you heard a chair begin pulled out.<br>\r\n<br>\r\nNext thing you knew there was some movement and you and Jenny were quickly pulled out of your dark prison and held in the palm of Jack's hand.  You and Jenny stayed close and held each other as he peered down at you.  \"Are you guys hungry?\"<br>\r\n<br>\r\n\"Y-yeah,\" you said.<br>\r\n<br>\r\nJack didn't show any indication of hearing you as he said, \"I'm really hungry, but my pizza is missing something.  What does it need... oh i know it needs some toppings like... BUGS!\"  <br>\r\n<br>\r\nYou and Jenny only had time to let out a shout as he flipped his hand over and let you two drop through the air and land on his slice of pizza.  You landed with a greasy splat and looked up at Jack who was grinning down at you.  The moment you were about to shout for help, Christian returned with two cups.<br>\r\n<br>\r\n\"OK, here you go Jack.  Now we can eat.\"<br>\r\n<br>\r\n\"No Jack it's mommy!  Don't eat us!\"<br>\r\n<br>\r\nAgain if Jack could hear you he didn't show any sign of it as he picked up his slice of pizza and gave it a big grin and folded the pizza in half trapping you and Jenny in two walls of gooey cheese.  The folded pizza was brought up to Jack's lips as he opened his mouth and let out an \"Ahhhh,\" noise as he slipped part of the pizza into his mouth.  You and Jenny were trapped as Jack took a huge bite out of the slice of pizza.  As Jack pulled away from the slice of pizza his mouth made smacking noises as he noisily ate his pizza.  After Jack was done chewing he let out a \"Mmmm,\" sound as he came back for another bite.  You and Jenny couldn't do much but shiver in anticipation of when your next.  Jack bite into the pizza and pulled away again with a huge chunk of the pizza.  You had your eyes close, and opened them when you realized you were still alive.  Quickly you looked through the gap and found that you were at the edge of the next bite.  <br>\r\n<br>\r\n\"Jenny, we need to jump.\"<br>\r\n<br>\r\n\"But Mark... the drop will kill us,\" she answered with fear in her voice.<br>\r\n<br>\r\n\"Not if we time it right we can jump onto Jack's shirt.\"<br>\r\n<br>\r\n\"Mark I don't-\"<br>\r\n<br>\r\nBefore she could finish Jack came in for another bite, it was now or never as you grabbed Jenny's hand and got ready to leap...<br>\r\n</span></div></div>",
            "created":1352701620,
            "id":1466145,
            "title":"Saved by the Dinner Bell?"
        },
        "1112112":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "content":"<div class=\"\"><div> <span>Jack slowly pressed down with his other foot on top of Jenny next to you.  There was shouting as you and Jenny tried to get Jack to listen but he showed no sign of caring.  You tried punching, kicking, and biting the foot but the only results was Jack laughing at your efforts and what he was about to do.<br>\r\n<br>\r\nThen you heard a scream from under the foot and some snapping; then an audio pop.  Your blood ran cold as you realized what happened to Jenny.  You let out a cry that sounded in human at the lost to the woman you loved so much.  As the foot ascended you saw all that was left was a small puddle of blood.  <br>\r\n<br>\r\n“Now it’s your turn.”<br>\r\n<br>\r\nYou didn’t try to run because there was nowhere to go.  Not to mention you just lost the only thing you ever loved.  The foot came down and pressed on you until you were pinned under its weight.  It was enough to prevent movement but not enough to hurt.  Then his foot started to twist and press down ever so slightly.  You let out a cry as you felt your body being rubbed out of existence.  Your back was on fire as it was being grounded into nothing.  Your entire body hurt when you heard bones breaking and then nothing.<br>\r\n<br>\r\nJack let out a giggle as he twisted his foot over the bug.  He always loved doing this.  Then his stomach growled in hunger.  “Awww, now I’m hungry and have no toys to play with.  What am I going to do?”<br>\r\n<br>\r\nTHE HORROR!!!<br>\r\n</span></div></div>",
            "created":1345654980,
            "id":1410482,
            "title":"Pressure"
        },
        "111212":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "content":"<div class=\"\"><div> <span>“Just what I was looking for, a snack,” he said as he licked his lips with his tongue.<br>\r\n<br>\r\n“No Jack it’s me, your mom, and Mark!”  Jenny pleaded as best she could but you saw it in his face.  He didn’t care who, or more importantly what you were.  What he cared about was getting something in his stomach.  <br>\r\n<br>\r\n“Ok little bugs time to get in my tummy.”  He tipped his head back with both you and Jenny in his palm rising up above.  He slowly tilted the hand back and let the two of you fall off his hand and free fall down into his dark wet mouth.  <br>\r\n<br>\r\nBoth you and Jenny flipped through the air shouting as you pass past Jack’s teeth and land on something soft and wet.  It was his tongue.  He slowly closed his mouth and sealed you and his mom in his mouth.  <br>\r\n<br>\r\nIt was dark and damp as the humidity was high.  You could smell his breath which smelled like old milk, probable because he just drank some milk or dairy product.  You reached out your hand and felt Jenny as you two pulled each other together getting ready for what was next.  The tongue beneath you slide around causing you two to fall down on your back and get covered in saliva.  Jack then swished his saliva around with you and Jenny.  You were shoved from one check to the next over and over again as you start to run out of air being cover in the thick wet liquid.  You final stop being thrown around and you land on top of Jenny who was on the tongue.  The tongue then pushed up ward and pinned you and Jenny together and then slide back, flicking the both of you into his esophagus.  <br>\r\n<br>\r\nJack could do this all day.  He loved to play with his food, especially if it were bugs.  He swished his saliva and bugs around in his mouth getting the taste of them.  It was fun feeling them squirm in his spit but he was getting hungry.  He stopped swishing and then swallowed the bugs to let them fall down into his belly.  <br>\r\n<br>\r\nYou and Jenny slide down the wet, hot squeezing walls that pulsated around you.  It felt like forever before you were deposited in a chamber that was surrounded by pulsating walls as you could hear a heartbeat.<br>\r\n<br>\r\n“Are we in his stomach,” Jenny asked scarred.<br>\r\n<br>\r\n“Yeah,” you replied.<br>\r\n<br>\r\n“Are we going to die?”<br>\r\n<br>\r\n“… No,” you didn’t have the heart to tell her the truth but knew she knew the answer.  She was nurse after all and she was just being optimistic.  <br>\r\n<br>\r\nYou find her in the dark and pull her in tight for a hug.<br>\r\n<br>\r\n“What do we do?”<br>\r\n<br>\r\n“There isn’t much we can do.”<br>\r\nAfter that being said the walls started to move in closer and you could feel you skin tingle slightly.  Then there was a rumble and then the air in the chamber was sucked out.  Now your skin tingled more and there was almost no air as you started to black out…<br>\r\n<br>\r\nJack let out a satisfying burp.  Bugs always made him gassy.  He rubbed his belly felling fuller than he was before those stupid bugs showed up.  Continuing with his toys he never realized he just killed his mom and neighbor.<br>\r\n</span></div></div>",
            "created":1345619220,
            "id":1410279,
            "title":"Can't play on an empty stomach"
        },
        "12":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Her child (boy) ",
                "Her child (girl)",
                "Children "
            ],
            "content":"<div class=\"\"><div> <span>\"What happened...\" you say wondering why your head feels like its about to explode.  Opening your eyes you quickly look around to see your surroundings when you gasp.  You were inside Jenny's house but something was wrong ... the house was too big.  Siting up you look around yourself to gaze at the unbelievable.  In front of you was a giant T.V. surrounded with a couch in front of it.  The T.V. could be the size of a house to you.  \"No way... this can't be real.\"  Standing up you began to walk around aimlessly just to see if the entire house was like this.  After a couple of minutes the situation sets into you, you have shrunk in your neighbor's house and no one knows where you are.  \"Wait she will be home any minute and then she will shrink too!!  This is bad if she shrink then we both will be in trouble.\"  Almost as if on cue you hear Jenny pull up into her drive way.  You begin to shout even though you know she wont hear you, \"Jenny don't touch the door, you will...\"  The door opens; your voice drops at the site of the giantess. You stare half expecting her to shrink, half wanting her to see you on the floor to help you.  To your joy she is the same size as always, but unfortunately she doesn't see you.  <br>\r\n<br>\r\n\"Mark are you here?\" she asked in a tired voice from working her shift at the hospital.  \"Huh, guess not.  He's normally here by now.  I wonder where he is?\"<br>\r\n<br>\r\nShe starts to walk forward.  Realizing you are in her way you jump to the side just in time to see her feet slam down right where you were.  You begin to chase after her to get her attention so everything can go back to normal.  When you hear another pair of foot steps running down the hallway.<br>\r\n</span></div></div>",
            "created":1339563600,
            "id":1358711,
            "title":"Inside the house...shrunken"
        },
        "121":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "In his diaper.",
                "Next to him on the couch."
            ],
            "content":"<div class=\"\"><div> <span>\"MOMMY!\" shouts little ... well big Mikey.<br>\r\nJenny smiles at her 3 year old son as he dashes to her.  She picks him up and smothers him  in kisses.  \"Hows my little boy doing today?\"<br>\r\n<br>\r\n\"Mommy I'm not a little boy.  I'm a BIG boy,\" said Mikey sounding a bit crossed.<br>\r\n<br>\r\n\"Oh right sorry honey, its been a long day today.  Have you seen Mark today?  He was suppose to be watching you.\"<br>\r\n<br>\r\n\"No.  But you said we were going to out today and I want to go to Chuck E Cheese.  Can we? Please.\"  Mikey pleaded.<br>\r\n<br>\r\n\"Well... OK let me change first and wait for Mark a little bit.  It's odd he isn't here now.  I was hoping to see him today.\"  With a sad look Jenny went down the hall way to change for Chuck E Cheese.<br>\r\n<br>\r\nMikey jumped on the couch and waited for his mom to return when something on the floor caught his attention.  Mikey loved to play with bugs, and this time it was no exception.  He jumped down off the couch and went to go see what bug was crawling on the floor.  As he got closer he noticed the bug trying to run away but due to his size Mikey caught up with it in no time and picked it up.  \"I found you!\"  He shouted with joy as he picked up the helpless bug.  \"Hmm what should I do with you?\"<br>\r\n***<br>\r\nMark was scared out of his mind first he couldn't keep up with Jenny as she went to change then Mikey came after him to do God knows what with him.  Wait this could be my chance.  Mikey's a smart kid he might be able to get Jenny's attention for me.  \"MIKEY!! MIKEY!! ITS ME MARK!\"  He hoped he could hear him as he was in the center of Mikey's hand.<br>\r\n<br>\r\n\"Mark?  What are you doing?  Are you pretending to be a bug?\"  Mikey questioned.<br>\r\n<br>\r\nThank God he can hear me.  \"NO I GOT SMALL.  LISTEN MIKEY I NEED YOU TO TAKE ME TO YOUR MOMMY.  CAN YOU DO THAT?\"<br>\r\n<br>\r\nMikey beamed him a smile, \"SURE!!\" he shouted causing you to wince.  He started to walk to his mom's room when he found her door locked and taking a shower.  \"Hmm. I need to keep you somewhere safe until mommy's done.  I know I'll keep you...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1340254800,
            "id":1364049,
            "title":"Mikey"
        },
        "1211":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Jenny checks Mark's house",
                "She promised they were leaving "
            ],
            "content":"<div class=\"\"><div> <span>Mikey was a little old to be wearing diapers but he still wasn't ready to use a toilet.  You and Jenny have been trying to get him to use a toilet but all your attempts have failed.  <br>\r\n<br>\r\nIt happened all to fast for you to comprehend but when it was over you were looking up at Mikey's butt.  \"Please don't tell me I'm in his...\" Mikey snapped his diaper shut.  <br>\r\n<br>\r\n\"You be safe there until mommy comes back,\" Mikey said with a grin.  Proud of him self he walked back to the couch to watch T.V.<br>\r\n<br>\r\nYou continue to shout trying to get his attention, but alas he either can't hear you or doesn't care.  Then you hear the T.V. turn on, oh no he's about to sit down to watch T.V. you tell your self.  As Mikey climbs up the couch to set down you move all the way to the back of the diaper to not get crushed by Mikey's butt.  You make it in time, lucky you...<br>\r\n<br>\r\n15 min pass and Mikey is pulled into an episode of Sponge Bob.  You sit in the back of his diaper trying to get out when you hear the water turn off from Jenny's room.  Thank God this is almost over.  You were begin to panic, good thing you kept your cool.<br>\r\n<br>\r\n\"Ok ready Mikey?  You dressed and ready to go Chuck E Cheese?\"<br>\r\n<br>\r\n\"Yes mommy.\"<br>\r\n<br>\r\n\"Good.  Did Mark come over yet?\"<br>\r\n<br>\r\n\"Ummmm I don't think so.\"  Your heart just exploded.  WHAT HE FORGOT!!  You begin to shout when Mikey gets up and you tumble down his diaper to the bottom.<br>\r\n<br>\r\nJenny picks up the phone and begins to dial your number to call you but gets a message machine, \"Hey Mark.  It's me.  I'm taking Mikey to Chuck E Cheese and you can meet up with us there.  We would love it if you could... well come along with us.\"  You can hear the nervousness in her voice and can imagine her blushing right now.  \"So I guess I'll see you later then.  Ok bye.\"  Jenny hung up the phone and looked at Mikey, \"Alright lets go.\" <br>\r\n<br>\r\nYou try to get Mikey's attention and even Jenny's but the T.V. is either to loud or they can't hear you through the diaper and pants Mikey is wearing.  Then it hits you... you are in Mikey's diaper and no one knows your there.  He isn't potty trained and his diaper is clean.  Any second things are about to get worse if you don't find a way out fast.  <br>\r\n<br>\r\nYou try to punch, kick, even bite him but he can't feel a thing.  You hear the T.V. turn off and the front door open then close.  Jenny helps Mikey into his chair in the car and buckles him up for the small road trip to Chuck E Cheese.  She pauses when she pulls out of the drive way, \"Maybe I should check if Mark is home?\" <br>\r\n<br>\r\nYou shout, \"JENNY I'M IN MIKEY'S DIAPER!\"<br>\r\n<br>\r\n\"Mommy, you said we were leaving,\" Mikey pouts, giving a sad face to her.  <br>\r\n</span></div></div>",
            "created":1340254800,
            "id":1364376,
            "title":"Can it get any worse"
        },
        "12112":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "OK!!!!",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, your right we should go.\"  Jenny put the car into gear and drove down the street heading for Chuck E Cheese.<br>\r\n<br>\r\n\"YEAH CHUCK E CHEESE!!!\" shouted Mikey as he bounced up and down in his care seat.  Each bounce felt like a dump truck backing up into you, \"OOF... OOF... Mikey... Stop... I ... Can't... Breath!!!\"  Fortunate for you he stopped but not because you told him.<br>\r\n<br>\r\n10 minutes later Jenny pulled up to Chuck E Cheese and let Mikey out of the car.  They both entered and Mikey immediately went to the ball pin to play.  You gave up trying to get his attention knowing that if he couldn't hear you before there is no way in hell he will hear you through the commotion going on in the store.  Mean while Jenny was sitting at a table after ordering some food for Mikey.  She kept looking at her phone seeing if Mark called her yet, but there was nothing.  \"I wonder if he likes me,\" she said under her breath.  She tried your number again for the fifth time today but got the same voice mail.<br>\r\n<br>\r\nAfter a while a waiter dropped off their order of extra cheese pizza.  Jenny called Mikey over to eat some food so he doesn't get hungry.  \"You want mommy to cut up your pizza for you honey?\"<br>\r\n<br>\r\n\"No,\" he said with a grin, \"I'm a big boy I can eat it all by my self.\"<br>\r\n<br>\r\nJenny just sat there smiling at Mikey as he ate still thinking about Mark.  Every so often she would hear the door open and look to see if it was Mark but soon realized it wasn't.  After Mikey and Jenny ate the pizza Mikey noticed that his mom was sad and asked, \"Mommy whats wrong?\"<br>\r\n<br>\r\nShe quickly smiled and said \"Nothing.  Why don't you go play now?\"<br>\r\n<br>\r\nMikey quickly jumped down from his seat and ran back to the ball pen to play.  You, still stuck in Mikey's diaper, were in a living hell.  As Mikey ran around and played with the other kids in the ball pen he started to work up a sweat.  His diaper turned from a soft dry prison into possible the most humid and wet environments in the world.  Worse you kept getting bounced around and started to stick to his butt.  First it was for a few seconds then you would fall back down.  Then the duration of it turned into minutes.  Eventual you final got stuck to his butt.  Unable to move you begin to get mad.  You start to kick, punch, yell, squirm.  You tried to get his attention but again he couldn't hear you.  You finally break down and give up.  You are screwed and there is nothing you can do about it.<br>\r\n<br>\r\nAfter a couple of hours Jenny started to get extremely sad, wondering why you didn't show up.  She was so upset that tears started to form in her eyes but she quickly brushed them away.  How mature of her to start to cry because someone didn't show up at a kids restaurant.  A few minutes later Mikey ran up to his mom ready to go.  \"Mommy are you OK?  You look sad.\"  Jenny again put on a smile for her son.  How observant for a 3 year old to know when she was upset.  <br>\r\n<br>\r\n\"I'm fine.  I just was hoping Mark would show up that's all.  But if your ready to go then come on.\"  She quickly picked up her purse and walked out with her son holding her hand.  They got in the car and started to drive home.  \"You know what Mikey I don't need Mark,\" she said \"When I got my little man with me.  In fact your the only man I need in my life.\"  <br>\r\n<br>\r\nHearing this you begin to shout again \"JENNY!!! I'M RIGHT HEAR DAMN IT!!! LISTEN TO ME I LOVE YOU!!!! PLEASE JUST HELP ME!!!!\"  Not to your surprise she didn't hear you.  With the music playing and with Mikey's clothes, not a word reached her.  Pinned under Mikey's butt you begin to cry \"I was going to ask you out tonight... but for some damn reason out of everyone in the world I shrink.\"<br>\r\n<br>\r\nJenny pulled up into the drive way and got Mikey out of his car seat and into the house.  It was night time and they had a couple of pizzas for lunch and dinner.  She had to go to work tomorrow morning so she was getting Mikey ready for bed.  \"OK little man ready for bed?\"<br>\r\n<br>\r\n\"Mommy I told you I'm not a little man,\" he said with a frown.  She quickly sniffed to see if Mikey went to the bathroom in his diaper and to her surprise he didn't.  Then she though of an idea.<br>\r\n<br>\r\n\"Fine.  I'll start calling you my big man if you can use the potty like we talked about.  Can you do that?\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1340341200,
            "id":1364554,
            "title":"Let the fun begin"
        },
        "121121":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Mad at you",
                "Remebers where you were"
            ],
            "content":"<div class=\"\"><div> <span>\"OK!!!!\" The sound of joy can not be missed in his voice.<br>\r\n<br>\r\n\"Alright.  Mikey next time you need to go I want you to go in this potty trainer.  When you do I want you to get me so I know that you went in the potty and not your diaper.  OK?\"<br>\r\n<br>\r\n\"Yeah mommy i understand.\"<br>\r\n<br>\r\n\"Good.  Now brush your teeth before you go....\"<br>\r\n<br>\r\nTo your worst fears all day you hear a beast growl at you.  The sound is almost deafening to your ears and the worst part is you know what it is.  The monster is Mikey, and it's got a present for you.  \"Dear God if you love me please don't let him shit his diaper now.\"  <br>\r\n<br>\r\n\"I guess your ready to go now?  Here is your potty and do you want me in here with you?\"<br>\r\n<br>\r\n\"No mommy I can do it all by myself.\"  With that Jenny left the bathroom for Mikey to go all by himself.<br>\r\n<br>\r\nHe quickly pulled his pants down and sat on the potty and waited to go the bathroom.  You on the other hand feel off his butt the moment it made contact with the seat landing with a ping in the bowl.  \"Please let him hear me.  MIKEY!!!!!  MIKEY!!!! DON'T GO YET!!!!!\"  By the power of God Mikey starts to get up off the potty.  Thank you God.  \"MIKEY ITS ME MARK REMEMBER YOU PUT ME IN YOUR DIAPER?!?\"<br>\r\n<br>\r\n Mikey frowned down at you for a brief second then his frowned turned into a smile \"What are you doing in there?\"<br>\r\n<br>\r\n\"I'LL TELL YOU AS SOON AS YOU HELP ME OUT!!\" Thanking every religious God you can think of.  A few seconds pass and you realize something is wrong he isn't moving at all.  It looks like he is in deep though.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1340341200,
            "id":1364601,
            "title":"Im a big boy now"
        },
        "1211211":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "content":"<div class=\"\"><div> <span>Mikey's face slowly turns to a frown, \"You made mommy sad.\"<br>\r\n<br>\r\n\"NO WAIT MIKEY YOU LEFT ME-\"<br>\r\n<br>\r\n\"I don't like it when she is sad.  I don't like anyone who makes her sad.  I don't like you.\"<br>\r\n<br>\r\nYou quickly realize that this could turn south really fast if you don't explain.  \"MIKEY REMEMBER YOU PUT ME IN YOUR DIAPER TO KEEP SAFE TO SHOW MOMMY.  REMEMBER?\"<br>\r\n<br>\r\nAfter a few seconds, a grin pops up on his face \"NOPE!!\"  With that being said a loud growl is heard again and you know the beast is ready to be released.  \"I need to go now so bye bye!!\"  He quickly waves good bye to you as you try to get his attention but it's too late he already blotted out the light with his butt.  Both you and Jenny don't know that cheese doesn't set well with Mikey and with all those extra cheese pizza slices in his belly things couldn't be worse for you.  A couple of minutes pass and you can hear Mikey humming a tone and then suddenly out of now where you hit in the head with a couple of splashes.  You taste a salty liquid and realize it's his pee.  You quickly start to spit when a whole torrent of piss starts to hit you in the back and push you around the bowl.  This continues for hours... or is it minutes, you can't tell for sure but its not fun.  Then it stops you keep telling your self that he only needs to pee and soon he'll get you out of here.  Deep down you know that growl wasn't to release his bladder.<br>\r\n<br>\r\nThen there is a growl louder then the rest you have heard signaling that this is it.  You barely have time to pray when the shit starts to fall.  First a few glops drop in the piss bowl splashing you with piss when you hear Mikey start to grunt.  That's when it happen, it started with gas been passed in the potty then a shower of possible the worse case of diarrhea flows out and starts to fill the bowl.  You are quickly washed away with it and push around being covered in it.  You quickly pull yourself out but get submerge again and again until you can't pull yourself up.  You quickly start to drown in the worst kind of liquid possible.  Layer after layer after layer.....<br>\r\n***<br>\r\nSmiling, Mikey let out a sigh of relief.  He felt so much better now.  Quickly he wiped his bottom with some toilet paper and pulled his diaper and pants up.  He went out in the hall way to get his mom to show what he did \"MOMMY MOMMY LOOK WHAT I DID!!\"<br>\r\n<br>\r\nJenny walked into the bathroom and almost gagged.  Well at least he used the potty instead of his diaper I can't image anyone standing that smell.  \"Well looks like someone just became a man,\"  She said with a giggle.<br>\r\n<br>\r\n\"Yeah it was FUN!!\"</span></div></div>",
            "created":1340341200,
            "id":1364634,
            "title":"Becoming a man"
        },
        "121122":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Jenny nows what she was doing",
                "Mikey had too much to eat for the rub to help"
            ],
            "content":"<div class=\"\"><div> <span>Mikey looked down at his feet and shuffled his feet around a bit not answering his mother.<br>\r\n<br>\r\n\"Hey.  It's OK, if your not ready then don't worry about.  Change is sometimes scary.\"  Jenny tried her best to get Mikey to look back at her.  Finally he looked up at his mother with a smile, \"OK mommy.\"<br>\r\n<br>\r\n\"That's my boy.  Now go brush your teeth and get ready for bed.\"  Mikey quickly went and brushed his teeth while you were still plastered to his butt.  You remember that Mikey still hasn't used his diaper yet.  You were part joyful that you aren't buried in shit, part mad because that could be a chance to be found by Jenny.  Unable to move much you begin to thrash around to break free.  Slowly you start to peel off his bottom when you hear a groan come from Mikey.  <br>\r\n<br>\r\nMikey's didn't feel good and he let out a soft moan.  Quickly after brushing his teeth he went to go see if his mommy can help.  \"Mommy, mommy, I don't feel good.\"<br>\r\n<br>\r\n\"Whats wrong sweetie?\"<br>\r\n<br>\r\n\"My tummy doesn't feel good,\" Mikey said with a groan.  Jenny could hear his tummy growl and gurgle.  It must be a tummy ache from all the food he ate today.<br>\r\n<br>\r\n\"How much pizza did you have?\"<br>\r\n<br>\r\n\"This many,\" Mikey said holding up his hand with five of his fingers outstretched. <br>\r\n<br>\r\nJenny's eyes grew big at the amount her son ate.  That was a lot of pizza to have in one day, especially for a child.  \"Well no wonder why silly, you had a lot of pizza.\"<br>\r\n<br>\r\nMikey closed his eyes and let out another groan.  \"Mommy.  Make me feel better, please,\" he pleaded with his face full of pain.<br>\r\n<br>\r\n\"OK sweetie come here.\"  She picked up her son and lead him down over her lap and pulled his shirt up and started to rub his belly.  Usually this helped him when he had gas when he was younger and hopefully it will help now.  After a few minutes he let out a sigh of relief.  Jenny still rubbed his belly to help him digest all that food he had.  A couple of more minutes went by and Mikey's eyes started to close slowly.  Five minutes later he was sound a sleep in his mothers arms.<br>\r\n<br>\r\nJenny picked up Mikey and took him to bed to sleep, and covered him in blankets.  \"Good night my big boy,\" she said and kissed him goodnight.<br>\r\n<br>\r\nMean while, since Mikey was lead down on his side, you peeled your self off and landed in Mikey's diaper.  Quickly you try to find a way out but to your disappointment you couldn't push your self out of  his diaper and was stuck, yet again.</span></div></div>",
            "created":1340427600,
            "id":1365830,
            "title":"Upset Stomach"
        },
        "1211221":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "content":"<div class=\"\"><div> <span>Again you are helpless in a child's diaper unable to get out or help.  With Mikey on his side you are up against his top left butt cheek.  All day you have been praying to God to help you but now you desperately pray, \"Don't let him turn in his sleep.  What ever he does please don't let him turn in his sleep.\"  A long time passes by and you realize that Mikey hasn't moved an inch.  You let out a breath of relief as you realize God listen to you.  <br>\r\n<br>\r\nYou see a light a the bottom of his diaper and you let out a gasp; its a gap in his diaper between his legs touch.  Mikey sleeps with a night light and you can see the glow from it under the covers.  You were near the top of his diaper and decide its time to get the hell out of here.  You get half way there, (right in the middle of his butt cheek) when his legs move a bit and close the gap.  DAMN IT.  I'll just wait till he moves his legs-<br>\r\n<br>\r\nThere is a loud gurgle heard above you.  The same gurgle about an hour ago when Mikey said he felt bad.  \"No, NO, NO!!!\" he farted.  The smell was so bad that your eyes started to water and you coughed profusely.  Then came more farts, wet farts.  Your were down on you knees crawling up to the top of the diaper and then the light shined again.  Do you dare head toward it.  Another fart this almost as bad as the first.  I'll die if I stay here you think as you turn around and head toward the light.  <br>\r\n<br>\r\nYou make it a little further then where you were before the farts; a blob fell from the sky.  It smelled worse then the farts and you knew what that was.  Quickly you  turn around and then another blob blocked your path.  Shit.  You were stuck in between an ass and a wet place.  Before you can even decide what to do the Wet farts come out faster and then stop.  Oh no you think.<br>\r\n<br>\r\nThe shit really started to pour; it came out and hit the side of his diaper and slide down to your feet.  The down pour started to come down Mikey's butt cheek too.  Shit started to fall all around covering you head to toe in it.  The pile grew higher and higher until you were about chest high in shit.  Then it stopped as soon as it started, and you heard Mikey in his sleep let out a sigh.  <br>\r\n<br>\r\nYou quickly start to move only to find that you were stuck, MOTHER F*****.  Great now I'm stuck in shit.  You squirm as much as you can only to find out your efforts are pointless.  Its like being buried in sand... wet, smell, shitty sand.  <br>\r\n<br>\r\nThen your worst nightmare came true, Mikey was turning in his sleep.  With his butt rolling toward you crushing the mess with his butt and diaper the flow of shit pushed you.  Luck was on your side.  You were pushed in between Mikey's butt cheeks to his crack.  You were also free from the shit pile.  \"HAHAHA.  IS THAT THE BEST YOU CAN DO!!\"  Shouting at Mikey, you get up and kick his cheek.  You still see light; brushing your self off (and as much shit as you can).  You walk toward the light.  <br>\r\n<br>\r\nMikey let out a loud groan and farted heavily and let loose the most shit ever made in history.  You, just happening to be directly under his asshole, were buried in it.  The pile rolled over you and filled his diaper to the brim covering his butt, and you in the worst case of crap ever.  Unable to move or breath you start to fade out while Mikey continue to entomb you.<br>\r\n<br>\r\nThe next morning Mikey woke up feeling really good.  He yawn, and stretched when he realized his tummy didn't hurt.  He ran to the kitchen and found his mom.  \"MOMMY, MOMMY!!  MY TUMMY DOESN'T HURT ANYMORE THANK YOU!!!\"<br>\r\n<br>\r\nJenny smiled and picked up her son when the smell hit her.  Gasping and wide eyed; she quickly pulled his diaper open and looked at the results.  There was a lot of stuff back there, \"Whoa, looks like Mommy's big boy made a BIG mess.\"<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1340427600,
            "id":1365849,
            "title":"Mother knows best"
        },
        "122":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "3 years old ",
                "11 years old",
                "18 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The sound came from Jenny's daughter, who was ...</span></div></span></div>",
            "created":1343538000,
            "id":1392806,
            "title":"Sammy"
        },
        "1221":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Stay where you are",
                "Get help now"
            ],
            "content":"<div class=\"\"><div> <span>Jenny's daughter Sammy came bounding into the room with a big smile on her face.<br>\r\n<br>\r\n“Mommy,” she shouted with great enthusiasm.<br>\r\n<br>\r\n“Sammy!”  Jenny copied Sammy’s reaction which caused her to giggle with glee.  Jenny picked up her daughter and spun her around in her arms.  Jenny kept Sammy in her arms as she held her close as she walked into the kitchen.<br>\r\n<br>\r\nYou did your best to stay out of the way of the two giantess way.  When they started to head for the kitchen, and didn’t even notice you, you being to doubt your plan.  This is hopeless, you think.<br>\r\nJenny was talking to her daughter about her day knowing that she probable doesn’t even know what she is talking about.  It was more for her than her daughter; a way to relive the stress of the day.  To Jenny’s surprise her daughter nodded her head as if she did know what she was talking about.  Jenny continued her tale of great day as a nurse while getting some juice out for the both of them.  She put some in a sippy cup for her daughter and one in a glass cup for her.<br>\r\n<br>\r\n“Thank you mommy,” she said.<br>\r\n<br>\r\n“You’re welcome.  Let mommy change and we will go do something fun, ok?”<br>\r\n<br>\r\n“Ok mommy.”<br>\r\n<br>\r\nJenny then set Sammy down who ran into the family room to watch some T.V. as Jenny went to change into something more appropriate then scrubs.<br>\r\n<br>\r\nYou just sat there in the middle of the family room when you heard the stomping of a 3 year old running in your direction.  You ran for cover under the coffee table.  You barely make it in time to see a pair of small feet standing near where you were.  You don’t know if you should be found by Sammy or not.  She may be too young to understand what to do.  On the other hand you are in dire need of help.  You made up your mind to…<br>\r\n</span></div></div>",
            "created":1343538000,
            "id":1392822,
            "title":"Little Sammy"
        },
        "12211":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Show the bug to Mommy",
                "Hide the bug"
            ],
            "content":"<div class=\"\"><div> <span>You weren’t going to chance it; shrinking was bad enough you didn’t want to be found by a little kid who may not comprehend your situation.  You stay in the shadows under the table as the T.V. turns on, My Little Pony turns on; her favorite show.  She was sing along with the theme song, off key of course.  Then to your horror she dropped her sippy cup.<br>\r\n<br>\r\nSammy was watching her favorite show because it had ponies.  She was laughing at a joke when she lost her grip on her drink.  It hit the ground as she let out a gasp.  She went after her cup that rolled to the coffee table.  She fell down on the ground and reached for the cup when something moved under the table.  Curious she got up and pushed the table.  <br>\r\nTo her joy she found the culprit, a bug.  <br>\r\n<br>\r\n“Hello mister bug.  What are you doing there?”<br>\r\n<br>\r\nYou just stood there as your hiding spot was gone now.  You looked into the face of the child who found you.  You were scarred to move until you heard her say bug.  Oh no!  She loved to play with anything small like Barbie’s especially the ones that talk, but her favorite things to toy with were bugs.  They moved on their own and squirmed when they were trapped.  You panicked and ran.  You didn’t know where to, you just ran away from Sammy.<br>\r\n<br>\r\nSammy let out a squeal of delight at the sight of you running.  She loved a chase.  She gave you a few seconds head start then came after you.  <br>\r\n<br>\r\nYou heard the heavy footsteps of the small girl coming after you.  You saw the couch was in front of you, and went for it.  There was no way she could move the couch and decided that was your best bet.  You went running for your safe haven when a shadow fell over you.  A giant foot came crashing down on you.  It stomped on top of you with a great force that knocked the air right out of you.  You were smashed into the carpet as the tons of weight from this small little child crushed you to death.<br>\r\n<br>\r\nSammy dropped her foot down with as much care as possible.  She didn’t want to kill this bug like she did last time, well not without some fun first.  She quickly stepped down on the bug, “Where do you think you’re going?”  She removed her foot to look at the damage she did.  The bug wasn’t moving and Sammy thought she killed it.  She was sad but then the bug started to crawl and head to the couch.  Giggling with glee she quickly picked up her new toy with her hand with ease.<br>\r\n<br>\r\nYou felt the blood course through your body again when the foot was removed, you thought you could crawl to the couch without her noticing but that didn’t end well as a giant hand descended on you and picked you up.  You were brought to a giant face of a cute little girl who grinned at you like she just won a prize, which she did.<br>\r\n<br>\r\n“Hello mister bug.”  Sammy said again, she then tilted your head at you like a dog looking confused.  “You remind me of someone, but who?”  <br>\r\n<br>\r\nYou quickly start to shout at her, “SAMMY ITS ME MARK!!”<br>\r\n<br>\r\n“No not Mark… Oh I know that other bug I swallowed.  Was he your cousin?”<br>\r\n<br>\r\nYou don’t know which was more horrifying, the fact that she heard you but didn’t recognized you or that she eat a bug that looked like you.  You start to yell and try to wiggle out of her hand when you hear Jenny’s door open and she’s walking into the family room.<br>\r\n</span></div></div>",
            "created":1343538000,
            "id":1392834,
            "title":"Safe ... or are you"
        },
        "122112":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Eat",
                "Play"
            ],
            "content":"<div class=\"\"><div> <span>“Mommy doesn’t like bugs so I have to hide you.”<br>\r\n<br>\r\nYour eyes widen at that statement.  With her other hand she opened the back of her shorts and the diaper underneath it.  She brought the hand with you in it and dropped you in.  You fell through the air as you land on the clean diaper and roll down until you were directly under her butt.  The light from the top of her diaper shone in lighting the inside of the diaper for a few seconds showing a pink clean diaper.  You were grateful it was clean, but for how long.<br>\r\n<br>\r\nSammy snapped her shorts back into place as she ran to mommy to give her a hug.<br>\r\n<br>\r\n“Ok baby girl, what should we do today?”<br>\r\n<br>\r\n“Can we go to the park?”<br>\r\n<br>\r\n“Sure, but what about lunch?”<br>\r\n<br>\r\n“Can we get some food on the way.”<br>\r\n<br>\r\nJenny smiled at her daughter, “You’re a smart little girl aren’t you?  Ok we can pick up some food on the way to the park.  You want to change or are you fine in those clothes.”<br>\r\n<br>\r\nSammy jumped up and down with joy, “Let’s go to the park, let’s go to the park, let’s go to the park!”<br>\r\n<br>\r\nYou were just getting comfortable when your world jumped up and down.  You went flying up and hit the round smooth butt of a 3 year old.  You then went falling down and landed on the diaper soft surface, then back up then down.  It was like going on a drop tower in an amusement park only a lot scarier.<br>\r\n<br>\r\nJenny got her stuff ready for the park and stopped to think about Mark.  “What about Mark should we invite him too?”<br>\r\n<br>\r\nSammy looked sad and said, “Can it just be us mommy?  It’s never just us.  Just for today, please?”<br>\r\n<br>\r\nJenny was touched at what Sammy said just the two of them mother and daughter together spending time together.  Sammy was right though it hasn’t been them for a long time; ever since her ex-husband left Mark has been help them get through it.  She needed to have some quality time with her beautiful daughter and one day without Mark won’t kill him.<br>\r\n<br>\r\n“Ok just us.”<br>\r\n<br>\r\n“Yay!”  Sammy jumped with joy again and ran for the front door.<br>\r\n<br>\r\nYou got bounced one more time before you felt your world moving forward.  With each step Sammy took one of her checks would press into you.  Right cheek, left cheek, right cheek, left cheek.  They would press into your face enveloping you and then releasing you, like a hug; a hug from a giant round jiggling sphere of pure flesh.  You heard everything that was going on and lost hope that Jenny would find you missing and look for you.  This was going to be a long day.<br>\r\n<br>\r\nJenny strapped her daughter into her car seat, who was still grinning at the thought of going to the park.  Jenny couldn’t stop herself from smiling at her daughter, and closed the door.<br>\r\n<br>\r\nSammy just farted in her car seat and was grinning at the pleasure it brought.<br>\r\n<br>\r\nYou never heard it.  It was a silent and deadly fart that was released from Sammy.  Sammy has always been a stinker but this… well this was ridicules.  The smell was terrible and you felt the warm air rush out of her and wash over you.  You shudder at the heat from the fart and then the smell attacked your noise.  You thrashed about at the power it had.  It burned and your eyes started to tear up.  You quickly cover your gagging mouth so you don’t throw up.  <br>\r\n<br>\r\nYou were about to move somewhere else.  Anywhere would be better than under Sammy’s ass.  Unfortunately Sammy had other plans.  She wiggled her butt to get comfortable in her car seat.  This caused her butt cheeks to spread apart and down.  They descended upon you.  Now you were face to ass with Sammy.  Her ass hole was emanating a particular stench not to mention the heat coming off her body.  <br>\r\n<br>\r\nJenny got in the driver’s seat and started the car.  She took off and drove down the street to a fast food restaurant that was both her and Sammy’s favorite.  After picking up the food she then drove down to the park to enough a day with her daughter. <br>\r\n<br>\r\nThey reached the park and Jenny helped Sammy out of her seat.  <br>\r\n<br>\r\nJenny asked, “What do you want to do first, play or eat?”<br>\r\n<br>\r\n</span></div></div>",
            "created":1343538000,
            "id":1392855,
            "title":"Where the sun don't shine"
        },
        "1221121":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Escape",
                "Fail"
            ],
            "content":"<div class=\"\"><div> <span>Sammy’s stomach let a growl.<br>\r\n<br>\r\n“Someone is hungry, let’s eat.”  Jenny took Sammy’s hand in one hand and carried their food in the other.  They walked over to a flat area to lay out a blanket to eat their food on.  They both sat down on the blanket and Jenny set the food out.<br>\r\n<br>\r\nYour face was almost touching Sammy’s ass hole when she started to walk.  The walls that sealed in in started to slide on either side of you to the rhythm of her steps.  When you thought it would never end they stopped; you bean to fall down ward as Sammy sat down.  Your world got compressed as Sammy’s butt cheeks pressed in on you due to her seating down.  The pressure made you gasp for air, which again wasn’t the most pleasant smell.<br>\r\n<br>\r\n“Mommy can I eat my taco now?”<br>\r\n<br>\r\n“Sure, here you go.”  Jenny handed Sammy her favorite food in the world, tacos.  <br>\r\n<br>\r\nSammy said thank you as she grabbed her taco and bite into it with a crunch.  She quickly ate her taco and grabbed a burrito.  She was starving and finished it in recorded timing.  Quickly she cleaned herself up so she could go play on the playground.  <br>\r\n<br>\r\nYou heard what they were eating and let out a howl of dread.  Tacos, it had to be tacos.  You tried to move away from the pulsating ass hole that continued to let out distinct stench.  It naturally smelled bad without Sammy farting, but with her eating tacos things will start to get worse.  To your misfortune you moved nowhere.  You could hear the munching of Sammy devouring the tacos with great hast so she can go play.  Your only chance is to escape while she goes play.<br>\r\n<br>\r\n</span></div></div>",
            "created":1343632860,
            "id":1393195,
            "title":"The best food in the world"
        },
        "12211212":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "yes",
                "nope"
            ],
            "content":"<div class=\"\"><div> <span>“Mommy can we go play now?”<br>\r\n<br>\r\nJenny just finished her food when Sammy asked.  “Sure.”  She quickly packed up the blanket and trash.  <br>\r\n<br>\r\nSammy grabbed her mommy’s hand and led her over to the slide.  Sammy climbed the latter and slide down laughing the whole ride down as her mother laughed with her.<br>\r\n<br>\r\nYou felt movement as your world started to move forward and then ascend.  You didn’t know what was happening before it was too late.  As Sammy slid down the slide her diaper was pulled back from the friction.  This caused you to be shoved deeper in Sammy’s ass.  Your face collided with her poop hole.  You were kissing her asshole with your face.  You couldn’t help but get a taste of it as you were forced to stay like that for the duration of the ride.  It tasted like ass, no surprise there.  As soon as the pressure was gone you pulled your head away from the hole as far as you could.  To your horror you felt the ascending feeling again and knew what was about to come.<br>\r\n<br>\r\nSammy loved the slide.  She could spend hours sliding down it.  Something was different though, her butt felt tingly.  She didn’t know why but it felt good.  So she decided to keep going.<br>\r\n<br>\r\nPossible hours went by and you lost track of how many times you were shoved into her ass hole.  All you know is the flavor it left in your mouth and the muffled laughter of the girl who was putting you through this horror.<br>\r\n<br>\r\n“You want to try the swings next?”<br>\r\n<br>\r\n“Yeah,” Sammy shouted.  She loved the swings almost as much as the slides.  <br>\r\n<br>\r\nJenny helped Sammy into the swing seat as she gave her a push.<br>\r\n<br>\r\nYou pulled your head out of the Sammy’s butt hole for possible the hundredth time when you were ascended again.  This time it was different, you could tell it was Jenny picking up Sammy.  You then felt the pressure of Sammy’s cheeks seal your only way out.  You thought the swings wouldn’t be as bad… wrong.  Each time Sammy reached the top of the push her butt pressed down on the seat, which pushed you into her asshole with more force than the slide.  Instead of your head just poking her hole your head went into it.  You gasped in surprise which allowed the fumes inside her to assault your nostrils.  The smell was the worst thing imaginable.  It was worse than the fart she hit you with earlier.  The smell made you see stars as you desperately pushed your head out.  You removed your head only to be pushed back in as she was pushed again by Jenny.  <br>\r\n<br>\r\nSammy felt that tingle again on the swing and let out a squeal of delight.  <br>\r\n<br>\r\nAfter a while Jenny took Sammy for a walk.  Sammy held her mom’s hand as they walked and occasionally she would take off running and then come back to Jenny.<br>\r\n<br>\r\nYou loved the walk compared to the previous tortures you endured.  Except for the running, which caused some more discomfort than when she walked, you could say it was peaceful (except for the smell).<br>\r\n<br>\r\nThe day was coming to an end and they were ready to go home.  Jenny put Sammy in her car seat and started to drive home.<br>\r\n<br>\r\nSammy’s tummy felt a little rumble after all that exercise she did today.  She was able to digest that meal faster than she would have if she didn’t move around so much.<br>\r\n<br>\r\nYou felt the familiar pressure of Sammy sitting when you heard a rumble.  You stared (as best you could in the dark) at the dark hole that made that noise.  The hole open a little bit for a couple of seconds as a warm gust blew over you and burned your noise.  You had tears streaming down your face as your noise started to run.<br>\r\n<br>\r\nJenny sniffed the air at an unfamiliar stench.  “Sammy was that you?”<br>\r\n<br>\r\n“Uh huh.”<br>\r\n<br>\r\n“Do you have to potty?”<br>\r\n<br>\r\n“Uh huh,\" she said sheepishly.<br>\r\n<br>\r\n“Can you wait till we get home?”<br>\r\n</span></div></div>",
            "created":1343634660,
            "id":1393218,
            "title":"Traped"
        },
        "122112121":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "choices":[
                "Diaper",
                "Potty"
            ],
            "content":"<div class=\"\"><div> <span>Sammy nodded her head, but it didn’t stop her from letting one rip.  Jenny smelled it and let out a whistle.  She rolled the windows down to let some fresh air in.<br>\r\n<br>\r\nYou were staring at the hole when it opened up and let a monstrous fart out in your face.  The blast blew over your body and made you gag at the smell.  The wind felt hot and humid as the gas burned your eyes and noise.  You started to cry when the hole closed up again followed by a low rumble.  The hole opened seconds after it closed and stayed open as a turd started to slide out toward you.  You screamed your head off and started to wiggle your way away.<br>\r\n<br>\r\nSammy felt the some poop coming out but quickly clenched her inner muscles and forced the log back in.  She was going to wait till she got home; she promised her mommy she would.<br>\r\n<br>\r\nYou let out a sigh of relief as the turd then retreated back into the dark abyss that was Sammy’s ass.  You regretted that because it caused you to breathe in.  Just because it was pulled back doesn’t mean the smell of fresh shit wasn’t hanging in the air.  You went pale as the smell caused you to black out for the rest of the trip home.<br>\r\n<br>\r\nJenny got home and quickly got Sammy out of her chair and into the house so she could go.<br>\r\n<br>\r\n“Ok dear let’s get you to the bathroom before you go in your diaper.”<br>\r\n<br>\r\n“It’s ok mommy I don’t have to go.”<br>\r\n<br>\r\n“But you said you had to go.”<br>\r\n<br>\r\n“It was just gas,” Sammy said with a smile.<br>\r\n<br>\r\nJenny didn’t know what to say but was glad she didn’t go in the car.  It would have been a long drive back.  “Well if you say so, I’m going to get change into some more comfortable clothes.  I’ll be right out to make some dinner.”<br>\r\n<br>\r\nJenny walked into her room and closed the door to change.<br>\r\n<br>\r\nSammy was left alone and her tummy was hungry.  She didn’t want to wait for dinner and decided to look for a snack to eat.  She opened some drawers and after a while she found what she wanted, a chocolate bar.  She unwrapped it and munched on the entire bar until it was gone.  Satisfied she went to watch some T.V.<br>\r\n<br>\r\nJenny came out of her room and found Sammy watching T.V. she sat down next to her and asked what she wanted for dinner, when she saw the wrapper on the table, “Sammy what is this?”<br>\r\n<br>\r\n“I found some chocolate.”<br>\r\n<br>\r\n“Oh no,” she gasped.<br>\r\n<br>\r\n“I’m sorry mommy I was hungry.”<br>\r\n<br>\r\n“This isn’t just chocolate, this is a chocolate laxative.  You ate an entire bar of chocolate laxatives?”<br>\r\n<br>\r\nSammy didn’t know what laxatives were but she knew what chocolate was.  She smiled and said, “Yep”<br>\r\n<br>\r\nJenny let out a low moan at what her daughter has done.  Almost on cue Sammy’s belly gurgled and bubbled.<br>\r\n</span></div></div>",
            "created":1343719380,
            "id":1394170,
            "title":"False alarm"
        },
        "1221121211":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "content":"<div class=\"\"><div> <span>Sammy’s tummy didn’t feel so good after that chocolate she ate.  She let out some gas which made her feel a little better.  <br>\r\n<br>\r\nYou were just waking up from your black out when Sammy farted again.  This woke you up completely; like a slap to the face.  You still were stuck in your usual spot; in between two walls of flesh.  The air was still fresh with the smell of gas after Sammy released that stinker.  You needed to find a way out before that log came back and fast.<br>\r\n<br>\r\nSammy just remembered that she had a bug in her diaper.  It was squirming in her butt crack which felt funny.  Sammy was going to let the bug out.  She got off the couch and started to put her hand into the diaper when her stomach protested.  There was no time for that, she had to go.  <br>\r\n<br>\r\nSammy let out a moan as she bent her legs and squatted right there and started to take a massive dump.  Jenny knew that this was going to be a smelly one so she got up and left, leaving you and Sammy together.<br>\r\n<br>\r\nYour world was moving when the walls of flesh separated and you fell out and landed on the diaper.  You didn’t know why until you look around and saw that Sammy was squatting.  There were two reasons why she would do that: the first was to sit down; the seconds was to take a dump.  You wish it were the first.    <br>\r\n<br>\r\n“Sammy let me out!”<br>\r\n<br>\r\nSammy shook her head no, “Sorry mister bug I have to go potty now.  You’ll just have to wait.”<br>\r\n<br>\r\n“You’re going to kill me!”<br>\r\n<br>\r\nEither she didn’t hear you or didn’t care because you heard her grunting heavily.  There was a loud fart that blasted your face for a couple of long seconds.  It was suddenly cut short; you looked up and saw why.  The log that almost got you in the car was back for you.  You tried to get away but to where.  You were in the bottom of diaper which was sloped to the epicenter of the shit.  You had nowhere to go. <br>\r\n<br>\r\nSammy pushed with all her might and felt a turd slide out of her butt and land in her diaper.  She let out a sigh of relief and felt more rumbling.<br>\r\n<br>\r\nYou crawled as high as you could as the log slide out and touched the diaper.  It started to coil around and grow in mass.  You couldn’t go any higher, and the shit was still coming.  It just reached your foot when it snapped off from Sammy’s butt.  You made it; you survived the log of doom.  All you have to do is wait until Jenny changes Sammy and get-<br>\r\nThere was a rumble which cut off your train of thought.  The log had friends, and they were coming for you.  A liquid down pour of sludge fall from Sammy’s asshole as it started to fill up the diaper.  The liquid was a greenish brownish shade as it fell nonstop.  It acted as water as it sloshed out and expanded to fill up all the space as it could.  The smell was ungodly, you would have died from the smell if you weren’t breathing through your noise.  The liquid was washing up to you and touched your leg.  You pulled it back as you felt it; the texture was of wet mud.  It kept coming for you as the level kept rising and rising.  You were up to your neck and the down pour still kept coming.  The diaper was filling fast and you were doing your best to float in the shitty mess.  You were running out of room as you came face to face with Sammy’s ass cheek.  <br>\r\n<br>\r\n“God please make it stop!!!!”<br>\r\n<br>\r\nIt stopped.  You were didn’t have much room but you were alive.  All you had to do now was float in this muck until Sammy got changed.<br>\r\n<br>\r\nJenny heard Sammy stop pooping.  She dreaded this but walked into the room.  The stench made her head spin.  It was appalling and went over to her daughter who looked sad.  “Ok let’s get you changed.”<br>\r\n<br>\r\nYou would have jumped for joy, but you were trying not to drown in shit.<br>\r\n<br>\r\n“Ok mommy, can you pick me up?”  Sammy held her hands out for Jenny to pick her up.<br>\r\n<br>\r\n“What?”  Both you and Jenny said at the same time.<br>\r\n<br>\r\n“Pleaseeeee?”<br>\r\n<br>\r\n“NO NO NO NO,” <br>\r\n<br>\r\nJenny let out a sight, “ok.”  She wanted to make her daughter feel better; she looked so sad.  If picking her up will help then she would.<br>\r\n<br>\r\n“NOOOO!!!”<br>\r\n<br>\r\nJenny reached down to pick up her daughter.  She cupped her on the butt and felt the mess.  She grimaced in discomfort as she felt the shit through the material.  She lifted her daughter up and held her with one arm under her as she carried her to the changing room.<br>\r\n<br>\r\nYou felt the diaper get compressed inward as Jenny’s big hands picked up Sammy.  Her hand pressed the diaper, shit, and you all together up against Sammy’s ass.  The little space you had left vanished as your vision was filled with crap.  You tried to move anywhere but it felt like a building collapsed on you.  You need to breath but all that filled your mouth was shit.  You gagged on it as your vision turned brown…<br>\r\n<br>\r\nJenny started to walk toward the changing room when she thought of Mark.<i> If Mark where here I would make him do this,</i> little did she now you were there and she just killed you under her daughter’s butt. <br>\r\n</span></div></div>",
            "created":1343787720,
            "id":1394888,
            "title":"Messy situation "
        },
        "1221121212":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "content":"<div class=\"\"><div> <span>Not even a second later Sammy jumped off the couch and ran to the bathroom.  She quickly closed the door and pulled her shorts and diaper down.  She found her potty trainer and turned around and sat down on it.<br>\r\n<br>\r\nYou were just waking up when you felt your world moving very fast.  There was some commotion happening and a door closed.  Then you felt more movement as your world opened up from beneath you.  When went tumbling down until you hit the bottom of your new prison with a ping.  You rubbed your head and saw that you were in Sammy’s potty, dear God no!<br>\r\nSammy let out a toot that singled that she was about to go poop.  She never felt so bad and had to go now when she heard a voice coming from under her.<br>\r\n<br>\r\n“Sammy!!”<br>\r\n<br>\r\nSammy got up and turned around and smiled at what she saw; mister bug.  “Hey mister bugs, what are you doing in there?”<br>\r\n<br>\r\n“Never mind that get me out!!” <br>\r\n<br>\r\nSammy smiled, “You didn’t say the magic word.”<br>\r\n<br>\r\n“Please get me out!!”<br>\r\n<br>\r\n“Ok,” Sammy said and reached her hand into get you out.  Seconds before it reached you there was loud gurgle that could be heard as the hand retracted.  “Sorry mister bug I have go poop.”<br>\r\n<br>\r\n“No get me out now!!!”<br>\r\n<br>\r\nSammy stopped listening to the bug.  It was sounding mean right now and she needed to go.<br>\r\n<br>\r\nYour hope was smashed as the little 3 year old sat down on the potty to do what it was intended to do.  There was a noise coming from above you and it sound like humming.  Sammy was humming a tune as you were trapped under her ass.  No sooner did that thought cross your mind when there was a blast of gas that echoed in the bowl.  You were knocked down by the sheer force of the blast as the smell filled the bowl.  You crawled to the back of the bowl to stay away from the log that you saw earlier, knowing full well that it’s coming back.  You heard a grunt above as the said log started to inch its way out and touch down.  The smell of fresh shit filled the bowl as the log started to coil outwards.  It looked like a giant monster as it kept coming and coming, it spread out and got closer to you as the log kept increasing in size.  It final snapped off and fell before it could reach you.  You let out a sigh realizing how dead you would be if that was in her diaper with you. <br>\r\n<br>\r\nYou then remembered you were going to get out because Sammy was done.  You walked around the giant log and closer to the front of the potty so she would be able to see you.  You reached the front and waited, and waited, and waited; still nothing.  What the fuck?  “Sammy you said you let me out when you were done!!!!”<br>\r\n<br>\r\nSammy was sitting on the potty when she heard a voice, she spread her legs and say mister bug right under her.  She gave a mischievous grin and said, “I’m not done.”  With that she out a loud grunt and pushed with all her might.<br>\r\n<br>\r\nYou looked up in horror as you heard what she said.  Her face was scrunched up in concentration as she started to shit some more.  Her asshole, which was closer to you because you thought you were getting out, opened up.  The hole let out liquid shit which poured down the pile of poop and washed down to the bottom of the bowl.  You tried to run away but the shit swept over.  You could hear a giggle from above as Sammy watched you get washed up with her diarrhea.  She scooted forward so her asshole would be directly under you as it continued to pour liquid crap out.  You were pushed around the bowl and felt the shit start to rise higher.  You couldn’t swim in this shit because it was too thick.  There were even bits of food still in her poop floating with you.  You quickly grabbed something to hang on to, you thought it was corn but you can’t tell for sure.  You floated around as the liquid got higher and higher and higher.  It eventual almost filled the bowl as it came to possible 2/3 full.  The shit waterfall stopped and Sammy got off the toilet. You let out a shout for her to let you out.<br>\r\n<br>\r\nSammy felt sooooo much better as she just let the biggest crap out in history.  She got off the toilet to see if mister bug was still alive.  “Sammy down here!!! Now get me out!!!!” <br>\r\n<br>\r\nYou saw Sammy’s face as she frowned at you, “Come on and hurry up!”<br>\r\n<br>\r\n“Why?”<br>\r\n<br>\r\n“Because I might drown!!”<br>\r\n<br>\r\n“Why?”<br>\r\n<br>\r\n“Because I can’t breathe your shit!!!”<br>\r\n<br>\r\n“Why?”<br>\r\n<br>\r\n“… Just get me out!!!”<br>\r\n<br>\r\n“Ok.”  The hand then reached in to pick you out of that hell hole when there was another gurgle and you saw Sammy’s face turn to pain.<br>\r\n<br>\r\n“No NO NOOO!!! GET ME OUT NOW!!!!”<br>\r\n<br>\r\nShe didn’t listen as she turned around and sat down.  You again were right under her asshole as it opened up.  If you thought that her last crap was big this was worse.  The torrent that blasted out of her ass shoved you under the swamp of shit like a rocket, pinning you under the layers of crap that was washing over you.  The flow of crap kept you under the shit as you tried to swim.  The liquid pulled you to the bottom where you got stuck in the original piece of poop she let out in the beginning.  Unable to move and running out of air, you tried to break free.  The force of shit pushing on you got worse and you were being sucked into the turd that had your foot.  Being buried in shit, while drowning in shit, and being shit upon.  The worse way to die…<br>\r\n<br>\r\n<br>\r\nSammy will never eat chocolate again.  Her butt hole felt sore for releasing all that poop caused by that bar of chocolate.  She got off the potty to see if mister bug was still alive, he wasn’t anywhere to be found.  She shrugged, and went to get mommy to see what she did. <br>\r\n<br>\r\nJenny smelled it down the hallway before she reached the bathroom.  Pinching her noise shut she walked in to see the potty almost overflowing.  How could a little girl poop so much?  She shook her head at the sight.  “Are you feeling better babe?”<br>\r\n<br>\r\nSammy nodded.  <br>\r\n<br>\r\n“Well I know this is a girls day but… why don’t we go get Mark to clean this up?”<br>\r\n<br>\r\nSammy smiled and said, “OK!”  <br>\r\n<br>\r\nThey both walked out the bathroom to go get their neighbor to help clean up Sammy’s little mess.<br>\r\n<br>\r\n</span></div></div>",
            "created":1343930340,
            "id":1396117,
            "title":"Toilet troubles"
        },
        "122112122":{
            "author_id":"jesusjesus1992",
            "author_name":"jesusjesus1992",
            "content":"<div class=\"\"><div> <span>As if to answer her mother Sammy let out a loud wet fart.<br>\r\n<br>\r\nJenny had to let a window down due to the atrocity of the smell.<br>\r\n<br>\r\nYou saw the hole open and a blast of hot air pushed you away.  The fart had enough force to get you out of her crack and land in her diaper.  Before you could move something wet splashed onto your chest.  It smelled like shit.  You wipe it off and found out it is shit; Sammy’s wet fart let some out.  The smell made you threw up as you try to find a way out before she takes a dump.  You scream as loud as you can hoping someone would hear you but the wind from the window covered your voice.<br>\r\n<br>\r\nSammy could feel her meal coming to an end.  Her belly let out a rumble to let her know it was time to push, and push is what she did.<br>\r\n<br>\r\nThere was no way out going up so you had to hope you could get out between her legs.  You crawled forward and prayed the diaper around her legs had a gap.  You were halfway there when there was an ominous noise above.  You heard Sammy give a grunt which followed a quick burst of farts then you heard it.  She was using the bathroom now.  You moved as fast as you could as the smell was catching up to you.  The smell hit you and you knew this was going to be a horrible diaper to be in if you can’t get out.  You made it to the legs where the diaper ended and tried to squeeze through.  The diaper was waterproof, which prevented liquids (and you) from getting out.  Shit you thought as you turned around and saw it.  An avalanche of brown liquid was slowly sliding toward you.  You were trapped between Sammy’s legs with a diaper at your back and tidal wave of shit bearing down on you.  You desperately attacked the diaper to get out; nothing.  You tried to warn Sammy by attacking her leg.<br>\r\n<br>\r\nSammy was releasing the mother of all craps when she felt a tingle on her leg.  “Oh mister bug I forgot about him.  Well you shouldn’t play in other people’s diapers, especially if they had tacos.”  She let out a giggle then pushed with all her might to empty her bowls.<br>\r\n<br>\r\nThe wall of shit was a few feet away from you when you heard what Sammy said.  You couldn’t believe it.  The girl you babysat for years, the one you took care of for Jenny, was about to cover you in shit.  The wall didn’t move an inch.  Did she stop?  Then the wall continued to slide ever so slowly forward.  The shit covered your feet preventing you from running.  Then the liquid started to rise higher and higher.  You felt chunks of shit or food hit your lower body that was submerged in the sludge.  Then the liquid stopped moving for good.  The wall of shit was dissipating out to the side to fill the diaper.  You were still stuck but the threat was gone.  You let out a happy laugh, you were safe.<br>\r\n<br>\r\nSammy just finished her dump of doom.  She let out a sigh of relief after removing all that pressure from inside her.  But there was a problem.  She felt uncomfortable in her diaper.  She wiggled her hips then moved her butt around in her car seat to get a better seat.<br>\r\n<br>\r\nYou were trying to get out of your trap of shit covering up to your waist when you felt some movement.  The movement increased as your world was shifted around.  That’s when things turned bad.  Your world was getting small as the walls around you compressed.  All the shit was sliding back down to the bottom of the diaper, along with you.  You scream for help as you slide into the shit pool of crap filled with Sammy’s leftovers.  You sank in up to your chest.  You were unable to move in the filth that restricted your movement then the sky descended on you.  You were right under her butt cheeks again as she was sitting down.  Her ass pushed you under her crap forcing you to the bottom.  The liquid filled you noise and mouth making you gag and swallow it.  You couldn’t move at the bottom of the diaper filled with shit.  You were stuck under the ass of a 3 year old drowning in her shit, and this is the last thing you heard through the diaper:<br>\r\n<br>\r\n“Whoa, it smells like someone died.” Jenny said  <br>\r\n<br>\r\nSammy let out a giggle, “But someone did die mommy.  I killed a bug in my diaper.”<br>\r\n<br>\r\n“Well that’s good.”<br>\r\n<br>\r\n<br>\r\n<br>\r\nA couple of hours later Jenny was changing Sammy's diaper.  She quickly glanced at the mess and saw just how bad she had to go.  \"No more tacos for you,\" she said under her breath as she threw away the diaper. <br>\r\n<br>\r\nShe then took a wipe and wiped Sammy's butt of the poop when she came across the bug.  <br>\r\n<br>\r\n\"That is one ugly looking bug.\"  She wiped your dead body off her daughter's butt cheek and threw you away with the rest of the shit.<br>\r\n</span></div></div>",
            "created":1343668620,
            "id":1393460,
            "title":"The car ride home"
        },
        "123":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "Get help from Jenny",
                "Get help from Lynn",
                "Get help from Lincoln"
            ],
            "content":"<div class=\"\"><div> <span>Through the hallway, you can see two kids, estimated to be around 11 and 13 years old, running towards Jenny with tired smiles on their faces. You manage to dodge their feet before they unknowingly stomped on you.<br>\r\n<br>\r\n\"Hey mum!\" exclaimed a white-haired boy and brown-haired girl, both in athletic sportswear, \"We're back from soccer practice!\"<br>\r\n<br>\r\nJenny smiles at her younger son and older daughter as they start taking off their shoes and socks near the front door. The two siblings hug their mum and in return, hugs them back, \"How was your afternoon today?\"<br>\r\n<br>\r\n\"It was alright,\" the girl responded sounding a bit proud, \"We were picked at team captains, and I beat Lincoln's team.\"<br>\r\n<br>\r\n\"Yeah, but that was because you had Jeremy on your team,\" Lincoln complained, annoyed that she was rubbing it in his face, \"It's not fair that you got first pick!\"<br>\r\n<br>\r\n\"Have you ever heard the term <i>ladies first</i> Lincoln?\" Lynn teased, \"Because that's exactly what I did this afternoon.<br>\r\n<br>\r\n\"Oh right, I'm so sorry for your loiss Lincoln,\" Jenny responded, which elicted a groan from Lincoln, \"Don't worry, you;ll probably beat your sister next week!\"<br>\r\n<br>\r\n\"Fat chance,\" his sister Lynn remarked, teasing his younger brother by sticking her tongue out. Retaliating, Lincoln stuck her tongue out as well in a mocking manner.<br>\r\n<br>\r\n\"It's been a long day today so you two better get some rest,\" Jenny suggested, letting the two kids go. However, a second later, their mum stopped them in their tracks.<br>\r\n<br>\r\n\"One more thing before you go. Have you seen Mark today? He was supposed to be watching you.\"<br>\r\n<br>\r\n\"Sorry mum, we haven't.\"<br>\r\n<br>\r\n\"Yeah,\" Lincoln added, \"I doubt he would've been in the school oval.\"<br>\r\n<br>\r\n\"Okay, thanks you two,\" Jenny said as the two kids walked off to their respective rooms, to do their lesurely activities. Once they were gone, Jenny got out her smartphone and started to try and call you. Predictably, she got put through the answering machine, prompting her to hang up. In the meantime, you tried to yell out, hoping that she'll hear but there was no reaction.<br>\r\n<br>\r\n\"Where could he be?\" Jenny said to herself, checking her watch for the time, \"I need to go in five minutes!\"<br>\r\n<br>\r\nAfter some frustration, she left the room and walked over to the kitchen. Now what? You should probably get help from Jenny but the kids rooms are closer to your position. However, you're not entirely sure if they'll help you, even if you did develop a strong connection with them.</span></div></div>",
            "created":1480662720,
            "id":2244639,
            "title":"Children "
        }
    },
    "info":{
        "author_id":"jesusjesus1992",
        "author_name":"jesusjesus1992",
        "brief_description":"You go to check on your next door neighbor's kid, only to shrink.",
        "created":1339568280,
        "description":"<td align=\"left\" class=\"norm\">You live next to a beautiful women who is a single parent.  You have know her for a while and her kid(s).  You have developed a strong connection between them and usually drop by to check up on them.  One day you go to see them and you shrink.<br>\r\n<br>\r\n</td>",
        "id":1873411,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1480662720,
        "modified":1480662720,
        "pretty_title":"Next Door Neighbors"
    }
}