{
    "chapters":{
        "1":{
            "author_id":"darkluke",
            "author_name":"Fitzroy Clement",
            "choices":[
                "The Kidnapping",
                "The Initiation",
                "The Mission",
                "Something else",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in the story do we begin?<br>\r\n<br>\r\nI encourage everyone to write their own interpretations of the characters, and to veer off in different directions.</span></div></span></div>",
            "created":1271388660,
            "id":868756,
            "title":"Prologue"
        },
        "11":{
            "choices":[
                "The Journey",
                "The Arrival",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Yet another day, walking out the door of my average apartment into a chilly winter day. A blue jacket and hat saving what was left of my assaulted body heat as I walked along the Grey, industrial wasteland that led the way to my job at the mill. This however was not a normal day, as I would find out seeing that when I approached the battered, red brick wall littered with spray painted insults and boasts I saw a unmarked, Grey van which looked like it was about to fall apart. Even then, I thought nothing of it just another delivery truck making it's rounds or a friend visiting another who lived in that particular building. I walked past the van and continued on my way until I heard the door of the van sliding and the clack of high heeled boots following me. Before, I could turn around I felt a pain in my neck that made my whole body go numb, despite this I could still see and was surprised to see a group of women in tight, leather jumpsuits (like those secret agents wear) were responsible for my attack. They drug me into that van and although my vision was unfaltering, my hearing faded and came back, faded and came back. When I tried to speak it came out bumbling, gibberish from what I could hear, so I even stopped attempting that. I sat viewing the world, not as a participant but as a passenger to a unknown fate.</span></div></div>",
            "created":1289148000,
            "id":989031,
            "title":"The Kidnapping"
        },
        "14":{
            "choices":[
                "He has a strange, new desire to dress and act as a woman.",
                "He discovers his body is slightly softer and more feminine now.",
                "He is being restrained and forced through a \"re-education program.\"",
                "He is unchanged, but compelled to obey everything a woman orders him to do.",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>A man walks down the street, unaware of a curious fate about to befall him.<br>\r\n<br>\r\nHe's an ordinary man, of average height and build.<br>\r\n<br>\r\nA middle-aged man simply on his way to work one day, choosing to go by foot rather than by car. <br>\r\n<br>\r\nA choice he would soon come to regret.<br>\r\n<br>\r\nBehind him, two curious women followed. <br>\r\n<br>\r\nThe first was a tall dark-haired woman with hair tied back in a sternly tight bun. She wore a green turtleneck sweater, a long brown skirt, and a pair of brown boots. She carried a big leather handbag slung over one shoulder. On her face, she wore a bitterly austere expression.<br>\r\n<br>\r\nThe second woman was a short, squat woman with fiery, long curled hair strewn wildly about her shoulders. She wore a pale periwinkle sweater, a pair of tight black pants, and a set of low heeled ankle boots. She carried a small, blue leather purse and wore a hard, flinty expression on her own face.<br>\r\n<br>\r\n“An acceptable target, Ms. Tree?” the short woman asked.<br>\r\n<br>\r\n“A most acceptable target, Ms. Take,” agreed the tall woman.<br>\r\n<br>\r\nThe duo quickened their pace and began approaching the unwary, hapless man from behind.<br>\r\n<br>\r\n“Excuse me sir,” said Ms. Tree. “I believe you dropped this.”<br>\r\n<br>\r\n“Here you are sir,” said Ms. Take. “I believe this is yours.”<br>\r\n<br>\r\nThe man turned around in confusion and looked at the pair of strange women. He was quite certain he hadn't dropped or lost anything.<br>\r\n<br>\r\nIn that fraction of a second it took for him to face the women with a frowned look of perplexed bemusement, the man suddenly felt a painful stabbing sensation in his arm.<br>\r\n<br>\r\n“What did you just …” he started to say, before crumpling to the ground unconscious.<br>\r\n<br>\r\n“It looks like he couldn't stand it, Ms. Take,” observed Ms. Tree gazing down at the man's drugged body.<br>\r\n<br>\r\n“Yes. It only stands to reason, Ms. Tree,” concurred Ms. Take.<br>\r\n<br>\r\nTogether, the two women lifted the sedated man by hoisting his arms over their shoulders. With surprising strength and agility, the duo navigated the man's numbly unresponsive body down the street, around the corner, and through the entrance to an ordinary, nondescript looking storefront.<br>\r\n<br>\r\nAs the women brought the man's body inside, they were greeted by a short, thin woman with jet black, Bettie Page style hair. She wore a brown, tweed skirt suit with a pair of brown, chunky heeled shoes. Moving quickly to lock the storefront's door behind the visitors, she next cleared off a display counter top in the store. <br>\r\n<br>\r\n“Put him here,” she said quietly.<br>\r\n<br>\r\nMs. Tree and Ms. Take immediately complied, stretching the man's now snoring body out atop the counter. <br>\r\n<br>\r\n“Is he good for your purpose?” asked Ms. Tree.<br>\r\n<br>\r\n“Will he serve our ends?” asked Ms. Take.<br>\r\n<br>\r\n“He'll do,” said the woman in the tweed skirt suit.<br>\r\n<br>\r\nShe rummaged around in the man's pockets, finally retrieving a wallet. <br>\r\n<br>\r\n“He won't be needing this any longer,” she said after briefly pausing to read the man's identification. “He'll have an entirely new name in a few moments. A new life, a new identity, a new purpose.”<br>\r\n<br>\r\n“We should bring in the equipment, Ms. Tree,” said Ms. Take.<br>\r\n<br>\r\n“Yes, we should bring in the equipment now, Ms. Take,” agreed Ms. Tree.<br>\r\n<br>\r\nAs the duo left the room, the woman in the tweed skirt suit dropped the man's wallet into a metal wastebasket full of shredded paper, then tossed a lit match in behind. <br>\r\n<br>\r\n“A whole new purpose awaits you my friend,” she said the unconscious man. “We have a <u>most</u> important mission for you to undertake.”<br>\r\n<br>\r\nWhen the man awakens … </span></div></div>",
            "created":1359947040,
            "id":1523879,
            "title":"Something else?"
        },
        "143":{
            "choices":[
                "More programming ",
                "First Mission ",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>The man awoke and immediately knew something was wrong. On a biological level, his body had switched from pumping out testosterone to estrogen in half an hour. This reworking and rewriting of a person's DNA was something thought to be impossible however, in the same half an hour time frame the man could no longer be called such. By some means, reproductive organs had been reversed, pubescent afflictions had been skipped and the man had become a fully grown woman. Now although he did not known this yet, he would soon as the women responsible for his abduction entered the chamber. <br>\r\n<br>\r\n\"Ms. Jones looks quite beautiful today, don't you think Ms. Take?\"<br>\r\n\"Yes, I do Miss Tree.\"<br>\r\n<br>\r\nThe new woman found herself groggy for a moment, until she realized that she was standing. Not only that, but she couldn't move, it seemed her body was frozen in attention while her mind was no longer in control of the movements of her body. <br>\r\n<br>\r\n\"You did very well on the subliminal commands Miss Tree. She has yet to move out of her attention.\"<br>\r\n\"Thank you very much Miss Take. Shall we begin to show her what she can do?\"<br>\r\n\"That would be very good Miss Tree.\"<br>\r\n<br>\r\nWait, \"she,?\" \"Her?\" The new woman's mind scrambled to figure out what they meant. Surely they didn't mean her, because she was a man. <br>\r\n<br>\r\n\"Miss Jones, could you please get ready for the party?\"<br>\r\n<br>\r\nAnd with that phrase, the body began to move as the mind struggled to exert any sort of will into the bodies decisions. Walking to the other side of the room to the left of a table with several medical instruments, mainly what looked like what would be usually used in checkups as well as a tape recorder with headphones. As soon as the body was parallel with this table it resumed it's attention position. <br>\r\n<br>\r\n\"Oh, yes Miss Jones. You move beautifully. We just had to change your body around, you'll be a proper woman yet,\" Miss Take said. \"And for your information Miss Jones, yes it's your body. Just better. Right down to your birthmark on your left thigh or the scar under your back from when you fell out of the tree at the age of 6.\"<br>\r\n<br>\r\nHow did they know that? Her mind scrambled to find any sort of sense in all of this and it was drawing blanks all the way. <br>\r\n<br>\r\nMiss Take walked away then chuckled to herself, walking back over to the woman. \"Oh, how rude of me! Miss Jones, please meet our guest!\"<br>\r\n<br>\r\nThe body turned to a mirror and the man's mind couldn't believe it. The reflection was that not of a middle aged man, but of a beautiful woman whose expression was that of a neutral scowl as he struggled to make a face, anything but to no avail. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://chethondo.files.wordpress.com/2008/08/miller2tni1904_600x9022.jpg\" target=\"_blank\">http://chethondo.files.wordpress.com/200...</a><br>\r\n<br>\r\n\"Aren't you glad we made you so pretty Miss Jones?,\" Miss Take said.<br>\r\n\"Yes, Miss Take. Thank you so much for this. I will not let you and Miss Tree down.\" A monotone voice exited Miss Jones larynx without the mind's permission. As the mind was screaming, the body offered a small smile with that statement. </span></div></div>",
            "created":1375864320,
            "id":1641984,
            "title":"A Better Woman achieved through chemistry "
        }
    },
    "info":{
        "author_id":"darkluke",
        "author_name":"Fitzroy Clement",
        "brief_description":"You're a man who is kidnapped by a secret cabel of  women, and turned into a secret agent",
        "created":1271388480,
        "description":"<td align=\"left\" class=\"norm\">You are a man who is one day kidnapped by a group of vaguely familar women. They overwhelmed you physically, drugged you, and when you wake up, they are in the middle of turning you into a brainwashed operative for their sinister plot of worldwide matriarchal domination. Of course, they turned you into a female too, in order to faithfully carry out your missions. <br>\r\n<br>\r\n<br>\r\nNote: You are aware of everything that is happening, but are artificially inhibited via alien genetic technology the cabel is using from using your free will. This is done to force you into carrying out your missions, and to trick yourself into thinking you've always been a female.</td>",
        "id":1664934,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1375864320,
        "modified":1375864320,
        "pretty_title":" Her Majesty"
    }
}