{
    "chapters":{
        "1":{
            "author_id":"murph1204",
            "author_name":"smurf1204",
            "choices":[
                "You",
                "geoff",
                "harold",
                "duncan",
                "owen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who will be the shrunken person that will be stuck with Izzy</span></div></span></div>",
            "created":1368874140,
            "id":1592077,
            "title":"The start"
        },
        "11":{
            "choices":[
                "Shrinks you ",
                "Kidnaps/traps you",
                "Hypnotizes you",
                "Unaware torture",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she torture you?</span></div></span></div>",
            "created":1384305120,
            "id":1693505,
            "title":"You"
        },
        "111":{
            "author_id":"helathpack",
            "author_name":"PrincePeel",
            "choices":[
                "Her Cleavage",
                "The Bed",
                "Her Feet"
            ],
            "content":"<div class=\"\"><div> <span>You start to open up your eyes slowly and let them adjust to the light. But when your eyes have fully adjusted you jump in shock from the giant face of a girl looking at you.<br>\r\n<br>\r\nSeeing that you've have awoken she starts to laugh and says<br>\r\n<br>\r\n\"Well it's nice to know my machine didn't kill ya'.\"<br>\r\n<br>\r\nYou then notice that your sitting in the palm of her hand and you starts to freak out more<br>\r\n<br>\r\n\"WHAT DID YOU DO TO ME!\" you shout at her, to which she laughs in response<br>\r\n<br>\r\n\"I shrunk you DUH!!\"<br>\r\n<br>\r\n\"WHY!\"<br>\r\n<br>\r\n\"Because...\" she quickly squeezes you in her hand so that only your head and shoulders and sticking out \"I need a new play thing\"<br>\r\n<br>\r\n\"P-Play thing?!\"<br>\r\n<br>\r\n\"Yup! Now lets begin\"<br>\r\n<br>\r\nShe then starts to move here hand towards.... </span></div></div>",
            "created":1443392940,
            "id":2040604,
            "title":"Shrinks you "
        },
        "1112":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "\"Kiss My Ass\"",
                "\"Smell This Fart\"",
                "*Readers Choice*"
            ],
            "content":"<div class=\"\"><div> <span>Izzy moves her hand towards the bed and places you on it. \"What are you going to do with me?\" You asked her but then, Izzy jumped up and and landed and sat on you when she landed on the bed. \"MMMMPH!\" Was what you screamed under her due to the pain that she had inflicted on you. \"Aaaah, I think you're going to be a good seat cushion.\" Izzy said as you tried to squirm and escape when she said that, only for Izzy to lift her butt up and slam it back down on you hard. \"Uh uh uh, You're not going anywhere!\" Izzy would say as she started to grind her big rear on you very harshly. \"MMMPH MMMPH!\" You tried to scream, kick, or do anything to get this crazy woman off of you, but nothing would work and you were way too weak. <br>\r\n<br>\r\n\"Ok, since your going to be under there for awhile, i want you too...\"</span></div></div>",
            "created":1560796080,
            "id":2674819,
            "title":"The Bed"
        },
        "1113":{
            "author_id":"pro1234",
            "author_name":"ryan finn",
            "content":"<div class=\"\"><div> <span> you will be my tiny foot slave *no* well if you dont i will crush you bug yeah your a feet loving bug * i do not love feet *runs away* where are you going *traps him between her feet* you will...no i will trap you in a world where my feet surrounds you in a circle *NO WAY IM ENTERING THAT PORTAL*  *forces you into the portal HAHAHAHA MY FEET WILL TRAP YOU FOREVER  you bug bug buggy bug *iwill not lick anything* OH really * her toes force the tougne* why? becuse its fun watching you suffer around my big feet lets see how long you SURVIVE *oh no* izzy presses her foot down nearly crushing him your bones start to slowly brake* HAHAHAHAHA NOW TO CRUSH YOU BUG BUG BUG BUG BUG YOUR A FEET LOVING BUG HAHAHAHAHA*damm it* crushes him* well i hope he enjoyed it</span></div></div>",
            "created":1553555220,
            "id":2634828,
            "title":"Her Feet"
        },
        "114":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "\"Fart\"",
                "\"Keep rubbing my butt on this chair.\"",
                "She realizes she's sitting on something."
            ],
            "content":"<div class=\"\"><div> <span>You wake up, not remembering what happened to see that you are shrunken down and that you are on someone's chair too. You then see a orange haired girl walk into the room and is about to sit on you.<br>\r\n<br>\r\n\"Hey, wait a minite! Don't si-\" Don't sit on me was what you were about to say when the orange haired girl wearing green sat on you. You were not dead surprisingly, but you couldn't speak as your words were muffled due to being under the girls ass.<br>\r\n<br>\r\n\"This chair is really comfortable today!\" She as she began unwittingly rubbing her butt on you. \"It feels so good that I might..</span></div></div>",
            "created":1548982380,
            "id":2610741,
            "title":"Unaware torture"
        },
        "1143":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "\"Man!\"",
                "\"Girl!\"",
                "\"Bug! Eww...\""
            ],
            "content":"<div class=\"\"><div> <span> As Izzy keeps grinding her big butt on you, you start squirming around under her to escape from her heavy rear end. As you were doing so, she starts to feel you moving under her ass. \"Wait a minute, something feels... weird.\" Izzy says as she stops rubbing her butt on you and then slowly rubs her butt on you again to check and see if she is sittin on something. Izzy then starts to get up and then she turns around to see you on the chair and you feel like a huge weight is off of you (both figuratively and literally).<br>\r\n<br>\r\n When Izzy gets up, the first thing she says is \"Oh my god, it's a tiny....\"</span></div></div>",
            "created":1560799860,
            "id":2674837,
            "title":"Sitting on something  (or someone)"
        },
        "11432":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "Nothing. She dropped you back on the chair.",
                "\"Relax, I'm joking. I'll help you!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my god a tiny girl, Is it a doll?\" Izzy asked while picking you up from the chair and started poking your breasts and chest. \"Looks and feels real.'\" Izzy said, but before you could talk, Izzy licked your small face to see if you were a doll or not. \"She taste so real too.\" Izzy continued, you had enough. \"H-Hey, could you stop and help me For a second!?\" You would ask as she keeps you in her hand. \"You ARE real! How did you get so small?\" Izzy asked. \"I don't know, now could you help how I got like this?\" You asked her. \"Hmm, I would, but you were so dang comfortable when I sat on you!\" When she said that, your heart sank and you felt you should run, only you can't.<br>\r\n<br>\r\nIt would be that Izzy would say...</span></div></div>",
            "created":1560810780,
            "id":2674895,
            "title":"You're a Girl!"
        },
        "114321":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "She said \"How about I get someone to have fun wih you also?\"",
                "Izzy had some more gas."
            ],
            "content":"<div class=\"\"><div> <span>Actually, she didn't say anyhing. She just dropped you back on the chair without a second thought. You landed on your back when landed the chair with such great pain. When you opened your eyes, a green southern mountain was covering your view and you were about to get sat on by Izzy again. Then the mountain hit, and you were greeted with also of butt smothering by the crazy girl again.<br>\r\n<br>\r\n Rub and rub and rub was what she doing to you for quite awhile and quite harshly. 'Why is she doing this to me, and what did I do to deserve this!?' Was what you were trying to think, but Izzy's hard butt rubbing torture was making hard to think and more painful than anything. \"How are you doing back there tiny lady?\" She would ask, continuingto rub her big butt on you nonstop. \"How did you become so comfortable, is it one of those lotions women put on to keep there skin from dry in or is it that women are more comfortable than men are, or maybe...\" Not only were you being assaulted by her grinding her butt on you, she also talked as much as she was doing this. The thing you experiencing was hell, and it was going to get much much worse.<br>\r\n<br>\r\nAs she was still making your life a living nightmare by butt grinding with such great force, she stopped for a second and you felt hernbutt rumbling. \"Uh Oh, might wanna hold your breath!\" Izzy said, you didn't think she would be crazy enough to- Actually nevernind. 'She wouldn't da-' You thought, only to be met with a powerful stinky wind blowing towards your nose. \"MMMPH MMMPH!\" You muffle screamed under her butt the instant you smelt her gas. \"Whoops, my bad. You were so comfortable that I ended up getting gassy and farted on you, but a small girl like you can handle a bit of gas, I know someone who can rip one better than I can and hoo-boy they can stink up a forest.\" Izzy said and laughed, giving you no choice but to smell the ungodly smell and started coughing. Then, you heard the unlady like sound again. *PPPFFRRT* Was what you heard and felt her gassy wind in point blank range once more.\" Whew, talk about stinkers, you better still be alive under there!\" Izzy said. You felt like after all the grinding she did and the two point blank unlady like fumes you should be dead. 'Did someone who made me small also make my body immortal' you thought, but that thought was interrupted by Izzy grinding her butt on you again for a little, destroying your thought process in under 1 second. It was then she stopped again and...</span></div></div>",
            "created":1560812520,
            "id":2674902,
            "title":"BACK TO DA CHAIIIIIÌR!"
        },
        "1143212":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "You then wake up, seeing other tiny woman being tortured.",
                "You then woke up, in a jar."
            ],
            "content":"<div class=\"\"><div> <span>It was then that Izzy ripped another point blank fart on you, causing you to have a great face of disgust,  not being able to breathe fresh air nor even cover your nose. \"PLEASE GET OFF OF ME!\" You tried to say, but your words were muffled and they came out as \"MMM MM M MMMMPH!\"  \"Uh Oh, I feel kinda gassy, It's ok, you're GREAT to let it loose on, I should show you- uh oh *PPPPPFFFFRRRTT* Aaahhh.\" Izzy said, ripping another stinky storm point blank on you again without a care in the world. Izzy then ripped another one, making the smell much more worse for you, It was like she was forgetting that you are a human being. Through all the gas she used to assault your nose,you were feeling sleepy and was beginning to black out from the bad smell she was giving you. You were too weak to move and was beginning to close your eyes, you wished that you didn't want to wake up.<br>\r\n<br>\r\nYou then closed your eyes after getting a big whiff of the horrid stench she put you through.</span></div></div>",
            "created":1560814080,
            "id":2674907,
            "title":"From Seat Cushion to Fart Slave"
        },
        "11432122":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "Farted in the jar.",
                "Took you out of the jar."
            ],
            "content":"<div class=\"\"><div> <span>You slowly open your eyes to feel that you've laying on something hard. When you fully open your eyes and fully awake, you instantly see a lid with holes on it. You then knock on the hard surface and feel glass. From the looks of it, you were in some sort of jar, and it didn't taken long to find your captive as she was right there holding the moment you awoke.<br>\r\n<br>\r\n \"I see you're finally awake tiny lady, I can't believe it took you 3 days too, you were son fun to fart on too.\" Izzy said. 'Three days, it took me three days to wake up.' You thought to yourself. \"Why, Why are you keeping me here like this, did I do a anything to deserve any of this?\" You asked, you even shed a tear asking it too. \"I have no reason, It's just fun!\" Izzy responded. \"Fun, what kind of fun is too be had with a tiny woman like myself or anyone who would be shrunk like I am.\" You protested, then Izzy shook the jar. \"W-W-W-WOAHHHH\" You screamed, being shook by the giant crazy girl. \"Actually there is alot to be fun with you!\" Izzy said nonchalantly. This would get you worried so you tried your best to brace yourself as Izzy...</span></div></div>",
            "created":1560832140,
            "id":2675039,
            "title":"The Jar."
        },
        "114321221":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "Izzy came back",
                "You tried escaping."
            ],
            "content":"<div class=\"\"><div> <span>Izzy would then take the jar and open the lid. \"Huh? You're letting me out?\" You asked. She then laughed. \"Ahahaha, no silly! Though it might get a liiiittle stinky in there.\" Izzy said as she moved the jar you were towards her rear. She then pressed her butt on where the lid is suppose to be, only letting you see Izzy's massive butt. It didn't take you very long to know what she was going to do. \"Izzy.... Izzy DON'T\" YOU scream, but it was too late as the smell of the gas Izzy just produced surrounded the jar you were in. The air was suffocating in it and the smell was everywhere. You were covering your nose and your eyes were water in from the giant stench.<br>\r\n<br>\r\n'Aaaah, That feels much better.\" Izzy says, bringing the jar you were in close to her face. She then closed the jar by putting the lid back on it, essentially trapping you with the smelly air she produced. \"*cough* *cough*, it stinks, let me out of here!\" You demanded. \"Uh uh uh, not with that attitude, I think leaving you in that jar should teach you some manners.\" Izzy said. She then left put the table and left the room both of you were in. \"IZZZY *cough*!\" You screamed as she left you alone  in the room.<br>\r\n<br>\r\nAfter 30 minutes of being in the Jar that was filled with nothing but Izzy's fart.</span></div></div>",
            "created":1584567240,
            "id":2803381,
            "title":"Farted in the jar."
        },
        "15":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "Owen",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Owen or someone else?</span></div></span></div>",
            "created":1584558420,
            "id":2803348,
            "title":"owen or..."
        }
    },
    "info":{
        "author_id":"murph1204",
        "author_name":"smurf1204",
        "brief_description":"You get shrunk by the crazy girl from total drama island ",
        "created":1362399480,
        "description":"<td align=\"left\" class=\"norm\">you wake up shrunk by heather <br>\r\nYou are shrunk in this story<br>\r\nshe can be any kind of giantess you want<br>\r\nPlease add</td>",
        "id":1922281,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584567240,
        "modified":1584567240,
        "pretty_title":"total drama shrunk by izzy"
    }
}