{
    "chapters":{
        "1":{
            "author_id":"jtp17177",
            "author_name":"jman",
            "choices":[
                "Marc, a 24 year old ",
                "Dana, a 19 year old",
                "John, a 21 year old",
                "Jenny, a 31 year old",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>You can't believe it. You got the letter from your superior, and you are still in shock. You have been transferred to S Company, the worst in the US Army. You begged to stay, but were denied. You had to parachute in, as no helicopter would land there. Company S wasn't regulated by the army, so no rules were enforced. You didn't have to shower, change clothes, wear clothes, or do anything. It was half men, and half women. But, rumors say the women are worse than the guys. And on top of all this, you have been shrinking 2 inches a day. Who do you meet first?</span></div></div>",
            "created":1257302700,
            "id":786745,
            "title":"Bad News"
        },
        "11":{
            "author_id":"jtp17177",
            "author_name":"jman",
            "choices":[
                "Lt. John Vasquez, company leader",
                "Nurse Jan, Base medical specialist",
                "Jake, a young new recruit like yourself"
            ],
            "content":"<div class=\"\"><div> <span>You are greeted by a male in fatigues. \"Welcome to S Company, I'm Corporal Marc Johnson, your new tent mate and guide. Got any questions?\" \"I do actually. Is it safe here, and can you help me?\", you ask. \"It's very safe if you don't piss anyone off, and what's your other problem?\" \"This may sound ridiculous, but I've been shrinking a few inches everyday. Yesterday, I was 6'1'', today I'm 5'6''.\" \" Wow, you're having the same problem as me! I'm shrinking too. Sucks don't it?\" \"I'm glad I  won't go through this alone.\", you say. \" The problem is if we get too small, well...\" \"Well what? \" Well, lets just say you don't want want to get too close to feet around here\" Just then someone walks in.</span></div></div>",
            "created":1273008840,
            "id":878170,
            "title":"Marc, a 24 year old "
        }
    },
    "info":{
        "author_id":"jtp17177",
        "author_name":"jman",
        "brief_description":"Company S is not bad, it is real bad.",
        "created":1250708820,
        "description":"<td align=\"left\" class=\"norm\">You were transferred to S Company, the worst in the Army.<br>\r\nNo hardcore content, try to keep it 18 and under.</td>",
        "id":1592461,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1273008840,
        "modified":1273008840,
        "pretty_title":"S Company"
    }
}