{
    "chapters":{
        "1":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Anthro",
                "Feral",
                "You're feral and they're anthro",
                "You're anthro and they're feral"
            ],
            "content":"<div class=\"\"><div> <span>Well, you've been sold off. Apparently, you were such a good worker from where you're from, you attracted the attention of some very rich farms. So, your old farm decided to sell you off when offered a generous sum of money. So, now you're on a truck, being carried off to this new farm. Though, before you reach it, a few questions need to be answered.<br>\r\n<br>\r\nFirst, are these feral animals, or anthro animals?</span></div></div>",
            "created":1539147600,
            "id":2561885,
            "title":"The First Day of the Rest of Your Life"
        },
        "11":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Horse",
                "Bull",
                "Pig",
                "Lamb",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, this is a world with anthro animals. That means being able to walk around like a person. Now, mister, what kind of animal-person do you think you are?</span></div></span></div>",
            "created":1539149400,
            "id":2561888,
            "title":"Anthro"
        },
        "111":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Check out the Barn",
                "Look at the Stable",
                "Hang out near the Pen",
                "Introduce yourself to the main house"
            ],
            "content":"<div class=\"\"><div> <span>You were a very tough horse, especially for your size! Next to a grown adult, you'd measure up to their hips. Despite this, you're known to run for 3 hours a time, capable of lifting someone twice your size! Who knows how much you can lift when you're fully grown! Guess the new farm is gonna find out (hopefully). You're a chocolate brown horse with a darker muzzle. You felt extremely nervous about going out here, but your old barn-mates assured you this'd be for the best. If they spent as much as they had on you, then they must've bought you with the full intention of doing everything to keep you up to snuff!<br>\r\n<br>\r\nSoon, you felt the truck stop. Then, light poured in as the back the truck opened up, allowing you safe passage out. You gently stepped out, and walked around. You were hit with the smell of the farm. It was sort of familiar to you, having lived on one since you were born, and yet this smell was alien to you. You felt the urge to cover your nose as you stepped towards the white house in front of the truck, surely the living space of the farm owner. You see your previous owner speaking with the new owner, them bearing white and gray hair respectively, overalls you'd see on a stereotypical farmer, and a red and blue tweed shirt respectively. <br>\r\n<br>\r\nThe two of them were shaking hands, and nodded to each other. Then, your owner stepped away from him, and back towards his truck. As he passed by, he brought up a hand and gently ruffled the top of your head. \"Good luck, bud,\" he said as he stepped back into his truck. Then, you watched as it reversed out of the driveway, onto the road, and away, and you were still trying to digest the idea that that'd be the last you'd see of him. Meanwhile, the new owner stepped up behind you.<br>\r\n<br>\r\n\"Welcome to my farm!\" he declared to you. \"I'm Mr. Sybill! I'm gonna feed and groom you each day, and you just have to play nice with your fellow animals. If somethin' is starting to go south, feel free to speak to me.\" He spoke like a friendly old grandpa, immediately trying to get you more acquainted with your new home. \"My down the path by my house. I can lead you there if you wish.\"<br>\r\n<br>\r\n\"N-no thanks, I think I can follow it on my own,\" you said. Sybill shrugged, and walked towards his house. Then, you began to go down the path he described. As you walked down, you began to see a barn just like any other, red and white with a great big silo on one side. Next to it were several pens, and you could see other animals within them. You could also see some stables near the barn, which naturally drew you towards it. Though, wouldn't it get kinda boring talking to more horses again?<br>\r\n<br>\r\nBefore you could consider that further, the form of a cow suddenly filled your sights. Just like you, she was standing upright. She appeared to be a grownup, explaining why you measured up to her navel. She was white with black spots, and seemed to bear an hourglass figure. Like any other cow, her breasts were big, supporting quite a bit of milk. You remembered the cows at your old farm, but your old owner didn't like the animals mingling, so you didn't often get to speak with the cows. Good for you, considering how they usually boasted a form that made you feel funny.<br>\r\n<br>\r\n\"You must be the new guy, right?\" she said. You felt too nervous to speak, with her voluptuous form standing so close to you. Though, you were able to muster up a nod. \"Our leader, Ms. Bessy, likes to greet all the new guys. She's a bit busy with some cuties right now, buuuut...\" She reached behind her, before pulling out a spotted washcloth. She handed it to you, and you nervously picked it up. \"Go in the barn, and you'll see a line. As long as you brandish this to them, you'll be able to skip the line and see Ms. Bessy.\"<br>\r\n<br>\r\n\"O...ok,\" you said, a little nervous. You were surprised someone greeted you this fast, and that apparently they wanted you to see this Ms. Bessy. You curiously looked at the spotted washcloth, and in that time, the cow you spoke to walked away, leaving you confused about this. Though, as she left, she let out a \"Welcome to the barn.\"<br>\r\n<br>\r\nNow, you could greet anyone you wished to at first. First was the barn, which this Ms. Bessy apparently was staying at. Second was the stable, where you could get familiar with the local horses. Then there are the pens, which, even from here, you could see the pigs within. There were more buildings near the barn, though you couldn't see them from here. Maybe you could check them out later.</span></div></div>",
            "created":1539192720,
            "id":2562187,
            "title":"Horse"
        },
        "1111":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Step near the bucket",
                "Go for the stairs",
                "Ask what the line is for"
            ],
            "content":"<div class=\"\"><div> <span>You decided you should check out that barn. She apparently asked to see you, and it'd be rude if you didn't come and introduce yourself. So, you began to move down to the barn. The doors were opened up, and you were allowed to pass in. Once inside, it looked a lot like the barn at home, and you saw a few stalls for other animals that lie in the barn. However, weirdly, you saw a line of bulls only a little older than you at the far side of the barn. They all appeared to be nervously standing around, and lined up towards the stairs. They all looked nervous, and yet excited. It reminded you of the thrill of trespassing, and the fear involved in it.<br>\r\n<br>\r\nYou figured that this Ms. Bessy was up at the top of the stairs. Remembering back to those few times you attempted to trespass, you decided speaking to any of the bulls would only make them more nervous. So, you began to walk past the line, and up the stairs. A few of the bulls shot you some dirty looks, but quit their glares the moment they spied the spotted washcloth. So, with little resistance, you were able to pass the line, and head up to the top of the stairs. The bulls seemed to not go far up the stairs, just high enough such that they wouldn't be able to peek at what's going on upon the loft at the top of the barn.<br>\r\n<br>\r\nYou were able to get up there, and looked over the scene up top. You saw a few buckets, a round table in the middle of the barn, and a bed at the far corner. In the corner next to the bed, there appeared to be a changing curtain, a cow-shaped silhouette behind it. From the silhouette, she already looked bigger than that one that greeted you before. Her hips appeared to double your shoulder span, your forehead would've only made it up to her waistline, and she had breasts that'd easily cover half of your body if they were given the chance. Your walking made some noises on the loft, and the silhouette perked up upon hearing you.<br>\r\n<br>\r\n\"Pardon me, young man, I didn't usher you up,\" she said. Her words would suggest command, but her tone sounded more inviting.<br>\r\n<br>\r\n\"Uh, this cow out front asked me to see you,\" you said. You held out the spotted washcloth, hoping you'd prove yourself to her. She stood in place, taking in what you said.<br>\r\n<br>\r\n\"Oh... are you the new guy?\" she asked. Her body language seemed to suggest she was warming up to the sudden presence upon her loft. Then, the silhouette stepped out, revealing her full form. She was just as big as she looked, and was brown with white spots. Unlike other barn animals, she bore clothes like human would wear. She wore a black bra, black panties, and some thin leggings, which seemed to accentuate how big her hips were. You questioned why someone like her would where clothing, but you were also left to just imagine what she might be covering up. You felt your cheeks burn up as you gazed upon her.<br>\r\n<br>\r\n\"Y-yeah, I'm new here,\" you admitted. \"Though, I didn't understand why you wanted to see me...\"<br>\r\n<br>\r\n\"I heard a cutie was coming to our barn,\" she explained. \"And I wanted to give them a wonderful first impression~\" She placed a hand on her hip, and stood such that her curves were accentuated further for you. You felt the urge to cross your legs, nervous to her. \"And, I'd like to get a good read on the new guys. Come a little closer, won't you~?\" You felt like you were under a spell at her request. Without thinking, you were suddenly closer, stepping in the middle of the loft. You must've stepped forwards further without even realizing it.<br>\r\n<br>\r\nAt that, she sauntered forwards, approaching you. Once she was standing in front of you, you were reminded just how small you were to her. You were forced to look up at her, right through the valley of her chest. You could only imagine how insignificant you looked to the big cow. You saw her grin, and she began to walk around you, looking over you, \"hm-ing\" to herself as she took in more details about you. You felt yourself get more and more nervous as she scanned over your body.<br>\r\n<br>\r\n\"Have you had your first time yet?\" she asked, standing behind you. You could only be confused at what she could possibly mean. \"First time\"? What does that mean? <br>\r\n<br>\r\n\"Uh, what do you mean?\" you asked. You couldn't see her, but she grinned. It seemed your answer somehow satisfied her. Like your lack of knowledge on it somehow confirmed something for her. <br>\r\n<br>\r\n\"Oh, perfect,\" she decided. She then stepped away from you, and towards one of the buckets. She set it up and put it right next to one of the walls. \"Won't you stand next to this bucket real quick? I want to treat you to your 'first time'.\" You still weren't sure about what she was asking. And something about it made you feel like it was naughty. But, naughty in a way you weren't comfortable with. Was following her orders good for you right now?</span></div></div>",
            "created":1539223320,
            "id":2562364,
            "title":"Check out the Barn"
        },
        "11111":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Check out the stalls",
                "Go to the pen",
                "Hang near the forest line",
                "Go to the farmer's house"
            ],
            "content":"<div class=\"\"><div> <span>You decided to follow her directions. You were kind of new here, and you'd like to get in good graces here, of course on your first day. So, you stepped close to the bucket, looking up at the chubby cow. You nervously rubbed your foot in a circle on the ground as you realized you could only look up at her through the valley in her chest. <br>\r\n<br>\r\n\"Please place your hands on the wall, kid,\" she said. You turned towards the wall, and placed your palms against the wall. You were now leaning over the bucket she set up, and Ms. Bessy was behind you. You could practically feel her placing her hands on her hips as she loomed over her, her body heat tingling your back. Then, you felt her fingers wrap around your shoulders and her breasts around the back of your head. She gently rubbed your shoulders, her fingers tickling your body as they stroked down your back, down your sides, and around your hips.<br>\r\n<br>\r\n\"M-Ma'am, what're you doing?\" you asked. You felt really funny as her fingers rubbed over you and groped you. You clenched your legs together, feeling the urge to hide something. You weren't sure what, but you felt like her eyes were undressing you for some kind of weakspot. You heard her chuckle as she leaned in closer, her hands now groping your buttocks, her fingers dancing along them as she rubbed.<br>\r\n<br>\r\n\"You scared?\" she asked as she rubbed. \"All of the boys are when they first come up here. But you shouldn't be~ Once I touch just the right spots on one of you, you always come crawling back, begging for more~ Why do you think there's such a long line down there?\" She reared her hand back, and smacked one of those cheeks, eliciting a yelp of shock from you as your legs involuntarily spread. Ms. Bessy grinned wider as one head darted from your backside to your front, wrapping around the weird feeling between your legs. She lightly smacked her lips as you felt her hand rub along the length of that strangeness.<br>\r\n<br>\r\nLooking down, you saw it. Your fairly large, very exposed, cock, standing perpendicular from your body and burning up with this feeling you can't describe. And all the while, her hand was around the base of it, her fingers rapping along it.<br>\r\n<br>\r\n\"Now, let's find out if you're a vanilla boy~\" she said. And then, she began stroking, making sure your erection was angled at that bucket. You grit your teeth and shut your eyes, feeling this strange shame in your chest. You felt dirty, embarrassed, hoping no one else could see you now. Your fingers dragged through the wooden wall as if you were trying to find some handhold. You didn't know what kind of handhold you were looking for, maybe you were looking for some kind of ladder you could use to drag yourself out of there. But despite your hands frantically patting around, Ms. Bessy kept a firm grip on your throbbing desire, pumping and squeezing it like some kind of tube of toothpaste. <br>\r\n<br>\r\nYou were a first timer, obviously. It didn't take an expert to see that, and Ms. Bessy was certainly no amateur. She kept rubbing and rubbing, leaning in close and whispering in your ear.<br>\r\n<br>\r\n\"I love meeting new people, don't you?\" she asked. \"I'll be honest, I've been learning too much about the boys on this farm. I've learned how to press almost everyone's buttons. I'm going to love finding out everything that makes you tick~\" You squeezed your eyelids as much as possible, and with a powerful howl, you bucked your hips, and felt a powerful surge flow from your dick. A thick wave of cum filled up the bottom of the bucket, and soon you were left there, panting, tongue lolled out of your mouth. She nodded and got away from on top of you. She grabbed the bucket you came into, and stepped away.<br>\r\n<br>\r\n\"We should work on your stamina, bud,\" she said. \"In the meantime, why don't you keep me in mind?\" She then retreated back to behind the changing curtain. You then began stepping away from the loft, two hands over your crotch. As you stepped down, you saw the other bulls in line. They seemed to look at you with a mixture of knowing and envy. You blushed as you felt they somehow knew what she did to you, and picked up your pace as you left the barn.<br>\r\n<br>\r\nNow, you were standing outside of it, hands still over your crotch, now re-sheathing. You weren't sure if you could face anyone like this! But, you couldn't just meet the cows and call that a day, could you?</span></div></div>",
            "created":1554019080,
            "id":2637578,
            "title":"Step near the bucket"
        },
        "111114":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "You kneel down and smell",
                "You refuse"
            ],
            "content":"<div class=\"\"><div> <span>You were still blushing as you ran out of the barn, covering your groin with your hands. You felt like any eyes upon you would only carry judgement with them. You couldn't face anyone! Not like this! You had to get away from the animals. So, you decided the best place to go would be the house. Maybe the farmer was back and could understand your plight. You sprinted your fast horse legs as fast as you could until you made it up the hill and into the house of your new home. You didn't notice that the farmer wasn't back yet though.<br>\r\n<br>\r\nYou opened the door and shut it behind you, even stooping to locking the door to a house that isn't even yours! You just leapt onto the couch, still hiding your cock, blushing furiously. You were also panting, and soon realized your cock was still hard. You could only think about that scantily clad cow and how she draped over you and squeezed out your lust. While you were left with that, you heard someone walk in from behind. You looked back, and saw a slender figure crawling forwards, a thin tail waving in the air while he sauntered forth. He looked very feminine, but he was a male cat. He bore white fur with orange spots, plump hips, and a welcoming grin.<br>\r\n<br>\r\n\"Hello, dear~\" he said. \"Hey, you don't look like anyone I've seen before... Are you the new guy?\"<br>\r\n<br>\r\n\"U-um... Y-yes, I am,\" you answered, turning away from him.<br>\r\n<br>\r\n\"You shy, bud?\" he asked, coming in from behind, leaning against the back of the couch. His hands came down and gently stroked the top of your head, which made you feel weirder, which he seemed to notice. \"Ah, somebody touch you in a funny way, little guy?\" he asked, peering between your legs.<br>\r\n<br>\r\n\"Y-yeah...\" you answered. <br>\r\n<br>\r\n\"Makes sense,\" he said. \"It's easy for clothes-less animals to be exploited out here. Especially when they're surrounded by giant guys. Was it Bessy? Sylvia? Tusk?\"<br>\r\n<br>\r\n\"B-Bessy...\"<br>\r\n<br>\r\n\"Yeah, she's got a thing for chew toys like you. Wants ta milk them for all they're worth. I've heard tails of her cornering boys and doing weird things to them until eventually, she got the boys of the farm to want her treatment. However, I think I know a way to stop her...\" he said. At that, you perked up.<br>\r\n<br>\r\n\"Really?\" you asked. The cat nodded.<br>\r\n<br>\r\n\"Come...\"<br>\r\n<br>\r\n----<br>\r\n<br>\r\nHe took you up a floor into the house, towards a bedroom intended for a younger kid. The cat was searching through the dresser.<br>\r\n<br>\r\n\"Sybill had a family here, but the ma lost interest in the farm business, so she left and took the son with her,\" he said. \"Ah, here they are!\" At that, you perked up and stepped over, seeing him pull up a pair of green shorts. They looked like they'd be fine for a normal kid, but they were kinda small for you. Still, if this'd help...<br>\r\n<br>\r\n\"How will this help?\" you asked.<br>\r\n<br>\r\n\"Keep your private stuff covered, and you don't have to worry about gettin' exploited so much,\" the cat said. That made sense to you. So you stepped forwards and tried to take the shorts, but he pulled them away.<br>\r\n<br>\r\n\"Now, I don't usually do this for free,\" he said. \"Follow me.\" He stepped out of the room, and you obediently followed. And he led you down into the laundry room. There, you saw a hamper full of clothes, them slick with sweat. They reeked even from here! And yet, the cat reached in and scooped out a pair of socks, which he then pulled on.<br>\r\n<br>\r\n\"I love an obedient boy, so, if you want these shorts, you should follow my orders~\" he said. He sat back, propping one leg on the other and holding that foot up. \"How about you sniff?\" Dang, those things stunk! And yet, those shorts could be your only defense... Could you really degrade yourself and smell them?</span></div></div>",
            "created":1557813780,
            "id":2659605,
            "title":"Go to the farmer's house"
        },
        "1111141":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "And met with one of the horses",
                "And went to the barn",
                "And went to the pen",
                "And checked out the outfield"
            ],
            "content":"<div class=\"\"><div> <span>You looked down nervously, glancing at those stinky socks. He wriggled his toes teasingly at you as his leg stayed propped up, Loki keeping up this smug grin as he seemed to wait for you. You thought back to that weird stuff Bessy did to you, and thought about your choices here. You could either go back to getting touched weirdly by that cow, or you could smell this cat's grody socks tonight. Neither sounded like good options to your young mind...<br>\r\n<br>\r\nEventually, you decided that taking the short term loss was better than the other. So, you dropped down onto all fours, your face positioned just shy of his stinky soles. And yet, the cat wriggled his toes teasingly in your face.<br>\r\n<br>\r\n\"You're gonna have to bring yourself to them, farmhand~\" he teased. You rolled your eyes at this, realizing you'd have to degrade yourself <i>that</i> far. So, you nervously crawled forwards, your nose getting closer and closer to his sole. Then, you got into place. And at that moment, you immediately regretted your decision. You winced and, with a panicked whinny, reared back. However, he'd managed to wrap his free leg behind your neck, holding you tightly against his foot as he ground it into your muzzle. You immediately squirmed about, fighting against the grip of his leg as he held you close.<br>\r\n<br>\r\n\"Aw, do y'hate it that much~?\" he cooed. \"You're gonna make me self conscious~\" He snickered as he kept rubbing his sole into your face, you beginning to feel his sweat dot your muzzle. It was overwhelming! Sickening! You were too devastated by that retched smell! You felt your senses begin to dull into a haze, like your body was being weighed down by tar...<br>\r\n<br>\r\n…<br>\r\n<br>\r\nYou soon felt the soft sunlight hitting your face. You groaned and shielded your eyes, soon stirring awake. You found yourself... in the stables? You don't remember being here last night. Last night you were-. You soon realized you'd prefer to think as little of the last night as possible. You sat up, and soon realized a certain shielding around your lower half. You looked down, and saw that you were wearing those green shorts Loki offered up. Looks like you now had some kind of protection. Huzzah!<br>\r\n<br>\r\nLooks like you could survive one more day, you figured. So, you began to step out of the stall...</span></div></div>",
            "created":1566633180,
            "id":2706846,
            "title":"You kneel down and smell"
        },
        "1112":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "With the sleepy mare",
                "With the muscular stallion",
                "Examine the stalls deeper in"
            ],
            "content":"<div class=\"\"><div> <span>You decided the most logical step was to check out the stables. You figured that, you being a horse, it'd be very simple for you to get familiar with the horses in the farm. After all, you'd likely be living with them for a while. So, you began progressing to the stables. You walked in, and were greeted with a fairly familiar sight, at least upon first look. The stables looked just like your old place, with several stalls around the place intent for horses. You also saw several leather harnesses around the stables, which was weird. They sort of looked like they were intent on covering the whole of a person. It also stunk a little. It kind of reminded you of how smelly it was at your old place, but considering you got used to it over there, you felt like you'd get used to it here.<br>\r\n<br>\r\nThen, you heard a yawn come from one of the stalls. You looked towards it, and saw a horse rise from it. She bore a sylphlike face, and had droopy eyes, still trying to fight off Mr. Sandman.<br>\r\n<br>\r\n\"Yaaaaawn... Oh, I haven't seen you here before...\" the horse said. By their tone, you figured they were female, an assumption that was made clear when she brought herself up higher, bringing her breasts up over the stall and in front of you. She was as naked as any other mare you met, and slightly taller than the tallest mare you remembered. And yet she seemed fairly sleepy. \"You must be, yaaaaawn, the new guy, right?\" At that, you nodded, trying to keep your eyes away from her ample chest. Sure, the horses you met were always naked, but they usually found some way to cover up around you. She grinned. \"Well, nice to make your acquaintance... We apologize, but it's a bit of a tight fit around here...\"<br>\r\n<br>\r\n\"Indeed it is,\" you heard a more masculine voice say. You turned towards it, spying the stall next to the sleepy mare. He definitely looked like a stallion, and a mighty one at that. You could see mighty muscles forming his abs, pecs, and his humongous biceps. He looked like a powerful horse, more powerful than many of the horses you knew at the old place. \"Unfortunately, we don't have a free stall here. There are more deeper in, but they each have a horse associated with them. If you wish, you can bunk with one of us.\" At that, you realized the size difference. Your ears would barely poke over the edge of the stall, and they appeared more than chest high over them, at least. If what they said was true...<br>\r\n<br>\r\nYou never had to bunk with anyone you knew. A good thing too. That usually meant you wouldn't have to be too close to your naked comrades. But if you had to be close to any of these guys... You shook your head, and realized you had to make a choice. Where would you sleep?<br>\r\n</span></div></div>",
            "created":1540746360,
            "id":2569746,
            "title":"Look at the Stable"
        },
        "1113":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Brave the smell and enter",
                "Wimp out and back away",
                "The pig pulls you in herself"
            ],
            "content":"<div class=\"\"><div> <span>You decided to check out the pen. You knew you had to get used to the smell eventually, and what better way to do that than by getting to know the, at least from experience, smelliest animals on the farm. So, you began to approach it, trying desperately to ignore the smell as you got closer. Unfortunately, that'd be a tall order for the strongest of men, and you are far from the strongest. Eventually, you were forced to bring up a hand and cover your nose as you got closer and closer.<br>\r\n<br>\r\nEventually, you were right at the fencing surrounding the pen, and there, you could see that the floor was absolutely caked with mud. Additionally, scattered around the mud field were pigs of various sizes, but even the smallest one was significantly larger than you, your small form being only slightly bigger than her gut. In general, the pigs each seemed to be fairly big and pudgy, and appeared to've covered themselves in mud. Each pig had hips wider than your shoulder span, and the lady pigs generally had breasts larger than your head, while the man pigs were, predictably, flat chested. Well, flatter than the ladies.<br>\r\n<br>\r\nAnother thing you noticed while looking over them: they reeked! You remembered the pigs back home were rarely bathed, but this was just rediculous! You were forced to fan the air in front of you away. You felt like you should speak up, but soon, the pigs turned towards you, and each of them seemed interested in you. It's not often there's a new face on the barn, it seems. Soon, one of them was up in front of you, her leaning up against the fencing. You could hear it creak under her as she leaned against it.<br>\r\n<br>\r\n\"Oh, you must be the new guy!\" the pig said. She was easily 4 times your size, and stunk like a dumpster. \"We heard the new guy was coming today, but no one said he'd be as cute as you are!\" You felt your cheeks burn up at that compliment. You wanted to thank her, but the fear of the smell entering your mouth made you seal your lips. Though, thankfully, the look on your face seemed to communicate that you were thankful for her saying that.<br>\r\n<br>\r\n\"Oh, I'd love to get to know you more!\" she said, giddy at the prospect of learning about you. \"Come on in! I'm not the only gal that wants to talk to you!\" At that, you felt fear. You didn't want to avoid talking to them, you really didn't. But getting in that pen would mean possibly surrounding yourself with their foul smells! Then again, not meeting them would make you look awfully rude, wouldn't it? What to do, what to do...?<br>\r\n</span></div></div>",
            "created":1546317240,
            "id":2596961,
            "title":"Hang out near the Pen"
        },
        "1114":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Ask Loki for help",
                "Ask Rivet for help",
                "You think you can make it around the farm",
                "You just wanted to hang in the house for now"
            ],
            "content":"<div class=\"\"><div> <span>You decided that you'd be better acquainted with introducing yourself to the main house for now. Sure, you weren't exactly a house animal, but you felt you should make yourself more comfortable with your owners first. Maybe then the rest of the animals won't seem as intimidating to your nervous mind. So, you turned around, and headed back to the main house.<br>\r\n<br>\r\nBack there, you could see that the man that drove you here was already gone. It didn't quite hit you on the way over, the permanence of this. But seeing that empty driveway reminded you all the same: this was your home now, like it or not. All you can do now is say goodbye to the people you knew, though from a distance. You sighed, and turned towards the quaint looking house. <br>\r\n<br>\r\nThe house seemed to be two floors tall, the outside painted white and the backyard lined with a white picket fence. It seemed fairly unremarkable, though you felt it might grow on you the longer you stayed here. You approached the front door, and, after a few moments of hesitation, you knocked.<br>\r\n<br>\r\n\"Coming~\" you heard from within. You also heard the soft pats of someone walking towards the door, before the door was opened up. And beyond that door, you saw a feminine cat, standing upright. They appeared to be slightly shorter than you, though cats tended to be short, especially compared against horses. They seemed somewhat mature, given the wide hips and the plump cheeks. Though, you couldn't see any breasts. They had white fur with orange spots, and they sported a welcoming grin.<br>\r\n<br>\r\n\"H-hello, ma'am,\" you said. At that, the cat's grin seemed to turn more teasing.<br>\r\n<br>\r\n\"Sorry to dissapoint, kid, but I'm a dude,\" he said. At that, you felt your cheeks turn red.<br>\r\n<br>\r\n\"I'm sorry, sir, i-it's just-\" you began, only for him to laugh.<br>\r\n<br>\r\n\"Don't worry, I get that all the time,\" he said. \"Come in, you're the new guy, right?\" He stepped aside and motioned you inwards, and you followed. You stepped inside, and were greeted with a very nice smelling home, a few candles placed carefully around, a tasteful rug in the front room, and a couch covered in a shade of blue you felt nostalgic for for some reason. He sat on one side of the couch, and he patted to the one next to him. So, you followed.<br>\r\n<br>\r\nUpon sitting down, you heard some claws clatter against the floor upstairs. And that was followed by some frantic running as the claws scraped across the floor, the owner racing out of one of the upstairs rooms and down the stairs. Then, coming skidding into the living room, was a muscular lady dog, sporting thick muscles and a flat chest, though despite being a dog she seemed significantly taller than you.<br>\r\n<br>\r\n\"New guy!\" she shouted out as she scampered over to the couch. Before you could protest her approach, she was suddenly on top of you, stradling your lap and cuddling your face against her chest, causing you to squirm about on the couch as she smooshed you.<br>\r\n<br>\r\n\"Settle down, Rivet,\" the cat said. At that, the dog bashfully backed away from you, before sitting down on the cushion between you and the cat. \"Well, you got acquainted with Sybill's dog it seems.\" He sounded teasing in tone. \"Meanwhile, my name is Loki. Sybill's gone out to town for a moment, so you got us to take care of you~\" You looked up at them both, Rivet's face seeming excited and Loki's face seeming more playful. \"If you'd like one of us to show you around, just say so.\"<br>\r\n</span></div></div>",
            "created":1552032360,
            "id":2627638,
            "title":"Introduce yourself to the main house"
        },
        "115":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Dog.",
                "Cat.",
                "Free Choice Chapter."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these animals?</span></div></span></div>",
            "created":1546304160,
            "id":2596847,
            "title":"Something else"
        },
        "1151":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "The farm's anthropomorphic animals see yours truly.",
                "Yours truly runs into trouble.",
                "Open Choice Chapter."
            ],
            "content":"<div class=\"\"><div> <span>Greetings fellow readers, this is the story of yours truly who arrives at his new home after I had been transferred to another farm as yours truly after all tries to make a good first impression whereas screwball slapstick comedy and hilarity ensues, enjoy!<br>\r\n<br>\r\nMy story started as the sun rose one summer day as yours truly a great big completely fat animated anthropomorphic yet heroic good and friendly brown poodle who goes by the name of Andre starred in a Warner Bros. cartoon titled Dog Tales and would one day become a great big TV star had transferred to another farm as the truck I was riding in the back of stopped at my new home in other words a farm that I had transferred to as I got out of the rear part of the truck itself as I stepped away from it as the truck itself drove off into the distance as I then broke the 4th wall.<br>\r\n<br>\r\n\"Well folks I'm finally here at my new home as I'll try to make a good first impression and whatnot, meanwhile I may as well make myself at home by relaxing in a hot tub or Jacuzzi that's big enough for me.\" I said as I spoke to the audience who was watching while looking at the camera itself.<br>\r\n<br>\r\nI then found a big enough hot tub for me to relax in as it was already full of clean water as the hot tub's jets were on as soon as I stepped into the hot tub itself as I sat down in the hot tub and started to relax while I was at it.<br>\r\n<br>\r\n\"You know I could get used to being on a farm since I'm the big dog around here and whatnot.\" I said.<br>\r\n<br>\r\nSoon enough though....</span></div></div>",
            "created":1546390740,
            "id":2597317,
            "title":"Dog."
        },
        "12":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Horse",
                "Bull",
                "Goat",
                "Donkey",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>So, you're a normal animal with some power behind you. You're a bit of a prodigy, aren't you, being so tough so young? Well, your prowess has earned your old farm a pretty penny, and the new farm owners seem to think you'll make them a profit. Though, before we see whether or not that's true, let's decide your species.</span></div></div>",
            "created":1539153000,
            "id":2561935,
            "title":"Feral"
        },
        "13":{
            "author_id":"rainbowriderv",
            "author_name":"rainbowriderv",
            "choices":[
                "Horse",
                "Cow ",
                "Pig",
                "Bull",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, which species are you?</span></div></span></div>",
            "created":1543808880,
            "id":2584952,
            "title":"You're feral and they're anthro"
        },
        "14":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Horse",
                "Pig",
                "Lamb",
                "Goat",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>So, it turns out you're a very special kind of animal. Unlike most, you're actually able to walk upright, and look sort of like a human! Of course, someone like you would attract a lot of attention. This barn up ahead doesn't have any anthros though, it's all normal animals. Hopefully you'll fit in though. First, what kind of animal are you?</span></div></div>",
            "created":1539152880,
            "id":2561934,
            "title":"You're anthro and they're feral"
        },
        "141":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "The smelly pig pen",
                "The barn, likely housing cows",
                "Somwhere else"
            ],
            "content":"<div class=\"\"><div> <span>You are a horse. Though, not just any horse. You stood out to the buyer when, get this, you stood up before them. You were about as tall as a teen, fairly skinny, and bore chocolate-brown fur. Some'd say you looked cute, though you were fairly shy around people, even back home. You felt nervous about coming over, but your old owner assured you you'd be safe.<br>\r\n<br>\r\nSoon, you felt the truck stop. Then, light poured in as the back the truck opened up, allowing you safe passage out. You gently stepped out, and walked around. You were hit with the smell of the farm. It was sort of familiar to you, having lived on one since you were born, and yet this smell was alien to you. You felt the urge to cover your nose as you stepped towards the white house in front of the truck, surely the living space of the farm owner. You see your previous owner speaking with the new owner, them bearing white and gray hair respectively, overalls you'd see on a stereotypical farmer, and a red and blue tweed shirt respectively. <br>\r\n<br>\r\nThe two of them were shaking hands, and nodded to each other. Then, your owner stepped away from him, and back towards his truck. As he passed by, he brought up a hand and gently ruffled the top of your head. \"Good luck, bud,\" he said as he stepped back into his truck. Then, you watched as it reversed out of the driveway, onto the road, and away, and you were still trying to digest the idea that that'd be the last you'd see of him. Meanwhile, the new owner stepped up behind you.<br>\r\n<br>\r\n\"Welcome to my farm!\" he declared to you. \"I'm Mr. Sybill! I'm gonna feed and groom you each day, and you just have to play nice with your fellow animals. If somethin' is starting to go south, feel free to speak to me.\" He spoke like a friendly old grandpa, immediately trying to get you more acquainted with your new home. \"My down the path by my house. I can lead you there if you wish.\"<br>\r\n<br>\r\n\"N-no thanks, I think I can follow it on my own,\" you said. Sybill shrugged, and walked towards his house. Then, you began to go down the path he described. As you walked down, you began to see a barn just like any other, red and white with a great big silo on one side. Next to it were several pens, and you could see other animals within them. You could also see some stables near the barn, which naturally drew you towards it. Though, wouldn't it get kinda boring talking to more horses again?<br>\r\n<br>\r\nNow, you remembered on your way over the person driving you said that, due to being human-ish, that you'd likely have to help with the farm, what with milking, feeding, grooming, etc. You sort of thought about getting a head start on that, but you didn't want to do something without experience. So, you'd probably have to wait for Sybil to tell you about it. Though, if you'd tend to these animals, maybe you should get to know them. Some may wonder what there is to know about a feral animal, but, being an animal, you knew what they wanted.<br>\r\n<br>\r\nNow, who should you check out?<br>\r\n</span></div></div>",
            "created":1542009240,
            "id":2576549,
            "title":"Horse"
        }
    },
    "info":{
        "author_id":"nobody495",
        "author_name":"nobody495",
        "brief_description":"As a barn animal, you were transferred to this farm. Though, it's very... strange to you.",
        "created":1539148800,
        "description":"<td align=\"left\" class=\"norm\">Welcome to the Farm of Fooling. Here, you play as an animal that's being transferred from one farm to another. You're a fairly young animal, and you're very nervous about your new life. Though, as you're let in on your new farm, you begin to realize you have so much more reason to be nervous. Will you survive the lewd antics of your new barn-mates, or will their fun prove to be too much for you?<br>\r\n<br>\r\nEncouraged:<br>\r\n-Domaination<br>\r\n-Vore<br>\r\n-Facesitting<br>\r\n-Farting<br>\r\n-Licking<br>\r\n<br>\r\nRules:<br>\r\n1. Don't be too graphic. Refrain from gory descriptions<br>\r\n2. Digestion, while not explicitly encouraged, is still allowed. Just don't be so detailed with it.<br>\r\n3. None of the barn-mates can be younger than our main character.<br>\r\n4. Keep the Fooling between animals<br>\r\n5. Make sure the main character at least starts out as male</td>",
        "id":2171688,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1566633180,
        "modified":1566633180,
        "pretty_title":"Farm of Fooling"
    }
}