{
    "chapters":{
        "1":{
            "author_id":"gibsonlspl91",
            "author_name":"bbchsfootball63",
            "choices":[
                "found by jayd",
                "found by alex",
                "found by marissa",
                "found by rachel",
                "found by chelsea"
            ],
            "content":"<div class=\"\"><div> <span> your bus just dropped you off at school and your going to you locker and as you open it you start to feel funny and you think oh its nothing and get your books and head to class and after your class is over you head to the locker room to get dressed to go be a pe leader like usual and as you enter the gym you start to get light headed and pass out and when you wake up you see the girls entering the gym and you notice they're huge and guess yourself to 1in tall and you walk over to a group of girls what happens next.</span></div></div>",
            "created":1275513480,
            "id":893280,
            "title":"it all begins"
        },
        "11":{
            "author_id":"gibsonlspl91",
            "author_name":"bbchsfootball63",
            "choices":[
                "Soccer",
                "Running",
                "Volleyball",
                "Cardio",
                "Basketball"
            ],
            "content":"<div class=\"\"><div> <span>Jayd happens to look down and spots you she picks you up and puts you in her shirt and asks the teacher to go to the bathroom once she is in the bathroom she takes you out of her shirt and says how did you get like this and you respond I don't know I just walked in the gym passed out and woke up and was shrunk she says well I have noticed you looking a my feet alot and I think you have a foot fetish is this true you say yes oh that's good because your going to be in my sock for the whole gym class and with that she takes off her well worn gym shoe and takes off her drenched white ankle sock and drops you in the first thing you notice is the smell it's horrible she saw your reaction and says yeah I haven't changed my socks for two weeks and then you see her start to put her sock back on and then she puts her shoe back on and goes back to class what are they doing in class today.</span></div></div>",
            "created":1275676560,
            "id":894319,
            "title":"found by jayd"
        },
        "12":{
            "author_id":"gibsonlspl91",
            "author_name":"bbchsfootball63",
            "choices":[
                "In her sock",
                "Her shoe barefoot",
                "Her shoe with socks on",
                "Eaten",
                "In the black sock"
            ],
            "content":"<div class=\"\"><div> <span>Alex looks down and spots you and picks you up and goes to the bathroom and says wow I'm glad my shrinking spray in your locker worked and you say WTF you did this to me why Alex I thought we were frineds we are but I've always liked you and well I know that you like feet vore and giantesses and soo i thought mabey if I made your fantasy come you would be my boyfriend oh well I will ok well I'm going to keep you in my sock for gym class with that she takes of her right well worn Nike running shoe to expose her soaked purple ankle sock she said I have been wearing these socks for a week to get them super smelly for this moment and my nikes are 5 years old and with that she removes her sock to reveal her sexy barefoot and she places you between her first and second toes and starts to put her sock back on but takes it back off and says do you want to be in my sock or my shoe with me barefoot or with soocks on or do you want me to eat you because you can't die since I shrunk you or do you want me to put you in my other sock which is black.</span></div></div>",
            "created":1275685140,
            "id":894391,
            "title":"found by alex"
        },
        "122":{
            "author_id":"gibsonlspl91",
            "author_name":"bbchsfootball63",
            "choices":[
                "In her sock purple or black (ankle socks)",
                "In her shoe barefoot or with socks on",
                "Eaten"
            ],
            "content":"<div class=\"\"><div> <span>I want to be in your shoe while your barefoot ok I was hoping you would pick that one because then you can enjoy my smelly feet even more with that she takes off her other shoe to reveal her super sweaty black ankle sock and took off her black ankle sock and put her socks in her locker and then places you between her first and second toes again and says have fun in there and I'll give you some choices in what you can have me do with you after gym and with that she puts her shoe on and goes to gym class and in gym class they are running today so when you hear that you are o er joyed and so is Alex and then the teacher has them stretch first and go for a light jog to begin and after 10 minutes into the jog her feet start to get really sweTy and smelly and you are in heaven and you get a hard on and slip under her toes and she feels your hard on and starts to scrunch your manhood between her toes and you blow your load on her toes and then the teacher says ok class it's time to start running and Alex starts to run in a full sprint and after 5 minutes of her running your completely drenched in her foot sweat and her shoe is like 100 degrees and it is really smelly in there and after another 5 minutes she stops and sits down and takes her shoe off to check on you and asks are you enjoying it in there and you say yes I am and she's ok class is almost over and you say ok and she places you back between her toes and puts her shoe backbon and runs for the last 15 minutes if class and then goes back to the locker room and takes her shoes off and pulls you from between her toes and says ok here are your choices I can put you in either my purple or black sock or put you in my shoe and wear it barefoot or put you in my shoe and wear it with socks on or I can eat you</span></div></div>",
            "created":1275686580,
            "id":894397,
            "title":"Her shoe barefoot"
        },
        "1222":{
            "author_id":"gibsonlspl91",
            "author_name":"bbchsfootball63",
            "choices":[
                "socks",
                "barefoot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which is it socked feet or barefeet with you in her shoe</span></div></span></div>",
            "created":1309841700,
            "id":1140540,
            "title":"In her shoe barefoot or with socks on"
        },
        "1223":{
            "author_id":"gibsonlspl91",
            "author_name":"bbchsfootball63",
            "choices":[
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span>I want you to eat me I want to see what it's like in your sexy belly she says ok good because I'm hungry and with that she starts to lick you all over and mmm's and says your tasty and then pops you in her mouth and plays with you for a little bit and then swallows you whole and you slide down her throat for a minute and then plop into her stomach and you are amazed at it's sheer beauty and she says I'll let you out at lunch and with that she starts to get dressed and go to her next class and you rember you have the same lunch hour and that it's not for another 4 class hours and you think to yourslef I get be in her stomach for four hours I have got to be the luckiest guy on earth and then before you know it's lunch time and she is in the bathroom spitting you up and when you finally plop into her hand she says ok I'm going to keep you in my so k for the rest of the day and night I will even wear my shoes to bed for you and with that she takes off her right dc skater shoe and you see her drenached dripping purple ankle sock and she removes the sock and drops you in and you notice the smell is really strong and she yeah I kept moving my feet around in class so they would be nice and sweaty and smelly for you and she's says I'm actually going to just keep you in there for the rest of today and tonight and all day tomorrow too and with that she puts her sock back on and your trapped under her toes for the next 30 hours and then she puts her dc skater shoe backbon and she says oh yeah these shoes are 10 years old so enjoy and with that she goes to lunch. </span></div></div>",
            "created":1275687780,
            "id":894403,
            "title":"Eaten"
        },
        "13":{
            "author_id":"gibsonlspl91",
            "author_name":"bbchsfootball63",
            "choices":[
                "Keeps you in her sock for the class ",
                "Keeps you in her sock for the day",
                "Eats you"
            ],
            "content":"<div class=\"\"><div> <span>As your walking through the gym you look up to see Marissa looking down at you and she pucks you up and takes you to the bathroom and says yes I finally have you shrunk I know about your foot and vore fantasies and want to make them come true With that she proceeds to take off her right worn out Nike running shoe and reveals her gray ankle socks and takes them off to reve her sexy barefoot with it's long slender toes and it's perfectly shaped arch and then she place you between her toes and the smell that hits you is horrible and she just giggles in response and puts her sock back on and then her shoe back on.</span></div></div>",
            "created":1276409940,
            "id":898657,
            "title":"found by marissa"
        },
        "133":{
            "choices":[
                "You get digested!",
                "She lets you out after some time",
                "She begins to eat some more, making her stomach full."
            ],
            "content":"<div class=\"\"><div> <span>\"Even if you smell like sweaty feet, I will be a nice girl and make your dream come true.\"<br>\r\nAnd then, she tilted her head back and opening her mouth, places you gently on her tongue . After tasting you for a few moments, she swallows with a loud \"glup\". After being squeeze by her esophagus, you land in a strange and viscous lake of semi digested food. The girl ate something before you and started the process of digestion - your digestion.<br>\r\nWhat happens now?</span></div></div>",
            "created":1280697660,
            "id":928224,
            "title":"Landing in Marissa's stomach."
        },
        "14":{
            "choices":[
                "Her shoe",
                "Her panties",
                "Her boobs",
                "Her mouth",
                "Her hair"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"well well, looks like we have something here.\" <br>\r\nYour picked up and she looks at you. She then gets this giant grin.<br>\r\n\"I'm going to have with you during recess\"<br>\r\nShe then puts you in . . .</span></div></span></div>",
            "created":1400791920,
            "id":1800527,
            "title":"found by rachel"
        },
        "141":{
            "author_id":"gibsonlspl91",
            "author_name":"bbchsfootball63",
            "choices":[
                "Under her toes for only recess ",
                "Under her toes for the rest of the day",
                "Under her toes for the rest of the day and all night"
            ],
            "content":"<div class=\"\"><div> <span>She giglgles, looks at you with a huge smile and says I hope you like my stinky feet. Cause your going in my shoe, with that she takes off her ugg boot and you see she is wearing them barefoot, which you know will not be good for you. Now to your horror she drops you into the boot. When you land you tumble to the toe section and look back, and cry as you see her huge baby blue painted toe nails coming toward you.</span></div></div>",
            "created":1406700180,
            "id":1835323,
            "title":"Her shoe"
        },
        "144":{
            "choices":[
                "Pulled out",
                "Accedently eaten"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She walks to her next class with you inside her mouth. Your getting bumped every step she takes. When she gets to class your . . .</span></div></span></div>",
            "created":1400792040,
            "id":1800528,
            "title":"Her mouth"
        },
        "15":{
            "choices":[
                "See how you taste",
                "Clean my feet",
                "Crush you",
                "Put you in my sock"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Chelsea picks you up and says \" I found a new pet.<br>\r\nShe then says to you\" you better do what I tell you, otherwise, I might have to give you to Marissa\"<br>\r\nFirst, let's . . .</span></div></span></div>",
            "created":1400022420,
            "id":1795963,
            "title":"found by chelsea"
        },
        "151":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Delightful",
                "Horrid"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Mmm, I wonder how you taste!\" Chelsea runs her tongue over your face.<br>\r\n<br>\r\nWell?</span></div></span></div>",
            "created":1402278540,
            "id":1809264,
            "title":"See how you taste"
        },
        "153":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Her hand",
                "Her bare foot",
                "Her ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Crush you with what?</span></div></span></div>",
            "created":1402278360,
            "id":1809262,
            "title":"Crush you"
        },
        "154":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "\"Here come my piggies!\"",
                "\"Here comes my sole!\"",
                "\"Here comes my heel!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"First,\" Chelsea says, taking her sock off, \"I'm going to put you in my sock!\"<br>\r\n<br>\r\n\"CHELSEA! DON'T DO THIS!\"<br>\r\n<br>\r\nChelsea picks you up, and drops you in her sock.</span></div></span></div>",
            "created":1402278120,
            "id":1809259,
            "title":"Put you in my sock"
        }
    },
    "info":{
        "author_id":"gibsonlspl91",
        "author_name":"bbchsfootball63",
        "brief_description":"A boy is shrunken in school and must try to survive against all odds ",
        "created":1275512640,
        "description":"<td align=\"left\" class=\"norm\">the characters are <br>\r\n<br>\r\njayd: brunett hot preppy wears clogs and uggs alot. She is a gentle giantess but likes to have fun.<br>\r\n<br>\r\n<br>\r\nalex: hot preppy wears tennis shoes clogs and mocasins alot blonde she is a very domanitive person who loves to be in control<br>\r\n<br>\r\n<br>\r\nchelsea: hot brunett wears clogs and ballet flats alot. She is into the whole foot fetish scene and loves to have her feet worshiped and also loves the whole vore scene and loves to keep people in her socks and loves swallow people.<br>\r\nwhole and alive.<br>\r\n<br>\r\nrachel:   hot preppy brunett wears uggs clogs tennis shoes a and ballet flats alot. She is into the whole foot fetish scene to <br>\r\nand loves to give out alot of harsh treatment<br>\r\n<br>\r\nmarissa: hot blond wears uggs clogs and blalet flats alot. She is<br>\r\n into the whole foot fetish scene and loves to torture people with <br>\r\nher smelly feet.<br>\r\n<br>\r\nrules.<br>\r\n<br>\r\n1. if you use vore there is no digestion allowed.<br>\r\n<br>\r\n2.  teacher interaction is allowed<br>\r\n<br>\r\n3. guy interaction is allowed but no sexual stuff and no putting in the underwear please and thank you<br>\r\n<br>\r\n4. if you want guys in the story you can make up the characters names<br>\r\n<br>\r\n<br>\r\nother than that have fun and enjoy. please add people lets <br>\r\nmake this the best giantess story on the web. Who ever writes the first review will get 150 gp soo please add people this story is on here for you. And for every review I get I'll add a chapter and if you want a chapter added but are to shy to write it just email me the chapter you want and what you want that girl to do.</td>",
        "id":1678647,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1406700180,
        "modified":1406700180,
        "pretty_title":"the great shrinking fiasco"
    }
}