{
    "chapters":{
        "1":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Original universe ",
                "Comic book universe",
                "Movie universe",
                "Television universe",
                "more universes"
            ],
            "content":"<div class=\"\"><div> <span>                  Ethan being a Chaos Mag who loves to cause mischief decided to repeat one of most eventful endeavors. The spell that changed everyone who visited his turned in to their costumes. This time however the spell will only last one night and when it is over the person who wears the costume will retain an aspect or aspects of said costume. To ensure that no one will interrupt the spell or come looking for him he enchanted the shop to disappear one the last customer leaves. It is set go any where in the multiverse. Ethan also set up a way to watch what he set in motion an to go in and change things if he wants. <br>\r\n<br>\r\n                       He is a agent of chaos who enjoys his work as such he beseeched  Janice lord of chaos to power his spell. Once that was done he activated the enchantments he put in place to to randomly choose where to the shop to appear.          </span></div></div>",
            "created":1299906000,
            "id":1069212,
            "title":" More chaos and mischief spread."
        },
        "11":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Male ",
                "female"
            ],
            "content":"<div class=\"\"><div> <span>                                       Ethan's spell takes him to universe where all of the other universes including his own are considered fiction. So this means this world will be ripe for him to play with. So he begins to set up since it is only few days to Halloween. You were walking down thinking about the party you were invited to trying to decide what you were going to go as. You notice new costume shop that you never seen before. Figuring that it must be new you go inside to try and find something. You are<br>\r\n <br>\r\n                     </span></div></div>",
            "created":1299906000,
            "id":1069222,
            "title":"Original universe "
        },
        "112":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Movies/television",
                "Anime/Manga",
                "video games"
            ],
            "content":"<div class=\"\"><div> <span>You are Amy,a 20 year old female college student.You were looking for a costume for the campus's annual Halloween party but coudn't find one in the other stores in town.Since this store got your interest and you went Inside,you started to search for the perfect costume.As you started your search,Ethan comes closer..\"Hello Young lady,may I help you with something? Is there a costume im particular you are searching for? I can help you with that.\"<br>\r\n\"I don't mind.That would be more faster like that.\"<br>\r\n\"Good.\" said Ethan.\"Is there a section in particular you would go to?\"</span></div></div>",
            "created":1478015580,
            "id":2231274,
            "title":"female"
        },
        "1122":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Naruto",
                "Bleach",
                "Another series"
            ],
            "content":"<div class=\"\"><div> <span>\"Well..I do enjoy watching anime and reading manga.\" you said.\"Then why didn't you say so!\" said Ethan as he dragged you in the Anime/manga department.\"Now then,which series do you like?\" You noticed that the department had various section,each for a certain series.</span></div></div>",
            "created":1478015760,
            "id":2231275,
            "title":"Anime/Manga"
        },
        "11221":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "male character",
                "female character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You went through the Naruto section.The section had costumes for every character in the series you looked at the costumes and settle for...</span></div></span></div>",
            "created":1478015880,
            "id":2231276,
            "title":"Naruto"
        },
        "112211":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Choose the Naruto costume?",
                "Choose another?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decied on choosing a male character costume.That way,your classmates won't know it's you,,you first looked at a costume of the protagonist,Naruto Uzumaki</span></div></span></div>",
            "created":1478016000,
            "id":2231277,
            "title":"male character"
        },
        "1122112":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Choose the Sasuke costume?",
                "Next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Naruto wasn't your favorite character,so you passed and went on the next costume,the ones of his rival and friend Sasuke Uchiha</span></div></span></div>",
            "created":1478016060,
            "id":2231278,
            "title":"Choose another?"
        },
        "11221121":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Taka Sasuke",
                "AU Sasuke"
            ],
            "content":"<div class=\"\"><div> <span>She turned toward the costumes of Sasuke Uchiha,Naruto's rival.Only two were available,both were Shippuden,one was his Taka outfit,and the other outfit was something she never saw before,and it was listed as \"AU Sasuke Uchiha.Which one will she choose?</span></div></div>",
            "created":1478917560,
            "id":2235703,
            "title":"Choose the Sasuke costume?"
        },
        "112211212":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Back at your house",
                "Another customer came in."
            ],
            "content":"<div class=\"\"><div> <span>You decided on the AU Sasuke costume,thinking it was better then the Taka outfit.\"A perfect choice.\" said Ethan,who was standing behind you.You turned to face him,telling him not to creep you out like that.\"My apologises.Now since you find what you looked for,we can proceed with the payment.\" You nodded and followed Ethan.Once you paid the 30$ for the costume,which was a steal'Ethan ave you the bag containing the costume.which you took.Once you left,Ethan smiled.\"Have fun,since you will now be Sasuke's counterpart for this world...for the rest of your life.\"</span></div></div>",
            "created":1478918100,
            "id":2235705,
            "title":"AU Sasuke"
        },
        "1122112121":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "You collasped and fainted.",
                "The pain stopped,but felt as if you lost control of your body."
            ],
            "content":"<div class=\"\"><div> <span>Back at your home,you decided to try out the suit,You first removed every piece of the package:A blue shirt with a high collar and the Uchiha clan's emblem on the back,black pants,black armbands,white leggings,black sandals,a kunai holdster toput around your leg,a sword shealh to put on your back,a Konoha headband and a black wig styled in Sasuke's hairstyle.\"Let's get this over with.\" you said.You first putted on makeup,having Watch tutorials on YouTube how to up the appropriate makeup for your Sasuke Cosplay.After it was done,you putted on the wig,headband and the rest of the costume.<br>\r\nYou looked at your costumed self in the Mirror.You liked what you saw.Unfortunatly,you started to feel a sudden pain all over your body and...</span></div></div>",
            "created":1479496680,
            "id":2238747,
            "title":"Back at your house"
        },
        "11221121211":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Go back to the costume store"
            ],
            "content":"<div class=\"\"><div> <span>\"Tch,just wake up already.\" said a familiar male voice in your head.You open your eyes.You were still in your room on your bed.The last thing you remember was that you tried on that new Sasuke Uchiha cosplay you just bought from that strange store,then there was that sudden pain after you put in on.,then you fainted.\"Finally.\" said the voice in your head.That voice again.\"Am I going crazy?\" You asked yourself,only to notice that your voice had changed.You sounded like the voice in your head,now deeper and masculine.Sasuke's voice.You putted an hand on your chest,only to notice that your breasts were gone.You looked in the mirror,but it wasn't you in Sasuke's cosplay in the mirror,but Sasuke Uchiha himself.\"That outfit turned you into me.You are now my counterpart from this world.\"<br>\r\nYou understood.The costume store.It's costumes turn their wearer into the characters they represent.\"You are lucky that I letted you keep control of your body.Even though I will dissapear,my memories and personality will merge with yours.\" he explained.Before you could ask him...his voice was gone,and you felt dizzy.You memories entered your mind.You were now Sasuke,body and soul,but you still remember who you were,and hoped to find answers how to reverse this.</span></div></div>",
            "created":1481154360,
            "id":2247046,
            "title":"You collasped and fainted."
        },
        "112211212111":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "You acepted his offer",
                "I will think about it."
            ],
            "content":"<div class=\"\"><div> <span>You decided to head back to the costume store and ask the owner for explainations.But you coudn't be seen in your curent form.But fortunatly,it was Halloween tonight,and almost anyone was in costume.You could blend in easily.<br>\r\n---------------------------------------------<br>\r\nAs you arrived at the store's curent location,you noticed that....the store was gone.Was the owner aware of that and magically left,leaving transformed custumers like you in their curent states for the rest of their lives.<br>\r\nWhat will you do now?<br>\r\n\"So,one of his costume turned you into a younger me,right?\" asked a faimiliar voice.You turned, to face the owner of the voice,ready to fight,but when you faced him..you were shocked as you now faced a 30 year old Sasuke Uchiha,as he appeared in the Boruto movie.<br>\r\n\"Are you a transformed custumer like me?.\" You asked.<br>\r\n\"No,you might not believe me,but I'm the real Sasuke Uchiha,and I am not from this world.\" he said,looking at you,\"Your chakra is now the same as mine.His costume turned you into me.My counterpart for this world,where my world is known and thought as a work of fiction,like others.\"<br>\r\nYou knew Sasuke could now travel to other worlds thanks to his Sharingan.\"This man,Ethan is a chaos being from another world.He appeared in Konoha as well,transforming villagers with his costumes.I went through other worlds to investigate.\" he explained.<br>\r\n\"Is there a way to reverse this\" you asked,<br>\r\n\"Unfortunatly,there isn't.You will be my counterpart for this world for the rest of your life.Howrever,I can train you to use your jutsu and Sharingan,so you will be able to use this new form for the greater good.\" he suggested,.\"I might have only one arm now,but I will still be able to help you.\"</span></div></div>",
            "created":1484497380,
            "id":2263845,
            "title":"Go back to the costume store"
        },
        "1122112121111":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Chakra control",
                "Fire style ninjutsu"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine,I acept.\" you said.Sasuke only  nodded.\"Follow me,we'll need to be in a safer place.He dashed away.You tried to do the same and ninja dash after him,only to find out that it was easier then you though.<br>\r\n------------------------------------------<br>\r\nYou followed him to an abandoned school.You both went Inside and headed for the gym.\"This will do.\" said the older Sasuke,before to turn to you.<br>\r\n\"Now,we don't have much time on our hands.There might be others like you who have been turned into their costumes,but they might now have kept their free will like you did.I can't afford to stay here.I have to find Ethan and stop his schèmes.You need to be ready to find the transform ones and be ready to find them if necessary\" he explained.<br>\r\nYou nodded.<br>\r\n\"I'm ready.\"<br>\r\nSasuke nodded.\"Let's start with...</span></div></div>",
            "created":1485707520,
            "id":2270748,
            "title":"You acepted his offer"
        },
        "12":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Marve luniverse",
                "DC universe",
                "Dark Horse ",
                "Amalgam  universe",
                " A Independent comic universe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Which universe does his shop appear in.</span></div></span></div>",
            "created":1299906000,
            "id":1069224,
            "title":"Comic book universe"
        },
        "121":{
            "choices":[
                "\"I want to be an X-Man\"",
                "\"I want to be an Avenger\"",
                "\"I want to be some other hero\""
            ],
            "content":"<div class=\"\"><div> <span>Ethan's shop silently appears in a corner of a mall in New York City of the Marvel Universe.  Passersby give it a bit of attention since it is only a few days until Halloween.  You are cruising the mall trying to find a costume for your fraternity's annual Halloween party.  You walk in the door of the shop and a bell rings.  An older gentleman walks up to you after a moment.  \"Good afternoon, sir.  Welcome to my costume shop.  What kind of costume are you looking for today?\" he says in a fairly strong British accent.  Thinking about it, you realize you'd like a superhero costume, but it's just a question of which hero. </span></div></div>",
            "created":1299992400,
            "id":1069472,
            "title":"Marvel universe"
        },
        "122":{
            "choices":[
                "\"Where are the Justice League costumes?\"",
                "\"Where are the other heroes costumes?\"",
                "\"To heck with the heroes, I want to be a villain!\""
            ],
            "content":"<div class=\"\"><div> <span>Ethan's shop appears unnoticed in a corner of the Metropolis Mega Mall, where it quickly gathers the attention of the local college kids.  One of the local sorority's is having a big Halloween bash, so all the girls are looking for unique costumes to wear.  And since they're inviting the frat to the party as well, almost every girl is looking for sexy costumes.  <br>\r\n<br>\r\nA group of girls walks in and starts looking around at the amazing variety of costumes available.  Some old British dude shows up and asks how he can help them.  The girls respond....</span></div></div>",
            "created":1300078800,
            "id":1070061,
            "title":"DC universe"
        },
        "13":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                " Harry potter movieverse",
                "Twilight movieverse",
                "more choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Which universe does his shop appear at.</span></div></span></div>",
            "created":1299906000,
            "id":1069226,
            "title":"Movie universe"
        },
        "14":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Buffy verse his own.",
                "Charmed universe",
                "Supernatural universe",
                "Smallville universe   ",
                "more universes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which universe does Ethan's shop appear.</span></div></span></div>",
            "created":1299906000,
            "id":1069237,
            "title":"Television universe"
        },
        "145":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Cartoon universe",
                "Anime Universe ",
                "more choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ethan's shop lands in a</span></div></span></div>",
            "created":1299992400,
            "id":1069624,
            "title":"more universes"
        },
        "1451":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "X-men evolution.",
                "Ben 10.",
                "more choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Ethan's shop found its self in out of the way corner of a mall. His shop landed in one of the many universes but which one. </span></div></span></div>",
            "created":1299992400,
            "id":1069628,
            "title":"Cartoon universe"
        },
        "14511":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "  James and company come by later. ",
                "Students of Xavier's and the brotherhood both see the store go check it out."
            ],
            "content":"<div class=\"\"><div> <span>               Ethan took a little time to find out where he was while was opening the shop. He learned that he was in the city of Bayville  N.Y. not to far from New York city. \" Well this place has a lot super powered people to it doesn't really matter,\" commented Ethan. As he was organizing his inventory he noticed a couple of guys sticking a flier on his shops window. Curious he stopped what he is doing an went to see what the were putting up on his store with out permission.<br>\r\n <br>\r\n                As he opened up the door he noticed that these two looked like they were ready to pick a fight. He noticed that had light blue arm bands with letters F.O.H. on them. \" Pardon me young man would you please tell me what it is that you think you doing putting up fliers on my store front with out my consent,\" inquired Ethan?  \"We just doing are civil duty warning the mutie freaks that they are not welcome or wanted in our shops or towns.\" he replied.  \"You have a right to your opinion but I must ask you to take down the flier since you didn't ask for permission to put it up in the first place,\" said Ethan.    <br>\r\n                  <br>\r\n              \" Why are you mutie lover or something,\" the kid asked? \"No, but as I just got done explaining you put something up on my storefront with out my say so. If you don't remove it will have to call security to have you escorted from the mall and banned for vandalism and harassment. I don't want any trouble so why don't you and your friend here come back latter look through the shop for a costume for Halloween. Bring friends I'll give a discount to show no ill will towards you,\" said Ethan.   \"Alright we'll leave the store alone after all we're just looking out for the real humans and not those things.\" he replied.<br>\r\n <br>\r\n                       Ethan listened to some more of the rant before he stopped them. \"Sorry, young man I would like to discuss some more but I have to be getting back to work. Before you leave can you give your names so can be sure to give you the discount for you and your party, replied Ethan. The young man answered,\"The name's James and my friend over there is Steven and we'll have are girlfriends with us when we come by latter,\" replied James. <br>\r\n<br>\r\n                     \"See you then young man.  Would you do me a favor please pass the word around about my humble little shop. I could use all the advertising I can get,\" said Ethan.<br>\r\n<br>\r\n            \" No problem sir and thanks again ,\" replied James. With that they left. Ethan went back to the store thinking <i>I may be a servent of chaos but i am not a bigot I know to many powerful people. I really don't hate anyone. Dislike most them because I know them personally. I think the boy and his friends need to see life on the other side of the fence. Then maybe they will learn something. </i> With that in mind he went find the right costumes for James and his little group of biggots.  </span></div></div>",
            "created":1299992400,
            "id":1069641,
            "title":"X-men evolution."
        },
        "145112":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Fallow the X-women",
                "Enter the Brotherhood"
            ],
            "content":"<div class=\"\"><div> <span>            While Ethan was dealing the two goons. Two different groups  watched the exchange  with interest. Each wanting to see what the Britt would do. The groups who both happen to  be mutants and anything that was said or done about the subject was of interest to them. <br>\r\n      <br>\r\n            First of the groups  was one adult woman and 3 other teenage girls. The other group was made up of 4 teenage boys and girl. Ethan  noticed them when he was having that talk with those two young men minutes ago. From the interest they were showing he figured that they were mutants. So he went an put up the open sign in the front window of the store.  Tapping on the glass to get the two groups attention. When the one group of women noticed he motioned them to come to his shop.  The adult woman  a very beautiful black woman with  white hair was the first to come in the others hung back a little. <br>\r\n<br>\r\n               Ethan figured that the woman was being cautious with her being the only one to come in here first.  “Greetings  madam welcome to my costume shop.  From the way you and  the others were watching I can assume that you are mutants,” said Ethan. Before the woman could respond  Ethan continued , “ It doesn’t matter to me that you are a mutant or not, miss.”  “ Ororo Munroe,” replied the woman.<br>\r\n<br>\r\n         “That’s a  beautiful  name maim. If you are wondering about those two from earlier you don’t have to have to worry about them at least in here. I nether  agree or support their beliefs. I am just trying to make living and everyone is welcome here. So if you and the others out there want to can come in look around  all the costumes are on discount or reasonable priced since it is Halloween tomorrow,” said Ethan. <br>\r\n<br>\r\n                    Storm found the man pleasant and felt compelled to at least to look around. Rembering the girls she excused herself to go get the others. “ Jean, Kitty,  Rogue it’s all right  while we’re here lets look around maybe we’ll find some costumes for  tomorrow nights costume ball at the Professors estate,” said Storm.  As soon as she said that the three teenage girls that were waiting entered into the store to look around.  <br>\r\n</span></div></div>",
            "created":1300424400,
            "id":1072239,
            "title":"Students of Xavier's and the brotherhood bo..."
        },
        "1451121":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Fallow Storm.",
                "Fallow one of the others."
            ],
            "content":"<div class=\"\"><div> <span>           “Miss Monroe please feels free to ask for help if needed,” said Ethan. “Thank you sir”, replied Storm. “The names Ethan Rayne and your welcome. How about I help you and the others out since it seems to just be you fine ladies at the moment,” said Ethan. <br>\r\n<br>\r\n                       “Is this ball a big event or more a private gathering,” asked Ethan? “The ball is a semi private affair open to a few of Bayville’s leaders, close friends, and the students that live on the estate. Why do you ask,” inquired Storm.  “Madam, I asked only so that I would have an idea on what would be the best way to help you to find the right costumes.  For instants does the ball have a theme or just a loose guideline for the costumes,” replied Ethan. <br>\r\n<br>\r\n      “No it’s guests choice other than that nothing explicates to revealing,” answered storm. “That’s good to know it will help to find the right costume for all of you fine ladies. Don’t worry about finding a costume I will help you to find one that is right for you. I once heard a customer say that Halloween is come as you aren’t. So keep that in mind when you look most of all have fun. Don’t be shy to ask for help,” replied Ethan. <br>\r\n<br>\r\n With that Ethan left the group of women to look around and went back to unpacking the last of  tbe boxes for the store.<br>\r\n</span></div></div>",
            "created":1301461200,
            "id":1078744,
            "title":"Fallow the X-women"
        },
        "14511211":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Movie section.",
                "A different section."
            ],
            "content":"<div class=\"\"><div> <span>                    After talking to Mr. Rayne  all four of them went different directions to look around. The shop is incredible big on the inside. So there are many rows of costumes  all sorted by a themes such as literature, television, movies, time period pieces, and so on. There is so much that one could spend a couple of hours  going through it and not be finished looking through it all.<br>\r\n<br>\r\n                     Storm was awed and little flustered on what to wear to the party. She then remembered what Mr. Rayne had said, “Come as you aren’t.” With that in mind she went to find the right costume that would fit that description. She headed for the _____ section. <br>\r\n</span></div></div>",
            "created":1303016400,
            "id":1090001,
            "title":"Fallow Storm."
        },
        "145112112":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Comic / Manga section.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Storm wandered through the  Costume shop ending up in the _____  section. Which was?</span></div></span></div>",
            "created":1316149200,
            "id":1188179,
            "title":"A different section."
        },
        "1451121122":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Historical /Time period ",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other sections for Storm to choose.</span></div></span></div>",
            "created":1316149200,
            "id":1188180,
            "title":"More choices."
        },
        "14511211222":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Television section.",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> More choices for storm.</span></div></span></div>",
            "created":1316149200,
            "id":1188184,
            "title":"More choices"
        },
        "145112112222":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Literature section.",
                "Readers choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some more choices.</span></div></span></div>",
            "created":1316149200,
            "id":1188185,
            "title":"more choices"
        },
        "1451121122222":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Punk Leather outfit.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>          Storm found a row of costumes that felt right to her. It was full of choices that definitely not what she would usually wear. The row was filled with leather outfits simple cloths to adult oriented cloths. Most of the outfits were so opposite of what she usually wore. She normally wears dresses or casual bright toned clothes. These outfits were wilder and come as you aren't. While looking through the costumes she stoped picking one up that just seemed to call to her. Her chioce was?</span></div></div>",
            "created":1344747600,
            "id":1403239,
            "title":"Readers choice."
        },
        "14513":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about My Little Pony Friendship is Magic?</span></div></span></div>",
            "created":1473570000,
            "id":2209001,
            "title":"more choices."
        },
        "145131":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "One of the Mane six",
                "Another pony?"
            ],
            "content":"<div class=\"\"><div> <span>Ethan's shop ended up in Equestria,downtown Ponyville.He now had the form of a purple Unicorn with a red mane and tail and a mask cutie mark.The ponies and other creatures leaving in this world were preparing for what was their own version of Halloween:Nightmare night.As soon as he heard the bell,Ethan went back to the counter to great his first victims...custumers.</span></div></div>",
            "created":1473570000,
            "id":2209003,
            "title":"Yes"
        },
        "1452":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Naruto",
                "Black Butler",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which anime universe  should he end up?</span></div></span></div>",
            "created":1473570000,
            "id":2208997,
            "title":"Anime Universe "
        },
        "14521":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "I want to be a famous ninja",
                "I would like to dress as a famous villain"
            ],
            "content":"<div class=\"\"><div> <span>Ethan's shop ends up downtown Kohohagakure,the hidden Leaf village.It's been two years since the end of the fourth great ninja war and the Elemental nations were now at peace.They now had time for annual célébrations.Although they had no Halloween,they had a similar event where people could wear costumes,as well as a few conventions.<br>\r\nTwo teenagers,both genin came Inside the store.\"A new costume store,that's so cool!\" said one of them.<br>\r\n\"Hello,there,are you looking for a costume in particular?\" he asked.</span></div></div>",
            "created":1473570000,
            "id":2208999,
            "title":"Naruto"
        },
        "145211":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Follow Hiro",
                "Follow Yuki"
            ],
            "content":"<div class=\"\"><div> <span>\"I would like to be a famous ninja from this village!\" said the first teenager,Hiro.\"Maybe dress like Naruto.He's so cool!\"<br>\r\n\"What about you Young lady?\" Ethan asked the boy's female companion,Yuki<br>\r\n\"Well,I don't know which costume to choose so I'll go with a ninja too.\" she said.Ethan led them to the shinobi heroes section,they were outfits similar to those wore by not only famous ninja from the Hidden Leaf village,but other villages as well.Both friends went their seperate ways to browse through the costumes.<br>\r\nWhat will Ethan do?</span></div></div>",
            "created":1473570000,
            "id":2209005,
            "title":"I want to be a famous ninja"
        },
        "1452111":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "The Naruto costume",
                "the Sasuke costume"
            ],
            "content":"<div class=\"\"><div> <span>Ethan decided to follow the Young man,Hiro.He was browsing through the shinobi heroes section and coudn't decide.Those costume are all so cool,yet I can't decide...\" he said.\"Well,you woudn't mind if I help you.\" said Ethan.\"Which ninja would you like to become?\" \"Well,first there's Naruto Uzumaki,the hero of the village,then there's Sasuke Uchiha,Naruto's teamate and rival.I know he went bad for awhile but he helped Naruto end the Eternal Tsukuyomi and is now good again.\"<br>\r\n\"Is that so? Let's see.He Grabbed two outfits that looked like the outfits Naruto and Sasuke once wore as Genin,complete with Konoha headbands.<br>\r\n\"So which one will you choose Young man?\" he asked.</span></div></div>",
            "created":1474002000,
            "id":2210858,
            "title":"Follow Hiro"
        },
        "14521112":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Another customer comes in",
                "Back in Hiro's home"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll take the Sasuke costume.He much's cooler anyway.\" said Hiro.\"A perfect choice.\" said Ethan,grining.\"That will be 30 Ryo pleae.\"Wow,30 Ryo?! That's a steal!\" said Hiro as he paid Ethan.Yuki came back.\"What about you Young lady?\" he asked.\"Well,I do remember that I have a cat costume back at home.So I don't need to buy a costume here.\"That's a shame.\" said Ethan.\"But at least your friend bought something.\" \"Yeah,I'll show you that cool Sasuke costume!\" said Hiro.\"Also,Hiro right? Let me give you some advice before you leave.When you wear that costume,don't fall on the path of revenge....and try to control that new Sharingan you'll gain.You gonna need it.\"<br>\r\nHiro and Yuki looked confused.\"Right....\" he said,before Yuki and him left the store.Ethan returned behind the counter and smirked.\"He dosen't know what's waiting for him.\"</span></div></div>",
            "created":1474002000,
            "id":2210860,
            "title":"the Sasuke costume"
        },
        "145211122":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "An hour later,at the celebration"
            ],
            "content":"<div class=\"\"><div> <span>Hiro began to suit up in his new Genin Sasuke Uchiha costume.He looked in the Mirror.He now wore the iconic blue shirt with the high collar and Uchiha clan symbol on the back,cream shorts,white and blue leggings and armbands blue sandals and shurkiken holsters.He then putted on the last piece of the costume:his konoha headband.It was lighter then his real headband.He looked at his reflexion in the Mirror.Himself in Sasuke clothes.He mimiced some of Sasuke's moves.\"Fire style:Fireball jutsu!\".he shouted as he pretended to unleash a fireball.He smiled,but noticed some black spots on his Brown hair.\"Weird..\" he said.He dismissed it and left his room.He also felt pain in his entire body,as if it was starting to change.He dimissed it too and went to wait for Yuki.</span></div></div>",
            "created":1474002000,
            "id":2210862,
            "title":"Back in Hiro's home"
        },
        "1452111221":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Return to the costume store.",
                "Go see the Hokage"
            ],
            "content":"<div class=\"\"><div> <span>Hiro and Yuki headead downtown Konoha,where most of the villagers and shinobi were disguised for the celebration of the Autumm moon.Yuki was dressed in a cat costume.As the moon rised up in the sky,Hiro didn't feel well,He felt like his face was burning and his mind was getting foggy,with unknown memories replacing his own.\"Hiro.are you alright?\" Hiro fell to his knees.His muscle and bone structure,and chakra signature changed.His face change as well.The black spots on his hair spreaded as his hair on the back spiked while those on the front of his face grew and became shoulder length bangs.Hiro cried in pain as it now reached his eyes,They first turned from green to onyx black,before to become red with two black tomoe in each.<br>\r\nWhen the pain stopped,Hiro was still on his knees.\"Hiro..are you okay?\" Hiro turned to faced Yuki,but when Yuki stared at him,she noticed that it wasn't Hiro she was looking at,but at a Young 12 year old Sasuke Uchiha.\"Who's...Hiro?\" he asked.He sounded like Sasuke too.\"My name is Sasuke Uchiha.I'm the last member of the Uchiha clan.\" he said,getting up.\"What happened to you Hiro? Why did you become Sasuke? Don't you regonise me? It's me Yuki,your friend.\"<br>\r\n\"Sorry,but I don't know you.\" said the new Sasuke Uchiha.\"My teamates are Naruto Uzumaki and Sakura Haruno.\" he said.He looked around and heard music from dowmtown.\"Is there a celebration going on?\" he asked.\"What happened to you?\" she asked.Being of the Hyuga clan Yuki could use the Byakugan to check Hiro's chakra system,but it became the same as Sasuke.\"Did that costume did something to you?\" she asked.\"Costume? I'm not wearing any costume.\" said \"Sasuke\"<br>\r\n\"You're just as anoying as Sakura.\" said Sasuke.<br>\r\nYuki tried to find a solution</span></div></div>",
            "created":1474043520,
            "id":2210864,
            "title":"An hour later,at the celebration"
        },
        "14521112211":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Naruto Uzumaki",
                "the real Sasuke Uchiha"
            ],
            "content":"<div class=\"\"><div> <span>Yuki and Hiro/Sasuke returned to the costume store...only to find out that it was gone.<br>\r\n\"Where's the store? I thought it was here?!\" said Yuki.<br>\r\n\"What store?\" spat Sasuke.<br>\r\n\"The costume store where you bought that Sasuke costume.\" said Yuki.<br>\r\n\"I'M not wearing any costume.\" spat Hiro.<br>\r\n\"But HIro...\"<br>\r\n\"Stop calling me,Hiro.I told you my name is Sasuke.\"<br>\r\nThe Sharingan activated in his eyes.He could easily pick up a familiar chakra signature.He picked up a kunai.A figure appeared in the shadows.<br>\r\n\"First that store dissapears and now this.\" he said.<br>\r\n\"Show yourself!\" said Hiro/Sasuke.The figure came out of the shadows,revealing to be...</span></div></div>",
            "created":1474043940,
            "id":2210869,
            "title":"Return to the costume store."
        },
        "145211122112":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Sasuke and Yuki go after Hiro"
            ],
            "content":"<div class=\"\"><div> <span>The real Sasuke Uchiha,who is a 19 year old Young man,wearing a cream puncho and blue headband came out of the shadows.His Rinnegan eye and Sharingan eye staring at his Young doppleganger.\"So this is a product of this costume store? What happened to your friend?\" he asked Yuki,\"My friend Hiro bought a costume in this store earlier today and turned him into a Young version of you.\" Yuki explained.Hiro/Sasuke stared at the older Sasuke.\"Your chakra...are you me?\"<br>\r\n\"It's more the opposite,you are me.You became me..\" the real Sasuke replied.\"No,I'm the real Sasuke! I've always been!\" cried Hiro.<br>\r\nSasuke sighed and turned to Yuki.\"It's just as I feared.This costume store has costumes with powerful jutsu that turns the wearer into their costumes.\" he explained.\"Your friend is now the Young me,body and soul.\"<br>\r\n\"What can we do now?\" Yuki asked.\"Hopefuly,this jutsu will end in the morning.\" said Sasuke.Yuki and Sasuke noticed that Hiro had vanished.\"We hav eto go after him.Who knows what he will do.\" said Sasuke.</span></div></div>",
            "created":1474044540,
            "id":2210880,
            "title":"the real Sasuke Uchiha"
        },
        "15":{
            "author_id":"allen7811",
            "author_name":"no one",
            "choices":[
                "Book universe",
                "Game universe",
                " A combined universe (from choices above.) "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>     List of other universes for Ethan to visit are.</span></div></span></div>",
            "created":1299906000,
            "id":1069215,
            "title":"more universes"
        },
        "152":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Midgar(Final Fantasy 7)",
                "Eos(Final Fantasy 15)",
                "Other FF worlds?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ethan decided to visit the multiverse known in our world as the Final Fantasy video game franchise.But they were many worlds related to it, which one to go?</span></div></span></div>",
            "created":1500222420,
            "id":2354399,
            "title":"Game universe"
        }
    },
    "info":{
        "author_id":"allen7811",
        "author_name":"no one",
        "brief_description":"After the success of Halloween. He opens a shop elsewhere to cause more chaos.   ",
        "created":1299962640,
        "description":"<td align=\"left\" class=\"norm\">      Ethan opens his shop in another part of the multiverse original, television, comic book, book, movie, or game universe. Same as in the  Buffy episode the person or persons' become's who they dress up as for the night. but, by morning their original selves regains control. Do they retain any of the possession  i.e. appearance, knowledge, memories, powers, or variation there of. The general plot the story is  you go back to Ethan's but the shop is gone with out trace leaving you with what to do next. After the run in with his old buddy ripper Ethan enchanted his new shop to change locations even universes before the customers come back to find him. This way he came enjoy spreading his brand of chaos safely and watch it all from the safety of his shop.                     <br>\r\n<br>\r\nrules.<br>\r\n 1. No underage stuff if you are going to regress someone please no younger than eighteen.<br>\r\n 2. No killing a character outright to end the story or abrupt ending with no conclusion try keep it going. <br>\r\n 3. WG/WL and MG/ML is acceptable as long as it deals with the costume that is chosen.<br>\r\n 4. Personality changes to a character such as sexuality preferences is welcome please keep to a minimum.     <br>\r\n 5. Incest a big no.<br>\r\n 6. Characters turning evil or good is welcomed.<br>\r\n 7. Please use good grammar ( a few mistakes are fine just keep it readable).  <br>\r\n 8. One sentence chapter are fine but keep them to a minimum, nothing shorter than that please.<br>\r\n 9. Whichever  way you chose to go with it have fun. <br>\r\n<br>\r\n  disclaimer: I don't own buffy characters this was created for fun.</td>",
        "id":1759008,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1500222420,
        "modified":1500222420,
        "pretty_title":" Ethan's Costume Shop."
    }
}