{
    "chapters":{
        "1":{
            "author_id":"galaxia111",
            "author_name":"just some Guy",
            "choices":[
                "BOY",
                "GIRL"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First of all are you a boy or a girl?</span></div></span></div>",
            "created":1261976400,
            "id":812220,
            "title":"Beginning of something great"
        },
        "11":{
            "author_id":"galaxia111",
            "author_name":"just some Guy",
            "choices":[
                "to stay in this life",
                "to change into my other life",
                "Coose what you want!",
                "Coose what you want!",
                "Coose what you want!"
            ],
            "content":"<div class=\"\"><div> <span>One night when I were on the way home from my friends house. I was somehow bored so I thougt about my life. I really enjoyed living my life until now. I thought about how cool it would be to life another life somewhere else. But then I felt something like a lightning going through my body and I heard a strage voice saying: \"You've been ordered into another dimension. From now on you can choose your life by sleeping.\" When I came back to senses I stood right in front of my house door. \"Creepy\", I thought when I went up to my room. I lay on to my bed and drifted off ino sleep. Suddenls there appeared two bubbles in my dream. In my mind I toushed one of them and choosed...</span></div></div>",
            "created":1261976400,
            "id":812240,
            "title":"Strange voice"
        },
        "111":{
            "author_id":"genghiskhan",
            "author_name":"NotTheGuy",
            "choices":[
                "A world of dominant giantesses.",
                "A world where men are fattened to immobility by smothering women",
                "Not for me"
            ],
            "content":"<div class=\"\"><div> <span>You opt to touch the one that will let you keep you're life when the voice returns and says 'We present you the gift of being able to live in a better world, and you choose to stay here. For this you will be punished. You are cursed to love in a life you do not want.' Suddenly you wake up and find you are in...</span></div></div>",
            "created":1337576400,
            "id":1342063,
            "title":"to stay in this life"
        },
        "1113":{
            "author_id":"genghiskhan",
            "author_name":"NotTheGuy",
            "choices":[
                "teen babyhood",
                "Human pets",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A world where about 1 in 2 teenagers never mature beyond babyhood. You unfortunately are one of the adult babies. <br>\r\nOr A world where humans are pets to a superior race</span></div></span></div>",
            "created":1337576400,
            "id":1342065,
            "title":"Not for me"
        },
        "112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "wake up as a girl",
                "wake up as myself- nothing has changed",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still not believing this strange voice from earlier I decided to ignore it and find my sleep. But then a strange idea came to my mind: I always wondered what it would be like as a girl. So in my dream in imagined myself as a girl….</span></div></span></div>",
            "created":1272862800,
            "id":877448,
            "title":"to change into my other life"
        },
        "1121":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Your age",
                "Your family",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up after a full night sleep, only just like the images in your dream, now your a girl,<br>\r\n<br>\r\nIs anything else different</span></div></span></div>",
            "created":1287637200,
            "id":978496,
            "title":"wake up as a girl"
        },
        "11211":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Older",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you older or younger?</span></div></span></div>",
            "created":1287637200,
            "id":978498,
            "title":"Your age"
        },
        "112111":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "Ed is a loving husband who wants to know if you feel better",
                "Ed is an abusive, sexist husband who wants you to serve him supper!"
            ],
            "content":"<div class=\"\"><div> <span>You woke up and could immediately feel the changes in your body. There was no doubt that you were a female! You stood up carefully, and spotting a full-length mirror, you cautiously walked over to it. There, staring back at you, was a petite, young woman, with very long chestnut hair. As you hefted your breasts, you found it interesting that they felt larger than they looked on the outside. Perhaps the bra and the dress you were wearing held them back? Then you allowed a hand to go under your skirt. It was wonderful to feel a real pussy there! This could be fun!<br>\r\n<br>\r\nYou stopped yourself for now. There will be plenty of time to explore your body more later. You looked around, and it was a bit confusing. The room, indeed, the house, was not the one you used to live in. This room was very different. Then something caught your eye. Pictures! As you moved closer, you became concerned. There were pictures of you there, but not alone. In every picture, there was a guy next to you! Worse, one of them was a wedding picture! There you stood, or the girl you now were, in a wedding dress, and a guy in a tux towering over you! You looked at your left hand, and to your dismay, there was a wedding ring! You were married!<br>\r\n<br>\r\nYou heard something downstairs, and as quietly as you could, you worked your way down the hall, then down the stairs. You could see a man sitting in what you knew was your living room, and you knew his name was Ed, and that he was your husband!<br>\r\n<br>\r\nHe looked up and saw you and said, \"Emily! .....\"</span></div></div>",
            "created":1516770000,
            "id":2444526,
            "title":"Older"
        },
        "1121111":{
            "author_id":"nichster",
            "author_name":"nichster",
            "choices":[
                "Go to work ",
                "Skip work and go get some new clothes"
            ],
            "content":"<div class=\"\"><div> <span>A tall, fairly young and muscular man popped his head into the room and asked\"Are you OK? I heard a noise, was it you?\". You told him it was you and said you had had a slight shock and you were feeling fine. Luckily,your husband, whose name was Ed, was a loving and caring husband. You had been married for nearly a year now and this woman couldn't be happier. Good job, good husband and this body was youthful. He opened her wallet and saw that she was only 23. Her job was an executive assistant at a top company: a quick search suggested that she was earning about 75000 dollars a year. He wanted to learn more about his new life but he had to go to her job. </span></div></div>",
            "created":1587044700,
            "id":2819683,
            "title":"Ed is a loving husband who wants to know if you..."
        },
        "1121112":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "Meeting your old friend Sharon",
                "The life of a housewife"
            ],
            "content":"<div class=\"\"><div> <span>Ed growled, \"It's about time you came down you stupid, lazy, bitch! Now get in there and make me something to eat!\" Then he added, \"And bring me a beer!\"<br>\r\n<br>\r\nMemories flood your mind. Ed was so nice, such a gentleman... while you were dating. Your mother tried to warn you, but it was no use, you were in love. And even as you were shaking off the shock, you realized that you really did love Ed, even now. You were twenty, and Ed was twenty-five. You had married six months ago, and almost from the start, even on the honeymoon, you began to realize that Ed now regarded you more as his property, not an equal partner. Something inside of you made you rush to get him a beer. As you gave it to him, you felt very small, weak, and vulnerable before this huge male!<br>\r\n<br>\r\nSomehow, you knew where things were, and how to cook. At least, cook as well as a wife of six months can cook. As soon as it was ready, you went into Ed, \"It is ready honey. Would you like to come to the table, or should I bring your meal in here?\"<br>\r\n<br>\r\nEd looked at the game on TV, \"Shit. Those pussies don't know how to play! I might as well come to the table.\"<br>\r\n<br>\r\nAs soon as Ed was seated, you served him his meal. You sat there quietly, hoping he would like it. He ate like a pig, but didn't complain. You didn't have time to eat much before Ed pushed the plate away and stood up. He grinned, and you felt a shiver go up your spine as something inside of you knew what was coming. \"Not bad girl. But now I am ready for dessert.\"<br>\r\n<br>\r\nThere was no time to move or avoid his grasp as he roughly pulled you to him. The part of you that was a male was appalled and wanted to pull away, but the frightened girl named Emily knew better, and even though her, well, your, mind was occupied with thoughts of all the work you had to do. Putting away leftovers, dishes, wash, cleaning, there was no question that Ed would not understand. When he wanted your body, he wanted it when he wanted it, and right now, he wanted it! You found yourself returning his kiss, trying to enjoy what foreplay Ed would give you, and hoping that you would get wet.<br>\r\n<br>\r\nSoon, Ed broke the kiss and picked you up like a feather! He carried you upstairs, and as soon as he put you down, you hurried to undress for him! It was humiliating, but he would literally tear your clothes off if he had to. Ed pulled down his pants and pushed you onto the bed, where you quickly spread you legs for him! You wanted to cry and throw up as you felt his cock penetrate your pussy, but part of you did enjoy it. Of course, just as you began to feel some real pleasure, you felt Ed begin to cum and pump his hot seed inside of you. Damn! Don't you get something good in this life?<br>\r\n<br>\r\nAs he pulled out of you, there was a part of your mind that hoped that you would get pregnant this time, or soon. Surely Ed would love you more if he knew you were having his child. Right? You knew that you had to lay there, letting Ed's cum leak from your pussy, because you knew he liked looking at you as he dressed again. Then, without so much as a thank you for either sex or supper, he just turned and left the bedroom!<br>\r\n<br>\r\nYou wanted to cry, but the woman you had become had worn that option out already. The was beaten, defeated, numb. You couldn't believe that you had just accepted that this was to be your life! You didn't know how, but something was going to change around here! You would find a way to change Ed's view of you!</span></div></div>",
            "created":1516770000,
            "id":2444540,
            "title":"Ed is an abusive, sexist husband who wants you ..."
        },
        "112112":{
            "choices":[
                "Return to your boy self",
                "Remain as a girl"
            ],
            "content":"<div class=\"\"><div> <span>You woke up, sat on the bed and stretched yourself. A beautiful light was coming in through the curtains of your window. You looked your glasses and went to open the window.<br>\r\n<br>\r\nA fresh wind blew inside your room playing with your long brunet hair. It was a great Sunday morning.<br>\r\n<br>\r\nYou turned to see your room while remembering that strange dream of yours and giggled to yourself. Being a guy had always been a fantasy of yours, but that dream was so real that just by remembering made you felt a little weird.<br>\r\n<br>\r\nYou breathed deeply and let it go. You was a girl and there was no way for you to fulfill such a fantasy.<br>\r\n<br>\r\nYou walked to your closet and changed from your pink pajama to your usual jeans and t-shirt complimented by a pair of snickers. You have always been a little tomboy, but with the time not even your plain wardrobe could hide that you was growing as a good looking girl.<br>\r\n<br>\r\nAnd the worst part came just after you got down to breakfast.<br>\r\n<br>\r\n\"Good morning Ash. Are you still hiding Ashley on your room?\" You sister teasing you.<br>\r\n<br>\r\n\"I'm Ashley, Kat.\" You replied annoyed.<br>\r\n<br>\r\n\"Don't get so pissed of when you like to hide behind that lame clothes.\" She said as if nothing and continued, \"Specially when you have so cute things on your room.\" She pointed.<br>\r\n<br>\r\n\"You...\"<br>\r\n<br>\r\n\"Girls, stop arguing.\" You mother intervened.<br>\r\n<br>\r\nYou showed your tongue to your older sister at your mother's back.<br>\r\n<br>\r\nThe breakfast when as ever.<br>\r\n<br>\r\nYou didn't have plans for that day, so when your parents and sister left you sat at the couch and began to see TV. You didn't know how much time passed when you felt sleep.<br>\r\n<br>\r\nJust then a knock on the door awoke you...</span></div></div>",
            "created":1324962000,
            "id":1246968,
            "title":"Little tomboy"
        },
        "1121121":{
            "choices":[
                "Ashley woke up",
                "A Third Button"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Slugabed!\" Your little sister called you. \"Mom said that if you don't go down now you won't have breakfast.\"<br>\r\n<br>\r\nYou mumble something unintelligible trying to wake up. Girl, boy, you weren't sure of what was going on, but the hole at your stomach didn't let you think properly at the morning.<br>\r\n<br>\r\n\"You look terrible Alex.\" Your mother told you.<br>\r\n<br>\r\n\"I fine.\" You answered yawning while taking sit. \"Just a little tire.\"<br>\r\n<br>\r\n\"How many times I had told you not to play so late at night?\"<br>\r\n<br>\r\n\"Sorry, but today is saturday.\" You complained and your mother just sighed serving you your breakfast.<br>\r\n<br>\r\nYou finished your breakfast and returned to your room. You jump into your bed again, but you just couldn't return to sleep again. However you stood laying there looking at the emptiness of the ceiling remembering clearly the dream: You were a girl, were you?<br>\r\n<br>\r\nIt was awkward, remembering the feeling of being a girl when you have always been a boy. But the weirdest part came from the feeling of have always been a girl. You know who you are, but just now the doubt of not knowing which one of the two were real born inside you. Were you de dream? Or was? Both? Or any?<br>\r\n<br>\r\nYou got a headache. It was so complex to think about such a setting that after you don't know how much time, you decided to just let it be.<br>\r\n<br>\r\nIt was saturday and you didn't have plans so you decided to try to access your second life again and try to enjoy that Ashley's girl point of view.</span></div></div>",
            "created":1327726800,
            "id":1266581,
            "title":"Just a dream?"
        },
        "11211211":{
            "choices":[
                "Clothing store",
                "Shoe store"
            ],
            "content":"<div class=\"\"><div> <span>The knocking on the door finally awoke you. You sat at the couch and tried to fully awoke. Suddenly someone knocked on the window and called you.<br>\r\n<br>\r\n\"Ashley? Hey? Are you there?\" It was Karen, your friend.<br>\r\n<br>\r\n\"Karen, morning.\" You greeted her half-sleep opening the door.<br>\r\n<br>\r\n\"As I thought,\" she sighed looking at you, \"we don't do plans and you waste your Sunday sleeping.\" She smiled.<br>\r\n<br>\r\n\"Yea, why not?\" You said yawning walking back to the couch.<br>\r\n<br>\r\n\"Hey!\" She shook you. \"Are you listening?\"<br>\r\n<br>\r\n\"Sorry, I was just having a nice dream and want to continue it.\"<br>\r\n<br>\r\n\"With a boy?\" She smiled curiously.<br>\r\n<br>\r\n\"Somehow.\" You answered yawning.<br>\r\n<br>\r\n\"So, what was it about?\"<br>\r\n<br>\r\nYou were still a little dizzy after awaking, but you were sure that it was not a good idea to tell her about your dream of being a boy. So you just change the topic.<br>\r\n<br>\r\n\"Weren't you having a date today?\" You asked.<br>\r\n<br>\r\n\"That stupid,\" She stated a little mad, \"he called me this morning and told me something came up. And while I was coming here I found he was playing soccer! Can you imagine? He planted me for that stupid game!\" She said dramatically jumping to hug you.<br>\r\n<br>\r\n\"There, there,\" you tried to comfort her, \"And I bet you made a scene after you found out, right?\"<br>\r\n<br>\r\nShe pushed you back. \"It wasn't a scene! I just dumped him right there!\" She stated as an angry child.<br>\r\n<br>\r\n\"Okay, Okay.\" You tried to calm your friend.<br>\r\n<br>\r\nIt took a while, but her mood finally got stable enough to think what to do. You didn't want to go out, but looking at Karen and thinking about your dream, it was the best choice by the moment.<br>\r\n<br>\r\nThe only thing of the mall that you actually like was the arcade, but this visit wasn't a real pass time visit to the mall but a method to cheer up Karen. You were still confused, how did you two became friends? After all, she was the completely opposite of you... just like Kat. And when a voice called you both you remembered: Jenny was the reason.<br>\r\n<br>\r\n\"Hey!\" Jenny called you.<br>\r\n<br>\r\n\"Jenny!\" Karen jumped to greeted her.<br>\r\n<br>\r\n\"Jen,\" You just said.<br>\r\n<br>\r\n\"Well, lets go!\" Jenny told you.<br>\r\n<br>\r\nIt was interesting how you three look in group. Since Karen and you were completely opposites, having someone like Jenny, the very middle point between you two, make the things smoother.<br>\r\n<br>\r\n\"So she dumped another guy, eh?\" Jenny asked you just to confirm.<br>\r\n<br>\r\n\"Oh, yep!\" You sighed. \"She usually run directly to your house... So where were you?<br>\r\n<br>\r\n\"I had a morning training session.\" She giggled.<br>\r\n<br>\r\nJenny was part of the basketball team and with the beginning of the season so near it wasn't so surprising that the team were training even on Sundays.<br>\r\n<br>\r\n\"And how did you scape?\" You asked curious and thankful that she had done it.<br>\r\n<br>\r\n\"Actually,\" She began hesitating of gossiping, but she finally told you. \"It seems that the couch has a date.\"<br>\r\n<br>\r\n\"The Dragon Lady on a date!?\" You laughed. \"That's unexpected.\"<br>\r\n<br>\r\nJenny giggled with you.<br>\r\n<br>\r\n\"Hey! You two, let's began!\" Karen called you before entering on your first store of that day.</span></div></div>",
            "created":1328245200,
            "id":1270660,
            "title":"Shopping?"
        },
        "112112111":{
            "choices":[
                "A small exploration",
                "Ignore the feeling and try the dress"
            ],
            "content":"<div class=\"\"><div> <span>\"Ah! All of them are so cute!\" Karen exclaimed while trying to choose which dress was she going to try first.<br>\r\n<br>\r\nYou were just looking around bothered by just being dragged into Karen's world.<br>\r\n<br>\r\n\"You really dislike to do this kind of things, don't you?\" told you Jenny while looking for something to try herself.<br>\r\n<br>\r\n\"Not that much... just a little.\" You tried to smile to your friend.<br>\r\n<br>\r\n\"Hey! Girls! How do I look?\" Karen showed you.<br>\r\n<br>\r\n\"Is good.\" You said just to annoy Karen, who immediately looked for sympathy in Jenny.<br>\r\n<br>\r\n\"You are always fabulous.\" Jenny added winking.<br>\r\n<br>\r\nKaren's runway was as boring as always for you, but little by little something began to move inside you, some sort of curiosity. You began to look around you and then to yourself and your reflection on one of the store's mirrors.<br>\r\n<br>\r\n\"So you want to try something too?\" Jenny asked you.<br>\r\n<br>\r\nYou jumped surprised when your hear her and found her really close to you.<br>\r\n<br>\r\n\"What are you doing!?\" You said a little scared. \"When did you...?\"<br>\r\n<br>\r\n\"We called you, but you were so absent minded that I couldn't resist.\" Said Jenny<br>\r\n<br>\r\n\"She might be thinking on her dream's guy.\" Karen added giggling.<br>\r\n<br>\r\n\"Really?\" Jenny smiled a knowing smile. \"Cupid most be working hard lately.\"<br>\r\n<br>\r\n\"Could you stop gossiping?\" You asked annoyed.<br>\r\n<br>\r\n\"Well, come with me.\" Jenny pulled you into one of the dressers. \"Karen...\"<br>\r\n<br>\r\n\"Yes Ma'am.\" Answered Karen and in less that a second a yellow dress popped up from behind the curtain. \"Here it is!\"<br>\r\n<br>\r\n\"Then lest help you take that off.\" Said Jenny.<br>\r\n<br>\r\n\"I can do it myself!\" You said mad, pushing Jenny out of the dresser.<br>\r\n<br>\r\n\"Well, but we won't let you out with out trying it!\" Sentenced Jenny and both your friends laughed.<br>\r\n<br>\r\nYou sighed. How did I end in such a situation? You asked to yourself. Just a little bit more than a hour before you were so happy dreaming about a completely different life and now your were just stuck in a dresser of the mall. You sighed again and began taking off your t-shirt and jeans. You sighed at the look of the yellow dress, it wasn't the first time you use a dress, but for some reason you had never got used to it. And just then you look at your reflection at the mirror and something awkward, subtle, but awkward born inside you.<br>\r\n<br>\r\nYou were curious about your body...</span></div></div>",
            "created":1328763600,
            "id":1273646,
            "title":"Curiosity"
        },
        "1121121111":{
            "choices":[
                "Girls Conversation",
                "Escaping from your Friends "
            ],
            "content":"<div class=\"\"><div> <span>You were curious. But why exactly at that moment? You felt awkward about the whole situation that you don't really knew what was going on. Somehow since that first dream you had been feeling uneasy, might it be exactly because of that?<br>\r\n<br>\r\nYou observed you reflection on the mirror and noticed your own self. You knew yourself but it felt as if it was the first time you noticed yourself. Your body was young and smooth, there were little curves that pointed since then to a really good shaped body on the future. You noticed your white but cute underwear and pressed your little breasts with your hands. You sighed. Was that what means to become a woman?<br>\r\n<br>\r\nYou turned around to take the dress again just to notice the sight of your friends looking at you amused. You got mad and pushed them out.<br>\r\n<br>\r\nYou got into the yellow dress as fast as possible and got out to finish with that.<br>\r\n<br>\r\n\"So, what now?!\" You said with an angry tone.<br>\r\n<br>\r\nBoth giggled.<br>\r\n<br>\r\n\"You look cute.\" Told you Jenny making you blushed.<br>\r\n<br>\r\n\"You should use something like that more often.\" Karen smiled you turning you even more embarrassed red.<br>\r\n<br>\r\n\"Enough of that.\" You said turning around running into the dresser to return to your normal clothe.<br>\r\n<br>\r\nIt took a few more until you all finally got out of the store. You were exhausted, but it seemed like Jenny and Karen were still looking for more.</span></div></div>",
            "created":1329368400,
            "id":1278121,
            "title":"Normal Curious?"
        },
        "11211212":{
            "choices":[
                "A man",
                "A woman"
            ],
            "content":"<div class=\"\"><div> <span>\"And now?\" You asked to yourself finding yourself on an awkward white space.<br>\r\n<br>\r\n\"The observations had just began.\" That creepy voice that began everything told you.<br>\r\n<br>\r\n\"Observations?\" You asked. \"What are you talking about? Are you and alien and I had been abducted? Are you god? What?!\" You shouted, but the voice didn't answer. \"So how do I get out of here?!\"<br>\r\n<br>\r\nSuddenly a button appeared floating in front and in it said \"Alex\"; then a second button appeared by your side, \"Ashley\". This time it was a little more elaborated, but it was somehow like the first time, you thought. But when you were going to push Ashley's button a third one appeared.<br>\r\n<br>\r\n\"A third option?\" You thought.<br>\r\n<br>\r\nYou approached it to see what would it say, but there was nothing written on it.<br>\r\n<br>\r\n\"What do I do now?\" You hesitated. \"I'm curious about Ashley's live, but what If this is the only time a can get a third option?\"<br>\r\n<br>\r\nYou thought about the circumstances. And no matter how you look at them everything was awkward and senseless. So you breathed deeply and take the risk of pushing the third button.</span></div></div>",
            "created":1327726800,
            "id":1266598,
            "title":"A Third Button"
        },
        "112112122":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Younger",
                "Older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A woman... but around what age</span></div></span></div>",
            "created":1327726800,
            "id":1266644,
            "title":"A woman"
        },
        "1121121222":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Young Adult",
                "Adult"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>An Older woman, as in A Young adult or Adult</span></div></span></div>",
            "created":1327726800,
            "id":1266645,
            "title":"Older"
        },
        "11211212221":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Nope, just a cute young woman's life",
                "OH Yes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A Young Woman then... Any twists?</span></div></span></div>",
            "created":1327726800,
            "id":1266646,
            "title":"Young Adult"
        },
        "112112122211":{
            "choices":[
                "Introducing yourself to your students",
                "Late on the afternoon"
            ],
            "content":"<div class=\"\"><div> <span>Your alarm clock sounded, it was early on Monday, still dark. You yawned walking directly to the bathroom. You got blind for a second because of the light. You splashed some water on your face and finally woke up. You were a mess. It took you long to get prepared, but finally you were on your way to school.<br>\r\n<br>\r\nYou felt nervous, but the fresh wind of the morning on your long red hair and the sensation of speed over your bike comforted you. This was going to be your first year as an official teacher.<br>\r\n<br>\r\nYou sighed and calmed yourself while approaching to the school entrance; but your heart suddenly skipped a beat of excitement by looking at the students arriving. You felt great.<br>\r\n<br>\r\n\"Professor Everett. Good morning.\" Professor Wheeler greeted you.<br>\r\n<br>\r\n\"Good morning Professor Wheeler.\" You answered with a big smile to the black hair woman.<br>\r\n<br>\r\n\"I see you are all cheerful today.\"<br>\r\n<br>\r\n\"I need to be, this is my first day working here.\"<br>\r\n<br>\r\n\"Today is just the Entrance Ceremony, so there's really little work.\" She shrugged. \"Tomorrow, is when thing will actually begin.\"<br>\r\n<br>\r\nThe bell announcing the beginning of the classes sounded.</span></div></div>",
            "created":1328331600,
            "id":1270740,
            "title":"The New Teacher"
        },
        "112112122212":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Yes",
                "No, a different twist"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you Pregnant?</span></div></span></div>",
            "created":1327726800,
            "id":1266647,
            "title":"OH Yes"
        },
        "1121121222122":{
            "author_id":"tjm8",
            "author_name":"TJM8",
            "choices":[
                "yes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you conjoined</span></div></span></div>",
            "created":1458709200,
            "id":2121581,
            "title":"No, a different twist"
        },
        "11211212221222":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you some sort of mythical creature?</span></div></span></div>",
            "created":1508821200,
            "id":2405760,
            "title":"other"
        },
        "112112122212221":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up with wings?</span></div></span></div>",
            "created":1508821200,
            "id":2405765,
            "title":"Yes"
        },
        "1121121222122211":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "You remember your other lives",
                "Flying lessons"
            ],
            "content":"<div class=\"\"><div> <span>You wake up after a long refreshing sleep. You lay there for a few minutes, loving the feel of the fluffy surface that you were sleeping on. Your eyes still closed, you sat up and stretched, feeling your massive, feathery wings stretch with your arms. You stood up, and, through blurry eyes from sleep you stared into the mirror across the room. You saw yourself, an angel in her prime age 500 years old, her wings almost fully grown, naked as all angels are. Today was an exciting day: It was the first of your flying lessons. Looking into the mirror as you twisted your waist length hair  into a braid that would fit nicely between your wings, you recalled the dream you had been having. So many things in that dream had been foreign to you: from the strange garments covering your body, to the strange thing between your legs, but in the dream, you had seen it as normal. After finishing braiding your hair, you prayed for an hour, and then walked through the cloud wall. For some reason, as you walked through the angel city, you felt a strange feeling, like you were being watched by everyone else on the street, judged for how you looked, but you knew this was impossible: Angels didn't have any concept of jealousy. Where were these dark emotions coming from? Taking a  mental note to pray later for guidance on what you should do about it, you sped up, not wishing to be late for your first flying lesson.   </span></div></div>",
            "created":1508821200,
            "id":2405773,
            "title":"Yes"
        },
        "11211212222":{
            "choices":[
                "Single",
                "Married"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And you are...</span></div></span></div>",
            "created":1328763600,
            "id":1273491,
            "title":"Marital Status?"
        },
        "112112122222":{
            "author_id":"jackthejackman",
            "author_name":"JackTheJackMan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a 40 year old married housewife with 2 children?</span></div></span></div>",
            "created":1575095700,
            "id":2753659,
            "title":"Married"
        },
        "1121121222221":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "see what's happening with Alex, grown female as teenage boy",
                "more with teen Alex as a married woman",
                "you choose"
            ],
            "content":"<div class=\"\"><div> <span>You loved your mother and wondered what it would be like as an adult and a female like her.<br>\r\nYou  opened your eyes and knew it worked.You were no longer in your room.This was not a teenage boy's small and messy private place this lavish bedroom belonged to a couple of grown ups. They looked like they were rich too.<br>\r\nYou knew you were different also.Your hair was longer and well maintained.You had breasts- big ones and your willy was gone.You didn't really miss it you were a virgin with no prospects.The you from this dimension's vagina had pushed out two babies!<br>\r\nYou sat up.You looked at your feminine hands with manicured nails.Your were wearing a revealing pink nightie.<br>\r\n \"Babe, are you alright?\"the guy laying next to you asked in a deep voice.You turned to him.He was muscular and Hispanic.He resembled a guy  who was in your school that was a football player except this guy was 40.You blushed and laughed.This goodlooking jock called you a babe<br>\r\n\"I had a bad dream.\"you said in the voice of a mature woman.\"i was in high school and I was a boy who wasn't popular.\"<br>\r\nYou got out of bed and walked over to a mirror.The new you was short and Hispanic!You also received a cultural change!You were beautiful with no resemblance to the white boy you were yesterday.<br>\r\nYour new husband got out of bed.He was wearing only boxers and towered over you.He grabbed you with big hands and said smiling\"You definitely aren't a teenage boy and you had lots of friends when we were in school.\"Instinctively you turn around and kiss Fernando on the lips.You have a flashback to your wedding at the same time.It was huge and you looked gorgeous in your white dress!<br>\r\nLater after your husband a hedge fund guy had gone to work and your kids- a boy and girl you fell in love with immediately had gone to school you went into the backyard to try a cigarette.Alex from here had started in college.You wondered how she was\" enjoying\"her new life. </span></div></div>",
            "created":1587153780,
            "id":2820185,
            "title":"Yes"
        },
        "11212":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You look at yourself in the mirror on the wall, some of your room has changed because you are a girl, like the mirror.<br>\r\n<br>\r\nYou have breasts nothing to big maybe avarage for a girl your age, not to mention you don't look to bad.<br>\r\n<br>\r\nYou look like an average teenage girl who has just woken up in her bedroom. <br>\r\n<br>\r\nYou go to get dressed, taking off your nightdress and finding something to wear, you eventually pick some jeans and a top.<br>\r\n<br>\r\nYou see your mom but she is pregnant and you appear not to have any siblings apart from yourself.</span></div></div>",
            "created":1584040380,
            "id":2800605,
            "title":"Your family"
        },
        "11213":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Continue",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>You look at yourself in the mirror on the wall, some of your room has changed because you are a girl, like the mirror.<br>\r\n<br>\r\nYou have pretty large breasts, not to mention you're damn hot.<br>\r\n<br>\r\nYou go to get dressed, taking off your nightdress and finding something sexy to wear.<br>\r\n<br>\r\nYou find a short skirt and a low cut tank top that will look so hot on you, you quickly change clothes and primp in front of the mirror. <br>\r\n<br>\r\nDeciding that you are sexy enough you go downstairs to get breakfast</span></div></div>",
            "created":1287637200,
            "id":978500,
            "title":"Something else"
        },
        "112131":{
            "choices":[
                "You got some more clothes to wear?",
                "Your mother came in and picked for you including bra and knickers "
            ],
            "content":"<div class=\"\"><div> <span>You hear a voice behind you say, young lady you March yourself up those stairs now and put your school uniform on as your not going to school dressed like that.<br>\r\n<br>\r\nI'll not have my 15 year old daughter showing off her body like that.<br>\r\n<br>\r\nYou ended back in your room and?</span></div></div>",
            "created":1443416400,
            "id":2040848,
            "title":"Continue"
        },
        "1121311":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                " At school ",
                " On your way one guy  started to flirt with you "
            ],
            "content":"<div class=\"\"><div> <span>You decided that  because your mom  doesn’t want you to go out  showing off your body  you’re going to show up even more of it . You then got a white female  see-through  tank top the  barely covered your big breast (you can even see her breast and nipples  completely because she’s not wearing a bra) and  you don’t wear any underwear  instead you put on short see-through white yoga pants (you can see her entire big butt clearly and also her vagina). You then  Grab your book bag and sneak out and  go to school .</span></div></div>",
            "created":1550638800,
            "id":2620518,
            "title":"You got some more clothes to wear?"
        },
        "11213112":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "Said no",
                " Got horny for him and said yes ( you’re now  incredibly attracted to guys) "
            ],
            "content":"<div class=\"\"><div> <span> While you were walking to school you feel your breasts  bouncing all over the place  which for some reason you really enjoyed  I love watching them bounce. Your hips also  Swayed  back-and-forth while her butt  jiggled and  you realize your walking like a girl. And  there was one guy who kept  looking at you and he followed you and  stopped and  started flirting with you .  He was a very handsome 18-year-old and  he  complemented you on  how big your breasts and butt were and  that you looked beautiful.  He then asked you to  skip school and come to his home  he then also gave you a big slap on your butt which  you thought felt good. And  when you look at he  to give him a response, you ....</span></div></div>",
            "created":1550700060,
            "id":2620523,
            "title":" On your way one guy  started to flirt with you "
        },
        "1121312":{
            "choices":[
                "She tries her best to keep the things to tomboyish apart from the underwear?",
                "she gets feminine, sexy and girly everything?"
            ],
            "content":"<div class=\"\"><div> <span>You go back upstairs and into your room and start to look around your room, you turn around and see your mother walk in and say, sorry darling you do look pretty but you can't go to school like that.<br>\r\n<br>\r\nHere and she picked out <br>\r\n<a rel=\"nofollow\" href=\"http://9zz.co.uk/new/clients/15fashionwize/uploads/5_hipsters/more/9.jpg\" target=\"_blank\">http://9zz.co.uk/new/clients/15fashionwi...</a><br>\r\n<a rel=\"nofollow\" href=\"http://cdn.shopify.com/s/files/1/0587/7413/products/Girls_grey_knee_high_sock_with_bow_large.jpg?v=1408287344\" target=\"_blank\">http://cdn.shopify.com/s/files/1/0587/74...</a><br>\r\n<a rel=\"nofollow\" href=\"http://media.peterhahn.co.uk/is/image/peterhahn/E/peter-hahn-blouse-white-708438_PACK_F_170712_092910.jpg\" target=\"_blank\">http://media.peterhahn.co.uk/is/image/pe...</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.countyschoolwear.co.uk/sites/default/files/imagecache/product_full/dl_1991_navy-500x500_0.jpg\" target=\"_blank\">http://www.countyschoolwear.co.uk/sites/...</a><br>\r\n<a rel=\"nofollow\" href=\"http://picture-cdn.wheretoget.it/dzoxh6-i.jpg\" target=\"_blank\">http://picture-cdn.wheretoget.it/dzoxh6-...</a><br>\r\n<br>\r\nYou look and start to get dressed, your mother sits on your bed and says, darling i know your a tomboy so i was a little shocked to see you in that skirt and top this morning, but if you want to start dressing more feminine while your at school i can get you some dresses, skirts, underwear and a new school uniform.<br>\r\n<br>\r\nyou continue getting dressed and you say \"yeah mum thanks\" Well honey at least it would mean if you felt feminine you could have a chose between tomboy or feminine clothes.<br>\r\n<br>\r\nYou go to school and your mother gets your new clothing, but what does she get?</span></div></div>",
            "created":1454734800,
            "id":2100279,
            "title":"Your mother came in and picked for you includin..."
        },
        "11213122":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "Conservative but highly feminine",
                "Hot and sexy!"
            ],
            "content":"<div class=\"\"><div> <span>It was very different. Not only 'being' a girl, but how different things were for you in school. You found yourself alone as the new girl in school. Partly because you realized that the other girls were jealous of your looks, but also because you had to fight off the advances of several boys.That caused a real problem. First, you were repelled by them because, as a boy yourself until recently, you knew what they were thinking when they were talking to you, and it scared you. But second, it also turned you on! You found that you were  now attracted to boys!<br>\r\n<br>\r\nIt was a very confused girl who walked home!<br>\r\n<br>\r\nYou walk in the door and your mother comes up to you excited. \"Emily! I had the most wonderful day picking things out for you! Come on and see what you got!\"<br>\r\n<br>\r\nIn your bedroom, your bed was filled with bags and boxes. A quick look told you that most of the clothing was...</span></div></div>",
            "created":1575058380,
            "id":2753462,
            "title":"she gets feminine, sexy and girly everything?"
        },
        "112132":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                " Boyfriend and girlfriend For more than 3 years ",
                "Best friends forever "
            ],
            "content":"<div class=\"\"><div> <span>While you look in the mirror you take a few minutes to look at your body. Your breasts are really big and perky now that you look at them. Your probably a G cup tho you might be bigger. And you see your nipples which big, soft and pink and are now hard. You checked out your hight and you shrunk an  entire foot and now your 5,2 feet. You then check your waist and stomach and it was hairless and smooth and you were skinny. Then you looked at your hips and butt. You had really wide  hip to perfectly match your really big breast so you have a perfect beautiful hourglass figure. And your butt was also really big too. “Man I’m just getting the best body today” and then you see you very slim arm and legs. All your muscles were gone. Then you felt the empty space in your Crouch and you looked and see your shaved, cleaned, pale, and virgin vagina. “So this is what it feels to be a virgin girl” and then you look at your face and you see beautiful yet very cute girl with bright blue eyes and long  platinum blonde hair. You also find out the you don’t have any earrings and your ears have never been  pierced . You let out a sigh of relief. And you hear your cute and gentle voice. You then check your birthday and it’s still tomorrow and you’ll be turning 16. You  decide to continue inspecting your room. It’s  basically the same only with the mirror you guess you must be a tomboy in this life. You look at all your clothes and all you find is mini skirts, yoga pants and very revealing see through tank top. And you see that you don’t have any bras or panties. So are  actually happy  especially for the bra ,you wanted your breasts to be free. You don’t know why you have all these revealing clothes. But  you’re going to be late so you put on the tank top (people can see your nipples through it) and  they barely contain your breasts. And  you put on the mini skirt and you  bend over to pick something up and you see in the mirror that your butt is now on full display. But you decided  you’re going to have to do with it and it  could be fun . And  you finally go  downstairs . And you eat breakfast and  quickly say goodbye to your mother. You then  run to the bus stop and both of your boobs  pops out of your tank top but you  don’t realize it. You then see your best friend since you were little James.  What relationship do you have with him in this life.</span></div></div>",
            "created":1559899500,
            "id":2669949,
            "title":"Something Else"
        },
        "1122":{
            "author_id":"3oct1111",
            "author_name":"Wendy",
            "choices":[
                "You still see yourself but your a girl now",
                "Your gonna become a girl",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I awoke the next morning and quickly looked at my body, it was the same as always. But then I got a look at my room, it wasn't the same it was a girls room, you where in girls cloths!</span></div></span></div>",
            "created":1329627600,
            "id":1280074,
            "title":"wake up as myself- nothing has changed"
        },
        "11221":{
            "author_id":"astrolight",
            "author_name":"Froslad",
            "choices":[
                "Everyone thinks, treats and sees you as a girl",
                "Another choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does that mean everything thinks your a girl.</span></div></span></div>",
            "created":1385960400,
            "id":1702102,
            "title":"You still see yourself but your a girl now"
        },
        "112212":{
            "author_id":"3oct1111",
            "author_name":"Wendy",
            "choices":[
                "Yes",
                "Try again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does that mean that physically your all girl but for some reason still see you?</span></div></span></div>",
            "created":1429592400,
            "id":1967401,
            "title":"Another choice"
        },
        "11222":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "You find that is the Matt who was one of your best friends",
                "Oh no! It is the Matt who was your worst enemy!"
            ],
            "content":"<div class=\"\"><div> <span>I didn't know what was going on. When I woke up and looked around, this clearly looked like a girl's room! I saw posters of guys and boy bands. I saw a vanity with makeup! Stuffed animals were on shelve and on my bed. My bed cover was a pink flower pattern. I sat up, wondering if I was a girl! My hands went over my body. I didn't have breasts, and my cock was still there! Okay? But I was dressed in a pink nightie and wearing white panties. When I got up, I saw myself in the mirror but dressed in girl's clothing!<br>\r\n<br>\r\nSuddenly, my bedroom door opened! I was in shock! There was no way of hiding me standing here in girl clothing! My mom stuck her head in! \"Oh good! I am glad to see that you are up Emma!\" She stepped in, \"I know that Matt is picking you up at 2, but I need your help before you leave. Get dressed and come down stairs so we can have some breakfast and get started!\" Then she left the room!<br>\r\n<br>\r\nI was stunned! Not only did she see nothing wrong with me, she thought that I was a girl! Or did she? Maybe boys wear girl clothing in this world? Well, either way, I guessed that I would find out in time. For now, I needed to get ready. When I went into the bathroom, I didn't care about what others thought I was, I peed standing up!  I showered using girly shampoo that made my hair smell pretty. When I was all done in the bathroom, I headed back to my room. I realized that I didn't have a comb, so I had to use a hair brush. I looked at the makeup a long time. It seemed to be mine of course, but did I really want to wear it? And if I didn't, would I stand out? Be considered odd? I decided to compromise and wear some, but not much. The funny thing was, I seemed to know what to do, even though I never wore makeup before in my life.<br>\r\n<br>\r\nGetting dressed was different. Of course, all of the clothes were girl's clothing, and to my dismay, a majority of what would cover my lower half seemed to be skirts and dresses. I wasn't ready for that though, even if it was normal in this world, so I picked out some jeans and a top. The jean's were definitely girl cut, and the top was pink, but they seemed to be the least girly things I now owned! I did run into one issue in particular though. When getting some underwear, which of course were all panties, I saw that I had a large selection of bras! I hesitated a long time, but the fact that there were so many told me that it must be something I normally wore every day. I didn't like it, but I opted not to take chances, and with less trouble than I expected, I put one on. The fact that it was easy for me to do, like the makeup, somewhat confirmed that I was right. I normally did wear bras.<br>\r\n<br>\r\nI went down stairs, and as soon as we finished breakfast, my mom said, \"Okay honey. You take care of the dishes, and when you are done, clean the upstairs bathroom. You should be done in plenty of time to make yourself pretty for Matt before he comes. I hope it is a good movie that you go to!\"<br>\r\n<br>\r\nMake myself pretty for a guy!?!? Did I have a boyfriend in this world? Not really being a girl, that could make things awkward for me, of course, again, unless it was normal in this world. This was so confusing!<br>\r\n<br>\r\nEither way, I did what I considered my 'girl chores', and then took another shower. Cleaning the toilet was yucky! Yucky? Where did that come from? I cleaned up, and brushed my short hair, and for some reason, I went all out with the makeup. If I were taking a girl to the movies, I would expect her to look nice, so I braced myself and picked out a nice skirt and top. Nothing fancy, but much more feminine than I would have liked. I had just finished when the doorbell rang, and sure enough, my mom called up the step that Matt was there. I didn't even know who this guy was yet. For that matter, I didn't know if I was his girlfriend or if this was our first date! Well, there was only one way to find out, I went down the steps.</span></div></div>",
            "created":1579287600,
            "id":2774916,
            "title":"Your gonna become a girl"
        },
        "112222":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "My hair had grown",
                "I was growing breasts"
            ],
            "content":"<div class=\"\"><div> <span>When I got down the stairs, I was stunned! It was Matt Harris! He had been my worst nightmare since the fourth grade! He was as big and strong looking in this world as he was in the one that I came from! And I couldn't help noticing that he had a slight bulge in his crotch, so it didn't seem like he was a girl dressed as a guy. And he was tall!<br>\r\n<br>\r\nI guess my hesitation came off as shyness because my mom stepped in, \"Now, you understand the rules? She needs to be back by 9pm. No excuses for being late, or the two of you won't have a second date. Understood?\"<br>\r\n<br>\r\nIt was a little funny to see Matt the bully being put in place by my mom! He answered, \"Yes ma'am.\" A bit sheepishly. Then he looked at me with a smile, \"You look great Emma! Are you ready to go?\" He held out his hand.<br>\r\n<br>\r\nOkay, this was too weird! But I didn't have much choice until I had a better idea of where this life was taking me. I hesitated, then took his hand, \"Ready!\" I tried to sound like I was happy about it. He walked me to a local restaurant, holding my hand the whole time. Something felt like it was changing in me the whole time I was in contact with Matt, but I couldn't figure out what.<br>\r\n<br>\r\nWhen we got to the restaurant, I saw my reflection in the one window and got a bit of a shock. What I saw was....</span></div></div>",
            "created":1579288500,
            "id":2774922,
            "title":"Oh no! It is the Matt who was your worst enemy!"
        },
        "1122222":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "Give in and let him kiss you",
                "Tell Matt that you need to go to the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>Was it even possible? How? I tried not to show it, but I glanced down at my chest. It only took a small glance to see that my chest was more puffy than before! Not really breasts yet. More like a young girl who was just starting to get them, but it was also more than any normal male would have, and more than I had this morning! Now I was really glad that I had worn a bra!<br>\r\n<br>\r\nThere were other things too. Here I was with Matt, a guy who I should be hating right now, but I didn't. In fact, I liked his attention, and, well, I was enjoying being with him. Not that he wasn't picking on me, I found that he had a great sense of humor! Before the food came, and after, he seemed to really like holding my hand, and I didn't mind. However, I did notice that the changes in me seemed to happen a little faster when I was in physical contact with him. The feelings didn't go away when he didn't though. By the time we were done eating, I noticed two things. I could now feel the weight of my breasts, which were now undeniable. Also, I felt a tickle on my neck, and sure enough, When I saw my reflection in another window, I could see that my hair had grown much longer than it had been!<br>\r\n<br>\r\nI enjoyed the time with Matt, but now I was getting scared as we walked toward the theater. I was scared because of the thought of what was happening to me, and also because I knew what I would be doing with a girl in the theater on a date, and it wasn't watching the movie! Matt bought our tickets, and I almost thought that Matt seemed as nervous as I felt. Sure enough, Matt led the way to the back row. He only held my hand until the lights went low, an the moment that I was dreading was fast approaching. He let go of my had and put an arm around my shoulder. Soon, he was pulling me close. I knew what he wanted, but I was still a male where it counted. How could I kiss 'another' guy. There was another part of me though. A part that liked what I was feeling. A part that wanted to kiss Matt! What to do!?!?</span></div></div>",
            "created":1582591440,
            "id":2792402,
            "title":"I was growing breasts"
        },
        "11222221":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue in the theatre ",
                "Somewhere else "
            ],
            "content":"<div class=\"\"><div> <span>I sat still thinking but then I felt Matt kiss me and although the hand holding in the restaurant exelarated the charges the kissing made the changes happen even faster.<br>\r\n<br>\r\nWe kissed as a I felt a numb tightness between my legs.<br>\r\n<br>\r\nMatt pulled away and said \"you are beautiful Emma\" you smiled and moved forward to kiss him again as the compliment felt nice.</span></div></div>",
            "created":1587104760,
            "id":2820024,
            "title":"Give in and let him kiss you"
        },
        "11223":{
            "author_id":"genghiskhan",
            "author_name":"NotTheGuy",
            "choices":[
                "Role Reversal",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why are you wearing girls clothes? <br>\r\nIs it because men and womens roles are reversed? Now a girl now. <br>\r\n</span></div></span></div>",
            "created":1337576400,
            "id":1342055,
            "title":"Girls Clothes? Thats not right!"
        },
        "112232":{
            "author_id":"genghiskhan",
            "author_name":"NotTheGuy",
            "choices":[
                "Yes.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Men are incredibly rare so their interests, fashion and so forth are ignored. They dress like women and are second class citizens. Men are born about 1 in 100.</span></div></span></div>",
            "created":1337576400,
            "id":1342059,
            "title":"Man shortage."
        },
        "1122322":{
            "author_id":"kinect",
            "author_name":"Vortex",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if you aren't even supposed to be there and wake up with a girl version of yourself who freaks out</span></div></span></div>",
            "created":1399784400,
            "id":1795079,
            "title":"Something else"
        },
        "1123":{
            "author_id":"jasrite321",
            "author_name":"Jas",
            "choices":[
                "You’re sharing a body with a girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something else...?</span></div></span></div>",
            "created":1598329680,
            "id":2890975,
            "title":"something else"
        },
        "11231":{
            "author_id":"jasrite321",
            "author_name":"Jas",
            "choices":[
                "Your sister",
                "Your friend/crush"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are sharing a body with a girl, but with whom?</span></div></span></div>",
            "created":1598330160,
            "id":2890977,
            "title":"You’re sharing a body with a girl"
        },
        "112312":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "you have one day and she has",
                "one of you got randomly control",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how should this work out?</span></div></span></div>",
            "created":1598345580,
            "id":2891059,
            "title":"Your friend/crush"
        },
        "113":{
            "choices":[
                "Science",
                "Field Study",
                "After Class"
            ],
            "content":"<div class=\"\"><div> <span>You chose the bubble on your right and suddenly wake up. You aren't in your room; you're in a large, opulent room with all manner of expensive things you had always wanted, but could never afford. You wondered how you got there when the door opened to reveal your neighbor. However, he was dressed in a butler's uniform. <br>\r\n<br>\r\n\"Master Jake,\" he called you, \"Your breakfast is ready in the dining room. You'd better hurry up, sir, or you will be late for class. I can't speed in a limousine.\"<br>\r\n<br>\r\nMaster Jake? you thought to yourself. Why was your neighbor acting as though you were rich and he served you? Then you remembered what the voice had said. This must be your second life! In this dimension, you were rich!<br>\r\n<br>\r\nJumping out of bed with joy, you find your closet filled with the latest fashions. Throwing on the coolest clothes you have ever seen, you run downstairs and find the dining room. Even though you have never been here before, you know exactly how the mansion is set up. Finishing a full-course meal as quickly as a bowl of cereal due to your excitement, you rush out to the limo and your neighbor-turned-servant drives you to the University for your first class. </span></div></div>",
            "created":1355634000,
            "id":1489033,
            "title":"Your Second Life"
        },
        "114":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "something in medivial times",
                "something in the future",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are some selections for me:</span></div></span></div>",
            "created":1399870800,
            "id":1795232,
            "title":"Coose what you want!"
        },
        "115":{
            "choices":[
                "You try to talk but it comes out butchered. ",
                "An adult, older sibling enters the room ",
                "Find a new life"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly Jake shot up in bed in the dark. Everything suddenly smelled old and weird. Blankets surrounding you feel bulky, and rough. You go to move them, but they hit something, so you feel it and go it's a metal safety bar attached to your bed, confused even more you start to get up. But then I light turns on, in seconds you take in this rooms muted, and faded colors, the walls were a cream tone that matched bedding of a queen sides bed next to your own. The lamp even has faded likes on it. For a second you aren't sure, but the hand working the lamp looks wrinkly and thin. <br>\r\n<br>\r\nIn fact in the queen-sized bed she's a small old woman in a nightgown and hat, her elderly husband, with hair both Gary and missing slowly sits up. <br>\r\n\"Huh? What's wrong dear?\" He asks his wife. <br>\r\n\"Sorry just checking on Jakey. Are you alright sweetheart?\" She asks as she comes out of bed and comes towards you. Confused, all you mutter out is \"okay...\" But she dosen't seem to take your word for it. She pulls back your blankets and you see you are wearing nothing but an old boy's nightgown with strips. She lifts it up though and even your surpised to see yourself wearing a cloth diaper.<br>\r\n<br>\r\nIn this world you are the youngest, if only, son of some very old parents. Who dot on and care for you, with a weak body and small brain- mama had to be almost 50 when she had you, if not somehow older.</span></div></div>",
            "created":1501477200,
            "id":2362338,
            "title":"Coose what you want!"
        },
        "12":{
            "choices":[
                "I love Love Stories",
                "I want to go on a Epic Quest",
                "I'm curious about the future, so a Futuristic Spy-Fi one",
                "I'm excited by Mysteries and Thrillers",
                "If there is no risk... maybe A Horror Story..."
            ],
            "content":"<div class=\"\"><div> <span>Emily sighed.<br>\r\n<br>\r\n\"I would love to live something like this* She said closing her eyes imagining herself as the heroine of the book she just finished. \"Marco!\" She sighed hugging her pillow laying on the bed.<br>\r\n<br>\r\nEmily was an average girl with an average life. She never complain of her life, but sometimes she just felt a little bored. Most of her time was spent at the school  and her little free time between friends and her books. Nothing really change.<br>\r\n<br>\r\nShe walked to her boudoir and observed herself in the mirror. She was cute whit her long, curly brunet hair. She wore a little pair of glasses that frame her kindly honey eyes. She was curious of what would be of her with a different kind of life. What kind of adventures, mysteries, and romances she might live. Romances, eh? She pressed her finger on her strawberry lips and then on the mirrored image of them.<br>\r\n<br>\r\nEmily closed her eyes and sighed again. What was she thinking? She look the mirror again and got surprised noticing that her reflection wasn't a mirrored image of her.<br>\r\n<br>\r\n\"Do you really want experience the adventures of which you have read of?\" The mirrored Emily asked from behind the glass smiling.<br>\r\n<br>\r\nThe girl didn't know what to say. She gulped. What was occurring there? Was she dreaming? What?<br>\r\n<br>\r\nEmily was silently nervous looking at her reflection which was smiling her waiting for her answer.<br>\r\n<br>\r\nThe girl breathed deeply and gained courage to answer honestly. \"Yes, I do really want to have my own adventure.\" Said as firmly as her fear let her.<br>\r\n<br>\r\nHer reflection giggled. \"Then, when you wake up tomorrow, your wish will be granted.\"<br>\r\n<br>\r\n\"Just like that?\"<br>\r\n<br>\r\n\"Yes.\" The image confirmed. \"But I warning you that it will be just a glimpse. And when it ends it would be as if it had been just a dream.\" She smiled.<br>\r\n<br>\r\n\"Not exactly, but nearly.\" The mirror Emily giggled. \"So what kind of adventure would you like to live?\"</span></div></div>",
            "created":1328763600,
            "id":1273503,
            "title":"Emily"
        },
        "121":{
            "choices":[
                "Historical",
                "Actual",
                "Futuristic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"What kind of Love stories do you prefer?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273506,
            "title":"Love Stories Subdivision"
        },
        "1211":{
            "choices":[
                "Medieval Age",
                "Victorian Age",
                "Another Age"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"In which age?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273507,
            "title":"Historical"
        },
        "12111":{
            "choices":[
                "The Heroine, of course",
                "The Hero... maybe..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Are you the heroine or maybe the hero?\" the mirrored Emily giggled.</span></div></span></div>",
            "created":1328763600,
            "id":1273508,
            "title":"Your gender"
        },
        "121112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you mean I could be a prince?</span></div></span></div>",
            "created":1399870800,
            "id":1795228,
            "title":"The Hero... maybe..."
        },
        "12112":{
            "choices":[
                "The Heroine, of course!",
                "The Hero... maybe..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Are you the heroine or maybe the hero?\" the mirrored Emily giggled.</span></div></span></div>",
            "created":1328763600,
            "id":1273509,
            "title":"Your Gender"
        },
        "12113":{
            "choices":[
                "Nazi Europe",
                "Another age 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"In which age?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273510,
            "title":"Another Age 1"
        },
        "121131":{
            "choices":[
                "Heroine",
                "Hero"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Are you the heroine or maybe the hero?\" the mirrored Emily giggled.</span></div></span></div>",
            "created":1328763600,
            "id":1273512,
            "title":"Nazi Europe"
        },
        "1211312":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe you are Graf Staffenberg?</span></div></span></div>",
            "created":1587027060,
            "id":2819584,
            "title":"Hero"
        },
        "121132":{
            "choices":[
                "USA 20's",
                "Another Age"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"In which age?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273511,
            "title":"Another age 3"
        },
        "1212":{
            "choices":[
                "High School",
                "College",
                "Adulthood"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>At which point of your life does this take place?</span></div></span></div>",
            "created":1328763600,
            "id":1273514,
            "title":"Actual Time"
        },
        "12121":{
            "choices":[
                "A female student, of course!",
                "A male one... maybe."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Are you a female student or maybe a male one?\" the mirrored Emily giggled.</span></div></span></div>",
            "created":1328763600,
            "id":1273515,
            "title":"High School student"
        },
        "12122":{
            "choices":[
                "A female student, of course!",
                "A male one... maybe."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Are you a female student or maybe a male one?\" the mirrored Emily giggled.</span></div></span></div>",
            "created":1328763600,
            "id":1273516,
            "title":"College student"
        },
        "12123":{
            "choices":[
                "A Woman!",
                "A Man..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Are you a woman or maybe a man?\" the mirrored Emily giggled.</span></div></span></div>",
            "created":1328763600,
            "id":1273518,
            "title":"Adulthood"
        },
        "1213":{
            "choices":[
                "One with lots of robots and technology",
                "I like Space Traveling",
                "I'm... not sure."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"What kind of future do you imagine?\" The mirrored Emily asked curious.</span></div></span></div>",
            "created":1328763600,
            "id":1273520,
            "title":"Futuristic"
        },
        "12131":{
            "choices":[
                "A Futuristic Heroine!",
                "I'm not sure, but I'll take the hero roll..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Are you the heroine or maybe the hero?\" the mirrored Emily giggled.</span></div></span></div>",
            "created":1328763600,
            "id":1273521,
            "title":"Gender choice"
        },
        "12132":{
            "choices":[
                "A Space Girl!",
                "Maybe I'll try the guy roll... I'm curious."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Are you the heroine or maybe the hero?\" the mirrored Emily giggled.</span></div></span></div>",
            "created":1328763600,
            "id":1273522,
            "title":"Gender"
        },
        "12133":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>there could be something like star trek like</span></div></span></div>",
            "created":1399870800,
            "id":1795229,
            "title":"I'm... not sure."
        },
        "122":{
            "choices":[
                "I like being human",
                "I wondered if I can be Tolkien kind Elf",
                "Another race"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Do you want to stay human or maybe try another magic race?\" Emily's reflection asked her with a curious look on her eyes.</span></div></span></div>",
            "created":1328763600,
            "id":1273524,
            "title":"Your Race"
        },
        "1221":{
            "choices":[
                "Most are warriors and militaries",
                "Some are wizards and scholars",
                "And there's always mercenaries and assassins"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"And what does a human do in this world?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273526,
            "title":"I like being human"
        },
        "12211":{
            "choices":[
                "\"A sword girl\" Emily smiled.",
                "\"A sword man\" Emily answered shyly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So are you a sword girl or a sword man?\" Emily image giggled from the mirror.</span></div></span></div>",
            "created":1328763600,
            "id":1273528,
            "title":"Most are warriors and militaries"
        },
        "12212":{
            "choices":[
                "\"A witch\" Emily answered cheerfully.",
                "\"A warlock? Maybe\" Emily answered shyly."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So, are you a witch of a warlock?\" Emily smiled kindly.</span></div></span></div>",
            "created":1328763600,
            "id":1273529,
            "title":"Some are wizards and scholars"
        },
        "12213":{
            "choices":[
                "\"I'm the most lethal woman of the kingdom!\" Emily laughed.",
                "\"I'm the shadow that no girl can't resist.\"  Emily joked."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oh! That sounds scary.\" The mirror Emily laughed gently. \"So, are you a femme fatal or a shadows guy?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273532,
            "title":"And there's always mercenaries and assassins"
        },
        "1222":{
            "choices":[
                "\"An archer...\" Emily hesitated.",
                "\"I want to try elf magic and healing arts!\" Emily smiled.",
                "\"I like swords...\" Emily thought out loud."
            ],
            "content":"<div class=\"\"><div> <span>\"A Tolkien one?\" Emily's image asked confused.<br>\r\n<br>\r\n\"I mean a beautiful one!\" Emily said a little annoyed by the question. \"I would kill myself ending as a Rolling or Christmas one!\"<br>\r\n<br>\r\n\"Ok.\" Said the mirror Emily. \"So what might you do as one of this Tolkien elfs?\"</span></div></div>",
            "created":1328763600,
            "id":1273534,
            "title":"I wondered if I can be Tolkien kind Elf"
        },
        "12221":{
            "choices":[
                "\"What are you asking! A lovely and sexy elf girl of course!!\" Emily sentenced.",
                "\"A guy one?\" Emily asked surprised. \"Well, maybe...\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So are you still a girl or might try a guys point of view?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273535,
            "title":"Archer"
        },
        "12222":{
            "choices":[
                "... a Priestess is the obvious answer.\" Emily said.",
                "... a Priest? So I can't even try a guys point of view?\" Emily asked surprised."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So you want to be a Priestess or a Priest?\" The girl en the mirror asked.<br>\r\n<br>\r\n\"That sounds like some other RPG, but...</span></div></span></div>",
            "created":1328763600,
            "id":1273538,
            "title":"Magic and Healing Art"
        },
        "12223":{
            "choices":[
                "\"Sword girl or course!\"",
                "\"Sword man?\" She hesitated. \"As long as I remain young...\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So a sword girl or maybe a sword man?\" The mirrored Emily giggled.</span></div></span></div>",
            "created":1328763600,
            "id":1273540,
            "title":"Sword Dancer"
        },
        "123":{
            "choices":[
                "\"Space travels with lots of Spaceships battles!\"",
                "\"I love robots and cyberpunk environments!\"",
                "\"I want to try virtual reality.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oh! A Spy-Fi story!\" The mirrored Emily exclaimed excited. \"What kind of future do you see then?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273542,
            "title":"What kind of future you see?"
        },
        "1231":{
            "choices":[
                "\"I might enlist in the space army...\"",
                "\"Space mercenaries and spies seems to have more adventures...\"",
                "\"I want to be some sort of Jedy... If possible.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"As what do you what to live that future?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273544,
            "title":"Space, The Last Frontier"
        },
        "12311":{
            "choices":[
                "\"As a girl!\"",
                "\"Could I be a guy?\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"And would you enlist on it as a girl or as a boy?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273549,
            "title":"Enlist on the space army"
        },
        "12312":{
            "choices":[
                " \"I'm the most lethal woman of the galaxy!\" Emily laughed.",
                "\"I'm the shadow that no girl can't resist.\" Emily joked."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oh! That sounds exciting.\" The mirror Emily laughed gently. \"So, are you a femme fatal or a shadows guy?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273551,
            "title":"\"Space mercenaries and spies seems to have ..."
        },
        "12313":{
            "choices":[
                "\"A girl obviously!\"",
                "\"Can I be a boy?\""
            ],
            "content":"<div class=\"\"><div> <span>\"So you don't just want the technology but also want some sort of magic powers?\" The image smiled interested.<br>\r\n<br>\r\n\"Well, is my fantasy, isn't it?\" Emily replied shyly completely red.<br>\r\n<br>\r\n\"Don't worry!\" The girl on the mirror giggled kindly. \"So would you like to be a jedy girl or maybe a jedy boy?\"</span></div></div>",
            "created":1328763600,
            "id":1273555,
            "title":"The Jedy Life"
        },
        "123132":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "wish granted"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>since Luke Skywalker is a boy you think that you also should be one if possible</span></div></span></div>",
            "created":1399870800,
            "id":1795231,
            "title":"\"Can I be a boy?\""
        },
        "1232":{
            "choices":[
                "A Privet Detective.",
                "A Special Police officer with a cybernetic suit.",
                "Someone with paranormal powers."
            ],
            "content":"<div class=\"\"><div> <span>\"Cyberpunk? What's that?\" The Emily in the mirror asked confused.<br>\r\n<br>\r\n\"It's the is a postmodern and science fiction genre noted for its focus on high tech and a decadent socially.\" Emily explained.<br>\r\n<br>\r\n\"I don't get it completely, but what would you be in such a world?\"</span></div></div>",
            "created":1328763600,
            "id":1273563,
            "title":"Cyberpunk way"
        },
        "12321":{
            "choices":[
                "A sexy Woman!",
                "Maybe a scruffy Man..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So a private detective... A woman or a Man?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273566,
            "title":"A Private Detective"
        },
        "12322":{
            "choices":[
                "\"A girl with out doubt!\"",
                "\"Can I chose to be a boy?!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oh! A Special Police Agent! Sounds amazing!\" The Emily in the mirror praised you excited. \"And would you like to be a girl or a boy?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273569,
            "title":"Special Agent"
        },
        "12323":{
            "choices":[
                "\"I'm a girl and I want to stay like that!\" Emily settled.",
                "\"Mmm... I can be the strongest paranormal fighter as a man.\" Emily joked."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"That sounds scary.\" The Emily on the mirror said a little nervous. \"So would you be a esper girl or a over powered boy?</span></div></span></div>",
            "created":1328763600,
            "id":1273571,
            "title":"Paranormal Future"
        },
        "1233":{
            "choices":[
                "A Matrix kind",
                "A .Hack one",
                "I'm not sure..."
            ],
            "content":"<div class=\"\"><div> <span>\"So a virtual life...? Doesn't it feel a little redundant?\" The mirrored version of Emily said a little confused.<br>\r\n<br>\r\n\"Now that you mention it... a little.\" Emily accepted, \"But is a way to get two for the price of one.\" The girl laughed.<br>\r\n<br>\r\n\"That's cheating.\" The reflection accomplice giggled. \"But what kind of virtual world would be?\"</span></div></div>",
            "created":1328763600,
            "id":1273573,
            "title":"Virtual Life"
        },
        "12331":{
            "choices":[
                "\"I'm not Trinity, but I'm a girl.\" Emily giggled.",
                "\"I'm not Neo, but I would like to try a guy's pv.\" Emily giggled."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So are you Trinity of Neo, Miss Emerson?\" The reflection parodied the agent Smith.</span></div></span></div>",
            "created":1328763600,
            "id":1273574,
            "title":"In the Matrix"
        },
        "12332":{
            "choices":[
                "A girl",
                "A boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So you want to try a world with a virtual video game, right?\"<br>\r\n<br>\r\n\"Yep.\" Emily smiled to her confused reflection.<br>\r\n<br>\r\n\"Ok, so what are you going to be in the in between world?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273575,
            "title":"Virtual Games"
        },
        "123321":{
            "choices":[
                "A girl also",
                "A boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"And your character would be...?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273576,
            "title":"Your Avatar Gender"
        },
        "123322":{
            "choices":[
                "A boy also",
                "A girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"An you will play as a...?\"</span></div></span></div>",
            "created":1328763600,
            "id":1273577,
            "title":"Your Character Gender"
        },
        "124":{
            "choices":[
                "The detective kind",
                "The villain ",
                "The dragged in one"
            ],
            "content":"<div class=\"\"><div> <span>\"I like Agatha Christie, Eco and Conan Doyle books.\" Said excited Emily's counter part.<br>\r\n<br>\r\n\"Me too.\" Emily giggled. \"But Brown and Katzenbach aren't that bad also.\"<br>\r\n<br>\r\n\"Or even Gosick and Death Note can be options to experience a mystery.\"<br>\r\n<br>\r\n\"Yeah!\"<br>\r\n<br>\r\n\"So what roll do you want to play?\" Said even more excited Emily's reflection.</span></div></div>",
            "created":1328763600,
            "id":1273582,
            "title":"I'm excited by Mysteries and Thrillers"
        },
        "125":{
            "choices":[
                "Mysterious deaths",
                "Vampires and other Dark Beings ",
                "A traditional Ghost Story"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh!\" Said gloomily the girl in the mirror. \"So you actually like ghooosssst stoorriiiieeessss!\"<br>\r\n<br>\r\n\"Ah! Don't say it that way!\" yelled Emily scared. \"I change of mind already!\"<br>\r\n<br>\r\n\"Come one, I was just playing.\" Tried to comfort her real self still containing a laugh. \"I was just kidding.\"<br>\r\n<br>\r\n\"Really?\" Said a little Emily hugging her pillow.<br>\r\n<br>\r\n\"Yep!\" The other girl smiled. \"So what kind of characters do you like?\"</span></div></div>",
            "created":1328763600,
            "id":1273589,
            "title":"Boo"
        }
    },
    "info":{
        "author_id":"galaxia111",
        "author_name":"just some Guy",
        "brief_description":"You got the power to escape from your life into your life in another dimension.",
        "created":1262045220,
        "description":"<td align=\"left\" class=\"norm\">Some people on this planet have the luck to get a second life in another dimension. When they sleep they can choose in which dimension they want to go. One day you got this incredible power. The other dimension is just like our known real dimension but you will have a new family, new town to life in and of course a new body.<br>\r\n<br>\r\nPlease just follow this storyline and don't kill the main character in the real or the other dimension. Remember that all the people in the second dimension have another life in the real dimension too. <br>\r\n<br>\r\nAt least write what goes along with the story and your way of life. <br>\r\n(the real or the second one ^^)</td>",
        "id":1630689,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1598345580,
        "modified":1598345580,
        "pretty_title":"You and your second life"
    }
}