{
    "chapters":{
        "1":{
            "author_id":"zathura",
            "author_name":"Princess Zathura",
            "choices":[
                "Close Early",
                "Wait a Bit Longer"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\"><b>Wednesday, 17:05.</b><br>\r\n          The middle of the week. Alexandra had been waiting faithfully for a costumer to come in and at least look at something for the past three hours, but none had. She ran a small bookstore, a quaint little place, snuggled tightly between a candle shop and a music store. There was nothing fancy about it, this place held no secrets she had yet to uncover, but yet... The books themselves were always an adventure to her. A new land to be discovered, or a new tale to be told. They were her friends, her family, and her lovers. But sometimes, even they were too much for her. She needed some alone time with her new friend, cable. All she ever did was read, for once, she didn't want to read, she just wanted to think of nothing for a few hours. <br>\r\n          Aged at twenty years, she was in the prime of her life. She was happy and healthy, she was working her way through college, and like any twenty year old, she had friends whom she hung out with regularly (apart from her books). Today, of all days, she just felt tired. Her eyes were beginning to hurt from the amount of reading she had to do for her college work, not to mention bills and the like. She just wanted to sleep, too bad the store didn't close for another three hours. Then again, business was slow, what would be the harm of closing up a little early today???</span></span></div></div>",
            "created":1295066100,
            "id":1035627,
            "title":"The Hopeless Romantic"
        },
        "12":{
            "author_id":"zathura",
            "author_name":"Princess Zathura",
            "choices":[
                "Normal Old Woman?",
                "Crazy Old lady",
                "She's a Witch!"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">          Unfortunately, she remembered, if she were to go home, there would be too many distractions and she wouldn't have time to finish studying. The shop was peaceful and quiet. This paper was due before midnight, so she might as well get it done. It wasn't like there would be any customers to disturb her.<br>\r\n          As fate would have it, just as she finished that thought, the bell on the door rang as in came an old woman.</span></span></div></div>",
            "created":1304272980,
            "id":1098035,
            "title":"Wait a Bit Longer"
        }
    },
    "info":{
        "author_id":"zathura",
        "author_name":"Princess Zathura",
        "brief_description":"This is what happens when you're surrounded by books 24/7.",
        "created":1295062920,
        "description":"<td align=\"left\" class=\"norm\">Basically you (Alexandra), after being surrounded by nothing but books all day and all night for extended periods of time with very little human contact, your dreams become to mimic certain fairytales you've read and you begin to see a man (Romeo, no I couldn't think of a better name, an incubus infamous for luring girls into his world by playing with their dreams) appearing behind every corner, but is this man real? That is the question, or is he merely just a figment of your imagination?<br>\r\nSex is allowed (between Romeo and Alexandra) further into the story and so is masturbation, BUUUUUUUUUT that's it.<br>\r\n<br>\r\nMost of this is going to take place in Alexandra's dreams/ fairytales, but at the end of each story she should wake up, head to her bookstore, commute home, and then return to dreamland.</td>",
        "id":1741912,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1306096020,
        "modified":1306096020,
        "pretty_title":"A Little Fantasy"
    }
}