{
    "chapters":{
        "1":{
            "author_id":"coatbike",
            "author_name":"Coatbike",
            "choices":[
                "On top of the thrres bellys",
                "In the pool with them starring at me",
                "In the bed",
                "On the floor",
                "Still on Kyrtsals belly"
            ],
            "content":"<div class=\"\"><div> <span>As i was walkinng home the one day from school a strange portal openned up in the sky. I said what the heck. Just then i strated getting pulled into the portal. As i was in the portal it was all colerful and stuff. Then i blaced out. Is he ok one voice said said. I think so but we cant be sure. I really hope so poor cutie the other voice said.<br>\r\n<br>\r\nI was sartinng to come to. Girls he awake hes awake the voice said. As my full i seen that i was on a big fat furry blue belly with a very fat fox and a tigger starinn at me with woriied eyes. ( You arelready know who they are from the intro so no need for guessing.) I said where am i. You are in our house you sexy arrtive beast Says renamon. Is this real or am i seeing things i said. No this is all real Says krysatl whoose belly you were still sitiing on. I started puncinng myslef and said okay this is all real. Just then tigrress picked me up in and me on the lips. O_o ok ause you are cutie says tigress. Just then i fainnted for a whille and when i awoke i was....</span></div></div>",
            "created":1274065320,
            "id":884375,
            "title":"The arrvial"
        }
    },
    "info":{
        "author_id":"coatbike",
        "author_name":"Coatbike",
        "brief_description":"Where i some how get sucked in a protal and wind up in a world with obsee furries",
        "created":1273289640,
        "description":"<td align=\"left\" class=\"norm\">Its where i get sucked or walk into a protal and wind up in a house with big furries. Which is on Zs3 dva gallery and there a link. ME-Reid 17 yearold. The furries Renamon and Kyrstal and Tigress from knung-fu panada. And please add to this stroy<br>\r\n<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://zs3.deviantart.com/art/Reading-Rampage-104040872\" target=\"_blank\">http://zs3.deviantart.com/art/Reading-Rampage-104040872</a></td>",
        "id":1671113,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1274065320,
        "modified":1274065320,
        "pretty_title":"Reid and  Very fat furries"
    }
}