{
    "chapters":{
        "1":{
            "author_id":"wedgielordess",
            "author_name":"WedgieLordess",
            "choices":[
                "The classic, green haired Bulma!",
                "Pan",
                "Videl",
                "Chichi",
                "Bulla, also known as Bra!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's getting a wedgie today?</span></div></span></div>",
            "created":1308891600,
            "id":1133847,
            "title":"Choose a girl!"
        },
        "11":{
            "author_id":"bleudog1",
            "author_name":"writer",
            "choices":[
                "dragon ball",
                "dragon ball z",
                "dragon ball gt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what dragon ball<br>\r\n</span></div></span></div>",
            "created":1317704400,
            "id":1200882,
            "title":"The classic, green haired Bulma!"
        },
        "111":{
            "author_id":"bleudog1",
            "author_name":"writer",
            "choices":[
                "goku",
                "yamcha"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>whos giving the wedgie</span></div></span></div>",
            "created":1317704400,
            "id":1200883,
            "title":"dragon ball"
        },
        "1111":{
            "choices":[
                "Panties",
                "Thong"
            ],
            "content":"<div class=\"\"><div> <span>Goku hung onto a piece of the sheer rock wall over the hot lava.  All of a sudden he saw Bulma fall over the top and she screamed as she descended downwards.  After Bulma narrowly missed Goku's leg on her down, she said \"Goku helppp, grab me\".  Quick as lightning Goku grabbed onto the closest part of her; which just so happened to be her underwear.  What type of underwear is she wearing?</span></div></div>",
            "created":1341378000,
            "id":1371982,
            "title":"goku"
        },
        "11112":{
            "author_id":"tripleh2",
            "author_name":"tom",
            "choices":[
                "he hangs her on a tree",
                "he continues"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>goku pulls her up she thanks him turns around then goku tackles her and wedgies her and spanks her.    </span></div></span></div>",
            "created":1346907600,
            "id":1422354,
            "title":"Thong with the words \"spank and wedgie me\" "
        },
        "111121":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "content":"<div class=\"\"><div> <span> A put out Bulma hung from a tree for 2 1'/2 hours before someone else found her. Vegeta, of course. ''I'm intrigued how you managed this by yourself.'' He pulled down on both her legs, making her squeal as her thong tore and brought her to the ground. She leant on her husband as they made their way home. She had to see about some ice. Vegeta gave her a hard swat on her ass. Bulma cried out in shock and pain. ''Vegeta!''</span></div></div>",
            "created":1437454800,
            "id":2010732,
            "title":"he hangs her on a tree"
        },
        "112":{
            "choices":[
                "Vegeta",
                "Goku",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's giving the wedgie?</span></div></span></div>",
            "created":1349240400,
            "id":1439744,
            "title":"dragon ball z"
        },
        "1121":{
            "author_id":"greekgeekgod",
            "author_name":"Ollie Sadowski",
            "choices":[
                "Trunks comes in",
                "Goku comes in",
                "Vegeta brings out a vibrator."
            ],
            "content":"<div class=\"\"><div> <span>Bulma is in capsule corp, sleeping on the couch, when vegeta enters. He sees her white thong showing in the front and, smirking, and grabs the waistband. Her eyes shoot open and she stares up at him. \"Relax, woman.\"  he says, before yanking it up hard. She yells out in pain, but it soon turns to a moan of pleasure. She feels a gush of heat between her legs as vegeta pulls her up by the front of her thong. Then then yanks down her pants, exposing her lower lips with the thong pulled between. He hangs her up by the back of her panties and brings a hand down to rub her pussy, causing her to moan more. \"Ohhhhh vegeta!!\" </span></div></div>",
            "created":1556152620,
            "id":2649844,
            "title":"Vegeta"
        },
        "1123":{
            "author_id":"super3024",
            "author_name":"Potatorick",
            "choices":[
                "Piccolo",
                "Dende"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a namek</span></div></span></div>",
            "created":1411102800,
            "id":1858777,
            "title":"Other"
        },
        "113":{
            "author_id":"tripleh2",
            "author_name":"tom",
            "choices":[
                "elder kai",
                "vegeta",
                "videl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who does it</span></div></span></div>",
            "created":1356584400,
            "id":1495872,
            "title":"dragon ball gt"
        },
        "12":{
            "author_id":"raindramon2099",
            "author_name":"flamedramon2099",
            "choices":[
                "yes",
                "no",
                "mabey ",
                "never"
            ],
            "content":"<div class=\"\"><div> <span>pan was sitting on her bed and bored to death and didn't hear bulla come in so bulla reached down pan's jeans and pulled on pan's shin gold thong. \"AAAAH! BULLA WHAT THE HELL!\" pan screamed \" I wanted to have a wedgie contest... you in?\" bulla asked. \"I don't know.\" said pan.</span></div></div>",
            "created":1374037200,
            "id":1629522,
            "title":"Pan"
        },
        "124":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "choices":[
                "Vegeta joins in",
                "Bra runs into someone",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>          ''Too bad, you don't have a choice.'' She pulled harder on the other girl's panties causing them to wedge further into her butt crack. Pan knew she had to fight back to get out of this. Pushing Bulla away she flew up and landed behind her. ''WEDGIE FIGHT!'' She shouted, pulling on Bulla's purple bikini panties. Pan feigned shock. ''Why,Bulla, does your mommy know?'' Bulla was irritated and tried to get Pan back. Evading her by flying above her reach, Bulla grabbed her leg and threw her to the ground, pinning her down. ''Bulla,...Get. Off. Me.'' Bulla was oblivious to Pan's distress as she focused on her friend's glittering thong. Deciding on pulling up from the front,she yanked the thong forward. Finally tying it to an outraged Pan's bra. ''Ah, but Pan, it looks so good on you.'' Bra cooed at her helpless victim.<br>\r\n<br>\r\nNot helpless for much longer. Pan managed to knock Bulla off her and get back on her feet. She froze with shock as she saw Bulla over her mother's knee. ''I don't know what's going on here but I'm ending it.'' A crying Bulla was given a good spanking for the next 15 minutes before turning on Pan. ''You're next, missy,'' she stated while coming towards her. She was stopped by a grip on her own undies. ''Not so fast woman, I'd like to join in on this little game.'' Pan fled in horror with Bra still crying in the room. Making a hasty and necessary exit. </span></div></div>",
            "created":1437454800,
            "id":2010713,
            "title":"never"
        },
        "13":{
            "choices":[
                "Changing",
                "Walking alone",
                "Watching a fight",
                "Exercising",
                "Sleeping "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is she doing?</span></div></span></div>",
            "created":1340254800,
            "id":1364225,
            "title":"Videl"
        },
        "131":{
            "choices":[
                "Thong",
                "Panties",
                "Boyshorts"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Videl was changing because she just got done exercising. She just do happened to be changing outside. She took her sweaty white shirt off. Next she took her tight black shorts off. When she unbuttoned her bra she felt her.....</span></div></span></div>",
            "created":1340254800,
            "id":1364228,
            "title":"Changing"
        },
        "1311":{
            "choices":[
                "Pink and black lace",
                "Blue with orange waistband",
                "Shiny gold"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What color?</span></div></span></div>",
            "created":1340254800,
            "id":1364231,
            "title":"Thong"
        },
        "13111":{
            "author_id":"tripleh2",
            "author_name":"tom",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>goten and trunks come in and spank her and give her a wedgie</span></div></span></div>",
            "created":1346907600,
            "id":1422398,
            "title":"Pink and black lace"
        },
        "13112":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "content":"<div class=\"\"><div> <span> She was going to turn in for the night when she felt a tug on her thong. EEKK! Turning her head, she saw Bra with a good grip on her thong. ''So like you Pan,'' she said lifting the thong a little higher. ''Bra, what are you doing?'', Videl shrieked. ''What's it look like?'' She pulled tighter lifting the thong higher and further up Videl's ass. Videl tried to control herself as Bra tormented her. ''Bra..'' But Bra wasn't in the mood for listening. She lifted Videl into the air by her thong and carried her over to the bed. Pulling on the girl's thong she stretched it so that it fit across both ends of the bed post. Videl screamed in agony. Bra taking in her good work decided to let gravity do it's job. Videl hang there until her thong split and dropped her crashing to the ground. She curled up in pain and hoped nobody came in to see her like this.</span></div></div>",
            "created":1437454800,
            "id":2010710,
            "title":"Blue with orange waistband"
        },
        "1313":{
            "author_id":"doomacam",
            "author_name":"Gen",
            "choices":[
                "Gohan Gives an atomic wedgie",
                "Gohan lifts her up once again",
                "Writers choice"
            ],
            "content":"<div class=\"\"><div> <span>Videl unhooked her bra and was just about to release the undergarment from her shoulders when she felt a pair of hands grab her moist boyshorts. The hands came up along her butt, through the underwear to link around the waistband. She quickly turned her head around and saw who had grabbed her. To her surprise it was Gohan. Videl hadn't noticed he came in the room.<br>\r\n\t“Gohan! What are you doing!” Videl violently questioned her boyfriend. Videl was not too pleased about Gohan grabbing her like that out of the blue. She didn’t have a clue why he would do it either, but soon his intentions were clear. Gohan lifted up quickly on her boyshorts with large force. Videl screamed in pain from the sudden action. This is probably the last thing she would have expected Gohan to do. Gohan propped his elbows on his abdomen with Videl hanging from her underwear. Gohan was significantly taller, and stronger than Videl, so she was lifted off the ground with little effort. The fabric rubbed against her crotch in an unpleasant way, leading her to grab onto Gohan’s muscular arms to ease up the pressure. But it was all for naught. Gohan began bouncing her up and down. The underwear was stretching up and down with each tug. Videl began kicking her legs, desperately trying to get away.<br>\r\n\t“Gohan stop! It hurts, come on!” videl screamed at Gohan. Gohan just smiled, upping the speed of his bounces. Videls face turned red at the effort she was exerting by trying to get away from the relentless pain. She was just exercising before this happened, so she had little energy to fight back. Videl eventually gave in and limped as Gohan continued to bounce her.<br>\r\n\tAfter 3 minutes of bouncing, the bouncing started to feel different than before. Her already moist boyshorts were becoming even moreso, specifically in the crotch region. The pain had turned to pleasure. And as soon as it had started, it stopped. Gohan stopped bouncing her and set her down on the ground. Videl’s feet touched the floor, but she had no energy to keep herself standing. Her knees buckled and she was slowly set down on the floor by Gohan. Videl fell onto her hands from the kneeling position and panted. A moment passed as she looked at Gohan. Gohan still had a grip on her underwear and he had a weird look on his face. What happens next?<br>\r\n</span></div></div>",
            "created":1505883600,
            "id":2388428,
            "title":"Boyshorts"
        },
        "132":{
            "author_id":"kabukikongo",
            "author_name":"Death the kid",
            "content":"<div class=\"\"><div> <span>I met up with Videl one day after she was leaving the gym. We were walking home together, when suddenly she noticed her shoes were untied, and bent over to tie them. She was wearing a shirt that didn't cover her stomach, and when I looked down, I noticed her pink panties with a yellow flower pattern on them were sticking out. When she got up, they were still showing, and I couldn't help but stare. She then asked, \"are you okay? your eyes keep darting aroung like you're nervous about something\". I blushed a little bit, but I told her that her panties were sticking out. \"OH MY GOD! THIS IS SO EMBARRASSING\"! she screamed, causing everyone around her to turn their heads. I apologized for embarrassing her, and she said \"that's ok but\"... \"What's wrong?\" I asked. \"It's just that... my hands are all dirty and covered from sweat from working out... could you tuck them back in for me?\" she asked as her face turned bright red. She then turned around, and I gave them a little tug and let them snap against her skin. She let out a loud squeal, slapped me, and then tucked them in herself.' IF YOU EVER TOUCH MY PANTIES AGAIN YOU'RE DEAD!  she screamed. We then continued walking, and said \"yeah, yeah,  I get it, big bad Videl still wears panties with flowers on them, haha, just be quiet!\" \"Actually, those are probably the cutest panties I've ever seen. \"Really?\" she said while blushing. Thanks, they're actually my favorite. I then tried to change the subject, and we continued walking. After a while, I accidentily stepped on her shoelace, causing them to come untied again. Sure enough, when she went to tie them her panties came out again, but this time I couldn't resist. \"Just out of curiostiy, have you ever gotten a wedgie?\" I asked her. \"No... she replied. Why do you ask? she asked nervously. \"Well, they say there's a first time for everything\" I said, then reached for her panties, grabbed on and pulled with all my might, lifting her off the ground. \"WEDGIE!\" I yelled. \"OW OW OW\"! She cried, in vain to cover herself up. \"PLEASE STOP!  THIS ISN'T FUNNY!\" her face was redder then ever now. I was bouncing her up and down when suddenly, we heard a ripping sound, and I couldn't help but chuckle. \"NO DON'T EVEN THINK ABOUT IT! IF YOU RIP MY FAVORITE PANTIES I'M GOING TO KILL YOU\"! She screamed. Suddenly, they ripped and she fell flat and her face. She turned to look at me, and she had a look of death in her eyes, and charged at me screaming bloody murder. I woke up in a daze, covered in bruises and missing a few teeth, and then found the shredded remains of her panties in my pocket. \"Totally worth it,\" I thought to myself.</span></div></div>",
            "created":1392699600,
            "id":1747722,
            "title":"Hanging out with Videl"
        },
        "133":{
            "author_id":"shotgun234",
            "author_name":"Jake",
            "choices":[
                "A gold and silver striped Thong",
                "Regular pink Panties",
                "A normal white Thong"
            ],
            "content":"<div class=\"\"><div> <span>Videl was watching the match between Trunks and Goten, seeing how it was the first time that she had ever seen a super sayian. Little did she know that there was a figure slowly creeping up behind her. That figure was Gohan, sneaking up on his girlfriend waiting to pull a prank. When Gohan was behind his girlfriend he noticed that her underwear was exposed.<br>\r\n<br>\r\nWhat was the underwear?</span></div></div>",
            "created":1471410000,
            "id":2197244,
            "title":"Watching a fight"
        },
        "1331":{
            "author_id":"shotgun234",
            "author_name":"Jake",
            "choices":[
                "Bright red Briefs",
                "Black Boxer Shorts",
                "On of her Pink Lacy Thongs"
            ],
            "content":"<div class=\"\"><div> <span>Gohan suddenly shot his hand down and grabbed Videls thong instantly pulling it upwards.<br>\r\nVidel squealed 'Owww Gohan what are you doing!!!' <br>\r\nGohan replied 'what does it feel and look like I'm doing?' As he carried on pulling the golden thong up. He then decided that he would hang Videl from one of the hangers in their room. He hooked the thong  over the hanger and left Videl to hang there. After 15 minutes he finally unhooked the thong  which somehow hadn't snapped and let go, finally giving her an apologetic hug...<br>\r\n<br>\r\nVidel planned her revenge, plunging her down Gohans trousers, revealing....</span></div></div>",
            "created":1471410000,
            "id":2197329,
            "title":"A gold and silver striped Thong"
        },
        "1332":{
            "author_id":"shotgun234",
            "author_name":"Jake",
            "content":"<div class=\"\"><div> <span>Gohan reached down and yanked the bright pink underwear up and above Videl's head giving her an atomic wedgie.<br>\r\nVidel shouted at Gohan to stop but he didn't,  he held the pink panties over her head whilst laughing hysterically.<br>\r\n<br>\r\nAfter 20 minutes of this Gohan finally let go. Videl was mad but quickly calmed down and kissed Gohan on the cheek before walking out. On her way out she managed to snap a photo of her black g-string emerging from Gohan's trousers like a whale tail. She was going to get her sweet revenge showing this too everyone...</span></div></div>",
            "created":1471410000,
            "id":2197340,
            "title":"Regular pink Panties"
        },
        "1333":{
            "author_id":"shotgun234",
            "author_name":"Jake",
            "content":"<div class=\"\"><div> <span>Gohan pulled up the White thong as high as it would go without snapping. Videl with the thong positioned halfway up her back was trying to stop him, but unfortunately for her he was far too strong and she couldn't stop him from doing it. Gohan suddenly heard footsteps coming down the hall towards them.<br>\r\n<br>\r\nHe quickly decided to let go and hold on to Videls waist and kiss her. This was fortunate because that second Chi Chi had walked in. <br>\r\n'Oh I'll leave you two lovebirds to it.' Chi Chi said giggling before she left the room.<br>\r\n<br>\r\nWhen she did Gohan let out a sigh of relief. This moment was short lived as it was followed by a powerful slap that echoed around the house.</span></div></div>",
            "created":1471410000,
            "id":2197344,
            "title":"A normal white Thong"
        },
        "134":{
            "author_id":"raindramon2099",
            "author_name":"flamedramon2099",
            "choices":[
                "videl gets payback",
                "18 keeps going and spanks videl",
                "they get into a wedgie fight"
            ],
            "content":"<div class=\"\"><div> <span>videl was in the woods training and practiceing her fighting moves and flight after 3 hours she was worn out and didn't hear android 18 sneaking up behind her \" nows my chance for some fun with her.\"18 said. 18 then reached into videls shorts and grabbed her gold boyshorts and started to pull and then videl started to scream \" 18 WHAT THE HELL!\" videl screamed. \" got bored wanted to have some fun with you.\" replied 18.</span></div></div>",
            "created":1368939600,
            "id":1592956,
            "title":"Exercising"
        },
        "1342":{
            "author_id":"kaozdragon77",
            "author_name":"Wolf",
            "choices":[
                "Videls pleas fall on deaf ears anf 18 continues to spank her",
                "18 gets a idea to punish Videl futher",
                "Gohan hears Videl and comes to the rescue"
            ],
            "content":"<div class=\"\"><div> <span>Andriod 18 stretches Videls boyshorts up her backside creating a massive wedgie for the dark haired girl.<br>\r\n\"Let go you bitch\" Videl spat<br>\r\n\"Did your mommy not teach you any manners, looks like ill have to do it my self\"<br>\r\nVidel had no clue what 18 was talking about but it quickly became clear.<br>\r\nSMACK!<br>\r\n\"OW WHAT THE HELL!\" Videl screamed at the top of her lungs shocked by the sudden slap.<br>\r\nSMACK! SMACK! SMACK! \"STOP\" SMACK! SMACK! \" PLEASE!\" SMACK! SMACK! <br>\r\n\"IM SORRY FOR CALLING YOU A BITCH NOW PLEASE STOP GOHAN IS SUPPOSED TO BE HERE SOON AND THIS EMBARRASSING!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1584775500,
            "id":2804472,
            "title":"18 keeps going and spanks videl"
        },
        "13421":{
            "author_id":"kaozdragon77",
            "author_name":"Wolf",
            "choices":[
                "Videl pushes her luck",
                "Gohan arrives"
            ],
            "content":"<div class=\"\"><div> <span>18 ignores Videl's cries for mercy. She needed to be taught some manners and thats what 18 was going to do.<br>\r\nSMACK!SMACK!SMACK!SMACK!SMACK!SMACK!SMACK!<br>\r\nVidel was on the verge of tears, her father had spanked her before but never like this. Her bubble butt jiggled with every slap becoming more red as well.<br>\r\n\"18 STOP PLE- OW-PLEASE STOP JUST S- ACK- STOP DAMN IT!\"<br>\r\nBut once again 18 ingored Videl, she was just so captivated by the bounce of the booty.<br>\r\n\"Damn\" she thought to her self \" No wonder Gohan dates this girl.\"<br>\r\n18 looked over to her victim's face to see tears starting to roll.<br>\r\nIt was at that 18 felt a little pity but she was enjoying herself to much.<br>\r\nShe yanked up Videls underwear even higher than before earning a squel out of the black haired girl <br>\r\n\"Skrew you!\"<br>\r\nWhat? You want more?\"</span></div></div>",
            "created":1584776340,
            "id":2804477,
            "title":"Videls pleas fall on deaf ears anf 18 continues..."
        },
        "134211":{
            "author_id":"kaozdragon77",
            "author_name":"Wolf",
            "content":"<div class=\"\"><div> <span>\"GO TO HELL!\" <br>\r\nThat did it.<br>\r\n\"You know I was about to stop but now.\"<br>\r\n18 tightened her grip on Videls underwear and blasted off.<br>\r\n\"FUUUUUUCCCCCCKKKKKKKKKK!!!!\" Videl cried. <br>\r\nHer and her big mouth just had to push it and now look where she was.<br>\r\nSure she could fly but with the wind pushing back so hard it made her hanging/flying wedgie worse thus she coundnt concentrate her energy. The shock was so bad that she past out.<br>\r\nSMACK! <br>\r\n\"OW!\" Videl came to instantly but notin the forrest.<br>\r\nShe looked around to find a busty red head girl spanking her.<br>\r\n\" What do you think your doing!?\"<br>\r\n\"Hey now I paid good money to have my way with you and im going to make it worth it.\"<br>\r\nThat answered nothing for Videl. She then relized that she was tied up unable to move. She continued to look for answers and then she saw it.<br>\r\n\"Step right up to wedgie or spank the daughter of Mr.Satan. Wedgies are $20 spankings are $30 both are $40.\"<br>\r\n\"Oh fuck no\" Videl cried<br>\r\n\"Oh fuck yes\" replied the busty red head raising her hand.<br>\r\nSMACK!<br>\r\n\"AIE!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1584777420,
            "id":2804486,
            "title":"Videl pushes her luck"
        },
        "134212":{
            "author_id":"kaozdragon77",
            "author_name":"Wolf",
            "choices":[
                "Gohan turns the tables",
                "Gohan takes up 18s offer"
            ],
            "content":"<div class=\"\"><div> <span>\" GO TO HELL!\"<br>\r\nThat did it. 18 raised her hand to slap that perky ass again but when she went to strike nothing. Her arm wouldn't move.\"What the-\" she was quickly cut off realizing why she couldn't move.<br>\r\n<br>\r\nGohan was holding her arm preventing the next slap. \"What's going on here?\" He asked with anger after all his girlfriend's ass was on full display and being attacked. He felt a little aroused but now was not the time for that he wanted answers.<br>\r\n<br>\r\n\"G-GOHAN!\" Videl quickly became flustered even more so than before if that were posible. Her face iquickly turned red as her bottom. She didn't know what to do or say, her boyfriend, Gohan of all people had a full view of her wedgied/ spanked ass. It was so embarrassing Videl just wanted to die.<br>\r\n<br>\r\n18 waa taken back by Gohan's actions but kept a cool head. \"Just having some fun with with your girl here. Nothing to worry about.\" Giving Videls unddies a tug resulting a sqeal from Videl.<br>\r\n<br>\r\n\"It doesn't look like she's having fun.\" <br>\r\n<br>\r\n\"Oh come on just look at those moons you cant tell me something like this has never crossed your mind before?\" 18 pulled her arm away from him using the momentum to give Videl another slap. <br>\r\nSMACK!<br>\r\n\"AAAAIE!\"<br>\r\n<br>\r\n\"So what do you say wanna join in?\"<br>\r\n </span></div></div>",
            "created":1584809400,
            "id":2804654,
            "title":"Gohan arrives"
        },
        "135":{
            "content":"<div class=\"\"><div> <span>Video is sleeping in a tent one morning when goku found her. Get up goku said. She didn't get up so goku pulled the blanket off. He saw she was wearing a black with white waistband thong and nothing else. He grinned at the sight. He then said get up or else. She didn't move so he grabbed the thongand flew out of the tent giving her an atomic flying wedgie. Ouchhhhhhhhh let go. No we need to get moving. Well let me get dressed. No u didn't get up when I said so now u pay. They flew all day until they made camp. The next morning goku was sleeping and video told him to get up and pulled off the blankets revealing a pink and black thong of hers. She than gave him a wedgie but he woke up and reversed it so she was on the ground and he reached down her pants pulling out her blue with white lace waistband thong and carried her all day again.</span></div></div>",
            "created":1341810000,
            "id":1375057,
            "title":"Sleeping "
        },
        "14":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "chichi",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do you really want to give chichi a wedgie or some some other girl</span></div></span></div>",
            "created":1411102800,
            "id":1858815,
            "title":"Chichi"
        },
        "141":{
            "author_id":"kabukikongo",
            "author_name":"Death the kid",
            "choices":[
                "Help her pick out a new pair of panties for the next wedgie."
            ],
            "content":"<div class=\"\"><div> <span>One day, I decided to go to Goku's house for a visit, only to be greeted by Chichi. Apparently Goku had taken Gohan on a camping trip, and wouldn't be back for a week or so. \"Gohan's still young, so I thought it would do some good to bond with his father. Problem is, now I'm here by myself\" she said. Knowing that I had a long trip back home, I told her I could keep her company for a while. \"Thank you! Why don't we have lunch?\" she said. She cooked some lunch and we got to talking, when suddenly I dropped my plate on the floor, leaving a big mess everywhere. \"Don't worry I'll get it\", she said. She then grabbed a rag to clean it up with, and bent over right in front of me exposing her red G-string. I laughed a little bit, and she asked what was so funny. \"Nothing. By the way, thanks for giving me such a good view of your underwear\" I said. \"Oops!\" she said as she tucked them back in. \"Sorry, I hope your not offended, these panties tend to get away from me sometimes\". \"That's ok I don't mind. In fact, they were actually pretty sexy\" I said. \"Well thank you, I'm glad you like them\", she said. As she continued to clean her panties once again started to show. \"You know, I'd give you a wedgie, but I'd probably rip your panties off if I did\" I said. \"I'm not so sure, these ones are surprisingly durable\", she responded. We debated for a bit, and eventually she decided to make a bet. \"How about this. You give me a wedgie as hard as you can. If you rip them, I'll let you give me a wedgie whenever you want.. If you can't, you buy me whatever I want at the mall\". \"You're on\", I said, and she bent over to prepare. I then grabbed her panties and started to lift up, and she let out a small moan. I then lifted up harder, and she started to moan loader, almost as if she enjoyed it. I then lifted up as hard as I could, and she gritted her teeth. I bounced her up and down and she gasped with each bounce until we heard a small ripping sound. Sure enough, on the third bounce afterwards her panties ripped and she fell on the floor. \"Ow\", she moaned while rubbing her butt. \"Ha ha, that's what you get! This is gonna be a fun week!\" I taunted. \"It should be fun for both of us\", she said as she stood up and adjusted her pants. \"That was a really nice wedgie by the way she said. I guess I'll go without panties for now\", she said. She then bent over exposing her butt crack, and winked at me.</span></div></div>",
            "created":1422075600,
            "id":1922271,
            "title":"chichi's game"
        },
        "1411":{
            "author_id":"kabukikongo",
            "author_name":"Death the kid",
            "choices":[
                "I would give her an atomic wedgie",
                "I would give her a bra connection wedgie"
            ],
            "content":"<div class=\"\"><div> <span>Chichi wiggled her ass back and forth with her cute little butt crack hanging out. \"It's not very lady like for a  woman to show her butt crack\" I said jokingly as I pulled on her waistband and peeked down her pants. \"Well it's also not very gentlemanly to look at a lady's exposed privates. Or to give her a wedgie until her underwear rips\" she responded, while throwing me a wink. \"C'mon, you know you deserved it. In fact, I think you deserve another wedgie\" I said. \"Well, let me go put on some panties, so we can continue the lesson\" she said playfully, as she went into the next room. A few minutes later, she came back out and said, \"ok, here we go\" and she turned around. Once she bent over, she dug into her pants and hiked her lacy pink thong up over her hips. \"Wow, you have very pretty underwear. It almost seems like a crime to harm them. \"Aw, now you're embarrassing me\" she said, blushing and covering up her thong\". \"But that's still very sweet of you. Thanks\". Before she could even uncover, I grabbed her thong and hoisted her off the  ground by her thong. \"Aaaahh!!!\" she cried, holding her ass and blushing. \"Wedgie! Wedgie! wedgie!\"I chanted as I bounced her by her revealing underwear. \"Mph!\" she grunted with each bounce, until I stopped and just let her hang there. Enticed by the sight of her butt crack and her frilly pink panties, I lowered her, only to press my hands against her ass and wedgie her with my teeth. \"Hey now, stop that you pervert!\" She cried, trying to pull her panties away from me. Suddenly she seemed as embarrassed as if she were a  teenager and a boy she had a crush on had seen her panties by accident. This didn't stop me from yanking and yanking until eventually there was a loud rip and I had her whole thong in my teeth. She lay there with her ass in the air, no panties on and about half of her ass showing out of her pants. After a while she pulled up her pants, stood up and said \"well, someone got a little carried away eh?\". \"You know you had fun\" I said. \"Yeah. It was totally crazy, but you're right\". Either way, I think  that's enough for today\" she said as she rubbed her butt. \"We can try more tomorrow though\". \"Sounds good\" I said, with two pairs of her panties tucked into my pocket. The next day...</span></div></div>",
            "created":1430974800,
            "id":1974738,
            "title":"New panties for another wedgie."
        },
        "14111":{
            "author_id":"balla30",
            "author_name":"Arrow",
            "choices":[
                "Spandex thong",
                "Grannie panties with wedgie me across the butt"
            ],
            "content":"<div class=\"\"><div> <span>I then woke up the next day seeing Chichi cleaning the kitchen. She was on her hands and knees cleaning the floor with a cloth. I then see her black waistband poking out of her pants. I then sneak up up on Chichi grab her panties pulling up revealing </span></div></div>",
            "created":1433998800,
            "id":1991060,
            "title":"I would give her an atomic wedgie"
        },
        "141112":{
            "author_id":"balla30",
            "author_name":"Arrow",
            "choices":[
                "Hot pink thong",
                "Red bikini panties"
            ],
            "content":"<div class=\"\"><div> <span>Chichi then moans loudly as her panties are fronded into her ass. Oh nice grannies as I smile at the wedgie me being stretched out out by the wedgie. Chichi is blushing hard from her grannies being revealed. Time for your goodmorning wedgie. I then continue pulling and yanking on her black panties. Her panties are at the back of her head. After one more great pull the panties reach over her head. Then I pull down her grannies over her eyes snapping the waistband on her head. Chichi is now arching her back moaning loudly into her panties. A hole starts forming at the back of her grannies getting bigger. The waistband then rips off leaving Chichi in a moaning mess. She then leaves to her bedroom changing out of her clothes. She then steps out of her room in a bra and </span></div></div>",
            "created":1433998800,
            "id":1991063,
            "title":"Grannie panties with wedgie me across the butt"
        },
        "1411121":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "content":"<div class=\"\"><div> <span>          ''Why Chichi, I didn't think you were the type.'' ''Never mind that, give me what I came here for.'' I smiled at her direct approach and gave the lady just that. Chichi cried out as her thong rose up and over her head. Chichi was in pain as the torment continued. ''Now my girl,'' I said, here is the rest of your wish''. She felt herself pulled over my lap as my hand came down to smack her delightful, wriggling butt. ''My dear if you wish to prolong the experience, continue as you are.'' Chichi ceased moving and I was left to discipline that desirable derriere. Chichi was fussing again, so I just grabbed her thong from the back this time and tied it to her bra. Chichi was protesting even more so I adjusted the hold of her thong till it could be manipulated as a makeshift gag and continue. Chichi sported a hot,red, butt when I was done with her. It almost hurt me to leave her hanging from a bed post. Almost. That's how I left my friend Chichi. An overall, satisfying outcome, I must say.</span></div></div>",
            "created":1437454800,
            "id":2010720,
            "title":"Hot pink thong"
        },
        "1411122":{
            "author_id":"balla30",
            "author_name":"Arrow",
            "choices":[
                "Atomic Melvin",
                "Hanging"
            ],
            "content":"<div class=\"\"><div> <span>I stared at her in aw at her hot red bra and panties. Time for another wedgie my little slut. I then bend her over the kitchen counter closing her eyes. I then look into the fridge looking for the perfect food for a messy wedgie. I then pull backChichis waistband shooting honey into her butt crack. The I drop the bottle quickly yanking her red briefs to the sky. She moans loudly as the cool sticky substance was rammed up her ass. After a few more great pulls the panties break. Chichi then went and showered getting the golden sticky substance out of her ass. After the next few days Chichi has got many wedgies over the next few days. It was time to leave home but not leaving Chichi without a parting wedgie. I want to give her a good wedgie to leave in.</span></div></div>",
            "created":1433998800,
            "id":1991066,
            "title":"Red bikini panties"
        },
        "14111221":{
            "author_id":"balla30",
            "author_name":"Arrow",
            "content":"<div class=\"\"><div> <span>I then get a pair of spandex panties ready for Chichis fianally wedgie. I then grease the panties with butter to easier slide her panties in a wedgie. I then find her and put the panties on for her. I then yank on the front pulling hard. After about ten minutes I hook the waistband to the back of Chichis head.then I grab the back of her waistband pulling up. I then hang her panties up on a coat rack I then leave going home smiling at the wedgies I gave Chichi. Chichi is moaning loudly as she endures her atomic hanging wedgie. Goliath and Gohan walk in the doors hours later. They look up to see Chichi being sawed in half by her undies. Hi there honey you enjoying yourself. Chichis face gets redder as she is so embarrassed. Chichi never saw me again and she never recirved a wedgie never again.</span></div></div>",
            "created":1433998800,
            "id":1991067,
            "title":"Atomic Melvin"
        },
        "14111222":{
            "author_id":"manu7776",
            "author_name":"sssssssssszzcz",
            "content":"<div class=\"\"><div> <span>The next day, i went back and sneaked up on ChiChi, giving her a hanging wedgie on the fan. not only that, but i attached weights to her feet to pull her g-string further up her ass crack. the whole time, she was moaning and groaning as the underwear went further into her butt.after i stripped her to her bra and g-string, i grabbed a paddle and starting spanking her. She was yelling, so i gagged her with one of her old pairs of panties. after 20 minutes, i decided to leave.I then left going home smiling at the wedgies I gave Chichi. Chichi is moaning loudly as she endures her hanging wedgie.After 6 hours, Goten and Goku walked in through the door. They look up to see Chichi being sawed in half by her undies. Hi there honey you enjoying yourself. Chichis face gets redder as she is so embarrassed. Chichi never saw me again and she never recirved a wedgie never again.</span></div></div>",
            "created":1434690000,
            "id":1995146,
            "title":"Hanging"
        },
        "142":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "android 18",
                "supreme kai of time(if game characters are aloud)",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what other girls from the dragonball series will get a wedgie?</span></div></span></div>",
            "created":1441947600,
            "id":2033107,
            "title":"someone else"
        },
        "1421":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "vegeta",
                "chichi",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so who gives the hot android a wedgie?</span></div></span></div>",
            "created":1441947600,
            "id":2033135,
            "title":"android 18"
        },
        "14211":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "pink hello kitty panties",
                "another pair"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of panties is android 18 wearing when Vegeta gives her a wedgie?</span></div></span></div>",
            "created":1483851600,
            "id":2260623,
            "title":"vegeta"
        },
        "142112":{
            "author_id":"ehock",
            "author_name":"Writers",
            "choices":[
                "A pink lacy thong.",
                "Something Else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about this pair?</span></div></span></div>",
            "created":1505278800,
            "id":2385194,
            "title":"another pair"
        },
        "1421121":{
            "author_id":"ehock",
            "author_name":"Writers",
            "choices":[
                "A jean skirt with leggings/tights.",
                "Jeans."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she wear?</span></div></span></div>",
            "created":1505278800,
            "id":2385195,
            "title":"A pink lacy thong."
        },
        "14211211":{
            "author_id":"ehock",
            "author_name":"Writers",
            "choices":[
                "Android 18 teases Vegeta to wedgie her.",
                "Another choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What should happen?</span></div></span></div>",
            "created":1507525200,
            "id":2398599,
            "title":"A jean skirt with leggings/tights."
        },
        "14213":{
            "author_id":"ehock",
            "author_name":"Writers",
            "choices":[
                "By herself.",
                "By someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she wedgie herself?</span></div></span></div>",
            "created":1506315600,
            "id":2391607,
            "title":"someone else"
        },
        "142132":{
            "author_id":"javana",
            "author_name":"Swav",
            "choices":[
                "Videl",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will wedgie the android?</span></div></span></div>",
            "created":1542514560,
            "id":2579131,
            "title":"By someone else."
        },
        "1421322":{
            "author_id":"ehock",
            "author_name":"Writers",
            "choices":[
                "Krillin.",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about her lover?</span></div></span></div>",
            "created":1577122860,
            "id":2763636,
            "title":"Other"
        },
        "14213221":{
            "author_id":"ehock",
            "author_name":"Writers",
            "choices":[
                "She strips and they wedgie each other.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What should happen?</span></div></span></div>",
            "created":1577124600,
            "id":2763640,
            "title":"Krillin."
        },
        "142132211":{
            "author_id":"ehock",
            "author_name":"Writers",
            "choices":[
                "Pink with red hearts with the panties having a purple frilly waistband.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Android 18 in her old outfit which consists of a black shirt with striped sleeves, a jean skirt with tights, &amp; boots was sitting in the living room when Krillin came to her and sat with her Android 18 having saw Krillin decided to have some fun with him so she took off her shirt revealing her bra with her panties sticking out. What color are they?</span></div></div>",
            "created":1577124900,
            "id":2763642,
            "title":"She strips and they wedgie each other."
        },
        "1421322111":{
            "author_id":"ehock",
            "author_name":"Writers",
            "choices":[
                "Panties",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Android 18 asked Krillin what he thinks of her bra and he just drooled so 18 decided to seduce him further by taking her boots and tights off turn around and show Krillin a side of the back of her.</span></div></span></div>",
            "created":1577132700,
            "id":2763688,
            "title":"Pink with red hearts with the panties having a ..."
        },
        "1421322112":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "Pink hello kitty panties with her name on the tag",
                "White Barbie panties with pink trim",
                "Another pair"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other kind of panties is android 18 wearing?</span></div></span></div>",
            "created":1577126100,
            "id":2763647,
            "title":"Something else."
        },
        "1423":{
            "author_id":"masterfan18",
            "author_name":"master",
            "choices":[
                "Launch",
                "Vados",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Launch or some super characters?</span></div></span></div>",
            "created":1503464400,
            "id":2373681,
            "title":"someone else"
        },
        "14232":{
            "author_id":"distblazz",
            "author_name":"DistoBlazz",
            "choices":[
                "Whis",
                "Champa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will be giving the beautiful angel a wedgie?</span></div></span></div>",
            "created":1507266000,
            "id":2397211,
            "title":"Vados"
        },
        "142321":{
            "author_id":"ricnhatd",
            "author_name":"Writerman",
            "choices":[
                "Nomal wedgie",
                "Atomic wedgie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You chose whis what type of wedgie will vados get</span></div></span></div>",
            "created":1536481500,
            "id":2545142,
            "title":"Whis"
        },
        "14233":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Zangya ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Zangya </span></div></span></div>",
            "created":1534899420,
            "id":2536939,
            "title":"Someone else"
        },
        "142331":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Gohan ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gohan because she’s hot</span></div></span></div>",
            "created":1534899540,
            "id":2536941,
            "title":"Zangya "
        },
        "1423312":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Bojack ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bojack because he is the boss</span></div></span></div>",
            "created":1534899600,
            "id":2536943,
            "title":"Someone else "
        },
        "15":{
            "choices":[
                "Changing?",
                "Sleeping",
                "Cooking",
                "Exercising"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What was she doing?</span></div></span></div>",
            "created":1340254800,
            "id":1364387,
            "title":"Bulla, also known as Bra!"
        },
        "151":{
            "choices":[
                "C string",
                "Panties",
                "Thong"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She just had her undies on when...What underwear?</span></div></span></div>",
            "created":1340254800,
            "id":1364391,
            "title":"Changing?"
        },
        "1511":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "content":"<div class=\"\"><div> <span> Bra was turning in for the night and was now stripped to her undies. Which in her case, turned out to be a blaring red c-string. Her own mother didn't even know and wouldn't. All hell would break loose then. Most probably the cause of her dad. She was just about to change into her nightgown when-''EEKK''! ''This is for last time.'' An excited Pan gave her an atomic wedgie. A very painful wedgie, she might add. Bulla shrieked as she was lifted by her c-string and hung from a bed post.'' PAN YOU ARE SO DEAD''! Pan winked before saying, ''Don't think so princess.'' She left Bra hanging, literally, as she left the room. Bra was full of righteous fury as she was hung to dry. It was a bewildered Bulma that finally stumbled upon this interesting scene. Bra was still fuming as her mother helped her done and got her some ice.</span></div></div>",
            "created":1437454800,
            "id":2010717,
            "title":"C string"
        }
    },
    "info":{
        "author_id":"wedgielordess",
        "author_name":"WedgieLordess",
        "brief_description":"Pan, Bulma, Videl and more!",
        "created":1308956940,
        "description":"<td align=\"left\" class=\"norm\">Hey, thought I'd make this and hope people contribute! Main rule, nothing too extreme, and just girl wedgies, otherwise, write as much as you want, if you want me to write something, let me know!</td>",
        "id":1788229,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584809400,
        "modified":1584809400,
        "pretty_title":"Dragonball Wedgies."
    }
}