{
    "chapters":{
        "1":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Master Chief",
                "The Arbiter",
                "Sergeant Johnson",
                "Cortana",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose a character to control.</span></div></span></div>",
            "created":1418101200,
            "id":1899834,
            "title":"Who do you want to be?"
        },
        "11":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Pred",
                "Prey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the Chief a pred or prey?</span></div></span></div>",
            "created":1418101200,
            "id":1900109,
            "title":"Master Chief"
        },
        "111":{
            "author_id":"scp-spartan049",
            "author_name":"Deck_Spartan",
            "choices":[
                "The Ark(Remains of High Charity before HW2 events)",
                "Genesis and the Domain(Before 5s events, meeting Exuberant Witness)",
                "Requiem(Landing on the scarred but functional shield world after a sun dip)"
            ],
            "content":"<div class=\"\"><div> <span>Who is his prey? <br>\r\n<br>\r\nThis is after 4s ending where the portal has him land somewhere. The portal gives him a special power to absorb entities due to the composer and <i>Mantle's Approach</i> messing with slipspace 11 dimensions, so absorption vore. The portal also messed with his mind a bit so sexual advances tempt him, though not without good reason.<br>\r\n<br>\r\nWhere will he end up?</span></div></div>",
            "created":1599597120,
            "id":2899627,
            "title":"Pred"
        },
        "112":{
            "author_id":"scp-spartan049",
            "author_name":"Deck_Spartan",
            "choices":[
                "The Flood(Gravemind)",
                "Sword of Sanghelios(The Arbiter)",
                "The Banished(Atriox)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Master Chief is prey. Who is he the prey for?<br>\r\n<br>\r\n As the description of the story said, all the choices presented at the bottom are female.</span></div></span></div>",
            "created":1599595980,
            "id":2899616,
            "title":"Prey"
        },
        "12":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Pred",
                "Prey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is The Arbiter a pred or a meal for someone else?</span></div></span></div>",
            "created":1418101200,
            "id":1900107,
            "title":"The Arbiter"
        },
        "121":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Master Chief ",
                "Sergeant Johnson ",
                "Cortana "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is on the Arbiters menu?</span></div></span></div>",
            "created":1418101200,
            "id":1900122,
            "title":"Pred"
        },
        "1211":{
            "choices":[
                "The arbiter gains weight.",
                "He gains muscle.",
                "own chioce."
            ],
            "content":"<div class=\"\"><div> <span>It was quick and painless.With one hard swing of his plasma blaster,Master chief was knocked out cold.The arbiter wasted no time.He grabbed a hold of the chief's body and proceeded to goble him up.<br>\r\n<br>\r\nThe sangheili's belly expanded as the meal made it's way down the arbiter gullet.His suite became thight as his gut bulged out in size.<br>\r\n<br>\r\nThe arbiter's gut bounched and gurgle as he made his way back to his viheacle.The Prowler patiently waited on top of a sandy hill.He moanted it and drowed off.<br>\r\n<br>\r\nBut as he drow off,the digestion in his stomach begins.The sangheili smiled.He knew what was going to happen next.</span></div></div>",
            "created":1436418000,
            "id":2005550,
            "title":"A growing sangheili."
        },
        "12111":{
            "choices":[
                "He attackes the humans.",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>The elite stoped the prowler as he felt the meal digest in his belly.Jumping off,he saw that he was gaining weight.The sangheili's eyes widend,his smile faiding.\"This isn't seposed to happen\",he said in shock.<br>\r\n<br>\r\nThe arbiter groaned as he felt his body expand with fat.His belly bulged out,his butt grew larger,his face roanded out and his limbs grew fatter.\"O dear\",he said worried.<br>\r\n<br>\r\nSuddenly his belly growled.The arbiter felt a hunger that he could not discribe.It was just his luck that he saw to humans soldiers walking alone.</span></div></div>",
            "created":1436418000,
            "id":2005554,
            "title":"Expanding elite."
        },
        "122":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Brute",
                "Gravemind",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's hungry for Arbiter?</span></div></span></div>",
            "created":1418360400,
            "id":1901334,
            "title":"Prey"
        },
        "1223":{
            "author_id":"xanfire",
            "author_name":"Xanfire",
            "choices":[
                "Elite ",
                "Marine",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>None of them? How about one of these? </span></div></span></div>",
            "created":1427086800,
            "id":1952455,
            "title":"Other"
        },
        "12232":{
            "author_id":"xanfire",
            "author_name":"Xanfire",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some Lucky marine is going to have a full belly of Arbiter then. Alright Male or Female? </span></div></span></div>",
            "created":1436850000,
            "id":2007757,
            "title":"Marine"
        },
        "12233":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "A Prophet",
                "Master Chief"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else wants to eat him?</span></div></span></div>",
            "created":1436850000,
            "id":2007740,
            "title":"Other"
        },
        "14":{
            "author_id":"teveylen",
            "author_name":"Friendly_trev",
            "choices":[
                "Pred",
                "Prey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Cortana a pred or prey for someone else:</span></div></span></div>",
            "created":1577688840,
            "id":2766824,
            "title":"Cortana"
        },
        "141":{
            "author_id":"teveylen",
            "author_name":"Friendly_trev",
            "choices":[
                "Master chief",
                "UNSC Marines",
                "Some Covenant"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shall Cortana feast on:</span></div></span></div>",
            "created":1577689140,
            "id":2766827,
            "title":"Pred"
        },
        "1412":{
            "author_id":"teveylen",
            "author_name":"Friendly_trev",
            "choices":[
                "He is rude and makes comment on her gaining weight",
                "He is angered by the sight that she is taking more than her share or rations."
            ],
            "content":"<div class=\"\"><div> <span>     When first transferred into her new body, Cortana was shaken. She had never before actually experienced feelings like physical touch or taste before. This new Enhanced Interaction Body ( EIB for short) was part of the UNSC's new program to make AI constructs such as herself more relatable. The body she was given was made to represent her digital form but as a human version, with minor changes such as her skin tone from her normal clear blue to a pale whight.<br>\r\n     This new body was almost identical to a Human body, including the need of food and water as a energy source. Cortana soon realized, however, that her new body might have a issue with it's need for food. She regularly eats three meals a day with her Spartan partner John 117 otherwise known as the Master Chief, but still finds herself wanting more.<br>\r\n     Another effect of the EIB, is that Cortana can now fully experience Human emotions. Due to this and the combined problem of her over eating, she has grown rather self conscious and only speaks how she really feels to John. She had tried to get her eating problem fixed but service technicians on the Pillar Of Autumn are not able to find the issue .<br>\r\n     One day while working on the engine of the Pillar Of Autumn she finds herself needing to endulge on her cravings and sneeks extra rations in the room with her. Suddenly from behind she is approached by a marine.<br>\r\n<br>\r\nHow is the marine acting:</span></div></div>",
            "created":1577690880,
            "id":2766833,
            "title":"Dangers of technology"
        },
        "14121":{
            "author_id":"teveylen",
            "author_name":"Friendly_trev",
            "choices":[
                "Her breasts began to grow",
                "Her ass began to Expand"
            ],
            "content":"<div class=\"\"><div> <span>\"So that new body of your's seems to really like eating huh.\" Said the marine in a snarky voice. Cortana blushed and felt nervous, she had new the room was clear but forgot to turn on her motion sensors. The marine continued \" Yeah.. you keep this up and you might have to 3D print out a new body!\" She attempted to hold herself together, as his word hurt her and made her emotions start to swell. <br>\r\n     Cortana attempted to intimidate him into leaving \" I'll have you know marine, I am and outranking officer to you. These remarks will look rather poorly on you quarter review.\" He called her on her bluff \" you are just an EIB, you don't have any actual power other than helping your little green action figure not get shot but some stray grunt\" he said in an abrasive tone.<br>\r\n     Cortana could not hold it in anymore, it was one thing to insult and berate her but to mock John, that was unacceptable. Her anger over took her, \" You will not speak of John like that and think you can leave this room !\". The marine attempted to push her, \" What are you going to do eat me fatty!?\".<br>\r\n     Cortana rage took over as she grabbed to marime's shoulders, \"WHAT A GREAT IDEA PRIVATE\". Using her EIB's enhanced stregnt she lifted him in the air as her hunger took over. \"Wha.. what are you doi-\" where the last words the private got out before he was forced head first into Cortana's gaping mouth.<br>\r\n     The marine quickly attempted to unholster his UNSC issued magnum, but was unable to as Cortana quickly threw it aside. He slid deeper into Cortana's mouth as now he was shoulders deep inside her. Cortana relished the feeling as her neck now bulged with the Marines body flowing through it. As his body slid further into her, her stomach started to enlarge, as the first half of his body slowly made it's way into its final resting place. With one aduble \"euurp..\"his feet entered her mouth she closed it, letting him fully slide down and enlarge her stomach to near double it original size. \" Ohhh... I'm not hungry anymore!\" She exclaimed. Looking down she inspected her new gullet. It was almost as large as her! It was moving around as the marine inside was trying desperately to claw his way out. Cortana scoffed and said \"EIB's are nearly industuctuble you know, all you are doing is delaying the inevitable.\" She was quite happy with herself, for once her insatiable need for food had been quelled. <br>\r\n     Soon the marine inside grew tired and stopped struggling, her stomach began to turn into a more solid circular shape, and shrinked slightly as the Marine began to digest. Cortana soon realized her new body must digest things quicker than a normal human's can. After 10 minutes she began to notice that whatever was left of him was being redistributeed to the rest of her body.<br>\r\n<br>\r\nWhat started to happen to Cortana:</span></div></div>",
            "created":1577693460,
            "id":2766838,
            "title":"He is rude and makes comment on her gaining weight"
        },
        "142":{
            "author_id":"scp-spartan049",
            "author_name":"Deck_Spartan",
            "choices":[
                "The Flood(Gravemind)",
                "The Didact and Warden Eternal",
                "Exuberant Witness"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is she prey for? <br>\r\n<br>\r\n</span></div></span></div>",
            "created":1599597540,
            "id":2899633,
            "title":"Prey"
        },
        "1421":{
            "author_id":"scp-spartan049",
            "author_name":"Deck_Spartan",
            "choices":[
                "Halo 2 and 3",
                "Halo Wars 2(AU)",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Is she prey for the flood during Halo 2 and 3 or Halo Wars 2?<br>\r\n<br>\r\nHalo 2 and 3 are her time before the Chief rescues her.<br>\r\n<br>\r\nHalo Wars 2(HW2) would be an AU were the Gravemind successfully rips a piece of Cortana from herself without her knowledge and use that piece for its own needs. With the events of HW2 having High Charity imprisoned in a hardlight bubble its attention besides escaping is solely on the fragment.<br>\r\n</span></div></div>",
            "created":1599598320,
            "id":2899637,
            "title":"The Flood(Gravemind)"
        },
        "14213":{
            "author_id":"scp-spartan049",
            "author_name":"Deck_Spartan",
            "choices":[
                "Halo Rings (Zeta or Installation 09)",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I just thought of a few more choices, I'll leave another reader's choice at the bottom</span></div></span></div>",
            "created":1599599760,
            "id":2899644,
            "title":"Readers Choice"
        },
        "142131":{
            "author_id":"scp-spartan049",
            "author_name":"Deck_Spartan",
            "choices":[
                "Zeta ",
                "Installation 09"
            ],
            "content":"<div class=\"\"><div> <span>Zeta has 10 Graveminds under lockdown, for this story, all have broken containment<br>\r\n<br>\r\nInstallation 09 is a newly constructed ring that has flood samples and is to be brought out of slipspace near <i>Reach</i>. Created Cortana's Guardians brings it out of slipspace. Created Cortana could use her fragment to study the gravemind and extract information from them to help sustain her 10,000 years of peace. Along with strong-arming Anders.</span></div></div>",
            "created":1599600780,
            "id":2899650,
            "title":"Halo Rings (Zeta or Installation 09)"
        },
        "15":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Gravemind",
                "Marcus P. Stacker",
                "Tartarus",
                "Jacob Keyes",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else want to eat or be eaten</span></div></span></div>",
            "created":1418101200,
            "id":1899839,
            "title":"Other"
        },
        "155":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Humans",
                "Covenant "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which side?</span></div></span></div>",
            "created":1418101200,
            "id":1899840,
            "title":"More"
        },
        "1551":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "Commander Sarah Palmer",
                "Catherine-B320 aka Kat",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More humans to choose from.</span></div></span></div>",
            "created":1421730000,
            "id":1920342,
            "title":"Humans"
        },
        "15511":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "She punishes Majestic team by EATING THEM",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Commander Palmer observed from the balcony in the docking bay, Majestic Team was returning back to Infinity after a failed mission. Their target escaped with the intel, but even worse, the VIP they were assigned to protect was killed as well. Needless to say, Palmer was not pleased with her SPARTAN team. \"Majestic! DeMarco! What was that out there? Your pathetic excuse of a team bungled everything back there!\"<br>\r\n<br>\r\n\"Commander, we tried-\"<br>\r\n<br>\r\n\"Can it DeMarco, you'll explain yourselves back in my office.\" Sarah Palmer led the disgraced team from the dock area of the ship back to her private office. Once everyone was inside, Sarah secretly locked the door and turned off any access ports to prevent Roland, Infinity's on-board A.I., from monitoring what happens inside. <br>\r\n<br>\r\n\"I don't know what the incompetent display was out there in the field, but I refuse to call this group SPARTANS!\" Sarah yelled at the group of five spartans in front of her.<br>\r\n<br>\r\n\"I'm sorry Commander, we'll do better next time.\"<br>\r\n<br>\r\n\"Next time? With a screw up like that, there isn't going to be a next time. As your CO, I have to discipline this group to make them fit for duty, and I have had discipline you all in the past repeatedly. But it seems if you can't be disciplined, then well...\"</span></div></div>",
            "created":1421730000,
            "id":1920370,
            "title":"Commander Sarah Palmer"
        },
        "155111":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "Sarah finishes her meal uninterrupted.",
                "Somebody knocks on the door."
            ],
            "content":"<div class=\"\"><div> <span>\"...you should be added to someone who can get the job done.\" Everyone in Majestic was confused by her statement, \"What do you mean by added, Commander?\" SPARTAN Hoya asked. \"Simply by this,\" Sarah's mouth open wide, wider than anyone else in the room had ever seen a human open before. She made her first move on Paul DeMarco, he was standing closest to the Commander when she engulfed his entire head. Paul's movements were just blind struggles, he couldn't comprehend that he was being swallowed by another human being. The other members of Majestic were panicking at that moment. Tedra Grant and Anthony Madsen made their way to the door. <br>\r\n<br>\r\n\"IT'S LOCKED\" they screamed. \"Roland! Commander Palmer has gone gone insane!\" but there was no reply from the ship's A.I.<br>\r\n<br>\r\n\"She led us into a trap, she planned this!,\" a panicking Grant said allowed.<br>\r\n<br>\r\nBy this point, Sarah was half finished with DeMarco, his body leaving a large, visible in print in her throat and chest where he was going down. The other SPARTANs finally realizing that they should try to help their fellow team mate out of the gullet of their CO, try to pull Paul's legs back out. Sarah, anticipating resistance from the others, came prepared: she threw down a smoke grenade, but it wasn't spewing out normal smoke, it was knockout gas. Hoya, Madsen, Grant, and Thorne without their MJOLNIR armor filtering the air they breathed, all fell down, passed out from the gas. Sarah finished gulping down DeMarco, inside he curled into a round ball, outside Sarah's belly was bulging; she looked about 9 months overdue with an impossible number of children. \"Well, one down...\" she dragged Hoya's legs to her mouth. \"Four to go.\"</span></div></div>",
            "created":1421730000,
            "id":1920376,
            "title":"Commander Palmer's punishment methods"
        },
        "1551111":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "Sarah digests her giant meal.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Sarah continued on her feast in silence. Hoya's legs slid in very easily, what with no resistance from a sleeping prey. Sarah knew she could have taken on anyone of Majestic in a one-on-one fight. She was a true predator that way. She only cheated in this instance because as skilled was is, it would just be impossible to take on five SPARTANs while eating them all, two sure, maybe even three, but five at once is just silly. With the other four members of the squad, Sarah made sure to take off their clothes, better for flavor and digestion. DeMarco's clothes will have to come out one of two ways, and having fewer clothes in her gut will make it easier to belch them out. <br>\r\n<br>\r\nShe finished consuming Hoya, making sure to get a lick of his penis, she'll get doing that to Thorne and Madsen as well. When Hoya enter her stomach, Sarah's midsection nearly doubled in size, her belly was bigger than she was. After eating two men, Sarah wanted something sweeter, she picked up Tedra off the ground and start head first with her. Her head passed quickly enough, as Commander Palmer wanted to get this whole affair done soon, and she wanted a taste of Tedra breasts. Tedra Grant, being an athletic woman, didn't have particularly big breasts, they were pretty flat, but still tasted excellent for the Commander. Further past her abs, was Tedra's pussy. Sarah gave it a few sweeping licks, it tasted even more divine than her breasts. But after that it was time to finish her. Another SPARTAN was added to Commander Palmer's ever growing belly. She looked absolutely enormous, and was having a difficult time sitting in her office chair, as so much weight was pushing her belly forward.<br>\r\n<br>\r\nThorne and Hoya, Sarah ate as a pair, as she was too strapped for time to eat them one at a time. She started headfirst with both of them, basically shoving them both down her throat, while getting quick tastes where she could. When she got to their waists she was in heaven; she had two dicks in her mouth that she could suck and lick a she wanted. This was by far the best course of this meal. Sarah. after having her fill of cock, swallowed up their dangling legs and brought the entirety of Fireteam Majestic within her stomach. The full weight of her gut forced Sarah to the floor, inside her belly were five people, each equal to or greater than her own weight.<br>\r\n<br>\r\nUpon finishing the team, Commander Palmer was truly stuffed, \"I've gotta hand it to you Majestic, you were terrible SPARTANs, but you were at least an amazing meal.\" Sarah gently massaged her incredibly massive gut in a circular motion. \"As I was saying, if I can't make you better SPARTANs, you'll at least make me a better SPARTAN, after I digest you all that is!\" <br>\r\n<br>\r\nWith that said, Commander Palmer got off the floor and slowly made her way to her private quarters. She laid her heavy gut on the bed and snuggled the rest of her body underneath the covers. Sarah's fullness helped her get to sleep in no time, tomorrow she wanted to see her improved body.</span></div></div>",
            "created":1421730000,
            "id":1920383,
            "title":"The demise of Fireteam Majestic"
        },
        "15511111":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "Continue",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Sarah emerged refreshed from her rest, last night had to be one of the best night's sleep she's ever had. The first thing she noticed as she stood up, was that her perspective had changed. \"Am I taller?\" she asked herself. The 6'9 woman compared her height to a picture on the wall, \"I've grown!\" She had gained eleven inches in height over night, bringing her to 7'8.<br>\r\n<br>\r\nThe next very obvious thing she saw was that her breasts had gone up in several cup sizes, she was now a JJ-cup. She was going to be requiring some extra strength and extra large custom bras to be made for her. Luckily for the rest of her figure, her enormous gut evaporated over night, leaving her with her toned abs once again. After inspecting her front, Commander Palmer looked to her backside for any changes. Sure enough, her butt ballooned up as well, leaving nice, soft cushioning to see and to sit on. Each cheek was about the size of a beach ball, and her breasts were just as large. Her flesh was not the only thing growing. Her normally tightly bound hair bun had become undone overnight, growing to almost three feet in length, it also became more luminous and luscious. While Sarah liked it, she knew she was still going to have to get it cut and styled.<br>\r\n<br>\r\nOverall, Sarah was extremely pleased with these developments that Majestic made for her. Commander Palmer put an order in to requisitions for MJOLNIR armor that fit her new measurements. She was going to be rolling more than a few heads when people see her chest and ass. She found some stretchy clothing she could wear, then stepped out of her quarters to go get suited up: she wanted to test her new body.<br>\r\n<br>\r\nSarah Palmer was a gorgeous Amazon in every sense of the word. In the ships hallways, all personnel were distracted by Sarah's new appearance, most shocked by her sudden increase in size, others enthralled the by subtle bouncing of her chest and ass. Commander Palmer was pleased by their awkward stairs and appreciated the compliments, but would never say so. She was more annoyed by their slacking at work, then she felt compliment, however. \"Hey you get back your duty. Nothing to see here! Just your normal Commander walking through.\"<br>\r\n<br>\r\nWhen she arrived at her station to suit up, the technicians were taken aback by her development and the measurements that she requested. But she was the Commander and they obeyed, her armor chest plate stood 2 and half feet out from her body on account of her enormous chest, and they had to remove the normally protective plate on her butt as her ass was too large to conceal, leaving behind padding there instead. In her full armor, Sarah didn't look aerodynamic at all, but damn if she didn't look stacked.<br>\r\n<br>\r\nSarah chose to run the training gauntlet in Infinity's battle simulator. Sarah was always excellent at it before, but with her enhance body she blew through it like never before. She was faster, stronger, and had even quicker reflexes then before, she could even take on an entire squad of eight SPARTANs by herself; although, some of her victory may be attributed from the shock her incredibly endowed body caused to her opponents. <br>\r\n<br>\r\n\"Well that was a good workout, how about a real mission next?\" Commander Palmer said to the defeated SPARTANs laid out around her.</span></div></div>",
            "created":1421730000,
            "id":1920389,
            "title":"The improved Sarah Palmer"
        },
        "15512":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "She saves Six by getting creative",
                "She's too slow"
            ],
            "content":"<div class=\"\"><div> <span>SPARTAN Catherine-B320, otherwise known to her squad mates as Kat, was driving a Warthog along one of Reach's many highways. SPARTAN-B312, better known as Noble Six, was riding shotgun along side her. The pair of spartans were on patrol on one of Reach's many desolate highways. Kat couldn't get too much of a read off of Six, but then again Noble Six didn't say too much, he spoke more with actions rather than words. However, she could sense that he, like her was anxious to get back to base, patrol was usually pretty boring, it seemed like a waste of a spartan's valuable time. They would have preferred to be placed directly in the action.<br>\r\n<br>\r\nAs Kat was driving along on the highway, a bend in the road was approaching. This particular bend wrapped around a collection of high rocks that obscured the view of rest of the road past it. As the pair made their way along the bend, their Warthog suddenly flipped in the air, hidden explosives were littered across the highway. The Covenant had set this part of the road as a trap for coming traffic.<br>\r\n<br>\r\nKat and Six rolled out of the flipped over Warthog and pulled out their weapons of choice: Kat, an M6G Magnum pistol, and Six, an MA37 Assault rifle. They used the blown out remains of the Warthog as fast cover, while searching for a sturdier rock to hide behind. Kat easily dispatched the Grunt's unprotected skulls, while Six threw a frag to soften up some the Jackal's body shields, before unloading a magazine on the wiry bird-lizards. With the enemy's ranks momentarily thinned, the two spartans moved to more stable cover.<br>\r\n<br>\r\nA few shards of shrapnel from Six's grenade damaged a nearby Elite's shields, angering the Sangheili into enragement. The Elite dodged Six's follow up barrage of bullets before moving in closer to strike at Six. Six was caught off guard while he was reloading, and the Sangheili smacked the spartan's face into the ground, brutally stomping the downed spartans body.<br>\r\n<br>\r\nAt this moment Kat realizes Six's distress, she fired all eight shots her pistol contained before closing in to melee range. Does Kat save Noble Six in time?</span></div></div>",
            "created":1421902800,
            "id":1921223,
            "title":"Catherine-B320 aka Kat"
        },
        "155121":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "They get air evacuated back to Sword Base.",
                "They continue on foot."
            ],
            "content":"<div class=\"\"><div> <span>Kat ran as fast has her body would allow her, luckily, she reached Noble Six before the Sangheili could do anymore harm. Conveniently, her last shot fired had broken the Elite's shields, leaving it vulnerable to all sorts of attacks. Kat tackled the tall alien down, while grappling with it to disarm it of any Plasma pistols or portable Energy swords. The fight ends quickly enough, with the Elite pinned to the ground and Kat riding it on top. <br>\r\n<br>\r\n\"I've been waiting long enough to taste one of you,\" Kat told her intent to her captured prey. She opened her mouth wide enough to engulf the Sangheili's head. <br>\r\n<br>\r\nThe Sangheili was unfamiliar with this type of behavior from humans, \"What trickery is this demon?\"<br>\r\n<br>\r\n\"No tricks, just food and revenge for you messing up my friend there.\" Kat began stuffing the alien's head into her gullet, making sure to remove its armored headpiece first. The Sangheili struggled all it could, but like an Elite being assassinated, it was too late and spartan was overpowering them. Kat used her combat knife to peel the rest of the Elite out of its armor like you would peel the skin off an orange. <br>\r\n<br>\r\nNoble Six recovered enough to return to his feet, only to witness Kat doing the strangest act he'd ever seen a person do. She was eating an Elite three times her own size! And she was already halfway along. Six broke his normal quiet streak to ask what was going on. Kat replied in a muffled, \"Saving your ass Six!\" Six didn't quite know what to make of the strange display, but he was thankful for Kat rescuing his rear end. Kat had removed all of the Elite's armor by this point, and was beginning to swallow its legs. Her belly was greatly expanded by this point, it was far larger than the female spartan was, and its enormous growth ripped through the black under skin of her suit, exposing the soft flesh of her belly to the open air. <br>\r\n<br>\r\nAfter a couple more minutes Kat finished gulping the very last of the Elite's feet, \"-URP- No problem Six, we can talk about it more back at base.\" While Six had no idea what had just happened, he was grateful for it, and maybe a little more aroused by Kat's full belly. <br>\r\n<br>\r\nThe next important question came down to what to do next: call for an air evac, or go on further by foot?</span></div></div>",
            "created":1421902800,
            "id":1921244,
            "title":"Kat tries the Swallow Maneuver"
        },
        "1551211":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "The Next Morning",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The helicopter ride back to Sword Base was a long two hour ride, Kat earned many an awkward stare from the soldiers on board. The Elite in her giant belly could be seen in the outlines on her skin's surface. It made many violent movements and struggles during the ride, but those gradually died down as they got nearer to the base. Their superiors were none too pleased by Kat busting her armor, MJOLNIR armor was extremely expensive, but they were still glad that they hadn't lose any SPARTANS that day. By the time the chopper landed and Kat and Noble Six were both mission debriefed, it was late at night on that side of Reach. So both SPARTANS were getting ready for sleep in the barracks. <br>\r\n<br>\r\nNoble Six wanted to thank Kat personally for saving his life back there, dressed in only his grey boxers, he sought Kat out. He found her in the women's bunks, still transporting her immense belly around, although by now it was rounder than before as the Elite inside had been well underway digesting. Kat herself was dressed in standard issue gray panties and a matching tank top. She looked beautiful in Six's eyes, and the belly was endearing and a little cute too. \"Six, come here!\" she loudly whispered.<br>\r\n<br>\r\nSix didn't think twice and made his way over to his engorged crush. \"I just wanted to thank you again for saving me today.\"<br>\r\n<br>\r\n\"It was nothing, I would have done it any other time...and also I'm sure you would have done the same for me.\"<br>\r\n<br>\r\n\"Ye-yeah,\" Six stammered out, he wasn't used to talking this much. Both SPARTANS let out a blush at each other. \"Well I guess I have to get back to my bunk now,\" he began to turn around.<br>\r\n<br>\r\n\"Hey Six, why don't you lay in bed with me for a bit?\" Kat invited. \"Ok\" he readily replied back, letting out some his obvious interest. Kat's bed was quite snug, it was after all, only designed for one SPARTAN to sleep on, not two plus an Elite. Their two bodies rubbed one another in the small space, with Six getting more acquainted to Kat's belly than he ever had before. The two felt up each other's skin and took in their body odor. Their hormones started racing for more interaction. The rubbing eventually became groping and then finally grinding. <br>\r\n<br>\r\nNoble Six switched positions to get on top of Kat's dome of a stomach, putting him in prime position to kiss her face and stick his penis in her welcoming pussy. Both SPARTANS were in desperate need of release from constant war, and both were more than obliged to give the other than pleasure. Six released his warm load into Kat's accepting pussy, soaking in his juices, and expelling out her own during her climax. Both became exhausted and eventually fell asleep in each other's loving arms.</span></div></div>",
            "created":1421902800,
            "id":1921250,
            "title":"Close Night of Passion"
        },
        "15512111":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "Kat and Six go on another mission together",
                "All of Noble Team goes on a mission"
            ],
            "content":"<div class=\"\"><div> <span>By next morning, the pair of SPARTANS were still holding each other in a tight loving embrace. Kat was the first to awaken, immediately she noted the lack of a heavy belly attached to her; the Elite had been kind enough to allow itself to be completely dissolve overnight. She laid awake in bed for a few minutes longer, Six's breathing being her only source of company. While SPARTAN-B312 was new to Noble Team, Kat felt an intense physical attraction to the male SPARTAN, evident obviously in last night's love making session. <br>\r\n<br>\r\nKat sat up in bed to inspect some of the changes to her body after digesting the Elite, her breasts had notably swelled up several cup sizes, leaving her with an impressive H-cup. The growth of her breasts had also managed to snap her two sizes too small tank top. Kat groped her new assets, getting accustomed to their new dimensions and weight. Her movement in bed stirred Noble Six to waking. \"Morning sleepyhead,\" Kat said to her still groggy lover. \"Fun night last night?\"<br>\r\n<br>\r\nSix instantly perked up at being reminded of what they did, \"I'll say. And it looks like you're back to your usual shape I see.\"<br>\r\n<br>\r\nKat gave an uncharacteristic giggle. \"Somewhat, but I also have some new shapes,\" she leaned over to him, giving him the best possible view of her greatly enlarged breasts. Noble Six brushed his head up against Kat's soft chest, like a pet cat cuddling up to its owner. <br>\r\n<br>\r\n\"Well, I think's time we both got ready.\" Kat started to get up out of bed, but felt a tug on her behind. She looked over her shoulder and saw Six hugging her butt; her breasts weren't the only thing to grow, her ass cheeks had expanded like huge beach balls. Her gray panties clung tightly around her wide hips and swollen cheeks, but the reduced area gave Six a better view of private parts. Kat thought Six really was like a lost puppy looking for an owner. She gave Six a long kiss on the lips to see if that would settle the lover boy down. \"We can have round 2 tonight Six, but right now we really need to get suited up.\"<br>\r\n<br>\r\nKat got out of bed for real this time and stood her full height, Six followed second.From Kat's perspective, Six was looking a bit shrimpy. \"Hey Kat, weren't we always the same height? Since when were you almost as tall as Jorge?\" Kat looked around the room to compare and he was right, she had grown in height. The formerly 6'9 woman was now closer 7'4, she was going to need all new armor, not just a repair like they thought yesterday. Maybe combat was going to become more interesting for a bigger Kat? But one thing was definitely for sure: sex with Six was going to be a whole new experience.<br>\r\n<br>\r\nKat and Six walked over to the armory to get suited up, with Kat resting her arm over Six's shorter shoulders and bringing his head close to her bosom. They both enjoyed this level of closeness in each other's company.<br>\r\n<br>\r\n</span></div></div>",
            "created":1421989200,
            "id":1921677,
            "title":"The Next Morning"
        },
        "155121111":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "eat all of the children",
                "unbirth all of the children"
            ],
            "content":"<div class=\"\"><div> <span>After Kat and Six suited up, Kat had to have an up-scaled robotic arm attached, as her old one was too small now, just like the rest of her armor; they met in Command HQ getting briefed for their next missions. \"Kat you'll be heading to an orphanage in New Alexandria that has been cut off the Covenant. The Covies' AA guns prevent us from landing an air evac to save the children, and there's too much infantry on the ground to send in marines, So that's why we're sending a SPARTAN in to take care of the job, you are those kids' only hope SPARTAN. Do us proud.\" Sword Base's commander ordered. <br>\r\n<br>\r\nKat nodded, \"Can do sir.\" Six fidget a little, \"Permission to join SPARTAN-B320 on this mission, sir.\"<br>\r\n<br>\r\n\"The Lone Wolf wants to join the pack for a change? This isn't normally like you Noble Six, but... on consideration of the consequences of this mission, I'll allow it. Your Falcon is waiting to take you there now.\"<br>\r\n<br>\r\nOn the Falcon flight to the LZ, Kat and Six were staring intently at each other, \"You couldn't stand the thought of spending another minute without my company, huh Six?\" Kat teased. Six simply shook his head. \"That's alright, I prefer this arrangement myself. I think we make a good team.\" <br>\r\n<br>\r\nWhen they reached the landing zone, the Commander wasn't lying about the amount of infantry, as the LZ was quite hot. The Falcon pilot didn't bother landing the helicopter, the two SPARTANS jumped from ten feet in the air right into a firefight. The two took cover on some nearby crates, the enemies in area was pretty standard, mostly Grunts, Jackals, and a couple Elites directing those beneath them. Kat took a few head shots on Grunts when she could find them; Six was alternating between a machine gun and a DMR, using the machine gun to break the Elites' shields while using the DMR to inflict the critical damage to heads and vitals. The two skilled soldiers made quick work of the landing area, before moving on to deeper parts of the city.<br>\r\n<br>\r\nThey found the orphanage at the coordinates they were given, but when they reached it, they found it under siege by more Covenant. At the entrance of the building were the very last guards protecting the building, they were firing in vain at the invading aliens, but a green explosions rips around them, incinerating their bodies. This time they were assisted by Hunters armed with heavy plasma cannons. This would complicate things. Their strategy was much the same as before, picking off the weakest members of the Covenant while working their way up to the stronger opponents. When fighting the Elites, Six provided a distraction, goading one around a corner, where a waiting Kat was hiding. Using her enhanced strength from her bigger body, she had an easy time beating the Sangheili into submission, AKA punching his face so hard his neck broke. \"That's some power,\" Six remarked. Kat only snickered in response.<br>\r\n<br>\r\nWith all of the Elites finished, they turned their attention back to the Hunters, whose shots they had been dodging the whole fight. Six picked up a nearby rocket launcher, too bad there was only one shot left in it, it wouldn't be lethal, but he could at least soften up one of the Hunters. Kat, on the other hand found a shotgun, while she prefers pistols, she knew when times arose when that wasn't going to be enough. Six let off his rocket, it hit the closest Hunter to him. The Hunter in turn, absorbed the blast, albeit with damaged armor. Kat made her move behind the worm beast and shot off a spray of pellets into its back, harming it even further. Six took the opportunity to throw a sticky grenade on its exposed back, finishing it off. The other Hunter became enraged upon seeing its brother be killed, it ran forward, swinging its mighty arm at Six. Six was turned around, trying to escape the Hunter's swing, he was too slow to turn, but Kat rushed forth and tackled Six out of range of the swipe. Kat excited the tackle with a somersault, with her shotgun aimed at the Hunter's exposed face. She let pulled the trigger, releasing the shell into the beast's face. It didn't die of course, but it was injured. Kat dodged another of the Hunter's swipe, this time jumping behind it. She let off a few more shots, this time killing the beast. By this time Six recovered and was back on his feet. The Covenant in this area were defeated, for now. \"Come on let's head inside,\" Kat told Six, who followed her in.<br>\r\n<br>\r\nPast the front doors were bloody bodies littered about everywhere, there was no one to greet them. A few seconds in, the two SPARTANS could hear weeping from deeper inside the orphanage. Six and Kat searched for source of the sobs, finding them louder near the basement entrance. When they opened the door, they heard the voices of children. \"Is it safe yet?\" \"Where's Melissa?\" \"Who are you?\" <br>\r\n<br>\r\nThe two soldiers were overwhelmed by the questions asked, Kat took charge as Six wasn't much of a communicator, she took her helmet off to appear more human and comforting to the obviously scared kids. \"Children please calm. We're here to rescue you from the aliens. Can you tell me where the adults are that are watching you?\" One of the older kids, a ten year old girl spoke up, \"They were all upstairs keeping watch and protecting us. Melissa worked here and was our main caretaker, did you see her?\" The SPARTANS looked at each other grimly, remembering seeing the corpse of a woman in hallways with a name tag that read Melissa. \"I'm sure she's fine, and we'll look for her once we get you kids secured. I'll call in an air evac and get you all out of here to safety.\" <br>\r\n<br>\r\n\"Noble Actual, this is Noble Two, I need a Pelican here to evac these children.\" <br>\r\n<br>\r\n\"Negative Noble Two, there is still too much AA in your area to send in an evac.\"<br>\r\n<br>\r\n\"WHAT?! These kids will die out here if you don't evacuate them.\"<br>\r\n<br>\r\n\"There's nothing else we can do, we're stretched thin enough as it is and we can't risk losing more. I'm sorry, you'll have to find your own transport.\"<br>\r\n<br>\r\nKat looked to Six, \"There's no evac coming, we're on our own.\" <br>\r\n<br>\r\n\"What are we going to do?\" the male SPARTAN asked.<br>\r\n<br>\r\n\"Try to find a working vehicle, any vehicle. We'll take ten minutes and come back here.\" Ten minutes comes and goes, unfortunately they couldn't find an armored vehicle, but Six did find a transport Warthog, but it would leave the children exposed without protection. \"The children won't be safe in this thing, do you have any ideas to shield them?\" Six asked. <br>\r\n<br>\r\nKat was forced to get creative again. Things were getting pretty drastic, they no protection, no armor, for these kids. Then Kat got an idea, she had armor, if she brought the kids inside of her suit, her MJOLNIR armor could protect all of them, but how was she going to bring them in? Kat decided to...</span></div></div>",
            "created":1423717200,
            "id":1932251,
            "title":"Save the Children"
        },
        "1551211111":{
            "author_id":"jewelthespix23",
            "author_name":"Bluthespix22",
            "choices":[
                "Search for noble six and digest the children",
                "Leave and hope noble six will make it own his own"
            ],
            "content":"<div class=\"\"><div> <span>Kat looked at the children again before making her choice. She had put her helmet on a nearby bench \"Six,I nee to talk to you for a sec\" \"uhh... sure what is it\"he asked<br>\r\n\"We don't have many options except for that warthog and I can fit all the chil...\" \"Don't  tell me you want to\" \"Listen six we don't many other options\"kat said with a determined tone \"Fine but these are kids so be gentle\" \"I will\" six stood aside and watched as kat went over to the kids \"Alright I have a plan but no promises that you'll like it I'm going to eat you all but it's only to get you to saftey once we're safe i)l let you out\" all the kids stares at kat like she was dumb but soon they started to agree with her plan mainly because anything was better then being here where the covenant could get them Kat grabbed a kid with glasses by the shoulders and pulled his head into her mouth six watched as her stomach grew bigger after fully swallowing a kid he watched in about 50% shock that she could do that and about 50% attracted to her motions. It didn't  take long before she had all kids in her stomach <br>\r\n\"Six,you ready\" he nodded they headed out the basement to an old orange Corp warthog six took the wheel and kat sat next to him with her stomach against the dashboard. Six drove off and started heading back to base \"Noble actual this is Noble 2 we got the kids and are returning to base\" \"copy that Noble 2 good job Noble actual out\" it was a long hour of nothing but driving but then came a covenant stronghold a blast from a hunter quickly tipped the warthog making six fly out the front window and kat laying on her back beside the warthog Six was nowhere to be seen and kat didnt have much time to waste or she would end up digesting the children so she had tough decision to make.</span></div></div>",
            "created":1576128540,
            "id":2758529,
            "title":"eat all of the children"
        },
        "15512111111":{
            "author_id":"jewelthespix23",
            "author_name":"Bluthespix22",
            "choices":[
                "Round 2 of sex",
                "Split up and have them sleep on their own"
            ],
            "content":"<div class=\"\"><div> <span>Quick author note: the choice was meant to say RISK digestion the children <br>\r\n<br>\r\nKat quickly got to her feet and reached for her trusty pistol to realize it wasn't there she looked around before spotting a plasma pistol from a grunt that died in the explosion of the warthog. Looking around for six one more time before seeing what had taken out the warthog  there were two elites one hunter and about 12 jackals with about 30 grunts while focusing  on the enemy count she saw something moving closer  toward her she looked over to see six limping his way over to the warthog thankfully none of the covenant had seen him by time six got to the warthog he crouched beside it \"Hey you alright Six\" with a sound if concern in her voice \"Y-yeah I'm fine but more importantly are the kids?\" Kat had almost forgot the children  \"O-oh yeah there fine but we have to get to base soon I dont think I can hold them much longer I can feel their movements getting weaker\" \"ok then we need to hurry but we're going to have to walk\" \"alright let's stop talking and get moving\" the of then started walking still remaining undetected  about an 30 min walk there reached base \"Noble 2 to Noble actual  were back open the doors Noble 2 out\" \"Command confirm Noble 2\"  by time they got in the base Kat was already helmetless throwing the kids back up all except one \"why isn't he coming out\" \"he died he was in there to long\" there was a small bulge in her stomach she was digesting the kid with glasses the first kid she ate her stomach was fast at work digesting the kid <br>\r\n\"Well at least mist if you made it\" at this point it was late at night once again so six what will it be</span></div></div>",
            "created":1576296900,
            "id":2759336,
            "title":"Search for noble six and digest the children"
        },
        "1551211112":{
            "author_id":"chuckrogers",
            "author_name":"MidgetBiker",
            "choices":[
                "They drive straight to the base",
                "They take a detour"
            ],
            "content":"<div class=\"\"><div> <span>Kat looked back to the children, \"I know this is going to sound pretty crazy, but honestly pretty desperate here. You kids need protection while we drive out of here, and this is our only option. I'm going to unbirth you all, and bring you into my womb, you'll be safe in there, under all of my armor.\" The children were all confused by her request and didn't move, \"We have to move now!,\" Kat started undoing her armor around her waist, freeing the skin around her pelvis and thighs. She laid down on her back, spreading her legs wide to accept her first passenger<br>\r\n<br>\r\nThe first group to go in were the toddlers who could walk, they could get assistance from Six outside, helping them in, while Kat's vaginal muscles did most of the work inside. Six hustled the children in as gently as possible, as they were on a strict time schedule before Covenant reinforcements arrived. The first child in immediately curled up, leaving an obvious bulge in Kat's midsection outside. The young toddlers fought with Six, not understanding why they were being pushed back into the womb, but they were going to be the biggest hassle, and that's why they were chosen to go first. <br>\r\n<br>\r\nThe toddler group finished at only four. The next up were the older kids, their ages ranging from five to eleven, there were eight of them in total. They were harder in some ways than the toddlers, harder for Kat that is, to get them inside, their larger bodies proved more of a challenge to get inside the vaginal lips. \"HNNNNNGG,\" Kat grunted a heavy breath as the ten year old girl entered inside her. \"How are you holding up Kat?\" Six inquired. \"Alright all things considered, I've fit larger things in my stomach before, surely I can fit fifteen children in my womb.\" Six was gripping Kat's hand while soothingly massaging her increasingly bulging midsection, the black under suit of her armor, becoming more and more stretched as each child entered.<br>\r\n<br>\r\nThe last were the group, were the three infants. They wanted to do the infants last to ensure that the older kids inside would be able to receive them and find a safe place for the babies inside. Six looked down at the infant in his arms, prepared to push it up Kat's cooch. He thought its sleeping form was one of the most beautiful sights on Reach, and while he was a career soldier, he wouldn't mind having a child of his own after the war blew over. Kat looked at Six peering down at the infant, \"Six...come on,\" she urged him. \"Right,\" he continued on with their plan, placing the baby's legs into Kat's vagina, a combination of gently pushing from Six and pulling from one of the children in the womb brought the infant's full body inside of Kat. They repeated the process for the other two babies. <br>\r\n<br>\r\nOnce all the children were safely tucked in Kat's womb, the female SPARTAN was extremely stuffed. Her womb was fuller with fifteen children inside than her stomach was with one Elite she ate the other day. Her belly was so large, Kat couldn't get up on her own, Six lent her a hand and puller her to her feet. Her black skin suit covered her entire body and ensured that none of Kat or the children would be exposed to enemy fire. Six asked \"So how does it feel?\" while rubbing the stretched skin suit outside.<br>\r\n<br>\r\n\"Heavy, but... comforting, like I'm a mama to all of these kids.\" Inside of her womb, amniotic fluid had filled up and umbilical cords attached to all of her passengers. Hormones flooded her bloodstream as her body quickly identified itself as being pregnant. Kat's already expanded breasts distended even further in size as milk production started booming like mad. \"...and now I'm really pregnant.\" Both SPARTANS were surprised at the speed at which Kat's milky breasts enlarged themselves. Six thought Kat was the most beautiful woman he had ever laid eyes on, she basked in a divine maternal glow, that only being pregnant with a giant belly could bring. She was already en exemplary woman, being incredibly tall and busty, not to mention a total badass, and pretty smart too, being pregnant was just like a cherry on top of an already awesome sundae.<br>\r\n<br>\r\nA loud explosion outside reminded the two of the pressing matter of escape. They ran over to the parked Warthog outside. Kat needed help getting her belly into the vehicle, a task which Six was all too happy to assist her with. Once situated, Kat had a detached mounted machine gun, which she could use to fend off approaching Covies. Six took to the wheel and floored the vehicle, intent on escaping New Alexandria with everyone on board alive.</span></div></div>",
            "created":1423717200,
            "id":1932267,
            "title":"Maternal Kat"
        },
        "15513":{
            "author_id":"annathesum",
            "author_name":"Anna Wolfe",
            "choices":[
                "Marines",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Marines<br>\r\n<br>\r\nMore choices</span></div></span></div>",
            "created":1427000400,
            "id":1951964,
            "title":"More choices"
        },
        "155132":{
            "author_id":"scp-spartan049",
            "author_name":"Deck_Spartan",
            "choices":[
                "IIs",
                "IIIs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Female Spartans<br>\r\n<br>\r\nIIs or IIIs</span></div></span></div>",
            "created":1599600960,
            "id":2899651,
            "title":"More choices"
        },
        "1551321":{
            "author_id":"scp-spartan049",
            "author_name":"Deck_Spartan",
            "choices":[
                "Linda",
                "Kelly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Members of Blue Team<br>\r\n<br>\r\nLinda or Kelly?</span></div></span></div>",
            "created":1599601080,
            "id":2899652,
            "title":"IIs"
        },
        "1551322":{
            "author_id":"scp-spartan049",
            "author_name":"Deck_Spartan",
            "choices":[
                "Lucy-B091",
                "Fem!6 -B312"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lucy-B091 or Fem!6 -B312</span></div></span></div>",
            "created":1599645060,
            "id":2899891,
            "title":"IIIs"
        },
        "1552":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Elite",
                "Prophet",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who in the Covenant?</span></div></span></div>",
            "created":1418101200,
            "id":1900101,
            "title":"Covenant "
        },
        "15523":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Jackle",
                "Hunter",
                "Grunt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More Covenant</span></div></span></div>",
            "created":1418101200,
            "id":1900103,
            "title":"Other"
        },
        "155232":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "One Person",
                "2 People",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>You are huge hunter patrolling an area on the planet Reach. You have been here for over 8 hours and haven't eaten anything and nothing has happened yet. You have thought about eating those birds that run around but they were to fast for you. A few more minutes pass before you see a human jeep driving over the hill infringement of you. You look closely at the person in it and it seems to be...</span></div></div>",
            "created":1418101200,
            "id":1900178,
            "title":"Hunger Hunter"
        },
        "1552321":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Noble Team Member",
                "Master Chief",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are they?</span></div></span></div>",
            "created":1418101200,
            "id":1900179,
            "title":"One Person"
        },
        "15523211":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Kat",
                "Carter",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1418101200,
            "id":1900180,
            "title":"Noble Team Member"
        },
        "155232111":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Take off",
                "Shell is the best part"
            ],
            "content":"<div class=\"\"><div> <span>You see the blue women driving straight for you but you simply plant your shield in the ground and flip the car. You walk beside and reach your arm inside and grab the human. She is dazed but still awake and starts to punch your arm but is not effective. You smile at her and lick your lips wanting her as good. Should you keep her armor on or take it off?</span></div></div>",
            "created":1418101200,
            "id":1900184,
            "title":"Kat Lunch"
        },
        "1552321112":{
            "author_id":"bichhrlt",
            "author_name":"The Foox",
            "choices":[
                "Digest Her",
                "Find More Food"
            ],
            "content":"<div class=\"\"><div> <span>You decide to keep her amour on, it's more delicious and they last longer in your belly. You lift the blue Spartan in the the air, above your now open maw. She starts to panic more now that she knows what is happening. You drop the Spartan into your mouth and close it once she lands inside. You swish the small Spartan inside your mouth for a while before starting to swallow her down. She try's to stop herself from falling down your throat but you are to strong and gulp her down into her new home. Your belly bulges a little as it fills with the human Spartan. You pat your belly and ponder on what to do next.</span></div></div>",
            "created":1420866000,
            "id":1916137,
            "title":"Shell is the best part"
        },
        "155233":{
            "author_id":"annathesum",
            "author_name":"Anna Wolfe",
            "choices":[
                "Pred",
                "Prey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you're an Ungoyy. But are you a Predator or Prey?</span></div></span></div>",
            "created":1427000400,
            "id":1951965,
            "title":"Grunt"
        }
    },
    "info":{
        "author_id":"bichhrlt",
        "author_name":"The Foox",
        "brief_description":"Characters in the Halo series are hungry but for who?",
        "created":1418133480,
        "description":"<td align=\"left\" class=\"norm\">Welcome to the Halo series with a little twist. Become a Pred or a prey for anyone in the Halo series. Be Master Chief and become a meal for The Arbiter. This story contains vore, digestion, scat, and death.  All types of vore allowed along with some dirty stuff but only M|F, no M|M or F|F.</td>",
        "id":2021371,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1599645060,
        "modified":1599645060,
        "pretty_title":"Halo Vore"
    }
}