{
    "chapters":{
        "1":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "Brenda",
                "Tyra",
                "Thorne",
                "Cherri",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>first choose the girl you want to control.<br>\n<br>\nremember: you can go to fossils website for descriptions and personalities</span></div></span></div>",
            "created":1207976400,
            "id":521047,
            "title":"choose your girl"
        },
        "11":{
            "choices":[
                "Shrink",
                "Grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah, the biggest one of all! So, does the big blue beauty shrink or grow?</span></div></span></div>",
            "created":1207976400,
            "id":518924,
            "title":"Brenda"
        },
        "111":{
            "choices":[
                "The kitchen",
                "Thorne's room",
                "Tyni's room"
            ],
            "content":"<div class=\"\"><div> <span>Brenda wandered through the house, looking for something, anything to do. It was a hot summer day, and she'd just gotten out of the pool behind the Beauties' house. Still clad in her tight bathing suit, she felt incredibly bored after the swim, and decided to roam around the house, looking for something to do.<br>\r\n<br>\r\nThe house was unusually quiet as Brenda strode through the halls, careful to duck through low-hanging (at least for her) doorways. \"Wonder if there's anything good in here?\" she wondered as she stepped into...</span></div></div>",
            "created":1208494800,
            "id":521323,
            "title":"Bored Brenda"
        },
        "1111":{
            "choices":[
                "took a sip.",
                "tossed it down in one gulp."
            ],
            "content":"<div class=\"\"><div> <span>Brenda stepped into the kitchen, and was surprised to see a bubbling cup of something on the table, with a sign that said, \"Drink me.\" Brenda was a little suspicious of a trick, but she was very thirsty, and she didn't she anything else to drink. Besides, it smelled really good. What could happen?<br>\r\n<br>\r\nBrenda stepped over and reached down to grab the drink. She picked it up and...</span></div></div>",
            "created":1208581200,
            "id":521606,
            "title":"The kitchen"
        },
        "11111":{
            "choices":[
                "Kitti's height",
                "A foot shorter than Kittie"
            ],
            "content":"<div class=\"\"><div> <span>Brenda sipped a little, and was suprised at the taste of the drink. It was good! She hummed happily to herself and took another sip, but then noticed something unusual. The table, which used to be up to her thighs, was now up to her waist. It didn't take long for Brenda to figure it out. She had shrank!<br>\n<br>\nShe was about to toss the drink in the sink, when she got an idea. \"I've always wondered how it would be if I was smaller.\" she mused. A grin formed on her face. \"Yeah, I could shrink to Cherri or Kitti's height. I've always been the big one. Maybe I could get small for a change.\" Brenda sipped a little more of the drink, and felt herself getting smaller. She stopped when she was...</span></div></div>",
            "created":1208581200,
            "id":521649,
            "title":"Small shrinkage"
        },
        "111111":{
            "choices":[
                "Kitti walked in",
                "Tyra walked in"
            ],
            "content":"<div class=\"\"><div> <span>Brenda got smaller and smaller, and finally stopped at 5', Kitti's height. \"Wow.\" she said, looking at her new environment. \"So this is what it's like. Everything's so...big.\" She stepped around, amazed at how much longer it took to get places, and how she didn't bump her head on the ceiling. her swimsuit had already slipped off, being twice her size now.<br>\r\n<br>\r\nFootsteps echoed down the hall, and...</span></div></div>",
            "created":1208581200,
            "id":521717,
            "title":"Kitti's height"
        },
        "1111112":{
            "choices":[
                "I want to show all the other girls!\"",
                "I want to do something with you a this size!\""
            ],
            "content":"<div class=\"\"><div> <span>Footsteps signaled the approach of one of the girls, and Tyra rounded the hall corner into the kitchen. She absent-mindedly glanced down at Brenda. \"Hey Br-?\" She did a double take and dropped the book in shock. Did she just look down at Brenda?<br>\r\n<br>\r\n\"Hey Tyra.\" Brenda smiled, giggling up at her. \"You seem taller.\"<br>\r\n<br>\r\n\"How did you get like this?\" Tyra asked, crouching down a little to look Brenda in the eye. \"I mean, you're so...small.\"<br>\r\n<br>\r\nBrenda giggled, hugging Tyra in her giddyness. \"I know! Everything's so cool like this! I drank a drink on the counter, and suddenly I started shrinking!\"<br>\r\n<br>\r\nTyra's surprised look faded to happiness as she started giggling along with the shrunken Beauty. \"You're certainly happy about this, aren't you?\"<br>\r\n<br>\r\n\"Yes!\" Brenda said, squeezing Tyra in her best bear hug. \"And now...\"</span></div></div>",
            "created":1212814800,
            "id":541296,
            "title":"Tyra walked in"
        },
        "111112":{
            "choices":[
                "Tyni",
                "Val"
            ],
            "content":"<div class=\"\"><div> <span>Brenda slowly contracted, and soon she was a little over 5 foot, her target height. But she kept shrinking. \"Whoops.\" she said nevously as she continued to dwindle down. She finally stopped at 4', a full foot shorter than Kitti!<br>\r\n<br>\r\n\"Oh, great.\" she muttered as she tossed her now-giant swimsuit off of her shrunken body. \"Now I'm a midget. Oh well.\" She surveyed the newly enlarged kitchen, and was in the process of trying to climb onto the counter to get a better view when footsteps clambered down the hall, towards the kitchen. \"Who could that be?\" Brenda wondered.<br>\r\n<br>\r\nIt was...</span></div></div>",
            "created":1208581200,
            "id":521719,
            "title":"4' giantess"
        },
        "11112":{
            "choices":[
                "6 inches tall!",
                "3 inches tall!"
            ],
            "content":"<div class=\"\"><div> <span>Brenda swallowed the entire drink in one gulp. It bubbled in her stomach, and Brenda burped loudly as soon as it landed in her belly. She suddenly felt very dizzy, and collapsed on the floor.<br>\r\n<br>\r\nWhen she awoke, she thought she was dreaming. She was naked, with huge pieces of cloth in front of her. She stood up and saw she was laying on a huge white-tiled floor, and only when she looked up did she realize what happened. She was still in the kitchen, but it was gigantic! Appliances towered over her, and her bathing suit seemed as wide as a house. Brenda figured she must've been no more than...</span></div></div>",
            "created":1208581200,
            "id":521666,
            "title":"Tiny Brenda"
        },
        "111121":{
            "choices":[
                "Tyra",
                "Cherri"
            ],
            "content":"<div class=\"\"><div> <span>Brenda had shrank to 1/22 of her height! She was barely tall enough to reach a handle on the lowest drawer on the counter. \"Woah.\" she whispered, spaced out as she walked around the gigantic kitchen.<br>\r\n<br>\r\nBooming footsteps signaled the approach of a person, and a voice lazily said to itself, \"I'm starved. Wonder what's in the kitchen?\" <br>\r\n<br>\r\n\"Hey, I know that voice!\" Brenda thought as the footsteps came closer. \"It's...\"</span></div></div>",
            "created":1208581200,
            "id":521716,
            "title":"6 inches tall!"
        },
        "1111211":{
            "choices":[
                "evil! (uh-oh)",
                "concerned."
            ],
            "content":"<div class=\"\"><div> <span>The massive Tyra walked into the kitchen, looming over the countertop. She sniffed the air curiously. \"What is that?\" she wondered to herself aloud. Brenda gazed up at the big Beauty. To her, Tyra seemed about 16 times taller than her, a giant fleshy mountain wearing jeans and a ripped T-shirt.<br>\r\n<br>\r\n\"Tyra!\" she shouted in the lull, running around and doing her best to get noticed. She was hoping the T-rex girl would help her out. Tyra's eyes widened at her tinny voice.<br>\r\n<br>\r\n\"Who said that?\"  she asked aloud, shaking Brenda as she turned around.<br>\r\n<br>\r\n\"Down here!\" Brenda yelled. Tyra looked on the floor, and shock filled her face.<br>\r\n<br>\r\n\"Brenda,\" she whispered, crouching down. \"is that you?\". Tyra reached out and gently touched the tiny girl to confirm she was real.<br>\r\n<br>\r\n\"Yeah!\" Brenda replied, stepping a little closer. She couldn't believe how big Tyra was. Her foot alone was as big as a car. \"I shrunk after drinking a drink on the table. You have to help me!\"<br>\r\n<br>\r\nTyra's expression went from confused to...</span></div></div>",
            "created":1211778000,
            "id":536281,
            "title":"Tyra finds the tiny Brenda!"
        },
        "11112111":{
            "author_id":"blackfang3986",
            "author_name":"Redfang3986",
            "choices":[
                "to shove Brenda further up her ass",
                "play a game with her new toy"
            ],
            "content":"<div class=\"\"><div> <span>Tyra gave an evil grin as she looked down at Brenda. \"Damn I can't believe it worked\" she screamed aloud. She jumped for joy and Brenda fell to the floor by the titanic rex's movements. She tried to maintain her composure but the seemingly giant foot falls kept shaking her to the ground. She watched as her giant purple T-rex roommate danced happily on the floor. Eventually she stopped and fixed her eyes on Brenda again. She grinned and revealed a mouth of wickedly sharp teeth. She then reached down and grabbed the tiny brontosauruses. He hand curled into a tight grip around the now terrified Brenda. <br>\r\n<br>\r\n\"Tyra, what worked\", screamed Brenda as she squirmed within the iron grip. <br>\r\n\"The shrinking potion, silly\", Tyra said. <br>\r\n\"Shrinking potion\", cried Brenda. \"You shrunk me.\" <br>\r\n\"Yep\", the massive rex answered. <br>\r\n\"Well grow me back right now\", shouted Brenda in rage. <br>\r\n\"No can do Brenda. You see I was going to test this on one of you I just didn't know which of you would take the free drink. I'm so glad it was you though. We're going to have so much fun together. Well actually I'll be having fun, you probably won't.\" Tyra brought Brenda closer to he snout and examined the tiny herbivore. \"Hm, now that I think about it you still a little bit too big for what I have in plan. Let's make you even smaller!\" <br>\r\n<br>\r\nBrenda looked horrified. \"Are you crazy, Tyra? I'm already six inches tall how much smaller could I be.\" She was about to say something else but Tyra gripped her tighter and Brenda gave out a startled yelp. \"You should know better then to call someone who's much bigger then you crazy, just for that I think I'll keep you small.\" Brenda looked horrified. \"Oh and don't worry about the others once I'm done having some alone time with you, I intend to shrink them down too.\" <br>\r\n<br>\r\nWith that said and done. Tyra walked over to the fridge and pulled out a jug of the shrinking potion then she poured a glass and dunked Brenda's head in. The tiny anthro squirmed and squirmed. She held her breath for as long as she could, but Tyra squeezed her stomach and the bronto was forced to swallow the potion. Tyra then brought Brenda to her face and watched as the little dinosaur coughed and hacked. Then Brenda began to get smaller. She shrank and shank until she stood at the minuscule height of one inch. Brenda looked around at her now even larger surroundings and then fixed her eyes on Tyra. The girl was massive she now seemed sky scraper size to tiny Brenda. Tyra pinched Brenda's tiny body and brought her dangerously close to her giant mouth.<br>\r\n<br>\r\n\"Now Brenda\", Tyra began. \"Your not gonna give me any more resistance are you?\" The tiny bronto shook her head. \"And your going to do exactly as I say, right?\" Brenda nodded. \"Good now let's put you somewhere safe. I don't want to risk the others seeing you.\" With that Tyra pulled back her pantties and placed the tiny bronto in between her large, soft, yet tight ass. She made sure to wedge Brenda in as tight as she could before snapping back her panties and let darkness envelop the tiny bronto. Tyra walked back to her room, moaning slightly from tiny squirms Brenda had trying to escape. Tyra entered her room looked the door and decided...<br>\r\n </span></div></div>",
            "created":1372713540,
            "id":1620942,
            "title":"evil! (uh-oh)"
        },
        "111122":{
            "choices":[
                "Thorne",
                "Tyra"
            ],
            "content":"<div class=\"\"><div> <span>Brenda had gone from a giantess in her own right to the height of a crayon! \"Uh-oh.\" was all she could say as she gazed around the huge room, marveling at the size of everything.<br>\r\n<br>\r\nSuddenly, the ground began to shake, and Brenda turned around just in time to see a huge foot slam down next to her. Staring upwards, she saw the enormous being who was smiling down at her was... </span></div></div>",
            "created":1208581200,
            "id":521715,
            "title":"3 inches tall!"
        },
        "1111222":{
            "choices":[
                "to have a little fun with you!",
                "to be the biggest girl for once!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Brenda!\" Tyra boomed, grinning down at the tiny being before her. \"You look different!\"<br>\r\n<br>\r\n\"Tyra, help me!\" Brenda yelled up, still a little frightened at the Tyrannosaur's toothy grin. \"I've shrunk and I don't know why! I think it had something to do with-\"<br>\r\n<br>\r\n\"This?\" Tyra finished, holding up the empty cup of the strange drink. \"Yeah, I know! I made it just for you!\" She giggled again, her laughter shaking Brenda's world.<br>\r\n<br>\r\n\"You?\" Brenda asked, confused. \"Why?\"<br>\r\n<br>\r\nTyra crouched down and closed her hand around Brenda's tiny body. \"Oh, come on Brenda.\" she said, still giggling in excitement. \"I wanted...\"</span></div></div>",
            "created":1208754000,
            "id":522582,
            "title":"Titanic Tyra"
        },
        "11112221":{
            "choices":[
                "Well, I do have the antidote...",
                "Uh, not really"
            ],
            "content":"<div class=\"\"><div> <span>Brenda flew upwards within Tyra's grasp, then collapsed in her open palm. \"What?\" she said, still confused.<br>\r\n<br>\r\n\"Oh, you know,\" Tyra said, lifting Brenda up to her snout. \"just a little playtime with me, just us girls. Maybe later I'll show you to the others.\"<br>\r\n<br>\r\nBrenda knew in the JB house, playtime meant jumping on each other nude or some kind of foreplay. It never progressed past that, but Brenda was still scared of her new size and of Tyra, who was building-sized to her. Still, Brenda had done this kind of thing with Tyra before, and she trusted Tyra not to hurt her.<br>\r\n<br>\r\n\"Alright.\" she said. Tyra smiled down at her.<br>\r\n<br>\r\n\"Great, although you know it's not like you had a choice.\" she said, and she took a step towards the hall.<br>\r\n<br>\r\n\"Wait!\" Brenda called out. \"Can I go back to normal?\"<br>\r\n<br>\r\nTyra glanced back at her, replying, \"...</span></div></div>",
            "created":1208754000,
            "id":522679,
            "title":"fun with Tyra"
        },
        "111122211":{
            "choices":[
                "shrink the others?",
                "'get a bite to eat'?"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I do have the antidote...\" Tyra reluctantly revealed. Brenda jumped joyously in her hand. <br>\r\n<br>\r\n\"Great!\" the tiny dino-girl exclaimed, clapping her hands together.<br>\r\n<br>\r\n\"...but you can't have it yet.\" Tyra finished. \"This whole shrinking thing is about you and me having fun with your new size.\" Tyra's expression saddened as she imagined Brenda not wanting to play with her because she had shrunk her.<br>\r\n<br>\r\nBrenda smiled back up at Tyra. \"Aw, don't worry Tyra.\" she assured, patting the purple palm beneath her. \"I'll stay shrunk for ya!\" Brenda giggled as Tyra's face lit up again. \"I actually think it's cool you're so big. You're like a really big sister!\"<br>\r\n<br>\r\nTyra smiled warmly at the tiny girl in her hand. \"Awww,you're the best, Brenda!\" she said, nuzzling the tiny Brenda with her snout. Once the tender moment was over, Tyra glanced down at her charge with a slightly mischevious look on her face.<br>\r\n<br>\r\n\"Hey Brenda, I got the best idea! Why don't we...\"</span></div></div>",
            "created":1210914000,
            "id":532650,
            "title":"What fun can we have?"
        },
        "1111222112":{
            "choices":[
                "I was hoping I'd fill you up!",
                "Great! Let's head back to the kitchen!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Goo idea!\" Tyra replied. I'm a little hungry myself!\"<br>\r\n<br>\r\nBrenda grinned up at the huge Beauty, and said, \"</span></div></span></div>",
            "created":1212814800,
            "id":541304,
            "title":"To vore or not to vore"
        },
        "111122212":{
            "choices":[
                "play a 'game'.",
                "go outside."
            ],
            "content":"<div class=\"\"><div> <span>\"Uh, not really....\" Tyra admitted, her expression turning sheepish. Brenda's face turned to sheer horror.<br>\r\n<br>\r\n\"You mean...\" she started, her voice trembling as she comprehended being doll-sized for life. \"...I'm stuck like this...forever?\"<br>\r\n<br>\r\n\"Hey now,\" Tyra said comfortingly, stroking the trembling dinoess with a finger. \"just because I don't have it here doesn't mean I can't get you back.\"<br>\r\n<br>\r\n\"Really?\" Brenda said, gazing up at Tyra.<br>\r\n<br>\r\n\"Sure. There are lots of ways for you to get big again! It'll just take time, that's all.\"<br>\r\n<br>\r\nBrenda slowly grinned back up at Tyra. \"You had me there for a sec.\" she giggled. <br>\r\n<br>\r\nTyra's booming chuckle shook the tiny dionsaur anthro as she replied. \"Yeah, I guess I did. Besides,\" she said, lowering her face down to Brenda. \"we're gonna have a lot of fun together!\"<br>\r\n<br>\r\nBrenda's grin widened. \"You know, this is pretty cool!\"<br>\r\n<br>\r\n\"I knew you'd warm up to it!\" Tyra said happily. \"Now what should we do?\"<br>\r\n<br>\r\n\"Well,\" Brenda replied thoughtfully. \"I think we should...\"</span></div></div>",
            "created":1210914000,
            "id":532656,
            "title":"Uh, not really"
        },
        "1111222121":{
            "choices":[
                "Godzilla!",
                "'Hide and seek'"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"W-what kind of game?\" Brenda asked, spooked at Tyra's mischeivious grin,<br>\r\n<br>\r\nTyra giggled and stuck out her tongue to playfully lick the tiny Beauty in her palm. \"Oh,\" she purred, \"I was thinking...\"</span></div></span></div>",
            "created":1212814800,
            "id":541305,
            "title":"play a 'game'."
        },
        "11112222":{
            "choices":[
                "show myself to the other girls.",
                "let you 'play' with me."
            ],
            "content":"<div class=\"\"><div> <span>Tyra held Brenda by her waist, bringing the tiny dino up to her face. \"Huh?\" Brenda asked, completly confused. <br>\r\n<br>\r\n\"Oh, come on.\" Tyra said, snorting at her. \"You've always been the biggest, in every way. Bigger boobs, bigger butt, bigger thighs, everything. I want everyone to tower over you for once. Nothing against you, of course. I just want to see how you react.\"<br>\r\n<br>\r\n\"What are you gonna do with me?\" Brenda said, a little frightened at the gigantic Tyra's attitude.<br>\r\n<br>\r\n\"Oh,\" she said, her grin returning. \"I'll be nice. I figure you can either spend some time with me, first, or I'll let you show yourself to the other girls. And before you even ask, yes, I have an antidote. But I'm not letting you have it yet.\"<br>\r\n<br>\r\nBrenda sighed in relief, then thought about her choices. \"I think I'll...\"<br>\r\n</span></div></div>",
            "created":1208754000,
            "id":522680,
            "title":"To be bigger"
        },
        "111122222":{
            "choices":[
                "down Tyra's body",
                "up Tyra's body"
            ],
            "content":"<div class=\"\"><div> <span>Tyra giggled, and she smiled, exposing her huge white teeth. \"Great! I was hoping you'd say that!\" She practically bounded back to her room, shutting the door and jumping onto her king-size bed. Brenda, shaken but unhurt, was placed on a dresser. \"Wait here, sweetie.\" Tyra said, waggling a finger. <br>\r\n<br>\r\nTyra whipped off her top first, then let her jeans fal to the floor, exposing her pink sex and giant nipples. She leaned down to Brenda, her clevage right in front of the shrunken beauty. Brenda couldn't help but stare at the house-sized boobs, and found herself petting one, admiring the flesh. \"Like what you see?\" Tyra said, giggling. Brenda blushed but nodded her head. Tyra's grin became even wider. \"Well then,\" she said, scooping Brenda into her hand and lying out on her bed. \"why don't you explore me? My 'valleies' are all around my body. Do what you like!\". <br>\r\n<br>\r\nBrenda giggled and stepped over the soft flesh, moving...</span></div></div>",
            "created":1208926800,
            "id":523382,
            "title":"\"playtime\""
        },
        "1113":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "3 feet!",
                "1 foot!",
                "3 inches!"
            ],
            "content":"<div class=\"\"><div> <span>     Brenda stuck her head through Tyni's door, which was partially open.  Brenda could hear Tyni messing with something, and a quick search revealed that Tyni was busy with some object at her desk and chair.  Brenda smiled and called softly to Tyni, \"Whatcha workin' on, Tyni?\"<br>\r\n     Tyni turned around quickly, slightly startled, to look at Brenda.  Her look of surprise faded to a pleasant smile as she saw Brenda filling her doorway, \"oh, hey Brenda!  I just ordered this neat device from some company on the internet, \" she held up a futuristic-looking gun.<br>\r\n      Brenda stepped through the doorway and closed the door behind her, walking closer to Tyni to get a better look at the gun that she was holding, \"some kind of gun?  What does it do...is it dangerous?\"<br>\r\n      Tyni shook her head as she fiddled with a few knobs on the side of the gun, her grin growing wider as she looked up at Brenda, \"nah, its not capable of killing anything.  Actually, this is a ray-gun designed to change the size of things!\"<br>\r\n     Brenda tilted her head to the side as she tried to comprehend the concept of size-changing, \"really?  Have you tried it out yet?\"<br>\r\n      Tyni grinned and shook her head, \"no I haven't, so its great that you're here now so I can have someone to test it out on!\"<br>\r\n    Before Brenda could protest, Tyni pointed the ray at Brenda's chest and pulled the trigger, shrinking her to...</span></div></div>",
            "created":1223010000,
            "id":590291,
            "title":"Tyni's project"
        },
        "11132":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "Brenda doesn't mind so much...",
                "Brenda is still angry!"
            ],
            "content":"<div class=\"\"><div> <span>     Brenda cried out as the beam of light from the ray hit her.  At first, nothing happened, and both Tyni and Brenda wondered if the ray was simply non-functional.  As Brenda recovered from the initial shock of being hit with the ray, she looked at Tyni to berate her for trying something so dangerous on her, but realized that she had to look up at Tyni to speak to her.  Brenda looked down at herself as she dwindled in size, her clothes staying with her as she rapidly lost height.  Brenda became dizzy as the room around her seemed to swell to enormous proportions.  Meanwhile, Tyni was taking a few steps toward her shrinking housemate, studying her with increasing interest and excitement as the former largest of the beauties dwindled to well under the height of the smallest.<br>\r\n     Brenda closed her eyes tightly as the shrinking continued, and held them closed even after the feeling of shrinking left her.  For a few moments, Brenda breathed deeply as she tried to calm down, hoping that when she opened her eyes she would wake up from some kind of dream.  However, as Brenda opened her eyes, she saw that she wasn't dreaming; all around her were the giant furnishings of Tyni's room, and standing right above her was Tyni hirself, who was bent over to get a better look at Brenda.<br>\r\n     Tyni spoke first, \"Do you feel normal, Brenda??\"<br>\r\n      Brenda was startled for a moment at how deep Tyni's voice sounded, but then lost that feeling as she got somewhat angry at Tyni for using her as a test subject, \"Sure I'm alright....except for the fact that I'm the size of a DOLL!!\"<br>\r\n     Tyni sighed and kneeled down in front of Brenda, setting the ray-gun down beside her as she tried to bring herself down to Brenda's level, \"I'm sorry Brenda...I was just soooo excited about testing this thing out, and I really didn't think that you would mind so much.  You're always so mellow, you know?  Besides, sometimes you talk about how you would like to live life at a different size for a while, just to see what it was like, right?  Just think of this as a fulfillment of that wish!  I'll take good care of you, I swear!  And after a few days, if I don't change you back myself, the ray's effects are supposed to wear off, and you'll be back to your normal, big self.\"   Tyni smiled at Brenda, hoping that she had not deeply offended the now tiny bronto-girl.</span></div></div>",
            "created":1237698000,
            "id":665047,
            "title":"One foot tall with Tyni"
        },
        "111322":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "1 foot!",
                "3 inches!"
            ],
            "content":"<div class=\"\"><div> <span>      As Tyni moved a hand down toward Brenda to comfort her, Brenda turned away from the hand, crossing her arms in a gesture of defiance.  Tyni tried to stroke Brenda's back with a finger, only to have her hand whipped by Brenda's diminished tail.  Tyni sighed and backed away from Brenda, \"you really shouldn't be so mad Brenda, I wasn't going to keep you like this anyway!\"<br>\r\n      Brenda turned around to look up at Tyni, frowning, \"Then why don't you change me back now?\"<br>\r\n      Tyni nodded and picked up the size ray, fiddling with a knob on the side to set the gun to return Brenda to her normal size, \"Please don't be angry with me Brenda, I just wanted to try this thing out so badly!\"<br>\r\n      Tyni shot Brenda with the ray-gun, nearly instantly causing Brenda to swell upwards at a rapid pace.  Tyni watched with a bit of awe as Brenda's body swelled to her former titanic size.  Brenda's frown had faded a bit, but Tyni could tell that Brenda would probably still be unfavorable toward her for a while if she didn't do something to make it up to her.  After a few moments of deep though, Tyni's eyes lit up as she found her solution to her problem with Brenda.  Tyni giggled as she twisted the knob on the size ray back into a shrinking position, and before Brenda could interrupt her, Tyni held out the sizeray to the big bronto-girl, grinning up at her, \"here!  I still want to see someone under the effects of this ray, and if it makes you feel any better, you can be the one to use it on me, and make me as small as you want!\"<br>\r\n       Brenda looked at the ray in her hand with growing curiosity, and then looked back at Tyni, her frown quickly fading into a gentle smile, \"you'd do that for me?\"<br>\r\n       Tyni giggled happily at Brenda's emotional turn-around, \"you bet!\"  She clapped her hands together lightly in anticipation as she watched Brenda's grip on the  raygun become more steady and resolute.<br>\r\n       Brenda lowered the raygun in Tyni's direction, a playful grin on her face as she pulled the trigger, \"let's see if we can make you live up to your name, 'tiny'!\"<br>\r\n       As Tyni quickly lost height, it became apparent that she was shrinking toward a height of...</span></div></div>",
            "created":1237838760,
            "id":665394,
            "title":"The ray changes hands..."
        },
        "1113222":{
            "choices":[
                "\"That sounds great!\"",
                "\"I think it should be just you and me for now.\""
            ],
            "content":"<div class=\"\"><div> <span>Tyni gasped as the shrinking effect took hold of her, everything around her growing by the second. The carpet became as thick as grass, and the furniture seemed like buildings. And in the middle of it all, like a massive, blue skyscaper, was Brenda. Tyni felt a wave of dizziness as she stared up at her housemate, who was leaning over her with the biggest grin Tyni had ever seen on her. As the dizziness diminished, Tyni took a few steps back as she took in Brenda's seemingly colossal body. \"Woah!\" she finally managed, an amazed expression adorning her features. \"This is incredible, Brenda! You're huge!\"<br>\r\n<br>\r\nBrenda giggled and took a big step forward, shaking the shrunken beauty a little before crouching down to look closely at Tyni's shrunken form. \"Wow, Tyni!\" she said, craning her long neck down to meet Tyni at somewhat eye-level. \"You shunk more than I did!\" She grinned and added, \"It's a lot cooler this way!\"<br>\r\n<br>\r\nTyni smiled, happy that Brenda was finally enjoying her device. \"It's pretty awesome down here, too!\" she replied, walking up to Brenda's huge face, marveling at the bronto's size. \"Everything's so huge! I feel like I'm in a world of giants or something!\" Brenda's huge chuckle filled her ears.<br>\r\n<br>\r\n\"Well then,\" she giggled, gesturing to herself. \"consider me the resident giant!\" The pair shared a laugh, but then Tyni stopped, an idea coming to mind. \"Wait a second!\" Brenda looked down, confused. \"What?\"<br>\r\n<br>\r\n\"I got an idea!\" Tyni said excitedly, looking up at Brenda. \"What if we used the ray on the other girls? You could stay big, but we'd shrink everyone else! It'd be fun!\" Brenda thought about it for a moment. Tyni's idea was very appealing, and she was sure the others wouldn't mind too much, but still...<br>\r\n<br>\r\nBrenda looked back down at Tyni and said, ...</span></div></div>",
            "created":1239742440,
            "id":675876,
            "title":"Reversed shrinkage"
        },
        "11133":{
            "choices":[
                "I think I'll stay shrunk for a while.",
                "I want to be changed back."
            ],
            "content":"<div class=\"\"><div> <span>The green flash of light filled Brenda's vision as the shrink ray zapped her at point-blank. The bronto girl gasped as she lost her balence and fell to the floor, her eys clamped shut as the world was seemingly spinning around her. Brenda shook her head as the spinning subsided, trying to shake the dizziness from herself. When she did open her eyes, she was greeted with a strange and terrifying new world.<br>\r\n<br>\r\nTyni's room was gigantic. Skyscraper-sized furnishings towered over the tiny Beauty, and the carpet she was standing on felt more like tall grass. Brenda, shocked at her sudden transformation, looked at her own body and was slightly relieved to find that her clothes had shrunk with her. Her thoughts were suddenly interruped when a huge impact nearly knocked her off her feet.<br>\r\n<br>\r\nBrenda looked in the direction of the impact, terror filling her as she beheld an absolutely huge Tyni. The herm stood over her with an excited look on her face, her head seemingly hundreds of feet above. Brenda flinched instinctively as a deafening voice boomed down to her. \"Wow! It worked!\" the voice thundered jovially.<br>\r\n<br>\r\nBrenda nearly screamed as Tyni began to raise her monstrous foot, the appendage slamming down only a few yards from her tiny form, the huge footfall shaking her entire body. Brenda looked up in a mixture of awe and fear as Tyni bent over her, leaning down to get a closer look, hir massive breasts bouncing and swaying with hir movements. \"Thanks for being my little test subject, Brenda!\" Tyni boomed, grinning down at the blue Beauty. \"How do you feel?\"<br>\r\n<br>\r\nBrenda, though still a little frightened at the giant Tyni, still felt a little frustrated that Tyni had tried this on her without asking. \"I feel fine, Tyni, but you could've given me some warning!\" the bronto girl called up. \"I mean, what if I don't want to be shrunk?\"<br>\r\n<br>\r\nTyni's grin dissolved into a frown, and hir voice lost its excited tone. \"Sorry,\" shi said apologetically, glancing down at the floor. \"I guess I didn't think you'd mind that much. I was only going to have some fun with you.\" Shi let out a sigh, and Brenda was nearly blown over by the force of the exhale. \"Do you want me to change you back?\" Tyni asked, looking down at Brenda.<br>\r\n<br>\r\nBrenda felt a bit guilty for being angry at Tyni. After all, she only wanted to have a little fun. Still, Brenda wasn't sure she liked being tiny, and sort of wanted to be back to her big self as soon as possible. Brenda looked up at Tyni's huge face and replied, \"...\"</span></div></div>",
            "created":1249317180,
            "id":737994,
            "title":"3 inches!"
        },
        "112":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "a little (1 foot)",
                "pretty big (50ft)",
                "Very big (100ft)"
            ],
            "content":"<div class=\"\"><div> <span>It was a hot sunny day in the city, Brenda was lying on her bed slowly reading through one of her yoga book, wearing a tank top and some small (for her size) shorts. the room she was in was the biggest in her apartment seeing as she was a very large but not fat anthro, suddenly she slammed the book shut and throw it across the room. she thought to herself \"I’m tried of reading the same books over and over again. she got up and went over to her bookcase. <br>\r\n<br>\r\nthe bookcase had three shelves filled with different and interesting books, the first shelve was filled with her yoga and tai chi books, the second shelve was full of books about the  environment and how to be more green, the third shelve was full of erotic books (some borrowed from Thorne). Brenda decided to look through some of these books. she carefully choose a book and pulled it out of the shelve when she noticed the corner of a very old looking book.<br>\r\n<br>\r\nshe quickly (but still carefully) took a few of the books on that shelve off until see could take out the book. it was very dusty, and had a brown cover with a dark blue orb in the centre \"I don't remember seeing this book before and I’m pretty sure I didn't borrow this from Thorne\" she thought to herself. there was no title on the book and as Brenda flicked through the pages she saw that it was in a strange language, the only thing in english was the titles. she stopped on a page that said growth spell and decided to read it.<br>\r\n<br>\r\nBrenda read the chapter out loud \"elsa estrata tatom havan sava ear grets natos nosvartos amtos kanda\", after reading the words the orb on the cover of the book began to glow, brenda didn't notice at first because she still had the book open, but as the orb got brighter she saw the blue light, wondering what it was she closed the book and looked directly into the orb. suddenly she was engulfed into a bright blue light.<br>\r\n<br>\r\nwhen the light vanished brenda was lying on the floor, as she got up she saw the book lying next to her. \"i wonder what the bright light was abo.....\" Brenda was cut off at mid thought by a strange tingling sensation going through her body, slowly she started to grow bigger and bigger, her clothes started to strain against her body..<br>\r\n<br>\r\nHow big will she grow?</span></div></div>",
            "created":1208322000,
            "id":520566,
            "title":"A mystic book"
        },
        "1121":{
            "choices":[
                "using it again!",
                "showing one of the other girls.",
                "finding another growth spell!"
            ],
            "content":"<div class=\"\"><div> <span>Brenda suddenly began to expand. her body streched outward, and her clothes got tighter, particularly her shorts, which actually ripped. It stopped abruptly, and Brenda stood up. \"What happened?\" she muttered, confused at the sudden phenomenon.<br>\r\n<br>\r\nThen, she noticed it. Her highest bookself, which was twelve feet in the air, used to be a little higher than her head. Now she was level with it! \"Oh my God, I just grew!\" she said aloud, amazed the spell actually worked. Her giant breasts bounced with her gasp, jiggling, and her large fleshy tail (which was now even bigger) swung beind her in excitment. Brenda overcame her amazement and wondered what to do with her new power, instantly deciding on...</span></div></div>",
            "created":1208322000,
            "id":520691,
            "title":"a little (1 foot)"
        },
        "11211":{
            "choices":[
                "Kittie walks in",
                "Tyni walks in"
            ],
            "content":"<div class=\"\"><div> <span>Brenda giggled as she chanted the spell two more times, increasing her height to fifteen feet. Her shorts had already ripped off, and her tank top was bulging from containing her gigantic boobs. \"Yes!\" Brenda giggled as she gazed upon herself. <br>\r\n<br>\r\nSuddenly...</span></div></div>",
            "created":1208581200,
            "id":521608,
            "title":"15-foot Brenda"
        },
        "112111":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Shocked",
                "Confus or other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is kitties shocked by the sight of her huge friend or confused about it?</span></div></span></div>",
            "created":1563575100,
            "id":2689435,
            "title":"Kittie walks in"
        },
        "11212":{
            "choices":[
                "Thorne",
                "Tyra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"It's more fun if someone else can enjoy these, too.\" Brenda scooped up the book and walked down the hallway, eager to find another Beauty to show the book to.<br>\r\n<br>\r\nShe ran into...</span></div></span></div>",
            "created":1208581200,
            "id":521721,
            "title":"showing one of the other girls."
        },
        "11213":{
            "choices":[
                "the 10 foot",
                "the 20 foot"
            ],
            "content":"<div class=\"\"><div> <span>Brenda flipped through the book, eager to find a spell that could make her bigger, faster. She came up with only two more: a 10 foot growth spell or a 20 foot growth spell. \"Not much variety.\" she muttered, fingering her tit idly. \"Which one should I do?\" she wondered aloud.<br>\r\n<br>\r\nBrenda decided on...</span></div></div>",
            "created":1208581200,
            "id":521720,
            "title":"Finding another growth spell!"
        },
        "112131":{
            "choices":[
                "make her own way out. 'bye-bye, roof!'",
                "Call for help"
            ],
            "content":"<div class=\"\"><div> <span>Brenda was forced to lie down as her increasing size made her the biggest thing in the room at twenty-three feet tall and over three tons. It also deprived her of being able to exit by the door. \"Aw, man!\" she moaned. \"I'm too big!\". She shifted, her weight making the floorbords creak in protest.<br>\r\n<br>\r\nShe decided to...</span></div></div>",
            "created":1212814800,
            "id":541306,
            "title":"The biggest Beauty of all"
        },
        "112132":{
            "choices":[
                "but her butt is stuck in the window!",
                "and grew to a colossal height of 50 feet!"
            ],
            "content":"<div class=\"\"><div> <span>Brenda said the words aloud, and instantly began to expand. She crouched as she became bigger than the bed she was standing by, and still even larger. \"I have to get out of here!\" she cried as she felt the walls get closer. <br>\r\n<br>\r\nShe dashed for the window and sprang out,...</span></div></div>",
            "created":1212883740,
            "id":666793,
            "title":"No Growth inside!"
        },
        "1121322":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Rampage time",
                "Save the city"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(Sorry if im bad at this im new to this)   Does Brenda go on a rampage or doea she help around town?</span></div></span></div>",
            "created":1530795240,
            "id":2515282,
            "title":"Attack of the 50ft dino"
        },
        "1122":{
            "choices":[
                "The rest of the girls get home.",
                "Brenda tried out her new size.",
                "Brenda found the book and loked through it, searcing for a shrinking spell."
            ],
            "content":"<div class=\"\"><div> <span>Brenda felt herself expanding, and was paralyzed in horror as she grew, her clothes begining to tear off. \"I have to get out of the house!\" she thought. She dove for the window, and squeezed her big-boobed torso through, but when she tried to climb out, she saw her rear was stuck in the wall, and she was still growing. She pushed as hard as she could, and finally her butt blew through the wall, and she fell the last few feet to the ground. <br>\r\n<br>\r\nBrenda could only lay there as she grew bigger and bigger. She finally stopped, and she slowly sat up. Her huge form towered over the house, and she was forced to spread her legs to avoid crushing it. \"Oh no.\" Brenda moaned as she looked at herself. People down the road were already staring and screaming at the sight of her.<br>\r\n<br>\r\nThen... </span></div></div>",
            "created":1208581200,
            "id":521668,
            "title":"pretty big (50ft)"
        },
        "11221":{
            "choices":[
                "it was best to tell them.",
                "she shouldn't mention it."
            ],
            "content":"<div class=\"\"><div> <span>Val and the other girls were driving home in her car. People were running down the side walk, away from their block, screaming.<br>\r\n<br>\r\n\"Wonder what happened?\" Cherri thought aloud.<br>\r\n<br>\r\n\"Dunno,\" said Val, her brow raised in confusion. \"it's like there's a monster around here.\"<br>\r\n<br>\r\nThen they turned the corner, and saw a gigantic being perched over their house.<br>\r\n<br>\r\n\"Oh my God!\" Tyra gasped. \"It really is a monster!\"<br>\r\n<br>\r\nVal screamed and began to floor it, when Kitti shouted, \"Wait! Stop!\"<br>\r\n<br>\r\n\"WHAT?\" Val sreamed back in exasperation.<br>\r\n<br>\r\n\"It's Brenda!\"<br>\r\n<br>\r\nThey all looked back, and sure enough, Brenda's enormous body loomed over the neighborhood, her face contorted in confusion. Val slowly pulled the car into the driveway, and the JBs got out in shocked silence.<br>\r\n<br>\r\n\"Hey.\" was all Brenda could say. Her eyes were still wet, and it was apparent she had been sobbing.<br>\r\n<br>\r\n\"Brenda...\" Thorne started.<br>\r\n<br>\r\n\"What happened?\" Tyra finished, gazing in awe at the giantess.<br>\r\n<br>\r\nBrenda wondered if she should tell tem about the book, and decided that...</span></div></div>",
            "created":1208754000,
            "id":522685,
            "title":"The rest of the girls get home."
        },
        "11222":{
            "choices":[
                "mischeif.",
                "maliciousness."
            ],
            "content":"<div class=\"\"><div> <span>Brenda took a step, and the ground shook. \"Woah!\" she exclaimed as she took a few more steps, moving down the street and being carful not to crush the tiny people below. She reached down and absent-mindedly picked up a car. \"It's like a toy.\" she mused aloud, spinning it's wheels and hefting it.<br>\r\n<br>\r\nSlowly, a grin began to work its way across her face, one of...</span></div></div>",
            "created":1212814800,
            "id":541310,
            "title":"Brenda tried out her new size."
        },
        "112221":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Yeah",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she make wveryone her slaves?</span></div></span></div>",
            "created":1524996240,
            "id":2485664,
            "title":"mischeif."
        },
        "1123":{
            "choices":[
                "but she wasn't fast enough!",
                "and she squeezed out into the front lawn.",
                "but then her spurt stops!(for now)"
            ],
            "content":"<div class=\"\"><div> <span>Brenda's body lurched, and she instantly expanded. Her body rushed out, taking up the room quickly. Her clothes tore off, exposing her beautiful body as she grew. She rushed to the window, realizing she had to get out of the house lest she destroy it in her growth,...</span></div></div>",
            "created":1212814800,
            "id":541311,
            "title":"Very big (100ft)"
        },
        "12":{
            "choices":[
                "Shrink",
                "Grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All right, does Tyra shrink or grow?</span></div></span></div>",
            "created":1207976400,
            "id":518925,
            "title":"Tyra"
        },
        "121":{
            "choices":[
                "Took a bite",
                "Devored it quickly"
            ],
            "content":"<div class=\"\"><div> <span>Tyra stepped into the house, her belly rumbling. She hadn't eaten in hours, and she was starving. She felt like she could eat a whole cow, which, dure to her 7'6\" height and 140 kg weight, wasn't too unrealistic. She followed her nose as she entered the kitchen.<br>\r\n<br>\r\n\"Something smells good!\" she muttered as she opened the fridge. Inside sat a large leg of turkey, and Tyra was about to grab it when she saw the note next to it. It read: for Thorne. Do not eat. Tyra sighed and was about to look for something else when second thoughts came into her head.<br>\r\n<br>\r\n\"Thorne won't mind.\" she thought hungrily. \"I'll make it up to her.\" And so, she grabbed the leg of turkey and...</span></div></div>",
            "created":1208754000,
            "id":522578,
            "title":"Hungry girl"
        },
        "1211":{
            "choices":[
                "went to one of the other girls' rooms.",
                "sucked all the meat off the bone quickly.",
                "gave it to another meat-eating Beauty."
            ],
            "content":"<div class=\"\"><div> <span>Tyra suddenly felt her clothes loosen as she swallowed the bite. \"What the-\" she muttered, pulling at her T-shirt. Then, she saw it; the shirt seemed...bigger. Her shorts, which used to hug her ass tighly, now were a little baggy. She looked at the fridge. It seemed bigger, too...<br>\r\n<br>\r\n\"Oh my God!\" she cried. \"I shrunk!\" She set the leg down, and was about to tell one of the other girls when she had a thought. She did always have a size-changing fantasy, and with that turkey, she could shrink pretty small, seeing how her bite was only a small nibble.<br>\r\n<br>\r\nShe grinned and grabbed the leg. \"I know just what to do with this.\" she said, as she...</span></div></div>",
            "created":1211778000,
            "id":536285,
            "title":"Took a bite"
        },
        "12111":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "Brenda's room!",
                "Cherri's room!"
            ],
            "content":"<div class=\"\"><div> <span>    Tyra giggled as she held the leg of meat in her hand, quickly pacing down the hall toward the room of one of her housemates.  She had quickly, perhaps too quickly, developed the idea that she'd eat the entire leg of turkey after silently entering one of her friends' rooms, so she could prank them at her reduced size.  <br>\r\n     Tyra carefully considered the beauty that she wanted to prank, before finally settling on becoming small in...</span></div></div>",
            "created":1221368400,
            "id":582367,
            "title":"Shrinking to prank..."
        },
        "121111":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "She ended up around 2 feet tall....",
                "Tyra made a 'tiny' error in calculation!"
            ],
            "content":"<div class=\"\"><div> <span>    Tyra carefully opened the door to Brenda's room, peeking in to see if Brenda was there before stepping deeper inside, closing the door behind her.  As she crept through Brenda's room, Tyra heard the sounds of water rushing, alerting her to Brenda's presence in the bathroom adjacent to the bronto girl's room.  <br>\r\n      Tyra looked at the leg of meat for a moment, \"I'll have to be quick, before Brenda gets out of the shower!\"  <br>\r\n      Tyra tore into the leg of meat, stripping it quickly of all of the meat and tossing the cleaned bone underneath Brenda's bed to hide it for now.  Tyra felt a strange, tingling sensation as the meat started to take effect; she rapidly shrank, her clothes becoming baggier, until the point that they all fell off, leaving Tyra naked as she continued to shrink.<br>\r\n      Tyra had estimated that the entire leg of meat would take her to about 2 feet tall, but at the rate she was going, she wondered if she had miscalculated....</span></div></div>",
            "created":1221454800,
            "id":583007,
            "title":"Shrinking in Brenda's room"
        },
        "1211112":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "6 inches!",
                "1 inch!"
            ],
            "content":"<div class=\"\"><div> <span>    As Tyra continued to shrink at a startling rate, she realized that she'd already shrunk below her two-foot goal.  Tyra stepped out of the pile of clothes she'd left on the floor as the continued to raise higher and higher around her.  Tyra could not believe how much bigger everything looked from her shrunken perspective, and she began to get worried that she would become too tiny for Brenda to notice underfoot.  <br>\r\n     Tyra finally felt herself slow in shrinking, sighing in relief as she found herself standing in the middle of the Brenda's room at the miniscule height of...</span></div></div>",
            "created":1221541200,
            "id":583080,
            "title":"Tiny miscalculation"
        },
        "12111121":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "Brenda heard Tyra!",
                "Brenda didn't notice Tyra, but she did notice Tyra's clothes."
            ],
            "content":"<div class=\"\"><div> <span>     Tyra spun around a few times, her jaw dropping in awe as she took in the stunning sight of towering bedroom furniture all around her.  Tyra needed something to compare herself to, and headed straight for the enormous dresser against the wall close by Brenda's bed.  Upon reaching the dresser, Tyra saw that she barely reached the handle of the bottom drawer, and guessed she had to be about 6 inches tall at this point.  Chills ran down Tyra's spine as she began to realize that she may have been a bit too hasty in her decision to devour the entire leg of turkey, especially now that she was a quarter of her intended size.  <br>\r\n     A low, loud woosh of air alerted Tyra to movement behind her, and she quickly spun around, looking up and up at the towering body of Brenda, who was wrapped in a towel that barely held her breasts in place and barely made it the length of her body down to her thighs.  Tyra watched in fascination as Brenda walked toward her, the immense blue body distracting her, until she realized that Brenda was walking to get clothes from her dresser.<br>\r\n     Tyra yelled loudly up to the towering beauty, running as fast as she could to avoid the stomping feet as the closed in on Brenda's destination.  Brenda hummed to herself as she rummaged through the dresser, her hands releasing the towel that barely wrapped around her, which caused it to come loose and fall to the floor, catching Tyra underneath.  Tyra's muffled shouting was not audible to Brenda as she pulled on a pair of panties and stuffed her massive breasts into a bra.  Tyra struggled under the fabric, yelling frantically as she crawled toward the light.  <br>\r\n      When Tyra made it out, she stood up quickly and waved her arms, trying to get Brenda's attention as the blue beauty admired herself for a moment in the mirror above her dresser....</span></div></div>",
            "created":1221627600,
            "id":583456,
            "title":"Getting Brenda's attention"
        },
        "121111211":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "\"We should play a game!\"",
                "\"You should explore your new size!\""
            ],
            "content":"<div class=\"\"><div> <span>      Brenda turned around, the squeaking of Tyra's voice finally drawing her attention.  Brenda appeared confused as she looked around her room for the source of the high-pitched voice.<br>\r\n      Tyra ran closer to Brenda, still yelling up to her, \"Down here Brenda!!\"<br>\r\n      Brenda heard the yell, and as her head swung downward, she got her first glimpse of the source of the cry.  Her eyes widened at the sight of the shrunken beauty, and for a moment she didn't recognize her.  Brenda leaned down to inspect Tyra, and suddenly realized what she was looking at.  \"Oh my god...Tyra!  What the hell happened to you!\"<br>\r\n      Tyra grinned up at Brenda, happy that she'd finally gained her recognition, \"Oh, well i got a bite of this leg of turkey from the fridge, and I found out it shrinks you when you eat it.  So I thought it would be funny to shrink more and scare you here in your room...but I shrank too much.\"<br>\r\n      Brenda giggled and knelt down so she could gently touch Tyra with a finger, poking her as if to make sure she was real, \"Yeah, you sure did shrink too much, didn't you?\"<br>\r\n      Tyra giggled as Brenda poked her, and nodded up at the towering blue bronto girl, \"The turkey leg was one of Thorne's concoctions....she probably has a way to reverse it, but I don't think she's here at the moment.\"<br>\r\n      Brenda nodded and reached out to pick Tyra up off of the ground, giving Tyra a rush of light-headedness as Brenda straightened up.  Tyra felt safe in Brenda's care, she was always such a nice person, and she didn't mind being picked up by Brenda, in fact, it was a lot of fun!<br>\r\n      Brenda look at Tyra thoughtfully, then spoke, \"since Thorne won't be back for a while..\"</span></div></div>",
            "created":1221714000,
            "id":584112,
            "title":"Brenda finds Tyra"
        },
        "1211112112":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "Climb over them!",
                "Go between them!"
            ],
            "content":"<div class=\"\"><div> <span>    Brenda eyed Tyra's naked body for a moment, and giggled as she laid back onto her enormous custom bed.  Brenda stretched out as she laid on her back, holding Tyra over her face and studying her tiny housemate with interest.  Brenda set Tyra down on her upper chest, just shy of being between her mammoth breasts.  Tyra looked around at the blue flesh on all sides, taking a longer moment to study the 'mountains' that loomed above, held in place inside of Brenda's strained bra.  Brenda giggled and gave Tyra a gentle push with her finger, \"why don't you go explore my body, Tyra?  who knows what kind of interesting things you may find...\"<br>\r\n    Tyra giggled and playfully pushed back at Brenda's finger, before nodding excitedly at Brenda's suggestion.  After all, Tyra had never been six inches tall before, and she figured it would be fun to explore her friend Brenda at her new size.  Tyra faced Brenda's breasts, her first obstacle, and bravely stepped forward.  She experimentally reached out to stroke the blue flesh before her, causing Brenda to giggle softly from behind her.  Tyra grinned and pressed harder, trying her hardest to make a significant indentation in the firm, bouncing flesh.  Brenda giggled louder and shook her body so her breasts lurched forward, knocking Tyra back onto her tiny bottom.  Both dinos burst into a fit of giggles, Tyra quickly getting to her feet and deciding who she would get beyond those mountains of flesh...</span></div></div>",
            "created":1222146000,
            "id":586155,
            "title":"Exploration: Brenda"
        },
        "12111121122":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "Wanted to tickle the titanic bronto!",
                "Wanted to get to Brenda's panties..."
            ],
            "content":"<div class=\"\"><div> <span>    Tyra decided she'd rather go between Brenda's breasts; she figured that Brenda's enormous bust would be too much work for her to scale, and she was also quite interested in being between those massive breasts that were so much larger than her.  Tyra got onto her hands and knees to crawl forward, wondering if she'd be able to squeeze between Brenda's boobs, as they were mashed together quite well by her bra.  Brenda's deep giggle filled Tyra's ears as she crawled forward.  Brenda poked Tyra's cute little bottom as she started to squeeze between her breasts, causing the little rex girl to burst into a fit of giggles and fall forward, laying flat on her stomach.<br>\r\n     Brenda's voice boomed from behind Tyra, \"come on now Tyra, you've got a long way to go!\"<br>\r\n    Tyra grinned and crawled forward on her belly, finding the first few feet(to her) of flesh not too much of a tight squeeze.  As Tyra continued to crawl forward, however, she found herself becoming trapped between the walls of soft flesh, and at one point, she realized that she wasn't able to go forward nor backwards.  Tyra squirmed between Brenda's breasts for a few moments, until light suddenly appeared above her.  Tyra grinned as the breasts separated, standing up between them as she realized Brenda had removed her bra so Tyra could have an easier time.  Tyra turned back to face Brenda, waving at her in thanks.  <br>\r\n    As Tyra made it out from between Brenda's colossal breasts, she decided she...</span></div></div>",
            "created":1222405200,
            "id":587386,
            "title":"Stuck in the valley"
        },
        "121111211221":{
            "choices":[
                "first you have to finish your exploring!",
                "I could have you give me a bath."
            ],
            "content":"<div class=\"\"><div> <span>Tyra meandered out onto Brenda's belly, giggling to herself as she sank into the flesh with every step. Brenda could both see and feel the tiny Rex-girl walk across her, her tiny feet tickling her skin. Brenda involuntarily let loose a laugh, and Tyra lost her footing and fell into Brenda's quaking belly. \"Hey, that tickles!\" Brenda cried, leaning down over her huge boobs. Tyra laughed at the seemingly gigantic Bronto, then took on mischevious look as an idea took hold.<br>\r\n<br>\r\n\"Hmmm....\" she hummed to herself, glancing back up at Brenda with a grin. \"That tickles, huh?\" Brenda's eyes widened as she caught on to the mini-Rex's plan, unable to stop a smile of her own. \"Oh, don't you dare!\" Brenda warned playfully. Tyra laughed and then reached down and began to tickle the huge belly beneath her.<br>\r\n<br>\r\nBrenda instantly convulsed in a fit of giggles, squealing and squirming. \"I'm gonna get you, Tyra!\" she managed between quick breaths. The little purple Rex just laughed and struggled to keep from bouncing around too much on the blue flesh beneath her. Brenda bucked and lurched, nearly out of breath from laughing so hard. Tyra finally stopped and laid back into Brenda's belly, grinning at her handiwork.<br>\r\n<br>\r\nBrenda finally caught her breath and scooped Tyra into her hand. \"Good one, Tyra!\" she said with a smile, gently pushing her tiny friend with a finger. Tyra just grinned and leaned back in Brenda's palm. \"You always were so ticklish, Brenda!\" she replied, gazing up at the enormous blue beauty's face. \"I just couldn't resist!\" <br>\r\n<br>\r\nBrenda chuckled deeply, leaning back against her huge bed. \"Well, I did say I was gonna get you for that.\" she mused with a devious grin at Tyra. \"I figure that won't be too hard, seeing how I'm the giant!\" They both giggled, Brenda's laugh shaking Tyra around in her massive palm. \"The question is,\" Brenda continued, rumbling as she leaned directly over Tyra. \"what to do with you?\"<br>\r\n<br>\r\nBrenda thought a moment, then said, \"Well, ...\"</span></div></div>",
            "created":1234242000,
            "id":645352,
            "title":"Brenda gets tickled!"
        },
        "121111211222":{
            "author_id":"dvd-machine",
            "author_name":"rated r",
            "choices":[
                "crawl between the wet folds?",
                "go in the back door?"
            ],
            "content":"<div class=\"\"><div> <span>she ran over to brenda pink panties and looked at how big they were.<br>\r\nbrenda,s voice boomed hows the view tyra?.....how about a little game?<br>\r\ntyra turned to face brenda.....ok sounds like fun^_^brenda undid her panties and threw them aside<br>\r\n</span></div></div>",
            "created":1230008400,
            "id":623929,
            "title":"Wanted to get to Brenda's panties..."
        },
        "12111122":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "Climb up on Brenda's foot",
                "Climb up Brenda's tail"
            ],
            "content":"<div class=\"\"><div> <span>    Tyra began to panic when she realized how small she was.  Standing next to one of Brenda's enormous flip-flops, her head just came to the top of the sole, which told her that she must be about an inch tall.  The high pile of the carpet was evident, as it seemed like strange bushes that surrounded her and hindered her movement greatly.  Tyra didn't much time to consider her situation, when suddenly the door to Brenda's bathroom burst open with a deep, rolling 'boom', the wind from the door swinging open being felt greatly by the tiny T-rex girl.  Tyra was transfixed as she watched Brenda lumber through her room, each footstep shaking the ground beneath Tyra's feet, threatening to knock her off balance.  Brenda was wrapped in a towel, and was heading toward her dresser to find a bra to put on.  Tyra could not help but stare as Brenda's enormous form dressed itself, the enormous sheets of delicate fabric appeared quite thick to the tiny T-rex girl, and she imagined she'd get lost quite easily even in something as simple as a sock or washcloth.  <br>\r\n     Brenda's tail swept like a boom lift over Tyra's head, prompting her to duck to the ground.  Tyra tried to yell out to Brenda, but it became apparent that the titanic bronto girl could not even register the tiny voice of her shrunken housemate.  Tyra realized that she had to figure out a way to get Brenda's attention, but how would she do it?  Tyra dove out of the way as Brenda's foot stomped down near her.  She wondered if she should hop onto Brenda's foot, but she also considered trying to climb up Brenda's tail as it became apparent that Brenda was settling down to read a book, her tail laying on the ground to provide a decent ramp up onto the oversized beanbag chair Brenda was lounging in.<br>\r\n    Tyra decided to...</span></div></div>",
            "created":1222146300,
            "id":667149,
            "title":"She'd never hear you..."
        },
        "121111221":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "pussy",
                "butt"
            ],
            "content":"<div class=\"\"><div> <span>Tyra decided that the best way to get Brenda's attention was to climb on her foot and make brenda feel her enough to look down.<br>\r\n<br>\r\ntyra took the oppotunity of being right next to her foot to climb on, as she did this trya was suddenly hit by a humungous amount of wind. it was because brenda was still walking forward towards a cabinet of drawers the otherside of her room. tyra struggled to climb on as wave after wave of rushing air hit her head on. tyra began to feel her hands slipping against brenda's smooth scaled foot, if tyra fell now she would be crushed under brenda's foot. just when it seemed tyra was about to fall, brenda finally stopped moving, allowing the near microscopic tyra to get on top of brenda's foot.<br>\r\n<br>\r\nas the humungous brenda stood infront of the drawers cabinet, tyra took it as a chance to rest after such a dangerous moment. unfortunatly for tyra, it felt her unprepared for brenda's sudden movement. the reason Brenda had been standing infront of the cabinet was so see could get a pair of panties and now that she had found a pair she was starting to put them on. first raising the foot tyra happened to be on.<br>\r\n<br>\r\nbefore she could react, tyra was already falling. fortunatly for her (sort of), tyra fell right into the raising panties, preventing her from falling to her untimely death. tyra looked up in horror as she saw she was heading straight for brenda's........</span></div></div>",
            "created":1238174160,
            "id":667148,
            "title":"unexpected lift"
        },
        "1212":{
            "choices":[
                "3 inches",
                "6 inches",
                "1 inch"
            ],
            "content":"<div class=\"\"><div> <span>Tyra mowed down the leg of turkey quickly, stripping the meat off the bone. She finished with a belch, and rubbed her sated belly. \"Mmmmm, delicious.\" she murmured. Suddenly, the world around her began to enlarge, and it didn't take long for Tyra to realize what was happening: she was shrinking!<br>\r\n<br>\r\n\"Help!\" she cried as her jeans and top slid of her, followed by her underwear. She got smaller and smaller, finally stopping at a grand height of...</span></div></div>",
            "created":1208754000,
            "id":522580,
            "title":"Shrinking!"
        },
        "12121":{
            "choices":[
                "Brenda",
                "Thorne"
            ],
            "content":"<div class=\"\"><div> <span>Tyra stared up at the titanic fridge, still open from her meal. \"This is not good! I'm tiny!\" she muttered. \"I guess I shouldn't have eaten that turkey.\" She glanced around the room and saw everything was the saw as the fridge. Everything was gigantic!<br>\r\n<br>\r\nTyra was about to decide what she should do when rythmic quakes shook the ground. \"What is that?\" a booming voice wondered. Tyra looked up just in time to see a titanic figure looking down on her, and reconized the person as...</span></div></div>",
            "created":1208754000,
            "id":522586,
            "title":"3 inch Tyra"
        },
        "121211":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "in her underwear",
                "imbetween her breasts"
            ],
            "content":"<div class=\"\"><div> <span>\"TYRA?!?....how did you get so small\" asked Brenda, \"i think Thorne put something into that turkey leg so until she puts the antidote in it, anyone who eats any of it gets shrunk, and i ate all of it\" tyra replied sadly.<br>\r\n<br>\r\n\"Well we'll just have to ask Thorne for the antidote when she gets back\"<br>\r\n\"ARE YOU JOKING??\" shouted tyra, \"If Thorne finds out I stole some of her turkey she’ll punish me at this size……I may never recover from it\", Brenda carefully thought about the situation \"in that case, mabye we should try to get the antidote from thorne without her knowing\" suggested brenda.<br>\r\n<br>\r\n\"i think it might be best if i look after you until then\" Brenda placed her hand next to tyra so she could get on it, as tyra got on she couldn't help but look down her enormase roommate's cleavage. Brenda was watching tyra at the time \" maybe you'd like to explore the valley between them\" joked brenda, tyra looked at brenda and started to blush for staring at her friend.<br>\r\n<br>\r\nbrenda stood back up. where shall i keep you? </span></div></div>",
            "created":1208840400,
            "id":522840,
            "title":"The Colossal Brenda"
        },
        "1212111":{
            "choices":[
                "Thorne's room",
                "Brenda's room"
            ],
            "content":"<div class=\"\"><div> <span>Brenda giggled as she unzipped her jeans and dropped Tyra into her giant panties. \"Have fun in there!\" she said mischeviously. The panties snapped shut, and Tyra was enveloped by the warm heat of Brenda's sex behind her. She slid against the smooth moist surface, making Brenda shiver and moan as she put her jeans back on.<br>\r\n<br>\r\nA giant hand patted Tyra's tiny body as Brenda started to walk, her step bouncing Tyra around inside the panties. The great bounces continued until Tyra heard the zipper being unzipped. Light flooded in from outside the panties, and a big blue hand curled around her and lifted her out of the warm, moist prison. <br>\r\n<br>\r\nTyra found herself in...</span></div></div>",
            "created":1208926800,
            "id":523284,
            "title":"Put in Brenda's panties"
        },
        "12121112":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "Askes tyra to do the same to her",
                "gets discovered by one of the other girls"
            ],
            "content":"<div class=\"\"><div> <span>\"Er...Brenda, i thought we were going to look for the antidote in Thorne's room?\", Brenda looked down at the tiny tyranosuarus girl with a mischiveous smile on her lips. \"i thought that mabye we could have some fun before changing you back to normal\".<br>\r\n<br>\r\ntyra thought about this, 'if i do this, her fun might get out of hand, but then again, do i really have a choice at this size and who know, i might enjoy this too'.<br>\r\n\"what kind of fun did you have in mind brenda?\"<br>\r\n\"this\" before tyra could react, brenda stuck her tounge imbetween tyra's legs and started playing with her sex. tyra's body responded to brenda's licks and caused tyra to moan and shiver in pleasure.<br>\r\n<br>\r\nBrenda then.....</span></div></div>",
            "created":1209358800,
            "id":525082,
            "title":"Brenda's room"
        },
        "121211121":{
            "choices":[
                "put her up to her giant boobs.",
                "put Tyra inside her huge vagina."
            ],
            "content":"<div class=\"\"><div> <span>\"Wanna lick this?\" Brenda asked, sliding Tyra down her giant soft belly onto her huge slit. Tyra responded by giggling and dragging her tongue all over her friend's huge vagina, tantalizing her.<br>\r\n<br>\r\n\"Ohhhh...Ohhh...\" Brenda moaned, touching herself and quakeing. Tyra giggled at the shaking caused by her giant girlfriend and licked even more, making her jiggle with the big blue beauty's fleshy body.<br>\r\n<br>\r\nSuddenly, Brenda reached down her hand. Her fingers wrapped around Tyra's tiny body and...</span></div></div>",
            "created":1209531600,
            "id":526170,
            "title":"\"Wanna lick this?\""
        },
        "1212111211":{
            "choices":[
                "hungry! (uh-oh!)",
                "gonna sploosh!"
            ],
            "content":"<div class=\"\"><div> <span>Tyra was lifter up to her gigantic breasts. \"Have fun in there.\" she boomed, sliding Tyra into her massive clevage. Tyra giggled as she was squeezed between the house-sized boobs, the fleshy globes enveloping her. She rubbed them and hugged the flesh beneath her, marveling at its smoothness. <br>\r\n<br>\r\nTyra managed to lift herself out of her scaly prison, and maneuver her way down to Brenda's pink nipple. The tit was half her size, and she couldn't help but lick it affectionatly, giggling as Brenda moaned and touched herself. The tit hardened as the foreplay went on, Brenda's quakes rocking Tyra around on the massive mamories. <br>\r\n<br>\r\nThen, Brenda's voice thundered from her huge head. \"Oh Tyra, I think I'm...\"</span></div></div>",
            "created":1209531600,
            "id":526180,
            "title":"Mammoth mamories"
        },
        "121211122":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "show tyra to cherri",
                "lie to cherri and keep tyra to herself"
            ],
            "content":"<div class=\"\"><div> <span>hears her door being opened, brenda quickly hids tyra behind her back and turns around to see cherri at the door. \"hey brenda, i thought i heared tyra in here? or were you just playing by yourself\" cherri askes with a cheeky smile.<br>\r\n<br>\r\ndoes brenda.....</span></div></div>",
            "created":1209445200,
            "id":525561,
            "title":"gets discovered by one of the other girls"
        },
        "1212111221":{
            "choices":[
                "\"Hey, you guys want to play 'dolls'?\"",
                "\"And there's even more of those turkey legs in the fridge!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Cherri, I have something to show you.\" Brenda chose her words carfully. She wanted her shrunken friend to be a surprise. Cherri's brows went up.<br>\r\n<br>\r\n\"What is it, sis?\" Cherri asked, stepping forward and gazing up at Brenda. Cherri noticed the Brontosaur was naked, and momentarily her eyes rested on the gigantic bosom of the blue Beauty.<br>\r\n<br>\r\nBrenda giggled. \"Ta-da!\" she exclaimed proudly, opening her hand up. Tyra lay in her palm, giggling up at the seemingly enormous anthro girl before her. Cherri gasped in surprise. \"Tyra?\" she questioned, reaching out her finger and gently poking the tiny Tyrannosaur.<br>\r\n<br>\r\nTyra hugged the finger and giggled. \"Yep, it's me! I guess I shrunk after eating Thorne's turkey leg.\"<br>\r\n<br>\r\nCherri giggled at Tyra, amused. \"That probably wasn't the smartest thing to do.\" she admonished, patting Tyra on the back.<br>\r\n<br>\r\n\"Isn't she cute, though?\" Brenda jumped in, craning her head down to nuzzle the tiny girl fondly.<br>\r\n<br>\r\n\"Yeah!\" Cherri agreed. \"She's like a little doll, only real.\"<br>\r\n<br>\r\nBrenda giggled again and then asked...</span></div></div>",
            "created":1212901200,
            "id":541770,
            "title":"show tyra to cherri"
        },
        "1212112":{
            "choices":[
                "that she'd keep Tyra tiny, for now.",
                "Tyra should be able to choose for herself"
            ],
            "content":"<div class=\"\"><div> <span>Brenda grinned at Tyra and promptly stuffed the tiny T-rex between her massive mamories. Tyra giggled as the boobs bounced with Brenda's step and rubbed the flesh surrounding her, Brenda smiled down and moaned in pleasure, but then redirected her attention as they entered Thorne's room.<br>\r\n<br>\r\nThe room was dark, and filled with random Gothic things and piercings. Luckily, Thorne had been oddly lax in putting away the bottle marked \"Antidote\", and had left it sitting on her dresser. Brenda leaned down, snatched it, and dashed back to her room, Tyra still clutched in her breasts.<br>\r\n<br>\r\nBrenda jumped into her room and shut the door. \"Whew!\" she sighed, collapsing on the bed. She plucked a rather shaken Tyra from her clevage and placed her in her broad palm. \"Got it!\" she said, holding up the bottle of green liquid in the other hand.<br>\r\n<br>\r\nTyra grinned up at Brenda. \"Great! Can I use it now?\" At that Brenda paused. She liked Tyra this way, and, at least for a while, wanted her to stay small. In the end, she decided...</span></div></div>",
            "created":1208840400,
            "id":522977,
            "title":"Grabbing the antidote"
        },
        "12122":{
            "choices":[
                "Brenda",
                "Tyni"
            ],
            "content":"<div class=\"\"><div> <span>Tyra gazed up at the seemingly gigantic counter. \"What have I done?\" she whispered. \"I'm gonna get stepped on! Or worse!\" She began to run, glancing all around her at the giant appliances and furniture, trying to escape the maddening sense of helplessness. She rounded the corner into the hall. <br>\r\n<br>\r\nShe wasn't looking where she was going however, and ran into a gigantic ankle of someone in the hall. The flesh on the foot broke her fall, and the Beauty above gasped in shock. It was...</span></div></div>",
            "created":1212814800,
            "id":541303,
            "title":"6 inches"
        },
        "121221":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "\"We should go play in my room...\"",
                "\"I should show you to the other girls!\""
            ],
            "content":"<div class=\"\"><div> <span>      Brenda looked down in confusion at her foot, and for a moment only saw a tiny purple creature at her feet.  She bent down, looking at the shrunken Tyra with curiosity, not yet knowing that it was her housemate.<br>\r\n     Tyra backed up away from Brenda's massive foot as Brenda bent over, the lucious blue body filling her vision and casting a shadow over her shrunken body.  Tyra quickly called out to Brenda, \"Brenda!! It's me, Tyra!!\"<br>\r\n      Brenda, who could not discern the high, squeaking voice of her shrunken housemate, knelt down and picked up the tiny Tyra, \"well aren't you just the cutest little thing...\"<br>\r\n     Tyra panicked slightly and squirmed in Brenda's grip, which only made Brenda's grip firm up, while causing Brenda to giggle at the futile struggles of the shrunken dino girl.  Tyra felt light-headed as Brenda stood back up to her full height, raising her catch up to eye-level.  Tyra cried out to Brenda once more, \"It's Tyra, I'm TYRA!!\"<br>\r\n     At the very moment Tyra cried out, Brenda recognized the tiny being in her hand, as well as finally being able to understand her high-pitched voice.  Brenda gasped and pulled Tyra closer to her face, her enormous eye almost close enough for Tyra to touch, if her arms weren't pinned to her sides.<br>\r\n      Brenda spoke softly, her voice full of worry, \"Oh my god, Tyra!  What happened to you, how did you get so...tiny?\"<br>\r\n      Tyra sighed in relief when Brenda recognized her, then replied to Brenda calmly, \"I ate a turkey leg that Thorne prepared, and it SHRANK me!  What am I going to do??\"<br>\r\n       Brenda herself began to calm down, her enormous curiosity at Tyra's situation take over, \"I dunno Tyra, I guess we should wait for Thorne to get home so we can ask her for the antidote; I'm sure she'll understand your mistake.\"<br>\r\n     Tyra gulped and nodded, not wanting to think about what Thorne might do to her, but she was glad that Brenda had found her first.  <br>\r\n      Brenda suddenly giggled, causing Tyra to look up at her with a confused look, \"what's so funny??\"<br>\r\n      Brenda grinned and started walking down the hall, carefully cradling Tyra against her massive breasts, \"Oh, I was just thinking...\"</span></div></div>",
            "created":1221368400,
            "id":582365,
            "title":"In the hands of Brenda"
        },
        "121222":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "\"Let's go to my room...\"",
                "\"I should show you to everyone else!\""
            ],
            "content":"<div class=\"\"><div> <span>    Tyra immediately recognized Tyni's signature leg-warmers as her gaze drew upward toward the towering dino's face high above her.  Tyni stared at Tyra for a moment in confusion, before she finally recognized what she was staring at, and she gasped again, bringing a hand to her mouth, \"woah...is that you Tyra??\"<br>\r\n    Tyra nodded and waved to the enormous beauty, happy that she was recognized, \"yeah!  I ate some turkey leg that made me shrink.  Thorne made it, so she probably has the way to cure it...\"<br>\r\n     Tyni bent down, the denim in her tight cutoffs creaking loudly to Tyra's ears as she got a closer look at the shrunken Tyra.  Tyni reached a hand to pick up Tyra, who squeaked in protest and squirmed against Tyni's fingers.  Tyni frowned as she held Tyra up to her face, \"oh calm down Tyra, I'll take good care of you!\"<br>\r\n     Tyra calmed down for a moment, but then looked up at Tyni questioningly, \"take care of me?\"<br>\r\n     Tyni nodded with a grin, \"you're not gonna survive by yourself at that size!  you could get stepped on by someone!  C'mon, you trust me, and besides, we can have a ton of fun with you at your new size!\"<br>\r\n     The shrunken rex thought for a moment, then agreed, grinning up at Tyni, \"yeah, it should be plenty of fun to see the world at this size!\"<br>\r\n     Tyni cradled Tyra against her stomach, just below her breasts, as she walked down the hall, speaking excitedly...</span></div></div>",
            "created":1223010000,
            "id":590289,
            "title":"Tyni finds Tyra!"
        },
        "12123":{
            "choices":[
                "Thorne!",
                "one of the other girls"
            ],
            "content":"<div class=\"\"><div> <span>Tyra gazed up at the gigantic world around her, where chairs seemed over ten stories tall and crumbs were the size of basketballs. \"Oh no.\" she groaned, leaning against a treetrunk-thick chair leg. <br>\n<br>\nTyra cried out and held onto the chair as footsteps caused earthquakes all around her. \"Uh-oh!\" she thought through the shaking. \"I hope that's not Thorne!\" <br>\n<br>\nA huge head peered over the counter, looking at the bone on the table. It was...</span></div></div>",
            "created":1208754000,
            "id":522699,
            "title":"1 inch tall in the dinosaur kitchen"
        },
        "122":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "a foot taller",
                "50ft taller",
                "100ft taller"
            ],
            "content":"<div class=\"\"><div> <span>It had been a very hot day, tyra, wearing a bikini top and shorts, had just walked into the house, she was sweating from head to toe. \"man, it's so hot today, i need something to cool down\" she thought to herself, so she went into the kitchen and looked through the freezer for an ice cream.<br>\n<br>\nunfortunately, there weren't any there, \"nuts, thorne must of forgot to get some\" she thought, \"i'll see if there's any cool drinks instead\", tyra looked in the fridge for some lemonade or orange juice but there was nothing, except for a strange white drink with a slight mist coming off the top.<br>\n<br>\n\"hmm, must be some extra cold milk\", she picked up the glass it was in and gulped it all down.<br>\n<br>\nsuddenly she felt a little dizzy, she sat down on a nearby chair, her clothes felt a little tighter and the chair started to creak under her weight.<br>\n<br>\nhow much does tyra grow?</span></div></div>",
            "created":1208667600,
            "id":522023,
            "title":"a hot tyrannosaurus girl"
        },
        "1221":{
            "choices":[
                "more bottles of the stuff!",
                "Nothing left",
                "Another strange drink behind the first bottle"
            ],
            "content":"<div class=\"\"><div> <span>Tyra jumped out of the chair as she expanded, her top already tearing. When it stopped, she sighed in relief, than gasped when she realized what had happened! She grown almost a foot! Where once the fridge was as tall as her breasts, it was now closer to her belly.<br>\r\n<br>\r\nTyra giggled in delight, hugging herself in joy, her happy hops shaking the room. \"Cool!\" she exclaimed as she measured herself against numerous objects, amazed at her height. Then a thought came into her head. \"I need more of this!\" Tyra looked in the fridge, and saw that there was...</span></div></div>",
            "created":1208754000,
            "id":522576,
            "title":"Taller Tyra"
        },
        "12213":{
            "choices":[
                "began to grow!",
                "didn't grow (yet)."
            ],
            "content":"<div class=\"\"><div> <span>Tyra saw a vial of more liquid behind the first, this one red. She took it, shrugged and said, \"This must be it.\", and tossed it down without another thought. Her belly suddenly gurgled uncontrolably, and Tyra shook a little as the contents of the drink churned her belly.<br>\r\n<br>\r\nThe gurgling suddenly subsided, and Tyra...</span></div></div>",
            "created":1212814800,
            "id":541299,
            "title":"Another strange drink behind the first bottle"
        },
        "1222":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "hasn't stopped growing just yet",
                "starts showing off",
                "trys to ask for help"
            ],
            "content":"<div class=\"\"><div> <span>Tyra shook herself out of her dizzy spell and was quick to realise that she was growing, \"woah, i've got to get out of the house before i'm too big\" she quickly ran through the living room (which was connected to the kitchen) and out of the front door.<br>\r\n<br>\r\nwhen she got out of the house, her grow had spead up a bit, her clothes started to get painfully tight until they finally ripped apart, tyra continued growing bigger and bigger and bigger, finally stopping when she was about 50ft tall.<br>\r\n<br>\r\nalot of people had ran off from seeing thedino gal grow but some had stayed where they were and was enjoying the show.<br>\r\n<br>\r\ntyra....</span></div></div>",
            "created":1208667600,
            "id":521933,
            "title":"50ft taller"
        },
        "12221":{
            "choices":[
                "shock.",
                "mischeif. (Rampage!)"
            ],
            "content":"<div class=\"\"><div> <span>Tyra expanded higher and higher, her legs spread to avoid crushing the JB house, also giving the bystanders a great view of her tailhole and pussy. \"Woah!\" she exclaimed dizzily, wobbling at her growth. Her feet sank into the ground from her enormous weight, and she towered high above the neighborhood.<br>\r\n<br>\r\nShe stopped finally at about two hundred feet, large enough to make a two story house seem no more than ten inches high, less than doll-sized. Tyra shook her head, her legs still spread wide. She gazed down in wonder at the tiny surroudings below, and her face widened in...</span></div></div>",
            "created":1212814800,
            "id":541292,
            "title":"200 foot Tyra Recks"
        },
        "12222":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "up her ass",
                "in her pussy"
            ],
            "content":"<div class=\"\"><div> <span>as tyra looks down at all the people watching her she decides to put on a little show. she slowly puts her hands on her newly exposed boobs and started to rub them together, to give her watchers a better view she carefully kneels down onto the ground until her very large chest is hovering just above her audience. (If you haven't guessed by now, most of the audience are male)<br>\r\n<br>\r\nshe then put her hands the her sides careful not to hurt anyone, \"wanna touch them?\" she asks her audience, almost instantly everyone is touching her bosoms, especially her nipples. tyra was enjoying the sensational feeling so much that she started to finger herself, unfortunately this caused a few of the guys in the audience to run behind her. <br>\r\n<br>\r\nsuddenly, tyra got up, turned around and grabbed the guy who moved, then she held them close to her face. \"WHO GAVE YOU PERMISSION TO STOP?\" she shouted, the men quickly started begging for their lives, the guy below her started to run away, unfortunately for them she noticed this and slammed her foot in-front of them almost killing the first guy. \"AND WHO GAVE YOU PERMISSION TO LEAVE?\" she continued to shout. \"obviously you guys need to be put somewhere you'll stay\" she said in a much calmer voice.<br>\r\n<br>\r\nbut where to put you?</span></div></div>",
            "created":1208667600,
            "id":522096,
            "title":"a big show"
        },
        "122221":{
            "choices":[
                "letting you guys 'do what you like' while I lay down.",
                "having sex with a few lucky guys!"
            ],
            "content":"<div class=\"\"><div> <span>The man was petrified as Tyra reached for him, and only managed to scream as he entered her massive tailhole. Tyra moaned as she pushed him up it as far as she could. \"There.\" she said when she finished. \"Now I got ya!\"<br>\r\n<br>\r\nThe other men on the ground were too afraid of her to run. Tyra looked back at them, concern in her face. \"Sorry, guys. I was just having such a good time, you guys touching my boobs and all. I'll make up for it by...\"</span></div></div>",
            "created":1212814800,
            "id":541392,
            "title":"up her ass"
        },
        "1223":{
            "choices":[
                "let the people watching crawl around her body",
                "use another building as a dancing pole",
                "starts growing again"
            ],
            "content":"<div class=\"\"><div> <span>Tyra suddenly realises that she's growing when her clothes start to rip apart, suddenly she shot up in height and broke through the roof,\"what is happening\" she said. she had grown through the house and was completely naked <br>\r\n<br>\r\nAs Tyra examined her new found height couldn't help but notice that she getting all horny and wet, looking around she found a sturdy building, broke the top half off (luckly it was an abandoned building due for demolision) laid back and stared to play with her pussy and nipples. <br>\r\nsoon she noticed that people were watching so she decided to give them a good show.<br>\r\n<br>\r\nWhat does she do?</span></div></div>",
            "created":1224133200,
            "id":596235,
            "title":"100ft taller"
        },
        "13":{
            "choices":[
                "Shrink",
                "Grow"
            ],
            "content":"<div class=\"\"><div> <span>Throne was an excellent cook, although she wasn't exactly an \"Auguste Gusteau*\" she did like to experiment with flavours and spices, she was walking in a marketplace when she suddenly spied a mysterious shop. It was a spice shop except there where no windows, while this confused throne she went inside anyway. It was dark and gloomy inside the shop, there were spiders across the ceiling and a strong smell of a hundred spices at once, and it was enough to dull throne's sense of smell.<br>\r\nA short black coated woman was behind the counter, she looked a Thorne with one blue eye and one red eye, \"you look like the kind of woman who enjoys having power over others\" she said to Thorne \"I've got just the spice for you and you can have it for free\". As the woman turned to get the spice Thorne thought about what was going on, just then the woman turns back round and throws the spice to Thorne since she hadn't moved from where she stood. Thorne carefully looked at the spice, she then looked up at the old woman \"okay, I give, what's the catch?\", \"there is none\" the woman replied, \"nice try, but there's always a catch\", \"if you must know\" the woman began \"this is a magical spice that will change your life when you eat it\"<br>\r\n\"Yeah right\" and with that Thorne left the shop taking the spice with her, the old woman said to herself \"she'll find out soon enough\".<br>\r\nAfter doing some more shopping, Thorne when over to the local park and sat on one of the benches. She rummaged around her many shopping bags until she found the spice the old woman gave her. It was a tiny bottle of green powder, there was no label and it smelled like cinnamon, Thorne had decide to try a bit of the spice to see if it had a good taste. She took a pinch of the stuff, stuck out her tongue and put the spice on it.<br>\r\nAlthough the spice didn't taste of anything Thorne felt different from usual. <br>\r\n<br>\r\nDoes the \"mother\" of the Beauties, the pierced red raptor woman get tiny or huge?<br>\r\n<br>\r\n*the famous chief from Ratatouille</span></div></div>",
            "created":1207976400,
            "id":532052,
            "title":"Throne"
        },
        "131":{
            "choices":[
                "she shrunk a foot!",
                "she shrunk to 1/10 of her height!",
                "nothing had happened (yet)."
            ],
            "content":"<div class=\"\"><div> <span>Thorne suddenly felt the world warp, and suddenly the bench she was on seemed bigger. Her clothes felt looser, and she felt like she was floating. \"What?\" was all she could make out before she passed out.<br>\r\n<br>\r\nWhen the raptoress awoke, she was on the same bench. She looked at her surroundings and realized...</span></div></div>",
            "created":1212987600,
            "id":542084,
            "title":"Shrink"
        },
        "132":{
            "choices":[
                "1 foot!",
                "10 feet!",
                "50 feet!"
            ],
            "content":"<div class=\"\"><div> <span>Thorne clutched her head as dizziness clouded her mind. The red raptoress moaned a little as her clothles got tighter. She could feel herself strech. \"I'm growing? What was that stuff?\" she thought.<br>\r\n<br>\r\nHer clothes got tighter and tighter, and she wondered how much growth power was in that pinch. It turned out one pinch made you grow...</span></div></div>",
            "created":1212987600,
            "id":542080,
            "title":"Grow"
        },
        "1323":{
            "author_id":"superxash",
            "author_name":"Shemp",
            "choices":[
                "Find the old crone and hopefully return to normal",
                "Cut loose!! ",
                "Try to find that powder she tasted... maybe there's a warning??"
            ],
            "content":"<div class=\"\"><div> <span>Thorne's clothes didn't last long, shredding to bits after she passed seven feet, (because you NEVER take into consideration the possibility that you might suddenly enlarge to gigantic proportions when deciding on your daily wardrobe), and the crimson raptoress didn't show any signs of stopping. Mothers shielded their childrens' eyes from the sight of Thorne's voluptuous breasts swaying freely in the fresh air, and a few joggers got quite the look at her nether-regions. The normally calm and cool mistress blushed heavily and covered up her body as best she could. This felt strangely... odd... to her, since she's normally not all bothered about being naked, but the idea of being caught completely by surprise, not to mention suddenly billboard-sized, chipped away at her usually cold exterior. The cold air against her naked body didn't exactly help matters much, as she fought a slight growing arousal.<br>\r\n<br>\r\n\"Thank god it was just a pinch... would've hate to have seen how much bigger I would've become if I had sampled more of that damn powder.\" she grumbled, her embarrassment slowly turning to annoyance as she had not only lost one of her favorite outfits (that lovely little dark red asian outfit she so adored), but had also dropped her groceries too and most likely flattened them in the process of becoming some wannabe b-movie monster. She never really did like those movies, only tolerated them for Cherri's sake, but now... at this height... couldn't help but see why such a concept would be seen as appealing. Needless to say, her initial embarrassment over this situation soon subsided, and her usual demeanor quickly returned.<br>\r\n<br>\r\nThe crimson raptoress grumbled more to herself as she tried to think of what to do... should she try to find that crazy old lady? While she was slowly (but steadily) finding this a bit appealing, she had made plans to cook that night, not to mention have some... \"fun\"... with her girls. And the house had needed cleaning. But... this invigorating feeling was becoming intense, as it played up to her domineeringly kinky attitude. She was used to have control over others, but not on THIS scale before. As she tried to remember what the old lady looked like, a sly grin crept across her face as she looked down at the bewildered (and so deliciously HELPLESS) bystanders at her lovely feet.<br>\r\n<br>\r\nNO!! she had to remain in control... but... maybe it wouldn't hurt to cut loose once in a while....<br>\r\n<br>\r\n\"Oh what to do.... ?\" she asked out loud... and after a bit of pondering... came to a decision.</span></div></div>",
            "created":1314523560,
            "id":1176555,
            "title":"Attack of the 50ft Beauty!!!"
        },
        "14":{
            "choices":[
                "Shrink",
                "Grow",
                "nothig happens (yet)"
            ],
            "content":"<div class=\"\"><div> <span>Cherri, the \"Girl next door\", was having a very hard week working. her boss had been making her stay late to work extra hours at the cafe, and there was a new modeling girl at the art college. a orange furred vixen called Anna Tsuchie* who was very competative about the job.unfortunatly the worst of her troubles was yet to come, as cherri sat down at a table far to the back of the Cafe she worked at, she noticed a drink sitting infornt of her. she looked around to see if anyone owned the drink but there was no one in sight. she thought about taking the drink back into the kitchen, then she realised that she was increable thirsty. \"well, i'm sure no one would mind if i drank it\" Cherri thought to herself. she quickly gulp the drink down in one. suddenly she felt a little dizzy.<br>\r\n<br>\r\n...will the orange beauty get smaller than usual or become the big girl?<br>\r\n<br>\r\n(edited by zerosonicdrive)<br>\r\n*Anna Tsuchie is TM ZeroSonicDrive</span></div></div>",
            "created":1207976400,
            "id":542437,
            "title":"Cherri"
        },
        "142":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "2 ft taller",
                "50ft",
                "100ft"
            ],
            "content":"<div class=\"\"><div> <span>Cherri put the dizzyness off to the week she had, she didn't notice that she was a inch taller. As her work shift was over she got changed in the staff changing rooms and set off for home. It was dark outside and little to no people were out, other than the usual nightwalkers. As cherri walked down the street her clothes started to feel tighter than usual and she noticed that people started to look up at her. \"That's odd\" she thought \"normally people are looking straight at me, not looking up\".<br>\r\n<br>\r\nTo get back to her house she had to walk through the center of the city. While walking there she saw one of her friends walking the other way, her friend was a human called mark*, when mark saw cherri he went up to her to say hi.<br>\r\n<br>\r\nAs mark got closer he notice that cherri was different, \"hey cherri, it's good to see you\" said mark, it wasn't until mark was standing right next to her that he noticed cherri was a foot taller then him. \"Wow, you've gotten tall haven't you\" he excamed, cherri looked down at him and also noticed the height difference. \"I centainly have\" she replied, although she wondered how it happened cherri enjoyed being taller then someone for once. cherri felt a little dizzy again, then she suddenly shot up to......<br>\r\n<br>\r\n*mark is copyright starforge</span></div></div>",
            "created":1213074000,
            "id":542460,
            "title":"a little walk"
        },
        "1422":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "hide in the woods",
                "go to the jurassic beauties house"
            ],
            "content":"<div class=\"\"><div> <span>cherri rapidly started growing up in height quickly passing 10ft tall and she was still growing. her clothes strained against her brests and crotch, giving cherri small waves of pleasure as they rode up her expanding body.<br>\r\n <br>\r\nmike watch in amazement at the ever expanding cherri, becoming aroused at the sight of cherri's clothes ripping from her body and exposing her legs and stomach. when cherri eventually got to 20ft her clothes finally ripped from her body, exposing her breasts and imbetween her legs, she was a little disappointed at this but didn't show it and instead concentrated on watching everything seem to get smaller.<br>\r\n<br>\r\nwhen cherri stopped growing she had reached the height of 50ft, nearly all the buildings where shorter then she was. fortunatly most people were asleep in their homes and didn't see cherri growing or at her current size. mark stood at her bare feet and looked up at the giant beautie with aue. cherri looks down at mark with a worried look on her face, \"My god, i'm so big, what am i going to do now mark?\"<br>\r\n<br>\r\n\"well\" mark said thoughtfully \"there are some woods near by or your house is pretty close so we may be able to get some help from there\"<br>\r\n<br>\r\nwhat are they going to do? </span></div></div>",
            "created":1213765200,
            "id":545672,
            "title":"50ft"
        },
        "14221":{
            "choices":[
                "\"How did this happen?\"",
                "\"Is there any way I can help?\""
            ],
            "content":"<div class=\"\"><div> <span>Cherri figured the woods were closer and told Mike that's where she wanted to go. Mike then asked her \"Okay, but why the woods again?\" <br>\r\n<br>\r\nCherri blinked at Mike and said as softly as she could \"Well it's late at night, I'm at least fifty feet tall, and just the effort of walking would wake up the whole town, not to mention my roommates, who wouldn't know what to do with me anyway. So hiding in the woods is best option right now.\"<br>\r\n<br>\r\nMike nodded his head and together they ran (Or in Cherri's case stomped) into the woods.<br>\r\nMeanwhile inside the woods another anthro was sitting next to her tent reading by candle light. Her name was *Hunter and she while she wasn't extremely close to any of the JB's but she was a fellow waitress at the diner where Cherri worked, it just happened to be her day off, and she was spending it like she always did....Until she felt the ground shake beneath her that is.<br>\r\n<br>\r\nShe looked up to see a 50ft tall Cherri standing over her, and Hunter then asks...<br>\r\n<br>\r\n<br>\r\n*Hunter is © to Sonicboom182</span></div></div>",
            "created":1216443600,
            "id":557721,
            "title":"In the woods is a friend...."
        },
        "15":{
            "author_id":"x_sonic_x",
            "author_name":"zerosonicdrive",
            "choices":[
                "Tyni",
                "Kitti",
                "Staci",
                "Val",
                "New characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>this chapter is for jurassic beauties that were not on the first page or are yet to come (that means when another character arrives).</span></div></span></div>",
            "created":1207976400,
            "id":521048,
            "title":"more"
        },
        "151":{
            "choices":[
                "grow",
                "shrink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tyni, the not so tiny herm... does she grow or shrink?</span></div></span></div>",
            "created":1207976400,
            "id":519017,
            "title":"Tyni"
        },
        "1511":{
            "choices":[
                "races for the back door...",
                "Stays in the kitchen and touches herself..."
            ],
            "content":"<div class=\"\"><div> <span>Tyni the 80's child of the group had decided to just stay home and lounge around. It wasn't very often that sie got the house to herself, the only problem was now she was bored out of hir mind!<br>\r\n<br>\r\nSie was walking around the various rooms of the house looking for something to do, when by sheer luck Tyni noticed that a bottle of what appeared to be milk sitting on the kitchen table. <br>\r\n<br>\r\nNow that Tyni thought about it sie was a bit thirsty. \"Oh well why not quench my thirst...I mean it's not like anyone is going to stop me!\"<br>\r\n<br>\r\nShe swiftly picked up the bottle and after checking the label several times and finding no expiration date, Tyni shrugged hir shoulders and downed the bottle with very little hesitation.<br>\r\n<br>\r\nImmediately afterwards however Tyni starts to feel dizzy...at first sie tried to shake off the feeling, but it only got stronger.<br>\r\n<br>\r\nAfter several seconds of having this feeling, Tyni noticed two things right away...one everything seemed to be getting smaller...and two...sie was incredibly aroused!<br>\r\n<br>\r\nSie looked down at herself and saw that indeed while everything was getting smaller sie was indeed getting bigger, but one portion of hir body stood out: hir crotch!<br>\r\n<br>\r\nAlthough sie could feel her whole body getting bigger with each passing moment, her crotch seemed to be growing far faster than the rest of hir. After only several seconds Tyni's crotch was fully erect and seemed to get bigger with each wave of pleasure that passed through hir.<br>\r\n<br>\r\nNow however Tyni had a problem...she noticed that if she continued to grow she'd go right through the roof of the house.<br>\r\n<br>\r\nShe could try to reach the back door to the house, or just stay here and enjoy the feeling.<br>\r\n<br>\r\nTyni...</span></div></div>",
            "created":1221368400,
            "id":582101,
            "title":"Tyni's BIG problem..."
        },
        "15112":{
            "author_id":"versyrl",
            "author_name":"Syrls",
            "choices":[
                "Brenda walked in!",
                "Kitti walked in!"
            ],
            "content":"<div class=\"\"><div> <span>    Tyni was too engrossed in her growing member to think of getting out of the kitchen.  She planted herself down on the ground, resting herself against the refrigerator and stretching her legs out in front of her as she continued to slowly grow.  With 14-foot ceilings, in a sitting position Tyni would have to grow past 25 feet or more before she'd start to get uncomfortable, and she was satisfied with that assumption as she turned her attention to her growing cock.  <br>\r\n     Tyni was amazed at the size of it; she'd always had a generous size, but now she couldn't get a hand around her girth, so she used both hands at once to slowly pump herself as she continued to grow aroused.  Tyni experimentally pulled the cock against her body to test its length, and found that it was becoming long enough to reach her plump breasts.  Tyni quickly formed an idea, and wedged her length between her breasts as she continued to pump it at the base with both hands.  Tyni teased her feminine parts with her tail as she slowly grew, her member responding to stimulation with increased growth.  Tyni soon found that she was able to suck herself off, and did so greedily as she reached new heights of arousal.  Tyni's balls ached as they too continued to swell, forcing her to spread her legs apart as she pumped and sucked on her enormous shaft.<br>\r\n     As Tyni was working on herself...</span></div></div>",
            "created":1222405200,
            "id":587392,
            "title":"Self-satisfaction...."
        },
        "151121":{
            "choices":[
                "\"Let me join you!\"",
                "\"I have to go and get Cherri, she'll love this!\""
            ],
            "content":"<div class=\"\"><div> <span>Brenda just so happened to be walking into the kitchen when she immediately noticed two things: One...Tyni was on the floor masturbating, but that honestly was nothing new, as all of the JB girls had seen her do it more than once, and sometimes even helped her on occasion.<br>\r\n<br>\r\nBut the second thing was: She was noticeably bigger...everything about Tyni was bigger, and the most prominent thing was her genitals as they seemed to be growing bigger and bigger the longer Tyni pleasured hirself. Her member was easily twice the size it normally was, and that personally was saying something.<br>\r\n<br>\r\nBrenda continued to look over and as she did, she didn't even notice that she had taken several steps closer to see if this was real. That was when Tyni opened hir eyes, and noticed her roommate. <br>\r\n<br>\r\n\"Oh...mmm...hey Brenda...\" Tyni was partially out of breath as she was still in the processes of touching hirself with pleasure dripping in her voice, and pre sliding over her member which grew bigger and bigger along with the rest of her. She then spoke up and said:<br>\r\n<br>\r\n\"Well...I-I guess I have...some explaining to do....right?\"<br>\r\n<br>\r\nBrenda then giggled and said, \"Yeah, you do...but first...\"</span></div></div>",
            "created":1223614800,
            "id":593252,
            "title":"Nothing new here...wait a minute!"
        },
        "1511211":{
            "choices":[
                "Growing faster....",
                "Her body stops growing, but her cock keeps going..."
            ],
            "content":"<div class=\"\"><div> <span>Brenda took another step forward and gasped as she saw Tyni get a little bit bigger in size. She looked Tyni in the eyes for a moment as if to silently ask if she could help.<br>\r\n<br>\r\nTyni seemed to get the message as she nodded her head to Brenda's silent plea. She still continued to stroke her member, and suck herself off. She was still feeling complete bliss from her growing body and it was only getting better and better!<br>\r\n<br>\r\nBrenda at that moment reached out and began to grope and tease Tyni's breast with her hands, and after several seconds she could feel the warm, soft flesh growing inbetween her fingers, and Brenda giggled again as she kneaded the flesh inbetween her fingers again and again, <br>\r\n<br>\r\nTyni gave a loud moan in pleasure as she felt her breast receiving some much needed attention. By this point her head had reached the top of the refrigerator and she was still growing. She could also feel herself getting closer and closer to climaxing. She wanted it to come...but she also wanted Brenda to have a bit more fun with her body.<br>\r\n<br>\r\nBrenda could also feel the heat and warmth coming off of Tyni's body and she scooted close enough to try and warp her arms around Tyni's body. But her massive breast made that impossible. Brenda however didn't  mind as she blushed and just pushed her face into Tyni's bulging, growing cleavage.<br>\r\n<br>\r\nAs Tyni grew closer to her climax she began to feel warmer than before, and realized quickly that she was growing faster and bigger and so was her engrossing member, which by this point was too big and threatened to choke her. She removed the large appendage and groaned as she felt Brenda pushing against her growing body driving her closer and closer to her climax.<br>\r\n\"D-don't stop....Brenda...so...good! So...turned on! I'm close to the edge...just a bit more!\" cried Tyni as she felt warmer and warmer, she realized something was happening...<br>\r\n<br>\r\nTyni was....</span></div></div>",
            "created":1234933200,
            "id":648980,
            "title":"Longer, Harder, Bigger, Better!"
        },
        "1512":{
            "choices":[
                "She Doesn't shrink at all Yet!",
                "Rapidly Shrinks.",
                "Tyni starts to slowly get tiny."
            ],
            "content":"<div class=\"\"><div> <span>Tyni feels a sudden burst of Adrenaline sweep through her body rapidly. Her mind goes in a Split surreal exctasy and her toes and head feel light. Her sexy Curvy thighs feel a tickling rush through them and Tyni's Genitals even get a rush too.<br>\r\n<br>\r\nSemi-Aroused and Confused, how fasts she She Shrink?</span></div></div>",
            "created":1259000760,
            "id":795900,
            "title":"The Shrinking Process"
        },
        "15121":{
            "choices":[
                "Thorn walks in not knowing anyone is in the House with some Private Toys!",
                "Tyra walks home after going to the Strip Club. All Horney and Wet from the Rain!"
            ],
            "content":"<div class=\"\"><div> <span>She may not have started Shrinking yet, but my god is she Horny! Tyni feels a Squelting hunger to plow someone in the ass. Her Rod gets furiously erect, with Tyni gasping for air, she can feel a vivid ripple of sweat rush down from her clit to her smooth ankles. She Chokes in her own hunger as she rams through the door and looks for the nearest pair of Legs. She hears a creak from the other door to her Right, Tyni's Penis gets fully erect and Starving as...<br>\r\n<br>\r\nWho walks through the door?!</span></div></div>",
            "created":1259001360,
            "id":795905,
            "title":"The Hunger."
        },
        "151212":{
            "choices":[
                "Oh yes, and she gives her it hard!",
                "No, she is Interrupted by someone."
            ],
            "content":"<div class=\"\"><div> <span>Tyra Walks through the door she looks sad at first because the Strip Club had been closed for the day because of the weather, meaning no one to give her gorgeous hips some Attention. She looked up at a Horny Tyni, Poised up with a MASSIVE, THROBBING COCK.<br>\r\n<br>\r\n<br>\r\n          ...and she liked it!<br>\r\n<br>\r\nShe wanted no less when Tyni grasped her luscious waist and pulled on her firm, juicy and Damp ass Cheeks whilst ramming her long Slippery tounge down Tyras wet throat. The Two briefly exchanged saliva before Tyni threw Tyra and her Hot Body onto the Sofa, were she rested her sleek legs on the carpet facing the other way, legs crossed and Toes curved feminently. She gasped and begged For The HUGE baltic Red Penis to rip her tight asshole wide open. Tyni's lust finaly come to an end as She bent over Tyra, legs by either side standing her toes, Hands on Tyra's curved back, her sexy ass in the air. Tyni Pushed furiously on her Abdonamen to insert the Head. <br>\r\n<br>\r\nTyra's ass was at first uneasy.. but it soon engulfed the entire head with her gasping Cheeks. Tyra moned as she felt the huge package pushing through her Asshole Slowly yet Brutally. Tyra could feel the Entire rod as it finally wedged itself in place between her cheeks. She loved ever bit of it, especialy the feel of Tyni's Balls as they finaly bashed of her Unbelievably hot and juicy ass. This meant the Penis had finaly reached it's maximum depth in her slippery Asshole, and they both lifted their heads high and gasped.<br>\r\n<br>\r\n\"Ohhhh... Give it to me Tyni. I want it and I want it hard.\" Tyra Begged.<br>\r\n<br>\r\nDoes Tyni \"Give her it?\"</span></div></div>",
            "created":1259002860,
            "id":795913,
            "title":"THE PENETRATION."
        },
        "1512121":{
            "choices":[
                "Tyni Cums.",
                "Tyni starts seeing the after effects of the strange Drink. She starts Shrinking."
            ],
            "content":"<div class=\"\"><div> <span>Tyni pulled her Penis out, she could feel the Tight anus closing it's whole from infront of her Massive head.<br>\r\n<br>\r\n\"Put it back, Put it back, Put it back, OH PLEA-\"<br>\r\n<br>\r\nTyra was Interrupted by a Barrage of Cock ripping it's way in and out of her Asshole visously and Vigorously. The Rapid Pulses of Penis Destroyed her Anus from the inside out. Tyra Didn't move a Muscle as she Screamed in Orgasm and Ectasy. Her Asshole were constantly pounded by Tyni's huge Balls and thus her Ass never stopped vibrating. <br>\r\n<br>\r\n\"OH! OH! O-OH! YE-YES!! YESSS!! FUCK THAT BIG, -OH YES! FUCK!! FUCK THAT ASS!\" Tyra demanded more after every throbbing push Tyni did on her Cock. Her Ass was going forward then backward so fast and violently. <br>\r\n<br>\r\nTyni could feel the awesome feeling of Ass swallowing her cock. She loved it when Tyra resisted her Penis and clenched her Anus around her Cock, because that just made her harder and her Resistence was futile to Tyni's Savage Cock. Not that Tyra didn't want her ass destroyed, she also liked the feeling. <br>\r\n<br>\r\nWHAT HAPPENS NEXT!?</span></div></div>",
            "created":1259004000,
            "id":795919,
            "title":"Oh yes, and she gives her it hard!"
        },
        "152":{
            "choices":[
                "grow",
                "shrink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kittie, the small Southern-belle sabertooth...does she grow or shrink?</span></div></span></div>",
            "created":1207976400,
            "id":519015,
            "title":"Kittie"
        },
        "153":{
            "choices":[
                "shrink",
                "grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Staci, the smoky-voiced stegosaurus girl...does she get big or small?</span></div></span></div>",
            "created":1207976400,
            "id":519013,
            "title":"Staci"
        },
        "154":{
            "choices":[
                "Shrinks",
                "grows"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Val, the rich voracious Velociraptor...shrinks or grows?</span></div></span></div>",
            "created":1207976400,
            "id":518930,
            "title":"Val"
        },
        "155":{
            "choices":[
                "yes",
                "yes, yourself",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about a human who is friends/lives with the JBs?</span></div></span></div>",
            "created":1208581200,
            "id":521783,
            "title":"Human option"
        },
        "1551":{
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or female?</span></div></span></div>",
            "created":1208581200,
            "id":521784,
            "title":"Gender"
        }
    },
    "info":{
        "author_id":"x_sonic_x",
        "author_name":"zerosonicdrive",
        "brief_description":"you can take control of any of fossils girls and make them shrink or grow.",
        "created":1208014980,
        "description":"<td align=\"left\" class=\"norm\">you can basically take any of the jurassic beauties and make them shrink or grow, you can also interact with the other beauties (go here for character descriptions: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.jurassicbeauties.com/1024x768/bios.shtml\" target=\"_blank\">http://www.jurassicbeauties.com/1024x768/bios.shtml</a>).<br>\r\n<br>\r\nthere are only three rules:<br>\r\nRule 1: no scat or guro what so ever (if you don't know what these are, then consider yourself lucky &gt;P)<br>\r\n<br>\r\nRule 2: none of them can or will die<br>\r\n<br>\r\nRule 3: please don't end the story as other people may want to keep adding!<br>\r\n<br>\r\nother than that, you can add anything you want.<br>\r\n<br>\r\nall jurassic beauties (c) fossil<br>\r\nthis is his website: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.jurassicbeauties.com\" target=\"_blank\">http://www.jurassicbeauties.com</a><br>\r\n<br>\r\n(over 1000 views everyone, that's effing awesome XD) <br>\r\n<br>\r\none last thing, you can add your own characters but you do so under the risk that they can and mostly will be controlled by other users. <br>\r\nif you do add your own characters, please remember that fossil's girls are the main focus of this interactive. thank you<br>\r\nalso, your character must get envolved with the JBs at some point.<br>\r\n<br>\r\n<b>Good News Everyone</b> i've decided to add a new part to the story, the new \"yourself\" chapters. this is where you play yourself as your visiting the JBs at there home, don't get too excited though, there are some rules that go with these chapters:<br>\r\n<br>\r\n<b>Rule 1</b> - when adding to these chapters please remember that ou are playing <b>yourself</b>, that means you cannot have a name and the story has to be mostly first and second perspective, it can be third person but only for a short amount of time. you can also change to the perspective of the beauty you are interacting with.<br>\r\n<br>\r\n<b>Rule 2</b> - you cannot grow beyond your starting height of 5'10\", you can shrink as small as you want and the JBs can still shrink and grow, but you cannot grow bigger than 5'10\".<br>\r\n<br>\r\n<b>Rule 3</b> - like the JBs you cannot die.<br>\r\n<br>\r\n<b>Rule 4</b> - try not to end the story as other people may still want to add to it.<br>\r\n<br>\r\nthe new chapter can be found by going to the following options: more&gt;Human&gt;yes, yourself<br>\r\nthat's all the rules, enjoy!</td>",
        "id":1413076,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1563575100,
        "modified":1563575100,
        "pretty_title":"macro/micro jurassic beauties"
    }
}