{
    "chapters":{
        "1":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "MMPR?",
                "Zeo?",
                "Turbo?",
                "Samurai?",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose which season......</span></div></span></div>",
            "created":1321678800,
            "id":1225685,
            "title":"Which season?"
        },
        "11":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Red Ranger",
                "Blue Ranger",
                "Green Ranger",
                "Black Ranger",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Back to the beginning huh? Alright, which Ranger are you?</span></div></span></div>",
            "created":1321678800,
            "id":1225688,
            "title":"Season 1"
        },
        "113":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "At the Command Center",
                "At Rita's Palace",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Today started out just like every other day for you. Wake up, get breakfast, and go to martial arts practice. That's right, you are an aspiring martial artist. You train day in and day <br>\r\n<br>\r\nout in order to be the best and hope to one day be able to prove that you are. You hold black belts in several different styles and no amount of skill or prowess is enough for you. <br>\r\n<br>\r\nWhy do you have this drive though? What causes you to show such fierce determination? A look back at the television at the front of the dojo (training hall) would answer that. The <br>\r\n<br>\r\nnews was on and the top story was once again about-...\"The Power Rangers have once again saved the day\" said the news anchor man. \"That's right Jeff\" replied the anchor woman. <br>\r\n<br>\r\n\"They have once again brought down an evil monster bent on destroying Angel Grove\". \"One thing is for sure Candice\" said the anchorman. \"The Power Rangers will always be <br>\r\n<br>\r\naround to save the day\". \"It sure seems that way Jeff, it looks like there's no one out there stronger than the Power Rangers-\" *CLICK* You turned off the T.V. and walked across the <br>\r\n<br>\r\nempty dojo to the heavy bags. \"No one out there stronger than the Power Rangers huh\"? You retort as you wail on the heavy bag. \"Well see about that\" you say with determination <br>\r\n<br>\r\nin your voice. \"When the time comes, I'll prove that I'm the strongest, KIYAH\"! You yell as the heavy bag busts open and begins pouring sand everywhere from the force of your <br>\r\n<br>\r\npunch. \"Someday....\" you say as you grab your tote bag and head out the door to go home.</span></div></div>",
            "created":1321678800,
            "id":1225701,
            "title":"Your story begins"
        },
        "1132":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Rita's Test",
                "*Reader's Choice*"
            ],
            "content":"<div class=\"\"><div> <span>At Rita's Palace on the moon....\"Damn those blasted Rangers\"! Rita yelled. \"Every time, every SINGLE time\"! \"Do not fret empress\" replied Goldar. \"We will destroy them for <br>\r\n<br>\r\nsure next time\"! \"Shut it Goldar\"! She retorted. \"It's obvious to me that you are incapable of handling those pesky Rangers on your own\"! \"B-but, my Queen-\" \"SILENCE\"! Rita <br>\r\n<br>\r\nyelled as she stomped away. \"Boy Goldar, you sure made Rita mad this time\" said Squatt. \"Yeah, I've never seen her this fumed\" replied Baboo. \"GGGRRR....\" Goldar growled <br>\r\n<br>\r\nas he stared <br>\r\n<br>\r\ndown the two numb skulls. \"YIKES\"! They both yelled in unison as they ran. Rita was walking through one of the passageways of the castle when she saw one of the rooms <br>\r\n<br>\r\nglowing green. 'What the hell is that' she thought as she walked to the room. Upon entry she saw a glowing green power coin like one of the Power Rangers'. \"GASP\"! She <br>\r\n<br>\r\nexclaimed. 'Has the time finally come'. She grabbed the power coin and hurriedly made her way back to the lookout post. Finster saw the glowing coin in his mistress' hand. <br>\r\n<br>\r\n\"What might that be your highness\"? He inquired. \"If my hunch is correct, then it's the answer to our Power Ranger problem\" she replied. \"I'm just curious to see what kind of <br>\r\n<br>\r\nhost the power coin has chosen to become the new Green Ranger\" Rita continued as she began to look through her telescope with great interest. The telescope began to focus <br>\r\n<br>\r\nin on Angel Grove, then on an individual. \"Yes\"! She exclaimed, \"It's coming into focus\". Then finally you came into focus on the telescope. Wearing your white gi (martial arts <br>\r\n<br>\r\nuniform) black belt around your waist, and kanji (Japanese writing) that read \"Death\" on the back of your gi top. \"Ooohhh\" she said with earnest as she continued to look through <br>\r\n<br>\r\nthe telescope. Seeing your short blonde hair, bright blue eyes, and muscularly defined body. \"My, he certain LOOKS like he meets the qualifications\" said Rita. \"Finster\"! She <br>\r\n<br>\r\nyelled. \"Yes your majesty\"? He replied. \"Send down the Putty Patrol, I think we should test our new candidate\". She said, smiling wickedly. \"Yes ma'am\" said Finster as he fired <br>\r\n<br>\r\nup the monster making machine. \"I think I'll go as well and enjoy the show\". Rita said with a sneer.<br>\r\n</span></div></div>",
            "created":1321678800,
            "id":1225739,
            "title":"Rita's Evil Plot"
        },
        "11321":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Yes!  >:)",
                "No way!"
            ],
            "content":"<div class=\"\"><div> <span> At this point you were in the middle of walking home. You turned down an alley, it was the normal <br>\r\n<br>\r\nshortcut you took to get home quicker. When you were halfway down the alleyway you were suddenly <br>\r\n<br>\r\nsurrounded by six gray looking men with ugly faces. They continued to jump around, wave their arms <br>\r\n<br>\r\nabout and yell. \"Hmph\"! Is all you say as you drop your tote bag to the ground and crack your <br>\r\n<br>\r\nknuckles. \"I've seen you guys before\" you say. \"Your the guys I've seen attacking the Power Rangers\". <br>\r\n<br>\r\n\"Unfortunately for you guys\" you continue as you begin cracking your neck on one side, then the other, <br>\r\n<br>\r\n\"I'm not as forgiving as the Power Rangers\" you say raising a fist to them. \"A fight with me\" you say as <br>\r\n<br>\r\nyou take a fighting stance, \"is a fight to the DEATH\"! You yell as you charge one of the putties. <br>\r\n<br>\r\n\"KYAH\"! The putty was caught off guard as you give him an uppercut, sending flying a few feet back. <br>\r\n<br>\r\nTwo more try to charge you from behind, but you see it coming and grab both of them by the neck and <br>\r\n<br>\r\nimmediately slam their heads into one another. They both flop on the ground as another putty comes up <br>\r\n<br>\r\nfrom behind and grabs you in a bear hug. Then another one comes at you with a flying kick. However, <br>\r\n<br>\r\nyou duck just in time and the putty ends up kicking the other putty who had you in a bear hug, breaking <br>\r\n<br>\r\nhis hold. You tuck and roll and turn to face the putty. The putty turns around in time to see your fist <br>\r\n<br>\r\nflying at him. \"AYA\"! You yell as your fist punches through the putty's chest. He collapses on the <br>\r\n<br>\r\nground and evaporates into a pile of gray goop. You turn to face the rest of the putties. \"So, who's <br>\r\n<br>\r\nnext\"? You say, blowing the gray dust from your knuckles. The five remaining putties take a step back <br>\r\n<br>\r\nand look at each other nervously. Never before have they fought someone so tenacious and merciless. <br>\r\n<br>\r\n\"Alright then\" you say. \"If you won't come to me...then I'll come you\"! You charge at the putties. <br>\r\n<br>\r\n\"KYAH\"! You kicked one of the putties heads clean off. He falls to the ground in a pile of goop just as <br>\r\n<br>\r\nthe other had. Before the rest of them had time to react you swung around giving one of them a back <br>\r\n<br>\r\nfist to the head, again knocking it clean off. He too collapses into a pile pf gray goo. \"Heh, the way the <br>\r\n<br>\r\nPower Rangers fight you guys I would've thought you were tougher than this\" you say arrogantly. The <br>\r\n<br>\r\nremaining three putties look at each other and nod. Then suddenly, they all charge at you. \"Bring it\" <br>\r\n<br>\r\nyou say as you charge them as well. You jump in the air to perform a drop kick and kick both the <br>\r\n<br>\r\nputties on the left and right at the same time. Knocking both of their heads off. They both fall and turn <br>\r\n<br>\r\nto goo as you flip back and land on your feet. The last putty looks at you obviously scared as he scoots <br>\r\n<br>\r\nback against the wall of the building behind him. \"What's the matter\"? You say condescendingly, <br>\r\n<br>\r\n\"You're the ones that challenged ME! And now that you're losing it's no fun anymore\". You continue to <br>\r\n<br>\r\nwalk slowly towards him. The putty waves his arms at you in a plea for you spare him. \"I don't think so\" <br>\r\n<br>\r\nyou say grabbing him by the neck and lifting him off his feet. You're going to have to finish what you <br>\r\n<br>\r\nstarted\" you say giving him a stern look. You raise your other fist and pull it back as you prepare to <br>\r\n<br>\r\nfinish him. \"Goodbye\" you say in a monotone voice as you thrust your punch forward and punch clean <br>\r\n<br>\r\nthrough his head. He then finally collapses into a pile of goop just as the rest did. \"That wasn't nearly as <br>\r\n<br>\r\nhard as the Rangers make it look\" you say to yourself. \"Your perfect\"! you hear a feminine voice yell as <br>\r\n<br>\r\na mighty wind suddenly erupts. You then see a peculiarly dressed woman floating down from the sky <br>\r\n<br>\r\nwith a big wand in hand. \"Who might you be\"? You ask inquisitively. \"I am Rita Repulsa, Queen of <br>\r\n<br>\r\nDarkness and future ruler of this world\" she says with a curtsy. \"Interesting\" you reply looking her up <br>\r\n<br>\r\nand down. \"Whoever you are, you're certainly easy on the eyes\" grabbing her hand and kissing it. <br>\r\n<br>\r\n\"Why thank you\" she says. \"Am I safe in assuming your the one that sent those putties after me\"? You <br>\r\n<br>\r\nask. \"Yes\" she replies. \"But don't get the wrong idea, I was merely testing you, and you passed with <br>\r\n<br>\r\nflying colors my boy\". \"Why were you testing me exactly\"? \"To see if you were worthy of this...\" Said <br>\r\n<br>\r\nRita pulling out the Green Power Coin. \"And what's that\"? You ask. \"The key to the power of the Green <br>\r\n<br>\r\nRanger\"! She replied showing it to you. Your eyes go wide realizing what it was. You look at it intently <br>\r\n<br>\r\nas if it were calling to you. \"I've seen the way you fight\" said Rita. \"I've seen your drive, your <br>\r\n<br>\r\ndetermination, and your tenacity. Your the perfect candidate to become the new Green Ranger\"! She <br>\r\n<br>\r\nexclaims. Your eyes begin to glow green as you react to the coin. You then shake your head \"Wait a <br>\r\n<br>\r\nminute. What's in it for me\"? You inquire. \"Ah, thinking of the benefits huh\"? Said Rita \"I like that. <br>\r\n<br>\r\nWell first off, you'll be a driving force in my conquering of the world and get a grand spot in my new <br>\r\n<br>\r\nworld order...and....\" she leaned in closer as to whisper in your ear. \"You'll get....to fight....the Power <br>\r\n<br>\r\nRangers\". That last part caught your attention as flashbacks of what you had said earlier today rushed <br>\r\n<br>\r\ninto your mind 'I'll prove I'm the strongest' rung in your head. \"You mean it\"? You ask. \"I'll get to test <br>\r\n<br>\r\nmy strength against the one and only Power Rangers\"? \"But of course\" she replied \"I want you to be <br>\r\n<br>\r\nable to prove that you are the strongest fighter in the world\" she said as if she could read your mind. <br>\r\n<br>\r\n\"So what do you say? Will you become MY Power Ranger\"? She asked seductively.</span></div></div>",
            "created":1321678800,
            "id":1225830,
            "title":"Rita's Test"
        },
        "113211":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "At the Command Center",
                "Follow Goldar"
            ],
            "content":"<div class=\"\"><div> <span>“Hmmmm” you think about it for a moment weighing the pros and cons of the situation. 'On the one <br>\r\n<br>\r\nhand, the power I've always wanted is finally within my grasp' you think. 'However, I'm not entirely <br>\r\n<br>\r\nsure I can trust this woman and she IS trying to take over the world and I don't know if I can support <br>\r\n<br>\r\nthat'. You continue to contemplate until you come to a decision. You look to her smiling and say “Yes! <br>\r\n<br>\r\nIf it means the chance to prove I'm the strongest, then yes, I will”. “Hahahahaha”! She laughs smiling <br>\r\n<br>\r\nwickedly. “Excellent choice” “So, how does this work? Do you say some sort of magic word or <br>\r\n<br>\r\nsomething”? You ask. “Simply take the Power Coin in your hand and let the power take you” she <br>\r\n<br>\r\nexplained handing you the coin. “Sounds simple enough” you reply taking the coin. You close your <br>\r\n<br>\r\neyes and grip the power coin firmly in your hand. Green sparks begin to shoot out from the coin and a <br>\r\n<br>\r\ngreen light envelops you. “GRRAAAHHHH”! You yell as you feel your newly endowed powers come<br>\r\n<br>\r\nrushing through every fiber of your being. Rita looks on with earnest to see your final transformation. <br>\r\n<br>\r\n“Yes, YES, accept the power and become MY new Green Ranger”! She exclaims. Finally with sound <br>\r\n<br>\r\nlike the crackling of thunder, FWOOM! The transformation was complete. You open you eyes to see <br>\r\n<br>\r\nyou are now in a green spandex suit, a golden chest plate strapped over your chest, white gloves and <br>\r\n<br>\r\nboots, and a green protective helmet on your head. You look to your hand to see that the coin is no <br>\r\n<br>\r\nlonger there. You look down to your waist to see it is now embedded in your belt buckle, you then see a <br>\r\n<br>\r\ngreen dagger in a holster on the side of your belt. “This...is....AMAZING”! You exclaim looking at <br>\r\n<br>\r\nyour hands as you clench them into fists. “I could accomplish anything with this power, HHAAAA”! <br>\r\n<br>\r\nYou roar as you raise your fists to the air and green lightning sparks from your body. “And you fill out <br>\r\n<br>\r\nthe suit rather well” said Rita looking at your butt. “Now my Green Ranger, I shall draw the Power <br>\r\n<br>\r\nRangers out of hiding. Go and prepare yourself for the challenge you've been so desperately seeking”.  <br>\r\n<br>\r\n“Yes, my Queen” you say with an evil smirk. Rita teleports back to her castle. “Goldar”! She yells. <br>\r\n<br>\r\n“Yes Empress” he replied bowing. Go down to Angel Grove and have some fun. Yes my Queen, <br>\r\n<br>\r\nHAHAHA”! He said cackling as he flew down to Earth.</span></div></div>",
            "created":1321765200,
            "id":1226069,
            "title":"The New Green Ranger!"
        },
        "1132111":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Back At Rita's Palace",
                "The Fight Begins"
            ],
            "content":"<div class=\"\"><div> <span>(At the Power Rangers Command Center.......)<br>\r\n<br>\r\nZordon flashes into his cylinder. “Alpha, come quickly. I sense a major disturbance in the balance <br>\r\n<br>\r\nbetween good and evil on Earth. “Aiyaiyaiyaiyai”! Said the overzealous robot. “What could it possibly <br>\r\n<br>\r\nbe Zordon”?! Alpha inquired frantically. “It's hard to describe Alpha, but I fear the worst. Contact the <br>\r\n<br>\r\nRangers, I must warn the-” WHOOP WHOOP WHOOP! Rang the alarm interrupting Zordon. “Zordon! <br>\r\n<br>\r\nLook at the viewing globe”! Yelled  Alpha. “Goldar's attacking Angel Grove! Aiyaiyaiyai”! “Contact <br>\r\n<br>\r\nthe Rangers immediately Alpha, the disturbance I felt will just have to wait. “You got it Zordon, they'll <br>\r\n<br>\r\ngive Goldar what for”!  He said while typing on one of the control pads. <br>\r\n<br>\r\n<br>\r\n(In Angel Grove)<br>\r\n<br>\r\nRiiiiiiiiinnnnnggg<br>\r\n<br>\r\nRang the school's fire alarm as all the student's were being evacuated due to Goldar's attack on Angel <br>\r\n<br>\r\nGrove. Jason and the other Rangers rushed behind the school as they heard their communicators go off. <br>\r\n<br>\r\n“Alpha come in, what's going on”? Asked Jason. “It's Goldar”! Replied the robot. “Hurry, you guys <br>\r\n<br>\r\ngotta stop him or there won't be an Angel Grove left to save”! “You got it Alpha”! Jason replied. “IT”S <br>\r\n<br>\r\nMORPHIN' TIME”! They all raised their Morphers to the sky. “Mastodon”! yelled Zach. <br>\r\n<br>\r\n“Pterodactyl”! Yelled Kimberly. “Triceratops”! Yelled Billy. “Saber-tooth Tiger”! Yelled Trini. <br>\r\n<br>\r\n“Tyrannosaurus” Yelled Jason. They instantly morphed into their Power Ranger forms and were <br>\r\n<br>\r\nteleported to where Goldar was causing destruction. “AYA”! They all exclaimed as they took fighting <br>\r\n<br>\r\nstances. “Well well well, if isn't my LEAST favorite group of people” Goldar sneered. “Let's do this <br>\r\n<br>\r\nGoldar, we're ready” said Zach. “As much as I would like the pleasure of crushing you myself” replied <br>\r\n<br>\r\nGoldar. “I'm afraid you won't be getting the privilege of fighting me today”. “Alright then lemme <br>\r\n<br>\r\nguess” said Kimberly. “Rita's got some lame monster waiting on the sidelines”? “Yeah c'mon, who's <br>\r\n<br>\r\nRita got lined up for us this time” Trini asked folding her arms. “That....would be me” you say smugly <br>\r\n<br>\r\nfrom behind them. They all turn in surprise, taking defensive stances. But once they get a good look at <br>\r\n<br>\r\nyou they are taken aback. “What is this, some kind of joke”? Asked Jason. “Most illogical” Billy <br>\r\n<br>\r\nadded. “Afraid not” you reply. “I'm the real deal. The one and only Green Ranger”! You exclaim. “And <br>\r\n<br>\r\nI'm ten times the Ranger any of you could ever be” you add walking down to face them. “But if your a <br>\r\n<br>\r\nRanger, then why are you attacking us”? Asked Zach. “Because my Empress Rita wishes me to” you <br>\r\n<br>\r\nsay taking a fighting stance. “And I figure if anyone can give me a decent challenge it's the Power <br>\r\n<br>\r\nRangers”. “Alright then, get ready green bean” said Jason as he and the other Rangers took fighting <br>\r\n<br>\r\nstances as well. “This is gonna be good” said Goldar with an evil grin.</span></div></div>",
            "created":1321765200,
            "id":1226243,
            "title":"The Calm Before the Storm"
        },
        "11321112":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "At the Command Center",
                "At Rita's Palace"
            ],
            "content":"<div class=\"\"><div> <span>“Heh, I can tell just by looking at you guys” you say. “You can't beat me”. “Only one way to find out” <br>\r\n<br>\r\nsays Jason. “And just to keep things interesting” you say as you pull your dagger from it's holster. You <br>\r\n<br>\r\nthen stick it into the ground. “You're not even gonna use your weapon”? Jason asks in disbelief. “Don't <br>\r\n<br>\r\nhave to” you reply arrogantly. Jason gives you an angry look. “Power Rangers charge”! He yells as he <br>\r\n<br>\r\nand the other Rangers charge at you ready for battle. You take a defensive stance, readying yourself for <br>\r\n<br>\r\ntheir attack. They all come in at you from different directions with a wide array of different punches, <br>\r\n<br>\r\nstrikes, and kicks. You however, avoid all of their attacks with ease, dodging every blow. On the moon <br>\r\n<br>\r\nat Rita's palace, she watches your battle with great interest. “This is great, with any luck my strong and <br>\r\n<br>\r\nhandsome Green Ranger will rid me of those pesky do gooders once and for all”. “Yeah, I just wish we <br>\r\n<br>\r\nhad some popcorn to enjoy the sh-.......Wait.....what did you call him”? Asked Squatt. “Um, strong” <br>\r\n<br>\r\nRita said hesitantly. “After that” said Baboo. “None of your business”! She yelled as she turned back to <br>\r\n<br>\r\nresume looking through her telescope at the battle below. “YAWN” you say nonchalantly as the <br>\r\n<br>\r\nRangers continue their assault. “Guess it's time for me to go on the offensive”. You turn to face Billy <br>\r\n<br>\r\nthe Blue Ranger since he was the closest to you at the moment. “Lights out, AYA”! You yell striking <br>\r\n<br>\r\nhim with a two-handed strike combination to the gut and the face, which sends him flying back several <br>\r\n<br>\r\nfeet in a heap. “Billy”! Exclaimed Zach the Black Ranger. “you'll pay for that one, TAKE THIS”! He <br>\r\n<br>\r\nyells running and jumping in the air to perform a flying side kick. But before he connects with it, you <br>\r\n<br>\r\ngrab him by his kicking leg with both hands. “I don't think so, but whaddya say I take ya for a spin” <br>\r\n<br>\r\nyou say as you begin spinning Zach in circles fiercely. Increasing speed and momentum you release <br>\r\n<br>\r\nhim, sending him flying through a brick wall with a CRASH! “Oh no! Zach”! Yelled Trini. “Cover me <br>\r\n<br>\r\nKim, so I can get in close” she said pulling out her sai. “You got it” said Kimberly pulling out her bow. <br>\r\n<br>\r\nTrini rushed at you as Kim began firing energy arrows at you. However, PING PING PING! They all <br>\r\n<br>\r\nreflected off your golden chest plate with ease. “Hehe, nice try Pinky. Let's see how you handle this”. <br>\r\n<br>\r\nYou say as you rush at Trini, catching her by surprise with your amazing speed. “GWAH”! She screams <br>\r\n<br>\r\nas you clothesline her and secure her in a headlock. You continue your assault running at Kimberly <br>\r\n<br>\r\nwith Trini still in your headlock. You close in and grab Kimberly by the throat. “GAH”! She yells in <br>\r\n<br>\r\nshock. You lift both her and Trini off the ground by their necks. “Don't worry ladies” you say <br>\r\n<br>\r\nsarcastically. “There's plenty of me to go around”. You then throw them both into the air, jump up and <br>\r\n<br>\r\nWHAM! You knee both of them in the face sending both of them soaring into the air even higher. You <br>\r\n<br>\r\nland perfectly and see both of them collapse on the ground unconscious. You then turn around and see <br>\r\n<br>\r\nboth Zach and Billy were unconscious as well. “Well Red, looks like it's just you and me” you say <br>\r\n<br>\r\nsmirking. “He's doing it! He's ACTUALLY doing it”! Cheered Rita as she continued to look through <br>\r\n<br>\r\nher telescope. “Yeah! Go Green Ranger! Go Green Ranger”! Cheered Squatt and Baboo waving <br>\r\n<br>\r\npompoms. “You won't get away with this”! Yelled Jason clenching his fist in anger. “You think so <br>\r\n<br>\r\nhuh”? You say calmly. “ well if you think you can beat with THAT pitiful power level you're sadly <br>\r\n<br>\r\nmistaken. But if you think you can, come prove it” you say motioning for him to attack you. <br>\r\n<br>\r\n“AARRRGH”! Yelled Jason rushing at you sword in hand in a blind rage. He swings the blade at your <br>\r\n<br>\r\nhead and CHING! You easily catch the blade between your thumb and index fingers. Jason still <br>\r\n<br>\r\nstruggling to push the blade down on you says “You will pay” with anger in his voice. “I don't think so” <br>\r\n<br>\r\nyou reply smugly and SNAP! You snap his blade in two with your fingers. He takes a few steps back in <br>\r\n<br>\r\naw of your power. “Allow me to take this opportunity to properly introduce myself” you say as you <br>\r\n<br>\r\nslowly remove your helmet. “I'm Ryan, Ryan Cordaine” you say bowing. “And as for you, well” you <br>\r\n<br>\r\ncontinue as you raise your open hand aiming at Jason's chest. “your history” you say with a smirk. <br>\r\n<br>\r\nGreen energy begins to form in your hand as lightning starts crackling around it. “KYA”! You yell as <br>\r\n<br>\r\nthe energy blast bursts from your hand and makes a direct hit sending Jason flying back twenty feet and <br>\r\n<br>\r\nskidding along the pavement. You walk across the battlefield and stand over him. He groggily looks up <br>\r\n<br>\r\nat you, chest smoking, about to pass out himself from the impact of your last attack. “W-what ARE <br>\r\n<br>\r\nyou”?  He asks fearing for his life and the lives of his friends. You look down at him and simply state as <br>\r\n<br>\r\nyou aim your hand at him “I'm the Green Ranger.....BITCH”! Energy begins to form in your hand again <br>\r\n<br>\r\nfor your final attack. “ALPHA! Quickly teleport the Rangers back to the Command Center before it's <br>\r\n<br>\r\ntoo late”! Said Zordon. “You got it Zordon”! The robot exclaimed as he pressed a few keys on the <br>\r\n<br>\r\ncomputer. Back at the battlefield you say “Goodbye, KIYA”! You yell as you fire another energy blast, <br>\r\n<br>\r\nbut just as it was about to connect, Jason and the other Rangers vanished in flashing lights of their <br>\r\n<br>\r\nrespective colors. You look around to see that they were all gone. “Hey Goldar”! You yell. “What the <br>\r\n<br>\r\nhell happened”? You say confused. “It must have been that meddling Zordon”! He yelled in anger. You <br>\r\n<br>\r\nwalk across the battlefield and pick up your helmet. “Whatever the case, let's get back to Empress Rita <br>\r\n<br>\r\nand figure this out” you say as you and Goldar are enveloped in a green light and are teleported back to <br>\r\n<br>\r\nRita's palace.</span></div></div>",
            "created":1321851600,
            "id":1226641,
            "title":"Ranger Battle Royale!"
        },
        "113211121":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "The Next Day",
                "That Night"
            ],
            "content":"<div class=\"\"><div> <span>A loud FWOOM is heard throughout the Command Center as the Power Rangers return and from the <br>\r\n<br>\r\nlooks of it, they didn't look too well. \"Alpha\" said Zordon. \"Quickly, get them to the medical bay\". <br>\r\n<br>\r\n\"You got it Zordon. Hang in there Rangers, we'll get you patched up in no time. Aiyaiyai\" replied Alpha <br>\r\n<br>\r\nas he quickly distributed them to the medical bay to begin treatment. A few hours later, after everyone <br>\r\n<br>\r\nregained consciousness, they all returned to the main room of the Command Center so that Zordon <br>\r\n<br>\r\ncould explain. \"Zordon\" Jason began. \"What the heck happened back there? That guy was a ranger <br>\r\n<br>\r\nright? So why's he working for Rita\"? He asked. Zordon went on to explain to everyone about how Rita <br>\r\n<br>\r\ncame to you with the power coin and how you accepted, not knowing you would be put under Rita's <br>\r\n<br>\r\nevil influence. \"I get all that\" said Kimberly. \"I just don't get how he was able to take on all five of us <br>\r\n<br>\r\nwithout breaking a sweat\". \"Yeah\" said Trini. \"He didn't even look like he was trying\". He told me his <br>\r\n<br>\r\nname before he blasted me\" said Jason. \"What was it\"? Asked Billy. \"He said it was....Ryan...Cordaine I <br>\r\n<br>\r\nthink”. “Oh boy” said Zach. “What, you know that name”? Asked Jason. “Yeah” replied Zach. He's a <br>\r\n<br>\r\nmartial arts teacher at the dojo across the street from the dance studio. I've seen him in action, he's one <br>\r\n<br>\r\nbad mamma jamma”. “It would seem the Green Ranger's power has amplified this already talented <br>\r\n<br>\r\nyoung man's great strength to a degree higher than that of a normal Ranger” said Zordon. “This is a <br>\r\n<br>\r\nmost unprecedented situation. What should be done to rectify this problematic error”? Asked Billy is <br>\r\n<br>\r\nhis usual techno babble. “You must learn more about this young man” said Zordon. “He knows not <br>\r\n<br>\r\nyour identities, discover something that you might be able to use to your advantage next time you <br>\r\n<br>\r\nmeet”. “Great idea Zordon” said Jason. “Let's move out Rangers” he said as they were teleported back <br>\r\n<br>\r\nto Angel Grove.</span></div></div>",
            "created":1330578000,
            "id":1286997,
            "title":"At the Command Center"
        },
        "1132111211":{
            "author_id":"jcmsrules",
            "author_name":"Gentle Giantess's Rule",
            "choices":[
                "\"Gordon called\"",
                "Something else happened"
            ],
            "content":"<div class=\"\"><div> <span>*lunch time the next day*<br>\r\n<br>\r\nRyan was just about to sit down and eat his lunch while thinking up ways on how to completely destroy the Power Rangers for his mistress Rita, when he heard someone say \"HEY!!! COME SIT WITH US!!!\"  He turned around to see 5 teens at a table with an empty chair in between Kimberly and Trini. His brain was saying \"don't trust them, something is up\", but his body was already moving to the empty chair. \"Hi\" he said before he sat down. \"Hey, my names Jason and these are my friends Trini, Kimberly, Zack, And Billy.\" They all said \"hi\" while he swore he heard those names before. \"Hi everybody, my name's Ryan Cordaine.\" Billy said \" Yeah, I've heard about you. Your that Dojo teacher from the Dojo across the mall right?\" \"Yep. I'm the greatest teacher in the county.\" He brags Kim spoke up and said \"Look this may be out of the blue but, what's your take on the Power Rangers?\" Her friend's looked scared because he may get suspicious that they ARE the Power Rangers. But luckily Ryan was too busy thinking to notice. Then he said \"I absolutely hate them.\" Everybody gasped \"But why?\" Asked Jason \"They're awesome\". \"Yeah right  they are nothing but a bunch of losers. Heck I could beat they're asses with nothing but my bare hands. \"Ain't that the truth\" Zack whispered to Billy. But before another word could be spoken....</span></div></div>",
            "created":1604113680,
            "id":2932001,
            "title":"The Next Day"
        },
        "114":{
            "author_id":"adamthejoker",
            "author_name":"Joker",
            "choices":[
                "I'm a dude.",
                "I'm a girl."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You a guy or a chick? What? Colour doesn't choose gender. =3</span></div></span></div>",
            "created":1329368400,
            "id":1277947,
            "title":"Black Ranger"
        },
        "1141":{
            "author_id":"adamthejoker",
            "author_name":"Joker",
            "choices":[
                "\"Adam, honest and strong, the Stegosaurus dino-zord will follow your commands.\" ",
                "\"John, you are clever and brave, you shall command the Mastodon dino-zord.\" ",
                "\"Bianca, kind and generous, the Pachycephalosaurus-zord will be at your side.\""
            ],
            "content":"<div class=\"\"><div> <span>Okay, so you're a normal student at Angel Grove, at the Juice bar, you're sat by yourself, trying to mingle since you just transferred here. You're making good impressions, when suddenly an earthquake hits the city!!! You of course try to help some people out before taking off yourself, you notice four others, who you remember from role-call in class; Jason, Kimberly, Trinny and Billy. Wondering what they're doing, you run over and try to help-whoa what!? you can't move either!!! Suddenly a wierd feeling comes over you as you seem to raise up through the roof...but you don't feel anything and don't damage the roof as you burst off into the distance, following red, pink, yellow and blue lights. <br>\r\nEventually you land in the middle of the dessert, no sign of the lights anymore, suddenly strange grey humanoid creatures come out of nowhere and surround you...luckily you know a bit of Karate and start taking them out, but there seems to be an infinite amount of them! *huff* *puff* You need some back-up...<br>\r\n\"Hiya!\"<br>\r\n\"Hoo-ah!\"<br>\r\n\"Aiya!\" Suddenly *insert appearance of the power rangers here* come out of nowhere and save you. <br>\r\n\"That Zordon was right, the transfer student was out here and in danger...\" The one in Red exclaimed.<br>\r\n\"I think we owe him an apology...\" The one in yellow added.<br>\r\n\"We should take him along too, he did say he's the fifth ranger.\" After a ranger short walk you end up within a strange building, looking ancient on the outside, but very-high tech on the outside. <br>\r\n\"Oh thank goodness he's alright.\" A strange robot stated as you walked by.<br>\r\n\"I'm Alpha-five, and this is-\" You look up to the huge head inside what looks like a lava lamp.<br>\r\n\"Greetings, I am Zordon, an ancient evil has been awakened, known as Rita, and you and your other friends must become the power rangers to save earth.\" Suddenly a wierd belt buckle appears at your waist. </span></div></div>",
            "created":1329368400,
            "id":1277962,
            "title":"I'm a dude."
        },
        "11411":{
            "author_id":"adamthejoker",
            "author_name":"Joker",
            "choices":[
                "Kimberly.",
                "Trinni."
            ],
            "content":"<div class=\"\"><div> <span>\"Um...what IS a power ranger?\" You ask, very confused as to what's going on.<br>\r\n\"Warriors devoted to protecting the world from great evil, putting themselves on the front lives to save countless others.\" Zordon explains.<br>\r\n\"You ready Adam? Just do as we do. It's morphing time!\" Jason shouts, but before he can continue suddenly-<br>\r\n\"Stegosaurus!\" You cut ahead of him, as if it were a natural reflex. Suddenly you feel a huge amount of energy build up inside you, a black armour-suit similar to the others' fall upon you, a helmet looking like a lizards head, with huge spines going over it like a stegosaurus...and continuing down your back! Luckily they're not as big as you'd think. <br>\r\n\"...Zordon what happened? His suit is different from ours...\" Jason asks as Zordon looks down in amazement.<br>\r\n\"He has been chosen as an S-list ranger, his suit now gives him certain powers, and because he is of the stegosaurus, he has increased endurance during battle. But now's not the time to go into great detail, you must go before Angel Grove is destroyed!\" Before anyone can reply, you are whooshed up into the air again and are racing back to Angel Grove.<br>\r\n\"Where're we going?\" Kimberly asks.<br>\r\n\"To save the world!\" Jason replies. <br>\r\nBefore long you're in the streets, huge amounts of the strange creatures again attacking innocent civilians.  <br>\r\n\"Putties!\" Trinni exclaims.<br>\r\n\"Okay guys, we need to focus on taking out these guys-\"<br>\r\n\"And saving the civilians.\" You add.<br>\r\n\"Good call, we would'nt be heroes if we didn't save anyone right?\" Billy backs you up.<br>\r\n\"Let's go guys!\" Everyone moves out, taking out groups of putties like nothing.<br>\r\n\"They're nothing compared to us!\" Jason exclaims out of confidence.<br>\r\n\"Oh my god!\" Trinni shouts as she points over to a pram, up above on a building, a strange creature that looks like a Golem is about to drop down a taxi onto the pram. <br>\r\n\"Try and save this child rangers, bwabwabwabwa!\" The Golem mocks the rangers as it drops the taxi.<br>\r\n\"Not on my watch!\" You shout as you run over and jump into the path of the taxi, you think that this will hurt like mad...but instead the taxi bounces off your back like rubber.<br>\r\n\"Oh my baby! Th-thank you! Thank you!\" The mother repeats herself, running over and taking out her baby before running off.<br>\r\n\"That was real heroic off you Adam...\" Trinni compliments you, affection in her voice.<br>\r\n\"Good job man!\" Jason adds, giving you a slap on the arm as everyone else runs over.<br>\r\n\"Bwabwabwa! No way, nobody is more sturdy than me!\" The Golem jumps down, causing an earthquake as he lands.<br>\r\n\"Whoa-whoaaaaaaa! This guy must be causing the earthquakes!\"  Kimberly states as the group almost falls over. <br>\r\n\"Bwabwabwa, now for the first and final strike spike-boy!\" The Golem charges at you as the other jump out of the way.<br>\r\n\"Watch out!\" Billy shouts at you, but all you do is hold out your palm, catching the punch.<br>\r\n\"Ngh! Nggggggghffff! Bwhat is this!?\" The Golem whines as he tries to push you back.<br>\r\n\"Evil begone!\" You throw the Golem back into the wall in front of you.<br>\r\n\"Bwaaaaaaah!\" *THWATOH!* \"Ohhhh...\" The Golem wobbles about as it gets up while the others gather round you.<br>\r\n\"All right!\"<br>\r\n\"You're on a roll!\"<br>\r\n\"Bwabwa...behhhh...I don't get...this...\"<br>\r\nMeanwhile at Rita's moonbase.<br>\r\n\"Gaaaahhhh! Why is that ranger more powerful than my Golem!?\" Rita whines while a shadowy figure in the background shakes it's head.<br>\r\n\"Mistress, why not just make it bigger? It'll crush him no matter how hard his back is.\"<br>\r\n\"Aha! Of course, Magic Wand, make my monster grow!\" As Rita throw her wand down to earth, the Golem grows to Titan size.<br>\r\n\"BWAAAAAAAAAAAAAAHAHAHAHAHA!!! Try to stop me now spike-boy.\" You look up at the towering monster but try to stay strong.<br>\r\n\"...looks like we need Dinosaur power...um...come Stegosaurus!\" Suddenly from outside the city, Stegosaurus, black body, trimmed silver with glowing purple eyes and spines, comes running into the city.<br>\r\n\"Whoa, that's a zord?\" Kimberly asks as everyone looks up at your zord.<br>\r\n\"Okay...guess I have to jump?\" You jump up at the zord as the same power that zoomed you to the desert sends you into the cockpit of your zord. <br>\r\n\"Stegosaurus zord, take him out!\" At your command, Stegosaurus charges at the Golem knocking it into the ground. <br>\r\n\"I'll lend you a hand man! Come on, we need dinosaur power now!\" Jason shouted as the Tyrannosaurus zord comes running into the city, Jason jumps into it as Tyranno zord walks up to Stegosaurus zord.<br>\r\n\"I have an idea, Jason, can you swing us into that thing?\"<br>\r\n\"Alright, hope you know what you're doing man...let's do this! Go Tyrannosaurus!\" <br>\r\n\"Adam, if you can get Stegosaurus to curl up as it flies into that rock creature it's spines will deal critical damage.\" Billy suggested as Tyrannosaurus grabbed a hold of Stegosaurus' tail.<br>\r\n\"Got it, okay ready?  Go, Prehistoric Punt!\" Tyrannosaurus swinged Stegosaurus around, letting go at full speed, Stegosaurus is launched at the Golem as it curls up into a spiky ball.<br>\r\n\"Bwaaaaaaagh! No! I only just started causing-auggggggggggh!\" Stegosaurus sends the Golem flying, sparks coming out of it. Tyrannosaurus and Stegosaurus pose as the Golem explodes in the background.<br>\r\n<br>\r\nLater de-morphed and back at the juice bar, everyone is watching the news. <br>\r\n\"And so Angel Grove was saved, according to witness reports, by warriors in colourful suits as-well as mechanical dinosaurs. Well whoever they are, they have Angel grove's thanks for saving countless lives.\" <br>\r\n\"Well guys, looks like we might have to keep this going, with Rita on the loose an' all.\" Jason stated.<br>\r\n\"As long as we do it together, Rita will always fail.\" You add while Trini looks over.<br>\r\n\"You were so heroic out there Adam...you're even the one who took out that thing.\"<br>\r\n\"With Billy and Jason's help.\" You reply.<br>\r\n\"Zordon was right, you ARE honest.\" Jason commented as the group giggled. Suddenly Bulk and Skull walk in.<br>\r\n\"Well well, if it ain't the transfer kid, ain't you cool hanging out with these geeks?\" Bulk remarks as Skull looks over his shoulder.<br>\r\n\"Yeah, ain't ya?\" Bulk gives Skull a fierce look as Skull backs off.<br>\r\n\"Look you guys, we aren't looking for trouble so just leave us alone okay?\" Kimberly asks as the daring duo walk around to you.<br>\r\n\"Hey we only want to help out the new kid right Skull?\"<br>\r\n\"Yeah, bwahahahaha.\" <br>\r\n\"Bet you know karate like all these other guys huh?\"<br>\r\n\"As a matter of fact I do.\" You retort as Bulk steps back.<br>\r\n\"Ohhhhh, then show me.\" <br>\r\n\"Okay...\" You get up, walk over and do a high kick, thinking that will settle Bulk's curiosity.<br>\r\n\"Heh, that's nothing, and here we thought you were a dark belt.\"<br>\r\n\"Black belt you idiot.\" Bulk corrects Skull as he pushes you out of the way.<br>\r\n\"But he's right, even I can do something like that.\" You walk back to your seat and watch.<br>\r\n\"Huaaaaaiiiyaaaa!\" Bulk attempts to do a high kick but his leg only goes half as high and he ends up falling backwards into Ernie holding a cake. Bulk falls onto the floor, icing and bits of cake all over him as   everyone laughs, except Ernie who's shaking his head.<br>\r\n\"You better not make a habit of this Bulk...\"<br>\r\n<br>\r\n*Cue credits for episode*<br>\r\n<br>\r\nYou wanna make a move...but who are you planning on dating?</span></div></div>",
            "created":1329368400,
            "id":1277994,
            "title":"\"Adam, honest and strong...\""
        },
        "114111":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "To go to the Juice Bar",
                "You chicken out"
            ],
            "content":"<div class=\"\"><div> <span>You immediate decide that Kimberly is the one you plan on asking out but for some odd reason you're incredibly nervous as she's always not around or at gymnastics whenever you get the courage to speak finally on a Friday following a tough quiz you get your chance as you're putting things in your locker Kimberly wearing a traditional pink shirt with her middriff showing and blue cutoff shorts along with sandals and sunglasses over her head is walking towards you with a smile at you you feel your heart sinking into your feet \"God she's so beautiful!\" you think madly \"Hey Adam had a good day so far?\" you struggling not to blush nor slur your speech reply nervously \"Yes though I think I flunked my Math test last period!\" she giggles that sweet laugh  silently driving you mad with rage and longing to be with her \"I'm sure you didn't do that bad of a job on it well I'm off wanna to come to the Juice Bar with me and the guys later on?\" again you feel butterflies in every part of you not just your stomach as you slowly reply while sweating up a storm \"Uh..yeah I will\" \"Okay til then bye Adam!\" she gives a sweet wave and grins at you as she walks away meanwhile at her hidden palace on the Earth's moon Rita through her huge spyglass notices your conversation with the talented Kimberly Hart \"So it appears our newest Ranger has quite the crush on the Pink Ranger this will be the perfect time to introduce my newest creature the Loveless Heart!\" as she prepares to plot your downfall you finishing your last class after school still incredibly nervous about asking out Kimberly decide</span></div></div>",
            "created":1363755600,
            "id":1554391,
            "title":"Kimberly."
        },
        "114112":{
            "author_id":"adamthejoker",
            "author_name":"Joker",
            "choices":[
                "\"Sinister Seed!\"",
                "\"Heart thief!\""
            ],
            "content":"<div class=\"\"><div> <span>Early morning the next day at the lockers, you find yourself alone with Trini, none of the others around, she walks over to you, holding a maths book close to her.<br>\r\n\"Hey Adam, hate having maths in the morning don't you? I just can't concentrate when I'm still asleep.\"<br>\r\n\"Doing a few push-ups and some cold juice wakes me up so, I don't really have a problem with maths except the boring lectures from Miss Carpenter.\" Trini giggled.<br>\r\n\"Yeah, Miss Carpenter does make everything more boring, makes me fall back asleep...anyway I best go get my notes back from Kim, later Adam.\" You raise your hand slightly to hold her up, but you're too shy and Trini walks off.<br>\r\n\"Hey, you can't back down yet man, you have to keep her talking, get her attention.\" Jason suggested as he placed a hand on your shoulder.<br>\r\n\"Huh, no I just...\"<br>\r\n\"Come on man, you ain't fooling anybody, you got the hots for Trin right?\"  You look down in defeat.<br>\r\n\"Hey c'mon man I don't mean no harm, I just wanna throw in some advice y'know? Look, after class, not during class or it makes you look a bit desperate, ask her if she wants to hang with you during lunch, then try to get her to open up y'know? Try to learn her interests and hoobies alright?\" Suddenly the bell rang. <br>\r\n\"Alright, let's head for maths before Miss Carpenter starts taking role call early again.\" As you and Jason walk over to the classroom, you think about what Jason said...<br>\r\n<br>\r\nMeanwhile at Rita's moon-base. \"<br>\r\n\"Gaaaah! I need to find a way to break those rangers!\" Rita yells out loud.<br>\r\n\"Well you can't just keep sending out a random monster each time, if one random path of destruction won't lead them to their end, then another hundred won't...why not try to get control of one of them somehow? They wouldn't attack their friends...\" The shadowy figure suggested.<br>\r\n\"Ah yes of course! Brilliant idea! Now let's see...\" Rita began as she walked over to her telescope. <br>\r\n\"Hmmmmm? Well well well, looks like our bold black rangers has a thing for the yellow ranger...\" Rita stated as she notices you looking over at Trini at almost every moment during class, then she snapped her fingers.<br>\r\n\"I've got it! I shall send in the-\"</span></div></div>",
            "created":1330146000,
            "id":1283959,
            "title":"Trinni."
        },
        "1141121":{
            "author_id":"wolf210",
            "author_name":"wolf",
            "choices":[
                "you were fine (sorta)",
                "you had changed "
            ],
            "content":"<div class=\"\"><div> <span>back on earth \"well i guess i'll see you guys later\" you say before heading off to go home, but before you can you get warped to zordon. \"huh zordon whats up why did you call us wait no let me guess its another one of ritas monsters again isn't it?\" you ask. \"yes it is and i need you to defeat it before it causes trouble\" zordon says.  \"alright its morphin time!\" says jason (insert transformation here) and with that you are all sent back to angel grove. \"well well well looks like you rangers came to play but im not here to do anything just yet putties attack.\" and with that he jumped up and left the area \"jason im going after him you guys think you can handle the putties by yourselves\" you ask \"yeah we got this go after that guy\" says jason.<br>\r\n<br>\r\nwhile the others were fighting the putties you went after the sinister seed and eventually cornered him. \"give it up its over\" \"yes it is ... over for you!\" \"what the\" the next thing you know you were on your back holding your shoulder. \"bye bye ranger we will meet again soon\" with that said he got away and just as he left the others appeared \"you ok there?\" asked jason \"yeah yeah im ok\" you say still holding your shoulder \" lets report back to zordon\"<br>\r\n<br>\r\nlittle did you know that pain in your shoulder was a mind control seed that would turn you evil.<br>\r\n<br>\r\nthe next day</span></div></div>",
            "created":1478494800,
            "id":2234167,
            "title":"\"Sinister Seed!\""
        },
        "11411212":{
            "author_id":"jcmsrules",
            "author_name":"Gentle Giantess's Rule",
            "choices":[
                "The change was immediate ",
                "The change took a little time to fully take over you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How fast was the change?</span></div></span></div>",
            "created":1552512360,
            "id":2629913,
            "title":"you had changed "
        },
        "11412":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Kimberly has developed a crush on you ",
                "You developed a crush on her"
            ],
            "content":"<div class=\"\"><div> <span>\"You are John clever and brave you shall lead the Mastodon Dino-Zord!\" Zordon said the others beam at you \"Congratulates John!\" Jason said clapping you on the back, \"Yeah man way to go welcome to the team!\" Zack said but it was the alarm that sounded and Zordon directed your attention to the viewing globe \"It appears Rita has unleashed another monster upon Angel Grove so this would be a good time for our new team member to prove himself!\" \"Yeah come on John we'll teach you the ropes of fighting off Rita's bizarre creations!\" Trini said \"Thanks!\" you said \"Okay guys enough chat it's Morphing Time!\" Jason yelled as the six of you teleported from the Command Center into your special Power Ranger armor following the battle against a ferocious mutant zombie like creature the others stated it was one of Rita's toughest creatures as it was able to regenerate it's body parts at will and unleash devastating power beams that rendered all their weapons useless you for your first mission happen to be the one to save the day and actually save the cute pink ranger Kimberly while you're at it she responded later by gracefully hugging you \"Thank you John for saving my neck back there the others are right! You really are amazing even for your first time as a Power Ranger you came through sorry I never got a chance to introduce myself I'm Kimberly Hart!\" \"John Berk!\" you say a little shocked and nervous that such a pretty girl was this close to you as you never really spoke to girls in general and of course you heard just how talented the extremely beautiful Kimberly was at gymnastics but you shake her hand anyway still nervous she notices this and giggles \"Look there's no reason for you to be all scared of me John it's not like I'm going to sucker punch you or anything like that! I'm really a very good person and I hope you have a good experience as one of us! Want to walk me to class?\" you feeling a bit better and less nervous nod \"Sure!\" \"Okay goodie!\" Kimberly said beaming as she extended her arm for you to hold a few days later you realize </span></div></div>",
            "created":1363755600,
            "id":1554382,
            "title":"\"John, you are clever and brave, you shall ..."
        },
        "115":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "White Ranger",
                "Pink Ranger",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright then, how about White Ranger or Pink Ranger?</span></div></span></div>",
            "created":1321678800,
            "id":1225689,
            "title":"More Rangers"
        },
        "1153":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "For sure!",
                "No thanks..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yellow Ranger might be good?</span></div></span></div>",
            "created":1321678800,
            "id":1225691,
            "title":"Yellow Ranger?"
        },
        "11531":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Girl",
                "Boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, are you a boy or girl?</span></div></span></div>",
            "created":1385874000,
            "id":1701349,
            "title":"For sure!"
        },
        "115311":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Trini",
                "New Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you Trini, or a new girl?</span></div></span></div>",
            "created":1385874000,
            "id":1701350,
            "title":"Girl"
        },
        "1153112":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Lexie (who is shy, self-conscious of her beauty, but smart)",
                "Claire (Intelligent, strong, and uninhibited about her body)"
            ],
            "content":"<div class=\"\"><div> <span>Zordon asks Alpha to teleport five teens to the command center. The plucky automaton punches a few buttons, and finds five teens inside the Angel Grove Youth Center. The five teens were Jason: the headstrong, compassionate, loyal would-be leader; Billy: The intelligent, shy, but agile tech specialist; Zack: The fun-loving, level-headed comedian; Kimberly: the pretty, naive, yet strong gymnast. The fifth member was to be Trini, however Rita Repulsa had other plans. On her castle on the moon, she spies these events taking place and knows Zordon will likely form his Power Rangers.<br>\r\n<br>\r\n\"Goldar! Where's that talisman?!\" The stout, shrieking witch shouted.<br>\r\n<br>\r\n\"Here, my queen. This talisman has been in your collection for millenia. What possible use could it be?\" The wolf-faced monster in gold armor croaked.<br>\r\n<br>\r\n\"Idiot! I asked for the talisman, not your opinion! But, since you asked, This talisman will be my key to Zordon's undoing! It not only will make sure a different teen is teleported, it will forever imprint the child with a trait that will ultimately render whatever team Zordon creates into nothing but a gang of rowdy teenagers!\"<br>\r\n<br>\r\nRita wasted no time and flung the talisman toward Earth. Just as Alpha sent the signal to bring the teens in, the talisman worked its magic! Instead of Trini, Alpha ended up teleporting a girl who was in the gym's locker room. She was surprised to find herself alongside four people she'd never met before. What's worse, she was only wearing a towel! As the boys looked around at the gadgets, Kimberly noticed the odd girl wearing very little clothing.<br>\r\n<br>\r\n\"Hi there. I'm Kim, what's your name?\"<br>\r\n<br>\r\nYou answer:</span></div></div>",
            "created":1385874000,
            "id":1701354,
            "title":"A different Yellow Ranger"
        },
        "11531121":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Hapless Nudity",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Lexie. That's a cute name. Why were you wearing only a towel?\" Kim asked.<br>\r\n<br>\r\nBefore you can answer, Zack noticed you, the beautiful girl wearing only a towel, and sauntered over.<br>\r\n<br>\r\n\"Hey there. Don't think we've met. I'm Zack.\" The boy bowed before doing a backflip to impress you. However, his foot caught the bottom of your towel, whisking it off your body!<br>\r\n<br>\r\nYou weren't aware of what happened until the three boys began to look at you wide-eyed. You finally looked down and immediately crouched, squealing in embarrassment. Kim picked the towel off the floor and wrapped it around your naked body before hugging you. The guys murmuring apologies. You can't believe three boys, who you've never met before, just saw you naked!<br>\r\n<br>\r\n\"Ay yi yi yi yi!\" The automaton cried as he waddles toward you. You stand up, apprehensive towards the mechanical person's motives. <br>\r\n<br>\r\n\"Alpha, it's time we've introduced ourselves.\" Zordon commanded.<br>\r\n<br>\r\n\"Whoa, check out the floating head!\" Zack shouted.<br>\r\n<br>\r\n\"I am Zordon, a wizard who has been imprisoned here after my final battle with Rita Repulsa. The automaton as you call it is Alpha 5.\" Zordon explained.<br>\r\n<br>\r\n\"Wizard, Rita Repulsor, Alpha? I don't think I understand.\" Kim spoke up.<br>\r\n<br>\r\n\"Turn and watch the viewing globe.\" Zordon ordered.<br>\r\n<br>\r\n\"We won't be getting hypnotised or anything?\" Jason asked.<br>\r\n<br>\r\n\"The viewing globe is safe. Do not fear it.\" Zordon explained.<br>\r\n<br>\r\nThe five teens turned to look at a large white sphere on a pedestal. It appeared to be a normal globe around a lightbulb. However, as they gazed into it, they started to views images not unlike a VCR. It was snowy at first, but the picture became clear. It showed a manin a white robe waving his staff before a great white flash went off, and a sparkling ball flew from the staff into a woman wearing a horned hat and brown robes. The woman was gone in a flash, and the sparkling ball zoomed and deposited itself in a small gold container.<br>\r\n<br>\r\n\"During my final battle with Rita Repulsa, I wasn't able to defeat her, but instead imprisoned her in that dumpster, hoping she would never escape. Unfortunately, she has come back, and that is why I've called upon you five.\"<br>\r\n<br>\r\n\"How are we supposed to fight against a witch if she's too powerful even for you?!\" Zack asked.<br>\r\n<br>\r\n\"With these!\" Zordon bellowed for dramatic effect.<br>\r\n<br>\r\nIn a flash, five small objects appeared on the console. Each was a silvery metal gadget that was an inch think and four inches across and two and a half inches long. They were octagonal by shape, and in the middle there was a round piece of what looked to be bronze. Each one had a different animal stamped on it.<br>\r\n<br>\r\n\"These are your power morphers.\" Zordon explained.<br>\r\n<br>\r\n\"Morph?\" Kim asked.<br>\r\n<br>\r\n\"Metamorphosis. It means to change.\" Billy answered.<br>\r\n<br>\r\n\"With these, you will become the Power Rangers: mighty, powerful, and hopefully able to stop Rita's schemes.\"<br>\r\n<br>\r\n\"So, how do these work?\" Billy asked.<br>\r\n<br>\r\n\"Each of you will be designated an animal from which you draw your power. Jason, you are the courageous Tyrannosaurus Rex! Zack, you are the swift, powerful Mastodon. Kimberly, You are the nimble and agile pterodactyl. Lexie, you are the strong, fast, noble Sabretooth Tiger. Billy, you are the strong, Triceratops. Merely shout the name of the of your animal while raising your morpher to the sky. Try it now.<br>\r\n<br>\r\nEach of them took a morpher and once done, were wearing their uniforms. However, your uniform is different because of Rita's talisman. because of this, you are now plagued by...</span></div></div>",
            "created":1385874000,
            "id":1701371,
            "title":"Lexie (who is shy, self-conscious of her beauty..."
        },
        "115311211":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "You levitate over everyone in the room",
                "You slowly spin in place, giving everyone a nice view"
            ],
            "content":"<div class=\"\"><div> <span>Due to Rita's talisman, you were imprinted with its ability to make your life miserable. It has taken on many different forms of menace, including excessive aggression, being hated by the opposite sex, not being able to make friends, etc. However, it has chosen now to make its victim suffer embarrassing situations by having you lose your clothes at inappropriate times. As such, you find yourself standing among your new compatriots somewhat less clothed than they were. While they had somehow managed to morph into their suits, you look down to see you're only wearing a helmet, gloves, boots, and belt!<br>\r\n<br>\r\nAfter everyone gives themselves a once-over to marvel at their suits, their attention lands on your naked body. You yelp and cover yourself with your gloved hands. Kimberly can't help but giggle at your predicament, but the others are puzzled at this turn of events. <br>\r\n<br>\r\n\"Zordon, what happened?!\" You cry.<br>\r\n<br>\r\n\"Yeah, why is she naked?\" Billy asks.<br>\r\n<br>\r\n\"Lexie, I'm not sure what happened...\" Zordon began.<br>\r\n<br>\r\n\"You pervert! If brought me here just to see me named, I guarantee things will not end good for you!\" You exclaim.<br>\r\n<br>\r\n\"I'm sorry. I really have no clue what happened, but there's a way to find out. Alpha, escort Lexie to the bio-scanner.\" zordon ordered.<br>\r\n<br>\r\nAlpha gestured Lexie to follow, and she sheepishly walked behind, covering herself as best she could with her hands. She was, however, fully aware that this left her bare bottom exposed for the rest of them to see. Alpha brought her to a corner of the room where there was a three-foot wide circle on the floor that seemed to light up as she stood on it.<br>\r\n<br>\r\n\"This bio-scanner detects any magic or malfunctioning technology on or in your body. However, it works better if your limbs are stretched away from your body.\" Zordon explained.<br>\r\n<br>\r\nIt took a second for You to figure out what he meant.<br>\r\n<br>\r\n\"Wait, you mean I have to...expose myself to everyone?\" You ask.<br>\r\n<br>\r\n\"I'm afraid so. Otherwise, we can't figure out how to help you.\" Zordon replied.<br>\r\n<br>\r\nYou reluctantly lower your arms to your sides, exposing your ample breasts and trimmed pubic hair. Within seconds, a pale white light emanates from the floor beneath you and becomes almost blinding. You can only see white all around you, but everyone can still see you. You get a bit scared when you feel your limbs moving away from your body so you stand spread eagle. Your fear increases when you realize you are immobilized. However, you your embarrassment comes to a head when...</span></div></div>",
            "created":1385960400,
            "id":1701839,
            "title":"Hapless Nudity"
        },
        "1153112112":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Hason tackles the Putty",
                "The Putty squeezes your boobs"
            ],
            "content":"<div class=\"\"><div> <span>The scanner makes you spin in place, which means everyone will see all of you! You can't move your hands to cover you no matter how hard you try. You blush under your helmet as you hear everyone's reactions t seeing your naked body. After a minute, you're free to cover yourself,but what's the point now? You step off the platform and join the other rangers awaiting Zordon's conclusion.<br>\r\n<br>\r\n\"Lexie, I'm afraid you've been tainted by a powerful magic. The scanner show that you've been imprinted by the Talisman of Misfortune. No doubt this is Rita's doing to try to sabotage my efforts to defeat her. However, I am not going to let this hinder our cause. Alpha, deploy the rangers at once!\"<br>\r\n<br>\r\n\"Zordon, what does that mean?\" You ask.<br>\r\n<br>\r\nHowever, before you get your answer, you are zooming out of the command center and before you can scream, you're deposited in the middle of Angel Grove. A crowd gathers around you as they are curious about the uniformed team that has appeared. However, it doesn't take long for them to notice you.<br>\r\n<br>\r\n\"Hey, did someone forget something this morning?\"<br>\r\n<br>\r\n\"Check out the girl in the yellow helmet!\"<br>\r\n<br>\r\n\"Whoa, that uniform's not family friendly!'<br>\r\n<br>\r\nYou hear their comments, but your attention suddenly focuses on something even worse. You see a giant Ape with gold armor and wings terrorizing the city! This soon gets everyone else's attention and they begin to flee. You begin to cover yourself as they run past you, but you see your fellow teammates running ahead of you. You struggle to follow them before you're all attacked by Putty Patrolers.<br>\r\n<br>\r\n\"What are these things?\" Jason yells.<br>\r\n<br>\r\n\"I don't know, but they sure are ugly.\" Zack replies.<br>\r\n<br>\r\n\"Hey, these guys feel odd when you hit them.\" Billy adds.<br>\r\n<br>\r\n\"Yeah, it's like they're clay or something.\" Jason comments.<br>\r\n<br>\r\n\"Clay, gross.\" Kim says before flipping a putty over her head.<br>\r\n<br>\r\nYou stand still, trying not to get hit. However, your presence is noticed by the putties and they descend on your position. You lock their attacks as best you can, but you're overwhelmed. You're able to kick a couple away from you, but another two grab your wrists, leaving you open to attack by a third putty. You cringe as it gets closer, twitching its fingers toward you. You scream for help when...</span></div></div>",
            "created":1386046800,
            "id":1702834,
            "title":"You slowly spin in place, giving everyone a nic..."
        },
        "11531121121":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "You're standing on a platform in the center of the room",
                "You are each in control of a different limb"
            ],
            "content":"<div class=\"\"><div> <span>Jason suddenly tackles the putty to the ground, distracting the ones holding you enough for you to break free and kick them away.<br>\r\n<br>\r\n\"You alright?\" he asked.<br>\r\n<br>\r\n\"Fine, thanks to you.\" you reply.<br>\r\n<br>\r\n\"Don't mention it. Let's get these guys!\" Jason says before running back to the action.<br>\r\n<br>\r\nYou look around and see everyone fighting these weird guys. You're not sure how to jump in, but you find yourself forced into it when more putties run toward you. You avoid their attacks, but one finally hits your breasts. You're thrown backward, but oddly enough, you don't feel any pain. You move your gloved hands over your body, and you can feel bare skin, yet it seems there is a force field blocking attacks. With renewed vigor, you enter the fight full force. You flip putties over your head as you fight towards your teammates. Kim sees you and help you fend off a couple putties before standing behind you back to back.<br>\r\n<br>\r\n\"I wasn't sure you'd be able to join us.\" Kim said.<br>\r\n<br>\r\n\"I wasn't sure either, but it seems that even though I'm not wearing a suit, something is keeping them from hitting me.\"<br>\r\n<br>\r\n\"Great! At least we can get through this and figure out if we can get you un-naked.\"<br>\r\n<br>\r\nYou giggle and fight off the remaining putties side by side. Afterward, you re-group with your teammates and celebrate your victory.<br>\r\n<br>\r\n\"Man, that was awesome!\" Zack cheered.<br>\r\n<br>\r\n\"Yeah, these suits work great!\" Billy added.<br>\r\n<br>\r\n\"Lexie, how are you?\" Jason asked.<br>\r\n<br>\r\n\"She's fine. seems that even though she isn't wearing anything, nothing can touch her. I'm fine by the way.\" Kim commented.<br>\r\n<br>\r\n\"Is that true?\" Jason asks you.<br>\r\n<br>\r\n\"Yeah. It's like I'm wearing a suit, but I'm not. It's not like an invisible suit, cuz I don't feel anything on my body. It's like a force filed or shield.\" You explain.<br>\r\n<br>\r\n\"Zordon, if you can hear us, can you explain what's going on?\" Jason yells.<br>\r\n<br>\r\n\"Yes, I can hear you Jason. While you're in those suits, I can listen to your conversations. It seems what Lexie is experiencing is a slight loophole in the power coins' power. The symbol on your morphers are more than decoration. They are what give you power. It creates the suits and grants you extra strength and stamina during particularly strenuous battles.\"<br>\r\n<br>\r\n\"Thanks for the lecture, but in case you haven't noticed, Angel Grove is being terrorized by a giant flying ape!\" Zack interrupted.<br>\r\n<br>\r\n\"I was just about to get to that. Your power coins also power the greatest weapon we have in fighting against Rita's creations. That monster terrorizing the city is named Goldar, and he is Rita's closest advisor. She has used her magic to make him grow. In order to fight back, you merely need to call upon your Zords.\"<br>\r\n<br>\r\n\"Zords?\" Billy asked.<br>\r\n<br>\r\n\"They are fierce, fighting machines that that take the form of the animal on your power coins, and each of you is assigned one.\"<br>\r\n<br>\r\n\"Nice, but how do we call upon them?\" Jason asked.<br>\r\n<br>\r\n\"Simply announce that you need their help. They will immediately come to assist you.\" Zordon explained.<br>\r\n<br>\r\n\"Alright, guys. Let's do this.\" Jason says.<br>\r\n<br>\r\n\"We need DinoZord power now!\" You all shout.<br>\r\n<br>\r\nFrom seemingly out of nowhere, you hear a rumble. The thundering Zords suddenly appear n the horizon, from different locations before arriving right in front of you.<br>\r\n<br>\r\n\"Whoa, they're HUGE!\" Zack shouted.<br>\r\n<br>\r\n\"I guess we'd better get acquainted.\" Billy said, stepping closer to them.<br>\r\n<br>\r\n\"Rangers, you must pilot the Zords. Leap onto their heads and enter the cockpit.\" Zordon explained.<br>\r\n<br>\r\n\"Okay, I guess we'll just jump five five to ten stories into the air and hope we land on our Zord.\" You comment.<br>\r\n<br>\r\n\"Ready?\" Jason asks everyone.<br>\r\n<br>\r\nYou all jump into the air, and miraculously, you're drawn straight to your giant yellow Sabertooth Tiger. You open a hatch and jump, landing right into a chair.<br>\r\n<br>\r\n\"Wow, it's like it fits perfectly.\" You comment.<br>\r\n<br>\r\n\"Yeah, and the controls are very intuitive. It's almost second nature to me.\" Billy adds.<br>\r\n<br>\r\n\"Alright, let's fight this guy!' Jason announces.<br>\r\n<br>\r\nEach of you do your best to fight Goldar, but his swift movements and swordfighting skills are too good for your Zords. He easily fends off all your attacks.<br>\r\n<br>\r\n\"Zordon, something's wrong. We aren't winning!\" Kim yells.<br>\r\n<br>\r\n\"In the event that your Zords aren't enough, they can be combined to form the MegaZord.\"<br>\r\n<br>\r\n\"That would've been helpful a few minutes ago.\" Zack quipped.<br>\r\n<br>\r\n\"Alright, let's see if this works.\" Jason says.<br>\r\n<br>\r\nEach of you find a crystal on your armrest and a slot opens for you to insert it into the console in front of you. Inserting the crystal immediately initiates the MegaZord sequence. Slowly, each of your Zords slides into place, creating a large humanoid robot. To your surprise, you're now all in a large control room, however something is different...</span></div></div>",
            "created":1386565200,
            "id":1705689,
            "title":"Jason tackles the Putty"
        },
        "115311211211":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "In your home",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>You look out in front of you and see a large window looking out at the city. you lift your hand towards you face, but you stop when you see a large robotic fist almost smashing into the window! You extend your arms, ready for the impact, but then you see the fist suddenly move away, followed by another robotic hand next to it. You then get an idea. You move your right arm down, and you see the robot hand do the same.<br>\r\n<br>\r\n\"Lexie, you've figured out that the MegaZord responds to your movements.\" Zordon commented.<br>\r\n<br>\r\n\"What's the deal, Zordon? How come she is the only one who controls this thing while we just sit here?\" Zack asks.<br>\r\n<br>\r\n\"I'm not sure. The MegaZord was originally designed for all of you to work together. It seems Rita's talisman was able to change the controls so she has to do the fighting. I trust that all of you will help her control the MegaZord so you can work together and defeat Goldar.\" Zordon explained.<br>\r\n<br>\r\n\"Great. I can't even figure out how to turn my coffeemaker on, and now I'm in control of a giant robot.\" you comment.<br>\r\n<br>\r\n\"Kick!\" Jason orders, and you kick with your left leg, sending Goldar stumbling backward.<br>\r\n<br>\r\nNow in the heat of battle, you let go of your modesty and nervousness. You tune out everyone's yelling and concentrate on defeating Goldar. you block and punch and kick, but then his sword hits you, making you stumble backward.<br>\r\n<br>\r\n\"If you need a more powerful attack, summon the Power Sword!\" Zordon chimed in.<br>\r\n<br>\r\n\"I need Power Sword power now!!\" you exclaim.<br>\r\n<br>\r\nSuddenly, a silver sword drops from the sky! You try to catch it,but it flies out of your reach and lands behind you, embedding itself in the ground. You turn around and bend over to pull the sword from the ground. Behind you, Zack whispers to Jason and Billy how they can totally see everything thanks to your posture. Kim scoffs and clears her throat, alerting you to the show you were inadvertently putting on. You pull the sword from the ground and about to strike when Goldar simply vanishes out of thin air. You stand limply, not sure what to do when you're suddenly teleported back to the command center.<br>\r\n<br>\r\n\"Great job, Lexie! You won the fight against Goldar, but I'm sure Rita has some other plans up her sleeve.\" Zordon explained.<br>\r\n<br>\r\n\"So what do we do now? Those Zords are still out there.\" Jason asked.<br>\r\n<br>\r\n\"Don't worry, Jason. They'll be just fine. Once you are teleported back here, they'll return to wherever they came from. As for what to do now, you may go back to your lives and act like this never happened. When Rita shows up again, I will alert you. Be sure not to tell anyone that you are the Power Rangers. It not only protects you, but them as well.\" Zordon continued.<br>\r\n<br>\r\n\"How will we know if we are needed again?\" Billy asked.<br>\r\n<br>\r\n\"I will alert you viathese communicators.\" Zordon answered.<br>\r\n<br>\r\nA flash of light appeared and on a small table looked to be a set of five metallic bracelets. A metallic dome was positioned in the middle of the strap, like a wrist watch. Everyone took one and fastened it around their wrist.<br>\r\n<br>\r\n\"We will alert you with a beep from these communicators. You can press the button on the side to talk, and either Alpha or I will tell you what to do. Farewell Rangers, until we need you again.\" Zordon said.<br>\r\n<br>\r\n\"Wait, I'm still...\" you begin, but are cut off when you are teleported back to Angel Grove.<br>\r\n<br>\r\n\"...Naked.\" you finish as you look around you. To your surprise, you're now standing (nude)...<br>\r\n<br>\r\n</span></div></div>",
            "created":1386565200,
            "id":1705733,
            "title":"You're standing on a platform in the center..."
        },
        "115311211212":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "SHE will be ready in a few hours.\"",
                "HE will be ready in a few hours.\""
            ],
            "content":"<div class=\"\"><div> <span>Each of you is in charge of your respective Zord that is a limb of the MegaZord. Your job is to be the left leg. Billy is the other one. You are nervous, not sure if you all can work in tandem to control this thing, but you all gt it right on the first try! You start fighting Goldar, blocking his hits as best you can while dealing out your own. However, his sword slashes at you with such force, it knocks the MegaZord backwards.<br>\r\n<br>\r\n\"Your MegaZord has a weapon that you can call upon if the time warrants it. Simply call for the Power Sword!\" Zordon announces.<br>\r\n<br>\r\n\"We need Power Sword now!\" you all shout.<br>\r\n<br>\r\nThen, to your amazement, a giant silver sword descends from the sky, and the MegaZord catches it in its hand.<br>\r\n<br>\r\n\"Got it!\" Zack announced.<br>\r\n<br>\r\n\"Great, now let's show this guy who's boss!\" Jason shouts.<br>\r\n<br>\r\nHowever, before you do anything, Goldar retreats, vanishing out of thin air.<br>\r\n<br>\r\n\"Huh, I guess he's a coward after all.\" Billy commented.<br>\r\n<br>\r\nAs the MegaZord stands triumphant, all of you are suddenly teleported to the command center once again.<br>\r\n<br>\r\n\"Great job, Rangers!\" Zordon announces.<br>\r\n<br>\r\n\"I knew you could do it! Ay yi yi!\" Alpha exclaims.<br>\r\n<br>\r\n\"Thanks, but what about the Zords? we can't just leave them there.\" Jason asks.<br>\r\n<br>\r\n\"Don't worry, Jason. The Zords will be fine. After every battle, they return to wherever they came from, waiting for you to call upon them again.\" Zordon explained.<br>\r\n<br>\r\n\"So, now what? we just patrol the Earth? Make sure Rita's not doing anything else?\" you ask.<br>\r\n<br>\r\n\"It seems we have put a stop to Rita's latest scheme, however we still aren't able to figure out what to do about you, Lexie. In the meantime, you may live your lives as you normally would. However, no one can ever know you're a Power Ranger for not just your safety, but theirs as well. Goodbye until we need you again, Rangers!\" Zordon announced.<br>\r\n<br>\r\n\"Wait, but I'm..\" you begin, but then you're teleported back into the youth center locker room.<br>\r\n<br>\r\n\"...Naked.\" You finish.<br>\r\n<br>\r\nYou're at least grateful that no one was inside the locker room at the moment, so you go to your locker and realize you don't have the key. it was tied to your wrist, but it must've been lost after all the teleporting and morphing. You sigh as you realize you have to get home. You look around for anything that will cover you, finding a towel.<br>\r\n<br>\r\n\"At least this day can't get any worse.\" You say to yourself as you cautiously exit the locker room.<br>\r\n<br>\r\nYou walk into the dark room, not surprised since the center is closed at this time. You hope you can make your way to the exit and get home without anyone seeing you. However, you're surprised when the lights suddenly come on!<br>\r\n<br>\r\n\"Surprise!\" you hear a crowd cheer.<br>\r\n<br>\r\nIn your surprise, you let out a yelp and clasp your hands to your face, causing your towel to drop tot he floor. As your eyes adjust, you see it's your new friends! All of you realize you're standing there naked in front of them, and you finally try to cover yourself.<br>\r\n<br>\r\n\"You're not a secret nudist, are you?\" Kim jokes.<br>\r\n<br>\r\n\"I'm sorry. I didn't mean to...\" You squeak out, trying to reach for the towel.<br>\r\n<br>\r\n\"Leave it, it's fine. We've seen all of you already. When we were teleported back here, we wanted to do something special for you to say that you're one of us. I was hoping that it would give you a chance to get to know us with your clothes on, but it seems that's out of the question now.\" Jason explained, holding up a pizza.<br>\r\n<br>\r\n\"Wow guys, I'm...this is so unexpected!\" You beam with joy.<br>\r\n<br>\r\n\"We can do this another time if you're uncomfortable.\" Jason offered.<br>\r\n<br>\r\nYou mull it over before deciding.<br>\r\n<br>\r\n\"To hell with it. If we're gonna be fighting side by side from now on, you're gonna see a lot of me anyways!\" you say.<br>\r\n<br>\r\nYou join in a group hug and dig into the pizza, relaxing after a very strange day. Yet, unknown to all of you, it's just about to get weirder.<br>\r\n<br>\r\n\"Ahh! My talisman worked! That girl is going to be exposed so much, she might as well be a nudist!\" Rita shouted, looking through a telescope from her castle on the moon.<br>\r\n<br>\r\n\"Are we ready for phase two, my Queen?\" Goldar asked.<br>\r\n<br>\r\n\"Yes! Make sure my Ranger is ready to be deployed ASAP!!\" she ordered.<br>\r\n<br>\r\nGoldar left and went to the laboratory, where on the slab was a pulsing green form in the vague shape of a human. A Power Coin was mounted on a stand in the corner, beaming its light onto the humanoid. Goldar walked over to look things over.<br>\r\n<br>\r\n\"Good, this evil Green Ranger will prove no match for Zordon's Rangers.\" he said.<br>\r\n<br>\r\n\"Goldar!! Is my Ranger ready yet?\" Rita shouted from the hall.<br>\r\n<br>\r\nGoldar replied: \"Almost my Queen...</span></div></div>",
            "created":1386565200,
            "id":1705706,
            "title":"You are each in control of a different limb"
        },
        "1153112112121":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "A leotard and shoes",
                "Shorts and a tank top"
            ],
            "content":"<div class=\"\"><div> <span>The FEMALE green ranger lying on the slab was still pulsing green when Goldar left. However, as soon as he was gone, the girl sat upright ever so slowly...<br>\r\n<br>\r\nMeanwhile, back at the youth center, you are trying to get used to being the only one naked. You do your best to enjoy the pizza they brought for you. As you're trying to talk to everyone and have a good time, suddenly there's a flash of light and a bunch of metallic bracelets, which look like they had a circular speaker where a watch face would be, suddenly appear. You and the others try to figure out what's going on, but you hear Zordon's voice emanating from the bracelets.<br>\r\n<br>\r\n\"Rangers, I nearly forgot to give these to you. They are your new communicators. Use them to talk to each other about official Power Ranger business. When the city is in trouble, Alpha and I will contact you and give you the details of the situation. Whenever we need you, the communicators will beep, and you can press the button on the side to talk. Good luck, Rangers!\" Zordon explained.<br>\r\n<br>\r\n\"Wow, it's like having a phone on your wrist!\" Zack said in awe.<br>\r\n<br>\r\n\"They're secure transmitters that only we can use. They're even a direct line to Zordon. This is incredible!\" Billy added.<br>\r\n<br>\r\n\"As long as it doesn't clash with my outfit, I'm fine.\" Kim joked.<br>\r\n<br>\r\n\"Cool, it fits without any adjustment.\" Jason observed.<br>\r\n<br>\r\n\"Yeah, that is cool, but also a bit creepy. I mean, they knew our wrist sizes?\" you add.<br>\r\n<br>\r\n\"Well, I guess we should head home.\" Jason said.<br>\r\n<br>\r\n\"Wait, can someone give me a ride home? I don't really want to have anyone see me...like this.\" you ask.<br>\r\n<br>\r\n\"Sure. I can take you home. I think you're even on my way to my place.\" Kim said.<br>\r\n<br>\r\nYou agree and pick the towel up from the floor and are about to put it back on when Kim stops you.<br>\r\n<br>\r\n\"I think I have my warm up clothes in my locker. They should fit you just fine.\" she explains, leading you to the locker room.<br>\r\n<br>\r\nOnce inside, Kim opens her locker and takes out her bag. It has the clothes she normally wears when she's practicing her gymnastics. This includes...</span></div></div>",
            "created":1386997200,
            "id":1707502,
            "title":"SHE will be ready in a few hours.\""
        },
        "11531121121212":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Kimberly's house",
                "Lexie's house"
            ],
            "content":"<div class=\"\"><div> <span>Lexie is thankful for the clothes, but makes an unfortunate discovery. Kimberly must be slightly more petite, since the clothes she gave her turned out to be a tight fit. Luckily, the tank top was stretchy enough to encapsulate Lexie's ample breasts. The shorts were made of a spandex-like material that was able to stretch in all directions, affording Lexie the cover she sought. Of course, te tightness came with its own problems. Even though neither garment showed any signs of straining or tearing, the fact remained that her anatomy was pressed against a thin layer of clothing. Her nipples poked through the tank top, and their dark pink color was slightly noticeable. Further, the shorts hugged her curvy hips and outlined her backside very nicely. The only drawback was the very noticeable cameltoe in the front. No matter what Lexie dd, her front cleft was going to be on display. <br>\r\n<br>\r\nLexie bit her lip and hoped no one but Kimberly would see her. She emerged from the locker room, and all the guys noticed how her clothes hugged her like a second skin. Lexie blushed as she walked over to Kimberly, using her hands to hover over her crotch.<br>\r\n<br>\r\n\"Hey, I'm ready whenever you are.\" Lexie declared.<br>\r\n<br>\r\n\"Great! Let's go. See ya, guys!\" Kimberly bid everyone goodbye.<br>\r\n<br>\r\nLexie was too embarrassed to speak, but offered an awkward nod as she turned to leave. Zack gave her a wolf whistle as her plump bottom receded from the group. Lexie followed her new friend outside and was led to a white jeep.<br>\r\n<br>\r\n\"Alright, hop in!\" Kimberly gestured.<br>\r\n<br>\r\nLexie climbed into the jeep and Kimberly soon had them speeding off. During the ride, Lexie couldn't believe how much tighter the sorts became when she sat. The seam was digging into her sex, and the vibrations of the Jeep combined with the rough road made it difficult for Lexie to focus on where Kimberly was taking her. A sheen of sweat coated her skin by the time Kimberly stopped the car. Lexie opened the door and looked where they arrived at for the first time. It was...</span></div></div>",
            "created":1400216400,
            "id":1797235,
            "title":"Shorts and a tank top"
        },
        "11532":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Pink Ranger",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm just gonna put this out there: </span></div></span></div>",
            "created":1385874000,
            "id":1701346,
            "title":"No thanks..."
        },
        "115321":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Kimberly/Kat",
                "New Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just to be clear, You can choose to be Kimberly, Kat, or a new girl of your choice</span></div></span></div>",
            "created":1385874000,
            "id":1701347,
            "title":"Pink Ranger"
        },
        "12":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Power Rangers Zeo",
                "Chouriki Sentai OhRanger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have a choice none of the other options have. Continue onto Power Rangers, or go for its Super Sentai counterpart. Just be warned, Super Sentai is completely different from Power Rangers.</span></div></span></div>",
            "created":1539380340,
            "id":2562976,
            "title":"Zeo?"
        },
        "121":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "You get sucked into the TV Show",
                "You are in their universe",
                "Reserved"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does it happen?</span></div></span></div>",
            "created":1599449460,
            "id":2898736,
            "title":"Power Rangers Zeo"
        },
        "14":{
            "choices":[
                "ok",
                "um",
                "no "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ya but wen u go make sure u no the se'crets ok  <br>\r\n<br>\r\nwat happen </span></div></span></div>",
            "created":1329368400,
            "id":1278235,
            "title":"Samurai?"
        },
        "142":{
            "author_id":"cammanca23",
            "author_name":"Camman",
            "choices":[
                "The same as the show",
                "Not the same as the show"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it gonna the same as the show or will it be different <br>\r\n( the characters change but not much changes in the plot)</span></div></span></div>",
            "created":1365915600,
            "id":1571397,
            "title":"Um"
        },
        "1422":{
            "author_id":"cammanca23",
            "author_name":"Camman",
            "choices":[
                "Red",
                "Blue",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lastly which ranger are you?</span></div></span></div>",
            "created":1365915600,
            "id":1571398,
            "title":"Not the same as the show"
        },
        "14223":{
            "author_id":"brevination",
            "author_name":"Brevination",
            "choices":[
                "yeah a hit!",
                "darn hit a tree"
            ],
            "content":"<div class=\"\"><div> <span>Congratulations you are the 7th ranger: the black samurai ranger! Your name is Brevin Vice and your good friends with jayden and Antonio, the red and gold samurai rangers. your 17, you have not seen your friends since you were nine. you have been in china studying martial arts, you are a master in 3 styles of kung fu. you used wolf, bat and horse style, to befit your zords. These zords and their disc where going away presents from jayden, Antonio, and your first sensei. you got them back plus your new morpher when you were ready to return to the states. you had just gotten your bags and made sure your stuff was all there for you had made a list. you had two copies of said list, one english the other japanese, you had learned the language from your teachers, as well as how to use a sword. you took a taxi to get to the dojo. when you got there you saw 4 unfamiliar faces. by eavesdropping you learned the blonde Swedish guy was Tyler the green ranger. the dark haired Australian guy was Donny the blue ranger. the brunette farm girl was Lilly the pink ranger. And lastly Jonie the blonde was the yellow ranger. you then saw jayden and Antonio in full armor walk out with sensei yelling about a nighlok alert. you smiled, this was your chance to surprise them. while the others morphed and ran, you walked up to sensei and told him who you where. of course sensei was glad to see you and said you should join the others against the nighlok attack. \" yes sensei\", you said. you ran onto the street and pulled your morpher. \" its morphin' time\" you shouted. then you where clothed in a plack uniform the the symbol for darkness on your mask. you ran to the fight, and got there just as a goon was sneakin up on jayden. No, you thought, pulling explosion symbol power to attack the goon. It shot out like a rocket and then...</span></div></div>",
            "created":1413867600,
            "id":1875615,
            "title":"black ranger"
        },
        "142232":{
            "author_id":"brevination",
            "author_name":"Brevination",
            "choices":[
                "wolf",
                "bat"
            ],
            "content":"<div class=\"\"><div> <span>You didn't hit the mooger but jaden beat it off easily. Instead the shot hit what looked like a tree until it turned threw seeds at you which made more moogers, which the others except for jay and Antonio went to fight. One weakness you always had wrote to sensei and your friends about was, you cant use your symbol power without physically draining your self a bit. You spent hours trying to beat that weakness, and always woke up in your room. Jaden and Antonio rushed to your side as soon as they recognized your black symbol power. 'Brevin, you OK me amigo?', Antonio asked. 'I'm fine, really'. <br>\r\n'No your not, morphing and explosion you used symbol twice', jaden said. 'Plus, I actually used super speed to get from, the airport to the dojo, then used the last of it to get to the fight', you said meekly. '3 times?!? How are you still on your feet?', jaden asked. 'I've gotten stronger since my last letter to you guys', you explained. Meanwhile the tree monster was making more and more moogers. 'Jaden have the others move, I have a plan', jaden seemed uneasy at first but you gave him a thumbs up, and he nodded pushing a comm button on his mask and mumbling a fallback and regroup command. Four bright flashes later the others were behind you as well, and jaden did a round of introductions. You then took your morphed and put up a symbol power you developed in japan. A wave of energy, picking up degree and starting fires and small earthquakes had appeared and all that was heard was screaming and breaking bones. After it was over as you thought there was charred earth, blood and bones everywhere and fires. The other rangers seemed terrified,'glad you moved now huh?', you said. 'I call it 'Vince wipeout', cool right?' Then small tremors came out of nowhere, 'we have bigger problems' jaden said. Then the tree nighlok appeared as a giant. 'Time for mega mode power', jaden said. As they each picked a zord you chose yours it was..</span></div></div>",
            "created":1418965200,
            "id":1904921,
            "title":"Team effort"
        },
        "1422321":{
            "author_id":"brevination",
            "author_name":"Brevination",
            "choices":[
                "that night ",
                "next morning"
            ],
            "content":"<div class=\"\"><div> <span>'Let's cut this tree down', you said bravely,'mega mode power, unleash the wolf.' You stood proudley inside your zord, ' lefts rock wolf-zord', you said. The nighlok seemed, interested in you but ignored the others, who formed a mega-zord together and were obviousley confused that, the tree was ignoring them. But you understood completely, you called jaden,' J you thinking what I'm thinking?' 'Unfortunately, I think I am, he wants to test your strength for xandred, so he will ignore us completely.' 'Stand down guys', you said hearing protest followed by jaden encouraging words, everyone wished you luck, then the megazord dissapeared. 'So, it is down to you, and it is down to I, Treebora!', the nighlok roared. You needed an attack plan, and you knew it. Then an interesting idea came to mind, it would help since you were basically on your own. 'Wolf-zord, converge!', you say defiantley, the machine changed shape, taking a more human stance. 'Wolf-zord, beast warrior mode!', you were not done though. 'Bat-zord converge!', your bat companion, to your enemies surprise, turned into a sword with a glowing blue blade. 'But let me guess, you want me at my current best right Treebora?', you asked. The nighlok nodded slowly, very slowly. 'Right then, wake up horse-zord!', you shout, the warrior wolf-zord climbed atop the horse sword held high. 'Behold, I present to you the wild-heart samurai trimegazord', you say proudly. 'Let us begin ranger!', Treebora roared, charging at you. You charged back, sword to a point, then you jump over the nighlok, turn around and slash across his back. You smile until, the mark healed! 'Ha, fool a sword like that is useless against me', Treebora said, he then grabbed your sword and snapped it in half. Then he trashed the horse zord, from right under you. The wolf-zord fell to the ground, and turned to normal mode. You held your other zords in your hand, they needed rest. 'Come on Brevin think, he's gotta have a weakness. My sword didn't work, so that's out. He's a plant nighlok, he has immense strength, wait! That's it he's a plant', you say most triumphantley. The other rangers watched, as Treebora moved in for the final blow. A bright light then surged throughout the area, blinding the nighlok, you stood strong knowing you had him beat. Using symbol power, the wolf-zord was blessed with the power of fire. You attacked the nighlok leaving scratches that burned, and did not heal. 'No, impossible', Treebora roared as you attacked him more and more. 'One more hit, and your done Treebora', you said to the charred nighlok. 'Who are you?', he said weakley. 'I'm the black ranger, and your dust', you said. As the wolf-zord finished, preparing his attack, the nighlok was sucked into a red portal and dissapeared. You then joined the other rangers, 'what happened? Where did he go?', you demanded. 'Xandred called him back to the sanzu river, they will heal him and he will come back', jaden said. You then realized how weak you felt, and you collapsed to the ground. 'Brevin? Brevin?, oh god!', you heard Antonio scream, as you reached the ground blacking out. <br>\r\n*Meanwhile, back at the sanzu river* 'Thank you master, for saving me. Next time the black ranger will fall', Treebora said. 'See to it he does, we will cover for your vulnerability to fire next time', Xandred said. 'In the mean time, just heal', Octoroo said.<br>\r\n*Back with the rangers* The rangers were all brimming with worry at your condition. 'He will be stronger next time', Jonie said. 'Brevin or the nighlok?', jaden asked. 'I'm talking about the nighlok', Jonie replied. 'We'll train Brevin then, he has to get stronger to', Antonio said.</span></div></div>",
            "created":1419570000,
            "id":1907583,
            "title":"proving your mega"
        },
        "15":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "In Space?",
                "Time Force?",
                "Wild Force?",
                "Ninja Storm?",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More seasons to choose from.....</span></div></span></div>",
            "created":1321678800,
            "id":1225686,
            "title":"More Choices"
        },
        "153":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Somewhere in the Animarium",
                "Somewhere in Turtle Cove",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So where does your story start?</span></div></span></div>",
            "created":1384491600,
            "id":1694641,
            "title":"Wild Force?"
        },
        "1531":{
            "author_id":"brevination",
            "author_name":"Brevination",
            "choices":[
                "Brevin Beard, you are to be the gold ranger. Angry boar, welcome.\"",
                "Alan 'major' johnson, you are to be the green ranger. Watching owl, welcome.\"",
                "Gabriella Beard, you are to be the orange ranger. Jumping raccoon, welcome.\""
            ],
            "content":"<div class=\"\"><div> <span>(This story takes place in an alternate universe where Merrick is a ranger from the start, no zords ever died thus so hundreds or such zords are on the animarium. And the deer zord was never left behind. But 4 zords are sealed on earth that only the deer zord can find, he will only find them for the new ranger. The 4 zords are, boar, hippopotamus, owl, and raccoon. The story starts with the princess, talking with 5 zords about a 7th ranger. The zords are, deer, gorilla, elephant, and the bear brothers.) <br>\r\n<br>\r\n The princess woke with a start, looking at the clock Cole gave her. Its 2:47 am, but the princess could not sleep. She heard cries from outside, so she put on her traditional dress and grabbed a candle. Walking outside, she was surprised to see 5 zords just outside the temple. Her shock turned to fear and concern, when she saw how upset and nervous they seemed. The gorilla zord, reached out and lifted the princess up to the roof. <br>\r\n The princess looked to her zords, she knew they needed to speak with her. \"What's wrong dearies? Tell me what's the matter\", princess shayla said. The zords look to the princess, then deerzord spoke in zord tongue. The princess could not believe what she heard. \"A new ranger? Are you sure?\", shayla asked them. Then lights came in from all over the island, some coming from the five zords the princess could see. The lights formed a floating orb, which took on a flowing shape the princess recognized.<br>\r\n \"A morpher?\", she asked as the zords nodded. They gave her instructions to follow, then left to go back to bed except the deerzord who slept in the yard. The princess was gonna follow the instructions, but one quick issue. She was stuck on the roof, so she needed help. \"Merrick! Merrick! Come help me!\", she bellowed. \"Princess? Princess, where are you?\", Merrick called. He saw the princess waving at him, from the roof?!? \"Princess, how did you get up there?\", Merrick asked. The princess told him what happened, and Merrick was intrigued about the morpher. He fetched the ladder, and helped her down.<br>\r\n The princess approached the sacred water, and dips the new morpher in. The water glowed, and the morpher glowed and gained a look, to befit its new ranger master. \"Deerzord said that this morpher, will be he key to obtaining missing animal crystals\", shayla said. The water revealed an image of a young human mortal, the princess knew this was the new ranger.<br>\r\n However, the princess had an unwanted visitor. An org spy sent an image of the vision to his master, before heading out on his hover bike. However, gorillazord smashed the hover device from under him. Rhinozord slammed the spy over the edge of the island, sending him to his death. <br>\r\n The next morning, you walked downtown to start your job as a cafe cashier. You don't wanna screw your first day. You turn a corner, and see a bunch of grey creatures! One points at you and you run, you ran straight home. You look out and see them following, its like they knew who you where. 'What is happening', you think. Then suddenly the power rangers started fighting the grey things, out of nowhere!<br>\r\n But what's got you, is one ranger is guiding a women in a white dress and flowery crown towards your house. After they are out of view, you hear your doorbell. You answer and find the ranger, standing at your door. You let him into your house, along with the woman who was holding a box. <br>\r\n The woman tells you, she is a princess who helps the rangers. She says also that, she knows who you are just like the grey creatures. She says you were chosen, to do a special mission. You ask her what it is, why were you chosen and chosen b who?<br>\r\n She smiles sweetly at you. \"Well...</span></div></div>",
            "created":1433394000,
            "id":1987743,
            "title":"A new ranger?"
        },
        "15311":{
            "author_id":"brevination",
            "author_name":"Brevination",
            "choices":[
                "different view for now",
                "waking up"
            ],
            "content":"<div class=\"\"><div> <span> \"No way, you have the wrong guy. I'm just a cashier for a coffee house, I have almost no skills that qualify me as a ranger. I mean sure, I've got a black belt in karate. But I can't take on such a responsibility, not without thinking first. I gotta go to work now\", you told them. The princess was concerned, this was not what she had expected to happen. She left the morpher with a note, on your living room coffee table. \"He will come around\", she said calmly. <br>\r\n \"Princess, is it not strange that we fought no giant monsters today? What aim did those goons have?\", asked the red ranger, Cole. The princess simply continued to watch the sacred water, obviously she was troubled. After everyone left, Cole and the princess had been left alone. Cole was bored, he wanted to train. But he also was, worried for the princess and what upsets her. Eventually the princess turned to Cole, she decided to gain his aid. <br>\r\n \"Cole, I think I could use your help. There is an urgent matter, I need you to help me\", the princess said to Cole. \"Then how can I refuse? What do you need of me princess?\", Cole asked kindly. \"I need you to watch this boy for me . Its very important, the orgs want to harm him.\" The princess showed Cole the image of you, you were working briskly at the shop. \"I don't understand, he seems so normal.\" \"Looks are deceiving Cole, keep an eye on him whenever possible.\" \"Yes princess, as you wish.\" <br>\r\n You meanwhile, had an excellent first day at work. When you got home, you saw a note on the table. It said, 'if you change your mind the morpher will guide you.' You picked up the morpher. When you did, you heard what seemed like a voice. You reached out to hear it, and you saw bright lights. \"I am the deerzord\", said the voice. \"I must guide you, to find the four crystals of four missing zords.\"<br>\r\n You left your house, to track down the first crystal: boar. Cole followed you, but lost you at a fork in the road just out of town. He picked the wrong road, as you went to dead oak tree that had a  heart shape. You smashed it with your morpher, and reached to pull out a crystal. <br>\r\n Cole was freaking out, he backtracked a mile and saw you running to the river. He followed you, but you had already gotten the crystal for hippopotamus by sticking both hands in the river. But Cole was following orders to keep an eye on you, so he kept running after you. You made a stop, at an abandoned animal nest and pulled your morpher and a light shone from inside the nest. You reached in and a spiritual raccoon, gave you the crystal and a thumbs up. <br>\r\n Cole followed you still, he was wondering what all the running was for. But you were taking a break from running, to climb the tallest tree in turtle cove! Cole reached the clearing the tree was in, after losing track of you again. He decided to climb the tree to look for you, just as you reached the top to see an owl shrine. When you grabbed the crystal, the shrine vanished. You started back down, Cole scrambled down when he saw you to stay out of sight.<br>\r\n The deerzord told you to take the crystals, and go to a cave at the top of a cliff. There, he said the zords would channel their share of power into the morpher. Cole was exhausted, he called the princess and told her how tired he was getting from chasing you all over turtle cove. The princess told him to come back, and get some rest. <br>\r\n Cole passed out in his bed, and the four other rangers asked the princess what he had done.The princess said, Cole was on an important observation mission for her. The rangers asked what it was, but got no answer.<br>\r\n You found the cave around midnight, you went inside to finish what you started. \"Place the crystals in the four corners, of the chamber\", deerzord said. You followed his instructions, then waited for the next step. Deerzord said to recite a spell, that would transfer the shares of power, and allow the four zords to awaken on the anamarium. \"Ancient rangers! The test of the lost four is done, let the light shine on my source of power! Let me walk, in the footsteps of those who came before me!\", you shouted. <br>\r\n On the anamarium, the princess saw the 4 lost zords appear. She looked to the deerzord, who nodded to her in confirming. Back in the chamber, 4 white lights flew into your morpher which began to shine brightly. \"Good, now you simply must morph, and your are an official ranger. But be warned, if you finish the ritual there is no going back,\", deerzord said to you.<br>\r\n \"I came this far, I'm finishing what I started! GOLDEN ACCESS!\", you shout. On the annimaruim, the princess was walking by the sacred water. Suddenly, a flash of golden light came from the water! The princess knew what was happening, she called and yelled for Merrick and Cole. \"Boys, the gold ranger is ready, go find him!\",  the princess said as the two ran out. But Cole didn't understand what, this was about, what gold ranger?<br>\r\n Meanwhile after you triggered your morpher, things got real trippy. You saw hundreds of glowing animals, running right at you! But each one dissapeared in a flash of golden light, just as they are about to make impact. You meanwhile, had started feeling excruciating pain. It felt like, a mysterious force was trying to explode inside you! Your skin was burning and sizzling, like you were being cooked alive! <br>\r\n A bright light had appeared after you triggered the morphing sequence, but you didn't see it. The light flared through the whole cave, it charged into the sky like a shining pillar. It glowed so brightly it was like a sun, making midnight shine like it was noon. Everyone in turtle cove was awakened by this light, they looked at it in awe. Many were taking video footage or taking photos of the event. Animals, whether tamed or wild panicked. They panicked because the light was so bright, and continued to panic as it would not stop.<br>\r\n Merrick and Cole, looked in wonder at this amazing pillar of light. The princess, as well as the four other rangers had begun looking from the annimarium. The light was amazing, the princess was in wander, the four rangers asked wildly what was happening. Master org meanwhile, was observing the light from his lair. He sent goons out, to get a close look at the light. A small army of goons, about 40 had shone up just as Cole and Merrick were landing. <br>\r\n As soon as Cole and Merrick showed up, the goons were on the attack. Meanwhile, the pain, animals, and lights all stopped and faded. You made your way to the exit quietly. 'No turning back', you thought. Outside, the goons didn't see the light fade nor did Merrick or Cole. But everyone else did. You then stepped out, glowing just like the pillar. Everyone stopped to look at you, so an intro is needed. \"Angry boar! Golden ranger.... wild force!\", you shout. Then the goons charged, but you weren't running. You went in, charging like a mad beast. <br>\r\n Eventually all the goons were down or retreating, then Cole and Merrick approached you. \"So you're the one the princess had me watch right?\", Cole asked. You nodded, explaining that deerzord gave you the heads up. You all took off then, heading to the annimarium.<br>\r\n When you arrived, the four other rangers bombarded the lunar and red rangers with questions not seeing you apparently. The princess came out, and she did see you. Once the others did, they were in awe of your golden armor. After de-morphing, you explained your day to everyone. The black ranger commented, saying you had quite the day. You nodded, then passed out.</span></div></div>",
            "created":1433739600,
            "id":1989576,
            "title":"Brevins golden start"
        },
        "155":{
            "choices":[
                "original senario",
                "Mystic force ",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>more choices</span></div></span></div>",
            "created":1323925200,
            "id":1240130,
            "title":"Other"
        },
        "1551":{
            "choices":[
                "Left overs",
                "Original",
                "I clicked the wrong content."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wow some one actually picked this well more power to you.<br>\r\n<br>\r\nSo how should I tell this story well how about we use some of the Power Rangers that are left out or We can do something 100% Original?</span></div></span></div>",
            "created":1524718800,
            "id":2484716,
            "title":"original senario"
        },
        "15511":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Oh Kay",
                "Reading sux"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>*Marches in with a stack of Boom Studios power rangers comics, slams them on a spectral table*<br>\r\n<a rel=\"nofollow\" href=\"https://en.wikipedia.org/wiki/Power_Rangers_\" target=\"_blank\">https://en.wikipedia.org/wiki/Power_Rang...</a>(Boom!_Studios)<br>\r\nREAD NIGGA, READ</span></div></span></div>",
            "created":1597857660,
            "id":2887998,
            "title":"BOOM"
        },
        "15512":{
            "author_id":"matisse",
            "author_name":"Matisse",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you're going with a brand-spanking new group of Rangers. <br>\r\nFirst of all, are you a boy or a girl?</span></div></span></div>",
            "created":1604340360,
            "id":2933294,
            "title":"Original"
        },
        "155122":{
            "author_id":"matisse",
            "author_name":"Matisse",
            "choices":[
                "Storyline 1",
                "Other Storylines"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your story will start here.<br>\r\nDo you want to follow the first storyline or not?</span></div></span></div>",
            "created":1604340420,
            "id":2933295,
            "title":"Girl"
        },
        "1551221":{
            "author_id":"matisse",
            "author_name":"Matisse",
            "choices":[
                "Miss Winters was waiting for you",
                "You were attacked!"
            ],
            "content":"<div class=\"\"><div> <span>Your name was Susan, a 17-years-old girl with nothing unusual that made you different from your teenage fellows. You were quite tall and slim, with long blonde hair and deep and wide green eyes. You were wearing a shirt with long sleeves and a long skirt.<br>\r\nYou were going to school with your backpack on your back, keeping a calm pace. As you reached the school gates, you saw another girl shaking her hand in your direction, screaming loud “Susan! Susan! I’m here!”<br>\r\nSighing, you reached the girl and said “Astrid, do you always have to shout?”<br>\r\nAstrid was your best friend. She was tall and slim too, but with short hair black as the wings of a raven. Her small eyes were light blue, and she was dressed like your polar opposite: she was in fact wearing a shirt that left her navel fully exposed and didn’t even conceal much her boson, leaving a perfect balance of what was in sight and what was left to imagination. She was also wearing a pair of perfectly adherent pair of pants.<br>\r\n“Of course I have to!” Astrid replied, always loud, warping your shoulder with her arm “Without me, no one at school would even know you exist!”<br>\r\nYou sighed again, and simply said “Maybe we should go inside before getting late for attendance.”<br>\r\nAstrid nodded, and you two girls went inside the school.<br>\r\nOnce inside, you two reached the classroom, where the history teacher, Miss Winters, was registering attendances.<br>\r\nMiss Sephora Winters was the strictest teacher at the entire school. She was an incredibly tall (6,5 ft) and in shape woman, with blonde hair tied in a long ponytail. Her inquisitorial grey eyes, not concealed at all behind her big round glasses, were able to make even the toughest guys at school tremble. You remembered that once she stared at a bully so intensely that he wetted himself. She was always elegant, and was always carrying a long wooden ruler that she used as a pointer. While that wasn’t so unusual for a teacher, in her case it was frightening. Corporal punishment was not a thing in your school, but better be safe than sorry.<br>\r\nYou signed your attendance, and the eyes of the teacher got stuck on you.<br>\r\n“Good morning, Miss Winters.” you sheepishly said, feeling unease under that dreadful stare.<br>\r\n“Susan Evans. Good morning.” the teacher replied, before moving her stare to the other girl “And of course Astrid Willow. Energetic as usual, I see.”<br>\r\nAstrid nodded, but diverted her eyes from the ones of the teacher. Despite her strong will, even her couldn’t stand that.<br>\r\nAstrid signed attendance too, and you both sat at your desks to listen to Miss Winters lesson.<br>\r\nAfter it was over, you two begun to move toward the exit of the classroom, but the teacher stopped you: “Miss Evans, Miss Willow. Could you wait a moment, please? I have to tell you something.”<br>\r\nYou and Astrid both froze in place, fearing that the teacher wanted to scold you for something, and slowly turned toward her.<br>\r\n“Yes, Miss Winters? How can we help you?” Astrid asked.<br>\r\nSephora looked at you, and said “I need you two to do a special assignment. You will meet me after school in this classroom.”<br>\r\n“Just the two of us?” you asked, without stopping to look at your shoes.<br>\r\n“No, Richard will be with you too.” Miss Winters replied.<br>\r\nRichard was a boy in your class. Everyone knew he was Miss Winters’ favorite student, a true teacher’s pet. Astrid couldn’t stand him, but you had a different opinion. Sure, you wouldn’t have called him a friend, but you liked his kindness.<br>\r\n“What kind of assignment are we talking about?” Astrid asked.<br>\r\nSephora replied with a question “Are you familiar with Norse mythology, girls?”<br>\r\nYou and Astrid shook your heads, and the teacher said “That will be the theme of the assignment. Now you’re free to go.”<br>\r\nKnowing that ask for more after been dismissed by Miss Winters was useless, you two said your goodbyes to her and leaved.<br>\r\n“Norse mythology?” you said, once alone with your friend “What is she thinking?”<br>\r\n“I guess we’ll find out after school.” Astrid replied, moving toward the next class “I don’t look forward to work with Richard, though.”<br>\r\n“You really don’t stand him.”<br>\r\n“Yeah. You know me. I can’t stand teacher’s pet. It’s stronger than me.”<br>\r\nYou girls spent the morning together, taking classes. It was a quite a normal and uneventful day. Once that school was over, you and Astrid went back to Miss Winters classroom. Outside of it, right in front of the door, Richard was standing like a statue.<br>\r\nHe was a quite tall guy, with short brown hair. Despite his thick and small glasses, it was impossible to not notice his eyes: one was deep green, the other brown like a chestnut. He was wearing a simple white t-short and a pair of black trousers.<br>\r\n“Hi Richard.” you approached him “How are you doing?”<br>\r\nRichard looked back at you, like noticing you just as you spoke, and replied with a friendly yet almost formal tone “Can’t complain. Nice to meet you, Susan.”<br>\r\nAstrid approached him too, and with her coldest tone she simply said “Richard.”<br>\r\nThe guy looked at her, and replied in the same tone as before “Nice to meet you too, Astrid.”<br>\r\n“Do you have any idea about this assignment?” you asked him, preventing Astrid to add anything.<br>\r\nRichard shook his head, and said “No, Miss Winters simply said that she needed me to work with you two and to meet her after school in this classroom. I only know it’s something about Norse mythology.”<br>\r\n“Is she inside?” you asked.<br>\r\n“She is not arrived yet, which is indeed quite strange. Miss Winters is always on time.” Richard said.<br>\r\n“Well, we’ll wait inside sitting on the chairs.” Astrid said, moving toward the door.<br>\r\n“We can’t enter before the teacher arrives.” Richard calmly said.<br>\r\n“Yeah? Try to stop me.” she replied in a defiant tone.<br>\r\nThe girl passed the boy and entered in the classroom.<br>\r\n“Astrid, are you deaf?” Richard said, following her inside.<br>\r\nYou sighed and entered in the classroom too.<br>\r\nInside, Astrid sat on a chair with her feet over the desk, with the only objective to irritate Richard. The boy, for his part, begun a very boring tirade about how one should always respect the decorum of the school.<br>\r\nYou, instead, decided to look around. And saw a paper folded over the teacher’s desk. Curious, you reached it and opened the paper, reading it.<br>\r\nIt was Miss Winters handwriting.<br>\r\n“Guys, look at this.” you said, catching the attention of the other two.<br>\r\nRichard reached you and gently took the note from your hands, reading it loud: “Guys, I’m sorry but I had an inconvenience. Please, reach me in the school cafeteria. Miss Sephora Winters.”<br>\r\n“See, smarty-pants?” Astrid immediately pressed “If we had just waited outside we would have been waiting forever.”<br>\r\n“I admit it.” Richard said “But this is quite strange. Miss Winters is behaving quite strangely today.”<br>\r\n“So, we go to the cafeteria?” you asked.<br>\r\nRichard nodded, and replied “I’ll lead the way. Follow me, girls.”<br>\r\nAstrid sprang to her feet like a spring, saying “I know the way, thank you.”<br>\r\nAnd with those words she leaved the class.<br>\r\nYou and Richard followed her, and together you finally reached the cafeteria.<br>\r\nIn the cafeteria...</span></div></div>",
            "created":1604340480,
            "id":2933296,
            "title":"An ordinary day"
        },
        "15512212":{
            "author_id":"matisse",
            "author_name":"Matisse",
            "choices":[
                "Astrid",
                "Richard"
            ],
            "content":"<div class=\"\"><div> <span>Once in the cafeteria, you noticed that it was completely deserted. Not only there were no students or staff, but Miss Winters was nowhere to be found.<br>\r\n“This is quite unusual.” Richard said, touching his shaved chin “The cafeteria shouldn’t be empty at this hour. It’s too soon for the students, but the staff should be present. And where is Miss Winters?”<br>\r\n“Yeah, this is not normal.” you agreed “What’s happening today?”<br>\r\nBut while the three of you were still thinking about it, the doors of the cafeteria opened with a slam, and five figures entered in it.<br>\r\nThey were not humans, that was sure. Not only they were identical to each other, but their skin was not normal. It was blue, like if made of translucent ice. They had no hair, with two horns that protruded from their heads, and their eyes were red as burning flames. They were tall and muscular, and were wearing futuristic black armors. Each of them was holding in hand a sword and a shield.<br>\r\n“What are those?” you exclaimed, frightened.<br>\r\n“I don’t know.” Richard replied, trying to maintain his composure despite the fear in his heart “But they don’t look friendly.” <br>\r\nAstrid took a step forward and collecting all of her courage exclaimed “Whatever you are, stay away from us!”<br>\r\nThe five individuals didn’t respond, and slowly begun to move toward them.<br>\r\n“They come!” you yelled “What should we do?”<br>\r\nAstrid replied with action: she jumped forward and with all her strength pumped up by the adrenaline she threw a punch right into one of the monsters’ face.<br>\r\nThe creature took the blow and faltered, but just for an instant. He immediately reacted moving the shield in her direction in a rapid movement. Before he could hit her right on the face, however, Astrid was pulled back: Richard, with the movements worthy of a cat, had jumped forward and took her by the collar of her shirt, taking her away from the enemy’s attack.<br>\r\n“Thank you.” she mumbled, getting back on her feet.<br>\r\n“They are strong.” Richard said “I doubt we can beat them by force.”<br>\r\nYou took a step forward, and said “We must try, or we are done.”<br>\r\nAs you were about to try everything on a desperate struggle in a battle of survival against foes of unknown origin, a familiar figure entered in the cafeteria. With a rapid movement and parkour moves, the figure in question went beyond the monsters and positioned itself in your defense.<br>\r\nYou and both of the other were astonished in seeing Miss Winters, that pointed her wooden ruler at the monsters and said with a confident tone of voice “If you dare to threaten my pupils, you will get permanent detention.”<br>\r\nUnafraid, the five monster begun to move toward here.<br>\r\n“Miss Winters, we must find a way out of here.” Richard said.<br>\r\n“The way out is right in front of us.” she simply responded.<br>\r\nWith those word, Sephora twirled the ruler in her hand. Once done, the wooden ruler was no more: the teacher was instead holding a Viking large sword with runic inscription all over the hilt.<br>\r\nWithout even a second of hesitation, Miss Winters ran against the opponents. Swinging her sword in what looked like a mortal dance, the teacher struck all of the enemies down, one by one. As each of them reached the ground, mortal wounded, he melted down like ice exposed to the sun, disappearing forever.<br>\r\n“Bad boys must be punished.” the teacher commented as the sword reverted back to the ruler form, then she turned back toward her amazed students “I know you have a lot of questions, but we don’t have time right now. Follow me.”<br>\r\n“Yes, Miss Winters. We’re coming.” Richard immediately responded.<br>\r\n“What? Are you serious?” Astrid yelled “We’re following her like this after what we just saw?”<br>\r\n“She’s Miss Winters.” Richard calmly said “I’m sure she know exactly what to do.”<br>\r\nYou looked around, and decided to support…</span></div></div>",
            "created":1604340540,
            "id":2933297,
            "title":"Mysterious foes"
        },
        "155122122":{
            "author_id":"matisse",
            "author_name":"Matisse",
            "choices":[
                "To the test",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>You looked around, and decided to support Richard.<br>\r\n“Astrid, I want answers too… but I think we should simply trust her right now.” you said.<br>\r\nAstrid opened her mouth to speak again, but then closed it, deciding to trust her friend. She nodded, and moved next to Richard.<br>\r\nMiss Winters led the way, taking the group in the back of the cafeteria, in the kitchens.<br>\r\nShe reached a coffee dispenser and pressed the buttons on the display in a precise combination. With a thud, the dispenser begun to enter in the wall and slide on the side, revealing a secret passage: stairs descending in a dark corridor, the steps disappearing into the shadows.<br>\r\n“What the f…” Astrid begun to say, but Miss Winters interrupted her.<br>\r\n“Don’t’ your dare cursing, young lady. You’re still in school in the presence of a teacher.” she scolded.<br>\r\nThe girl closed her mouth, and didn’t complete her sentence.<br>\r\nMiss Winters moved her feet over the stairs, and begun to descend into the darkness. Without hesitation, Richard followed along, putting all of his trust in his favorite teacher. You and Astrid looked at each other, and you nodded. You descended the stairs, followed by her your friend.<br>\r\nThe descent was quite long, and you begun to nervously bite your lips. The entire situation was odd. You were attacked by mysterious monsters and were following a teacher in a secret passage at school. If someone would have told you in advance you would have surely laughed it off. But it was all true.<br>\r\nThe stairs finally ended, and you and the others found yourself in what looked like a underground laboratory. Monitors and shelves with strange cruets over them were all over the walls. The ceiling was decorated with ancient runes of the Norse lore, while the floor was painted with three colors that divided the room into three segments: red, blue and white.<br>\r\nThe teacher reached a chair and sat over it. She took a deep breath, and looking at her pupils she said “You have a lot of questions. But are you ready to get the answers?”<br>\r\nRichard looked at her and simply said “If you evaluate me as ready, Miss Winters, then I am.”<br>\r\n“What a licker.” Astrid commented, whispering in your hear.<br>\r\nYou decided to ignore her, and said to the teacher “I think we are. Can you explain us what’s happening?”<br>\r\nSephora nodded, and explained “Let’s start from the beginning. Once, long ago, an evildoer rose and threatened our planet. Luckily, a group of young heroes stopped him an exiled him with his armies in the outer space. His name was Hrymr. After his defeat, it was prophesized that one day he will return. So a secret society was formed, to choose the young heroes that will stop him once again. I am the last living member of the society, direct descendant of our founder. I am Miss Sephora Winters, Warden of the Earth.”<br>\r\n“I know you were exceptional.” Richard said with a strong admiration in his voice and his eyes, making Astrid sigh.<br>\r\n“So… those creature we fought were part of Hrymr army?” you asked.<br>\r\nSephora nodded, saying “Those are Hrymr foot soldiers, the Children of Jötunheimr. The lowest ranking warriors of his army.”<br>\r\n“Miss Winters, can we come to the point?” Astrid intervened “Are we the new generation of heroes?”<br>\r\nSephora grinned, and replied “Maybe. Or maybe not. I selected you three… but will you be worth of this honor?”<br>\r\nYou looked at each other, and you decided to say “Are you going to test us?”<br>\r\nThe teacher said “Yes. But I must be sure that you really want it. The task of being heroes is not an easy one.”<br>\r\nAstrid took a step forward, and proudly announced “I always wanted to be a hero! I’ll gladly take your test!”<br>\r\nRichard moved forward too, and said in his calm tone “Miss Winters, I will be honored to fulfill your expectations toward me.”<br>\r\nYou hesitated, but then flanked the others and said “I am in. I want to try to become a heroine.”<br>\r\nThe teacher smiled, and took out a wooden box decorated with runes. She opened it, and inside you saw three stones, each one with an ancient rune inscribed in it. But the runes on the stones, differently from all the other runes you saw that day, were not mere symbols: they were made of pure light that emitted a warm glow.<br>\r\n“These are the Ancient Runes that will permit you to take power from the Morphing Grid, the multiversal energy field where all heroes takes power from.” she explained “You have yet to pass the test to make it official… but from this moment forward… you are the Iron Viking Rangers.”</span></div></div>",
            "created":1604340600,
            "id":2933298,
            "title":"Truths revelaed"
        },
        "1553":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "operation overdrive",
                "spd",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe these</span></div></span></div>",
            "created":1363237200,
            "id":1550118,
            "title":"even more choices"
        },
        "15531":{
            "author_id":"moomoocow343",
            "author_name":"AuraJolteon6235",
            "choices":[
                "Replace an old ranger",
                "New ranger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you substitute for one of the original cast or are you a new ranger?</span></div></span></div>",
            "created":1453006800,
            "id":2090609,
            "title":"operation overdrive"
        },
        "15532":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "At SPD headquarters",
                "Somewhere in Newtech city"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OK, so where will this story start.  </span></div></span></div>",
            "created":1382331600,
            "id":1682454,
            "title":"spd"
        },
        "15533":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "light speed rescue",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>two more seasons left</span></div></span></div>",
            "created":1363237200,
            "id":1550119,
            "title":"even more 2"
        },
        "155332":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "dino thunder",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe 3 more</span></div></span></div>",
            "created":1363237200,
            "id":1550120,
            "title":"more 3"
        },
        "1553321":{
            "choices":[
                "Divided We Fall!",
                "United We Stand!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So What's your story going to be?<br>\r\n<br>\r\nWould you like to do a story that in separate or connected</span></div></span></div>",
            "created":1524718800,
            "id":2484637,
            "title":"dino thunder"
        },
        "15533211":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Brainwashed ",
                "With Rangers"
            ],
            "content":"<div class=\"\"><div> <span>Since you chose the loner option, I’ve prepared an OC for you. Hope you like him!<br>\r\n———————<br>\r\n“Dino Thunder, Power Up!”<br>\r\n“Carno Power!”<br>\r\n“Super Dino Mode!”<br>\r\n“Double Dino Mode!”<br>\r\nName: Issac Banner<br>\r\nAge: 28<br>\r\nProfession: archeologist, extra jobs wherever, Power Ranger<br>\r\nOutfit: Wears a blue shirt under a rugged and big greyish-purple arctic jacket, grey long pants, black work boots with purple accents, and the Silver Dino Gem in a Dino Bracelet on his wrist.<br>\r\nPower: He can freeze whatever he touches, through his soles or his palms.<br>\r\nRanger Form: Navy Dino Ranger/Dino Thunder Navy Ranger. His dinosaur motif is the Carnosaurus, and his suit resembles Tommy’s Black Dino Ranger suit instead of the main three’s Dino Ranger Suits, despite his Morpher resembling the main trio’s.<br>\r\n                        -Super Dino Mode: He gains spikes coming from the triangles on his suit and is a lot fiercer.<br>\r\n                         -Mega Battle Armor: Double Dino Mode:  After gaining the Silver Dino Gem, he can combine it’s power with the Navy Dino Gem to become equiped with Silver Chasmodon-themed armor and a new weapon. It’s not exclusive to him, though: the other rangers are able to use it. It’s power is equal with the Triassic Ranger, but inferior to the Triassic Battlizer.<br>\r\nWeapons: -Chillmax Saber: The sidearm for the Navy Ranger is a wicked retool of the Thundermax Saber.<br>\r\n                 -Carno Blade: A large flat blade themed off the Carnozord, complete with a pommel shaped like it’s head.<br>\r\n                 -Chasmo Shield: A large shield of a similar design to the Tricera Shield, however the extending spike is replaced with twin shotgun barrels.<br>\r\nZord(s): Carnozord and Chasmozord. Made by Mesagog from the data and specs of the Tyranno and Tricera Zord, the two form a Best Match and a powerful Megazord.<br>\r\nPersonality: Respectable, hard-working, self-isolating, has a good just heart and isn’t afraid to get down and dirty. He’s a bit stingy with his money, though....<br>\r\nHistory: Issac has always strived to be a good archeologist, and he’s not afraid to do the right thing. One day on an arctic dig, he fell into a cavern where he discovered the Navy Dino Gem, which bonded with him. He spent some time learning how to control his ice powers and new Ranger form, before the news of Rangers and Monsters in Reefside brought his attention to the city, where hep landed to join the Rangers. However, Messagog’s forces intercepted him and he was captured and brainwashed, and given most of his new gear, and sent to destroy the Power Rangers. After many fierce fights, and him seizing another Dino Gem, the Battlized Triassic Ranger beats him and breaks the brainwashing, allowing him to redeem himself by fighting on the side of good as a powerful ally.<br>\r\n<br>\r\nReason for not joining the Rangers: He wanted to join the Rangers, but he was brainwashed by Messagog and forced to fight the Rangers for a while until he’s freed from Messagog’s control later on. He proves to be a powerful ally once he’s on the side of good. (in terms of footage, he would replace the White Ranger Clone(though the clone would have an apparence as a one episode thing later down the line).<br>\r\n———-<br>\r\nSo, will we start with him being brainwashed or him with the Rangers?</span></div></div>",
            "created":1598624580,
            "id":2893155,
            "title":"Carno Power!"
        },
        "15533212":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Ankylo Power!",
                "diffrent colour"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now we need to decide on a Ranger Colour.<br>\r\n<br>\r\nWould you like to be Orange?<br>\r\n<br>\r\n<span style=\"text-decoration:line-through\">strap in this is gonna be longotime</span></span></div></span></div>",
            "created":1598620560,
            "id":2893127,
            "title":"Colouring Your Suit, Part 1"
        },
        "1553322":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "rpm",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>2 more maybe</span></div></span></div>",
            "created":1363237200,
            "id":1550121,
            "title":"more 4"
        },
        "15533222":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "lost galaxy ",
                "even f-Ing more "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I feel like I'm missing one or two </span></div></span></div>",
            "created":1363237200,
            "id":1550126,
            "title":"more 4? 5? I don't even know anymore damn it!!"
        },
        "155332222":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "umm jungle fury",
                "I know there are more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>damn it damn it damn it</span></div></span></div>",
            "created":1363237200,
            "id":1550129,
            "title":"even f-Ing more {e:cry} uhh"
        },
        "1553322221":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Rangers Together!",
                "I work alone."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We gonna join the team or act separately?</span></div></span></div>",
            "created":1598620080,
            "id":2893123,
            "title":"umm jungle fury"
        },
        "1553322222":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "mega force",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm leaving a space for future seasons</span></div></span></div>",
            "created":1363237200,
            "id":1550300,
            "title":"I know there are more damn it uh lazy author"
        },
        "15533222222":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "time force",
                "future seasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I forgot time force</span></div></span></div>",
            "created":1378616400,
            "id":1659715,
            "title":"oh crap"
        },
        "155332222222":{
            "choices":[
                "super mega",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about this one</span></div></span></div>",
            "created":1450760400,
            "id":2078174,
            "title":"future seasons"
        },
        "1553322222221":{
            "choices":[
                "troy the red ranger",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which ranger will you be</span></div></span></div>",
            "created":1450760400,
            "id":2078175,
            "title":"super mega"
        },
        "1553322222222":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "Dino Charge and Dino Supercharge",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> just when I thought I was out they dragged me back in </span></div></span></div>",
            "created":1508562000,
            "id":2404322,
            "title":" and thus I return once more "
        },
        "15533222222222":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "Ninja Steel",
                "ok there's one more for now"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> I think it was ninja steel or something</span></div></span></div>",
            "created":1508562000,
            "id":2404331,
            "title":"oh Christ what was the name of the new season?"
        },
        "155332222222222":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "The 2017 Power Rangers movie ",
                "whatever comes next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> The new Power Rangers movie </span></div></span></div>",
            "created":1508562000,
            "id":2404333,
            "title":"and of course let's not forget "
        },
        "1553322222222222":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "Super Ninja Steel",
                "Beast Morphers",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>seriously i'm beginning to think this will never end </span></div></span></div>",
            "created":1539234000,
            "id":2562602,
            "title":"And thus once more I gaze into the abyss"
        },
        "15533222222222223":{
            "author_id":"technodude459",
            "author_name":"predator rocks",
            "choices":[
                "Gokaiger",
                "more Super Sentai",
                "more Power Rangers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the Japanese origin of Power Rangers Super Sentai I personally recommend Gokaiger</span></div></span></div>",
            "created":1539277200,
            "id":2562609,
            "title":"I can't believe I didn't think of this earlier"
        },
        "155332222222222232":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Lupin VS Pat",
                "Another one,"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OH Boi, here we go.<br>\r\nI, personally, recommended LupinRanger VS Patoranger. It hasn’t been adapted yet, and I don’t think it will be, tbh. </span></div></span></div>",
            "created":1597849500,
            "id":2887968,
            "title":"This abyss will be deep."
        }
    },
    "info":{
        "author_id":"kkduser100",
        "author_name":"Raging Demon",
        "brief_description":"You are a Power Ranger! Choose and create your own destiny!",
        "created":1321746300,
        "description":"<td align=\"left\" class=\"norm\">You are a Power Ranger, enough said. Pretty much anything goes. Don't end the story early, don't kill the main character, and no M/M stuff. Have fun and add please. </td>",
        "id":1827121,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604340600,
        "modified":1604340600,
        "pretty_title":"You're A Power Ranger!"
    }
}