{
    "chapters":{
        "1":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Anime/Manga",
                "Cartoons",
                "Video Games",
                "Movies",
                "More choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Headmistress is ready to teach some students! Though now the question is, where does she get her students from?</span></div></span></div>",
            "created":1483851600,
            "id":2260967,
            "title":"Welcome to the Kinky Academy!"
        },
        "11":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Dragonball Z",
                "Sailor Moon",
                "Neon Genesis Evangelion",
                "Ranma 1/2",
                "More choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's start off with some classics.</span></div></span></div>",
            "created":1483851600,
            "id":2260973,
            "title":"Anime/Manga"
        },
        "111":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Male Characters",
                "Female Characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Dragonball Z universe has a lot of characters. So let's narrow down character options a bit by picking whether you'd like to focus on male or female characters.</span></div></span></div>",
            "created":1483938000,
            "id":2261291,
            "title":"Dragonball Z"
        },
        "1111":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Goku ",
                "Krillen ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Goku or Krillen </span></div></span></div>",
            "created":1535000400,
            "id":2537629,
            "title":"Male Characters"
        },
        "11111":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Become a sissy ",
                "Something Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does Goku take how about become a sissy </span></div></span></div>",
            "created":1535000400,
            "id":2537682,
            "title":"Goku "
        },
        "11112":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Submission 101",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Class does Krillen take how about Submission 101</span></div></span></div>",
            "created":1535000400,
            "id":2537683,
            "title":"Krillen "
        },
        "1112":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "Bulma",
                "Chichi",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose the lucky lady?<br>\r\n<br>\r\nBulma <br>\r\n<br>\r\nChichi<br>\r\n<br>\r\nmore?</span></div></span></div>",
            "created":1487566800,
            "id":2279934,
            "title":"Female Characters"
        },
        "11121":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "wg home ec",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does Bulma take?<br>\r\n<br>\r\nWeight home ec?</span></div></span></div>",
            "created":1487566800,
            "id":2279935,
            "title":"Bulma"
        },
        "111211":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Bulma is placed in wg home ec",
                "Bulma's introduction to home ec"
            ],
            "content":"<div class=\"\"><div> <span>Bulma opened her eyes feeling dazed. She found herself in a principal's office, sitting in a chair with her hands tied behind her back.<br>\r\n<br>\r\n\"Ah welcome Ms Bulma.\" greeted a busty woman in a uniform.<br>\r\n<br>\r\n\"W-wha- whats going on here! Where am I?\" Bulma demanded.<br>\r\n<br>\r\n\"Why you've been enrolled in my academy, Kinky Academy which specializes in molding subjects into the ideal image of a certain fetish. And I'm Headmistress XXX.\" XXX introduced herself.<br>\r\n<br>\r\nBulma studied this headmistress, she had long hair down to her knees, a huge bust which she flaunted with a long deep cleavage, smooth skin, a beautiful face but sported a somewhat deviant smile. The headmistress was dressed in what looked like a nazi style uniform with a arm band bearing the academy's insignia. Her skirt was fairly short leaving her attractive legs exposed. <br>\r\n<br>\r\n\"What do you mean molding subjects into ideal images of fetishes?\" asked an infuriated Bulma.<br>\r\n<br>\r\n\"Oh why we specialize in everything from submission to corruption classes even classes that transform students. We have special machines and hire prodigious experts that can do anything, afterall we have a 100% graduation rate.\" XXX proudly said.<br>\r\n<br>\r\n\"No way am I gonna become someone's fetish toy! I'll leave!\" Yelled a livid Bulma.<br>\r\n<br>\r\nXXX chuckled \"Oh how amusing, it never gets old. Everyone says that and they try to escape but we always catch them and continue the programming. Hahahaha\" she laughed. \"Anyway let's get you started.\"<br>\r\n<br>\r\n\"So what fetish do I have to learn.\" Bulma mocked.<br>\r\n<br>\r\n\"Defiant aren't we? Now let's get you to class which is...\"XXX said looking at her clipboard \"Weight gain home Ec.\"<br>\r\n<br>\r\n\"Weight gain home Ec?!\" Bulma yelled.<br>\r\n<br>\r\n\"Yes you'll be fattened up into a bbw than you'll be sent to weight gain home ec 2 to become a ssbbw.\" smiled the headmistress.<br>\r\n<br>\r\n\"What no way am I becoming fat. No way in hell...\"Bulma screamed as she was drug off.<br>\r\n<br>\r\n\"Heh heh I love my job.\" chuckled the licentious headmistress XXX.<br>\r\n<br>\r\n</span></div></div>",
            "created":1492837200,
            "id":2308972,
            "title":"wg home ec"
        },
        "1112111":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "a bunch of girls",
                "some girls from other animes"
            ],
            "content":"<div class=\"\"><div> <span>\"Let go of me!\" yelled Bulma as she was hauled off by the staff.<br>\r\n<br>\r\n\"If you think I'm just gonna let you fatten me up, you've got another thing coming buddy!\" threatened the fiery blue haired girl.<br>\r\n<br>\r\nBulma is brought to the classroom with a sign above it saying 'Weight gain Home Ec 1.' The door opens and Bulma is tossed in. Before Bulma could get up the door immediately shuts close and is unable to be opened.<br>\r\n<br>\r\n\"Great just great!\" Bulma growled. <br>\r\n<br>\r\nBulma than looked around studying her surroundings. The room had desks with contraptions attached to it, and numerous machines with tubes hanging from them. At least the room looked comfortable. <br>\r\n<br>\r\n\"Hmm I don't see a way to escape for now.\" Bulma muttered \"So I guess I'll just have to sit through this dumb class for now. But no way am I going to turn into a fat blob.\" <br>\r\n<br>\r\nBulma than noticed her fellow classmates which consisted of....</span></div></div>",
            "created":1492837200,
            "id":2308978,
            "title":"Bulma is placed in wg home ec"
        },
        "11121111":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "a tv monitor appears",
                "machines restrain the girls"
            ],
            "content":"<div class=\"\"><div> <span>\"So were you all dragged here against your will too?\" Bulma asked.<br>\r\n<br>\r\n\"Yes none of us have any memory of what happened.\" informed a distraught girl.<br>\r\n<br>\r\n\"Yeah we all woke up in the headmistress's office and she told us that we were new enrollments.\" added another girl.<br>\r\n<br>\r\n\"She said that we were sent here to fulfill a fetish and that we're going to home ec to become fat.\" spoke another concerned lass.<br>\r\n<br>\r\n\"We're not really going to get fat? Right? I mean that can't do that!\"<br>\r\n<br>\r\n\"Well I know I'm sure not. I mean I have such a perfect body, no way am I gonna let some kinky school ruin it for some pervert.\" Bulma said displaying her resolve.<br>\r\n<br>\r\nThe other girls found strength and shared her resolve. As the girls regained some assertiveness the door opened unveiling the teacher. In walked in a 300 pound woman dressed in a uniform similar to that of headmistress XXX worn in a manner more suitable for her 300 pound frame. Like the headmistress she proudly displayed ample cleavage. But she also had a fat belly hung from underneath her shirt, her arm band was snug around her fluffy arms. The woman heavily strode to the front of the class.<br>\r\n<br>\r\n\"Ahem welcome to Weight Gain Home Ec, I am Ms Filler and I will be the one who molds you into a FA's ideal woman.\" Ms Filler announced with a satisfied smile.<br>\r\n<br>\r\n\"Hey listen up lady, there is no way you're gonna turn us into fatties!\" barked Bulma.<br>\r\n<br>\r\n\"Oh how I love the first day!\" stated Ms Filler \"Always so recalcitrant.\" she said taking out a remote a flipping a switch.<br>\r\n<br>\r\nSuddenly...<br>\r\n<br>\r\n</span></div></div>",
            "created":1492923600,
            "id":2309592,
            "title":"a bunch of girls"
        },
        "111211111":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "tries to escape",
                "enters her dorm"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly a tv monitor lowers from the ceiling and a film initiates.<br>\r\n<br>\r\n\"Just sit back and watch ladies.\" Ms Filler said taking a seat herself.<br>\r\n<br>\r\n\"Hmmph!\" Bulma grumbled taking a seat which was surprisingly comfy.<br>\r\n<br>\r\nThe the video played and images of delicious sweets were shown followed by mouth watering meats. The girls eyes were constantly barraged by images of sumptuous foods meanwhile Ms Filler was spraying an aroma throughout the room which would stir up the girls' appetites. GROWLLL The girls' stomachs were now famished. <br>\r\n<br>\r\n\"Oh man I'm getting hungry.\" muttered Bulma unable to look away from the enticing screen. <br>\r\n<br>\r\nMs Filler than shut off the tv monitor \"Okay it looks like you girls are more in the mood for home ec so let's begin by learning how to bake a special ingredient high calorie deluxe cake.\" she said leading the willing class to a kitchen classroom. <br>\r\n<br>\r\n\"Fine, I'm only doing this cause I'm so hungry.\" grumbled Bulma.<br>\r\n<br>\r\nUpon entering the kitchen she was bombarded with posters encouraging obesity. Images of fat girls and foods graced the walls each subliminally promoting gaining weight. Bulma than went to her designated counter were she anxiously began her cake. Bulma only grew more voracious as she completed each step. Meanwhile Ms Filler played a soundtrack for the class as they cooked, a soundtrack that surreptitiously messaged the girls to eat and get fat. <br>\r\n                Eat  Don't be thin   Eat   You're so beautiful when you're fat   Thin is misery   Fat is love<br>\r\n \"Do they really think that that will work?\" Bulma said mixing her cake batter.<br>\r\nOnce they put their cakes in the oven, Ms Filler offered cookies to quell their hunger as they wait. From years of experience Ms Filler was fully assured that everyone would partake of the cookies. Bulma was no different in fact she had multiple servings.  At long last the cakes were ready  and no one possessed any restraint and immediately commenced consumption. <br>\r\n<br>\r\n\"God this is so good!\" Bulma said with a mouthful of cake \"Gasp I got to watch myself, I don't want to succumb to this academy. ..Buuuttt a little more cake won't hurt.\" <br>\r\n<br>\r\nGazing at the sight of the girls' portruding bellies, the teacher dismissed class and the girls went to their dorm. Then Ms Filler pulled out her phone and contacted the HeadmistressXXX.<br>\r\n<br>\r\n\"Headmistress XXX, this is Ms Filler of Home Ec. Yes the first day went splendidly. Yes I'll teach them recipes while increasing their appetites. Soon the girls will constantly be baking to satisfy their unending hunger. Of course Headmistress I'll program them to love being fat and wanting to be fatter. Yes mm hmm well over and out.\" Ms Filler addressing the Headmistress.<br>\r\n<br>\r\nMeanwhile Bulma was walking down the hall, rubbing her bloated belly and... </span></div></div>",
            "created":1492923600,
            "id":2309601,
            "title":"a tv monitor appears"
        },
        "1112111111":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "the injections",
                "next day at home ec"
            ],
            "content":"<div class=\"\"><div> <span>Walking down the hall, Bulma realized that she was alone.<br>\r\n<br>\r\n\"Alright looks like the coast is clear, time to make my get away.\" Bulma muttered to herself.<br>\r\n<br>\r\nBulma sneaked through the hallways keeping scarce from all eyes.<br>\r\n<br>\r\n\"Huff huff this would be easy if it wasn't for my bloated gut.\" Bulma wheezed \"They underestimated me, guess they didn't realize that I was a genius. heh heh.\" Bulma snickered as she roamed the hallways which seemed bereft of security.<br>\r\n<br>\r\nHowever unbeknownst to Bulma she was being watched via security cameras monitored by the Headmistress herself. The headmistress observed her prey attempt to escape with glee knowing full well that she would fail. Gleefully watching as the escapee who filled with ignorant confidence made her attempt of liberation, the headmistress moaned in anticipation at the notion that the defiant student would be pulled back in place. The headmistress than watched Bulma try to climb through a window when she ordered her guards to capture her.<br>\r\n<br>\r\n\"Huff come on.\" Bulma said trying to heave her overstuffed body through a window before being suddenly beleaguered by guards.<br>\r\n<br>\r\n\"W-what? Oh come on! Why me?\" Bulma loudly pouted as her sluggish body was halfway through the window.<br>\r\n<br>\r\nThe guards seized their captive and brought her to Headmistress XXX's office for punishment.<br>\r\n<br>\r\n\"Let me go!\" Bulma demanded.<br>\r\n<br>\r\n\"Did you have fun on your first day, Ms Briefs?\" XXX inquired.<br>\r\n<br>\r\n\"Shut up! You better let me go, I've got some pretty tough friends you know and once they locate me they'll.\" <br>\r\n<br>\r\n\"They'll never find you unless we want them to Bulma.\" XXX interupted Bulma's threat. \"You see Kinky Academy has technology capable of anything, so kidnapping a girl and remaining hidden from the outside world is a piece of cake. Do you really think we could abduct beloved characters and transform them into living embodiments of fetishes without the best preparations?\" informed XXX.<br>\r\n<br>\r\nBulma still retained some confidence \"Ha my friends are stronger than you can imagine.\" Bulma boasted.<br>\r\n<br>\r\n\"And I'm more kinky than you realize. Now you're enrolled in Weight gain Home Ec, you will get fat and you will love it.\" assured XXX.<br>\r\n<br>\r\n\"That'll never happen!\" glared Bulma. <br>\r\n<br>\r\nXXX got behind Bulma and grabbed her belly.<br>\r\n<br>\r\n\"Do you know how many calories you lost during your little escapades? I think a suitable punishment would be for you to make up those calories, tenfold.\" XXX licked her lips.<br>\r\n<br>\r\n\"Are you gonna make me eat tons of food like earlier?\" barked the captive.<br>\r\n<br>\r\n\"Oh no this is a punishment, we're trying to make your appreciation of food exponentially grow, so we wouldn't want you to associate food with displeasure, in fact its our plan to make food one of your few pleasures in life.\" XXX explained.<br>\r\n<br>\r\n\"So what are you going to do?\" asked Bulma now becoming rather apprehensive of the situation.<br>\r\n<br>\r\nXXX cackled as she unveiled a vat of fat from liposuction patients. <br>\r\n<br>\r\n\"Wait please don't I'm rich I can get you anything please no!\" pleaded Bulma as she was strapped down as fat was injected into her.        </span></div></div>",
            "created":1493442000,
            "id":2312533,
            "title":"tries to escape"
        },
        "11121111112":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "round 3",
                "bulma resists"
            ],
            "content":"<div class=\"\"><div> <span>It was about time for class to start with the still thin girls chatting amongst each other, concerned about the oncoming class. \"Hey where's that green haired chick?\" asked a girl. \"Yeah that Bulma girl. She's about to be late.\" \"Yikes I wonder what Ms Filler would do to her.\" \"Even worse what about that diabolical Headmistress XXX.\" The girls clamored about until the door opened unveiling a much heavier Bulma. Her previously trim waist was now hanging from underneath her shirt with her boobs spilling atop. Her thighs now rubbed against each other as she drug her body into the class. The other girls could see her defeated countenance displaying her violation. 40 pounds of thick, jiggly fat was forcibly injected into Bulma as punishment of attempted escape. With her head and arms hanging low, Bulma took her seat, her ass slightly spilling over the sides. Her classmates could only shudder in horror, painfully knowing they'll all share the same fate.<br>\r\n<br>\r\nIn walked Ms Filler, confidently swaying her wide girth. \"Okay class today we'll be shaping our minds into that of gluttonous ladies.\" She stated while staff strapped shock collars onto the girls' necks. \"Ack What's this?!\" shrieked Bulma along with other fearful girls. \"Simply tools we'll use to ensure you'll correctly choose.\" Ms Filler said as food was carted in. \"Ahhh! No Way! EEEKKK!\" Shrieked a desparate girl attempting to flee. A guard swiftly grabbed her. The horrified girl frantically struggled but to no avail. \"I think she'll need to be punished.\" suggested Ms Filler. The guards than dragged the recalcitrant lass off, most likely to Headmistress XXX's office. Bulma could only sympathize with the shattered girl as she obediently allowed herself to be collared.<br>\r\n<br>\r\n\"Okay ladies this is what's going to happen you'll be offered two plates, obviously if you choose incorrectly you'll get shocked. You than must eat it completely, failure to completely eat it all will result in a stiff shock. Alright let's begin.\" Bulma sat back clutching her fat belly watching each girl sigh as she makes her choice. Occasionally a girl would get shocked and then begrudgingly carried off the other dish. Finally it was Bulma's turn. Approaching the table, Bulma saw her choices, a salad and a slice of pie with whipcream. \"sigh I guess you want me to take the pie.\" Bulma sighed taking the pie, returned to her desk eating it in its entirety. \"Okay now time for round 2.\" Ms Filler announced bringing out more dishes. Bulma watched on as events repeated itself until it was her turn again. This time it was a skinless chicken breast or a bucket of greasy fried chicken smothered in gravy. \"Oh you've got to be kidding me! I've got to eat all that?!\" an irritated Bulma whined again making the correct decision. Bulma consumed the contents of the bucket only to heard Ms Filler say \"Alright ladies on to round three. Come on we've got a full day ahead of us.\"<br>\r\n   </span></div></div>",
            "created":1495602000,
            "id":2324600,
            "title":"next day at home ec"
        },
        "111211111121":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "more rounds",
                "other lessons"
            ],
            "content":"<div class=\"\"><div> <span>\"All right ladies here comes your third serving.\" Ms Filler hummed signaling her students to take the next test. Bulma heard the girls in front of her whine as they reached the new choices, each girl gently sobs as she picked the correct food. Once Bulma got to the test she saw that her choices were a stalk of celery and...\"BUTTER! You mean I have to eat BUTTER!?\" Bulma yelled as she stared at a actual stick of butter sitting on a plate. \"No way am I eating a disgusting stick of but--ERROWW\" Ms Filler interrupted the rebellious girl with a nice shock. Bulma instantly lost her defiant resolve and obediantly picked the butter. \"Oh I'm already so fat and they keep forcing food on me. Wah, I'm gonna become a blimp!\" Bulma wailed staring at her butter. Bulma walked back to her desk preparing herself for her creamy meal as did many other girls.</span></div></div>",
            "created":1500526800,
            "id":2356637,
            "title":"round 3"
        },
        "11121112":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "megumi tadokoro (food wars)",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>\"So you girls forced here against your will too?\" Asked the visibly irritated Bulma. \"Yes it's so unusual, I was on a mission for my guild when I was suddenly abducted and brought here.\" Informed a blue haired woman with pale white skin and a tattoo on her thigh. \"My abduction was similar, I was separated from my crew while exploring an island before my capture happened.\" added a tall, slim woman with big blue eyes and black hair. \"Yeah I never thought I'd be kidnapped since I wield the maken Murakumo.\" a busty purple haired school girl said. \"Well I don't know about you but I sure as hell ain't gonna let some Headmistress fatten me up for some perv's satisfaction.\" Bulma expresses her outrage causing the others to agree. \"By the way I'm Bulma Briefs who are you?\" Bulma inquired. Each girl gave her name. \"Juvia Lockser\" answered the blue haired woman. \"Nico Robin\" spoke the tall woman. \"I'm Haruko Amaya.\" introduced the busty school lass. \"Great nice to meet you all, now I'm sure if we stick together we can resist this Headmistress and her quirky staff.\" Bulma boasted.<br>\r\n<br>\r\nAs the women grew confident in their resilience, an odor wafted through the air. It was enticing. The smell was coming from the teacher entering the room while pushing a cart of some of the most appetizing food these women have ever seen. \"Sniff wow that smells great!\" Haruko declared. \"Indeed it even smells better than Sanji's cooking.\" Nico Robin admitted. \"My it certainly smells good.\" added Juvia. \"It's not like it smells that great.\" lied Bulma trying desparately to resist the school. \"Alright class take a seat so we can begin.\" instructed the home ec teacher who was....  </span></div></div>",
            "created":1494392400,
            "id":2317406,
            "title":"some girls from other animes"
        },
        "111211121":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "Megumi brings in more food",
                "the girls undergo brainwashing"
            ],
            "content":"<div class=\"\"><div> <span>\"Let me welcome you girls to weight gain Home Ec!\" announced the cheerful teacher, \"I'll be your teacher Megumi Tadokoro.\" She said writing her name on the board. \"She's the teacher but she's so young.\" Bulma whispered to Juvia. \"Now let's go over the criteria for this semester.\" Megumi said. <br>\r\n<br>\r\nPamphlets were passed out to each girl as Megumi went over the class's itinerary. \"Now ladies you've been sent to wg home ec to become fat bbws for Headmistress XXX's clients and it's my job to serve you irresistable food which will smother your trim bodies in fat. To reduce athletic ability decrease your energy.  But the purpose of home ec isn't merely to fatten you up. Far from it. It's also designed to increase your appetite making it downright insatisible. To make exercise or any excessive physical activity repugnant. To alter your mindset into obsessing over food, from solving all your problems with food, to celebrating with food, to eating out of boredom. From this class you'll acquire an expertise over various cuisines making you all food aficionados.\" Megumi announced.<br>\r\n<br>\r\nAs the itinerary was given, the girls went through the pamphlets. The pamphlets showed lavish dishes and illustrations of skinny females next to fat females. Images of girls consuming exuberant meals proudly rubbing their bellies paired with girls wearing tight clothes flaunting their bulges.<br>\r\n<br>\r\n\"Now I'm sure you'll like, this unlike the other classes at Kinky Academy Home Ec is one of the least forceful classes, though I should warn you any defiance will be fiercely dealt with. Even if you're against it now, you will gain weight and graduate from this class even if we force you. And if you think you can resist I should warn you I'm rather prodigious at cooking. But don't misunderstand me. The purpose of Home Ec is to make you love your fat bodies, to adore cooking, and revel in feasting. Home Ec will make you love food.  By the time we're done with you, you will all look back at your skinny selves with disgust.\" Megumi giggled as she concluded.  \"Oh and if you're lucky enough you'll go on to Home Ec 2 to fatten even more into ssbbws. Though that class is more intense than this one.\" Megumi stated.<br>\r\n<br>\r\n\"No way! There's no chance that I'll change into a fat foodee!\" Bulma angrily retorted. \"Oh really?\" Megumi gently smiled as she unvieled a splendid dessert. Bulma was rendered silent and awestruck as she oogled the alluring dessert. Megumi grabbed the dessert and shoved it in Bulma's drooling maw. \"What do you think slim?\" Megumi smirked. The unbelievable dessert induced Bulma into a transcending trance. It was as if Bulma was flying through the sky naked. Never before has Bulma's tastebuds been so pleasured. \"I've never had anything so good before.\" Bulma moaned in elation. \"Is it really that good?\" Haruko muttered. \"There's enough for everyone ladies!\" Megumi shouted. \"Oooh its too hard to resist!\" Juvia cracked as did the others. Each girl partook in the dessert and like Bulma experienced an exhilarating trance.  </span></div></div>",
            "created":1494392400,
            "id":2317437,
            "title":"megumi tadokoro (food wars)"
        },
        "11122":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Domination 101",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Domination 101</span></div></span></div>",
            "created":1535000400,
            "id":2537643,
            "title":"Chichi"
        },
        "111222":{
            "author_id":"tiggers",
            "author_name":"Dale Gibson ",
            "choices":[
                "Sure",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Chi-Chi gets taught about kinky role playing?</span></div></span></div>",
            "created":1564290000,
            "id":2693562,
            "title":"Something else "
        },
        "11123":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "Android 18",
                "more dragon ball girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps the blonde android has been enrolled in Kinky Academy?</span></div></span></div>",
            "created":1521781200,
            "id":2468367,
            "title":"more"
        },
        "111231":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Stepford Wives Training ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about She takes Stepford Wives Training </span></div></span></div>",
            "created":1535000400,
            "id":2537642,
            "title":"Android 18"
        },
        "111232":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Videl ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Videl </span></div></span></div>",
            "created":1535000400,
            "id":2537633,
            "title":"more dragon ball girls"
        },
        "1112321":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Bimboology",
                "Something Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about she takes Bimbology</span></div></span></div>",
            "created":1535000400,
            "id":2537635,
            "title":"Videl "
        },
        "1112322":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Zangya ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Zangya </span></div></span></div>",
            "created":1535000400,
            "id":2537634,
            "title":"Someone else "
        },
        "11123221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Introduction to Bondage ",
                "Something Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class should Zangya take how about Introduction to Bondage </span></div></span></div>",
            "created":1535000400,
            "id":2537783,
            "title":"Zangya "
        },
        "11123222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Princess Snake ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Princess Snake </span></div></span></div>",
            "created":1535000400,
            "id":2537686,
            "title":"Someone else "
        },
        "111232221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Transformation ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Class does Princess Snake take how about Transformation </span></div></span></div>",
            "created":1535000400,
            "id":2537800,
            "title":"Princess Snake "
        },
        "112":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Sailor Moon",
                "Sailor Mercury",
                "More Sailor Scouts..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one of the Sailor Scouts is unfortunate enough to be captured and taken to the Kinky Academy?</span></div></span></div>",
            "created":1483851600,
            "id":2260989,
            "title":"Sailor Moon"
        },
        "1121":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Bimboization, turn her into a ditzy big breasted bimbo!",
                "BDSM, turn her into dominatrix or a submissive slut!",
                "More fetishes..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So we've chosen the goofball leader of the Sailor Scouts. Now it's time to finally pick out what fetish she's going to learn all about.</span></div></span></div>",
            "created":1483851600,
            "id":2260992,
            "title":"Sailor Moon, herself"
        },
        "11213":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Weight gain",
                "Muscle growth",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The fetishes.</span></div></span></div>",
            "created":1535605200,
            "id":2540833,
            "title":"More fetishes..."
        },
        "113":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Asuka",
                "Rei",
                "Misato or more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just who will find themselves enrolled in the headmistress's Kinky Academy?<br>\r\n<br>\r\nAsuka<br>\r\n<br>\r\nRei<br>\r\n<br>\r\nMisato</span></div></span></div>",
            "created":1595874660,
            "id":2876337,
            "title":"Neon Genesis Evangelion"
        },
        "1131":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Weight gain home Ec",
                "submission101",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class will the German pilot undergo?<br>\r\n<br>\r\nWeight gain home Ec to add some weight to the scrawny girl.<br>\r\n<br>\r\nor<br>\r\n<br>\r\nSubmission 101 would certainly tame the fiery red head.</span></div></span></div>",
            "created":1595875500,
            "id":2876342,
            "title":"Asuka"
        },
        "11311":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Asuka waits nervously in her room",
                "Introduction to wg home ec"
            ],
            "content":"<div class=\"\"><div> <span>\"Ugh uh...    whe- where am I?\"<br>\r\n<br>\r\nBlurry vision gripped Asuka as she had awoken in a bright room. <br>\r\n<br>\r\n\"Is..this...NERV?\" <br>\r\n<br>\r\nThe room was painted completely white, void of any character, a rather unsettling feeling. Asuka found herself lying on a modest single person bed attached to the wall. Hopping off the bed, Asuka noticed she had been stripped down to her underwear.<br>\r\n<br>\r\n\"Gah!\" Asuka yelled throwing her arms around herself \"What is this?! This better not be some stupid experiment Ritsuko tossed me into without my permission!\"<br>\r\n<br>\r\nAsuka's indignant yelling was silenced by a knock on her door. The Eva pilot turned to the opening door. <br>\r\n<br>\r\n\"Hey what is this? Who are you?\"<br>\r\n<br>\r\nIn entered a woman dressed in military attire. Though fashioned rather unorthodox to military standards. Her outfit was skintight and attention-grabbingly revealing. She wore a short skirt displaying her smooth thighs and permitting the bottom of her nicely sized butt to peep out.  A barely buttoned shirt showing a tantalizingly long cleavage of her tremendous boobs. A sexy beret atop her silver haired head complimented her duds. All standing from a pair of perfectly shined high heels.<br>\r\n<br>\r\n\"Are you with Nerv?\" Asuka asked, her postulation based off of the woman's outfit, nothing unfamiliar to Asuka.<br>\r\n<br>\r\n\"I am not my dear student.\" she confidently answered.<br>\r\n<br>\r\n\"Well who the hell are you then?\" Asuka now nervous, barked, moving one arm across her bra.<br>\r\n<br>\r\n\"Your principal.\" <br>\r\n<br>\r\nAsua stared silently.<br>\r\n<br>\r\n\"Headmistress XXX and you are now a student of my Kinky Academy!\" XXX emphatically announced.<br>\r\n<br>\r\n\"Kinky Academy?\" an irked Asuka repeated. \"I didn't agree to this!\"<br>\r\n<br>\r\nXXX chuckled \"It's not up to you, little girl.\" XXX pinched Asuka's cheek. \"As of now you are property, an item, if you will, that we aim to mold and reshape into a new product. A product that specifically caters to our client.\"<br>\r\n<br>\r\n\"Mold and reshape me?!\" Asuka angrily replied.<br>\r\n<br>\r\n\"Both physically and mentally\" XXX nodded.<br>\r\n<br>\r\n\"Like I'd ever submit-\"<br>\r\n<br>\r\nAsuka's words were cut short from a crackling taser XXX pulled out. <br>\r\n<br>\r\n\"Ah ah ah\" XXX sung \"Resistance will be met with force young lady. You'll do best to obey our every last word.\"<br>\r\n<br>\r\n\"Y-you can't be serious.\" Asuka stammered.<br>\r\n<br>\r\n\"Now, you like all of our other students will be reprogrammed to become the living embodiment of a fetish. Your personal living space will be modified and updated to accommodate your transformation.\" <br>\r\n<br>\r\n\"Transformation? Just what class are you going to put me through?\" Asuka demanded.<br>\r\n<br>\r\nXXX pulled out phone, looking up the new girl's file. \"Let's see...Asuka Langley Souryuu. You've been enrolled in our state of the art Weight Gain Home Ec designed to fatten you up and teach you how to properly use your excess flesh to please.\"<br>\r\n<br>\r\n\"You people plan on fattening me up!\" Asuka furiously latched out.<br>\r\n<br>\r\n\"You and your fellow classmates.\" XXX smiled  \"We'll send up some of your clothes for your new curriculum.\"<br>\r\n <br>\r\n\"Just what is going on?\" Asuka cried out.</span></div></div>",
            "created":1595880240,
            "id":2876374,
            "title":"Weight gain home Ec"
        },
        "113112":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Asuka talks to other characters",
                "Asuka returns to her room"
            ],
            "content":"<div class=\"\"><div> <span>After Asuka received her clothes, her school uniform, Asuka was escorted across a long hall, deep beneath the Earth's surface. Asuka was then brought to a large lobby leading to various auditoriums. Asuka observed the other options. Submission 101, bondage, stepford wives training, each one sent chills down her spine. The thought of thousands being modified into sexual objects gripped Asuka. Just how powerful was Headmistress XXX?<br>\r\n<br>\r\nAsuka was then brought to a hall with a sign 'weight gain home ec' placed next to it. Asuka was shoved through and the exit was blocked.<br>\r\n<br>\r\n\"Dammit\" Asuka grumbled<br>\r\n<br>\r\nWithout any alternative, Asuka begrudgingly continued forward into the auditorium. Asuka found herself amongst hundreds of other girls forcibly enrolled in this outrageous home ec. Asuka could only grit her teeth as she took a seat. <br>\r\n<br>\r\n\"This is unbelievable\" expressed the frustrated German girl.<br>\r\n<br>\r\nA surveillance of her surroundings unveiled numerous other girls posting demeanors similar to Asuka. It wasn't hard to imagine why, the idea of being abducted from their normal lives and sent to a academy to be fattened up seemed rather unappealing. Girls from all various walks of life were there. It seemed Asuka was going to be attending classes with some interesting characters. One could hear murmors of nervous girls talking among one another concerned for their well beings. <br>\r\n<br>\r\nThe crowd was instantly silenced as the speaker approached the podium. It was a woman in similar attire to XXX, one of her teachers perhaps. Though this one was somewhat portly, clearly a woman unfamiliar with diet and exercise. <br>\r\n<br>\r\n\"Can I have everyone's attention!\" She spoke.<br>\r\n<br>\r\nAll eyes obediently looked upon her.<br>\r\n<br>\r\n\"Good. Now allow me to introduce you all to the Headmistress's Kinky Academy's illustrious Weight gain home Ec! This never fail program will fatten you up into ideal women. You will grow not just in body but in mind as well. You will adopt habits that will ensure an obese future. Any behaviors that could hinder weight gain will be extinguished. You'll develop incredible appetites and acquire tastes for high calorie foods. Any sort of physical prowess you'd possess will be removed protecting your beautiful fat. No need to worry about everyday life as you will all be taught tricks and techniques to maneuver your heavy bodies through everyday life. And most you'll master any and all sexual positions and activities with your fat bodies. From belly fucking to oral, you'll guarantee a masterful performance.\"<br>\r\n<br>\r\nThe woman's words made the situation seem all too real, even Asuka began to feel that becoming fat was inevitable. <br>\r\n<br>\r\n\"Each of you will be issued a curriculum scheduling your mandatory classes to your rooms. You can see it after this introduction\" informed the speaker \"Each of you will attend basic classes at first but as you advance we'll assign you to more specific classes to guarantee that even problematic students will graduate. With that, this concludes the lecture. Feel free to get acquainted with your fellow classmates.\"  <br>\r\n<br>\r\n </span></div></div>",
            "created":1595884860,
            "id":2876481,
            "title":"Introduction to wg home ec"
        },
        "114":{
            "author_id":"johndoe94",
            "author_name":"theunknown one",
            "choices":[
                "Akane",
                "Shampoo",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky lady?</span></div></span></div>",
            "created":1485320400,
            "id":2268961,
            "title":"Ranma 1/2"
        },
        "1143":{
            "author_id":"johndoe94",
            "author_name":"theunknown one",
            "choices":[
                "Nabiki",
                "Kasumi ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about either Nabiki or Kasumi</span></div></span></div>",
            "created":1485320400,
            "id":2268963,
            "title":"Other"
        },
        "11433":{
            "author_id":"johndoe94",
            "author_name":"theunknown one",
            "choices":[
                "Sure",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Ranma in his girl form?</span></div></span></div>",
            "created":1485320400,
            "id":2268964,
            "title":"Other"
        },
        "115":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "One Piece",
                "Naruto",
                "More animes..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Any of these animes appeal to you?</span></div></span></div>",
            "created":1483938000,
            "id":2261289,
            "title":"More choices..."
        },
        "1151":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Nami ",
                "Nico Robin ",
                "Other Characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Characters from One Piece live in the era of pirates. <br>\r\n<br>\r\nWho will be taken to the Kinky Academy? <br>\r\n<br>\r\nFirst up, both Nami and Nico Robin are female crewmates of the nortorious Straw Hat Pirates. </span></div></span></div>",
            "created":1487653200,
            "id":2280531,
            "title":"One Piece"
        },
        "11511":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Submission 101",
                "Introduction to Bondage",
                "Other Choices"
            ],
            "content":"<div class=\"\"><div> <span>Student Profile<br>\r\n<br>\r\n<b>Name:</b> Nami <br>\r\n<b>Height: </b>170 cm (5' 7\")<br>\r\n<b>Age:</b> 20<br>\r\n<b>Hair Description:</b> long, wavy orange hair<br>\r\n<b>Birthday:</b> July 3rd <br>\r\n<b>Measurements:</b> B98-W58-H88<br>\r\n<b>Cup Size:</b> J-cup<br>\r\n<b>Personality:</b> Due to a poor upbringing as a child, she is greedy when it comes to money and treasure. She has very little modesty, often wearing skimpy clothing and would even go as far as to let herself be seen naked in exchange for money. She can be manipulative and seductive, unafraid to use her sex appeal to benefit her.<br>\r\n<b>Fetish Class:</b> [Insert Fetish]<br>\r\n<br>\r\n</span></div></div>",
            "created":1487826000,
            "id":2281329,
            "title":"Nami "
        },
        "115111":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Tickling",
                "Vibrators",
                "Whipping"
            ],
            "content":"<div class=\"\"><div> <span>Clenching her fists in excitement, Headmistress XXX strode down the dimly lit corridor to visit her brand new student. This entire facility was owned and ran by her. She absolutely loved it. This illegal, systematic business of hers had brought her great pleasure, and she got to share and teach this pleasure with many others. The demands of her client were numerous. Behind the veil of manners and social norms, there was a dark corner in the minds of many where fetishes and naughty fantasies emerge. Today, she had been hired to capture a girl named Nami who’s both a pirate and a thief. In short, her new student was a criminal, and criminals should be punished, right? <br>\r\n<br>\r\nHer high heels halted in front of the cell. She grabbed around one of the metal bars while peeking at the lovely, curvaceous young woman on the other side. <br>\r\n<br>\r\nThe pirate girl had long, wavy orange hair and light-brown eyes. She was being held in place in a standing position. Her wrists were raised over her head, shackled to the ceiling by a strand of chain. She gave an anxious glance at the unfamiliar woman who was eyeing up and down at her body. The mischievous smirk on her captor’s lips made her heart sink. She remembered sleeping in the Thousand Sunny –the name of her ship- one night, and upon waking up, she ended up here in a dungeon. <br>\r\n<br>\r\n<span class=\"corange\"><i>I must’ve been kidnapped when I was asleep. But where am I? There shouldn’t be an island nearby for at least another two days. Moreover, the Log Pose on my wrist is gone.  </i></span><br>\r\n<br>\r\nXXX had a clear view on her new student’s sexy, hourglass figure. Nami wore nothing but a green and white bra to cover her large assets, a pair of blue jeans with no belt, and a pair of brown sandals. Clothing aside, she had a dark-blue tattoo on her upper-left arm and bead-shaped earrings on both earlobes. <br>\r\n<br>\r\nThe headmistress unlocked and opened the barred gates. She gestured with open arms before speaking in an upbeat tone, <span class=\"corange\">“Welcome, my new student, to Kinky Academy. From here on out, you’ll be taking the special course, Submission 101. You’ll soon get to learn how to please and obey your master.” </span><br>\r\n<br>\r\n<span class=\"corange\">“What!? ... K-Kinky Academy?” </span>Nami looked both astonished and appalled of the implications. She jerked forward, yanking on the chains that kept her arms raised up high. <span class=\"corange\">“I’m not interested in your course. Just who are you?”</span> she spoke in an assertive tone. <br>\r\n<br>\r\n<span class=\"chotpink\">“Oh my, how feisty... I’m the headmistress of this facility, XXX,” </span>the dominatrix introduced herself. <br>\r\n<span class=\"corange\"><i><br>\r\nXXX? What kind of name is that? <br>\r\n</i></span><br>\r\n<span class=\"corange\">“Where are my friends?” </span>The pirate girl asked in a serious tone. If she was here, then it was possible the rest of her crew could be in the same predicament. <br>\r\n<br>\r\n<span class=\"chotpink\">“Unfortunately, you’re friends aren’t here. I’ve been hired to handle only you,”</span> informed the mistress. <br>\r\n<br>\r\n<span class=\"corange\">“Eh?”</span> Nami widened her eyes. She was the only one excluded from her crew? That meant Luffy, Zoro, Sanji, Robin, Chopper, Brook, Franky, and Usopp weren’t here. None of them could help her. <br>\r\n<br>\r\n<span class=\"chotpink\">“Now then, I think it’s time to set some house rules,”</span> XXX walked in circles around the pirate woman like a shark surrounding its prey.<span class=\"chotpink\"> “First, you will address me as ‘mistress’ from now on. Second, you will obey my every command. So if I tell you to be silent, you cannot make a sound. Third, you will speak only the truth to me. And lastly,”</span> she grinned, “the fourth rule, you’re not allowed to leave this facility until you pass the course.” <br>\r\n<br>\r\nNami remained dead silent. She began to realize just how crazy this woman is. There was still hope in her eyes. Her friends would come looking for her. However, without their navigator, her friends would be helpless in navigating across the seas of the New World. Realistically, they had no means of finding her. <br>\r\n<br>\r\n<span class=\"corange\">“!” </span>She recalled what XXX said earlier: ‘I’ve been hired to handle only you.’<br>\r\n<br>\r\n<span class=\"corange\">“Wait! Who hired you to capture me?” </span>She asked impatiently. Immediately, a hand slapped across her left cheek, leaving a red stinging mark, <span class=\"corange\">“ACK!”</span> <br>\r\n<br>\r\n<span class=\"chotpink\">“Aren’t you forgetting something?”</span> XXX asked in a strict tone. <span class=\"chotpink\">“I thought I told you to address me as mistress.” </span><br>\r\n<br>\r\n<span class=\"corange\"><i>What? She's actually serious about all that?<br>\r\n</i></span><br>\r\n<span class=\"chotpink\">“It seems I ought to punish you. I’ll show you what happens when you disobey the rules.”</span><br>\r\n<br>\r\nThe headmistress XXX decided that the best form of punishment for this pirate girl is... <br>\r\n<br>\r\n</span></div></div>",
            "created":1493355600,
            "id":2312114,
            "title":"Nami - Submission 101"
        },
        "1152":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Hinata Hyuga ",
                "Ino Yamanaka",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character from Naruto shall be the unwillingly accepted into Kinky Academy? </span></div></span></div>",
            "created":1487826000,
            "id":2281446,
            "title":"Naruto"
        },
        "11523":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Tsunade",
                "Sakura",
                "No good, got anyone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these possibilities?</span></div></span></div>",
            "created":1564290000,
            "id":2693478,
            "title":"More Naruto characters"
        },
        "1153":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Fairy Tail",
                "Sword Art Online",
                "Other Animes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are more anime choices that may contain a character to your liking. </span></div></span></div>",
            "created":1487912400,
            "id":2281679,
            "title":"Fairy Tail or Sword Art Online?"
        },
        "11531":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Lucy Heartfilia",
                "Mirajane Strauss",
                "Other Characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will be the unlucky accepted student to Kinky Academy? </span></div></span></div>",
            "created":1487912400,
            "id":2281681,
            "title":"Lucy Heartfilia or Mirajane Strauss?"
        },
        "115311":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Submission 101",
                "Marco",
                "Other Fetishes"
            ],
            "content":"<div class=\"\"><div> <span>Student Profile<br>\r\n<br>\r\n<b>Name:</b> Lucy Heartfilia<br>\r\n<b>Height:</b> 175 cm (5' 5\")<br>\r\n<b>Weight:</b> 47 kg (104 lbs)<br>\r\n<b>Age:</b> 17<br>\r\n<b>Hair Description:</b> long, straight blonde hair<br>\r\n<b>Measurements</b>: Bust- 91cm; Waist- 59cm; Hip- 88cm<br>\r\n<b>Personality: </b>Lucy is someone with a lot of pride in her sex appeal. She is kind and carring person who values friendships greatly. She has a passion for literature, leading to interests in reading and writing.<br>\r\n<b>Fetish Class:</b> [Insert Fetish]</span></div></div>",
            "created":1488171600,
            "id":2282897,
            "title":"Lucy Heartfilia"
        },
        "1153113":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Domination 101",
                "Other Fetishes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other fetishes.</span></div></span></div>",
            "created":1488258000,
            "id":2283258,
            "title":"Other Fetishes"
        },
        "11533":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Soul Eater",
                "Miss Kobayashi's Dragon Maid",
                "Other animes..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Soul Eater or Miss Kobayashi's Dragon Maid? That's right, even dragon girls aren't safe from Headmistress XXX.</span></div></span></div>",
            "created":1491973200,
            "id":2303723,
            "title":"Yet more to chose from..."
        },
        "115331":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Maka ",
                "Tsubaki ",
                "More characters..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Looks like some unlucky students go from Death Weapon Meister Academy to the Kinky Academy.<br>\r\n<br>\r\nLet's start with Maka Albarn the meister or demon weapon Tsubaki Nakatsukasa.</span></div></span></div>",
            "created":1492837200,
            "id":2309229,
            "title":"Soul Eater"
        },
        "1153311":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Corruption Course",
                "Bimbology",
                "More class options..."
            ],
            "content":"<div class=\"\"><div> <span>Maka Albarn, the smart, brave, and strong willed meister it is then. Now it's time to pick out a class for Maka to take at her new school.<br>\r\n<br>\r\nHow about making Maka go through the Corruption Course and twisting all her kindness and heroic traits into a wicked and perverted slut? <br>\r\n<br>\r\nOr maybe have her take Bimbology to take away all of her intelligence and make her go from flat chested to busty.</span></div></div>",
            "created":1492837200,
            "id":2309257,
            "title":"Maka Albarn"
        },
        "115332":{
            "author_id":"5jalpham1230",
            "author_name":"Scribe",
            "choices":[
                "Looked over the paper of courses scheduled ",
                "Wanted to get her own terms straight"
            ],
            "content":"<div class=\"\"><div> <span>Two of the dearest of Miss Kobayashi’s girls were being sent off to a school to supposedly further their education. As they were picked up by train and taken to the academy, Quetzacoatl and Tohru left home with excitement and discussion of their futures. They soon took off towards the main class gathering and noticed they were both assigned to the same orientation room. Soon before them stood the lovely and legendary Headmistress Xandru Xavier Xelta. “Oh dearies, welcome to the academy! It is my absolute pleasure to have two of the brightest young minds join us here today! Now I know this may be strange, but I will take in Quetzacoatl in first for discussion. Tohru, I be back for you afterwards.” Soon the two were brought into the adjacent room to discuss matters. <br>\r\n“Sooooo you found a way to cover it up and bring your situation to the academy. Goodnes dearie you are a little genius aren’t you?” Quetzalcoatl replied, “Indeed, I’m happy to meet a woman as smart as you on excluding the matter from the public. Now I understand this serves of some condition for you, yes?” “Oh it’s just but one condition dearie. Of course in private you’ve known for a while what this place is all about. The fetishes galore have made this place a god send for the secretly horny and the like. When I heard your vision... it was one of the only in a while to truly excite me. And I’ve seen it all. But I know you know that. Of course we have the classwork laid out here.” Quetzalcoatl next...</span></div></div>",
            "created":1583382900,
            "id":2796832,
            "title":"Miss Kobayashi's Dragon Maid"
        },
        "1153321":{
            "author_id":"5jalpham1230",
            "author_name":"Scribe",
            "choices":[
                "“Yes. These will work.”",
                "“I’d like a few changes.” (change as you see fit; your storyline now)"
            ],
            "content":"<div class=\"\"><div> <span>On the paper the following was described:<br>\r\n<br>\r\nQUETZALCOATL: <br>\r\n-Domination 101<br>\r\n-Intro to Bondage<br>\r\n-Corruption Course<br>\r\n-Sculpted Muscles<br>\r\n-Futanari Training<br>\r\n-Male Expression TF (commonly called MTET F)<br>\r\n<br>\r\nTOHRU: <br>\r\n-Mind Control<br>\r\n-Bimbology<br>\r\n-Age Regression Class<br>\r\n-Weight Gain Home Ec 1 (with plans for follow up Ec 2)<br>\r\n-Porky Pig’s Perky and Porky Photo Planning (P6 for short)<br>\r\n<br>\r\n“Well, well Quetzacoatl, you’ve certainly set the bar high for your classes. A total dominance major pathway with a twist of our artistic/body expression minor. You’ve picked some of the hardest classes we offer... and yet I know you’ll do well. As for Tohru, I see you know what you want. These should certainly be easy enough to give her an expedited track to constantly punch below the weight of her other peers and condition her towards to sub-mistress major with the bedroom beauty minor. Of course if she gets off track we will make special plans to keep her track constantly easy enough to keep on pace with your blazing and challenging schedule. So my last question becomes: do these terms work for you?” </span></div></div>",
            "created":1583384040,
            "id":2796842,
            "title":"Looked over the paper of courses scheduled "
        },
        "11533211":{
            "author_id":"5jalpham1230",
            "author_name":"Scribe",
            "choices":[
                "Impressively sized dick",
                "rather disappointing cock"
            ],
            "content":"<div class=\"\"><div> <span>“Perfect! As you know, your little friend has already been carried off and is currently being started in Mind Control to break her brain down for bimbology and will progress from there. As for you of course, you will start in Futanari training for today. Allow me to randomize your fate, or rather length...” Quetzalcoatl soon felt a sensation between her thighs. Soon there she saw her... </span></div></div>",
            "created":1583384400,
            "id":2796846,
            "title":"“Yes. These will work.”"
        },
        "115332111":{
            "author_id":"5jalpham1230",
            "author_name":"Scribe",
            "choices":[
                "Quetz started her day",
                "Tohru has already started her hard day"
            ],
            "content":"<div class=\"\"><div> <span>“Oooooh huh ho! My oh my darlin— uh hehm excuse me, mister... it seems your hard classes just got harder in the best way, ehh!?” Quetzalcoatl gave a disinterested chuckle. “Where’s my first class again?” “Go down the hall to the right and you’ll see it on the room number: 8-D.” XXX gave a slight chuckle for the room number. Quetz left and headed off to the classroom. Soon after... </span></div></div>",
            "created":1583386320,
            "id":2796855,
            "title":"Impressively sized dick"
        },
        "115333":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "yep ",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about RWBY</span></div></span></div>",
            "created":1493701200,
            "id":2313841,
            "title":"RWBY?"
        },
        "1153331":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "yes",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it someone from team RWBY?</span></div></span></div>",
            "created":1493701200,
            "id":2313845,
            "title":"T"
        },
        "11533311":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "white rose",
                "bumblebee"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it a member of white rose or bumblebee duo</span></div></span></div>",
            "created":1493701200,
            "id":2313847,
            "title":"yes"
        },
        "115333111":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "Ruby",
                "Weiss"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1493701200,
            "id":2313848,
            "title":"white rose"
        },
        "1153331111":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "coruption course",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Headmistress XXX could only give a small smile as she sees her newest student. In the chair in front of her is a sleeping Ruby Rose. Her arms were tied behind the chair to keep her in place. She also where a special collar on her neck designed to suppress someone’s aura. She had dealt with a few huntresses and their Aura can be a pain to deal with in the beginning so she used the collar till they were better students. She looked over miss rose file and found it impressive.<br>\r\n<br>\r\n She was let into Beacon at 18 while the standard age for enrollment is twenty.  She was also made the leader of her own team and has helped stop many robberies being done by a roman Torchwick. There were other highlights in the files. The headmistress was not easily impressed but found many of the highlights impressive. She felt disappointed when she read some of the more negative points in the file. The girl had low self-esteem even with her accomplishments. She was also very naïve and innocent for her own good. <br>\r\n<br>\r\nReading through the file a few times the headmistress could not help but let out a light chuckle at how fun it will be to work with miss rose. The sound was enough to awaken her sleeping student. She waited a minute to see the girl fully wake up and realize that she is not in her dorm room. She smiled as she saw the girl struggle with her binding for a moment and look of confusion when she could not activate her aura. <br>\r\n<br>\r\n“Hello miss rose,” Headmistress finally said. <br>\r\n<br>\r\n“What, who are you,” she asked with a bit of fear in her voice. “Where am I?” <br>\r\n<br>\r\n“The name you shall know me by is Headmistress XXX, and you are at my little school called Kinky academy,” she answered. “Here we teach students to become masters of their sexual fetish.” When she said the last part she had a big grin on her face. <br>\r\n<br>\r\nRuby tilted her head in confusion till she said, “What is a fetish, and what does that have to do with me I don’t remember signing up for something like this?<br>\r\n<br>\r\nWhen she asked what a fetish was the headmistress had to resist the urge to face palm. The girl was too innocent for her own good. What 18 year old didn’t know what a fetish was?  “I will tell you what that is in a moment consider it your first lesson here. As for why you are here is rather simple. We were hired to kidnap you and train you in the way are client wishes. You will not be able to escape here no matter how hard you try. Many have tried but none have succeeded. The collar around your neck is specially designed to suppress your aura. That means that you can’t use your aura unless we let you,” she says. She looks at ruby and sees the girl’s eyes widen in disbelief as she tried to activate her aura but found that she couldn’t.<br>\r\n<br>\r\n“As for your first question a fetish is a term used to describe an activity or act that people find sexual stimulating. This could be certain parts of the body or certain acts. By performing these acts or doing sexual activities while focusing on the body part will cause for greater pleasure. You will learn different types while you are here and I don’t want to keep you late for your first class,” she said.<br>\r\n<br>\r\n She then signaled to big men at her door to untie ruby and bring her to her first class. They did as ordered and picked the girl up as she tried to struggle and kick at the guards even aiming at their privates a few times. This would work on most men but her men were trained to handle any pain including a few nut shots. They soon left the office as the headmistress looked over some of her paperwork that she still had to do. She let out a sigh before going back to the tedious work she hated to do nut it was necessary. <br>\r\n<br>\r\n<br>\r\nWhat is her first class?<br>\r\n</span></div></div>",
            "created":1493701200,
            "id":2313870,
            "title":"Ruby"
        },
        "11533311111":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "domination or submissive ",
                "bondage 101"
            ],
            "content":"<div class=\"\"><div> <span>Ruby eventually gave up escaping from the two men. She was getting tired and even kicking those between the legs caused little reaction from them. She just had to play along for the time being till an opportunity arose for her to escape. When she stopped struggling the guards let her walk the rest of the way to the class room. <br>\r\n<br>\r\nWhen they reached the doors they knocked on the door and it was opened by a small cat like creature. It had pure white fur with two pink eyes. It had four ears which ruby found the most interesting. Two looked like normal cat ears and the other two looked like tassels that split at the end. Ruby could not help but tilt her head in confusion at the little creature and wonder why that little creature opened the door. <br>\r\n<br>\r\n“Contract,” she suddenly heard in her head. She looked around for the voice but could not find anything. <br>\r\n<br>\r\n“No Kyubey she is your new student. Here is her paperwork,” one of the men said. He then turned to Ruby and said, “Kyubey her is the teacher. He may look like a creature of pure innocence but don’t let that fool you that little guy is one of the evilest guys I know. That voice you heard earlier was his. He doesn’t speak, instead he sends telepathic messages. It takes a while but you will get used to It.” he then pushed her through the door after Kyubey stepped to the side. <br>\r\n<br>\r\nShe nearly stumbled when she came in but managed to right herself. She then looked at the room she was in. it looked like a normal classroom with desks and a chalk board on the wall with the words “corruption course: the best way is not always the good way.” Sitting in the desks are five other girls. <br>\r\n<br>\r\n“You are just in time miss rose we were just about to begin,” Kyubey said. “Now class we have a new student that is new to our academy her name is Ruby rose. Now miss rose could you please sit next to Madoka.” <br>\r\n<br>\r\n“Sure,” ruby said. She still found it weird to hear the teacher’s voice in her head but just shook it off for now. She went to sit next to the pink haired girl that raised her hand. When she sat down and looked at the teacher to see what this class was all about. <br>\r\n<br>\r\n“Now that everyone is seated let me give a quick description of the class to our new student. I had explained this to each of you before but it would be best for you to treat this as a review,” Kyubey said. “This class is about turning nice little girls like yourself into more evil versions of yourself that like to do bad things to others and do things you are not supposed to do.” <br>\r\n<br>\r\nRuby could not believe it. This class was to make someone evil. There was no way she would ever let this class corrupt her into the ways of the bad guys. She wanted to be a huntress to protect people from bad people not become one. She just shook her head and listened to the teacher while she tried to think of a way out of the school. <br>\r\n<br>\r\nWhat she didn’t know was that Kyubey telepathy worked both ways and heard her thoughts. When it did it had to resist a smirk. Good girls like her were the easiest to corrupt. It just had to do the job right. First she will probably try to make an ally in the class to help resist its teaching. Unfortunately for her all the other girls in class even though they didn’t act like it were already graduates of the academy that Kyubey brought in to give false hope before taking it away. That combined with the subliminal messages that Kyubey always broadcasted in the room she will eventually see the darker ways as more entertaining. <br>\r\n<br>\r\nThe class went on for about an hour and a half with Kyubey discussing how it is better to do things the evil way instead of the good way. It mentioned how the good way may make you look righteous but in the end that was all it did. Where the evil way got the job done and gave you an added bonus for yourself. That bonus could be better reputation to a monetary gain. It even pointed out that even the heroes from comic books that were supposed to be the height of justice were giant hypocrites. The moment they put on their masks and attacked the bad guys they break several laws but is seen as okay simply because the public is behind their actions. <br>\r\n<br>\r\nWhen class was over Kyubey looked at the papers he was given and said, “Homura could you please guide Miss Rose to _______________ it should be along the way to your next class.” The black haired girl said sure and walked over to ruby and took her hand as she led her out of the room. <br>\r\n<br>\r\n<br>\r\nWhat is ruby’s next class?<br>\r\n</span></div></div>",
            "created":1493787600,
            "id":2314281,
            "title":"coruption course"
        },
        "115333111111":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "submission 101",
                "domination 101"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one is she taking?</span></div></span></div>",
            "created":1493787600,
            "id":2314282,
            "title":"domination or submissive "
        },
        "115333111112":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do her and Homura talk on the way to class?</span></div></span></div>",
            "created":1493787600,
            "id":2314284,
            "title":"conversation?"
        },
        "1153331111121":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "starts off with the basics",
                "hardcore right off the bat"
            ],
            "content":"<div class=\"\"><div> <span>“So how long have you been here,” ruby asked. <br>\r\n<br>\r\nHomura just shrugs her shoulders and says, “About a month.” This is a lie she came here about two years ago but she needs her to believe she is new so she can earn her trust.  <br>\r\n<br>\r\n“So what can you tell me about this place,” ruby asked. <br>\r\n<br>\r\n“It is tough to adjust to the classes at first but you get used to it. Its better if you just follow along rule breakers get punished,” she answered. <br>\r\n<br>\r\n“You do know we just got done with a class that basically is all about rule breaking,” ruby said in a sarcastic tone. <br>\r\n<br>\r\nHomura stops for a moment before she thinks about it and says, “Good point. I know you are probably thinking about escape, but I wouldn’t if I were you.”<br>\r\n<br>\r\n“Why,” ruby asked. <br>\r\n<br>\r\n“Let’s just say the punishment for escaping is not pleasant,” she said in a tone of voice that ruby could tell that she was afraid. <br>\r\n<br>\r\nDeciding to change the topic ruby asked, “So what can you tell me about this intro to bondage? What is bondage anyway?”<br>\r\n<br>\r\n“The teacher of that class is Corset. He is a demon from another dimension. As for bondage it is the way of restraining yourself or others. This can be done with ropes, belts, handcuffs, chains, and other type of items,” she answered. <br>\r\n<br>\r\nRuby just nodded her head thinking about the class. Wanting more info about the school she asked, “so what are the teachers I should try to avoid making mad?”<br>\r\n<br>\r\n“We’ll all of them will have severe punishments if you anger them enough, but the main three you should avoid is the headmistress, Orochimaru, and Esdeath. <br>\r\n<br>\r\n“I know the headmistress but who are the other two,” ruby asked. If these are the main three she needs to look out for then she wanted to know as much as she can. <br>\r\n<br>\r\n“Orochimaru is in charge of the transformation class. It is a class were you are turned part animal and will take up some of traits of said animal. He is very sadistic and often has several experiments going on that would cause the most evil of people to flinch from what is being done to others. Esdeath is in charge of domination 101 and also teaches advance sadism. She is the very definition of a sadist. She loves to break people and make them obedient little slaves,” she said. She figured it would be best if she knew about the teachers know then finding out about them latter. <br>\r\n<br>\r\n“Does the headmistress teach a class,” ruby asked. <br>\r\n<br>\r\n“Yes she teaches some of the advance classes as well as Submission 101. She mainly teaches it so the new students will understand there place,” she answered. “We will have to talk more later. Here is your next class.” She gestured to the door on the right. <br>\r\n<br>\r\nRuby took a deep breath and knocked on the door, and is greeted by a giant of a man with blue skin. Without saying anything he gestures her to come inside. “Well class this is the new student her name is ruby rose. Why don’t you sit next to Hinata.” he gestures to a girl with long blue hair with pale eyes with a hint of lavender. She sits down and awaits the lesson. <br>\r\n<br>\r\n<br>\r\n<br>\r\nHow does he teach the class?<br>\r\n</span></div></div>",
            "created":1493787600,
            "id":2314466,
            "title":"learn about the teachers"
        },
        "11533311111211":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>“Now that everyone is here let’s begin,” Corset said. “Now I know most of you have never done this before so let’s start with the basics. Bondage is the practice of being physically restrained, as with cords or handcuffs, as a means of attaining sexual gratification. It is a part of BDSM. BDSM stands for three main concepts BD stands for bondage and discipline, Ds stands for Dominance and submission, and Sm standing for Sadism and Masochism. For this class we will focus on the bondage and discipline portion while introducing the others. Do you all understand?” Everyone just nods their heads in understanding. <br>\r\n<br>\r\n“Good now when most people think about bondage the main thing people think about is tying people up with rope but that is just a small part of bondage,” he said. “While rope is the common form you shouldn’t forget about other forms of bondage. You can also use belts that can adjust the tightness of. There is also the case of using handcuffs. They are quick to put on but if you know the trick they are also easy to remove. There are also chains but those should be left alone till you are at a high enough level since it could cause severe injury to the bound party.” <br>\r\n<br>\r\nHe spent the rest of class discussing some more points about bondage till he said, “Let’s finish this off with me teaching you how to bind some ones wrist with a larks head double column. I want each of you to look at the person next to you and have a quick game of rock, paper, and scissors with the winner raising their hand.” I look next to Hinata and we have a quick game that I win. When I raised my hand he came up to me and handed me some rope. He did the same for the other winners in the class. <br>\r\n<br>\r\nWhen all the ropes were passed around he came back to the front and said, “Now the winners will be doing the tying while the losers will be bound. This is an important lesson for you to remember the winners are the superiors who stay in control. Now will the losers place their hands in front of them facing the winner.” All the girls did as commanded. “Now will the winners fold the rope in half? When you are done with that I want you to form a lark head. For those who don’t know what that is it is where the rope folds in half with the tail ends of the rope going through the loop. Then wrap the rope around the wrist on the sides away from the fingers. After that you can pull the tails through the loop that was formed earlier. When that is done place one hand behind the knot and grab the tails from the bottom and bring it around. After that I want you to pull it till you can just fit two fingers. After that bring the rope around the bottom again but instead of going over the top go between the cords between the cuffs. Then go around to the opposite side you went through and then go back around to the other side again so the rope is in front of the cuffs in your hand. Know finish this off with a surgeons knot. The remainder of the rope is for you to guide them around how you see fit.” <br>\r\n<br>\r\nHe looks around to grade everyone’s work. For beginners it was okay but they could use some work. He then sees his new student miss rose work. He says, “This is very well done miss rose. I would have to say this is the best out of everyone else. Have you done this before?” <br>\r\n<br>\r\n“No Mr. Corset I just have always been good with my hands and at some point it just sort of clicked and was easy to get,” she answered.<br>\r\n<br>\r\n Corset looked at her for a moment before he nodded his head and returned to the front. He could not stop the smile from appearing on his face at the fact that miss rose appears to be a natural at this. He is sure in time she may be upgrading to some of his more advance classes. He then said, “Well according to your schedules your partners are in the same next class as you so using the knot guide them to the next class room. Hinata make sure you tell ruby the directions. In case you are curious this is not a coincidence and will be how we end all of our classes with one side being bound and leading or dragging depending on the knot. Now class dismissed.” They all said goodbye and left the room leading their partners to their next class. <br>\r\n<br>\r\nDo she and Hinata talk much on the way to class?<br>\r\n</span></div></div>",
            "created":1493787600,
            "id":2314518,
            "title":"starts off with the basics"
        },
        "115333111112111":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "domination or submissive ",
                "pet training"
            ],
            "content":"<div class=\"\"><div> <span>“So your name is Hinata. it is nice to meet you my name is ruby rose,” ruby introduced herself she felt nervous leading a girl with her hands bound around but didn’t want to get in trouble till she could figure out a way to escape.<br>\r\n<br>\r\n“Nice to meet you to ruby. My full name is Hinata Hyuga,” she says with a stutter. <br>\r\n<br>\r\n“So how long have you been here,” ruby asked. <br>\r\n<br>\r\n“About two weeks,” she said. “Do you remember how you were caught no else seems to be able to remember?” <br>\r\n<br>\r\n“No the last thing I remember was going to bed in my room then waking up in the headmistress’s office. What do you remember,” ruby replied. <br>\r\n<br>\r\n“I was on a date with my boyfriend Naruto. We have been having some issues since my lack of confidence is keeping us from going any further than a quick kiss. When we separated for the night I returned home and went to bed only to wake up in her office as well,” Hinata answered. <br>\r\n<br>\r\n“I see,” ruby said. “Well I hope we can get along well Hinata since it looks like we share at least two classes together.” <br>\r\n<br>\r\n“That sounds nice ruby,” Hinata said with a smile. Ruby replied by giving her a hug. It felt nice to have a friend in this twisted place. <br>\r\n<br>\r\n“So have you figured a way out yet,” ruby whispered to her. <br>\r\n<br>\r\n“No I have not,” she replied. “We are kept in a small part of the building and the exit is far away from where we are kept.” <br>\r\n<br>\r\n“I see,” ruby said breaking the hug. <br>\r\n<br>\r\nThe two talked about a few other things like about the food here and some of the classes here till ruby asked, “so what is our next class? <br>\r\n<br>\r\n<br>\r\nWhat class is next?<br>\r\n</span></div></div>",
            "created":1493787600,
            "id":2314525,
            "title":"first freind"
        },
        "1153331111121111":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "domination 101",
                "submission 101"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which 101 are they taking?</span></div></span></div>",
            "created":1493787600,
            "id":2314527,
            "title":"domination or submissive "
        },
        "11533311111211112":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "painful punishment",
                "sexual punishment"
            ],
            "content":"<div class=\"\"><div> <span>“Submission 101 with the headmistress,” Hinata answered weakly. “In fact that is the door right there. She pointed at the door next to them. They look at each other before they take a deep breath and open the door. When they come in they can see headmistress looking at them before she smiles at them. <br>\r\n<br>\r\nShe walks over to them and takes the rope from Ruby’s hands and says, “come along students class is about to begin.” She led them to the rest of the class where they see a few of the girls from the last class that had their hands tied had the rope tied to a chain with their arms suspended above their heads. Their partners were sitting in a chair next to them. XXX then leads them to an open spot and does the same to Hinata. She then orders ruby to sit in the chair. After she does she looks at the other girls and notices that they have been strapped into the chair. Before she could resist the XXX placed the straps on ruby with expert ease and quickness. <br>\r\n<br>\r\n“Now that everyone is ready let me explain how this class works. This is a mandatory class for all students. In this class we teach you to be obedient to your masters. When you are done with this class you will be given to the person who hired us to capture you and put you through these lessons. They have specified what they want you to learn and you schedule is designed to reflect that. Now for starters many of you are new here and are rather disobedient for that reason you will remain in your current position for the length of class. Am I understood,” she said. <br>\r\n<br>\r\n“UM,” ruby said. “Is there any way of knowing who hired you or what they want us to learn?” <br>\r\n<br>\r\nMistress XXX looks at the girl before she slaps her. “First off only speak if you are address,” she says. She then slaps ruby’s other cheek. “Secondly you do not ask questions. Thirdly I will admit it is a good question but you will just have to wait to see what type of person you become in the end. We do not disclose client information to anyone.” <br>\r\n<br>\r\nShe then spends an hour telling the student of why it is important for them to obey the rule and how they don’t want to face a punishment. “Now I am sure you are all hungry after your earlier classes. Now if you want to eat you just have to say ‘Headmistress may I please have some food,’ if you say that you will be fed,” she said. <br>\r\n<br>\r\n“Headmistress may I please have some food,” everyone but ruby said with practiced eased. Ruby just looks at them all in shock how they could just say that so easily. <br>\r\n<br>\r\n“Well looks like most of you will be getting normal food,” headmistress says. She then pushes a button and a few of her men come in with trays of food and starts to feed the other students. She then walks over to ruby and says, “Well looks like you don’t get to have any regular food today. Don’t worry we don’t want you to starve to death so you will get something to eat after that you will be punished by not following my orders.” <br>\r\n<br>\r\nShe asks for her men to get her the usual. The men goes to the desk and pulls out an open mouth gag, tubing and a funnel. When they returned she forced the gag into ruby’s mouth to keep it open she then takes the tubing into ruby’s mouth and secured it to the gag. When that was done she placed the funnel on the other end of the tube. Her men then have a bucket of bad smelling liquid. <br>\r\n<br>\r\n“This little concoction is very healthy for you. It has all your daily nutrients that you could need. Unfortunately I can’t say the same for the taste or smell those two factors are horrible about it. As your about to learn,” she said. What she did not mention was that their were drugs in all the food to make people more obedient over time. She then had one of the men start to poor it down the funnel as she held it in place. Ruby tried to resist but could not stop the liquid from going down the tube into her mouth. She felt like hurling the moment the substance touched her tongue. She couldn’t spit it out and to keep herself from choking on it she had to force herself to swallow the concoction. After a few minutes they emptied the bucket and forced the fluid down the tube till it was all gone. <br>\r\n<br>\r\nWhen they were done they removed the tube but put a plug on the gag to prevent her from puking. Mistress XXX then grabbed ruby’s chin and said to the class, “now let this be a reminder of the main lesson for this class. Those who don’t obey will be punished and those that do obey get rewarded. You all got nice meals fed to you while miss rose got our special soup force down her throat. Now miss rose I am going to remove the gag and you are going to apologize for being rude earlier and not ask for you food. <br>\r\n<br>\r\nAs she was removing the gag ruby was doing her best not to puke and then she heard what the woman said about having to apologize to her. Ruby is usually a pretty nice person but when she heard that she had a moment of rage that caused her to do something stupid. She took whatever was left of that soup in her mouth and when the gag came off she spit right into the face of the head mistress. When she did it she widen her eyes she could not believe that she did that. That was something yang would do not her. The whole room was also in silence. None of the students could believe the new girl did that. The silence was broken when a guard said, “Wow that took balls.”  When he finished that statement the headmistress snapped out of her shock and gave the girl a hard punch to the face causing her chair to fall over with her unconscious. <br>\r\n<br>\r\n“I guess this little bitch hasn’t learned her lesson yet,” she said. “I guess she will have to face further punishment. Guards bring her to one of the punishment rooms.” The guards got out of their stupor and walked over to unstrap the girl from the chair as they dragged her out of the room. “Class is dismissed,” she said as she followed after the guards. <br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat type of punishment will ruby face?<br>\r\n</span></div></div>",
            "created":1493787600,
            "id":2314607,
            "title":"submission 101"
        },
        "115333111112111121":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "domination 101",
                "pet training"
            ],
            "content":"<div class=\"\"><div> <span>The guards arrived at the punishment room and quickly removed all of miss rose’s clothes and took them out of the room. They then took her arms and attached them to a pair of manacles hanging from the ceiling. When they were done they saw XXX enter the room. She looked over their work and said, “Good job now leave.” She left no room for argument in her tone of voice. <br>\r\n<br>\r\nThey quickly followed her orders and left the room. When they left XXX took a bucket of water in the corner and threw the water at ruby. It caused her to wake up and start struggling in the chains till XXX came up and slapped her in the face. “Calm down slut you are about to receive three punishments for each of your transactions against me,” XXX said. <br>\r\n<br>\r\n“Three,” ruby replied. <br>\r\n<br>\r\n“Yes three. First was that you spit in my face, second that you embarrassed me in front of my workers and students and finally you disobeyed me and didn’t apologize,” she said. “Each punishment will be worse than the last, but hopefully at the end you will be more obedient. She then grabbed a whip from the wall and walked behind ruby. “Now I am going to give you twenty whippings and want you to keep count. After each whipping I want you to say, “Sorry for being a bad girl mistress” after you say the count. For each time you don’t say anything the whipping won’t count. Now let’s begin.” <br>\r\n<br>\r\nShe then sent the whip to hit Ruby’s back causing her to scream. “One I am sorry for being a bad girl mistress,” ruby yelled. This went on for a few minutes till the count reached twenty. The real number was twenty seven because ruby broke down in tears and couldn’t speak for a few of them. <br>\r\n<br>\r\n“There is your first punishment. The second punishment ties in with the first,” XXX said. She grabbed a bag of salt and poured some of it on to ruby’s back causing her to scream in pain. “Just embrace the pain. The salt in cleaning your wound the pain is cleaning away your bad deeds. “<br>\r\n<br>\r\nWhen she was done she took a few steps back to admire her work. When she could see the tears in ruby’s eyes she walked up to her and placed a hand on her cheek. “Do you think I enjoy punishing you,” she said in a gentle voice. “I don’t. I want all my student to be the best at what they are here to do and love to watch their growth. Every now and then I have to show tough love to them for them to help them become the good children they are supposed to be. Now your final crime was embarrassing me in front of your classmates so your last punishment will be an embarrassment to you in front of your classmates.” <br>\r\n<br>\r\nShe pulled out a marker from her pocket and removed the lid. She then started to write all over Ruby’s body. On her lower back she wrote the words ‘please slap me’ with arrows pointing at her ass. On her stomach with arrows pointing at her privates were the words ‘virgin looking for a good time.’ On her breast were the words, ‘please squeeze.’ On Ruby’s forehead was the word ‘whore’ and ‘please insert cock here’ written on her cheeks. <br>\r\n<br>\r\n“There we go,” XXX said. She pulled out a full body mirror so ruby could see what was written on her. When ruby saw the words that were written on her she could only leave her mouth hanging open in shock. She can’t believe she had these words written on her. “These words will remain on you till this time tomorrow. You also won’t receive your clothes back till then either. Now I think it is time I get you to your next class you have two more classes today till you can turn into your room tonight.” She then unhooked the cuffs holding ruby above the ground. When they first came off ruby started to fall to the ground but was caught but XXX she helped the girl to her feet before she led her out of the room. They walked in silence till they arrived at ruby’s next class and XXX opened the door and told ruby to enter. She did as ordered and entered the room looking at the ground not being able to look her classmates in the eyes. <br>\r\n<br>\r\nWhat is ruby’s next class?<br>\r\n</span></div></div>",
            "created":1494133200,
            "id":2315881,
            "title":"painful punishment"
        },
        "1153331111121111212":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "pet",
                "owner"
            ],
            "content":"<div class=\"\"><div> <span>When she worked up the courage she looked up to find herself in an area she would describe as an animal shelter. She couldn’t see anyone in the room but she could see collars and leashes on the wall as well as whips. There was also spray bottles and animal cages. <br>\r\n<br>\r\n“Hello there you must be the new student,” a voice said next to ruby. She turned towards the voice and sees a blond woman with a black coat with fur on the wrist and bottom of the jacket. She also had a fur wrapped around her throat. She also had maraca like beads in her hair. “My name is Cynthia, and I would like to welcome you to pet training,” the woman said. (It’s Cynthia from Pokémon). “In this class students are divided into two categories. They are as owner or pet.” <br>\r\n<br>\r\n“Owner and pet,” ruby repeated questionably. <br>\r\n<br>\r\n“Correct. The owners are trained in the proper way to take care of the pet and best ways to train the pets,” she explained. “The pets are trained to now their place and how to act like the animals they are supposed to be. The placement is decided by what the client wants the student to learn lets see what you are.” She looked through the papers and found ruby’s name and designation. “Okay looks like you are a ___________. Let’s go find you a partner.” <br>\r\n<br>\r\nShe led ruby to a different door and opened it to lead ruby inside. Once they were inside she closed the door behind her. <br>\r\n<br>\r\nWhat is Ruby’s category? <br>\r\n</span></div></div>",
            "created":1494133200,
            "id":2315997,
            "title":"pet training"
        },
        "11533311111211112122":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "the ways of intercorse  (basicaly a class all about having sex)",
                "transformation"
            ],
            "content":"<div class=\"\"><div> <span>Ruby was surprised to see Hinata in the room. She was sitting down on all fours wearing a collar with a leash attached to it. She also had what appeared to be cat ears on her head. Ruby had to suppress a laugh when she thought about Blake’s reaction to seeing that. “Pet welcome your new master,” Cynthia said. Hinata then started to crawl and ruby noticed that she had a tail as well. At first sight she thought it was attached to a belt at her waist, but then she noticed that there was no belt and looked more closely at the tail. When she saw where the tail was she instinctually covered her butt. She could not believe that they would shove anything there. <br>\r\n<br>\r\nSeeing her student reaction Cynthia could not leave the smile off her face. “Don’t worry the tail plugs are only for the pets during training. You are to be an owner not a pet. Now take your pets leash and let’s show you the training ground,” she said. Ruby looks hesitant for a moment before she reaches down and picks up the leash. They then followed Cynthia to a much larger room. “OK student are last pair has arrived so everyone gather around.” After she shouted that out about a good dozen people came to her. Ruby had to look away when she saw all of them look at her and heard a few of them laugh at her. she then focused on the ‘pets’ she saw that most of them were like Hinata but some had dog ears and tails rather than that of a cat. There were only two that were different. One was this fat girl who had pig ears and a tail she also had a pig’s nose placed on her. The other had two long pointed yellow ears with black tips. On her cheeks were two red circles and her tail went all the way up to her head shaped like a lightning bolt. <br>\r\n<br>\r\n“Good now that everyone is here let me introduce Owner ruby and her pet cat Hinata,” she said. “Now since these two are new let’s start with a quick explanation of the rules of this classroom. First only the owner is allowed to speak in human tongue. The pets are animals and as such are not capable of speaking English. Second the pet must remain with their master at all times and not try to run away. Violation of these two rules will result in punishment for both parties.” She looked at Hinata and ruby to make sure they understood. They each gave a quick nod of their heads to show they understood. <br>\r\n<br>\r\nWith that done Cynthia said, “Well since we have two new students let’s start off easy with a quick walk around the playground and then the owners and play with their pets for a bit,” she said as she started to walk around the training ground a few times. When they were done she had everyone separate so they can have some time to play with their pets. Ruby looked around and saw that some of the dog girls was chasing after sticks or rolling around in the dirt following master’s orders. Some of the cats were playing with cat toys that there masters. The pig girl went to an area filled with mud and started to roll around in it while the other girl just laid in her master’s lap eating an apple. <br>\r\n<br>\r\nCynthia walked over to the girls and said, “Well now you can play with your pet in any way you like except for in a sexual way. That is only for special lessons. This class is all about teaching you to take care of your pet and the experience of treating another human as an animal or being an animal. You can find the toys for play in the tote over there.” She pointed at a tote that was sitting against the wall. They walked over to it and opened it up. Inside of it were several toys that Ruby had used with Zwei. There were other toys that she had seen in the pet store before designed to be used by cats. She picked up some of the stuffed mice from it and dangled it in front of Hinata. Seeing this Hinata figured out what she was supposed to do and started to swat at the mice. The two walked to an empty area of the training ground and started to play with the mice. They switched to the laser pointer for a bit till they were called by Cynthia. <br>\r\n<br>\r\n“Okay class that is all for today. Now Hinata why don’t you show her the way to your next class,” she said as she led the students out of the classroom. When they entered the preparation area the pets got into a sitting position as the owners removed the ears, tails and collars. Seeing that she was supposed to remove the parts from Hinata. she easily to remove the ears and collar but hesitated  when she got to the tail she turned her head the other way while whispering sorry to Hinata as she quickly pulled out the tail. This action caused Hinata to let out a moan. Ruby then helped Hinata stand up and lead her to the changing room so she can get dressed. When she came out the two talked for a bit as they went to their next class ruby noticed that Hinata looked hesitant for this next class and that caused Ruby to get even more nervous about it. <br>\r\n<br>\r\nWhat is there final class for the day?<br>\r\n</span></div></div>",
            "created":1494219600,
            "id":2316341,
            "title":"owner"
        },
        "115333111112111121221":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "rough",
                "gentle"
            ],
            "content":"<div class=\"\"><div> <span>Ruby and Hinata walked into the classroom and Ruby cold see several beds but no desks. She looked around for a place to sit but could not find any. All the boys in the class were standing by the wall while all of the girls were sitting on one of the beds. Hinata grabbed her arm and brought ruby to two open beds with her sitting on one of them while ruby sat on the other. <br>\r\n<br>\r\n“Hey Hinata what class is this,” Ruby asked. <br>\r\n<br>\r\nHinata was about to answer but before she could a voice spoke behind them saying, “This is sex education class.” Ruby turned around and sees a woman with long wavy black hair and mauve eyes. She had a gorgeous figure in a dress that barely covered her breast. “My name is lust and this is not your schools sex ed class. Hear have something to drink.” She hands both of them a bottle of water while going to the other girls and doing the same thing. All of them took a few sips of the water as well but were slightly hesitant. <br>\r\n<br>\r\nLust then walked to the front and said, “Well class this is sex ed. This is the class wear I teach you how to have sex and the best way is to just jump into it. However I have been informed our new student is a virgin so we will take the usual course for one.” she then turns to ruby and smiles. Ruby could not help but feel nervous from the smile. She also wonders why she is starting to feel so hot right now. <br>\r\n<br>\r\nIs the class rough or gentle on virgins?<br>\r\n</span></div></div>",
            "created":1496379600,
            "id":2329736,
            "title":"sex ed"
        },
        "1153331111121111212211":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "one person",
                "gangbang"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it one person or gangbang</span></div></span></div>",
            "created":1496379600,
            "id":2329738,
            "title":"rough"
        },
        "1153331111121111212212":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "escape",
                "classes"
            ],
            "content":"<div class=\"\"><div> <span>\"Now i believe that the first time should be special so i try to be gentle with them,\" Lust said. she reached into a hidden drawer on the wall and pulled out a strap on dildo. she placed it on her self and walked to ruby. \"now the rest of you boys will pick a partner and  go on like normal. ill take care of miss rose myself.\" <br>\r\n<br>\r\nWith her orders each male walked to the girls and joined them on the bed while both sides removed their clothes while some did so hesitantly others removed their clothes quickly. as this was going on lust got on the same bed as ruby and forced her onto her back. as this was going on ruby could feel herself heating up some more. <br>\r\n<br>\r\n\"the water is laced with a special drug to help my students get into the mood and more complacent,\" Said lust. \"Now just lay still and let me do all the work for now i know it can be scary and painful the first time but you will get used to it.\" with that said she started to slowly thrust the dildo into ruby's soaking pussy. <br>\r\n<br>\r\nRuby started to get terrified and tried to fight it. Lust response was placing a hand on her shoulder and going deeper into ruby. as she was about to fully enter her Ruby let out a moan of pleasure as she cringed from the pain. lust continued to pull out and reenter ruby for a few more times before she said, \"Get ready I'm about to pick up the pace.\"<br>\r\n<br>\r\nWith that said she started to pound into ruby with a bit more force and speed than before she kept picking up the pace till ruby let out a moan of pleasure and had an orgasm from the expereince. they continued like this for an hour and stopped a few times for a breather. when the hour was up lust layed in the bed with ruby holding her gently whie saying, \"Well done sweatie that was a great time next time we will have one of the guys take you with a bt more force. trust me when i say while this may feel nice it does not compare to the real thing.\" <br>\r\n<br>\r\nshe then gets up and walks to the front of the class and said, \"Well every one that is it for today now head to the cafeteria and get some supper and head to bed. oh yeah hinata Ruby is your new roommate so be a dear and show her the way.\" <br>\r\n<br>\r\n\"Okay mam,\" Said Hinata a bit out of breath. <br>\r\n<br>\r\n\"Remember children you only get this class for the beginning of your stay and then move on to the preference of the client,\" She said as she left the room. <br>\r\n<br>\r\nHinata helped ruby out of the bed and the two followed the rest of the class after they got dressed to the cafeteria. after each of them get a simple soup and salad they went to the table on the far corner of the room and started to talk. <br>\r\n<br>\r\n<br>\r\nWhat do they talk about?<br>\r\n</span></div></div>",
            "created":1515906000,
            "id":2440918,
            "title":"gentle"
        },
        "11533311111211112122122":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "continue to talk",
                "move on to their room"
            ],
            "content":"<div class=\"\"><div> <span>\"Man i thought classes back at beacon where bad,\" Said ruby. <br>\r\n<br>\r\n\"Yeah i know but it could be worse from what i heard about some of the other teachers in the advance classes,\" said Hinata. <br>\r\n<br>\r\n\"How,\" asked ruby with a hint of fear. <br>\r\n<br>\r\n\"Well from what i heard advance sadism and masochism are ran by a teacher named Esdeath and she doesn't consider it passing in sadism unless you leave te person a broken mess, and with advance masochism you have to get off on the tiniest of cuts even paper cuts. then of course you have Orochimaru in transformation how sometimes turns his students into test subjects for his newest creations,\" Said hinata. <br>\r\n<br>\r\n\"What type of creations,\" Asked ruby. <br>\r\n<br>\r\n\"Well from what i heard he has developed different drugs that causes unique changes to the human body from making the person unable to move to making them a complete bimbo. the last one is actually used in a different class,\" said hinata<br>\r\n<br>\r\n\"Man now i am afraid of what my other classes are going to be,\" said ruby. \"So how do you know what your classes are going to be i was just following people around all day is it going to be like that till i memorize the schedule?\" <br>\r\n<br>\r\n\"No that is just the first day,\" said hinata. \"When we get into our room you will see your schedule as of now till you move on to the advance classes. that is also how you can tell what the client wants you to become. with mine they seem to want me to be a submissive house wife. their might be more to it when i advance to higher classes but that is what i have now. <br>\r\n<br>\r\n\"i see,\" said Ruby. she started to slowly eat her soup <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nDo they continue to talk or move on to their room<br>\r\n</span></div></div>",
            "created":1518411600,
            "id":2451997,
            "title":"classes"
        },
        "115333111112111121221222":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>is this how rubys schedule look like: <br>\r\nMonday, wedsnday Friday<br>\r\n8-945<br>\r\nDomination 101<br>\r\n10-1145<br>\r\nino to sadism<br>\r\n12-145<br>\r\nSubmission 101<br>\r\n2-345<br>\r\nmild muscle course<br>\r\n4-545<br>\r\nsex ed<br>\r\nTuesday and Thursday<br>\r\n8-945<br>\r\ncorruption course<br>\r\n10-1145<br>\r\nintro to bondage<br>\r\n12-145<br>\r\nsubmission 101<br>\r\n2-345<br>\r\nhow to train your pet<br>\r\n4-545<br>\r\nsex ed<br>\r\n</span></div></div>",
            "created":1521522000,
            "id":2466874,
            "title":"schedule"
        },
        "1153331111121111212212221":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "breackfast next morning",
                "jump to first class",
                "continue to talk for a while"
            ],
            "content":"<div class=\"\"><div> <span>\"Well this seems to be my schedule what do you think it says about what they want me to become,\" Ruby asks handing the schedule to Hinata. <br>\r\n<br>\r\nshe took the schedule and looked at it for a few minutes before she spoke. \"It seems they want you to be a sadistic villain. the muscle course says they want you to stay in shape so they do expect you to keep fighting afterwards but the corruption and the fact you are a master in the pet course says you will need to be a Dom at times but still submissive to your master.\" <br>\r\n<br>\r\n\"Well I wont break that easily,\" said Ruby. <br>\r\n<br>\r\n\"Good luck with that,\" said Hinata. \"I think it might be best to just go with the plan for now. just top avoid punishments.\" <br>\r\n<br>\r\n\"yeah just till I can come up with an escape plan,\" said Ruby \"don't worry ill take you with me.\" <br>\r\n<br>\r\n\"thanks,\" Said hinata. <br>\r\n<br>\r\nunseen by them is a small bug underneath there beds. in her office the headmistress just smirks and says, \"Go ahead and try but eventually you will break they all do.\"<br>\r\n<br>\r\n<br>\r\ndo the pair go to bed or stay up a little longer?</span></div></div>",
            "created":1586463480,
            "id":2816271,
            "title":"yes"
        },
        "11533311112":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "domination or submissive ",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about domination or submissive 101?</span></div></span></div>",
            "created":1493701200,
            "id":2313871,
            "title":"dominate or submissive"
        },
        "115333111122":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "transformation",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe she is transformed into a Faunus or even more animal like</span></div></span></div>",
            "created":1493701200,
            "id":2313872,
            "title":"transformation"
        },
        "1153331111222":{
            "author_id":"johndoe94",
            "author_name":"theunknown one",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe one of these</span></div></span></div>",
            "created":1494478800,
            "id":2317904,
            "title":"Bimbofication or stepfordization?"
        },
        "11533311112221":{
            "author_id":"johndoe94",
            "author_name":"theunknown one",
            "choices":[
                "Bimbofication",
                "Stepfordization "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1494478800,
            "id":2317905,
            "title":"Yes"
        },
        "11533311112222":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Weight Gain Economics 1",
                "Weight Gain Economics 2",
                "More classes, please!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, then what about these two?</span></div></span></div>",
            "created":1535605200,
            "id":2540805,
            "title":"No"
        },
        "115333111122223":{
            "author_id":"cookiecat1234",
            "author_name":"Cookiecat1234",
            "choices":[
                "Futanari Training Class",
                "Shemale Training Class",
                "Micro/Macro Class",
                "More Classes, Please!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these classes?</span></div></span></div>",
            "created":1550034000,
            "id":2617347,
            "title":"More classes, please!"
        },
        "1153331111222234":{
            "author_id":"squidlord",
            "author_name":"Squid lord",
            "choices":[
                "Introduction to nastiness",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a stink and gross girl training course?</span></div></span></div>",
            "created":1563685200,
            "id":2690415,
            "title":"More Classes, Please!"
        },
        "115333112":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "Yang",
                "Blake"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1493701200,
            "id":2313849,
            "title":"bumblebee"
        },
        "1153331121":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Submission 101.",
                "Domination 101.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of fetish will she be learning?</span></div></span></div>",
            "created":1535691600,
            "id":2541196,
            "title":"Yang"
        },
        "11533312":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Team JNPR.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Someone from Team JNPR?</span></div></span></div>",
            "created":1535691600,
            "id":2541198,
            "title":"someone else"
        },
        "115333121":{
            "author_id":"johndoe94",
            "author_name":"theunknown one",
            "choices":[
                "Jaune/Pyrrah",
                "Ren/Nora"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which member of team JNPR will it be</span></div></span></div>",
            "created":1535864400,
            "id":2541777,
            "title":"Team JNPR."
        },
        "1153332":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Cardcaptor Sakura ?</span></div></span></div>",
            "created":1511067600,
            "id":2417023,
            "title":"no"
        },
        "11533321":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First we have to pick a character ?</span></div></span></div>",
            "created":1511067600,
            "id":2417024,
            "title":"Yes"
        },
        "115333211":{
            "choices":[
                "Syaoran Li",
                "Another male character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now , which male Character ?</span></div></span></div>",
            "created":1511067600,
            "id":2417025,
            "title":"Male"
        },
        "1153332111":{
            "choices":[
                "Trap fetish",
                "Another fetish"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now , which Fetish class will Syaoran be force to take ?</span></div></span></div>",
            "created":1511067600,
            "id":2417027,
            "title":"Syaoran Li"
        },
        "11533321111":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Mistress XXX was reading the file , on her newest student. Name Syaoran Li , senior in highschool , hobbies martial arts , sword fighting , several sports , looking at the unconscious Syaoran. She could tell he had a very well tone body , she grinned wickedly as she read what class Mr. Like would be going to. She licked her lips , OH the irony , she was going to enjoy this one. She slap Syaoran face hard.<br>\r\n<br>\r\nSyaoran was jerk out of his sleep , by a hard slap. It took him a minute to get focus , he was in a officer room. He had no clue on how he got here , then he noticed her. His eyes widen , sitting on her desk was a glorious woman. She had an hour glass figure , with massive breasts E cups at least , She had long slender legs , she had long red hair and piecing blue eye. She was wearing a black business suit jack , a white blouse , with several buttons unbuttons showing off a lot of cleavage and some of their black lace bra , she was also wearing a black mini skirt with fishnet stockings and black heels.<br>\r\n<br>\r\nA part of Syaoran was turn on by her , but she had a wicked smile , that made Syaoran frighten. \" Well , hello Mr. li , glad to see you up. My name is Mistress XXX , and welcome to Kinky Academy.\" Said Mistress XXX , Syaoran was very nervous at hearing the name of the place he was in. \" You must be wonder why you are here and what is in store for you. Well here at Kinky Academy we pride ourselves on making every student here a master on any fetish that they are a sign to. We have a 100% , graduation rate , so trust my you will be a master by graduation. \" Said Mistress XXX , Syaoran just stared at her definitely. Mistress XXX , loved the looked on Syaoran's face , she was going to enjoy wiping it off his face. <br>\r\n<br>\r\n\" Now , you must be wondering what fetish you have been a sign , well it a very special one. It's are very special Trap program.\" Said Mistress XXX , it took Syaoran to realized what that was. He tried to jump out of his chair , but realized he was tied to it. <br>\r\n<br>\r\n\" Mr. Li , no one has ever escape from my Academy , and try as you might , but resistance is pointless. Like said earlier we have a 100% success rate. So I suggest you just except your fate , and don't cause ant trouble.\" Said Mistress XXX , with a wicked grin. Syaoran was furious , he was still trying  to get out of his chair , he was not going to let this woman of her academy make him a trap. <br>\r\n<br>\r\nMistress XXX snapped her fingers , and two guard came in. They untied Syaoran from his chair, and grab him before he could escaped. Then they drag him out of Mistress XXX officer, and into the academy. Syaoran was shrugging to get free of the guards , the whole time. After a few minutes , the guards toss him into a class room.<br>\r\n<br>\r\nSyaoran looked around , he saw several boys and girls in the class room. Syaoran then realized all the girls where boys , he was about to leave the class room when the teacher came in. She was tall with long blonde hair and blue eyes. She was wearing a long blue dress , she was smiling at him.<br>\r\n<br>\r\n\" Well , you must be are new student. Mr. li right , well I'm Mr. Lace your Trap teacher.\" He said , Syaoran jaw drop she was he.<br>\r\nHe looked him over , this made Syaoran nervous. \" First , you have to change into your new uniform.\" Said Mr. Lace , as he handed Syaoran a bag. Syaoran refuse to go a lone with this nonsense , he stood defiant at the teacher.<br>\r\n<br>\r\n\" Well Mr. Li , I see you have not excepted you place here. So I will give one more change to behave and put on your new uniform or I will just have to force you to put it on.\" Said Mr. Lace with a smiled.<br>\r\n<br>\r\nWhat does Syaoran do ?<br>\r\n<br>\r\nOption 1: Do as he was told , strip and put on the uniform.<br>\r\n<br>\r\nOption 2: Refuse , and let Mr. Lace strip him and force to wear it.<br>\r\n</span></div></div>",
            "created":1511067600,
            "id":2417033,
            "title":"Trap fetish"
        },
        "115333211112":{
            "choices":[
                "Picking out lingerie",
                "Putting on make up"
            ],
            "content":"<div class=\"\"><div> <span>Syaoran stood definitely , he was not going to let this teacher intimidate him. Mr. Lace licked his lips , he loves it when they resist. <br>\r\n\" I guess you want it the hard way , I love the hard way.\" Said Mr. Lace , Syaoran ready himself , Mr. Lace just smiled. <br>\r\n<br>\r\nSyaoran decided to make the first move , he charge at the teacher. Mr. Lace giggled as he simply move to a side , and tripped Syaoran. Syaoran landed on the floor , and before he recover , Mr. Lace pounced. He landed on Syaoran's legs , \" You see Mr. Li , I like to strip my disobedienced student , piece by piece to increase their humiliation. To make sure they know , they are completely at my mercy. \" said Mr. Lace , Syaoran was  still trying to get up. Then Mr. Lace grabbed Syaoran legs. \" Now , let start with these shoes.\" Said Mr. Lace , as he untie Syaoran's shoes , and toss them into the class's trash can. <br>\r\n<br>\r\nMr. Lace then got up , Syaoran jumped up and charge again. Mr. Lace smirk , as he dodge a punch from Syaoran. Then Mr. Lace grab Syaoran's arm , and twists it behind Sayroan , then Mr. Lace grab Syaoran's other arm and pull it back too. Then grabbing both of Syaoran's wrists in one hand. Syaoran was struggling to break free , but it was in vain. Mr. Lace grip was just to strong , then Syaoran saw Mr. Lace other hand reach for the buttons on Syaoran's shirt. To Syaoran's horror , Mr. Lace began to unbutton them , starting from the top and working his way down. Syaoran was blushing , as his shirt was undone , he had to break free before Mr. Lace strip him further. Once , Mr. Lace was done unbuttoning Syaoran's shirt , he grab the collar , and then he release his grip in Syaoran and kick him forward , pulling Syaoran's shirt off him , and finally tossing it into the trash can.<br>\r\n<br>\r\nSyaoran got up , and turn to Mr. Lace , he was searing with rage. M . Lace was checking out Syaoran , \" Well that body just won't do. It's far to hairy and when tone. Traps's need to have a very cute figure. Well don't you worry this class will fix that.\" Said Mr. Lace smirking. This made Syaoran mad , and charge again , Mr. Lace sigh and duck down grabbing Syaoran by his waist and turn him around. Then Mr. Lace quickly undid his belt and pants , and then pulling them down. Syaoran blushed a new shade of red , as he heard the class laughing. He tried to pull his pants up , but Mr. Lace push Syaoran out of them , toss them into the trash can.<br>\r\n<br>\r\nSyaoran was so embarrass now , being strip to his underwear , and being completely helpless against Mr. Lace. \" Now , Mr. Li those boxers , just have to go. \" said Mr. Lace with a laugh , Syaoran was to embarrass to move. Mr. Lace walk up to Syaoran , \" Now Mr. Li , please remove your boxers , and hand them me.\" Ordered Mr. Lace , Syaoran was not going to give in.<br>\r\n<br>\r\nHe trying kicking Mr. Lace , but Mr. Lace was just to fast. He grab Syaoran's leg and quickly pulling off Syaoran's sock. Syaoran tried again with his other leg , but the Mr. Lace stopped it , and took off his other sock.<br>\r\nNow clad only in his boxers , Syaoran felt defeated. Mr. Lace took this moment to , grab Syaoran's boxers and rip them off of him. Then he toss them into the trash , Syaoran realized what just happen , and quickly cover himself.<br>\r\n<br>\r\nThe class was laughing like crazy , and Mr. Lace just giggled. \" Now , Mr. Li you have two choices , either you can stay naked for the rest of the school day , or put on your new uniform.\" Said Mr. Lace , Syaoran was completely humiliated. He was strip naked , and he couldn't stopped it. He didn't wanted to be naked for the whole day , so he had no choice. \" I will put on the uniform Mr. Lace.\" Said Syaoran in a defeated tone , Mr. Lace smiled , and walked over to the bag.<br>\r\n<br>\r\nThen he started to handed Syaoran pieces of his new uniform. First was a pair of black thigh stockings , Syaoran had trouble putting them on. Next was a pair of green silk panties , Syaoran felt humiliated putting them on. Next came a green corset , Mr. Lace helped Syaoran putting it on. The corset was very tight and Syaoran had a tuff time breathing. Then was the uniform , it was short green skirt and green and black sailor fuku. Syaoran hated putting them on , once he was done , Mr. Lace looked him over.<br>\r\n<br>\r\n\" Your so cute now , Mr. Li. Now go sit down.\" Ordered Mr. Lace , Syaoran took his sit in shame. \" Now class , are first lesson for today is in.... </span></div></div>",
            "created":1511413200,
            "id":2419119,
            "title":"Option 2"
        },
        "1153332111121":{
            "choices":[
                "Try to escape",
                "Go to his room and meet this student"
            ],
            "content":"<div class=\"\"><div> <span>Syaoran had to endure a whole class about lingerie , how to put on , all the different types and how to match it with different clothes. Syaoran was still piss at what happen to him , he was trying to come up with a plan to escape. <br>\r\n<br>\r\nOnce the class was over , Mr. lace asked him to stay. Syaoran walk over to Mr. Lace's desk , he did his best not scowl at him.<br>\r\n\" So Mr. Li , enjoy your first class ?\" Ask Mr. Lace , some what mockingly. Syaoran didn't answer , \" Well since your new here , you are going to be put with another student in the Trap course. Since he is almost complete with the course , his job is to help adjust to the course.\" Said Mr. Lace  , handing Syaoran a piece of paper.<br>\r\n<br>\r\nSyaoran left the classroom , he thought of what to do next. He could fine away to escape or he could go to his new room. <br>\r\n<br>\r\nWhat does Syaoran do next ?</span></div></div>",
            "created":1521781200,
            "id":2468487,
            "title":"Picking out lingerie"
        },
        "11533321111212":{
            "choices":[
                "Issei Hyoudou ( Highschool DXD)",
                "Ichika Orimura ( Infinite Stratos)"
            ],
            "content":"<div class=\"\"><div> <span>Syaoran slowly walked to the dorms , he wanted to escaped but realized that most likely the school had him under surveillance. Who ever wanted him here and to be turn into a TRAP wouldn't want him to escape , plus being a new student the head mistress , would make sure he was watch.<br>\r\n<br>\r\nAs Syaoran make his way to the dorms , he saw other students , both girls and boys. Some looks normal , why other where dress in all kinds of clothes. Some in leather catsuits , weird very feminine dresses , some students look to have animal fuse on them , their where blonde girls where some of the sluttiest clothes he ever saw.<br>\r\n<br>\r\nThose girls giggle and talk like they only care about sex and where very unintelligent. Some students scared him , the smile he saw on their faces look so malevolent , he gulped just looking at them. Some student where so fat or muscular , he didn't know how they move.<br>\r\n<br>\r\nAfter a few minutes Syaoran would do anything to get out of this mad house. Soon he reach the dorm he been assigned , he sighed as he open the door. His plan was to get any info about this school , so he could make a plan of escape.<br>\r\n<br>\r\nWhen Syaoran saw the inside of the dorm , he was froze in horror. The whole room was pink , with lace , fills and ribbons covering everything. He saw all kinds of feminine things , like stuff animals , make up and perfume and many other girly things. <br>\r\n<br>\r\nHe notice two beds , both where pink and cover in lace and fills. He also saw two closets , he feared looking inside. Two chest of drawers and to desk with large mirror , they where both pink and had many feminine items on them. <br>\r\n<br>\r\nHe didn't see this student , but heard a shower going. He saw hallway , most likely going to the bathroom. Syaoran decide to wait on a bed , he was nervous. He didn't know who to except , he wonder how feminine was this student , was he going to try to convince him just to except becoming a TRAP or maybe he was planning a escape too.<br>\r\n<br>\r\nAfter an half an hour , he heard the door to the bathroom open , Syaoran waited to meet this student. Syaoran blushed at seeing him , he was gorgeous , Syaoran had trouble realizing that this was a guy. He was wearing a very short and sheer black negligee , that is when Syaoran saw them. This guy had a pair of giant breasts , that a black lace strapless bra barley held. Syaoran looked down at the guy panties , he saw a bulge. So Syaoran knew this was a guy , Syaoran was so shock he didn't know what to saw.<br>\r\n<br>\r\n\" So you must be the new student , that I'm assign to help adjust to becoming a TRAP.\" Said the guy , his voice was very feminine Syaoran thought. Syaoran looked up at him , he gulped. <br>\r\n<br>\r\n\" My name is....<br>\r\n<br>\r\n</span></div></div>",
            "created":1525582800,
            "id":2489360,
            "title":"Go to his room and meet this student"
        },
        "1153332111122":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "Go and let Mr. Lace put make up on him",
                "Take detention with Mr. Lace"
            ],
            "content":"<div class=\"\"><div> <span>Syaoran just sneered at Mr. Lace , as he went on about blush , lipstick , mascara and varies other types of make up. Syaoran was not going to take part this classes , he was not going to let Mr. Lace or any other teacher in this crazy school feminize him. No he was going to escape this place and soon.<br>\r\n<br>\r\nAs Syaoran thought of a way to escape this school , Mr. Lace noticed that Syaoran was not paying attention. Well that wouldn't do , Mr. Lace thought , guess he had to teach Syaoran other lesson in obeisance. <br>\r\n<br>\r\n\" Mr. Li , since you seem not to care about the lesson. How about you come up and I will show you personally how to put on male up.\" Said Mr. Lace smiling.<br>\r\n<br>\r\nSyaoran just sat at his seat , sneering at Mr. Lace. He was not going to let someone put make up on him. Both Syaoran and Mr. Lace stared at each other for a minute , then Mr. Lace smirk.<br>\r\n<br>\r\n\" OK then , if you are refusing to cooperate , then I have no choice but to give you detention. \" said Mr. Lace , the rest of the class gasped , many lower their head and blushed. They where all thinking back to their detention with Mr. Lace.<br>\r\n<br>\r\nSyaoran saw how the class was reacting , their reacting made Syaoran a little nervous. Then he looked back to Mr. Lace and Syaoran's blood ran cold. The glare in his eyes and the way he licked his lips , Syaoran gulped in terror.<br>\r\n<br>\r\nHe began to reconsider letting Mr. Lace put make up him. Syaoran blushed and sweat as the predatory glare of Mr. Lace. <br>\r\n<br>\r\nWhat does Syaoran decide to do ?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1531285200,
            "id":2518551,
            "title":"Putting on make up"
        },
        "11533321111222":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "Slowly strip Syaoran ",
                "Give Syaoran a nice long spanking"
            ],
            "content":"<div class=\"\"><div> <span>Syaoran had to make a choice , he sighed. He wasn't going to let this teacher or school turn jin into a trap , he had to much pride to just let it happen. <br>\r\n<br>\r\nHe folded his arms and sneered at Mr. Lace , do your worse Syaoran thought. Mr. Lace just smirk at him , \" Well so be it , detention Mr. Li and I going to love stripping that pride off you.\" Said Mr. Lace , licking his lips , Syaoran blushed at comment. He had a feeling the stripping part , means more then his pride.<br>\r\n<br>\r\nThe class whispered to themselves , Syaoran didn't pay any attention to them. He was survive the detention and escape this place. The class end and the rest of the students left , some looked at him.<br>\r\n<br>\r\nSyaoran just sat in his seat , waiting for Mr. Lace detention. Mr. Lace went to the door and locked it , he turn to Syaroan.<br>\r\n<br>\r\n\" You brought this on yourself , Mr. Li. I going to love stripping your male pride and making you the most adorable and submissive trap.\" Said Mr. Lace , Syaoran just stared defiantly at him , he was going let him break him.<br>\r\n<br>\r\nMr. Lace went to his desk , he then slid off his dress. Then he pulled a bag and quickly change into his detention clothes.<br>\r\n<br>\r\nHe walked over to Syaoran's desk , Syaoran saw Mr. Lace new clothes. He blushed then gulped , he was a wearing a black leather corset , panties , gloves , fishnet stockings and black heels.<br>\r\n<br>\r\nHe holding a pair of handcuffs , <br>\r\n\" Now Mr. Li put these on.\" Said Mr. Lace with a smirk as he place the handcuffs on the desk.<br>\r\n<br>\r\nSyaoran just stared at him in defiance , Mr. Lace just smiled. This was going to be fun , he thought. Mr. Lace quickly pulled Syaoran up and smashed him on top of another desk. <br>\r\n<br>\r\nThen he grabbed the handcuffs and then grabbed one of Syaoran's arms. Syaoran tried to get free but Mr. Lace was too strong , then he felt cold metal on his wrist. Syaroan tried to stop Mr. Lace from cuffing his other wrist behind his back but Mr. Lace was just to fast.<br>\r\n<br>\r\nSyaoran tried to break the cuffs but they where to strong , Mr. Lace lower himself and started whispering into Syaoran's ear.<br>\r\n<br>\r\n\" Don't worry , you might hate this at first but by the end of detention your going to loving it.\" Whispered Mr. Lace , this made Syaoran blushed and scared.<br>\r\n<br>\r\nWhat does Mr. Lace do next ?</span></div></div>",
            "created":1531458000,
            "id":2519562,
            "title":"Take detention with Mr. Lace"
        },
        "115333211112222":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "Syaoran had a very erotic dream",
                "Syaoran woke up in the mourning , with a knock at his door"
            ],
            "content":"<div class=\"\"><div> <span>Mr. Lace , grinned as he lift up Syaoran's skirt. Then he groped his ass , this made Syaoran gasped. Then Mr. Lace slapped him the ass , Syaoran squealed in pain. Mr. Lace continue the spanking , each slap on his Syaoran's ass earn a squeal.<br>\r\n<br>\r\nFor several minute the spanning continue , soon Syaoran started moaning. This made blushed , he couldn't believe he was enjoying this.<br>\r\n<br>\r\n\" Like I said , you will enjoy it.\" Said Mr. Lace , with a smirk. Then Mr. Lace turn Syaoran over , then he started to unbutton his shirt. Once done , he remove the corset. He grinned and then started licking Syaoran's nipples , Syaoran bit his lips. He refuse to give in , he will not give Mr. Lace the satisfaction of him liking this.<br>\r\n<br>\r\nAfter 30 minutes , Syaoran was panting and worse he getting hard. Then Mr. Lace slid Syaoran's skirt off , then he rub Syaoran manhood through his panties.<br>\r\n<br>\r\nAfter a few minute , Syaoran couldn't hold anymore. He started moan out loud , this made Mr. Lace giggled. After an hour , Syaoran couldn't take anymore ,\" Please I need to cum !\" Shout Syaoran , this made Mr. Lace laughed.<br>\r\n<br>\r\n<br>\r\n\" You want release ?\" Asked Mr. Lace , in a coy tone. Syaoran could only nod with a whimper.<br>\r\n<br>\r\n\" First apologize for your behavior in class.\" Said Mr. Lace , Syaoran had no choice. He said he was sorry , Mr. Lace shook his head. Louder , demand Mr. Lace , Syaoran screamed he was sorry.<br>\r\n<br>\r\n\" Good boy.\" Said Mr. Lace , as he pat Syaoran head. <br>\r\n<br>\r\n\" Now I wanted to you to put on the make up.\" Said Mr. Lace as place a make up kit in front of Syaoran. Then he uncuffed Syaoran , Syaoran rub his wrists.<br>\r\n<br>\r\nMr. Lace handed Syaoran lipsticks , he grabbed the lipstick and Mr. Lace taught him on to put it on. Then Mr. Lace handed other make up , mascara , blushed and eyeliner.<br>\r\n<br>\r\nOnce Mr. Lace was done , he show Syaoran's face in a mirror. He blushed , he look so cute and made him feel more embarrass.<br>\r\n<br>\r\nWhich turn him on even more , then Mr. Lace started giving Syaoran a hand job. After a few he screamed as he cummed.<br>\r\n<br>\r\nSyaoran was panting , and felt totally humiliated. <br>\r\n<br>\r\n\" OK  Mr. Li , remove your clothes.\" Order Mr. Lace , Syaoran nodded as stripper naked.<br>\r\n<br>\r\nThen Mr. Lace order him to follow him , Mr. Lace lead Syaoran through the school. Syaoran was glad no one was in halls.<br>\r\n<br>\r\nSoon they reach a room , \" This your room Mr. Li. A student who almost have completed the Trap course will be here in the mourning , to show you around the school. So I expect you to behavior or it will be another detention. \" said Mr. Lace , Syaoran just nodded.<br>\r\n<br>\r\nSyaoran entered the room , he went straight to bed. He didn't pay attention to his new room , he just wanted to go to sleep.<br>\r\n<br>\r\nWhat happen next ?</span></div></div>",
            "created":1535000400,
            "id":2538018,
            "title":"Give Syaoran a nice long spanking"
        },
        "1153332111122221":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "Syaoran took a shower",
                "He heard a knock at the door"
            ],
            "content":"<div class=\"\"><div> <span>Syaoran was walking through his school , just like a normal day , except he was wearing a sailor fuku. It was green and black , the skirt was very short. He was also wearing a pair of black thigh high stockings and a pair of black heels.<br>\r\n<br>\r\nHe entered a class room , the room was empty. He sat at a desk , he waited for minutes. Then the classroom door , Syaoran blushed , Sakura his girlfriend walked in.<br>\r\n<br>\r\nHe lower his head , wearing this sexy girl clothes made him embarrass. <br>\r\n<br>\r\n\" Get up.\" Said Sakura , Syaoran gulped as he did. Then she pulled him into a kiss , this stunned him. Then she drag Syaoran to teacher's desk and shove him over it. Then she got on her knees , then she grabbed Syaoran's panties and pulled them down.<br>\r\n<br>\r\n\" What cute panties Syaoran , you always choice the best lingerie.\" Sakura said with a smirk. Then made Syaoran blushed , then put her head under his skirt and started to give Syaoran a blowjob.<br>\r\n<br>\r\nSyaoran was moaning crazy , he was panting. Syaoran was lost in pleasure , soon he screamed when he climax. Sakura was smiling  , \" You sound so girly Syaoran , that his so sexy.\" Said Sakura , for some reason this made Syaoran happy. Sakura got on top him , she lean in.<br>\r\n<br>\r\n\" Remember , you look go as girl.\" Sakura whispered into Syaoran's ear.<br>\r\n<br>\r\nThen Syaoran woke , he was sweating and panting. He couldn't believe he had a dream like that. Then he realized his manhood was throbbing , this made embarrass.<br>\r\n<br>\r\nWhat happen next ?</span></div></div>",
            "created":1535086800,
            "id":2538343,
            "title":"Syaoran had a very erotic dream"
        },
        "11533321111222211":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "He heard a knock at the doot",
                "Look for something to wear "
            ],
            "content":"<div class=\"\"><div> <span>Syaoran sighed , he was still upset with that dream he just had. He knew he couldn't get back to sleep , so he decide to take a shower. He found the bathroom , he turn on the light.<br>\r\n<br>\r\nHe groaned as he saw it , it was pink and fuzzy. He frowned , he had to get out of here. He didn't had a choice , so he headed into the shower. The soap and shampoo where both scented , as he washed. The noticed his body hair felt off and his skin was becoming silky and smooth.<br>\r\n<br>\r\nThe shampoo made his , silky and shiny. He sighed as he got out and dry himself off. Then he did the rest of his normal bathroom routine.<br>\r\n<br>\r\nOnce he was done , he walked only wearing a short pink towel. <br>\r\n<br>\r\n<br>\r\nWhat happen next ?</span></div></div>",
            "created":1535605200,
            "id":2540903,
            "title":"Syaoran took a shower"
        },
        "115333211112222112":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "He put something on",
                "He heard a knock at the door"
            ],
            "content":"<div class=\"\"><div> <span>Syaoran knew he wouldn't fine any guy clothes but maybe he could fine something to wear. He search through the closet and dresser , he sighted in disappointment. He found nothing , but sexy lingerie , school girl uniforms , dress , blouse and skirts.<br>\r\n<br>\r\nEverything was sexy and girly , he wanted to scream but it will be pointless. <br>\r\n<br>\r\nWhat happen next ?</span></div></div>",
            "created":1536814800,
            "id":2547484,
            "title":"Look for something to wear "
        },
        "1153332111122221122":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "Issie takes Syaoran around the academy",
                "Issie want Syaoran to put on his face"
            ],
            "content":"<div class=\"\"><div> <span>As Syaoran was thinking on what to where, he heard a knock at the door. He sighed, this must be the student that Mr. Lace had told him about. He felt angry that this student is going to try to convince him to just accept his fate.<br>\r\n<br>\r\nThat wasn't going to happen, he was not going to be turn into a trap and he will escape this place. <br>\r\n<br>\r\nSyaoran march to the door, he was going to give this person a piece of his mind. Forgetting he was wearing only a towel, he open the door.<br>\r\n<br>\r\nWhat Syaoran saw made him blushed, standing in front of him was a beautiful girl. She average height, with a sexy figure, but what stood out was her breasts. They where massive, F cups at least.<br>\r\n<br>\r\nHe coughed, Syaoran looked at his face. She had brown eyes and long brown hair. She smirk at him, this made Syaoran gulped.<br>\r\n<br>\r\n\" May I come in ?\" Asked the male, Syaoran nodded.<br>\r\n<br>\r\nOnce inside the male turned around, \" My name is Issie Hyoudou, and is a pleasure to meet you Mr. Li.\" Said Issie, as he started to walk around Syaoran.<br>\r\n<br>\r\nThis made Syaoran feel embarrass, then he realize he was still only wearing a towel, which only increased his sense of embarrassment.<br>\r\n<br>\r\n\" Well, you will make a cute trap.\" Said Issie, as he sat down on the bed.<br>\r\n<br>\r\nSyaoran growled, he was about to say something when Issie looked at.<br>\r\n<br>\r\n\" I know what your feeling, I hated the idea of becoming a trap. I thought I could endure the training and escape.\" Said Issie, Syaoran just stared at him. He thought Issie was weak, he will endure the training and escape. Then Issie giggled, and this made Syaoran angry.<br>\r\n<br>\r\n\" Listen, I get it. I was once a very perverted guy, with obsession for breasts. That is why I was given these.\" Said Issie, as he gave his own breasts a squeeze.<br>\r\n<br>\r\nThis made Syaoran blushed, will he given large breast too. He was horrified at the idea.<br>\r\n<br>\r\n\" I know it's going to be hard at first, but if you don't right back and do everything you're told. It wouldn't be that bad, heck once I accepted it. I had a really pleasurable experience. \" said Issie, as he stood up.<br>\r\n<br>\r\nThen Issie stated to undress, this shocked Syaoran. He wanted to look away, but for some reason he could't.<br>\r\n<br>\r\nIssie stripped off his uniform, now clad in only a red lace bra and matching panties. Syaoran looked at Issue's body, it was sexy. As Syaoran check him out, he saw the bulge in his panties.<br>\r\n<br>\r\n\" Don't be jealous, by the end you will have a body just as sexy as mine.\" Said Issie, as he giggled.<br>\r\n<br>\r\n\" Now, time for you to get dress.\" Said, Issie, as went to get some clothes for Syaoran to wear.<br>\r\n<br>\r\nFirst Issie toss him, a pair of green lace panties. Wanting to get this over with, Syaoran put the panties on. Syaoran was surprised at how wonderful that felt.<br>\r\n<br>\r\nNext Issie helped Syaoran put on a green corset. <br>\r\n<br>\r\n\" This will help with hour's figure.\" Said Issie, as he tighten the corset. Syaoran gulped at the corset tighten on him.<br>\r\n<br>\r\nNext Syaoran was handed a pair of black thigh high stockings, he put them on.<br>\r\n<br>\r\nThen Issie went into the closet, <br>\r\n\"So their is no classes for today, so you can wearing what ever you want.\" Said Issie, as he pulled out a green sundress and handed it to Syaoran.<br>\r\n<br>\r\nSyaoran sighed as he put it on.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\n</span></div></div>",
            "created":1548046800,
            "id":2605564,
            "title":"He heard a knock at the door"
        },
        "11533322":{
            "author_id":"chavwarrior",
            "author_name":"ChavWarrior93",
            "choices":[
                "Yes Please.",
                "No Thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Yu-Gi-Oh!</span></div></span></div>",
            "created":1569560400,
            "id":2724180,
            "title":"No"
        },
        "12":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Futurama",
                "Simpsons",
                "Danny Phantom",
                "Kim Possible",
                "More choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which cartoon characters are going to the Kinky Academy?</span></div></span></div>",
            "created":1483851600,
            "id":2260975,
            "title":"Cartoons"
        },
        "121":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Philip J. Fry",
                "Leela Turanga",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shall be the latest student for the Academy?</span></div></span></div>",
            "created":1521954000,
            "id":2469777,
            "title":"Futurama character choice"
        },
        "123":{
            "author_id":"moonheat",
            "author_name":"Moonheat",
            "choices":[
                "Sam",
                "Paulina",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And who exactly ?</span></div></span></div>",
            "created":1551070800,
            "id":2623021,
            "title":"Danny Phantom"
        },
        "1231":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "stepford wives training",
                "age regression daycare",
                "another class"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what classes will Sam Manson be taking?</span></div></span></div>",
            "created":1551070800,
            "id":2623044,
            "title":"Sam"
        },
        "124":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Kim Possible",
                "Ron Stoppable",
                "More characters..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's start off with the two main characters, Kim Possible and Ron Stoppable. </span></div></span></div>",
            "created":1483938000,
            "id":2261292,
            "title":"Kim Possible"
        },
        "1241":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Submission 101.",
                "Domination 101.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of course does Kim enter into?</span></div></span></div>",
            "created":1493182800,
            "id":2311069,
            "title":"Kim Possible"
        },
        "12413":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Weight Gain Home Ec.",
                "Bimbology",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other course should be Ms. Possible's major?</span></div></span></div>",
            "created":1493182800,
            "id":2311302,
            "title":"More Kim Possible classes"
        },
        "125":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "totally spies",
                "family guy",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>totally spies or family guy</span></div></span></div>",
            "created":1487566800,
            "id":2279928,
            "title":"More choices..."
        },
        "1251":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Clover",
                "Alex",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And what character do you wish to see enrolled in the Academy?</span></div></span></div>",
            "created":1535173200,
            "id":2538524,
            "title":"Totally Spies"
        },
        "12511":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Weight Gain Home Ec",
                "Transformation",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And what shall be the blonde spy's main course at the Academy?</span></div></span></div>",
            "created":1535173200,
            "id":2538525,
            "title":"Clover's major"
        },
        "125111":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "XXX then pulls out a cookie, a very familiar cookie.",
                "Clover stops laughing as metal cuffs are locked around her wrists.",
                "The blonde yelps as XXX quickly injects her with something."
            ],
            "content":"<div class=\"\"><div> <span>Slowly returning to consciousness, the blonde spy reached up to hold her aching head.<br>\r\n<br>\r\n“Ah good, you’re finally awake. I was hoping that the capture agent hadn’t been too rough with you,” a distinctly feminine voice said. It had a very noticeable French accent, and sounded rather seductive and yet clipped at the same time. There was also a slight lisp as well.<br>\r\n<br>\r\nCracking her eyes open, Clover found that she was lying down, but it was obvious it wasn’t her own bedroom. This room wasn’t covered in a number of shades of pink and it was much smaller than her bedroom was. It looked more like a dark and stark dorm room or something. Her view was quickly cut off as someone stepped over her, likely the one speaking. Clover scrambled away in fright, or at least tried to if her body hadn’t decided to be mostly unresponsive.<br>\r\n<br>\r\nClover’s mind was still foggy, but even she was able to figure out that a person like the one standing over her shouldn’t exist. Utterly enormous breasts dominated her figure, each of them easily large enough to make it so that a normal person wouldn’t be able to move, let alone stand, and that wasn’t even figuring in both of them together. Her hips were similarly oversized, wider than an average person’s shoulders apiece. It didn’t help that she was wearing an utterly skintight outfit that possessed a cutout that exposed almost the entirety of her breasts, as well as another around her trim stomach. The woman’s face was striking with piercing eyes beneath the bangs of midnight black hair that flowed from her head and down around her body. Despite herself, Clover couldn’t restrain her eyes from nearly constantly flicking up and down the other’s body.<br>\r\n<br>\r\n“Come now, you don’t want to be late on your first day,” the impossible woman all but purred.<br>\r\n<br>\r\nCompletely ignoring what was said, Clover instead asked, “Like, who are you supposed to be? And where am I?” as she looked around the room.<br>\r\n<br>\r\n“Not that it really matters, but you may call me Headmistress XXX, and this is my academy,” she responded with a hint of pride. “Though to be more specific, it’s a dorm room—”<br>\r\n<br>\r\nClover cut her off as she burst out laughing, “Whatever, that’s like a really stupid name.”<br>\r\n<br>\r\n“You’re not the first one to say that, and you won’t be the last. It’s of no consequence either, you’ll change your tune soon enough.”<br>\r\n<br>\r\nStill laughing, Clover managed to blurt out, “As if.”<br>\r\n<br>\r\nIf Clover had been paying more attention, she might have noticed how XXX’s eyes briefly flared red, licked her lips, and muttered “Ooh, I’m going to have fun with you.” Raising her voice, she then said, “As I said before, you’re almost late, and we have something to do before you get started.”</span></div></div>",
            "created":1535432400,
            "id":2539927,
            "title":"Clover’s first day"
        },
        "1251111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "A few days later, Clover was now at her previous size when she was hooked.",
                "A few weeks later, Clover was now much fatter than she was previously.",
                "Actually, something else happened instead..."
            ],
            "content":"<div class=\"\"><div> <span>\"Besides, I'm sure you are quite familiar with THESE delectable treats, Ms. Clover.\" Headmistress XXX quipped, as she soon pulled out a large basket full of multi-colored cookies.<br>\r\n<br>\r\nOf course, Clover's eyes opened wide in shock and remembrance, quickly realizing what was placed before her: Passion Patties cookies, the same addictive delicacies that caused her to fatten up when she first tasted them on a certain mission.<br>\r\n<br>\r\n\"Ohhhh no! Like, there's no way in hell you're making me eat THOSE!!\" Clover barked, just as she noticed how her buxom captor had this gleaming aroused look in her eyes, just as XXX then chirped, \"*giggle* Glad to see that your memory hasn't dulled over the years, Ms Clover. I must admit, you looked rather *sexual moan* ravishing, with all those extra pounds. It was quite a shame to see you lose all that exquisite girth.\"<br>\r\n<br>\r\nFrom there, Clover soon felt herself being heavily restrained against her will, trying to instinctively free herself but it was proven futile. Then, Headmistress XXX soon sashayed her way toward the captive Clover, carrying the basket full of Passion Patties, bearing an ecstatic grin upon her face, as she seductively whispered into Clover's ear and retorted \"...But don't fret. We shall soon fix that, my dear.\"<br>\r\n<br>\r\nAt first, Clover tried to forcefully keep her mouth closed shut. But unfortunately, that was proven futile as well, as she felt Headmistress XXX effortlessly open Clover's mouth wide enough to forcefully insert three Passion Patty cookies into her mouth. <br>\r\n<br>\r\nClover attempted to spit them out, only for the buxom woman to assertively reinsert the cookies back into her mouth. \"Now, now, Ms Clover. No need to be fussy. Let your taste buds embrace what you've denied for so long.\" Headmistress XXX said, just as Clover had no alternative but to go along with what the woman had in store, as she felt Headmistress XXX forced her mouth to chew up the cookies in her mouth.<br>\r\n<br>\r\nIn turn, this caused the Passion Patties to disperse onto her taste buds, causing Clover to relapse back into a Passion Patties-addicted stupor, as she greedily swallowed the chewed up Passion Patties. <br>\r\n<br>\r\n\"...*sexy giggle* That's my girl. Let your taste buds savor the sweetness of those cookies.\" Headmistress XXX quipped, where she then soon let Clover go, only for the blonde Spy to greedily lunge at the basket full of multi-colored cookies, gluttonously devouring them with piggish gusto. Suffice to say, Clover was now legitimately hooked on the Passion Patties once more. <br>\r\n<br>\r\n\"...And don't worry, I had some people make sure that Bittersweet's cookies don't ultimately kill those who consume the Passion Patties. And this time, I'd say you'll certainly be much bigger than your previous size by the time we are done. *giggle*\" Headmistress XXX retorted, watching as Clover began to subtly put on more weight. </span></div></div>",
            "created":1535605200,
            "id":2540809,
            "title":"The Return of Passion Patties"
        },
        "12512":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Age regression daycare",
                "Others."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alex's major here will be what?</span></div></span></div>",
            "created":1569560400,
            "id":2724244,
            "title":"Alex"
        },
        "12513":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Sure.",
                "Mandy.",
                "Anyone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Others that could be students include Sam?</span></div></span></div>",
            "created":1569560400,
            "id":2724243,
            "title":"Someone else"
        },
        "125132":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "age regression daycare",
                "submission 101",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what Class would Mandy be made to Major in?</span></div></span></div>",
            "created":1571893200,
            "id":2737729,
            "title":"Mandy."
        },
        "1251321":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Gas",
                "SE"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She's knocked out how so?</span></div></span></div>",
            "created":1571918220,
            "id":2737732,
            "title":"age regression daycare"
        },
        "1253":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "American Dad",
                "Teen Titans",
                "Or more?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these for potential new students for the academy?</span></div></span></div>",
            "created":1487998800,
            "id":2281958,
            "title":"More cartoon choices"
        },
        "12532":{
            "author_id":"dinocoat",
            "author_name":"DinoCoat",
            "choices":[
                "One of the Heroes",
                "One of the Villains"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character is sent to the academy?</span></div></span></div>",
            "created":1499490000,
            "id":2349800,
            "title":"Teen Titans Choices"
        },
        "125321":{
            "author_id":"dinocoat",
            "author_name":"DinoCoat",
            "choices":[
                "Starfire or Raven",
                "Beast Boy, Robin, or Cyborg"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which hero is sent to the academy?</span></div></span></div>",
            "created":1499490000,
            "id":2349801,
            "title":"Teen Titans Heroes"
        },
        "12533":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Avatar Last Airbender",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Avatar Last Airbender</span></div></span></div>",
            "created":1535000400,
            "id":2537650,
            "title":"Or more?"
        },
        "125331":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Aang ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Aang </span></div></span></div>",
            "created":1535000400,
            "id":2537651,
            "title":"Avatar Last Airbender"
        },
        "1253311":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Transformation ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Transformation </span></div></span></div>",
            "created":1535000400,
            "id":2537663,
            "title":"Aang "
        },
        "1253312":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Katana ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Katana </span></div></span></div>",
            "created":1535000400,
            "id":2537657,
            "title":"Someone else "
        },
        "12533121":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Age Regression daycare ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about age Regression daycare </span></div></span></div>",
            "created":1535000400,
            "id":2537660,
            "title":"Katana "
        },
        "12533122":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Sokka",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Sokka</span></div></span></div>",
            "created":1535000400,
            "id":2537658,
            "title":"Someone else "
        },
        "125331221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Weight Gain Home Ec2",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Weight Gain Home Ec 2</span></div></span></div>",
            "created":1535000400,
            "id":2537661,
            "title":"Sokka"
        },
        "125331222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Toph ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Toph </span></div></span></div>",
            "created":1535000400,
            "id":2537659,
            "title":"Someone else "
        },
        "125332":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "yes",
                "more shows"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Ed Edd n Eddy?</span></div></span></div>",
            "created":1571893200,
            "id":2737673,
            "title":"Something else "
        },
        "13":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Super Mario Bros. series",
                "Sonic the Hedgehog",
                "Final Fantasy",
                "Legend of Zelda",
                "More choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which video game will have some of it's characters go to her academy?</span></div></span></div>",
            "created":1483851600,
            "id":2260976,
            "title":"Video Games"
        },
        "132":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Male ",
                "Female ",
                "Robot "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Male or Female </span></div></span></div>",
            "created":1535086800,
            "id":2538143,
            "title":"Sonic the Hedgehog"
        },
        "1321":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Sonic",
                "Tails",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Sonic or Tails</span></div></span></div>",
            "created":1535086800,
            "id":2538145,
            "title":"Male "
        },
        "1322":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Amy ",
                "Rouge ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Amy or Rouge </span></div></span></div>",
            "created":1535086800,
            "id":2538144,
            "title":"Female "
        },
        "134":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Link",
                "Zelda",
                "More characters..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want the hero of the games, or the Princess the series is named after?</span></div></span></div>",
            "created":1483938000,
            "id":2261288,
            "title":"Legend of Zelda"
        },
        "135":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Tomb Raider ",
                "Portal",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Tomb raider or Portal </span></div></span></div>",
            "created":1535086800,
            "id":2538139,
            "title":"More choices..."
        },
        "1351":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Male",
                "Female ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Male or Female </span></div></span></div>",
            "created":1535086800,
            "id":2538140,
            "title":"Tomb Raider "
        },
        "13512":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Lara Croft",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Lara Croft</span></div></span></div>",
            "created":1535086800,
            "id":2538141,
            "title":"Female "
        },
        "1353":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Sure.",
                "Others."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hmmm, the ladies from Life Is Strange?</span></div></span></div>",
            "created":1569560400,
            "id":2724245,
            "title":"Something else "
        },
        "14":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Disney/Pixar animated movies",
                "Star Wars",
                "Harry Potter",
                "Dreamworks",
                "More Movies..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which beloved cinema franchise characters become Headmistress XXX's students?</span></div></span></div>",
            "created":1483851600,
            "id":2260978,
            "title":"Movies"
        },
        "141":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Jasmine",
                "Ariel",
                "More characters..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's start off with two of the most popular Disney Princesses. </span></div></span></div>",
            "created":1483938000,
            "id":2261287,
            "title":"Disney/Pixar animated movies"
        },
        "1411":{
            "author_id":"moonheat",
            "author_name":"Moonheat",
            "choices":[
                "Bimbology/Transformation",
                "Corruption/Futanari",
                "One of the others "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's start with some fetishes. Do you want:<br>\r\n<br>\r\nBimbology/Transformation<br>\r\n<br>\r\nOR<br>\r\n<br>\r\nCorruption/Futanari</span></div></span></div>",
            "created":1532408400,
            "id":2524011,
            "title":"Jasmine"
        },
        "1413":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "cinderella",
                "snow white",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who else from Disney do we try?</span></div></span></div>",
            "created":1569560400,
            "id":2724186,
            "title":"More characters..."
        },
        "142":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Male ",
                "Female ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Male or Female </span></div></span></div>",
            "created":1535000400,
            "id":2537773,
            "title":"Star Wars"
        },
        "1421":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Anakin Skywalker",
                "Obi Wan Kenboi",
                "Someone Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Anakin Skywalker or Obi Wan Kenboi</span></div></span></div>",
            "created":1535000400,
            "id":2537776,
            "title":"Male "
        },
        "1422":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Padme ",
                "Leia",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Padme or Leia</span></div></span></div>",
            "created":1535000400,
            "id":2537774,
            "title":"Female "
        },
        "145":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "live action Disney movies",
                "marvel movies",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what other movie franchise characters become Headmistress XXX's students?</span></div></span></div>",
            "created":1551157200,
            "id":2623320,
            "title":"More Movies..."
        },
        "1451":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "disney's descendants",
                "high school musical",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what live action Disney movie do we go with?</span></div></span></div>",
            "created":1569733200,
            "id":2725196,
            "title":"live action Disney movies"
        },
        "14511":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "Mal,daughter of Maleficent",
                "Evie,daughter of the evil queen",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which of the residents of Auradon and the isle of the lost become students?</span></div></span></div>",
            "created":1569733200,
            "id":2725202,
            "title":"disney's descendants"
        },
        "145111":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "age regression daycare",
                "stepford wives training",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what class is the daughter of Maleficent made to major in?</span></div></span></div>",
            "created":1571918520,
            "id":2737734,
            "title":"Mal,daughter of Maleficent"
        },
        "1451113":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Yup",
                "Any more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Another class Mal could major in... Bimbology?</span></div></span></div>",
            "created":1571919000,
            "id":2737740,
            "title":"something else"
        },
        "145113":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "Audrey",
                "Jane",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what other girls from the Descendants movies ends up at the academy?</span></div></span></div>",
            "created":1571893200,
            "id":2737723,
            "title":"someone else"
        },
        "1451132":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Sure",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jane will major in age regression daycare?</span></div></span></div>",
            "created":1571918280,
            "id":2737733,
            "title":"Jane"
        },
        "14512":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Gabriella",
                "Sharpay",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, which of the East High ladies is taken to the academy?</span></div></span></div>",
            "created":1569733200,
            "id":2725199,
            "title":"high school musical"
        },
        "145122":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "Age regression daycare",
                "submission 101",
                "another class"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what class does Sharpay Evans end up taking?</span></div></span></div>",
            "created":1569733200,
            "id":2725247,
            "title":"Sharpay"
        },
        "1451221":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Sure.",
                "Changing room.",
                "Another room."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She acts like a spoiled brat a lot of the time. Maybe returning to her childhood will help her see the light. Now then, she wakes up in one of the daycare's rooms. It's the nap room?</span></div></span></div>",
            "created":1569733200,
            "id":2725249,
            "title":"Age regression daycare"
        },
        "1453":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Oh yeah",
                "Clueless.",
                "Even more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more movies to use. Mean Girls, perhaps?</span></div></span></div>",
            "created":1571923140,
            "id":2737748,
            "title":"something else"
        },
        "15":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "Comic Books",
                "TV shows",
                "Literature",
                "Web comics/Web shows",
                "Crossover"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other realms of fiction will she get students from?</span></div></span></div>",
            "created":1483851600,
            "id":2260970,
            "title":"More choices..."
        },
        "151":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "DC Comics",
                "Marvel comics",
                "More comic books..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which super powered or non super powers characters end up at Headmistress XXX's academy?</span></div></span></div>",
            "created":1483851600,
            "id":2260982,
            "title":"Comic Books"
        },
        "1511":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Batman ",
                "Wonder Woman ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Batman or Wonder Woman</span></div></span></div>",
            "created":1535000400,
            "id":2537632,
            "title":"DC Comics"
        },
        "15111":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Corruption Course ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Batman take how about Corruption Course </span></div></span></div>",
            "created":1535000400,
            "id":2537681,
            "title":"Batman "
        },
        "15112":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Muscle ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class will Wonder Woman take how about Muscle </span></div></span></div>",
            "created":1535000400,
            "id":2537678,
            "title":"Wonder Woman "
        },
        "151122":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "stepford wives training",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about Wonder woman takes Stepford wives training?</span></div></span></div>",
            "created":1551157200,
            "id":2623309,
            "title":"Something else "
        },
        "15113":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Superman ",
                "Something Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Superman </span></div></span></div>",
            "created":1535000400,
            "id":2537666,
            "title":"Someone else "
        },
        "151131":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Mind control ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does superman take how about Mind control</span></div></span></div>",
            "created":1535000400,
            "id":2537793,
            "title":"Superman "
        },
        "151132":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Catwoman ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Catwoman </span></div></span></div>",
            "created":1535000400,
            "id":2537667,
            "title":"Something Else "
        },
        "1511321":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Domination 101",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does Catwoman take how about Domination 101</span></div></span></div>",
            "created":1535000400,
            "id":2537792,
            "title":"Catwoman "
        },
        "15113212":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "how to train your pet",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe cat woman could major in pet training?</span></div></span></div>",
            "created":1551157200,
            "id":2623311,
            "title":"Something else "
        },
        "1511322":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Zatana ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Zatana </span></div></span></div>",
            "created":1535000400,
            "id":2537668,
            "title":"Something else "
        },
        "15113221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Age regression daycare ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does Zatana take how about age regression daycare </span></div></span></div>",
            "created":1535000400,
            "id":2537791,
            "title":"Zatana "
        },
        "15113222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Flash ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the flash </span></div></span></div>",
            "created":1535000400,
            "id":2537669,
            "title":"Someone else "
        },
        "151132221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Micro ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does flash take how about Micro </span></div></span></div>",
            "created":1535000400,
            "id":2537790,
            "title":"Flash "
        },
        "151132222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Harley Quinn ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Harley Quinn </span></div></span></div>",
            "created":1535000400,
            "id":2537670,
            "title":"Someone else "
        },
        "1511322221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "How to train your pet",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does Harley Quinn take how about How to train your pet</span></div></span></div>",
            "created":1535000400,
            "id":2537789,
            "title":"Harley Quinn "
        },
        "1511322222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Green Lantern ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Green  Lantern </span></div></span></div>",
            "created":1535000400,
            "id":2537671,
            "title":"Someone else "
        },
        "15113222221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Muscle ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does Green Lantern take how about Muscle</span></div></span></div>",
            "created":1535000400,
            "id":2537788,
            "title":"Green Lantern "
        },
        "15113222222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Supergirl ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How About supergirl </span></div></span></div>",
            "created":1535000400,
            "id":2537672,
            "title":"Someone else "
        },
        "151132222221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Futanari Training ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does supergirl take how about Futanari Training </span></div></span></div>",
            "created":1535000400,
            "id":2537787,
            "title":"Supergirl "
        },
        "151132222222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Batgirl ",
                "Someone Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How About Batgirl</span></div></span></div>",
            "created":1535000400,
            "id":2537784,
            "title":"Someone else "
        },
        "1511322222221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Marco",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does batgirl take how abou Marco</span></div></span></div>",
            "created":1535000400,
            "id":2537785,
            "title":"Batgirl "
        },
        "1512":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Male",
                "Female",
                "Some over gender"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Male or Female </span></div></span></div>",
            "created":1535000400,
            "id":2537676,
            "title":"Marvel comics"
        },
        "15121":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Thor",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Thor </span></div></span></div>",
            "created":1535000400,
            "id":2537777,
            "title":"Male"
        },
        "151212":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Iron man",
                "Someone Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Iron man</span></div></span></div>",
            "created":1535000400,
            "id":2537779,
            "title":"Someone else "
        },
        "1512122":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Spider-Man ",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about spider man </span></div></span></div>",
            "created":1535000400,
            "id":2537794,
            "title":"Someone Else "
        },
        "15121221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Mirco",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does Spider-Man take how about Mirco</span></div></span></div>",
            "created":1535000400,
            "id":2537805,
            "title":"Spider-Man "
        },
        "15121222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Wolverine ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How About Wolverine </span></div></span></div>",
            "created":1535000400,
            "id":2537807,
            "title":"Someone else"
        },
        "15122":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Scarlet witch ",
                "Someone Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Scarlet Witch </span></div></span></div>",
            "created":1535000400,
            "id":2537778,
            "title":"Female"
        },
        "151222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Jean Grey ",
                "Someone Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Jean Grey </span></div></span></div>",
            "created":1535000400,
            "id":2537797,
            "title":"Someone Else "
        },
        "1512221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Weight Gain Home EC",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class does Jean Grey take how about Weight Gain Home Ec </span></div></span></div>",
            "created":1535000400,
            "id":2537798,
            "title":"Jean Grey "
        },
        "1512222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Kitty Pryde",
                "Someone Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Kitty Pryde</span></div></span></div>",
            "created":1535000400,
            "id":2537799,
            "title":"Someone Else "
        },
        "15122222":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Miss marvel ",
                "Someone Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Miss Marvel </span></div></span></div>",
            "created":1535000400,
            "id":2537810,
            "title":"Someone Else "
        },
        "151222221":{
            "author_id":"jazzer1",
            "author_name":"Bob",
            "choices":[
                "Bimbology",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Class does Miss Marvel take how about Bimbology</span></div></span></div>",
            "created":1535000400,
            "id":2537811,
            "title":"Miss marvel "
        },
        "152":{
            "choices":[
                "Malcom and his .......",
                "Other choices ",
                "Something completely different "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Malcom in the Middle ........featuring Malcom  !<br>\r\n<br>\r\nGo on adventures as Malcom involving Only his mother, or only his two other brothers or Malcom and only his Father !!!</span></div></span></div>",
            "created":1521867600,
            "id":2468813,
            "title":"Malcom in the middle"
        },
        "1522":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "jessie",
                "Bunk'd",
                "another tv show"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what other ones could we try?</span></div></span></div>",
            "created":1569560400,
            "id":2724187,
            "title":"Other choices "
        },
        "15221":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Jessie herself.",
                "Emma.",
                "Zuri, or others."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who from Jessie is taken to the academy?</span></div></span></div>",
            "created":1569560400,
            "id":2724246,
            "title":"jessie"
        },
        "15223":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Yeah.",
                "Modern Family",
                "Even more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shall we use Buffy: The Vampire Slayer?</span></div></span></div>",
            "created":1569560400,
            "id":2724250,
            "title":"another tv show"
        },
        "152233":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "once upon a time",
                "good luck Charlie",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what other show could we try?</span></div></span></div>",
            "created":1569819600,
            "id":2725835,
            "title":"Even more choices"
        },
        "1522332":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Yeah.",
                "Ivy.",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, is Teddy the one who ends up in the academy?</span></div></span></div>",
            "created":1569819600,
            "id":2725836,
            "title":"good luck Charlie"
        },
        "153":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "Baby-Sitter's Club",
                "Harry Potter",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The ladies from which book or book series will join the academy?</span></div></span></div>",
            "created":1569819600,
            "id":2725816,
            "title":"Literature"
        },
        "154":{
            "author_id":"greatkobold",
            "author_name":"Great Kobold",
            "choices":[
                "Twokinds yes!",
                "Sorry but no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Twokinds!<br>\r\n<br>\r\nOr no?</span></div></span></div>",
            "created":1593201360,
            "id":2857192,
            "title":"Web comics/Web shows"
        }
    },
    "info":{
        "author_id":"strangemind45",
        "author_name":"Very-Strange?",
        "brief_description":"Headmistress XXX with teach your favorite characters a few things...",
        "created":1483921320,
        "description":"<td align=\"left\" class=\"norm\">There is a secret illegal facility known as the \"Kinky Academy\" run by the mysterious Headmistress XXX. It's a special school where the goal is not to educate students in things like history, science, or math. This twisted version of a boarding school only teaches about sexiest and depraved fetishes, and makes sure each student graduates as an expert in a specific fetish...whether they want to or not.<br>\r\n<br>\r\nNo one comes to this academy willingly. Someone hires Headmistress XXX to capture someone and give them a special \"education course\" planed for the kidnapped victim. When people arrive at the academy, they have no memory of how they were captured or were they are. Though they soon learn that escape from the school is nearly impossible, so they have to endure whatever sinister course is prepared for them. As they are forced to take different classes all training them how to please someone with a certain sexual skill, while teaching them to enjoy it themselves. <br>\r\n<br>\r\nSome people think they can endure her classes or escape, but with Headmistress XXX's numerous recourses, she can do almost anything she wants to her students. She can brainwash them with subliminal messages hidden around the school, changing their personalities and even sexuality. She even has special equipment and machines that can alter their bodies to make them grow,shrink them, and change their bodies in a variety of kinky ways.The more classes they take, the more likely they'll be changed mentally and physically into perverts that suit the sexual desires of whoever sent them their in the first place. Even the greatest heroines, heroes, and even villains will have trouble escaping her school and must endure her erotic classes. Now you get to send your favorite characters in fiction and make them take a special course at her school that will surely make them into perverts by the graduation ceremony. <br>\r\n<br>\r\nRules and Important Info:<br>\r\n-Headmistress XXX and her staff are up to the imagination of the writers of a storyline, but once she and her staff have been members have been established in a storyline, please keep consistent to the story and don't change them randomly in a story. <br>\r\n-First pick from the shows, movies, games, etc or add your own things you like. Then pick a character from what you like, and then pick a main fetish for them to \"major\" in during their time at the academy. You can have a few side fetishes along the way, but keep focus on the main one. Always leave plenty of fetish and character options. <br>\r\n-All fetishes are allowed except lolicon, necrophilia, and guro. Though I will allow aged up 18+ versions of younger characters.<br>\r\n-No killing off characters<br>\r\n-You can have your character try and escape from the academy, but they cannot simply escape in one chapter as the school always has something to keep most students trapped inside. You'll need to make sure your characters take some classes and give them a good story arc to let them escape. <br>\r\n-No short chapters poorly written chapters with only a few sentences of dialogue. The only short chapters should be the option chapters setting up the story at the beginning.<br>\r\n-More rules may be added depending on how things go...<br>\r\n<br>\r\nHere are some Fetishes/Classes ideas can to help people get started:<br>\r\n<br>\r\n-Submission 101: Learning how to please and obey your master.<br>\r\n-Domination 101: Learning how to take charge and punish those who don't obey.<br>\r\n-Introduction to Bondage:  Learning how to bind or learning how to enjoy being bound in tight bondage gear. <br>\r\n-Corruption Course: A special course designed to take good girls and corrupt their morals to make them more wicked and naughty.<br>\r\n-Transformation: This advanced class changes students in various ways, such as turning them into another species or half human/half animal hybrid, then teaching them all about sexual that come with new bodies.<br>\r\n-Bimbology: A class that teaches young girls how to be a proper bimbo by draining intelligence while making your body more sexy.<br>\r\n-Mind Control: This class is usually reserved for students with exceptionally strong will power and resistance. After completing this class, they will be empty headed and happy slaves who will obey the master assigned to them after graduation.  <br>\r\n-Muscle: A special more extreme form of gym class that really helps students develop muscles along with teaching how to use their muscles to please people sexually. <br>\r\n-Stepford Wives Training: A girls only class that makes girls into perfect housewives by teaching them how to cook, clean, fuck, and never disobey their husbands. <br>\r\n-Weight Gain Home Ec: This class fattens students up to help them become BBWs or BHMs. If they take Weight Gain Home Ec 2, they're guaranteed to become SSBBWs or SSBHMs.<br>\r\n-Futanari Training: This class gives girls dicks and teaches them all about the pleasures that come with one.  <br>\r\n-How to train your pet: A pet play class where student learn all about the responsibilities of taking care of a pet, or become one themselves.<br>\r\n-Marco: Students are required to grow to gigantic sizes, then learn how sexy their bigger and better bodies are.  <br>\r\n-Micro: Students need to be shrunken down, then get to experience being crushed and played with by someone bigger in sexy ways. <br>\r\n-Age Regression Daycare: Students sent here often get to enjoy going through childhood again as made to wear clothes for little children, made to behave like little kid, or in more extreme cases of being made to wear diapers again. <br>\r\n<br>\r\nOf course, you can feel free to add other fetishes I've neglected to mention as long as you don't add ones that were blacklisted above. </td>",
        "id":2108053,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595884860,
        "modified":1595884860,
        "pretty_title":"Headmistress XXX's Kinky Academy"
    }
}