{
    "chapters":{
        "1":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>As far as you were concerned, your days as a free Beoga are over.  The only comforting thought is that you are not alone on this ship.  Below the deck you are tied up with ten other Beogani brothers and sisters.  Half of them are as pale as the moon, the other half are the hue of tanned leather.  Where all the others are you couldn't tell, but it was reasonable to assume they were being held on separate ships bound elsewhere.<br>\r\n<br>\r\nThe last thing you remember before you were captured was the grand celebration for the beginning of Autumn.  This year the Beoga crops had yielded a magnificent bounty.  Such an immense surplus had not been had for over 400 years; a regular offering to the harvest goddess was not going to cut it this time.  Thus it was, after a week and a day of preparations, that a sumptuous banquet was held in the sacred grove of Etya, the Beogani goddess of the hunt - to whom you and your people owe their delicious game and the very large feet needed to pursue the animals.  Of course, your people had also intended to offer tribute to Oolomita, the goddess of agriculture, who made this harvest bountiful and this banquet possible, so the elders sent you to fetch Oolomita's statuette from her shrine.  The fact you were entrusted with this task filled you with pride; by combining the two sacred places with this simple gesture, you would be the one to renew the bond between hunter and farmer, between nature and the cultivated realm of man.<br>\r\n<br>\r\nThat was when <span class=\"clblue\">They</span> arrived.<br>\r\n<br>\r\nAfter you were assigned this simple yet important task, you ran as fast as your clompers could carry you to collect the statuette from Oolomita's shrine.  But when you hurried back to Etya's grove with the statuette in hand, the sight of 6,000 <span class=\"clblue\">Blue Elves</span> gathered in the town's plaza stopped you in your tracks.  They appeared to be led by a dour-faced woman with a turquoise complexion and hair like finely spun gold astride a huge deer with spiraling antlers: this was none other than Princess Nikali of Preotopia Prime leading the army and her mount was a giant eland from the fabled exotic hotlands, but you did not know this at the time.<br>\r\n<br>\r\nThough you had never met a <span class=\"clblue\">Blue Elf</span> before or have any clue why such a large gathering of these elves had arrived on your doorstep, your gut told you that they were not here for the celebration - or that they came in peace.  The fact these elves were armed certainly did not give the impression they were invited either.  Without a word, the princess pointed her ebony sceptre at you with the same menacing look in her eyes.  You had immediately taken the hint and dashed towards the grove.  <br>\r\n<br>\r\nA sharp pain hit your neck from behind, but it did nothing to slow your pace.  After quickly brushing away whatever stung your neck, you focused all your thoughts on reaching the banquet grounds.  You had to warn everybody of the invasion.  Sure, they lacked weapons on account of the relative peace of the banquet, but at least they could take shelter in Etya's Burrow or the caves deep within the forest.  After evading the <span class=\"clblue\">Blue Elves</span> for such time, perhaps your elders could then orchestrate a counterattack to drive the invaders out and back to their ships.  It was unlikely that the <span class=\"clblue\">Blue Elves</span> would want to throw away lives any more than your fellow Beogas, so perhaps they would think twice before messing with a bunch of \"bare-assed savages\" again.<br>\r\n<br>\r\nFurther thoughts were interrupted by a sudden dizziness you had felt.  Your speed lessened and you began to stumble; your vision became blurry and your breaths became as slow as your feet.  No matter how hard you tried to focus on your immediate task, it was difficult to make out the path ahead of your on account of your increasingly blurry vision.  The throbbing pain in your head did not make it any easier.  Finally, after one last stagger, your body had decided show you mercy and let you drift into unconsciousness.<br>\r\n<br>\r\nYou don't remember anything else after that; you blacked out before you had even fell in the dirt face-first.<br>\r\n<br>\r\n<br>\r\nWhen you regained consciousness, you were aboard the very ship you are now on with ten other Beogas.  You were all below deck, sitting on the floor with wrists tied and torsos restrained to strong wooden beams by equally strong ropes, and under the constant surveillance of one of two guards assigned to your group.  They were also responsible for feeding all of you, giving you water, and if any of you had to relieve yourselves both guards had to present when they tended to you one at a time.  If any of you so much as stepped out of line (which some of you did, including you), then the guards punished you or your comrades with an open-handed slap across the face, taking away your food and water for the rest of the day, or exploiting your biggest weakness - quite literally - by removing your footwear and tickling your bottoms of your feet.<br>\r\n<br>\r\nThis has been your life for about a week now.  Sure, you will not be down here forever and life will change any day now but for you it will not necessarily be for the better.  You understand the outside world well enough to know that slavery usually awaited those who were taken captive by a foreign invader.  Being a free soul for your entire life, the very thought of someone else owning you frequently made you miserable.  It would be as if you were no longer a person.<br>\r\n<br>\r\nFortunately, you have not been entirely despondent from loneliness.  You could still talk to the others whenever the guards would \"allow\" it and this made you feel a little better.  But the one Beoga that kept you from falling into despair and reminded you that you were still a person was the one sitting right next to you: a little boy named Deyja.  He was a pale-skinned Beoga who appeared to be around 8 or 9 years of age with a short mop of red hair, eyes blue like the sky, and chubby cheeks with freckles (something you have always found endearing about him).  For clothing he only wore a leather vest, dark green trousers, and the typical leather shoes worn by your average Beoga.  Other Beoga children would begin losing their excess body fat at the seven year mark and gradually become more slender over time, but Deyja, still a chubby kid, seemed to be taking his time.  While you had never spent a lot of time in his company, you never felt the need to make fun of him or mock his portly figure like the other children; on the contrary, you thought he was cuter than a puppy.<br>\r\n<br>\r\nIn any other situation similar to yours, it would supposedly be your duty to protect and watch out for somebody younger and weaker than yourself.  However, that was not the case at all in this situation.  Back home, Deyja was never much of a talker - at least not to your knowledge - but now he would always try to start a conversation with you.  You two would share your favourite sights back home, what foods you liked, whatever dreams you had for the future, your best scores in a game of Palabo; the boy would talk about anything to pass the time and alleviate your melancholy for a while - at least until one of the two assigned guards told you both to be quiet.  But in those moments when your mood was considerably low, such as the present moment, he would offer gentle words of comfort and encouragement, to let you know things would be alright, even though he had very little to be happy about himself as you do.  <br>\r\n<br>\r\nOften, as he is doing now, Deyja would stroke your leg with his little right foot (well, <i>little</i> in comparison to your feet and those of the other adults) using slow, gentle strokes with his bare pudgy toes to calm your troubled mind.  It was a simple yet kind gesture on his part, despite the underlying wistfulness it carried within.  But by far his most selfless act was on the second day in captivity when he demanded one of the two guards to leave your feet alone when you were about to be punished.  Angered - and taken aback - by his uncharacteristically brazen attitude, the guard turned her attention away from you and towards Deyja.  Your shoes and foot cloths still remain on your feet, but at the expense of your friend's footwear.  The guard had given that brave lad's bare feet a thorough vellicating and ensured she had sent him up the wall, be it through scribbling her fingernails along his meaty soles or utilizing a feather to attack his plump toes.  Though you begrudgingly admitted the boy's laughter and ticklishness was utterly adorable, you couldn't help but ponder the nature of your relationship once more.  In these situations, <i><b>you</b></i> were supposed to be the one to comfort and protect the little guy, not the other way around!  That boy must be the living incarnation of Milva, the goddess of kindness, bravery, and the heart, to act as he did on your behalf, so what did that say about you?<br>\r\n<br>\r\nAfter that day, you had felt bad that Deyja sacrificed his shoes and foot cloths just for your benefit and wished that he had not said anything.  Be that as it may, he said he did not regret sticking up for you and that he would do it again without hesitation.  As he had said in his own words, \"That's what friends do for each other.  I know you would've done the same for me.\"<br>\r\n<br>\r\nAlthough you agreed with the lad and you were grateful for his help, you still felt an ounce of regret for what had happened.  Flash forward to the present and as you ponder that day's events, you consider your own standing compared to everyone else present.  By now, every Beoga onboard has had their shoes and foot cloths confiscated by those two guards except for you, and it's very unlikely they will ever get them back.  From time to time, those same guards would tickle everyone else's feet for their own amusement but they never made an attempt to remove your shoes after that incident.  It makes you wonder if the guards like you best out of all the others.<br>\r\n<br>\r\nStaring at a nearby bronze plate, you see the reflection staring back at you as a...</span></div></div>",
            "created":1595309040,
            "id":2872359,
            "title":"Home is behind..."
        },
        "11":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "12-15 years old",
                "16-19 years old",
                "20-23 years old",
                "24-27 years old",
                "28+ years old"
            ],
            "content":"<div class=\"\"><div> <span>Indeed you are a male Beoga, whose feet retain their soft and smooth appearance even longer than the females - much like yours.  Even though you are still a prisoner aboard this ship, you can't help but admire your features in that bronze plate.  In a way, it's flattering that your reflection reminds you that you are...</span></div></div>",
            "created":1595311020,
            "id":2872368,
            "title":"Male"
        },
        "111":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Baker's apprentice; pale-skinned with black hair and hazel eyes; 13 years old",
                "Farm hand; brown-skinned with terracotta hair and blue eyes; 14 years old",
                "Junior cartwright; brown-skinned with brown hair and blue eyes;15 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595397600,
            "id":2872951,
            "title":"12-15 years old"
        },
        "112":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Apprentice vintner; pale-skinned with blond hair and green eyes; 16 years old",
                "Apprentice builder; pale-skinned with lavender hair and grey eyes; 19 years old",
                "Acolyte of Etya; brown-skinned with black hair and brown eyes; 18 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595453460,
            "id":2873235,
            "title":"16-19 years old"
        },
        "113":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Farmer; \"pale-skinned\" with brown hair and golden eyes; 22 years old",
                "Lumberjack; brown-skinned with dark brown hair and green eyes; 23 years old",
                "Nobody; pale-skinned with red hair and blue eyes; 20 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595368200,
            "id":2872742,
            "title":"20-23 years old"
        },
        "114":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Baker; pale-skinned with ash blond hair and dark blue eyes; 25 years old",
                "Hunter; brown-skinned with moss green hair and hazel eyes; 24 years old",
                "Miner; pale-skinned with black hair and grey eyes; 26 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595379480,
            "id":2872836,
            "title":"24-27 years old"
        },
        "115":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Fisherman; brown-skinned with lavender hair and green eyes; 28 years old",
                "Former Minoboar's slave; pale-skinned with red hair and grey eyes; 30 years old",
                "Trader; brown-skinned with black hair and golden eyes; 29 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595368800,
            "id":2872744,
            "title":"28 years old or higher"
        },
        "12":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "13-16 years old",
                "17-20 years old",
                "21-24 years old",
                "25-29 years old",
                "30+ years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>That's right; you are a female Beoga, whose feet are typically larger than the male, and yours are no exception.  That bronze plate is so well-polished that it reflects every detail on your beautiful face.  It also shows that you are clearly...</span></div></span></div>",
            "created":1595310480,
            "id":2872366,
            "title":"Female"
        },
        "121":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Oolomita shrinemaiden; brown-skinned with red hair and blue eyes; 13 years old",
                "Junior diver; pale-skinned with dark brown hair and brown eyes; 14 years old",
                "Tailor's apprentice; brown-skinned with indigo hair and grey eyes; 16 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595453580,
            "id":2873236,
            "title":"13-16 years old"
        },
        "122":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Dye-maker; brown-skinned with dyed hair and brown eyes; 20 years old",
                "Toymaker; brown-skinned with auburn hair and grey eyes; 18 years old",
                "Potter; pale-skinned with terracotta hair and green eyes; 19 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595383800,
            "id":2872866,
            "title":"17-20 years old"
        },
        "123":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Hunter; pale-skinned with red hair and brown eyes; 22 years old",
                "Grove-Watcher; brown-skinned with auburn hair and hazel eyes; 24 years old",
                "Rancher; \"pale-skinned\" with silver hair and blue eyes; 23 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595380620,
            "id":2872844,
            "title":"21-24 years old"
        },
        "124":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Weaver; pale-skinned with dark brown hair and grey eyes; 25 years old",
                "Bronzesmith; brown-skinned with black hair and brown eyes; 26 years old",
                "Former criminal; pale-skinned with sky-blue hair and golden eyes; 29 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595367600,
            "id":2872740,
            "title":"25-29 years old"
        },
        "125":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Herbalist; brown-skinned with red hair and golden eyes; 36 years old",
                "Carpenter; pale-skinned with blond hair and brown eyes; 31 years old",
                "Diver; brown-skinned with black hair and blue eyes; 40 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you, and more importantly, what were you before you were taken prisoner?</span></div></span></div>",
            "created":1595370720,
            "id":2872750,
            "title":"30 years old or higher"
        }
    },
    "info":{
        "author_id":"thetickler",
        "author_name":"Icy yet Warm",
        "brief_description":"Welcome to the world of Odion, where your big feet are the reason for your servitude.",
        "created":1595147580,
        "description":"<td align=\"left\" class=\"norm\">You are a Beoga, a nation and offshoot of humanity from the far northern reaches of Odion's main continent of Zeikra.  What is a Beoga, you ask?<br>\r\n<br>\r\nBeogas are a humanoid race which look human in almost every way except for their naturally willowy bodies, unnatural resistance to cold temperatures, four fingers on each hand, six toes on each foot, small ears, and everyone is born with an eidetic memory.  But the most noticeable difference between a Beoga and a regular human <b>by far</b> is their abnormally large feet.  For example, a normal human of the female gender at an even 6 feet tall would have the equivalent of a size 11 US or thereabouts, but a female Beoga of the same height would have the equivalent of a size <b>18</b> shoe.  And speaking of shoes, Beogas are almost always seen wearing closed footwear due to the rough terrain and frigid winters of their homelands.  Constantly covering and protecting their feet from the elements and physical damage would no doubt leave their feet very sensitive to touch.<br>\r\n<br>\r\nThat's where you come in.  You are one of the Beoga, and life had been good to you up until the day you were taken captive.  An army from the southern <span class=\"clblue\">Blue Elf</span> Kingdom of Preotopia had landed on your shores during the big celebration of the Autumn Equinox, taking you and your people completely by surprise.  You were one of many prisoners leaving the Beogani homelands in bondage and you are now being shipped to whatever Preotopian settlement they see fit.  There is little doubt you and several of your Beoga brothers and sisters will be sold into slavery.  But what you don't know is that the <span class=\"clblue\">Blue Elves</span>, especially those of the Preotopian nobility, have strong feet fetishes, so it's fair to say the mass enslavement of your people may have been motivated by this apparently common kink.  That means two things about your future are certain: you may never see your home again and your giant feet will most likely become somebody's playthings.<br>\r\n<br>\r\nIt kind of makes you wonder if your unusually large feet, the very feature that defines the Beoga race, is truly a blessing from the gods or a curse, doesn't it?<br>\r\n<br>\r\n<u><b><font class=\"size4\" style=\"\">RULES</font></b></u><br>\r\n- No ridiculously short chapters (I can't tell you how annoying that is nor can I stress it enough).<br>\r\n- Refer to everything the POV character (that's you) does in 2nd person perspective (e.g. \"you are\", \"you see\", \"you laugh\" and so on).<br>\r\n- This is a primarily foot fetish-driven interactive, so let's try and keep the fetish aspect limited to that, m'kay?<br>\r\n- Tickling is allowed on other parts of the body too, but try to keep it on the feet as much as possible.<br>\r\n- Anything goes: M/F, F/F, F/M, and <i>even</i> M/M<br>\r\n- Keep any foot fetishism towards other characters besides the POV character to a minimum.  After all, <i>you</i> were purchased for a reason.<br>\r\n- Sex or sexual acts are permitted, but only between adults.  I mean, come on.<br>\r\n- You are free to allude to the POV character only being able to speak in Beogarin - the Beoga language - which no one but fellow Beoga can understand (you know, as a language barrier between you and non-Beogas, especially <span class=\"clblue\">Blue Elves</span>).  In fact, I encourage it.  Ultimately, whether your character learns the realm's common tongue or not is up to you.<br>\r\n<br>\r\n<b><font class=\"size35\" style=\"\">Author's Notes:</font></b> To spice things up a little, I had decided to set this particular interactive within a Bronze Age setting rather than the typically medieval-themed fantasy stories we all know and love.  I'm a huge fan of Greg Stafford's Glorantha stuff (HeroQuest, RuneQuest, King of Dragon Pass, etc.) and this story and setting is partly inspired by that series.  Try to keep the time period in mind if you want to write something; feel free to ask me any questions if you need clarification.  <i><b>Also</b></i>, I will definitely reward any good chapters you submit with points (starting at 600).  The juicier and/or more creative the chapter, the more points I'll send.  Just be sure to check your spelling and grammar (and follow the rules) before you submit it; I don't mind helping but please put in some effort yourself.  That's all I ask.<br>\r\n<br>\r\nAnd that's it.  Remember to keep your feet on the ground, slave (pun entirely intended).  Good luck to you.</td>",
        "id":2227220,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595453580,
        "modified":1595453580,
        "pretty_title":"Big Foot Slave"
    }
}