{
    "chapters":{
        "1":{
            "author_id":"feather99",
            "author_name":"feather99\n",
            "choices":[
                "In front of a castle",
                "In a mystical forest",
                "In a pink meadow",
                "In a quaint town",
                "On the shore of an ocean of feathers"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey! Hehehehe! Cut it out!\" I giggled as Sarah pinched my side on the way back from our date. She loved to take advantage of how ticklish I was. It made it really difficult to disagree with her because she would just tickle me until I gave in. I still loved her though, she was nice. But today she was mad at me because I had stared at a waitresses butt during our date so I knew I was in for it. <br>\r\n<br>\r\n\"Why should I stop!\" she chided grabbing my opposite hip. I jumped away from her hand and right into her arms writhing in ticklish laughter.<br>\r\n<br>\r\n\"I'm sorryhehehehe!\"<br>\r\n<br>\r\n\"Fine,\" she let go of me and I playfully ran from her into the park.<br>\r\n<br>\r\n\"Come back here!\" she screamed as I ran into the darkness. <br>\r\n<br>\r\nI hid behind a tree and tried to catch a glimpse of her from around the side of the tree. Suddenly a strong gust of wind hit me and I fell backwards. And I didn't hit the ground. I fell straight into a hole I had somehow missed  when I hid behind the tree. I continued to scream as I fell through the pitch black hole for five minutes before I felt my tube growing tighter and tighter. <br>\r\n<br>\r\nThe tube was closing in around me and at that point is when I realized I had no close on as I felt my bare skin make contact with the slick edges of the tube. I was going head first through the quickly tightening tube and raised my arms over my head in order to race for impact. It wasn't long before the tube got so small that it form fit to my body as I fell. <br>\r\n<br>\r\nThen I felt the surface of the tube begin to change. Instead of feeling slick, every once in a while I would feel a feathery substance brush across my body. Then, suddenly it became a hellish tickle tube of feathers. I squealed as the feathers pervaded every inch of my body. Luckily it wasn't long before the tube deposited me in a brave new world</span></div></div>",
            "created":1503475140,
            "id":2373338,
            "title":"Down the Rabbit Hole"
        },
        "11":{
            "author_id":"feather99",
            "author_name":"feather99\n",
            "choices":[
                "Be sacraficed",
                "Be given as a gift",
                "Be sat in the town stocks",
                "Be thrown in the pit",
                "Be a spy for her"
            ],
            "content":"<div class=\"\"><div> <span>The fall, surprisingly, did little damage to my body. I landed on a field of rainbow feathers swaying in the wind. I stood up and recognized the ginormous blue castle that lay before me. It had four bastions linking the great walls and a giant, shimmering tower in the center. Banners of pink feathers decorated the walls of the castle. The front of the castle had one large pink door . At the door stood two guards. They were both extremely attractive women, and fairly short. They wore only blue, translucent tights, pink booty shorts, and blue lacy bras. They both held large, fuzzy, pink... swords. Their were more guards that dotted the tops of the walls of the castle holding blowguns.<br>\r\n<br>\r\n'This must be a dream!' I frantically thought to myself. I tried pinching myself... and it didn't hurt. I felt validated and was confident that somehow I blacked out and was dreaming all of this. With this confidence I strutted, naked, up to the door guarded by the two blonde vixens. <br>\r\n<br>\r\nAs soon as the guards noticed me they readied their 'weapons'. \"What is your business here?\" the blonde guard demanded.<br>\r\n<br>\r\n\"However I want,\" I gushed with my exceedingly false confidence not slowing down one bit. <br>\r\n<br>\r\n\"He is a freshling,\" the brunette girl giggled. Both girls dropped the 'swords' and walked up to me meeting me five foot from the large pink doors.<br>\r\n<br>\r\n\"So, you guys gonna let me in that dope ass castle?\" I gushed excitedly.<br>\r\n<br>\r\n\"Not exactly,\" the blonde teased, \"Now tell me, are you ticklish?\" Both girls began wiggling their finely manicured, pink fingernails in the air menacingly. <br>\r\n<br>\r\nI began backing up in protest. Dream or no dream I was insanely ticklish. \"Now, come on. We can tal-,\" I was cut short as they attacked me.<br>\r\n<br>\r\nThe blonde girl jumped onto my upperbody, immediately wrapping her legs around my waist and locking her feet at the ankles. I am a strong guy so I didn't fall down... at first. But then her hands dove into my armpits. I clenched my arms to my sides, clamping her wiggly fingers into my armpit. I collapsed to the ground giggling in hysterics. Then, I felt the brunette's tight clad legs lock around my ankles and her fingers danced on my soles. The blonde nibbled and blew raspberries all over my chest and belly. I was being tickled so much that within a few minutes, I was out.<br>\r\n<br>\r\nI woke up in a brightly lit throne room. I was tied spread eagle with silk scarves and was on a golden table in front of whom I could only assume was the queen of this castle given she sat in the throne. She wore a pink, breezy gown and light blue tights. She had long, white fingerless gloves and her shimmering blonde hair seemed to wave in the breeze even though she was inside. Upon closer inspection I realized her ears were pointy so these must be elven women.<br>\r\n<br>\r\n\"Ah, I wonder what I 'll do with you, freshling,\" the elf queen sighed as she stood up and strode up to the table.<br>\r\n<br>\r\nI tried to talk but realized that some spell must have been put on me because no sound came out.<br>\r\n<br>\r\n\"You can't speak silly. You can't even move your toes unless I say so.\" She giggled as the look of fright came across my face as I realized that my toes were frozen completely spread apart. <br>\r\n<br>\r\nShe tapped her nails on my belly watching me squirm. \"I'll have to sit and think about it, but you'll be a good footrest for now, and I'll let my wiggly play with you.\" She giggled as she sat down and outstretched her legs. She sat her soles on my belly and rubbed then in circles wiggling her toes. It tickled a little but wasn't maddening. Then, 'her wiggly', a fuzzy worm creature about a foot long, snaked down her leg as even she giggled from its touch. It snaked across my stomach, down my legs and ont my feet. I couldn't stand it! Finally she decided that I would</span></div></div>",
            "created":1505716260,
            "id":2387541,
            "title":"Before the Queen"
        }
    },
    "info":{
        "author_id":"feather99",
        "author_name":"feather99\n",
        "brief_description":"A wormhole opens up dropping Josh in a world very different from ours",
        "created":1503464340,
        "description":"<td align=\"left\" class=\"norm\">A new world fundamentally different from ours sends Josh into a multitude of ticklish situations<br>\r\n<br>\r\nRules:<br>\r\nNo M/M<br>\r\nIf there is sex it must be linked to tickling</td>",
        "id":2132053,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1505716260,
        "modified":1505716260,
        "pretty_title":"Brave New World"
    }
}