{
    "chapters":{
        "1":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "Three Big Brothers",
                "Two Star-Crossed Lovers Amongst the Stars",
                "The Centers of Attention",
                "Four A-Mage-ing Roommates",
                "Other groups of guys"
            ],
            "content":"<div class=\"\"><div> <span>Choose your guys from the groups below, or pick the last option for an opportunity to create your own group!<br>\r\n<br>\r\n1) Jordan (16), Jesse (13), and Jacob (11) are three normal brothers in present-day America who share a room. They get along well with each other, though some tensions do lie hidden beneath the surface. They bring home a “souvenir” from vacation (a small, rare Incan idol they found on the ground while touring Machu Picchu) that ends up having some interesting effects on them all.<br>\r\n<br>\r\n2) Zerikai and Caylor are two teenagers from two different species who live on a newly constructed space station. The two boys have fallen for each other despite the fact that the planets each of them are from have only recently signed a truce ending forty years of war and are still very distrustful of each other. Thus, they have to keep their relationship hidden from everyone, a task that’s as thrilling as it is frustrating. While exploring the station, they discover a new technology that could have some, ahem, “BIG” results.<br>\r\n<br>\r\n3) Marcus has been the starting center for his high school's basketball team since his freshman year, and he’s been damn good; after all, he's 6’11”, the tallest boy in the state. Now, though, as a senior trying to impress all the college scouts coming to see him play, he’s being challeneged for his starting spot by, of all things, a new freshman boy, Li, who has just arrived from China, and is already turning heads, especially since he’s seven feet tall (and still growing)! When Marcus finds out the rare herbal supplement that’s behind Li's growth, however, the race is on to see which basketball star will come out on top!<br>\r\n<br>\r\n4) Eli, Calvin, Vincent, and Alec have just started their first year at Molward Academy, a small private college that focuses on the development of magical skills, something that is not entirely unique amongst colleges of their world (though hardly commonplace). The four guys are roommates, and have found living away from home for the first time with three other guys to be both challenging and rewarding. But when one of the boys finds a book of rare spells in the library and brings it back to the room, one section in particular ignites both their curiosity and their competitiveness.  </span></div></div>",
            "created":1320642000,
            "id":1219522,
            "title":"Prelude"
        },
        "11":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "Jacob, who sleeps with it and grows during the night",
                "Jesse, who sleeps with it and grows during the night",
                "Jordan, who sleeps with it and grows during the night",
                "Jordan, but it ends up growing the other two boys during the night",
                "Something else Happens"
            ],
            "content":"<div class=\"\"><div> <span>“Hey! That's not fair!” Jesse shouted as he furrowed his brow at his younger brother. “I want to have the statue on the table next to my bed!” Scowling, he climbed his feet up on the lower bunk bed that he slept in and tried to reach out towards his younger brother's hands, which held on to an ebony idol about six inches tall. They had just bought this from a small shop near Machu Pichu, where they had gone on vacation with their family the week before. The old Peruvian woman that ran the shop   claimed it was an ancient treasure from the ruins themselves, and that it granted a special blessing on whoever slept near it.<br>\r\n<br>\r\n\"Fair?\" Jacob scoffed as he sat the idol down on the shelf above the top bunk which belonged to him, laughing slightly. \"I'm the one who saw it first and who got Mom to buy it! What's fair is that I should keep it.\" As the youngest of the three, Jacob was used to getting his way, as their parents tended to favor him and baby him, a fact of which he knew all too well and manipulated to his advantage.<br>\r\n<br>\r\n\"Would you two quiet down?!\" Jordan shook his head in frustration as he sat on his bed on the other side of the room. \"You guys have been bickering about that stupid idol since the beginning of the flight home!\" Jordan, the older brother, always tried to keep a measure of calmness about him, as he knew he was the role model to the other two boys. Of course, he would sometimes forget and lose his temper, but he tried to make sure these situations were rare.<br>\r\n<br>\r\n\"Well, what do you want us to do, then?\" Jesse asked, blowing the hair out of his eyes in frustration. \"There's only one idol, and there's three of us.<br>\r\n<br>\r\nJordan sighed. \"Didn't you guys go through Kindergarten? We're all gonna have to share.\"<br>\r\n<br>\r\n\"Well, we are sharing!\" Jacob exclaimed. \"You two can look at it from my shelf.\"<br>\r\n<br>\r\n\"Bullshit!\" Jesse shouted, lunging again for his brother and grabbing his shirt, trying to wrestle him down.<br>\r\n<br>\r\n\"Hey, hey, HEY!\" Jordan jumped up and grabbed both of his brothers, separating them. \"Calm down, you guys. There's no need to fight about this. Now, I know we all want to sleep near the lucky idol--\"<br>\r\n<br>\r\n\"It's not lucky!\" Jacob interjected. \"It's supposed to be sacred!\"<br>\r\n<br>\r\n\"Whatever,\" Jordan rolled his eyes. \"The point is, all three of us can't be the closest one to it every night. We're going to have to take turns.\"<br>\r\n<br>\r\n\"Fine,\" Jesse said as he shook himself free from Jordan's grip. \"But who gets to have it tonight?\"<br>\r\n<br>\r\n\"Yeah,\" Jacob said, climbing up to his bed and sitting on it. \"Who gets it?\"<br>\r\n<br>\r\nJordan thought for a moment, looking closely as the idol as he did so, until an idea came to him. \"You know, this thing is vaguely in the shape of a bottle. What if we spin it, and whoever it's pointing towards gets to keep it for the night?\"<br>\r\n<br>\r\nThe two other brothers considered the suggestion. \"That sounds fair, I guess,\" Jesse finally said.<br>\r\n<br>\r\n\"Cool!\" Jacob exclaimed. \"So we're gonna let the idol decide who gets to sleep with it!\"<br>\r\n<br>\r\nThe three boys sat down in a circle, with Jordan still holding the idol. They made sure they were all equally far apart from each other, then Jordan placed it on its side in the center of the circle, paused for a moment, and then gave it a good spin. It spun around remarkably fast, keeping on going for nearly thirty seconds, but it eventually landed on…</span></div></div>",
            "created":1322802000,
            "id":1233000,
            "title":"Three Big Brothers"
        },
        "113":{
            "author_id":"narutoxd",
            "author_name":"NarutoXD",
            "choices":[
                "was still there.",
                "had gone missing. Who took it?",
                "was being held by one of your brothers."
            ],
            "content":"<div class=\"\"><div> <span>The boys waited in anticipation as the bottle slowed to a halt.<br>\r\n<br>\r\nJesse and Jacob groaned in disappointment.<br>\r\n<br>\r\nJordan had mutual feelings about it, though he did have an air of superstition. “Better luck next time guys.”<br>\r\n<br>\r\nJesse and Jacob grumbled a bit and resigned to their beds. Jordan smirked. At least neither one of them can complain that the other has it.<br>\r\n<br>\r\nJordan looked at the idol under his lamp light and saw that it had little images scrawled all over it. Most had been wore away with time, but you could make out the faint images of giant people lifting boulders with easy and crushing cities. Some were helping with bridges and some were being forced into labor. In all cases, the people were huge!<br>\r\n<br>\r\nJordan’s thoughts started to drift away as he stared. As a sophomore in high school, he was pretty average. Nothing to special. He was a swimmer, so he had a relatively slim build. Not like the pros who were entirely aerodynamic and well muscled. He kind of wish he were more like them. He always finished somewhere in the middle. Never last, but never first. This kind of peeved him.<br>\r\n<br>\r\nAnyway, Jordan slept with these thoughts on him mind. As he drifted off to sleep, he imagined that it was the next day. He was strolling down the hall walking with new confidence. His muscles were large enough to make his XL shirt hug them. Everyone looked at him in awe and wanted to know how he got so huge!<br>\r\n<br>\r\n(Lets make Jordan ‘you‘)<br>\r\n<br>\r\nTo the side, you heard some girls mutter something about the abnormally large bulge that you sported for a groin. You smirked hearing that.<br>\r\n<br>\r\nAfter school at practice, you changed in your swim trunks and swimming cap. As you stepped out, you saw a group of kids gathered on the opposite side. The gasped as they saw your well chiseled abs and beefy pecs. Your biceps were large, but perfectly balance with the rest of your body to create the perfect and totally aerodynamic build.<br>\r\n<br>\r\nAs you got into the water, you started to swim your usual laps. Your well muscled arms and body cut through the water as easily as a hot knife cutting butter. You slipped through at new speeds never before scene! Before, you could never finish 20laps, but now it felt so easy. You kept going and going until you were to tired to continue. You got out of the pool and heard kids muttering.<br>\r\n<br>\r\n“Did you see that? 125 laps! That’s insane!” you chuckled inside your head and went for your shower.<br>\r\n<br>\r\nAs you turned on the water, you felt the chlorine slip off your skin. You took out your soap and started to help the cleansing. As you rubbed it off, you felt your new muscles. Every crevice, hill and ditch! It gave you a sense of satisfaction. Surprisingly, you felt your pants tighten as your python filled with blood.<br>\r\n<br>\r\nUnknowingly, you stripped your swim trunks off and grasped your huge man meat. 18in of hot steel was in your grasp. You started to jack off in the shower. After a while, you stopped because the drain was about to clog because of the huge amounts of hot seeds being released. Your tennis ball balls felt drained, but you were satisfied.<br>\r\n<br>\r\nYou made sure to hide any visible mess and left after you changed.<br>\r\n<br>\r\nWhen you got home, you ate dinner, and ate dinner again because you were so starved. You belched with satisfaction.<br>\r\n<br>\r\nWhen homework and other shores were done, you went to bed. You saw the idol on your bed and gave it a silent thanks. You fell asleep and then you woke up from your dream.<br>\r\n<br>\r\n(Back to Jordan)<br>\r\n<br>\r\nJordan sat up with a jolt. He had the greatest dream of his life last night. He felt his morning wood in his pants and the slick substance that it had released. He got out of bed and went into the bathroom. Jordan rinsed his briefs and tossed them into the hamper to be washed thoroughly.<br>\r\n<br>\r\nJordan began his usual morning routine. As he stripped, he realized something. His cloths felt more snug than ever before. They were even tight in some areas! Justine quickly removed all his cloths and looked his body over. “YES!” Jordan was shaking with excitement. He had grown into the body of his dream and he loved it. Actually, he was even bigger than that. He was taller. His hair was brushing the 7ft ceiling. His arms were built large but slim. Everything about him looked huge, but perfectly balance. Everything was in sync. It was a perfect built for strength, power, and speed. Maybe even a little flexibly, though he’ll have to word for that. Jordan felt every muscle to make sure it was real, and pinched himself a hundred time. “Its real! Oh my god… How?” Then he remembered the idol. “Can it be?” Jordan wrapped a towel around his larger body and ran into the room to grab the idol.<br>\r\n<br>\r\nWhen he got there, the idol…<br>\r\n</span></div></div>",
            "created":1325134800,
            "id":1248663,
            "title":"Jordan, who sleeps with it and grows during the..."
        },
        "1131":{
            "author_id":"narutoxd",
            "author_name":"NarutoXD",
            "choices":[
                "They were all shocked that he was suddenly huge!",
                "Nothing. He just came in really loudly. What's going on?",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Jordan was relieve when he saw the idol still on his bed. His brothers were still asleep, so they wouldn’t be an issue yet. Homeroom started in an hour, so he had some time. With his new muscle, he bet he could sprint to school with energy to spare. Plus, he only live like 5 minutes away. Jordan went to their shared closet and hunted for a set of cloths that fit his new size. He ended up with a set of XL sweats that his dad had given him in hope that he’d grow into it. Jordan let out a chuckle “I guess I did grow into it.” He slipped them on and looked in the mirror. The cloths hugged his muscles making them look even bigger. They accented certain parts making him look like a junior bodybuilder. As he looked, he realized how large a bulge he really did have. It was like someone stuffed a shirt into his pants. This was going to be a new day.<br>\r\n<br>\r\nJordan took the idol and stuffed it in his bag. He ran to a nearby copyist. The guys is famous world wide for his ability to make an exact replica of what ever you gave him. He even got the weight the same.<br>\r\n<br>\r\nAs Jordan walked up the stone path to the guy’s shop, Jordan couldn’t help but pause and stare at the rows of statues standing up front. Like an army of soldiers standing in time. After a few minutes of admiration, Jordan continued up the path into a cozy looking wood lodge.<br>\r\n<br>\r\nJordan “Hello? I’m looking to have a statue replicated.”<br>\r\n<br>\r\nIn the back of the room, Jordan heard a dry raspy voice “Hold up! Hold up! I’m not as young as I was.” An old man came trudging forward with an old looking staff as a support.<br>\r\n<br>\r\nJordan smiled at the old man to show he meant no harm and that he was just looking to have something copied. And also because he admired older people. They’ve lived a long life and they can sometimes be very interesting. One time, he spent 5 hours listening to a man at a retirement home talk about his teen years and what idiotic things he had done. “Hey. Do you need any help?”<br>\r\n<br>\r\nThe old man had stopped trudging forward “No. I’m fine, and besides. I’m already here!”<br>\r\n<br>\r\nJordan smiled “Good point. Sorry about that.”<br>\r\n<br>\r\nThe old man smiled “No… no… its alright. The day I can’t walk anymore is the day I die, but that doesn’t concern you. What concerns you is that idol I’m assuming?” He mage a gesture toward the idol in your hand.<br>\r\n<br>\r\nJordan raised his hand up to give the old man a better look “Yah. I was wondering if you could copy it, and if yes, then how much would it cost?”<br>\r\n<br>\r\nThe old man looked at it intrigued “I haven’t seen anything like this in decades. How did you come across it?”<br>\r\n<br>\r\nJordan looked at a nearby clock and saw that he had 30minutes left. He gave a quick summary about the shop and the souvenirs. “So yah. My brothers kept fighting over it, and I can’t take it anymore. I want them each to have one.”<br>\r\n<br>\r\nThe old man smiled “Now that’s the nicest thing I’ve seen an older brother do in a while. You know what? I’ll copy it for free. No charge. How do you like that?”<br>\r\n<br>\r\nJordan was shocked “Are you sure? I don’t make much, but I can pay it off over time.”<br>\r\n<br>\r\nThe old man kept waving the offers off “No. I insist. Now d you want me to copy it or not!”<br>\r\n<br>\r\nJordan stopped arguing since he knew that he lost. He just smiled and said thank you. He handed the old man the statue and turned to leave. Then he remembered that he never said his name “Oh! And my name’s Jordan. I’m glad I met you.”<br>\r\n<br>\r\nThe old man smiled “Xavier, but my friends used to call me Xav. Come by after you’re done with school. I should have it done by then.”<br>\r\n<br>\r\nJordan never told Xav that he was going to school, but he guessed that it could be assumed. “Thanks for the heads up. I appreciate it.” Xav had already turned toward his work station and began working. Jordan’s goodbye managed to get a grunt from the old man.<br>\r\n<br>\r\nAs Jordan left the lodge, he couldn’t help but smile. He really like the old man. He still had some spunk left in his bones.<br>\r\n<br>\r\nWith that, Jordan ran to school. He made long powerful strides with his mighty legs. He felt power in every step. As he ran, he let out a whoop of joy. He ran up the steps to the school and burst the doors open. <br>\r\n<br>\r\nAll the students turned and faced him with a curious expression.<br>\r\n</span></div></div>",
            "created":1325134800,
            "id":1248692,
            "title":"was still there."
        },
        "11312":{
            "author_id":"narutoxd",
            "author_name":"NarutoXD",
            "choices":[
                "Xav was attacked and the idol is gone!",
                "Nothing, Xav's lights had burnt out, and he had a hard time replacing them."
            ],
            "content":"<div class=\"\"><div> <span>Jordan stood there at the front door with everyone staring at him. Then as seen as it started, it stopped. All the students turned back toward their conversations and talked like nothing happened. What’s going on?<br>\r\n<br>\r\nJordan walked down the hall like he owned them. He had gained a bit of a cocky attitude and what not. Suddenly, he felt a light punch to his left shoulder. He turned around and saw one of the players on the swim team, Jase.<br>\r\n<br>\r\nJace “Hey! How’s the number one swimmer doing on this fine morning?”<br>\r\n<br>\r\nJordan was thoroughly confused. Why wasn’t anyone wondering why he was so huge? It’s not like this happened everyday! He decided to play along anyway “Pretty good. I had an awesome jog this morning. Felt a good pump.”<br>\r\n<br>\r\nJace smirked “Well anyway. Coach wanted me to tell you that he wants to see you before home room. That gives you about 15minutes. I would go. He seemed pretty excited.”<br>\r\n<br>\r\nJordan was curious “Ok. Thanks for the heads up.”<br>\r\n<br>\r\nJace “No prob.” With that, Jace ran off to pass a message onto another student. The kid was like Hermes, the school messenger!<br>\r\n<br>\r\nJordan walked to the coaches office and saw him sitting behind his desk looking at a pamphlet. “Coach Reese? You called for me?”<br>\r\n<br>\r\nReese looked up and with a small smile “Yes. You are here to talk about your future! Now is not a time to be shy or modest. We all know you’re the best swimmer in the state, and maybe the nation! You have caught some attention from some very important people in very important places. Trust me. I did my research. Now take a look at this.” Reese handed Jordan the pamphlet. It showed a college campus surrounded with ponds and cherry trees that were just blossoming. “Looks nice right? Well guess what. They are offering you a full ride if you sign a contract swearing that you will go to their university! They gave me a call this morning and they want to hear back with in a week. What do you think?”<br>\r\n<br>\r\nJordan was speechless. He was only a sophomore and colleges were already looking at him! He was stunned “I… I… I need to sleep on it. Do you mind?” Your neck was starting to hurt because you have to look down on every body from your 6ft 11in perspective.<br>\r\n<br>\r\nReese nodded in understanding. He nodded with approval “Good! That’s what I wanted to hear. You didn’t just nose dive right into something before you understood it. Save that for the pool. Here. Take the rest of the material they sent. Read up.” He hands you a box of material. “And Jordan. If you don’t accept, it’d be ok. Its only sophomore year. There are two more big ones to use up. Two years to get more offers. And I bet an IV league school has already taken interest in you right now. You just got to show them your true colors.”<br>\r\n<br>\r\nJordan felt like he was holding his future in a box. His arms felt weighed down by expectations and decision. Though, Reese did help him calm down a bit with the last part “Thanks coach. I’ll sleep on it.”<br>\r\n<br>\r\nWith that, he left feeling slightly less excited, but then he remembered his growth and what it had given him. His excitement returned anew.<br>\r\n<br>\r\nThe rest of the day went on ‘normally’ until he came to gym. He pretty much excelled beyond his previous capabilities.<br>\r\n<br>\r\nWhen pool practice came around, he changed into his swim trunks and diving cap. As he stepped out, he saw that some people had lined up along the bleachers to see his bulging muscles.<br>\r\n<br>\r\nWhen you stepped out, you saw some of the girls gossiping about whether Jordan were sill a virgin. At that point, he realized he still didn’t have a girlfriend to adore his godly muscles. <br>\r\n<br>\r\nWow! He’s become more and more self absorbed.<br>\r\n<br>\r\nAs he got in the water and did his laps, he felt like it was a repeat of his dream. However, he wanted to beat his previous amount. He stopped at 150 laps even. He got out panting and laying on the floor, but got up when he heard his stomach growl. He was starving! Jordan did a quick shower, changed and sprinted home. By then, his stomach was eating away at itself. It was almost painful.<br>\r\n<br>\r\nWhen he got inside, he noticed that no one was at home yet. Jesse was a basketball fanatic and Jacob was a baseball nut. They were both at practice. His parents were at work.<br>\r\n<br>\r\nJordan ran sprint/walked into the kitchen and started to cram an much left over pizza into his mouth that it could fit. The strange thing was that there were three boxes of left over pizza, and they were gone once Jordan was done with them.<br>\r\n<br>\r\nSitting back, he let out a belch and rubbed his now taunt stomach. It was full to the brim with pizza. Then as fast as it formed, his super human metabolism devoured the pizza. His round stomach had shrunk back down to his tight 6pack. <br>\r\n<br>\r\nAfter a moment of resting, he remembered that Xav was expecting him. Jordan got up and started running to Xav. When he got there, all the lights were, out but the door was open.<br>\r\n<br>\r\nDid something happen?</span></div></div>",
            "created":1325134800,
            "id":1248709,
            "title":"Nothing. He just came in really loudly. What..."
        },
        "113122":{
            "author_id":"narutoxd",
            "author_name":"NarutoXD",
            "choices":[
                "Nothing. It was his imagination.",
                "The bottle shaped idol was actually a bottle! What's inside?"
            ],
            "content":"<div class=\"\"><div> <span>Jordan walked in cautiously. He looked around and saw the light above him swinging. To the side, he heard a thud as though something had fallen over.<br>\r\n<br>\r\nXav “Dang it! Curse old age!”<br>\r\n<br>\r\nJordan ran to the source of the sound and stopped at the door. There was still some sun in the sky, so there was some light coming in through the window. Jordan saw Xam on the ground and helped him up. “What happened? Are you ok?”<br>\r\n<br>\r\nXav brushed himself off “Yah. Everything’s ok, but my lights just burnt out. They’re almost as old as me!” He chuckled and wheezed a tiny bit, but other than that he was fine.<br>\r\n<br>\r\nJordan’s heart stopped racing. He had thought the old man was attack or something. That would have been horrible! “Tell me where the replacements are. I can change them for you.”<br>\r\n<br>\r\nXav started protesting. Saying that Jordan was going to make poor old Xav lazy and incompetent. Jordan won this argument by insisting that it can be considered payment for making the copy of the idol. <br>\r\n<br>\r\nOnce the new lights were in, Xav brought Jordan to a back room and showed him the replica.<br>\r\n<br>\r\nJordan was astonished “That’s amazing! It looks just like the other one. Wait… that is the replica right? Cause I can’t tell the difference.”<br>\r\n<br>\r\nXav smiled “This one was the original” He handed Jordan the first idol. “This one is the replica.” He gives Jordan the other idol. Holding them both in his hands, he felt the faint difference. The real idol had a strange aura, and the other idol seemed less animated. However, if you hadn’t touched them, you could never tell the difference!<br>\r\n<br>\r\nJordan thanked Xav one last time and left. He might come back every now and then to check on the old man. He was a good guy.<br>\r\n<br>\r\nOnce he was at home, he saw that his brothers had returned. There was a pair of muddy cleats from Jacob and some red and gold shoes that belonged to Jesse.<br>\r\n<br>\r\nJordan smirked. He’d have to be clever when he handed them the idol. He walked up to the room and saw the two boys doing homework on their own. WOW! That’s a surprise. <br>\r\n<br>\r\nWhen they saw Jordan come in, they got up and glared at him.<br>\r\n<br>\r\nJesse “Who said you could leave with the idol! We looked everywhere.”<br>\r\n<br>\r\nJacob “Yah! What he said.”<br>\r\n<br>\r\nJordan saw an opportunity here “You know what? You’re right. You guys can have the idol now. You two can spin it tonight, and not include me. That thing has been nothing but bad luck. At least for me.”<br>\r\n<br>\r\nThe two boys seemed a little less enthusiastic about the idol now. Though, that quickly blew over. Jacob though you just trying to get them to not want it, so that Jordan could keep it all to himself.<br>\r\n<br>\r\nJacob smiled “Nice try, but that’s not going to work on me. Now gimme!” He held his hands out in a cup for Jordan to deposit the idol.<br>\r\n<br>\r\nJesse caught onto the trick “No! Give it to me!”<br>\r\n<br>\r\nJordan was getting sick of this childish behavior and screamed at the top of his lungs. His deep voice made him sound even more commanding than ever before. “Enough! Either you two learn how to share, or I’ll snap the idol in two and give you guys each a part.”<br>\r\n<br>\r\nJesse and Jacob protested. Its either all or none. Not half!<br>\r\n<br>\r\nThey stopped when Jordan held the idol in two hands in a snapping position. “Now will you share?”<br>\r\n<br>\r\nThey nodded their heads.<br>\r\n<br>\r\nJordan “Ok then! I’ll leave you two alone to spin the idol.” Jordan handed over the idol and left with the original in his backpack. A moment later, he heard Jesse whoop.<br>\r\n<br>\r\nJesse “Yes! It’s mine tonight!”<br>\r\n<br>\r\nThis was followed by Jacob throwing a tantrum. In his rage, he almost hurt Jesse. Luckily, Jordan had the common sense to come back upstairs and hold and hang Jacob by his shirt until he stopped fighting.<br>\r\n<br>\r\nJordan “You should be ashamed of yourself. You almost hurt Jesse.” Jesse was standing next to Jordan. His head only reaching the top of Jordan’s abs.<br>\r\n<br>\r\nJesse “Yah! What’s wrong with you!”<br>\r\n<br>\r\nJacob started fidgeting again “Its mine! Its mine! Its mine! I want it.”<br>\r\n<br>\r\nJordan was getting more and more tired of his youngest brother each day. Today, he had reached the boiling point “Listen you little runt. Listen and listen well. You may be the youngest and spoiled the most. Well guess what! I’m the old and when mom and dad aren’t home. I and the one in charge. Now I’m going to put you down and you’re going to look at that was over there until mom or dad get home. Do you under stand!” Jordan’s face was red from the onslaught of words he had just given.<br>\r\n<br>\r\nJesse craned his neck trying to make eye contact. His eyes were full of admiration, but mostly fear. He had never seen you ever get that angry.<br>\r\n<br>\r\nJacob’s mouth was open in shock. Partly because he had never been talked to like that, and he was afraid. Truly and horribly afraid. Jacob started to burst into tears and cry like never before. In years past, he cried to get what he wanted, but now these were real tears. Not the fake tears he used to conjure up.<br>\r\n<br>\r\nJordan tried to stay angry. He’d been holding it back for years. Ever since Jacob learnt he could take advantage of Mom and Dad, he’d gotten away with everything. In middle school, Jordan had been working for months on a science project. It was the day before it was supposed to be presented. The poster boards were made, and the model was created. Then guess what! Jacob got bored and decided to play. The teach had some mercy and gave Jordan a C- instead of the D he was supposed to get. Then the thing that made it worse was that his parents barely punished the twerp. Gave him a mean look and told him to go to his room. Nothing else!<br>\r\n<br>\r\nAll of his anger and pent up frustration was burnt away in his long tirade, and now it was gone. He felt kind of guilty for yelling at Jacob.<br>\r\n<br>\r\nJordan “Jacob… I’m… I’m sorry. I shouldn’t ha-”<br>\r\n<br>\r\nJacob “I hate you! Let go of my.” He pulled himself up your Jordan’s arm and bit him. Jordan let go in surprise. The bite did no physical damage, but the emotion strain was much greater.<br>\r\n<br>\r\nJordan looked at Jacob got up and ran out of the room. He turned and faced Jesse. Jesse caught Jordan’s eyes and turned away fearing that if he made eye contact, he’d be the next victim.<br>\r\n<br>\r\nJordan “Do you hate me?”<br>\r\n<br>\r\nJesse stuttered “N-n-no, but I am an a little scared.” He recoiled back fearing that you might hurt him.<br>\r\n<br>\r\nJordan looked in the mirror and saw a studly hunk, but he also saw a monster that hurt his brothers.<br>\r\n<br>\r\nThen he heard the slamming of the front door from down stairs.<br>\r\n<br>\r\nJordan thought the worst “No! He didn’t!” Then he turned to Jesse “You look through the house and see if he’s here. Give me a call if he is. I’m going outside.”<br>\r\n<br>\r\nJesse had forgotten his fears and looked at his brother with admiration. Jordan’s deep voice, tall stature, and large build gave him the aura of command. Instinctively, after seeing dozens of army movies and shows “Sir yes sir!”<br>\r\n<br>\r\nJordan couldn’t help but let out a smirk after hear that. “Hmm… sir. I like that. No go!”<br>\r\n<br>\r\nJesse ran out and started looking with a flash light. Jordan ran down stairs and burst out the front door and started to sprint to who know where?<br>\r\n<br>\r\nAn hour later, nothing. Jordan started to trudge home. His legs were worn out. He’d sprinted from one end of town to the other. He asked Jacob’s friends if they had seem him, but that got him no where. They gave him possible locations, but those were all dead spots. <br>\r\n<br>\r\nWhen he got home, he saw that his parents’ cars were parked in the driveway. When he stepped inside, heard a heart wrenching cry. His dad was holding his mom in a heart felt hug. He caught his dad’s eye. They were full of sadness, but when they saw Jordan, they filled with anger and frustration.<br>\r\n<br>\r\nJordan looked away and stalked toward his room and locked the door. Out of the corner of his eye, he saw a bit of the idol sticking out of his backpack. Instantly, he grew to hate the idol. He walked over and yanked it out of his bag and glared at it. He imagined all his hate going in his hands turning into heat and melt the cursed idol. But sadly, that didn’t happen. Out of frustration, Jordan threw the idol at the wall. He threw it so hard, that the top entered the wall there by leaving the idol attached to it.<br>\r\n<br>\r\nThe throw left Jordan some satisfaction. It helped him release some steam. Slowly, he walked up to the idol again and pulled it out.<br>\r\n<br>\r\nWhen he looked at it, he thought he saw something different.<br>\r\n<br>\r\nWhat is it?<br>\r\n</span></div></div>",
            "created":1325134800,
            "id":1248734,
            "title":"Nothing, Xav's lights had burnt out, and he..."
        },
        "1131222":{
            "author_id":"narutoxd",
            "author_name":"NarutoXD",
            "choices":[
                "Jordan comes back to see that things have improved. Lets go back to the Battles!",
                "Lets switch over to Jordan's perspective. What else did the liquid do to him?"
            ],
            "content":"<div class=\"\"><div> <span>Jordan looked at the idol and saw a tiny crack had formed. Then a tiny sliver of a golden liquid began to trickle out of the crack. Jordan felt the power in the liquid and knew that it had some type of magic to it. Jordan hung the bottle over his mouth and let the liquid drip down his throat. He wanted it to do one thing right now. Help him find his brother.<br>\r\n<br>\r\nThe moment it touched his tongue, he tasted 1001 flavors in single moment. He felt himself grow light as he continued drinking from the idol. Suddenly, he had a waking dream. He felt himself float out of his body and get sucked through the walls and into the streets. The dream dragged him through a maze of roads and dark alleys. Then he stopped. He saw his brother hiding behind a dumpster and called to him. Jacob didn’t hear him, or couldn’t hear him. Then Jordan heard the yells of some foreign sounding men. Jacob began to shake with from fear. The men were closing in on him. At the last second, Jacob burst forward and started running down the alley. <br>\r\n<br>\r\nThen everything turned a bright gold, and Jordan was back in his body. He was still holding the idol, but it was empty. Before he knew what he was doing, he was already running down the hall. He shoved past his angry father and crying mother, and sprinted through the street. He somehow remembered the path his dream had given him. As he neared the original spot, he felt a mental pull in another direction. He followed the pull. When he came out of the alley, he saw a dark van and two men dragging his brother into it.<br>\r\n<br>\r\nJordan was fuming. He charge the van.<br>\r\n<br>\r\nThe men inside had just gagged Jacob and had closed the door. Suddenly, the door caved in. It was dented and nearly pulverized. A giant shadow loomed into the contents of the car. It punched the two men senseless and then grabbed Jacob.<br>\r\n<br>\r\nThen the shadow started sprinting home with the boy over his shoulder like a sack of rice. Jacob was bobbing up and down. He knew who it was and was some what glad that he was here. Some time during the escape, Jacob had fallen fast asleep.<br>\r\n<br>\r\nJacob woke back up in a hospital. Everything was white. He saw his mom on the side holding his hand. He could hear yelling just outside his room.<br>\r\n<br>\r\nDad “What’s wrong with you! How could you have let him out like that? I thought I raised you better!”<br>\r\n<br>\r\nJordan “You think I let him out on purpose? Huh? It as much a shock to as it was to you. And guess what! You weren’t the one running back and forth across town looking for him! You were at home where it was warm. You got to hug mom and make her feel better. I could have done that! But no! I ran out and punch the living **** out of those people before they could get him. Don’t ask me how I knew where he was. I just did.”<br>\r\n<br>\r\nDad tone soften up “I would have gone to, but…” He drifted off there.<br>\r\n<br>\r\nJordan scoffed “I thought so.”<br>\r\n<br>\r\nDad’s tone got more irritated now “Now you listen here.”<br>\r\n<br>\r\nJordan cut him off “No you listen. I’m tired of you not listening. You always think your right and you never stop and listen! Now I’m going to make you.”<br>\r\n<br>\r\nDad “Now hold up. When haven’t I listened?”<br>\r\n<br>\r\nJordan scoffed again “When ever it involve your precious little boy. When ever it deals with him, you totally disregard anything else. He made me fail science in middle school!”<br>\r\n<br>\r\nDad “It wasn’t his fault! He was just a baby.”<br>\r\n<br>\r\nJordan “Dad! He was 9! That isn’t the age of a baby! He getting older and he’s moving on. You guys aren’t! You guys are blind for god’s sake! He uses you guys and gets what ever he wants. When I asked for something when I was his age, you decided I had to work for it. How about him!”<br>\r\n<br>\r\nDad’s voice started to croak “It was before we got some money. We have more now.”<br>\r\n<br>\r\nJordan “And that lets you give him what ever he wants. How about me? Nothing has changed. I still have to do everything the same as before!”<br>\r\n<br>\r\nDad “You ask for to much. We can’t get them.”<br>\r\n<br>\r\nJordan laughed “That’s funny. Really… it is. The only think I asked for in the last 3 years was an ipod. Maybe $100 at most. Your answer was get it yourself! Then dear little Jacob asked for a quad core computer and you tossed money at his feet. That’s funny. It really is.”<br>\r\n<br>\r\nDad was silent “Leave. I don’t want to see you till dinner.”<br>\r\n<br>\r\nJordan sneered “You can’t take it can you? Knowing you created a selfish and self-centered snob. He’s a good kid at heart, but its buried under so much stuff like selfishness that the good side rarely pops up!”<br>\r\n<br>\r\nDad “Leave! I won’t hear anymore of your insults!”<br>\r\n<br>\r\nJordan wanted to spit at his father, but decided against it “I want change. For the better I hope.” Jordan walked away and jogged to someplace quiet.<br>\r\n<br>\r\nJacob was in bed and he heard every word. Then he heard something fall to the ground outside the door. Followed by the sound of crying. Jacob’s heart was being crushed by cinder blocks of guilt. His brother told him everything he was, and he couldn’t deny it. He started to cry.<br>\r\n<br>\r\nAt this point, the noise had finally woke up their mom. She saw Jacob crying and hugged him to comfort him.<br>\r\n<br>\r\nLater that evening, at dinner, every one was at home. They acted like usual. Like nothing happened. However, the air was full of tension. Like a single sound would make the room explode.<br>\r\n<br>\r\nDad said silently “Family meeting.” Everyone gathered at the table.<br>\r\n<br>\r\nMom was worried. She’d never seen Dad so solemn. “Honey. What’s wrong? Is what Jordan did still bothering you. I can deal with him.”<br>\r\n<br>\r\nJordan heard this and snorted. This caught his mom’s attention. She still felt very angry that he let Jacob out and was about to snap at him, but Dad’s hand rested on her shoulder telling her to stop.<br>\r\n<br>\r\nDad “Rebecca, it was out fault in the first place.”<br>\r\n<br>\r\nMom/Rebecca “What do you mean? I can’t possible tell where we went wrong with Jordan. We did everything right!”<br>\r\n<br>\r\nDad “We didn’t go wrong with Jordan. He’s probable the least wrong person in the family.”<br>\r\n<br>\r\nMom “John, then what did we do?”<br>\r\n<br>\r\nJesse decided to chip in. He was treated more like Jordan that like Jacob, so he knew how Jordan felt. “You spoiled Jacob like crazy!”<br>\r\n<br>\r\nMom “We did now. We treat you all the same!”<br>\r\n<br>\r\nDad “No. He’s right. While you were sleeping with Jacob…”<br>\r\n<br>\r\nJacob jumped in “Jordan and Dad had an argument. I heard all of it. Jordan was right. I was being selfish and greedy. I hated him when he yelled at me, so I ran. Then he saved me. I didn’t know how to feel, so I just chose to be glad he saved me. I can’t believe I’m saying this, but if you’re going to punish someone. Then it’s probably me.”<br>\r\n<br>\r\nEveryone was silent.<br>\r\n<br>\r\nMom smiled “Aww… its ok. See? He’s such a good boy. You don’t need to be punished.”<br>\r\n<br>\r\nAt that moment, Jordan slammed his hands onto the table. Stood up and walked away from the house. He’d come back in a while.<br>\r\n<br>\r\nJesse sighed “You did it again.”<br>\r\n<br>\r\nMom was dumbstruck “What did I do?”<br>\r\n<br>\r\nDad “I don’t want him to sound cruel, but he wanted us to do something about Jacob. Not necessarily bad, but a punishment of sorts. We never punished him before, and we hesitate for some reason. We have treated them differently. We were harder on Jordan than these two.”<br>\r\n<br>\r\nMom was in denial “I can’t accept it. We did what was best. For them!”<br>\r\n<br>\r\nDad “We did good with Jordan, though we could have given him more. We made him work for everything. Jesse was a little like that to, but I realized that we had started treating him like Jacob as well. Don’t you see? We spoil them to much.”<br>\r\n<br>\r\nEven Jesse and Jacob nodded in agreement. Ever since Jordan flipped out, they felt like someone threw off a shroud and woke them up.<br>\r\n<br>\r\nThey told mom exactly what happened, and her eyes opened in disbelief. She remained in denial. He perfect little boy couldn’t have…<br>\r\n<br>\r\nLets just say that there would be reforms.<br>\r\n<br>\r\nWhat happens now?<br>\r\n</span></div></div>",
            "created":1325134800,
            "id":1248959,
            "title":"The bottle shaped idol was actually a bottle! W..."
        },
        "11312222":{
            "author_id":"narutoxd",
            "author_name":"NarutoXD",
            "choices":[
                "The idol kept its origional magic! Jesse grew!",
                "Its a dead relic. Did Jordan have it's powers now?"
            ],
            "content":"<div class=\"\"><div> <span>Jordan stormed out of the house. He couldn’t believe his mom. The ignorance! He ducked slightly as he marched past the door and then ran out into the streets. He stopped at the city pond near by and just sat quietly. Thinking…<br>\r\n<br>\r\nAs he thought about it, he did feel kind of guilty. His parents were doing what they thought was right. Though they did get a little side tracked. He couldn’t stay mad much longer, so he just ended up sighing and looking up at what ever stars we could see. The light pollution kept the stars to a minimal. <br>\r\n<br>\r\nAfter a while Jordan groaned “What have I done!” He punches the water in front of him. He acted so rude and arrogant to his dad. He didn’t know if this would get an better. <br>\r\n<br>\r\nThen he heard the revving of an engine. It was a black van with a missing door. The van was charging right at him. It was going to fast, and he couldn’t get out of the way in time.<br>\r\n<br>\r\nSuddenly, he felt like someone plugged him into an outlet. His body surged with energy as it exploded in growth. His 7ft height surged forward making him a towering 10ft tall wall of muscle. In order to keep Jordan safe, the liquid he drank made him grow large enough to survive the impact. He was about 500lbs of bulging muscles. His pecs pushed 1ft off his body. His 8pack abs were as hard diamond.  His watermelon biceps made him look like he could hug a tree and snap it in half without even trying. His giant legs grew so large that they rubbed against each other when he walked. <br>\r\n<br>\r\nBAM! The van came to a full stop as it made contact with a wall of flesh.<br>\r\n<br>\r\nJordan “Oof. Ouch!” He felt like he was hit by a van. (Bless his imagination).<br>\r\n<br>\r\nThe people in the van jumped out with a couple loaded shotguns “Your’th goin’ t’th paay.” The guy was talking with a lisp, but I think he was say “You’re going to pay.” Jordan must have him his pretty hard because he was bruised everywhere.<br>\r\n<br>\r\nJordan saw the guns and ran up to one guy. He grabbed the open end and squeezed it shut. The guy fired, but nothing came out. He fired again and again until BOOM! His gun exploded from the tremendous pressure inside. Jordan turned to the other guys and they fired. There was the sound of bullets ricocheting. <br>\r\n<br>\r\nJordan was going to have some bruises, but other than that, he was fine. One of the men was hit by a bullet and fell to the ground clutching his groin. The others fired again out of fear, but when Jordan was un-phased, they turn tailed and ran.<br>\r\n<br>\r\nWhen they were out of sight, Jordan looked down at his body in shock. He had to be the biggest teen or person on earth! He flexed his huge biceps and they rose high into the air. He started bouncing his basketball pecs and laughed. It always humored him when people did this, and it was funnier when he did it.<br>\r\n<br>\r\nThere was a honk behind him and he saw his dad’s car. His dad was inside waving for him to come in.<br>\r\n<br>\r\nYour joyful mood turned a little sour. Maybe you’d give him a shot. You got in the shotgun and waited.<br>\r\n<br>\r\nDad was quiet “We talked. The family and I. You were right.”<br>\r\n<br>\r\nJordan was slightly shocked that he had such an impact, but then again, a 10ft behemoth is hard to ignore. “You did! I am? Wait. I am!”<br>\r\n<br>\r\nDad smiled slightly “We, your mom and I, agreed to limit your brothers a little more. I though about what you said, and I see that I did make a few large mistakes. I hope I can fix them before its to late.” His dad sounded kind of de-motivated. Like he had aged 10years in that one day.<br>\r\n<br>\r\nJordan looked at his dad and felt partially guilty, but he was satisfied for the most part “So what are we changing?”<br>\r\n<br>\r\nDad “Your mom and I are going to try to raise Jesse and Jacob more like you. You’re responsible and dependable. I’m sorry I didn’t see it before. I guess that you were growing up so fast, I couldn’t keep up. I clung to the closest thing that I remembered of you and then Jacob came. I didn’t want to move on any more, so I wanted him to be mine for a long time. But then this happened and then that, and I felt like it was all falling apart. I’m sorry. It’s just that your old man loves you all to much. I can’t see the day I have to let you all go.” Dad voice was croaked and he was crying lightly.<br>\r\n<br>\r\nJordan stared at his dad in surprise and shock. Today must have hit dad more than he had thought “Dad. It’s not like I’ll be gone forever. I’ll visit, and I’m not gone yet.”<br>\r\n<br>\r\nDad “I know that! But the thought that I have to let go… it… I can’t.”<br>\r\n<br>\r\nJordan put a firm hand on his dad’s shoulder. It looked kind of odd. His hand was big enough to grasp the entirety of the shoulder and more. This growth was much to big, but he didn’t care. The moment was to emotional. “Then stop  thinking about it. Just go with the flow, and don’t fight. It’s easier that way.”<br>\r\n<br>\r\nDad smiled “You heard that from Grampa didn’t you. O’ he kept telling us… You are getting bigger and bigger every day. I love too see you get stronger, but I hate to see that you’re just ready to go. It’s hard not to think about it, but I’ll give it a shot. I’ll fill your mom in later. Promise me you won’t tell anyone I cried like that. I’ll look less masculine if you know what I mean.”<br>\r\n<br>\r\nJordan looked at his dad in surprise. That was that. The chat was done, and he was relatively satisfied. He smiled. Less masculine indeed! “Fine, but if I see things relapsing. Pack your bags. Your going on the carpet of shame.”<br>\r\n<br>\r\nDad smiled “Blackmail… Hmmm. Maybe I didn’t raise you that well.”<br>\r\n<br>\r\nJordan “What’s that supposed to mean?”<br>\r\n<br>\r\nThey laughed their way home.<br>\r\n<br>\r\nJordan walked up the stair. They groaned under his weight. When he got to his room, both his brothers were fast asleep. Jesse had the idol, and the wall still had a hole in it. Jordan sighed. Then he glimpsed himself in the mirror. This all happened because of an old relic. Jordan looked under his bed and pulled out the real idol. He lifted Jesse’s arms and slipped the real one in and took the fake one out.<br>\r\n<br>\r\nIt was his turn after all.<br>\r\n<br>\r\nJordan sighed and went to bed.<br>\r\n<br>\r\nThe next morning…<br>\r\n</span></div></div>",
            "created":1325134800,
            "id":1248973,
            "title":"Lets switch over to Jordan's perspective. W..."
        },
        "113122221":{
            "author_id":"narutoxd",
            "author_name":"NarutoXD",
            "choices":[
                "He grows huge muscles that can hit a homerun everytime or throw a ball at 150mph",
                "He grows in general."
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Jordan stretched an stood up. Thump. “Ouch!” Jordan just bumped his head on the 7ft ceiling. <br>\r\n<br>\r\nHe looked around and saw something shocking. Jesse! His feet were sticking out front beneath his blanket. They hung over the mattress! Jordan was shocked. He walked up to Jesse and gave him a light tap. Jesse woke up immediately.<br>\r\n<br>\r\nJesse “What!”<br>\r\n<br>\r\nJordan “Look at yourself in the mirror.”<br>\r\n<br>\r\nJesse “You got my up so I could look in the mirror?”<br>\r\n<br>\r\nJordan sighed “Just do it.” <br>\r\n<br>\r\nJesse sighed but complied. As he stood up, he felt something was off. He was looking straight at Jordan’s pec. He was never tall enough to do that before. “Did you shrink?”<br>\r\n<br>\r\nJordan laughed “No. You grew! Look!”<br>\r\n<br>\r\nJesse turned and faced the mirror. He saw a 6ft 6in tall kid with a decent build. It was perfect for basketball for kids in his age group. He had to be the tallest in the class.<br>\r\n<br>\r\nJordan “I think the idol did this to you like it did to me.”<br>\r\n<br>\r\nJesse “What? What did it do to you? You were always that big.”<br>\r\n<br>\r\nJordan “I wasn’t I used to be average in every way until I slept with it the first night. Than this happened.” He pointed to the rest of his body.<br>\r\n<br>\r\nJesse was in shock “No way!”<br>\r\n<br>\r\nJordan “Yes way! Now get back to bed or something. I have to get ready for school and you still have like an hour before you have to get out of bed.”<br>\r\n<br>\r\nJesse laid down, but he couldn’t sleep. How on earth did this happen. What he dreaming? This had to be the best dream ever! He couldn’t wait for school and basketball practice. He’d own everyone today.<br>\r\n<br>\r\nJesse heard the shower turn on and later turn off. The stairs groaned as his giant brother walked down them. The front door slammed as his brother closed it. Jesse couldn’t sit any longer. He got out of bed and ran outside. He started to dribble the basket ball back and forth and tried shooting at his new height. He missed a couple dozen times as he tried to adjust to his height. After an hour had passed, he managed to get 10 shots in a row. He heard a loud yawn as Jacob woke up.<br>\r\n<br>\r\nJesse took this as his warning to start getting ready for school. He took his shower, breakfast, etc.<br>\r\n<br>\r\nAt school, he was expecting people to freak out or stare at him, but far from it. Every now and then, he’d get a compliment or joke like “How’s the weather up there big guy? Ready to win the game for us again?”<br>\r\n<br>\r\nJesse was totally confused, but he didn’t care. This gave him a lot less trouble.<br>\r\n<br>\r\nAt practice, he totally dominated. Catching rebounds and dunking almost every shot he made. It was the greatest day of his life.<br>\r\n<br>\r\nWhen he got home, he was just about ready to die and go to heaven. Everything he ever wanted was given to him.<br>\r\n<br>\r\nWhen bed time came, Jesse looked at the idol on his bed. He wanted to sleep with it again so much, but he saw Jordan looking at him expectantly. He gave it to Jacob after a little mental dispute.<br>\r\n<br>\r\nWhat happens to out little boy?<br>\r\n</span></div></div>",
            "created":1325134800,
            "id":1248977,
            "title":"The idol kept its origional magic! Jesse grew!"
        },
        "1131222212":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "This night's growth spurt brings much more results than the first.",
                "Jordan doesn't grow at all! One of his brother's took the idol while he slept."
            ],
            "content":"<div class=\"\"><div> <span>When Jacob woke up the next morning, he noticed that his two brothers were both already wide awake, sitting on their beds and staring at him with a bit of a shocked look on their faces.<br>\r\n<br>\r\n\"What's the matter?\" he asked, stretching a bit as he yawned. <br>\r\n<br>\r\n\"Uhh, see for yourself,\" Jesse said, pointing to the bathroom mirror. <br>\r\n<br>\r\nJacob hopped out of bed, feeling a bit disoriented for some reason, but he chalked that up to being early in the morning. He stumbled into the bathroom, turned on the faucet, and splashed some water into his face. Out of the corner of his eye, he saw something strange in the mirror, and when he looked closer, he nearly fell back in amazement.<br>\r\n<br>\r\n\"Oh wow! I'm big!\" he exclaimed. He looked over himself. \"I must be nearly as tall as Jesse now,\" he said aloud. Running back into the bedroom, his larger feet making much more noise than anyone had been used to, he tugged at Jesse to stand up, then stood back to back with him. In fact, he was just about an inch shorter than the middle brother, but he was still pretty impressed. \"I guess I'm finally catching up to you two guys,\" he said, beaming. <br>\r\n<br>\r\n\"Well, actually--\" Jesse started, but then Jordan cut him off, quickly shaking his head. <br>\r\n<br>\r\nLater that morning, while they were still upstairs but Jacob had gone down for breakfast, Jordan told Jesse, \"Let's not tell him anything about the idol yet. We don't quite know what all is going on, and I'd rather figure things out first.\"<br>\r\n<br>\r\n\"Why?\" Jesse asked. \"He's got every much of a right to know as us!\"<br>\r\n<br>\r\n\"Not yet,\" Jordan simply replied. \"But if it happens again, if we all each grow again, then we can let him know.\"<br>\r\n<br>\r\nJacob's day at school was amazing. He was a little surprised to see that no one else besides his brothers out-and-out acknowledged his sudden growth spurt, but he was pleasantly surprised to see that he was now the most popular kid in school. The desks, though, seemed awfully tight now, but that was a small price to pay.<br>\r\n<br>\r\nThat evening, as the brothers were all getting ready for bed, Jordan picked up the idol. \"I guess it comes back to me tonight, huh?\" He tried to hide his excitement, but Jesse, at least, could plainly tell that Jordan was psyched.<br>\r\n<br>\r\n\"Yeah, I guess,\" Jesse said, a little disappointed.<br>\r\n<br>\r\nThey all three climbed into bed, and Jordan quickly found himself asleep, waiting to see what tomorrow would bring.</span></div></div>",
            "created":1330491600,
            "id":1286150,
            "title":"He grows in general."
        },
        "11312222122":{
            "choices":[
                "Hang out with your brothers and slowly outgrow them.",
                "Go to school and then stay at someone else's house."
            ],
            "content":"<div class=\"\"><div> <span>Jordan woke up the next morning and jumped out of bed. He quickly hit his head on the ceiling and he knew he had gotten bigger but he was disappointed to see it was only a couple of inches. That's when he realized the idol wasn't in his bed! He looked all over for it! He could hear his brother waking up but he was too busy looking under his bed for the idol. \"OW!\" yelled Jesse. It was enough to make Jordan turn around. \"Jesse I can't find-\" he had stood up and turned around to face his younger brother. He expected to look down, but he was actually having to look up! Jesse was standing up as much as he could. He had his knees bent a little bit and his shoulders were still pressed up against the ceiling! \"WHERE'S MY IDOL!\" yelled Jordan. He was furious! It wasn't fair Jesse had taken his turn! Jordan had shared it with his brothers. He could have easily kept it for himself. \"YOUR IDOL?!\" yelled back Jesse. By this time Jacob had woken up and he was curious as to why they were fighting. He was still unaware it was the idol that had made them all grow. \"Jesse why did you take the idol? It was Jordan's turn! Jordan why are you yelling? You know Jesse could beat you up if he wanted to.\" Jacob tried to get them to understand. Jordan thought about what he had just said and knew he was probably right. He hadn't noticed it earlier but Jesse had gotten a lot more muscular with his new height. \"Jacob go outside and play.\" Jesse commanded. Jacob smiled and ran outside clueless to what the older two were talking about. Jesse turned to Jordan and said, \"You've always been the bigger brother. It was my turn!\" \"But Jesse I'm also the OLDEST brother! Of course I'm going to be bigger! Now give me my idol.\" Jordan saw it on Jesse's bed and he reached for it. Jesse snatched it up and said \"No! It's mine!\" The two of them wrestled over it for a while. Jordan able to keep up because of Jesse's restricted mobility- it's hard for a twelve foot tall muscle-hunk to move around in a seven foot room. The idol came loose and fell to Jordan's side of the room. Jordan dove for it and remembered the fake one he had. He switched the two and acted like he had the real one. \"Yes! It's mine!\" Jesse held Jordan down with one huge hand and pried the idol free with the other. \"Not anymore! I'm not done being the biggest!\" You stuffed the real one in your pocket and ran out of the room. What were you going to do? Stay around here or go somewhere else to grow?</span></div></div>",
            "created":1348981200,
            "id":1437824,
            "title":"Jesse took it!"
        },
        "113122221221":{
            "choices":[
                "Keep the idol overnight ",
                "Give the idol to Jacob "
            ],
            "content":"<div class=\"\"><div> <span>Jesse was satisfied with the false idol. He shoved it in his pocket and went outside to play with Jacob. Jordan, with the real idol in his pocket, decided to stick around and watch as he grew bigger than his little brother. Jesse and Jacob were running around in the background kicking a soccer ball back and forth. You stood by and watched for about half an hour as the idol sent a warm tingling sensation throughout your body. You could feel yourself slowly but surely growing bigger and taller. Neither of your brothers seemed to notice. After a couple of hours, Jordan felt his clothes were tighter, but they still fit. The ball rolled over to him and Jacob ran over to get it. \"Want to play big bro?\" He asked. You smiled and said sure. You ran around kicking the ball wi your brothers. Whenever you ran past Jesse you were able to really see how big you were getting! When your mom came out and called everyone in for dinner, Jacob sprinted inside. You started to walk in when you felt Jesse's hand on your shoulder. <br>\r\n<br>\r\nYou turned around and looked down at your younger brother. He only came up to your shoulders! \"What?\" You asked him. <br>\r\n\"You know good and well what.\" He said. \"How did you grow when I have the idol?\" <br>\r\n\"I don't know. I guess the magic rubbed off on me after we fought over it. Should've just let me have my turn.\" You turned around to leave. Jesse looked furious. He threw it at the back of your head making you stop. You knelt down and picked it up. You stuck it your back pocket before turning around and glaring at Jesse. You took one step toward him and grabbed him by his shirt collar. Your bicep bulging, you lifted him off the ground and held him at eye level. \"Keep acting like that and I'll break the damn thing. Or I'll make sure me and Jacob are the only ones who get it.\" You said through gritted teeth. Jesse was sweating! You could see the fear in his eyes. You dropped him and let him crumple on the ground. </span></div></div>",
            "created":1373605200,
            "id":1627182,
            "title":"Stay at home"
        },
        "12":{
            "choices":[
                "Himself",
                "Caylor",
                "a Myprax"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Caylor!\" Zerry yelled exuberantly at Caylor's door. \"I've got something to show you!\"<br>\r\n<br>\r\nCaylor groaned as Zerry<i> always</i> had something to show him. But he didn't want to upset him and pressed the OPEN button. Zerry rushed in holding a large yellow box.<br>\r\n<br>\r\n\"Quickly,\" Zerry yelled. \"Shut it.\" Confused, Caylor pressed the SHUT button. Zerry made sure there was nobody else around and began to open the box. Inside of it was a triple-prong laser and a jar of Mippraxes.<br>\r\n<br>\r\n\"What are you doing with those?\" Caylor stammered. \"You know those are illegal here!\"<br>\r\n<br>\r\nZerry was a Derrpam, with tan skin and spiky, orange hair and a long belly-button tentacle for his age. Caylor was a Qentom, with light blue skin and very strong muscles, yet still being quite weak compared to other Qentoms. Myppraxes were miniature people, about the size of a regular-sized specy's thumb. There were known to hold a lot of energy, so laws were often made to protect them.<br>\r\n<br>\r\n\"Just whatch Zerry said as he delicately shoved several mypaxes into the laser with his belly-button-tentacle. Caylor had rarely seen such three-pronged lasers, since most usually used a lot of energy. <br>\r\n<br>\r\n\"What does it do?\" Caylor asked.<br>\r\n\"It makes any kind of species grow,\" Zerry said. \"Just the species and nothing else.\"<br>\r\n\"I've heard about some research on that,\" Caylor said.<br>\r\n\"Well it works,\" Zerry said. Watch.\" He aimed the laser at.<br>\r\n</span></div></div>",
            "created":1364187600,
            "id":1557269,
            "title":"Two Star-Crossed Lovers Amongst the Stars"
        },
        "13":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "When practices start, Li has grown a few inches & greatly improved his skills",
                "In the next few weeks, Marcus and Li strike up a friendship",
                "To counteract Li's height advantage, Marcus works out, hoping to get more buff",
                "Marcus tries to get to know Li better, but Li is aloof",
                "Something Else Happens"
            ],
            "content":"<div class=\"\"><div> <span>From the moment Marcus laid eyes on Li, the first day of his senior year when the new freshman from China walked in through the doors of his school, Marcus knew that they would be in competition with each other. After all, it was rare enough when he was the only boy in the school who was nearly seven feet tall, but now, Li threatened to steal the spotlight from him, an inch taller and three years younger to boot. As the year proceeded, Marcus prayed that Li would decide against trying out for the basketball team, at least until after Marcus had graduated.<br>\r\n<br>\r\nMarcus's prayers went unanswered.<br>\r\n<br>\r\nThe tryouts had always been merely a formality for Marcus. He was probably the best basketball player in the state, and no one in the school had ever come anywhere close to him in either height or skill. And while this year Li had surpassed him in one of those categories, Marcus still was a much better basketball player than the tall Asian boy, and when the two went head-to-head, Marcus clearly outclassed Li, though the freshman held his own.<br>\r\n<br>\r\nAfter the tryouts had finished, the boys headed to the locker room to shower and change. Marcus found Li sitting on a bench, a towel wrapped around his neck. Taking a deep breath, he decided to be welcoming and get to know this new boy who could soon be his rival. \"Hey, man,\" he said, sticking out his hand. \"My name's Marcus.\"<br>\r\n<br>\r\nLi hesitated for a moment, but then shook Marcus's hand in return. \"Li,\" he said simply, his voice soft and quiet. Marcus wondered to himself how good the kid's English was. After all, he did just move here from another country.<br>\r\n<br>\r\n\"You sure did pretty well for a freshman,\" he said, sitting next to him and beginning to take off his shoes. \"How long have you been playing?\"<br>\r\n<br>\r\nLi stared down at the floor as he answered. \"Six months,\" he said.<br>\r\n<br>\r\n\"Six months?!\" Marcus was in shock. First of all, he couldn't imagine a kid that tall not being pressured or forced into playing basketball at a very early age. But more importantly, if he'd only been playing for a few months, that meant he had a lot of room to improve. Not to mention that he probably still had a year or two of growing left in him. Pretty soon, Marcus thought, he could be a superstar.<br>\r\n<br>\r\n\"Wow!\" Marcus said, trying to force a smile. \"Well, I know we'll be on the team together this year. Here's to a good year!\"<br>\r\n<br>\r\n\"Yes.\" Deciding he wasn't going to get any more than that, Marcus nodded and stood back up, heading towards the showers. As he did so, though, he heard Li's voice calling out behind him. \"You played well too, Marcus.\" His smile growing bigger, Marcus turned around and nodded in thanks. <br>\r\n<br>\r\n\"He may end up stealing the spotlight from me,\" Marcus said to himself as he stripped down and stepped into the shower, \"but there was just something about him that I can't help but like.\"</span></div></div>",
            "created":1322802000,
            "id":1232991,
            "title":"Already Tall, But Room For More"
        },
        "132":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "The rest of the day passes uneventfully, and it's time for them to practice. ",
                "After school, Marcus is waiting and Li hasn't shown yet. Where could he be?",
                "Li comes to see Marcus in between classes. "
            ],
            "content":"<div class=\"\"><div> <span>Marcus wasn't quite sure why, but the next day he found himself arriving early to school (an amazing feat in itself). After he stuck his backpack in his own locker, he decided to head over to the area where he thought Li's locker would be. Freshmen were usually relegated to the second story of the west wing of the school for their locker assignments, where most of the classes they would take (Biology, Geometry, etc.) were held. This was pretty much the furthest possible point from Marcus's locker, and took him a good ten minutes to walk, even with the halls mostly empty. <br>\r\n<br>\r\nAs he got closer, Marcus kept his eyes open for the spiky black shock of hair atop a head sticking a good foot and a half above the others. He figured Li would be easy enough to spot, but after walking up and down the hallway for several minutes, with nervous freshmen looking up at the super-tall senior in their midst, he couldn't find him. Maybe I should check the library, he thought to himself.<br>\r\n<br>\r\nHe stopped in the middle of the hallway. Wait a minute, he thought. Why did I just think that Li would be in the library? For that matter, why would I assume that he would get to school early in the first place. Marcus started to feel guilty, realizing that he’d assumed that since Li was Asian, he’d automatically be a model student who was always studying (well, at least when he wasn't playing basketball). It was a dumb assumption to make, he realized, and he began to turn around, ready to get out of there and back where he belonged. As he did so, though, he smacked right into Li, who had just walked up behind him.<br>\r\n<br>\r\n“Oof,” Li grunted as he was knocked backward. He may have been an inch or two taller than Marcus, but the older boy still outweighed him by a good thirty or forty pounds of muscle, and being caught off-guard, he nearly fell to the ground, able to catch his footing at just the last moment.<br>\r\n<br>\r\nMarcus’s eyes went wide in panic and embarrassment. “Oh, geez, Li, I'm sorry!” He reached out, placing his hand on Li’s shoulder. “Are you okay, man?” he asked, hoping that his concern sounded genuine.<br>\r\n<br>\r\nThe corners of Li’s mouth turned upwards in a half-smile. “Yeah,” he said, nodding. He gently rubbed his arm at the spot where Marcus had run into him, doing his best to act like nothing had happened.<br>\r\n<br>\r\n“Good,” Marcus said, sighing in relief. “But I'm glad I, uh, ran into you, so to speak. Heheh.” He smacked himself in the head. What's the matter with me, he thought. Usually he didn't have a problem being cool and suave, but something about this new seven foot tall Asian kid seemed to throw him off balance. He wasn't sure if it was intimidation, or curiosity, or... infatuation? No, that can't be it, he tried to assure himself. <br>\r\n<br>\r\n“Oh?” Li responded neutrally, looking at Marcus straight in the eye. <br>\r\n<br>\r\n“Uh, yeah,” Marcus mumbled. “I mean, after I got home from tryouts yesterday, I was thinking. If you’ve only been playing basketball for a few months, then there are probably some things I can show you that might help you improve your game. You know, if you’re interested.”<br>\r\n<br>\r\nLi gave him a hesitating look, and Marcus immediately began to regret asking him. “Well...” the freshman said, thinking it over.<br>\r\n<br>\r\n“Never mind,” Marcus said, starting to turn around. “I guess it's a dumb idea, right? I mean, we’re probably going to be competing for the same starting spot. You probably think I want to sabotage you or something.\"<br>\r\n<br>\r\nFeeling his cheeks begin to blush, Marcus was caught off-guard when he heard Li start to laugh. Whirling back around, he saw a huge grin spread across Li's face, one bigger than he would have ever expected from the normally stoic boy. <br>\r\n<br>\r\n\"No, no, Marcus!\" Li said, shaking his head and still smiling. \"I think it's a great idea! I just didn't want to come off too eager, I guess.\" He took his hand and ran it through his hair, still grinning, and for a moment Marcus thought he saw those olive cheeks turn slightly red. <br>\r\n<br>\r\n\"O-okay then,\" Marcus stammered. \"When should we start? What would be good for you?\"<br>\r\n<br>\r\nLi shrugged. \"If today after school works for you, that'll be fine with me.\" <br>\r\n<br>\r\n\"Really? That soon?\" Marcus was taken slightly aback, but Li simply nodded. \"All right. Today it is.\" He finally grinned back, and began to feel a lot better about bringing this up. \"I guess I won't see you until then, right? I mean, not that I'd mind seeing you before then, but we're not in any classes together, and our lunch is scheduled at different times, and my locker is all the way--\" Marcus stopped himself mid-sentence, realizing he was starting to babble. <br>\r\n<br>\r\n\"Right. See you then, Marcus.\" Li smiled and then headed down the hallway. <br>\r\n<br>\r\n\"See ya, Li.\"</span></div></div>",
            "created":1333774800,
            "id":1311241,
            "title":"Jitters"
        },
        "1321":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "Li surprises Marcus and asks him over.",
                "Marcus chickens out, and doesn't see Li until the next day.",
                "They both head into the locker room for a shower..."
            ],
            "content":"<div class=\"\"><div> <span>Marcus couldn't concentrate in any of his classes. Well, he normally couldn't anyways, but today was worse than usual. Several times teachers would call on him, snapping him out of his daydream and back into an embarrassed reality. But what had he been daydreaming about? Could it have been-- No, there's no way. I mean, the guy was not only a, well-- a GUY, but he's also three years younger than him and … had such beautiful brown eyes…<br>\r\n<br>\r\nThe after-school meeting with Li suddenly seemed to be a very conflicting idea. But Marcus was a man of his word, and he said he'd be there to help Li, dammit he was going to be there to help him. As soon as the bell rang, he headed down to the gym, where sure enough Li was waiting, already having changed into a white t-shirt and red basketball shorts. \"Hey,\" the Chinese boy said, giving Marcus a little wave.<br>\r\n<br>\r\n\"Hey, yourself!\" Marcus waved back. \"Give me a minute to change and I'll be right back.\" <br>\r\n<br>\r\nLi smiled and nodded, and headed to the locker room. As he changed into his own black shirt and shorts, he noticed that he had grown slightly aroused. At what, he thought, before realizing that his heart was beating a little faster. He slowly came to the realization that had been dogging him all day: he had a crush on Li. He didn't know quite why. Maybe it was because the fourteen-year-old was the only person he had ever seen taller than him, maybe it was because of his humble but cheerful attitude, or maybe Marcus just had a thing for Asian guys that he was only now discovering. But facts were facts, and Marcus couldn't deny his definite infatuation. And basketball shorts weren't the best way to hide that.<br>\r\n<br>\r\nThe next hour was spent in a pretty heated, intense game of one-on-one. Marcus couldn't help but be impressed by Li's persistence and his ability to learn. Every time Marcus would make a post-up move that would allow him to blow by Li or knock the seven-footer off his feet, Li would get up with an even fiercer determination. Towards the end, Li had been able to pick up a few moves of his own, and even added on his own spin. Marcus still won, 18-15, but Li was getting better and better all the time, and Marcus knew that, before the end of the year, the freshman would be the better player.<br>\r\n<br>\r\n\"Good game,\" Marcus said at the end, shaking Li's hand. And he meant it.<br>\r\n<br>\r\n\"Yeah,\" Li nodded, slightly out of breath. \"You're really good. I think I learned a lot.\"<br>\r\n<br>\r\nMarcus smiled, then hesitated. He had a desire to ask Li if he might want to hang out some more after this, but he felt conflicted about it. Would it be wise? Or should he just wait on it, see what would happen later? </span></div></div>",
            "created":1374037200,
            "id":1629854,
            "title":"The Boy's Got Game!"
        },
        "13211":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "\"I have to go!\" Marcus quickly leaves to examine the pills more closely",
                "\"What's the big idea?\" Marcus confronts Li about the pills"
            ],
            "content":"<div class=\"\"><div> <span>While Marcus wrestled with the thoughts in his head, Li had yet to let go of Marcus' hand and was still shaking it somewhat listlessly. Marcus normally would have called the taller boy out on this, playfully, but he was far too distracted to notice. As it was, the next sentence out of Li's mouth came as a complete surprise to Marcus.<br>\r\n<br>\r\n\"Hey...you wouldn't want to come over today, would you? I mean...I know how it goes, you being a senior and me being a dumb freshman and all but...I had a lot of fun today and..I don't really no anyone else in the school so...\"<br>\r\n<br>\r\nMarcus hastily let go of Li's hand, his palm feeling slightly sweaty, not sure how to respond. It was almost like Li had seen into his mind, noticed what he was struggling with, and had decided to make it easy for him. Li was starting to look unsure now, wiping his hand carelessly on his jersey. eyes focused on Marcus. The older boy finally found his voice and said, \"Sure! Uh...today? Like right now you mean?\"<br>\r\n<br>\r\nLi nodded and said, \"My parents are both at work until late so we'd have the place to ourselves. It's a pretty nice place and I have a basketball hoop in my driveway so we could practice more if we wanted if watching TV isn't your thing.\"<br>\r\n<br>\r\nMarcus noted how nervous the teen seemed. It was hard to remember, sometimes, with Li being so tall, that he was only a young freshman and on top of that, newly moved not only to the town but the whole country! Marcus smiled reassuringly and said, \"Alright! I like watching TV just fine.\"<br>\r\n<br>\r\nLi's face broke out in a smile as Marcus agreed. \"Awesome! Let's change first and we can go!\"<br>\r\n<br>\r\nMarcus followed Li into the changing room, having to walk a bit faster to keep up with the Asian teens longer, smooth legs...Marcus shook his head slightly, keeping his eyes up as they walked to the bank of lockers. Li immediately began to strip, much to Marcus' chagrin (and delight), Li's smooth, brown colored chest soon fully on display. He had a nice athletic build, his torso appearing a bit longer than average, no doubt due to his impressive height. There was not a trace of hair, except for a few wisps traveling down from his navel past his waistband, no doubt joining a modest collection of similar hairs. Marcus gulped slightly as Li hooked his thumbs into the elastic waistband of his shorts, pulling them down, letting them pool around his large bare feet, his shoes and socks already set aside. \"Feels like I'm going to need new shoes soon...\" He muttered, glancing over at Marcus. Noticing the staring, he raised an eyebrow slightly and said, \"Uh...you can change too you know. That's why we're in the locker room.\"<br>\r\n<br>\r\nMarcus jumped, blushing slightly. \"I know! I was just...\" He stopped as he realized there really was no way to end that sentence without the honest truth. So he merely let the sentence drift off into nothingness, yanking his own jersey off shortly after. He tossed it aside when he notice Li smiling at him, a fresh pair of briefs already pulled up around his slender hips. His almond shaped eyes traveled over Marcus' exposed torso, along his pecs and abs.<br>\r\n<br>\r\n\"Do you lift or something?\" Li asked, his eyes slowly locking with Marcus'. \"You look bigger than your average basketball player.\"<br>\r\n<br>\r\nMarcus nodded a little and said, \"Yeah, a few days a week. Nothing wrong with working up a little extra strength and endurance.\"<br>\r\n<br>\r\n\"Yeah, that makes sense...I'm always afraid building muscle would start making me slower though.\" Li said, pulling on a pair of jeans.<br>\r\n<br>\r\n\"Speed would only end up being an issue if you ended up looking like a linebacker.\" Marcus said, chuckling as he stripped down completely, making sure Li was bent over picking up a shirt before changing out of his jockstrap and into a breezy pair of boxers.<br>\r\n<br>\r\n\"No worries about that happening.\" Li said with a grin. \"No matter how much I eat I never gain any weight. I'm surprised I even have this little bit of muscle.\" He gently pounded on his exposed chest, a low thumping sound accompanying the movement.<br>\r\n<br>\r\n\"Consider yourself lucky man...If I go off my diet even a little I blow up like a balloon.\" Marcus said ruefully, buttoning his shirt.<br>\r\n<br>\r\nLi just laughed, bending over slightly and holding his stomach. \"S-Sorry...but that's way too funny of an image!\"<br>\r\n<br>\r\nMarcus looked annoyed for a second before snickering a little, full on laughs bursting out shortly after. It was just too infectious! It was nice to be able to talk to Li like they were good friends rather than the tense little bursts they'd been having before. Li was so easy to talk to, it was like they had known each other for years. It was nice to know he was warm and friendly on top of everything else Marcus already liked about him...<br>\r\n<br>\r\nAfter getting dressed they slung their backpacks on and headed to Li's house, the taller teen leading the way slightly. Marcus was surprised when he noticed they seemed to be heading to the area of town known as \"The Hills\". It wasn't really called that officially; it was merely the nickname the students had given the entire area, a kind of gated off area where all the richest people lived. A less charitable version of the nickname was \"Snob Hill\" but that one was more the favorite of the older residents of the town. Marcus' surprise was only deepened when Li led him right through the gate fifteen minutes later, after trudging up the slight incline of the hill. His jaw plain dropped open when he saw what could only be described as a mansion. It was two stories tall and almost ridiculously wide seeming, the front door situated between two massive pillars that connected with a balcony on the second floor, no doubt leading into a bedroom. The driveway in front of it was long and slightly twisty, not to mention wide enough that two vans could drive down it comfortably side by side; and judging by the two door garage, they might very well have two vans.<br>\r\n<br>\r\nLi rubbed the back of his head as he noticed Marcus' shock. \"Yeah...we're...kind of rich....\" His face turned a little red, as though the very idea of wealth embarrassed him. \"My parents are both doctors and we ended up moving here for better opportunities...They're not exactly thrilled I want to play basketball rather than pursue a more \"stable\" profession.\"<br>\r\n<br>\r\n\"Wait...\" Marcus said, quickly collecting himself. \"Both your parents are...doctors? Isn't that pretty stereotypical?\"<br>\r\n<br>\r\nLi stared at Marcus for a second before snorting, sounding kind of relieved. \"I guess I never thought about that...it's only a stereotype here! Where I'm from, it's called \"being smart\".\"<br>\r\n<br>\r\nThey both laughed at that, walking up the driveway together. Li pulled out a small house key from his pocket, unlocking the door. \"I'm a latchkey kid.\" He explained, slipping the key back into his pocket. \"Always have been pretty much.\"<br>\r\n<br>\r\n\"Do you have any brothers or sisters?\" Marcus asked, taking his shoes off and setting them aside.<br>\r\n<br>\r\n\"Nope! It's just me and my parents. You know....China.\" Li said, raising both eyebrows in a knowing look.<br>\r\n<br>\r\n\"Oh. Oh! ....Oh.\" Marcus said, slowly understanding what Li was getting at. \"Did you ever want a brother or a sister?\"<br>\r\n<br>\r\nLi shrugged and said, \"I don't know. I just got used to being the only kid. It's nice to have my own room though.\"<br>\r\n<br>\r\nMarcus looked around the house as they headed up to Li's room, the stairs covered in a thick carpet that made Marcus want to take his socks off and just drive his toes deep into it. The house was just as impressive inside as out, decked out in a style that combined both Western and Eastern tastes. Li's room, on the other hand, was more modern. A TV was against one wall, a video game system hooked up to it, an expensive looking laptop was on the desk in the far corner, and his king sized bed was against the wall, under the window. The room was at least twice the size of Marcus', posters covering the walls featuring various basketball players and a few that depicted Chinese actors, surrounded in writing that was completely foreign to Marcus.<br>\r\n<br>\r\n\"Do you speak Chinese?\" He asked, looking closer at one poster.<br>\r\n<br>\r\n\"是的，有点.\" Li said, Marcus looking over at him in surprise. Li chuckled and said, \"Yes, a little. I'm not sure if I was even saying it right though...\"<br>\r\n<br>\r\n\"Sounded pretty impressive to me!\" Marcus said, walking over to Li's desk. A medicine bottle immediately caught his eye, more Chinese writing printed on it. It looked like it was filled with pills of some kind. \"Hey...do you have a medical condition or something? If you don't want to tell me you don't have to.\"<br>\r\n<br>\r\nLi stiffened slightly as he looked at the bottle. \"No...I don't. That's just...you know, a...herbal supplement. To keep me healthy.\"<br>\r\n<br>\r\nHe seemed incredibly uncomfortable as he headed for the door to his room. \"Anyway...do you want a soda or a Gatorade or anything like that?\"<br>\r\n<br>\r\n\"Sure, sure.\" Marcus said, watching Li leave and head down the stairs. It couldn't be...could it? He picked up the bottle and popped it open. The pills appeared to be ordinary capsules filled with a brown powder. Was this Li's secret? The reason why he was so incredibly tall despite his age? Marcus didn't want to believe it...Li didn't seem like the kind of guy who cheated...but then why had he been acting so suspiciously? Marcus shook a few of the pills out onto his hand, examining them more closely. Before he got too far, he heard Li heading up the stairs again! He quickly shoved the pills into his pocket and moved away from the desk.<br>\r\n<br>\r\n\"We're all out of soda so all we have is Gatorade. That okay?\" Li asked, holding up two bottles.<br>\r\n<br>\r\n\"Uh...yeah! Listen Li...\" Marcus said, moving in closer...</span></div></div>",
            "created":1396328400,
            "id":1771929,
            "title":"Following to the Source?"
        },
        "1322":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Challenges him to a fight",
                "Challenges him to a lifting contest",
                "Challenges him to an eating contest"
            ],
            "content":"<div class=\"\"><div> <span>As Marcus waited for Li, he chowed down on a sub. Marcus had always had a good appetite. Must have been less so with his competition. Impatiently, Marcus sat in silence for his competition for awhile when he decided to step outside for a bit to see if Li was there instead but wasn't. As Marcus sat outside, he finally saw Li through the tall shrubs he was sitting behind. Li got close, but then ducked behind a broad tree near him. Marcus could see Li drink some sort of liquid &amp; he seemed to grow taller. Could it be that Li's height came from enhancements and not naturally? Marcus felt angry when he thought about all the work he went through &amp; now might be replaced by someone who might be cheating. Marcus decided to challenge Li.</span></div></div>",
            "created":1333947600,
            "id":1311968,
            "title":"After school, Marcus is waiting and Li hasn'..."
        },
        "133":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Cheer leader likes Marcus' muscles",
                "Cheer leader likes Li's height",
                "Cheer leader likes both height & muscles"
            ],
            "content":"<div class=\"\"><div> <span>He liked Li but Marcus's competitive spirit, lead him to challenge himself @ the weight room daily over the next three weeks. Marcus may not be able to control height, but could thickness. During the next game three weeks latter, Marcus' thickness was an advantage as he easily plowed over Li a number of times, despite Li now being 7'1 to Marcus' 6'11. The two were @ odd<br>\r\n<br>\r\nDuring the game, the tall, blond, head cheer leader had noticed the two alpha males. She could not quite make up her mind as to what attracted her, Marcus' muscles or Li's height?</span></div></div>",
            "created":1333774800,
            "id":1311080,
            "title":"To counteract Li's height advantage, Marcus..."
        },
        "1331":{
            "author_id":"gunslinger1999",
            "author_name":"GrowingNikki",
            "choices":[
                "Li very quickly grows larger than Marcus. Kaitlin leaves for the bigger man.",
                "Marcus quits the basketball team and devotes all his free time to the gym.",
                "Li grows quickly so Kaitlin gives Marcus a special boost."
            ],
            "content":"<div class=\"\"><div> <span>Kaitlin Summers had the best job in the world, she got to dance for huge crowds of men that drooled over her tight, sexy body while she got to drool over the hottest guys in the school. Since the basketball season had started Kat watched her two favorites, Marcus and Li, hustle up and down the court working their superb bodies into a sweat. She had spent weeks trying to decide which one she liked more; Marcus was the older and more mature one but Li somehow had Marcus beat when it came to height.<br>\r\n<br>\r\nTonight, though, Kaitlin had made up her mind between the two. The moment Marcus had exited the locker room and removed his jacket Kaitlin got a good look at his arms and chest and it was quite obvious that Marcus had been beefing his body up. As much as Kaitlin loved her men tall to rival her own 6 foot 1 inch body she loved them with big muscles even more. She watched him for the entire game her lust growing by the minute as Marcus dominated the other players and by halftime she had determined that he would belong to her and her alone.<br>\r\n<br>\r\n- - -<br>\r\n<br>\r\nAfter the game Marcus and Li were leaving together with plans to celebrate their victory at Valentino's, the local pizza joint, when Kaitlin approached them still clad in her cheerleader outfit.<br>\r\n<br>\r\n\"Hi Kat, what's going on?\" Marcus greeted the blonde bombshell.<br>\r\n<br>\r\nKaitlin's face lit up in a dazzling smile that melted Marcus's knees. \"Hi Mark,\" she said, her voice dripping with sex. \"And hello, Li,\" she added without breaking eye contact with Marcus.<br>\r\n<br>\r\n\"Hello Kaitlin,\" Li responded turning a little red. He'd never told anyone but he had a pretty big crush on the head cheerleader though he rarely had the courage to even so much as speak to her. \"Uh.. How are you?\"<br>\r\n<br>\r\nShe continued ignoring Li's question completely. \"Great game tonight, boys. Especially you, Mark. You really owned the court tonight.\"<br>\r\n<br>\r\nNow it was Marcus's turn to blush. \"Thanks.\"<br>\r\n<br>\r\nNow Kaitlin cut to the chase. \"You've been working out, haven't you? You're looking really strong out there and uh,\" she stepped forward and put her hand on his chest, \"pretty big right here.\"<br>\r\n<br>\r\nMarcus's confidence was soaring and he was finding himself in sync with what Kaitlin's goals were: he was about to land a girlfriend. He tensed his pecs and grinned. \"I didn't know you were into guys with muscles.\"<br>\r\n<br>\r\nKaitlin purred with approval while she slid her hand down to Marcus's abs. Her other hand joined the first and she ran her fingers over the bumps on his stomach through his shirt. \"Oh yes, the bigger the better.\"<br>\r\n<br>\r\nMarcus nodded. \"So how does this rate?\" He raised one arm and flexed a 16 inch bicep.<br>\r\n<br>\r\nHer purr grew to an outright moan. \"I call that a fantastic start. You've got a really big frame with a lot of room for muscle and if you want to you could get really, really big.\" She pressed her body against his and rubbed her hip against his crotch. \"And I'm sure you want to, right?\"<br>\r\n<br>\r\nMarcus wrapped his arms around Kaitlin's shoulders then looked over his shoulder to Li who was trying not to stare. \"Hey, man. You go on to Valentino's and I'll catch up with you later.\"<br>\r\n<br>\r\nLi hung his head. \"Uh.. sure.\" He didn't even try to hid the sadness in his voice but neither Kaitlin nor Marcus noticed.<br>\r\n<br>\r\n- - -<br>\r\n<br>\r\nMarcus quickly learned that Kaitlin's lust for muscle was more of an obsession than a mere turn on. She explained to him that her father, brother, and several cousins were very active in the bodybuilding and muscle development community and she was willing to pass on the full wealth of their knowledge to Marcus. She did everything for him: purchased his supplements, organized his diet, set his workouts, and measured his progress. At first he wasn't to excited about getting huge, really he only started working out to gain an advantage over Li, but the zeal with which his tall, beautiful, busty hardbody girlfriend approached his workouts was infectious. At first he only worked out for her approval but after a few months his body swelled greatly and he became addicted to the size, strength and power he now commanded and wanted more.<br>\r\n<br>\r\nBy the time the season was half over Marcus looked a lot more like a football player than a basketball player and his game was beginning to suffer for it. Despite his size he was still agile and quick and there was no question that he was the strongest player on the court no matter who they were playing. The trouble was he could no longer navigate his huge frame between or around other players and he was missing more and more shots because of his inability to compensate for his ever increasing power. He didn't care, though, since his buff body drove Kaitlin wild and the two would spend every available minute alone having wild and passionate sex.<br>\r\n<br>\r\nOne morning Marcus awoke with Kaitlin's body wrapped tightly around his own. He spent a few minutes enjoying the soft warmth of her breasts against his arm and her strong and smooth legs intertwined with his own. They had set a new record with their lovemaking the previous night when they'd gone just shy of four hours without stopping. Marcus was impressed with his own ability to keep going without getting tired and loved that Kaitlin could keep right up with him every step of the way.<br>\r\n<br>\r\nHe untangled himself from her embrace and still naked made his way to the bathroom. After clearing his bladder Marcus examined his body in the mirror over the sink. He was enormous and could probably hold his own on a stage with full sized bodybuilders. He flexed his arms and smiled; as of yesterday he had measured his biceps at 20 inches around. He'd added 4 inches in mere months and with Kaitlin's help he was still growing. He still felt a little down that he was no longer the tallest guy at school but he loved being the strongest.<br>\r\n<br>\r\nIn his self obsession Marcus hadn't noticed that his rival Li had grown from 7 foot 1 inch to 7 foot 3 inches, and not only that the Chinese boy was beginning to bulk up a little as well.... a fact that was not unnoticed by Kaitlin.</span></div></div>",
            "created":1403672400,
            "id":1817560,
            "title":"She loves the big guys."
        },
        "134":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "\"...because I need to start training your replacement now, not next year.\"",
                "\"...because I want you to help him.\""
            ],
            "content":"<div class=\"\"><div> <span>The next day at practice, Marcus once again found himself going up against Li during drills and plays.  And once again, he found himself being knocked down a peg by the younger boy's height advantage.  That extra inch of height translated into a longer reach for Li, meaning Marcus had to work harder than ever before to get around his opponent to the basket.<br>\r\n<br>\r\nBut while Li's height made him a bigger obstacle, Marcus had more than enough tricks to overtake him on the court.  After all, he'd been playing for years, and the extensive training both he and his coaches had put him through had made him one of the most agile, maneuverable, and quick thinking players anyone had ever seen, especially in regards to his height.  Marcus had all the size and strength of a near-seven-footer coupled with the speed and agility of a player half his size.<br>\r\n<br>\r\nAnd it wasn't hard to put all that extra skill into use against the younger boy.  By the time Coach Packard ended their practice, Marcus had managed to score nearly thirty baskets on Li, versus only three Li had managed to get past him.  Sweaty and out of breath, Li almost looked frustrated as he stood bent over waiting for coach's after-practice pep talk.  And while part of him felt bad for it, Marcus felt a vindictive joy at seeing that young upstart put in his place.<br>\r\n<br>\r\n\"Alright, boys, it's time to assign you to your teams.  We've got enough of you this year to have full rosters on both JV and Varsity, so I don't want to hear any complaining about being in one and not the other, ya here?\"<br>\r\n<br>\r\nNo one responded.  Whether from heeding the coach's word or just being too tired to complain, no one could tell.<br>\r\n<br>\r\n\"Alright then.  Now, on JV we've got--\"<br>\r\n<br>\r\nMarcus tuned the coach out.  He knew where he was going to be, so he didn't need to know who all was on JV.  Instead, he started musing on who his teammates would be, considering how he'd seen each of them play.  But coach's voice cut off his continued musings just in time to call out the last name.<br>\r\n<br>\r\n\"--and la Mays.  You guys are free to head back to the showers so I can talk with the Varsity team.\"<br>\r\n<br>\r\nMarcus watched them get up and head for the locker room.  But what he didn't see was Li going with them.  Why?  Surely he should be on the junior team.  It made sense, after all.<br>\r\n<br>\r\n\"Now then, the rest of you are our Varsity team.  And while we all know that Marcus is going to be the one leading us to another state title this year, that doesn't mean any of you can slack off.  I need every single one of you to put in a hundred percent every time you're out on that court.  That especially includes you, Li.\"<br>\r\n<br>\r\nMarcus started.  Li was on Varsity?  What was going on?!<br>\r\n<br>\r\n\"You've got the height, and you've got some talent.  But you need to develop your skills.  You've got to be ready to step in when we need you to cover for Marcus.  I highly doubt he's ever going to give us any trouble, but we need you ready to step up just in case.  Got it?  Good.<br>\r\n<br>\r\n\"Alright, go hit the showers.  I'll be in my office for the next half hour if you have any questions.\"<br>\r\n<br>\r\nAnd with that, Coach headed off the court.  The rest of the boys, Li included, started trudging their way to the showers.  But Marcus lingered long enough for them all to leave before heading after Coach to get some answers.<br>\r\n<br>\r\nArriving at the coach's office, Marcus knocked once and then let himself in.<br>\r\n<br>\r\n\"Ah, Marcus,\" Coach said, looking up from some paperwork he was filling out.  \"What can I do for you?\"<br>\r\n<br>\r\nMarcus hesitated.  \"Um, well...\"<br>\r\n<br>\r\nCoach's eyes narrowed slightly.  \"Marcus, everything alright?  It's not really like you to be wary like this.\"<br>\r\n<br>\r\nMarcus shook himself and started again.  \"Look, Coach, I was just wondering about Li.  I mean, I know he's got the reach, and he's got some basic talent.  But he's only been playing for six months, and it really shows.  Why would you want a freshman with so little experience in this sport as the backup center for the Varsity team?\"<br>\r\n<br>\r\nCoach eyed Marcus carefully for a moment.  Finally, he chuckled and addressed him.<br>\r\n<br>\r\n\"Marcus, you're an incredible athlete, and an excellent leader for the other boys, but you've got a lot to learn when it comes to coaching.  Li is on the Varsity team...\"</span></div></div>",
            "created":1585371600,
            "id":2808784,
            "title":"Teaming Up"
        },
        "1342":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "\"No, I better just take it to him myself.\"",
                "\"Alright, you can take it to him.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Li is on the Varsity team because I want you to help him,\" Coach explained.<br>\r\n<br>\r\nMarcus was taken aback.  \"What?\"<br>\r\n<br>\r\nCoach Packard smiled and shook his head.  \"Look, Marcus, you and I both can see that this kid's got some considerable talent.  He could be just as skilled as you are someday.  But in order for him to reach his full potential, he needs someone to show him the ropes.  Someone who can show him just what a seven-foot player can do, not just because of his height, but in spite of his height.<br>\r\n<br>\r\n\"I've been following your progress since you first started back in seventh grade with Coach Estavez.  Even back then you were big, but you didn't move like you were big.  You've managed to push yourself to a peak of athletic ability most guys your size can only dream of.  And I know it wasn't easy.  There are so many things you had to figure out on your own, 'cause no one else could tell you how to do it.  It's not like there was some extra tall senior around to take you under his wing.<br>\r\n<br>\r\n\"That's why I'm pairing him with you.  You and he are the only two guys anywhere around here who might have any idea what struggles the other might be going through.  He's going to need your guidance and encouragement if he's ever going to reach his full potential.<br>\r\n<br>\r\n\"And while you've got a lot of skills both on and off the court, you've still got a bit to learn when it comes to true leadership and humility.\"<br>\r\n<br>\r\nMarcus felt a glare flaring up, but he knew Coach was right.<br>\r\n<br>\r\n\"You two are going to need to learn to lean on each other.  You might just see him as your competition, but you should be seeing him as a friend.  After all, I bet it would have been nice when you were younger to have someone around who understood how you felt being as tall as you are.\"<br>\r\n<br>\r\nMarcus stewed for a moment in silence.  Finally, he let out a long deep sigh.  \"Yeah, I get what your saying.\"<br>\r\n<br>\r\nCoach smiled.  \"Glad that's settled.  Now, go get yourself cleaned up, you smell like hard work, and unfortunately hard work stinks like a--\"<br>\r\n<br>\r\nBut the coach cut himself off as he moved the papers he'd been working on off of his desk.  For a moment he just started at the new pile sitting underneath the first.  Then he let out a groan followed by a rather choice expletive.<br>\r\n<br>\r\n\"What's wrong?\" Marcus asked.<br>\r\n<br>\r\n\"I forgot, because Li's just a freshman he has to have special permission from a parent or guardian to play on the Varsity team.\"<br>\r\n<br>\r\n\"Wait, really?\"<br>\r\n<br>\r\n\"Yeah, it's a dumb rule the school board put in years ago.  It hasn't ever really been an issue, but if I don't get this form signed and turned in to the central office by tomorrow morning he'll have to play JV.\"<br>\r\n<br>\r\nCoach grabbed up the form and ran to the locker room, Marcus following closely behind.  But when they got there, only Jackson Trotsky was left, zipping up his gym bag.<br>\r\n<br>\r\n\"What the-- what's going on?\"<br>\r\n<br>\r\n\"Jackson, did Li already leave?\"<br>\r\n<br>\r\n\"Uh, yeah, he was the first one out.  He even managed to leave before the JV kids were done.  I don't know how he does it, but he's pretty efficient at getting himself cleaned up.\"<br>\r\n<br>\r\nCoach repeated his colorful word again, causing Jackson to blush slightly in surprise.<br>\r\n<br>\r\n\"Well, I guess I'll have to go talk to his parents myself,\" he finally sighed.<br>\r\n<br>\r\nBut Marcus had been thinking, and an idea had occurred to him.<br>\r\n<br>\r\n\"Hey, since you're wanting me to get to know him better and help him train, maybe I can take it to his parents for you.\"<br>\r\n<br>\r\nCoach turned to him, a wary look on his face.  \"I don't know.  It's generally against school policy to hand out student information to others, even other students.\"<br>\r\n<br>\r\n\"Come on, Coach.  You know I wouldn't abuse that kind of information.  You can trust me.\"<br>\r\n<br>\r\nCoach pondered it for a bit.  Finally, he responded.</span></div></div>",
            "created":1585371600,
            "id":2808802,
            "title":"A Helping Hand"
        },
        "13422":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "\"...about a year ago.\"",
                "\"...about two years ago.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, you can take it to him.  But not a word of this to anyone.  That means you too, Jackson.\"<br>\r\n<br>\r\nJackson just shrugged.  \"It's no big deal to me.\"<br>\r\n<br>\r\nCoach turned back to Marcus.  \"Get cleaned up and then come see me for the address.\"<br>\r\n<br>\r\n\"You got it, Coach,\" he replied, a grin on his face.<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nThirty minutes later found Marcus walking through a small and relatively posh neighborhood.  Considering how close he lived to school, he'd never needed to take his car to school.  But Li's family apparently lived further away from school in the opposite direction from home, which meant a bit of a walk.<br>\r\n<br>\r\nOf course, Marcus didn't have much of a problem with that.  The houses here were all small but nice looking, and all were neatly clean and efficient in their presentation.  Marcus didn't want to go making any untoward assumptions, but it seemed Li's parents were decently well off.<br>\r\n<br>\r\nAs he turned a corner, he noticed on the opposite side of the intersection an odd little shop, not unlike a Mom and Pop store near downtown.  But the sign outside was in Chinese lettering, and the only thing he could make out from it was the picture of the mortal and pestle in forest green.  He considered it for a few moments, but then moved on.  He needed to get to Li's place soon if he wanted to be home before dark.<br>\r\n<br>\r\nLuckily for him, Li's place was just another block down from the odd shop.  Marcus, seeing the house number that matched the address, nodded to himself and went right up to the front door, ringing the bell and stepping back to wait.  And after a few moments, the sound of a lock turning announced the appearance of a small Asian woman opening the door to him.<br>\r\n<br>\r\nShe was quite small, surprisingly small even.  Marcus of course knew about the standard stereotype of Asian people being relatively short, but he'd expected someone like Li, a literal giant kid, to have parents that might have been at least a little above average.  But this woman couldn't have been much more than five feet.  Her head barely came up to his chest.<br>\r\n<br>\r\n\"Can I help you?\" she asked warily through her accent.<br>\r\n<br>\r\n\"Um, hi, Miss.  I'm Marcus, I'm a friend of Li's from school.\"<br>\r\n<br>\r\nShe lit up.  \"Oh, yes, hello!  Come in, come in!\"<br>\r\n<br>\r\nShe quickly stepped aside to allow him, and after a bemused moment he entered, instinctively ducking through the doorway like he'd had to for the past several years.<br>\r\n<br>\r\n\"Li is not here right now,\" she explained, closing the door and moving past Marcus into the front room.  \"But he will be back soon.<br>\r\n<br>\r\n\"It is so good to meet one of Li's friends.  His father and I were not quite sure he had been making any, since he is so shy.  But here you are.  And you're tall, too, just like our Li.\"<br>\r\n<br>\r\n\"Yeah,\" Marcus managed to get out, a little overwhelmed at Mrs. Li's exuberance.  But he managed a smile as she went on.<br>\r\n<br>\r\n\"It has been so hard for him, with his height and being in this new country.  But now he has you, and that will make things so much better for him.  Especially with his height.  He is so self-conscious about that.  And maybe having another big friend will ease his mind about it....\"<br>\r\n<br>\r\nMarcus nodded along, but was finding it hard to concentrate.  He felt bad about being here behind Li's back, even if it was for a legitimate reason.  His wandering thoughts led to wandering eyes, and he found himself looking around at the room's decor.  In particular, the pictures on the table they were standing beside.  One near the front especially drew his attention.<br>\r\n<br>\r\nIn it, he saw the same small woman standing before him.  On the other side was a middle aged Asian man who looked like he wasn't much taller than her, maybe five-four at most.  And in between was a younger Li, who was only slightly taller than his mother.<br>\r\n<br>\r\nMarcus' mind began to work.  Li, who today was at least an inch taller than himself, was at some point just barely taller than his mother, this tiny five foot woman who could barely reach his chest.  How was such a growth spurt even possible?  What was going on here?<br>\r\n<br>\r\n\"...and I hope you can stay to meet Li's father.  He is working late tonight, but should be back soon.\"<br>\r\n<br>\r\nMarcus' attention came back around to Mrs. Li.  \"Oh, is this him?\" he asked, directing her attention to the picture.  It wasn't perhaps the most subtle tactic, but it might shed some more clues.<br>\r\n<br>\r\n\"Oh yes, that is him,\" Mrs. Li replied, picking up the frame to better look at it.  \"That is the three of us about...\"</span></div></div>",
            "created":1585458000,
            "id":2809912,
            "title":"Meeting Mrs. Li"
        },
        "134221":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "He waits until morning and asks Li about it.",
                "He heads to Mr. Fushigo's to find out more about those tea bags."
            ],
            "content":"<div class=\"\"><div> <span>\"That is the three of us about a year ago.  Such a handsome boy, is he not?\"<br>\r\n<br>\r\nMarcus vaguely managed to nod as his mind reeled with this new information.<br>\r\n<br>\r\nOne year.<br>\r\n<br>\r\nOne year!<br>\r\n<br>\r\nLi had somehow grown nearly two feet taller in ONE YEAR!  How was that even possible?!  In order for that to happen, he'd have had to grow another inch every two weeks.  Was the human body even able to grow that quickly?!<br>\r\n<br>\r\nMarcus had known that something seemed off about Li ever since he'd said he'd only been playing for six months.  Now his mother was telling him he'd been almost as short as her only a year ago.  What was going on with this kid?<br>\r\n<br>\r\nSomething was definitely fishy about all this, and Marcus was determined to find out.  But any plans to try and coax more information out of Mrs. Li were dashed when the front door opened and Li squeezed himself inside.<br>\r\n<br>\r\n\"Li!\" his mom called, setting down the picture and going to hug him.  Li remained near the door as she wrapped her arms around his middle, staring in shock at Marcus.  Marcus just stared back, unsure how to respond himself.<br>\r\n<br>\r\nMrs. Li however felt none of the tension between them as she broke her hug.  \"How was your day?\"<br>\r\n<br>\r\nLi hesitated before finally responding.  \"Fine,\" he finally muttered.<br>\r\n<br>\r\n\"Good, good.  Did you stop by Mr. Fushigo's on your way home?  Oh, yes, you did!\"<br>\r\n<br>\r\nShe reached forward and grabbed the brown paper bag Li had been holding.  On the side was the same Chinese lettering and picture of a mortal and pestle Marcus had seen in front of the odd shop on his way here.  She reached inside and pulled out a few small paper envelopes that looked not unlike tea bags.  Each had more lettering on their side, along with what appeared to be a picture of a man standing next to a short tree.<br>\r\n<br>\r\nBut Marcus didn't a chance to see any more, as Li suddenly grabbed the tea bags from his mother and started berating her in Mandarin.  She argued back, but eventually she sighed and handed the brown bag over as well.  And with that, Li silently scurried out of the room and down the hall.<br>\r\n<br>\r\n\"My apologies.  Li can be...sensitive when it comes to his personal business.\"<br>\r\n<br>\r\n\"That's fine,\" Marcus replied, even if that was the opposite of how he felt about all this.  \"If he doesn't want to tell me, then he doesn't have to.<br>\r\n<br>\r\n\"I am a little curious, though.  The picture on the bag looked a lot like this sign I saw on my way over.  You wouldn't happen to know anything about that, would you?\"<br>\r\n<br>\r\n\"Oh, that is just Mr. Fushigo's apothecary.  He supplies medicine and herbal supplements to the community, brought over directly from back home.\"<br>\r\n<br>\r\n\"Hmm, interesting.\"  And this time Marcus meant it.  \"Well, it's getting late, and I should probably get going.\"<br>\r\n<br>\r\nMarcus made to leave, until the actual reason he had come here suddenly slipped back into his head.<br>\r\n<br>\r\n\"Oh, I almost forgot.  Coach sent me over with this.\"  He pulled out the form and handed it over, explaining it's importance to Mrs. Li.  Once she understood what she needed to do, he insisted on leaving again.  Mrs. Li tried to insist he stay, but he managed to convince her he needed to get going, and was soon back out the door.<br>\r\n<br>\r\nBut before he could start heading back, he turned around to look again at the unassuming house.  Something weird was going on with Li, something strange, and possibly not all that natural.  Marcus was determined to figure it out.  But the only clues he had were the photo, proving how unusual Li's height really was, and the strange tea bags Li hadn't wanted to talk about in front of him.<br>\r\n<br>\r\nThe way he saw it, Marcus had two options.  Either he could just talk to Li about it in the morning and hope he explains what's going on.  Or he could head over to Mr. Fushigo's apothecary and see if he can find whatever those bags were.  On the one hand, it would be more honest to try and give Li the benefit of the doubt.  But on the other hand, it wouldn't hurt to make sure Li wasn't using anything...illegal.<br>\r\n<br>\r\nMarcus just wasn't sure which option would actually get him the answers he wanted.</span></div></div>",
            "created":1585544400,
            "id":2810051,
            "title":"Growing Concerns"
        },
        "1342212":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "He gives in and sells him the stuff.",
                "He stands firm and doesn't sell him the stuff."
            ],
            "content":"<div class=\"\"><div> <span>With how aloof Li had been, and with the surprise of showing up at his house uninvited, Marcus doubted that Li would give him a straight answer if he just asked.  There was really only one lead that might be worth pursuing.<br>\r\n<br>\r\nMarcus turned and immediately made his way back to the intersection where he'd seen Mr. Fushigo's shop.  Within minutes, he arrived.  And while it was starting to get rather dark out, the sign on the door still said the shop was open, much to Marcus' relief.  Emboldened by this, he stepped inside.<br>\r\n<br>\r\nThe shop was rather dimly lit.  Every available wall space was covered in shelves, each containing a plethora of strange looking goods.  There were great jars of colored powders, bunches of unfamiliar leaves and stalks and vegetables, bottles of all shapes and sizes filled with strange liquids that seemed almost to glow in the moody lighting, and various sealed boxes covered in odd pictures and intricate Chinese lettering.  Even the floor space was cramped, with only small aisles to walk through between elaborate displays of wares and goods.<br>\r\n<br>\r\nMarcus carefully worked his way through the shop, trying very hard not to disturb any of the products on display.  As he did so, he looked around for anything that looked like those tea bags he'd seen.  But it wasn't until he'd managed to thread his way through to the checkout counter that he had any success.<br>\r\n<br>\r\nThere at the register display, he found them.  A small collection of about twelve or so bags, each adorned with the same lettering and picture of a man and a tree.  He carefully picked one up to examine it, hoping there might be an English version of the lettering on there somewhere.<br>\r\n<br>\r\n\"Can I help you, sir?\"<br>\r\n<br>\r\nMarcus nearly jumped out of his skin.  He turned around to see who had spoken.<br>\r\n<br>\r\nAn elderly man was there.  He was stooped over slightly, and appeared not much taller than Li's mother.  His face was smooth, save for the slight wrinkling around the eyes, and his white hair was tied back in a tight bun on his head.<br>\r\n<br>\r\n\"Are you alright, there, son?\" he asked, a piercing look in his eyes.<br>\r\n<br>\r\nMarcus finally managed to get his breathing under control and nodded.  \"Yes, yes, I'm fine.  Sorry.  I didn't see you.\"<br>\r\n<br>\r\nThe man eyed him for a few more moments.  \"Very well then.  May I ask again, can I help you with something?\"<br>\r\n<br>\r\n\"Um...yes, yes!  I wanted to know about...about this.\"<br>\r\n<br>\r\nHe held out the packet he'd grabbed, thankful he hadn't dropped it or crushed it in his fright.  The man leaned in slightly to inspect it, then looked back up at Marcus, a much more scrutinizing squint in his gaze.<br>\r\n<br>\r\n\"Is there a particular reason you are interested in this product, sir?\"<br>\r\n<br>\r\nMarcus faltered.  \"I...I just think it looks...interesting.  I mean...it's got this...tiny tree on it.  I just...I'm just wondering if that's the tree this...stuff...is from.\"<br>\r\n<br>\r\nIt was a horrible lie, and Marcus was almost certain it hadn't actually worked.  The man stared for a few moments more before beginning to make his way around to the other side of the counter.<br>\r\n<br>\r\n\"I appreciate your interest in my wares, but I doubt you would find anything useful about that particular item.  It is not for people of your...generous blessings.\"<br>\r\n<br>\r\nGenerous blessing?  What was he talking about?<br>\r\n<br>\r\n\"You mean it's not for...for tall people?\"<br>\r\n<br>\r\nThe man paused again.  \"You are already gifted with great abundance in stature.  These are for those who do not have such blessings.\"<br>\r\n<br>\r\nMarcus mulled that over for a second.  \"So, it's a growth supplement.\"<br>\r\n<br>\r\nThe old man didn't respond, but his wary expression was confirmation enough.<br>\r\n<br>\r\nThis was it.  This was the answer to the whole mystery.  Li hadn't always been tall.  He'd used to be short, very short.  But somehow over the past year he'd managed to get a hold of this...this growth stuff.  And he'd used it to grow into a near literal giant.<br>\r\n<br>\r\nAnd he was still using it!<br>\r\n<br>\r\nHow much taller was he trying to become?  How much taller could he grow?  And how quickly could that extra height start to truly overshadow Marcus' own abilities?<br>\r\n<br>\r\nThis just wouldn't do.  Li was basically dosing to give himself an advantage.  Well, two could play at that game.<br>\r\n<br>\r\n\"Well, I think I'd like to buy some of this,\" Marcus finally said, glaring determinedly down at the shop owner.<br>\r\n<br>\r\nThe man shook his head.  \"I have told you, it is not for you.  You are already blessed with great height.  You do not need more.\"<br>\r\n<br>\r\n\"Look,\" Marcus started, a dangerous edge coloring his voice, \"I'm the one who gets to decide if I'm tall enough, not anyone else, including you.  I want to buy this stuff for my own use, and I'm willing to pay for it, whatever the cost.\"<br>\r\n<br>\r\nThe old man paused again, and Marcus wondered if he was trying to decide whether to give in or not, or just being dramatic.  Finally, he responded.</span></div></div>",
            "created":1585544400,
            "id":2810257,
            "title":"Supplemental Investigations"
        },
        "13422121":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "He heeds the warning and only uses one.",
                "He disregards the warning and uses two."
            ],
            "content":"<div class=\"\"><div> <span>The shopkeeper sighed.  \"Very well.  You may have it.  But may the consequences of this be on your head.\"<br>\r\n<br>\r\nMarcus was just about done with all the theatrics.  \"Fine, whatever, just tell me what this is and what I need to do to use it.\"<br>\r\n<br>\r\nThe man glared at him before picking out another of the bags to explain.  \"Deep in the forests of the Changbai Mountains, there is a secret grove of ancient trees, said to be as old as heaven itself.  The trees are not very tall, but have bark as strong as metal, and leaves with poison more deadly than the viper.  And the roots of the trees spread out a great distance, consuming all the energies of the earth they can and killing any other plant that tries to grow in their territory.<br>\r\n<br>\r\n\"These roots grow quite long, and quite fast.  And unlike the bark, they are soft and easily harvested.  When properly prepared, powders made from these roots will allow a man to grow tall and fast, like the roots.\"<br>\r\n<br>\r\n\"Yeah, whatever,\" Marcus interjected, impatient to hear what he really wanted to know.  \"So how do I 'properly prepare' these.\"<br>\r\n<br>\r\nThe man's glare intensified, but he relented to his question.  \"Prepare boiling water, as if you were making tea.  Measure out about a cup of the water and add the contents of a single envelope of powdered root.  Stir until the powder dissolves, turning the water a dull green.  Then drink.  Use no more than one envelope per day.  Using this supplement too quickly will have dire consequences.\"<br>\r\n<br>\r\nMarcus almost felt the need to make a sarcastic comment at the dramatic wording, but something about the insistence of the man's warning tone made him shut his mouth.  After all, he was delving into dangerous territory, putting some unknown substance into his body.  And it might pay to actually listen to the shopkeeper's instructions, lest he get something wrong.<br>\r\n<br>\r\n\"So how much can you sell me, and how much will it cost?\" he finally asked.<br>\r\n<br>\r\nThe man paused once more.  \"I have only enough supply to sell you two weeks' worth.  Return at that time, and I will have more if you still desire it.<br>\r\n<br>\r\n\"As for price, ten dollars per envelope.\"<br>\r\n<br>\r\nMarcus blanched.  This guy was charging him a hundred and forty bucks for something that might not even work.<br>\r\n<br>\r\n<i>Except it had worked for Li</i>, his thoughts reminded him.  And that was enough to convince himself to go through with it.<br>\r\n<br>\r\nHe pulled out his wallet.  \"Do you take credit cards?\"<br>\r\n<br>\r\nThe shopkeeper smirked.  \"I have a chip reader,\" he replied, pulling the aforementioned reader and a tablet out from beneath the counter.  Once the payment went through, he placed them back beneath and pulled a bag out for thirteen packets of the powdered root, which he then offered to Marcus, who was still holding the fourteenth in his hand.<br>\r\n<br>\r\n\"Have a good day, sir,\" the shopkeeper replied smugly.  \"And remember, one envelope per day.  No more, or else.\"<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nThe next morning dawned bright and early for Marcus.  He was up an hour before his parents like always for his morning job around the neighborhood.  But instead of his usual coffee, he just let the coffee maker boil the water on its own.<br>\r\n<br>\r\nAfter all, he had something better to drink this morning.<br>\r\n<br>\r\nOnce it was ready, he pulled down his mug from the shelf and poured in a reasonable amount of water.  Then he grabbed the brown bag with the packets of powder inside and opened it, reaching in and grabbing for one.  He ended up grabbing two.  A part of him made to immediately put one back, but another faltered.<br>\r\n<br>\r\nWas it really that bad if he had more than one a day?  Wouldn't using two a day make his growth faster?<br>\r\n<br>\r\nBut what about the \"dire consequences\" of overdosing, like the shopkeeper had said?  Was it worth the risk?  Besides, he had no idea what exactly this would do to him.<br>\r\n<br>\r\nHe stood there, going back and forth, whether to heed the man's instructions or throw caution to the wind.</span></div></div>",
            "created":1585660020,
            "id":2810872,
            "title":"Expository Warnings"
        },
        "134221211":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "Continue with the practice.",
                "Skip ahead a ways."
            ],
            "content":"<div class=\"\"><div> <span><i>I'd better not risk it</i>, he thought to himself.  <i>The last thing I need is for this to blow up in my face.</i><br>\r\n<br>\r\nHe returned the extra packet to the bag and opened the other one to dump the contents into his mug.<br>\r\n<br>\r\nAfter stirring for a few minutes, the powder seemed to have dissolved, and the water solution had turned dark green like a dense forest.  He picked up the mug, bringing it to his lips.  Just before it reached his mouth, he hesitated.  Was he really about to do this?  But he'd already spent money on it.  Too late to turn back now.<br>\r\n<br>\r\nAnd so down the hatch it went.<br>\r\n<br>\r\nIt wasn't bad, but it wasn't exactly ambrosia either.  It had a very earthy taste, like the time his mom had gotten tea leaves for the three of them to try.  But there was also a sweetness to it, like natural sugar, and an invigorating sort of feeling as the warmth moved down his throat.  As it settled into his stomach, he felt that warmth, that vigor, spreading further, until his entire body felt energized.<br>\r\n<br>\r\nForget coffee, here was a real wake up drink.  Even if it didn't make him grow a single inch, the energy alone from this one cup might be worth the price.<br>\r\n<br>\r\nMind clear and blood pumping, Marcus took off on his jog with more enthusiasm than ever before.<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nAt practice that afternoon, Marcus was of course assigned to play with Li, just as Coach had wanted.  And while Marcus might still be quite peeved at Li's \"dosing\", now that he was too it seemed like bad sportsmanship to be outwardly angry at him.  Besides, he was just a kid.  And it might be nice to have a friend who he didn't have to crane his neck down to talk to.<br>\r\n<br>\r\nAs they were running through opening stretches, Marcus decided to extend an olive branch.<br>\r\n<br>\r\n\"Hey, man, I'm sorry about showing up at your house yesterday like that.  Coach just wanted me to give something to your mom, and she insisted I come in as soon as I introduced myself, and well...\"<br>\r\n<br>\r\n\"Yeah, I get it.  She's not exactly easy to say no to,\" Li replied, conceding the point.<br>\r\n<br>\r\n\"Anyway, look.  I think we got off on a bit of a wrong foot here.  How about we start over?  Coach is probably going to have us spending a lot of time together, being the only guys this tall on the team.  Plus I think he wants me to help you develop your skills.  You're pretty good for a beginner, but you've got a lot of potential that you're not quite using yet.  And maybe I can help with that.<br>\r\n<br>\r\n\"And all that would be a lot easier if we could be friends.  What do you say?\"<br>\r\n<br>\r\nLi hesitated, continuing his stretch.  Finally, he said, \"Yeah, sure.  We could give it a try.\"<br>\r\n<br>\r\nMarcus smiled and nodded as they moved into their next stretch.</span></div></div>",
            "created":1585664940,
            "id":2810918,
            "title":"Trying New Things"
        },
        "1342212112":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "\"Yes, you may have the four week supply.\"",
                "\"No, I only sell it by the two week amount.\""
            ],
            "content":"<div class=\"\"><div> <span>It would be incorrect to say that Marcus and Li hit it off perfectly well after that.  Between Marcus' suspicions and Li's aloofness, there was a fair amount of ground between them.   But slowly, surely, they began to build a bond of sorts.<br>\r\n<br>\r\nAs it turned out, Coach was right.  Li was a little sensitive about his height.  No one else in school was anywhere near as tall as the two boys, and the difference between Li and his fellow freshman was even more pronounced.  Such extreme differences are prone to causing distrust, fear, confusion, and even jealousy.  And as teenage boys will do when faced with complicated emotions, they channeled that into the old teenage standby:  bullying.<br>\r\n<br>\r\nMarcus stumbled upon Li being picked on several times over the next week, and while he didn't intervene the first few times, after finally getting Li to talk to him about it, he decided he wasn't just going to stand back and let this happen to his new friend.<br>\r\n<br>\r\nBy the time two weeks had passed, the other boys had learned not to mess with Li, at least not so long as his friend Marcus, the star basketball player, was around.  Marcus made it a habit to check in every so often, and any time he saw boys picking on Li, he stepped in and shooed them off.  He hated that this was happening to Li, but an odd part of himself actually liked these protective instincts he'd developed.  He wondered to himself if this was what having a little brother was like.  It felt nice.<br>\r\n<br>\r\nBut his relationship with Li wasn't the only thing that was growing.<br>\r\n<br>\r\nMarcus had managed to convince himself not to check his height every day.  It wasn't like the roots would work that quickly.  Li was living proof of that.  But the energy boost every morning was still quite the plus.  And even if he didn't know it for certain, there were times when he was relaxing or being still when he could almost feel as if he were growing taller.<br>\r\n<br>\r\nAs it turned out, he might have been right.<br>\r\n<br>\r\nAfter waiting a week, he measured himself against the wall where his parents had been recording his height since he was three.  He stood himself straight up, carefully holding his position as he used a book and pencil to mark his height.  Feeling he'd made a decent enough mark, he turned back around, and a surge of exhilaration filled him.<br>\r\n<br>\r\nThere on the wall was a mark in pen noted with \"6'-11\"\" and dated with the start of the new school year.  And right above it was the pencil mark, a good half inch higher on the wall.<br>\r\n<br>\r\nIt was working.  Marcus was growing taller.<br>\r\n<br>\r\nBut so, unfortunately, was Li.<br>\r\n<br>\r\nIt made sense.  Li was definitely still taking the roots.  He'd even personally seen him with them.  So it was reasonable to assume Li would continue to grow at that same profound pace.<br>\r\n<br>\r\nBut that didn't mean Marcus had to like it.<br>\r\n<br>\r\nIt was obvious at every practice that Li still had an inch on him, and that extra little inch kept nagging at Marcus' brain.  He needed to find to way to even the score.<br>\r\n<br>\r\nBut the two weeks came and went, and Marcus was still unsure how he could even the odds against Li.  The slightly more pressing concern was the fact that he had now used all of his root powder and needed to get more.<br>\r\n<br>\r\nSo that evening found him once again heading to Mr. Fushigo's shop in Li's neighborhood.<br>\r\n<br>\r\nOnce again, there was no sign of anyone as he entered.  But rather than risk being snuck up on again, Marcus called out a hello.<br>\r\n<br>\r\n\"Has it been two weeks already?\" a voice asked.  Marcus turned toward it just in time to see the shopkeeper closing a nondescript door leading out the back of the store room.<br>\r\n<br>\r\nMr. Fushigo eyed Marcus with a calculating gaze.  \"My how time flies.  I suppose you are here for more of the root?\"<br>\r\n<br>\r\n\"Yes,\" Marcus replied simply, moving to meet him at the counter.  \"I'm rather pleased with the results and would like them to continue.\"<br>\r\n<br>\r\nThe shopkeeper hummed before responding.  \"You were already tall, and you are now even taller.  Yet you wish to grow even more.  I wonder just how much will be enough for you.  A foot, two feet, three?  Will you be done when you surpass the trees, or dwarf the mountains, or reach the sky?  Will you be satisfied when you tower over the heavens themselves?\"<br>\r\n<br>\r\nMarcus groaned.  \"Look, I get it.  Greed can be bad.  But it's not like I'm trying to outgrow the world.  I just want to be a little taller.  Is that really a crime?\"<br>\r\n<br>\r\nThe shopkeeper sighed, but he relented and prepared another bag of the powdered root.<br>\r\n<br>\r\n\"Also,\" Marcus interjected, \"could I get a four week supply instead of two?  it would be nice to have plenty so I don't have to refill it so often.\"<br>\r\n<br>\r\nMr. Fushigo looked up incredulously.  Marcus pressed on.  \"Please, it's not like I'm going to abuse it, I swear.\"<br>\r\n<br>\r\nThe shopkeeper considered him for another few moments before responding.</span></div></div>",
            "created":1585685220,
            "id":2811121,
            "title":"Two Weeks Later"
        },
        "13422121121":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "Play it safe",
                "Take the risk"
            ],
            "content":"<div class=\"\"><div> <span>\"Very well, you may have the four week supply.  But that means I should not expect to see you before those four weeks have passed.\"<br>\r\n<br>\r\n\"Yeah, that's fine,\" Marcus hastily replied as Mr. Fushigo added the extra packets to his bag.  And once he had paid for the new supply he rushed home.<br>\r\n<br>\r\nOnce he was home he went to measure himself, just as he had the previous week.  And just like last week, the new mark was a good half inch higher than the last one.  Meaning he had now grown a full inch taller.<br>\r\n<br>\r\nOne full inch.<br>\r\n<br>\r\nHe was now officially a seven footer!  How cool was that!<br>\r\n<br>\r\nBut Li was still taller.<br>\r\n<br>\r\nLi had already been seven feet.  And the extra inch he'd grown in the last two weeks to match Marcus' put him at seven-foot-one.  At this rate, unless Li suddenly decided to stop there was no chance of Marcus catching up to or passing him.  Ever.<br>\r\n<br>\r\nUnless...<br>\r\n<br>\r\nUnless he found a way to speed up the process.<br>\r\n<br>\r\nMarcus looked over at his desk where he'd dropped the root powder, thinking.  Using one packet a day had let him grow an inch in two weeks.  Logically, it stood to reason that using two packets a day could double that.  Two inches in two weeks.  Against Li's one, that would let him tie their heights after just two weeks.  Continuing that, he could surpass Li in height by a full inch in just a month.  Or maybe even more...<br>\r\n<br>\r\nMarcus shook his head.  The idea of such incredible growth was blinding him to the fact that he only had a four week supply of the root powder.  If he insisted on using two a day, that time would be cut in half, and he'd have to go back for more a lot sooner than Mr. Fushigo was expecting to see him.  And there was still the matter of Mr. Fushigo's warning about taking more than one a day.  Marcus had no idea what he could have meant by \"dire consequences\", but he was pretty sure he didn't want to find out.<br>\r\n<br>\r\nIt all came down to whether or not the prospect of surpassing Li in height was worth the risk of any complications.<br>\r\n<br>\r\nShould he play it safe and stick with being an inch shorter until Li finally decides he's satisfied?<br>\r\n<br>\r\nOr should he risk the dangers of accelerating the process to become the bigger man?</span></div></div>",
            "created":1585747020,
            "id":2811539,
            "title":"Calculated Decisions"
        },
        "134221211212":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "Li",
                "Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>By the next morning, Marcus had made his decision.  He was going to double the intake.  He figured whatever potential issues might come up would be worth it if he could catch up with Li.<br>\r\n<br>\r\nSo that morning, instead of his usual one packet, he dumped in two.  The additional powder made the final drink a much darker shade of green than it had been previously, and it almost tasted a little grainy.  But the energy boost felt about the same and he didn't have any sudden nausea or stomach pain, so he dismissed it and went on with his day.<br>\r\n<br>\r\nThis time as the days passed, he actually did start to notice the change.  His shoes had started getting just a tad bit tighter.  His pants and shirts were starting to come up a little short when he stretched out.  He was much more aware of how much he had to duck and bend over to get through doorways and avoid ceiling fans and fixtures.<br>\r\n<br>\r\nAnd as annoying as it all was, the thrill of his increased height more than made up for it.<br>\r\n<br>\r\nBy the end of that first week on the doubled dose, he could already tell how much taller he'd grown.  And his measurement that night confirmed it:  one inch in one week.<br>\r\n<br>\r\nThis was going quite well.<br>\r\n<br>\r\nBut as the second week went on, he began to grow concerned.  If he wanted the growth to continue, he'd need to get more of the root powder from Mr. Fushigo.  And the old man would be suspicious if he showed up two weeks early asking for more.  What could he do?<br>\r\n<br>\r\nNot even the fact that he could now look Li directly in the eye, which surprised both of them when they realized it, could lift his souring mood as the end of the second week approached.  But it did give him enough resolve to at least attempt it.<br>\r\n<br>\r\nJust as he had done two weeks before, and two weeks before that, Marcus made his way to Mr. Fushigo's shop.  He wasn't sure what he would do to convince him to give him some more, but he had to try.<br>\r\n<br>\r\nBut this time when he squeezed through the front door, he was surprised to see someone already in the store room at the counter.  And it wasn't Mr. Fushigo.<br>\r\n<br>\r\nIt was...</span></div></div>",
            "created":1585772520,
            "id":2811691,
            "title":"Doubling Down"
        },
        "1342212112122":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "The Next Day",
                "Two Weeks Later"
            ],
            "content":"<div class=\"\"><div> <span>It was a young woman, probably close to his own age, but only slightly taller than Mr. Fushigo.  Besides the height, she also seemed to have a strong facial resemblance to the older shopkeeper.<br>\r\n<br>\r\nShe was leaning against the counter, her face in her hand looking bored when Marcus came in.  But the door opening had drawn her attention, and she was now standing up straight with a fake smile to address the new customer.<br>\r\n<br>\r\n\"Welcome to Mr. Fushigo's Apothecary.  My name is June.  How can I help...you...\"<br>\r\n<br>\r\nJune faltered as Marcus approached the counter.  It was fairly obvious his height had thrown her for a loop, though not necessarily a bad one.  Marcus suddenly wondered if that might work to his advantage.<br>\r\n<br>\r\n\"Yes, I think you can help me,\" he replied cordially, a flirtatious hint to his tone.  He offered his hand.  \"I'm Marcus.  And you're...June, correct?\"<br>\r\n<br>\r\nJune's cheeks colored slightly as she took the offered hand.  \"Ye...yes, I'm June.  Mr. Fushigo is my grandfather.\"<br>\r\n<br>\r\n\"Ah, interesting.  I guess you must be helping him out here in the store.\"<br>\r\n<br>\r\n\"Yes, uh, I am.  He's on a trip back to China to pick up some new stock for some of our more popular wares.  Like our special Tibetan Tea Blends.  Would you...be interested in that?\"<br>\r\n<br>\r\nJune leaned in, a beckoning smirk on her face.  Marcus leaned down to meet her.<br>\r\n<br>\r\n\"Actually, I'm here for some more of these.\"  He reached over to the display of root powder, grabbing one to show the girl.  \"I'm in need of a refill on my supply.  Tell me, how much are you able to sell to me at one time?\"<br>\r\n<br>\r\nJune's blush deepened.  \"I'm only supposed to sell them in two week amounts.  But...but maybe I could make an exception.  Just this once, of course.\"<br>\r\n<br>\r\nMarcus smiled and winked.  \"Of course.\"<br>\r\n<br>\r\nJune giggled.  \"So, how much do you need?\"<br>\r\n<br>\r\nMarcus' smile widened.  \"How much have you got?\"<br>\r\n<br>\r\nJune's eyes widened, but she didn't drop her smile.  \"Let me check.\"<br>\r\n<br>\r\nShe headed to the door to the back, pulling Marcus' hand until she had to let go.  Marcus smiled after her.  This was turning out so much better than he had expected.<br>\r\n<br>\r\nAfter a few minutes, June came back with a large box, the same picture of the man and tree on the side.<br>\r\n<br>\r\n\"Assuming your taking this stuff once a day, this should be enough to last you for about four months.\"<br>\r\n<br>\r\n\"Sounds perfect,\" he replied, placing his hand on the box right next to June's.  \"What do I owe you?\"<br>\r\n<br>\r\nJune giggled again as Marcus pulled out his credit card.  And once the transaction was done, she carefully handed the box over.<br>\r\n<br>\r\n\"Pleasure doing business with you, ma'am,\" Marcus called back as he was leaving.  All he got in reply was another giggle.<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nFour months, she had said, and she was technically correct.  Marcus counted them out himself when he got home.  112 packets, a sixteen week supply.<br>\r\n<br>\r\nOr an eight week supply, if you were double dosing.<br>\r\n<br>\r\nBut now Marcus didn't have to worry about that.  Once the next two weeks were up he could go back to the shop and face Mr. Fushigo as if he was still following his instructions.  And with the old man none the wiser he'd be able to double dose for the next three months after that.  Which should be more than enough for himself and Li.  They were already both over seven feet.  It wasn't like they'd actually try to push their luck past eight.<br>\r\n<br>\r\nWould they?<br>\r\n<br>\r\nBut Marcus didn't dwell on that.  Instead he focused on his new measurement:  seven foot two.  And based on his calculations, so too was Li.<br>\r\n<br>\r\nBut not for long.</span></div></div>",
            "created":1585791540,
            "id":2811805,
            "title":"A Lucky Break for a Lying Boy"
        },
        "13422121121222":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "...until he saw something on his leg.",
                "...until he felt something in his gut."
            ],
            "content":"<div class=\"\"><div> <span>The next two weeks turned out to be even better than the previous two.  Having now caught up to Li, the continued use of the double dose led to surpassing him, much to his confusion.  Once more Marcus was the tallest guy in school.  And no one seemed to even notice the odd sudden growth spurt he'd gotten.  Of course, when you're practically a foot taller than everyone else anyway it's hard for them to notice a few extra inches.<br>\r\n<br>\r\nAnd it wasn't like his new size was causing any problems on the court.  Despite his increased height, and the increase in weight to match his growing proportions, he was still just as agile and quick as he'd already been.  As far as Coach was concerned that was all that mattered.<br>\r\n<br>\r\nHis parents did give him a few funny looks, but they were often so busy that they didn't have time to dwell on whether or not their son was suddenly growing again.  Besides, he'd been tracking his own height for years.  If he didn't come to them about it then there wasn't a problem.<br>\r\n<br>\r\nExcept that there was.<br>\r\n<br>\r\nHaving already grown three inches in four weeks, Marcus soon found that his wardrobe was quickly becoming too small for him.  Which wasn't that big of a deal.  He had plenty of money thanks to his parents (which of course had come in handy when paying the boatload that the root powder cost), so going to the local Big and Tall store for new shirts and pants wasn't an issue.  But he had to custom order his shoes, since no store in town kept anything near his foot size in stock.<br>\r\n<br>\r\nBut it wasn't just his own wardrobe.  Coach was noticing how much his basketball shirts were riding up on him.  And while he didn't insist on measuring out Marcus himself, he did insist he give him his new sizes so he could reissue his uniforms.<br>\r\n<br>\r\nAnd that wasn't even getting into how much smaller the rest of the world had become in comparison.<br>\r\n<br>\r\nMarcus had already had a hard time fitting into the desks in class, but now they were becoming downright constricting.  He was having to duck so much more to get through doorways it was straining his neck.  He barely fit inside his own car, and he'd already had the seat pushed as far back as it could go.<br>\r\n<br>\r\nBut as unfortunate as all that was, it still wasn't enough to deter him from the joy at beating Li as his own game.<br>\r\n<br>\r\nAnd the measurement he took the morning he'd be heading back to Mr. Fushigo's was all the boost he needed.<br>\r\n<br>\r\nSeven foot four.<br>\r\n<br>\r\nProfessional Basketball Player height.<br>\r\n<br>\r\nMore than enough.<br>\r\n<br>\r\nBut also still not enough.  Not until Li was done.  He didn't care how much he'd come to like Li, as a friend, or as an adopted little brother.  He wasn't going to back down until Li did.<br>\r\n<br>\r\nAnd that was all that consumed his thoughts that morning as he drank his morning double dose of root powder, as he went on his morning jog, and even as he showered before getting ready for school.<br>\r\n<br>\r\nThat is, until...</span></div></div>",
            "created":1585827420,
            "id":2812113,
            "title":"Unforeseen Complications"
        },
        "134221211212221":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "Li notices him and he gets confronted.",
                "Li doesn't notice him and he gets away."
            ],
            "content":"<div class=\"\"><div> <span>He'd been getting dressed after his shower when he saw it.  Right there on his inner thigh.  Just below his briefs.<br>\r\n<br>\r\nA rash.<br>\r\n<br>\r\nA rash unlike he'd ever seen or heard of before.<br>\r\n<br>\r\nCarefully he reached down to inspect it.  It was a brownish gray, almost ashy.  It was hard to the touch and dry.  Yet there was no real border to it.  The transition from normal skin to hardy rash was almost seamless as he rubbed his fingers along his leg.<br>\r\n<br>\r\nStill, it didn't hurt, not even when he touched it.  Marcus reasoned it was probably just the stress of all the work he'd been doing on and off the court.  He'd probably scraped it against something and just not noticed.  Li's playing had been becoming more aggressive lately, and Marcus had taken a tumble or two because of it.<br>\r\n<br>\r\nNot that he was mad.  He was actually proud to see Li putting his size to good use, in addition to the new agility and speed he'd been developing.  And he'd been improving quite a lot since they'd been placed together by Coach.<br>\r\n<br>\r\nAnd as he mulled these thoughts over, he pulled on his pants, and the rash slipped out of sight and out of mind.<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nBut the rash wasn't the only thing that would dampen Marcus' spirit that day.<br>\r\n<br>\r\nLi was acting oddly.  He was back to being more aloof, like when Marcus had first met him.  And try as he might, Marcus couldn't get him to talk to him more than he had to.<br>\r\n<br>\r\nEven at practice, Li was just barely putting in the effort, going through the motions without any real heart in the matter.  And the coach took notice, even going so far as to call him out for lack of focus a few times.<br>\r\n<br>\r\nIt was a rather disconcerting change, and Marcus wasn't sure what to do about it.<br>\r\n<br>\r\nBut Marcus had a slightly more pressing concern to attend to, and since Li had already been rebuffing his attempts to get him to talk he doubted he'd be more open to it after the dressing down from Coach.<br>\r\n<br>\r\nSo Marcus hastened over to Mr. Fushigo's to get his new (double) supply of root powder.<br>\r\n<br>\r\nIt was on his way over that Marcus began to wonder if June had told her grandfather about him coming in while he had been gone.  He hadn't considered it before, but now that he was about to face him again after defying his instructions the possibility seemed quite probable.  What would he say if the shopkeeper confronted him about it?  Would he ban him from the store?  Force him to return the stuff he'd not yet used?<br>\r\n<br>\r\nAs the storefront came into view, Marcus forced his face into an impassive one, even as his mind raced with panicked potentialities.<br>\r\n<br>\r\n\"Back again, I see,\" Mr. Fushigo's voice greeted Marcus as he entered the shop.  He looked over to see him already at the counter.  He didn't seem angry or suspicious, but that wasn't necessarily saying much.<br>\r\n<br>\r\n\"Yeah...yeah, I'm back.  I, uh, just needed the next month's supply of that root powder.\"<br>\r\n<br>\r\nThe shopkeeper scrutinized him for a moment.  \"Still insisting on growing further.\"<br>\r\n<br>\r\nMarcus did his best to remain unperturbed.  \"Yeah, just...just a little bit.  I mean, I'm only getting this stuff a month at a time.  That's not a lot.  I mean, I'll know when enough is enough.\"<br>\r\n<br>\r\nMr. Fushigo just kept staring at him.  \"You know, the tree that these roots come from is a particularly persistent one.  It will insist on growing into every space it can, cutting out all other life in its vicinity.  I wonder if perhaps it has taken root in your mind as well.\"<br>\r\n<br>\r\nMarcus' anger flared up at that.  \"Look, I could be asking for more than the four weeks you've been giving me.  But I've been sticking with that, okay?  That means that I can stop taking it whenever I'm sure I'm done.  And I don't need some platitude about addiction from you.  Now, can I have this month's supply?\"<br>\r\n<br>\r\nMr. Fushigo's eyes narrowed slightly, but he still reached over to the display to prepare his new month's supply.  Marcus let out a breath he didn't know he'd been holding and pulled out his credit card to pay.  And once he was done, he left with his bag without another word.<br>\r\n<br>\r\nBut just as he was leaving the shop, he saw Li heading toward it.</span></div></div>",
            "created":1585832520,
            "id":2812169,
            "title":"That Can't Be Good"
        },
        "1342212112122211":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "He heeds the concerns and goes to Mr. Fushigo.",
                "He ignores the rash and keeps taking the larger doses."
            ],
            "content":"<div class=\"\"><div> <span>Before Marcus could do little more than panic, Li noticed him, and the frown that was on his face deepened.  Marcus tried to head off, but Li still managed to catch him less than half a block away from Mr. Fushigo's.<br>\r\n<br>\r\n\"What are you doing here?\" he asked coldly as he came to a stop in front of him, blocking his path.<br>\r\n<br>\r\nMarcus immediately went on the defensive.  \"I'm just taking a stroll.\"<br>\r\n<br>\r\nLi's eyes narrowed.  \"And how do you explain that?\"  He nodded toward the bag still in Marcus' hand.<br>\r\n<br>\r\nMarcus quickly moved it behind his back, but the damage had already been done.<br>\r\n<br>\r\n\"That's why you passed me in height, isn't it?\" Li accused, his face turning angrier.  \"You were jealous and then you found a way to make yourself taller than me.\"<br>\r\n<br>\r\nMarcus's own anger flushed through him, overriding every instinct to play dumb.  \"Well maybe I wouldn't have had to if you hadn't been making yourself taller.  At least I got to six-eleven on my own.  You dosed yourself to reach seven feet!\"<br>\r\n<br>\r\n\"So did you!  And now you're doing something that's making you grow even faster!\"<br>\r\n<br>\r\n\"So what?!  I've earned the right to be the tallest!  You don't deserve all that height you've got now!\"<br>\r\n<br>\r\n\"Neither do you!  You're even worse than me because you're obviously using more than Mr. Fushigo recommends!\"<br>\r\n<br>\r\n\"I had to!  There was no way I could keep up with you without double dosing!\"<br>\r\n<br>\r\n\"Well maybe I should start triple dosing too so I can surpass you!\"<br>\r\n<br>\r\n\"You wouldn't dare!\"<br>\r\n<br>\r\n\"Try me!\"<br>\r\n<br>\r\nThe two glared each other down for several minutes, rage pulsing through them.  Finally, their energies spent, they started to come down, and the realization of all they'd said hit them full force.  They found they could no longer look each other in the eye.  And after several more moments of awkward silence, Li finally spoke up.<br>\r\n<br>\r\n\"I thought you were my friend.  I thought I could trust you.  You'd been so nice, so encouraging, so understanding, like no one else has ever been.  But you went behind my back like a jealous child, just to make yourself feel better.<br>\r\n<br>\r\n\"I guess I don't have any friends here.\"<br>\r\n<br>\r\nMarcus' heart sank, but he couldn't bring himself to speak as Li left, back in the direction of Mr. Fushigo's.  Finally, once his footsteps had faded out, he started the long trek back home in silence.<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nThe next few days were tense.  Li made no effort to acknowledge Marcus any more than he absolutely had to.  And Marcus, still angry and upset over the confrontation, responded in kind.  They still practiced together for basketball, but their dealings were so formal and concise that it was like talking to a stranger.  And honestly, Marcus had never felt more alone and isolated than he did then.<br>\r\n<br>\r\nBut it soon became clear that Li was following through on his threat to triple dose to counteract Marcus' double dosing advantage.  By the second week after their falling out, Li had caught up to Marcus' now seven-foot-six height.  Marcus had no idea how he'd gotten around Mr. Fushigo's warnings, but that didn't matter.  He needed to even the playing field.<br>\r\n<br>\r\nSo he started triple dosing to match him.  Which he did, much to Li's frustrations.<br>\r\n<br>\r\nBut another matter of growing concern was also beginning to escalate.<br>\r\n<br>\r\nMarcus' rash, originally so small and basically forgettable, was starting to spread.  Not only was the original rash getting bigger, but other spots were starting to appear on his arms and torso.  And the texture of the rash was changing, turning into hard blocky scales that hurt to pick at, and reminding Marcus more and more of a tree's bark.<br>\r\n<br>\r\nMarcus briefly wondered if this might be the side effects Mr. Fushigo had warned him of from overdosing on the root powder, and that he should go confess to him and ask about the rash.  But another part of him insisted it wasn't a big deal and that he should keep taking the larger doses to match with Li.</span></div></div>",
            "created":1585922880,
            "id":2812688,
            "title":"Confrontation and Escalation"
        },
        "13422121121222112":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "Then Li lunges for the tumbler and they fight.",
                "Then something stops them."
            ],
            "content":"<div class=\"\"><div> <span>The thought of coming clean to Mr. Fushigo terrified him, not just because of the potential for the old shopkeeper's wrath to come down on him hard, but also for the rather twisted reasoning that as long as he didn't know for sure that this rash was a consequence of his overdosing that he'd be fine.  He simply switched to wearing sleeves on his arms for practice and using his long sleeve shirts otherwise to keep them hidden, both from others and himself.<br>\r\n<br>\r\nIgnorance was bliss, after all.<br>\r\n<br>\r\nBut both the rashes and the tension between the two boys were growing rapidly.  Their interactions on the court had gone from formal to curt to downright passive aggresive.  It was only the punishment for unsportsmanlike conduct that was keeping them from a full on brawl.  But only just.<br>\r\n<br>\r\nBy the end of the fourth week since their falling out, things had become downright nasty.  It didn't help that the two of them were now standing at seven feet and nine inches tall, with all the increased strength and weight to match.  If they were to actually fight now, whatever damage they did to each other would be nothing compared to what they could do to everyone and everything around them.<br>\r\n<br>\r\nIn fact, Marcus was so enraged by Li that he had come up with a particularly cutting way to bring him down to size once and for all.<br>\r\n<br>\r\nAs soon as practice was over, Marcus headed home and took all of his remaining packets, a three week normal dose supply, and dumped them all in a single tumbler with enough water to make it a liquid.  And then he headed straight for Li's place, intending to drink it all in front of him, consequences be damned.<br>\r\n<br>\r\nThat would show him.<br>\r\n<br>\r\nBut he didn't quite make it to Li's.  Instead, Marcus found him heading in his direction just as he came into view of Mr. Fushigo's shop.  Enraged at the sight of him, Marcus marched right up to Li, who had already responded in kind.<br>\r\n<br>\r\n\"You,\" Marcus started, his unoccupied hand clenching, \"you have been nothing but a thorn in my side since the moment I met you.\"<br>\r\n<br>\r\n\"Well you're not exactly a pinnacle of civility and friendship yourself,\" Li retorted, his own hands balled into fists.<br>\r\n<br>\r\n\"At least I didn't come here under false pretenses.\"<br>\r\n<br>\r\n\"You're one to talk, mister 'I'm just taking a stroll'.\"<br>\r\n<br>\r\n\"I only did this because you were!\"<br>\r\n<br>\r\n\"And that makes you better?!  You're height's just as artificial as mine!\"<br>\r\n<br>\r\n\"But at least I started out tall!  All of your height is fake!\"<br>\r\n<br>\r\n\"It's real enough to do this!\"<br>\r\n<br>\r\nLi shoved him.  It didn't do much, but it was enough to make Marcus see red.  A malicious grin sprung up on his face.<br>\r\n<br>\r\n\"Well, once I drink this, it won't matter.\"  He held up the tumbler.  \"This has enough root powder in it to make me so much taller you could never catch up.\"<br>\r\n<br>\r\nLi's eyes narrowed as his rage bloomed.  \"Not unless I take it and drink it first.\"<br>\r\n<br>\r\n\"I'd love to see you try.\"<br>\r\n<br>\r\n\"I bet you would.\"<br>\r\n<br>\r\nFor a few moments, they stared each other down.  Then...</span></div></div>",
            "created":1585996140,
            "id":2813090,
            "title":"The Tipping Point"
        },
        "134221211212221121":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "Someone else had grabbed the tumbler.",
                "The tumbler wasn't there."
            ],
            "content":"<div class=\"\"><div> <span>For few moments, they stared each other down.<br>\r\n<br>\r\nThen Li lunged forward.<br>\r\n<br>\r\nMarcus just barely managed to keep the tumbler out of his grasp, but it went flying down the street as he was knocked down by the force of Li's tackle.  Li made to get up, but Marcus seized him and rolled, pulling Li down onto the pavement.  With Li winded, he made to get up and run after the tumbler, but Li grabbed his shirt from behind, pulling him back down as well.<br>\r\n<br>\r\nOn and on it went, one trying to get up and the other pulling them back down, the two together zigzagging along the road as they slowly but inexorably moved after the tumbler.  A few brief punches were traded, but this fight was more about beating the other to the prize, not to a pulp.<br>\r\n<br>\r\nThat didn't protect them or their clothes from getting torn up a bit.  On one landing Marcus scraped his knee on the ground, ripping the lower half of his pant leg off and leaving a bloody scrape exposed, right next to one of his new rashes.  Which was apparently enough to distract Li, who froze long enough for Marcus to pull him down, ripping the sleeve off his hoodie and exposing a very similar rash on Li's arm.  Which was enough to distract Marcus, giving Li another chance to go for the tumbler.<br>\r\n<br>\r\nBut Marcus wouldn't let him, tackling him again and sending the tumbler flying down the road, finally coming to rest on the sidewalk outside a glass storefront door.<br>\r\n<br>\r\nThe two boys kept going at it, each trying to beat the other to the prize, and doing everything they could to slow the other down.  Which wasn't easy.  Had they had this fight back when they first met, Marcus might have been able to overpower Li easily, even with Li's superior height.  But all those weeks of root powder consumption and Marcus helping to train Li had left the two boys almost evenly matched.<br>\r\n<br>\r\nThey grappled and grabbed, pulled and pummeled, each doing their best to slow the other and get ahead.  But neither could get a clear advantage.<br>\r\n<br>\r\nThen, just as they had reached the tumbler once again, something happened to make them both freeze.</span></div></div>",
            "created":1586028360,
            "id":2813278,
            "title":"The Climactic Battle"
        },
        "1342212112122211211":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "...opening into another room.",
                "...opening out to the yard behind the store"
            ],
            "content":"<div class=\"\"><div> <span>The tumbler, with Marcus' one ticket to being the biggest once and for all inside, wasn't sitting on the ground where it had rolled to.  It was being held in an old yet firm hand connected to a very disappointed looking old shopkeeper.<br>\r\n<br>\r\nMr. Fushigo was glaring at the pair of them worse than either had ever seen.  It was so intense that, had they been in a cartoon world, Marcus was certain the older man would be literally red-faced with steam pouring out his ears.  As such, the look on his face as it was was bad enough.<br>\r\n<br>\r\n\"I should have known it might come to this,\" he finally said, his voice quiet but filled with unbridled rage.  \"I should have known that allowing you two to both have access to this might end badly.  Now look at you, scrambling around in the dirt like rabid wolves fighting over a field mouse.  You two should both be ashamed of yourselves.\"<br>\r\n<br>\r\nThe boys slowly picked themselves up, hanging their heads in shame and feeling a lot smaller than they actually were.<br>\r\n<br>\r\n\"I honestly thought you might prove me wrong.  I had hoped that you would beat this terrible addiction, that you two might figure this out for yourselves.  And yet, here you are, so consumed with your desire to outdo the other that you're willing to risk everything just to show the other up, like pathetic children.\"<br>\r\n<br>\r\n\"He started it,\" Marcus grumbled.<br>\r\n<br>\r\n\"You're the one who started double dosing,\" Li retorted.<br>\r\n<br>\r\n\"Well you're the one who started triple dosing.\"<br>\r\n<br>\r\n\"Well you're the one who put three weeks worth into a single drink and threatened to drink it right in front of me!\"<br>\r\n<br>\r\n\"So did you once I'd told you!  And what about that rash on your arm!\"<br>\r\n<br>\r\n\"You've got the same rash on your leg!\"<br>\r\n<br>\r\n\"Enough!\"<br>\r\n<br>\r\nThe two had been approaching each other during their exchange, and had nearly come to blows again.  But Mr. Fushigo's commanding tone would garner no more fighting between the boys.  At his outburst, they separated again, resuming their ashamed stances.<br>\r\n<br>\r\n\"Come, there is something you two need to see.\"<br>\r\n<br>\r\nMr. Fushigo stepped into his store, waiting for the two of them to squeeze their enlarged frames through after him before leading them to the door to the back.  Behind it, they found various boxes and barrels of the same stuff being sold out front, as well as supplies to package and sort out stock meant to be sold in smaller quantities.  But the shopkeeper ignored all of these as he led them to another door, this one opening...</span></div></div>",
            "created":1586107620,
            "id":2813655,
            "title":"Dressing Down"
        },
        "13422121121222112112":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "They both agree to stop using the root powder.",
                "One or both of them insist on still using it."
            ],
            "content":"<div class=\"\"><div> <span>The second door led the three out into the yard behind the store, and its centerpiece immediately caught the two boys' attention.<br>\r\n<br>\r\nIt was a tree, no more than twelve or so feet tall, with thin twisted branches and a wrinkled trunk.  It's leaves were a dark dull green, and its bark an ashy gray.  And the clump of earth it was growing out of was propped up above the ground by thick bamboo poles, exposing the pale roots that were growing right out of it, which had clearly been cut off recently.<br>\r\n<br>\r\n\"Do you know what that is, boys?\" Mr. Fushigo asked them.<br>\r\n<br>\r\nMarcus shrugged, shaking his head.  Turning to look at Li, he saw the same confusion on his face as he did the same.<br>\r\n<br>\r\n\"That is the Niuqu Siwang Tree, the Warping Death.  Because its life begins with another's death.<br>\r\n<br>\r\n\"The Niuqu Siwang does not bear fruit or nuts or spread pollen or seeds to reproduce.  Rather, its roots infect whatever plantlife they encounter and consume them from the inside, transforming them into another of their own kind.<br>\r\n<br>\r\n\"But they don't just affect plants.  Any creature that eats the roots can become addicted if enough is consumed.  They will keep eating more and more of the roots, slowly overwhelming their bodies with the tree's essence, which eventually will take hold and begin to grow within them, transforming them into trees as well.<br>\r\n<br>\r\n\"Those rashes you've been getting are the first stage of the transformation.  It is excess essence from the root building up in your bodies with nowhere to go.  The amount I told you to take was the largest you could consume without being affected, and I have always tried to limit how much any individual was able to get.<br>\r\n<br>\r\n\"But you two have been taken captive by the false promises of a force that only sees you as raw materials to further its own spread.  If you continue down this path, you will both be consumed by the tree, just as you have already been consumed by this senseless rivalry.  Let it continue, and it will be your doom.<br>\r\n<br>\r\n\"But end this now, and you can still be safe.  Without consuming more of the root, your bodies will be able to process the excess amount of essence, allowing the rashes to fade as the last of it is processed into your growth.<br>\r\n<br>\r\n\"The choice is yours.\"<br>\r\n<br>\r\nThe shopkeeper's tale ended, Marcus turned to look at Li, who met his gaze.</span></div></div>",
            "created":1586408760,
            "id":2815921,
            "title":"The Terrible Truth"
        },
        "134221211212221121121":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "choices":[
                "There's yet more drama for this pair of boys.",
                "Forget the drama, let's just skip to the happy ending."
            ],
            "content":"<div class=\"\"><div> <span>Marcus looked over at Li, his horror apparent on his face.  Li's too was contorted with fear as their eyes met, and a hint of guilt to match his own appeared there.  In that moment, Marcus knew that they were both thinking the same thing.<br>\r\n<br>\r\nThis needed to end now.<br>\r\n<br>\r\n\"I'm sorry, Mr. Fushigo,\" he finally whispered, too ashamed to speak any louder.  \"I'm sorry I let this get so out of hand.  I'm sorry for being so callous and disrespectful.  I'm sorry for taking advantage of your granddaughter's trust.  I...I know I don't deserve your forgiveness, but I humbly ask for it.\"<br>\r\n<br>\r\nMarcus bowed his head as Li gave his own apology.  Once he was done, the two of them stood in silence, waiting for Mr. Fushigo's response.<br>\r\n<br>\r\nFinally, he spoke.<br>\r\n<br>\r\n\"You are forgiven.\"<br>\r\n<br>\r\nThe weight in Marcus' stomach seemed to lift almost immediately.  He couldn't help but beam a little as he looked up to meet Mr. Fushigo's gaze, which for once wasn't piercing or critical, but simply calm and contemplative.  Turning to Li again, he saw the same relief reflected in his face.<br>\r\n<br>\r\n\"But I'm afraid you are not quite out of the woods yet,\" Mr. Fushigo's words cut through their relief.  \"After ingesting so much in so short a time, your body has become addicted to the substance.  And as with all such biological imbalances, your withdrawal from it will be arduous.<br>\r\n<br>\r\n\"However, you are not the first I have known to become so consumed by this.  I can help you through the process of withdrawal.  Come back inside and I will make the arrangements.  My partner is a doctor.  He will be able to cover for us so that you can work this out in privacy.  He will notify your families and instructors so that you may stay with us until it passes.\"<br>\r\n<br>\r\nThe old shopkeeper led them back into the store.  As they stood waiting in the storeroom as he called his partner, Marcus turned to Li.<br>\r\n<br>\r\n\"Hey, man, I'm sorry.  I never should have let this happen.  I should have just left it alone.  I don't have to be the biggest.  I should have just been happy for you.\"<br>\r\n<br>\r\nLi didn't respond at first.  But after a few moments, he spoke up.<br>\r\n<br>\r\n\"You know, if you hadn't been jealous, then I would have probably just kept growing and growing.  And then even you would be so small compared to me that I'd still feel alone, even if we had become friends.  But because all of this happened, I'm not alone.  Sure, I'm not exactly in a very good position right now, what with all...this.  But...at least I have you here to keep me company.  At least...I'm not alone.  And really, that's all I've ever really wanted.\"<br>\r\n<br>\r\nMarcus' eyes were beginning to water.  \"You know, before we had that fight, I had actually...I had been really liking our friendship.  I mean, we were both lying to each other, but...but we were also kind of close to each other.  Like, more than just friends.  Like...\"<br>\r\n<br>\r\n\"...like brothers?\"<br>\r\n<br>\r\nMarcus met Li's eyes, and there was a distinct hint of hope and affection mingling in his dark pupils.<br>\r\n<br>\r\n\"Yeah, like brothers.\"<br>\r\n<br>\r\nMarcus offered his hand to shake.  Li hesitated, then gently pushed it aside before going in for a hug.  And after a brief moment of surprise, Marcus returned the gesture.<br>\r\n<br>\r\nThey held their embrace for a few moments before breaking away, a light blush in their cheeks but a friendly smile clearly displayed.<br>\r\n<br>\r\n\"Hey,\" Li suddenly piped up, \"you know how he said that this excess root stuff's gotta process through us before it all gets flushed out.\"<br>\r\n<br>\r\n\"Yeah?\"<br>\r\n<br>\r\n\"Did that sound like we'd probably grow a little more before we're done to you?\"<br>\r\n<br>\r\nMarcus paused.  He hadn't considered that.  But now that Li brought it up...<br>\r\n<br>\r\n\"It's possible.  If it's true, how much more do you think we'll grow?\"<br>\r\n<br>\r\n\"I don't know.  How much more would you like to grow?\"<br>\r\n<br>\r\n\"Well, we're already seven-foot-nine, assuming I measured correctly this morning, and that's already pretty tall.  But then, the tallest guy in the world right now is that Sultan guy from Turkey, and he's eight-foot-two.  And while that seemed pretty unattainable a few months ago, now...\"<br>\r\n<br>\r\nThe two shared a look, an odd sort of shared thought passing between them.<br>\r\n<br>\r\n\"Do you really think that's possible, or even a good idea?\" Li asked him, though his tone was not nearly as concerned as his words suggested.<br>\r\n<br>\r\n\"Well, I used to think I couldn't get to seven-foot-nine, and yet,\" he gestured to himself, earning a quick chuckle from Li, \"clearly I was wrong.  Whose to say I'm not wrong about that too?\"<br>\r\n<br>\r\n\"I guess we'll just have to wait and see,\" Li replied.  And the two shared a mischievous chortle.</span></div></div>",
            "created":1586461560,
            "id":2816262,
            "title":"Reparations and Ruminations"
        },
        "1342212112122211211212":{
            "author_id":"dacedu23",
            "author_name":"BigDudeDeluxe",
            "content":"<div class=\"\"><div> <span>Going through withdrawal was not fun, to say the least.<br>\r\n<br>\r\nThere were times where Marcus was feeling perfectly fine, no problem whatsoever.  And yet five minutes later he could be either crying his eyes out from overwhelming sorrow, angry enough to smash anything nearby that was breakable, or even desperate enough for more of the root that only Li, with his equal size and strength, was able to stop him from storming back to the shop to get it.  And if he wasn't having a bad moment, Li probably was, requiring him to intervene on his behalf.<br>\r\n<br>\r\nAnd that didn't even cover the pain his body was being racked with.  Apparently his body had become so used to the growth caused by the root that it was continuing to try and keep growing.  But without the root powering and catalyzing it, his body was practically cannibalizing itself to keep up with its own demand.<br>\r\n<br>\r\nThe only thing that kept it at least at a manageable level was the more than significant amount of food he and Li were now consuming on a daily basis.  And if they intended to return to playing basketball once it was over, they'd have to continue on this augmented menu just to keep up with their expanded bodies' needs.<br>\r\n<br>\r\nAs to that, Dr. Fushigo, Mr. Fushigo's husband, spent a great deal of time helping them understand what their new sizes would entail and what health issues they may be facing in the future.  While most who recovered from addiction usually went on to lead normal healthy lives, despite their enhanced size, Dr. Fushigo explained that, based on his projections, they might be the two tallest former root consumers he'd ever encountered.  Which meant that the two would have to be carefully monitored, as they would be spending their lives pushing the limits of human biology.<br>\r\n<br>\r\nBut the necessary three weeks to get through the worst of the withdrawal symptoms came and went without too much trouble, and the two boys returned to their lives symptom and rash free to try and live as normally as possible.<br>\r\n<br>\r\nThis of course was somewhat hampered by their new extreme heights.  Even after the withdrawal symptoms faded, they continued to creep ever higher, though at least it had slowed to a crawl.  But that didn't stop the fact that they were now both over eight feet tall.  Fitting into anything, clothes, cars, even houses, had suddenly become so much more difficult.  Both boys had had to ask their parents to custom order clothes for them to fit their new sizes.  It took telling Marcus' parents the truth about what had been going on to convince them to acquiesce.  But at least they were understanding, mostly.<br>\r\n<br>\r\nIn the end, the two families actually became rather close, especially after one weekly checkup with Dr. Fushigo showed that the two had officially surpassed Sultan Kosen as the world's tallest living men by a fraction of an inch.  The shocking news took them all by surprise.  But the idea of getting into the record books was quite alluring, and a claim was put in with the people from Guinness to confirm it.<br>\r\n<br>\r\nThe official measuring ceremony took place a week after Dr. Fushigo declared them fully recovered from their withdrawal, so noted as being the first week to show them not having grown any taller.<br>\r\n<br>\r\nIn order to accommodate the crowds that inevitably gathered to see them, the event was hosted by the school, which had already been boasting about the boys' incredible heights and how they might lead their team to a championship title.  Of course, their inclusion on the team was considered rather controversial, given their nearly insurmountable advantage.  But Coach had managed to strike a balance between giving them game time and still allowing their opposing teams a fighting chance.<br>\r\n<br>\r\nOn the day of, everyone showed up to see their boys being judged.  The officials had brought along an official stadiometer to make the final determination.  And after several tense minutes as they carefully checked and rechecked both boys, it was officially declared.<br>\r\n<br>\r\nMarcus Boggs and Li Nguyen, Tied for Tallest Living Person, With a height of 8 Feet 4 Inches each.<br>\r\n<br>\r\nWhile the notoriety and fame were quite nice, Marcus was also grateful that it wasn't as overwhelming as it would be were he an actual celebrity and not just a notable individual.  After his experience of throwing caution to the wind for the sake of his own ego and getting bit quite soundly on the butt by it, he was just happy to be alive and healthy.  Sure, it was nice to be appreciated and admired, but Marcus felt more and more like those were things the old him would have wanted.  Not so much the new him.<br>\r\n<br>\r\nWhat he did want was to keep spending time with Li, his little brother in all but name.  The two were practically inseparable, and their families' new plan would mean even more time together.<br>\r\n<br>\r\nAfter seeing just how much the boys were struggling with the proportions of normal everyday things, the two sets of parents had gotten together to commission a new house to be built on an unused lot in the Nguyen's neighborhood for the six of them to share.  It took several weeks just to get the plans finalized, as they had to vertically scale up many of the amenities to fit their giant sons.  But by the time June and Marcus' graduation came around, the house was complete, and there was at least one building where the boys didn't have to worry about ducking through tiny doorways.<br>\r\n<br>\r\nBut the thrill of this new home failed to make up for the unfortunate truth that Marcus was graduating high school and would be heading off to college in the fall to study Pre-Med.<br>\r\n<br>\r\n\"I just figured that I'm going to probably need to know all this stuff for the two of us,\" Marcus explained to Li a few weeks into summer as they lay on the ground in their shared backyard watching the stars.  \"And if I can use that to help other people as well, then that's just icing on the cake.\"<br>\r\n<br>\r\n\"I know, and I'm really proud of you.  I just...I just kinda wish you were staying here, with me.  I know, it's selfish.\"<br>\r\n<br>\r\n\"Nah, bro, I get it.  It's gonna be hard being away from you after everything we've been through together.  No one else can really understand what I've been through or how I feel, you know?\"<br>\r\n<br>\r\n\"Yeah.\"<br>\r\n<br>\r\n\"But it's not like you'll be alone.  You'll still have all your classmates.  Granted a fair number of them are just hanging on for the notoriety, but what about Niel and Sky.  And Abby.\"<br>\r\n<br>\r\nLi's face instantly went red at that, and he elbowed Marcus for bringing up his crush.  Marcus just cackled.<br>\r\n<br>\r\n\"And it's not like I'll be gone forever.  You'll be able to come and visit, and I'll definitely be coming home pretty regularly.  And we can still call or video chat or whatever.\"<br>\r\n<br>\r\n\"I know, I know.  It just...it won't be the same.  After you leave, everything's going to change.\"<br>\r\n<br>\r\nMarcus turned to look at Li.  \"Life is change, bro.  Everything's changing all the time.  But just because it's changing doesn't mean it's going away.  It's just going to be different.  And that's true for us too.  You and I aren't the same guys we were a year ago, or even who we were yesterday.  And we'll be different people tomorrow.<br>\r\n<br>\r\n\"Just as long as we keep trying to be good people, everything else will work out in the end.\"<br>\r\n<br>\r\nLi turned to meet his gaze, a small smile on his face.  \"Thanks, bro.\"<br>\r\n<br>\r\nMarcus returned the smile before scooting a little closer so he could wrap his arm around his shoulder.  \"Besides, no matter what happens, I'll always love you.\"<br>\r\n<br>\r\nLi's smile widened at that, and he reached up to pat Marcus' hand on his shoulder.  \"Love you too.\"<br>\r\n<br>\r\nIt was true that their lives would always be complicated, and life would always be unpredictable.  But in the end, so long as they had each other, nothing could ever truly bring them down.  Theirs was a hard won bond, forged in the bitterest of battles, and coming out all the stronger for it.  For in their battle to be the biggest, victory had come not from defeating each other, but rather winning each other over.  After all, the best way to truly defeat an enemy was to make them your friend.<br>\r\n<br>\r\nOr better yet, your brother.</span></div></div>",
            "created":1586483340,
            "id":2816419,
            "title":"Epilogue:  Battle Bonded Brothers"
        },
        "14":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Alec grows taller as planned.",
                "The spell back fires! Eli grows taller instead!",
                "Alec grows taller...but doesn't stop!",
                "Calvin and Vincent start growing instead!",
                "All four boys begin to grow!"
            ],
            "content":"<div class=\"\"><div> <span>Molward Academy. The finest institution for boys wishing to learn the magic arts. Only the best and the brightest are allowed in, showing proficiency in at least four areas of study. Tuition is quite high, though for the rich boys that apply, money is hardly an issue. The academy itself is a massive, sprawling campus filled with ancient stone buildings, enormous gardens, and a spacious view of the mountains. For those lucky few who were accepted, they would embark on a journey of learning that would prepare them for an exciting career in a burgeoning field that few were privileged enough to learn.<br>\r\n<br>\r\nIn a nutshell, that was what the boys applying for Molward were told. Getting into Molward was all but impossible for anyone outside of the higher class. Money wasn't the only problem. Magic is a relatively new branch of learning, thought for centuries to be nothing more than tricks and sleight of hand, true magic artifacts had been found, among them the Veneficus Libri, a master book of magic containing all known spells, potions, charms, and other forms of magic. With this book, a whole new branch of study was begun. Due to the dangerous and powerful nature of magic, however, only a select few were being taught it. If you weren't from one of the best high schools in the country you wouldn't even be able to so much as look at a lesser book of magic. If you weren't allowed to study, there was no way you'd be able to score high enough on any off the tests to get into Molward.<br>\r\n<br>\r\nHowever, our story isn't about Molward's history or about the world at large. Rather, it's about a small group of four boys, roommates as fate would have it, who are about to change the destiny of the very world they live upon.<br>\r\n<br>\r\n\"I. Hate. Charms.\" Calvin said as he threw his backpack carelessly into the corner before collapsing on the couch.<br>\r\n<br>\r\nEli looked up from his book and said, \"I told you to study harder for the test you know. This is what you get for just lazing around all day.\"<br>\r\n<br>\r\n\"Eli, have a heart! I wasn't lazing around! I was...observing the rugby team.\" Calvin said, grinning slightly as he looked over at Eli.<br>\r\n<br>\r\nEli pushed his glasses up and sighed. \"Must be nice not having to worry about getting passing grades...Some of us have scholarships to maintain.\"<br>\r\n<br>\r\nCalvin turned over on the couch and said, \"Yeah, you're the first guy to ever come to this school who wasn't rich! You must really want to learn magic.\"<br>\r\n<br>\r\n\"Well...yeah!\" Eli said, closing his book and setting it aside. \"Magicians are paid huge amounts of money for their work! My family needs all the money it can get right now...\"<br>\r\n<br>\r\nEli drooped as he stared pensively at the table, picking at it slightly. He seemed so out of place amongst the lavish dorm room. It was furnished with a living room, a kitchen, a dining room, and a huge bathroom, though it came at the cost of a single bedroom, shared between four boys. None of the boys minded at all. They had all gotten to know each other within the week and had become fast friends, though they were all completely different. Eli was small, quiet, and studious. His hair was brown and somewhat shaggy, always in a state of disarray from staying up until all hours of the night studying. He had large round, thin framed glasses, hiding his strangely grey eyes, that always tended to droop down to the end of his nose, looking entirely too big for his face. His uniform was shabby and patched, not to mention three sizes too big for his small, frail body. He had had to roll up the sleeves of his shirt and pants several times just to be able to use his hands! Everything about him was weak and runty but he was the nicest guy you could hope to meet.<br>\r\n<br>\r\nCalvin, by contrast, was tall and athletic. His uniform was immaculate and his blonde hair was short and orderly, the bangs hanging just slightly over his stunning blue eyes. He came from a particularly wealthy family and had never had to work hard a single day in his life and because of this he was quite lazy and completely laid back. He also had a certain...taste for bigger, stronger men and would spend all the time he could watching the various sports teams practice on the fields. He was never coy about his likes and wore his heart on his sleeve. If anyone teased him or mocked him his whole demeanor would change, taking on an air of authority, usually intimidating the coward who taunted him completely. Of course, when he couldn't, he could always rely on Vincent to help.<br>\r\n<br>\r\nVincent was the biggest of the four, standing at near seven feet tall with a near body builders build, his clothes always seemed to be far too tight, accentuating every bulging curve of his body. He wasn't as smart as the others but he made up for it in sheer determination, often studying with Eli to keep his grades up. His nature was gentle despite his size and he always tried to help people when they needed it. When they had first met Calvin had flirted with him endlessly but Vincent never really caught on to Calvin's interest and the blonde had quickly given up hope, settling for admiring from afar. Vincent's hair was black and incredibly short, spiking slightly in the front. His eyes were a bright green and a smile was almost always on his face. When he wasn't hanging out with Eli to study or when the boys were not all hanging out together, Vincent spent a lot of time with Alec.<br>\r\n<br>\r\nAlec was taller than Eli, though only by a foot, putting him at the second smallest in the group, but he had more confidence packed inside him than the rest of the school combined. His hair was a flaming red while his eyes were a dark brown. He always seemed to be grinning, was always up for a challenge, and never backed down from anyone or anything. He had a small splash of freckles across his nose and cheeks, and his body was severely bulky, the size of his muscles attempting to make up for his lack of height. Alec was a bit of a loudmouth and cocky to the extreme, not to mention incredibly competitive, but he also had a fierce loyalty towards his friends, always defending them...except for when he was playfully playing tricks on them or showing off. Eli had many stories about how he had been innocently studying, only to be suddenly dragged out of his seat an into the air, Alex bench pressing him over his head like he weighed nothing.<br>\r\n<br>\r\nCalvin was about to speak some words of encouragement, though he wasn't very good at it and always got uncomfortable when Eli mentioned his poorer roots, feeling guilty even though it wasn't his fault Eli didn't have much money, when the door suddenly banged open and Alec walked in, Vincent ducking down and squeezing in after him. Calvin leaped up and said, \"Vincent! There you are!\"<br>\r\n<br>\r\nHe ran forward and hugged his bigger friend, Vincent giving him a tight bear hug right back, a smile on his face. \"You're always so happy to see me Calvin. It's like coming home to a puppy!\"<br>\r\n<br>\r\nCalvin winked and said, \"You bring out the best in me big guy.\"<br>\r\n<br>\r\nAlec rolled his eyes and sat down at the table, opposite Eli. \"Hey, Eli, you're smart right? Take a look at this!\"<br>\r\n<br>\r\nHe tossed a huge leather bound book onto the table, sending several of Eli's notes flying to the floor. Eli sighed and pulled the book closer. The sooner he looked at this, the sooner he could get back to studying. His eyes widened as he read the title. \"Alec...where did you get this?\"<br>\r\n<br>\r\n\"Found it in the library and nicked it when no one was looking!\" He said with a grin. \"That old librarian never lets me check out anything cool so I didn't even bother to try this time. What is it?\"<br>\r\n<br>\r\n\"This...is a really, really rare book of spells!\" Eli said, opening it up and turning the pages carefully. \"It's second only to the Veneficus Libri!\"<br>\r\n<br>\r\n\"Woah...you'd think they'd keep that under glass or something.\" Alec said, shrugging. \"What sort of spells are in there?\"<br>\r\n<br>\r\n\"Well, it has almost anything you can think of! Spells of invisibility, of transformation, charms, potions, spells to change the body, spells to--\"<br>\r\n<br>\r\n\"Wait a minute! Change the body? What do you mean by that?\" Alec asked, jumping up and rushing over to Eli's side of the table to look at the book.<br>\r\n<br>\r\n\"Um...spells to change the body. Improve strength, increase height, change features, things like that.\" Eli said warily.<br>\r\n<br>\r\nAlec grinned and said, \"Oh man! That's awesome! Hey! Use one to make me taller! You're good at spells!\"<br>\r\n<br>\r\n\"I don't know...it could be dangerous!\" Eli protested.<br>\r\n<br>\r\n\"Come on! What's the worst that could happen?\" Alec pushed. Calvin and Vincent, hearing this discussion, walked over.<br>\r\n<br>\r\n\"Give it a try Eli. At worst you could end up making Alec explode and then at least he'd be quiet.\" Calvin teased.<br>\r\n<br>\r\nAlec chose to ignore that statement, for now, and said, \"Come on Eli! Go for it!\"<br>\r\n<br>\r\nEli sighed and turned a few more pages, finding the spell to increase height. \"Okay...I'll try! But don't be mad at me if something goes wrong!\"<br>\r\n<br>\r\nHe read the spell, holding his hand up, energy gathering into the palm of his hand. When the spell was done the energy discharged, sending sparkles over the four men. They waited...nothing seemed to happen. Just when Alec was about to demand Eli try again, something began to change!</span></div></div>",
            "created":1335762000,
            "id":1326100,
            "title":"In Which we Meet our Heroes"
        },
        "141":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "The spell causes Eli to grow bigger. Maybe getting a sample will change his mind",
                "The spell grows Alec even bigger than before! Is he too big to be stopped?",
                "A new spell changes something else about Alec and/or the other boys."
            ],
            "content":"<div class=\"\"><div> <span>The three other boys stared at Alec, waiting for something -- anything -- to happen to him. <br>\r\n<br>\r\n\"Is it working?\" Calvin asked, scrunching his nose as he tilted his head to the side. \"Is he any bigger?\"<br>\r\n<br>\r\n\"Well,\" Vincent put his hand to his chin as he studied Alec closely, \"maybe an inch or -- nah, I don't think he's changed at--\"<br>\r\n<br>\r\nHe stopped and all four boys gasped as a bright iridescent light started to radiate from Alec's body. Eli and Vincent both winced a little, shielding their eyes with their hands, but Calvin's eyes only went wider. \"Awesome!\" he exclaimed. \"What's it feel like, Alec?\"<br>\r\n<br>\r\nAlec couldn't answer, either unwilling or unable to talk while his body was being affected by the spell. His eyes had closed as soon as the light had started, and, strangely enough, his hair seemed to stand on its end. As the light continued to shine, he began to grow taller, more and more of him coming into existence, his muscled chest filling out his black polo and causing it to start to tear a little at the seams. His jeans were becoming more skin tight as he inched upward, and the bottom of his shirt could no longer completely cover his stomach, revealing a set of washboard abs with a thin trail of striking red hair running from his navel down towards his crotch. <br>\r\n<br>\r\nAfter about thirty seconds, the light \tquickly dissipated, and Alec's growth halted, leaving him a hair taller than Vincent at just over seven feet. His clothes had definitely seen better days but were still straining to stay on his large, powerful frame. He opened his eyes, first looking out at his stunned, speechless roommates, then down at his body, marveling at his new size. A smile slowly crept across his lips, and he began to chuckle.<br>\r\n<br>\r\n\"Wow,\" he said, shaking his head in delight, \"I've gotta hand it to you, Eli, you sure know how to cast a spell.\"<br>\r\n<br>\r\n\"I'll say!\" Calvin chimed in, grinning even more than Alec, and he let out a whistle. \"You look fuckin' fantastic!\"<br>\r\n<br>\r\n\"Interesting,\" Vincent said, impressed but not as excited as the other two. \"I guess I now have some competition for the biggest guy in the room.\"<br>\r\n<br>\r\nThe only one of the three who didn't seem to be happy with the spell's effects was the one who had cast it. \"I don't know, guys,\" Eli said as he wiped sweat from his brow. \"This doesn't seem right. I need to change you back, Alec.\"<br>\r\n<br>\r\n\"Are you kidding?!\" The protest came simultaneously from both Alec and Calvin, but Alec was the one who continued, \"C'mon, Eli, don't you think this is incredible? Besides, what's the harm in having a little fun?\"<br>\r\n<br>\r\n\"We could get in trouble, for starters,\" Eli responded. \"Dean Corinth finds out that we've stolen a priceless book from the library and used spells way beyond our level, and he'll expel us from the university.\"<br>\r\n<br>\r\nAlec rolled his eyes. \"Eli, why do you always have to be so worst-case-scenario about everything?\" He gave Eli a friendly slug on the shoulder that hit a little too hard, not yet used to his increased strength. \"Besides, how will the Dean find out?\"<br>\r\n<br>\r\nRubbing the new bruise on his bicep, Eli frowned up at Alec through the hair that had fallen into his eyes again. \"Some of us have to be careful, you know. If I get kicked out, I don't have 'Mommy' and 'Daddy' to fall back on and support me. And I think word of one of his students suddenly growing a foot taller is the kinda thing that'll find its way to the Dean pretty quickly.\"<br>\r\n<br>\r\nAt this, Vincent's brow furrowed. \"He's right, Alec,\" he said, his voice sounding even deeper than usual. \"It's not like this is a subtle change.\"<br>\r\n<br>\r\nAlec sighed, shaking his head. \"Fine, fine, we can be careful about using it. I'll let you change me back… after we try a few more spells.\"<br>\r\n<br>\r\n\"No!\" Slamming the spell book shut, Eli jumped up out of his chair, knocking it to the floor in the process. The three other boys were taken aback slightly by the unexpected and uncharacteristic force that the usually mousey boy suddenly displayed. Walking over to Alec, the spell book in hand, Eli glared up at him, doing his best to look determined and insistent, a task that was all the more difficult by the fact that he was currently eye-level with Alec's pecs. \"I'm changing you back now, and then I'm going to take this book back to the library and making sure none of us can ever find it again!\"<br>\r\n<br>\r\nA tense silence filled the room. Calvin glanced at Vincent, then at Eli, then up to Alec, unsure of what to think of all this. \"C'mon, guys,\" he finally said, his voice cracking slightly, \"can't we find a way to work this out somehow?\"<br>\r\n<br>\r\n\"Sure,\" Alec said, as he reached in and quickly grabbed the book from Eli, who tried to hold on with all his might but was easily outmatched by the bigger, stronger boy. \"Eli, I know you'll come around sooner or later, and see that keeping this book will be the best thing that's ever happened to you or any of us. In fact,\" he said, as he started flipping through to the pages and finding the section that Eli had read from a few minutes ago, \"I think I've found just the thing.\"<br>\r\n<br>\r\n\"Alec, No!\" Eli cried out, trying to grab the book back, but it was too late, as Alec had already read a new spell aloud.</span></div></div>",
            "created":1335848400,
            "id":1327493,
            "title":"Opening The Can of Worms"
        },
        "1411":{
            "author_id":"jamesfoxes",
            "author_name":"JamesFoxes",
            "choices":[
                "Eli is nervous, but can't deny this is a dream come true.",
                "New development makes Eli want more, and he'll take what he wants!",
                "Eli wants to take \"revenge\" at the other boys, and takes the book back."
            ],
            "content":"<div class=\"\"><div> <span>Pointing a hand out at Eli the way he had seen Eli perform his former spell, Alec clumsily finished the final words from the text. <br>\r\n<br>\r\n“What did you do?!” Eli chimed up from over the lip of the books leathery edge. “Nothing that you don’t sorely need, little guy. A bit of good luck!” Alec’s words only just managed to sink in before Eli started to tremble, and the magical incandescent display began to flow back into the room. This time no one shielded their eyes – not wanting to miss a moment of what was about to happen!<br>\r\n<br>\r\nEli began to moan softly and with one quick jump, his head bumped into the book knocking it out of Alec’s hands. “Argh!” Alec stepped back from the sudden growth spurt and looked wonderingly down at Eli’s still rather small form. The small boy, only having gained a foot in height and now up to Alec’s former size, opened his eyes and looked around the room. Everything looked so much more natural at this height: “Hey, you know, maybe this isn’t so bad after all!” Eli smiled broadly, happy that Alec at least didn’t overdo it as he had feared; maybe he had been wrong to mistrust his otherwise cocky friend.<br>\r\n<br>\r\n“This isn’t that bad at all..” Eli admitted with a slight grin “Although, I can pass this off as a long deserved growth spurt, YOU can’t!” Eli pointed a finger up at the still towering Alec “and, I still thiii- ohmygod! “ Eli was cut short as a flowing pleasurable sensation washed through his body, making him nearly fall backwards. Three sets of eyes widened in wonder as Eli once more grew before the group. Slowly his body surged up against Alec’s, their chests pushing in together and Eli’s eyes soon met Alec’s before slowly climbing higher. <br>\r\n<br>\r\nStruggling to contain Eli’s growing body, his clothes was stretching and tearing in a long ominous choir of popping strands, soon making his trousers snap fully off his silky boyish thighs and exposing his colourful superman boxers to the group.<br>\r\n<br>\r\n“That’s one huge S!” Vincent whistled  and nudged an elbow at Alec, who was still frozen in place. Or he would be if it wasn’t for Eli’s swelling body pushing him slowly backwards. Eli gasped and threw his hands In front of his bulging groin to save some dignity at least for a little while longer. He found his palms pressing oddly against his nethers, <i>they shouldn’t do that this far from his pelvis!</i> He looked down and blushed deeply at what he saw. <br>\r\n<br>\r\nHis still slowly ongoing growth spurt had transformed his usually loose boxers into a skin tight speedo wrapped like cling-film around three impressive spheres. His young package had ballooned out into something that would look more appropriate on a horse, and wasn’t even close to being covered by his hands! “Are you sure you read the right spell, Alec? Please please PLEASE tell me that you remember which one!” Calvin grinned stupidly as he looked up and down over Eli’s expanding young body.<br>\r\n<br>\r\nEli inhaled deeply, which broke off the rest of his white school uniform; the broken piece of clothing fluttering down over Alec’s face who was too shocked by the now 10 foot boy in front of him to care about it, making both Calvin and Vincent giggle at what looked like a Halloween ghost who outgrew his sheet. <br>\r\n<br>\r\nEli’s boxer-speedo had finally started to give in to the mounting pressure inside the tight clothing, and a long rip ran along the stretched surface, beginning to expose his barely hidden flesh. Calvin was entranced by this development and reached out a hand to run it along Eli’s hips, drawing a gasp from Eli above and groan from the speedo below. And as Eli was preparing to run out of the room from pure embarrassment, his growth ended, making his head bump against the high ceiling. <br>\r\n<br>\r\nThere was a moment of shared silence in the room except for the groan of floorboards and random pop of a fabric strand following every movement Eli made. Alec, Calvin, and Vincent stepped back slowly and from Eli’s new perspective, they all looked like small toddlers; Alec who was now the second biggest of the group only came up to Eli’s ribcage. <br>\r\n<br>\r\nAll of them, Alec especially, was curious to see what Eli’s reaction would be. <br>\r\n<br>\r\n“So… What do you think, Eli?”</span></div></div>",
            "created":1336885200,
            "id":1336356,
            "title":"What you don't want to miss"
        },
        "15":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "A pair of couples",
                "Open",
                "open"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's some more stories and space for your own!<br>\r\n</span></div></span></div>",
            "created":1322802000,
            "id":1233001,
            "title":"More Options!"
        },
        "151":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Yes",
                "No!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We have here Amanda and Stacy, Pete and Chuck. Two very competitive couples who engage in a battle of growth between the sexes. They can be bodybuilders or gluttons attempting to get fatter than the other. Who will win? </span></div></span></div>",
            "created":1373691600,
            "id":1627210,
            "title":"Open"
        },
        "1511":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Chuck, a new neighbour who is as big & strong as Pete",
                "Chuck, a new neighbour who bigger & stronger than Pete",
                "Chuck, a new neighbour who is almost as big & strong as Pete"
            ],
            "content":"<div class=\"\"><div> <span>Amanda, a woman who was use to getting her own way, sat on the chair, admiring her man Pete, as he flexed for her from across the room. From his thick neck to his broad shoulders to his barrel chest, there was no twenty year old that turned her on more &amp; he knew it. Pete loved his Amanda and meant to keep her which was easy as few men could compete with him for size &amp; strength which was the basis of Amanda's lust for him. Yes, a flex of Pete's biceps was all it took to keep Amanda's attention for him.<br>\r\n<br>\r\nWait, Amanda was not looking at him. Instead, she seemed to be looking intently out the window of their apartment. Who was she looking at so intently? Pete moved to see.</span></div></div>",
            "created":1373691600,
            "id":1627360,
            "title":"Yes"
        },
        "15111":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Chuck and Stacy",
                "Chuck alone"
            ],
            "content":"<div class=\"\"><div> <span>Pete could see Chuck was about the same size as him and was even lifting the same amount of weight but it seemed easier for him. After watching a few more minutes and counting in his head, it looked like he could do more reps too! Was it possible that this new guy was even stronger than he was? Pete saw the way Amanda stared and jealousy soon overtook him. \"You think he's hot? Fine then, Come on!\"<br>\r\nAmanda and and Pete left the apartment and went to Chuck's place, where they found...<br>\r\n   </span></div></div>",
            "created":1394686800,
            "id":1759924,
            "title":"Chuck, a new neighbour who is as big & strong a..."
        },
        "15112":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Announced she was leaving him for Chuck .",
                "Randomly announced her desire to bulk up and help Pete beat Chuck as well."
            ],
            "content":"<div class=\"\"><div> <span>Pete was shocked to see that Chuck was uber massive with thirty-five inch arms, a fifty-eight inch chest, twenty six inch calves and thighs, and a chiseled eight pack in contrast to Pete's big gut. Pete was furious as he was used to being the bigger,stronger, more domineering guy. No one should have been bigger than him! He also knew Amanda had originally picked him because he was biggest and strongest so what would she do now? She turned to him and...<br>\r\n</span></div></div>",
            "created":1374123600,
            "id":1629903,
            "title":"Chuck, a new neighbour who bigger & stronger th..."
        },
        "15113":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Kissed him",
                "Said she was taking a survey."
            ],
            "content":"<div class=\"\"><div> <span>Pet's living room was primarily filled with a weight bench looked out on the apartment courtyard and Amanda's seat while providing a good view of the massive Pete while he preened and lifted for her admiration also was directly opposite the window of another apartment belonging to Chuck Hammond.  Chuck had been a star quarterback in college at 205 pounds of lean muscle but now that he was finished with football and didn't need to be fast and flexible he had decided to add some more muscle.  Amanda could see the sweaty jock working his weights behind big Pete and she was taken by the differences.  She, of course, didn't know Chuck's name but she could see that he was better looking than Pete and that he had muscles without Pete's tank of a ball belly.  He was big and Amanda liked big when they were muscles.  Pete had been her ideal 3 months ago but now he seemed to be fixated on getting bigger even if it meant a belly.<br>\r\nThe guy in the window still had abs, not a tank like Pete.<br>\r\nShe stood up and called out to Pete.<br>\r\n\"I need to go.\"<br>\r\nPete grunted and heaved.  \"Call me.\"<br>\r\nAmanda left and  went to Chuck's apartment.  She had to meet this hot guy.  She knocked and a moment later, the handsome stud opened the door. He gave Amanda an approving look.<br>\r\n\"What can I do for you?'  he asked.<br>\r\nAmanda's mind reeled.  She knew what she wanted him to do for her.<br>\r\nShe smiled and</span></div></div>",
            "created":1373778000,
            "id":1627940,
            "title":"Chuck, a new neighbour who is almost as big & s..."
        },
        "151131":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Stay away from my man",
                "Cold cocked her."
            ],
            "content":"<div class=\"\"><div> <span>Chuck staggered back as Amanda put her arms around him and planted a passionate kiss on his sexy lips.  Her big breasts pushed against his bulging chest.  He was used to having girls pursue him but this was a new one. Amanda looked up at Chuck shyly and smiled.  <br>\r\n\"I saw you through the window and thought I should introduce myself.  My name's Amanda.\"<br>\r\n\"Well, Amanda.\"  Chuck answered. \"That's the warmest introduction I ever received.  My name is Chuck.\"<br>\r\nChuck's girlfriend Stacy was in the room and she was glaring at Amanda. while Chuck enjoyed having two beautiful women competing for him.  Stacy was a pretty brunette with a big booty that Chuck loved and the newcomer, Amanda was a blond with impressive boobs.  Chuck was weighing his options here.  Could he possible have both women?<br>\r\n\"Stacy, this is Amanda.  She just dropped in to introduce herself.\"<br>\r\nStacy glared then said<br>\r\n</span></div></div>",
            "created":1373950800,
            "id":1628935,
            "title":"Kissed him"
        },
        "151132":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Amanda bets that Pete is bigger & stronger than Chuck",
                "Stacy bets Chuck is bigger & stronger than Pete"
            ],
            "content":"<div class=\"\"><div> <span>Amanda said she was taking a survey for a company featuring a new protein shake. Amanda worked for an exercise club &amp; had the hot body to prove it. Chuck let her in.<br>\r\n<br>\r\nMy firm wants to know men's measurements so as they will know if this is a good location to market their newest protein shake. I can see that your measurements are manly.<br>\r\n<br>\r\nInstead of telling Amanda what his measurements were, Chuck said he was 205 pounds at 6'2 &amp; gave her a measuring tape. He then stood tall &amp; flexed for this beautiful woman<br>\r\n<br>\r\nNeck, 16\", Shoulders, 50\", Chest, 45\", Waist, 32\", Arms, 15\", Thighs, 25\", Calves, 15\". Amanda admired Chuck's eight pack, but felt Pete's other muscles were way bigger.<br>\r\n<br>\r\nAs Amanda was wondering if she should be so forward as to measure Chuck's manhood as it seemed to be getting nice &amp; thick with all the flexing he was doing, in came Stacy</span></div></div>",
            "created":1373950800,
            "id":1628823,
            "title":"Said she was taking a survey."
        },
        "1511322":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Pete is bigger and stronger."
            ],
            "content":"<div class=\"\"><div> <span>Amanda told Stacy everything and described Chuck's measurements to her to see if they were accurate. After Stacy confirmed that they were,she brought up Pete to compare and Stacy said Chuck was bigger and stronger. Amanda immediately got insulted and suggested they prove it. The trio went back to Pete's place and...  </span></div></div>",
            "created":1373950800,
            "id":1628827,
            "title":"Stacy bets Chuck is bigger & stronger than Pete"
        },
        "15113221":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The contest begins but the girls  plan to bulk up and challenge them both. ",
                "The contest begins and Amanda has also challenged Stacy to the same contest. "
            ],
            "content":"<div class=\"\"><div> <span>Pete and Chuck both flexed to their fullest for their ladies but in the end, Pete was superior. Chuck might have had an eight pack but Pete had eighteen inch arms, a seventeen inch neck, a fifty-five inch chest and sixteen inch thighs and calves. When the girls {semi-jokingly} suggested measuring manhoods, Pete crudely remarked that he didn't want to shame \"little Chucky\" even more. Chuck became angry and suggested that he was still stronger and decided a weight lifting contest and arm wrestling would prove it. Pete could bench about almost three hundred pounds and did so for ten reps. Pete could only do eight reps of two fifty and lost handily. They then moved to a coffee table and locked hands, pushing with all their might.  Their arms bulged to amazing size for almost a minut but Pete was merely toying with Chuck and slammed his arm down instantly. A humiliated Chuck challenged Pete to a rematch iin six months,stating that one would be bigger and stronger by that time. Chuck agreed and said the challenge was set. The girls were making plans too.  </span></div></div>",
            "created":1373950800,
            "id":1628832,
            "title":"Pete is bigger and stronger."
        },
        "151132211":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Skip to the contest.",
                "Follow the girls' progress."
            ],
            "content":"<div class=\"\"><div> <span>Amanda and Stacy had been talking while the guys made plans and it turns out they both had secret desires to be as big and strong as their guys. Amanda was always reading female bodybuilding magazines and FBBs compete on television but kept it secret from sexist Pete. She just loved the idea that women could be big,strong and muscular but also sexy. Stacy felt the same way but was limited to reading FMG fiction online. Chuck was even more sexist than Pete and would berate her for even thinking such things.<br>\r\n<br>\r\nTo this end,both girls decided enough was enough. They would help the  boys train but would also train themselves to beat both in secret. When the day of the contest came, it would be a battle of the sexes.</span></div></div>",
            "created":1373950800,
            "id":1629078,
            "title":"The contest begins but the girls  plan to bulk ..."
        },
        "1511322111":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The girls reveal themselves and the guys get angry.",
                "The girls reveal themselves and the guys aren't impressed."
            ],
            "content":"<div class=\"\"><div> <span>Six months came and went with the two competitors {secretly four} going all out. They pumped iron day in and day out, followed special diets, and guzzled steroids. Finally, the day of the contest arrived.<br>\r\n<br>\r\nPete was the first to show up and it was clear he was huge. His big gut had become a slab of solid muscle,easily an eight pack. Chuck was unimpressed as he appeared just as large and his abs were more defined than ever. Only exact measurements would tell which was superior.<br>\r\n<br>\r\nBefore the contest could begin, the girls ran in looking scared. Both were wearing bulky clothes that only showed off their much larger breasts. The guys fully appreciated this sight as they hadn't had sex at all during their training, their drive to compete pulling them away from all else. Each man had plans to take both girls for himself after their victory though.<br>\r\n<br>\r\n\"Hold it fellas, something's come up!\" Amanda squeked in a frightened voice \"there's two people who want to challenge you both right here,right now!\" \"Yeah\" Stacy added \"they claime they're bigger and stronger than you guys ever were!\"<br>\r\n<br>\r\nBoth men took a moment to digest this news and looked at each other wearily. Finally, Chuck said \"alright then, bring them on!\"  \"Yeah!\" Pete grunted \"I'll take on both them and Little Chuckie if I have to! Where are they?\"<br>\r\n<br>\r\nThe girls' frightened looks suddenly became smug smiles. They turned to each other, winked and began removing their bulky clothes. \"They're right here!\"</span></div></div>",
            "created":1374296400,
            "id":1631379,
            "title":"Skip to the contest."
        },
        "15113221112":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The girls aren't  as big as the guys but  close. On to the strength contests!",
                "The girls match the guys muscle for muscle. On to the strength contests!"
            ],
            "content":"<div class=\"\"><div> <span>Amanda and Stacy stood before their guys in blue and red posing bikinis, their bodies transformed from fit to that of muscle goddess! Huge arms that looked at least twenty inches unflexed,  powerful thighs,sculpted calves, big breasts that extended fom powerful chests, obvious abs, and more were well blended with shapely feminine curves and their already increddible looks to create superwomen. Even the best female body builders would've been envious but the guys didn't look impressed or even outraged. They just looked bored.<br>\r\n<br>\r\n\"Is this it?\" Chuck snorted \"I thought it was serious.\" \"Yeah\" Pete laughed \"you two want to challenge us? That's a riot!\" The girls' smirks faded and were soon replaced with scowls. \"And why is that!? Stacy demanded \"we're just as big and strong as you guys!\"  \"Hell, bigger and stronger!\" Amanda sneered as she flexed her mighty bicep.<br>\r\n<br>\r\n\"Oh please,we'll admit you look good for muscle bitches but we're still guys\" Chuck scoffed \"we'll always be bigger and stronger.\" Stacy scowled even more and put her hands on her hios. \"Oh yeah? Prove it!\"  \"Our challenge still stands boys\" Amanda said \"a size contest followed by some contests of strength, us against you. Loser is the winner's slave. Agreed?\" Chuck and Pete looked at each other and smirked. \"Alright bitches,let's measure up!\"   </span></div></div>",
            "created":1375592400,
            "id":1640279,
            "title":"The girls reveal themselves and the guys aren..."
        },
        "151132211121":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span>The contest was on, staring with the size competition. Amanda and Stacy flexed their hardest but the guys won in the end, though not as easily as they would have liked. Amada had twenty five inch arms, an almost fifty-eight in chest minus her breasts, and twenty inch thighs and calves while Stacy had twenty-three inch arms, a fifty-five inch chest minus the breasts, and seventeen inch thighs and calves but Pete and Chuck both had twenty-seven inch arms,  sixty-inch chests, twenty-four inch necks, and thirty-inch thighs and calves. The girls hadn't done their necks because they believed it was stupid but it cost them points.<br>\r\n<br>\r\nThen it came time for the strength contests. First was weight lifting and it would be Amanda against Pete and Stacy against Chuck. Unlike before, the winner would be decided by the number of reps completed. Pete loaded the bar with a stagering four hundred pounds and did twenty reps easy, daring Amanda to match him.<br>\r\n<br>\r\nAmanda scowled in determination and actually loaded five hundred pounds onto the bar. Pete thought she was bluffing at first but his jaw dropped  when she actually managed it. Unfortunately, she could only manage three reps so she lost.<br>\r\n<br>\r\nNow it was Chuck's turn but he could only do three hundred and ten pounds. He cranked out eight reps before turning it over to Stacy, who attempted to match Pete's record and loaded four hundred pounds. After about two reps however, she gave out.<br>\r\n<br>\r\nNow it was time for arm wrestling. Pete and Amanda locked hand and went at it for nearly five minutes, their mighty muscles bulging and their faces red with exertion. In the end however, Pete was able to slowly bring her hand down. Next, Chuck and Stacy began to armwrestle. It seemed even at first but after two minutes, Chuck slammed down Stacy's arm with a powerful force.<br>\r\n<br>\r\n\"Well girls, looks like we proved who wears the pants around here\" Pete sneered as he flexed his huge biceps \"now get in the kitchen! You're gonna prepare us a victory feast.\"<br>\r\n<br>\r\nThe girls nodded and walked to the kitchen meekly but their minds were buzzing with plans. They may have lost but just barely. The battle of the sexes was just begining.   </span></div></div>",
            "created":1379307600,
            "id":1663854,
            "title":"The girls aren't  as big as the guys but  c..."
        },
        "1511322112":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The girls reveal themselves and challenge both guys.",
                "They wait for Pete and Chuck to go at it and challenge the winner."
            ],
            "content":"<div class=\"\"><div> <span>Over the next six months, Amanda and Stacy trained in earnest while keeping up pretenses with their guys. They urged Pete and Chuck to bulk up with massive weight lifting sessions, stuffed them with food,protein shakes, and the safest steroids they could find. All this together was turning the guys into massive muscle giants but they had no idea their girls were undergoing the same treatment. <br>\r\n<br>\r\nAmanda and Stacy were driven by pure competitiveness to surpass the guys efforts, using images of the biggest FBBS for inspiration. They trained daily both at home and in the weight room of Amand's exercise club. They also made sure to eat twice much food and take as much steroids and protein shakes as both of them. Both men were too fueled by their hate for each other to notice any change in their ladies and had even been convinced by them to swear off sex until the contest was over. Both girls had promised each one a big reward if they won and that simply fueled their efforts.<br>\r\nFinally, the day of the contest came.  </span></div></div>",
            "created":1374037200,
            "id":1629733,
            "title":"Follow the girls' progress."
        },
        "15113221121":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "The girls whipped the boys.",
                "Chuck and Pete ran for the door."
            ],
            "content":"<div class=\"\"><div> <span>Chuck and Pete were so distracted by their rivalry that they were clueless about what the girls were doing.  Each was driven to do more than the other and by now each was nearing 350 pounds of muscle bound bulk and huge roid guts.  They had simplified their lives to eating and lifting and while their woman had been the original reason for the competition, they were now incidental.  They didn't notice that their dainty flowers were now nearing 175 pounds; their breasts more like pecs and their tiny waists were big hard balls.Between the drugs, the lifting and the food, the girls had begun to encourage each other and as their development continued, they forgot their boyfriends as sex objects and began to appreciate each other.<br>\r\nBy the time the men were ready to compete, the girls wanted to whip both of them.  <br>\r\nPete was still the bigger man although by now the difference wasn't much.  Stuffed into trunks that barely contained his bulk he stormed over to Chuck ready to beat him to a pulp when he heard.<br>\r\n\"Stop right there tubby.\"  He turned to see his a huge amazon glaring at him and he realized it was his Amanda.  But what had happened to her?  She looked like a serious weightlifter with boobs.  She was disgusting.<br>\r\n\"You too, fats.\"  Stacy was standing facing Chuck and she was every bit as big as Amanda.  What was going on.<br>\r\nThen Amanda attacked, dancing around Pete and pummeling his face.<br>\r\nStacy attacked Pete and soon</span></div></div>",
            "created":1374037200,
            "id":1629764,
            "title":"The girls reveal themselves and challenge both ..."
        },
        "15113221122":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "They watch the contest..",
                "Both girls change their minds and challenge both."
            ],
            "content":"<div class=\"\"><div> <span>Amanda and Stacy both wore bulky clothes to hide their progress so the only the only thing the guys noticed were their bigger boobs. They decided to let them settle their contest before revealing themselves and challenging the winner. Both Pete and Chuck were now massive mscle giants who barely fit into the skimpy briefs they wore but the girls were confident in their own results, at least Amanda was. Stacy was having second thoughts. What if they couldn't win?<br>\r\n<br>\r\nAmanda noticed this and decided to take action. She whispered to Stacy to meet her in the kitchen and they both asked for a small delay, coming up with the cover story that one  was gong to tak the other into a threesome with the winner.<br>\r\n<br>\r\nOnce inside, Stacy spilled her guts. \"Amanda,what did we get ourselves into? Those guys are huge! How could we compete with them?\"<br>\r\n<br>\r\n\"Hey, hey, this is no time for cold feet girl.\" Amanda said with a reassuring smile \"we both trained hard, didn't we? You just gotta believe we can win. And so what if they're huge? So are we!\"<br>\r\n<br>\r\nTo prove her point, Amada shed her bulky clothes and did a classic double bicep pose. She was dressed in a dark blue bikini much like a professional female bodybuilder and was indeed a sight to behold with almost thirty inch arms, a nearly sixty inch chest with massive breasts, sixteen and a half inch thighs and calves and a slender waist with a prominent six pack. She was indeed massive but still beautiful and sexy, something only a few FBBS and the women in Stacy's stories could pull off these days. {An: No offense to FBBs but some are way too addicted to steroids.}<br>\r\n<br>\r\nFilled with newfound confidence, Stacy nodded resolutely. \"You're right, let's get 'em!\" Amanda smiled and got dressed once more. No need to spoil the surprise just yet. As both girls walked out, Stacy could help but wonder who was the biggest and strongest between them?<br>\r\n <br>\r\n</span></div></div>",
            "created":1374037200,
            "id":1629820,
            "title":"They wait for Pete and Chuck to go at it and ch..."
        },
        "151132212":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Pete beats Chuck to a pulp",
                "Chuck beats Pete to a pulp"
            ],
            "content":"<div class=\"\"><div> <span>The contest began but Amanda also challenged Stacy to see who could be the best female bodybuilder. Both girls watched their diets for months &amp; had tiny waists &amp; full breast<br>\r\n<br>\r\nMeanwhile, Stacy pushed her Chuck to bulk up. He readily did so as he liked being the big, butch male, &amp; did not like being humiliated by Pete next door. He would show Pete.<br>\r\n<br>\r\nFor months, Chuck piled on the pounds. His eight pack turned into a six pack &amp; then a four pack. However, his strength &amp; muscle mass also increased dramatically.<br>\r\n<br>\r\nAt the same time, Pete continued to down several protein shakes daily. There was no hiding his big manly gut now. Now, it was getting hard to find clothes to cover him up.<br>\r\n<br>\r\nJust before it was time for the two men to measure up, Pete caught Chuck putting the moves on his Amanda. Both men were full of testosterone rage and flew at each other.</span></div></div>",
            "created":1373950800,
            "id":1628839,
            "title":"The contest begins and Amanda has also challeng..."
        },
        "1511322121":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Amanda gives her champ a reward",
                "Stacy gives her loser an ultimatum"
            ],
            "content":"<div class=\"\"><div> <span>\"GET YOUR DIRTY PAWS OFF MY WOMAN\", boomed Pete, ass red in the face with rage as he glared at Chuck, standing there with his hands on Amanda's full ass.<br>\r\n<br>\r\n\"Hey, maybe Amanda here wants a real man instead of a fat slob like yourself,\" said Chuck calmly, before looking in Pete's direction. Chuck then stood back &amp; ripped off his shirt to proudly display what months of downing protein many protein shakes daily &amp; fewer reps with heavier weights had done to his body. Truly, he was much bigger/stronger.<br>\r\n<br>\r\nThe two men circled each other, sizing each other both. Both instantly came to the same conclusion, that they were bigger &amp; stronger than the other &amp; would beat the other easily. Pete gave Chuck a shove on the chest, pushing him back a foot. Chuck, insulted, reciprocated, but Pete's 30+ inch thighs stood their ground. Then the fists flew. The thuds were loud as each man gave the other blow after body blow. Any average man would have been out with one blow from either of these muscle monsters. However, these two were more or less equally matched alpha males.<br>\r\n<br>\r\nWithin a minute, Chucks blows became a little weaker, &amp; he felt pain which he did not like. He tried to summon up more strength from within, but had reached his limit.</span></div></div>",
            "created":1374037200,
            "id":1629707,
            "title":"Pete beats Chuck to a pulp"
        },
        "1511322122":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Amanda beats Stacy to a pulp",
                "Stacy beats Amanda to a pulp"
            ],
            "content":"<div class=\"\"><div> <span>Amanda and Stacy watched as their men fought.  Both men were bigger and stronger than six months ago.  Pete's big powerlifter belly was now a gigantic blimp.  Chuck's tiny wasit and washboard abs were now a bulging slab of hard muscle.  Pete was the bigger man and stronger if you were lifting weights but the bulk of his belly made him awkward and inept in a fight.  Soon he was heaving for breath and staggering as Chrucks blows made contact.  Blood dripping into his eyes made it hard to see and the lighter man was able to dance around his opponent.  Finally Chuck caught Pete with an uppercut that knocked him cold.  The big man fell with a thud and lay unconscious.<br>\r\n\"The bigger they are, the harder they fall.\"  Chuck told the watching ladies.  <br>\r\nStacy and Chuck went home to celebrate leaving Amanda to nurse her big man.  She was disappointed.  Pete was big alright.  Pete was strong too.  But the lighter, less powerful but more agile and graceful Chuck won the day.  She considered her options.  Big wasn't everything and as she looked at Pete's round face and double chin she remembered how different he looked now than when she first met him. He was lean and chiseled then, every girl wanted him but with Amanda's encouragement Pete got bigger and bigger.  The blimp that he had become wasn't quite what Amanda had anticipated.  She wasn't ready to be the girl of a fat loser.  Amanda packed her bags leaving Pete lying on the floor. She had another plan.  She was more woman than Stacy and a winner like Chuck deserved better.  Soon she was at Chuck's door and when Stacy answered, Amanda invited her to step outside where they foung over Chuck.</span></div></div>",
            "created":1373950800,
            "id":1628927,
            "title":"Chuck beats Pete to a pulp"
        },
        "15113221221":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Furious Pete joins a Fight Club to toughen up",
                "Depressed Pete resorts to food to comfort himself"
            ],
            "content":"<div class=\"\"><div> <span>Chuck tore Amanda off Stacy as she was getting the better of her. Chuck carried Amanda inside his apartment to calm her down but never came out. Passionate sounds were heard from inside. Stacy picked herself up &amp; went to a cafe for coffee &amp; reflection. Who should she meet there, but the big, fat loser, Pete, downing a donut &amp; a coffee with cream.<br>\r\n<br>\r\n\"Well, it's easy to see how you got that big, soft gut that cannot take a punch from a real man like my Chuck\", Stacy stated unkindly in her frustration. Pete glared at her.<br>\r\n<br>\r\n\"You don't look so great yourself, sister,\" said Pete flatly as he nursed his black eye &amp; broken nose. \"What happened to you? Have you seen my Amanda, she's disappeared.\"<br>\r\n<br>\r\n\"Well hon, I have news for you\", Stacy announced. \"It looks like we are both losers as 'your' Amanda is with my Chuck, making out right now. We need a plan. Do you have one<br>\r\n<br>\r\nPete was heart-broken &amp; furious at the same time. He knew he should not care for a woman who would drop him when he was down, but he did. It was time to make changes.</span></div></div>",
            "created":1374210000,
            "id":1630580,
            "title":"Amanda beats Stacy to a pulp"
        },
        "151132212211":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Meanwhile, Amanda and Chuck are bulking up as well."
            ],
            "content":"<div class=\"\"><div> <span>Pete joined a fight club the following week,determined to become bigger, badder, and better than ever. Stacy joined too in a effort for revenge against Amanda. They bulked up tremendoudly and learned wresttling,boxing, and various martial arts. Along the way, Stacy and Pete found themselves becoming attracted to each other. Pete was far more considerate to Stacy than Chuck ever was and Pete found he and Stacy had a lot more in common than he and Amanda ever did. He also found he had a thing for muscular women as he enjoyed watching Stacy bulk up alongside him. Soon the new couple was ready for revenge.</span></div></div>",
            "created":1374210000,
            "id":1630802,
            "title":"Furious Pete joins a Fight Club to toughen up"
        },
        "1511322122111":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Pete measures up",
                "Chuck measures up"
            ],
            "content":"<div class=\"\"><div> <span>Chuck woke up feeling erotic. He was turned on &amp; needed Amanda to service him. Most morning he woke up feeling this way, ever since he had outmuscled that fat Pete. However, this morning Amanda had already left for the gym. Chuck checked himself out in the mirror. Man, he had certainly put on some size since Amanda had moved in. Chuck must be up to 270 pounds of man by now. He did not know what supplements Amanda was supplying him, but they sure were helping him to pile on the pounds of muscle. Though he had lost his abs, his waist was a decent 36\" considering all his muscle mass. Plus he was benching well over 300 pounds &amp; curling 150 with one hand. Chuck felt himself to be the biggest, toughest, strongest man around. After all, he had proven that months ago when he had beaten that ex jock, Pete &amp; taken his woman.<br>\r\n<br>\r\nThe phone rang, &amp; it was his Amanda who wanted him to meet her at the mall so as she could buy him some new clothes. After all, he had outgrown all of his old clothes. Meanwhile, Stacy &amp; Pete had the same idea. The two giants were about to collide once more. Had Pete got control of his gut? Had Chuck let himself go &amp; not noticed?</span></div></div>",
            "created":1374296400,
            "id":1631036,
            "title":"Meanwhile, Amanda and Chuck are bulking up as w..."
        },
        "152":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Yes.",
                "No,let's move on to other options."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Tony and Andrea, a husband and wife who enter a bodybuilding contest and must compete to outmuscle each other?</span></div></span></div>",
            "created":1374728400,
            "id":1634337,
            "title":"Open"
        },
        "153":{
            "choices":[
                "In high school",
                "In college",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a group of high school friends?</span></div></span></div>",
            "created":1430629200,
            "id":1973144,
            "title":"A group of friends"
        },
        "1531":{
            "choices":[
                "Yes!",
                "Yes! (option 2)",
                "No! More choices!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this group of three guys:<br>\r\n<br>\r\nCody- 6'2\" lean and muscular. Cocky jock<br>\r\n<br>\r\nBen- 5'10\" skinny. Friendly smart<br>\r\n<br>\r\nJosh- 5'8\" chunky. Class clown</span></div></span></div>",
            "created":1430629200,
            "id":1973146,
            "title":"In high school"
        },
        "1532":{
            "choices":[
                "Yes!",
                "Yes! (option 2)",
                "No! More choices!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these three male roommates:<br>\r\n<br>\r\nPatrick- 6'4\" fat. loud and cocky<br>\r\n<br>\r\nMichael- 6'0\" lean and muscular. friendly ladies man<br>\r\n<br>\r\nBlake- 5'9\" skinny. funny and smart</span></div></span></div>",
            "created":1430629200,
            "id":1973147,
            "title":"In college"
        }
    },
    "info":{
        "author_id":"citywalker",
        "author_name":"citywalker",
        "brief_description":"A pair or group of guys compete to see who'll come out on top as the biggest amongst them.",
        "created":1320674340,
        "description":"<td align=\"left\" class=\"norm\">A pair or a group of boys or guys have found some way to get bigger, whether it's natural or supernatural. As they start to grow, competition, either friendly or fierce, starts to heat up between them, and they try to battle it out to see who amongst them will be the biggest!<br>\r\n<br>\r\nThis story (so far) has only one rule: there must be at least two males as main characters. Other than that, go nuts! Be as creative or as crazy as you want to be. I should only intervene to clean up spelling/grammar.<br>\r\n<br>\r\nThanks. Have fun, and let me know what you think.</td>",
        "id":1824356,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1586483340,
        "modified":1586483340,
        "pretty_title":"Battle to be the Biggest"
    }
}