{
    "chapters":{
        "1":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Black Site",
                "Mysterious Device",
                "Human, Viper Compatibility ",
                "Readers Choice",
                "Readers Choice 2"
            ],
            "content":"<div class=\"\"><div> <span>What will cause the our viper to begin to grow?<br>\r\n<br>\r\n1. During the first black site mission a viper gets caught in an explosion and gets drenched in human DNA it has some serious side effects.<br>\r\n<br>\r\n2. A device found by resistance that is believed to be a weapon is given to XCOM, when it is used in the field on a viper it's affect aren't so much deadly as they are... titillating. <br>\r\n<br>\r\n3. Humans and vipers are rather compatible. When a really... randy viper kidnaps a XCOM soldier from the battlefield to satisfy her needs. The results of this are rather... expansive. <br>\r\n<br>\r\n4. Vipers just start to grow. Readers Choice.</span></div></div>",
            "created":1456853040,
            "id":2111695,
            "title":"First Off"
        },
        "11":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "no just one",
                "yeah three",
                "how about five",
                "lets do seven",
                "nah lets do eight"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>wait before it continues was it one or a couple like three </span></div></span></div>",
            "created":1472347380,
            "id":2202483,
            "title":"Black Site"
        },
        "115":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "lower half",
                "upper half",
                "genitals"
            ],
            "content":"<div class=\"\"><div> <span> (I will be using long war vipers for this, yes long war guys made alien pack that add several new variants and enemy including new variants for the vipers, the list of them is 1viper 2 Naja 3  Sidewinder, the naja and sidewinder have three variants)<br>\r\n<br>\r\nThe group of vipers which consisted of 2 regular vipers, 3 naja, and 3 sidewinders fired from the middle of the holding room, which contained  the green goo and human bodies within them.<br>\r\n<br>\r\nThe vipers fired on the xcom agents, but suddenly one of the agents fired blindly hitting several of the tanks causing them crack open, the goo poured out of them and onto the vipers.<br>\r\n<br>\r\nThis cause the vipers to panic and run away.<br>\r\n<br>\r\nThe group of vipers were now far from the advent facility panting and moaning pleasure for some reason.<br>\r\n<br>\r\nwhat changes first</span></div></div>",
            "created":1476908160,
            "id":2225656,
            "title":"The beginning of something new"
        },
        "1151":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "upper",
                "gentials"
            ],
            "content":"<div class=\"\"><div> <span>The vipers fell to the ground, still moaning loudly, their lower structure changing, their tails moving... reconfiguring, the felt pain as they felt two new limbs extending out. One of the vipers looked at their lower half realizing they were forming legs and feet.<br>\r\n<br>\r\nTheir ass's started to expand growing jigglier and bigger, a new hole opened up between their cheeks. Giving them an ass a human would have... expect it has scales.<br>\r\n<br>\r\nTheir tails rested above their butts. Their legs were covered in scales along with the top half of their feet covered in scales, with the bottom of the feet being soft skin.<br>\r\n<br>\r\nThe color of the bottom of the feet where white. They had somewhat long toe nails ( basically their toe nails look like this  <a rel=\"nofollow\" href=\"https://e621.net/post/show/868889/2016-5_toes-anthro-anthrofied-arbok-barefoot-big_b\" target=\"_blank\">https://e621.net/post/show/868889/2016-5...</a>)<br>\r\n<br>\r\nTheir hips expanded and their thighs gained fat which hid strong muscles. The vipers now had sexy legs.<br>\r\n<br>\r\nwhat changes next? <br>\r\n </span></div></div>",
            "created":1476908880,
            "id":2225661,
            "title":"lower half"
        },
        "11511":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "Genitals "
            ],
            "content":"<div class=\"\"><div> <span>\"Ooooooh I'm going to cum~.\" Moaned a naja \"Sera this feels amazing.\"  <br>\r\n<br>\r\nThe viper Sera moaned her foot accidently rubbing against the najas pussy, moaning from the pleasure Sera wiggled her new five toes by accident causing the the naja to cum.<br>\r\n<br>\r\nTheir chest plates felt tighter, it forced the group of snake women to take them off. Their chest expanded outwards.<br>\r\n<br>\r\n\"Ooooh this feels soooooooo good~\" moaned Sera as her breast grew.<br>\r\n<br>\r\nThey all felt a tingling sensation, when they looked at their breasts, they saw nipples and areola forming on them.<br>\r\n<br>\r\nSoon their chest stopped growing. As they panted they felt a weird sensation from their crotch.</span></div></div>",
            "created":1476918240,
            "id":2225742,
            "title":"upper"
        },
        "115111":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "Something happens to sera",
                "Nothing, they explore their new bodies *Ie sex"
            ],
            "content":"<div class=\"\"><div> <span>The group of snake women moaned louder as they cummed uncontrolled,  their vaginas had moved into the place a human women would hers, but somthing else was happening.<br>\r\n<br>\r\nThey felt were growing penis and a scrotum.<br>\r\n<br>\r\nSoon they had erect cock,  which looked a humans dick, except with one difference, there dicks were each of their respective skin colors.<br>\r\n<br>\r\nYellow for regular vipers, tan for viper naja, and dark blue for sidewinder.<br>\r\n<br>\r\nTheir scrotums were white and had soft skin, they had two testicles one in each sack.<br>\r\n<br>\r\nSera moaned and rubbed her new male apendage.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1476925140,
            "id":2225780,
            "title":"Genitals "
        },
        "1151111":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "Making a new plan.",
                "sex"
            ],
            "content":"<div class=\"\"><div> <span>Sera moaned louder \"something happening to me.\" her scales started to turn light blue, the back of her hood gain several black streaks.<br>\r\n<br>\r\nHer dick and balls grew larger, her scrotum remained white while her dick had turned light blue, she had gained a foot of height leaving her at six foot two, her breasts started to grow, soon reaching a f cup by human standards  <br>\r\n<br>\r\nher areola and nipples turned light blue.<br>\r\n<br>\r\n\"Wh-whats happened to me?\" Sera moaned/ panicked \" Vaja, Boj, Ni, Ma.\" as she looked at her allies as she said their names Vaja the other viper, Boj, Ni, Ma, the three Naja.<br>\r\n<br>\r\n\"Ki, Fein, Li.\" she looked at the three sidewinders.<br>\r\n<br>\r\n\"Whats happened to us, I-I-I feel like something been lifted... I don't feel the control of the ethereals anymore, were free!\" said Sera, she looked at her allies \"were free from the ethereals blasted control.\"<br>\r\n<br>\r\nShe picked up her allies... no friends, smiling as she did.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1476926340,
            "id":2225785,
            "title":"Something happens to sera"
        },
        "11511111":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "time skip",
                "reader choice "
            ],
            "content":"<div class=\"\"><div> <span>Sera: Height 6 foot 2, Gender: female/futa, Dick length:11 inchs when erect, Breast: F cups.<br>\r\nVaja: Height 5 foot 11, Gender: female/futa, Dick length 7 inchs when erect, Breast: E cups<br>\r\nBoj: Height 5 foot 8, Gender: female/futa, Dick length 8 inchs when erect, Breast: DD<br>\r\nNi: Height 5 foot 8, Gender: female/futa, Dick length 8 inchs when erect, Breast: EE<br>\r\nMa: Height 5 foot 9, Gender: female/futa, Dick length 8 inchs when erect, Breast: EE<br>\r\nKI: Height 5 foot 10, Gender: female/futa, Dick length 9 inchs when erect, Breast: E<br>\r\nFein: Height 5 foot 10, Gender: female/futa, Dick length 10 inchs when erect, Breast: DD<br>\r\nLi: Height 5 foot 11, Gender: female/futa, Dick length 9 inchs when erect, Breast: EE<br>\r\n( just some quick information)<br>\r\n<br>\r\nAfter an hour of adjusting the group of sexy snake women started to talk.<br>\r\n<br>\r\n\"Alright girls, we can assume that stuff back the blacksite did this to us, were going to have to adapt, we have a penis and balls, along with with a vagina, so this is odd.\"<br>\r\n<br>\r\n\"But that's not the big problem, its these legs, it will take some time to get used to, were also free from the ethereals control.\" Sera said.<br>\r\n<br>\r\n\"Yes, but that's really not the big problem, Its what happened to you Sera~\" moaned Vaja as accidently stroked her cock.<br>\r\n<br>\r\n\"If I remember correctly, that scale coloration is associated with Queen viper and King vipers, maybe the the stuff activated some dormant genes of yours.\" Boj said.<br>\r\n<br>\r\n\"All in favor of having Sera as our queen say I.\" Said Boj, the other Vipers said I.<br>\r\n<br>\r\n\"What!\" Sera said shocked \"i don't think I'm fit to be a quee-.\" she was stopped when Vaja put a finger to Sera lips.<br>\r\n<br>\r\n\"Hush, your our queen now, you always were the leader of our group so it fits you, now shut up and lets have some fun.\" Vaja cooed as she used a hand to get Seras cock erect.<br>\r\n<br>\r\n\"We'll let you two have fun.\" Said Boj as she motioned the other vipers to follow her, they left leaving Sera and Vaja alone.<br>\r\n<br>\r\nVaja gently pushed Sera onto the ground. She moved down to Seras crotch \"I remember looking at  some videos, I remember something called a boob job.\"<br>\r\n<br>\r\n\"It went like this.\" she put the cock between her tits \"our breast aren't scaly which is nice, soft like our butts and our scrotums or our feet or cocks.\"<br>\r\n<br>\r\nShe used the sides of her arms to move her breast up and down.<br>\r\n<br>\r\nSera moaned her hands gripping the ground, she bucked her hips moaning.<br>\r\n<br>\r\nAs Vaja moved her tits, when she had the chance she use her tongue to lick the cock up and down.<br>\r\n<br>\r\n\"Vaja I-I can't hold it anymore.\"  Sera cames covering Vaja breast's and face.<br>\r\n<br>\r\nShe got up and slid Seras cock into Vagina \"I really hope that stuff changed how we give birth, I rather not have a hot body, if I lay eggs.\"<br>\r\n<br>\r\nShe started to moved up and down. They fucked for a few hours.<br>\r\n<br>\r\nwhat happens next?</span></div></div>",
            "created":1476929220,
            "id":2225803,
            "title":"Making a new plan."
        },
        "13":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "It lunges at him biting him, when it pulls away his dick feels hot!",
                "She explains she's feeling the mating heat even though it's not time to do so",
                "The viper explains she's been curious of humans and has wanted to mate with one",
                "The viper proclaims that he is her pet and she will do what she likes with him",
                "Suddenly it's chest grows larger and it wraps itself around him lovingly!"
            ],
            "content":"<div class=\"\"><div> <span>Brian Rock grunted as he shot his Assault Rifle, his loose black ponytail waving, sweat pouring off his tanned face as he backed up firing, at the viper that approached him. It hissed as it effortlessly dodged the bullets slithering to and fro. \"Come on!\" shouted a X-COM operative a woman with conrow ponytail. He could see the extraction point but knew it was too late. In the distance he could see some advent troopers, running forward. He also remembered Central saying that there were cruisers inbound.<br>\r\n<br>\r\nHe waved his hand, \"Get out of here!\" he shouted. She shook her head and was about to run to him when the voice of the commander sounded in his ear.<br>\r\n<br>\r\n\"Brian you can make it if you move now, I know you got one grenade but don't use it to throw your life away. Bernie see if you can-\" it was then a warning sounded, \"Shit several advent crafts coming in 50 seconds.\" there was a pause. \"Are you sure Brian?\" he asked.<br>\r\n<br>\r\nBrian smiled, as he reached for the grenade at his waist, he held it up but the Viper kept advancing, \"Boss I wasn't gonna live long anyways.\" he said.<br>\r\n<br>\r\nThere was silence, \"Your sacrifice will not be forgotten.\" and then the order, \"Bernie extract now!\" he said. The operative stood there then she gritted her teeth and turned around she waved at the transport above it sent down a line she grabbed it and watched as Brian primed the grenade. It was then she was pulled in and the transport craft powered away with the data in tow.  Brian stood there then he released the button 5 seconds before it exploded. He sighed as he sat down thinking of his name being emblazoned with the other soldiers that died trying to restore Earth to Humanity.<br>\r\n<br>\r\nIt was then that the strangest thing happened, the vipers tongue shot out, it wrapped around the grenade then the Viper jerked it's head and sent the grenade spinning away. It bounced twice then exploded, Brian looked at the viper as it neared him now slithering more slowly it's frill extended. He was sure if it had a rattle it'd be rattling right now. It then moved it's body curling around him before squeezing down on him. He grunted as he tried to muscle his way out but even with the fit and trained body he had acquired from training could resist the viper. As it squeezed down advent troopers ran up and pointed their mag rifles at him. They spoke in their alien language. When the viper hissed at them and responded back they looked at each other confused. Suddenly the vipers body wasn't squeezing so hard and it lowered itself so it was near his head it stroked his head like some kind of pet. It spoke again, the troopers looked at each other while the cruisers came down. The viper hissed it's body tensing around Brian.<br>\r\n<br>\r\nBrian of course was flabbergasted <i>'What the hell is going on?'</i> was all he could think.<br>\r\n<br>\r\nSuddenly one of the cruisers came in front of the viper and it opened when it did several more vipers came out. The hissed and spoke to each other in a strange language the viper around Brian hissed back. Eventually they parted and the grabbed Brian and uncurled around him as it did a viper moved forward and placed a collar around his neck, he was about to grab it when he was pulled by the viper onto the cruiser it closed and took off. Brian was about to look around when suddenly he felt the collar jolt him and he lost consciousness.<br>\r\n<br>\r\n<div align=\"center\"><b>An Unknown Location</b></div><br>\r\n<br>\r\nBrian woke up to another shock, he sat up looking around blearily, he raised his hands holding them up defensively, \"Put your handsssss down human!\" a voice with a slight rasp spoke. He stopped then turned to see the viper that had captured him was staring at him, with those dark orange yellow eyes. It stared at him with that narrow eyed look.<br>\r\n<br>\r\nBrian lowered his hands, he was scared, so he asked the obvious question, \"What do you want from me?\" he said in a low whisper. The viper cocked it's head slightly It was then he noticed that it was naked and it's bare chest was revealed showing... breasts with nipples? <i>'What kind snake has nipples?'</i> he couldn't help but wonder.</span></div></div>",
            "created":1468033080,
            "id":2177398,
            "title":"Captured"
        },
        "14":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Dr. Vahlens Redemption?",
                "The Elders Failed Plot?",
                "The True Nature of the Viper Race?",
                "The Viper Pheremone cloud?",
                "Some other reason for growth"
            ],
            "content":"<div class=\"\"><div> <span>Dr. Vhalen captures a viper and wanting to do right of her Rulers experiment she creates a new viper that is capable of consuming toxic waste to grow her body, or even assume a humanoid form, or create a milk that causes men to become massively endowed, she see's the possibility of peace with this new viper. It doesn't hurt that it can speak english as well.<br>\r\n<br>\r\nThe Elders in an attempt to draw humans to their side, modify the Vipers yet again, but the modifications causes them to be immune to their mind control but makes them incredibly horny, and with their... swelling endowments few men can resist them.<br>\r\n<br>\r\nVipers are a mysterious race, a female dominant race, Tygan can't help but want to study them. When he has the officers of X-COM capture one he finds rather interesting discoveries in particular their behavior during mating season.<br>\r\n<br>\r\nAdvent is trying to create an aerial based stimulant to enhance battle functions. When the soldiers of X-COM attacks they test it out, and while it makes most of their soldiers perform better, the Vipers become unbelievably horny, and the chemicals causes their breasts to swell to tremendous proportions and they aren't too picky in picking a mate at this point.<br>\r\n<br>\r\nMore possible reasons for growth</span></div></div>",
            "created":1468007580,
            "id":2177285,
            "title":"A few more options"
        }
    },
    "info":{
        "author_id":"bubad",
        "author_name":"L.wood",
        "brief_description":"The femme fatale from XCOM 2, the viper, gets a hole lot more womanly.",
        "created":1456836060,
        "description":"<td align=\"left\" class=\"norm\"><span class=\"clred\"><font class=\"size5\" style=\"\"><u><b>Plot</b></u></font></span><br>\r\n<br>\r\nThe viper from XCOM 2 grows curvier, lustier, ect... Have fun!<br>\r\n<br>\r\n<font class=\"size5\" style=\"\"><u><b><span class=\"clred\">Rules</span></b></u></font><br>\r\n<br>\r\n1. The focus of the story is on the viper, so the main focus has to stay on her/them.<br>\r\n<br>\r\n2. Humans are allowed to grow, but the only other aliens allowed to grow are the berserker because it is confirmed that is is female, and      the codex because it looks female. But with that in mind keep in mind rule #1.<br>\r\n<br>\r\n3. The only deaths allowed are unnamed characters and enemies and only in combat situations, also remember don't be to descriptive, just say they were shot or something and leave it at perfectible. <br>\r\n<br>\r\n4. Sex is allowed, but nothing to extreme and keep it a single chapter. And alien and human sex is allowed ;)<br>\r\n<br>\r\n5. Have at least a paragraph with good grammar. <br>\r\n<br>\r\n6. No popping<br>\r\n<br>\r\n7. Keep transformations realistic, don't go \"OMG tehy gain 100 cup sizes!\"<br>\r\n<br>\r\n<span class=\"cblue\"><u><b><font class=\"size4\" style=\"\">Allowed Topics</font></b></u></span><br>\r\n- Breast expansion<br>\r\n- Butt/Hip expansion<br>\r\n- Penis/Ball growth (for men only)<br>\r\n- Minor height growth (nothing over a foot)<br>\r\n- Lesbian<br>\r\n<br>\r\n<span class=\"cblue\"><u><b><font class=\"size4\" style=\"\">Not Allowed Topics</font></b></u></span><br>\r\n- Weight gain<br>\r\n- Giant/Giantess growth<br>\r\n- Vore<br>\r\n- Foot stuff<br>\r\n- Toilet stuff<br>\r\n- Guy on Guy<br>\r\n- Ending the story<br>\r\n<br>\r\n<font class=\"size5\" style=\"\"><b><div align=\"center\">With that said and done, Please Add and have fun</div></b></font></td>",
        "id":2076819,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1476929220,
        "modified":1476929220,
        "pretty_title":"XCOM 2: Viper Hourglass Expansion"
    }
}