{
    "chapters":{
        "1":{
            "author_id":"scorch21500",
            "author_name":"Scorch",
            "choices":[
                "MA5C Assault Rifle",
                "M90 Shotgun",
                "S2 Sniper Rifle",
                " Jackhammer Rocket Launcher",
                " AIE-486H Heavy Turret Platform (can't shoot till set up)"
            ],
            "content":"<div class=\"\"><div> <span>\"<i> Get ready we're coming in hot, soon as i touch down you guys have to move, i won't be able to stay long, give 'em hell boys.</i>\" The Pilot of Pelican, Echo 253 said to the Marians in her belly. 10 men being sent into a hot zone, their objective wasn't far from where they were touching down  but it was going to be a fight none then less.<br>\r\n<br>\r\n\"Ok you heard the lady, ladies, soon as those doors open your going to move like you got a purpose!.\" Sgt. Petters said over the squad mike. the Pelican lurched as the pilot started maneuvering to try and avoid as much fire as it could. William held onto the harness that kept him to his seat, it was there to make sure he didn't go flying if the pelican went down. A lot of good it would do as the Covies would be on them before they had a chance to do anything.<br>\r\n<br>\r\nThe pelican stopped moving and leveled out, there wass another lurch and the doors cracked. \"<i>Touch down! HIT IT MARIANS!</i>\" the pilot said.<br>\r\n\"GO GO GO!\" SGT. Peters said as everyone was already unstrapped and heading for the door. William stood and reached for his weapon....</span></div></div>",
            "created":1288821300,
            "id":986217,
            "title":"GO GO GO!"
        },
        "11":{
            "author_id":"theone25",
            "author_name":"ResolveOfSteel",
            "choices":[
                "William and SGT. Peters, Samuel (Sniper) and Bruce (Heavy), Ray and Ted  (ARs)",
                "William and Samuel, Ray and Bruce, Sgt. Peters and Ted",
                "William and Ray, Bruce and Sgt. Peters, Samuel and Ted"
            ],
            "content":"<div class=\"\"><div> <span>William's grip tightened on his AR, checking the amount of rounds it had in the cartridge before jumping from the open bay doors. He was almost immediately swamped with plasma fire coming from a group of grunts with a pair of hunters nearby. William ran for cover, a warthog that had been blasted onto it's side. He peeked over the top of the jeep, firing of a few rounds at the group of advancing grunts. The rest of his team had similar reaction's to his, running for what little cover was available. Not everyone was as lucky as he was though, it had only been five minutes, and they had already lost two men. William yelp, startled by a blast of plasma fire that had shot past his visor. Shaking his head and berating himself for not paying attention, he returned to the battle, blasting grunts and occasionally getting a few shots on the pair of hunters, the rest of the squad doing the same with their own assortment of weapons.<br>\r\n<br>\r\n\"Will!\" <br>\r\n<br>\r\nWilliam turned his head towards the voice, crouching behind the worthog. It was Samuel, the squad's sniper, he was behind the remains of building, the rubble making excellent cover.<br>\r\n<br>\r\n\"What?\" William yelled over the sounds of the skirmish.<br>\r\n<br>\r\n\"I can't get a good shot from here.\" He explained. \"I need you to give me some covering fire so I can get to that building over there.\" He continued, motioning to a four story building across the street from the worthog.<br>\r\n<br>\r\n\"Consider it done. Wait for my signal, then run.\" William turned away from Samuel, pulling out a frag grenade. He pulled the pin and threw it into the crowd of grunts. The explosion killed the majority of the grunts and stunning the now lone hunter.<br>\r\n<br>\r\n\"Go, go, go!\" William shouted, motioning for Samuel to run.<br>\r\n<br>\r\nSamuel nodded before darting from behind the destroyed building, moving from cover to cover while William fired at the remaining grunts and hunter, drawing their fire away from the mobile sniper. When Samuel finally made it inside of the building, William's comm crackled to life.<br>\r\n<br>\r\n\"All right, thanks man. Now sit back and watch the fire works.\"<br>\r\n<br>\r\nAfter a few moments of nothing but the sounds of gun fire, William heard, well, more gunfire. Five consecutive gunshots, considerably louder than the rest, five grunts dead. Five more gunshots, five more grunts dead. There weren't many left now. three grunts and the hunter. They were easily taken care of by the rest of the squad, which was now to only six men. <br>\r\n<br>\r\nSgt. Peters went to each man and colected the dog tags. Jerry Fisher, Samantha Bloom, Vern Yigs and Reggie Quint. Four great men and women, that will never get to see the outcome of the war.<br>\r\n<br>\r\nAfter a short moment of silence, Peters stood and addressed the remaining soldiers. <br>\r\n<br>\r\n\"We lost some excellent men today. So when you're out there, remeber your fallen comrades, and for every one of us that they take, take from them a thousand of theirs! Now let's get out their and give those alien bastards hell!\" This was met with a large cheer from the soldiers, their morale now recovered thanks to the Sargent's speech. \"All right men, on me, we're heading deeper into the city, so be on your toes. So, according to the GPS data that I received, the main Coveanent force is in the heart of the city, so We'll split into three groups of two and approach them from the north, east and west, leaving the south open for Squads Zeta and Rho. Are we clear?\" All of the soldiers nodded in response. \"OK, the teams are gonna be...\"</span></div></div>",
            "created":1311053880,
            "id":1150202,
            "title":"MA5C Assault Rifle"
        },
        "112":{
            "author_id":"theone25",
            "author_name":"ResolveOfSteel",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"There will be three groups consisting of two people per group, each group will have it's own objective and name plate. Red Group will consist of William and Samuel, your objective will be to clear out the east section of the city, after that is done, you will proceed to clear out the sky-scraper named Cloud Tower. Once there, you will set up a sniper position on the roof and await further orders. Green group will consist of Ray and Bruce. Your job is to clear out west side and fortify the the main road leading into the heart of the city with turrets and other defensive weaponry that you will receive before moving out. Gold team will consist of me and Ted. We'll take north side, clear out the area, and bunker down for the fight. Once all of our objectives are completed, I'll call in for Rho and Zeta squads to come in from the south. If everything goes according to plan, Rein will be ours again. All right men, move out.\" The soldiers nodded and paired off, collecting any necessary equipment before moving out.</span></div></div>",
            "created":1311059520,
            "id":1150222,
            "title":"Divide and Conqure"
        },
        "12":{
            "author_id":"evilguy",
            "author_name":"evil dude",
            "choices":[
                "William kills the Elite with the Gravity Hammer",
                "William quickly loads a fews shells into his Shotgun and blows the Elite away",
                "The Elite avoids his attack and their battle continues...",
                "Williams ally kills the Elite while it is distracted",
                "The Elite avoids his attack and is aided by the nearby Grunts "
            ],
            "content":"<div class=\"\"><div> <span>The shotgun had always been one of William's favorite weapons. Simple, yet effective... also it was pretty fun to see the horrified looks on whoever was on the receiving end of a close-range shotgun blast. The marines began heading out immediately and soon came under heavy Covenant resistance. Most of their foes were lowly Grunts or Jackals, but they did have a few Elites with them, which would surely prove to be a handful. Nevertheless, Williams wasn't the type to scare easily and boldly announced his presence to the enemy by blowing away a nearby Grunt and grabbing its Needler with his free hand. One of the Elites who was armed with a Plasma Sword charged him and made a swipe at his head, only to miss at the last second. Taking advantage of his foes carelessness William pressed his Shotgun right against the Elite's head and pulled the trigger causing it to stumble backwards as William fired one more shot into its chest to make sure it was dead. <br>\r\n<br>\r\n<br>\r\nBy this point a couple of Brutes had shown up armed with Gravity Hammers and the marines would soon be in trouble if they didn't start taking out more Covenant troops. Fortunately, William was able to kill three more Grunts with his shotgun before it ran out of ammo and was also able to bring down one of the Brutes with a barrage of needles. Tossing aside the now spent Needler William grabbed his foe's fallen Gravity Hammer and charged a nearby Elite who had one of his allies pinned down along with a squad of Grunts. Right at the last second the Elite noticed the charging marine and dodged just in time for a Grunt to be knocked across the battlefield. The Elite in turn took a swing at William, only to miss by an inch, giving the brave warrior just enough time for a counter attack...</span></div></div>",
            "created":1295074500,
            "id":1035718,
            "title":"I call Shotgun!"
        },
        "13":{
            "author_id":"scorch21500",
            "author_name":"Scorch",
            "choices":[
                "He finds it.",
                "Jackson and McKey go down",
                "AMBUSH!",
                "more sniper fire (multiple contacts)",
                "\"MOTAR TANKS!\""
            ],
            "content":"<div class=\"\"><div> <span>William grabbed The S2 sniper rifle from the case by his seat. He along with everyone else filed out into a hail storm of plasma fire coming at them from almost all sides. William sprinted to the nearest cover and got down by another marian firing bursts from his assault rifle anytime the fire the fire let up on there position.<br>\r\n<br>\r\n\"Damn, we're taking fire from ever where! What the hell are we doing here? this is suicide!\" the young man yelled. William was about to answer when the back of his head exploded in a shower of blood, grey matter and bits of bone. \"<br>\r\n<br>\r\n\"Shit! Sniper get down!\" Sgt. Petters yelled. \"Andrews your up! take down that sniper or we can't move up.\"  Williams nodded. \"Mckey! Jackson! Give Andrews cover!\" the two marines Stood and started to spray the area infront of then with a hail of gunfire. <br>\r\n<br>\r\nWilliam stood and rested the tri-pod of the rifl on the ruined wall he was behind and started looking for the sniper.</span></div></div>",
            "created":1297703100,
            "id":1053793,
            "title":"One shot, one kill."
        },
        "131":{
            "author_id":"scorch21500",
            "author_name":"Scorch",
            "choices":[
                "William moved with them",
                "williams stayed behind to provide sniper cover."
            ],
            "content":"<div class=\"\"><div> <span>William Contied to scan the roof-tops and windows  on the buildings that had a view of where the dead marian had been standing, as he looked the sound of McKey and JAckson's assult rifle fire and the whine of plasma wepons started to fain out as william was going into was was refered to as  the \"zone\" by a lot of the other snipers, it was just him, and the other sniper. nothing else, all he could hear was his heart beat and his own breathing as he scaned the windows. <br>\r\n<br>\r\nWilliam cought sight of movments from one of thw windoes and moved his crossed hairs to it,  there was the Jackle with it's Beam Rifle working on finding anogher target, whether it was william himself or Jackson and McKey william would never know. He lined up his shot and hld his breath, a few second lateter the rifle in his hands kicked and the neck of the Jackle exploded in a spray of purple blood, in a death grip the beam rifle went off but it went wild and hit a wall 30 meters to williams left. <br>\r\n<br>\r\nAll at once the wold was filled with sound agian as William got back down behind cover. \"Snipers down sir.\" he told Sgt, Peters.<br>\r\n<br>\r\n\"Good works, Marians, MOVE UP!\" He yelled.</span></div></div>",
            "created":1297796400,
            "id":1054464,
            "title":"Line of Sight"
        },
        "1312":{
            "author_id":"scorch21500",
            "author_name":"Scorch",
            "choices":[
                "HUNTERS!",
                "Gun fire behind him, Attck from behind!",
                "William moves up"
            ],
            "content":"<div class=\"\"><div> <span>\"Adrews stay here and cover out advase, i'll leave Jacksona nd MEcky behind to guard you from an Covies we may miss.\" Sgt. Peters said to william, he nodded in reply. \"OK,  MOVE UP!\" he yelled.<br>\r\n<br>\r\nWilliam  proped the rifle up on the wall agian and sighted an Elite and squeezed the trigger, he was rewarded with a Flash as the personal shield loverloaded and then a bloom of purple blood from the elite's chest. With that the rest of williams squad started moving between cover as they advanced on the target in the distance, a Covant anti-air batter, it was tearing any ship that came close to pices which was hinfer the advance of the UNSC forces into the city, Williams squad was to take it off-line, permantly.<br>\r\n<br>\r\nAs His squad advanced Jackson was taking down elites and leaving the now l;eaderless grunts to be delt with by his squadmates. every now and then when  a group of Jackles would get into a defensive position William would take them down by aiming for the small indent in the side of the shield they used to fire from behind there shilds with.</span></div></div>",
            "created":1297885620,
            "id":1055001,
            "title":"HEAD SHOT!"
        },
        "13123":{
            "author_id":"scorch21500",
            "author_name":"Scorch",
            "choices":[
                "Victor 335 makies it landing",
                "The banshees are back!"
            ],
            "content":"<div class=\"\"><div> <span>After a few minutes that seemed to be hours Williams squad had moved up far enough that he was having trouble seeing the Covies and he didn't want to waist his Sniper ammo on the grunts.<br>\r\n\"We're moving up!\" He said to Jackson and McKey. They nodded and williams went over the wall sprinting to the next bit of cover as Jackson and McKey followed him, moving to different cover. After moving about a hundred meters or so Williams stopped.\"Take up defensive positions on my flanks, Stay down.\" he orders, the whine of plasma fire and the clatter of UNSC assault rifles were loud now as they were maybe 3 meters from the fighting.<br>\r\nWilliam propped the rifle up on again and sighted his first target.<br>\r\n<br>\r\nIt was like this for about an hour as William moved up to cover his squad and they moved up once the way was clear. Jackson and McKey got to see some action when a couple dozen grunts charged them at one point.<br>\r\n<br>\r\nFinely The squad reached the base of the anti-air plasma cannon and began to plant the explosives wile william and the rest of his squad mates covered them.<br>\r\n<br>\r\n\"<i>Ok all set, get clear!</i> Came the voice of Langsin, the squads explosives expert The squad quickly moved away and shortly after that there was a massive explosion from the base of the cannon. The radio was willed with Cheers and whoops as the tower began tilt then topple. <br>\r\n<i>\"Ok Echo 253, we're ready for pickup.\"</i> Sgt. Peters said into the radio.<br>\r\n\"<i>This is Pelican Victor 335, Echo 253 went down about an hour ago after being engaged by a squadron of Banshees' she lead them away from your positions before she went down, i'm here to pick you up.\"</i> The pilot of Victor 335 said.<br>\r\n<i>\"Damn, ok move in to pick us up.\"<br>\r\n\"Will do.\"</i><br>\r\n<br>\r\nWilliam looked up as he heard the sound of te engins approching from the south west, Williama noted that this pelican had a warthog attached to the underside of it's tail.<br>\r\n\"Ok, i see you making my appraoch.\"</span></div></div>",
            "created":1298480940,
            "id":1059335,
            "title":"MOVE!"
        },
        "131231":{
            "choices":[
                "Provide Back Up",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>William stood back as the Warthog was dropped.Andrews you are with me Sgt.Peters ordered as he climbed into the drivers seat.Yes Sir William answered climbing onto the turret.Tutty get over here Sgt.Peters ordered.<br>\r\nYes Sir a marine answered carrying a shotgun.You climb into the passengers seat Sgt.Peters ordered.<br>\r\nSir where are we going William asked?We are going to.....</span></div></div>",
            "created":1298502540,
            "id":1059520,
            "title":"Victor 335 makies it landing"
        },
        "131232":{
            "author_id":"scorch21500",
            "author_name":"Scorch",
            "choices":[
                "Go for the warthog",
                "Try and make it out on foot."
            ],
            "content":"<div class=\"\"><div> <span>William was standing off a way from the rest of the group assembling for evac and do to them not being ordered differently so was Jackson and McKey.<br>\r\n<br>\r\nVictor 335 was just coming it when suddenly a loud roaring noise was heard coming from the northeast. William looked to the noise then his hand snapped to his radio. \"VICTOR 335 four BASHING APPROACHING YOU AT 4'O'CLOCK, EVADE!.\" he yelled into he radio, but it was to late. Before victor 334's pilot could even react the banshee's fired there fuel rod cannons and struck V335's side.<br>\r\n<br>\r\nV335 hung in the air for a few second spewing smoke and fire then began to fall toward where the Marines had assembled for their evac. \"I'M HIT! IC AN\"T HOLD IT MAYDAY, MAYDAY, MA--\" there was a blast of static as a second explosion rocked V335 and disengaged the Warthog.<br>\r\n<br>\r\nAll the marines started to try and run for cover but V335 was coming to fast and before anyone could get more then a few feet away V335 smashed into the ground right in middle of everyone. there was a massive explosion as V335's tanks erupted into a huge fireball.<br>\r\n<br>\r\nWilliam who was furthest from where the Pelican crashed was still picked up and thrown 30 feet through the air, landed hard and then blackness took him.<br>\r\n<br>\r\n<br>\r\nWilliam was out for an unknown amount of time<br>\r\n<br>\r\nHe looked around franticly to try and get his barring, he remembered V335 getting shot down but everything after that was hazy. He seemed to have landed in a pile of rubble that was once a wall of an apartment building.<br>\r\n<br>\r\nHe heard the distinct high pitched voices of grunts and rough hard voices of elites. Then as if summoned by his thoughts an Elite appeared on the top of the pile of rubble and saw him. William saw his S2 a few feet away and grabbed it. without taking the time to bring it to his shoulder, he brought the barrel around and pulled the trigger. The elite's shield flared, then failed and his neck exploded in a shower of gore. Before William could even take a breath he felt hands on him, He started to struggle till he heard a very human voice.<br>\r\n\"Sir, calm down, it's ok.\" the voice said.<br>\r\n<br>\r\nWilliam whipped his head around and saw the now helmetless face of Jackson, there was a minot gash above his left eye that was probably caused when his helmet was ripped off his head in the explosion. William also saw McKey, still in his helmet, on the other side of himself.<br>\r\n\"Sir we have to get out of here, the Covenant are crawling all over the place.\" McKey said.<br>\r\n\"We have to get to the rest of the squad.\" William said.<br>\r\n\"There is no one else left sir, they're all dead.\" Jackson said.<br>\r\nWilliam froze for a second then he was on his feet, there was no time to sit around and mourn, not while the Covenant are around. \"Let's move.\"<br>\r\n\"Sir!\" McKey and Jackson replied in unison.<br>\r\nWilliam then noticed for the first time that McKey had a shotgun on his back and that Jackson had a Jackhammer, he hadn't bothered to notice those detail till now.<br>\r\nAs they scrambled up the pile of rubble they caught site of V335's warthog laying on it's side only about 20 meters away, for the fall it seemed to still be in serviceable condition with the worst damage being the smashed windshield.</span></div></div>",
            "created":1299517140,
            "id":1066386,
            "title":"MAYDAY!"
        },
        "1312321":{
            "author_id":"scorch21500",
            "author_name":"Scorch",
            "choices":[
                "They making",
                "The Bashee's persure them."
            ],
            "content":"<div class=\"\"><div> <span>Williams, Jackson and McKay made a break for the warthog. The crack of Williams’s sniper rifle when he shot the elite had alerted all the Covies in the area to their presents and Williams doubted they could make it out of foot; they were going to need the speed and fire power of the ‘Hog.<br>\r\nThe three surviving Marines made it to the ‘Hog a got behind it just at the first whine of plasma weapons were hears and the plasma shots splashed on the ground all around the ‘hog.<br>\r\n“GET IT OVER!” William yelled as the three threw their weight against the ‘hog in an attempt to get it back on its wheels. In the back of their minds they knew ever second they spent there was another second they were closer to death.<br>\r\n<br>\r\nAs they pushed William felt the ‘Gog give a bit and inch by inch they slowly pushed it up till most of the weight was past the halfway point. The Marines fell against the side of the “hog as it suddenly fell onto all four wheels.<br>\r\n“Okay Good, McKay get on the gun and Jackson you get shotgun, move!” William ordered the two privates and they scrambled to take their positions. As soon as McKay was on the gun he swung it around and opened up on the covenants approaching the hog to give Jackson Cover sine the passenger side was on the side with the covenant. As soon as Jackson was in William hit the starter button and hoped it would start, the engine tried a few times and then sputtered to life.<br>\r\n“We’re rolling, next stop anywhere but here!” William yelled as he put his foot down on the accelerator like it was made of lead. The “hog jumped forwards and the covenant scattered to get out of the way, some didn’t move fast enough and the marines felt the “hog jump a bit at the improvised speed bumps.<br>\r\n</span></div></div>",
            "created":1300132260,
            "id":1070272,
            "title":" Moving fast"
        },
        "13123212":{
            "author_id":"scorch21500",
            "author_name":"Scorch",
            "choices":[
                "Stop and  make plans",
                "Keep driving."
            ],
            "content":"<div class=\"\"><div> <span>After they got clear of the Covies around where the ‘Hog had come to a rest after its fall from V355 they turned onto a road “ok, we’ll head south away from the fighting and try and link up with another platoon to—“ William was interrupted by a plasma explosion hitting the road to their left.<br>\r\n<br>\r\n“Heads up, we got Banshees on our tail!” McKay yelled as he started to swing the gun around, as if to confirm what McKay had said three more fuel rod canon shots hit the area around the ‘Hog.<br>\r\n<br>\r\n“Hold on!” William yelled as he pushed the accelerator to the floor and swerved to make the ‘Hog  harder to hit. It was a good thing to as the ground where the “hog had been was strafed by the duel plasma launcher on one of the Banshees. <br>\r\n<br>\r\n“I count four hostile’s in the air, engaging.” McKay said and William felt as well as heard the big gun the took up the entire back half of the ‘Hog spin up and start firing. “Yeah! TAKE IT BITCH!” William heard McKay yell as William swerved again. William looked up ahead and saw the road and surrounding building had been hit hard by artillery, most likely from the Covies’ mortar tanks known as Wraiths. <br>\r\n“hold on, things are going to get a bit bumpy up ahead.” He warned McKay. They were onto the wreckage within a few seconds and now William was not only swerving wildly to try and avoid the hail of plasma fire from above but also to try and avoid the piles of rubble and burned out wreckage that hd once been cars fighters at one point. As he did this he could feel and hear the gun fire periodically up at the Banshees.<br>\r\n As if things couldn’t get any worse it seemed the Covies had been holed up in this area and now they were taking fire not only from the ground but also from the ground forces as well. Do to the gun being take up trying to keep the Banshees from getting a lock onto the ‘Hog Jackson had to deal with the ground forces as best he could, He propped himself up in the passenger seat so he could see over the wind shield and level his assault rifle, this William only heard rather than felt as the Rifle was not as big or as powerful as the gun on the back.  William got in on the fight as well a she ran down a few of the grunts who were unlucky enough to step out in front of the ‘Hog.<br>\r\n<br>\r\nEven with all the fire they were pouring on the area they weren’t going to make it at this rate, they needed a way to either get away from the ground forces or to lose the banshees. Then William saw one that would do both or at least one, a mall with a big glass entrance.<br>\r\n<br>\r\n“Hold on!” William yelled as he jerked the wheel and hit the breaks to make the sharp turn to get up on the sidewalk and then they were smashing through the glass that had somehow survived the bombardment. The roof forced the Banshees to pull up and kept the three marines out of site of them and luckily there were no Covies in the mall.<br>\r\n<br>\r\nAs the ‘Hog flew past burned-out store fronts and signs of combat William began to think about where they should go, the Covies were pushing them further into the city rather than towards the base camp.. Before William could make a choice they reached another entrance to the mall and one of the Banshees flew down and hovered in the doorway turned to fire on them. “JACKSON, TAKE ‘EM OUT!” William yelled and Jackson nodded, then dropped down back below the wind shield. He than grabbed the Jackhammer and got back up with it on his shoulder. <br>\r\n<br>\r\n“And this is where you go bye, bye.” He said and pulled the trigger. The rocket streaked through the air ahead of the ‘Hog and caught the Banshee dead center. It exploded in a mass of red and green fire and black smoke.<br>\r\n“GET DOWN!” William yelled they sped towards the flaming wreckage. Jackson dropped back down and McKay braced himself as the ‘Hog hit the debris and smoke at top speed. There was a bone jarring impact as the four-ton armored recon vehicle plowed through was left of the Banshee, and then all at once they were back in daylight and there wasn’t a Banshee in site. The road ahead of them lead straight into a tunnel which William didn’t mid as the Banshees wouldn’t be able to follow them.<br>\r\n</span></div></div>",
            "created":1300390740,
            "id":1071737,
            "title":"The Chase"
        },
        "14":{
            "choices":[
                "He dumps the jackhammer for something more wieldy",
                "He does the same thing with the other hunters",
                "The hunter's not dead..."
            ],
            "content":"<div class=\"\"><div> <span>The first thing within Andrew's reach was the Jackhammer missile. Knowing where the immense firepower would best fulfill its destiny, he looked and spotted what he was looking for: A hunter. Or more accurately TWO hunters since they always traveled in pairs. Andrews flicked the safety off and activated the two times zoom. He sighted on the hunter's massive chest plate and fired. The hunter must have seen the rocket comming and tried to sidestep it, but failed. THe shaped charge detonated on the hunters shield which blew the monster into ribbons. There was a cry of anguish as the other hunter saw its bond brother go down. It immediately began charging at Andrews and smashed a marine with its massive shield in its mad charge for revenge. He let the other rocket loose but he undershot and blew a file of grunts and an elite to hell. Just as the hunter was about to crush him with its shield, Andrews flung himself sideways and drew his M6d handgun at the same time. The unexpected manuever cost the monster dearly as Andrews fired 5 shots into the exposed patches of orange skin on the hunter's backside. He shakily got to his feet and spat on the hunter's corpse...</span></div></div>",
            "created":1317182220,
            "id":1196516,
            "title":"Rockets Ahoy!"
        }
    },
    "info":{
        "author_id":"scorch21500",
        "author_name":"Scorch",
        "brief_description":"A Halo Interative",
        "created":1288813740,
        "description":"<td align=\"left\" class=\"norm\">This is a Halo Interactive where the main character is a human Marine on colony Carsil 342, and outer colonny that the Covanunt have found. You will follow this Marine as he and his squad attempt to beat back the Covanaunt. <br>\r\nthis story will take place during the Human-Covanaut War before Reach fell. Good Luck!<br>\r\n<br>\r\nThe planet: Carsil 342 is a mining colony that is somewhat close to the inner colonies.There are a few lare cities and small mining towns acrose the surface. ONI has reason to belive that there is an Isurectionist Base on the planet as well and it is unknown waht they will do if encountered.<br>\r\n<br>\r\nSubject: Corpoal Willian Andrews, 26, Male.<br>\r\nBackground: William grew up on the Lunar collany and is the oldest of 3 children ( one brother and youndest is a sister)  and is the Son of  an Navy Captain and a civilan school teacher.<br>\r\nHe grew up in a stable home and was going to become and Enginer till his Brother was killed on Harvest. after that he joined the Mariens. He has seen some combat but not much as they are usualy recalled from planet side before the Covanut could Glass the planet.<br>\r\nCarsil 342 will be his 5th deployment.<br>\r\n<br>\r\nRules:<br>\r\n1) this story takes place before Reach and since Brutes were not \"officially\" encountered till after the battle of Installation 04 the will not appear, likewise  neither will engineers. only Elites, Grunts, Jackals and Hunters will appear.<br>\r\n2) Any of the weapons not part of the brutes( Brutes plasma rifles, brute shots, etc) will not appear, all others will be fine.<br>\r\n3) swearing is okay but don't go crazy.<br>\r\n4) please be somewhat detailed in the fights, No \"He ran up and started shooting and then the grunt was dead\" i want some details in that fights.<br>\r\n5) i may make more.</td>",
        "id":1721729,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1317182220,
        "modified":1317182220,
        "pretty_title":"Carsil 342"
    }
}