{
    "chapters":{
        "1":{
            "author_id":"251enon",
            "author_name":"152",
            "choices":[
                "Moka",
                "Kurumu",
                "Mizore",
                "Kokoa",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks Tsukune?</span></div></span></div>",
            "created":1346482500,
            "id":1417994,
            "title":"Which"
        },
        "11":{
            "author_id":"251enon",
            "author_name":"152",
            "choices":[
                "Inner",
                "Outer"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which version?</span></div></span></div>",
            "created":1346484420,
            "id":1418010,
            "title":"Which halve?"
        },
        "111":{
            "author_id":"251enon",
            "author_name":"152",
            "choices":[
                "when tsukune tries to get another Rosario. (End of capu 2)",
                "Readers choice",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>when does this take place?</span></div></span></div>",
            "created":1412564460,
            "id":1867442,
            "title":"Inner"
        },
        "1111":{
            "author_id":"251enon",
            "author_name":"152",
            "choices":[
                "Give me a foot Rub",
                "Be my seat cushion",
                "Help me bathe"
            ],
            "content":"<div class=\"\"><div> <span>Tsukune wanted to get the Rosary to see the other Moka but was interrupted by Inner Moka, the silver haired beauty who protected him from harm this year and last year from Kuyou. She tried telling him to stay and come with her to the club room but Tsukune was determined to get the rosary.<br>\r\n<br>\r\n\"I'm sorry Moka I have to go!\" Tsukune said about to go around her. In another universe Tsukune get's the rosary and is reunited with her beloved pink haired Moka in this one she decided it was time for him to pay his debt, the human at first felt light headed and then his vision went blank being knocked out.<br>\r\n<br>\r\nTsukune woke up with a striking headache. \"Oww' He stood up and looked around to see nothing but darkness. \"Where am I?\" He then remembered, seemingly moments ago he was with Inner Moka and now he's here in a dark place. \"I guess I better find away back to Yokai Academy first.\" He said walking with his hands in front of him hoping not to hit anything in front of him. \"Why is it so dark, I can't be outside.\" He said as he suddenly felt a flat surface, it felt weird fragile as he can  scratch a tiny hole into it but not through it, it was like. \"Cardboard?\"  Only rather thick.<br>\r\n<br>\r\nLight suddenly started coming from above, Tsukune looks up to see the 'ceiling' moving, he's shocked at what he's looking at. \"M-Moka?\" Indeed what he sees is the now giant face of Moka looking down at him, it must have been twice as big as his whole body if not even more so, she was staring with a menacing glare with her crimson eyes. Tsukune took a step back as he felt a shiver down his spine, he sees her giant pale hand reaching down for him. Tsukune cannot move paralyzed with fear as Moka loomed over him with her angry gaze. Moka's slender fingers wrapped around his tiny body and he was being lifted up until he was eye level with the giant (to him) vampire.<br>\r\n<br>\r\nMoka looked into Tsukune's eyes. 'He's afraid, good.' She thought knowing this will be easier than she anticipated. \"Hello Tsukune.\" She said in a stern voice.<br>\r\n<br>\r\nTsukune snapped out of his fear and looked around realizing he was in Moka's room. Only much, much bigger than he imagined, he then looked into Moka's angry gaze, he collected the courage to speak. \"M-Moka, how did you get so b- no how did I get so small?\"<br>\r\n<br>\r\nMoka smirked as Tsukune trembled being held in her fist. It was almost like when he stood between her and Kurumu last year only much more satisfying. \"Didn't you remember that needle I gave you a few hours ago?\"<br>\r\n<br>\r\nTskune thought back and remembered a pain in his neck before blacking out, his eyes widened with realization. \"You did this, why?\"<br>\r\n<br>\r\nMoka got angry as she (lightly) tightened her fist around her tiny human's body causing him to cry in pain. \"Why? Simple Tsukune I thought it was time that you finally pay your debt.\"<br>\r\n<br>\r\nTskune was cringing in pain and looked to Moka almost afraid to ask. \"M-moka, w-what do you mean debt?\"<br>\r\n<br>\r\nMoka didn't squeeze him this time, though he did hurt her with wanting to replace her with the other Moka she still loved him. \"Let's see, that time I saved you from Saizo, Kurumu, Gin, and all those other idiots that tried to hurt you or our friends.\" She glared daggers at him to drill more fear into him. \"I saved you time and time again and how do you repay me?\" She asked hypothetically. \"You tried to replace me with the other Moka again, a phantom, not caring if I even wanted to put on the rosary or not.\"<br>\r\n<br>\r\nTsukune now realizes what this was about, she didn't want to be sealed in the rosary and he wanted her too in order to see the other Moka again. \"Moka it isn't like that-OWW\" <br>\r\n<br>\r\nMoka squeezed her hand again causing him to wail in pain. \"Know your your place, Tsukune.\" She said angrily. \"This is how you'll repay me Tsukune, your going to be my property, my slave, my pet.\" She said. \"Or I can do other things to you.\" She said glaring into his soul in order to scare him into submission. \"Any objections Tsukune?\"<br>\r\n<br>\r\nTsukune can see her eyes, she wasn't joking, it wouldn't end well for him to displease her and hopefully clear up this misunderstanding . \"I'll do whatever you want Moka.\"<br>\r\n<br>\r\nMoka grinned, at last the boy she had feelings for is now officially at her mercy. \"Good, and until you prove yourself loyal you are only allowed to call me mistress and not my name.\" She said earning a nod from him, Moka squeezed her hand again making him scream in pain.\"Well?\"<br>\r\n<br>\r\nTsukune was in intense pain but complied. \"Y-yes mistress.\"<br>\r\n<br>\r\nMoka smiled. \"Good, I could have done this even if you were normal size but I don't want our friends interfering, we wouldn't want that.\" She began to walk to her bed still holding him up to her face. \"Now to start your first job is to....\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1430558700,
            "id":1972311,
            "title":"Know your place"
        },
        "11111":{
            "author_id":"251enon",
            "author_name":"152",
            "choices":[
                "We should sleep, it's gotten late",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Moka began to walk to her bed still holding him up to her face. \"Now to start your first job is to...\"  She dropped Tsukune on the bad and chuckled seeing him bounce on the impact. Moka sat on the bad seeing im jump from her sitting, furthering her cackling.  The vampire began takng her shoes off than her socks and tossing them off the bed, she then placed her beautiful bare feet at Tsukune's sides who covered his head fearing she would hit him. \"Rub my feet.\"<br>\r\n<br>\r\nTsukune looked to see Moka's giant bare feet plopped on their heels, they were big compared to him. His head only came up to just under the balls of her feet.<br>\r\n<br>\r\nMoka glared angrily down at her tiny human pet. \"Get to it.\"<br>\r\n<br>\r\nTsukune shook his head and decided it was best to please her. Tsukune ran to her right foot first and placed his hands on the arch of her foot forming circles with his hands. The human never massaged anyone in his life, and certainly not given anyone a foot rub. Gulping he pops his head from the side of her foot to see Moka's face. She looked displeased, Tsukune went back to work and charged his shoulder into her sole hoping it' have her relaxed.<br>\r\n<br>\r\nMoka closed her eyes and smiled contently. \"Mmmm, that's more like it, keep at it.\" She said lying down as her love interest did everything he could to please her.<br>\r\n<br>\r\nTsukune sighed relieved that he managed to please her, hopefully he can get her in a good mood and convince her that it was a misunderstanding. The human would make circles around Moka's foot and pushing with his back to add force, it looks as though this was working he began to have confidence that she'd be ok with his current effort. Now though he was nervous he started to notice how Moka's feet felt, smooth, clean, no sweat, and they didn't smell either. They actually rather had a nice aroma, smelling like roses.<br>\r\n<br>\r\nAs if she read his mind Moka began to talk, though she was still lying down with her head on her pillow.. \"Your very lucky Tsukune, that I take great care of my feet, but that could change depending on your behaivior, I'll make your job harder for you by letting them stink if you ever do something displeasing, understand?\" <br>\r\n<br>\r\nTsukune cannot see Moka's head due to her lying down but knew better than not to answer. \"Y-yes mistress.\"<br>\r\n<br>\r\nMoka smiled to her self pleased that he knew his place. \"Good, that's enough of my sole, massage my toes next.\" She ordered casually.<br>\r\n<br>\r\nTsukune put raised his arms to reach for her pinky toe but ionly managed to touch the bottom of it. \"Mo-uh Mistress, I can't reach.\"<br>\r\n<br>\r\nMoka opened her eyes and sat up again to see Tsukune struggle to reach for the pinky toe of her foot. \"Hahaha, It looks like I might have made you too small.\" She said amused at his pitiful efforts. \"Very well step to the side for a bit.\" She ordered having Tsukune step  away as she placed her foot flat on the bed. \"Alright now get started on my toes.\"<br>\r\n<br>\r\nTsukune began walking around the giant foot and got the toes. Tsukune pressed his hands on her pinky toes.<br>\r\n<br>\r\nMoka watched as her little man massage toe after toe, very pleased by his efforts. The human then began massaging the big toe with all his might, looking up with a worried  look on his face. Moka chuckled at the fear on his face. \"Your doing a good job, keep this up and you might be done soon.\" She reassured.<br>\r\n<br>\r\nTsukune went back to massaging Moka's big toe, pressing on it with all his might. 'If I keep this up, maybe she'll let me talk to her and we can get through this hole mess.' He thought as rubbed the smooth skin.<br>\r\n<br>\r\nMoka sees Tskune working his fingers to the bone, she truly enjoyed being dominant over him. \"That's good enough Tsukune now my other foot needs your attention.<br>\r\n<br>\r\nTsukune looked to see Moka with her grin and spoke. \"Yes mistress.\" And so the same process repeated on Moka's other foot, when he was done he was tired and hoped Moka would let him rest, rubbing two giant feet can be exhausting.<br>\r\n<br>\r\nMoka stared down at Tsukune and grinned at his exhaustion. It's only been a day and already he's doing his best to please her. \"Alright Tsukune, now before you rest you have one job left.\" She sees the worry in his eyes and chuckled. \"Don't worry it won't take that much ever, just finish the job by kissing my toes.\"<br>\r\n<br>\r\nTsukune's eyes widened. \"Y-you want me to k-kiss your toes, your kidding right?\" This Moka, Inner Moka would never have him do something so degrading would she?<br>\r\n<br>\r\nMoka smiled down  at him. \"Ha, do I look like I'm kidding?\" She asked frowning which made Tsukune scared as Moka's right foot rose and hovered over Tsukune's diminutive form making him trip and land flat on his back against the mattress his view covered by the sole and toes of Moka's foot. \"I did say I can do other things to you, didn't I?\"<br>\r\n<br>\r\nTsukune was scared he began to beg. \"Mo-Mistress, please don't I-I'll do whatever you want just don't hurt me please!\"<br>\r\n<br>\r\nMoka's foot was put right back where it was, making Tsukune look up to see Moka with her disappointed frown. <br>\r\n<br>\r\nMoka glared at him. \"Kiss my toes, now.\" She demanded.<br>\r\n<br>\r\nTsukune stepped in front of her right big toe and puckered his lips. He always wanted to kiss either Moka, but not like this. His lips met Moka's toe, it wasn't that bad, her skin felt cool and nice to kiss. The human walked and kissed every toe all while being watched by his mistress, he then stopped and looked to Moka toknow what to do next.<br>\r\n<br>\r\nMoka looked disappointed. \"I didn't say stop, keep kissing each toe back and forth until I say stop. \" She demanded coldly.<br>\r\n<br>\r\nTsukune didn't say anything, hoping to get in her good side again he kissed every toe back and forth as he listened to Moka speaking to him.<br>\r\n<br>\r\nMoka smiled as he kissed every toe. \"You know this is fitting for you, after all I always kicked anyone who tried to harm you, it's only fair you show my feet some appreciation, don't you think Tsukune?\"<br>\r\n<br>\r\nTsukune stopped and looked up at Moka. \"Y-your right mistress, I should.\" He said as he got back to kissing her middle toe.<br>\r\n<br>\r\nAfter a while Moka thought of something else. She looked down at her pet. \"Alright Tsukune, you can stop now.\" Tsukune stopped and looked up at the giant vampire. \"Alright Tsukune, I think now we...\"<br>\r\n<br>\r\nP</span></div></div>",
            "created":1430599140,
            "id":1972554,
            "title":"Foot rub"
        },
        "111111":{
            "author_id":"251enon",
            "author_name":"152",
            "choices":[
                "In the morning 1",
                "In the morning 2"
            ],
            "content":"<div class=\"\"><div> <span>\"We should sleep it's gotten late.\" Moka said looking at the clock, it was already 10PM and she had classes in the morning. The vampire looked down at Tsukune and grabbed him in her fist, She held the human close enough for him to feel her cool breath. <br>\r\n<br>\r\nTsukune decided to ask. \"Um Mo- I mean mistress, what about our friends, they'll wonder where I-\"<br>\r\n<br>\r\n\"Let me deal with that, but now Tsukune, you and I are going to have to talk about your first job today.\" She said with a serious look on her face and a frown.<br>\r\n<br>\r\nTsukune gulped. \"Oh um, yes, um did you like it mistress?\"<br>\r\n<br>\r\nMoka made a light smile, at Tsukune as he tried his best to show he was loyal. Then she had an evil grin on her face at what she had planned for him, this caused him to gulp in worry. The vampire put one finger on Tsukune's head petting him. \"Now Tsukune, your massage was enjoyable, but, I'm afraid it was...metiocre at best.\"<br>\r\n<br>\r\nTsukune started to panic. \"M-mistress, I-I'm sorry, I'll try I harder I OWW!\" He screamed as Moka increased her grip on the boy.<br>\r\n<br>\r\nMoka glared at him. \"Dont. Interrupt.\" She said in a warning tone. \"Not to worry though, I did enjoy it, but you'll have to do better at knowing how to rub my feet.\" She said.<br>\r\n<br>\r\nTsukune didn't say anything, he listned not wishing to be in anymore pain from Moka's wrath.<br>\r\n<br>\r\nMoka got her evil grin back as she looked at Tsukune. \"So what better way for you to learn how to please me then by spending time with my feet?\" She asked.<br>\r\n<br>\r\nTsukune looked at the silver haired beauty and gulped. \"What do you mean, mistress?\"<br>\r\n<br>\r\nMoka stood up and bended down with Tsukune still wrapped in her hand, she then lifted up a sock in front of Tsukune. Tsukune then realized what she meant. <br>\r\n<br>\r\nMoka laughed. \"I trust you know where this is headed, now Tsukune perhaps I'll let you sleep in a more pleasing area on my body once you've improved on massaging my feet, but for now this is where you'll be spending your time sleeping and while I go to class.\" She said with a smile.<br>\r\n<br>\r\nTsukune's eyes widened. \"B-b-but Moka, I-I mean mistress y-you'll crush me if I'm in your sock while your walking.\"<br>\r\n<br>\r\nMoka shook her head. \"I'm not a fool, the potion I used to shrink you also made you indestructible.\" She says as she now holds Tskune's body by the collar of his uniform. \"You will be safe I promise.\" She says as she hovers Tsuknue's body over her sock, she can still see the fear in his eyes, she felt pity for him after all she still loved him, with a smile she puckered her lips and pressed them against Tsukune's tiny face, when she pulled back she sees Tsukune's face turn red from his blush. \"That's for good luck now down in you go.\" She said as she dropped him into her sock, she then put the sock on, she felt Tsukune's head between her toes and his body under her sole. The vampire then placed her foot down hearing him grunt with her accute senses, she chuckled as she lied down in bed, when she got the covers on she got another evil idea. \"Oh and Tsukune, in exchange for the kiss I'd like you to kiss my foot in my sleep, atleast for an hour.\" She said grining.<br>\r\n<br>\r\nTsukune was still in a daze from the combination of Moka, INNER Moka kissing him and being stepped on by the vampiress, he then heard his order and blushed. 'Moka, I hope I can make things right.'<br>\r\n<br>\r\nMoka then felt her toes kissed and closed her eyes in delight. 'I wonder what we'll do tommorow.'<br>\r\n<br>\r\n</span></div></div>",
            "created":1446443400,
            "id":2055893,
            "title":"We should sleep, it's gotten late"
        },
        "1111111":{
            "author_id":"251enon",
            "author_name":"152",
            "choices":[
                "A Bath",
                "Breakfast"
            ],
            "content":"<div class=\"\"><div> <span>Mona's eyes opened and closed a bit hearing that annoying alarm clock, she slammed her fist on it breaking the clock to pieces along with the dresser it was on. She rose her arms yawning, she was only wearing a tank top and short shorts. She rested her arms and looked at her right foot smiling as she felt Tsukune's body against her sole. \"Hmm, he's probably very uncomfortable.\" She waved her foot feeling Tsukune's body is tight in her sock. \"Well better let him out.\" She rose her foot and took off her sock letting him hit the bed below the shadow of her foot.<br>\r\n<br>\r\nTsukune's eyes opened, they were groggy at first but once they were adjusted he sees Moka's giant foot above him. \"Ah!\" He instinctively yelled.<br>\r\n<br>\r\nMoka smirked as she pressed her foot down, squeezing her big and second toe around Tsukune's head. She looked down at the minuscule human below her foot, with a fanged smile she spoke. \"Good morning Tsukune.\"<br>\r\n<br>\r\nThe human looked up from between the toes of the foot he spent all night with. \"Mo- Mistress, good morning.\" He said trying to sound sincere, the gigantic foot on him wasn't too uncomfortable it still smelt of cherries and it was just as soft as ever.<br>\r\n<br>\r\n\"Mmm\" Moka pressed down on her foot a bit making Tsukune wince. \"That is no way for a pet to greet their master. Give my foot some morning kisses.\"<br>\r\n<br>\r\nHoping she will get her foot off of him her kisses the beg and second toe repeatedly, he even had some neck room to kiss her crevice, the space between her gigantic peds.Feeling that familiar cool touch his lips made him feel almost ecstatic to kiss her foot.<br>\r\n<br>\r\nMona laughed that sounded booming to Tsukune's  tiny ears and rose her foot up. She put her leg at the side of the bed to let her pet human stand up. \"You will do that every morning right?\" She gave a threatening look for fun.<br>\r\n<br>\r\nTsukune turned blue from that and bowed. \"Y-yes my mistress!\" He looked up to take in how beautiful Moka was, that tank top showed her belly button and her cleavage. Those shorts showed her giant, goddess like legs. Her size seemed to make her more appealing to him, she was more dominant than she ever was before, he was taking out of his thoughts when he was grabbed and hoisted up to her giant crimson eye.<br>\r\n<br>\r\n\"Enough gawking it's time for-\"</span></div></div>",
            "created":1520452320,
            "id":2461854,
            "title":"Inner Moka's morning foot kisses"
        }
    },
    "info":{
        "author_id":"251enon",
        "author_name":"152",
        "brief_description":"Tsukune shrinks and one of the girls of Yokai Acadamy take him.",
        "created":1346482380,
        "description":"<td align=\"left\" class=\"norm\">No Yukari. No male besides Tsukune. No occ without a reason. no dying.</td>",
        "id":1888607,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1520452320,
        "modified":1520452320,
        "pretty_title":"Rosario + Vampire Shrink"
    }
}