{
    "chapters":{
        "1":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "James",
                "Lisa",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First choice.<br>\r\n<br>\r\nJames or Lisa? Or both?<br>\r\n</span></div></span></div>",
            "created":1087621200,
            "id":203887,
            "title":"First choice"
        },
        "11":{
            "author_name":"Reader#4",
            "choices":[
                "Big James helps James get fat",
                "Big James shows James around",
                "Suddenly James starts to grow fat",
                "Big James takes James to a \"get fat\" store",
                "Big James introduces James to his \"Big Buddies\""
            ],
            "content":"<div class=\"\"><div> <span>James always wanted to be fat but he was afraid that he would be made fun of so he never tried.<br>\r\nHe had a summer job as a lab worker at the local university. Mostly he just swept and polished the machines in the lab.<br>\r\n<br>\r\nOne day while he was cleaning up in the lab he noticed a new piece of machinery. It looked like a large metal circle. On a nearby table there was a remote control. James picked it up and walked near the circle and looked at the remote.<br>\r\n<br>\r\n\"I wonder what this does.\" says James checking out the remote. Sudenly, James accidently hit a button, the circle opened up, and the next thing James new he was falling.<br>\r\n<br>\r\nAfter a little while of falling James saw abright light and then he stopped falling. He had landed on something soft and warm. James looked around and realized he was in his room.<br>\r\n<br>\r\n\"Hey will you get off of me?\" Came a voice from the big cushion he had landed on. It sounded just like his voice.<br>\r\n<br>\r\nThen he realized that he had landed on someones stomach!<br>\r\n<br>\r\n\"Oh I'm sorry. I don't how I...\" As he got off he saw the face of the person he landed on. Only he saw himself looking back!! The guy looked exactly like James only he was incredibly fat!<br>\r\n<br>\r\n\"Ahhh!!!\" they both yelled.<br>\r\n<br>\r\n\"Woah! Who are you?\" asked the large James.<br>\r\n<br>\r\n\"I'm James. Who are you?\" said James.<br>\r\n<br>\r\n\"I'm James.\" said the large James.\"How'd you get here?\"<br>\r\n<br>\r\n\"Well I was working at the lab and then I got sucked into this machine and...\"suddenly James remembered that the people in the lab had been trying to find a way into another dimension and he must have landed IN that other dimension!!!\"Oh my gosh!! I've been sent to another dimension!!!\"<br>\r\n<br>\r\n\"You're from another dimension?\"asked big James.\" Then you must be me, only from YOUR world. Why are you so small?\"<br>\r\n<br>\r\n\"Why are YOU so big?\" asked James.<br>\r\n<br>\r\n\"Well here in Blubberberg, being fat is good for you and is considered attractive.\" said big James.<br>\r\n<br>\r\n\"Wow its just the opposite in my world. I think I'm going to like it here.\" says James. <br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1087794000,
            "id":204161,
            "title":"Welcome to Fatland"
        },
        "111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Big James shares his stash with you...",
                "Big James takes you down to the lunchbar..."
            ],
            "content":"<div class=\"\"><div> <span>\"Why are YOU so big?\" asked James.<br>\r\n<br>\r\n\"Well here in Blubberberg, being fat is good for you and is considered attractive,\" said big James.<br>\r\n<br>\r\n\"Wow its just the opposite in my world. I think I'm going to like it here,\" says James. <br>\r\n<br>\r\n\"Not at your current size though,\" remarks Big James.  \"You're so skinny, boys will make fun of you, and people will pity you.  We've gotta get you fat!  It will be fun to have a twin...\" Big James concludes.<br>\r\n<br>\r\n\"How am I going to get fat?\" James replies.  \"I mean, I know I can eat more, but it'll take a while to get as big as you.\"<br>\r\n<br>\r\n\"Yeah, but the sooner you start, the better,\" notes Big James.  \"Here, I keep a stash of snacks in my desk, and there's a lunchbar downstairs...\"<br>\r\n</span></div></div>",
            "created":1133413200,
            "id":287047,
            "title":"You need to get fat!"
        },
        "1111":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "To get more on the moobs",
                "To get more on the belly",
                "Your Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Big James got his stash out &amp; stuffed it Little James mouth. He had never felt so hungry. He had started off at 60 lb., now he was well over 150 lb. He was getting huge. He had to waddle everywhere now. Then Big James said \"Hmmm, you need...</span></div></span></div>",
            "created":1233205200,
            "id":640479,
            "title":"Little James Becomes Big James"
        },
        "1112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "at least twice his weight",
                "three times his weight"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, but the sooner you start, the better,\" notes Big James. \"Here, I keep a stash of snacks in my desk, and there's a lunchbar downstairs.\"  Big James' tummy chose that moment to rumble hungrily.  Big James looked at the watch on his fat forearm.  \"It's lunchtime!\" he remarked happily. \"Let's go get you started on eating and growing.\"<br>\r\n<br>\r\nBig James led the way into the hallway and down towards the elevators.  As James trailed along behind him, he realised that Big James might be even bigger than he thought.  While James was not an insubstantial guy himself - his pudgy 225 pounds on a six foot frame had brought him some kidding and teasing, especially back in high school - Big James was a whole lot bigger.  James figured Big James had to be....</span></div></div>",
            "created":1151643600,
            "id":327636,
            "title":"How big is Big James"
        },
        "112":{
            "choices":[
                "They go to an all you can eat place",
                "They stay home and rade Large James' fridge"
            ],
            "content":"<div class=\"\"><div> <span>\"Well why don't I show you around the city?\" said the fatter James.  \"Yeah I'd really like to see this new and fatter world\" said small James.  Large James took James around and showed him all his favorite hang-outs most of which seemed to be all you can eat places.  That must have been one of the reasons that he was so fat.  Afterwards Larger James introduced James to some of his freinds.  \"James, I'd like you to meet Isaiah, He has been my freind since first grade.  Isaiah, James.  James, Isaiah\"  \"Nice to meet you little guy\" said Isaiah Jovially.  \"The pleasures all mine\" said James smiling.  \"Now where is a good place to eat around here?\" said James.</span></div></div>",
            "created":1145077200,
            "id":313171,
            "title":"Looking around and meeting some freinds"
        },
        "113":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "are a little smaller than the guys...",
                "are fatter than the guys, though..."
            ],
            "content":"<div class=\"\"><div> <span>\"You're from another dimension?\"asked big James.  \"Then you must be me, only from YOUR world. Why are you so small?\"<br>\r\n<br>\r\n\"Why are YOU so big?\" asked James.<br>\r\n<br>\r\n\"Well, here in Blubberberg, being fat is good for you and is considered attractive,\" said big James.<br>\r\n<br>\r\n\"Wow, it's just the opposite in my world. I think I'm going to like it here,\" says James. \"I've always wanted to be fat.\"<br>\r\n<br>\r\n\"People really think it's better to be thin in your dimension?\" asks big James.  \"Weird.  Thinnies are so ugly - meaning no offense.\"<br>\r\n<br>\r\n\"Oh, that's ok, I think thin people are ugly too - especially girls.\"<br>\r\n<br>\r\n\"Girls are thin in your dimension too?\" asks James.  \"That must be horrible!  Here in Blubberberg we are all fat!  The girls...<br>\r\n</span></div></div>",
            "created":1114146000,
            "id":246330,
            "title":"Comparing dimensions"
        },
        "1131":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "362 pounds...",
                "426 pounds..."
            ],
            "content":"<div class=\"\"><div> <span>\"Girls are thin in your dimension too?\" asks big James. \"That must be horrible! Here in Blubberberg we are all fat! The girls are a little smaller than the guys here, but they're also shorter - and some of them aren't smaller, they're huge.  But there are some huge guys too.\"<br>\r\n<br>\r\n\"Huge guys?\" asks James.  \"You're pretty huge yourself!\"<br>\r\n<br>\r\n\"Oh, no really,\" replies big James.  \"I'm a pretty ordinary size for a guy our age, I weigh...</span></div></div>",
            "created":1114146000,
            "id":246332,
            "title":"How big is big James?"
        },
        "11311":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "amazement",
                "joy"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, no really,\" replies big James. \"I'm a pretty ordinary size for a guy our age, I weigh 362 pounds.  I'm still gaining, though - I'd like to make it to 400.\"<br>\r\n<br>\r\nWhile big James is talking, James suddenly feels that his pants are too tight.  His stomach rumbles loudly, and he looks down to see that he has a tiny gut pooching over his belt.  His chest seems different too - and the hollow spaces on his hands seem to be filling up.<br>\r\n<br>\r\n\"I'm getting fat!\" he says in ...</span></div></div>",
            "created":1114146000,
            "id":246333,
            "title":"James starts to grow"
        },
        "113111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "James is as big as Big James...",
                "James' pants split at the seams - oww!"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n\"I'm getting fat!\" James says in amazement.  \"Look at that!\"  He gestures towards his growing gut with one hand, as it continues to grow over his belt.  His chest swells with fat, as does the rest of his body - and his clothes get tighter and tighter.<br>\r\n<br>\r\n\"This is great!\" Big James says in approval.  \"The bigger you are, the better you'll fit in here.\"<br>\r\n<br>\r\n\"Boy, my clothes are getting tight though,\" James remarks.  \"Painfully tight.  Guess I'd better get rid of this belt.\"  He undoes the buckle and the button on his pants - which immediately fly open under the weight of his growing gut.  His shirt's buttons are gaping, and as he tries to undo them, one of them flies off towards Big James.  <br>\r\n<br>\r\n\"You're getting really big!\" remarks Big James as a button pings into his belly.  \"Wish I could grow that easily,\" he adds wishfully.  He keeps watching as James grows and grows, until...</span></div></div>",
            "created":1118293200,
            "id":255459,
            "title":"James keeps growing"
        },
        "1131112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "that you're about my size...",
                "that you're bigger than I am!"
            ],
            "content":"<div class=\"\"><div> <span>\"You're getting really big!\" remarks Big James as a button pings into his belly. \"Wish I could grow that easily,\" he adds wistfully. He keeps watching as James grows and grows, until suddenly there is a gentle ripping sound from James' pants.  He bends over to look down and hears a massive ripping sound as his pants split at the seams, followed by his shirt.  In moments, James is standing there, clothed only in shreds of his former garments - he realises that even his underpants are ripped.<br>\r\n<br>\r\nBig James looks at him in astonishment. \"I've never seen anyone expand just like that!\" he finally says.  \"You need new clothes!  I think I have some spares here.\" Big James waddles over to his desk as James stands still, hoping no-one comes in through the door while he's standing in shreds of clothing.  Big James comes back and hands James a pair of shorts and a t-shirt.  \"Here, I wear these to play volleyball,\" Big James says.  \"They'll do until you can get more.  I think...</span></div></div>",
            "created":1120626000,
            "id":259911,
            "title":"James has grown huge!"
        },
        "11311122":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "607 lb.",
                "533 lb."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“I think that you’re bigger than me now. Wow I guess I’m Little James now. I wish that I could be that big. You’re about 200 lb. bigger than me &amp; I’m about</span></div></span></div>",
            "created":1244523600,
            "id":705476,
            "title":"Little James is Now Big James (or should I say Big"
        },
        "113111221":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Looked like the Axiom in Wall-e",
                "Looked like a fast-paced mansion"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm 607 lb. That's pretty heavy in our world.\" Little James (the James of Blubberburg is now smaller than our protagonist) said. That makes you over 807Then he called the special Fat Center to bring in special equipment for those who want to gain even more than anyone else.<br>\r\n<br>\r\nIn about an hour the came in with the cart to carry you. You were brought outside where you saw lots of fat people. What surprised you even more was the advancement of technology in this dimension</span></div></div>",
            "created":1244523600,
            "id":705491,
            "title":"Going to the Fat Center"
        },
        "11312":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "950 pounds...",
                "1150 pounds!"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, no really,\" replies big James. \"I'm a pretty ordinary size for a guy our age, I weigh 426 pounds. I'm still gaining, though - I'll to make it to 500 pounds in the next few years.\"<br>\r\n<br>\r\n\"How big do guys get here?\" asks James, his brain feeling fried as he tries to imagine his big namesake - or anyone else - wanting to be 500 pounds.<br>\r\n<br>\r\n\"Oh, very big!\" replies James grinning.  \"There are guys here whose mothers and girlfriends and wives really want them to grow!  They eat and eat, and grow huge - why even in my class there's a guy who weighs 700 pounds, and one of my classmates has an uncle who weighs...<br>\r\n</span></div></div>",
            "created":1125032400,
            "id":269856,
            "title":"Guys can get really big here..."
        },
        "113122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "down to the cafeteria...",
                "out to Big Donald's Burgers..."
            ],
            "content":"<div class=\"\"><div> <span>\"There are guys here whose mothers and girlfriends and wives really want them to grow!\" says James with a grin.  \"They eat and eat, and grow huge - why even in my class there's a guy who weighs 700 pounds, and one of my classmates has an uncle who weighs 1150 pounds!\"<br>\r\n<br>\r\n\"1100 pounds!\" James says in disbelief.  \"But that's impossible - he'd have a heart attack or something.\"<br>\r\n<br>\r\n\"No, he's in good health, I think - certainly he still gets around.  My dad's 850 pounds, and he has no troubles.\"<br>\r\n<br>\r\n\"That's huge!\" James says, disbelieving.<br>\r\n<br>\r\n\"Better fat than skinny!\" retorts Big James, then apologises.  \"Sorry - where you're from you probably don't have much choice.  But since you're here, you can fatten up!\"<br>\r\n<br>\r\n\"You know, I've always wondered what it would be like to be fat,\" James said in return.  \"I like to eat, but in my world fat is seen as a negative.\"<br>\r\n<br>\r\n\"Well, if you like to eat, you've come to the right place!\" says Big James happily.  \"It's almost lunchtime, I'll stop and take you...<br>\r\n<br>\r\n   </span></div></div>",
            "created":1133499600,
            "id":287298,
            "title":"James likes to eat"
        },
        "114":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "300 pounds...",
                "400 pounds..."
            ],
            "content":"<div class=\"\"><div> <span>\"Wow, it's just the opposite in my world. I think I'm going to like it here.\" says James. <br>\r\n<br>\r\n\"People will stare at you though,\" remarks Big James.  \"You'll have to get fat.\"<br>\r\n<br>\r\n\"Huh, that should be easy,\" replies James.  \"I'll just eat more and forget the diets my mum has tried on me.\"<br>\r\n<br>\r\n\"Oh, you should be on a diet,\" says Big James, concerned.  \"It's not healthy to be your size.\"<br>\r\n<br>\r\n\"But I don't want to get skinnier,\" says James.<br>\r\n<br>\r\n\"Oh, is that what diets do in your world?\" asks Big James.  \"Here a diet is for gaining weight, for people who have trouble being skinny.  And you sure are skinny!\"<br>\r\n<br>\r\nBig James walks over to James and extends his hand to help him up.  At close range, James realises that Big James is even bigger than he thought - James guesses Big James must weigh at least...<br>\r\n</span></div></div>",
            "created":1109912400,
            "id":238437,
            "title":"Many things are reversed in Blubberland..."
        },
        "1142":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "a good weight - and I'm still growing!",
                "pretty light - I want to gain a lot more!"
            ],
            "content":"<div class=\"\"><div> <span>Big James extends a hand to help James up. At close range, James realises that Big James is even bigger than he thought - James guesses Big James must weigh at least 400 pounds.  He's huge - his whole body is covered in a thick layer of fat, not just his big gut and heavy pecs. <br>\r\n<br>\r\n\"C'mon,\" says Big James, \"I'll take you to the Fat Store, they'll get you started gaining to a normal size.\"  Big James continues to hold James' hand as he starts to lumber forward.  James is so fascinated by watching Big James' size at close range that he doesn't notice for a moment that Big James still has his hand.<br>\r\n<br>\r\n\"Hey, do guys hold hands here?\" James asks, as he gently tries to pull his hand away.  Big James, obviously surprised, lets go.<br>\r\n<br>\r\n\"Don't guys hold hands in your dimension?\" he asks.  <br>\r\n<br>\r\n\"No,\" replies James.  \"Why do you do it here?\"<br>\r\n<br>\r\n\"Well, the Africans started it,\" replies Big James, \"and since they're the biggest and fattest guys - they have the best fashions! - everybody does it now.\"<br>\r\n<br>\r\n\"The Africans are the fattest?\" James replies in shock.  \"In my world Africa is full of starving people.\"<br>\r\n<br>\r\n\"Oh no, Africa is rich, with lots of food,\" replies Big James.  \"Black guys get so big - it's cool!  I hope to get as big as some of the black guys I know - one of they, Wakil, is really huge!\"<br>\r\n<br>\r\nJames stayed quiet and thought hard for a while, as the two of them proceeded down a hallway and into an elevator.  This building looked like the lab building where James worked, but different - the doors were bigger for one thing, and the benches were all wider.  He followed Big James into a spacious elevator and asked, \"Can I ask you, how big are you?  Where I come from, sometimes big people don't like to be asked about their size.\"<br>\r\n<br>\r\nBig James chuckled and replied, \"Oh, here it's the skinny people who don't want to talk about their weight!  I weigh 411 pounds - for my, well our, height, that's...</span></div></div>",
            "created":1111035600,
            "id":240394,
            "title":"Big James starts to explain about Blubberland"
        },
        "11421":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "looked at Big James and licked her lips",
                "looked at James with pity in her eyes"
            ],
            "content":"<div class=\"\"><div> <span>Big James chuckled and replied, \"Oh, here it's the skinny people who don't want to talk about their weight! I weigh 411 pounds - for my, well our, height, that's a good weight - and I'm still growing! I hope to put on another 40 pounds this year.\"<br>\r\n<br>\r\nThe elevator halted and the doors opened.  James watched Big James waddle out into a sunlit lobby, just like the one back on his world.  Watching Big James strut his fat body was, James had to admit, fascinating - James was really wondering what it would be like to be so big, and so uninhibited about his size.  Big James turned his head and said, \"C'mon, the Fat Store's not far.  You may attract some stares, but ignore the.  I'm going to pick up some stuff there myself.\" <br>\r\n<br>\r\nJames followed Big James out into the sunshine, onto a science campus that looked very familiar, yet subtly different.  Big James headed towards a street corner where in James' world there was a walk-in medical clinic - but here, there was a glass-fronted store, with a huge neon sign that proclaimed, \"The Fat Store\".  As James walked along behind Fat James, he saw a very fat but beautifully stacked girl about their ages coming the other way.  As she got closer, she...</span></div></div>",
            "created":1111035600,
            "id":240396,
            "title":"Heading out to the Fat Store"
        },
        "114212":{
            "author_id":"spuffyromy",
            "author_name":"spuffyromy",
            "choices":[
                "50 pounds bigger",
                "100 pounds bigger"
            ],
            "content":"<div class=\"\"><div> <span>The girl looked at skinny James with pitty in her eyes oh you poor man we will fix you up in no time she says patting his head like a kid.<br>\r\nThe girl hooked arms with skinny James and walked hin to a chair like you would see in a dentis office.<br>\r\nThe girl whose name turned out to be betty grab his arm injected him with something then placed a band aid on it.<br>\r\nthen Betty laid the Chair all the way back and placed a tube in his mouth.<br>\r\nBetty turnd on the machine conected to the tube warm sweet stuff pumped in his mouth.<br>\r\nThere you go sweetie I'll be back in a bit says Betty as she walks out.<br>\r\n<br>\r\nJames can feel his clothes tightening see his belly push out as his shirt rides up.<br>\r\nPing his pants buttion popped off zipper pushed down his belly filling the gap.<br>\r\nBetty returned she walked over to the machine turned it off alright honey that should catch you up to the rest of us she says.<br>\r\nNow the injection should turn half of whatever you eat into fat and we have been feeding you our fat mix though the tube expland Betty.<br>\r\nBetty takes the tube out of his mouth and helps him up he looks down at his pot belly and guesses himself to be   </span></div></div>",
            "created":1359914400,
            "id":1523429,
            "title":"looked at James with pity in her eyes"
        },
        "11422":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "rubbed up against Big James",
                "looked at James with disgust in her eyes"
            ],
            "content":"<div class=\"\"><div> <span>Big James chuckled and replied, \"Oh, here it's the skinny people who don't want to talk about their weight! I weigh 411 pounds - for my, well our, height, that's pretty light - I want to gain a lot more! Most of my friends are over 500 pounds now.\"<br>\r\n<br>\r\nThe elevator halted and the doors opened. James watched Big James waddle out into a sunlit lobby, just like the one back on his world. Watching Big James strut his fat body was, James had to admit, fascinating - what would it be like to be so big?  And Big James wante to get even bigger!  <br>\r\n<br>\r\nBig James turned his head and said, \"C'mon, the Fat Store's not far. You may attract some stares, but ignore them. I'm going to pick up some stuff there myself.\" <br>\r\n<br>\r\nJames followed Big James out into the sunshine, onto a science campus that looked subtly different. Big James headed towards a street corner where in James' world there was a medical clinic - but here, there was a glass-front, with a huge neon sign that proclaimed, \"The Fat Store\". As James walked along behind Fat James, he saw a very fat but beautifully stacked girl about their ages coming the other way. As she got closer, she... <br>\r\n</span></div></div>",
            "created":1112072400,
            "id":242177,
            "title":"Big James is not big enough!"
        },
        "114222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "a hundred pounds heavier...",
                "two hundred pounds heavier..."
            ],
            "content":"<div class=\"\"><div> <span>As James walked along behind Fat James, he saw a very fat but beautifully stacked girl about their ages coming the other way. As she got closer, she looked at James with disgust in her eyes.  \"Ewh,\" her pursed lips seemed to indicate, \"how gross!\"  She didn't actually speak, but waddled her stacked self as far away on the sidewalk as she could while they passed.<br>\r\n<br>\r\n\"See what I mean,\" said Big James, pausing and looking back at James after a moment.  \"She didn't find you very attractive, did she? Kind of like looking at a bug,\" he went on.  \"But, I'll tell you something to make you feel better - she's not that hot herself, she's too small!  Really beautiful women here are at least...</span></div></div>",
            "created":1118293200,
            "id":255458,
            "title":"She finds James unattractive!"
        },
        "1142222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "over 500 pounds too...",
                "a LOT bigger than the women..."
            ],
            "content":"<div class=\"\"><div> <span>\"...she's not that hot herself, she's too small!\" said Big James reassuringly.  \"I think she's about 280, 290 pounds.  Really beautiful women here are at least two hundred pounds heavier than that - to get on the cover of Vogue they really have to be over 500 pounds.\"<br>\r\n<br>\r\nJames gasps inwardly.  500 pounds?  To be on a magazine cover? Incredible.  Then it strikes him - Big James says he's small, wants to gain a lot more weight, even though he's alread 411 pounds!  Are the women here smaller than the men....or BIGGER?<br>\r\n<br>\r\n\"So,\" begins James diffidently, walking along behind Big James and trying not to attract much attention, \"if the girls are supposed to be 500 pounds, what size dot they want guys to be?  What size are the guys in the men's fitness magazines?\"<br>\r\n<br>\r\n\"Oh,\" replies Big James casually, \"they're...</span></div></div>",
            "created":1133499600,
            "id":287287,
            "title":"If beautiful women are so big....how big are men?"
        },
        "11422221":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "just over 550 pounds...",
                "about 700 pounds..."
            ],
            "content":"<div class=\"\"><div> <span>So,\" begins James diffidently, walking along behind Big James and trying not to attract much attention, \"if the girls are supposed to be 500 pounds, what size do they want guys to be? What size are the guys in the men's fitness magazines?\"<br>\r\n<br>\r\n\"Fitness magazines?\" asks Big James quizically after a pause, \"Oh, you must mean men's fashion and fatness magazines? Nobody worries about 'Fitness' here, excepting the odd athlete...there certainly aren't magazines about it! The guys in the fashion mags are a bit bigger than the women in the fashion mags - taller, you know, and a bit fatter.  Last year the \"Most Handsome Man\" in Playgirl was ... <br>\r\n</span></div></div>",
            "created":1146632400,
            "id":316875,
            "title":"Size makes a handsome man"
        },
        "114222212":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "I take you down to his lab?\"",
                "the three of us go for lunch?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Last year the 'Most Handsome Man' in Playgirl was about 700 pounds...706 if I remember rightly.  I never saw the issue, but it got widely reported, and then he started showing up in car ads and stuff.  He was a Sumo wrestler and a football star, I believe,\" said big James.<br>\r\n<br>\r\n\"700 pounds and he played FOOTBALL?\" little James asked in disbelief.<br>\r\n<br>\r\n\"Oh yeah,\" said Big James.  \"He'd be little slow, but think of it, nobody's going to get by him!\"<br>\r\n<br>\r\n\"Yeah, I suppose even the running backs and quarterbacks are fat here!\"<br>\r\n<br>\r\n\"Oh no, quarterbacks are usually only about 300 pounds...\" <br>\r\n<br>\r\n\"That's huge!\" little James interrupted.<br>\r\n<br>\r\n\"Not here!\" retorted big James.  \"I should introduce you to one of my colleagues who plays semi-pro ball.  Jason's been trying to put on a little extra weight to keep up with the rest of his offensive line...  In fact, why don't...<br>\r\n<br>\r\n</span></div></div>",
            "created":1160024400,
            "id":350730,
            "title":"Handsome at 700 pounds!"
        },
        "1142222122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "are a lot more elevators!",
                "emergency chutes where the stairs should be!"
            ],
            "content":"<div class=\"\"><div> <span>\"I should introduce you to one of my colleagues who plays semi-pro ball,\" says Big James. \"Jason's been trying to put on a little extra weight to keep up with the rest of his offensive line...he's the lightest, not much heavier than me. In fact, why don't the three of us go for lunch?\" <br>\r\n<br>\r\nBig James takes off his lab coat and hangs it behind the door, then leads little James out into a wide hallway that superficially resembles the one back in little James's reality.  Little James notices one startling difference, though, besides the size of Big James - there...<br>\r\n <br>\r\n</span></div></div>",
            "created":1186462800,
            "id":433274,
            "title":"Out of the lab"
        },
        "11422222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "over 750 pounds...",
                "close to 1000 pounds!"
            ],
            "content":"<div class=\"\"><div> <span>\"So,\" begins James diffidently, walking along behind Big James and trying not to attract much attention, \"if the girls are supposed to be 500 pounds, what size do they want guys to be? What size are the guys in the men's fitness magazines?\"<br>\r\n<br>\r\n\"Oh,\" replies Big James casually after a pause, \"you must mean men's style magazines?  'Fitness' is something only athletes worry about here - thre certainly aren't any magaziens about it!  The guys who get into our men's style mags are a LOT bigger than the women in their fashion mags - last year the \"Most Handsome Man\" in FHM magazine was ...</span></div></div>",
            "created":1138251600,
            "id":298353,
            "title":"Handsome guys run HUGE!"
        },
        "114222221":{
            "choices":[
                "They grow to 1500",
                "They get to over 2500!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, guys here usually get to around 750 or as high as 900 pounds.\"  he said very casually.  \"Wow that fat.  That is positively huge.\"  said little James in astonishment.  \"Yeah, but if you think that is huge you should see some of the Flabbywood stars.\"  Big James said, \"I mean they get up to at least...</span></div></div>",
            "created":1146632400,
            "id":316843,
            "title":"The stars are even larger here"
        },
        "1142222211":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "onto an elevator...",
                "down a ramp..."
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, but if you think that is huge you should see some of the Flabbywood stars,\" Big James said, \"I mean they get up to at least 1500 pounds!\" <br>\r\n<br>\r\n\"Wow!\" replies little James.  \"That's huge!\"<br>\r\n<br>\r\n\"Yep!\" replies Big James.  \"I'd love to get to movie star size.  Do you have an actor called Russell Crowe in your world?\"<br>\r\n<br>\r\n\"Sure do!\" replied little James.  \"He's a real heartthrob, does a lot of action and historical movies.\" <br>\r\n<br>\r\n\"Here too!\" says Big James.  \"For his role in 'Gladiator', he gained all the way up to 1750 pounds as a Roman general turned Caesar!\"<br>\r\n<br>\r\n\"Oh my,\" replied little James.  \"I'm going to have to get fat!\"<br>\r\n<br>\r\n\"You are indeed,\" replied big James.  His stomach rumbled at that moment.  \"Let's head down for lunch!\" he suggested.  Big James headed out of the lab and ...<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1160024400,
            "id":350729,
            "title":"Flabbywood stars get big!"
        },
        "1142222212":{
            "author_id":"wgwriter",
            "author_name":"WGwriter",
            "choices":[
                "the store is filled with feeding machines and ultra Weight Gain juice",
                "is only for thin people who need to gain weight"
            ],
            "content":"<div class=\"\"><div> <span>\"I mean they get over 2500 POUNDS!\" Big James said. \"Amazing! I need to grow a lot!\" little James said.<br>\r\n<br>\r\n\"Hey do you have an actor named Leonardo DiCaprio in your world?\" big James asked.<br>\r\n<br>\r\n\"We do! In fact, he's my favorite actor!\"<br>\r\n<br>\r\n\"well here, in his role in Titanic, his weight was at least over 3000! People say he's going to be next years \"most Handsome Man\"<br>\r\n<br>\r\nThey finally arrive at the fat store and see that..............</span></div></div>",
            "created":1312693200,
            "id":1163350,
            "title":"They get to over 2500!"
        },
        "115":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "shorter than Big James but just as fat...",
                "much fatter than Big James!"
            ],
            "content":"<div class=\"\"><div> <span>\"You're from another dimension?\" asked big James.  \"Then you must be me, only from YOUR world. Why are you so small?\"<br>\r\n<br>\r\n\"Why are YOU so big?\" replied James.<br>\r\n<br>\r\n\"Well here in Blubberberg, being fat is good for you and is considered attractive,\" said big James.  \"Skinny guys don't get girls.\"<br>\r\n<br>\r\n\"Wow it's just the opposite in my world. I think I'm going to like it here,\" says James. \"I've always wanted to be fat.\"<br>\r\n<br>\r\n\"Well, then you've come to the right place,\" replies Big James smiling.  \"But you've gotta fatten up.\"  Just then the door of the lab opened, and James saw another monstrous belly - whoops, another guy - coming in.  <br>\r\n<br>\r\nThe new guy stopped and stared.  \"Who are you?\" he said incredulously, staring at James.<br>\r\n<br>\r\n\"This is my twin from another dimension,\" says Big James quickly.<br>\r\n<br>\r\n\"Oh boy, it must be a strange place,\" replies the new guy.  James realises that the new comer is...<br>\r\n</span></div></div>",
            "created":1133499600,
            "id":287294,
            "title":"Another guy comes in"
        },
        "1151":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "we hitting the cafeteria?\"",
                "the other guys coming, or are they meeting us there?\"",
                "the girls joining us?\""
            ],
            "content":"<div class=\"\"><div> <span>Just then the door of the lab opened, and James saw another monstrous belly - whoops, another guy - coming in. <br>\r\n<br>\r\nThe new guy stopped and stared. \"Who are you?\" he said incredulously, staring at James.<br>\r\n<br>\r\n\"This is my twin from another dimension,\" says Big James quickly.<br>\r\n<br>\r\n\"Oh boy, it must be a strange place,\" replies the new guy. James realises that the new comer is shorter than Big James -- but just as fat... which is saying something.  <br>\r\n<br>\r\nJames - well suddenly he realises he might be 'Little James' around here - thinks the two guys look like those famous fat twins.  What did those guys weigh anyway - 600 pounds?  700 pounds? More?  Anyway, they are FAT!<br>\r\n<br>\r\n\"Well, 'little' James, what are you staring at?\", 'Big' James asks.  <br>\r\n<br>\r\nLittle James breaks out of his stare.  \"I don't think I've ever seen two guys as fat as you two before, except in books,\" 'Little' James ruefully admits.<br>\r\n<br>\r\n\"Well, you'd better get used to it, if you're staying around here!\" says the second fat guy.  \"I'm Mark,\" he adds, sticking out one well-padded hand.  \"Let's go eat!\"<br>\r\n<br>\r\n\"Right on!\" says Big James.  \"Are....<br>\r\n<br>\r\n<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1220331600,
            "id":577686,
            "title":"The second guy is just as fat..."
        },
        "1152":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "well over his belt and down his thighs....",
                "past his knees!"
            ],
            "content":"<div class=\"\"><div> <span>The new guy stopped and stared. \"Who are you?\" he said incredulously, staring at James.<br>\r\n<br>\r\n\"This is my twin from another dimension,\" says Big James quickly.<br>\r\n<br>\r\n\"Oh boy, it must be a strange place,\" replies the new guy. James realises that the new comer is much fatter than Big James...which is really saying something, as Big James is so large that his belly made a great landing spot for Little James.  Little James thinks Big James must be at least 500 pounds to have such a big soft belly.  The new guy, though, just seemed to be all gut - his gut filled the broad door as he waddled through, and hung down...</span></div></div>",
            "created":1146632400,
            "id":316878,
            "title":"Big James is fat, and the new arrival is...fatter!"
        },
        "11521":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "691 pounds...",
                "788 pounds!  Woo hoo!"
            ],
            "content":"<div class=\"\"><div> <span>James realises that the new comer is much fatter than Big James...which is really saying something, as Big James is so large that his belly made a great landing spot for Little James. Little James thinks Big James must be at least 500 pounds to have such a big soft belly. The new guy, though, just seemed to be all gut - his gut filled the broad door as he waddled through, and hung down well over his belt and down his thighs.  Little James grits his courage and finally asks the newcomer, \"If you don't mind me asking, how much do you weigh?\"<br>\r\n<br>\r\n\"Oh, not as much as my wife wants me to!\" the newcomer remarks, \"but I am getting up there,\" he continues, rubbing one hand appreciately across his vast paunch.  \"Last week I weighed in at...<br>\r\n</span></div></div>",
            "created":1163134800,
            "id":358254,
            "title":"How big is the newcomer?"
        },
        "115211":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Force feed him everything manually",
                "Force feed him from a tube in his mouth and stomach"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"691 lb., I'm almost at my goal of 700 lb. Then I'll be able to live happily. Oh, by the way my name is Dean. I hope you like it here, let's help you 'fit in'.\" Then he started to tie him down &amp;</span></div></span></div>",
            "created":1233205200,
            "id":640494,
            "title":"Dean the Dead Weight"
        },
        "115212":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "just a good size....",
                "the best size.  He's a fashion model!"
            ],
            "content":"<div class=\"\"><div> <span>Little James grits his courage and finally asks the enormous newcomer, \"If you don't mind me asking, how much do you weigh?\"<br>\r\n<br>\r\n\"Oh, not as much as my wife wants me to! But I am getting up there,\" he remarks, rubbing one hand appreciately across his vast paunch. \"Last week I weighed in at 788 pounds! Woo hoo!\"<br>\r\n<br>\r\n\"Heidi must be some pleased,\" notes James.  <br>\r\n<br>\r\n\"Yep, she is.  Be at 800 soon enough,\" remarks the newcomer.  \"But tell me, skinny guy,\" he continues, turning to Little James, \"how are you so small?  Don't you eat in your world?\"<br>\r\n<br>\r\n\"Yes, but not like you, I imagine,\" says James.  <br>\r\n<br>\r\n\"Come, let's get lunch!\" the newcomer says, and he heads back out the door.  The two Jameses follow, and little James whispers to big James, \"I think I know him - if his wife is Heidi.  But on my planet he's not very big...\"<br>\r\n<br>\r\nBig James replies, \"Well, here he's....<br>\r\n<br>\r\n</span></div></div>",
            "created":1177045200,
            "id":400811,
            "title":"The big guy is BIG!"
        },
        "1152121":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "at least 1400 pounds....",
                "over 2000 pounds.... and growing!"
            ],
            "content":"<div class=\"\"><div> <span>The two Jameses follow, and little James whispers to big James, \"I think I know him - if his wife is Heidi. But on my planet he's not very big...\"<br>\r\n<br>\r\nBig James replies, \"Well, here he's just a good size.\"<br>\r\n<br>\r\n\"Just a good size??  At 788??  If that's a 'just' a good size, how big are guys supposed to be here?  788 seems ENORMOUS to me....\"<br>\r\n<br>\r\n\"788 enormous?  Ho ho!  Here enormous would be...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1220245200,
            "id":577412,
            "title":"788 is just a good size....here"
        },
        "11521211":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "a massive guy appeared on the sidewalk...",
                "the bus door opened, and the first passsenger off..."
            ],
            "content":"<div class=\"\"><div> <span>788 enormous? Ho ho! Here enormous would be at least 1400 pounds,\" replies big James.  He watches little James intently, and is rewarded as little James' jaw drops.<br>\r\n<br>\r\n\"14...14 HUNDRED pounds!\" little James stutters.  \"Oh my god!\"<br>\r\n<br>\r\n\"Yeah, cool ain't it?\" replies big James grining.  \"Our friend Kyle,\" - he motioned ahead - \"that's what size Heidi wants him to be.  Don't know if he'll make it, but...\"<br>\r\n<br>\r\nLittle James couldn't reply - his mouth was hanging open.  But, he continued to trail along in the wake of the two fat guys in front of him.  As they came out the front door of the institute, he looked around, and saw lots of people the size of Kyle and big James.  <br>\r\n<br>\r\n\"Keep watching, somebody HUGE is sure to come along,\" remarked james, noting little James' rubbernecking.  <br>\r\n<br>\r\nSure enough, just as a bus rolled up...</span></div></div>",
            "created":1257656400,
            "id":788873,
            "title":"at least 1400 pounds....!"
        },
        "115212111":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "\"We can find you a new girlfriend easy as pie, hmm pie\"",
                "We can bring her faster than you can say ratatouille, hm ratatouille\""
            ],
            "content":"<div class=\"\"><div> <span>A gargantuan man appeared on the sidewalk. He was wearing a pair of yellow sweatpants &amp; a yellow shirt making him look like an obese yellow sun god. He was almost 3/4 of a ton, &amp; probably had an appetite to match. He was sucking down a milkshake &amp; chewing burgers at the same time. Then he notices you &amp; puts out his enormous hand for you to shake. \"Well I'll be if it aint Juvie James. Whose the tiny guy right here, your 'little' brother or something?\"<br>\r\n<br>\r\n\"No Lucas.\" then he whispers in Lucas's ear, \"He's actually my alternate self from another dimension, one where fat people aren't seen as good or healthy people.\"<br>\r\n<br>\r\n\"What?!?! That's ##**!! Everyone knows fat is good for you in every way. This dimension your twin's from must be seriously whacked out.\"<br>\r\n<br>\r\n\"I know,\" said little James, \"I've wanted to be fat my whole life, without the worry of teasing or health problems. Now I can accomplish my dream.\" Then all three boys high-five each other then little James realized something. \"I only wish my girlfriend Lisa could have come with me. She would have loved the idea of being fatter with me in this new world.\"<br>\r\n<br>\r\n\"Don't worry about it.\" Gestured Lucas...</span></div></div>",
            "created":1266210000,
            "id":836863,
            "title":"Meeting Lucas"
        },
        "115212112":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Apple Shaped Dough Boy/Ball-Gut Man",
                "Little Butter Blob of a Boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A apple-shaped or more like a ball of blubber. Or a buttery \"little\" boy, who is way shorter but way fatter (age must be 16 or less)?</span></div></span></div>",
            "created":1431912960,
            "id":1979550,
            "title":"the bus door opened, and the first passsenger o..."
        },
        "1152122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "a western-themed buffet....",
                "set up like a truck-stop diner back on little James' world..."
            ],
            "content":"<div class=\"\"><div> <span>As they follow the bigger guy out, little James whispers to big James, \"I think I know him - if his wife is Heidi. But on my planet he's not very big...\"<br>\r\n<br>\r\nBig James replies, \"Well, here he's the best size. He's a fashion model!\"<br>\r\n<br>\r\n\"No way!  Back home, he used to be a model, then he put on a few pounds...\"<br>\r\n<br>\r\nBig James giggled.  \"Imagine not being a model because you'd put on 'a few pounds'!  Here models need all the 'a few pounds' they can put on!\"<br>\r\n<br>\r\nLittle James giggled back.  \"You know, back home I worried about my weight - heck, everybody worries about their weight, except the naturally skinny people...but here, you're expected to put on weight....I think I'm going to like it here.\"<br>\r\n<br>\r\n\"I'm sure you are!\" replied Big James.  \"But you do need to worry about your weight here - you need to worry about putting ON weight...\"  Big James grinned at his bad joke, and little James slapped him on his broad back.<br>\r\n<br>\r\n\"That's the kind of worrying I've been waiting all my life for!\" noted little James.<br>\r\n<br>\r\n\"Good!\" was all big James had time to remark before their fat fashion-plate friend stopped in front of a pair of huge plate-glass doors.  <br>\r\n<br>\r\n\"Here's our lunch stop!\" he announced, before leaning his massive midriff into the door, pushing it open.  Little James was enthralled, never having seen anyone open a door with their stomach before, a sight Big James took in stride.  They followed their nearly 800 pound friend into the lunch spot which was....<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1213592400,
            "id":544932,
            "title":"He was a model in the other world - but not fat!"
        },
        "11521222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "350 pounds...",
                "500 pounds!"
            ],
            "content":"<div class=\"\"><div> <span>They followed their nearly 800 pound friend into the lunch spot which was set up like a truck-stop diner back on little James' world - except the booths all had moveable benches, so there was room.  The two big guys, James and Mark, sat on one side, leaving room for skinny James on the other.  Within seconds seemingly, a waitress was at the table, dropping menues and pouring coffee in to cups.  She was smiling and friendly, blonde, dressed in white and red, and must have been pushing...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1232427600,
            "id":636020,
            "title":"It's like a truck-stop diner"
        },
        "115212222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "the Trucker's special?\"",
                "an appetiser to enhance your appetite?\"",
                "the four course meal deal?\""
            ],
            "content":"<div class=\"\"><div> <span>Within seconds seemingly, a waitress was at the table, dropping menues and pouring coffee into cups. She was smiling and friendly, blonde, dressed in white and red, and must have been pushing 500 pounds!<br>\r\n<br>\r\n\"James, who's your tiny friend?\" the waitress asked.<br>\r\n<br>\r\n\"He's also James, he's just arrived here, and he needs to put on a little weight!\"<br>\r\n<br>\r\n\"I'll say,\" replies the waitress.  Turning to little James she asks, \"What would you like?  Perhaps...</span></div></div>",
            "created":1410451500,
            "id":1855517,
            "title":"Fat diners, fat waitstaff, great meals!"
        },
        "11522":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "In the house",
                "In the town"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi, my name is Billy.\" said the even bigger boy with a deep voice blocked off by his fat. He waddled over to you and gave you a bear hug. Big James joined in &amp; you were squeezed tight.<br>\r\n\"Aw man, I like this a lot. Could you guys sit on me, I think it'll be relaxing.\" James asked. Then they sat on him and he was massaged &amp; lost all the cricks in his spine. \"Man I'm hungry. I figure I'm gonna have to eat a lot everyday to catch up to you guys. Better start now then.\" He asked to be fed everything</span></div></div>",
            "created":1233205200,
            "id":640492,
            "title":"Billy the Big Blob"
        },
        "115221":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "join you guys in the cafe for lunch...",
                "get big fast - bring on the Weight Gainers!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, 'little' James, if you're gonna stay here and you wanna get fat you'd better get started eating,\" says Billy with a grin.  \"Fortunately, we've got a great cafeteria here in the lab building.\"<br>\r\n<br>\r\n\"Do you think that'll be enough?\" asked big James.<br>\r\n<br>\r\n\"You're thinking...?\" asked Billy.<br>\r\n<br>\r\n\"Well, he's so small...\"<br>\r\n<br>\r\n\"Yeah, but he's new here, he might just do fine.\"<br>\r\n<br>\r\n\"Well, you went.\"<br>\r\n<br>\r\n\"Yeah, but I'm a special case!\" chuckled Billy, bouncing a hand off his vast gut.<br>\r\n<br>\r\n\"What are you talking about?\" asked little James.<br>\r\n<br>\r\n\"Well, here in Blubberberg we have special help for the very skinny, like yourself,\" remarked James.<br>\r\n<br>\r\n\"Yeah,\" added Billy, \"special clubs and centres to help the skinny fatten up - or fat guys like me get even bigger!  I went, 'cause I wanted to be huge, and I'm still in the program.\"<br>\r\n<br>\r\n\"What are the special clubs called?\" asked little James.<br>\r\n<br>\r\n\"Weight Gainers,\" replied Billy.  \"You want to try it now, or just hit the cafeteria with us?\"<br>\r\n<br>\r\nLittle James considered for a moment.  \"I'd like to ...</span></div></div>",
            "created":1257656400,
            "id":789062,
            "title":"Learning about special clubs"
        },
        "12":{
            "choices":[
                "Lisa finally gets revenge",
                "Lucy goes too far",
                "Lisa swops worlds",
                "Lisa decides to go on a diet"
            ],
            "content":"<div class=\"\"><div> <span>I tried to hide myself from the prying in the changing rooms. Everyone else looked thin and gorgeous compared to me. My legs, breasts and stomach wobbled like jelly as I quickly shoved my school shirt over my head. I felt like everyone's eyes were on me, but when I looked around they were all going about as normal, chatting and laughing as they got changed. <br>\r\n'Hey, what are you perving at?' Lucy Stanford, a class A bitch and my enemy, asked me. <br>\r\n'Nothing.' I mumbled, looking down at my scuffed shoes.<br>\r\n'I think she's turned a lesbian because she's finally realised that no boy will ever fancy her because she's so fat.' Lucy said in a stage whisper. Her gang shrieked in unison and pulled faces.<br>\r\n'Ignore them.' my best friend, Emily, advised me 'It doesn't matter what they think and anyway, you've got a great figure.'<br>\r\nEasy for her to say. She is practically a skeleton, even though she chomps her way through a truckful of junk food a day.<br>\r\n'Watch it Emily, she's got her eyes on your bazookas!' Lucy tittered <br>\r\n'Shut up, Lucy, and get a life.' Emily said, turning to face her.<br>\r\n'On second thoughts, what bazookas? There's nothing there!' Lucy shot back.</span></div></div>",
            "created":1133499600,
            "id":287302,
            "title":"Feeling fat"
        },
        "122":{
            "choices":[
                "Lisa wakes up in a strange place",
                "Lucy and her group run away leaving the phone",
                "Emily Helps Lisa and they plan revenge"
            ],
            "content":"<div class=\"\"><div> <span>Lisa dropped her head in embarrassment and shame, she could feel the hot tears welling up in her eyes. Emily dropped her bag and turned on Lucy, her eyes blazing in anger.<br>\r\n\"Well we can't always have parents that fix all of our problems for us can we?!\"<br>\r\nLucy's mouth snapped  to a close and she quickly looked around. Her overly confident attitude shaken for a moment.<br>\r\nWhat are you talking about? she sneered. But her voice isn't as venomous as before.<br>\r\nEmily continued, in a non nonchalant voice, oh c'mon Lucy my uncle told me about the \"growth spurt\" you experienced over the summer--most expensive one I've ever heard of.<br>\r\nLucy knew that Emily's last name sounded familiar, but brushed it off as coincidence, she had no idea that her uncle was the expensive and very exclusive plastic surgeon that she had begged her parents to take her to over the summer, to get her breasts done.<br>\r\nLucy's cronies looked at their leader in askance. The heat was slowly creeping its way up her neck and she knew her face was red. Without thinking she threw her phone at Emily's smiling face--the thin girl ducked and Lisa still studying her shoes was the recipient of the small missile, it smacked her temple with such force that she never felt herself hit the ground. The last thought she had before the world went black was that she hoped her shirt didn't ride up... </span></div></div>",
            "created":1323061200,
            "id":1235040,
            "title":"Lucy goes too far"
        },
        "1222":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "The office is fancy",
                "The office is questionable",
                "The office is on the outskirts of town"
            ],
            "content":"<div class=\"\"><div> <span>Seeing the fat girl fall to the ground prompted Lucy and her cackling friends to run away, forgetting to retrieve the skinny girl's phone.<br>\r\n<br>\r\n\"Uh those bitches. You okay Lisa?\" said Emily extending her arm.<br>\r\n<br>\r\nOpening her eyes, Lisa immediately saw her bare belly. Of course her shirt would ride up. Lisa's attempt to sit up was hindered by her stomach's girth. Using every ounce of strength in her frail body, Emily helped lift Lisa to her feet.<br>\r\n<br>\r\n\"Huff huff thanks Emily\" Lisa expressed her gratitude through heavy pants.<br>\r\n<br>\r\n\"Uh-huh.\" Emily, herself panting desparately. <br>\r\n<br>\r\nIt was then that the tiny waisted girl noticed Lucy's phone. Picking it up she scrolled through her contact list. Screw her privacy, the miserable bitch deserved it. Emily ran her eyes down the screen, seeing nothing out of the ordinary until...<br>\r\n<br>\r\n\"Lisa! Look at this!\" <br>\r\n<br>\r\nLisa leaned over to see the screen.<br>\r\n<br>\r\nDR HOPE'S MIRACLE BODY MODIFICATION<br>\r\n<br>\r\n\"So that's how Lucy grew her big boobs overnight.\" Lisa blurted.<br>\r\n<br>\r\n\"But I thought she went to my expensive uncle to have it done?\" a confused Emily wondered.<br>\r\n<br>\r\n\"Maybe that's how she stays so thin.\" Lisa suggested.<br>\r\n<br>\r\n\"Hmm let's find out. We'll have you act as Lucy and schedule an appointment.\" schemed Emily.<br>\r\n<br>\r\nWith a quick phone call, the two girls set up an appointment that afternoon and drove their way to Dr Hope's office.</span></div></div>",
            "created":1565623380,
            "id":2700954,
            "title":"Lucy and her group run away leaving the phone"
        },
        "12221":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Lisa enters a clothing store",
                "Lisa checks her phone"
            ],
            "content":"<div class=\"\"><div> <span>The office was spectacular, resembling more of mansion than a doctor's office. The office was ornated by posters of beautiful slim models and decorated with erotic statues of women, all basking in the joy of their slender physiques. As they gazed upon the celebrated depictions, the girls were approached by a nurse.<br>\r\n<br>\r\n\"Yes Lucy Stanford? The doctor is ready to see you.\" said the nurse leading them down the lavish hall.<br>\r\n<br>\r\nLisa was envious of the nurse. A gorgeous blonde with a size 2 waist and a respectable pair of C cup breasts which she flaunted by leaving some buttons undone. Lisa wanted a figure like the nurse. She wanted to be thin like the world demanded of her. They arrived at Dr Hope whose appearance didn't give off the impression of a doctor.<br>\r\n<br>\r\n\"Ah Ms Stanford, enjoying your desserts again .\" he said embracing Lisa in a hug \"though this time it seems you've really let yourself go. Fret not, I'll give you some pills that'll fix everything.\" Dr Hope stated.<br>\r\n<br>\r\n\"You can do that?\" Lisa asked.<br>\r\n<br>\r\n\"My dear I could change the world. I have many abilities. If it is wealth you desire, I can grant, if it is physical perfection you want, I can give, if you want fame, I can bestow.\"<br>\r\n<br>\r\n\"Wow you have that kind of power?\" Emily awed<br>\r\n<br>\r\n\"I just want to be thin.\" Lisa urged.<br>\r\n<br>\r\n\"Of course. Take this pill and absolutely follow the directions. Failure to do so could result in global catastrophe \" Dr Hope warned handing Lisa a diet pill.<br>\r\n<br>\r\n\"Yes uh-huh.\" Lisa eagerly nodded.<br>\r\n<br>\r\nThe girls left the enchanted building and drove off. Lisa read the directions which stated: SWALLOW PILL AND DO NOT EAT FOR 1 HOUR.<br>\r\n<br>\r\n\"Simple enough.\" Lisa said popping the pill.<br>\r\n<br>\r\nThe instant Lisa swallowed the pill, she was blasted with a relentless hunger.<br>\r\n<br>\r\n\"Oh I'm so hungry!!!\" whined Lisa.<br>\r\n<br>\r\n\"Calm down Lisa, just hold out for an hour.\" Emily pointed at her car's clock \"See 2:00, at 3:00 you can eat all you want.\"<br>\r\n<br>\r\nThe girls drove to the mall to do some shopping to pass the time. Lisa clutched her hungry stomach, envying all the skinny women walking around her, anxiously waiting to shop at all of the alluring clothing shops that never carried anything larger than a size 8.<br>\r\n<br>\r\n\"Finally 3:00!\" Lisa rejoiced ordering a huge meal from the food court.<br>\r\n<br>\r\nLisa fervently shoveled food through her mouth. Greasy burgers, salty fries, thick milkshakes, chicken strips, and onion rings in moments stuffed Lisa's stomach. However, unbeknownst to the fat girl was that the car's clock was 10 minutes to behind and she had just monumentally shattered the pill's directions.<br>\r\nLisa became dizzy and past out.<br>\r\n<br>\r\n\"Lisa Lisa\" echoed Emily's voice \"Lisa!\"<br>\r\n<br>\r\nIt was uncertain how much time had past but eventually Lisa regained consciousness, Lisa finding herself on the floor. Of course her shirt rode up exposing her fat belly which still existed. Emily was no where in sight. Lisa scanned herself over. She was still fat as ever, the pill failed. Heaving her fatself up Lisa reasoned she should stroll the area in search of Emily. Walking through the mall, things seemed off. There were a bunch of women, rather portly, sauntering through the mall. They also appeared oddly confident, exhibiting no sense of shame walking their hefty bodies around. In fact, their attire complimented their larger bodies.<br>\r\nIt was then that an advertisement caught Lisa's attention. It displayed a plus size model. The mall normally didn't advertise plus size models except at the only plussize store. Lisa suddenly realized plus sized models were on all of the ads. Not a single slender woman appeared on ANY advertisement.<br>\r\n<br>\r\n\"Wait...What's going on?\" Lisa queried.<br>\r\n<br>\r\nBy eating a heaping of fastfood within the hour, Lisa had disrupted the magic of Dr Hope's pill and altered society. Instead of making her thin, it made society fat. No longer was skinny the ideal body that society dictated to women. In fact being skinny was loathed and ridiculed by men and women alike. Now obesity was glorified amongst the female population. Being fat meant everything to girls in this world. <br>\r\n<br>\r\nIt was real. Fat is beautiful.<br>\r\n<br>\r\n <br>\r\n<br>\r\n </span></div></div>",
            "created":1565627520,
            "id":2700970,
            "title":"A very potent pill"
        },
        "122211":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Nice and fat!",
                "Not fat enough..."
            ],
            "content":"<div class=\"\"><div> <span>Lisa found herself in the middle of a fat-positive world. Posters displayed luscious women well above the 200 pound mark, extra large mannequins draped in trendy clothes posed in esteemed department stores, food stands were plentiful and proudly boasted of their high calorie count. The thought of women being fat, let alone wanting to be fat, shocked Lisa. Lisa began to walk down the mall before quickly stepping into an automated walkway. Now being relieved of the effort, Lisa saw many other women taking the same liberty, totally unabashed by the indolence. It was then that Lisa noticed that the mall was filled with automated walkways. Women barely had to exert themselves in this world.<br>\r\n<br>\r\nAs Lisa let herself be carried away, she studied each clothing store. Every last one catering solely to larger sized ladies. Bikinis sized 28 ornamented windows, lingerie graced the wideness of obese mannequins, bridal shops advertised there opulent gowns with fat women. Filled with awe, Lisa entered a store. Upon entering, Lisa's visage was graced by waves of plus size outfits. Unlike in her previous world these outfits were downright fashionable.<br>\r\n<br>\r\n\"Why hello Ms. Is there anything I can help you with?\" greeted a hefty woman.<br>\r\n<br>\r\n\"Oh uh just browsing.\" Lisa uttered.<br>\r\n<br>\r\nLisa's eyes studied the well fed woman before her. She flaunted her weight with \"flattering\" attire. Her shirt was unbuttoned low revealing generous cleavage. The buttons that were done were strained. Her clothes tightly wrapped around her curves. She wore a very short skirt that exposed her thick dimpled thighs.<br>\r\n<br>\r\n\"Well okay then you just call if you need anything.\" <br>\r\n<br>\r\nLisa than watched as the wide woman sauntered her way to help another customer, a 400 pound woman deciding which thong to buy. As Lisa perused the aisles she exchanged friendly glances with fellow plus sized women. In the past skinny woman scoffed at others, even their skinny sisters. <br>\r\n<br>\r\nWho knew high fat diets had such a positive impact on women.<br>\r\n<br>\r\nLisa found herself standing before a tantalizing bikini. She never would've worn it in her old world but now that fat was good, Lisa felt optimistic. Picking it off from the hanger, Lisa took it to the changing room. Taking a space next to a woman inspecting her self in a pair of short shorts.<br>\r\n<br>\r\n\"Ugh. It doesn't make me look fat enough.\" groaned the woman.<br>\r\n<br>\r\n\"Perhaps this would suit you better. It would really compliment your cellulite.\" suggested an employee.<br>\r\n<br>\r\nThe customer and attendent continued prattling as Lisa removed her clothes and donned the bikini. It was revealing. Flesh that she had never showed before was now on full display. Despite the unfamiliar breathe of air on her bare thighs, Lisa felt good, liberated in fact. A bikini was way more comfortable than any confining one piece. Lisa then turned her attention to her reflection in the mirror. Never before had she studied her physique with such optimism. Accustomed to hiding her curves in baggy clothing, Lisa never noticed just how curvacious she was. Most notably was how huge her boobs were. They were spilling out of the already large top. Her belly so huge and doughy now suddenly seemed appealing, mesmerizing in fact. Lowering her sights to her chunky legs left her intrigued. There was nothing gross about her fat legs, if anything the bumpy flesh made it interesting. Lisa then twisted around to look at her butt. It was so big and round, temptation prompted her to spank it.<br>\r\n<br>\r\n\"Oh! That felt...interesting.\" Lisa admitted.<br>\r\n<br>\r\nCurious, Lisa needed a second opinion, her fat body couldn't be that nice.<br>\r\n<br>\r\n\"Um excuse me.\" Lisa waved over an employee.<br>\r\n<br>\r\n\"yes ms?\" asked the woman waddling her ample body over.<br>\r\n<br>\r\n\"How do I look?\" Lisa asked baring all.<br>\r\n<br>\r\nThe employee enthusiastically answered...</span></div></div>",
            "created":1567013580,
            "id":2709165,
            "title":"Lisa enters a clothing store"
        },
        "123":{
            "author_id":"h2ostella",
            "author_name":"Anabel Drake",
            "choices":[
                "Yes to the ice cream",
                "No to the ice cream"
            ],
            "content":"<div class=\"\"><div> <span>After school, Lisa trudged home, glad to finally have the weekend to get away from everyone who teased and be among the people who loved her.  When she finally arrived home, the ice cream man had his truck parked in front of her house with a line of kids trailing off to the side. Lisa decided that since she was going to start to diet tomorrow, today would be her celebration and it would be an ice cream cone. She patiently waited as the kids in front of her ordered and paid for their ice cream. Finally it was her turn when a flash of light knocked her to the ground. The ice cream man bolted out of the truck and helped Lisa to her feet. \"What was that?\" Lisa asked groggily.<br>\r\n\"I don't know. I just saw you fall to the ground. I thought you were fainting from all the clothes that you were wearing on this hot day.\" he said with a knowing smile. \"Can I get you something? It be on the house. I know, how about the special Crazy Chocolate Cream Cake Cone?\"  </span></div></div>",
            "created":1146546000,
            "id":316801,
            "title":"The Ice Cream Man"
        },
        "1231":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "in her bed",
                "on the streets",
                "in a completely different world"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lisa couldn't say no to ice cream so she bought it and ate it. After that she began to feel drowsy and passed out. When she awoke she found herself...</span></div></span></div>",
            "created":1303534800,
            "id":1093080,
            "title":"Yes to the ice cream"
        },
        "12313":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "obese & pregnant women and fat men",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is like at first</span></div></span></div>",
            "created":1444336080,
            "id":2045172,
            "title":"in a completely different world"
        },
        "1232":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "her mother explained the value of fat",
                "her sister walked in",
                "next day at school"
            ],
            "content":"<div class=\"\"><div> <span>Lisa declined the offer and went home, plagued with a peculiar feeling that she couldn't shake off.<br>\r\n<br>\r\n\"Mom I'm home!\" Lisa announced.<br>\r\n<br>\r\n\"Welcome home sweety I'll have a snack ready in a minute dear.\" yelled out her mother.<br>\r\n<br>\r\nThat was unusual, Lisa's mother never had snacks prepared for her after school. After today's unpleasant harassing by Lucy, Lisa didn't want to gain any more weight and so declined.<br>\r\n<br>\r\n\"Actually I'll pass.\" Lisa politely declined.<br>\r\n<br>\r\n\"What!\" her mother immediately replied in an alarmed manner.<br>\r\n<br>\r\nLisa somewhat bewildered by her mother's extreme reaction explained \"Well yeah you see I think I have a weight problem cause these girls at school made fun of me and...\" Lisa ceased her words as her mother stood in the doorway.<br>\r\n<br>\r\nStanding before Lisa was her mother only she was morbidly obese, weighing at least over 500 pounds. Her mother was merely chunky with some flab and rolls but she wasn't this big. Here stood a much fatter version of her mother, standing there unaware of any changes. Her once pudgy belly was now gigantic hanging over her crotch, her once plump breasts were now enormous melons resting heavily upon her belly, her thick legs blimped into gelatinous pillars, and her arms which used to only jiggle with movement now had globs of sagging fat. Odd enough as her physique was, her demeanor was nonchalant about her weight, it was as if she didn't care about being a whale.<br>\r\n<br>\r\n\"Are you getting teased for being too skinny?\" Her mother continued on. Lisa was too befuddled to answer. \"I knew it, I knew your weight would be a problem. But don't worry sweetheart, mommy's got a cure for you.\" she said pulling out a huge cheesecake.<br>\r\n<br>\r\nHer mother quickly cut a slice and brought it up to Lisa's lips. Her mother held the slice in front of her, insisting she take a bite. Still confused Lisa obediently bit into the dessert, plus it was really tasty. <br>\r\n<br>\r\n\"Good huh?\" her mother asked as her daughter nodded. \"Good I was worried the weight gain powder would ruin the taste.\"<br>\r\n<br>\r\n\"W-Weight gain powder?!\" <br>\r\n<br>\r\n\"Yes sweety you need to gain weight and the ad on tv said this accelerates weight gain. Why I saw a scrawny young girl turn into a beautifully fat woman why she could've been a model.\" explained the mother.<br>\r\n<br>\r\nLisa finished her cheesecake and..  </span></div></div>",
            "created":1505057280,
            "id":2383601,
            "title":"No to the ice cream"
        },
        "124":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "young, plumpish receptionist with a warm smile...",
                "grandmotherly type who smelt of baking..."
            ],
            "content":"<div class=\"\"><div> <span>Finally tired of the razing of Lucy and company, Lisa breaks down and decides to go on a diet.  While the girls might have criticised her looks, Lisa was certainly not missing anything in the brains and determination department - she called around, checked out the internet, even checked with the BBB about which diet centre to consider.<br>\r\n<br>\r\nThe only problem she could see was how her boyfriend, James, no skinny-minny himself, would take her going on a diet.  Oh well, he was a guy, as long as her bazoombas remained impressive, he might ignore the rest.....<br>\r\n<br>\r\nIn her research, it slowly became apparent that there was one diet centre that was different from all the rest - one that had no criticisms levelled against it, even by those who had dropped out of its programs.  The \"before and after\" photos on its website were not as impressive as some of the others - and the people's progress seemed slower - but there were all smiling in the photos, relaxed photos of those caught feeling happy, rather than the obviously posed and forced photos of the other centres.  And the feel of the place just seemed better too - less pressure, more support, no hideous \"group\" meetings (unless you wanted to).  Lisa called the centre to set up an appointment - they could see her that afternoon, or the next day, to her surprise.<br>\r\n<br>\r\nShe dressed up just a little for the appointment - nerves? - and arrived ten minutes early at an unprepossessing unit in an average strip mall - well, an above average strip mall, judging by the cleanliness of the grounds, the modest, classy signs, and the good cars parked about.  Lisa walked into the reception and was greeted by a receptionist - a ...</span></div></div>",
            "created":1151643600,
            "id":327633,
            "title":"Lisa researches diet centres"
        },
        "1241":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "generous curves....",
                "well-above-average weight and plump tummy!"
            ],
            "content":"<div class=\"\"><div> <span>She dressed up just a little for the appointment - nerves? - and arrived ten minutes early at an unprepossessing unit in an average strip mall - well, an above average strip mall, judging by the cleanliness of the grounds, the modest, classy signs, and the good cars parked about. Lisa walked into the reception and was greeted by a receptionist - a young, plumpish receptionist with a warm smile.<br>\r\n<br>\r\n\"Hello there, can I help you?\"  <br>\r\n<br>\r\n\"Yes, well, I want to lose some weight and I'm looking for a diet centre...\"<br>\r\n<br>\r\n\"Well, we prefer to call ourselves a 'health centre' - after all, diets are dangerous!  And they don't work.  But being healthy - that's the important thing, that will make you happy.  Would you like to book a free consultation?  Or, actually, Shelly is free right now, if you have 20 minutes or so?\"<br>\r\n<br>\r\nLisa was floored - diets are dangerous?  But the free consultation sounded good...<br>\r\n<br>\r\n\"Sure, I have 20 minutes,\" she told the receptionist.  <br>\r\n<br>\r\n\"Great!  Shelly will be right out.\"<br>\r\n<br>\r\nIn a moment, a woman appeared through a door.  She was smiling and obviously relaxed and happy, in a strappy little dress that did nothing to hide her ...<br>\r\n<br>\r\n</span></div></div>",
            "created":1156741200,
            "id":342794,
            "title":"Checking out the unusual center"
        },
        "13":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "A hospital",
                "Some ones house",
                "A fattening center",
                "A restraunt",
                "The house of another pair of James and Lisa."
            ],
            "content":"<div class=\"\"><div> <span>James and Lisa are two lab workers at the local university. Mostly they just swept and polished the machines in the lab.<br>\r\n<br>\r\n“I wish that the Prof. would at least tell us what this stuff does.” James said. He had red hair, blue eyes and glasses. He was a fat admirer and wished that he and Lisa could be fat. But then they would be ridiculed and have a lot of health threats.<br>\r\n<br>\r\n“Well no sense wondering.” Lisa said. She was blond with green eyes and very skinny. She knew how James felt but her mom wanted her be thin and a model. She pulled back on her mop and hit a button. The machines stared to make noises and there was a big flash.<br>\r\n<br>\r\nJust before they passed out they saw they were in a park surrounded by fat people.<br>\r\n<br>\r\nWhere will they wake up?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1087621200,
            "id":203892,
            "title":"A new world."
        },
        "131":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "500lb.",
                "200lb."
            ],
            "content":"<div class=\"\"><div> <span>James and Lisa awoke to find themselves in hospital beds. “But doctor it doesn’t make any sense. They are healthy yet they look so… unnatural.” They heard a nurse say.<br>\r\n<br>\r\n“I know but the test confirms that except for the vital levels of fat they both are in almost perfect health.” The doctor said.<br>\r\n<br>\r\n“Where are we?” Lisa asked.<br>\r\n<br>\r\n“Oh, you’re awake. You’re in Bluberburg hospital. I’m Dr. Wells and this is Nurse Philips.” They were both very fat.<br>\r\n<br>\r\n“I heard what you said but I don’t understand I thought fat was bad for you.” James said.<br>\r\n<br>\r\n“Bad for you what are you talking about? Everybody knows you need to be fat to be healthy It’s been that why since the comet crashed 800 years ago.” Dr. Wells said.<br>\r\n<br>\r\n“What comet? Look we were in a lab and I accidentally hit a button and then the next thing we knew we were here.” Lisa said.<br>\r\n<br>\r\n“And you became like you are now.” Nurse Philips said.<br>\r\n<br>\r\n“No we have been like this as long as we can remember.” James said.<br>\r\n<br>\r\n“Eye witnesses said that you came through some kind tunnel in the air suddenly. Maybe you came from another dimension.” Dr. Wells said.<br>\r\n<br>\r\n“Probably so what were you talking about a comet?” Lisa said.<br>\r\n<br>\r\n“Well when it crashed it spread a dust all over the planet. It made it so that in order to be healthy people had to be fat. This is okay since we all think it’s very sexy.” Nurse Philips said.<br>\r\n<br>\r\n“So how do we get back home?” James asked.<br>\r\n<br>\r\n“Even though we made advanced technology to let us live easy lives with an endless food supply we don’t have a way to traverse dimensions. So you have to stay here and we can make the two of you like the rest of us.” Dr. Wells said.<br>\r\n<br>\r\nThis was James’ dream come true now he and Lisa could be as fat as they wanted and no one would say anything about health risks or how they looked. “So when can we do that?” James said.<br>\r\n<br>\r\n“Right now all we have to do is give you this shot in you stomach and you will get fatter with everything you eat and you’ll be packing in pounds in no time.” Dr. Wells said holding up a needle with a purple liquid. He gave the injection to Lisa then to James.<br>\r\n<br>\r\n“Wow I feel so hungry I need to eat.” Lisa said.<br>\r\n<br>\r\n“You’re already starting to change all you need is some food and the process will be permanent.” Dr. Wells said. They went to the cafeteria James and Lisa started to eat as much fattening food as they could. Lisa could finally eat what she wanted with out her mother telling her to have a salad instead. They ate and ate all the while they were ballooning with fat.<br>\r\n<br>\r\nHow much would they gain? <br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1087794000,
            "id":204080,
            "title":"At the hospital"
        },
        "1311":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Eat more to get fatter",
                "go and explore"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n When James and Lisa had stopped eating, they both were around 500 lbs.  <br>\r\n<br>\r\n         \"Wow...you look good!\" said James.  Lisa smiled. <br>\r\n <br>\r\n         \"You look good yourself\" said Lisa.<br>\r\n<br>\r\n          As the two waddled out of the cafeteria, they saw an exteremly fat man around 20.  The man had to be around 1500 lbs!  James could hardly believe anyone could get that big.<br>\r\n<br>\r\n           \"Well, what to we do now?\" asked Lisa. <br>\r\n<br>\r\n           \"We could eat more and be even fatter or explore this place\" said James.   </span></div></div>",
            "created":1088744400,
            "id":205638,
            "title":"500-pound James and Lisa"
        },
        "13111":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>“Lets get some more to eat then we’ll look around more.” Lisa said.<br>\r\n<br>\r\n“Sounds great!” James said. They went to a restaurant.<br>\r\n<br>\r\nJames couldn’t help but notice how beautiful Lisa looked. She now had EEE sized breasts, a belly the size of a boulder and enormous thighs and butt. He also had these qualities EEE man breasts and such. After they fished there 18th milkshake they gained another 200lb.  They also found out that they had machines here that could make food out of thin air so there would never be a shortage of food.<br>\r\n<br>\r\n“The way you two have been gaining you two could become supermodels.” There waitress said.<br>\r\n<br>\r\n“Supermodels?” Lisa asked.<br>\r\n<br>\r\n“Us?” James said.<br>\r\n<br>\r\n“Yes, the fattest people are always considered beautiful.” The waitress said.<br>\r\n<br>\r\n“Hey lets go for it James lets eat so much that we become supermodels!”<br>\r\n</span></div></div>",
            "created":1089867600,
            "id":207727,
            "title":"200 more"
        },
        "131111":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "Lisa is pregnant.",
                "Some how both are pregnant."
            ],
            "content":"<div class=\"\"><div> <span> It has been a year since James and Lisa became models. They now weigh a thounsand pounds and are married.<br>\r\n<br>\r\n Lisa was floting in their pool. Then James waddled in. \"Hey honey ready for dinner?\"<br>\r\n<br>\r\n \"Always.\" Lisa said.<br>\r\n<br>\r\n They had lots of meats a sweets. After dinner the two of them made passionate love.<br>\r\n</span></div></div>",
            "created":1111035600,
            "id":240438,
            "title":"The Good life."
        },
        "1311111":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><div> <span>Then Lisa felt nauseous &amp; went to the bathroom to puke. They went to the doctor to find out what was the problem. They talked to figure it out (they were newly weds, so they don't know just yet).<br>\r\nThey went to the doctor &amp; waited in the waiting room. They kept on eating strange foods to satisfy their cravings. By then you got to the doctor’s office. “Hello. I’m Dr. Newman.”<br>\r\n“Hi I’m Lisa, &amp; this is my husband James.” She points out her husband.<br>\r\n“All I need you to do is inject it into your uterus &amp; let me take care of the rest.” Then they scanned your blood &amp; it was official.<br>\r\n“All right Lisa you’re pregnant. So doc, is it a boy or girl?”<br>\r\n</span></div></div>",
            "created":1266728400,
            "id":840702,
            "title":"Lisa is a Mom Now"
        },
        "13111111":{
            "author_id":"sirjoseph",
            "author_name":"SirJoseph",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lisa gave birth to a healthy baby boy some months later with James supporting her in a vast maternity ward.<br>\r\n<br>\r\nUnfortunately, as they left the hospital the family walked in front of an oncoming bus.<br>\r\n<br>\r\nTHE END</span></div></span></div>",
            "created":1400923080,
            "id":1801430,
            "title":"Boy"
        },
        "1311112":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "3rd month",
                "9th month"
            ],
            "content":"<div class=\"\"><div> <span> Both James and Lisa woke up one morning feeling a little sick. They went into separate bath rooms and threw up.<br>\r\n<br>\r\n This was the third day this week they woke up feeling like this. They knew another change that was caused by the comet was that men would become pregnant as well and the husbands and wives often have babies together. So they both took a home pregnancy test that was as accurate as the hospital test back at their old world.<br>\r\n<br>\r\n \"It's positive.\" Lisa said with a smile. <br>\r\n<br>\r\n \"That's wonderful.\" James then hugged his now 2000lb. wife. She had breasts so big that she couldn't where a bra any more. Her belly hung just above her knees. Her butt and thighs about the size of a small child. He weighed the same as her with the same kind of features.<br>\r\n<br>\r\nWe're going the have to make a few changes in our date books. I wonder how much more we're going to weight now that we're eating for two or maybe more.</span></div></div>",
            "created":1111381200,
            "id":240856,
            "title":"Finding out."
        },
        "13111122":{
            "author_id":"mycatsmoony",
            "author_name":"mycatsmoony",
            "choices":[
                "time skip 3 months",
                "time skip 18 years"
            ],
            "content":"<div class=\"\"><div> <span>\"Its been nine long months hun how do you feel?\"James said he almost doubled in size because of the baby or well babies he found out he was going to have triplets and Lisa completely double for her five children in her.as you finish the sentence your stomach starts feeling bad and you faint. By the time you get up all three children from you came out all boys you have the doctors lay them on your huge breasts as you admire your children you can hear crying from the other side of the room you can tell its the new borns from your wife.<br>\r\n<br>\r\n</span></div></div>",
            "created":1413180600,
            "id":1870763,
            "title":"9th month"
        },
        "13112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "by city hall and the Giant Galleria.\"",
                "right by the Mammoth Mall.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Well, what to we do now?\" asked Lisa. <br>\r\n<br>\r\n\"We could eat more and be even fatter or explore this place\" said James. <br>\r\n<br>\r\nLisa rubbed a hand appreciatively across her generous belly.  \"I vote we go and explore,\" she said.  \"Let's see some more of this cool new dimension.\"<br>\r\n<br>\r\nAs they happily waddled towards the doors of the hospital, one of the nurses who had been tending them hurried up behind them.  <br>\r\n<br>\r\n\"James and Lisa, before you go out, you'll want to take a look at these,\" the nurse said.  She handed them a city map, a pair of bus passes, a tourism guide and a wallet with two small plastic cards.  \"You might want to go to the City Hall first and register,\" she went on, \"the doctor has already spoken to the mayor about your status and the city will help you.\"<br>\r\n<br>\r\n\"Cool,\" said Lisa, \"and what about shopping?\"<br>\r\n<br>\r\n\"Those charge cards are tied to a city account,\" the nurse said.  \"They'll let you buy a bit - new clothes,\" she said, indicating their very plain hospital-issue duds, \"a few meals, a hotel for the night.  But you must talk to the mayor soon.\"<br>\r\n<br>\r\n\"Thanks!\" said James, and the newly fattened couple continued their weighty progress out of the hospital.  The first thing they noticed was there seemed to be no stairs - everything had either ramps or elevators.  They walked down the shallow ramp from the hospital entrance to the sidewalk and saw a bus stop a few metres away.  Unlike bus stops in their old world, though, this one had a number of comfy benches about it, most occupied by one or two people - a few were smaller than James and Lisa, but most were about their size, and some were much bigger.  <br>\r\n<br>\r\n\"So,\" said James, \"city hall first, or shopping?\"  <br>\r\n<br>\r\n\"Shopping!\" said Lisa enthusiastically.  \"I'm not meeting the mayor wearing this old thing!\"<br>\r\n<br>\r\n\"Right,\" said James.  As he spoke a bus drew up to the stop, and threw open its broad doors.  The driver inside beamed as the other passengers boarded.  James and Lisa approached the door, and Lisa noticed that the driver was fatter than James - a lot fatter than James.  The bus was adapted to him though - the steering wheel was very small, and set off to right, so it didn't interfere with his mammoth gut.  The two boarded and James asked the driver, \"Do you go to city hall, or near a shopping mall?\"<br>\r\n<br>\r\nThe driver replied, \"I go...</span></div></div>",
            "created":1111122000,
            "id":240500,
            "title":"James and Lisa head out"
        },
        "131121":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "a mammoth pair of jeans in the window of the 'Denim Den'.",
                "a moving sidewalk down the hallway of the Galleria..."
            ],
            "content":"<div class=\"\"><div> <span>As James and Lisa boarded, Lisa couldn't help but notice that the bus driver was a lot fatter than even the new, 500 pound James. She asked the driver, \"Do you go to city hall, or near a shopping mall?\"<br>\r\n<br>\r\nThe driver replied, \"I go by city hall and the Giant Galleria - they're on the same city square.\"<br>\r\n<br>\r\n\"Oh good,\" replied Lisa, and she and James made their way back to find seats.  The front seats were reserved for those with mobility problems, like city buses back home, and were occupied by a couple of folks who looked like they'd make the 'Guinness Book of World Records' back home as being the fattest folks in the world.  <br>\r\n<br>\r\nAs the bus rolled along, they were clearly headed downtown - the buildings got taller and taller, though there didn't seem to be a lot of traffic, except that there were a lot of buses.  Soon, the bus pulled up on one side of a large city square, with a big statue and a large water fountain in the centre, and a very traditional New England-looking city hall on one side.  On the other side, a towering block announced that it was 'Giant Galleria and Giant Towers phases I-IV'.  <br>\r\n<br>\r\nJames and Lisa got off, and walked through the huge revolving door into the Galleria, where they paused to consult a store plan.  None of the store names seemed familiar, though some looked something like a store name back home - 'Robin Baskin' ice cream, for example - and James and Lisa were both puzzled by the lack of Big 'n' Tall or Plus clothing shops.  They were about to ask a passerby when an idea struck Lisa.<br>\r\n<br>\r\n\"Of course, James, they wouldn't have Big 'n' Tall shops - everyone here is big!\" she remarked.<br>\r\n<br>\r\n\"Let's head out then!\" James said.  He stepped past the store plan and saw beyond it...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1186462800,
            "id":433257,
            "title":"Off to shop!"
        },
        "1311212":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "would fit right in....",
                "might want to gain a few more pounds..."
            ],
            "content":"<div class=\"\"><div> <span>\"Let's head out then!\" James said. He stepped past the store plan and saw beyond it a moving sidewalk down the hallway of the Galleria.<br>\r\n<br>\r\n\"Well, that certainly helps when hauling this bod around,\" remarked Lisa, navigating her generous new tush across to board the moving belt.  On the moving sidewalk she and James could see a lot of folks, and window displays in a lot of shops, and judging by what they saw, at 500 pounds each they...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1227589200,
            "id":611618,
            "title":"a moving sidewalk inside the Galleria"
        },
        "131122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "there were far fewer cars...",
                "many of the bus passengers seemed well off..."
            ],
            "content":"<div class=\"\"><div> <span>James and Lisa approached the bus, and Lisa noticed that the driver was fatter than James - a lot fatter than James. The two boarded and James asked the driver, \"Do you go to city hall, or near a shopping mall?\"<br>\r\n<br>\r\nThe driver replied, \"I go right by the Mammoth Mall.\"<br>\r\n<br>\r\n\"Great!\" replied James.  He and Lisa proceeded back into the bus, passing by two fat people enthroned on big comfy seats right at the front - fat people far bigger than James had ever imagined, looking like those photos of the fattest people in the Guinness Book of World Records.  James tried not to stare, and caught Lisa doing the same thing.  They quickly found seats together, and sat as the bus rolled comfortably along.<br>\r\n<br>\r\nAs they rode, they noticed that...</span></div></div>",
            "created":1133499600,
            "id":287293,
            "title":"On the bus"
        },
        "1311221":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "the moving sidewalks ....",
                "the number of people riding on scooters!"
            ],
            "content":"<div class=\"\"><div> <span>As James and Lisa rode in the bus, they noticed a number of changes from their world.  One of the most noticeable was how much cleaner the air was - and that there were far fewer cars on the road.  Also, the bus they were on seemed incredibly quiet.  <br>\r\n<br>\r\nThe Mammoth Mall loomed up in front of the, and when the bus pulled up to a stop, they and about half the others on the bus disembarked.  The wide mall doors opened and closed in front of them, and they found themselves in a mall that looked familiar, yet different.  One of the differences was...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1207803600,
            "id":518274,
            "title":"Differences to see"
        },
        "13112211":{
            "author_id":"knt23",
            "author_name":"Katie",
            "choices":[
                "ugly, but James wouldn't say so.",
                "bright purple and would look nice on Lisa."
            ],
            "content":"<div class=\"\"><div> <span>One of the differences was the moving sidewalks.  People could ride it around the mall and step off right into the store.  James and Lisa exchanged glances.  Interesting.  The found an empty spot on the sidewalk and hopped on.  It moved surprisingly fast with all the weight that was on top of it.<br>\r\n<br>\r\n\"Let's go in here!\" Lisa cried, pointing to a store with designer clothes.<br>\r\n<br>\r\n\"Uh, sure.\"<br>\r\n<br>\r\nLisa waddled into the store with James following behind.<br>\r\n<br>\r\n\"Oh, this is cute!\" Lisa said, holding up a shirt.  It was...</span></div></div>",
            "created":1213851600,
            "id":546380,
            "title":"The moving sidewalks"
        },
        "132":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "well into the 300 pounds",
                "at least 400 pounds!"
            ],
            "content":"<div class=\"\"><div> <span>James and Lisa saw a flash of a park full of people, then everything went dark.  James opened his eyes, and realised that he was not in the park anymore!  He was on his side, in the recovery position.  His head hurt!  He could see Lisa beside him, on a...bed.  A very big bed.  The room was dark.  James groaned, and rolled onto his back.  Looking around he could see a person sitting on a chair near the bed.  It was a guy....<br>\r\n<br>\r\n\"Oh I'm sorry. I don't how we...\" James started to say, then a surge of pain went through his head and he closed his eyes.  When he looked again, he realised that the person on the chair was a guy - a very big guy!  As he looked, the guy spoke.  <br>\r\n<br>\r\n\"Oh good, one of you is waking up.  The paramedics aren't here yet, but... do you mind if I turn on a light?\"  <br>\r\n<br>\r\n\"Yes,\" replied James weakly.  The huge guy got up, turned on a table to one side of the bed, and James got a good view of him.  The face he saw looked like himself!! In fact, the guy looked exactly like James - or like what James would look like if he doubled in weight!<br>\r\n<br>\r\n\"Wha...who...who are you!\" James asked.<br>\r\n<br>\r\n\"Whoa! Who are you?\" asked the large James.<br>\r\n<br>\r\n\"I'm James. Who are you?\" said James.<br>\r\n<br>\r\n\"I'm James too,\" the large James said. \"How'd you two get here?\"<br>\r\n<br>\r\n\"Well we were working at the lab and I touched a device then there was a noise and vibration and ... there were people in a park and....how did we get here?\" <br>\r\n<br>\r\n\"We carried you in here.  You fell out of the sky while some people were having lunch.  I carried you and my girlfriend Lisa carried her.\"<br>\r\n<br>\r\n\"Her name's Lisa too,\" James said in a still shocked voice.  \"How'd you get so big?\" he asked.  But before the large James could reply, he suddenly remembered that the people in the lab had been trying to find a way to ravel to another dimension.  Could he and Lisa have landed IN another dimension!  \"Where are we.  We might have been sent to another dimension!!!\"<br>\r\n<br>\r\n\"You're from another dimension?\"asked large James. \"Then you must be me, only from YOUR world. Why are you so small?\"<br>\r\n<br>\r\n\"Why are YOU so big?\" asked James.<br>\r\n<br>\r\n\"Well here in Blubberberg, being fat is good for you and is considered attractive.\" said large James.<br>\r\n<br>\r\n\"Wow, it's just the opposite in our world. I think we're going to like it here,\" says James. <br>\r\n<br>\r\n\"People will stare at you, call you 'freak',\" remarks large James. \"You'll have to get fat.\"<br>\r\n<br>\r\n\"Huh, that should be easy,\" replies James. \"Lisa and I've been on and off diets all the time - GAINING weight should be easy!\"<br>\r\n<br>\r\n\"Oh, you'll have to go on a diet,\" says large James, concern clear in his voice. \"Both of you. Your size is so unhealthy.\"<br>\r\n<br>\r\n\"But I don't want to get thinner!\" says James.<br>\r\n<br>\r\n\"Oh, is that what diets do in your world?\" asks large James. \"Here a diet is for gaining weight, for people who have trouble getting big, who are stuck being skinny. And you two sure are skinny!\"<br>\r\n<br>\r\n\"Us, skinny?\" <br>\r\n<br>\r\n\"You sure are!\" remarks large James.  He walks over to James and extends a hand to help him up. At close range, James realises that Big James is even bigger than he thought - James guesses Big James must weigh...<br>\r\n</span></div></div>",
            "created":1186462800,
            "id":433237,
            "title":"Waking up "
        },
        "1322":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                " haven't been that small since I was 10 years old....",
                " haven't been that small since I was 15 years old....",
                "am glad I called the paramedics - we gotta fatten you up right away!"
            ],
            "content":"<div class=\"\"><div> <span>\"You sure are!\" remarks large James. He walks over to James and extends a hand to help him up. At close range, James realises that Big James is even bigger than he thought - James guesses Big James must weigh at least 400 pounds!  While at first James had only noticed his namesake's big belly, now he sees thicker arms, big hands, a big chest, and huge legs - this other James must be well over twice his weight!<br>\r\n<br>\r\n\"Can I ask you something?\" says little James, hesitating a bit.<br>\r\n<br>\r\n\"Sure!\" replies the larger James.<br>\r\n<br>\r\n\"It may be too personal, but....you seem huge to me.  How much do you weigh?\"<br>\r\n<br>\r\n\"Me?  I'm not huge, I'm only 430 pounds.  How much do you weigh?\"<br>\r\n<br>\r\n\"189 - I used to be over 200,\" replies smaller James.<br>\r\n<br>\r\n\"189!  Boy that's small.  I...<br>\r\n <br>\r\n</span></div></div>",
            "created":1195621200,
            "id":467070,
            "title":"Big James is big...."
        },
        "133":{
            "choices":[
                "They eat her candy",
                "They fall in love with her"
            ],
            "content":"<div class=\"\"><div> <span>Stickiness. They felt sticky all over. It was as if they were drowning in some viscous goo, but before they could black out, a pair of strong arms lifted them to the surface.<br>\r\n<br>\r\nHacking, they wiped the stuff from their eyes and saw a tall figure before them. It was probably a woman, but neither could honestly tell for sure. She complusively brushed her blue bangs away from her face, even though it didn't seem long enough to get in her eyes. She smiled from behind large spectacles.<br>\r\n<br>\r\n\"Where are we?\" Lisa said around a sweet mouthful of whatever the goo was.<br>\r\n\"You are in a fattening center,\" the blue-haired one explained.<br>\r\n\"A what?\" James asked, scooping goop from his ears.<br>\r\n\"A fattening, chewy, caramel center, in fact.\" They began to notice that, indeed, they were standing in a huge pool of thick caramel. Bluie was sitting on the edge of the pool, which was surrounded by chocolate.<br>\r\n\"Would you two mind telling me what you are doing inside of my record-breaking confection?\" She grinned wider, but less friendlily.</span></div></div>",
            "created":1115442000,
            "id":249014,
            "title":"The Big Fattening Center"
        },
        "1331":{
            "choices":[
                "James and Lisa eat their fill, which isn't much.",
                "They eat the whole thing.",
                "Blue has tricked them somehow."
            ],
            "content":"<div class=\"\"><div> <span>\"We're not sure.\"  James said.  \"One minute, we were in our lab, the next thing we know, we're here.\"<br>\r\n<br>\r\n\"You're scientists?\"  Blue asked.<br>\r\n<br>\r\n\"Well, yes.\"  James replied.<br>\r\n<br>\r\n\"Excellent!\"  She said, the friendliness returning to her smile.  \"You'll understand, then, when I tell you that you have landed in my latest experiment.\"<br>\r\n<br>\r\nLisa had begun to actually slurp the delicious caramel, but this led her to swallow nervously and stop.  \"Experiment?\"<br>\r\n<br>\r\n\"Oh, that frightened you.\"  Blue said.  \"Fear not, and please keep eating.\"<br>\r\n<br>\r\n\"Eating your experiment?\"  James asked.  \"We couldn't do that.\"<br>\r\n<br>\r\n\"No, silly.\"  Blue corrected.  \"This gigantic candy is not the experiment, although it does represent a remarkable triumph.  No, the experiment is about capacity.  Namely, how much one will eat when surrounded by food.  We had intended for people to choose their favorite, but you've landed in the middle of this giant candy, so I guess that will do.\"<br>\r\n<br>\r\n\"So you want us to eat as much of this as we want?\"  Lisa asked.<br>\r\n<br>\r\n\"Eat the whole thing, if you can.\"  Blue responded.  \"All the caramel, all the chocolate.\"<br>\r\n<br>\r\n\"No one could...\"  James started, but was interrupted.<br>\r\n<br>\r\n\"She's right, James!\"  Lisa exclaimed as she broke off a piece of the chocolate wall and ate it.  \"This whole thing is edible!  And delicious!\"<br>\r\n<br>\r\n\"Go on, James.\"  Blue encouraged.  \"Try it.\"<br>\r\n<br>\r\nJames put his mouth into the caramel and slurped.  It was good,  quite good.</span></div></div>",
            "created":1429653540,
            "id":1967580,
            "title":"They eat her candy"
        },
        "13311":{
            "choices":[
                "Blue takes Lisa and James to her lab.",
                "Lisa and James demand an explanation."
            ],
            "content":"<div class=\"\"><div> <span>Blue looked disappointed as James and Lisa slowed to a halt.<br>\r\n<br>\r\n\"That's it?\"  She asked them.<br>\r\n<br>\r\n\"Oh, God, I'm so stuffed.\"  Lisa groaned.<br>\r\n<br>\r\n\"I don't even want to smell this caramel anymore.\"  James agreed.<br>\r\n<br>\r\n\"All right then.\"  Blue said, making a tsk noise with her tongue.  \"Out you go, I guess.\"<br>\r\n<br>\r\nJames and Lisa climbed out of the candy onto the platform where Blue sat.<br>\r\n<br>\r\n\"Now, we'll get you cleaned up, and... wait, what's wrong with the two of you?!\"  Blue asked in shock.<br>\r\n<br>\r\n\"Other than the fact that I'm going to explode?\"  Lisa asked.<br>\r\n<br>\r\n\"You're...thin!\"  Blue yelled.  \"I thought that your faces looked strange, but I couldn't see your bodies before.  You're little twigs!\"<br>\r\n<br>\r\n\"Not after that display of gluttony.\"  James answered.<br>\r\n<br>\r\n\"Gluttony?\"  Blue asked.  \"That wasn't even an appetizer, but I can see now why it was so difficult for you.  This won't do, no, not at all.  We've got to work on this, A LOT.\"<br>\r\n<br>\r\n\"Work on what?\"  James asked.<br>\r\n<br>\r\n\"On you.\"  Blue said.  \"I don't know how you've survived to adulthood being so thin, but we've got to correct this right away.  Fortunately, you came to the right place.\"</span></div></div>",
            "created":1429654620,
            "id":1967586,
            "title":"James and Lisa eat their fill, which isn't ..."
        },
        "133112":{
            "choices":[
                "They play along.",
                "They try to make a run for it."
            ],
            "content":"<div class=\"\"><div> <span>\"We're just two normal people.\"  Lisa said.  \"Why do you keep saying we're so thin?\"<br>\r\n<br>\r\nBlue frowned.  \"You're delusional.  What a predicament.\"<br>\r\n<br>\r\n\"We're not delusional.\"  James explained.  \"We just don't understand.\"<br>\r\n<br>\r\n\"You don't understand that you're supposed to be fat?\"  Blue asked.<br>\r\n<br>\r\n\"Why would we want to be fat?\"  Lisa asked.  \"I'm quite alright with the way I look.\"<br>\r\n<br>\r\n\"Sure, but what about your health?\"  Blue asked incredulously.<br>\r\n<br>\r\n\"Getting fat isn't going to improve that.\"  James said.<br>\r\n<br>\r\n\"I thought you were scientists.\"  Blue said.<br>\r\n<br>\r\n\"We are.\"  James replied.<br>\r\n<br>\r\n\"But you don't know that the single most important key to health is how fat you are?\"  Blue asked.<br>\r\n<br>\r\n\"Right, being thin prevents health problems.\"  Lisa offered.<br>\r\n<br>\r\n\"Kids, I don't know where you're from, but here on Grelon, you've got to know that being fat is the key to happiness and well-being.\"<br>\r\n<br>\r\n\"Grelon?\"  James asked.<br>\r\n<br>\r\n\"Yes, the planet.\"  Blue confirmed.  \"You're in the heart of the nation-state of Adipos.\"<br>\r\n<br>\r\nJames and Lisa looked at one another.</span></div></div>",
            "created":1429655520,
            "id":1967594,
            "title":"Lisa and James demand an explanation."
        },
        "1331121":{
            "choices":[
                "James and Lisa do as they are told.",
                "They make a run for it."
            ],
            "content":"<div class=\"\"><div> <span>\"OK.\"  James said.  \"What do we need to do?\"<br>\r\n<br>\r\n\"Now you're starting to sound like yourselves; that sugar must be kicking in.\"  Blue said.  \"I'm going to put the two of you in the clinical observation unit, where I can control and monitor your diets.  We'll have you looking and feeling better in no time.  You're lucky you ended up here.\"<br>\r\n<br>\r\n\"What is this place?\"  Lisa asked, as Blue led them toward a building with rounded edges.<br>\r\n<br>\r\n\"This is the National Institute for Nutrition.\"  Blue explained.  \"We spend our days and nights trying to figure out ways to improve the health of the people of Adipos through better nutrition.\"<br>\r\n<br>\r\n\"By making them fat.\"  James said.<br>\r\n<br>\r\n\"No, by making them fatter.\"  Blue corrected, leading them through the front doors.<br>\r\n<br>\r\nThe place was quiet.  In fact, there was no one around at all.<br>\r\n<br>\r\n\"Where is everybody?\"  Lisa asked.<br>\r\n<br>\r\n\"This is the week of the largest nutrition conference on Grelon.  I'm the only one here, but that's good.  We'll have a chance to put some pounds on you before everyone returns.\"<br>\r\n<br>\r\n\"Why aren't you fat?\"  James asked bluntly.<br>\r\n<br>\r\n\"I'm not human.\"  Blue responded.  \"I am an android scientist.  I exist to serve the people of Adipos and Grelon and work relentlessly to make them as fat as possible through discovery and innovation.  Now, go ahead and clean up while I make some preparations.\"</span></div></div>",
            "created":1429656300,
            "id":1967601,
            "title":"They play along."
        },
        "13311211":{
            "choices":[
                "The next morning...",
                "The next week..."
            ],
            "content":"<div class=\"\"><div> <span>James and Lisa were led to separate rooms.  The quarters were reasonably comfortable with modest but oversized furniture and large bathrooms.  Each of them felt better after they had washed the caramel off.  Clothing awaited them, clean and utilitarian.  They returned to a common area, where Blue awaited.<br>\r\n<br>\r\n\"Take these.\"  She said, handing each of them a pill.<br>\r\n<br>\r\n\"What are they?\"  Lisa asked.<br>\r\n<br>\r\n\"They're an experimental drug designed to maximize fat cell growth and replication.  We've found that they're not very effective in people who are already at a healthy weight, but in thin animals, the results were quite good, with animals increasing their weight by 124.7% at one week.  I think we can do better with you with round the clock nutrition.  You'll take these once per day.\"<br>\r\n<br>\r\n\"Wait a minute.\"  James said.  \"We're not lab rats.\"<br>\r\n<br>\r\n\"They're perfectly safe.\"  Blue reassured them.  \"There were no adverse side effects in our human trials.  In fact, they seemed to make people feel calm and happy.  They just weren't effective at their intended purpose.  I believe they will work well on the two of you.\"<br>\r\n<br>\r\n\"But you don't...Lisa, what are you doing?\"  James said as he watched Lisa take the pill.<br>\r\n<br>\r\n\"Oh James, this has to be a dream.\"  She said with a wink.  \"Just take it.  You don't want me to get big and fat all by myself, do you?\"<br>\r\n<br>\r\nJames complied.<br>\r\n<br>\r\n\"Excellent.\"  Blue said.  \"These next pills are appetite stimulants.  You'll receive them twice per day.\"<br>\r\n<br>\r\nThey took the pills without question, and Blue left to go get food.<br>\r\n<br>\r\nShe returned with a cart containing a variety of foods as well as two small tubes.<br>\r\n<br>\r\n\"Now, tilt your heads back.\"  Blue said.<br>\r\n<br>\r\nThey did as they were told, but both jumped back when Blue attempted to put the tubes down their noses.<br>\r\n<br>\r\n\"What the hell are you doing?!\"  Lisa snapped.<br>\r\n<br>\r\n\"Placing your feeding tubes.\"  Blue explained.  \"In addition to whatever you eat, you'll be receiving feedings around the clock through these small tubes.  If you just relax, I'll have them in before you know it.\"<br>\r\n<br>\r\nJames shrugged his shoulders as he looked at Lisa.  They once again complied.  After the initial sensation, they soon found that the tubes were fairly unobtrusive.  Through long extensions, Blue connected the tubes to outlets in the wall, and a whitish liquid began to flow.<br>\r\n<br>\r\n\"Now, your jobs are to relax, enjoy yourself, rest, and eat.\"  Blue said.  \"Especially to eat.  The foods and your tube feedings have been designed to deliver optimal calories at all times.  When you need more, just ask.\"<br>\r\n<br>\r\n\"I don't know about you, James, but I'm hungry.\"  Lisa said, grabbing a cookie from the cart.<br>\r\n<br>\r\nJames hesitated for just a moment before joining her.</span></div></div>",
            "created":1429658940,
            "id":1967616,
            "title":"James and Lisa do as they are told."
        },
        "135":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "a little on the small side...",
                "a bit bigger than average - I practice a lot..."
            ],
            "content":"<div class=\"\"><div> <span>James came too, feeling a little groggy.  He looked around, and the first thing he saw was Lisa, who looked no better.  They were lying on a vast bed of some sort, in a dimly lit room that looked like a bedroom - but the proportions were off.  The door, for example, was too wide.  Before James can fully come, too, though, the door opens and two people come in.  <br>\r\n<br>\r\nWell, they're clearly people, but unlike any James and Lisa have seen before.  The man has red hair and glasses, and James thinks that his eyes might be blue, but they are buried so far back behind fat cheeks that it is hard to tell. And it is not only the man's face that is fat - he has no neck either, and his shoulders are huge!  So are his arms, hugely fat inside a loose tank top that drapes over a pair of exceeding fat pecs and droops down onto a huge gut.  The other person is a huge woman, blonde, with green eyes also buried in fat cheeks, and a vast cleavage thanks to two huge breasts that rode just above a huge belly.  Her arms were thick with fat too.<br>\r\n<br>\r\n\"You're waking up!\" says the man, \"that's good!  How do you feel, are you hurt?  We'll get you help if you need it, but we didn't want to embarrass you by calling an ambulance unnecessarily.\"<br>\r\n<br>\r\n\"Embarrass us?  What happened?\" James asks.<br>\r\n<br>\r\n\"Well, you seemed to fall out of the sky beside our picnic.  We were just having lunch outside the lab when you literally fell onto the ground beside us. You didn't seem hurt, only dazed, so we hustled you here.\" <br>\r\n<br>\r\nThe woman added, \"If we'd called an ambulance then the photogs would have seen you and that would have been SO embarrassing for you.\"<br>\r\n<br>\r\n\"Embarrassing?\" asked Lisa.<br>\r\n<br>\r\n\"Oh yes, you two are so scrawny, they would have photoing you a lot.\"<br>\r\n<br>\r\n\"Scrawny?\"<br>\r\n<br>\r\n\"Oh yes, we've never seen anybody as thin as you.\"<br>\r\n<br>\r\n\"Wow,\" said James.  \"Cause you seem pretty fat to us - no insult intended.\"<br>\r\n<br>\r\n\"No, being called fat is never an insult!\" said the woman brightly.  \"Anyway, I'm Lisa and this is my husband James.\"<br>\r\n<br>\r\n\"That's amazing!  I'm Lisa and this is my co-worker James.\"<br>\r\n<br>\r\n\"Why are you so thin?\" the man burst in. <br>\r\n<br>\r\n\"We're a normal size,\" replied James cautiously.<br>\r\n<br>\r\n\"Where do you come from?\"<br>\r\n<br>\r\n\"Springfield.\"<br>\r\n<br>\r\n\"Well, this is Springfield, but I've never seen anyone as thin as you before here.\"<br>\r\n<br>\r\n\"How big are you?\"  James asked the bigger James.<br>\r\n<br>\r\n\"Me?\" asked James.  \"Just an ordinary size, maybe....<br>\r\n</span></div></div>",
            "created":1144213200,
            "id":310924,
            "title":"Arriving at James' and Lisa's place"
        },
        "1351":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "500 pounds...",
                "600 pounds....",
                "put on another 100 pounds or more..."
            ],
            "content":"<div class=\"\"><div> <span>\"How big are you?\" James asked the bigger James.<br>\r\n<br>\r\n\"Me?\" asked James. \"Just an ordinary size, maybe a little on the small side - I like my body, but I know Lisa would love to see me bigger.\"<br>\r\n<br>\r\n\"Would I ever!\" added Lisa enthusiastically.  \"I keep encouraging him to gain more weight, I just know he'll look fabulous once he's...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1207803600,
            "id":518220,
            "title":"Big James is a little on the small side?"
        },
        "13513":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "there was this huge famine...",
                "there was this flu that killed off all the skinny people..."
            ],
            "content":"<div class=\"\"><div> <span>\"Would I ever!\" added Lisa enthusiastically. \"I keep encouraging him to gain more weight, I just know he'll look fabulous once he's put on another 100 pounds at least...\"<br>\r\n<br>\r\nThe jaws of 'little' James and Lisa dropped at this declaration, but 'bigger' James just smiled sheepishly.  \"I know dear, and I am trying...\"<br>\r\n<br>\r\n\"I know, and I love how much you can eat because you're trying,\" Lisa cooed back.<br>\r\n<br>\r\n\"Another 100 pounds!\" little Lisa blurted out.  \"How...how BIG are people here?  Why are people big here?\"<br>\r\n<br>\r\n\"Well, there's some smaller than us, and a lot bigger than us - and a few a LOT bigger than us,\" bigger James replied philosophically.  \"As to why...well, about a hundred years ago...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1243400400,
            "id":698066,
            "title":"James needs another 100 pounds?"
        }
    },
    "info":{
        "author_id":"jawmax",
        "author_name":"Jawmax",
        "brief_description":"A man and woman goes to a diminsion were being fat is healthy and attractive.",
        "created":1087680000,
        "description":"<td align=\"left\" class=\"norm\">Through a freak accident James and Lisa are sent to a world where being fat is good for you and is considered beautiful.<br>\r\n<br>\r\nKeep it in the area of weight gain and no gay/lesbian stuff.</td>",
        "id":859564,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1567013580,
        "modified":1567013580,
        "pretty_title":"World of Fat"
    }
}