{
    "chapters":{
        "1":{
            "author_id":"calipsosenvy",
            "author_name":"Bound in Bones",
            "choices":[
                "Peter's view on how Clara is growing more distant",
                "Captain Nightt's veiw on the 2 new comers on his ship",
                "Claras ponderings on what Jon might have meant...",
                "Whatever yu come up with!!!!"
            ],
            "content":"<div class=\"\"><div> <span>Clara awoke in the dead of night. She could hear the ship creak and moan with the rocking of the ocean. She sat up in her bunk and looked around. She heard Peter above her snoring contently. Every one was asleep. She removed the dagger from under her pillow and placed it in the belt of her pants. She gave a quick yawn and stretch sitting on the side of her bed. She tiptoed past sleeping men and clutter on the ground slowly up the stairs and onto the deck. The chill breeze hit her with a shock. The night was warm, but she never got used to the cold breeze on the open sea. She had been aboard <i>The Beleriand</i> for three months already and still she could not get used to the sudden wind. She noticed as she crossed the deck that it was completely empty, such a change from the hustle in the day. She still couldn't believe how Peter had talked her into dressing in drag and joining a pirate crew. Her guise as a young man was easy to see through and instead of going as \"Charles\" after the first week she started calling herself by her given name. No one was the least bit surprised. Though there were a few men she knew to stay away from. <br>\r\n<br>\r\nShe rather liked it like this. Empty. She felt as though the ship was hers, there was no one to be wary of, the only time she felt completely at ease. <br>\r\n<br>\r\nShe stood for a time at the bow letting the chill numb her skin. Looking out over the black night time waters there was no city lights in any direction. She had learned by now how to tell a heading by the stars and knew they were traveling west to what? She did not know. Her mind began to wander and soon she got sick at looking into the Abyss of dark nothing around her. It reminded her too much of her future. She was to be married to a wealthy man, run her own household, make her father proud... but that was months ago. Now she was nothing but a Pirate. The darkness scared her so she decided to lay flat on the ground both arms to her side looking straight up at the bright specs in the sky.<br>\r\n<br>\r\nLooking at the clear sky, feeling the motion of the sea below her, and the hard creaking of wood, she felt at ease almost happy. She felt strange, like her whole life was on a ship though she knew that she had been on a ship only once before this. She let her thoughts wonder past her caring. There was a small noise behind her. She thought it was the ships ceaseless creaking and thought nothing of it.<br>\r\n<br>\r\nA man sighed behind her. She jumped slightly tilting her head to see who it was. \"Didn't mean to scare you.\" It was Captain Jonathan Nightt. Clara didn't move and stared up, silent once again. \"Your Mother...\" He started slowly, \"Used to do the same thing.\"<br>\r\n<br>\r\n\"You know nothing of my mother.\" Clara said irritated. He knew how touchy she was about her mother. She didn't know why he insisted on bringing her up.<br>\r\n<br>\r\n\"I wouldn't say 'nothing'\" Jon said the usual smirk on his face missing. He seemed oddly somber, serious. Very different from his usual demeanor. Clara was silent once again. \"You were born some time in December, 1620. Were you not?\"<br>\r\n<br>\r\nClara sat up on her elbow and looked at him. \"How did you know that?\" She was surprised. <br>\r\n<br>\r\nHe stood still as stone looking out into the blackness that frightened her so much. He didn't smile or even look at her. \"You never met her, have you? Your mother I mean.\"<br>\r\n<br>\r\nShe looked away from him and back up at the arching sky. \"She died when I was young. I don't remember her too well.\"<br>\r\n<br>\r\nHe took a step toward her to rest his arm on the railing. \"What do you know of her?\"<br>\r\n<br>\r\n\"Why?\" She said irritated again. \"Its really none of your business.\"<br>\r\n<br>\r\nAt this Jon smiled looking down at her. \"Sorry Madam.\" He said in a mocking tone. \"If I hit a nerve I'll leave it be.\" He resumed is gaze over the waters blacker than the skys above. <br>\r\n<br>\r\n\"My mother was beautiful...\" Clara said after a long silence. \"She loved my father.\" Jon sneered at the last statement, but Clara ignored him. \"I was born in England and when I wasn't even a year old my father accepted his position on the island. So we boarded a ship and set out. We were attacked by pirates...It is said that they killed everyone except my father and I. We alone were spared. I haven't the memory for her, but I had portraits around my old home. She had dark hair as black as the sea below us and her eyes as blue as the sea in the morning.\"<br>\r\n<br>\r\nJon contemplated her answer for a moment. \"It's strange isn't it?\" He asked her taking a seat next to her.<br>\r\n<br>\r\n\"Strange? How so?\" she knitted her brow and looked up to him.<br>\r\n<br>\r\n\"Only that your mothers hair was as black as your fathers once was...\" He sighed again and touched her dark red hair.<br>\r\n<br>\r\n\"And what's that supposed to mean?\" She asked grabbing her hair protectively and sitting up.<br>\r\n<br>\r\nJon got to his feet. \"You're the schooled one.\" He said simply. \"Figure it out.\" He walked back out to the bow of the ship and looked towards the sky. All that was heard was the sound of the waves crashing against the hardened wood of the boat and the distant wind. \"A storm is coming.\" Was all he said before he left Clara alone to ponder her heritage.<br>\r\n<br>\r\n</span></div></div>",
            "created":1350024120,
            "id":1444912,
            "title":"Contemplation"
        },
        "14":{
            "author_id":"toastanium",
            "author_name":"Toastanium",
            "choices":[
                "Secure the front with Peter",
                "Secure the back behind Jonathan"
            ],
            "content":"<div class=\"\"><div> <span>In two hours, the wind picked up and the waves began to swell. The sky grew even darker, the starlight choked by ominous black clouds. Clara felt the first drops of rain against her face as she leaned against the mast, bracing against the strengthening gale. Peter came up to the deck along with a few other members of the crew, roused by Captain Nightt in the moments prior. He scowled at the rains ahead.<br>\r\n<br>\r\n\"Couldn't have picked a worse time for it,\" he grumbled, \"I was having the most wonderful dream. It was market day on the island, and all of the stalls were deserted. I walked through the aisles and took whatever I wanted.\"<br>\r\n<br>\r\nClara gave him a scolding look. \"That wasn't a dream. That happened right before we left. Thank you, by the way. I hope it was worth getting run out of town.\"<br>\r\n<br>\r\nPeter yawned, unfazed. \"It was, right up until now. How bad does it look, Captain Nightt?\"<br>\r\n<br>\r\nThe captain swung by on his way to the helm. His dark eyes sized up the approaching storm from under the heavy feathered hat on his head. \"It's a sizable one, lad. We'll need hands on the mainsail to keep her down when i steer, if you please.\"<br>\r\n<br>\r\n\"Aye aye,\" Peter responded, and headed for the sail ropes.<br>\r\n<br>\r\nClara fidgeted nervously. Jonathan caught her eye and gave her a calm grin.\"We'll make it through, Clara.\" A bolt of lightning illuminated the ship.<br>\r\n<br>\r\nAs the storm worsened and bore down on the galleon, Clara saw two ropes that needed securing; one at the front of the deck, at the mainsail with Peter, and one up on the poop deck with Jonathan, at the back of the ship. The winds whipped her clothes around her and the rain plastered her hair to her face. Through the blurry mess, she could tell that she would only have to time to tie one before the full force of the storm was upon them.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1500111180,
            "id":2353665,
            "title":"The storm rises"
        }
    },
    "info":{
        "author_id":"calipsosenvy",
        "author_name":"Bound in Bones",
        "brief_description":"Aboard a pirate ship, the captain seems to know more about her than she does herself...",
        "created":1350021180,
        "description":"<td align=\"left\" class=\"norm\">Clara Evans was born and raised in a well-to-do family on a somewhat small island under the control of England. Her father works for the government keeping control there. Her mother died in a pirate attack in the crossing. As a result she grew up with the fear of pirates.<br>\r\n<br>\r\n Her best friend, Peter, was never really the kind of guy to stay out of trouble. Due to his ill luck and uncaring attitude he managed to get himself and Clara aboard <i>The Beleriand</i>. Peter gets along well with the Pirates having grown up an orphan and causing trouble at a young age. Clara is a bit standoffish with the pirates and only talks to Peter in depth, but recently they are finding each other much more different than they thought. <br>\r\n<br>\r\nTogether they learn that pirating isn't all that it seems. They meet Captain Jonathan Nightt (Yes, with 2 't's) who isn't the typical pirate captain you'd imagine. He is a bit older than both Peter and Clara although not too old, he's just more experienced and with experience comes a sense of mystery. Also he is fairly good looking ;)<br>\r\n<br>\r\nThe only thing I ask as the creator of this line is that there is no graphic sexual scenes. By all means that doesn't mean no sex, just nothing graphic. I have rated this 13+ and I would like to try and keep it there.<br>\r\n<br>\r\nThanks!</td>",
        "id":1897291,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1500111180,
        "modified":1500111180,
        "pretty_title":"The Star Gazer "
    }
}