{
    "chapters":{
        "1":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Mr. Mulligan ",
                "Miss. Mulligan "
            ],
            "content":"<div class=\"\"><div> <span>Mr. Mulligan 47 - 6ft tall with blue eyes and dark brown graying hair. A tall athletic build and hairier than your average man, but just in the right places.<br>\r\nAlso is hung like a horse.<br>\r\nOr <br>\r\nMiss. Mulligan 44 - 5ft 8in with green colored eyes and long reddish graying hair. An above average tall curvy body with perky A-cup breasts with a shapely booty.</span></div></div>",
            "created":1548306000,
            "id":2606883,
            "title":"First we choose between Mr. or Miss. Mulligan "
        },
        "11":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "The Lewis Family",
                "The Munro Family",
                "Other Families ",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mr. Mulligan it is, now to move onto the families and the crazy experiments. </span></div></span></div>",
            "created":1548306000,
            "id":2606888,
            "title":"Mr. Mulligan "
        },
        "111":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Body Part Swapping",
                "Head swapping",
                "Change their roles in their family",
                "More choices "
            ],
            "content":"<div class=\"\"><div> <span>\"Now, now what shall I ever do with the Lewis Family.\" he said with a smirk. “Shall I swap body parts, swap heads or swap their roles in the family.” The doctor said with a sigh. After some deliberations and thinking in his chair the doctor declared his intentions.</span></div></div>",
            "created":1548392400,
            "id":2607532,
            "title":"The Lewis Family"
        },
        "1111":{
            "author_id":"ipee234",
            "author_name":"P-Two-Three-Four",
            "choices":[
                "Zoom in on John with the receptionist",
                "Martha is bored and looks around",
                "The littles wander off",
                "New arrivals come in"
            ],
            "content":"<div class=\"\"><div> <span>Dr Mulligan grinned as he looked at the Lewis family in the lobby of his B&amp;B on a hidden security camera above their heads. He’d been watching the family intensely since they’d arrived a few days ago. He saw them as perfect guinea pigs for his, to say the least, strange experiments.<br>\r\n<br>\r\nThe father, John Lewis, was stood conversing with a receptionist. He was quite a round man, obviously years past his prime and sorely in need of some physical exercise. The bottom of his beer gut dropping out from underneath the greasy white sleeveless top he wore. John was pretty hairy with his large, lumberjack beard, hairy armpits and swathes of hair running down his puffy legs.<br>\r\n<br>\r\nHis wife in contrast seemed in peak physical condition, her large, DD cup rack threatening to spill out from the low cut top she was wearing. Martha Lewis was a certified MILF, having curves in all the right places and with her lush vermillion locks and piercing blue eyes she looked like she could be a model if she wanted to. It was perplexing to Dr Mulligan how she’d ended up married to a slob like John. “Must be rich,” he noted.<br>\r\n<br>\r\nStanding together were their two oldest children, Jenny and Michael. Jenny was tall for a woman at 5’10” but seemed smaller than she was due to her shy personality. She had light red hair which was currently pulled into a neat ponytail behind her head, pushed away to reveal sensitive brown eyes. Her large C cup breasts were a handful but she made no attempt to flaunt them about. Michael was large and athletic, his muscles rippling out of his black tank top. He had shaggy dark brown hair and blue eyes, making him look like a laid back surfer.<br>\r\n<br>\r\nPlaying beside them were the three littles, Smith, Lauren and James. They were all cute, none being more than 9 years old. Smith was the ringleader, looking mischievous with his bucktoothed grin, his blue eyes sparkling. Lauren was cute in her pink dress and ballet flats while 5 year old James sped around in his Transformers onesie.<br>\r\n<br>\r\n“Oh yes,” Dr Mulligan cackled, “This will be very interesting indeed...”</span></div></div>",
            "created":1550552400,
            "id":2619833,
            "title":"Body Part Swapping"
        },
        "11113":{
            "choices":[
                "Michael watches his old body being disected of his body parts even his penis",
                "The doctor is seen drugging his younger brother Smith between his toes",
                "Rex loves his new pair of bare feet, but can't feel any sensation"
            ],
            "content":"<div class=\"\"><div> <span>Smith, Lauren and James wonder off into the other room to see the popcorn machine and gumball machine up close. Smith was wearing flops on his large tan, bare feet which made loud sounds as he walked across the tiled floor. Lauren wore cute sandals and James had on sneakers. Jenny kept an eye out on the trio as Michael sits down and props his sneakered-feet on another chair. Dr. Mulligan zooms into Michael saying \"Ah, my first victim!\"<br>\r\nAs the family finishes checking in, the doctor comes out of a side room and greets the family. He says \"Do you mind if I borrow your son Michael for a couple hours? I need some muscle to move some heavy equipment to other rooms. You all can get settled in your rooms and I'll spring for dinner.\" <br>\r\nJohn smiles and replies \"Sure, make mine medium rare! Michael, help the doc!\" Michael sulks and stands up and follows the doctor into the side room. <br>\r\nThe doctor says \"Take a seat Michael. Do you surf?\" Michael grins and takes a seat saying \"Not much anymore. The waves in Texas suck!\" The doctor laughs saying \"Oh, I betcha you still know how to stand on a board. I used to surf when I was younger and I still have my own surfboard...right over there (points to back wall). Michael stands up and walks over toward it. He exclaims \"Wow, the a cool surfboard! Can I try it out?\" The doctor replies \"Uh sure, its a long board so be careful when you stand on it. Take your shoes off before you step on it.\" <br>\r\nMichael takes the long board off the wall hooks and places it on the arms of the sofa. He quickly kicks off his sneakers, then climbs up onto the board in his stocking feet. As he does the standard surf pose, the doctor says \"Michael, do you always surf with your socks on?\" Michael looks down at his stocking feet and laughs. He quickly lifts each legs and peels off each sock. He places his tan bare feet down back onto the board. The doctor looks intently at Michael's bare beauties saying \"Those are sure some good looking surfer-type feet you have Michael...and those slender, long toes are perfect...do you pedicures?\"<br>\r\nMichael replies \"Just a couple times... my mom works at a beauty salon and gives me one when no one else is present.\" <br>\r\nThe doctor smiles saying \"Hey take off your shirt and really let loose.\" Michael peels off his shirt revealing a tan, hairless chest.<br>\r\nAs he poses, the doctor takes a few pictures with his camera phone. <br>\r\nMichael looks around the room and notices a padded table and some electronic equipment as he poses on the board. He says \"What's all that stuff for?\" The doctor replies \"A massage table and some special testing monitors. Hey, do you want a quick massage before helping me with moving stuff?\" <br>\r\nMichael contemplates for moment than nods his head. He gets off the board and walks barefoot over to the table. He then says \"Do you want me naked? My dad gets massages once in a while and loves going a la natural.\" The doctor replies \"Uh, if you don't mind. It makes it easier giving the massage without any clothes. I don't have any towels though, so you'll be exposed.\" <br>\r\nMichael shrugs his shoulders and pulls off his shorts and underwear and climbs up naked onto the table and lays down on his stomach. The doctor notices Michael's bare buns are even tan and the bottom of his bare feet are pinkish in color with no flaws.<br>\r\nA moment later the doctor is seen massaging Michael's back, arms, buns, legs and bare feet. Michael groans and moans murmuring \"Oh that feels good...more on my feet please.\" The doctor smiles and rubs Michael's feet and toes more. <br>\r\nUnknown to Michael, the doctor takes a small syringe and needle out of his pocket and quickly sticks it in between Michael's big toe and index toe inserting some liquid drug. Michael reacts by flinching saying \"Owww...what happened?\"<br>\r\nThe doctor replies \"Sorry Michael, I was trying to massage at the base of your toes. You probably felt a sting...it was just a nerve. Turn over on your back please.\"<br>\r\nMichael turns over slowly shaking his head a few times feeling dizzy. He has a semi-erection which the doctor notices as Michael's toes are tantalized by the doctor's fingers. The drug soon takes effect and Michael is out cold. <br>\r\n<br>\r\nA few hours later, Michael wakes up feeling strange. He looks around and notices his naked body is across from his head. He then notices his severed bare feet are laying on the table on either side of his head which is attached to a contraption that circulates blood and oxygen. He watches as the doctor comes in and picks up his severed feet and begins to attach them to another unknown person who is covered in a white sheet. The discarded feet are in a large glass pot and are severely deformed.<br>\r\nMichael becomes frightened but is unable to speak. After the doctor finishes attaching the feet to the body, he tickles them to stimulate the nerves. Michael feels the sensation and giggles. He stops as the doctor pulls back the sheet and reveals the body with his feet attached. It's his old classmate Rex who was in a wheelchair since he was little. <br>\r\nA few moments later, the doctor awakens Rex and he helps him up and begins to walk using Michael's bare feet. Michael watches and feels the cold tile against the bare soles of his feet.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1559365200,
            "id":2667759,
            "title":"The littles wander off"
        },
        "111131":{
            "author_id":"ipee234",
            "author_name":"P-Two-Three-Four",
            "choices":[
                "“Fine, do what you want to.”",
                "“Screw you.”"
            ],
            "content":"<div class=\"\"><div> <span>Michael was helpless, unable to talk or do anything while the Doctor grinning maniacally and Rex practiced bouncing around and moving with his new, fully functional set of feet. He thanked the Doctor as he skipped his way out of the laboratory, laughing as he passed his unneeded wheelchair and smirked arrogantly at Michael’s disembodied head.<br>\r\n<br>\r\nDoctor Mulligan waved goodbye as the doors hissed shut. He swiftly moved over to the table Michael’s head was perched on, adjusting some settings on the console and rearranging the wiring going into Michael’s nose and oesophagus. He tried to reach out for Michael’s mouth but pulled back once Michael gnashes his teeth angrily. “Ooh, you’re a <i>feisty</i> one! I like you!” the doctor hummed as he inspected Michael’s peeved-off-looking head.<br>\r\n<br>\r\n“Most of the people I <i>’borrow’</i> for my experiments are SO boring, you know, you’re average Joe’s and Jane’s popping by to stay for a couple nights, nothing special. But you my friend, YOU are different, YOU are a prized specimen: tall at 6 foot with such an athletic physique, a body that many would kill to possess. Not to mention the messy brown hair and brilliant blue eyes- in a couple of years, I could actually see you as an actor or at the very least, a male model.”<br>\r\n<br>\r\nMichael composed himself as he tried to pull together the right words in his drugged haze. “Wh-Why? Why are you... doing this?” Mulligan’s smirked again as he twirled around and booted up one of the monitors in his lab, showing Michael footage from dozens of cameras set up inside the bed and breakfast, footage focusing on every inhabitant staying there.<br>\r\n<br>\r\n“...What do you see out there, Mr Lewis? Happy families, laughing kids, romantic couples? Look closer.” Michael squinted his eyes as his eyes focused on what looked like a peaceful looking couple lazing about on deckchairs beside the pool outside. Nothing seemed amiss until Michael watched the portly man turn over and playfully stroke his partner’s crotch. He gasped as he saw the front of the woman’s bikini rise as a monstrous bulge grew and strained the tight fabric. Although he couldn’t hear it he sensed that the woman was giggling and imagining doing something dirty with her massive manmeat later.<br>\r\n<br>\r\n“Those two...” Dr Mulligan continued, “were in the middle of a bitter divorce when their car broke down and they came to my doorstep. They both wanted kids but the poor guy was completely  infertile. A couple months and a couple of changes later, they’ve fallen back in love again and are well on their way to having children now.” Michael observed the surprisingly clear footage and realised what he thought was the man’s middle-aged potbelly was actually a pregnant stomach, probably only a couple months from being ready to give birth.<br>\r\n<br>\r\n“Or even look at these.” He pointed to a screen where a pretty looking young lass, no more than about 16-17 years old, was walking hand in hand with a drop-dead-gorgeous 45 year old cougar. Michael watched on as the younger girl reached round and squeezed the MILF’s juicy butt inside her leopard print cocktail dress. <br>\r\n<br>\r\n“These two fine ladies were both trapped in abusive relationships with two of the ugliest brutes I’d ever seen. As soon as I found out I had them sent to my lab where I swapped their relationships over to their partners and then scrapped them for parts. Now they’re both in a healthy, supportive marriage with people they can talk to without the risk of getting a fist to the face.”<br>\r\n<br>\r\n“B-But they didn’t... They didn’t CHOOSE to be with each other, you, you forced them! And the age difference... the other woman’s l-like 30 years older!”<br>\r\n<br>\r\nDr Mulligan rolled his eyes. “Yes, I forced them to leave their crackhead boyfriends and live happier lives with caring partners. Yeah, I’M the bad guy here. And as for the age, well, every year is just a measure of how long it takes us to orbit the Sun- it doesn’t make a difference to me or to the genuine feelings they now have for each other. Plus, I put in a mental note to not do anything inappropriate until the girl’s 18th birthday.”<br>\r\n<br>\r\n“Do you get my point though? Many people, many families come here. Many are sad, lonely or just going through rough patches. Me and the work I do here, it has improved all their lives, no matter how bizarre it would sound outside these B&amp;B walls. Many people wish they could lead different lives, do different things, look like different people. That’s where someone like you comes in; I need you, more specifically your body, to help me to help out everyone else.”<br>\r\n<br>\r\n“Now, you have two options: you can cooperate, giving me full permission to take and distribute your body parts to those who need them more than you, and possibly receive a NEW body. I can also see if I can get you a new life to go with it as well if you really wanted me to.”<br>\r\n<br>\r\n“Or you can refuse to help me, leading me to take your parts by force and forcing you to leave as a disembodied head for as long as I see fit. You know your old friend Rex that just left? Yeah, he’s a new employee of mine and once he heard you and your family were staying here immediately asked for your feet and spinal chord. He seemed pretty happy with what he got but he didn’t realise that I’d left the mental connection between you and your spinal chord intact- you still can feel what he feels. Imagine that was something like, I don’t know, your arm and you got shot? You would feel ALL of the pain, no anaesthetic, no nothing. Just you, your disembodied head and your pain receptors screaming out constantly. Now what’s it gonna be?”<br>\r\n<br>\r\nMichael gulped. He thought it over quickly before he said:</span></div></div>",
            "created":1563339600,
            "id":2688533,
            "title":"Michael watches his old body being disected of ..."
        },
        "112":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Body Part Swapping",
                "Head Swapping",
                "Change their roles in their family",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>\"Now, now what shall I ever do with the Munro Family.\" he said with a smirk. “Shall I swap body parts, swap heads or swap their roles in the family.” The doctor said with a sigh. After some deliberations and thinking in his chair the doctor declared his intentions.</span></div></div>",
            "created":1548392400,
            "id":2607536,
            "title":"The Munro Family"
        },
        "113":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "The Beaumont Family",
                "The Watt Family",
                "The Buchanan Family",
                "Other Families"
            ],
            "content":"<div class=\"\"><div> <span>Doctor Mulligan went over a couple dozen screens from hidden cameras in his rooms at the guests that he had, all of which were unaware of these crazy experiments that went on in this place. Leaning back in his office chair he mumbles, \"No, not the Lewis's or the Munro's what about the Beaumont's? he said watching the mother and son.<br>\r\n<br>\r\n<u>The Beaumont Family:</u><br>\r\nRosemary Beaumont 39 - 5ft 9in lightly tanned with long brunette hair with icy blue eyes and in shape with D cup breasts and a big ass.<br>\r\nQuentin Beaumont 15 -6ft brown hair and bluish-gray eyes.<br>\r\n<br>\r\nThen after watching the two, he said to himself, \"I'll keep them in mind, but the Watt family seems like an interesting bunch to have fun with.\"<br>\r\n<br>\r\n<u>The Watt Family:</u><br>\r\nJean Watt 41 - 5ft 10in with long blonde hair with deep green eyes, in shape with large C cup breasts and nice ass.<br>\r\nDonald Watt 38 - 6ft with short brown hair and brown eyes.<br>\r\nMitchell Watt 13 - 5ft 2in with short brown hair and green eyes.<br>\r\nJacqueline Watt 15 - 5ft 7in with long brown hair and brown eyes with large C cup breasts.<br>\r\nEmily Watt 12 - 5ft 2in with long blonde hair and small B-cup breasts. <br>\r\nGlenn Watt 9 - 5ft tall with short blonde hair and green eyes.<br>\r\n<br>\r\n\"So many great choices, but what about about the Buchanan's?\" He mumbled to himself, but then looks over the Buchanan family going about settling in their room.<br>\r\n<br>\r\n<u>The Buchanan Family</u><br>\r\nFredrick Buchanan 47 - 6ft 2in with short brown hair with blue eyes. <br>\r\nNancy Buchanan 39 - 5ft 8in with shoulder length brown hair and gray eyes, with D cup breasts.<br>\r\nTimothy Buchanan 11 - 5ft 1in with short brown hair and blue eyes <br>\r\nMegan Buchanan 13 - 5ft 1in with long red hair and blue eyes, with large B-cup breasts.<br>\r\nScott Buchanan 16 - 6ft with short brown hair and gray eyes.<br>\r\nMargaret Buchanan 16 - 5ft 10in with long brown hair and brown eyes with Large C-cup breasts.<br>\r\n<br>\r\n\"Hmmm....the Buchanan's could be a great bunch to experiment with.\" He says with a devilish grin at all the ideas that are flowing into his head, but then he glances over at another screen showing another family that just arrived as well, \"maybe they could be too.\" </span></div></div>",
            "created":1548392400,
            "id":2607480,
            "title":"Other families "
        },
        "1133":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Body Part Swapping ",
                "Head Swapping ",
                "Change their roles in their families ",
                "More choices "
            ],
            "content":"<div class=\"\"><div> <span>\"Now, now what shall I ever do with the Munro Family.\" he said with a smirk. “Shall I swap body parts, swap heads or swap their roles in the family.” The doctor said with a sigh. After some deliberations and thinking in his chair the doctor declared his intentions.</span></div></div>",
            "created":1548478800,
            "id":2607568,
            "title":"The Buchanan Family"
        },
        "11332":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Margaret and Megan ",
                "Timothy and Scott ",
                "Fredrick and Nancy ",
                "Different combinations "
            ],
            "content":"<div class=\"\"><div> <span>After thinking it over a few times in his head he declared, \"head swapping is what I shall do.\" He says as he spins around in his chair until he is facing his assistant, \"who shall I get for you doctor?\" His assistant asks. <br>\r\n<br>\r\n\"Hmmm...\" he says as she turns back towards his screens. Watching the Buchanan Family go about settling, watching them all for a bit until he has an idea of who he wants. Turning back around in his chair he says, \"you shall bring me.........and.......\"</span></div></div>",
            "created":1548478800,
            "id":2607570,
            "title":"Head Swapping "
        },
        "113324":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Margaret and Fredrick",
                "Scott and Nancy",
                "Megan and Timothy ",
                "Maybe a combination involving the other families."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Doctor orders a different combination and that is?</span></div></span></div>",
            "created":1548478800,
            "id":2608101,
            "title":"Different combinations "
        },
        "1133241":{
            "author_id":"ampvdccc",
            "author_name":"engineered",
            "choices":[
                "The doctor follows the two more. ",
                "The doctor targets other members of this family. ",
                "The doctor swaps other arrivals. ",
                "The doctor opts for a different type of part swapping. "
            ],
            "content":"<div class=\"\"><div> <span>The two were drugged and brought to Dr. Mulligan's lab while the rest of the family was also drugged so no one would notice the two missing. He viewed the father-daughter pairing and thought they were the two best subjects to really test his reality-changing technology on. <br>\r\n<br>\r\nWhile they were laying on their respective tables, the devious doctor removed the heads of Frederick and Margaret using advanced laser-cutting technology. One that was done, he placed the heads and bodies on ice as he prepared the equipment and utensils for the rest of the operation. Finally, he removed the heads and bodies from the ice and spent the next 8 hours carefully reconstructing every nerve ending that would connect each head to its new body. After the tireless work, he stitched them up. The stitches were special in the sense that they dissolved into the body and caused it to heal at much more rapid rates. <br>\r\n<br>\r\nAfter 12 hours from start-to-finish, the operation was completed, and the two were placed back into their room. Frederick's, on his daughter's shorter body, was dressed in her nightie and placed back into the spooning position with his wife in their shared bed. And Margaret, shirtless with her father's beer-bellied hairy torso and only wearing night pants, was placed into her own bed, her large feet now hanging off the end of it. Mulligan noticed the girl was already starting to pop and erection in her sleep, confirmation to him that the procedure was indeed successful. <br>\r\n<br>\r\nThen, Mulligan waited. The sun began to rise and shone on the face of Nancy who began to stir. She shifted over and her eyes fell upon Frederick for the first time in his new form. Mulligan held his breath. But, he let out a sigh of relief when Nancy just smiled at her husband's bearded face. \"Hey sweetie,\" she said, cupping his soft breasts in her hands. She then snuck one of them up his nightie and teased his young pussy through his panties, rubbing it sensually. \"Mmm, that feels nice, dear.\" He said in his gruff voice. He reached over with his dainty hand and took his glasses off the night stand, putting them on. \"Damn, it felt good just to let the girl's out to breath last night!\" He said, referring to his perky tits. \"I know!\" Said Nancy licking her lips at the sight of her husband's erect nipples poking out from under his thin-veiled nightie.<br>\r\n<br>\r\nOn the other computer, the devious doctor watched as Margaret had already gotten out of bed, scratching her very male ass. She went over to the toilet, her penis still erect, much to her dismay. She turned around and pulled down her pants, sitting her fat male butt on the toilet, starting to take a shit. Her penis pointed straight outward and would not cease. She briefly thought about jerking off right there but knew that once she focused on getting ready for the day, the erection would subside (especially at her body's age, but she didn't know that). Once done, she wiped, pulled up pants, and washed her hands. Looking in the mirror, she flexed her arm. She had good muscle there. But, then she lifted and dropped her round belly. It bounced considerably. \"Ugh, I really need to lose this weight if I want Jeremy to ever go out with me. The girl's cute face vastly clashed with her new body, but she was none the wiser. She started the shower, taking off all the clothes and revealing the entirety of her middle-aged male body. <br>\r\n<br>\r\nNext...</span></div></div>",
            "created":1552107600,
            "id":2628046,
            "title":"Margaret and Fredrick"
        },
        "11332413":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Force then to switch clothes",
                "Make them think they are in the wrong clothes"
            ],
            "content":"<div class=\"\"><div> <span>Next the good doctor turned his attention to a mother in her early 40s and her teenaged son. Why the mother and son chose to be in this particular B and B he had no idea. They appeared to be a nice normal mother and son Possibly this maybe the last clean bed in town. Regardless, they looked to be a perfect match for his next experiment. <br>\r\n<br>\r\nThe mother Angela was dressed in sporty light blue blouse that stopped just after her elbows. It was modestly buttoned but still still a tiny bit of white satin could be seen under it. Her skirt was loose and stopped below her knees. It was white with tiny blue flowers but almost a sheer material. She had a simple pair of heels that completed the feminine look.<br>\r\n<br>\r\nHer son, being 19, looked a bit more disheveled. His name was Kyle as could be seen on his shirt. It was a trendy sports Jersey for no particular team. Just navy blue with white trim on the sleeves. His cargo pants had some style to them, but really weren't that impressive. After examining his sneakers through the camera the doctor could tell this boy was a track runner.<br>\r\n<br>\r\nOnce they got to their one bedroom they both noticed the awkward situation they were both in. Neither knew how awkward it was about to get. As they tossed their bags on the bed they were instantly grabbed and brought to the lab. <br>\r\n<br>\r\nWhile still awake the good doctor removed both of their outerwear then quickly tied them to two separate tables. He angled them so the could both see each other. Kyle wasnt nearly as humiliated as his mother. After all it wasnt that odd for her to see him in his boxer breifs. Through shocked and very confused he remained very calm and just wanted to know what was going on. His mother on the other hand was very vocal.<br>\r\n<br>\r\nAngela was now tied down, unable to move wearing her highwaist pink panties. Her white satin undershirt was still on however the straps had fallen off her shoulders. As a result her matching pink bra was in full view. She yelled and screamed in tears asking what was going on. <br>\r\n<br>\r\nDoctor Mulligan just ignored her and opened her luggage. He pulled out more of her underclothes and two long nightgowns. After casually placing them by Kyle's bed, he moved over to Kyle's bag. He laid out all of Kyle's socks and underwear in front of her. Then began to work.....</span></div></div>",
            "created":1581483600,
            "id":2786634,
            "title":"The doctor swaps other arrivals. "
        },
        "113324131":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Run for it",
                "Reluctantly go along"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok you two\" Dr. Mulligan began, \"As you can see next to you I've placed the others clothes. I can tell both of you are upset so I'll be quick with my request. You will both willingly dress as the other for the next 3 days. Once you've finished your stay here, you may change back and forget this whole experience.\" Mulligan stood back smiling awaiting a response. <br>\r\n<br>\r\n\"You are out of your mind!\" Angela yelled still trying to break free. As she jolted in her restraints her undershirt fell further down. <br>\r\n<br>\r\nKyle, being much more calm simply asked, \"...and if we dont?\" Which made the doctor smile even bigger.<br>\r\n<br>\r\n\"I'm so glad you asked!\" He chuckled as he turned on more lights in the room. He spun them both around and showed them two glass rooms next to them. \"Let me introduce to you the Westin High School cheer squad!\" <br>\r\n<br>\r\nAngela screamed in horror at the sight in front of her. In one room she saw a 7 attractive teenage girls all with naked 300 pound man bodies crying \"please help us!\" Right next to them in the second glass room were the man. 7 of them with their chubby old heads onto of fit teenage bodies all still wearing skimpy uniforms.  Them men were definitely enjoying themselves as they would press their firm ass cheeks to the mirror, showing the girls their sexy panties. One man walked to the glass right buy Klye and took his top off. <br>\r\n<br>\r\nDr. Mulligan turned off the lights and spun them back around. \"So what do you say? Seems easy right?\" <br>\r\n<br>\r\n\"Easy?\" Kyle said, \"I dont even think I'll fit in her clothes.\" <br>\r\n<br>\r\n\"Ah but that's the beauty. That's why I'm trying this on you two. They wont fit perfectly as you are not a woman and she isn't a man, but it will be close enough.\" Mulligan said looking at a still struggling Angela.<br>\r\n<br>\r\n\"So if we refuse, you'll switch our heads?!\" She yelled, but now with a terrified tone.<br>\r\n<br>\r\n\"I can do anything I wish to you two. Just consider that!\" Dr. Mulligan walked back over to the release clamps and let them both loose....</span></div></div>",
            "created":1581570000,
            "id":2786775,
            "title":"Force then to switch clothes"
        },
        "1133241312":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Release them",
                "Play by the rules"
            ],
            "content":"<div class=\"\"><div> <span>The both clumsily dropped to the lab floor and looked at each other. Kyle rushed to console and guard his mother. Angela was free to adjust her satin undershirt and tried to cover her lower half. \"This man is a psycho Kyle, but let's not test him. Quick hand me your briefs.\" <br>\r\n<br>\r\n\"Ah ah ah! One thing I forgot to explain.\" Dr. Mulligan began. \"I would also like you to refer to each others clothes as your own so Kyle you mother has requested HER briefs.\" <br>\r\n<br>\r\nKyle walked over and handed his mother HER briefs. \"Now, I'll need MY panties?\" Kyle asked looked at the doctor.<br>\r\n<br>\r\n\"Yes that's right but since it is night time, you will only need to wear your nightgown to bed. No need for your bra. That comes tomorrow. I'll see you all at breakfast!\" And with that Dr. Mulligan left to lab and opened a door to their room.<br>\r\n<br>\r\nKyle held up a pair of his mothers, now his apparently, seafoam green panties. \"This is never going to work mom. Let's just run out of here.\" His whispered moving towards the door. <br>\r\n<br>\r\nAngela had just pulled her sons breifs up her lower half and walked toward the glass rooms. \"No way Kyle, do you want to be like these people.\" One of the girls pushed her hairy belly to the glass and started crying out. \"You've got to release us.\"</span></div></div>",
            "created":1581570000,
            "id":2786776,
            "title":"Reluctantly go along"
        },
        "11332413122":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "That night",
                "In the morning "
            ],
            "content":"<div class=\"\"><div> <span>\"Don't even think about it Kyle! I dont want us getting our head swapped around. I like my body just fine thank you. I dont need to have my son's body below my head. Or....worse.\" Angela saw a very attractive brunette take out her dick and piss in front of the other girls. \"Put on my....I mean your night gown and let's go to bed.\" <br>\r\n<br>\r\nKyle reluctantly slid his seafoam panties up his hairy legs and struggled keeping his manhood contained. Angela had removed her satin undershirt but stopped at her bra. \"Kyle where are my undershirts?\" <br>\r\n<br>\r\n\"Sorry mom, but i...you dont wear undershirts\" Kyle laughed at his mothers embarrassed face. \"Take off my bra please.\" <br>\r\n<br>\r\nKyle now in his light green satin nightgown and matching panties stood next to his mom wearing only her socks and breifs. \"This will be an awkward 3 days\" she said trying to cover her breasts....</span></div></div>",
            "created":1581570000,
            "id":2786777,
            "title":"Play by the rules"
        },
        "1134":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "The Turner Family",
                "The Johnson Family ",
                "Both",
                "Your Choice "
            ],
            "content":"<div class=\"\"><div> <span>The family in question is the Turner Family which peaked Dr. Mulligan's interest in all the possibilities that he could try on them.<br>\r\n<br>\r\n<u>The Turner Family</u><br>\r\nBen Turner 42 - 5ft 11in with short blonde hair and brown eyes.<br>\r\nMelissa Turner 40 - 5ft 9in with long black eye and blue eyes with large C-cup breasts and nice ass.<br>\r\nPeter Turner 15 - 5ft 10in with short brown hair and brown eyes<br>\r\nJoan Turner 15 - 5ft 7in with long brown hair and gray eyes with small C-cup breasts.<br>\r\n<br>\r\nLike the last few times, he saw another family that he could experiment. Unlike the their families this particular one brought their two dogs along with them, \"hmmm...I never combined animals with humans before.\" He mumbles to himself as he thinks of those possibilities.<br>\r\n<br>\r\n<u>The Johnson Family</u><br>\r\nJoe Johnson 38 - 6ft 3in with short black hair and brown eyes.<br>\r\nMary Johnson 36 - 5ft 7in with long reddish brown hair and brown eyes.<br>\r\nDavid Johnson 14 - 5ft 8in with short brown hair and brown eyes<br>\r\nEmily Johnson 13 - 5ft 5in with long dark brown hair and hazel eyes.<br>\r\nRocco - a big black and white Pit Bull.<br>\r\nJack - a big black and brown German Shepard.<br>\r\n<br>\r\n\"So many choices!\" the doctor said with a evil grin. \"Now which of them should I pick?\" he said pondering.</span></div></div>",
            "created":1548392400,
            "id":2607488,
            "title":"Other Families "
        },
        "12":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "The Lewis Family ",
                "The Munro Family ",
                "Other Families",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Miss. Mulligan it is, now to move onto the families and the crazy experiments. </span></div></span></div>",
            "created":1548306000,
            "id":2606889,
            "title":"Miss. Mulligan "
        },
        "121":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Body Part Swapping",
                "Head Swapping ",
                "Change their roles in their family ",
                "More choices "
            ],
            "content":"<div class=\"\"><div> <span>\"Now, now what shall I ever do with the Lewis Family.\" She said with a smirk. “Shall I swap body parts, swap heads or swap their roles in the family.” The doctor said with a sigh. After some deliberations and thinking in her chair the doctor declared her intentions.</span></div></div>",
            "created":1548392400,
            "id":2607541,
            "title":"The Lewis Family "
        },
        "1211":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..get used to her new form.",
                "..explore her new form to figure out who's it is.",
                "..explore her new form sexually.",
                "..try and figure out who is responsible for this.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, lets try something a little different this time.\" Miss. Mulligan mumbles to herself to herself as she watches the Lewis family for a few more seconds when she finally gets an idea of what she wants to do in her head, \"assistant.\" She says.<br>\r\n<br>\r\n\"Yes, Doctor.\" Her assistant speaks up. <br>\r\n<br>\r\n\"Could you go and fetch me John Lewis and Lauren Lewis for an experiment, please.\" Miss. Mulligan explains.<br>\r\n<br>\r\n\"Yes Doctor.\" She answers and walks over to the elevator where she pulls in two medical beds inside with her. To lay the soon unconscious bodies of John and Lauren. With the door closing, she presses the button to head up to main floor of the Bed and Breakfast. As the elevator began to go up, Miss. Mulligan turned back to her computer to begin the process of releasing the fumes into the Lewis Family room to help make things easier for her assistant. As one by one each family member passes out right where they were standing, laying or sitting. <br>\r\n<br>\r\nSeeing her chosen subjects together in the living room sitting on the sofa in front of the TV, \"ooh...that should make things much easier for her.\" She says to herself as she sees her assistant pass by a camera on one of her monitors. Making her way towards the Lewis Family room with both beds until she stops just outside their door where Miss. Mulligan unlocks the door remotely so her assistant can get in. <br>\r\n<br>\r\nAfter this, she sees her assistant walk right in with both beds and makes her way towards them. Where she proceeds to pick up each subject, laying them on the beds, strapping them on for safety before she makes her way out and down to elevator. Bringing them down to Miss. Mulligan's lab like she was told to do. When she brings them into the operating room, Miss. Mulligan came into greet her, \"thanks assistant, but now if you may leave.\" She says as she grabs a pair of latex gloves while her assistant t walks out of the room.<br>\r\n<br>\r\nFrom there Miss. Mulligan began the process of stripping the bodies of latest subjects until both John's hairy chubby body is fully naked along with Lauren's small body as well. Once she did that she grabbed her invention that is a magical blade that can cut through any living thing without causing harm. With that in hand Miss. Mulligan held the blade over Lauren's small bodys waist carefully cutting right through. Until her little body separates into two horizontally. <br>\r\n<br>\r\nSmiling at the results of this, she then moves over to John's big hairy chubby body and does the same exact thing until he too is separated in half like Lauren. After doing that she picks up Lauren's lower half since it's much lighter than John's lower half. Carrying it over to the waist of John's torso setting it beside him. Where she then uses all her strength to move his lower half far enough away from his torso. From there she picks up Lauren's lower half again and attaches it to John's torso, making him have the lower half of 7 year old girl making him look rather ridiculous because of the size difference. <br>\r\n<br>\r\nNext she wheels Lauren's bed closer to John's, locking the wheels before she rolls John's naked hairy lower half onto the bed laying opposite of Lauren's torso. Not because it's a mistake, it's just part of Miss. Mulligan's plan as she carefully slides Lauren's torso down until it attaches directly to her dad's much big, hairy, adult male lower half backwards. So that right below her little waist is his big hairy smelly ass instead of his large 8 inch cock and hairy balls. After seeing the results of her latest swap she smiles at how perfect it came out, but mainly for how comical she looks with how wide her hips have become. Even making her giggle a bit from how she looks while she unstrapped Lauren's now hairy ankles before she leaves her be to go tell her assistant to take John back up to his room. <br>\r\n<br>\r\nOpening the door, Miss. Mulligan poked her head out, \"hi Doctor.\" Her assistant greets, \"hi assistant, could you take John back up to his room.\" <br>\r\n<br>\r\n\"I will Doctor, but what about Lauren?\" She asks.<br>\r\n<br>\r\n\"Ohh...she'll be with me for some observations.\" Miss. Mulligan answers.<br>\r\n<br>\r\n\"Okay.\" Her assistant answers and follows Miss. Mulligan into the operating room where she sees what she did to her latest subjects looking a bit surprised, but doesn't say a word. Instead she just grabs the bed that John is laying on and takes him back up to his room while Miss. Mulligan unlocks the wheels to Lauren's bed and wheels her into a test room where she'll watch Lauren adjust to her new form. However, not before Miss. Mulligan flicked a switch to change reality for John and Lauren to make everybody around them to think they are normal and to always be naked along with being horny. <br>\r\n<br>\r\nWith that done, Miss. Mulligan walked out of the room to take a seat in a separate room that has a view into the test room that Lauren can not see into. From there Miss. Mulligan just waits for Lauren to wake to see her new form which didn't last long as Lauren begins to stir as she lets out a long yawn and rubs her eyes with her small hands. Where her eye lids flutter a few times adjusting to the bright light above her before she tries to sit up only to find it a little difficult to do so. Looking down at why this could be, she sees something very odd, instead of her little legs she sees a big pair of hairy chubby legs below her waist that are backwards, \"huh.\" She says in her high pitched voice as she continues to look down while using her little hands to brace herself up.<br>\r\n<br>\r\n\"What happened?\" She mumbles to herself as she slowly raises a hand and pokes her now very hairy chubby ass. Feeling her little finger poke it resulting in now knowing that those legs are hers. After figuring that out she tries to move her large hairy legs, slowly bending each one bring her large hairy feet up into view before she turns herself perpendicular to her bed letting her large hairy legs hang over the edge until her large feet are firmly planted on the cool floor. In the process she felt something odd under her as she moved herself to the edge of her bed, wondering what it could be. Lauren carefully got off the bed where Miss. Mulligan giggled a little at the sight of Lauren standing there with her dad's backwards lower half seeing his large cock dangling between her hairy legs behind her almost like a tail. <br>\r\n<br>\r\nThat's when Lauren turned her upper to look behind herself to see down between her new hairy legs something that she has never seen before, but knows that boys have and screams out, \"A PENIS!\"<br>\r\n<br>\r\nSeeing her reaction made Miss. Mulligan giggle again as she continued to watch her when she slowly reached out with a small finger to poke the head of her penis to feel herself touch it and make her shutter from feeling it. From there Lauren began to....</span></div></div>",
            "created":1578978000,
            "id":2773858,
            "title":"Body Part Swapping"
        },
        "1212":{
            "choices":[
                "Do we follow Smith and his new toy?",
                "Do we follow Michael and his small toy?",
                "Does she take more family members?",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>'Well lets see ... who shall we begin with ?  Hummm ...Okay lets start with our oldest son and our middle son and see if they like the switch or not.\"<br>\r\n<br>\r\nShe then leads both boys into a strange looking, almost closet looking structure that was wired up with even stranger looking power devices and she pulls the switch ...... BBUUUZZZZ .... CRACK ..... BUZZZZZZZ ....... and then all the lights went out.<br>\r\n<br>\r\nShe then walks over to the panel box and trips the breaker and when the lights came back on, out walked both boys, looking like they were kind of in a daze, the oldest boy Michael walks out with his younger brother's body ... while Smith walks out with his older brothers body, both boys were naked but with different looking expressions once they came back to their senses.<br>\r\n<br>\r\nSmith was grinning and feeling up his new body and was getting quite hard, while Michael had the look of depression looking at his young small body and equally small thin penis ... </span></div></div>",
            "created":1548824400,
            "id":2609785,
            "title":"Head Swapping "
        },
        "12123":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..Lauren and James waking up.",
                "..Martha and John waking up.",
                "..she decides to change the roles of Michael and Smith.",
                "..she swaps the heads of Jenny and Jenny's boyfriend Chase. ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Well lets see...who shall we begin with? Hmmm...Okay lets start with Lauren and James assistant.\"<br>\r\n<br>\r\n\"Okay Dr. Mulligan.\" Her assistant answers and begins to wheel two bed towards the elevators when she hears, \"hold on a second assistant.\" <br>\r\n<br>\r\n\"Yes Dr. Mulligan.\" Her assistant stops and turns around to see Dr. Mulligan turn around in her chair and say, \"lets see how they like being the parents of the family.\" Dr. Mulligan tells her.<br>\r\n<br>\r\n\"Will do Dr. Mulligan.\" Her assistant answers and take note that she needs to get John and Martha as well.<br>\r\n<br>\r\nFrom there her assistant heads up in the elevator to room 220 while Dr. Mulligan turns back in her chair to watch in her monitors to see the Lewis family just going about there business as usual. That is until Dr. Mulligan press the designated key to release the knockout gas into the entirety of the room. Where she sees each member fall to the floor or slump over from where ever they were at that moment resulting in all of them being unconscious. Just as she sees her assistant arriving at the door just outside the room, \"perfect timing.\" Dr. Mulligan says to herself.<br>\r\n<br>\r\nMeanwhile her assistant is using her all access card to get into the room where she wheels in the two beds and brings them to the parents bedroom. Where she sees Martha laying on the floor while John is laying on the bed, so she walks over to Martha, picks her up and lays her on one bed. Then she wheels the other towards the side of the bed and rolls John onto the bed because he's not the lightest person. From there's she wheels them both out of the room and down to the bedroom that Lauren and James are sharing. She sees them both on laying on the floor in front of their toys they were playing with. <br>\r\n<br>\r\nShe looks at them for a moment before easily picking them up and laying them beside one of their unconscious parents. With them on the beds, she covers them up and wheels them out of the room and back down to Dr. Mulligan's laboratory. <br>\r\n<br>\r\nMeanwhile in the laboratory, Dr. Mulligan is prepping her own invention that allows her to swap the heads of who ever she puts through it. Making sure she gets the settings just right, but sometimes it can have a slight mix up. However, she is sure that this will work 100% work. As she finished that up, she sees her assistant walk in the room with her latest subjects, \"good work assistant, but if you don't mind.\" Dr. Mulligan says.<br>\r\n<br>\r\n\"Of course.\" Her assistant answers and heads out of the room while Dr. Mulligan gets right to work as she uncovers her four subjects and takes each off their bed and lays them into the machine. A strange looking, almost closet like structure that was wired up with even stranger looking power devices. Putting them in no particular order and closes the door where she begins the process of swapping their heads. <br>\r\n<br>\r\nShe pulls the switch......BBUUUZZZZ......CRACK.......BUZZZZZZZ.......and then all the lights went out. Only for a brief moment however, when the lights come back on in her laboratory. Dr. Mulligan walks over to the locked door while pulling her protective glasses off. She unlocks the door where an odd smoke like byproduct of the swap pours out slowly revealing the results of her latest swap. Laying on the floor of the head swap device, Dr. Mulligan got a bit of a surprise when she sees Lauren's little 7 year old head perched up on John's big 45 year old pudgy hairy body. Even more so as she James's little 5 year old head perched up Martha's big 44 year old curvy motherly body. <br>\r\n<br>\r\n\"Huh???\" Is all that's comes out as she looks over them for a moment before looking at John's big 45 year old head is perched up on Lauren's little 7 year old body while Martha's big 44 year old head is perched up on James's even smaller 5 year old body. <br>\r\n<br>\r\n\"Well....I suppose that was to be expected.\" She mumbles as she decide to just go with it and picks up each one and lays them on their beds again. Once she did that she then decided to try out her role swapping serum. Where she switched the dial on a gun like device that has a large needle at the end, changing it to '<span class=\"cnavy\">DAD</span>' and sticks the needle into Lauren's neck. Where she pulls the trigger, changing Lauren's role in the family to be the Dad. Then she moves onto James, changing the dial to '<span class=\"cpink\">MOM</span>' and sticks the needle into James's neck. Where she pulls the trigger, changing James's role in the family to be the Mom.<br>\r\n<br>\r\nAfter doing that, she decides to change it up a bit and changes the dial to '<span class=\"clblue\">YOUNGEST BROTHER</span>'  and sticks the needle into Martha's neck. Where she pulls the trigger, changing Martha's role in the family to be the Youngest Brother. From there she changes the dial once again to '<span class=\"cppink\">YOUNGEST SISTER</span>' and sticks the needle into John's neck. Where she pulls the trigger, changing John's role in the family to be the Youngest Sister. <br>\r\n<br>\r\nAfter all that, \"okay assistant.\" Dr. Mulligan calls out and her assistant comes into wheel the beds out of the room and back to their room. While she does that, Dr. Mulligan puts the role changing device away and takes a seat at her monitors to watch her assistant bring Lauren and James into their new room while putting Martha and John into new shared room.<br>\r\n<br>\r\n<u>For Choices 1 and 2:</u><br>\r\nFrom there she watches her assistant leave the room and starts to see....<br>\r\n<br>\r\n<u>For Choices 3 and 4:</u><br>\r\nor...</span></div></div>",
            "created":1585899240,
            "id":2812588,
            "title":"Does she take more family members?"
        },
        "12124":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Miss. Mulligan has her assistant bring the boys back to their rooms.",
                "Miss. Mulligan has her assistant bring the boys to her testing room.",
                "Miss. Mulligan decides to swap another two from another family.",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these choices.</span></div></span></div>",
            "created":1549083600,
            "id":2611685,
            "title":"More Ideas"
        },
        "1214":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..make the family share bodies.\"",
                "..use her newly built teleporter device.\"",
                "..injecting a new morph serum into them.\"",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Maybe we do something else instead, like...</span></div></span></div>",
            "created":1585804800,
            "id":2811915,
            "title":"More choices "
        },
        "122":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Body Part Swapping ",
                "Head Swapping ",
                "Change their roles in their family ",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>\"Now, now what shall I ever do with the Munro Family.\" She said with a smirk. “Shall I swap body parts, swap heads or swap their roles in the family.” The doctor said with a sigh. After some deliberations and thinking in her chair the doctor declared her intentions.</span></div></div>",
            "created":1548392400,
            "id":2607545,
            "title":"The Munro Family "
        },
        "123":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "The Beaumont Family",
                "The Watt Family",
                "The Buchanan Family",
                "Other Families "
            ],
            "content":"<div class=\"\"><div> <span>Doctor Mulligan went over a couple dozen screens from hidden cameras in her rooms at the guests that she had, all of which were unaware of these crazy experiments that went on in this place. Leaning back in her office chair she mumbles, \"No, not the Lewis's or the Munro's what about the Beaumont's? She said watching the mother and son.<br>\r\n<br>\r\n<u>The Beaumont Family:</u><br>\r\nRosemary Beaumont 39 - 5ft 9in lightly tanned with long brunette hair with icy blue eyes and in shape with D cup breasts and a big ass.<br>\r\nQuentin Beaumont 15 -6ft brown hair and bluish-gray eyes.<br>\r\n<br>\r\nThen after watching the two, she said to herself, \"I'll keep them in mind, but the Watt family seems like an interesting bunch to have fun with.\"<br>\r\n<br>\r\n<u>The Watt Family:</u><br>\r\nJean Watt 41 - 5ft 10in with long blonde hair with deep green eyes, in shape with large C cup breasts and nice ass.<br>\r\nDonald Watt 38 - 6ft with short brown hair and brown eyes.<br>\r\nMitchell Watt 13 - 5ft 2in with short brown hair and green eyes.<br>\r\nJacqueline Watt 15 - 5ft 7in with long brown hair and brown eyes with large C cup breasts.<br>\r\nEmily Watt 12 - 5ft 2in with long blonde hair and small B-cup breasts. <br>\r\nGlenn Watt 9 - 5ft tall with short blonde hair and green eyes.<br>\r\n<br>\r\n\"So many great choices, but what about about the Buchanan's?\" She mumbled to herself, but then she looks over the Buchanan family going about settling in their room.<br>\r\n<br>\r\n<u>The Buchanan Family</u><br>\r\nFredrick Buchanan 47 - 6ft 2in with short brown hair with blue eyes. <br>\r\nNancy Buchanan 39 - 5ft 8in with shoulder length brown hair and gray eyes, with D cup breasts.<br>\r\nTimothy Buchanan 11 - 5ft 1in with short brown hair and blue eyes <br>\r\nMegan Buchanan 13 - 5ft 1in with long red hair and blue eyes, with large B-cup breasts.<br>\r\nScott Buchanan 16 - 6ft with short brown hair and gray eyes.<br>\r\nMargaret Buchanan 16 - 5ft 10in with long brown hair and brown eyes with Large C-cup breasts.<br>\r\n<br>\r\n\"Hmmm....the Buchanan's could be a great bunch to experiment with.\" She says with a devilish grin at all the ideas that are flowing into her head, but then she glances over at another screen showing another family that just arrived as well, \"maybe they could be too.\" </span></div></div>",
            "created":1548392400,
            "id":2607490,
            "title":"Other Families "
        },
        "1231":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..bodypart swap.",
                "..head swap.",
                "..role swap.",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>The lure of messing with the mother and son pair was just to much for Miss. Mulligan and switched her monitor to just them. To see what they were up to in the room, a room of choice that made Miss. Mulligan intrigued because it is meant for family of four or six. Which mean there is three bedrooms, one for room the parents, two more for the kids to share or have their own room all to themselves. <br>\r\n<br>\r\nNot really sure why Rosemary Beaumont purchased the room, it intrigued Miss. Mulligan otherwise as she watches Rosemary unpack a multitude of luggage. Almost like she was moving into the room, filling the drawers with sexy lingerie and her daily outfits along filling the bathroom with a plethora of perfumes, soaps and towels, '<i>what is this woman doing?</i> Miss. Mulligan asks herself. <br>\r\n<br>\r\nAs she keeps watching Rosemary go about unpacking she sees her pull out a couple of odd items like pasties for your nipples, crotchless panties and a number of sex toys. Including various sized suction cup dildos and double ended dildos along with various sized butt plugs. Also some sex toys for men like flashlights. Seeing all of this really made Miss. Mulligan intrigued at what her job is, then she remembered that Rosemary had paid for the room in entirety of paper money instead of credit or debit, \"wait?........is she a stripper.\" Miss. Mulligan asks herself. <br>\r\n<br>\r\nThen her eyes go wide as she realizes that all of what she had just seen makes sense that Rosemary is indeed a stripper which could only mean that Quentin who is unpacking all his stuff in his room is her son whom of which may not who his real father is. However from what Miss. Mulligan sees as he pulls things out from his own luggage. She sees many things that could keep a 15 year old boy happy, she sees him pull out a PS4 which he hooks up to the provided TV in the room. Not only that, he also pulls out his brand new iPad Pro, his iPhone 11 along with plenty of sneakers and clothes that every teenage boy could ever want. <br>\r\n<br>\r\n\"Huh...it seems she treats him very well.\" Miss. Mulligan says to herself as continues to watch them get settled in while she thinks of what she can do with these two victims of hers. <br>\r\n<br>\r\nThinking of the many experiments she did in the past with various people, doing bodypart swaps, head swaps, role swaps and the many other things she's done to them. The question now is, what will Miss. Mulligan do now with Rosemary and Quentin, a....</span></div></div>",
            "created":1585630800,
            "id":2810697,
            "title":"The Beaumont Family"
        },
        "12314":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..body part swap and head swap.",
                "..body part swap and role swap.",
                "..head swap and role swap.",
                "..or a combination of all three.",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a combination of some choices, like...</span></div></span></div>",
            "created":1585638480,
            "id":2810740,
            "title":"More choices"
        },
        "123144":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..Quentin waking up first.",
                "..Rosemary waking up first.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Ohhh...I can't choose so I'll have everything done to them.\" Miss. Mulligan says as she finally comes to a decision, so she turns to her assistant, \"would be so kind as to fetch me Rosemary and Quentin from Room 202? Please.\" Miss. Mulligan asks.<br>\r\n<br>\r\n\"Yes Dr. Mulligan.\" Her assistant answers as she grabs two hospital beds, wheeling them into the elevator and proceeds to use the elevator to go up to the second floor of the <i>Bed &amp; Breakfast</i>. Where she wheels them out and down the hall towards the mentioned room. <br>\r\n<br>\r\nMeanwhile down in Miss. Mulligan's laboratory, she sees her assistant walking towards the room, so she presses the key on her keyboard to release the knockout gas into the room. Where it happens almost instantly as she sees Rosemary rub her forehead before stumbling and ultimately laying on her bed unconscious. Then down in Quentin's bedroom, she sees a less dramatic scene as he just slumps over onto his side on his bed laying there unconscious, \"Excellent.\" Miss. Mulligan says as she rubs her hands together mischievously.<br>\r\n<br>\r\nWhile Miss. Mulligan revels in that, her assistant is using her all access card to get into the room where Miss. Mulligan sees her wheel both beds into the room. Closing the door behind her and proceeds to take one bed to where Rosemary is laying on her bed where she moves her onto the bed, strapping her in. After that she heads out to get the other bed to get Quentin. Soon enough he too is strapped onto the bed just like his mom and are both wheeled out of their rooms and out of the their room. <br>\r\n<br>\r\nWhere Miss. Mulligan sees her assistant going down the hall with both of her soon to be test subject of her latest experiment. She was so excited that she went into her operating room to prep well before they even get down into her lab. She prepped so quickly that she just ended up waiting a few minutes until her assistant wheels in her subjects, \"excellent, assistant.\" Miss. Mulligan tells her.<br>\r\n<br>\r\n\"You're welcome.\" Her assistant says and leaves the room to wait.<br>\r\n<br>\r\nFrom there, Miss. Mulligan unstraps them from the beds and pulls them onto the operating tables. Where she pulls their clothes off until they're both naked, which will make swapping much easier. After getting them in position, Miss. Mulligan picks up this blade of her own creation which separates body parts without harm, \"ooohh....good to use this again.\" She cooos as she looks at the shiny blade in her hands before walking back over to Rosemary and Quentin. <br>\r\n<br>\r\nWhere she gets right to work, as she slices Rosemary's head and neck right off her shoulders. Moving it up right on the operating table. Then she proceeds to do the same thing with Quentin's head until he too is up right in the operating table a few feet away from his body. From there she uses the blade to slice off Rosemary's huge breasts so that they are still connected together and sets them aside. Where she then cuts off Quentin's flat, slightly hairy chest off and sets it aside. <br>\r\n<br>\r\nNext she sets the blade down and picks up Rosemary's rather hefty breasts where she holds them over Quentin's chest. Where she then lowers them down until his mom's huge ample breasts are firmly attached to his chest. After admiring that, she then picks up Quentin's flat and slightly hairy chest and attaches it to his mom's chest. Resulting in their chest being swapped, which looks rather comical Miss. Mulligan must say as she looks at her work laying on the table. After doing that she was about attach their heads to each other's bodies when she decided to do one last thing. <br>\r\n<br>\r\nMiss. Mulligan proceeds to roll their bodies over until she can see both of their asses, one being Rosemary's big ample ass and the other being Quentin's much smaller slightly hairy ass. Smiling at what she is about to do, she picks the blade back up and proceeds to cut each cheek off separately until she has four ass cheeks to swap. First she picks up Rosemary's big jiggly smooth ass cheeks and proceeds to attach them Quentin's small hips. Making them look ridiculous attached to his body, but not as ridiculous as seeing Quentin's small slightly hairy as she cheeks attached to his mom's wide hips.<br>\r\n<br>\r\nSeeing that, she decides why not and swaps their genitals also, so she slices off Rosemary's pussy along with Quentin's dick and balls. Where she sets them aside so she can sets the blade down. After that she picks up Quentin's dick and balls attaching them to Rosemary's crotch. Then she picks up Rosemary's pussy and attaches it to Quentin's crotch.<br>\r\n<br>\r\n\"Mmmm....now that is perfection if I must say so myself.\" Miss. Mulligan tells herself as she admires her latest work. <br>\r\n<br>\r\nTaking a few minutes to look over their altered bodies, she sets the blade down and rolls their bodies over again. This time she picks up Quentin's unconscious head and attaches it to Rosemary's altered body. Then she picks up Rosemary's unconscious head and attaches it to Quentin's altered body. <br>\r\n<br>\r\n\"Now they are complete.\" Miss. Mulligan says, but then she remembers one last thing, she didn't swap their roles, \"oh boy, couldn't forget that now could we.\" She says to herself as she walks over to a drawer and pulls out a syringe filled with blue glowing liquid. Where she walks back over to Quentin and injects half of the blue glowing liquid into his neck. Then she moves on over to Rosemary and injects the remaining glowing blue liquid into her neck. <br>\r\n<br>\r\nFrom there, they are now done, so Miss. Mulligan moves them back onto the beds and covers them up, \"assistant.\" She calls out and her assistant comes back in to see Dr. Mulligan's latest subjects are done, \"if you wouldn't mind.\" Dr. Mulligan says.<br>\r\n<br>\r\n\"Will do Dr. Mulligan.\" Her assistant says as she wheels them out of the operating room, into the elevator and up they go to the second floor where she wheels them back to their room. Once inside she lays Quentin on the bed in the room that Rosemary had unpacked all her stuff. Then she lays Rosemary in the bed in the room that Quentin had unpacked all his stuff. After doing that she quickly got out of the room and back down to Miss. Mulligan's laboratory. Where she sees her at her monitors again watching them. <br>\r\n<br>\r\nBack to Miss. Mulligan, she sees....</span></div></div>",
            "created":1585641480,
            "id":2810753,
            "title":"..or a combination of all three."
        },
        "1231441":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Catching up with Rosemary.",
                "Continue with Quentin.",
                "Unexpected guest at their room.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Quentin's eyelids start to flutter up as he stretches his newly acquired body that belonged his mother a few hours ago. Feeling much taller and a little more feminine than before, but also feels some familiar feelings. Coming from his slight hairy ass along with dick and balls that look dwarfed by his mom's wide hips along with her thick thighs. <br>\r\n<br>\r\nAnyways Miss. Mulligan smiles as she watches him sit up on the bed looking like your typical tired teenage boy as he looks down at his slightly hairy flat chest that he scratches with his mom's bright baby blue manicured nails like it was a normal thing to do. Then she sees him looking down to his limp dick and hairy balls between his smooth thick thighs and cracks smile before he wraps a hand around his dick to give it a few strokes before he gets up to his feminine feet. Where he stretches once again in a rather feminine and boyish manner because he Miss. Mulligan had changed his role to become his stripper mom, Rosemary. While keeping some of old ways mixed in with his new feminine attitude, \"excellent.\" Miss. Mulligan says to herself as she sees that it worked just the way she intended it to.<br>\r\n<br>\r\nFrom there Quentin mumbles to himself, \"god damn I'm sexy.\" As he starts to do a little dance. A dance that shows off his curves, his long smooth legs as his erect dick bounces around between them, his flat slight hairy chest and not to forget his slightly hairy ass which he gives a few smacks as he dance a little more. Which made Miss. Mulligan a little wet between her legs as she watched this young 15 year old boy dance like a stripper with his borrowed altered body, \"mmmm....I feel so sexy.\" Quentin says in his voice as unknowingly points his slight hairy as she towards one of Miss. Mulligan's very well hidden cameras where he starts twerking his ass, shaking good it along with his hairy balls which really gets Miss. Mulligan going. <br>\r\n<br>\r\n\"Oh man, gotta save that for tonight at the club.\" Quentin says to himself as he straightens up as he begins walking towards his dresser with a great deal of swaying going in his hips which make his dick sway side to side, \"I mean, guys just droll over me all night.\" He adds as he pulls open a drawer which contains all of Rosemary's various sex toys. <br>\r\n<br>\r\nBringing a big smile to Quentin's face as he looks at now his plethora of sex this in the drawer. At all the various suction cup dildos, butt plugs, and all the other stuff in there, \"oh boy, which one shall I choose.\" He mumbles as he reaches down to stroke his dick as makes up his mind, \"yeah, do it Quentin.\" Miss. Mulligan says to herself, \"play with your new sexy body.\" She adds. <br>\r\n<br>\r\nA few seconds later, Quentin grabs the largest red butt plug that was in there at 8 inches long and 4 inches thick, \"this will do for now.\" He says to himself as he closes the drawer and walks back over to bed. Tossing the huge red butt plug on the bed while he lays down on his back, and shows his new flexibly by putting his legs behind his head while putting his arms through. Where rubs his dainty feminine hands on his slightly hairy ass before stroking his dick and massaging his balls, \"god damn man, playing with my toys always gets me going so good.\" Quentin's moans as Miss. Mulligan sees him spit in his hands where he then rubs them between his hairy ass cheeks. Lubing up his moms gorgeous big brown asshole making him moan louder and louder until he just can't help himself and slides a few fingers in. Where his eyelids close as he moans from fingering his asshole, getting all his spit inside for a few more seconds until he pulls them out leaving his asshole gaping. <br>\r\n<br>\r\nAfter he recovers a bit, he spits in his hands again and this time makes a fist with one and shoves it right into his gaping asshole. Which makes him moan so loud as he feels his small fist inside his asshole while he uses his other hand to start stroking his dick again. Seeing this just made Miss. Mulligan so horny, that she hiked up her skirt and pulled her panties aside so she can start rubbing her aching pussy. As she watch Quentin pull his fist out only to shove it right back in a few more times until he looks a little sweaty and gaping enough to fit that huge butt plug in his ass, \"phew....that really gets me going.\" He moans.<br>\r\n<br>\r\nAs he grabs the huge butt plug with his spit covered hands, rubbing them all over it. Lubing it up the best he can before he lines it up with his beautiful gaping asshole. Causing him to toss his head bald as he moans just from thinking about it deep in his ass, stretching him out so good. However, he recovers soon enough and starts pushing the huge red butt plug into his ass. Feeling his stretchy hole stretching out more and more until his eyes go wide as he really starts to feel it. Right up until he jerks violently from his asshole swallowing it right in making him just about scream from the pleasure mixed with pain. <br>\r\n<br>\r\nFeeling the huge butt plug in his ass, stretching him out so good that he just moans some more as he strokes his dick a few more times before he finally puts his legs back down, resting his feet on the floor for a few minutes to recover before he sit up on the edge of the bed. Feeling that huge butt plug deep inside his ass and just stands up like normal before he turns back so he can look at the huge base of the red butt plug sticking out of his ass where he smiles as he breaths a little heavier than normal, \"good ass, but now can you handle this.\" Quentin says as he walks over to one corner of the bed foot of the bed. <br>\r\n<br>\r\nWhere there are decorative wooden pieces to the foot board that stick up a good 8 inches in the shape of globes. Quentin straddles one of them before he sets the base of the huge butt plug on it while spreading his hairy ass. From there he breathes in and out a few times before Miss. Mulligan sees him start to squat down until she sees the base of the huge butt plug starting to disappear into his ass. Then it does as Quentin just about screams in pleasure from feeling the huge red butt plug get swallowed up right into his ass completely. Leaving no trace of it showing as he stands up breathing heavily as he feels in there as his dick leaks pre cum on the carpeted floor.<br>\r\n<br>\r\nHe takes a few more minutes to recover from such a thing and soon enough he's standing up straight before he gives his hairy ass a few squeezes and smacks, \"now that is one talented ass right there.\" He says. <br>\r\n<br>\r\n\"It sure is Quentin.\" Miss. Mulligan says as he is fingering herself to the sexiest thing she's seen in a while. <br>\r\n<br>\r\nAfter that Quentin begins to walk towards his bathroom, his hairy ass swaying side to side as he does as he says, \"I better get cleaned up before I met with my son Rosey.\" <br>\r\n<br>\r\nSpeaking of Rosemary, what is she doing in her bedroom or continue with Quentin in the shower.</span></div></div>",
            "created":1585707300,
            "id":2811278,
            "title":"..Quentin waking up first."
        },
        "1232":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..a bodypart swap.",
                "..a head swap.",
                "..a role swap",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>The Watt Family had already moved into their room, already situated into their own rooms. The parents in one room and each of their kids having their own room, which is perfect for Miss. Mulligan and her interesting experiments. As she sits there twiddling her thumbs looking over the Watt Family go about their business in their rooms.<br>\r\n<br>\r\nMiss. Mulligan begins to wonder what she can possibly do to these new test subjects of her. She has plenty of possible things she can do to them, \"hmmm....what shall I ever do to these beautiful test subjects of mine.\" She says to herself as she continues watching as thinks of the things she can do like....</span></div></div>",
            "created":1599813420,
            "id":2901012,
            "title":"The Watt Family"
        },
        "1233":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..a bodypart swap.",
                "..a head swap.",
                "..a role swap.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>The Buchanan Family had already moved into their room, already situated into their own rooms. The parents in one room and each of their kids having their own room, which is perfect for Miss. Mulligan and her interesting experiments. As she sits there twiddling her thumbs looking over the Buchanan Family go about their business in their rooms.<br>\r\n<br>\r\nMiss. Mulligan begins to wonder what she can possibly do to these new test subjects of her. She has plenty of possible things she can do to them, \"hmmm....what shall I ever do to these beautiful test subjects of mine.\" She says to herself as she continues watching as thinks of the things she can do like....</span></div></div>",
            "created":1586499660,
            "id":2816527,
            "title":"The Buchanan Family"
        },
        "12334":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..making the family share bodies.",
                "..using her newly built teleporter device.",
                "..injecting a new morph serum into them.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something a little more experimental like....</span></div></span></div>",
            "created":1586499840,
            "id":2816528,
            "title":"More choices."
        },
        "123344":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..making the family posses each other's bodies.",
                "..making the entire family all headless.",
                "..making the entire family all bodiless.",
                "..using a new untested device to make heads and bodies separate.",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something even more experimental like....</span></div></span></div>",
            "created":1586500020,
            "id":2816529,
            "title":"More choices."
        },
        "1233444":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..Margaret getting use to her new form.",
                "..Joe getting use to his new form.",
                "..Miss. Mulligan wanting to experiment some more.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Ah..ha...that's what I'll do.\" She says as she remembers a new device she made a few years ago that she never really got around to testing, \"I'll make their heads and bodies separate.\" She adds as she practically runs over to a drawer where she kept the gun like device hidden. <br>\r\n<br>\r\nPicking it up out of the drawer she inspects it before powering it on which works perfectly, \"excellent.\" She mumbles before walking back to her wall of monitors where she looks at the Buchanan Family going about their business and wonders who she'll test it on first when she sees one of her janitors passing by on the screen. Who is a favorite of hers to include in these experiments because of his huge 13 inch black cock that he posses, \"oohhh...yesss.\" She basically moans just from the thought of seeing somebody else using it again. <br>\r\n<br>\r\nWith him in mind, she looks again. Mainly at the four children minding their own business in their rooms where she eventually decides on Margaret, the Buchanan's 16 year old daughter, \"she's perfect.\" Miss. Mulligan mumbles.<br>\r\n<br>\r\n\"Oohhh...assistant.\" Miss. Mulligan calls out and her assistant comes to her call, \"yes Dr. Mulligan.\" <br>\r\n<br>\r\n\"Could you fetch me Margaret Buchanan please, from room 330.\" Dr. Mulligan tells her.<br>\r\n<br>\r\n\"Okay.\" Her assistant answers and grabs a hospital bed where she makes her way towards the elevator and was just about to head up when she hears, \"ohh...and remember to bring Joe down with you.\" Miss. Mulligan tells her.<br>\r\n<br>\r\n\"Yes Dr. Mulligan.\" Her assistant answers and closes the door to the elevator and heads up to the third floor of the Bed &amp; Breakfast. Where she is greeted with Joe waiting to use the elevator, \"how convenient.\" Her assistant says. <br>\r\n<br>\r\n\"Let me guess, another experiment?\" Joe asks.<br>\r\n<br>\r\n\"Yeah and speaking of experiments, Dr. Mulligan wants to see you.\" Her assistant explains. <br>\r\n<br>\r\n\"Cool, so what is it this time, swapping heads or something?\" Joe asks.<br>\r\n<br>\r\n\"No idea.\" Her assistant answers, \"it's always a secret with Dr. Mulligan, but I'll get down there as soon as possible.\" Joe answers and uses his all access card to get down to the laboratory. While her assistant wheels the hospital bed down the hall to the Buchanan's room. As she does that, Miss. Mulligan presses the key to release the knock out gas into the Buchanan's room where she sees one by one each family member drop to the floor or slump over from where ever they were at the moment. Just as Margaret passed out, Joe had walked in the lab, \"hey Dr. Mulligan.\" Joe greets. <br>\r\n<br>\r\n\"How you doing today Joe?\" Miss. Mulligan answers. <br>\r\n<br>\r\n\"Oh you know, same old stuff.\" Joe answers as he leans up against the wall. <br>\r\n<br>\r\n\"I figured, but today I promise you'll experience something you've never experienced before.\" Miss. Mulligan tells him.<br>\r\n<br>\r\n\"You're telling me there's something else that you have made me do?\" Joe teases. <br>\r\n<br>\r\n\"Oh...there's plenty and I think you'll like this one every much.\" Miss. Mulligan explains. <br>\r\n<br>\r\n\"Can't wait.\" Joe answers. <br>\r\n<br>\r\n\"Speaking of that let's get you prepped shall we.\" Miss. Mulligan answers as she gets up off her chair and walks into her operating room. While Joe follows and gets up onto the operating table while Miss. Mulligan grabs her blade that allows her to separate body parts without harm. Carrying it over to Joe where he sees her holding it over his neck for like the 100th time. Feeling cold blade slice through his neck still gets him though. From there Miss. Mulligan picks up his head and moves it over to different operating table facing away from his body and the other operating table. <br>\r\n<br>\r\nJust as Miss. Mulligan did that, her assistant came back down with Margaret laying unconscious on the hospital bed, \"excellent, assistant.\" She says as she takes the bed from her and proceeds with the rest of the experiment while her assistant walks out of the operating room to wait.<br>\r\n<br>\r\nFrom there Miss. Mulligan uses her blade again and separates Margaret's head from her body. With her head separated, Miss. Mulligan carries her head over to Joe's 6' 5\" muscular dark body is laying and carefully lines up Margaret's head between his shoulders. With her ready to attach, she leaves her be for the time being and goes back to pick up Joe's head. Where she carries him over to Margaret's body and proceeds to attach his head to it without him knowing what she just did, \"a different body again.\" He says and sits up to get a bit of a surprise as he sees a slim pale teenage girls body below his neck which certainly clashes with his dark skin. <br>\r\n<br>\r\n\"Exactly, but I'm not done yet, so lay back down.\" Miss. Mulligan tells him and Joe does what he is told. <br>\r\n<br>\r\nFrom there Miss. Mulligan walks back over to Margaret's head and pushes her pale neck between Joe's broad shoulders making her head attach to his tall muscular well hung body. From there she retrieves her untested gun like device that separates heads from bodies giving the head the ability to levitate as well. Aiming the device at Joe she pulls the trigger which causes a faint blue glowing light to shoot at his neck where he sees a faint blue glowing ball form between his head and neck. Which also caused a weird sensation like his head is separated again, but it feels very different, \"what did you do Doc?\" Joe asks.<br>\r\n<br>\r\n\"Try moving your head.\" Miss. Mulligan answers. <br>\r\n<br>\r\nFocusing on that he suddenly feels his head move up and turn so that he is facing Dr. Mulligan, \"woah...I'm a floating head.\" Joe says.<br>\r\n<br>\r\n\"A levitating head to be exact.\" Miss. Mulligan tells him. <br>\r\n<br>\r\n\"Well...yeah, but what's with the glowing balls?\" Joe asks.<br>\r\n<br>\r\n\"They act as a link between your body and your head so you still have control over it a feel everything it does.\" Miss. Mulligan explains.<br>\r\n<br>\r\n\"Ohh.\" Joe says and makes his new body sit up and feel the area where his head was a few minutes ago to see his small pale hand pass right through the glowing ball, \"cool.\" He mumbles before he starts levitating around the room until he is beside his former body, \"what about her?\" Joe asks.<br>\r\n<br>\r\n\"She'll get her chance soon enough, but in the meantime. I need you to get to cleaning again.\" Miss. Mulligan tells him.<br>\r\n<br>\r\n\"I'll get right on that.\" He says as he levitates out of the room with his small pale body following closely behind him where he gets back me into the elevator again and heads back up to do his job. Meanwhile back in the operating room, Miss. Mulligan aims the devices at Margaret causing the same faint glowing blue beam of light to shoot out at her neck. Causing the same faint glowing ball to form between her head and new body. Unlike Joe, her head just lays on its side because she's still unconscious and once again separated.<br>\r\n<br>\r\nFrom there, \"ohh...assistant.\" Miss. Mulligan calls out and her assist comes walking in, \"yes Dr. Mulligan.\" She answers.<br>\r\n<br>\r\n\"Could you bring Margaret here back to her room please?\" Miss. Mulligan asks.<br>\r\n<br>\r\n\"Yes Dr. Mulligan.\" Her assistant answers and wheels Margaret's out of the operating room and back into the elevator. Where she brings Margaret back to her room slowly but surely. Once she arrives at the bedroom door to Margaret's room, she wheels her inside and lays her on her bed. Laying her new massive body down first followed by her head laying in the correct spot. After that her assistant quickly gets out of there as she hears the rest of Margaret's family waking up. Just in time too as Miss. Mulligan sees her assistant walking down the hall while the Buchanan's wake up. <br>\r\n<br>\r\nIncluding Margaret whos eyes flutter open to see the ceiling of her room like before, but starts to feel a little odd. Like she feels much bigger than she did before, so she decides to look down to see what the issue is. She feels her head suddenly move up off the bed and turn to look forward where she sees a tall muscular man's dark skinned body laying there, \"ahhh.\" Is all that comes out as she looks at the body, then in the mirror at her now levitating head with a faint glowing blue ball under it. Wondering if that's hers, she thinks about moving the larger muscular arms up as if they're going to grab her head and that's when she sees them do just that, \"it can't be.\" She mumbles and thinks about sitting the body up on the bed. Where she sees it once again respond quickly as it sits up on the bed, \"it is mine.\" <br>\r\n<br>\r\nFrom there we continue with....</span></div></div>",
            "created":1586504160,
            "id":2816538,
            "title":"..using a new untested device to make heads and..."
        },
        "12334441":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..let's suck each other's big cocks.\"",
                "..let's have sex obviously.\"",
                "..I need to go do something first.\"",
                "..you think of something Alex.\"",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>\"This is so crazy.\" Margaret says to herself as she thinks about what she is experiencing right now. The fact that she is a levitating head that is in control of a tall muscular dark skinned body right now just makes her levitate in place for a moment. That is until she thinks about moving her head over to the open area of the room and turns to face the bed which still gets to her, \"this is so wild, I'm a floating head.\" She says with a big smile on her face.<br>\r\n<br>\r\nAs she looks over her new body with a big smile she concentrates on sitting the body on the edge of the bed before standing it up to see just how tall her new body is. Seeing how tall her new body just makes her mouth hang open a little not even saying a word as she looks at the 6' 5\" tall muscular body wearing what looks like a janitors outfit. Still not saying anything she begins to walk her new body around the room which she almost hits her own head because she wasn't far enough up out of the way, so she levitated up towards the ceiling almost hitting the ceiling.<br>\r\n<br>\r\nAs she walks her new body around, she just looks on in amazement that this is actually happening right now and just keeps on watching her new body move around under her control. Making it do stretches, squats, flexing her big muscles and even doing girly poses which makes her giggle. After recovering from giggling she levitates back down over the bed and turns her body to face her, \"ohhhmman...I can't wait to show everybody this.\" She says as she looks at her new body.<br>\r\n<br>\r\nMargaret stares at it for a moment before she notices she keeps looking down at her new crotch which she knows that boys have dicks, \"hmmm...I wonder what I'm lacking down there.\" She says as she looks at it, \"only one way to find out I guess.\" She adds before unzipping the one piece janitor suit. Pulling the zipper all the way down from the faint glowing blue ball down to her crotch where she then pulls her big muscular arms out letting the top fall down around her waist. To reveal that her new body is wearing a tight white muscle shirt underneath, hugging her muscles nicely. After marveling at the upper bodies muscles as she levitates above the bed she then uses her big masculine hand she to push the rest of the janitors outfit down around her ankles. <br>\r\n<br>\r\nAs her body stands back up she sees that below her waist she is wearing nothing but a pair of black boxer briefs that have one impressive bulge in them, \"WOW!\" Is all Margaret says as she looks over her practically naked male body. From there she kicks the janitors outfit to the side before she grabs the waist band of her boxer briefs. Where she closes her eyes as she pushes them down her long muscular legs until they're at her ankles where she steps out of them before she tosses them aside. Next she stands her body back up straight and with her eyes closed she counts to three and opens her eyes which get very big along her mouth hanging open wide as she is in awe at the size of the huge black cock dangling between her long dark muscular legs. <br>\r\n<br>\r\nShe is in such awe of the huge cock that she doesn't say anything for a little while as she just stares at it, thinking of <i>'jeeze, that's like as thick as my little pale arms.......its long as them too.'</i> she thinks and just stares for a little while longer until she realizes that it is not even erect yet making her eyes some how get even bigger, so from there she reaches down between her legs with one hand wrapping it around her huge cock. Just that made her little levitating head moan as since she's never felt a cock like this before, but she has touched her boyfriend's much smaller penis before so she has some experience.<br>\r\n<br>\r\nAfter recovering from that she starts to slide her hand down the length of the shaft where she accidentally hits her cheek with the head of her very large cock making her giggle that she just did that and moves her head back a few inches so that won't happen again. As she focuses again she sees the large purplish pink dick head right in front of her face and just stares at it while she moves her hand back down the shaft. Making her moan and groan from doing so, but she keeps on doing it over and over while moaning until she feels what it's like to have a huge erect 14 inch cock between her legs which is pointing right at her little head. Once again her eyes go wide as she sees the fully erect cock in front of her face, \"OHMYGOD.\" Is all she can say as she looks at it while feeling it. <br>\r\n<br>\r\nWhile Margaret was just about to see what her new cock could do it seems that her boyfriend Alex showed up to the family's room where Margaret's mother Nancy let him in, \"hey Alex, fancy seeing you here.\" Nancy greets.<br>\r\n<br>\r\n\"Yeah, Margaret told me where you guys were, so I came by to visits.\" Alex answers.<br>\r\n<br>\r\n\"I told her not to, but oh well and her her room is the last one on the right.\" Nancy answers.<br>\r\n<br>\r\n\"Thanks Nancy.\" Alex says as she makes his way down the hall unknowingly about to step into something he's never seen before. He grabs the door knob, turning and pushes the door open to see what gen can only describe as a tall muscular headless dark skinned half naked man's body standing in front of Margaret's now floating head that both seem to have faint blue glowing ball attached to them, \"ahh...Margaret?\" He says while unsure of what's going on.<br>\r\n<br>\r\nMargaret immediately turned her head to look where the voice came from while her new boy instinctively tried to hide its nudity. At first she was sacred, but then saw her boyfriend Alex standing there looking very confused. Once she realized who it was, she quickly levitated right over to him and planted a kiss right on his lips, \"you actually came Alex.\" Margaret says,<br>\r\n<br>\r\n\"Yeah, but...\" Alex says as he points towards the now more relaxed half naked male body over by the bed.<br>\r\n<br>\r\n\"Oh that, apparently that's my new body and I can levitate.\" Margaret answers, \"but how?\" Alex asks.<br>\r\n<br>\r\n\"No idea, but I'm having fun.\" Margaret answers as she walks her new half naked body over to Alex with her huge erect cock bouncing around until they're face to face. Where she reaches out with a hand, \"don't be rude, shake my hand Alex.\" Margaret teases.<br>\r\n<br>\r\nAlex hesitantly shakes Margaret's large dark skinned hand, \"see, that wasn't so bad.\" Margaret teases.<br>\r\n<br>\r\n\"So it really is yours then?\" Alex asks, \"yup and I was just about to have fun, wanna join?\" Margaret asks.<br>\r\n<br>\r\n\"Ummm......just as long as that doesn't go anywhere near my ass then I'm game.\" Alex says as he's coming to grips with the fact that Margaret is a levitating head and that her body is now a tall 6' 5\" dark skinned muscular body with a huge cock. <br>\r\n<br>\r\n\"I promise silly.\" Margaret answers before kissing Alex again for longer this time which makes him instinctively try and grab her body, but feels nothing. Instead his hands passed through the faint glowing blue ball which Dr. Mulligan still had no clue what her invention would do. That's when she find out, as the same faint blue glowing ball suddenly appeared between Alex's head and body causing his head and body to separate. It wasn't until they stopped kissing that Margaret noticed, \"ahh...Alex.\" <br>\r\n<br>\r\n\"What?\" He answers.<br>\r\n<br>\r\n\"I think you can levitate now too.\" Margaret says.<br>\r\n<br>\r\nWhich causes his body to suddenly go right, but his head stayed in place which made him wonder what just happened, so he turns his head to look and sees his body with the same faint blue glowing ball where his head was just like Margaret's new body, \"I guess I can, but how?\" <br>\r\n<br>\r\nMargaret thinks before saying, \"maybe it has to do with these glowing balls.\"<br>\r\n<br>\r\n\"Maybe I touched the one under your head and it made me like this.\" Alex tells her. <br>\r\n<br>\r\n\"Maybe and I'm horny.\" Margaret says making Alex turn his head to look back at her, \"me too.\" He answers as she takes off all his clothes until he's naked. <br>\r\n<br>\r\nFrom there Alex levitates over to Margaret's levitating head and begin passionately kissing each other while their bodies walk up to each other. Where Alex's body grabs Margaret's huge cock while Margaret's body grabs Alex's much smaller cock, where they begin to jerk each other off while there heads continue kiss. As they kiss their bodies get a little handsy with their fee hands. Alex's hand feeling up Margaret's muscular slightly hairy ass while Margaret's hand feels up Alex's smooth ass until Alex's hand his under her tight muscle shirt, which he helps take off revealing her muscular upper body. In that action of taking off her muscle shirt, his hand passed through the faint blue glowing ball on top of her body. Which had a major effect on his body. Mainly because his body is now an exact copy of Margaret's tall 6' 5\" dark skinned muscular well hung body. <br>\r\n<br>\r\nTheir bodies kept on feeling each other up for a little while longer until Alex Margaret turns their heads to get a surprise, \"your body, it turned into mine.\" Margaret quickly says.<br>\r\n<br>\r\n\"Well....at least we don't have to worry about your cock going near my ass now.\" Alex says making light of the situation. <br>\r\n<br>\r\n\"That's true.\" Margaret answers.<br>\r\n<br>\r\n\"Yeah, so what do we first?\" Alex asks.<br>\r\n<br>\r\n\"Hmmm....</span></div></div>",
            "created":1586673660,
            "id":2817513,
            "title":"..Margaret getting use to her new form."
        },
        "1234":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "The Turner Family",
                "The Johnson Family",
                "Both",
                "Your Choice"
            ],
            "content":"<div class=\"\"><div> <span>The family in question is the Turner Family which peaked Dr. Mulligan's interest in all the possibilities that he could try on them.<br>\r\n<br>\r\n<u>The Turner Family</u><br>\r\nBen Turner 42 - 5ft 11in with short blonde hair and brown eyes.<br>\r\nMelissa Turner 40 - 5ft 9in with long black eye and blue eyes with large C-cup breasts and nice ass.<br>\r\nPeter Turner 15 - 5ft 10in with short brown hair and brown eyes<br>\r\nJoan Turner 15 - 5ft 7in with long brown hair and gray eyes with small C-cup breasts.<br>\r\n<br>\r\nLike the last few times, she saw another family that she could experiment. Unlike the their families this particular one brought their two dogs along with them, \"hmmm...I never combined animals with humans before.\" She mumbles to himself as she thinks of those possibilities.<br>\r\n<br>\r\n<u>The Johnson Family</u><br>\r\nJoe Johnson 38 - 6ft 3in with short black hair and brown eyes.<br>\r\nMary Johnson 36 - 5ft 7in with long reddish brown hair and brown eyes.<br>\r\nDavid Johnson 14 - 5ft 8in with short brown hair and brown eyes<br>\r\nEmily Johnson 13 - 5ft 5in with long dark brown hair and hazel eyes.<br>\r\nRocco - a big black and white Pit Bull.<br>\r\nJack - a big black and brown German Shepard.<br>\r\n<br>\r\n\"So many choices!\" the doctor said with a evil grin. \"Now which of them should I pick?\" She said pondering.</span></div></div>",
            "created":1548392400,
            "id":2607491,
            "title":"Other Families "
        },
        "12342":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..do a body part swap.\"",
                "..do a head swap.\"",
                "..change their roles in their family.\"",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmmm...this Johnson Family has pets, something I've never gotten to experiment with yet.\" Miss. Mulligan said to herself as she watches the two dogs nibble in their treats while the family moves about settling in their rooms. <br>\r\n<br>\r\nThen, \"are you sure that's a good idea Doc.\" Mulligan's assistant asks her causing Miss. Mulligan to turn her chair around to face her, \"are you questioning my abilities?\" She asks her assistant. <br>\r\n<br>\r\n\"No, of course not.\" She frantically says while thinking about what happened the last time she questioned her. A time she remembers well, when Miss. Mulligan transplanted her head onto a young teenage boy's chubby body and changed her role to be the wife of a tall muscular hairy man that was very sexually active. <br>\r\n<br>\r\n\"You know what happened last time.\" Miss. Mulligan reminds her, \"I know, please don't. I beg you.\" Her assistant pleads. <br>\r\n<br>\r\n\"I won't, besides I went a little to far the first time.\" Miss. Mulligan adds. <br>\r\n<br>\r\n\"Thank you, but what is your plan?\" Her assistant asks. <br>\r\n<br>\r\n\"Well....I want to....</span></div></div>",
            "created":1553662800,
            "id":2635471,
            "title":"The Johnson Family"
        },
        "123422":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Mary and Joe",
                "Emily and Rocco ",
                "David and Jack"
            ],
            "content":"<div class=\"\"><div> <span>..do a head swap.\" Miss. Mulligan answers.<br>\r\n<br>\r\n\"Okay, so who do you want to go get for you?\" Her assistant asks. <br>\r\n<br>\r\n\"Well....I want to spice up things a little in their relationships. Like Joe and Mary along with Emily and David.\" Miss. Mulligan tells her, \"would you also like me to fetch Rocco and Jack for you as well.\" Her assistant asks. <br>\r\n<br>\r\n\"Exactly.\" Miss. Mulligan answers as she turns back around to watch her monitors. <br>\r\n<br>\r\nMeanwhile her assistant grabs the necessary things to get her doctors subjects which is just a wheel chair since Miss. Mulligan had pumped a sedative into the Johnson family's room knocking them all unconscious. Her assistant uses the elevator to get up to the main floor where she makes her way down to the room and getting herself in where she finds her first two subjects passed out on the floor. Being light she picks up Rocco and Jack, carefully placing on the wheelchair where she brings the down to the lab. Next she goes back up a few more times to get Joe, Mary, Emily and David until they are all on Miss. Mulligans operating tables. <br>\r\n<br>\r\nAfter that Miss. Mulligan and her assistant prepares them by stripping off all their clothes. Neatly folding them off on a vacant to table. Next Miss. Mulligan begins her experiment by using her highly advanced laser cutting tool, cutting through the bases of all her subjects necks. Causing each of their heads to detach from their bodies resulting in no blood because the laser caused skin to grow where it cuts, \"excellent.\" Miss. Mulligan mumbles to herself as she begins her next part. <br>\r\n<br>\r\nShe picks up Emily's cute sleeping head and carries her over to the Rocco's headless body. Where she presses the base of her neck against Rocco's body resulting in them attaching to one another. Then she attaches Rocco's head to David's body. After doing she picks up Mary's head and places it on the shoulders of Joe's body resulting in them attaching. Next she picks up Joe's head and attaches it to Jack's body resulting him being attached to his German Shepard's body. Once she did that she looked at David's head along with Jack's head and decided to attach David to Mary's body while Jack gets attached to Emily's body. <br>\r\n<br>\r\nAfter doing all that Miss Mulligan ran a few test to find everything went through without a problem and smiled at her latest creations, but she is not done just yet. She grabs yet another one of her advanced tools which is programmer sort of device that. How it works is Miss. Mulligan sets a role on the screen and then a needle pierces the skin and injects the subjects with a strange liquid. Resulting in who ever the person is gaining a new role in the family. <br>\r\n<br>\r\nFirst she uses it on Rocco thus changing his role to boyfriend. Then she moved onto Emily changing her role to girlfriend resulting in Rocco and Emily now being boyfriend and girlfriend. Next she went over to David and Jack changing their roles to girlfriend and girlfriend resulting in them being a lesbian couple. Finally she changes Mary's role to husband and Joe's role to wife. <br>\r\n<br>\r\nAfter all that, Miss. Mulligan steps back and smiles at her latest experiment. Knowing that this could possibly be her best yet, \"okay assistant, bring the back to their rooms and leave their clothes here. They won't be needing them any time soon.\" <br>\r\n<br>\r\n\"Yes ma'am.\" Her assistant answers as she quickly brings each subject back to their rooms. Laying Mary's tall pudgy hairy naked body on their bed with Joe's now furry canine body beside her. Then she sits Rocco on the sofa in the living room along Emily's white furry canine body laying beside him. Next she lays David with his mom's curvy naked body on his bed along Jack on Emily's body.<br>\r\n<br>\r\nAfter doing that she quickly makes her way back just as they begin to wake up, but who do we focus on now.</span></div></div>",
            "created":1553662800,
            "id":2635478,
            "title":"..do a head swap.\""
        },
        "123424":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..making the family share bodies.",
                "..using her newly built teleporter device.",
                "..injecting a new morph serum into them.  ",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something a little more experimental, like....</span></div></span></div>",
            "created":1585720620,
            "id":2811371,
            "title":"Other choices"
        },
        "1234243":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..David's body begins to move on its own.",
                "..Joe's body begins to move on its own.",
                "..Dr. Mulligan comes up with an idea.",
                "..her assistant comes up with an idea.",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>\"I think it's time to test this new serum I created.\" Miss. Mulligan says to herself as she picks one of the syringes filled with the green glowing liquid.<br>\r\n<br>\r\n\"Who shall I fetch Dr. Mulligan?\" Her assistant asks.<br>\r\n<br>\r\n\"Bring me the whole Johnson family.\" Miss. Mulligan answers with a devilish grin on her face.<br>\r\n<br>\r\n\"Shall I bring the dogs as well?\" Her assistant asks.<br>\r\n<br>\r\n\"Leave them be, I have something in store for them later on.\" Miss. Mulligan answers.<br>\r\n<br>\r\n\"I'll be on my way Dr. Mulligan.\" Her assistant answers and wheels two hospital beds that are wide enough for two people to lay on them. She wheels them onto the elevator and begins to make her way up to the Johnson Family's room which is 116. While she is doing that, Miss. Mulligan takes a seat at her big multi screen display of each room in her Bed &amp; Breakfast. Where she watches the Johnson family get settled in, in the living room together, \"how convenient.\" She says to herself as presses the button to release the knock out gas to make things easier for her assistant.<br>\r\n<br>\r\nWho is wheeling the two hospital beds down the hall to room 116 and uses her all access card to get into the room where she wheels the beds inside. Closes the door and begins to load the unconscious members of the Johnson family, who she found to be all together in the living room. One by in she lifted them up onto they beds until Joe and David are on one while Mary and Emily are on the other bed. From there she wheels them out of their room, down the hall and into the elevator. Where she uses her all access card to get all the way down to Dr. Mulligan's laboratory. <br>\r\n<br>\r\nWhere she had prepped the operating room for her four test subjects to which she laid out four syringes filled with the morphing serum in them. Along with four cleared operating table for each of her test subjects whom of which her assistant wheeled into the room just as she finished up her prep, \"excellent.\" Dr. Mulligan says as she looks over her new test subjects, ready to test her new serum out on them. Before she begins she strips them of their clothing and moves them onto the separate operating tables.<br>\r\n<br>\r\n\"Now if you don't mind, I may need your help.\" Miss. Mulligan tells her assistant.<br>\r\n<br>\r\n\"Anything Dr. Mulligan.\" She answers.<br>\r\n<br>\r\n\"Good, so what I'm going to do is inject this into you and your going to help me morph them.\" Dr. Mulligan tells her.<br>\r\n<br>\r\n\"Is that safe?\" Her assistant asks. <br>\r\n<br>\r\n\"Of course it is, I wouldn't ask you if it wasn't.\" Dr. Mulligan answers as she picks up a fifth syringe and walks over to her assistant who looks a little worried at the moment, \"don't worry.\" Dr. Mulligan tells her.<br>\r\n<br>\r\n\"I'll try.\" She answers and winces in pain as she feels the rather large needle slide into her arm and feels the cold liquid flow into her veins. Making her shiver a little, even after Dr. Mulligan had pulled it out of her arm, \"give it a minute while I inject them as well.\" Dr. Mulligan tells her assistant who just continues to shiver as she feels the liquid taking its effect on her body. <br>\r\n<br>\r\nWhich last until Dr. Mulligan had injected the last syringe into Emily's body, when she finally stopped shivering and felt a little different than before, \"are you feeling any different?\" Dr. Mulligan asks.<br>\r\n<br>\r\n\"Yes, but nothing is happening.\" Her assistant answers, \"just concentrate on something on your own body and morph it into something else.\" Dr. Mulligan explains.<br>\r\n<br>\r\nHolding up her right hand, her assistant concentrates on it and thinks of morphing it into a copy of her right foot. Almost instantly her right hand changes shape, into that of her own right foot. Which made her eyes go wide as she looks at her right foot with a much different perspective. Wiggling her toes and turn green her foot around to look at it closely while Dr. Mulligan smiles at the fact that it worked just like she had intended it to, \"excellent.\" She says.<br>\r\n<br>\r\nCausing her assistant to look up, \"ohh sorry Dr. Mulligan.\" <br>\r\n<br>\r\n\"I understand, but let's get started shall we.\" She says as her assistant changes her foot back into her hand, \"good, now what I'm going to need you to do is morph each of their heads off their bodies.\" Dr. Mulligan tells her.<br>\r\n<br>\r\n\"Okay.\" She answers as she walks over to the other side of the Johnson family and looks down at their heads where she concentrates greatly. Focusing on morphing their heads separate and their necks away completely from their bodies. Just like that Dr. Mulligan sees each head separate from their body which brings a big smile to her face, \"good job assistant, but could now morph Joe's and David's dicks so that they can stretch out enough to fit a head in.\" Dr. Mulligan tells her.<br>\r\n<br>\r\nHer assistant just looks at her for a second before she concentrates on their dicks to morph them so that a head can fit in them. Which didn't bring any physical change in shape or size. However they are fully erect, but they're not sure if it had worked or now, \"did it work?\" Her assistant asked. <br>\r\n<br>\r\n\"Only one way to find out.\" Dr. Mulligan answers as she picked up Mary's head and gave it to her assistant who decided to try it in David's body first. She walked over to the side of David's operating table and held Mary's unconscious neckless head over David's erect 5 inch dick. Slowly she lower Mary's head down further and further until it is pressing against his dick hole. At first nothing happened, but then Dr. Mulligan and her assistant both saw his dick hole begin to stretch out more and more as her assistant pushed Mary's head down further. Thats when they saw his dick hole swallow a quarter of Mary's head, so her assistant continues to push Mary's head down, making David's dick swallow more and more of Mary's head until all that was left was her reddish brown hair was sticking out of the end of his dick. <br>\r\n<br>\r\nBoth Dr. Mulligan and her assistant looked at each other in amazement before her assistant picked up Joe's neckless head. Where she did the same thing with his head, pushing it down into David's dick. Making it swallow his head entirely until both of their heads are deep inside David's young body, \"that....that is so cool.\" Her assistant tells Dr. Mulligan.<br>\r\n<br>\r\n\"Its better than cool, but I'm going to try now.\" She says and picks up Emily's neckless head and held it over Joe's erecting 9 inch dick. Like before it took a minute before they saw Joe's dick hole stretch out swallowing a quarter of Emily's head. Which Dr. Mulligan then began to push Emily's head further and further into his dick until all that was left was her long dark brown hair sticking out of the end of his dick, \"oh boy that's fun.\" Dr. Mulligan coos.<br>\r\n<br>\r\n\"I know right, but it's David's turn now.\" She says and tosses Dr. Mulligan his neckless head. Which she catches and does the same thing with David's head as she did with Emily's head. Pushing it down into Joe's dick, seeing it swallow it right up until both Emily's and David's heads are deep inside Joe's older body. With the Johnson Family's heads in the dicks of Joe's and David's bodies, her assistant asks, \"is there anything else you need my help with?\" <br>\r\n<br>\r\n\"Yes there is assistant.\" Dr. Mulligan answers before adding, \"I need you to morph the assholes on Joe's and David's body to stretch out enough for a body to fit into.\" <br>\r\n<br>\r\n\"I'll try.\" Her assistant answers and focuses on Joe's and David's assholes. Morphing them so that an adult sized body can fit in each without any issues whatsoever. At first nothing really happened from what they could until Dr. Mulligan had rolled Joe's body over and looked between his hairy ass to see a rather large dark brown asshole, \"check David's body.\" She tells her assistant who rolls David's body over where she sees a rather large bright pink asshole between his smooth pale ass. <br>\r\n<br>\r\n\"Looks like it worked, but we need to test it.\" Dr. Mulligan tells her assistant as she walks over to Mary's athletic big breasted body, \"help me carry this over to David's body and go feet first.\" She tells her assistant who quickly jumps into action to help her boss. From there they carry Mary's surprisingly light body over to David's small smooth ass where they press Mary's feet against his asshole which immediately starts to suck in her body. Slowly without any help David's body sucks in Mary's body, sucking in her long toned legs before stopping at her waist where it then sucks in more of her body until it stops at her breasts. From there it sucks in the rest of her body until the hands are sticking out, only for a few seconds though as David's body completely sucks in Mary's body. Leaving no evidence that her adult sized body is in his little body, <br>\r\n<br>\r\nAfter seeing the results of what David's body did, they quickly pick up Emily's small body and press it feet first against Joe's dark hairy asshole. Where it sucks in her little feet immediately where it then sucks in up until her little waist. Where it stops for a moment before sucking in the rest of her body until it's completely inside his dark hairy asshole. After that Dr. Mulligan and her assistant turn to look at each other and hug each other, \"you did excellent today assistant.\" Dr. Mulligan tells her.<br>\r\n<br>\r\n\"Thank you so much Dr. Mulligan.\" Her assistant says as she hugs her boss tightly. <br>\r\n<br>\r\n\"You're welcome and you did so well in fact that I'm going to let you keep that morphing ability.\" Dr. Mulligan tells her. <br>\r\n<br>\r\n\"Oh thank you, I thank you so much Dr. Mulligan.\" Her assistant says. <br>\r\n<br>\r\n\"You are very welcome.\" Dr. Mulligan says as she hugs her assistant tightly. <br>\r\n<br>\r\nAfter their long hug they let go of each other look at Joe's and David's naked bodies, \"so Dr. Mulligan, what do we do with them now?\" <br>\r\n<br>\r\n\"Hmmmm....good question.\" Dr. Mulligan answers as they both think of some ideas, so in the meantime they wheel both into separate test rooms. From there they look into the test rooms where....</span></div></div>",
            "created":1585725540,
            "id":2811397,
            "title":"..injecting a new morph serum into them.  "
        },
        "12342434":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..our own heads in the experiment.",
                "..their dogs heads in the experiment.",
                "..somebody else from another family in the experiment.",
                "..somebody that is famous in the experiment.",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hey Dr. Mulligan.\" Her assistant speaks up.<br>\r\n<br>\r\n\"Yes assistant.\" Dr. Mulligan answers. <br>\r\n<br>\r\n\"I was wondering if I....ummmm....could....use....</span></div></span></div>",
            "created":1585726080,
            "id":2811404,
            "title":"..her assistant comes up with an idea."
        },
        "123424341":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Dr. Mulligan playing with Joe's body.",
                "Her assistant playing with David's body.",
                "Her assistant doing something with their former bodies.",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>\"Ohhh...like copies of our heads?\" Dr. Mulligan asks as she looks over Joe's and David's bodies.<br>\r\n<br>\r\n\"Ahhh....if you're okay with it, I was wondering if we could use are actual heads instead of copies.\" Her assistant explains.<br>\r\n<br>\r\nDr. Mulligan turns to look at her assistant with an intrigued look on her face as she thinks about her assistants idea, \"it's okay if you don't, I ca....\" her assistant starts to say, but gets interrupted by Dr. Mulligan saying, \"lets do it assistant, but which body would you like to use?\" <br>\r\n<br>\r\n\"Ohhh...ummm...I kind of want use David's body if you don't mind.\" Her assistant answers with a little worry in her voice.<br>\r\n<br>\r\n\"Don't worry assistant, I would love to use Joe's hairy body. Beside I love guys with some hair on them.\" Dr. Mulligan answers.<br>\r\n<br>\r\n\"Thank you Dr. Mulligan.\" Her assistant thanks her, \"no problem, so shall we get started?\" Dr. Mulligan asks.<br>\r\n<br>\r\n\"Lets do it.\" Her assistant says as begins to focus on Dr. Mulligan's head and neck. Morphing it separated from her body and onto Joe's naked headless body. Focusing hard on that, she starts to see her head disappearing until it's out of sight as her body stumbles backwards and falling onto her chair. With no head to control it anymore because Dr. Mulligan's head is now appearing inside the test room where Joe's naked body is. Slowly appearing until her assistant sees her doctors head back in reality as her head is firmly attached to Joe's body.<br>\r\n<br>\r\nNow Dr. Mulligan looks down to see Joe's naked hairy body below her neck where she suddenly gets the rush of feeling a new body under her head. As she begins to move her manly hairy arms, wiggle her masculine fingers and soon enough Dr. Mulligan sits up on the bed Joe's body was laid on where a big smiles comes across her face as she looks at the rest of Joe's hairy body. Especially his still erect 9 inch dick and most surprising of all, she doesn't even feel the two heads in his body along with Emily's small body in his hairy ass, \"oh god yes.\" Dr. Mulligan moans before she looks towards where her assistant still is and smiles as she mouths, \"thank you.\" Even though she can't see her in there.<br>\r\n<br>\r\n\"Your welcome.\" Her assistant answers even though they can't hear each other.<br>\r\n<br>\r\nFrom there, her assistant focuses on her own head and neck, morphing it separated from her body and onto David's young body. Slowly she feels her sight fading, her hearing going away along with her sense of smell going away until it was just nothing for a few minutes until the darkness started to fade as her sight starts to come back. Slowly starting to see the ceiling of the test from, hearing the air conditioner and most of all feeling the rush of gaining the feeling of David's young body. Feeling everything from his little body to his still erect 5 inch dick she begins to wiggle her fingers and toes until she is sitting up on the bed David's body was laid on. Smiling from ear to ear at the sight of having David's young body below her neck. <br>\r\n<br>\r\nMeanwhile in the observation room the assistants body had stumbled backwards until it slumped up against the wall with no head to control it anymore. From there who do we focus on now, Dr. Mulligan with Joe's body or her assistant with Davidson body or maybe she does something with her and Dr. Mulligans bodies. <br>\r\n<br>\r\nWhich one will it be?</span></div></div>",
            "created":1585774080,
            "id":2811701,
            "title":"..our own heads in the experiment."
        },
        "12343":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "A Body Part Swap ",
                "A Head Swap",
                "A Family Role Swap",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Looking between the two monitors displaying the Turner and the Johnson families Miss. Mulligan can't decide which family to experiment with, \"hmmm....so many good ideas, but I can't decide.\" She mumbles to herself as she continues watching on with her assistant patiently waiting for instructions. <br>\r\n<br>\r\nAfter a few more minutes Miss. Mulligan eventually decides why try to choose just in family when she can choose subjects from both families and do some of her experiments, \"yeah, that's it!\" She says with enthusiasm as she spins her chair around to face her assistant, \"what is Dr. Mulligan.\" Her assistant speaks up.<br>\r\n<br>\r\nWith a big smile on her face Miss. Mulligan answers by saying, \"fetch me.....and.....\"<br>\r\n<br>\r\nBut for what type of experiment?</span></div></div>",
            "created":1578978000,
            "id":2773543,
            "title":"Both"
        },
        "123431":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "..I'm going to have sex with you.\"",
                "..you're going have sex with me.\"",
                "..we're going to have a little fun.\" ",
                "Other",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>\"Peter Turner and David Johnson for me, please.\" Miss. Mulligan tells her assistant. <br>\r\n<br>\r\n\"Yes Doctor.\" She answers and begins to make her way up to the Turner's and Johnson's rooms by the elevator. <br>\r\n<br>\r\nAs her assistant makes her way to the correct rooms, Miss. Mulligan turns back to her monitors where she makes sure that everybody is in the rooms before she fills the rooms with her perfected knock out gas. Wheeling over to her main computer, she begins initiating the process of filling the correct rooms with the knock out gas so her assistant can easily get in and out without being caught. <br>\r\n<br>\r\nAfter selecting the correct rooms, she presses the enter key where she sees one by one each pass out right where they were. Specifically Peter who falls on to his bed in the room he is sharing with Joan. Followed by David who falls on to the sofa in front of the living room TV. Seeing that everybody is now passed out, Miss. Mulligan presses the enter key again, this time unlocking the doors to each of the families rooms. <br>\r\n<br>\r\nAfter doing that she reclines back in her chair and watches her assistant make her way to the door of Turner family and walks inside. Where she flawlessly makes her way to the kids shared bedroom and picks up Peter, carrying out his limp body out of the room and into the hall way where she carries him to the elevator. Propping him up inside on the floor against the elevator car wall before making her way down the Johnson's room where she walks in with ease. Finding David almost immediately sitting down on the sofa passed out. Being quick, she picks him up like she did to Peter and carries him out of the room and down to the elevator where she props him up beside Peter.<br>\r\n<br>\r\nFrom there Miss. Mulligan watches her assistant step in and close the door where she does the usual sequence of button pressing to get down to Miss. Mulligan's secret lab. With a brief moment of waiting Miss. Mulligan hears a ding followed by footsteps as her assistant carries David over to one operating table. Laying him out where she then walks back to do the same with Peter until Miss. Mulligan's latest victims are both laying in the operating tables that have seen so many others, \"great job assistant, but now if you don't mind.\" Miss. Mulligan says.<br>\r\n<br>\r\n\"Yes Doctor.\" Her assistant answers and walks out of the operating room to wait out of sight.<br>\r\n<br>\r\nFrom there Miss. Mulligan starts by stripping the unconscious boys of their clothes until they're both naked as to not wanting to ruin their clothes. Next she puts velcro straps around the ankles and wrist of both to help keep them in place as she begins her experiment. An experiment she's done plenty of times and made easier by the invention of her magical blade which can separate body parts with ease. <br>\r\n<br>\r\nGrabbing the blade, she begins by cutting each boy in half just above the waist. Causing their halfs to separate horizontally and helps spread them apart so they won't connect back together accidentally. After doing that she then cuts both boys heads off at the bases of their necks causing them to separate from their torsos. After seeing the results of her blade, she sets it aside as she then moves the boys unconscious heads aside. Where she then releases the boy's wrists from the velcro straps and turns their torsos upside down. <br>\r\n<br>\r\nOnce she did that to each of the boys torsos, she then grabs Peter's head and attaches it to David's torso right where his lower half was attached to earlier. Smiling to herself at the results, she then picks up David's head and attaches it to Peter's torso right where his lower half was attached to earlier. Once she did that, Miss. Mulligan also changed a few things by injecting them with her perfected serum to make others and themselves to think everything is normal. <br>\r\n<br>\r\nAfter doing that she has her assistant come back in who marvels at what she did to her latest victims, \"interesting.\" Is all her assistant says. <br>\r\n<br>\r\n\"Is that all?\" Miss. Mulligan asks. <br>\r\n<br>\r\n\"I didn't mean it like that, I swear.\" Her assistant worriedly says.<br>\r\n<br>\r\n\"Oh don't worry, you'll get a surprise when you get back from taking them to their rooms.\" Miss. Mulligan tells her.<br>\r\n<br>\r\n\"Will do Doctor.\" Her assistant says and picks up both boys and carries them to the elevator where she quickly brings Peter to his families room. Then David to his families room before she heads back down to Miss. Mulligan's lab where she sees her waiting in the operating room with the boys still naked lower halfs, \"what are those for?\" She asks.<br>\r\n<br>\r\n\"These.....well.....are for you and I.\" Miss. Mulligan answers which surprises her assistant.<br>\r\n<br>\r\n\"Wait...what?\" Her assistant speaks up.<br>\r\n<br>\r\n\"You've been such a good assistant for me, I decided that you and I could have some fun together.\" Miss. Mulligan answers.<br>\r\n<br>\r\n\"How?\" She asks. <br>\r\n<br>\r\n\"Well....\" Miss. Mulligan begins to say as she takes off her lab coat along with every piece of clothing until she is naked. Taking this as a hint, her assistant quickly disrobes as well until she is naked in front of her boss, \"good, now get up on the table next to David's legs.\" Miss. Mulligan tells her.<br>\r\n<br>\r\nShe does just that where she is then promptly cut in half causing her upper body to separate from her lower half. From there she sees Miss. Mulligan get up beside Peter's legs and cuts herself in half as well and then attaches her upper body to his waist. Resulting in her having Peter's 15 year old male lower half as her own. Seeing that makes her think that she is going to do that to, so she lines her upper body up with David's and is about to attach when, \"hold on.\" Miss. Mulligan tells her as she gets off the table and walks up beside her assistant. <br>\r\n<br>\r\n\"Just lay back and I'll help you.\" She tells her assistant who does exactly that. <br>\r\n<br>\r\nFrom there Miss. Mulligan releases David's ankles before turning his lower half over so that his smooth ass is showing instead of his flaccid dick. Then she pushes his lower half up against her assistant's waist causing them to attach, this time backwards. Looking down at herself, her assistant sees what Miss. Mulligan did to her. Instead of seeing a dick between her legs, she sees the smooth ass of David right below her waist, \"did you just?\" She says as she looks at Miss. Mulligan who now is sporting an erect 6 inch dick.<br>\r\n<br>\r\n\"I did and I did it because of how excellent of a assistant you are.\" Miss. Mulligan explains. <br>\r\n<br>\r\n\"Thanks Doctor, but what are we doing?\" Her assistant asks.<br>\r\n<br>\r\n\"Well....\"</span></div></div>",
            "created":1578978000,
            "id":2773723,
            "title":"A Body Part Swap "
        }
    },
    "info":{
        "author_id":"demonchicken69",
        "author_name":"DEMONCHICKEN69",
        "brief_description":"Doctor Mulligan is conducting experiments on people.....but what will he or she change?",
        "created":1548373980,
        "description":"<td align=\"left\" class=\"norm\">Doctor Mulligan is taking people from his renowned bed and breakfast to conduct experiments on them. <br>\r\n<br>\r\n<u>The Doctor:</u><br>\r\nDR. Mulligan is in his or her late 40s.<br>\r\nMr. Mulligan - 6ft tall with blue eyes and dark brown graying hair.<br>\r\nOr<br>\r\nMiss. Mulligan - 5ft 8in with green colored eyes and long reddish graying hair.<br>\r\n<br>\r\n<u>The Patrons:</u><br>\r\nThe Lewis family:<br>\r\nJohn Lewis 45 - 6ft tall lightly tanned pudgy hairy body and with blonde hair with brown eyes.<br>\r\nMartha Lewis 44 - 5ft 9in tall red hair with large DD cup breasts and blue eyes and with a great motherly curvy shape.<br>\r\nJenny Lewis 16 - 5ft 10in tall with light red hair and large C cup breasts and brown eyes.<br>\r\nMichael Lewis 15 - 6ft tall athletic with dark brown hair and blue eyes.<br>\r\nSmith Lewis 9 - 4ft 4in tall with dirty blonde hair and freckles and blue eyes. <br>\r\nLauren Lewis 7 - 3ft 5in tall with brown hair and green eyes.<br>\r\nJames Lewis 5 - 3ft tall with blonde hair and brown eyes.<br>\r\n<br>\r\n<u>The Munro family:</u><br>\r\nBrian Munro 52 - 6ft 1in tall with brown, but graying hair and blue eyes. Mostly muscular.<br>\r\nMichelle Munro 43 - 5ft 8in tall with dirty blonde hair and large D cup breasts and blue eyes and very tan.<br>\r\nKevin Munro 12 - 5ft 8in tall with dirty blood hair and gray eyes and somewhat tan.<br>\r\nJean Munro 11 - 5ft tall with brown hair and brown eyes, somewhat tan and A cup breasts.<br>\r\n<br>\r\nAdd any characters if you want to.<br>\r\nAlmost anything is fine, basically <br>\r\nif you read my stories then you'll <br>\r\nknow what is allowed.<br>\r\n<br>\r\nNote - Also have good grammar and have fun.</td>",
        "id":2180757,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1599813420,
        "modified":1599813420,
        "pretty_title":"Doctor Mulligan's Experiments"
    }
}