{
    "chapters":{
        "1":{
            "author_id":"bigrich1",
            "author_name":"Bigrich",
            "choices":[
                "American food",
                "Chinese food",
                "Mexican food",
                "Italian food",
                "Thai food"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look at your watch and see that its 12:30pm. You are studying for finals right now and decide to go get lunch. You put your books away and drive over to a nearby restaurant. Today you decided on eating,</span></div></span></div>",
            "created":1271383860,
            "id":868724,
            "title":"Where will you eat at?"
        },
        "11":{
            "choices":[
                "Angie reaching for the fry",
                "Angie's boot",
                "Another waitress reaching for the fry",
                "A 7-year-old Mexican girl reaching for the fry",
                "A 38-year-old blond mom reaching for the fry"
            ],
            "content":"<div class=\"\"><div> <span>This restaurant looks to be a burger joint, and you're looking for something that's filling so you won't be hungry while studying. This place seems to be just the spot. You put your car into the nearest spot, check your wallet to see you have enough money to pay, and then hurry into the restaurant. You get a table and eye the menu with hunger.<br>\r\n<br>\r\nA minute after you sit down, a lady comes over to take your order. She is African American, has long black hair, and looks around 30, maybe 35. She is wearing a yellow apron, and black knee-high boots.<br>\r\n\"Hi. My name is Angie, what'll you have?\"<br>\r\nYou tell her you'll have a cheeseburger and fries, and she goes back to get you a glass of water. As soon as you drink it, however, you feel very funny. Suddenly, you get very dizzy, and you slump out of your chair unconscious.<br>\r\n<br>\r\nA few minutes later, you wake up and see that everything seems out of proportion. Suddenly a gigantic fry lands next to you on the floor. It looks like a canoe to you! You look around and it dawns on you that you are 1/2 an inch tall. What will you do now?<br>\r\n<br>\r\nSuddenly, a giant object coming towards you frightens you. It is...</span></div></div>",
            "created":1271981760,
            "id":871899,
            "title":"American food"
        },
        "111":{
            "choices":[
                "\"I must be dreaming.\" And proceeds to throw you into the trash.",
                "\"Do you need help?\"",
                "\"You're mine, now.\""
            ],
            "content":"<div class=\"\"><div> <span>It's Angie's giant hand and it looks like it is moving towards  the fry. It looks like Angie is going to clean up her mess. You think to yourself that this could be the perfect time to get Angie's attention. You quickly jump on the fry, seconds before Angie picks it up.<br>\r\n<br>\r\nAs Angie moves towards the trash can, she spots something peculiar about the fry.<br>\r\n<br>\r\n\"Huh? What is this? Some type of small action figure?\"<br>\r\n<br>\r\nNow's your chance. You quickly speak out, \"Um, no. Actually it's me...the person who just ordered the food.\" You look at her face. \"I'm just as confused as you are. Heh.\"<br>\r\n<br>\r\nAfter a couple of seconds of awkward silence, Angie finally speaks.</span></div></div>",
            "created":1277674620,
            "id":907506,
            "title":"Angie reaching for the fry"
        },
        "112":{
            "choices":[
                "Climb her",
                "Stay where you are"
            ],
            "content":"<div class=\"\"><div> <span>A couple yards (from you're perspective, that is) away, Angies giant boot stomped right next to you. You looked above in awe to see a giant Angie carrying a lunch tray. Not thinking about anything else, you jump onto her boot as she walks to a booth. You assume its her lunch hour. When she took a seat, you climbed up her boot in a quick fashion. When you got to the top of her boot you could walk along her thigh. You then got onto her lap and looked up to see her eating a hamburger. Would you climb the rest of her, or stay on her lap</span></div></div>",
            "created":1289773080,
            "id":993577,
            "title":"Angie's boot"
        },
        "114":{
            "choices":[
                "you near the mouth",
                "you near the grabage",
                "your pulled away from the fry"
            ],
            "content":"<div class=\"\"><div> <span>You move closer to the gigantic fry and couldnt believe how large it was compared to you. You were in awe, but suddenly, you see a shadow surrounding you, you look back and see a hand coming at you. Or so you thought.<br>\r\n<br>\r\nThe hand belonged to a 7 year old girl  and she was really just reaching for the fry, but to your bad luck, it was a cheese fry and you ended up stuck to it as the mexican girl picked it up.<br>\r\n<br>\r\nYou watch in horror as....</span></div></div>",
            "created":1300072920,
            "id":1069972,
            "title":"A 7-year-old Mexican girl reaching for the fry"
        },
        "115":{
            "choices":[
                "Jump down her cleavage and she felt you",
                "Jump down into her cleavage she didn't feel you ",
                "Jump into her purse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The mom picks up the fry unaware of the fact that you are on it sshe lifts ythe fry upto her awaiting maaww and you decided to...<br>\r\n</span></div></span></div>",
            "created":1559166900,
            "id":2666208,
            "title":"A 38-year-old blond mom reaching for the fry"
        },
        "12":{
            "author_id":"bigrich1",
            "author_name":"Bigrich",
            "choices":[
                "Lyn comes back, wondering where you went",
                "Lyn comes back, smiling down at you",
                "Something different"
            ],
            "content":"<div class=\"\"><div> <span>You walk inside of a very traditional looking chinese restaurant. Its strangely dead but you figure thats a good thing since you only have about an hour. You sit at a table and the chinese waitress comes over with a menu and water. She looks about 35-40 ish with black hair in a ponytail and a nice figure overall.<br>\r\n<br>\r\n\"Hello. My name is Lyn. I will take your order whenever you are ready.\" She says.<br>\r\n<br>\r\n\"I'll take the special number 3.\" You tell her.<br>\r\n<br>\r\n\"Great! I'll make you something to eat then!\" The waitress says and walks off.<br>\r\n<br>\r\n\"Thats strange.....\" you say to yourself and take a drink of water. Then almost immediatly you feel sick! \"Whats going on?! You say before blacking out,<br>\r\n<br>\r\nLater you awake on the floor. You are still in the restaurant but something is different. Everything is much bigger. You notice a grain of rice lying on the floor and pick it up. Its now the size of a football in your hand! Just then you hear heavy footsteps. Somebody is coming! Then,</span></div></div>",
            "created":1271937540,
            "id":871723,
            "title":"Chinese food"
        },
        "122":{
            "author_id":"bigrich1",
            "author_name":"Bigrich",
            "choices":[
                "You turn around and run for your life",
                "You are too scared to move and Lyn grabs you"
            ],
            "content":"<div class=\"\"><div> <span>A black and worn looking shoe crashes down right in front of you! You fall onto your back and gasp in horror! You observe the giant shoe for a moment. It smells like rubber, grease, and foot sweat galore. You slowly look up and see that it belongs to the waitress Lyn. Who is looking right down at you with a smirk on her face,<br>\r\n<br>\r\n\"I told you I would make you something to eat right?\" Lyn smiles and bends over, reaching for you!<br>\r\n<br>\r\n\"Uhoh....\" You say before,</span></div></div>",
            "created":1272457380,
            "id":874679,
            "title":"Lyn's new tiny victim"
        },
        "1221":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Lyn grabs you",
                "Lyn decides it would be better to crush you",
                "Somebody approaches her"
            ],
            "content":"<div class=\"\"><div> <span>Not sparring another second, you turned around and ran. You had no idea where you were heading, but it was anywhere away from the crazy waitress!<br>\r\n<br>\r\n\"Ooohh...I like it when they run hehehe.\" Lyn says and begins to follow you, her massive black loafers right on your tail! of course, if Lyn really wanted, she could easily catch you at this size. She'd rather just take this moment to toy with you instead.<br>\r\n<br>\r\n\"Im getting closer little man! You better run faster!\" Just then, you roll your ankle and fall to the ground. \"Agh damnit!\" You then looked up and gasped! Your little escape attempt was more than useless as Lyn has you now!</span></div></div>",
            "created":1378289400,
            "id":1657424,
            "title":"Running from her trampling feet!"
        },
        "12211":{
            "author_id":"alenkolenovic1",
            "author_name":"Alen",
            "choices":[
                "Take you home ",
                "Make you a servant at her restaurant ",
                "Make you part of the menu "
            ],
            "content":"<div class=\"\"><div> <span>Lyn looks down and picks you up off the floor. You see her licking her lips and you start to try and escape but notice that she has a tight grip on you.<br>\r\n<br>\r\n“Now little man, I have some tasks for you to do for me and if you disobey me, you will he severely punished.” <br>\r\n<br>\r\nLyn takes you to her office and places you on the table. You look around and see pictures which may presumably be of her family. You eye Lyn and are frightened of what she is going to do to you.<br>\r\n<br>\r\nYou notice that Lyn is taking off her loafers and realize that the air around you is starting to get musky. You cover your nose as her bare feet are coming much closer to you. <br>\r\n<br>\r\n“Now little man, I have been on my feet all day. My feet are getting really tired. So, I want you to smell, and rub my feet.” Lyn commanded.<br>\r\n<br>\r\nYou look at Lyn’s gargantuan sized feet and notice all the dirt on it. More out of fear, you walk up to her feet and start smelling it. You gag and start coughing from the foul odor. You then start rubbing her soles and feel all the dirt coming onto you hands. You rub really hard to please Lyn and notice that she looks satisfied. <br>\r\n<br>\r\nAfter what feels like an eternity, Lyn stopped you from doing your task. Does Lyn...</span></div></div>",
            "created":1567241460,
            "id":2710979,
            "title":"Lyn grabs you"
        },
        "1222":{
            "author_id":"briguy",
            "author_name":"patriot",
            "choices":[
                "Crispy Critter",
                "to go menu",
                "she's not looking , RUUUUN!"
            ],
            "content":"<div class=\"\"><div> <span>\"I hope you like fried food,\"she says wit a wink,   you don't likt the soud of that especially when you see her tongue dart out of her mouth as she licks her lips.  She caries you ino the kitchen and drops yo ino a bowl of sweet and sour sauce.  You gagg and sputter as you choke on the tangy sauce as it goes down your throat.  she pushes you repeadly  down in the sauce to make sure you are completly covered in the tangy goodness.  She then reaches in and pulls you out.  \"MMMM, you look good enough to eat,  only problem is an hour latter I will be hungry again.\"<br>\r\n<br>\r\n \"Should I go ahead and fry you to a golden brow, or maybe I should  have take out and save you for my dinner tonight?  What to do ,What to do?\"</span></div></div>",
            "created":1338538920,
            "id":1349712,
            "title":"You are too scared to move and Lyn grabs you"
        },
        "123":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "A different staff member coming for you",
                "An unaware customer walking past",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sitting on the floor, you see </span></div></span></div>",
            "created":1451369220,
            "id":2080816,
            "title":"Something different"
        },
        "13":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Andrea comes back thinking you left.",
                "Andrea looks for you, aware.",
                "Nobody comes ",
                "A new guest comes",
                "The manager comes and picks you up"
            ],
            "content":"<div class=\"\"><div> <span>Walking into the restaurant, you notice the place to be eerily colorless. The walls are a tannish yellow, and it was empty for the lunch hours. You sit down without being waited, and soon a Hispanic woman of about 35 walked up and handed you a minute saying \"Hello I am Andrea! Welcome to the Ol Inne. Can I get you anything?\"<br>\r\n<br>\r\n You tell her \"water\" and go back to looking at your menu. She soon returns with your drink, and you pay no attention to it as you take a sip. The effects way in immediately, as your vision becomes less and less clearly. You suddenly see normal again but wish you hadn't as the world is that from the perspective of just an inch tall.<br>\r\n You freak out as</span></div></div>",
            "created":1451368980,
            "id":2080813,
            "title":"Mexican food"
        }
    },
    "info":{
        "author_id":"bigrich1",
        "author_name":"Bigrich",
        "brief_description":"You shrink in a restaurant and find yourself at the mercy of the waitress!",
        "created":1271337420,
        "description":"<td align=\"left\" class=\"norm\">((Some of you might remember my last story \"Shrunk at a restaurant\" here on writing. com. My account was deleted for some unknown reason so I lost everything :( but some people did like the story so here it is again!))<br>\r\n<br>\r\nYou are a twenty something year old guy named Justin who is on a lunch break. You decide to go to a restaurant of your choice but end up shrunken down under 1 inch in height and at the mercy of the huge waitress herself! Will you manage to survive and figure out what happened?<br>\r\n<br>\r\nNo giant males, limit sexual interactions. Death endings are awesome but just dont use them in excess!</td>",
        "id":1664778,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1567241460,
        "modified":1567241460,
        "pretty_title":"Shrunk at a restaurant 2"
    }
}