{
    "chapters":{
        "1":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Barbara dunkelman",
                "Lindsey jones",
                "Elyse willems",
                "Jessica vasami"
            ],
            "content":"<div class=\"\"><div> <span>*this story will begin with 4 ladies of RT, after they have had you, unaware to them, for some time you will end up being passed around, if you survive that long*<br>\r\n<br>\r\nYou wake up in a strange place, by the looks of it you are in an office on a desk...<br>\r\n<br>\r\nIn walks...</span></div></div>",
            "created":1561611600,
            "id":2679564,
            "title":"The beginning"
        },
        "11":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "You are an inanimate object",
                "You are half an inch tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She towers over you as she sits at her desk, you look around trying to figure out whats happened...</span></div></span></div>",
            "created":1561611600,
            "id":2679566,
            "title":"Barbara dunkelman"
        },
        "111":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A small food item",
                "An item of small clothing",
                "A sex toy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1561611600,
            "id":2679568,
            "title":"You are an inanimate object"
        },
        "1111":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A single nut in a bowl of dozens",
                "A solitary sucking sweet on the desk",
                "One of a group of inch wide cookies"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look about quickly as the giant blonde begins to mover her skyscraper hand over you, you can tell now that you are...</span></div></span></div>",
            "created":1561698000,
            "id":2679958,
            "title":"A small food item"
        },
        "11113":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Mariel salcedo walked in complaining about missing breakfast",
                "Barbara decided to get coffee to dunk her cookies in",
                "She harshley grasped you, causing crimbs to fall off of you"
            ],
            "content":"<div class=\"\"><div> <span>The miles tall barbara grabs the cookie that was half lying on top of you, scratching her perfect nail roughly across your surface, if you were still human you would definantly be bleeding. You looked up in time to see half of your cookie twin disapear inside the giants mouth, her jaw flexed as you heard a deafining crunch, she withdrew her hand, still holding the second half of the cookie, crumbs rained down on you as you watched her relentlessly chew for what felt like an hour. She swallowed, a visible lump traveled down her throat, dissapearing at her tops collar. Barbara gleefully tossed the second half of your once identical cookie brother or sister into her perfect mouth, slightly soaked in saliva mixed with chewed cookie, one drop falling neatly right onto you, burning slightly due to its acidity. She began chewing again, her mind already wandering back to her work, already forgetting the cookie she had just destroyed and sentenced to her stomach. By the time she had logged into her e-mail she had already forgotten about the cookie. Barbara began to absent mindedly reach towards your pile of cookies, but this time you were the top cookie. Just as she made contact... </span></div></div>",
            "created":1561698000,
            "id":2679962,
            "title":"One of a group of inch wide cookies"
        },
        "111131":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "She bites you in half",
                "She pulls you fully in with her tounge and begins chewing"
            ],
            "content":"<div class=\"\"><div> <span>Without a second thought barbara said \"catch\" as she roughly grabbed you, rubbing some small crumbs off of you, a moment later you were propelled at unimaginable speeds by the blondes massive hand towards mariel at the door. She caught you, her grip nearly snapping you in half as she brought you up to her hungry mouth. Holding you in front of her lips she thanked barbara, spraying you with spit.<br>\r\nAs she turned to leave her mouth opened, she brought you into it and bit down, a shot of pain fired through you as your cookie body began to fracture in between her teeth...</span></div></div>",
            "created":1561870800,
            "id":2680667,
            "title":"Mariel salcedo walked in complaining about miss..."
        },
        "1112":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A new bra",
                "One sock, with another next to you",
                "A pair of underwear neatly folded"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As barbara sits down you try to move but cant, you look around and see that you are...</span></div></span></div>",
            "created":1561870800,
            "id":2680554,
            "title":"An item of small clothing"
        },
        "112":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Stuck to a food item",
                "Free to move",
                "Taped inside her empty mug"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you?</span></div></span></div>",
            "created":1561611600,
            "id":2679575,
            "title":"You are half an inch tall"
        },
        "1122":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "The titanic sole of barbaras boot coming down onto the chair",
                "The immense ass of jessica nigri covering every inch of the chair in its shadow",
                "An opening to get to the floor, barbara had kicked the chair from her seat"
            ],
            "content":"<div class=\"\"><div> <span>You quickly go to run out and get barbaras attention when her massive hand passed over head and grabbed a pen as tall as a building. You decided to try leaving the desk, you saw a chair opposite barbara, the desk between the cairs where you were. You made the long walk to the far edge of the desk from barbaras side to here, looking down you saw the cusioned expanse of the chair below. Jumping off was a risk, but had to be done, you landed and roled to the middle of the black leather like seat. Suddenly you were knocked to the your knees by the chair moving rappidly, getting up you saw...</span></div></div>",
            "created":1564203600,
            "id":2693390,
            "title":"Free to move"
        },
        "11222":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "You lifted with it, you were stuck to her leggings",
                "She was repositioning, this time her full ass cheek was heading for you",
                "She was done, she left as the skinny jeans of arynn zech appeared above you"
            ],
            "content":"<div class=\"\"><div> <span>the ground darkened quickly, you looked up to see a huge ass, in tight colourful leggings, moving downwards at you. The bouncy cosplayer jessica was in to discuss things with barbara about upcomming events, she entered the room and bounded over to the chair, her large breasts swaying as she walked, she grabbed the chair and ripped it backwards before swiftly and harshley planting her ass into it. You diddnt have anywhere to run so decided to minimize damage to yourself, if it was possible with an ass like this coming down on you. You barely moved as jessica made contact, her weight displacing her ass across most of the chair, you ended up just barely surviving, your legs were pinned painfully under her left ass cheek while your upper body was pushed to the seat by the tightly stretched material of jessicas leggings, she wiggled, to her very slightly, the leggings twisted your head and left deep friction burns on your skin, you felt a pop from under her cheek, her wiggle had dislocated something in one of your legs. The heat radiating from jessica was immense, causing your burns to hurt, she wiggled again, this time a lot more vigorously. More cracks from your trapped legs, she was pulverising them, your head was twisted again while the leggings peeled more skin from your face and almost definently broke your nose. Jessicas ass then began to rise...</span></div></div>",
            "created":1564203600,
            "id":2693399,
            "title":"The immense ass of jessica nigri covering every..."
        },
        "112223":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Arynn shuffles back, the pocket with her phone is about to land on you",
                "Arynn shuffles you into her empty rear pocket unaware and stands up taking you",
                "Arynn leaves, ellie main sits down with you under her thick thigh"
            ],
            "content":"<div class=\"\"><div> <span>Arynn was already sitting down as you looked up, her ass stretching the jeans smooth as she lowered herself to the chair. Lucky for you and your broken body she made contact at the front of the chair, her full weight now pushing into the seat inches from you. You saw arynn's jeans had 2 rear pockets, one had nothing in it, the other had her phone sticking out of it. You then started noticing you were healing, your left leg was almost the correct shape again. Arynn suddenly began to shuffle backwards on the chair, closing the distance between you and her ass...</span></div></div>",
            "created":1566094980,
            "id":2704085,
            "title":"She was done, she left as the skinny jeans of a..."
        },
        "12":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "You are an inanimate object",
                "You are half an inch tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She towers over you as she sits at her desk, you look around trying to figure out whats happened...</span></div></span></div>",
            "created":1561611600,
            "id":2679569,
            "title":"Lindsey jones"
        },
        "121":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A small food item",
                "An item of small clothing",
                "A sex toy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1561611600,
            "id":2679570,
            "title":"You are an inanimate object"
        },
        "1211":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A single chocolate chip in a 5 inch cookie",
                "A redvine, in a cup with about 20 other identical red vines",
                "A solitary hard candy on a small plate"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lindsey begins moving her hand towards you, never looking over at you. You panick and look around wondering why you cant move, you see why now and panic even more. You are...</span></div></span></div>",
            "created":1561784400,
            "id":2680102,
            "title":"A small food item"
        },
        "12111":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Putting down the cookie",
                "Taking her second bite",
                "Passing your cookie home to fiona nova"
            ],
            "content":"<div class=\"\"><div> <span>Her huge hand gripped your end of the cookie, a massive finger almost derectly on top of you. Lindsey begins to lift her cookie, you included, up to her waiting mouth. Her mouth looked huge to you as it opened to accept her first bite at the far end of the cookie. She pushed the cookie in, the sides of her mouth were pushed by the wide cookie, her lips closed and then, *crunch*.<br>\r\nYou were quickly moved backwards as she began methodically chewing, making sure she got every peice of cookie and chocolate chip, like you, between her huge teeth. Then your cookie prison moved again, lindseys massive finger shuffled over you, cutting off your view, you heard her gulp, 1 bite gone to her stomach.<br>\r\nYou then felt movement again, she was...</span></div></div>",
            "created":1561784400,
            "id":2680103,
            "title":"A single chocolate chip in a 5 inch cookie"
        },
        "121112":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Lindsey slides your end of the cookie into her mouth",
                "Lindsey takes a bite of the other end of the cookie"
            ],
            "content":"<div class=\"\"><div> <span>You felt her finger get heavyer on top of you, then something huge grazed past you with a massive crunching noise, suddenly you were blasted with light, you saw the peoce of cookie lindsey had just bitten off sitting on her tounge inside her mouth as you were pulled away by her hand. The hige thing that touched you was one of her teeth, lindsey began chewing again, tbis time keeping you scarily close to the edge of her lips, you could see into her mouth some times as she chewed, the cookie piece was no more, replaced by a mashed paste of cookie and saliva. *gulp*...</span></div></div>",
            "created":1561784400,
            "id":2680342,
            "title":"Taking her second bite"
        },
        "12112":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Lindseys hand, bringing you to her mouth",
                "Fiona novas hand, carrying you away with her",
                "Meg turneys hand, shoving you in her back pocket for later"
            ],
            "content":"<div class=\"\"><div> <span>Lindseys finger brushes against your red candy body as she pinches the redvine next to you. She lifts it effortlessly out of the cup towards her slightly open mouth. She slips it in between her lips, but does not bite down. Her lips purse as she begins to suck on it, slowley you notice the candy stick begin to slide into her mouth as she starts to nibble the end off. Piece by piece the redvine starts dissapearing into her mouth untill it is gone entirely. You lose focus for a second, being brought back to reality by a hand grabbing you and 2 other redvines out of the cup, its...</span></div></div>",
            "created":1561784400,
            "id":2680171,
            "title":"A redvine, in a cup with about 20 other identic..."
        },
        "121121":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Lindsey starts slipping you in between her lips",
                "Lindsey begins roughly chewing one of the other redvines she grabbed with you"
            ],
            "content":"<div class=\"\"><div> <span>Lindseys grip got stronger as you grew closer to her mouth, you and the 2 other pieces she had grabbed got close enough to smell the previous candy, as her lips slightly parted, just wide enough to slide one redvine in tightly, her tounge slid out a little, wetting her lips, ready to accept you in, you saw the red on the top surface of lindseys tounge as it slipped back into her mouth. Suddenly...</span></div></div>",
            "created":1561784400,
            "id":2680345,
            "title":"Lindseys hand, bringing you to her mouth"
        },
        "1211212":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Up, starting to slide in between her lips",
                "Down, sliding across her chin as she began chewing again"
            ],
            "content":"<div class=\"\"><div> <span>Holding you and the other 2 redvines nearly horizontaly lindsey started shoving the candy on top of you through the small gap in her lips, you could hear the wet sticky noises coming from the candy, as she shoved the redvine in you and the 3rd candy in her hand got pushed towards lindseys massive lips. You made contact with a moist sound, slowley pressure built as the giant woman shoved the candy into her mouth. You began to bend, eventualy you would slip off her lip, if you slipped upwards you would end up joining the current victim of lindseys uncaring mouth, sliding between her lips. If you slipped down you would be spared for now. Just then, the pressure stopped building, replaced with a wet chewing sound as lindsey began thoughtlessly crushing the redvine currently half way into her mouth. After a while of deafening chewing the pressure began building again, faster now than before, you felt her lip start to slide at your tip, you were bending, but what way...</span></div></div>",
            "created":1561870800,
            "id":2680859,
            "title":"Lindsey begins roughly chewing one of the other..."
        },
        "12112121":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "She chews again",
                "You black out as she swallows your second half"
            ],
            "content":"<div class=\"\"><div> <span>You began sliding upwards, forcing your way between lindseys lips against your will, her hand began pushing you in faster, but slow enogh to coat you in saliva fully, as the first redvine nearly fully dissapeared into her mouth, you were half way, you could feel lindseys massive toung batting roughly against you in her mouth while her vice grip stop pushing, this was it. You felt her jaw close quickly shoving her teeth harshley into you, it hurt like hell. You felt your self split in half, the part between her lips stayed while your other half was violently assaulted by lindseys teeth, as she chewed the pain was intense, feeling crushed and thrown about by her teeth and toung, then the inevitable happened, she swallowed. You felt your body get sucked backwards, deep into her mouth then it began to be pulled downwards with the remains of the original redvine,as it reached her stomach the acid realy began to burn, like being lit on fire. Lindsey began pushing the rest of you in as your chewed half sank into her stomach acid painfully...</span></div></div>",
            "created":1564290000,
            "id":2693558,
            "title":"Up, starting to slide in between her lips"
        },
        "121121212":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "You were in her stomach seconds after landing",
                "You were in a box of mcdonalds fries, lindsey again looking down at you",
                "You were looking up from the socked feet of meg turney, you are on the floor"
            ],
            "content":"<div class=\"\"><div> <span>Your vision began to fail as lindseys lips sealed you inside, as her teeth began to mash at you, deforming you painfully while your other half was disolving in her stomach below, you began blacking out from the pain as she stopped chewing. She swallowed, her constrictive throat pushing you to join your previous half in agony in her stomach while she moved on without thinking about you again. Before even reaching lindseys stomach you blacked out fully, when you awoke...</span></div></div>",
            "created":1564290000,
            "id":2693644,
            "title":"You black out as she swallows your second half"
        },
        "1211212123":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "An inanimate object",
                "Half an inch tall"
            ],
            "content":"<div class=\"\"><div> <span>You began to regain consciousness, when you could see again you noticed the lack of stomach acids, or a stomach in fact, these were replaced by two immense feet wrapped in grey ankle socks. You looked up to see the tower of a woman was meg turney, standing above you looking on her phone, completely oblivious to you, you look around noticing you are...</span></div></div>",
            "created":1564635600,
            "id":2695455,
            "title":"You were looking up from the socked feet of meg..."
        },
        "12112121231":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A running shoe, meg was dressed for the gym",
                "A grape that had fallen from the counter",
                "The cap from a water bottle, the one meg was now filling above you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You tried to move but couldnt, you were...</span></div></span></div>",
            "created":1564660860,
            "id":2695457,
            "title":"An inanimate object"
        },
        "121121212312":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "So, in my mouth you go\" she said as her mouth opened",
                "My chair it is then\" meg began walking away with you",
                "So, ill get you later\" she tossed you in a bowl of other grapes"
            ],
            "content":"<div class=\"\"><div> <span>Meg looked down, her eyes widened as they passed over you, her mouth moving into a smile. The goddess began to lean down, her arm out stretched to grab you, her massive thumb bashed you into her equally large index finger, she kept applying pressure, pinching you, then she lifted, moving you quickly up to rest high above her clevage at mouth level, \"what to do with you, little grape, i need to punish you for being on the floor\" she said, amused at herself \"i could just eat you, maybe i put you on my chair? Or ill just put you in my bowl again, get you later. Bah who am i kidding youre just a grape, your only purpose is to be eaten by me, you dont care where you go, meaning its my choice...\"</span></div></div>",
            "created":1564743060,
            "id":2695874,
            "title":"A grape that had fallen from the counter"
        },
        "12112121232":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Free to move",
                "Stuck firmley to the inside of one of megs sneakers",
                "Stuck to the ground and covered in mud, megs shoe was next to you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You then saw you were...</span></div></span></div>",
            "created":1564660620,
            "id":2695456,
            "title":"Half an inch tall"
        },
        "121121212321":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "climb onto the empty shoe next to you",
                "climb onto the sofa across the room",
                "meg moves, trapping you under one of her feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decided you need to get meg's attention, but how?</span></div></span></div>",
            "created":1591018200,
            "id":2844073,
            "title":"Free to move"
        },
        "121122":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "She takes you to her mouth next",
                "You are the last one to go to her mouth",
                "She takes you home with tye other redvine in her hand"
            ],
            "content":"<div class=\"\"><div> <span>You snapped buck as the sensation of being pushed on one side by a huge finger and on the other side 2 more redvines being shoved into you by another finger. You were rapidly brought skyward, but not towards lindsey as you had expected, suddenly you were in the firm grip of a hand, being swung back and forth at the hip of a different person, huge grey jogging pants on the huge legs of the person who now had you. You got a glimps upwards to the face of your new owner, it was fiona, a redvine half in her mouth, her other hand holding it as she bit and pulled at it, splitting it in half, one going with her hand while the other was grabbed by her tounge and went out of sight between her lips...</span></div></div>",
            "created":1561784400,
            "id":2680243,
            "title":"Fiona novas hand, carrying you away with her"
        },
        "122":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Stuck to a food item",
                "Free to move",
                "Taped inside her empty mug"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you?</span></div></span></div>",
            "created":1561611600,
            "id":2679576,
            "title":"You are half an inch tall"
        },
        "13":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "You are an inanimate object",
                "You are half an inch tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She towers over you as she sits at her desk, you look around trying to figure out whats happened...</span></div></span></div>",
            "created":1561611600,
            "id":2679571,
            "title":"Elyse willems"
        },
        "131":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A small food item",
                "An item of small clothing",
                "A sex toy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1561611600,
            "id":2679572,
            "title":"You are an inanimate object"
        },
        "1313":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "I give you to allanah (pearce) for her birthday\"",
                "Im heading home to use you\"",
                "Im heading home so i can send you to austin\""
            ],
            "content":"<div class=\"\"><div> <span>Elyses gaze fell on you and she began to smile \"ooh its here, the dildo is here\". You now knew what you were, a dildo, this explained the fact you couldnt move. \"Right\" elyse whispered, as if speaking to you \"better put you away untill...</span></div></div>",
            "created":1564203600,
            "id":2693006,
            "title":"A sex toy"
        },
        "13131":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "You were under alanahs desk, about to play foot rest all day",
                "Alanah threw you in her car, shes going home now",
                "She tossed you next to autumn farrell's identical bag in the hall, good luck"
            ],
            "content":"<div class=\"\"><div> <span>You guessed about an hour passed untill the drawer elyse stuffed you into was ripped open excitedly to reveal not just elyse but alanah pearce too \"well alanah?\" Elyse said hopefully. \"Its perfect, looks a good size and feels prety firm\" alanah responded in her smooth australian accent, while deftly poking you to see how you feel. \"Right buddy, youre coming home with me forever\" alanah whispered as she grabbed you and roughly dropped you into her bag, the last thing you heard as the zip was closed was \"tganks elyse cant wait, you know how rough i can get, my last one broke after only...\" you were now in silent darkness, worried by alanahs unfinished last comment. You felt the bag get uncaringly tossed somewhere...</span></div></div>",
            "created":1564203600,
            "id":2693011,
            "title":"I give you to allanah (pearce) for her birthday..."
        },
        "131312":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Someone rings her door bell",
                "She gets in, ready to use you"
            ],
            "content":"<div class=\"\"><div> <span>You heard the engine roar to life seconds after you landed, the ride was mostly smooth, the ocasional bump from the road jostled you, making your mental preperation for what was about to happen impossible.<br>\r\nEventually your bag was lifted as the engine died. A few bouncy minutes later you were set down, light flooded in as alanah unzipped her bag, her eyes fell on you almost imediately, she giggled under her breath from anticipation, one of her massive hands dimmed the light as it began to surround you in its grasp, she began lifting you out. As you exited the bag you saw that alanah was already undressed mostly, only a large shirt and underwear remained on. Alanah started walking, carrying you by her hip, to a door at the other side of her living room, she opened the door and continued in, her bare feet slapping on the floor, she flicked on the lights to reveal a bathroom, she began moving to the shower, lifting you up towards her face. Her lips moved apart revealing a sexy smile, teeth partly exposed, her tounge began to extend from between as she turned you around, contact. Her wet tounge worked its way around your base leaving a film of her spit on you, she stepped into the shower and turned you, she brought you down to the level of her now slightly moistened underwear, then you were forcefully smashed against the wall behind you as her hand released its grip, alanah had stuck you to the wall of her shower. She looked down at you dominantly, suddenly she pulled her cheeks then pursed her lips, then *peww* a mass of spit flew from alanah and landed directly on you, obscuring your vision a little. By the time you could see again alanah was already leaving the shower, she pulled her top off revealing her sea blue bra struggling to contain her, she leant in and turned on the water, before closing the shower door and begining to remove her bra...</span></div></div>",
            "created":1564549200,
            "id":2695177,
            "title":"Alanah threw you in her car, shes going home now"
        },
        "1313122":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "3 months later and she still uses you as violently in her shower",
                "You come to as alanah is removing you from the wall",
                "You wake up staring at maddy parkinson"
            ],
            "content":"<div class=\"\"><div> <span>As the hot water blasted down on you, alanah began removing her bra, in a sexy motion it fell, revealing what lay beneath, her magnificent breasts swayed gently as she removed her undewear and deftly discarded both bra and panties in a hamper. The shower door swung open as she stepped in, water bouncing off of her as she closed the door, sealing your fate. First alanahs hand roughly grasped you, ramming you firmly to the wall, making sure you wont fall off, then with the same hand she violently jerked you upwards towards her now soaked clit. Her hand farced you to grind against it as her other hand grasped at the massive tits casting a shadow above. Without warning alanah turned to face way, her ass now looming before you, her rough grip still tightly holding you as her rear moved for you. Her hand guided you as her ass made contact, she slid you between her legs as she bent forwards, her hand repositioned and your world got realy dark and warm, you were in her vagina, suddenly it was light again, then dark followed with a slap from her ass hitting the shower wall, light, dark, slap, light, dark, slap. This went on for an eternity as alanah got louder and more vigorous, her vaginal wals crushing in on you while you were in or her thighs doing the same on the outside. Eventually as alanah reached her 3rd climax her body won as you passed out still inside of her. She had used you against your will till she made you lose conciousness...</span></div></div>",
            "created":1566610440,
            "id":2706737,
            "title":"She gets in, ready to use you"
        },
        "13131222":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "6 years of constant use pass",
                "1 year later",
                "the next week"
            ],
            "content":"<div class=\"\"><div> <span>you came to slowley, all you could hear was the slow drip from the recently silenced shower. as your vision came back you saw her, the australian goddess who just used you mercilessly for the last god knows how long. she was now in panties and a large t-shirt, she leaned in and grabbed you, pulling hard, stretching you until *shluuuck* you released from the wall. she roughly toweled you mostly dry and left with you for another room.<br>\r\nyou were dropped into her drawer as soon as she entered her bedroom, the last thing you saw was her magnificent and scary ass as she bumped the drawer closed with it.</span></div></div>",
            "created":1594468980,
            "id":2865979,
            "title":"You come to as alanah is removing you from the ..."
        },
        "13131223":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A peeled banana on maddys plate",
                "One of a pair of shoes maddy was puting on",
                "Half an inch tall but human again, you jump from where you are"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your vision returned as you began waking up, suddenky you were fully brought back as a massive hand came down next to you, looking up for alanahs face you were shocked to see maddy parkinson, you werent in the shower anymore, instead you were now...</span></div></span></div>",
            "created":1566650820,
            "id":2706964,
            "title":"You wake up staring at maddy parkinson"
        },
        "131312233":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "You were headed for the chair she was about to sit down on",
                "You were falling right towards the inside of her sneaker she was about to wear",
                "You would hit her exposed belly and slide down into her underwear"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You ran towards maddy, trying to avouid the gaze of her beautiful eyes. You reached the edge and lept. Falling you saw where you were about to land...</span></div></span></div>",
            "created":1566651060,
            "id":2706969,
            "title":"Half an inch tall but human again, you jump fro..."
        },
        "1313122333":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Go to the gym\" your world got darker as she slid on some leggings",
                "Have some me time\" she began rubbing herself through her panties",
                "Go to the pool\" you were covered by a bikini, not panties"
            ],
            "content":"<div class=\"\"><div> <span>As you fell you saw that maddy was sitting, her well toned belly exposed, you hit it, bouncing slightley then begining to quickly slide down it towards a gap at the top of her enderwear. Just then maddy moved, accelerating your decent and opening the gap further. You slid in, the darkness consuming you, you finaly came to a stop between her labia, just then a massive force rammed you into her, sealing your fate, now stuck to her vagina you felt maddy stand up and say \"alright, time to...</span></div></div>",
            "created":1566651780,
            "id":2706974,
            "title":"You would hit her exposed belly and slide down ..."
        },
        "13131223333":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "content":"<div class=\"\"><div> <span>Maddy stood compressing you with her thighs, your micro body fully hidden between her pussy lips. after a long walk she obviously reached the pool, you heard many voices outside. Suddenly your world became wet as maddy slowly lowered herself into the water, you couldnt breathe, maddy was drowning you, as her hips continued deeper your breath began to run out. The water was only up to maddys belly button but to you this was too much, as she had fun your mouth gave way and water was forced in as maddy waded. Death came soon after, you were washed out later that day when maddy pleasured herself in the shower, unaware of you having ever existed.</span></div></div>",
            "created":1571575080,
            "id":2735721,
            "title":"Wet lofe with maddy"
        },
        "131313":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Alanah's face, excited, she was biting her lip in anticipation",
                "The confused then aroused and excited face of autumn farrel"
            ],
            "content":"<div class=\"\"><div> <span>You smacked the ground hard, there was little else in here but you and some pens, they bounced off of you and came to a rest all over the small back pack.  FEW HOURS of silence and solitude later you were forcefully lifted, then began swinging as the lifter walked, you bounced off her leg from time to time, after a few minutes you were tossed into car, the drive home saw you roling around a bit inside the bag. Eventually the car stopped and your bag was lifted, taking you inside. You were set down on something soft, a bed or sofa. Then the zip began opening, light flooded in but was soon cut off by...</span></div></div>",
            "created":1564376400,
            "id":2694110,
            "title":"She tossed you next to autumn farrell's ide..."
        },
        "132":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Stuck to a food item",
                "Free to move",
                "Taped inside her empty mug"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you?</span></div></span></div>",
            "created":1561611600,
            "id":2679577,
            "title":"You are half an inch tall"
        },
        "14":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "You are an inanimate object",
                "You are half an inch tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She towers over you as she sits at her desk, you look around trying to figure out whats happened...</span></div></span></div>",
            "created":1561611600,
            "id":2679573,
            "title":"Jessica vasami"
        },
        "141":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A small food item",
                "An item of small clothing",
                "A sex toy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1561611600,
            "id":2679574,
            "title":"You are an inanimate object"
        },
        "1411":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A single insignificant grape",
                "A peice of gum at the top of her pack",
                "A throat sweet for jessica to suck on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jessicas hand reaches out to grab you, you then see that you are just...</span></div></span></div>",
            "created":1565438160,
            "id":2699796,
            "title":"A small food item"
        },
        "1413":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "A vibrator",
                "A dildo",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind?</span></div></span></div>",
            "created":1591482600,
            "id":2846994,
            "title":"A sex toy"
        },
        "14132":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "put you in her bag to use at home later",
                "took you to the toilet to use right now"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>as jessica sat she spotted you lying on the desk.<br>\r\n\"ooh, a dildo? must be a new sponsorship for me to try out\". she took hold of you, her fingers just overlapping as they wrapped around your rubbery form. she lifted you and...</span></div></span></div>",
            "created":1593186780,
            "id":2857118,
            "title":"A dildo"
        },
        "142":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Stuck to a food item",
                "Free to move",
                "Taped inside her empty mug"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you?</span></div></span></div>",
            "created":1561611600,
            "id":2679578,
            "title":"You are half an inch tall"
        },
        "1421":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "A half eaten chocolate bar",
                "An opened banana",
                "A grape, your legs shoved deep inside"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look around as the giant jessica sat down. You notice that you cant move, suddenly a shadow is cast over you, its jessicas hand reaching for what youre stuck to, you look down and see now that you are stuck to...</span></div></span></div>",
            "created":1562043600,
            "id":2681614,
            "title":"Stuck to a food item"
        },
        "14213":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Jessica throws you in her mouth with the grape",
                "Jessica drops your grape onto her legs and grabs another",
                "Jessica drops you on the floor, you roll to near the door"
            ],
            "content":"<div class=\"\"><div> <span>Jessicas hand grabbed a grape, sending a few others rolling off the desk, she threw it in her moth chewing harshley, her hand already gripping your grape, she began lifting you, holding you infront of her still chewing mouth, loud wet sounds coming from within as the grape inside was totally destroyed  you looked down to her legs in time to see a grape get pulverised between her thighs, jessica diddnt react meaning she diddnt know or care what happened to her grapes. Just then...</span></div></div>",
            "created":1562302800,
            "id":2682432,
            "title":"A grape, your legs shoved deep inside"
        },
        "142131":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Were propelled forwards to join the rest of your grape in her mouth",
                "You fell from the grape and down her shirt into her tight sports bra",
                "Jessica started squeezing your half of the grape as she moved it over her mouth"
            ],
            "content":"<div class=\"\"><div> <span>Jessicas throat moved as a large gulp sound signaled her mouth being emptied. Her lips parted revealing her teeth, beginning their move to accept your grape prison. You began moving towards her open mouth, you were at the far end of the grape by her hand. Her lips suddenly closed around the end of the grape, you heard a popping sound as you saw her jaw flex, jessica had bitten the end off of the grape, you suddenly rocketed backwards as she began chewing the half of the grape she had in her mouth, suddenly you...</span></div></div>",
            "created":1564203600,
            "id":2693159,
            "title":"Jessica throws you in her mouth with the grape"
        },
        "142133":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Jessica gets up to leave",
                "Ellie maine comes in"
            ],
            "content":"<div class=\"\"><div> <span>Just as jessica opens her mouth to shove your grape prison into it her grip loosens, you fall fast to her massive thigh, the landing cements you further into the grape making escape impossible. you begin rolling to inbetween her thighs, remembering what they did to the last grape jessica absent mindedly pulverised between them, just as you reached the middle and stopped roling you looked up to see a new grape being slid between her lips, just then the huge thighs began to part, dropping you and your grape directly into the danger zone, you looked forwards, seeing in the distance between the thighs jessicas womanhood tightly outlined in the black leggings she was wearing.<br>\r\nHer legs started coming togeather again, closing the gap between her thighs, your grape started roling away from her, you diddnt know if you were happy about this but quickly decided that being crushed between a giant womans legs and vagina at the same time would hurt, suddenly you felt a falling sensation, you had roled off of the seat then *BANG* jessicas sneaker bashed you across the room, you eventually roled to a stop a few jessica sized steps from the closed door...</span></div></div>",
            "created":1563944400,
            "id":2691686,
            "title":"Jessica drops you on the floor, you roll to nea..."
        },
        "1421332":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Ellies foot crashes down on your grape as she continues tapping",
                "Ellie leaves just as the massive boots of barbara dunkelman stomp in"
            ],
            "content":"<div class=\"\"><div> <span>The massive door swung open as a huge, skinny jean wrapped leg appeared, followed by ellie maine, each crash of her converse on the floor brought her closer to you. Suddenly a shadow apeared over you, within a second ellie had covered the distance from the door to your position on the hard cold floor, her sneaker was right above you, and getting bigger fast. It missed by millimeters, shaking your grape prison, then another crash to the other side, her right foot landing in line with her left, she had stopped right above you. Looking up you followed the line of her gigantic legs to her magnificent ass, well pronounced in her skinny jeans. Suddenly a series of crashes snap you out of you ass based daydreams, ellie was tapping her foot, the left one, the one that just barely missed you when she came in, just then...</span></div></div>",
            "created":1564030800,
            "id":2692033,
            "title":"Ellie maine comes in"
        },
        "14213321":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "You become something for a community member",
                "You become something for another rt member"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ellies foot bounced, after minutes of fear, it happened, her foot was above you. It rocketed downwards and went through you without ellie even noticing, you were gone, your grape remains fell off her shoe in the car park as she walked to her car.</span></div></span></div>",
            "created":1577792820,
            "id":2767417,
            "title":"Ellies foot crashes down on your grape as she c..."
        },
        "142133211":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Alison (adothop)",
                "Freya (fridgefreya)",
                "Sasha (alexskyline)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is getting you?</span></div></span></div>",
            "created":1577768400,
            "id":2767418,
            "title":"You become something for a community member"
        },
        "14213322":{
            "author_id":"dustman",
            "author_name":"dustman1",
            "choices":[
                "Shes heading home, its a hot day but she decides to walk",
                "Shes going to return these boots to the props department"
            ],
            "content":"<div class=\"\"><div> <span>Ellie turned to leave, her shoe gliding over you before her massive form disapeared through the door, imediately replaced with the giant brown boot of barbara, stomping in vibrating the floor as she walked. Her foot came to a stop above you, her boot heel at one side and the rest of the boot at the other, another lucky escape with barbaras boot right above you. However your lick quickly ran out as barb broght her foot up onto just the heel and slid it back slightly, to her a minor adjustment to her stance. Suddenly with the weight of a goddess her boot began its return journey to the ground, this time you and your grape were part of its eventual domain. As her boot made contact with the grape which encased you barbara slowed, still adding preasure. The grape began to give way under the uncaring sole as it made its way to its rightful destination, the hard floor. Juice started to bleed from the skin of the grape as her foot pressed on, pressure began building on you, pain. Barbaras unconsious movements concluded when her boot was firmly flat on the ground, what she wasnt aware of was that she had a passenger stuck inside her treads, stuck tight in mashed grape, dried mud and small stones, you. She span on the ball of her foot, smearing any loose grape debris from her boot onto the floor, as she began walking you were carried away by barbara...</span></div></div>",
            "created":1564030800,
            "id":2692410,
            "title":"Ellie leaves just as the massive boots of barba..."
        }
    },
    "info":{
        "author_id":"dustman",
        "author_name":"dustman1",
        "brief_description":"You shrink or become an object next to an unaware female at rooster teeth",
        "created":1561680060,
        "description":"<td align=\"left\" class=\"norm\">You become shrunk or turn into an inanimate object near a ladie from rooster teeth or related companies<br>\r\nRule: the normal sized people do not know you exist, they MUST remain unaware of you at all times except after killing you if they make a remark about something strange.<br>\r\n<br>\r\nFeel free yo add to tbis, i will remove if it doesnt fit the theme im going for so go for whatever<br>\r\nOnly real rules are it must always be unaware and there must be NO male interaction at all<br>\r\n<br>\r\nThis is a female giantess only story.<br>\r\n<br>\r\nPlease do add to build this big, if you want to add more choices to a chapter feel free to ask<br>\r\n<br>\r\nIf you want something or someone in particular added, leave a review, message me or add it in its chapter spot with a description of what you want, ill write it, but if you feel you can add, do add to this story, it is open for anyone to add to</td>",
        "id":2194399,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594468980,
        "modified":1594468980,
        "pretty_title":"Giantess object tf rooster teeth"
    }
}