{
    "chapters":{
        "1":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Alan, the father",
                "Martin, the son",
                "Male humans",
                "Male Furries"
            ],
            "content":"<div class=\"\"><div> <span>I arrived in the afternoon with taxi. The new house was located in a cul-de-sac in the suburbs just outside of Anthropolis. Thanks to the new credit card i received in mail from the bank of Furplanet i was able to pay the driver and got out of the taxi. And then i looked at the new house, which was a bit bigger than i thought, and it´s even cheaper than the old house! Then i started to think back to Earth...<br>\r\n<br>\r\nI am always happy when my family is around, especially the love of my life: Marian. She´s a beautiful and talented woman. We met when started at college 25 years ago and it was love at first sight and 20 years ago we got married and 3 years after that we had our first child. In total we have three: Gloria (17), Martin (15) and Hannah (13). We all lived in Juneau, Alaska where i worked at the university of Alaska Southeast. Even though Marian could have any job she wanted, she rather stayed at home being a housewife and take care of the kids.<br>\r\nMarian and i celebrated our wedding-anniversary with a dinner and making love on our bed while the kids have sleepovers with their friends, and in the next morning i received a letter from the university of Anthropolis offering me a job, they even sent an advanced monthly payment which is more than i earn in a year! Furplanet was known to be a really nice place, clean air, beautiful nature and no crimes anywhere. Marian and the kids got really exited and encouraged me to accept.<br>\r\n<br>\r\nThat was two weeks ago.<br>\r\n<br>\r\nIt was decided that i would go ahead and make sure everything set while Marian and the kids visits her parents in Canada (she is born canadian) for a week. I arrived an hour later thanks to Furplanet-made spaceship, even though there´re was a light-year distance between us! And now here i am.<br>\r\n<br>\r\nThe house seemed bigger inside. It has four bedrooms (Gloria and Hannah complained about having their own rooms), one guest room, a study (perfect for me!), a living room, a big kitchen with a dining room, an attic, and a beautifully green backyard (when Marian sees this, she´ll wanna plant a garden right away!). All the beds and the furnitures was already set up by the movers while the rest are still in the boxes.<br>\r\n<br>\r\nAnd now i standing on the front yard looking over the cul-de-sac. The sky was clear blue without a cloud on sight, and with the warmth reminded me of the family-trip to California. The houses around me looked the same as mine but in other colors. And when i looked at the house opposite of mine i froze.<br>\r\n<br>\r\nOutside the garage there are three flamingo-girls washing a car. They looked almost the same and wearing same daisy dukes but different bikini tops, i suspect they´re sisters. The way they wash the car reminds of a YouTube-video i caught my son watching last year. I also noticed another thing: they look old enough to be his daughters, but their bodies would put a model to shame! Their breasts are VERY big!. Then they notice me, giving me a strange look. And suddenly one of the girls held a soap in the air with both hands (or...paws?), squeezed and let it all drop on her breasts. My mouth got wide open, my eyes widened and my pants is getting a bit uncomfortable...<br>\r\n<br>\r\n\"Hey there neighbor!\" i heard feminine voice shout from my right. I turned my head and saw a female dalmatian jogging to my direction. I couldn't help but watch as her breasts bounced around. When she got about ten feet she slowed down and reached out her right paw.<br>\r\n\"I´m Judy. Judy Dalma\", That´s a name in english, to make it easier for humans. They already have names in the language humans can´t use.<br>\r\nI politely shake her paw, \"Alan. Alan Turner\"<br>\r\nJudy Dalma; \"Nice to finally meet a human in our neighborhood\", she turned to the flamingo-girls for a moment and shouted \"Hey! I thought you were gonna clean the car, not your tits!\", the girls giggled while i blushed from hearing that.<br>\r\nAlan Turner; \"I guess i´m the first human in the area. Heh\"<br>\r\nJudy; \"Oh yeah, and it´s nice to have a MAN around here too\", that got me a bit confused and she´s eyeing me up and down, \"well, i gotta go home and take my shower, see ya!\" she walked around me and when she got 12-feet away she turned 180 and said \"if you plan on jogging, let me know!\" and disappeared into her house.<br>\r\n<br>\r\nI went back inside and started to unpack some of the boxes (i have the whole week until my family arrives) started filling the living room. Then i finally noticed a few boxes labeled \"WELCOME\". I opened up a small one and found many brochures for a lot of attractions, restaurants, theaters, malls, parks...nightclubs? I opened another one to find a bunch of furry... PORN?! I better send this one back to whoever sent this! And i opened the last one, a big one, only to find a lot of bathrobes. Female bathrobes, that looks a whole lot different from the robes I've seen. I better return this one too. And now i got thinking... because i was so amazed of the spaceship, the planet, the city even the house, that i didn't notice the females around me during the trip. Was the taxi driver male or female, i didn't know. And that got me thinking about the flamingos and the dalmatian. Are all females like that? I decided to continue unpacking, starting with my laptop (Mac).<br>\r\n<br>\r\nThen it turned to night. And to my surprise it started raining. I guess i have to check the weather report more often. It´s now 8pm and I've already unpacked for the living room, the kitchen and the bathroom, so i decided to sit on the couch with my laptop. An hour later i heard the doorbell ring. \"Who could that be? At this hour?\" i thought. When i opened the door i got a breathtaking sight: two females in wet clothes! One is a blond, chocolate furred poodle with a tight pink t-shirt and a pair of tight jeans and the other is a white furred, red-haired cat with a shirt and a pair of jeans they both have wide hips and breasts that seemed like two pairs of basketballs!<br>\r\nThe cat; \"Sorry to disturb you this late, but a greedy bitch abandoned us nearby and, well, we got lost\"<br>\r\nThe Poodle; \"Can we come in so we can dry up? Please?\", she looked at me with cute puppy eyes.<br>\r\nI´m not the kind of person who would not help people in need, and i do have a box strange bathrobes. So I decided: \"come in and i´ll call a taxi\". But what i didn't know was that it´s gonna be a looong night...<br>\r\n<br>\r\n<br>\r\n<br>\r\n(QUESTION FROM THE AUTHOR: will you keep following Alan? Or his son Martin? Or maybe other male humans and furries?)</span></div></div>",
            "created":1479445200,
            "id":2238844,
            "title":"The arrival of Alan Turner..."
        },
        "11":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "The three flamingo-sisters",
                "A sexy bunny-milf",
                "A hot vixen",
                "A skinny, teen panda",
                "An old friend from Earth"
            ],
            "content":"<div class=\"\"><div> <span>I let them change in the bathroom while i called the cab. And then they went down the stairs and i couldn't help but look at them. The robes helped revealing their voluptuous forms and shows of a lot of cleavage from top to bottom! Luckily the girls still have their underwear on. I snapped myself back to reality.<br>\r\nAlan; \"The good news is that a taxi is on the way, but the bad news is that it won't arrive for another 90 minutes\"<br>\r\nThe cat; \"That´s ok, we can wait. By the way, I´m Cathy\", and she shake my hand<br>\r\nThe poodle; \"And I'm Daphne!\", she gleefully shakes my hand, which makes her breasts jiggle a lot. Both girls giggled when i blushed.<br>\r\nWhen they sat down on the couch i asked what happened.<br>\r\n<br>\r\nDaphne; \"Well, we heard that a couple of new human boys were gonna go to our school and one of them is throwing a party, so Cathy and i decided to try our luck going their\"<br>\r\nCathy; \"We hitched a ride from one of our classmates. But it turned out she intended to get him first and left us a few blocks from here! And then it stared raining and we got lost\"<br>\r\nFemale furries fighting over human boys? Weird.<br>\r\nAlan; \"you're in high school?\"<br>\r\nCathy; \"Oh yeah! We just turned seniors\"<br>\r\nDaphne; \"And we´re among the best cheerleaders in Anna Pitch High!\"<br>\r\nCathy; \"Are you gonna work there?\", she was excitingly curious.<br>\r\nAlan; \"No, but I'm gonna work at the university\"<br>\r\nDaphne; \"The biggest school on the planet?! Woff!\"<br>\r\nAlan; \"Is it that big?\"<br>\r\nDaphne; \"Every furry from the city and all around the planet is going there!\"<br>\r\nCathy; \"By the way, are you alone?\"<br>\r\n<br>\r\nI told them that my family is arriving next week. I showed them the photo album while Daphne sat by my left and Cathy sat by my right, and strangely gives me a good view over their breasts.<br>\r\nDaphne; \"Your son looks so cute!\"<br>\r\nCathy; \"Well i think your eldest daughter looks hot\"<br>\r\nDaphne; \"I highly recommend a great beauty shop for your wife\"<br>\r\nCathy; \"Your youngest seems to be growing up to a pretty female\"<br>\r\nStrange compliments and they're also pressing their bodies onto mine. And i hate to admit that their breasts feels good pressed on my arms. I look at my wristwatch and that the taxi will arrive in another 30 minutes. Suddenly the girls walked to the stairs before asking me if they could borrow the shower for a moment? I told that they have 20 minutes and they ran up the stairs with their breast and butts jiggling.<br>\r\n<br>\r\nWhen the twenty minutes were up i knocked on the bathroom door. No answer. I knocked again. Still no answer. I decided to cover my eyes and go in. The shower was on and i couldn't hear them. Strange. Suddenly i felt tap on my right shoulder, i yelped and turned to see Cathy completely naked! She was watching me with the same look that the flamingo-girls had. A pair got wrapped around my waist and i felt a pair of wet orbs on back. I turned my head to see the face of Daphne before she kissed me fully on the lips! I quickly got out of her grasp headed to the door, but it got blocked by Cathy who then grabbed my shirt pulled me for a kiss too! I got of her but while i back away, both of the girls gets closer and closer until i had back against the wall. No escape. Now they're smothering against me, touching me and then starts to take my clothes off!<br>\r\n\"STOP!\" i shouted to no avail \"We´re not doing this, we can't, I'm MARRIED!\"<br>\r\nBut they just keep moaning and say \"yes we can\" and finally they dropped down my underwear, and reveals a very hard penis, and they suddenly start licking it! I tried to protest, but i couldn't. It felt to damn good. My hands starts to slowly move over their heads, sliding the fingers through their hairs. And then Daphne start to lick, kiss and massage my sack, while Cathy first kissed the head of my penis before taking into her mouth! I have felt anything like that in my whole life!<br>\r\nBefore i knew it i helplessly released in her mouth, and she swallowed it all eagerly down her throat. And then they brought me into the shower and starts kissing my neck while moved my hands over their backs down to their asses, and squeezed. They're just so big! The girls moaned in response and we started a make out session. And then Cathy turned, bent down and pressed her tits on glass door while Daphne grabbed my dick and guided it to Cathy's pussy. Out of instinct i held her hips with both my hands and then slipped myself inside her, making us both moan. She's really tight! I kept pumping in Cathy while Daphne pressed her tits on my back, and i turned my head so she can kiss me, which she did and even put her tongue in my mouth. We continued like this for a moment until Cathy and i came at the same time, moaning loudly (of course mine was muffled by Daphne's mouth). Then Cathy came to think of the taxi but Daphne responded \"why bother? It´s my turn to have MY pussy filled!\". By now i didn't object and we dried ourselves off.<br>\r\n<br>\r\nI led them to the bedroom and they pushed me onto it. Cathy then laid laid beside me while Daphne gets between my legs and starts stroking my dick until it was hard enough and she starts sucking it. I started moaning as Cathy plants her lips on mine, passionately giving me a french kiss. Daphne suddenly stopped sucking. I craned my head up to look. She's putting my dick between her large breast and then pressed them together. She's giving me titfuck! And then Cathy pressed her tits on my face, guiding my mouth to her right nipple. Meanwhile Daphne moves her tits up and down and occasionally lick or suck my head. Finally after a few minutes i released into her mouth.<br>\r\nWhat happened next is that i fucked Daphne from behind and gropes her tits with my both hands while Cathy massages my back with her tits and licks my neck and my earlobe. Then i laid back with Cathy riding my dick and Daphne puts her pussy over my mouth and i licked it. Then i fucked Daphne in missionary position while she gets kisses from Cathy who's masturbating herself. <br>\r\nFinally after what seemed like hours i lost consciousness between the girls. Still cumming inside the cat...<br>\r\n<br>\r\n<br>\r\nNEXT MORNING<br>\r\n<br>\r\n<br>\r\nI felt the sun shinning through the window as i slowly opened my eyes. Only find both females gone and the time is nearly ten in the morning. After taking a quick shower I put on some underpants, a t-shirt and a pair of jeans before going down to the kitchen for breakfast. On the fridge i found note, saying:<br>\r\n<br>\r\nIT´S THURSDAY SO WE DIDN´T <br>\r\nWANT TO BE LATE FOR SCHOOL.<br>\r\nTHANKS FOR THE GREAT FUCK!<br>\r\nHOPE TO BUMB INTO YOU AGAIN.<br>\r\n<br>\r\nXOXO<br>\r\nCATHY+DAPHNE<br>\r\n<br>\r\nWhile i ate my breakfast i began think about what i just did. I cheated on my wife! Why didn't i stop those two girls?! And more importantly, myself?! Why did i let myself have sex with two high school cheerleaders?!<br>\r\nAfter finishing breakfast i started my laptop to try and find out what the hell is going on this planet! As it turns out, the females becomes incredibly horny when turning 16, not before, and at the same time have their bodies transformed, and because of the low number of males in the world the females are free to mate with whoever they want. Whether the male is a friend, stranger or family!<br>\r\n<br>\r\nWhatever happened the other night, will not be the last. That explains the boxes i received yesterday! My family must never know what I'm about to be doing, Marian wouldn't understand and our son might fall for the temptations. I hide the boxes in the big attic. Let´s just hope i survive this planet.<br>\r\n<br>\r\nThen i just remembered i have a meeting the principal of the university this afternoon. I better get myself ready by then.<br>\r\n<br>\r\nAnd then i heard the doorbell again. Who could it be this time?</span></div></div>",
            "created":1479531600,
            "id":2239136,
            "title":"Alan, the father"
        },
        "111":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Timeskip to the university",
                "Sex on the bus!",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>The flamingo-girls who car-washed yesterday were right now standing outside the front door, wearing nothing but bikinis (red, green and yellow)! Without a word they quickly got inside, closed the door, grabbed me and pushed me onto the couch. Then they took my clothes off until my boxers remained and when they took that off down to my feet exposing my erect cock. The three identical girls stared at it for a few seconds before they're taking their bikinis off. One of them leapt on me first. Her full tits filled my vision as she straddled my lap wrapping a hand around my cock and guiding it straight for her moist, almost foaming, womanhood.<br>\r\n<br>\r\nI couldn't believe this was happening as my cock slid easily into the flamingo-girl´s dripping pussy. This birdie was really wet and we had only just begun! She cried out in ecstasy as my pole entered her and she began riding fiercely. I grabbed hold of her juicy mounds with a gasp of pleasure and began lifting my hips to meet each of her desperate downward thrusts. The flamingo-girl Nr. 2 appeared on the couch beside me and thrust her giant melons into my face, pressing her engorged nipple into my mouth and i sucked it eagerly. Girl Nr. 3 took a cushion on the opposite side, grabbed my hand and thrust it into her crotch. My fingers soon found their way into her honey pot, soaking them to the knuckles in her love juices.<br>\r\n<br>\r\nThe pleasure overwhelmed me as the three girls began to moan and squeal in a gyrating tangle of flesh. My cock ached in its desire and my body quaked with each push, suck and penetration. My free hand grabbed Nr. 2´s other massive tit and squeezed the nipple causing her to scream and quiver in pleasure.<br>\r\n<br>\r\nI feel like i wanted more. I needed more!<br>\r\n<br>\r\nNr. 1 was panting loudly and her cum had soaked my entire groin, my hand was getting sore from fingering Nr. 2 but her shrieks of gratification fueled me on. All three flamingos were contorted in bliss and even the second flamingo-girl had orgasmed hard from nothing more than the fondling and suckling of her generously sized rack. I could feel my balls swell as their moans, squeals and rutting pushed me towards the edge of exploding. Nr. 1´s pussy seemed to be sucking at me with plunge onto my rock-hard manhood and the third flamingo had grabbed my wrist and was grinding my hand deeper inside of her. I couldn't hold back any longer and exploded deep into Nr. 1´s sopping young womb causing her to scream in a final orgasmic climax before collapsing sideways onto the floor besides the couch.<br>\r\n<br>\r\nBut it wasn't over yet!<br>\r\n<br>\r\nI snatched my hand back from the third girl beside me and pushed her down over the couch arm and lifted feathered ass until her engorged cunt was exposed to me. Nr. 2 cried out in dismay at her lost chance for my cock, but I just got up onto my knees on the cushions and plunged my throbbing dick straight into Nr. 3´s dripping slit. She grabbed the couch arm in both support and yearning, and arching her back, lifting her ass so I could enter her completely again and again. I marveled at her gorgeous firm and strong hips, and we both cried out as my cock hit the back of cervix with each penetration.<br>\r\n<br>\r\nI reached behind me and grabbed Nr. 2 hauling her over her sister´s back until she was standing over her with a leg on either side of her bucking sister´s hips. With one hand still on the luscious Nr. 2´s hip i grabbed Nr. 3´s thigh and stuck my face between her legs, almost causing Nr. 3 to collapse on top of her sister in pleasure. I lapped at her foaming cunt like a man starving for pussy and she leaned against me heavily to stop herself dropping onto Nr. 3´s back as I ate her out.<br>\r\n<br>\r\nI still find it hard to believe that girls like these would wanna fuck a boring middle-aged man like me. Even the girls from last night. These girls wanted me, they wanted me badly and I don't feel any regrets at all!<br>\r\n<br>\r\nMy tongue licking deep within Nr. 2 and her cries where growing loader and louder as she came again and again dripping her juices over my face. Nr. 3 was pushing her voluptuous ass eagerly back into every thrust I made causing a slapping sound as my balls smacked up against her. I could feel the head of my cock rub against her tight insides and it sent a bolt of lightning to my core energizing my tired body and I came deep inside of Nr. 3 causing us both to cry out in euphoria and collapse, darkness came over me...<br>\r\n<br>\r\nOnly to be jolted awake by Nr. 2 who began to ride fiercely on my cock! All I did was lying back tiredly and letting her do the work. Her tits bounced violently as her ass went up and down on my dick. I was completely mesmerized by those heavy breasts of hers.<br>\r\n<br>\r\nWe went on like that for about 10 minutes until my balls started to swell again, knowing that I won't hold back much longer. And when she came for fourth time I released my sperm deep in her, making us both scream in ecstasy and she fell backwards, letting my penis go of her pussy. But for some reason it was still a bit hard. And then I suddenly hear someone say \"well now I'm impressed\" and turned my head towards the hallway and there stood my other neighbor, Judy Dalma. She´s wearing a pair of tight jogging shorts and a sports bra. <br>\r\n\"I just finished my round when I heard a lot of moaning and screaming. Not bad for a human!\", and she moves towards the couch while taking off the little clothing she had, \"think you can go for another round?\" she asked before she knelt by the couch grabbing my cock and took it all in her mouth. She was a natural her head bobbing up and down the length of my cock, her tongue leaving no part of my lengths untended for long. After a few minutes of sucking I felt myself building up to a climax. \"I'm going to cum\" I warned her and then she stop... only to get on top of me and slides my cock inside her.<br>\r\n<br>\r\n\"This is my favorite exercise!\" she shouted and moved her hips with an incredible speed. I reached up to her breasts but she then suddenly leaned forward and pressed her tits on my face, completely blocking my vision but never stopped her hips from moving, no matter what! My lips found her left nipple and sucking it for all that is worth. About five minutes later she came hard but I haven't yet. And before I could she got and placed my cock right between her large tits, pressed them together and gives me a titfuck. It only took a minute and i came all over her tits and face!<br>\r\n<br>\r\nThe flamingo-girls meanwhile woke up and when they see Judy drenched in my cum they moved in to wipe some for themselves, and she didn't object. The three introduced themselves to me as Chloe (Nr. 1, red), Flora (Nr. 2, Green) and Jessy (Nr. 3, yellow). After resting for a bit, and seeing that I need to get ready for the 2 o'clock meeting with the principle, which is 90 minutes from now. All the females gives me erotic hugs (Judy licks my cheek, since she´s a dog) before leaving and took a shower, again.<br>\r\n<br>\r\nAfter getting my suit on I decided to take the bus to the university, getting a bit of sightseeing on the way. Question is: will it be a calm ride?</span></div></div>",
            "created":1481562660,
            "id":2249030,
            "title":"The three flamingo-sisters"
        },
        "12":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Shyly talk to her (I'm in love man!)",
                "A group of females walk up to me",
                "A female teacher gets in front of me",
                "I have to get to class!",
                "Sheila is heading towards me!"
            ],
            "content":"<div class=\"\"><div> <span>(Inspiration from Furry High: Human Students) <a rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1940582-Furry-High-Human-Students\" target=\"_blank\">http://www.writing.com/main/interact/ite...</a><br>\r\n<br>\r\nThis planet is truly breathtaking. We arrived at our new home thanks to a flying taxi. Dad walked out welcoming us and we all had a big family hug (except Gloria, who immediately wanted to see her own room and decorate it!).<br>\r\n<br>\r\nI walked into my new room and started to pack up my things (dad respects the privacy of his children). I am a bit of a organizer when it comes to my things. And it includes my computer and iPad (I'm a mac-person like dad), some posters and a bunch of comic books (Marvel and DC) and ordinary books (Harry Potter, Narnia, Hunger Games, Divergent, Lord Of The Rings and Game of Thrones). And i also have couple of video-games.<br>\r\n<br>\r\nLater i Encountered other guys in the neighborhood who are the same age as me: Terry the raccoon, Bobby the rabbit and Ernie the chipmunk. After figuring out that we´re all gonna be on the same school, we quickly became friends. Bobby invited me to join the guys playing video-games (while showing me how it works), and i accepted it. <br>\r\nWhile we´re busy playing the game Bobby's mom, Stacy, got home. And she´s one hot MILF with very large boobs! She got us drinks from the kitchen and when she leaned down handing me a drink, i could perfectly see her cleavage. I blushed with embarrassment but she didn't seem to mind as she winked at me. While Terry and Ernie make horny comments on Stacy's tits i don't see annoyance or embarrassment on Bobby's face, which is weird.<br>\r\n<br>\r\nFinally i had to go home for dinner and it´s school tomorrow. Apparently my sisters made some friends too and my parents talked about the neighborhood. But when mom asked about the neighbors, dad seemed a bit nervous and simply said that they're all very friendly. And i couldn't help but notice that he's hiding something.<br>\r\nAfter dinner i went to the bathroom started to masturbate while thinking of Stacy and her tits and after that i went straight to bed.<br>\r\n<br>\r\nIn the middle of the night i had to make a piss, and once that was done went down to the kitchen and decided to get myself some juice and a apple. Suddenly i heard the front door open and then i see dad enter, wearing a robe, and walked to the kitchen, but stopped mid track when he saw me. While i watch him with an raised eyebrow, he awkwardly told me to not mentioning this to anybody, before he slowly turned and walked back to bed.<br>\r\nThat got me thinking. Is dad having an affair? But i shrugged that thought away. He would never do that to mom. He probably just went for a walk in the warm night air. And so i went back to bed too and quickly fell asleep.<br>\r\n<br>\r\nDad insisted after breakfast that he drive us to school. He dropped me and Gloria off and drives away to drop Hannah off at her school. And let me tell you this high school is gigantic compared to our old school! And every female i see is sexy as hell, while the males are few. Gloria then ran off to the new friends she met yesterday, and at the same time i saw my friends too. They showed me to the office where i meet a staff member who would tell where my classes will be.<br>\r\nShe's a wolf with tits the size of overgrown melons and a coke bottle body figure. She gives me two kinds of slips; one had the class i was going to while the other to her office. I asked what the other one was for and she said it´s for whenever i need assistance or \"anything else\". I got a bit confused about the last part and that look in her eyes. I stepped out of the office back to the guys.<br>\r\n<br>\r\nWhile walking through the hall i stopped to see a beautiful creature: she's a vixen with red fur on her body except her black hands and feet, the white on her front and the tip of her big bushy tail, and her long pink hair reaches down her back. Her breasts were two large watermelons and her ass is very big, and she's wearing a pink t-shirt that stretches over her tits and a pair of tight pink Daisy Dukes.<br>\r\nBobby; \"That´s Sheila. She's one of the popular girls in school\"<br>\r\nTerry; \"Yeah. But maybe you should go and introduce yourself!\"<br>\r\nErnie \"Yeah man! Do it!\"<br>\r\nShould i really do that?</span></div></div>",
            "created":1480914000,
            "id":2246169,
            "title":"Martins first day in a new (SEXY!) school"
        },
        "123":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "History (wolfess)",
                "Cooking (Sheep)",
                "More teachers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of teacher?</span></div></span></div>",
            "created":1493824680,
            "id":2314389,
            "title":"A female teacher gets in front of me"
        },
        "1233":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "PE (doberman (dog))",
                "Math (cat)",
                "More teachers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>PE (Physical Education) or math?</span></div></span></div>",
            "created":1493825160,
            "id":2314391,
            "title":"More teachers"
        },
        "12333":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Biology (cow)",
                "Chemistry (owl)",
                "More teachers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Biology or chemistry?</span></div></span></div>",
            "created":1493825280,
            "id":2314393,
            "title":"More teachers"
        },
        "124":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Honor Literature",
                "History",
                "More classes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class?</span></div></span></div>",
            "created":1499986140,
            "id":2352745,
            "title":"I have to get to class!"
        },
        "1243":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Math",
                "Science",
                "Gym"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1499986200,
            "id":2352747,
            "title":"More classes"
        },
        "13":{
            "choices":[
                "Kage Ookami ",
                "Mark Jonson",
                "Walden Green",
                "SmokingAshGamer",
                "More Guy are on there way there."
            ],
            "content":"<div class=\"\"><div> <span>Ok sine you want a little more choice here a few.<br>\r\n<br>\r\nName: Kage Ookami <br>\r\nAge: 23<br>\r\nGender: Male<br>\r\nOccupation: writer<br>\r\nInfo: Kage was offered a free fully paid trip by his publishing company to go to the Furplanet to help show companies willingness to have different kinds of races all over. Also it seem that he was requestted by a few there to help bolster sale with a new book.<br>\r\n<br>\r\nName: Mark Jonson<br>\r\nAge: 40<br>\r\nGender: Male<br>\r\nOccupation: Software writer.<br>\r\nInfo: Mark was sent to Furplanet by a goverments to help fix problems with the merger of the two planetary systems. Mark is excited to work on there code systems and learn about the planets internet.<br>\r\n<br>\r\nName Walden Green<br>\r\nAge: 30<br>\r\nOccupation: construction.<br>\r\nInfo: Because humans need slightly different housing systems to live in there is a booming sector for construction work. Walden is one of the first group of workers that have been sent to help fill that need.<br>\r\n<br>\r\nName: SmokingAshGamer<br>\r\nAge:18<br>\r\nGender: Male<br>\r\nOccupation: Professional Gamer<br>\r\nInfo: SmokingAshGamer, that his real name he had it changed when he was of legal age. Is a rising star in the professional video gaming circuit and gameplay star. His fame has gotten him him offers from multiple game teams on both worlds. He going to Furplanet to cheek out the team and video games there.</span></div></div>",
            "created":1496194140,
            "id":2328313,
            "title":"Male humans"
        },
        "135":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Alvin Seville",
                "Robert Wallace",
                "Jake Taylor",
                "More guys on the way"
            ],
            "content":"<div class=\"\"><div> <span>Name: Alvin Seville<br>\r\nAge: 18<br>\r\nOccupation: College student<br>\r\nInfo: Alvin was given that name by his the orphanage manager, who is a fan of \"Alvin and the Chipmunks\", and his adoptive parents let him keep it. Now he's arriving at Furplanet to study and party at the university of Anthropolis. And he's in for a wild life in there!<br>\r\n<br>\r\nName: Robert Wallace<br>\r\nAge: 30<br>\r\nOccupation: High school teacher<br>\r\nInfo: After having looking for a job in three years, he finally got one in one of Anthropolis' many high schools. And so, with encouragement from his pregnant wife Becca, he moved in to the house where they were to start their new family. And it happens to be facing the school, a school which is full hot students and teachers.<br>\r\n<br>\r\nName Jake Taylor<br>\r\nAge: 24<br>\r\nOccupation: Police officer<br>\r\nInfo: Thanks to agreements between the planets, Jake gets to be a police officer in the world of beauties. He has always wanted to try fucking the hot furry females since he first heard about them and seen furry fashion magazines. But is he going to get more than he can chew?</span></div></div>",
            "created":1564937340,
            "id":2697060,
            "title":"More Guy are on there way there."
        },
        "1354":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Fred Gordon",
                "John Carter",
                "Jim Newton",
                "More guys on the way"
            ],
            "content":"<div class=\"\"><div> <span>Name: Fred Gordon<br>\r\nAge: 47<br>\r\nOccupation: Businessman<br>\r\nInfo: Having been recently divorced from his wife and seen his kids become adults, he decided to moved to Furplanet, where his business have expanded and given him more money than he could possibly imagine to get on Earth! And he will get the opportunity to get some fucking from the heavily endowed furry women.<br>\r\n<br>\r\nName: John Carter<br>\r\nAge: 25<br>\r\nOccupation: Nurse<br>\r\nInfo: John and his wife Amy are newly weds and have just arrived on a tropical island on Furplanet. A place of beauty, couple-romance and lustful females eyeing on John.<br>\r\n<br>\r\nName: Jim Newton<br>\r\nAge: 13<br>\r\nOccupation: Middle school student.<br>\r\nInfo: Jim and his mom and dad recently moved to a town in Furplanet and he's gonna go to high school when the summer is over. Meanwhile, the neighborhood females are planning to get his virginity while his puberty is on full swing!</span></div></div>",
            "created":1564942260,
            "id":2697088,
            "title":"More guys on the way"
        },
        "13544":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Kevin Hartman",
                "Alex Jeffords",
                "David Stanford",
                "More guys on the way"
            ],
            "content":"<div class=\"\"><div> <span>Name: Kevin Hartman<br>\r\nAge: 40<br>\r\nOccupation: accountant<br>\r\nInfo: Feeling unappreciated and unsatisfied in bed, Kevin decides to go to Furplanet and cheat on his wife with hot furry girls.<br>\r\n<br>\r\nName: Alex Jeffords<br>\r\nAge: 20<br>\r\nOccupation: Soldier<br>\r\nInfo: Since he's gonna get deploy to the American embassy in Furplanet, he's taking that opportunity to finally meet his internet girlfriend, a bimbo poodle named Barbie.<br>\r\n<br>\r\nName: David Stanford<br>\r\nAge: 26<br>\r\nOccupation: Hospital doctor<br>\r\nInfo: Having accepted a job in Furplanet, he has no idea what a wild adventure he's getting himself into.</span></div></div>",
            "created":1564945680,
            "id":2697096,
            "title":"More guys on the way"
        },
        "135444":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Sean Wood",
                "Spencer Radcliffe",
                "Aaron Hunt",
                "More guys on the way"
            ],
            "content":"<div class=\"\"><div> <span>Name: Sean Wood<br>\r\nAge: 13<br>\r\nOccupation: Orphan<br>\r\nInfo: His surprise adoption takes him to Furplanet, where his new, all-female family has plans for what's inside his pants.<br>\r\n<br>\r\nName: Spencer Radcliffe<br>\r\nAge: 22<br>\r\nOccupation: College graduate<br>\r\nInfo: Spencer came here looking for jobs, but finds a wild adventure of hot, furry sex!<br>\r\n<br>\r\nName: Aaron Hunt<br>\r\nAge: 36<br>\r\nOccupation: Dentist<br>\r\nInfo: Two months before his weeding, the nerdy Aaron's three friends brings him on a week long bachelor party-trip to Furplanet. But they have no idea how messed up their trip is gonna get!</span></div></div>",
            "created":1565030640,
            "id":2697583,
            "title":"More guys on the way"
        },
        "1354441":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Bunnies",
                "Lions",
                "Wolfs",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of family does he get into?</span></div></span></div>",
            "created":1565030760,
            "id":2697586,
            "title":"Sean Wood"
        },
        "13544414":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Cows",
                "Sheep",
                "Mice",
                "More families"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of family does he get into?</span></div></span></div>",
            "created":1565188680,
            "id":2698499,
            "title":"More"
        },
        "135444144":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Hyenas",
                "Squirrels",
                "Swans",
                "More families"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of family does he get into?</span></div></span></div>",
            "created":1565198520,
            "id":2698514,
            "title":"More families"
        },
        "1354441444":{
            "author_id":"dinosaurking",
            "author_name":"dragon",
            "choices":[
                "Horse's",
                "Dinosaurs",
                "Flamingos",
                "More families"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of family does he get into?</span></div></span></div>",
            "created":1565581740,
            "id":2700671,
            "title":"More families"
        }
    },
    "info":{
        "author_id":"falcon",
        "author_name":"Falcon",
        "brief_description":"Spinoff to \"Furtown, USA\". Inspiration from \"Just Trying to Fit In\" by GWriter.",
        "created":1479490800,
        "description":"<td align=\"left\" class=\"norm\">\"If you think a town of horny, female furries might be a lot to handle... Imagine a whole planet of them!\" -- Falcon<br>\r\n<br>\r\n<br>\r\nNo one would have thought in 2017 that aliens would come in contact with us. A Civilization of furries wanted to form alliances and trade agreements with Earth. The furries lived on the planet called Furplanet. Since then humans started to take vacations to the exotic Furplanet while furries take vacations to Earth. In 2020 a few human families started to actually move to Furplanet. <br>\r\nOne of which is 43-year-old Alan Turner with his wife Marian and their children.<br>\r\n<br>\r\nAlan is a loving father and a happily married man who works as a teacher in the university of Alaska Southeast while Marian is a happy housewife. They believe nothing could come between them and Alan loves his wife and has no reason to cheat on her. But when he was offered a job and a house to live-in on Furplanet, their lives were about to change. And Alan have many great challenges waiting for him there.<br>\r\n<br>\r\nFor what many humans did not know is this:<br>\r\n<br>\r\nThe females on Furplanet have very beautiful and hot bodies (exempel: Huge breasts and asses!) and are constantly horny. But the problem is that the males are close to be rare! Which is why they are all very eager to get their hands on every human male who are either visiting or moving in... Alan Turner INCLUDED!!!<br>\r\n<br>\r\n<br>\r\nFurplanet-info: <br>\r\n<br>\r\nThis planet is about twice the size of earth and is a united federation and also a matriarchal society. The capital is called Anthropolis, a city with every known environment and a population of over 103 million furries of all kinds (mammals, reptiles and avians). The furries are also technologically advanced with spaceships flying cars!<br>\r\n<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1. The females can be 16 to 50 years and have VERY HOT bodies! (Huge breasts, thin waists, big asses, wide hips etc.)<br>\r\n<br>\r\n2. This story will have romance, sex and other mature content, furries, love and anything else you come up with<br>\r\n<br>\r\n3. Try to add long chapters (a paragraph at least)<br>\r\n<br>\r\n4. No offense, but no gay sex, OK with lesbian<br>\r\n<br>\r\n5. NO VORE, WEIGHT GAIN, SHRINKING, etc!<br>\r\n<br>\r\n6. There will be some incest<br>\r\n<br>\r\n7. If you want to add other male humans or furries, then be my guest<br>\r\n<br>\r\nEnjoy! (and please add!)<br>\r\n<br>\r\n<br>\r\nReward: 1000 Gps per chapter</td>",
        "id":2103080,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1565581740,
        "modified":1565581740,
        "pretty_title":"Furplanet"
    }
}