{
    "chapters":{
        "1":{
            "author_id":"playerplays14",
            "author_name":"playerplays",
            "choices":[
                "Rika and Renamon ",
                "Kari and Gatomon",
                "Yolei and hawkmon",
                "Mimi Tachikawa and  Palmon"
            ],
            "content":"<div class=\"\"><div> <span>RoyceDarkmon-he wearing black buttoning shirt with a white tee shirt under it then he has on black jean with black sock and shoes<br>\r\nAttack moves: Force Push, Power Fists, Lighting Blast, Darkness Shield<br>\r\n<br>\r\n<br>\r\nChampion Level: Darkkon-black some surround RoyceDarkmon and he come out he wearing a Anbu black ops clothing but no mask he has two swords and his eyes are black and yellow.  <br>\r\nAttack moves: Hell Judement, Hell Fury, Darkness Blast, Killer Frenzy, and Shadow Clones<br>\r\n<br>\r\n<br>\r\n<br>\r\nUltimate Level:Nightmaremon-his whole body is cover in black metal and his arms turn into Death Claws and has a metal tail with spikes on it and his feet’s are razor Sharp claws his hair turn into metal spike.<br>\r\nAttack moves: darkness slash, blinding rage, hurricane fang,pulizing fist,<br>\r\n<br>\r\n<br>\r\n<br>\r\nMega Level:Owaridamon-mystic armor appear on RoyceDarkmon black and gold colors on the armor and a red tore up scarf sticking out his helmet and two sword fuel by his aura.<br>\r\nAttack moves: Divine Blast, Dragon Fist, Doom Fang,Vemon Stike,Chaos Blast<br>\r\n<br>\r\n\"Ughh...My head WH...where am I\" said Royce he sat up on the bench he felt something in his hand was a folded piece of paper he open it up and read what was on it *your name is Royce Williams you live on 1486 Morrison Lane and your bank number is 457 live a happy life* \"Royce...Williams that...my name\" then Royce have a vision seeing a lot people in white coats staring at something but it ended \"wh..what was that what were those people looking at i ...need to walk around a bit maybe I will remember something” he got off the bench and started to walk in to the town he checked his pockets the only thing he had in there was a wallet with three hundred dollars in it and a pair of house keys and he had a cell phone a brand new cell phone like it was just open out the box so he wasn't getting any info out that \"where did I get this stuff?” said Royce as he put his hand on a store window \"none of this make any sense is my name is Royce\" he look in the store window and see his refection \"WHO AM I RRRAAAAAAGGGHHH!!!!!!!\"Then he smash the window *RINNNNNNNNNG*the alarm roared\"HEY YOU STOP RIGHT! \"Shouted...<br>\r\n</span></div></div>",
            "created":1252502280,
            "id":757977,
            "title":"the bringing"
        },
        "12":{
            "author_id":"playerplays14",
            "author_name":"playerplays",
            "choices":[
                "Kari and Gatomon",
                "someone else",
                "someone else",
                "someone else",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span> Royce turn around and see a girl wearing pink and white striped shirt and yellow short and a cat wearing yellow gloves looking at him” are you trying to rob that store \" \"no am not trying rob this store\" \"DON'T LIE TO ME LET GET HIM GATOMON!\"Snaped Kari then the Gatomon started changing \"GATOMON DIGIVOLVE TO ANGEMON!\" then a bright light surrounded the area standing in Gatomon's place was a gorgeous Angel Digimon \"CELESTIAL ARROW!\" Angemon shot arrow at Royce he wanted to dodge the arrow but some reason he wanted stay when the arrow came close to contact with Royce he easily dodge  it then he look at them with a bold look on his face \"I don't want to fight you\" \"you should have thought about that when you busted that shop window” said Angemon as she was charging at Royce \"Divine Kick!\" while flying at Royce the same feeling came again as soon Angemon came close \"FORCE PUSH” then he put his right hand up and then dark energy stop her in her track then slowly started pushing Angemon back then sent her flying back to Kari \"wh..what just happen” said Angemon then Royce pull out a hundred dollar bill out of his wallet and place it in the window of the store \"see i didn't mean break the window\" said Royce then Kari and Angemon were shock when they hear that \"oh my god we are so sorry we didn't know we... I sure have heard your story am so sorry\" \"it okay it okay... i mean if i was to see something like this I would have did the same thing\" \"you would\" \"yeah i would oh by the way my name is Royce\" \"it nice to meet you Royce my name is Kari and Gatomon well Angemon now” Royce look at Angemon she wave at you \"um... hey do you know were is 1486 Morrison Lane is at\" as soon Royce say that Kari looked happy  \"hey that were we live at we can walk you there\" \"um sure i would like that\" \"okay follow us” said Kari then Angemon de-digievolve back to Gatomon and they started walking down the street they talked got to know each other better *few hours later* they made it to his house \"so this is where you live it nice \" \"thank you\" \"well it getting late now how about we meet you next time at your house and hang out\" \"yeah that a good idea\" said Royce then Kari started walking up the street Royce wave good bye then he felt a tug on your pants he look down and see Gatomon but you can see a little redness around her cheeks is she blushing \"um...can i ask you something\" Royce crouched down to her \"sure\" \"are you a cat person?\" Royce just smile and started rubbing Gatomon head she purr as you were doing it \"i think cats are great\" \"you do\" \"yeah\" \"thank for answer my question Royce “said Gatomon  as she turn around and try to catch up to Kari Royce walk up to his house \"wonder what in here\" then pull out his keys and slit it in the key hole then open the door and walk inside it was dark in there look for the light switch he fondled in the dark for awhile there he found the light switch \"here it is *click* WOW\" he see the place is fancy and everything was brand new then spotted a box on the kitchen counter he walk toward it and see that it a brand new Xbox elite 360 with a note on it he pick it up and read it *all the thing you need live a good life* \"who is this person \"then looked to the left and see a bag full of video games \"cool am loving this life anyway hmmm I wonder how many room this places hads\"Royce decided that it time to check this place out *few minutes later* \"man this house had two bedroom, one bathroom, living room,kitchen,and a pool too man this is a house and am so glad that I live here*yawn*man it getting late better hop in the bed” then he started walking to his bedroom and got in the bed and went to sleep *next morning* *KNOCK KNOCK KNOCK* \"*yawnnnn* who knocking this early morning” said Royce as he was hoping out the bed then started to walk toward the door opening it and saw.....   </span></div></div>",
            "created":1252517520,
            "id":758031,
            "title":"Kari and Gatomon"
        },
        "122":{
            "author_id":"playerplays14",
            "author_name":"playerplays",
            "choices":[
                "\"Okay I don't see why not\"            ",
                " \"can't maybe next time\"",
                "something happening"
            ],
            "content":"<div class=\"\"><div> <span>a girl with blue eyes, red hair with streaks wrapped in a pony tail, wearing a shirt with a blue heart broken in half, blue jeans, a yellow scarf wrapped tightly around her neck, and a pair of red sneakers..<br>\r\nand a yellow fox wearing purple gloves at his door \"you must be Royce\" \"how you know my name\" \"my name is Rika and this Renamon one of my friends told me about you\" \"who would that be WHOA\" in a quick instant the yellow fox grabbed Royce by the shirt and lift him up a little \"we challenge you to a digibattle\"said the yellow fox knowing that they aren't going to take for a answer so he agree \"okay okay easy up on the shirt\" \"oh sorry\" then she put you down \"my that one strong grip you got there my foxy friend\" \"enough with the chit chat follow us \"said the girl Royce lock up his place and follow the girl and fox to a place near the park he woke up at \"this is it get ready\" Royce stranded in his battle stands then Renamon charging at Royce swiping at his chest but Royce dodge then she try another swipe, another dodge, swipe, dodge, swipe, dodge, swipe,dodge,swipe,dodge then Royce grabbed her pawglove \"sorry about this FORCE PUSH\" Renamon felt tremble of his power coming for his hand and then she was sent flying back she landed on her back but quickly got back knowing that she wasn't going to hit him it was time to do some quick thinking  \"DIAMOND STORM!\" then firing at least a hundred sharp diamonds at Royce \"shit\" knowing that the shards was moving fasts he cross his \"DARKNESS SHIELD\" then a black ooze started coming out the ground and started to float up in the and started to form a round shield that absorbed the shards of diamonds then a small shook in the shield then the shards of diamonds was shot right back at it owner she quickly dodge it though by jumping up in the air  \"LIGHTING BLAST” cracker of lighting started forming on his fingers tips then *BZZZZZZZZEEEEEOOOOOOOOOOOOMMMMMMMM* a electrifying strong line of lighting shot out them and stuck Renamon like a stack of bricks falling down in the air not wanting to be a jerk Royce jump up in the air and caught Renamon holding her like that just got merry  \"wh..what going on\" \"well I kinda use too much of my power in that last attack that knock you out for awhile i didn't want to hurt you that bad\" \"you care about me \" \"yeah what kind of person i would be if i let you fall” after saying that Renamon turn her head because she was blushing \"thank you\" as they descended down to the down to the ground  Rika seem disappointed that the battle ended \"humph I guess you win this one \" then she walk away but Renamon stay behind \"am sorry that we challenge you\" \"it alright but am the one that sure be sorry \" \"it okay am use to it\" \"are you sure your not hurt or anything\" \"am fine\" \"that good\" Renamon just giggle then kiss him on the cheek he blushing like crazy when she did that \"wha..wha...what that for\" \"*giggle* that was for saving me\" \"getting kiss by a beautiful fox\" \" *giggle* thank you \" \"no problem \" then Renamon turning around blushing \"um...do you want to take a walk with me\" said Renamon.......  </span></div></div>",
            "created":1252517700,
            "id":758034,
            "title":"someone else"
        },
        "1221":{
            "author_id":"playerplays14",
            "author_name":"playerplays",
            "choices":[
                "Renamon ",
                "angemon",
                "some else"
            ],
            "content":"<div class=\"\"><div> <span>Renamon nearly knock Royce down when she hug him after saying that \"great i can show you around\" \"that a great idea\" said Royce and then they was walking out the park Royce couldn't help that felt like he was being watch by someone \"um where are we going Renamon\" \"oh to a little place i know \"then they turn into a small alleyway then walk toward a dark brown door with a little sign on *The Digi Club* she knock on the door three time then the door open up \"let go in\" then Renamon walk in the place  then Royce try to get in before he was stop by a pawclaw \"you can't be here\" said a male Renamon then the female Renamon realize that Royce was stop by the other Renamon \"it okay he with me\" said the female Renamon then the male Renamon look at Renamon wierd for a second then shug his shoulder then let his paw \"go in\" they wander in the club see a bunch of digimon dancing all around there was even a bar Royce is old enough to drink Renamon drag Royce toward the dance floor \"come on let have some fun\" said Renamon who started dancing Royce had no choice he started danicng Renamon started dancing her ass off all the digi-mon stop dancing and started looking at him all eyes was on him because they think he human but he a digimon *a few hours later* he was tried of dancing but Renamon still wanted to dance \"am going to the bar to get a drink\"said Royce Renamon nodded and keep on dancing while Royce walk to the bar and sat down on the bar stool and order a beer drinking his beer some one tap his shoulder....</span></div></div>",
            "created":1253279040,
            "id":762204,
            "title":"\"Okay I don't see why not\"            "
        },
        "12213":{
            "author_id":"playerplays14",
            "author_name":"playerplays",
            "choices":[
                "it time to kick some ass!!!!!"
            ],
            "content":"<div class=\"\"><div> <span>he turn to look it was a devimon wearing a pair of sunglasses and was smiling \"hey there been talk about you being a digimon.\" \"yeah am a digimon if your wondering what is you want.\" \"well there a digimon fight in the cage room. \" \"and what your point.\" \"well there a prize i want out of it. \" \"what the prize.\" \"it five hunreded dollars.\" \"and what you have to do to win that prize?\" \"well you have to fight the former champ of this fight Greymon he never lost a fight how about that man.\" \"well.....\" then the Devimon started frowning \"hey i can unstand if your scare.\" you don't know why but when he say scare Royce took it as a insult \"SCARE WHO SCARE AM NOT SCARE OF NO ONE HELL I BE DAMN TO SKIP THIS FIGHT LEAD ME THERE!\"Snaped Royce after saying that the Devimon just smile \"alright follow me.\" then set his beer on the bar counter and follow the Devimon past the crowned dance floor of digimon to a Steel door he knock on the door then a metal panel slide to the side and a pair of eyes appeared \"password.\"said the deep voice \"digi ufc.\" said the Devimon then the steel door flew right open then they walk in there was a long hallway that lead to big room with cage wall and a whole lot of digimon looking and yelling and screaming \"well kid this is it Digi-UFC let get you sign up.\" \"alright.\" then they was getting though he crowd and saw another Devimon \"are you signing up?\" \"yeah.\" \"do know that Digi-UFC does care if you injure by the champ and you may be putting up your life on the line sir.\" \"yeah i know just sign me up.\" \"okay it your funeral.\" told the other Devimon then he sign some paper Royce turn around and started walking though the crowd to the cage wall and see a Greymon with a scar on his mask and then he saw Exveemon all beat up blood driping out his mouth he charge at Greymon but he swatted Exveemon like a fly Royce swear that he hear bone cracking when he did that Exveemon de-digievolve back to Veemon he wasn't moving at all the match was deside that it was over Veemon was carry out the cage by Angemons in nurse outfit \"WHOOO ISSSS NEXXTTTT!!!!!!\"bellow the Greymon then the Devimon at the sign up booth walk in there and pull out a micphone \"it seem that we have a new challgener Royce Williams come out here!\" said the Devimon then Royce walk in the cage and then look at his oppent \"HEHEHEHAHAHAHA THIS LITTLE GRUNT I  WILL CRUSH YOUR BONES!\" \"well then let see if you can.\" then the Devimon walk out the cage \"FIGHT!!\" a unknown voice say\"Great Horns Bash!!\" Greymon charge at Royce knowing what to do Royce jump up in air \"POWER FIST!\" then Royce slam his fist on Greymon head causing his head to slam into the ground causing the ground to shake \"GRRRR HOW DARE YOU HIT ME YOU WILL PAY FOR THAT!\" lifting his head off the ground \"Horn Impulse!\" then Greymon started swinging his horn around trying to hit Royce but fail Royce dodge all his attack swing,miss,swing,miss,swing,miss,swing,miss then Royce yelled \"Lighting Blast!\" he shot lighting out his hand the struck Greymon causing him to stunble backward he grit his teeth in anger \"THAT IT!!!\" bellow Greymon then flames started coming out his mouth \"Nova Blast!! \" then he shot a giantic ball of flame out his mouth that headed toward Royce \"HOLY SHIIIIIITTT!!!!\"yelled Royce as a giant ball of fire was coming toward him he knew that he had to think of something and something quick \"DARKNESS SHIELD!!\" then his black shield appear right about the time fire ball came it collided with the shield struggle to push back the flames the struggle went for a hour then both the shield and the ball of flame disappear but it took a troll on Royce his energy was drain by that attack he fell on his knee tired and drain Greymon just smile \"Tail Crash!\" then he swung his tail and struck Royce and sending him flying into the wall hit the wall like a sack of brick falling on the ground coughing up blood then Greymon struck him again slaming him into the ground he can hear his bone crack when he did that the crowd glasp in horror Royce lying on the ground blood coming out his mouth he try to get up but as soon he push his body up with his arms but his arms give in causing him to fall back on the ground can't move his body the pain was pulsing though his body  \"i...i...i can't....move...ughh....my body ...hurt like...hell....is this.....it?\" then his vision start getting blurry slowly his eyes started closing all he seen was Greymon roaring victory then everthing black out  then he found himshelf floating in compete darkness \"so this is how it end beat up by a digimon. \" said Royce then suddenly blinding light shine in front of him and a shadowry male figure standing in front of him\"Get up your not done yet.\" \"who are you?\" \"C'mon your not gonna give up are you?\"ask the shadow figure in a calim voice Royce try to see who it but can't see him because the light was too bright \"do you know who am i?\" \"that doesn't matter all you need to know is that am here to help you\" \"why are you helping me?\" \"because i can have you die on me.\" then he extented his right hand Royce take his hand and grab it \"great I figure you need some help.\"said the male figure then the light got brighter so bright that he couldn't see no more he close he eyes but when he open they up he was back in the Cage room looking at the crowd stun to see that he up and Greymon was confuse to see what he see \"HOW ARE YOU ABLE TO STAND UP!!!\"yelled Greymon Royce till looked the same blood coming out his mouth and all but the pain was gone and then he fell a brust of enery surgeing though his body then suddenly he stomp his foot on the ground causing it to crack then black smoke arose from the cracks that he just made then the smoke started covering his body until the crowd can only let see a black ball of smoke then a black eerie light shot out the smoke \"DARKMON DIGIEVOLVE TOOO!!!\"then the smoke spread out slowly realing Royce new form his hair was longer and clothes change in anbu black op clothing (off of nartuo) he had two swords on the side of him and his eyes was black on the outside but yellow in the inside and was alittle taller \"darkkonmon.\"he said in a deep calim voice....     </span></div></div>",
            "created":1253279100,
            "id":762206,
            "title":"some else"
        }
    },
    "info":{
        "author_id":"playerplays14",
        "author_name":"playerplays",
        "brief_description":"this story is about a digimon who was create in a secret lab under the city they ",
        "created":1252501860,
        "description":"<td align=\"left\" class=\"norm\">working on creating the ultimate weapon by mixing hvirus type and Dark type which create Darkmon the scientist call it project Darkmon they celebrate on creating the next weapon to put on the black uman DNA with digimon DNA market he was a young black male with long hair very good looking some of the female scientist described him dead sexy but on the day he was awaking all hell broke loose knowing that he was created to start wars knowing that he has no life knowing that his dreams was made by them he feel sad he wanted friends,memroy,dreams but most of all he wanted a life knowing that he wasn't going to get any of it his rage build up that he started to destroy the laboratory using his powers to escape this hell then he black out when he woke up he was on a park bench and he can't remember anything the only thing he had was a piece of paper a wallet with thirty hundred dollars bills and a cell phone and a house key in his pocket......           this where his new life start</td>",
        "id":1598339,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1253279100,
        "modified":1253279100,
        "pretty_title":"Story of Darkmon"
    }
}